{
  "QiEGfqFEtwaLrUN004MLug": {
    "date": "1/19/2018",
    "text": "The other day I was late coming home from work.  I knew my family had already had dinner and as I was approaching the intersection where PDQ is I thought....  hey, I've always wanted to try this place.  So I stopped.  I was a little worried as I walked in because I was the only customer in the store.  There were a couple of cars waiting in the drive-thru.  I took note that the place was clean as I walked up to the counter.  I was greeted by a friendly employee and said I was a first timer but heard they had banging chicken tenders.  The young lady confirmed they were 'known for their tenders' so I opted for the meal.  Four tenders, a side, and drink.  By the time I got my drink and picked a place to sit they were headed to my table with my food.  Long story short, everything was so hot and fresh it blew my mind.  I can't believe it took me so long to give this place a try.  Lots of dipping sauces, all made in house, and they've added burgers for the non-chicken eaters.  I think you should give this place a shot.  I really enjoyed it, maybe you will too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aye89hSfgw6tA2tzQbckaA"
  },
  "XPr976GkSSbosQWhIDPdng": {
    "date": "9/6/2017",
    "text": "PDQ outshines Raising Canes! Fast, accurate service. Our meals were fresh and held together and stayed warm & crispy. This was our 1st visit and we went durning a busy lunch hour. The staff is excellent, great attitudes and friendly (somebody is teaching customer service). Oh, my Bride was very happy with all the different sauces to choose from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dlyf7Rsk2K6jRBw71Iivzg"
  },
  "aqpwwYh4rP8IiV9urKrcCA": {
    "date": "1/31/2018",
    "text": "Love love love this place! Chicken sandwich's are great and the zucchini fries are AMAZING!!! I eat here more than I'd like to admit but it's def worth it. Staff is always friend and quick. If you're looking for something good, quick and reasonably priced this is the place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t39INFyDMBKyHy9lWeLqMg"
  },
  "7H6cGYVhXRhaEif8KhVqUA": {
    "date": "1/21/2016",
    "text": "Just wanted to update my review, this place since my last review hasn't changed. Still quality food, amazing service and still looks as clean as the day it opened! Favorite is definitely the buffalo chicken tender sandwich. The buffalo sauce is delicious not to mention the chicken itself is nice and juicy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAVb0WUUkvf45YreMyFyDA"
  },
  "HpDlc1Cm1V6aiFZPrh765A": {
    "date": "6/25/2017",
    "text": "This is by far the best fast food place I have been in. It's so well maintained that it gives you the feel of a full service restaurant. Let's start with the location. The place itself looks so modern and the ambience is one that relaxes you as you eat. Second, the menu is simple and precise. Third, the speed of service is amazing. I ordered my meal, and as I was pouring my drink in one of their futuristic coke machines, my meal was ready. The food itself was great too. The chicken was nice and tender and cooked to perfection. The fries are good but I personally don't think that it was their best quality. The place is clean. I have to mention the bathroom. It almost looks like the type of bathroom you have at home with a sink inside the stall and another one outside, which gives the customer the convenience of privacy. This place is overall awesome and I definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JmZFJ25Cn3qZaOkNFVQ8MQ"
  },
  "A4-mQ8t90HyHoZfgVjxoQA": {
    "date": "2/27/2016",
    "text": "Clean, fast and friendly service.   Exceptionally tasty crispy chicken tenders.   Fries have both salt and pepper on them.   Fresh lemonade was very good; I added water to mine as it was a strong flavor for me.  Cole slaw was good;  never had blueberries in slaw prior.  Fun hand washing station.   Hope more  open around the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cfwvos6oFlDquGiI2Qy1gQ"
  },
  "prbZ6poT9z3TqVZZV50iIg": {
    "date": "8/11/2017",
    "text": "Love this place. Great chicken strips, good dipping sauces, always clean with a friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7efIUivENXuuaVgHOxSlA"
  },
  "Cytg1LGEVQzuqSm3gcLtCQ": {
    "date": "10/29/2016",
    "text": "I'm so sad... I recommend this place to everyone, but I haven't been in awhile.  My friend recently said it was greasy and gross and I put up the biggest fight.. well today I was proven wrong. :( I got the nuggets and fries meal..the fries were so soggy, wiggly and undercooked I only ate 3 before tossing them. The nuggets tasted stale but were juicy, but not in the amazing way they were the first time I tried them.. more like wet. The service was wonderful as always but wow, so not what I remembered. I don't think I'll ever go back. So sad",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Y9Feqi0voIL4mreMFcmNkg"
  },
  "NQWFUxxU6aKXrD-qG6RNmQ": {
    "date": "6/10/2017",
    "text": "We love this place!  Every time we eat here it's delicious. My son and I love the tenders. They are always fresh, hot, and well seasoned. The hubby loves the burgers for the same reason. The BBQ sauce is sweet and tangy.  The fries are good, but I'm more of a fan of thicker cut fries. The employees are friendly and always smiling which is a nice change from being scowled at by most places.  Just an enjoyable experience every time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UtSla-0fuM31jRsKUZ-qIA"
  },
  "xbWfgJ95Oxzil3WHLeRr5g": {
    "date": "4/28/2017",
    "text": "When I want a chicken sandwich, it will have to be PDQ! Chicken is moist and delicious. I always order the bacon avocado club, so good! Also love the shoestring fries and they have a good list of delicious sauces. My favorite sauce is the spicy Siracha. Must give it a try when you're in this part of town, not sure if there's another location here in Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r2nsOzqb5srozsalr7jNsg"
  },
  "rrjJwr4xveaggEqWzpvVHw": {
    "date": "3/26/2017",
    "text": "Came in with my family not knowing what I can eat on my very strict diet, but ordered a taco salad with grilled chicken instead, and most everything else removed, including the dressing. Chef Hector offered to hand make a salsa especially for me and add extra veggies so my salad wouldn't be so plain. I was very impressed with him, his willingness, and his service with a smile.  It's nice to know I can come here with my special dietary needs. THANK YOU",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIk6MT_j6AX2t-SbmI_n1Q"
  },
  "NWNgzBsdH2AfXnG4FpEnpQ": {
    "date": "1/5/2017",
    "text": "WOW! Came in because of a BOGO ad but I am sure to be back. Portions are oversized  but more importantly food is seasoned beyond good! As a matter of fact I want to try everything on the menu now, and bring the rest of my family too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y0zRNXGpfBXmrNG_Gkcl_w"
  },
  "NoiKeoici2ra2FeguxvrpA": {
    "date": "9/17/2016",
    "text": "Love alllllll of their dip sauces. The chicken is moist and flavorful. The place is really clean and open. Zucchini fries are good and the portion is good for the price. We also ordered the fries, we were sad to find out they were soggy even if it was in an open container. The cashier said it was flavored but it's just regular fries. I would recommend zucchini fries instead.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "U7UZbYMbIBFGnSHpp2tk2A"
  },
  "HcWEEBLZPmcnMbOm581-LQ": {
    "date": "7/31/2015",
    "text": "I compare this awesome new place to a Chick Fila.  This was our first time here and we loved our experience. The chicken tenders are great and Canes better watch out this place has a way better variety.  Any extra sauce is free.  They have a variety of different sauces.  The fresh apple slices with toffee dip is so good.  The meals are priced less than Canes and they include your drink.  Way better deal.  I had the 3 pc with blueberry coleslaw. It was very tasty.  The French fries were fresh cut very good. Daniel helped us and he was amazing. Love this place service was Excellent.  The reason I compare it to Chick Fila is because the lemonade was better and I'm a certified lemonade conniseur (wink wink). Seriously the lemonade is great, way better than Canes as well but no extra cost.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lyqU-WIKzNqlWD1lXQ_UsQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Great atmosphere",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lyqU-WIKzNqlWD1lXQ_UsQ/o.jpg"
      }
    ],
    "user_id": "nYbLdMOWQnP8cDYIEp5NAA"
  },
  "IQ0CQJMMkc7vTtwWNAB_pw": {
    "date": "8/15/2015",
    "text": "Since my last visit, I waited quite awhile before heading back there.   When PDQ first opened, they greeted you, checked on you ands their customer service was phenomenal. Their food was excellent as well.  Since then, their food is still good, just don't ask for lettuce wrapped, but the customer service has plummeted.   I was given coupons for free food and was asked to contact the manager when I arrived do that they could ensure I received excellent service.   I went in and did not ask for the manager, because I wanted to see if it had gotten any better. It hasn't. It's much worse.   I had to ask for everything I needed such as sauce, dressing, the fries we ordered, and had to get then to clean our table off! This locations service is no longer people dedicated to quality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wc_YLaw7CHOeVDKHy0kdmg"
  },
  "RyGQLgibHjV-ktVgBsKgSw": {
    "date": "11/7/2015",
    "text": "Great place to dine at. The staff is very helpful in helping decide what to eat. The atmosphere is cool & mellow. I had the grilled turkey burger, fries, cookie, & soda. It was delicious! They also had the corn hole game outside & played a few rounds after we ate which was cool. Most def going to come back again & bring the entire fam.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lg8wPe68x_NlPs8uYlY3lw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lg8wPe68x_NlPs8uYlY3lw/o.jpg"
      },
      {
        "img_id": "2rpPRxfqw73QogSuga8Pgw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2rpPRxfqw73QogSuga8Pgw/o.jpg"
      },
      {
        "img_id": "u4TlcZuw9mrM5klxP6O9LQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u4TlcZuw9mrM5klxP6O9LQ/o.jpg"
      }
    ],
    "user_id": "WrgdF5BLASGIhVKYgvSV4A"
  },
  "Uc63onRkkMyMsmqsTKk2eQ": {
    "date": "6/5/2017",
    "text": "The food is always so good. But the service is absolutely terrible. They don't greet you when you walk or leave. And they always forget to add sauce. I used to come here when it barely opened & everything was on point from the food to the staff but it seems it's gone downhill from there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-W9gAmUOD8bXQkE_2e-eg"
  },
  "oAQjINkN4GxG2Z22d3-FKg": {
    "date": "12/5/2015",
    "text": "I ate it before I took a picture haha it was Sooo good! I got the chicken tenders combo and chose fries to be the side. The fries were thin cut and delicious! They have a ton of sauce choices but I chose ranch and it was really good!!! The soda machine is also those customized soda machines so you can make cool combos. The service through drive thru was still a face to face order which I thought was a cool concept for drive thru. Overall I highly enjoyed my visit and will be back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fj-cFMD2qheCcv3FNvMcEg"
  },
  "DhB63wqAjAecdo0fTrNGLA": {
    "date": "2/23/2017",
    "text": "My favorite spot for chicken! I love the nuggets & fries, and they have CHEERWINE!!! I always opt for PDQ over Canes, Popeyes, etc. Friendly staff, clean shop. Always leave full and happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0F857WwEOGIoZQRU1guPlw"
  },
  "3NuouhLE-z7ZlyjiN83djA": {
    "date": "4/27/2015",
    "text": "For a person who is supposed to be up to date on everything food in Las Vegas, sometimes things slip through the crack, so imagine my surprise one day when I notice a brand new restaurant called PDQ on my drive home, then not even 24 hours later, my barber is talking about this new chicken joint that in his words \"is better than raising canes \" with fighting words like that, I had to make my way down there ASAP.  PDQ stands for people dedicated to quality, and in that regard, they excel by far. When you walk in, everyone is extremely nice, they are very attentive, and you can tell great customer service is something they emphasize. Like 10 stars for customer service because I don't think I've ever been taken care of like that before --the restaurant: it's actually slog nicer than expected. It's a lot more upscale than fast food and has a very polished feel. There's big screen TVs around, so you can watch whatever game is on while you eat. Very relaxed and the type of place I could see myself hanging out for awhile --the food: they have chicken, they're about chicken. If you're coming here, then you're here for chicken. Now, better than raising canes isn't something I'd necessarily say. Different, yes, if that's what's your preference. It definitely felt a bit heavier, but two things they have over canes without a doubt is that they have waaay more sauces, and you can get your chicken sauced for free. So kudos on that mr. PDQ. They have blueberry coleslaw which I was excited for, but turned out super disappointing.  Overall, this is a place I'd recommend and I have made multiple trips here. I wouldn't drive across town for it, but if I'm within 10-15 minutes and I want chicken, I'd roll thru to this spot",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "anhGQg8z0ireASQoGu0usQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. PDQ corn hole awesome sauce!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/anhGQg8z0ireASQoGu0usQ/o.jpg"
      }
    ],
    "user_id": "KyMkKb5IohKb0S7v4Jv-oA"
  },
  "a23g8BnZqWIgyQ7bYlOTQg": {
    "date": "9/3/2015",
    "text": "We noticed this place while driving down Craig. Based on the yelp reviews, decided to try. The service was excellent! Very friendly!  Food came out quickly. All was prepared & cooked perfectly!  I had chicken finger meal with a chocolate peanut butter shake. Hubby had the chicken sandwich. We didn't leave a single crumb. Shake was thick & just the right amount of chocolate & pb taste. I loved the sauces!  I really hope word gets out about PDQ because this is a great place & would love to see it be a success! Definitely would go back again & again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "WvanLjQlrp1OBScCI5o4Qw"
  },
  "NFp_FIcKwS1lqWil_a_JFw": {
    "date": "6/8/2015",
    "text": "PDQ which stands for People Dedicated to Quality. Another chicken strip restaurant in the game that I havnt been to so I took my wife and kids here because kids love chicken strips naturally.  I ordered two 5 piece chicken strips meals ($9.29 each). One grilled and one fried so we can taste both versions. Comes with fries and a drink. My oldest son wanted the Chicken Caesar Salad ($6.29).  The fried chicken strips were similar to Canes but a little bit bigger. The grilled were similar to Strip n Dip but twice as big. All strips were cooked just right and was not dry at all. The fries were a cross between shoe string and regular fries. It seems like they cut it fresh and fry it right away. I like these kind of fries because it has the skin on it still. The chicken caesar salad was good according to my sampling and the fact that my oldest finished it quick.  PDQ has lots of nice features. Their two coke machines feature lots of flavors. The restaurant itself is a nice size to accommodate even the busiest of days. The condiment station has everything you need from ketchup to malt vinegar to napkins and utensils. They even have a separate hand washing station if that is all you need to do. The hand soap they provide for you has a nice lavender smell to it. It's the kind of hand soap that you could probably find at a Bath and Body Works. Outside they have one of those bean bag tossing game thingies. Hours are everyday from 10:30 am to 10 pm.  There were two things that impressed me the most. Their customer service and the made from scratch sauces you can dip your strips in.  The customer service was awesome. You order and wait at your table for them to bring it out to you. While we were eating, they came by several times to make sure we were ok and that if we needed anything.  As for the sauces you have your choice of bleu cheese, buffalo bleu, chipotle barbeque, creamy garlic, honey mustard, ranch, and sweet heat. You guys had me at garlic. What I like about it is because you can have as many sauces as you want for no extra charge! I know all the other places charge you for any additional sauces.  Overall I think the chicken strips are a cross between Canes and Strip n Dip but with better french fries. They also have chicken and turkey sandwiches along with hand spun shakes. Eventually I will try those items as well. Definitely will come back.  Yelp 2015 Review #30 528 overall",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 17,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "sx4oOnBkKOAF5WHeJXwSdA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Condiments  station.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sx4oOnBkKOAF5WHeJXwSdA/o.jpg"
      },
      {
        "img_id": "guVlocZityWhrlRGZVTHbw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. They have 2 of these coke machines. Yay!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/guVlocZityWhrlRGZVTHbw/o.jpg"
      },
      {
        "img_id": "jynaDFUqya1siFA2y8LhCQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Their hand soap. Smells good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jynaDFUqya1siFA2y8LhCQ/o.jpg"
      }
    ],
    "user_id": "0FMte0z-repSVWSJ_BaQTg"
  },
  "XMsnccBrszcfinv9wMEe7g": {
    "date": "6/18/2015",
    "text": "It's a fast food type of place but it doesn't seem like the other fast food establishments. It's clean, modern, spacious and it smells good. They even have good handwash.  For bulking season, I tried this place and got me a chicken tenders combo with fries. You get a sauce but you can get more sauces for extra. I tried the garlic sauce and ranch. The garlic sauce was sweet and didn't taste like garlic. The price isn't bad. The chicken was not mystery chicken parts. They have sandwiches, salads, burgers, shakes, etc.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "TJXXyugbtEUmLark75hJXw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. 4pc Chicken Tenders Meal with Creamy Garlic and Ranch dipping sauces",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TJXXyugbtEUmLark75hJXw/o.jpg"
      },
      {
        "img_id": "O5JribRWo4_h8UX4k5TOKQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Located on Craig &amp;amp; Allen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O5JribRWo4_h8UX4k5TOKQ/o.jpg"
      }
    ],
    "user_id": "tH0uKD-vNwMoEc3Xk3Cbdg"
  },
  "H3EBEcR_XOoohFYB0nQT3g": {
    "date": "6/7/2018",
    "text": "Love this place. Food is great and Staff is always welcoming. Hector Runs this store Great. This was just what NLV needed. If my kids had to choose anyplace to eat this would be there first choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgsy3g7dtPFLZBEEkc1Byg"
  },
  "MKKt-NmB7v07dfeX7NAVxA": {
    "date": "11/20/2017",
    "text": "I really want to know who old is this lettuce? It's so hard to eat healthy and this is exactly why.. I'm soooooo pissed off that I have to throw my lettuce away, the important lettuce that holds my sandwich together  I will never go here again .. great customer service though ps I just opened the lettuce and found brown Avocado  I hate them ..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vJUiFCHAXrkwph0qA0Ak-w",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vJUiFCHAXrkwph0qA0Ak-w/o.jpg"
      },
      {
        "img_id": "RxKGLd0tzGdR6gSTO7p_JA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RxKGLd0tzGdR6gSTO7p_JA/o.jpg"
      },
      {
        "img_id": "L9PicuWEeXBvvyD8hejmZQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L9PicuWEeXBvvyD8hejmZQ/o.jpg"
      }
    ],
    "user_id": "gFw5fMugGNx878ndbDhRoQ"
  },
  "OSZAWy8BSScrs6NxjUqD8g": {
    "date": "2/17/2019",
    "text": "2 stars only because the staff are nice..other than that, the food is disgusting. The tenders are rubbery and lack flavor and the fries taste stale.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uz3P-9JS43RaswztGNUCLw"
  },
  "wUz5iSBiSkc8hRKC10jUYQ": {
    "date": "4/13/2018",
    "text": "They use to have good sized burgers. Less meat now. For the price I would think more meats. Salads and lemonade are still great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rlbXh5Z8qJlaFb3Jqr6Z9Q"
  },
  "6T2or04Zi9iI8kBSI50zfw": {
    "date": "7/21/2018",
    "text": "I like their salads especially the yaya Greek salad.  Fresh and delicious. The chicken is always good. They also have good burgers though I find them pricey for that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NG4-eVLlBtcKSdRDpg9fA"
  },
  "OXdyP3ZYFPBfEgalkso6Gw": {
    "date": "6/24/2018",
    "text": "Good tender chicken and very fast service. Simple and effective. I would recommend anyone in the area to give it a try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T08jK5066jdpOompsr_oeA"
  },
  "Q_83YMrfktiWypwmA2gcag": {
    "date": "7/8/2016",
    "text": "This is my first time back since after this location opened, they really did a great job pulling off a quality customer experience .. It started off with our experience ordering with Jeffrey (sorry if spelling is wrong ) not only did he have a SMILE the whole time he was patient , kept me informed and advised me of where I could locate pricing and what to go for . When I first came I tried chicken strips this time I opted for a California Chicken club which was delicious , I'm trying to watch my carb intake so I opted against a meal but I was tempted by the fried zucchini .. My kids both got kids meals with cheer wine and my mom got a three item chicken strip meal it totaled out to around 25 which I consider a steal for the freshness and the overall environment of the location .  Lejuan was the their cashier who also took the time to compliment my stitch shirt which means tons to a Disnerd like me .  Our food was brought up directly to our table by Miguel before I could even finish checking in on yelp while I was getting my drinks (they have those awesome push drink machines with zillions of flavors) plus different teas I got green tea and it was delicious .. Miguel also open my kids cheer wine for them which to me just shows going above and beyond .  While dining I was able to catch a bit of an NBA summer league game and then some UFC fighting which was awesome since my kids eat slow.. I also was impressed with how one of the workers Daniel came to check on us a few times during our meal and also offered to empty our trays which I declined as I needed to fill the time while my kids finished there cheer wine but I will say this place seems to be run the right way.  Definitely fresh quality food with amazing service and a very comfy vibe. They are also running a campaign to help veterans locally in the area which always makes me happy to support a place..  Super glad I got a chance to come back and look forward to making it a regular spot for chicken goodness .. I love that they have a variety of grilled and crispy options plus diff types of dishes",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "niBmHAJTbPPiHMXWjxXYqQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/niBmHAJTbPPiHMXWjxXYqQ/o.jpg"
      },
      {
        "img_id": "O-DImso-o7UIhzrVBgjItA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O-DImso-o7UIhzrVBgjItA/o.jpg"
      },
      {
        "img_id": "wxsk-Gp-6XvXD5Hvpo0_Mg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wxsk-Gp-6XvXD5Hvpo0_Mg/o.jpg"
      }
    ],
    "user_id": "vwLV4TkRMoghs86tB1Ke8Q"
  },
  "o8fkFeZmOuLEb8stTudohA": {
    "date": "1/17/2019",
    "text": "I never tried PDQ on my  own. The staff was very friendly.   The food came quick during lunch rush(i was highly  surprised  by that).  My meal was great",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmp6yq0ntq9avNx9Dw0kJg"
  },
  "ST0ethL0jjoMWMoNnoWqwA": {
    "date": "10/22/2016",
    "text": "Chikfilwho? PDQ is slammin for a fast food joint. It is True the fries be kinda soggy but with fast food chicken this good, who cares?   When I say \"fast food\" I mean fast. You usually don't have enough time to get your drink before food is on the table.   The employees are very professional and freindly. A few fast food places have come around and asked me if I need anything but never does a gentleman come to me in white chefs coat and ask what I think, am I happy with the order? Very impressive for an $8.00 chicken sandwich spot.  It is very clean inside and they have a good drink bar plus I really like the hand wash station so you don't have to fully commit to a tedious restroom trip..  The chicken is really good and the choice of dipping sauces are awesome. I haven't even tried them all. I was a little dissapointed when I got a shake because the flavor was kinda watered down with a milk taste.   If you are even questioning trying this place, don't wait. Just do it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WJYW4nuFHUhtV2iaeQHB0g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Can&amp;#39;t wait to come again.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WJYW4nuFHUhtV2iaeQHB0g/o.jpg"
      }
    ],
    "user_id": "yKAIxV3KCxBKK5ezsry_0Q"
  },
  "FSf1VA0599fhSBa7udAX1g": {
    "date": "6/28/2016",
    "text": "This was my surprise of the week! I am not sure what I expected....no I expected deep fried stuff I cant eat because of gluten intolerance and all the food I stay away from. My Mom loves deep fried tenders so I went with her to watch her eat.  Surprise surprise, they have grilled tenders, salads, fresh lemonade, hand cut fried, zucchini to die for, and so many sauces to choose from. I really like what they have done with fast food gone healthy or you can choose some delicious fried food! Any way you go, you will win.  I know my friends will say 5 stars? It is good! The employees were all very nice! The food was great! The place was immaculate! Tasty! There were nice touches to the packaging like metal baskets, the prices are great!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "GJ4Ibvh2Sf6I3jTMBYSzGQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Blueberry coleslaw",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GJ4Ibvh2Sf6I3jTMBYSzGQ/o.jpg"
      },
      {
        "img_id": "2AphQ7-Y8aaXpPuOrRa7dg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Salt grinders add a nice touch!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2AphQ7-Y8aaXpPuOrRa7dg/o.jpg"
      },
      {
        "img_id": "uLz1I4yriUi7LmSQDs1jYQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. They support vets",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uLz1I4yriUi7LmSQDs1jYQ/o.jpg"
      }
    ],
    "user_id": "LgiBFHIsRWIduc7HTq2rkA"
  },
  "BlslbkzDLTH49v1En_Qw3g": {
    "date": "3/17/2015",
    "text": "I would rank the chicken tenders here slightly below versions at ChikFilA and Raisin' Cain but above Wingstop and McTenders. The cleanliness of the restaurant and the friendly efficiency of the employees reminded me of ChikFilA, but with different sauces and blueberry coleslaw instead of waffle fries.   Standout sauces, in order, are the creamy garlic, chipotle barbeque, and the buffalo bleu. Other options include ranch, bleu cheese, honey mustard, and sweet heat. Tenders were on the smallish side, order of 3 was a bit over $4. The much-hyped blueberry coleslaw was interesting and fresh, but not really for me.  Extra cool points: they have ketchup on draft at the condiment station, and Cheerwine available for purchase (a regional soda from the Carolinas).",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "B60WtRkOCPvIwYItrvGesw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Ketchup spout",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B60WtRkOCPvIwYItrvGesw/o.jpg"
      },
      {
        "img_id": "K4YoBMO4X6I_BiZENAGKNA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. OMG Cheerwine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K4YoBMO4X6I_BiZENAGKNA/o.jpg"
      }
    ],
    "user_id": "bLbSNkLggFnqwNNzzq-Ijw"
  },
  "tz0wWHV0JA79efrqUBLEbw": {
    "date": "3/15/2018",
    "text": "If you want fresh food  don't go to this place . My fries tasted like they reheated them in a microwave, my avocado was mostly black with a few spots green.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ojEtAf_h8f3UAOVFsYcfUw"
  },
  "1t-mqIApK2WDA7zHpa56wQ": {
    "date": "6/14/2018",
    "text": "Good food. Friendly staff. Quick. Tots are a little salty but overall really good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unyCtpHmGt42rm0I4tXsIQ"
  },
  "ffz681CQVyOG8D0GNx80Yg": {
    "date": "10/28/2018",
    "text": "two words, ZUCHINNI FRIES!!! amazing! i aslo love the fact they have a lot  of different sauces and u can try em all!! For free!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N2XVQBsbgjmMruMKnQ3TqQ"
  },
  "0eM06odJtfi9_6ru0TIvkw": {
    "date": "6/19/2016",
    "text": "This place is extremely close to my job so I like to come here when I feel like not being healthy. They do have healthier options, but who can go to a place with such great chicken tenders and walk away with no chicken tenders.  The drive thru was a tad bit awkward for me because I didn't hear the girl tell me to go to the second window to get my food so I was kind of just idly waiting until she gave me this \"what're you still doing here look\"..oops  I personally like to get the chicken tender meal with fries. I'm sure the small will suffice but I always feel the need to get the meal with a little extra. Also, go ahead and do yourself a favor and different sauces that you haven't tried. I really like their sauces and I don't think you can go wrong with the options.   The shakes are also on point. I just can't get them a lot because I'm almost absolutely sure I'll have a heart attack if I drink it while also eating all my chicken tenders. They're just that good.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ERcsc0YO5CCUbkC8EV2INg"
  },
  "hKXDozscplMOy0Y0fUobsw": {
    "date": "5/12/2018",
    "text": "Love pdq but the service sucks ass sometimes. Today Lizzy opened the window & decided to finish her text message while I'm staring at her. It wasn't that it was unprofessional as much as it was insulting because she was trying to hide it. I felt as if she were trying to insult my intelligence . Take the girl out of the window & make her slice potatoes or something lol.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHkJk0UwRG3-xxY-Nlt4_w"
  },
  "mQG1PtFQXBkdvAHP_CTh6Q": {
    "date": "8/9/2016",
    "text": "My significant other and I opted to try PDQ based on Yelp reviews we had seen.  Neither of us had ever been so we were excited to try something new.    This location was easy to find and was quite clean. We had attempted to do our research before arriving by looking at the menu and skimming what others recommended on Yelp. When we got to the counter, the young girl helping us was a little shy but competent and smiling (always a bonus in my book).   My significant other ordered the Buffy Bleu Sandwich meal with fries (delicious!) and I ordered the Fresh Tenders Meal (x3) (totally hit the spot!). I asked the young lady behind the counter what side she recommended and she suggested Fresh Apple Slices with Toffee Dip. I had read rave reviews about the Fresh Blueberry Coleslaw so I opted for that, instead.   My significant other paid while I used the restroom super quick. To my surprise, our food had already come out and he had found a place to sit by the time I left the bathroom. I've never seen food ready that quickly. He told me that a man behind the counter had heard the suggestion of Apple Slices and Toffee Dip turned down for Blueberry Coleslaw and wanted us to be able to try BOTH so he had added Apple Slices and Toffee Dip to our order for FREE. I was shocked. Sometimes those little gestures are enough to make lifetime customers. As it was, the Apple Slices and Toffee Dip were much better than the Blueberry Coleslaw (in my opinion) and I thanked the young lady as we left for the great suggestion.   One of the things I really like about PDQ, (other than their customer service and speed) was the selection of Homemade Sauces they offered. I counted eight different types. It was nice to have the option of choosing something other than ketchup or ranch.  The food, overall, was a breath of fresh air compared to other restaurants. My significant other and I fully intend to return to try all the sauces and enjoy some Apple Slices and Toffee Dip again soon.  Thank you, PDQ!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F1fBHY2HAV0zAawbqkRvTQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Buffy Bleu and 3x chicken tenders. Toffee, Ranch, Sweet Sriracha, and Bleu Cheese Dips, Apple Slices and Blueberry Coleslaw.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F1fBHY2HAV0zAawbqkRvTQ/o.jpg"
      },
      {
        "img_id": "yKZC8DoTcoRilF5_2WBM5Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Delicious cookies! The perfect softness :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yKZC8DoTcoRilF5_2WBM5Q/o.jpg"
      }
    ],
    "user_id": "mEboiMCt7mSICSQPCp12yA"
  },
  "C64WCJRb2L23AzKB_25LyQ": {
    "date": "4/8/2015",
    "text": "I have to say their chicken strips are very good. Not as crispy as Cane's but more tasty and moist. I also tried out their chicken caesar salad and it was just okay, nothing special. I did not care for the dressing that they used. It just had a weird taste. The shakes are also very good. Overall a decent place for a quick meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m2hYaPVP9DOWdHmKjsf84w"
  },
  "SUqO-E8YKdH8CjBmr6cZGA": {
    "date": "7/12/2015",
    "text": "Best healthy fast food option I've had in Vegas. Tasty chix strips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_7PfR6Tvh2xTbiVi1GELoQ"
  },
  "ZcVTP1005NFapgbRYG8eIQ": {
    "date": "2/29/2016",
    "text": "Love this place. My favorite is the crispy chicken salad. The ranch dressing is delicious. Fries are amazing too. You must try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FNEQLoMl1RCYTDiuqxRWmg"
  },
  "VR2EQ6aDD4M68X-GeA0DoA": {
    "date": "1/4/2016",
    "text": "Pdq was just that, we had enough time to order our food, sit down to start talking and our food was already done. I had the buffalo tender sandwich and my wife had the grilled chicken. The fries were slightly seasoned which meant you could still taste the potatoes which was perfect. Dipping sauces were nice to sample and went well with the fries. The atmosphere is nice and not all plastic like other fastfood places. Sandwiches hit the spot and the coke vending machine let us mix our own dr peppers which i love. Great little lunch date with the wife place. I'm sure we'll be back. Tons of windows, good music, super clean and just a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dAOCGCuHLNqOSjbhiBkD2w"
  },
  "uZDo54-PDgHqJZFu4mCPdA": {
    "date": "2/23/2016",
    "text": "Excellent experience.  Totally would recommend this place.  It was a first for us and I would do it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LdtgOpmcXrOtCnSWIvHPew"
  },
  "s4xjUKnAQgw4_b0T4zY2LA": {
    "date": "7/19/2015",
    "text": "This place is good all around best thing is the customer service is better than anyplace ive been so accommodating you can get any of the sauces or she said we can have all of them if we want lol you can also swap out any sauces on sandwitches or get grilled chicken instead of fried! By the time we got our drinks filled up our order was ready and offered even more sauce if we didn't think we had enough the fingers frys and sandwitches all on point the buns were extra fresh definitely check them out",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBTk93i1C__uQ8_-Vdj5_w"
  },
  "WphXmZdgQV9otXedTbYHqg": {
    "date": "9/4/2015",
    "text": "Love pdq!  I've been there many many times and I will continue to go back. Friendly staff. Super fast service. Quality food. Love their grilled chicken sandwich. The apples and toffee dip is a super yummy alternate for fries. Love their cookies. Their shakes are on point as well. Always really clean. Just love it there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rywcWRl6pozNCrfCN8MvcQ"
  },
  "EuxaApENTRCRphIUhWbZUQ": {
    "date": "6/28/2015",
    "text": "Love this place!!!! Chicken strips are better than canes and all their sauces are handmade and free!!! You can also mix grilled strips with crispy strips! This is definitely a great spot to eat at!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wi6wpGVjpGKBUdn4kVVkHw"
  },
  "O5ZECDQJstsPDqa4BFwVKQ": {
    "date": "10/12/2015",
    "text": "Today was my 1st time going to PDQ and I must say it was amazing! Great customer service. Everyone was very tentative of us the restaurant was very clean and my kids loved the chicken strip. I would recommend this place to everyone",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uwkJYUWxhqbUS2gc2_nmnQ"
  },
  "fnesN9hRurSo5SburTlYfQ": {
    "date": "11/9/2015",
    "text": "We had some time to kill before we had to pick up our son from school.  I saw high ratings for this \"fast food\" and decided to try it.  As we walked up to the building, I notice they had a corn hole game outside.  When we walked it, I was shocked to see how modern the inside looked, as well as how clean.  It didn't look so much like a \"fast food\" place, but more like a real restaurant.  Items on their menu stood out, with phrases like 'fresh cut', 'homemade', 'blueberry coleslaw'....I ordered their chicken tenders with sweet siracha sauce and a Heath milkshake.  Wow!  I think if there were more PDQ's, that would be trouble for Canes.  Their tenders were so fresh, juicy...their breading amazing.  My fiance had one of their sandwiches, just as good.  Definitely recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGzjZMQrLrdBxjA6rfzwxg"
  },
  "V-axn-B-XCzKtLqUGbxF1w": {
    "date": "7/29/2015",
    "text": "I just went a got two crispy chicken salads and they were fantastic! I swear it to be True that everything I have ever bought from PDQ is top notch! The staff is always friendly and courteous. And the unlimited sauce! I have tried them all and they are all so good I can't pick a favorite. I must say, I have never been more satisfied with a restaurant. I can usually find something I'm not fond of in a restaurant, but not at PDQ. I have told everyone I know to give PDQ a try. I also gave them my own personal guarantee  \"if you don't like it I'll buy it.\" The upper management are upstanding and people of their word. Outstanding product by people who care and it shows! I can't say enough great things about PDQ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WLNA2d06sHxE7QfeAHcag"
  },
  "3BPwxKpJPjcsNS0a2UuitQ": {
    "date": "4/9/2015",
    "text": "Have stopped  twice with the family. Lots of good things to say about this location. The food is good and fast, personally  I have enjoyed the spicy chicken tender sandwich.  The environment is clean and your  food is ready, fresh, and too your table in a short time. Also a great place for kids.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5y3E1hCA5V1IJ3uR4St-Vg"
  },
  "k5TIN0qH2PTyhHp0CeNWaA": {
    "date": "12/19/2016",
    "text": "Took care of us and daughters gluten allergy.  Chef actually made her a little extra food free.  The chicken sandwich was amazing.  Clean, neat, fresh.  A great addition.  Tried it because if a free teacher coupon and won us over. Wife liked even more than me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZuQ7f0Bgj5rLL9TSvZe2w"
  },
  "kjNCr2sL23Oh-yctRmK2uA": {
    "date": "7/23/2015",
    "text": "This place is the absolute BEST! I have always been a hardcore Raising Canes lover until PDQ came along. They are hands down way better. The service is always so pleasant and quick. I have never had anything below extraordinary at this location. I recommend it to anyone and everyone",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52O9BclOfQLipKAiLmJz6A"
  },
  "MYcLobRjfqxP_BQUMdBeRQ": {
    "date": "6/1/2015",
    "text": "Fast and friendly but they put Rosemary on their grilled chicken and that killed it for me. I hate Rosemary so I didn't like the chicken. It was moist but the flavor just wasn't to my liking. Dipping sauce was good and I liked that they will give you as much as you want. I can't do fried food so I can't rate that but I've heard it's good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0QISUfiotlsAaxOFdkgPg"
  },
  "wM6NN90yD2qJSTEomeeu9g": {
    "date": "5/18/2015",
    "text": "I've driven past this place a few times and finally got to check it out today. LOVED IT. Decent prices, good food and great service! They don't have a large menu, but it seems to pretty customizable AND you can have as many dipping sauces as you'd like AT NO EXTRA CHARGE! They even have a \"hand washing station\" seems weird I know, but it's actually pretty cool.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tY9TNS_sNwQ0VQYDEKwBQ"
  },
  "CLUrlHdlvcLI-VxCwNWdOg": {
    "date": "3/29/2015",
    "text": "Not bad. Tenders are pretty good. Not any better or worst than cane's but it has its own flavor. Fries are great and love the buffalo sauce!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8fEikTqROY0HUSG8hlCEEQ"
  },
  "kzbAqcd3Njj29ZycnSRT6Q": {
    "date": "9/7/2015",
    "text": "I ate it all and forgot to take a picture but they have the best buffalo chicken sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jNy6yVVxVUeBS-QzE4e6Zw"
  },
  "QvouD7Gwo990RJqm_coB0g": {
    "date": "5/6/2016",
    "text": "Wow, wasn't sure what would be special about another chicken tender, salad etc place, here I found that customers are treated with VIP service and quick tasty food. For me sometimes its the little things that make me happy to return to  a restaurant whether it is fine dining or fast food. At PDQ, a clean bathroom, great/considerate staff, an area in the lobby to wash your hands as a family, great seating options, wonderful selection of kid and adult food choices, unique sauces, milkshakes, top-notch soda dispenser, soft yummy cookies all at a reasonable price makes this place a family staple. Mind you this review is for dine in only!! My husband brought home food from here two or three months ago- I think it was, but it was nothing to cheer about. We decided to give it another chance but dined in hoping it would be better. It was more then better. If I had to say one bad thing, the fry cook has to make sure they stay crisp on the outside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "R-w5SF_jcDWNlXF0QWNcIQ"
  },
  "Q5sYl6QCGZ6MQM48LSoOKA": {
    "date": "11/4/2016",
    "text": "their zucchini fries are the best I've ever tasted!! their chicken burgers were average tasting, and i hate that the sauce is limited to those \"mixed\" flavors",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PExRzlVr9tRE8OvZ55SFfA"
  },
  "l-j56SXububDXkH0XWEDgw": {
    "date": "12/26/2015",
    "text": "What else can I say but wow is this place good. I tried PDQ for the first time and it was worth the extra 10 minutes to drive than to go down the road to the other chicken place. The chicken was juicy and cooked just right and the fries were just perfect. I also am impressed that they do not charge extra for sauce like the others do. Thanks PDQ. I will b back !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOhzYARKE-1cCZTZQaiE2w"
  },
  "xd9v_eTl752XCSuejpoaXA": {
    "date": "2/26/2016",
    "text": "There was a bean bag game to play before you even walk in the door, so already in a good mood. Then a handwashing station right there by the door, so you know people probably wash their hands right when they get in there so the place is probably cleaner than most places.  The chicken was good, the coleslaw was good, the fries were good, the shake was good, the service was good, the place was clean and nice.  Really nice. If they had an outdoor play area they would be as awesome as Joe's Crab Shack for going and letting your kids play and not bother you while you can eat a meal and catch up with your friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJP6cns2IRz1XifErMlQbA"
  },
  "Vfodm9O1JHP0n3tmuGRLZw": {
    "date": "6/6/2015",
    "text": "Building and interior is nice but the food doesn't match. It doesn't compare in any way to Canes. Quality is not impressive and seems on par with McDonalds. I won't go back. It could be so much better but they aren't trying hard enough.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qnfLeoTKD45gKVoDu6ZWiw"
  },
  "PC5ITqSPsxwAG9mH1kBpoQ": {
    "date": "3/31/2015",
    "text": "The same people that vote for Pizza Hut as \"BEST OF LAS VEGAS\" for Italian food also give this place 4 and 5 stars. All I can say is the employees are nice and friendly, but frankly the food is over priced, small portioned, and just plain crappy,small fried chicken fingers and cold mushy fries.... yeah, that's what a family dinner should be.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "o7oDOkJMky50DpaQ4-D5wg"
  },
  "3H4S4Xx-vjEqbsE9idqF8g": {
    "date": "1/20/2016",
    "text": "This is a great spot to stop at everything here is excellent and the service is good. Good clean atmosphere to sit and watch sports if you want to",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ptB225Il8GLAxXK13r39bQ"
  },
  "5JYuGpMiSTIPGom5Ih02Ug": {
    "date": "7/3/2015",
    "text": "First let me say that the customer service is fantastic.  The restaurant is beautiful and very clean.  It's all down hill from there.  Canes sets the bar for me and this doesn't even come close.  The fingers are plump and juicy, better than Canes.  They have absolutely no flavor though. Zero. None.  They could have been so much more if they had some flavor.  Canes have great flavor and the sauce is a compliment to that flavor.  Here you have to drown your tenders in sauce to give them any flavor.  The fries were mediocre.  They weren't even that hot when we got them.  At Canes everything is too hot to touch when it gets to your table.  You know it's fresh.  Here I'm pretty sure my fries were not fresh.  Also got the apples with toffee dip.  It was good but nothing that special.  I'll stick to Canes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IgmnF3eJVOdfZB224gBVXg"
  },
  "8rkEXp7BfaU7vTD2QQuYtQ": {
    "date": "3/17/2015",
    "text": "Fast and friendly service! I'd say it's a little better than canes. More sauces to choose from, fingers are perfectly cooked and the fries are pretty good! I'll be back for a quick bite!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "w7Q-WMxPuznP-P2Y79ICng"
  },
  "11ZxP0qXN4W2GrQHhQ_9kA": {
    "date": "11/16/2015",
    "text": "Wow! I am so happy we stopped here! I've never heard of PDQ before and we've passed by several times. They have a big menu full of interesting sandwiches, shakes and desserts. I got the crispy turkey sandwich and a lemonade. I was pleasantly surprised by how massive my sandwich was! I mean, it was the entire turkey breast!!!! And the lemonade was so darn good. Fresh ingredients, great customer service and food that's to die for. Please stop by, you won't regret it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "58YtktG6OiSvQTJiVopgOg"
  },
  "qD6Jt2Aphgr7NfsKcP_WDQ": {
    "date": "6/7/2015",
    "text": "Bomb. Fries are fresh and high quality. Chicken and turkey is good. Sauces are amazing. Better than raising canes sauce. they also don't charge for extra sauce. This alone makes this place 5 stars! you can't even get free sauce at McDonald's. Customer service was excellent too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lYXFAolwgUqt8DVdZFSQEw"
  },
  "Xk-Y6mBTL4Maqz47BjFiVQ": {
    "date": "6/24/2015",
    "text": "Delicious!! The crispy chicken salad is super yummy and the apples with the toffee dip are the best thing I've ever tasted! It's great that everything is fresh. The chicken strips are way better than canes in my opinion because they're less greasy. Take your dog with you in the drive through and they give him a treat!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7VsihmrVZJzUSL_VqjEfzA"
  },
  "9mKX__FjErWrLZCJG0f9gg": {
    "date": "5/11/2015",
    "text": "PDQ gets 5 stars from me for a few reasons: First and foremost, the food.  I love chicken fingers and only treat myself to them once in a great while, but from now on when I do, it'll be PDQ over Cane's. I like that these fingers are fried crispy and the french fries are fried with the skins on.  The unlimited sauces are a treat and the flavors are great.   Second, I love that PDQ is taking a chance in an area of town (my area) that sees businesses closing up shop each week.  The area has taken a turn in recent years and having a nice, new clean, family friendly establishment is great for the community.  Why would I drive over to Cane's and buy chicken fingers for about the same price when I can get them two miles from home and support a local business?  (*hint to all NLV residents- unless you want another thrift shop or check cashing shop in your backyard, patronize this place) Third, I am a teacher.  This establishment did so much to support and honor teachers during Teacher appreciation week. They catered a lunch for the staff of the local high school (free of charge)and provided lunch for a local elementary school or two.  On top of that they  offered every teacher a free meal provided they show their school badge.   The staff is friendly and helpful and aim to please.  Check out PDQ, and like I said if you are an NLV resident and want to see  the community improve it is a good idea to support businesses in the area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B6toJwIl3nxJTbAABauXOA"
  },
  "IFVaBns7W9VXKmDKnAnwiQ": {
    "date": "7/22/2015",
    "text": "Does anyone know what seasoning is anymore? Chick-fil-A seems to be the only chicken place to get it right. You can't just stick a piece of chicken in a fryer and call it good. There is no flavor in the chicken. The sauce options are really good, and the service is impeccable. However it is hard to look past the star of the restaurant being so weak. Oh, and the fries are awful and seem to be getting worse.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Q2RjGHUw0dDixtL3OV2Ig"
  },
  "bwb5n5EdCxysSvT_4-z7Eg": {
    "date": "3/19/2015",
    "text": "I was really stuck between 3 or 4 stars. I decided on 4 because I really liked the quality of their chicken, better than Popeyes and Canes I think. However, the taste of the chicken was very plain, definitely lacking some flavor. I ordered the 5 piece meal since other reviewers said they weren't full, and it was too much for me. I think the 4 piece would be perfect. I liked their homemade sauces, however even after dipping my chicken in them, there was still that lack of flavor. The fries were really greasy, and I wasn't a big fan of them. I went through drive thru and had no problems, the staff was friendly and fast. The food came out really hot, and overall I think I could give them 5 stars if their chicken was more flavorful. I might give them another try down the road.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "geLlB_Qo_M900dCjxpKu9A"
  },
  "_Bh6Z0UBS2ibk3KEa8fKcg": {
    "date": "2/2/2016",
    "text": "I have been here a couple of times. First they are very friendly and fast with service. I think though I have decided that raising canes is still my favorite for chicken fingers. Some pluses about PDQ is that you can get a salad or sandwich so if your looking for some a little different this is your place. I also enjoy the different choices of sauces.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZtW4ud-A5doXWgM5dOFaIg"
  },
  "QtoxAApwV9laeEJGM1ZbHA": {
    "date": "4/24/2015",
    "text": "Awesome grilled turkey sandwich!!  The quality and service were awesome!  They also have a motto \"People Dedicated to Quality \". Great name and motto with some serious quality food!! Will definitely return and I'd recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Um-3UHQVVCtrX1m3chK5Bg"
  },
  "WWkv4iJquVUjqoLyOaF6gw": {
    "date": "12/13/2015",
    "text": "Chicken was tender and moist. This was my first time here. My mom and I were really impressed. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RCegBS9DCZ_7rfO3IRiV3w"
  },
  "VZWCeE4F_wwOAOfZYSwtEg": {
    "date": "8/29/2015",
    "text": "Walked in not knowing what to expect and we were surpised with both the service that we got as well as the food we ordered. I ordered the crispy turkey burger which was super YUMMY. The FRIES was also great. Fries were thin, crispy and fresh. Hope this review helped. Enjoy :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cebWRGurVnPGfjKPTv-DuA"
  },
  "1LObe9mUHLMuQ5svVH0eEg": {
    "date": "3/13/2015",
    "text": "Food was great my new favorite place for chicken stripes. Everything I tried tasted delicious. I would recommend this to all my friends and family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "NZSwASN06ZA2BPrWHoRqzg"
  },
  "UcoMPhpAZKZyOqZYefiBLQ": {
    "date": "5/24/2015",
    "text": "Good food, not pricy. The staff is great! I recommend getting all the dipping sauces for the fingers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pycAioMz_-n9QU4h6BfVzA"
  },
  "XlUAeCUgFCFtkeYWJh6OsA": {
    "date": "1/7/2016",
    "text": "Some of the best fast food chicken sandwhiches I've had, great milkshakes too. I would defineitly recommend this place to everyone I know.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXzrjHyRu5vZZkG_rsG5cA"
  },
  "JnlmS03Bf7tfvUrpAqRbyg": {
    "date": "3/24/2018",
    "text": "Decided on PDQ for lunch and they never disappoint. The resturant as clean as when they first opened. All of their employees are nice, friendly, and a sense of humor. They have the new soda machines that give you a bajillion soda options. The food came out quickly and our order was perfect. The apples and dip are delishishness!! One new thing i did notice is they have a box where you can turn in your retired American flags...very cool... love this place!!! They never disappoint!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pc4GXoRAU_iWWSpUEhY0ww",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Mmmm PDQ",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pc4GXoRAU_iWWSpUEhY0ww/o.jpg"
      }
    ],
    "user_id": "N2a8jXoJdNf0HrObbMLUUg"
  },
  "VnDLdp57DBlxJ55ACfRZzw": {
    "date": "1/2/2019",
    "text": "Food here is always great quality and tastes very fresh. The service is extremely quick and you have your order before you know it. Their drive-thru ordering is very efficient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdLayg_TZ7_A7s7BhxrvWw"
  },
  "mRyBvqcDTMgD3M-k0llu5A": {
    "date": "9/11/2018",
    "text": "Better than sex food! Juiciest chicken tenders we've ever had. And you never pay extra for sauce.  Will return soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mBEwJXNl_iyhVjxpZyKm0Q"
  },
  "azPc37-S1MlUy3xElAYWFA": {
    "date": "12/5/2018",
    "text": "This was a great experience. The food was excellent and the service was top notch. Highly recommend. Unfortunately there is only 1 in Nevada but it is a must eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oNR9sztlF883zmAMiK3lQ"
  },
  "ev1dqSwXLSAFO3vpl67RRA": {
    "date": "2/1/2018",
    "text": "OMG.   All of the sandwiches I've had w/ chicken or turkey were delicious There's a hawaiian chicken one on brioche that was so good. Burger is pretty tasty too. Zucchini Fries~~! Peanut Butter Oreo Shake~~~~! The sauces!  Only thing is that it's kinda pricy for a fast food place.. but the quality is good so it is worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vh8v72MaEqUCsNwWsslibg"
  },
  "cO4FGuoiAec3ZghTU7m5Zg": {
    "date": "8/5/2018",
    "text": "I visit his place for the first time couple months ago and I found the chicken to be quite small and quite dry. I was excited cuz it was baked and not fried but honestly I thought it was pretty gross. Also quite expensive for what you get.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jMA5Z5MDTRMIDKbd0yMFQ"
  },
  "JSUlsmFqspXgrFr7o6GOGQ": {
    "date": "7/7/2017",
    "text": "Love PDQ! I stop on my way to work to get salads for my co-workers and I at least 2 a week.  Justine is always a sweetheart! Food is always really good,  and reasonably priced for the portion sizes.   What I will say sets them apart is how nice every one is! (With the exception of Alex, a female cashier/order taker whom I do not like at all). Justine always gets my order ready with a shine,  and sometimes leaves me little notes.  I appreciate her hard work,  and taking a minute to make me smile- picture attached!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wZxgFRoD2pcQJZiXWChD8g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Justine leaving little hearts on my cookies!! Thank you for making me smile!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wZxgFRoD2pcQJZiXWChD8g/o.jpg"
      }
    ],
    "user_id": "SsBkTZzGKIY4dvGQXj1z_g"
  },
  "P7sZxd6WGSLJiyidvSYpUg": {
    "date": "3/6/2016",
    "text": "You really can't go wrong with PDQ. The name stands for 'People Dedicated to Quality' and that message shines through with every meal. The restaurant is a large open space, and it is so incredibly clean. The menu is posted at the register, and also on a large LED screen so it's easy to see and you don't get the 'pressured-to-order-anxiety' that you develop at most places.   We get the strip & fries meal. The chicken strips are succulent and well seasoned, the fries are cut on-location and still have the skin. They can tend to be a bit greasy - but I love them never-the-less. They also have one of those fancy coke machines where you can create your own concoction....holy yum.   They've got a good blueberry coleslaw, and I've had a couple of their salads before - they never disappoint. After running around on a Sunday morning, this is the perfect place to nourish oneself. They've even got some pretty amazing shakes for when you treat yo'self. :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "uYlzvshOSWCTwNLFBELTug"
  },
  "lVAwqEkDlmr7d3S2PD1c9A": {
    "date": "3/24/2019",
    "text": "The chicken nuggets were so good! The sauce was amazing--garlic creamy sauce was my favorite. The staff was super friendly and gave me the apples with caramel chocolate sauce for free because it was my first time. They were super yummy and a really refreshing way to finish the meal. The restaurant was clean and looking. Fingers crossed they'll be opening one in Henderson. This one is pretty far for me, but if they open one in Henderson I will definitely be a regular. I'm surprised there aren't already more around town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMcExQ3toqFqCpgT_Ae6JA"
  },
  "iJ4PApP-xk761XAIw_MtzA": {
    "date": "10/2/2018",
    "text": "First time ever going there and i wont be going back. The chicken had a odd moldy taste and I brought family to it. So embarrassing. Building is clean, they have that going for them but the chicken unfortunately isnt.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vtN9K2i9I22WvEhzhpJZrg"
  },
  "1uYwVVJHanqZmz5ghzaLgQ": {
    "date": "6/28/2017",
    "text": "4 stars out of 5 because the service was not friendly, with a smile, or even a hello.    The chicken is delicious!  I love the size portions and that there was no gristle to be found.  The french fries were good, not sobbing in crease or over salted.    The sauces and choice of variety of sauces is what makes this chicken place stand out.  I like that we can get several different flavors for each individual eater in the bunch.    I will be back and look forward to trying more sauces.  My personal fave the buffalo bleu!  Finally, someone who understands blue cheese and buffalo sauce were a match made in Heaven.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T6KPIQZ7zbQTfmiH5ntkZw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T6KPIQZ7zbQTfmiH5ntkZw/o.jpg"
      },
      {
        "img_id": "R4_oiiUfCB92-Rb0zmYYZQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R4_oiiUfCB92-Rb0zmYYZQ/o.jpg"
      }
    ],
    "user_id": "SJuSiO27FTKi5qKrNDa8Lg"
  },
  "1hDdtkcaqUyYJ42aZ4oV9w": {
    "date": "10/15/2018",
    "text": "Great prices and great food! Very clean and the staff is sharp and ready onsite. Thanks pdq! With that being said get their honey butter sandwich! At first sight it seems like nonsense. After the first bite all my thoughts left my mind from the warmth of this sandwich. It took me back to youth I swear by it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFPK0UcRNdEvghL-t-ahlQ"
  },
  "mBbJBdyVSG139d4zyywXRA": {
    "date": "4/17/2017",
    "text": "I used to come here all the time when I lived on the north side of town. The food is delicious. It's always clean, service was really great. Now that I moved further away, I come here Sunday evenings after church. I would still give the food 5 stars. But the service is always terrible. No greeting when you walk in, no greeting when you walk out. They always forget to give me sauce when I ask ahead of time.. and I go with my significant other so it's always weird when we both get our own sandwiches and tell them what sauce we would like and they just give us one to share. Anytime we ask for help it feels like it's really inconvenient to them. I don't know. I let it slide because I love the honey butter sandwich so much but to come here every Sunday and always have bad service says alot. Luckily we don't have to tip anyone! I used to always get the Cali club with crispy chicken. Ever since the honey butter sandwich came out I get that with sweet sriracha sauce. SO GOOD. The chicken is so crispy and the flavors from the seasoning or batter they use always pop out. Apple's with toffee butter are a must try.  Overall, despite terrible service I always come back for the food. Maybe I'll try the Sahara location from now on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6BdkhVJe3AhqxMc9fqM7SQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6BdkhVJe3AhqxMc9fqM7SQ/o.jpg"
      }
    ],
    "user_id": "xTimtxT3p1zKrtfP9JRuZA"
  },
  "D7_maKuFyHL9FsLwhEylFA": {
    "date": "12/3/2015",
    "text": "Had this placed bookmarked for a while.....blah blah blah.  You know how it goes already.  PDQ was serving solid chicken strips. I prefer a little more crunch to mine but I could tell these were not freshly fried.  The order was completed just seconds after we ordered.  I know there signage says fresh fast food but at this speed it's not that fresh. The natural cut shoestring fries, (meaning they leave the skins on) were slightly undercooked and soggy. They were tasty but some might not like the natty style.  We also had a salad from PDQ which had this tasty blueberry vinaigrette dressing.  Never had this flavor of dressing which was delicious as we're the candied sliced almonds.    What I liked about PDQ was they give you as many dipping sauces as you would like to try. No up charge for seeking your favorite. I had the Buffalo Bleu and Chipotle BBQ which were both good. They also have the Coke freestyle machines and three different Tea selections and lemonde.  I hear there shakes are awesome so I will go for there flavor of the month next time.  Overall decent spot to try. Prices and portions were fair and food was good quality. Next time I hope it comes a little fresher but this was not a serious drawback for me. They did have an army of staff who definitely had too much time on their hands and it was difficult to see who was in charge. They had a lot of students working and someone wearing a Chefs coat who might gave been in charge.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "_AM8bo0pMdoAKbK1iK4scQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_AM8bo0pMdoAKbK1iK4scQ/o.jpg"
      },
      {
        "img_id": "jhxNaRJl1-Q9tc6Oc_2sjA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. I remember these from school.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jhxNaRJl1-Q9tc6Oc_2sjA/o.jpg"
      },
      {
        "img_id": "UWzQhclc4Hvu0TNqMWANzw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Go ahead lick your screen. No one is watching.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UWzQhclc4Hvu0TNqMWANzw/o.jpg"
      }
    ],
    "user_id": "8fsZcLADFrPTbGrFqMACpg"
  },
  "aZoio6r0BlqJNrmSEhmuSw": {
    "date": "4/29/2018",
    "text": "Sorry beats Kanes hands down! Chicken isn't over breaded, sauce compliments the chicken, not makes up for it. Sad more people don't know about it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ys0fyvMJfKyh1knTEWadbg"
  },
  "knoEBoOrVa_r0Fv9N1HnIA": {
    "date": "6/29/2018",
    "text": "The best customer service in the north!  Food comes out fresh with a smile every time.  Inside, thus place is huge, tons of seating with tv's and very clean.  Keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-HcirMcpUDd3GvexCOCCzg"
  },
  "683bE5TyhKL0FCfMgQFzmA": {
    "date": "11/19/2017",
    "text": "Food is always ok.  Ordered the Cesar salad and the salad was old...  The place smells really bad it's dirty and they were four employees standing around doing nothing on the Sunday afternoon when there's no customers but me inside. The floor was dirty no paper towels in the bathroom and it smelled horrible don't think I'll be coming back here anytime soon, I think I'll just stick with the Sahara location for now.  Whatever happened to employees taking pride in their job and doing what they're supposed to like mopping and cleaning and making the place look good not here!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "56DrkR69w-MFIFLaduJmvw"
  },
  "LO5QIgsoyOH0PJnYQ4PaIA": {
    "date": "7/4/2018",
    "text": "One of the BEST places to eat if you are conscious about the ingredients you put in your body.  Healthy delicious food and great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QNA_qajoAw2rlxSj2hsFSQ"
  },
  "ats3ZBiK6FbVxeknqc5bww": {
    "date": "3/9/2018",
    "text": "This is the PDQ closest to where I live, just a hop, skip and a jump away, and is usually frequented by me whenever PDQ has one of it's two-for-one specials going on. This is a frequent occurrence throughout the year.  The drive thru is easily accessible and usually a smooth service experience for a quick grab and go of two deliciously fresh chicken tender or sandwich combo meals of your choosing at 50% off whenever a coupons is available.   Two meals each consisting of a sandwich or 3 chicken tenders, large fries and a drink for slightly more than $9.00 is definitely a worthwhile and flavorful deal that should not be passed up!  The PDQ menu has undergone something of an update recently with new items available and is even better now than it used to be. Thus, if you haven't stopped by in a while now might be just the time to do so and explore what's new. The current menu can be accessed online at any time.  Worth noting is that PDQ also has a variety of tasty chicken sandwich options available in addition to its chicken tenders or nuggets while its main competitor - Raising Cane's - is pretty much a chicken fingers only establishment.  This is why I usually get most of my chicken fingers/tenders at Raising Cane's while my go-to location for truly tastebud-stimulating, deluxe chicken sandwiches is PDQ.  If you decide to dine in, you will not fail to notice the invariably friendly employees and quick service overall. You will be promptly greeted as soon as you cross the threshold.  The clean and modern restaurant itself has quite the airy and open design inside (in my opinion much nicer than the competition at Raising Cane's). It is well lit and can't help but enhance the enjoyment that you will be experiencing as you happily consume one delectable chicken sandwich or tender after the other.  Note that PDQ also will give you a completely free combo meal of your choice (not just a 2 for 1!) on your birthday, while Raising Cane's will send you a buy-one-get-one-free box combo offer on the anniversary of your Caniac Club membership.  People delivering quality (PDQ): It's definitely what they do very well indeed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3YkDOdIpQLu3Iq3ZZ3VSzQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3YkDOdIpQLu3Iq3ZZ3VSzQ/o.jpg"
      },
      {
        "img_id": "I_DAMbnibOFpGVE2LHi0NQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I_DAMbnibOFpGVE2LHi0NQ/o.jpg"
      },
      {
        "img_id": "LETeDE5pDf-Go3Jsu9bK1g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LETeDE5pDf-Go3Jsu9bK1g/o.jpg"
      }
    ],
    "user_id": "1aJni3g7tN1ikyCxIHnmtg"
  },
  "FZSS3BFEWnx6h_fNa5EVdw": {
    "date": "3/5/2018",
    "text": "Went 03/01 around 8 o'clock at their Craig rd location in Las Vegas . Order zucchini fries and was very disappointed to find a top layer of about 10 zucchini's and the rest little fried pieces of CHICKEN. Usually when eating there everything is fresh and done correctly but this is just unacceptable .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QoS0bziS_ry2BeKYcPsiVQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QoS0bziS_ry2BeKYcPsiVQ/o.jpg"
      }
    ],
    "user_id": "LopWq8nTPuSq8w8ZuDtZMw"
  },
  "Ds-o1Fe4FiG6YWHlEKC4AQ": {
    "date": "5/15/2015",
    "text": "For a fast food joint - its pretty good.    The service was lightning fast and friendly.  We had the chicken tenders, fries and a salad.  The tenders are light and juicy.  Not a lot of flavor, but they offer a nice variety of dipping sauces.  The fries were good, kind of a homestyle type of fry.    I would give this place 3 stars but I bumped it up to 4 stars because they have pepper grinders on the tables.  KUDOS!  I keep telling people Im going to start bringing a pepper grinder to restaurants because it is so much better than the regular stuff!  This shows me that this place actually cares about how the food tastes and it is appreciated.  Get some fresh ground pepper on your fries!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "W8LHQTHegJ1H8oDVblkA4g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Finally, fresh ground pepper and salt at a restaurant!  Well done pdq!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W8LHQTHegJ1H8oDVblkA4g/o.jpg"
      },
      {
        "img_id": "ONra8zquyFSuUjLo1xZfIA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Chicken salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ONra8zquyFSuUjLo1xZfIA/o.jpg"
      }
    ],
    "user_id": "L15JCA18Ib_vMUVJILxiSw"
  },
  "9mMO2J6d1FNCLMIz-3dV4g": {
    "date": "4/25/2015",
    "text": "I have come in to PDQ twice now in just the last five days alone. I have tried and enjoyed the chicken fingers, the coleslaw, the fries, three sauces, Cheerwine soda, and a chocolate malt. I have even used the handwash station upon entering and tried my luck at the free cornhole game outside. I think it is safe to say that I am a fan.  The chicken fingers are pretty good here. While they are not the most crunchy fingers I've had, they are some of the most moist and tender around. They taste good too. You can actually see the herbs and spices in the breading. Freshness you can see. As good as they are on their own, you should try them with one of PDQs many sauces.  The first time I came in I tried the creamy garlic sauce. This was sweet, spicy and garlicy. A perfect creamy sauce for these fingers. Today I tried two other sauces, the honey mustard and the chipotle BBQ. Honey mustard is simply a good classic chicken finger sauce in any form. This sauce is especially good. It is a sweeter honey mustard than normal. You can actually taste the honey. As for the chipotle BBQ, it is like a smokey ketchup. Its good but better with the fries.  The fries are fresh cut daily and seasoned with salt and pepper. Shoestring style fries, as these are, can be really good or really bad depending on the way they are cooked. These are done right and tend towards the good. Some ketchup, chipotle BBQ or some other sauce help but aren't especially necessary. Just a nice touch.  The coleslaw is excellent here. It is more fresh than other fast food places serve so the cabbage is still crisp and a little bit spicey. This is less creamy than the standard slaw. The kicker here, besides the freshness, is the handful of blueberries they toss on top. Their sweetness balances the slight spice of the cabbage nicely. Gourmet slaw from a fast food place. Pretty cool.  The hand spun chocolate malt I had today went down way to easy. It was silky smooth, ultra creamy and sweet with a nice wallup of malt just for kicks and giggles. I think it is made with soft serve ice cream. That isn't my first choice as I prefer old fashioned hand scooped shakes. Regardless, this was a strong version.  PDQ stands for People Dedicated to Quality. They take that name and slogan seriously in here. The place is very clean. The food is always fresh. Service is always friendly. I would be in here more if the prices were lower. A four finger meal with fries OR slaw and a drink for $8+ is a bit much when I can get fries and slaw plus toast for ths same price elsewhere. I have a feeling they will do alright without me coming in every week. With what they are putting on the table this is the next big thing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOIMO2wT_WbNqmavhnCRxw"
  },
  "rE1pltYQp9wilg-8p0_qmw": {
    "date": "6/20/2015",
    "text": "The Crispy Chicken Sandwich was delicately fried to perfection leaving a perfect balance of crispness and juice that makes it a very good sandwich by itself. Throw in the wide variety of radical sauces that only adds to the experience and you've got yourself a dish that very much surpasses the efforts of Chick-fil-A and Raising Cane's.  It really looks home made as well. When they know you're a first timer, they offer to give you all dipping sauces and place looks really clean and open.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "47VHXBfkvMG2vGujavg7_w",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/47VHXBfkvMG2vGujavg7_w/o.jpg"
      },
      {
        "img_id": "CcTQ3DPOVB9RT_D2yE95wQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CcTQ3DPOVB9RT_D2yE95wQ/o.jpg"
      }
    ],
    "user_id": "Q4LOqAus7TjheKgZwQfkdg"
  },
  "WyW4o-YbZpxEy-Rn7PlWEg": {
    "date": "10/22/2017",
    "text": "Excellent food choices, taste great and reasonably priced. The food choices were geared to bring healthy and nutritious, everything was cooked appropriately, the inside of the restaurant was neat and clean, plenty of parking. Their was not a thing not to like about this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X9KcIIac2cGDGsmX3inl2g"
  },
  "5kxNEBbm89r5dN6E3luSaw": {
    "date": "7/4/2016",
    "text": "This is our second visit here in 2 days. The staff member at the register gave us a great overview of everything. The food is SOOO fresh. Sarah had a banana shake and it was full of real bananas not just syrup like most other places. I had the chicken sandwich and I thought it was one of the best sandwiches I've have quality wise in a long time. The sign People Dedicated to Quality really does apply here. Try the blueberry ginger sauce. Great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PYk5ByK40DT8Jft6cADMOg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Clea, fast, friendly, amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PYk5ByK40DT8Jft6cADMOg/o.jpg"
      }
    ],
    "user_id": "HS4Y-QWGkyIEC3wFx4DEXg"
  },
  "1IS3uMdvl_MO3hcWtM6azw": {
    "date": "4/4/2017",
    "text": "So, I'd driven past this place a million times. Been wanting to try it. I even started following them on Facebook. They released a $5 off coupon on Facebook, so I got it and decided to try it. I can't tell you how disappointed I am. The reason it's getting two stars is only because the fries were actually pretty good. I started eating those on my drive home. But it went down hill from there. They have a lot of sauces. I ordered a side of their Buffalo blue sauce cause I wanted it for my fries. I don't know if it's how it's made, or if they gave me the wrong sauce, but it was sweet! What Buffalo blue sauce is ever sweet? So that was gross. Go home, opened my Cali club chicken sandwich that I ordered with the crispy chicken instead of the grilled chicken. Two bites in and I tasted something funky. Then i realized that it was the taste of mold! I don't know if the avocado was going bad, or the chicken had been sitting. But it was so gross. I couldn't even finish it. For a meal that would have been over $9 without my coupon, I was very disappointed. Pay over $4 and only enjoying the fries was disappointing. I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "txoyFbWcdAD_aRmr5v6OQg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Over priced for gross food.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/txoyFbWcdAD_aRmr5v6OQg/o.jpg"
      }
    ],
    "user_id": "dct-Z72jZnpcEFoj21NU-A"
  },
  "BW1d4DVG44mCyatTROv1wA": {
    "date": "7/23/2016",
    "text": "The cleaniest freshest fast food place ever! The bathrooms are amazing! Our food was great! The crispy chicken has a perfect crunch thats freshly fried! I love the zucchini fries..ommg and the sweet siracha sauce is great! I love how legendary their customer service is as well! We literally ordered our food, used the restroom came out and our food was ready! Everything from sandwiches, fries, salads and drinks=impressive!  Thank you PDQ for a great family lunch date!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bOM7sIuB_yjHm46shPacoQ"
  },
  "-HQ8pZqRoq_glDe6Q4_U5g": {
    "date": "10/3/2016",
    "text": "Chicken is always fresh orders actually received inside and drive-through are relatively quick. Just had their chicken nuggets white meat plum fresh lightly breaded along with their zucchini fries shoestring lightly breaded of course they're a little greasy they are zucchini sticks but very good. Several great dips to choose from  there honey mustard sauce is one of the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bzysLAIkFwPu6VezAcFSIQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. White meat nuggets with zucchini fries along with ranch and honey mustard",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bzysLAIkFwPu6VezAcFSIQ/o.jpg"
      }
    ],
    "user_id": "1aruOVWpIVWDC-6r6XadVQ"
  },
  "aLxAMJ1vD5wdsfpDJZazSg": {
    "date": "8/17/2017",
    "text": "Very tasty chicken.  Very clean store and nice employees.  Impressed with bathroom and fountain hand washing tub.  Great for kids.  Will go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9-MHgiNQWm6oAxfeLlYug"
  },
  "QQw6PmFPimesRCpjGPlNvw": {
    "date": "8/15/2017",
    "text": "Food was really good service was even better! Kurt was awesome he made sure to let me sample the toffee apple dip which is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xn2-yokEMqggXW9nbr7zow"
  },
  "D_ULTKyY4RUl9CrgFdu7GA": {
    "date": "1/12/2016",
    "text": "A big fan of this place. The sandwiches are great and they got an assortment of sauces to choose from. While a little on the pricey side, I think it's worth it based on the quality you get. Everyone month they switch up a new milkshake, to me those have been a hit and miss, but the strawberry, chocolate, and vanilla that are available all the time are great. The customer service here is also beyond amazing, everyone is really nice and they do orders fast.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "4N-HU_T32hLENLntsNKNBg"
  },
  "VauAtdk9IIcbsRf-GOtzWw": {
    "date": "4/17/2016",
    "text": "I have been eyeing this place for months. Mulling it over as I drive by. Intrigued by the corn hole and suburbia urban shipaTown look (South Park) for the ill informed. So finally my hunger and curiosity overwhelmed me and I went in. I was greeted by an overwhelmingly friendly staff. I was a little hesitant, because j figured it was a trap. So we got out order in and it took longer for me to use the restrooms than get my food. It was like the cooks knew what I wanted. The food was phenomenal and they catered to our not on the menu order for my daughter. Very very pleased. I highly recommend this place for families or anyone looking for a healthier alternative.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JkUuLTHKsk8-43TElo5N_g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Even my fussy eating daughter was blasting back everything she had in front of her. Miracle workers here. Except none are blind and deaf.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JkUuLTHKsk8-43TElo5N_g/o.jpg"
      },
      {
        "img_id": "clPl10KyJn_NWAHG89IjLg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Grilled Chicken bacon sammich. Made sweet sweet love to my taste palette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/clPl10KyJn_NWAHG89IjLg/o.jpg"
      }
    ],
    "user_id": "_QjDW_6gQEPmMpyYGvOHmw"
  },
  "laE4zC5coF-U9BEJCu8Qmw": {
    "date": "4/13/2018",
    "text": "Love this place eat here all the time. They are always pleasant at the window or inside I would recommend it to family and friends",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5y-LPRAOCbnEP5_DfOvazg"
  },
  "pn2IZ1PGxuGaWEh0xiFeMg": {
    "date": "3/31/2015",
    "text": "Chicken is chicken is chicken. Personally, I don't see what all the hype has been lately for chicken with the opening of Canes here in NLV and now PDQ. But, I encouraged my son and husband to try something new tonight.  And I'm glad we did!    First thing to greet us was a sidewalk beanbag toss game.  Cool. Walking in was nice to see the open area and the smiling faces to great us.   Kayla took our order and she was super friendly, even joking around with my goofball family. I ordered the 4 piece with Blueberry cole slaw and buffalo blue sauce. My husband and son went for the 5 piece with fries and ranch. We weren't seated but 5 minutes at the most, just enough time to grab a sweet tea and sodas, before our food was ready. Digging right in, we LOVED it. Chicken was moistens the sauces were delicious. And the cole slaw?  Awesome. Never thought to put blueberries in slaw. Staff came by to check on us and take our empty baskets. For dessert we had a vanilla shake and two Oreo shakes. Yummy!  Easy to drink too with their extra big straws. Had to try their homemade chocolate chip cookie and I'm glad we did. Talk about super soft.   Oh and they have a hand washing area when you walk in. Nice touch so you don't have to go to the bathroom to clean up before and after your meal. Lavender soap too!  Nice.   Definitely will be back often!  Great food. Great staff. Great experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oKKk3dVgBVlm5KoJT6w-Hg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Great way to wrap up your meal...shake and a cookie!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oKKk3dVgBVlm5KoJT6w-Hg/o.jpg"
      },
      {
        "img_id": "2PKah4In_WBhnkkVXmDFOA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Blueberry cole slaw?  Absolutely yummy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2PKah4In_WBhnkkVXmDFOA/o.jpg"
      },
      {
        "img_id": "LJ7B4mmvee63N6evEBdRZw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crisp on the outside and tender and moist on the inside!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LJ7B4mmvee63N6evEBdRZw/o.jpg"
      }
    ],
    "user_id": "iLGfA0iJgHn3-n3Fnwt0Ng"
  },
  "rY7mQqMbRCJe0CbwwqF8wg": {
    "date": "4/26/2016",
    "text": "We were surprised how good this place was. Can't go wrong with Chicken Strips and French Fries. I also had the Salted Caramel Shake. It was so good that I finished it before the food got to the table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "haX505azV76mquXYrQBIvA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/haX505azV76mquXYrQBIvA/o.jpg"
      }
    ],
    "user_id": "lK-nDdaTfvhuhUowIyOpmw"
  },
  "-4JIbEBLgCrOHIixRJR5lg": {
    "date": "6/2/2017",
    "text": "I really want to like this place. I cant really say that i've ever had a 5 star visit. I e tried this place a few times to give it a fair shot before yelping. Today we went thru the drive thru. 1st window rep never greeted us however the 2nd window made up for it. Very nice! When ordering, she never asked sizes or about fry sauce. Since i don't frequent this place often i, of course, didn't realize this til we were home. Thats when i see my sons fries are limp, greasy and tasted old. They were pretty disgusting. My grilled honey mustard chicken had NO SAUCE! Beside extreme pepper, it was pretty bland bland. The apple slices and toffee dip were good. I didn't go back to have them fix anything. I probably wont go there again for awhile its expensive for fast food.  The price vs the quality and the accuracy isn't worth the hassle.  My recommendation is check your order, thoroughly, before you leave. Good luck PDQ!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucW9uFU1J41TuJRKxYKQ0A"
  },
  "dNJkzwJoXE9Mu0cEa1IAQg": {
    "date": "6/28/2017",
    "text": "The food was just ok. The coleslaw didn't have much flavor. The sandwich was big and pretty but didn't taste as good as it looked. Hubby said the tenders were not better than canes. They forgot my ranch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ta3BGvmyGTMV2LeJs-3rVQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. 2 orders of fries, blueberry coleslaw, breaded chicken sandwich, chicken tenders, drink.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ta3BGvmyGTMV2LeJs-3rVQ/o.jpg"
      }
    ],
    "user_id": "USMm3mKNzIGS8L6y6fH9hA"
  },
  "jYO1znV-w46p7K3i2SpEfg": {
    "date": "1/31/2016",
    "text": "Love this place food is really good... The first time I tried it I fell in love it... My first order was chicken(fried) salad and fries both at amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EqXooCH8CV3yzATS-mZvaw"
  },
  "V5SQP_kHEE-zxS8ZEdHoKg": {
    "date": "9/15/2017",
    "text": "They have your standard fast food fare but also several healthier alternatives (would like to have seen some calorie info on the menu, though).  Clean restaurant, polite staff, really good food served FAST!  I had the taco salad and the wife had the crispy chicken salad. Both were very good. The fresh squeezed lemonade was just tart enough to give it a kick and was equally good. It's a little out of our way, but I'll definitely make a point to come back whenever we're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MMy4eyIuLrSG5xbOV_WJRw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MMy4eyIuLrSG5xbOV_WJRw/o.jpg"
      }
    ],
    "user_id": "Cnqj6mA2oxx2KKlzvlYBjw"
  },
  "sCaTLWh_5ySzmNYBq04ojA": {
    "date": "11/17/2015",
    "text": "This place was a last minute stop after a hike and it ended up being a really good experience.  This place is like canes, but... With more variety. There can easily be a debate on who has the best chicken but i would have to lean towards canes. Pdq has a variety of sauces though, sammiches, and even a really good salad and some pretty good milk shakes.  The place is clean and the staff is friendly.   Im definitely coming back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "mlXLPBayYqjbUMmtFrlw4g"
  },
  "Yz1NazUttpQD0LH33letFA": {
    "date": "7/14/2019",
    "text": "I visited PDQ after being away from there for almost a year.  I was a bit disappointed that the chicken tenders were noticeably smaller than they used to be.  I ordered a 4 pc basket thinking I could share it with my son, but because they were small pieces I didn't have any.  The portion of French fries were also a lot smaller than my previous visit.  For almost $10 with a drink, this was not a good deal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1udfSgsviHgyMxOKND_REg"
  },
  "cyCHvn9krIOMy_aKaQRsAA": {
    "date": "4/23/2019",
    "text": "Super tasty and fresh. First time eating here. I had the Cali bowl. Chicken was amazing, broccoli cooked perfect, and their shakes are super good. Definitely worth the $.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnuXRz-xGm40hevpbWZMrQ"
  },
  "TZ3EdNwp5gQE5C4c1TjXPQ": {
    "date": "4/27/2019",
    "text": "PDQ gives off such an amazing home feel . I always feel like I get the best quality from each staff member. For 2 years I've been coming here and I'm always greeted I've come in so often they all remember my name. If your out and wanna stop for really good food this is the place to go... If you wanna chill with friends and be served fresh hot good food this is the place and kids love it here ive brought my neice and loves the apples with the homemade dip sooo good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rdt__nr1i6FzsuHIi54wRw"
  },
  "hxgohbBRBrx9Qbjwg69CIw": {
    "date": "1/2/2017",
    "text": "I admit it, I'm a fan of PDQ.  I'm here for the chicken, specifically their grilled chicken.  People Dedicated to Quality is their motto and they stand by it. There hasn't been one time that I have received less than stellar service here.  After you order, the food is served with the quickness.  Yes, I know it's fast food.  But it's \"clean\" fast food.  The chicken sandwich and chicken tenders are okay.  It's their grilled tenders that rock my boat.  My typical order is 12 grilled tenders for $12.50.  This is enough to feed two or just me.  Taste wise, it's equvilant to grilling chicken breast at home.  Hip Hip Hooray!!  2017 Yelp Review #4",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "dvF-CpeCVdh6JTCZAMeIyA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crispy Chicken Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dvF-CpeCVdh6JTCZAMeIyA/o.jpg"
      },
      {
        "img_id": "xjf737dFc_TvPnTma3_HiA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. 10 Grilled Chicken Tenders",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xjf737dFc_TvPnTma3_HiA/o.jpg"
      },
      {
        "img_id": "5vXHxbEE_a-A_fRcAfmGuA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5vXHxbEE_a-A_fRcAfmGuA/o.jpg"
      }
    ],
    "user_id": "y3FcL4bLy0eLlkb0SDPnBQ"
  },
  "JBhF_8iIBRdFYzfE_CLa0w": {
    "date": "6/23/2019",
    "text": "This might be harsh, because my original review was brimming with accolades.  I hadn't eaten here in a while and recently went in with the family.  We ordered our chicken strips and our desired dips.  Dipped them, bit into it, and immediately, I thought a mistake had been made.  Tried a couple of other dip flavors and the same disappointment.  Went up to tell them our dips were \"different.\"  Manager told us that the recipes of all the dips were redone.  Redone?  So, it's a nationwide thing and nothing can change it.  Everything tasted bottled and lackluster.  The chicken, while the same, is nothing without the original dips.  Maybe it was for cost-effective measures, but that's what had us going here--the high quality dips.  I could buy a bottle of Ranch dressing at a store and it still would taste better than the Ranch they served us.  There's no desire for us to go back ever.  So sorry that PDQ went in that direction.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgzjhRYTQXyOMFXHYG_2RQ"
  },
  "7US8LfE4loKlPMq_SYFb6w": {
    "date": "7/20/2018",
    "text": "This was a really nice change of pace. I was in the area for work and saw the good reviews and decided to stop in. I was amazed at how quickly my order was prepared. The chicken was delicious. The fries were also good but not as hot as they could be. Still not bad. They have a great selection of sauces and fountain drinks. It was also remarkably clean in case you're like me and you judge a place on their bathroom.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msxc1VlPTD6E-0Kns7bIFw"
  },
  "Hh0KxwmLF7h_ulfd7-Hulw": {
    "date": "4/2/2019",
    "text": "Had this for the first time ever today an it was absolutely amazing. The manger on duty HECTOR AVALAR an his staff, welcomed us like we were family. Me an my family will definitely be back an encourage ppl to try an support this amazing place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0QrBPrI2j2f1a3RaE9l2w"
  },
  "k3PA68ADLBu_gsvmfLaccQ": {
    "date": "4/30/2018",
    "text": "I have only tried this place once, and my mom said the chicken was not as juicy as normal. It is because of this (I trust my mommy's opinion on everything), the fact that we all have off days, and the bowl with the Fritos was kinda good that I will try this place again.  My mom likes PDQ better than Cane's. Cane's is always juicy when I have it in Vegas. That's why the two star rating.  I will be sure to try this place again next time I visit Vegas. If it's as good as my mama says, I know I'll raise my star rating.  2018 Challenge - 39 of 100",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "Kf4dEsXWO56QUO9hgQeHeQ"
  },
  "lmYTPdljYul42StydiXZ1A": {
    "date": "4/21/2017",
    "text": "4/20/17 Excellent service! We had two different employees come by to see how everything was tasting. One came back and cleared our table for us. Don't mean to compare you to another restaurant but you got Cane's beat. It's all about the sauce selection for me. Although I do like Cane's I don't like their sauce. Only other option is ketchup. You guys rock with all the sauce selection. I also like that I can get grilled chicken for a healthier meal.  Love Love Love the lemonade.  Prices are affordable. Very clean restaurant with happy employees.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACMYTmlycF2-HgSZ8lyC0A"
  },
  "OczfPa7hpRlkU69eWRJOFA": {
    "date": "10/1/2018",
    "text": "So many sauces to try from. Tried their tenders and nuggets, and they didn't charge any extra to try all their sauces. With their fountain drink they have SO MANY to choose from as well. Way over 20drinks to choose from. Maybe over 30. Quiet chill place for family and friends with lots of seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9OBoDVEVpPNQFrD1X4xCQ"
  },
  "J6JkPNnwBLhfWmKWkOsejw": {
    "date": "11/17/2017",
    "text": "I'm a bit embarrassed of how much I enjoyed myself here. I typically don't eat fast food, but I've had Cain's and thought it was severely lacking flavor.  PDQ is juicy, crispy, seasoned, deliciousness!  The fries are wicked good too!  I had the honey BBQ sauce and thought it was really good, I tried the creamy garlic and was surprised how much I liked that one too. I also tried the honey butter sandwich, it was sweet and yummy, and the dripping on my fries were a nice treat Lol Oh, and I don't know how they did it, but our food was on the table within 5 minutes of ordering, I swear to god! And it was golden brown, which indicates good oil not the old, rancid stuff. The dinning room is pretty swanky for a fast food joint, modern and very clean; they even have a bunch of TVs on the walls.   All in all, I'm very impressed w this place and will gladly drive out of my way for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QKfZqCzMdAz9CTYrhC5DjQ"
  },
  "p8xzn4rI9KtSHXYg-zBnpg": {
    "date": "11/5/2018",
    "text": "1st time back since they opened. Noticed that the tenders are half the original size. They are still tasty and quick about getting orders out. Place is popular with families , the menu has been updated  with sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PD0EuTfz4S-F7L73XkheQ"
  },
  "EzlzAKYIbK-ruGVYDKMtOQ": {
    "date": "11/2/2017",
    "text": "Wow.  They've gotten even better.  The new chicken sandwiches are the best I've ever had.  The Pimento Southern Pimento has lots of cheese and the right amount of crunch.  The Hawaiian sandwich is awesome.  The pineapple and fresh slaw goes well with the generous portion of fresh grilled chicken.  Service is quick and friendly.  The crew is excellent.  I love the recent Birthday BOGO coupon.  Coupons help me make my fast food choices, so keep them coming !  Happy Birthday, PDQ !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gab1_sLsjJLAJojoFd-d-g"
  },
  "Xc63FGGUvnY6g-69MVFsrg": {
    "date": "7/28/2018",
    "text": "I've gotten sick twice now after eating here.  Management doesn't seem to care and plays dumb yet there are multiple reviews of people getting sick at this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QusE6oEezkcqRpzVHGEHSQ"
  },
  "JGLlJ75_sMRN4b4_ckk10A": {
    "date": "6/19/2018",
    "text": "Passed by this restaurant several times. Wife researched online, looked good decided to stop. Great experience. Staff was ultra-friendly and considerate. Told them we were first-timers and they did the rest.  Wife and I had chicken sandwiches - they were great. Kids had tenders - they loved them. Great variety of sauces, sides and drinks.  Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Idx4fbm1ZLx4sYFltVwxQ"
  },
  "rpkQgbDXVdOmgxi5FXsrBQ": {
    "date": "8/17/2017",
    "text": "Someone once said to me, Raising Canes over  PDQ. We don't fast food much so it took us a while to even try them out. One night while our older boys were at football camp, our younger boys hunger game got real. PDQ was the most closest, and so I PDQd on into the drive-thru.   Let me just say, I don't like talking on the phone, I don't like texting either, because I greatly prefer face-to-face interaction. When I discovered their drive-thru does not require you to speak into a box, but to an actual person looking right at you...PDQs points jumped up to a 100000000. On this night, I ordered myself a chocolate shake, boys had the nugget kids meal, and the honey butter chicken for the  hubs.   Chocolate shake was on point. I was happy that I didn't have to suck for dear life. Am I the only one who peeves at shakes that hasn't been \"shaked\" up long enough leaving you no choice but to use a spoon. Ugh. I opened up my boys kids meal and was impressed at the boxload of fries they give. It was way more than enough for my 4 and 2 year old. I ended up splitting the fries between them so I scored  fries from my other son's meal. My 2 year old didn't finish his chicken, so I was able to taste it. The chicken was not greasy, and it was pretty moist.  My husband who loves food, but is NOT a burger of any sort finatic...surprised me by his reaction to the honey butter chicken sandwich.  He was like wow, that's pretty good. And so people...we went from never going to PDQ to stopping in 3x in 2 weeks. Pretty big deal to us. Lol. On other visits, we have had the zucchini fries....those were good. If you want zucchini fries instead of fries for your meal I believe it's about a 2 dollar upcharge.  Service has always been helpful and friendly. You will have to wait for your food as they make everything fresh. We love their sauce options that apparently they make in-house so don't expect some sealed up container for your bbq sauce like you're at jack-in-the-box. My husband loves the bleu cheese dip while my boys and I like the sweet sriracha. It's almost like eating spicy tuna mayo...but chicken. Lol. They have a good amount of sauces to choose from and they haven't been stingy when giving us our dips.   So of you ask me, Raising Canes or PDQ? It shouldn't be a debate. They both have two different menus. If you want variety...PDQ is your place as they don't sell JUST chicken. It wouldn't be a fair comparison. I love them both. But with my family of 6 and everyone having different desires...if we are having a white chicken never frozen kind of mood...we would head to PDQ over Raising Canes easy.   Each visit it has always been clean. I love that they have this wash your hand area that doesn't require you to go into the bathroom. Genius idea. Lol. They have counter seating, but yet...you don't feel like you're at a diner.   The one thing I was rather disappointed in...is their blueberry coleslaw. I thought it was going to be something magical or different when really, it was literally coleslaw with a few blueberries in it. Whoopdeedoo. I should've lowered my expectations. Think I went ham with my imagination on that one.   Definitely kid and stroller friendly. Lots of seating to choose from. Highly recommend giving them a shot especially if you are in a chicken finger or nugget mood.   Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "MC0aQHT7mQ1WJknOD6u8pg"
  },
  "a344MaJfYrYbclVN-NYT-w": {
    "date": "10/22/2017",
    "text": "My first time here was a few days ago. I went through the drive thru and got a grilled turkey sandwich. It was soooo yummy!  A few days later (today), I went back and ate in the restaurant will my friend, Dale. He got a double cheese burger with nothing on it and I got the grilled turkey sandwich (it was that good). They got the order correct the first time. Dale and I felt that the fries were way too salty and so they brought us a fresh batch (still a bit over salted but maybe that's their thing). For me, my sandwich only had about a teaspoon of cranberry sauce. I'm a HUGE cranberry fan so I requested more sauce. The manager brought it to me in person. She was friendly. She wasn't wearing a name tag though so she will remain anonymous.   The restaurant is very large and clean (but not sterile feeling). The staff was especially pleasant and helpful.  I highly recommend PDQ!  PS - Pretty Dang Quick (PDQ)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gxlxakxEgvE1PYMRvPYgHQ"
  },
  "XvO0ZkyJBEqWv754OBLL0Q": {
    "date": "10/18/2018",
    "text": "I love this restaurant. They used to have a location on Sahara but closed it. Everything is fresh and made to order. I've tried almost everything on the menu and love it all. Zucchini fries, fresh chicken sandwich's, amazing salads, homemade dressings and dips. It's all good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3RTzlGZCSRRsHKjKamCw0g"
  },
  "cvqJjBW5gZS3W6ZM_mcFjg": {
    "date": "8/2/2017",
    "text": "PDQ is a great staple out in North Las Vegas. Great chicken, perfectly crispy fries and a plethora of sauces. It's nice having a place out here that does chicken really well AND has multiple sauce options. Did I mention they have a lot of sauces from which to choose???  My boyfriend and I both got the crispy strip combos and 7 difference sauces to try and it was fun trying the different ones with the fries and chicken, get as many as you can to try! I really like mixing the ranch with the buffalo blue, my bf likes the honey mustard and we also like the blueberry ginger one but think it would be better with the grilled chicken (may have been a seasonal sauce as i don't see it on the website.)  How many times can I mention the word sauce in a single review? Sauce.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8W5UIJUnmAFssdAxg9YN_g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8W5UIJUnmAFssdAxg9YN_g/o.jpg"
      }
    ],
    "user_id": "yfiCKqdrk_i9Pa7ochyWtg"
  },
  "XWEMjv2-3kHINFurSOfGFw": {
    "date": "1/20/2019",
    "text": "Haven't been here in awhile, chicken is good, however it tastes like they went to frozen fries. They used to be fresh cut and pretty close to in n outs fries... such a shame they switched...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aHsIQ5yE-_I-vaBML5ustw"
  },
  "3hCB4gWoQPsgTJTClaxgCw": {
    "date": "6/6/2015",
    "text": "This is one of my families favorite place to go. The chicken is amazing. I'm in live with the fries and milkshakes. My family and I prefer PDQ over Canes anyday, out of everything in comparison we miss the bread, but everything is so great we hardly notice.  The service is amazing! Our food was ready almost right after we order. Josh was a great DRA, he was very sweet and made sure everyone was getting what they want/needed.  Overall we love this place and recommend it to everyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njFf0YYm6S40s3ap0RlA5A"
  },
  "Qjw4ex0jCwisMpbv6V3TqA": {
    "date": "3/8/2016",
    "text": "Stopped here last night for Military Monday discount.. It was the first time our family had been here even though we live so close. I will have to say I was impressed with the food and service we received. We all got the tender meals and were impressed with the taste and quality. The tenders are lightly breaded and juicy... The variety of sauces offered appeals to any taste bud. We will definitely be coming back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4q7Mz4zl6uo6DokY6vMVOA"
  },
  "SiSNcZ7ubyE3IGPtVKAXcA": {
    "date": "2/6/2016",
    "text": "I finally got to stop by after working in NLV. After reading reviews I wanted to try! This place does chicken tenders, chicken sandwiches and salads. I got the Cali chicken club. I know that I was hungry, but it was one of the best chicken sandwiches I ever had! Bacon lettuce tomato avocado , but the brioche bun made it! I also tried the blueberry coleslaw , so good!! They at first gave me apples and toffee dip by mistake, I went to take it back, and they let me try it. It was delicious . Great place, service and staff . Go try it! Now I hear there's one on the west side.  And of course there is a coke freestyle",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ESBXYiZQJcXNNAvRki-IiQ"
  },
  "2ObOTexgFU0mQWUEGNZ0RQ": {
    "date": "7/13/2016",
    "text": "I don't often leave reviews. But, I have never been so satisfied trying a new place. We popped in after a busy day of hauling junk. (In 100 degree weather). We were greeted, and the menu was explained to us thoroughly. They answered a few dumb questions, cheerfully. Let us taste a dressing. Food was  quick and amazing. They even brought out a few chicken tenders to try, because we ordered salads.  I found a new lunch spot, which is a tough task.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PaxPGfdcvGgWqVy3LPtBcQ"
  },
  "5PiuV1yhbxe-emkD634_Nw": {
    "date": "9/21/2015",
    "text": "However I enjoy variety when it comes to quick and easy I am unsure of pdq. The chicken sandwich wasnt bad. Wasnt great. You get a monster amount of fries which are shoe string style. Idk not my favorite. The kids meal options are great. And super affordable. Everything is super affordable. Service was quick and easy. Maybe I just need to go back and try it a 2nd time. It definitely is something to check out if your in the area looking for some thing quick.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xTuARYZMQ95v5PIpCdwITw"
  },
  "UouxQ8zHeBn9qdTAGRs7FQ": {
    "date": "2/12/2016",
    "text": "This place is super clean. The staff is so nice and the food is great! It's not greasy or overly breaded. I love the apples with toffee sauce too. You could put that toffee on anything and it would be amazing. The sauces are delicious. My personal favs so far are the sweet heat and creamy garlic. I've tried the chicken tenders and grilled turkey sandwich, both had great flavor and served hot and fresh! I definitely recommend trying this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kP7FbFoBRW6gsoAoTDytKQ"
  },
  "_yUKnK_fKiNFSShzT7IguQ": {
    "date": "11/22/2016",
    "text": "Soooo yummy! The chicken is very fresh and the sauces they have are tasty! I like it more than canes it is much cleaner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3NFNY2w66aMG-P6Lv-fsg"
  },
  "2RKuet6ceIwz9ZyFiZqOHg": {
    "date": "3/22/2015",
    "text": "This will be one of our new regulars!! Healthier options for a \"fast food\" restaurant plus the good ol'fashion fries and shakes. Hands down one of the best customer service experiences we've had at a restaurant in years, even $100 plus dinners. Free refills on homemade lemonade and unlimited dipping sauces. Better than raising canes with numerous sauce options, other options than just chicken tenders, and sweet tea! Corn hole game out front and even gave my daughter a free kids tee! So awesome! Will continue to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TAAgJyeugfWuFIolY6ABmw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TAAgJyeugfWuFIolY6ABmw/o.jpg"
      }
    ],
    "user_id": "6-SSjt6qm7zTFRcxZVWP9Q"
  },
  "JdzgzuliuASK28IPk6exOQ": {
    "date": "3/19/2015",
    "text": "PDQ  is a lovely family restaurant!  Their people were definitely dedicated to quality. Our orders were filled fast! The  chicken strips were delicious and the sauces were homemade and delicious! My favorites are bbq and sweet heat.   I believe they are the only restaurant here to serve the popular Canadian  soda Cheerwine!!  It has a fresh open floor plan with flat screens and the men have sinks in the stall, my husband says!  Wendy and Andrew came by the table regularly to ensure we were having a superior experience! We will go there regularly! !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bj5eSuXpIei0gtO2efcg4Q"
  },
  "8Jx92HV4E3HooGCpWOeE_A": {
    "date": "10/26/2015",
    "text": "This place is GREAT! I was so surprised and impressed by the food here. And you can try ALL OF THE SAUCES! As many as you want for free. They were all very good. The staff was also very friendly. I will be a repeat customer for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tRZBRXuLj7-BRtRZolDHtw"
  },
  "aceJI00Uh_hpQcrksnOyfw": {
    "date": "6/7/2016",
    "text": "Me and my family come here at least once a week!! We always get the best service and fresh food!! The managers Robert and Miguel are outstanding managers and they always make us feel so welcome every time we come in!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdJpQWPvgzv3dI7oWmsedw"
  },
  "ehzeKZ1xeMEjp1TIEFq86A": {
    "date": "6/30/2015",
    "text": "NO! The food isn't worth the money to me. It's not seasoned , the fries are awful. It's best to drive down Craig to RAISING CANES. !!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9KiNtZLO9Ay4s0Yt59Ompg"
  },
  "1lu3OVTbRjHSh8mymQ5YkA": {
    "date": "5/3/2015",
    "text": "PDQ is comparable to Raising Cane's being that they both have a menu built around chicken fingers and they are made fresh and not frozen. Chick-fil-A serves freshly made chicken too but can't be compared to PDQ as far as flavor goes among many other things. Chick-fil-A tastes much better. The chicken fingers I had here were not bad but they weren't crispy like the menu described them to be and they were soggy and mushy. I got my order for take out so it's possible that the chicken sits in a steam bath when packed for take out until you are ready to eat it and that maybe makes them soggy? I am not sure but I've had them a couple times now and they were not crispy. Shakes are 50% off from 3 pm to 5 pm. I had a peanut butter pretzel shake and it was very good! I'd come back for their shakes no problem. The workers were friendly and upbeat and they also have sandwiches and salads on the menu.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "3_7k2utJ-mlW9_brZfRJmg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. lemonade",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3_7k2utJ-mlW9_brZfRJmg/o.jpg"
      },
      {
        "img_id": "G5whYMyALWNf8zsoji-abg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. hand washing station",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G5whYMyALWNf8zsoji-abg/o.jpg"
      },
      {
        "img_id": "poEKdTV-KFjgTWr804Q13Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. they have freestyle machines sadly...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/poEKdTV-KFjgTWr804Q13Q/o.jpg"
      }
    ],
    "user_id": "eytpwJXgg5nWU6jrlQ6qAA"
  },
  "GDXQrr3HPQoIl1mIMa3HUg": {
    "date": "5/18/2017",
    "text": "The crispy chicken sandwich is really good, not a big fan of the fries though. But I love the sandwich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CL2Zdl7Uynf4h7QwxMNkuQ"
  },
  "_gWAa4aUmizf3SE7ofFU8A": {
    "date": "3/18/2017",
    "text": "Loved this place. The manager was awesome. We told him it was our first time there so he kept bringing us things to try.  We like chick fil a and canes but PDQ has there own twist which makes it different and super yummy. We will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X88gasaCIguth8alL6yh3Q"
  },
  "l848ByFfZpWc8b83gZyFTw": {
    "date": "6/26/2015",
    "text": "I wasn't that impressed with PDQ maybe it was because I was comparing it to Raising Canes but the tenders lacked seasoning. Something about the honey mustard tasted weird to me so I let me son taste it and he said the same. I will try to give it another chance as I saw they have a turkey cutlet sandwich on the menu. The peanut butter cookies were delicious as well as my drink. I won't count them out because they do honor our military with a Military Monday deal of 50% off. This in itself earns it another try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9V6k0kDdvJoEn5jCpJprfg"
  },
  "IE-zCcjkbLlogmWTRz_IzQ": {
    "date": "7/16/2015",
    "text": "Very friendly staff, awesome food! The fries are yummy and the crispy chicken is fried just right don't forget the buffalo sauce Love it :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UGCYEI595FxT5zsXg333TQ"
  },
  "BFh-8ziP1yrkWdVk1AiwCw": {
    "date": "11/2/2015",
    "text": "Excellent Service: Check Excellent Food: Check Clean Restaurant: Check  PDQ out Chick-Fil-As Chick-Fil-A.  Customer service is an art, and these guys nail it. From the unused umbrellas at the doors (although if it raining I have seen them escort diners to their car), to the prompt and polite interactions with the staff PDQ is firing on all cylinders.  Once my order, which was ready before I finished my transaction, was wrong and PDQ fixed it in seconds without question, and even offered up double apples when I declined the toffee dip due to allergies (I guess not too many people order apple slices with kids meals).  So if you are in the NW, and are craving good food and good service, stop off at PDQ and eat lunch with these guys.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yScJQXKTwRkp0TCQ_gRUWA"
  },
  "htAn990xwnzNaVLiosYCWw": {
    "date": "1/31/2016",
    "text": "A. Ma. Zing.. Every time I go here it's amazing and fresh. I always get the crispy turkey sandwich with the blueberry coleslaw. Top 5 best things I've ever eaten.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QVOcho6ucQaMzeYjR8kh1Q"
  },
  "CGxfqCtWz6g8LG0lPHgu8w": {
    "date": "5/18/2015",
    "text": "There blueberry cold slaw was amazing but there grilled chicken Cesar feel so short my tung felt like it was violated my husband had the fingers and fries he said fries good but chicken could youse some help maybe they should go try canes!!!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AACHu95AQhSGyszjHx3vCA"
  },
  "PSFvKKwfQNr5cj9ZVnOwwA": {
    "date": "3/23/2015",
    "text": "Had the 5 finger meal 9.49 a tad spendy but they were good not the biggest fingers but they did the job the star of the show for me was the sauces canes is bomb but you only get the 1 sauce n can spice it up with hotsauce which is a must but here you have plenty of choices and the creamy garlic was the bomb but the Buffalo blue was off the chart they have salads and sandwiches the wife loved her buffalo sandwich fries were good the milkshake was awesome oh ya and you can play korn hole outside lol anyways all in all a tad pricey but good heard Monday 5 to close the 5 finger meal is 5 bucks so that would be well worth it ... Will def be going back !!! Clean and great customer service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YACM7eUQifGH_Y0Bcd73vw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. 5 fingers creamy garlic and buffalo blue nummerz",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YACM7eUQifGH_Y0Bcd73vw/o.jpg"
      }
    ],
    "user_id": "ot5XMULeujG5p8kvqg8vCg"
  },
  "vM8fO_nfJSuNbLuKz2U4fQ": {
    "date": "3/20/2015",
    "text": "Service was very quick and friendly.  Ordered for dinner, dining in 3 grilled chicken tenders meal with blueberry coleslaw and drink.  Nice family oriented atmosphere with a comfortable interior.  There are huge flat screen tvs to look at while seated.  The chipotle BBQ sauce had a distinct flavor very tangy.  Overall, had a positive dining experience here and would come back to try more from menu again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P6AwpqvXJx1ITsq2NKPgyQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Small drink",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P6AwpqvXJx1ITsq2NKPgyQ/o.jpg"
      },
      {
        "img_id": "i17scJXFr0OSc537GytgDQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Grilled chicken tenders with chipotle bbq sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i17scJXFr0OSc537GytgDQ/o.jpg"
      },
      {
        "img_id": "UGftVWA-Qa-uY2mo7NIXQA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Blueberry coleslaw",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UGftVWA-Qa-uY2mo7NIXQA/o.jpg"
      }
    ],
    "user_id": "CkqT3yGUeM_9vSbFES_O5w"
  },
  "oJYZHAIS-gxOdnom8sY7KA": {
    "date": "9/20/2016",
    "text": "Ordered the honey butter sandwhich and the chicken was very dark. Tasted like the oil was old or burned. Same with the fries, tasted old and burnee. Disappointed because I was told this place was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QZoepmoHeRK0Lb6S8R51eA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Soggy fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QZoepmoHeRK0Lb6S8R51eA/o.jpg"
      }
    ],
    "user_id": "WcMnK1Tn-Kx1iDt8qmU5SA"
  },
  "FYMzVJNW7PetA212exyl1A": {
    "date": "3/15/2015",
    "text": "In a nutshell, I still love Raising Cane's chicken tenders more.  However, PDQ does care about \"homemade\" and fresh items.  Love their Coke 100 machines, as well as unsweetened Regular and Green Teas (Sweet Tea available also).  You can purchase Lemonade and bottled Cheerwine.  Sign up for coupons at <a href=\"/redir?url=http%3A%2F%2Fwww.eatPDQ.com&s=16dbed41f8054467df72a2c275bcdced7e891146e942cd6c79ee2f3c8a9c8111\" target=\"_blank\" rel=\"nofollow\">eatPDQ.com</a> and follow them on social media.  Also, there are certain specials available, such as the $1 mint shakes on March 17th (St. Patrick's Day) or the Monday Madness Meal - 3 piece tender meal from 5 p.m. to 10 p.m. for $5 every Monday in March  PDQ also caters.  The food is freshly made, but I feel the tenders don't have as much flavor as Raising Cane.  I love the blueberry coleslaw.  Will need to try the salad next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPhk0TD-eT4DSYjHmMuvTQ"
  },
  "eYcV8QCrKDPJ2cDM2EDBJg": {
    "date": "9/13/2016",
    "text": "The food is perfect and the staff is the best.  If you love chicken go here. If you love friendly staff go here. The place is always super clean and my husband thinks it's better than Canes!! Tonight randomly the manager gave the kids free shakes and let them make them!!!!! Go here :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpuP-y7ffSa_EsQV0VyduA"
  },
  "gAYEmJXYn_j_dEVwkvrnkg": {
    "date": "4/25/2016",
    "text": "I was very surprised at the wonderful quality of this \"Fast Food\" restaurant.  All employees were very friendly and the chicken was excellent.  Great dipping sauces too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FTPe7VVwGDM8j9csFhShWA"
  },
  "KOwzvbaBN-1gCW2DLduFsg": {
    "date": "9/3/2016",
    "text": "First time here we had the chicken breast sandwich that the chef order for me and also 4 orders  chicken tenders with 5 people all together the food was good service was facility very clean we will come back again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DI0P1F8W0sOJElK-Z1Y7aA"
  },
  "85Ri6FmB1rxvZmnmqPcQuQ": {
    "date": "5/28/2015",
    "text": "First off there service is fast and friendly, if your dining in there always someone walking around the dining area checking on customers they are able to grab you any extra dipping sauces, extra napkins, or even a drink refill if there not to busy. There service is impressive especially because there a fast food joint.  As far as there food I can only speak on what I've had there so far and I've been to PDQ four times in two weeks and I'm hooked on there grilled chicken strips. The grilled strips are seasoned so well I hardly dip them in the dressing. The French fries are good but I prefer the apple slices and not because the apples are amazing it's because there toffee dipping sauce that comes with the apples is straight up addicting.    If I have any suggestions for PDQ it would be toward the lack of consistency with there sweet tea/ lemonade. The sweet tea is hardly sweet at times and the lemonade can be a bit too sour for the kids.   Either than that I'm a huge fan of PDQ it's a much better alternative to many fast food joints for busy families like my own. In reference to some other chicken finger spots here in vegas I'd say PDQ takes it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_BJLAya0SVqeg1rgRwo5g"
  },
  "J_BKn-8BjcaJhxxJEDgLuQ": {
    "date": "3/21/2015",
    "text": "I went here mainly because I'm not a fan of the bland, tasteless chicken and disgusting sauce at Raising Cane's, and sure enough PDQ actually had good food.  The breading on the chicken is nice and crispy and the homemade ranch had a bit of spiciness that I enjoyed. The fries are also quite good. Even though they were really busy service was friendly and incredibly fast.  Looking forward to making this my go to place when I'm in the mood for chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQHALW3lLovKRXhHPEq00g"
  },
  "rdWJtn_sxyCAeLctZh0ppw": {
    "date": "4/9/2016",
    "text": "Best chicken spot in Las Vegas. Tried it for the first time recently and it was delicious. Definitely a great alternative to no Chik-Fil-A here. I got their crispy chicken sandwich and it was great. Good amount of veges, tasty bun, and actual crispy chicken. Love this spot and I definitely recommend it to everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PdI7QY_7Ennk465tQbRLJg"
  },
  "rDXMjrJCb_MP5vOYLIE5SQ": {
    "date": "8/8/2016",
    "text": "Let me start by saying what great customer service they have. All employees seem to enjoy serving you with a smile.Everything is so fresh and good. My favorites are there grilled chicken salad w/blueberry vinegarette and their fresh zucchini fries w/ sweet surrachi dipping sauce. Glad there's a healthy alternative for quick delicious food close by:-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lbcTFGtEHPvZhVxowxHBg"
  },
  "UXCYsoxFmSkemNks66mlAg": {
    "date": "1/27/2016",
    "text": "The tenders were good, the fries not so much. Raising Canes gives for a extra strip, the fries are better and Canes costs less. Canes is a better value.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gz22jzQ7lGDHDW5znYQvEQ"
  },
  "gOKaT3TGVdyE9yvxUnTAXA": {
    "date": "9/24/2015",
    "text": "I love this place. I love the management team and how engaged they are with each person walking in. No matter what time you come in they always acknowledge you. Staff is very friendly. Restaurant is always clean including the restrooms and food is of great quality.Great job managing the crew Miguel.  I enjoy their food and endless dressing yum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGmq38Jyrhm7RmN7M0d1bA"
  },
  "iS8pOg9iAON-3qdC3P7rwQ": {
    "date": "5/15/2016",
    "text": "I tried their salads for the first time and they are pretty good, I get it with the fried chicken, the only thing that's  missing is a boiled egg.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lX_j1NZA0xpJ9E1tu7SsIQ"
  },
  "TTEPIuRXeGgdVQPS1yoBVQ": {
    "date": "4/17/2017",
    "text": "found this place because my kids and wife get hungry at weird times and this was the next right turn. the food was good and came out quick will be back if im ever in the N LV area again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iMZuaVxBeTSo_H2_8uUusQ"
  },
  "BWiAh1bTAlrdnOSGdFV3GA": {
    "date": "8/29/2016",
    "text": "First time for husband and I .Small menu . But very fast service food was also great.. thanks PDQ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooTkcqt-7IDpY0YN6EF58Q"
  },
  "1ZXXoxfNiwtO8kzlNkqakQ": {
    "date": "8/27/2016",
    "text": "This place is great. I had the crispy chicken meal with fries. The chicken wasn't greasy and the ice tea is perfect. My only gripe was the fries. There pretty horrible. Everything is fresh and made to order but my favorite part is that you don't have to order into a little box. You get to speak to a real live person in the window. I'll definitely be back just hold the fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uNWKhrVOlzUoqaZWGacs1w"
  },
  "UZY2lkDd4lW3o8eII24OhA": {
    "date": "4/13/2015",
    "text": "Been here quite a few times. Chickens so good even my kids like the bread less tenders. Great service. Quick service. My family likes this and it's great for a quick meal and you don't feel gross after.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e7bT3qjb3oFIoQkiBb4Nhw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Done",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e7bT3qjb3oFIoQkiBb4Nhw/o.jpg"
      }
    ],
    "user_id": "F91RFtoZpgORgz5gVxP3hA"
  },
  "583HfADTImcghPdHQfFHSA": {
    "date": "4/13/2015",
    "text": "Tenders are good, with a good selection of sauces. Fries are excellent, but don't travel well. Real fries not formed guck. Chicken and turkey sandwiches are excellent, and rank with the chik. The standouts are the drinks! Coke everything machine like 5 guys + add cheerwine abd hand spun shakes! I hate yelp snobs who rate everything against Joel Robuchon! It's 5 star fast food, not Michelin stars yelp stars. Get over yourself",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mu_V2VkgKcg7-rU0W3Iczw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mu_V2VkgKcg7-rU0W3Iczw/o.jpg"
      }
    ],
    "user_id": "5y6otJ_lfwY4oSEh1hqC8A"
  },
  "8tzEXP9r7lU70ZoXIXVXfg": {
    "date": "5/1/2016",
    "text": "One of my favorite places to eat. I come here pretty regularly. The service is fantastic and the employees are extremely friendly. Plus the food is great. The buns for the sandwiches really make them stand out. I love their milkshakes, and I look forward to trying each seasonal flavor. I'm not a big fan of there fries but the side of apples are outstanding with the dip that comes with them. I highly suggest trying them. All this and your food comes incredibly quick. They take fast food to a new level.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9ZUG1tXBQ-mvmyRiJKSMQ"
  },
  "QdVSsJfb9AF3bIIk3MIUAQ": {
    "date": "10/26/2018",
    "text": "Ok I'm not a fan of fast food ... But after here, I could change my mind  I had never been here, never even heard of this place, but my first impression was way better than expected.  I had the chicken queso bowl and it was fresh and tasty.   I also was there at happy hour, so on the way out I ordered a heathbar shake to go.  Outstanding!   I'm glad I came and checked this place out.  The service was good and so was the food.  Plus plus from me",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "zmFRHyeRAGagONM5hyVWeg"
  },
  "Si4CtYHSJat9BtemmVJegg": {
    "date": "3/2/2018",
    "text": "One of the best fast food spots in town! Service is lightning speed and food comes out minutes after ordering. Food is always fresh and piping hot. I usually get the 5 piece tender meal w/ creamy garlic dipping sauce. Mmmmm, so good!   You can order your chicken crispy or grilled, and they also have chicken sandwiches and salads. Get the new Greek salad! It's better than most Greek restaurants! Just sad they no longer sell their blueberry cole slaw!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "eFz0gDtSpvqjYT-ePRjzzg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Zucchini fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eFz0gDtSpvqjYT-ePRjzzg/o.jpg"
      },
      {
        "img_id": "8fKJxpQyuFFkPObNv6cKiw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Totchos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8fKJxpQyuFFkPObNv6cKiw/o.jpg"
      },
      {
        "img_id": "n5S5X6ZQy3aLESMeH9FZHg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Zucchini fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n5S5X6ZQy3aLESMeH9FZHg/o.jpg"
      }
    ],
    "user_id": "zBi_JWB5uUdVuz3JLoAxGQ"
  },
  "mAgnSMzd-Nxt4_GvD-2wiA": {
    "date": "6/19/2019",
    "text": "First time here had never heard of it. The place is clean and welcoming. The cashier was extremely helpful and pointed out some the employee favorites and most ordered. I ordered the chicken sandwich and zucchini fries. The food was served quickly. I was pleasantly surprised by the quality of all the ingredients. Everything was fresh. The manager surprised us with a complementary order of chicken tenders. The best chicken tenders I've ever had. Overall this is a great place to eat. It's affordable. I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQVEr0nDe__tOLNtbbnRmA"
  },
  "ZuEqHrgU0eoOue6Dlew0fw": {
    "date": "6/18/2019",
    "text": "I wish this place was closer to me; the food is excellent.   I like their buffalo blue and creamy garlic sauce on the tenders.  The tenders were exactly that tender and juicy.  Definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1O3FS7DLNEE-yxvY_e8ulA"
  },
  "6zFUy9I43E1UTGJRBZttug": {
    "date": "6/11/2019",
    "text": "This place is alright. The food is fresh, the establishment is clean. This place isn't as good as chick-fil-a but I would say its better than raising canes. Overall, I would go there again and probably try something other then the chicken tenders. (I might have felt differently about the taste of the chicken tenders if I liked either of their sauces I tried, honey bbq and honey mustard).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7jrhS2KtnpBfewdn1mNFzw"
  },
  "m5S_JLgKwuspz40AYo6Ytg": {
    "date": "6/14/2019",
    "text": "This place is great! Great salads and they make their own dressings! Yum yum yum love the honey mustard! The chicken sandwiches are similar to chik-fil-A with the honey mustard sauce on a butter roll! They have great cheeseburgers and rice bowls. The cheddar tots with bacon oh dear! Very Good! A variety of everything and great flavor. Friendly staff. Good job PDQ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qCA53woIp4L4F_xIUrWRIA"
  },
  "JzLfLd_oiTxvuD2TpkzCEQ": {
    "date": "2/11/2019",
    "text": "We always comes here with our family either it is to go or to eat here at the restaurant we encounter Nancy I believe she is a supervisor/chef/manager I must say our experience each time we here is always been EXCELLENT! Restaurant always clean all staffing always nice and polite. Thank you PDQ for providing fresh food (chicken tender, fries, zucchini fries and etc) and all the delicious sauces option (in love with the thai peanut is my favorite) but the rest are delicious as well. Our kids enjoyed the variety drinks option and huge sitting area :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9kElsBhkHl-EzJo2gIZv2w"
  },
  "uvOwjOqhZP-q-btknplNGQ": {
    "date": "6/30/2019",
    "text": "Good quality chicken tenders and nuggets I'll be back for sure. Food came out quick and the service was great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ElQ-_gZYXRNXzpkY6h5qUg"
  },
  "sMMzQzQQlkSvoXbHse6NzQ": {
    "date": "11/17/2017",
    "text": "PDQ or as I like to call it, the poor mans Chick-Fil-A. It'll hold you over if you're craving chicken strips and nothing else. Because the sides aren't worth the calories. Either bland or soggy. You're better off going to Canes. I tried their Cheerwine to see what the fuss was all about. Too sweet for me. I wasn't really a fan. I usually measure fast food joints by my kids enthusiasm to revisit. They haven't mentioned it once. Then again, they don't like CFA or Canes either. Weirdos, lol.   Customer service is great so kudos for that. If you pull up to the drive-thru with your doggo they'll give em' a treat. I think that's a nice touch.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "SAWkTZbP79ildfrDsiqUrQ"
  },
  "WRuiEeYmmq6CQNL8aNe3AQ": {
    "date": "8/3/2018",
    "text": "Really yummy fresh chicken. It's probably the most juiciest chicken I've ever tried and the fact that it came from a semi fast food restaurant that serves fresh food. That's awesome. You can taste the difference between this chicken and other fast food places. Gives me kinda of a California Chicken cafe vibe, but with fried chicken lol best way I can describe it. We tried the most basic thing, their chicken nuggets and also their zucchini fries. They were good, wasn't a big fan of their fries. They  were just really floppy and looked kinda dead.   I still think I might like chick filets nuggets better. But the fact that this place is all fresh everything, including their sauces is pretty amazing. Definitely will try something different next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vjg408Bj89cHO60ez9Riqg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Fries were kinda old and wimpy looking.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vjg408Bj89cHO60ez9Riqg/o.jpg"
      },
      {
        "img_id": "7mtzN9IdpjGakl-skkd2qw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Chicken nuggets and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7mtzN9IdpjGakl-skkd2qw/o.jpg"
      }
    ],
    "user_id": "VDsnV9Xc-akVbJC0hVtAQw"
  },
  "AWIwgxaYlnOIRvfZg744xw": {
    "date": "1/10/2019",
    "text": "This place is friendly & fresh!  I can not believe there are not more around town.  PLEASE put one in Henderson!!!  I have to travel too far to this one. BUT ITS WORTH IT!!!! Yummy food and management is doing a great job!  A guy name Hector came around to each table to make sure everything was perfect for his guests! LOVE the hand washing station out in the open for everyone to use.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g0LQ3Mzp5jup5w1_UcSKeA"
  },
  "vluRJ-JNANp1wiSh-sduLA": {
    "date": "6/24/2019",
    "text": "This restaurant is amazing I've been wanting to place my review for a long time now since my whole family have been costumers for a while and still don't get tiered of eating here... It's clean and everyone is friendly... If your looking for healthy fast food this is the best place to go. You can change your French fries to zucchini fries or broccoli. You can go from crispy to grilled or get something different every time and you won't get tiered of it... You can just choose regular and it still beats many fast foods out there... I'm lucky to live near it, because there's only one in Vegas... It's great Thanks PDQ!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSu4ggRzVyQUG-wHvzJAlA"
  },
  "fYuGzPzeZMhx6cDJgly2tw": {
    "date": "10/14/2017",
    "text": "Updated review. PDQ is still awesome! I went there the other night because I didn't feel like cooking and was feeling extra hungry haha! So I decided to try some things that are out of my normal order.   I went with the bacon cheese burger and an order of 12 nuggets. Delicious! Honestly their burgers are really tasty. Since they are a chicken themed place I would never order outside the specialty but thought I'd try it and so happy i did! They have some of the best burgers in my neighborhood. Plus they use potato bread buns which are my favorite and elevates the taste. The burger was cooked to perfection and I very much enjoyed it.   They seriously have the best chicken nuggets. It's like giant deep fried goodness! OMG why have I never ordered those before...?!? The order of 12 fed me,  my mom, plus each of my dogs split one hahah. They are crispy, juicy, and so satisfying.   I also got my usual order of zucchini fries because who can go there and not get those?!?   Once again you have one satisfied and FULL happy PDQ customer. Also, I would like thank the staff who works there. I hope corporate DOES read this review because you should know the staff is excellent. I've never been to any fast food restaurant that has a staff who actually looks like they are enjoying their job, greet you with a friendly genuine smile, and leave you with a happy experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kkzLDEVtGy36TRVDAvnFow",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kkzLDEVtGy36TRVDAvnFow/o.jpg"
      },
      {
        "img_id": "W7q5XeQNvITgwjVe9fZ6sQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W7q5XeQNvITgwjVe9fZ6sQ/o.jpg"
      },
      {
        "img_id": "dhYfA0I8woE2oIzJ-gF6KQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Those golden delicious zucchini fires I can&amp;#39;t stop eating",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dhYfA0I8woE2oIzJ-gF6KQ/o.jpg"
      }
    ],
    "user_id": "jgaEUrQtOnLwbm05zyoA0w"
  },
  "ldg_pDONSqCEKxvrZ-fr3g": {
    "date": "11/21/2018",
    "text": "After a long week crammed into 3 days I didn't feel like cooking.  I had a coupon for PDQ and had never been there. I told the cashier at the ordering window (personal service) and she helped me get an order together.   Kim was waiting at the pick up window.  She customized my son's drink, got us the sauces we wanted for free, and extra ketchup. Big smile the whole time.  Wished us a Happy Thanksgiving for tomorrow.   We got home and oh YUM!  That chicken is better than ANY \"fast food\" or \"drive through\" chicken.  We will definitely be returning for the customer service and the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "ks-THNW260klKVtl4-BQVQ"
  },
  "9avTeFDs_kJrL4GeTEefWw": {
    "date": "4/21/2019",
    "text": "Friendly fast service great customer service my food not so great the totchos get a A plus it's not a good sign if the totchos are better then the chicken and the sauces weren't that great either sorry but raising canes is way better !!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xicUMsPDgWiJmkyGL8xPeQ"
  },
  "ftBjGYwoEbzGhVZ-5kOXdg": {
    "date": "12/7/2018",
    "text": "Great customer service, friendly staff and fast! Only thing, I should've checked our food before we left. Kids meal had tater tots instead of the fries that were requested. And the nuggets in both the 12 piece and the kids meal were extremely dark and tasted like old/burnt oil. :-(. Haven't been to this place in over a year but the food used to ALWAYS be fresh and really good. The Cali club chicken sandwiches and fries were ok. Not sure if we'll be going back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4nLitqUhFs2Z7vldh9Kf8Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4nLitqUhFs2Z7vldh9Kf8Q/o.jpg"
      },
      {
        "img_id": "uXAJnEwAZ6TisVTQhNN1uw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uXAJnEwAZ6TisVTQhNN1uw/o.jpg"
      }
    ],
    "user_id": "vCmelO7PhXpjIrQFBnFJEA"
  },
  "89t4_1M2cmS6QhtunPjS_A": {
    "date": "3/19/2018",
    "text": "My new Fave place in Las Vegas For Lunch!   This restaurant makes all chicken related items.  (Tenders, sandwiches, bowls, etc.)  The only CON so far is if you order fries, eat them fast because within 10 min, they get soggy.   Chicken is fresh and crispy (if crispy is what you ordered).  Great customer Service and sauces are endless, no extra charge.  Prices are fair as well.  I'm excited to return and try one of their bowls.   Sweetened tea and strawberry lemonade are really good!!   Parking, drive thru & dine in options are available.  Definitely returning!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q3BAelrqVR1NKz790YjHvg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Tenders and chicken sandwiches are placed in a box which I think is cute and Unique.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q3BAelrqVR1NKz790YjHvg/o.jpg"
      },
      {
        "img_id": "N373S2qcUOLHytJcL7-s9Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crispy Chicken Sandwich with Pepper Jack cheese added for 75 Cents.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N373S2qcUOLHytJcL7-s9Q/o.jpg"
      }
    ],
    "user_id": "zwKLl0R9twRbZyU-i52Wbg"
  },
  "G3uVvWlmzl9WUkIkByF5vA": {
    "date": "5/15/2019",
    "text": "I sent a personal message to PDQ as requested 14 days ago as requested but she still hasn't replied?!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jL6P7XfpMLX9OhSNIcdkPQ"
  },
  "0lUvsBtsSxIVe70E6HeTxQ": {
    "date": "8/21/2018",
    "text": "We love PDQ, Their honey nuggets are soo delicious. It's a little pricy but it's real whole pieces of chicken. You can't beat the price for the freshness . Customer service is okay. Not the best I've had but it wasn't bad at all. Nothing to complain about here. Hopefully they can open more locations soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8CaRLV7T47Uff0GWuAcdiQ"
  },
  "zs6JMy0ZlkLCWTcTiAP78g": {
    "date": "3/17/2018",
    "text": "I am super super picky when it comes to chicken. This place is soooo good, it was way better than I thought it would be. I had the grilled chicken salad, and the chicken was so tender. My mom had the crispy chicken sandwich, which she said was the best chicken sandwich she has had in a while. The sauces are good, and the bread tastes great too. We also tried a shake and cookie, which were just as good. I will definitely be back! I live super far, but will travel just to eat here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EKj2dl1fwAZS41O60da6xw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EKj2dl1fwAZS41O60da6xw/o.jpg"
      },
      {
        "img_id": "A1B1Urt9QEaWKM7o3XfQ0g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A1B1Urt9QEaWKM7o3XfQ0g/o.jpg"
      }
    ],
    "user_id": "8oNbx_xxll_oNUh-x-s16g"
  },
  "EjGEa0mWC_nw4698A3PxyQ": {
    "date": "10/22/2016",
    "text": "Good chicken apple slices and toffee are a nice offering many choices of homemade dipping sauces people are always friendly and you never speak through a box when ordering at drive thru chicken is always (almost) hot and fries are hand cut and plenty of them",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-3lgdoz1NhW8OMUXwzcNoQ"
  },
  "Owg4FyA_QtjaswXWTw1rTw": {
    "date": "3/16/2015",
    "text": "I do think quality-wise PDQ beats Cane's. Plus, I enjoy the fact that PDQ has friend turkey sandwiches. The friend turkey was top quality.  I am hoping there would possibly be more turkey options down the road. Obviously this is oodles better than Farm Basket. Also, for a side I would hope for more options than french fries or blueberry cole slaw (which sounded awesome but not as tasty as I had hoped). Also, I am a huge fan of fruity shakes, and would prefer a 2nd option than strawberry - especially if PDQ prides itself on awesome shakes.  Pricing is ok. It is not overly expensive. I did take off one star because of a personal rule I have: If I am leaving a restaurant hungry, and spent more than $10 per person for a fast food place, then something is wrong. After eating at PDQ, we went to Costco and I ate something else there. Not that I need to feel like I ate at the Rio Buffet, but I was just as hungry when I left as I was before eating.  At least the food tasted good.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VZfIzNPiO_5eNkGNFSNZDw"
  },
  "v6h8tk61eX7R-OHaxYwFNw": {
    "date": "12/18/2017",
    "text": "Good food! I got the chicken strips and the chicken and sauces were really good - I liked it much better than Raising Canes - fries are also good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQaPCyVvoccRjZLdSi_vtA"
  },
  "zEvCtcVw4MrhS80NSkK2Nw": {
    "date": "3/16/2015",
    "text": "I know they just opened but with two people taking our drive thru order it should've been right, right? Nope. Both three piece meal boxes were marked as \"3\" but both only had TWO tenders... That were pretty small. We didn't discover it until we got home, hungry from the long wait. The tenders were eh, the bleu cheese and hungry mustard dressings were good. #GoCanes",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "L7ohS3WeDChARLlav_7kAA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. My Three Piece Meal...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L7ohS3WeDChARLlav_7kAA/o.jpg"
      }
    ],
    "user_id": "spFCVRROMn78BPJhEEhy2A"
  },
  "rIEfdE_MM6c7_2kwoZybHA": {
    "date": "4/5/2015",
    "text": "First time eating here.  Service was SSOOO fast!!  The staff is FRIENDLY, personable, very attentive, helpful and accommodating.  Let's talk about the food now...  um.. YUM!!  Good quality food.  Very fresh, flavorful and their portions sizes are huge!  Not to mention their prices are extremely affordable!!  Definitely coming back and trying to promote them (by my own will because they are that good).  I hope PDQ stays here for awhile because with food that delicious, it really should be shared with everyone!!  Good job PDQ!!  Btw..  I've never thought so highly of a place until PDQ.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8dWc9zNXPTyabMjm0oEasg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8dWc9zNXPTyabMjm0oEasg/o.jpg"
      }
    ],
    "user_id": "zFIUzG7MwsR7U5zt0C_gXw"
  },
  "MtHnqZcDU3P1mqDT1FzNWA": {
    "date": "2/6/2017",
    "text": "Today was me and my husband's first time at PDQ and it was an amazing experience here the service was immaculate almost no wait at all we had our food before we set down the food was hot and fresh as if it was made to order the sauces were amazing we had to pull the manager aside and tell him about our experience good job guys you gain a returning happy customer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5DxYU5K9vCiPqDiuXR_vw"
  },
  "kJVNLocIj20tB1ltQ9KNQw": {
    "date": "7/11/2016",
    "text": "Vero is my favorite worker at pdq! They have fast service and great food! 10 out of 10 would recommend !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNCvotBYN5ae2DrFCmCF8A"
  },
  "RrOdnID2rcK95_rJiM3bBw": {
    "date": "2/1/2017",
    "text": "Sucks! Raising Kane's blows this place off the map. The kitchen is open and right in your face. So you get to see just how unproductive their employees really are. The food while offering some different choices was just OK. I personally won't be back soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BBN3QIEVC5eMrH4vBRu9kA"
  },
  "8ASnIqNvzKB89GSQgq6S1g": {
    "date": "10/1/2015",
    "text": "I gotta give it 5 tbh... But it's not better then canes let's not get it twisted!!!! Pdq is good but skinnyfats restaurant chikadopilos chicken smokes pdq chick in out the water but im not dissing pdq just a different brand of chicken. And style of chicken too the staff and atmosphere is good... But at the end of the day it's till fast food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C08augVM4NANGnp1klfEJw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. So good so far",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C08augVM4NANGnp1klfEJw/o.jpg"
      }
    ],
    "user_id": "kEXwXvFLXRkijKQpKca_ew"
  },
  "8uN-2ickp1daWkgcHV5Aig": {
    "date": "10/27/2016",
    "text": "My wife and I ended up getting some crispy chicken tenders, zucchini fries, and the blue berry coleslaw. The food was very delicious. The tenders were just lightly breaded, crispy on the outside, and moist on the inside. The ranch dipping sauce was also very good and seemed to have a bit of additional seasoning in it. The employees were very attentive, even through the drive through. Will be eating here more frequently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JwDpPSPCjDwfUuYmbt_qew"
  },
  "1w63eoCkvDrOgcHuKTh4Fw": {
    "date": "7/24/2015",
    "text": "Lovely salad with crispy turkey!   It was delicious with Craisins almond slivers red cabbage lettuce!  The kids meal with one crispy and one grilled  chicken tender was gobbled up by my grandchildren!  Loved the yahoo with the kids meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ypG2Sn_7HNRCt9wNWg-jHw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. New favorite salad!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ypG2Sn_7HNRCt9wNWg-jHw/o.jpg"
      }
    ],
    "user_id": "lpOv0Whjogq1Ca-X55BpFg"
  },
  "s5_miwurTuv2zSdqcf1CjA": {
    "date": "11/19/2016",
    "text": "Love this place my kids love the chicken tenders and fries. The staff is always friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHMlcGFwVEcY92hF2d1HDw"
  },
  "cvlpndKktNQPrHEKzwg5kA": {
    "date": "6/10/2016",
    "text": "First timer. The homemade sauces are the best.  I absolutely loved the Blueberry Ginger sauce.  The Buffalo Bleu was a second runner up.  Excited to try the other sauces.  Clean and friendly atmosphere.  Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "teco1IJYfB-cKmCieyW47Q"
  },
  "EPB97SPD2XSeMqWhoV4ufA": {
    "date": "11/17/2017",
    "text": "Great food, super nice staff and very reasonable prices. The salads are amazing!! We were looking for a good take home salad, tried all the fast food restaurants with no extended success. PDQ was perfect, fresh foods, looks like cooked to order and good portions. Thank you!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rWWqs_R5VTNxYifwktv6A"
  },
  "vRmsLTLR2hrM71xEMMZxBQ": {
    "date": "11/13/2015",
    "text": "If you want fresh they have it. Great tasting chicken strips. The sauces are awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "naMmTNb4eodvHnCCA94zSA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Very clean!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/naMmTNb4eodvHnCCA94zSA/o.jpg"
      }
    ],
    "user_id": "UBcB2bSzeqQ1jccjPaDYkw"
  },
  "rsJAD-hHNJg5rzPalfZI-Q": {
    "date": "2/6/2017",
    "text": "I love going here!! I am very picky about chicken sandwhichs and they never disappoint! They have plenty of options of sides, the apples being my favorite and my kids always finish their food when we eat here! It's a win win!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fF2bbPBF6GV9kQ_oY5fZcw"
  },
  "KINjviPC_gZjgZuQmAeXNw": {
    "date": "4/1/2015",
    "text": "We love to try the new spots and could not wait to try the new PDQ. The place is airy, clean and welcoming. The counter person was happy to tell us about the menu and we decided on two 5 piece crispy chicken combos with fries.   My hubby was excited about the 100+ variety coke machine and was still selecting his drinks when our order was called out over the speaker. One of the many servers found us and brought our order to the table with a smile.   The strips were well seasoned and very generous in size. My favorite dipping sauces are the \"sweet heat\" and \"creamy garlic\". The fries are crisp with a good amount of season. Did I mention they have have sweet tea!!!!!! Perfect.   We ended with a Oreo shake for the hubby and the seasonal \"coffee/toffee\" shake for myself. My hubby remarked that the shake was full of flavor and well blended.   We have already visited again this week for a quick lunch and can't wait to go back.  The highlight\": I purchased some bottled \"cheerwine\" soda and the manager took my pic and stated I may end up on the Facebook site!!!! Great for families and a nice casual lunch. Welcome PDQ to Las Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1oT5WHTtujhJ0D5l8S_IQA"
  },
  "Qz0pjoFi3c0mxTjBIPH6qw": {
    "date": "3/30/2015",
    "text": "Best coleslaw ever! It isn't drowned in sauce but just right with the blueberries. Plus all the sauce choices and the fries rock and the staff is amazing.  The chicken tenders are great too.   The girl taking orders tonight was so sweet to my 9 year old who wanted to order his own food.   I think they hired the guy who announces your food is ready just for the voice.  And they have a cornhol game to play outside also.  It's an all around great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AIJ-9pcaqxtEuvmfRwuSMA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Chicken ceasers salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AIJ-9pcaqxtEuvmfRwuSMA/o.jpg"
      }
    ],
    "user_id": "_lUs8bCe-kXTVq5kRpvALg"
  },
  "vcUsLYLpWBZgnQ-QHR1_nw": {
    "date": "9/25/2016",
    "text": "As a former cane's regular, I can only say PDQ has better chicken, fries, sauces, and slaw.  Cane's still is better on sweet tea, but PDQ does have the 100+ soda option machine.  If you love Cane's, try PDQ and decide for yourself.  I did...bye Cane's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "13YJt09v9jjuYhW7UrLoXg"
  },
  "GFaHYHsKSLSVsC6zyczjcw": {
    "date": "6/20/2015",
    "text": "Absolutely one of my favorite places to eat!  Not only is the food always fresh and delicious, the staff members are amazing and friendly!  They always have a smile on their face, remember me,  and treat me like I'm their best customer.  I'm sad that some of the staff has changed,  but it does make way for new faces!  Keep up the great work!  My favorite sauce had become a mixture of creamy garlic,  sriracha, and regular buffalo mixed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aUJOmB54LRmsRqAS-ic27Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aUJOmB54LRmsRqAS-ic27Q/o.jpg"
      }
    ],
    "user_id": "r0rbHEB7kWJKhzweCOeyeQ"
  },
  "061IWwDJPbAa1_NSszvJUQ": {
    "date": "7/26/2019",
    "text": "PDQ is definitely my new quick service food crush!! Taylor and I have been twice in the past couple weeks and both times were great.  Before moving to LV, I didn't realize \"chicken restaurants\" were so popular; Chik-fil-a has recently made their CA expansion, but I had no idea there were a plethora of similar brands! PDQ is one of them, but offers a much bigger and better menu in my opinion. They have tenders, nuggets, sandwiches, salads, and even a burger!   Am I absolutely smitten with their zucchini fries!! They are thin sliced and breaded with a light seasoned batter that reminds of an Outback Bloomin' Onion. They can be a tad oily, but I just toss them around on a napkin and that helps a lot. I have been happy with my buffalo bleu sandwich and Tay has tried the Cali Club both times with good results. The fries are also top notch- thin and perfect crispy texture!   The restaurant is clean and comfortable. They have a really cool hand washing station with fancy soap to clean up before and after your meal! They also have a drive thru, but dine in service was very quick both times. I will be back many more times despite the inconvenient location. Please, PDQ, open one (or more) in central LV/Henderson!! Share your tasty offerings with the whole city!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 17,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "kpNIRI73lkBS9oQndYpEQA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Restaurant front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kpNIRI73lkBS9oQndYpEQA/o.jpg"
      },
      {
        "img_id": "PABQI5Xf5eouQioP0XW6OQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Cali club, buffalo sandwich, and zucchini fries!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PABQI5Xf5eouQioP0XW6OQ/o.jpg"
      },
      {
        "img_id": "GtLpOzoFHOk6g_xasHevjw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Best zucchini fries ever!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GtLpOzoFHOk6g_xasHevjw/o.jpg"
      }
    ],
    "user_id": "PVB0ggrspa1wWUECI7BN6w"
  },
  "HNi25i-twB68dCIgfpKuYw": {
    "date": "8/20/2019",
    "text": "This place is just ok. It's not overrated. The chicken is fresh but not crispy as you would think a deep-fried tender would be. The fries are mediocre. Not too salty but we will put it below McDonald's standard fries. The tater tots were not as crispy as you would want them to be. It's more of a soggy out of the oven texture.  As for the sauce. The Honey BBQ sauce is great! I would definitely get that sauce. The chipotle BBQ sauce didn't hit the mark. Not too much taste to it. The Ranch dressing for the salad had a more mayonnaise-like taste and substance.  The burger tastes like baseball stadium burgers. The cheese is so clear you can literally see through the oil in it. The lettuce was fresh and crisp. The Sauce was not as flavorful as I thought. (PDQ) the sauce just seemed oily and mayo-based that it didn't hit any flavor profile desired for a burger. Stick to chicken.  The price of the products is too overpriced. Boasting how fresh the products are is too common nowadays in the Chicken market here in Las Vegas. It should be evaluated again.   If you have nothing else to eat, then go here. Definitely not on my top 10 list for chicken here in Las Vegas. Didn't hit the mark. No flavor. No aroma. Left no impression.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p3hHqCSkxwQHv7iaIrD8Sw"
  },
  "8ZXSRMniUlznhb0B27XXcw": {
    "date": "7/1/2019",
    "text": "Great customer service love the food definitely will be going back!   If I can recommend anything I would definitely recommend the chicken tenders I asked if they can make my chicken tenders into the honey butter dipped chicken tenders which is not on the menu and they did they were so good and I love the zucchini fries I asked them for well done and they were nice and crunchy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D9fWMjoHg11QIe-7kMgb9A",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Original chicken tenders with tater tot&amp;#39;s",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D9fWMjoHg11QIe-7kMgb9A/o.jpg"
      },
      {
        "img_id": "lz0SH-9VcClaCQ8VvZ-J7Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Strawberry shake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lz0SH-9VcClaCQ8VvZ-J7Q/o.jpg"
      },
      {
        "img_id": "ORPm--iKAR8ZAONEBwgNVw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Zucchini fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ORPm--iKAR8ZAONEBwgNVw/o.jpg"
      }
    ],
    "user_id": "25pSBiKhSGMc1LnID9dOMQ"
  },
  "0IDC5HlKG7-2CPXr8GcNdw": {
    "date": "9/21/2019",
    "text": "Love this place!! Always fresh & such great people that work here. My kids love it & I love feeding it to them. I don't buy them fast food but I'll buy them this any day. They're fast but it's not fast food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TtC6T5GvIWFsyQ1Yf6UQTQ"
  },
  "OLEN2yYyKzoWmfZImzk8oA": {
    "date": "8/29/2019",
    "text": "Sad to say theirs only 1 , there use to be 2 but it's all location in which it was but people didn't know what they had in their neighborhood.... The name says it all, no questions asked...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7L3mgFE-PR5MaGSTeNk1zQ"
  },
  "bBOlcGRmWw5DAkn0ZzEhYg": {
    "date": "8/9/2019",
    "text": "When it comes to fast food, PDQ is probably the best around.  Its menu is not as limited as Canes' but it has chicken that is almost as good.  There are some great sides you can get and the Kid's menu is excellent and has healthy options available.  I love how you can add bacon and avocado to the sandwiches too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWc9qiV9EAFPuJAi1AGYOg"
  },
  "fcPRFZMfGGEp_V78ZW0FeQ": {
    "date": "1/7/2019",
    "text": "The first Monday of every month is military day & you get 50% off your order!  I've been going every month for awhile now and my only regret is I didn't start going to PDQ sooner.  They consistently have good service, good food & sauces, and good deals.  No extra charge for additional sauces.   The employees always have great attitudes, the place is clean & the food is tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yypLU1-65sD8cN9G4Kwvdw"
  },
  "h2TPDZGjH4AhPfKRgrT81w": {
    "date": "9/5/2019",
    "text": "Stopped by here for the first time after my stepson's baseball practice. Daniel greeted us so friendly and walked through the whole menu with us. My husband decided on a sandwich recommended by Daniel, and I got the tenders. My son got the nuggets with a strawberry shake. His shake was so good that I had to order me an oreo one. Delicious. Thanks Daniel for the extra customer service you provided by family!  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_2GYdoSxcM1KcTIb0ISGQ"
  },
  "aJ6E6z3f3Ol5-hb-aYBHFg": {
    "date": "7/6/2019",
    "text": "Was looking forward to trying this place out but my bread was moldy so there goes that......",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n7Ns4nuDaZlBKNth9viUNg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. My receipt .....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n7Ns4nuDaZlBKNth9viUNg/o.jpg"
      },
      {
        "img_id": "uZhZUehrVO5qVJ9V5O6cNA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. The mold on my burger bun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uZhZUehrVO5qVJ9V5O6cNA/o.jpg"
      }
    ],
    "user_id": "hcGU3XucsXj5-yCs0j54QA"
  },
  "rKNkc2JUtJeuRCzpTHYhuw": {
    "date": "8/7/2018",
    "text": "PDQ is so good! I wish it wasn't located on the completely opposite side of town from me, but it also may prove to be a good thing because the fried chicken tenders are highly addictive.   This restaurant is always spotlessly clean, bright, and welcoming. The employees and manager are all top notch. PDQ specializes in chicken tenders (both fried and grilled), but of course the fried ones are the best. The breading has an unusual flavor to it, so those with picky palates may not be such a fan.   The menu is straightforward with chicken, chicken, and more chicken. There are salads, rice bowls, and sandwiches on the menu too, and side dishes like fries, broccoli, black beans with rice, tater tots, and incredible fried zucchini. You can upgrade any combo for a \"fancier\" side. I always get the zucchini and the portion size is large, even for a big eater like me. It's plenty to share.   All the sauces are homemade in house too, and they'll give you as many as you like with no upcharge so you can try a bunch to find your favorite. They'll also wrap any sandwich in lettuce, which is a bonus for all you low carb diners out there.  If you have a sweet tooth, they have yummy looking milkshakes for dessert. I love the drink options, with fresh brewed iced tea (sweet and unsweetened) as well as two big Coke Freestyle machines.   I really, really love this place. Health food this ain't, but it's a decadent treat!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 14,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "-OPUq9E79T7KoD04RYOBhw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Zucchini fries are SO GOOD.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-OPUq9E79T7KoD04RYOBhw/o.jpg"
      }
    ],
    "user_id": "BQkC6RneYfvfG6wRe0hsvQ"
  },
  "GmuUlZgQOGOEm-gkHkTG2Q": {
    "date": "6/14/2019",
    "text": "PDQ is amazing! They have amazing customer service and food!  I came here on a whim with some work folks and they did not disappoint.  They make all of their sauces in house and when they found out it was my first time having PDQ they gave me a sample of every sauce on the menu!  I got to find my personal favorite which is creamy garlic by far! I could put it on anything!  Its really tasty on the zucchini fries.  They are much tastier than the regular fries.  They have great milk shakes and even sell cheerwine.  The drink of my home country of North Carolina.  Their chicken is what takes the cake.  Pair their tenders or sandwich with one of their many dipping sauces to create a unique flavor.  I've taken family visiting from out of town to check them out.  Everyone has enjoyed the food and been impressed by the cleanliness and customer service.  Several years after discovering PDQ I found out that it originated in North Carolina.  I now work right near the original location which is now called Tenders.  PDQ is the best.  They've got some competition now with a Chick-Fila close by.  PDQ is the winner in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "9eFi-CKKmdlwpoHVja9Y6g"
  },
  "NKJXKceHJBy3V45wDpuaOg": {
    "date": "3/9/2019",
    "text": "This place was amazing. I had the butter honey chicken sandwich and it did not disappoint.  Tried the totnachos they were good as well just yellow cheese was a bit chunky but had good flavor.  Also sweet tea is soooo good !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gmvb7u3UTukbs3pfCOhTmw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gmvb7u3UTukbs3pfCOhTmw/o.jpg"
      }
    ],
    "user_id": "xPbyzax8yHs6EZQXetMLQA"
  },
  "e5Ulo2zydV0z95RuCOs7ig": {
    "date": "7/2/2019",
    "text": "Food was fresh and fast. Customer service was very friendly. Would recommend if looking for a quick bite that's good quality.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jJHR0FXejcoCd9NeY7A7Uw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jJHR0FXejcoCd9NeY7A7Uw/o.jpg"
      }
    ],
    "user_id": "KPD4lg9M8kRJgN_yq7tSzA"
  },
  "87SkCTuvC_YhV_2Zpclgfg": {
    "date": "4/29/2018",
    "text": "I love PDQ and I am glad to say I remember when this awesome place opened. I wish I would remember the names of the staff, but, I will pick on Daniel since I just ordered and he exemplifies the staff as a whole. Daniel is always smiling and attentive to my screwy orders. Daniel is polite and friendly and is one reason I enjoy eating here. At the end of a long day I need for the world to be peaceful and orderly.   The Crispy Chicken sandwich is my favorite, however, I am lying to you since I will eat anything prepared here. On top of the amazing food, their milkshakes are superior to In & Out for the reason that they offer various flavors and all are yummy. In addition, the cookies here are so delicious they probably have grammas in the back baking these in small batches.   American food was never represented in a better light. I love this place and I hope they continue to grow and expand. Thank you PDQ!!!",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 10,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "oec_nOUbDJIZy8gfj0Vbug",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Yia Yia&amp;#39;s Greek salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oec_nOUbDJIZy8gfj0Vbug/o.jpg"
      }
    ],
    "user_id": "O9pMFJSPg80YVzpMfNikxw"
  },
  "if6_ZZlHfRYEr364-hZ9mw": {
    "date": "5/14/2018",
    "text": "PDQ = People Dedicated to Quality. They're doing their best to live up to their name. The food was fresh, the restaurant was clean, and the service was quick.   We ordered a pimento crunch sandwich, a grilled tenders meal with the feta tomato salad, and the totchos. The pimento crunch sandwich had pimento cheese and potato chips over crispy, fried chicken in a buttery bun. Sounds ridiculous, right? It was. But, it was also ridiculously delicious. The pimento cheese was creamy and the potato chips added a saltiness that balanced out the creaminess. Would order it again, for sure. The grilled tenders were pretty basic but I got some honey mustard and honey bbq and that jazzed it up just enough. The feta tomato salad was fresh and would've been great, but they add mint to theirs and I'm not a fan of mint. Finally, the totchos - tater tots covered in a nacho cheese sauce and topped with bacon and green onions. It was good but a little salty, as to be expected.   I was pleasantly surprised with my meal. They have quite a few interesting items on the menu so a return visit will be made.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ClJ4Zxtk7N6S3IpzNe0M4w",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Feta tomato salad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ClJ4Zxtk7N6S3IpzNe0M4w/o.jpg"
      },
      {
        "img_id": "eWITF2csslxYef3YMbNa-Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Pimento crunch sandwich with pimento cheese, potato chips, and bacon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eWITF2csslxYef3YMbNa-Q/o.jpg"
      },
      {
        "img_id": "6GscRcl3QIgCUgOSj4mY1A",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Totchos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6GscRcl3QIgCUgOSj4mY1A/o.jpg"
      }
    ],
    "user_id": "urZhn8rei-iEjOLRc6sg9w"
  },
  "EqvM-7YBbt0ZXKxi4THN0Q": {
    "date": "4/27/2019",
    "text": "All crew standing around doing nothing.  They were all on there phones at some point.  The girl with the glasses took a cloth out of her purse cleaned her glasses with it put it back in her purse and went back to work without washing her hands.  Another employee had just arrived to work went straight to the register to clock in.  Put her hat on after she clocked in and did not wash her hands.  All crew was on the phone in the matter of 20 mins that I was there still not one person washed there hands.  The girl in the pink shirt who was not working all behind the counter not on the clock with her hair all flying around.  9 employees on a sat night at 5:30.  Not busy at all and they are getting paid to hang out not do any work and break health code violations.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ti9TnY_qqAPv0S4aqk5Ig",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crew doing what they do I guess",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0ti9TnY_qqAPv0S4aqk5Ig/o.jpg"
      }
    ],
    "user_id": "u6qTd9lKkSnr0WzDmxgZ3Q"
  },
  "ri1J_OAQIYXPJaXG-WnYdw": {
    "date": "2/24/2019",
    "text": "I would rate this place an overall of 3.5 stars. Food:3/5 stars  Service:5 star  Ambiance:5 star  Value:3.5 stars This is my first time trying pdq and i felt like it was missing that IT factor. To be honest it didn't have anything that really would make me want to come back. I ordered the Thai bowl and 2 chicken tenders and it was okay. The broccoli in the Thai bowl tasted like frozen broccoli that was microwaved. Also the chicken that was served to me wasn't really that hot it was semi warm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uGj0zu4PPkrAQBUnpn5mgw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uGj0zu4PPkrAQBUnpn5mgw/o.jpg"
      }
    ],
    "user_id": "TlfoEtnqd9jIsuHZW8iuSw"
  },
  "lLgOy_aOKeXDdZv-Nv7yhg": {
    "date": "4/17/2019",
    "text": "I was definitely lured in by the tantalizing photos of the food here. I was not disappointed. The chicken tenders were delicious. On par with Raising Canes. The dips were great. Very tasty. The zucchini fries were not impressive, bland, and deep fried to oblivion. The fries were also boring. French fries should be your biggest investment!!! I wouldn't be against coming back. Much more to try out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f587WkOuLAotgXOVAybylA"
  },
  "4bombeH6Kfhyiol0PzKXLA": {
    "date": "6/2/2019",
    "text": "I had a great experience here today.  I had never been but drove by often so I thought I would give them a try.  I am Glad that I did. They are not busy and I received exceptional customer service. The cashier made a recommendation  that I took and I was very pleased with my choice.  Great job and I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eZleZr_yLOxQ_LiBdImu4w"
  },
  "8MXRH2yUQ7sqnOHlAhkQ_w": {
    "date": "11/19/2018",
    "text": "I wish they would give that place a different name because I can never remember PDQ.   Was in the area (which I never normally am) so decided to give it a try.  Chicken sandwich was well made.  Flavorful and pretty juicy.   Fries were not soggy at all like some others have said.  Well seasoned too.  Soda was on point.  Staff was nice and everything seemed clean to me.  Would go back if it wasn't so far.  Wish the Sahara location never closed because that one is about 10 mins closer.  They have some sort of email club where you get 3 free tenders for signing up with any purchase and a free meal for your birthday.  I appreciate the love from them.  Gonna try to make my way back.  I believe they give 50% off on the first Monday of the month to military.   Cool stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "lzgEUPNFGboDm1U7aO8gTQ"
  },
  "DGtMkv5mQbqsGFNcYyTLuA": {
    "date": "1/21/2017",
    "text": "Have been here twice back to back after i first tried there chicken is awesome and so many homemade sauces .love the Blueberry coleslaw fries not so great but thats ok cause the food is awesome also the cookies ..staff is very friendly and very fast ..i have never seen a store as clean as this one and bathroom as spotless .i highly recommend this ..and will b back for sure ..if anyone complains about the high prices i didnt think so there not chinsy with there sauces either and blow canes out of the water pdq is the best",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jPOC8O0jbluXPoHgCkCOxA"
  },
  "BtFlWrDQj6u0KaVMGVADkg": {
    "date": "4/30/2015",
    "text": "I love you Raising Canes but PDQ (People Dedicated to Quality) had me with their unlimited sauces, always moist chicken and skin-on french fries. Been here many times & we were always greeted with warm smiles from the workers. All the employees and owners/chefs (I'm assuming) are always there as well, always helping out, prepping food, greeting everyone and asking if anyone needed anything. Honestly, when dining in, you will ALWAYS be be greeted/asked if you needed anything, I promise. If not, please correct me. They are always genuinely nice and ready to accommodate you with anything!  As for the food, it's always consistently yummy. The chicken tenders are moist and I enjoy all the sauces I've tried (Creamy Garlic, Honey Mustard, Ranch, etc). They also don't charge you extra, just kindly ask. I love the skin-on fries and I dash a bit of sea salt cause I love me some sodium. The portions are big too! Oh and I can't forget the 100+ drink machine, various types of teas and their thick, creamy milkshakes!  All in all, I'm definitely a fan despite the somewhat high price for fast food.. And of course, I'm a fan because of that lovely hand washing station with lavender hand soap. I mean, come on.. it's adorable! Check them out, for sure!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "Nbr4DYLPxURjxelLVTSt8A"
  },
  "y2Rip4lUNjpC_Z08GnE15w": {
    "date": "9/28/2015",
    "text": "I could not be happier!  I had PDQ cater my 4 year olds birthday party since I was running out of time and needed help. He loves chicken tenders as most 4 year olds do so I figured it would be a hit and I was right! All the kids AND their parents raved about the food and wanted more. They were on time and brought all the sauces, plates, napkins, & utensils. It was so easy!  Thank you PDQ, you made our party excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aIzdtX2UCfarHIoVYbfWCw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. All the kids in the bus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aIzdtX2UCfarHIoVYbfWCw/o.jpg"
      }
    ],
    "user_id": "dFOKDTKdZLZMSqPSr-_NkQ"
  },
  "AMigsyqaWTkMJNaLpTe55Q": {
    "date": "5/13/2016",
    "text": "P eople D edicated  to Q uality I had a difficult time deciding what to order. This was my first visit.  I decided on the Cali and fried zucchini.  Man was it good! The prep kitchen is open viewing and the entire visit, the crew was smiling and laughing with each other. Not in a bad way either. They made for a great dining atmosphere. Service- excellent and dining area spotless.  Try this place out, you will enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ms4I6ajYOMxBu_wekuBxHg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. I still can&amp;#39;t get over table service with fast food and now this.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ms4I6ajYOMxBu_wekuBxHg/o.jpg"
      }
    ],
    "user_id": "IyppjkPOT3pZHzwSQzPQ9A"
  },
  "e8WwbLlve4PNUW3ZLVZGug": {
    "date": "1/13/2016",
    "text": "I normally write to complain, not this time. First time at PDQ and I love everything from the food freshness, food flavor, food selection, dish innovation, customer service, cleanliness, and drink selection.   WOW!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qb-9RF9o-jp16hqVlu_myQ"
  },
  "qRukVVNSzhmOxMUc0HL_zQ": {
    "date": "1/9/2017",
    "text": "I came here for the first time right before Christmas. It was absolutely delicious. I had a chicken sandwich (yes crispy). It was breaded perfectly and crunch was decadent. 20x better than chix filet and 10x better than Canes! I had a side of the slaw which was different but a little dry. I didn't care. The sandwich was so awesome it didn't matter!  Today had a jones for fried chicken tenders so hoping to get the same delicious chicken I had on my first visit, I decided to go back to PDQ.   I ordered the 4 tender meal with fries. Disappointing. Breading was scant and didnt have that awesome crunch and depth. The fries were lousy because they were not crisp rather were tasteless and soft and soggy.  If I could recapture that chicken sandwich breading with its awesomeness from my first visit , I'd come back. For now back to canes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhHsw9Uf24S8G8Gf3MnE_Q"
  },
  "munDdE3zCcNtTatbvYoYzQ": {
    "date": "9/16/2015",
    "text": "From far away I couldn't even tell this place was a restaurant. After finding out it was a chicken joint I had to try it out.  The restaurant itself is very clean and the staff were very friendly.  The chicken is so amazing, very tender and the sauces were addicting.  I Recommend trying this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BN6K1b7I1cyM6-FgZsfmPw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Buffalo chicken sandwich and fresh cut fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BN6K1b7I1cyM6-FgZsfmPw/o.jpg"
      }
    ],
    "user_id": "maN_EaMVU5UpAu1SKGL0qA"
  },
  "qGjtPyu8p0Dp5tu8shwCOQ": {
    "date": "6/8/2015",
    "text": "Chicken was good as well as their sauces. Fries were pretty good as well. Lemonade was pretty sweet but addicting.  I was excited to try the blueberry coleslaw but there wasn't much flavor to get excited about. The best part of was hands down the apples and toffee dip. I could eat that everyday. Service was good. I got through the drive through pretty fast. It was a little refreshing to give your order to a person in the first window oppose to the speaker box.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7gSwABACGPVrRvWlO5ORGA"
  },
  "4quoq4n8CISeOwXvbdDb6Q": {
    "date": "7/5/2015",
    "text": "OK, after visiting their competitors and back to PDQ twice they get my five star.   They tenders taste better than the others.  Their music is what I had a problem with, its not good and  is too loud. Love the sweet chipotle sauce.  Good job PDQ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qQZcokxfbminWZAPH95eLw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Kitchen in the open",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qQZcokxfbminWZAPH95eLw/o.jpg"
      }
    ],
    "user_id": "1_oU3pAMIRhMlLO8X36x8w"
  },
  "0S3f2SbNELEEO9D7UmHwJQ": {
    "date": "5/18/2015",
    "text": "First time checking this place out. I've seen a bit of hype about it, and even a news story, so when hubby and I happened to pass by it on Craig on the way home, we made a u-turn to try it out.  I can't comment on the inside as we went through the drive-thru.   Ordered:  - 1 order of 4 chicken tenders (crispy) with buffalo bleu dipping sauce  I do like the option to not get any sides, as typically I won't eat all of mine anyway. So hubs got a meal and I opted for the tenders-only. So this worked out well.  - 1 order of 4 chicken tenders (grilled) with creamy garlic dipping sauce and a side of blueberry coleslaw  Now, I was pretty excited to try the slaw, cuz well, BLUEBERRY slaw, right? It wasn't anything great IMO. I had assumed the blueberries would at least be smashed into the coleslaw or something, but it was just coleslaw with blueberries in it. Plus, the slaw was a bit on the dry side.  Chicken tenders (grilled) - smaller than Cane's and just plain boring. I wondered why my husband got the grilled ones, but the \"crispy\" ones weren't all that wonderful either. Totally different batter than Cane's, which lends to a much less \"crisp\" eating experience. This is more like a KFC original recipe batter. Strips were on the small side as well.  Considering my husband and I would have to pass a Raising Cane's, a Buffalo Wild Wings, AND a Wingstop in order to get here, I'd have to say this was our first and last time eating here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "hZfzVrhsCQ9JDAb2jYoJNQ"
  },
  "APtjYyTfYoyPHQKppqlbsw": {
    "date": "4/10/2017",
    "text": "This place is awesome. Super clean, polite staff,and one of the best salads I've had from a fast food place . I'll definitely go back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPs3xDt9z7gNtN6y_lBNcw"
  },
  "hK-EGFjGdJpXmvhLZWuiXA": {
    "date": "6/11/2015",
    "text": "Chicken tenders are my favorite food. I could eat them everyday without being bored. (and I pretty much do). So naturally I've tried to find out who has the best chicken tenders around. (or at least in my opinion).  I've had Fame Basket, Strip n Dip, and Cane's.  Yesterday, I visited PDQ. Life changing.  The restaurant is incredible clean. You could probably eat off of the floor. (Don't do that). The customer service is unbelievable. We were greeted immediately with a smile and as first time customers, offered help in deciding. Remy was our cashier and was nothing but kind, patient, and friendly.  I ordered a 4 piece crispy chicken tender meal with fries, ranch, and creamy garlic sauce. My husband ordered the same but a 5 piece meal and added a side of blueberry coleslaw. For dessert, we got a cranberry oatmeal cookie and peanut butter chocolate chip cookie.  We sat down and waited for them to call our name to pick up the order. They brought it to us instead. They even brought a fork for my husband's coleslaw. Another worker came by twice asking if we needed anything and that he'd be happy to take our tray away once we were done.  Tenders: The best I've ever had. They are crispy but not over run with breading. The chicken is perfectly cooked and are great sized tender sizes. The seasonings are great too.  Fries: The fries were great. They resemble shoe string but are a little thicker. They're hand cut too. Perfect amount of seasonings. Don't need salt or anything.  Coleslaw: \"It's not so much blueberry coleslaw as it is coleslaw topped with blueberries.\" - My Husband.  Dipping Sauces: Wide variety of dipping sauces and they don't cost extra if you ask for more than one. Definitely homemade too. The creamy garlic tasted very much like garlic, lol. The ranch was creamy and delicious as well.  Beverages: They have a coke machine, so you can get any flavor of any coke product. That's always a favorite. They also have a great lemonade and a specialty bottled soda called Cheerwine. We didn't try it but will definitely next time.  We will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OCz9lJa59X2YXkQy9u2-0Q"
  },
  "da-QaAfpWLtYT3J-N9FIag": {
    "date": "12/9/2016",
    "text": "Really good grilled chicken salad with blueberry ginger vinaigrette.  Service was great and people were very nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWi1N67CzTtdyB1O8Iltaw"
  },
  "O3rDH9HZJL1EyPGqLqOVgw": {
    "date": "2/9/2016",
    "text": "Mmmmm!  to anyone that hasn't been here, I highly recommend!   Everything we had was really fresh and so good! Their sauces were all had great flavors. I'm not a salad kind of guy, but I would definitely have their salad again! The honey siracha added a great kick to the salad! I can't stop saying good things about their shakes & chicken!  The grilled chicken sandwich was to die for! #PDQ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5w2hxtsmZo7jpr5RCHvJog",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5w2hxtsmZo7jpr5RCHvJog/o.jpg"
      }
    ],
    "user_id": "CII3T3dtCUdh0T0zMhpawg"
  },
  "j9x3WaPZFbng8h-D_nnF5A": {
    "date": "7/1/2015",
    "text": "I tried this place yesterday because I had a BOGO coupon for 3pc tenders meal. The chicken was good. The pieces were a little small. I liked that they had several sauces to select from and the lady at the register said I can get as many as I wanted at no charge. NO CHARGE?! Awesome, I got the buffalo bleu, creamy garlic, and sweet heat. They were all good. THE CREAMY GARLIC IS BOMB! She also asked if I wanted to upgrade the drink to a large for 10 cents more... of course I did! 2 meals for $8 was a great deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JPWzwSDXda6b4nQeC3hPWw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JPWzwSDXda6b4nQeC3hPWw/o.jpg"
      },
      {
        "img_id": "PF_4y0OI8STu68cD4xrQhQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. 3pc tenders meal w/ buffalo bleu, creamy garlic, and sweet heat sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PF_4y0OI8STu68cD4xrQhQ/o.jpg"
      }
    ],
    "user_id": "s5l0J4eOkKJ203kVg0Cg9Q"
  },
  "DwcyHGfNFf64qJqqNjEu4A": {
    "date": "12/31/2016",
    "text": "Such an amazing place for chicken!! I had tenders meal and husband had a burger. They messed up, forgot to put an extra patty in his burger and when they fixed the mistake- we got a complimentary apples with dip!! The dip is so good!! My chicken tenders were fresh and juicy and tender, so perfect. We also got to try coffee and cookies free of charge. Felt almost embarrassed when they kept giving all this extras. In any case, the food was delicious, service is super friendly and fast. I definitely will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HXqDDRu1uZvID8pZEpV1uQ"
  },
  "OIN_t3CqJWf0ankhubqkkg": {
    "date": "11/5/2015",
    "text": "Had no idea what this place was about. A friend of mine told me check it out, and I'm glad I did. Great dinning area, clean and has TV's too! Blue Berry Cole Slaw was tasty! But the Fresh Apple Slices with Toffee Dip was pretty impressive! Any place that has bags while you wait is definitely a place you want to consider! Thanks Hector!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4dKaG-l1LPFQqTWNAVfN8w",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4dKaG-l1LPFQqTWNAVfN8w/o.jpg"
      }
    ],
    "user_id": "k3KKyGhQya-T8GeRdyFjMQ"
  },
  "7vai40okh6bC88kCPNT0zQ": {
    "date": "3/23/2017",
    "text": "Had my first experience at PDQ and my last. Wendy's is just down the street. Half the price Twice The Taste.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrJNxDBXlYK5McVLYy5QIQ"
  },
  "wILqAU0buVbq8G3AQTOk1A": {
    "date": "3/13/2015",
    "text": "PDQ stands for People Dedicated to Quality and they certainly live up to their name. I used to crave raising cane's all the time. Tonight I had PDQ and my cravings have changed forever! PDQ is superior to Canes in every way...  Variety: Strips (grilled or fried), they even have turkey, sandwiches, salads, 7 different sauces (all delicious), milk shakes, fresh cookies, apples with a decadently delicious dip, blue berry coleslaw.  Superiority: the strips are thick, juicy, flavorful and tender. Did I mention the 7 sauces...all made fresh in house. Canes has always lacked in the French fry department for me...PDQ has fresh cut fries that are simply fantastic (light years better than INN N OUT)...could be the best fries out there! The milk shakes are flavorful and creamy and could rival Dairy Queens blizzards. The bread on the sandwiches are soft and tasty. Everything is worth having. You won't have just one favorite.  Convenience: More than ample parking. Tons of seating. Plenty of friendly staff. They have a handless hand washing station outside of the restrooms so you don't contaminate your freshly cleaned hands on a bathroom handle (every establishment should have this!) Fast service! Even TV's so you can watch whatever game is on!   Price: super affordable. I felt like I was actually stealing from them for the prices I paid. Catering is ridiculously fair.   All in all a fantastic new establishment. I can't wait until they are all over town. Until then I guess I will be driving 20 miles to satisfy my new obsession! ENjOY!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "W0-fbi3ocwkU--jPTKMXxQ"
  },
  "wPlGMR9oqA8yh0wYoEwGOA": {
    "date": "4/27/2017",
    "text": "Loved the food!!! Tried it for the first time last night and it was great! Would have given 5 stars but the cashier and employee that took our order was rude. She was not helpful and you could tell she was miserable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49stjNJ8cirT7wHVU1zukw"
  },
  "b_XsggL8Krl0XV6YntJaNg": {
    "date": "1/31/2016",
    "text": "I've been here three times now and I am continually pleased with my meal! The food is fresh and flavorful, the sauces are yummy, and the shakes and malts are great! Plus, the workers are always nice and accommodating! This is definitely a new favorite place of mine :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5dWcFwt5J_t2Jl0QvFrGg"
  },
  "oHWRml09T_t1ncucocHdAA": {
    "date": "4/21/2016",
    "text": "I was really impressed with the  level of customer service at this restaurant. Hector went up and beyond to remedy my original complaint. When other companies might not show they care, this one does. I wanted to say thank you and, it was appreciated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pcz_94OP77lvsbW_0O_ZA"
  },
  "pEtK4gYhG5n4f-xsqHj_DQ": {
    "date": "1/23/2016",
    "text": "First off like I've read in a previous review which I agree with, people need to get off their high horse and stop acting like they are eating at a damn Wolfgang Puck Restaurant. This is a chicken finger joint and it's good! The chicken fingers are very tasty and same goes with the natural cut fries. I've been here quite a few times and every time I've been satisfied with my order. I've ordered a side salad with my order quite a few times as well and I LOVE it, definitely not a skimpy salad you would receive elsewhere. As far as sauces go you can also choose as many as you'd like (they have a great selection) at NO extra charge. They all have great flavor. Hey I just visited a couple days ago and received two free shirts for my children just as a gift. Try it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoyMy4e8wNJ7iEDQ0VoQeg"
  },
  "IZql8AWrWPvN1SNXQ4qnGQ": {
    "date": "3/16/2015",
    "text": "Food was so good on opening day my bf and I decided to have dinner there. I used the drive thru and there were some hiccups. Got charged for shakes that I didn't order. However the staff at the pickup window handled it for me with no issues and apologized. Got a refund for the shakes and received my meal. I asked for sweet heat sauce when ordering so checked the bag before leaving and saw only one sauce. I asked for another sweet heat, the girl handed me a sweet tea. Simple mistake. I again asked for the sweet heat making sure I said sauce and she said oh ok. Closes window and is moving around inside, opens the window again and hands me a milkshake. She apologized for the wait and smiled. I was so confused and after asking 3 times for sauce I just took it and left. Just opened so of course some wrinkles will happen and the staff was still friendly, food delicious too. I'll go back but probably won't use the drive thru.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Nuf4QlQH-zTqnEhHITVO-A",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Drinking some fresh squeezed lemonade while waiting for food.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nuf4QlQH-zTqnEhHITVO-A/o.jpg"
      }
    ],
    "user_id": "VTbkwu0nGwtD6xiIdtD00Q"
  },
  "cLIMl3csbYpN7sYCXsxMfw": {
    "date": "6/16/2015",
    "text": "Tried this new venue and found it to be excellent. Tenders were full of flavor and juicy. Staff is well trained and decor is superb. We will be making this place a regular stop",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Os53IcRcUXxbqOPjEXtUA"
  },
  "QPEGeoVT5CqiLo2Fh-NKLA": {
    "date": "3/19/2015",
    "text": "The 2 star rating is for the service I received not the food. 2 of us went on St Patrick's day to check out PDQ because they were offering $1 Mint Oreo shakes. We walked right up to the counter and ordered a 3 piece chicken strips, a grilled turkey sandwich and 1 chocolate peanut butter shake and i mint oreo shake. Well before I even put my change away my food order was up, but not the shakes.  We waited 7 minutes for our shakes, by that time our food was no longer hot. We got 1 napkin on our tray. The chocolate PB shake was not blended well and had a huge blob of chocolate at the bottom. The grilled turkey sandwich was very good. If I did go back I would skip the shakes, not worth the wait.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "535H0AVY41CWfHGjYhEoKQ"
  },
  "1rfiYWSJCN9rchXKJyazXg": {
    "date": "11/16/2015",
    "text": "Best chicken tenders in Las Vegas!!! Unlike other places the sauces are unlimited no extra charge.Ever since my bf and I tried this place we been coming back almost every week! Their food is fresh and the customer service is just out of this world. Staff is super friendly and hardworking. Special thanks to Andrew B",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FN6ylBkFIZInj8Atm6wwKw"
  },
  "w8_qPt-Bx_wE60v58Jk0ag": {
    "date": "11/14/2015",
    "text": "Ordered 50 chicken fingers today for a party and the workers had the chicken fingers perfectly cooked in under 8 minutes. The manager also gave us Apple slices with peanut butter dip and blueberry Cole slaw on the house. I am so pleased with the service. Will be going back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68MNNErzHS3h-HZyMDp5Ng"
  },
  "kIeHzPJU8HY_LrzerU6QPA": {
    "date": "12/15/2015",
    "text": "A lot of my co-workers love this place.  Me, I'm not crazy about chicken unless I'm the one who's making it.  That said, these guys are OK, and customer service is good.  They can be very busy during the lunch hour on Friday, which is why if I go, I will go during the non-peak hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTPNvBKY490_t9Ay3bFaww"
  },
  "29K5lH0-dtPfO4P1UiYLHQ": {
    "date": "10/18/2015",
    "text": "Tried it out for the first time today. The chicken tenders and sauces along with the fries are super good. I didn't like the Caesar salad that much. We also got the apples with the toffee sauce and it's delicious! We will be back next weekend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "juSIzsuK3ks3dBsaJIAZ6g"
  },
  "Gfi8KKvPKa7QhmRyhH9jhw": {
    "date": "9/18/2015",
    "text": "Seriously fresh, nutritious, delicious fast food! The quality stands out. The service is excellent. We are so pleased with this discovery. This place is in a league of its own.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e-nN3irzfirysgKRXTlHMw"
  },
  "In0LdIdoWQN5LXiAIv8ozg": {
    "date": "5/24/2015",
    "text": "This is my 4th time here. Best chicken and fries !!! Customer service is outstanding!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "47xYFVSi46v4lb96lgQLsQ"
  },
  "epqr_x55M7_2QgBhrslTOQ": {
    "date": "9/8/2015",
    "text": "I had moderate expectations since it is realitively new.  It definitely exceeded them.  The interior was spacious, clean, and I was surprised at the number of visitors.  That is usually a good sign.  Ordering was easy, friendly service, and fast delivery.  I also prefer the chicken strips over Raising Canes, although their fries fell short since they weren't hot.  Nonetheless, we will go back again soon and try some other sauces.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uKYBCrO0FfQ2OT4nFgAQ1A"
  },
  "9Fb9HcyTZ8MowfX0TvQJVw": {
    "date": "10/5/2016",
    "text": "Was at the thrift store and yelped this place it had 4 1/2 stars so I decided to try it. Wow! The atmosphere, the customer service, their kitchen and the food was all surprisingly above & beyond especially for fast food. I never eat fast food but now after I'm thrifting this will be my new cheat treat. Order the Buffalo chicken sandwhich with zucchini fries YUM!!  Got to high five Kurt, which I am assuming is the manager, for their motto....people dedicated to quality hence their name PDQ totally says it all about this place and plus who doesn't love quality fast food?! And when they say quality they mean it in their food, service & the style. Open, clean kitchen like they aren't afraid to hide anything love clean kitchen & clean food made me feel safe like eating from my kitchen at home! Staff were all super chill and fun to mess with btw if you get Lajuan as your cashier, be nice because yes that's his real name I already teased him about it lol. Thanks for the dinner PDQ you will be seeing me again! Especially because yall said bye when I left & the apple fritter stuff. -Candace & Bill",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Gi9JXeZjYrn7fTyzvHW1Q"
  },
  "Nwc9ZTMegR6A09Ggp0vjLw": {
    "date": "7/14/2015",
    "text": "Stick with Canes which has real pieces of chicken not nuggets! This place is overpriced.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dfhwoS9MIpY2dmRe51jl2g"
  },
  "a_tkKoa5suzL4zV48oYhQg": {
    "date": "7/6/2015",
    "text": "Great customer service and good food. 50% off your entire order on the first Monday of the month if you are military. Great alternative to the traditional fast food chains.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UWwxvq2q7UqGP1PD380hJg"
  },
  "k_ho5Xcejxl5nPZUSCKwpQ": {
    "date": "8/31/2015",
    "text": "I am more than pleased with the entire package.  Very decorative and we'll maintained  store.. The food quality was FANTASTIC... Hector the manager should run for president.. Lol and Remy R should be vice president.... Lol no seriously this place is wonderful and I recommend it to anyone that loves great food fast and efficient service...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NNfcS5VO4nhGneV2WhLOVA"
  },
  "Gt7IILG8JYMeAphJm1B4bQ": {
    "date": "3/26/2015",
    "text": "Good food kids loved it clean and employees are on it, fast service too and healthy options too salads and grilled chicken way better alternative than other fast food places, my bill was about 40 bucks for a group of 6 not bad",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBm0uh16IwxqWV2vpdhLQg"
  },
  "jaZwvUo3BdA_EoqVZmJK8A": {
    "date": "3/21/2015",
    "text": "Great service and the food is wonderful. Really fresh. Brand new location and it's nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beFqDUfYeLMUBtNJOvEqqA"
  },
  "CD2B8hMgrL-6jcF3eBV_lg": {
    "date": "3/21/2015",
    "text": "Raising Cain's has NOTHING to WORRY ABOUT!  PDQ is expensive for what it is and what you get.  I ordered the 5 piece \"meal\" with 3 sauces and a chocolate shake.  The person with me ordered the tender sandwich and a chocolate malt.  First, the \"meal\" here means chicken tenders with EITHER fries OR coleslaw. Since the slaw description states that they put blueberries in their coleslaw, I opted for the fries.  I was excited to see the fries were the shoestring variety since this usually means they will be cooked to medium or well done.  These were almost raw and some had the texture of raw apples!  There is no Texas toast included so a meal is tenders and fries.  The \"hand spun\" chocolate milk shake tasted like it came from a machine with that really whipped texture.  The dipping sauces tasted like salad dressing, straight from the bottle.  This cost me $12.73. My friend's sandwich was inedible and made her gag but the dogs did eat it.  Her chocolate malt, which we ordered 3 times since this order seemed too complex for them to get right the first time, arrived as a vanilla shake.  Her meal cost $10.36!  I wanted to like PDQ since it is fairly close to my home!  I will gladly drive by it to get to Cain's every time!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vl3xdjqA_0o_-ZG_mmqrqw"
  },
  "5w8b6jM6_CDXnW2SThuoiA": {
    "date": "2/24/2017",
    "text": "Wow. Total transformation!!!! When I first ate here this place was ass. Excuse my language! :P.  U posted a bad review.  Some one high up reached out and offered a free meal. Of cures I responded way to late, but that heater was enough to eventually win me over amd come back. Let me tell you, everything was sooooo good. Canes has competition now. Even the honey mustard is better.    Sense PDQ is closer.  I'll be doing more business here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bbrk-_bJH0X-dQsChwCBsg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. I respect a company that reaches out to a unhappy customer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bbrk-_bJH0X-dQsChwCBsg/o.jpg"
      },
      {
        "img_id": "MGtNUoQhEAeY0xosWjuf7g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Delicious",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MGtNUoQhEAeY0xosWjuf7g/o.jpg"
      }
    ],
    "user_id": "OfB0F25QByaFUJypUe3ujA"
  },
  "SC3FBmGEc9EHNr4HPNhTxA": {
    "date": "5/12/2015",
    "text": "Another chain place that gets my 5 stars!  I have to start this off my giving credit to my fellow yelper Amy K who checked into this place a few weeks ago & I had no idea what PDQ stood for. I was very pleasantly surprised to see some really delicious looking pics and what sold me was the crispy chicken salad, first pic!  So today after a long day at work & being sick all week I wanted to try something new and that salad looked so damn good. I was hoping it would taste as good as it looked and it did! Most salads are so disappointing for fast food chain places and this by far is my favorite salad ever! The dressings are homemade and they have a wide variety of choices. We tried a bunch of them and they gladly allowed us.   The chicken tenders are so moist and flavorful and the buffalo sandwich was outstanding. I also tried the special cheerwine soda which tasted exactly like most people described; Dr.Pepper with a hint of cherry. It was great!   For dessert we had a homemade cookie that was so fresh and chewy (bomb) and the apple slices soaked in pineapple juice that are then dipped in toffee sauce were amazing! I have to admit the drive across town was so worth it.   The restaurant itself is so new that it sparkles. It's adorable! Everything was so clean & shiny :) The service was great! They even have a community sink that you can wash your hands in after your meal with lavender soap. Nice touch PDQ folks! You have it going on and I'm happy to spread the word :)",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 18,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "mb1AARFMfbLKZQLeJnw9zA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Lavender soap and huge sink!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mb1AARFMfbLKZQLeJnw9zA/o.jpg"
      },
      {
        "img_id": "b0ecvCYAfUxRSInDPsW7Uw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Close up! :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b0ecvCYAfUxRSInDPsW7Uw/o.jpg"
      },
      {
        "img_id": "t7tsjgKuDMEMl3hje99yzQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Apple slices in pineapple juice w/ toffee dip! Wow!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t7tsjgKuDMEMl3hje99yzQ/o.jpg"
      }
    ],
    "user_id": "LNPyE5X1K5B_flcTCH9StQ"
  },
  "AjxL8xIGg2xH9LM7uLfdcQ": {
    "date": "4/23/2015",
    "text": "I stopped in for dinner and ordered my food to-go. I wasn't too impressed with my food on the first visit, so I came back again to give PDQ another try since the reviews were so good. The inside was very clean and they have an interesting hand washing station. Sauces are made from scratch, the chicken fingers are hand-battered and made fresh and the fries are cut fresh. Heck there is even a game of cornhole outside. PDQ (people dedicated to quality) is in a larger than normal building for a fast food place and offers plenty of seating. I feel most of the stuff I just previously mentioned is attracting parents with young kids because kids love chicken fingers and playing games, all offered here at PDQ. Adults (most anyway) love chicken fingers also.  3 Piece Crispy Fresh Tenders Meal ($7.29) - Along with the crispy tenders this meal came with a drink and choice of side, I chose the fresh cut fries and one choice of sauce, I chose honey mustard. The chicken tenders were small to me. Two of the tenders were really small compared to the third longer one and they were skinnier than the ones at Raising Cane's. There wasn't anything crispy about the tenders, instead they were soggy. I thought the flavor was lacking a lot as well. The honey mustard dipping sauce was actually very good. I tried one of the fries when I got back to my car and it was good, really good, but the fries didn't hold up well during the car ride and ended up greasy and soggy. Since they are cut fresh, I recommend eating them inside and not getting them to-go.   Fresh Apple Slices with Toffee Dip ($2.19) - I liked this. There were 2 apple layers in a cup with juices to keep the apple fresh and the apples were nice and crisp. The toffee dip tasted great paired with the apple slices. I can see this being enjoyed by all ages.   Crispy Chicken Salad ($6.59) - This salad has sliced crispy chicken tenders, mixed greens, shredded cheese, tomatoes, cucumbers and comes with honey mustard dressing. The mixed greens were crisp and looked fresh, but tasted like a bagged mix from the grocery store. The tomatoes tasted fresh and were very tasty. When in came to the cucumbers, I found two in my salad. I liked the amount of tenders on the salad and they were plump pieces, but again the chicken wasn't crispy however this time tasted decent with the honey mustard dressing and the chicken wasn't soggy like before.  Peanut Butter Pretzel Shake - These are half price from 3 - 5 pm, so I only paid 2 bucks and change for a large. I have to say this shake was the best thing I had from here! The straws are nice and fat so all the chunky pretzel pieces were able to go through it with no problem. The peanut butter flavor was really good.   I do feel the prices are fair here, inside is clean and the employees are friendly. The salad is something I'm willing to give another try and I'd like to try one of the sandwiches. I will absolutely be back for the shakes!",
    "rating": 3,
    "rated": {
      "funny": 28,
      "useful": 42,
      "cool": 38
    },
    "photos": [
      {
        "img_id": "Lp0BNDUWjeJo6KEz9fWaVw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. &amp;#34;Spicy Buffalo Chicken Sandwich&amp;#34; (w/tomato added) @ PDQ - 6/15/15",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lp0BNDUWjeJo6KEz9fWaVw/o.jpg"
      },
      {
        "img_id": "Mgqrva-EX0ExHlWNQqJNaA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. &amp;#34;Fries&amp;#34; (w/blue cheese sauce) @ PDQ - 6/15/15",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mgqrva-EX0ExHlWNQqJNaA/o.jpg"
      },
      {
        "img_id": "4f6XQtWDQ3Wzg2sgH46cYg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. &amp;#34;Fries&amp;#34; @ PDQ - 6/1/15",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4f6XQtWDQ3Wzg2sgH46cYg/o.jpg"
      }
    ],
    "user_id": "Fv0e9RIV9jw5TX3ctA1WbA"
  },
  "Nz511wXsGb_oK5uvl6QwLw": {
    "date": "8/7/2016",
    "text": "We came here based on Yelp reviews and the fact that my daughter requests chicken strips at every meal.  Could not believe how quickly the food is served and it was totally hot and fresh.  I had the grilled chicken sandwich, my daughter had chicken strips with fries, other daughter had crispy chicken sandwich with the best zucchini fries ever, and my husband ordered chicken strips.  He opted to order small and finish up our leftovers but the food was so good, we had no leftovers and he had to stand in line and order again (which lasted another 10 seconds).  It was funny to watch people reaching into their back pockets to pay as their food was already being served to them.  Or a family of 4 returning from the soda fountain to sit at a table and the guy with the food was following them.  We joked that they were psychic, especially when another customer dropped his whole tray of food and when he stood up from picking it up, a replacement tray was already on its way.  Incredible food, service, prices, quality and cleanliness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sUAtaDiWH44NnFpmqsx4ng"
  },
  "MFeUv-jMzP8QWsSA8bj_nQ": {
    "date": "7/26/2015",
    "text": "Walk through the door to a huge hello and a smile. The service was really good. The people that work there are super friendly. I order a Grilled Turkey Breast Sandwich with a lemonade to go with my meal. The food was good!! I can't wait to come back again. Try the creamy garlic with your fries.    Side not.. I really like the section where you can wash your hands. They don't use the cheap stuff lol.  -----------------------  Back again! This place is cracking.. The service was excellent, and the food was delicious. You must try the lemonade. The apples with the special sauce was a real treat. My crispy tenders that I order are moist and tender.  The honey mustard and creamy garlic is super bomb! I will definitely come back again. This is on my list of go to spots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4nc52gaqCYiIYieFoX8OYA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4nc52gaqCYiIYieFoX8OYA/o.jpg"
      },
      {
        "img_id": "adtFFO5JODsl_B7YsyXG1A",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/adtFFO5JODsl_B7YsyXG1A/o.jpg"
      },
      {
        "img_id": "7Axrbsr54iok_Ss5QVmP5g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Axrbsr54iok_Ss5QVmP5g/o.jpg"
      }
    ],
    "user_id": "ZWeE3yB9WU_DBSU03Dl5kA"
  },
  "Pl-T3sFIdFWpLsxWipNznw": {
    "date": "3/27/2015",
    "text": "Ok, something new. Go in with an open mind.   I read reviews who comment and compared this place to canes. If we're gonna do a comparison the chicken at canes is a oily battered mess and this is not.   We enjoyed our meals here at PDQ. The chicken was of  high quality chicken breast and the fries were fresh. The chicken wasn't battered heavily and didn't leave your hands  oily. The size of the chicken is plump and of very good size. I think what topped it off for me were the sauces offered and variety of drinks available.   Food was made fresh and fast. Restaurant had a ton of seating. I loved the idea of having a hand wash station outside of the restroom.   Definitely a place for chicken lovers to enjoy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Sga72WfbC7R6pOLtKAci3Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sga72WfbC7R6pOLtKAci3Q/o.jpg"
      }
    ],
    "user_id": "gYiqlmSa5YQ3JTKQMt12Wg"
  },
  "-Y5VpCAWUNCjDZlMwngHeA": {
    "date": "3/23/2015",
    "text": "I'd heard a little bit about PDQ before from articles online, but since I've never travelled to anywhere even remotely close to one, I never really expected to try it. But on my way to work a couple months ago, I noticed some construction going on for a new restaurant and after finding out it was a PDQ, I found out their opening date to post on Yelp and awaited my chance to check them out. I drive by this location every day 5 times a week, and it was neat to see how quickly they got it built up. So after finishing up a fun 5k this past weekend just down the street, I figured no better time to check them out.  The location itself is actually pretty dang big for a fast food joint. They have plenty of seating, a nicely organized drink/condiment station, and an unusual but very cool hand washing station just outside of the bathrooms. And if you happen to enter or exit on the side where the drive thru is, you can even play a couple games of cornhole on their custom PDQ boards. Pretty cool!   But what exactly does a place called People Dedicated to Quality serve? Chicken, and lots of it of course. Their main menu items are grilled or fried chicken tenders. But they also offer sandwiches, including a turkey sandwich, salads, and a variety of sides. For those original to their areas, you might be glad to see they serve up Cheerwine here alongside their new fancy Coke machines.   Since this was our first time, we decided to get a few different things to try and kind of share with each other. For whatever reason, they don't let you mix and match what type of fingers you want with your combo, so if you want a variety of grilled and fried, you'll have to order a meal and then add fingers a la carte. Pricing isn't terrible, but the fingers are a little on the small side, and a 5 piece combo will set you back a little under $10. They do include a side and drink with it though.  Neither the grilled or fried chicken fingers were great, but they aren't bad either. Since Raising Cane's is really the only other large fast food joint dedicated to fingers, it's hard not to make comparisons. I'm not not a huge Cane's fan, mainly because they are almost always just unbelievably greasy, so it was nice to see the ones here at PDQ are much lighter in the grease department. And while both types of fingers were tender, I was surprised to see how soggy and not so crispy the fried ones are. The flavor of the chicken itself is decent, but there's really nothing special about them on their own.  To go with the chicken, we ordered a couple different dipping sauces from their variety. Unfortunately, they completely mixed it up and we only ended up with Creamy Garlic and Buffalo. The buffalo was almost inedible, unless you like eating sticks of butter. But the garlic was decent and didn't overpower the chicken. Had they not got flooded with a line of people after we got our food, I probably would have went back up and got our order right, but hey it's just sauces. Even though the Chipotle & Sweet Heat sounded pretty intriguing.   We also sampled all three sides, and again everything was okay, but nothing stood out. The fries are on par with several fast food joints, but have a slight edge since they are also very light on the grease. The blueberry coleslaw was decent, but it's just basic coleslaw with a couple blueberries thrown in. Add some salt to it and thank me later. And while the toffee dip that comes with the apples is good, the apples came in a cup that was filled halfway with liquid that made them way too soggy.   Overall, PDQ is a hugely welcome addition to an area where there just really isn't many choices. They also got some of the best \"service\" you're going to find in a fast food spot. But the food itself doesn't stand out from any other similar chicken joints, and doesn't come anywhere near the local favorite that Strip-n-Dip has become. I won't be rushing back, but if I was in the area and needed something quick, I wouldn't turn down a couple strips and a game of cornhole!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "VJnoBhMgiMfUyGEbR4jIpg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Blueberry Coleslaw",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VJnoBhMgiMfUyGEbR4jIpg/o.jpg"
      },
      {
        "img_id": "BDaMFiieu5GxfWyWFRI9iA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crispy Strips Close-up",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BDaMFiieu5GxfWyWFRI9iA/o.jpg"
      },
      {
        "img_id": "6l_GGyNA4Na7SfOnZZA-Kg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crispy Strips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6l_GGyNA4Na7SfOnZZA-Kg/o.jpg"
      }
    ],
    "user_id": "QqRSNjWhfUFv1ZU0OnYKZQ"
  },
  "T49Cn3jyH7t-t8lBuCjDuQ": {
    "date": "4/17/2017",
    "text": "This place is awesome and the food is great the manager was awesome! Everyone that works here it's pleasant place is clean the food is amazing best honey mustard ever can't wait till I get done so I can drink my shake! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ift_VoQKuqY7bnt9UuI6yQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ift_VoQKuqY7bnt9UuI6yQ/o.jpg"
      }
    ],
    "user_id": "DaQxH-7vXDrjQC6WPRpttg"
  },
  "1zYC7NSeSsEulawegtrhoQ": {
    "date": "3/13/2015",
    "text": "All right all of you chicken lovers, you've got to try this place and tell me that you don't love it!!    So first off, I need to explain that they have 9 dipping sauces to choose from. ALL of them are free, no matter how many you choose. And ALL of them are made in-house. My favorite is the honey mustard, sweet heat and chipotle bbq!!  You have a choice between breaded chicken fingers or grilled. They also have chicken sandwiches, turkey sandwiches and salads. Between all of us, we had chicken fingers, chicken sandwich and a breaded turkey sandwich.  All of which were excellent!!  The sides were all equally as tasty. Blueberry coleslaw, fries and the apples were all really yummy!! The fries are fresh cut like Inn and Out, but BETTER!  I'm a soft/soggy kinda girl and it's perfection!    The shakes were super creamy. We had mint Oreo, peanut butter, regular Oreo and chocolate. Way cheaper than Dairy Queen and was the perfect dessert!  And the cookies were soft and moist.   They also have fresh squeezed lemonade, green tea, sweet tea and iced tea.   Everything we had here was really delicious. And the wait for food was not long at all. It's very spacious with plenty of seating.   Please give it a try!  Seriously loveeee this place!! 5 stars!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "FeLDj_h5MLTRnMJvT0jY9g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. The menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FeLDj_h5MLTRnMJvT0jY9g/o.jpg"
      },
      {
        "img_id": "oqQnY4zmfx3ykLvPpa70Bw",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. ...And he&amp;#39;s absolutely breathtaking.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oqQnY4zmfx3ykLvPpa70Bw/o.jpg"
      },
      {
        "img_id": "_RzMHAofXLVf0WZcEwJXKA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. The entry way",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_RzMHAofXLVf0WZcEwJXKA/o.jpg"
      }
    ],
    "user_id": "Tq61AHCncEpvRGnUvgnmzA"
  },
  "CVFBC9L1A0-mLyh46nSgqg": {
    "date": "8/24/2017",
    "text": "I recently came here a little over a week ago but this is one of my go to joints now. I get the Buffy blue with pickles it's freakin fantastic. Also the fries have their own flavor it's great. Family friendly and EXTREMELY clean. The quality of the food is always 10/10 and wrapped neatly in my food basket. It never takes longer than 5 minutes to make either. The service is awesome too. Me and boyfriend will be back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_XppjmiQUVel7OCAXuM0BQ"
  },
  "a9-D-2pOBYuYzP4HjI64QQ": {
    "date": "7/24/2015",
    "text": "This is a nice, new chicken tender place that's what Cain's should be. They offer much more than just tenders alone and more sauce choices which is great.  I had the Buffalo chicken sandwich and Frys. I've got to say, the sandwich is comparable to the McD's spicy McChicken sandwich and sadly I thought the McD version is better (and only a buck). The Frys are a little limp, I like crispy Frys.  The Wife had the crispy turkey sandwich with was very good. Crispy and great flavor. I'll get that next time.   Ok, I tried PDQ again and this time it was very tasty. I got the crispy turkey sandwich and ask to get my fries extra crispy. Both were done right and very good. I'll be back and try the tenders and their sauces next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ9zd2_eHoXMrSux9AzgCQ"
  },
  "Uttz9VG3Ma_wTqyLI6eSsA": {
    "date": "3/15/2015",
    "text": "Just went here for lunch. I had a 3 piece chicken tender meal and hubs had a grilled chicken sandwich meal. There had to have been 25 smiling people working there for opening day so kudos to them for being prepared. Food came out quick and it was delicious. They were giving free shirts and balloons to all the kids. Imagine Cane's plus more sauces and desserts.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "X9E9mrd3ZTV3RDZrzmFc8g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. 3 piece chicken tenders meal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X9E9mrd3ZTV3RDZrzmFc8g/o.jpg"
      },
      {
        "img_id": "bocJLyt_YmdHdFXwqOFBKA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Grilled chicken sandwich with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bocJLyt_YmdHdFXwqOFBKA/o.jpg"
      }
    ],
    "user_id": "VigsAph76fP7pechJ743EA"
  },
  "kRIUl1rWL-cLvkv-e4pmBw": {
    "date": "12/1/2017",
    "text": "Awesome food and amazing service! Must try, we have always loved Canes Chicken Fingers but this place is a step above. Extremely clean and great sauces and tv's around the place with sports on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xygyxcrb0NDb4J4Sby5XBQ"
  },
  "PWnwBuyxNY0NoKV7EUMs1Q": {
    "date": "10/12/2017",
    "text": "I drove past this place for over a year not knowing what it was. I didn't even know it was a chicken tender place.  This has to be the worst name for a franchise. It doesn't portray what is being sold there. At one of the 51's games I received a $5 off coupon so decided to try it. The chicken tenders are absolutely amazing. Probably the best I've ever had. The chicken is moist and tender (never frozen) and they have a bunch of different dipping sauces that are great! The only reason I'm giving 4 stars is because of the name of the place not being able to identify what is being sold there. The food and service are definitely five star. The employees are friendly, helpful and serve the food with a smile. Try this place out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F8_RFApBCBsXG3N4kGo0vQ"
  },
  "PdAM8-NPcjMzK0Q-lLPSlQ": {
    "date": "3/20/2018",
    "text": "Was very disappointed visiting the other day, when this location first opened the food and chicken strips and dipping sauce were amazing, canes had nothing on them except the name but as I dined there the other day menu tv was blurry the tables were filthy and as you came upon the hand washing sink and restrooms you smelled a stench of sewer not what you want when your out eating what was even worse was the ice tea dispensers they were filthy !!!! Very filthy. Kinda sad because this place was a 10 now it barely looks like the doors will stay open the strips were small now and the sauces were rancid almost spoiled and to top it off the new burger was terrible.  I probably won't recommend pdq or go back because it's a dive restaurant now it's too bad because this use to be a great place now it's RIP pdq.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2DCxM9vcAv5bx-DlqtG0Aw"
  },
  "eB2Sgcs33-2yrejlQw6eCQ": {
    "date": "6/25/2016",
    "text": "Solid road trip option! A nice alternative in the sea of fast food burgers. Ordered the grilled chicken sandwich, and shared an order of shoestring fries with my husband. He had the half grilled & breaded chicken strips and loved their garlic sauce.   Food was tasty and just the right amount. Would definitely stop here the next time we're passing through.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "C4o_GxtnyokmimIEWboUlw"
  },
  "ScAwabXBaGJer8CNwHpJTA": {
    "date": "3/24/2015",
    "text": "PDQ provides a great alternative to fast food we usually eat. I ordered the chicken strip kids meal for my so  and he said it was perfect. He is the pickiest eater. Even though chicken strips are his favorite food there are just some chicken he will not eat. Inside the restaurant is very roomy and lots of seating.  As far as the chicken strips the meat was high quality and not too much batter or grease. We did not try any sauce because he eats it plain.   The fries had a good salt level but were a little too soggy for my tastes. Hopefully they will come out with more side dishes in the future.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TMpzSLxJ-MnHT0Xvp0Cl_A"
  },
  "n5eOe6fkpJbwwiAKsJ90qQ": {
    "date": "3/23/2018",
    "text": "Went there yesterday for lunch. I ordered a crispy pimento cheese chicken sandwich. I received my sandwich in as much time as I could wash my hands and fill a water. As a matter of fact... all 4 of our food orders were just as fast as McDonalds.  Orders came out in about 2 minutes, maybe less.I took one big bite into my plump crispy chicken sandwich and I got a mouthful of raw pink chicken. It was really gross. Took it back and manager on duty offered me another meal. So I got an unbreaded chicken sandwich with avocado. That sandwich too also was handed to me in about 45 seconds. What?  Are they precooking everything here now?  Another poorly prepped sandwich with all of the avocado unevenly placed and hanging out the rear of the sandwich. This place IS NOT about QUALITY.  Rename this place to PUD with no Q for quality. People Undedicated to Quality because this place serves way too fast to be properly prepped.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edfrbX4KMM9RAXOUYXKxpw"
  },
  "k_xFg192ONDgUnOVpeE_pw": {
    "date": "4/1/2018",
    "text": "My new go-to place. The food is SO GOOD and fresh! I dont frequent faat food places because the chicken...isnt real chicken. Here the chicken is 100% white meat and delicious. Tried the burger and it was YUM, Angus beef on a potato roll. The service is also wonderful. The staff is so pleasant everytime and the food is not only affordable but consistent. I love the variety of dipping sauces and drink options.  Also, the restaurant is very modern and clean a twist to conventional fast food places. I love the barn sink in the restaurant that allows you to wash your hands before you dine. Granted you can just go to the bathroom typically, however its just a nice touch. I love the lavender soap they supply. My only negative comment would be that the floor is always sticky near the soda machine, I wont take off a star because I understand that its tough to watch for everyone who spills in that area, which Im sure is often. Its just a little inconvenient when you walk over for soda and tge floor is sticky and it then creates the bottom of your shoes to now make thay sticky sound everywhere you now walk. -1 star because there is a slight \"old wet towel\" smell near the drain by the soda. Ive been to the restaurant 2 times so far and this smell is standard in that area. Its defintely the drainage and Im not sure how this could be corrected. Over all great experience and literally crave the zucchini fries...im actually thinking about them RIGHT NOW! Oh lastly, the peanut butter chocolate chip cookies are phenomenal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZx_n-uAllzDMaIbiZM_Ew"
  },
  "plI6LO_uDteuypdMTqx9mA": {
    "date": "12/20/2016",
    "text": "Never been here before and I can say I'm very impressed with the customer service we received. The employee was very friendly and kept asking if we were ok after giving us the food. The food was also great. I like the fact the have tons of sauces to pick from as well. We'll be returning happy customer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4XR2r8QI9Z1y0AiyVc-U0Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Pdq 5 piece tenders",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4XR2r8QI9Z1y0AiyVc-U0Q/o.jpg"
      }
    ],
    "user_id": "Z1elyh9rDtx4S22uIo75-w"
  },
  "UYm6DU_oaet9Tiq0ntDOVw": {
    "date": "5/18/2018",
    "text": "As a long-time fan of Chick-fil-A, I wasn't walking in expecting to be comparing the two. But as we ordered, sat down, and were served, I couldn't help it. The service is as good, if not better here than at CFA. The sauces are better, and so is the chicken! Everything was very clean and we were thoroughly impressed. I would like more sandwich options--I think next time I'll just be getting chicken strips because I ended up eating just the chicken off my pimento crunch sandwich. Very impressed!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rgK8DVNwbl16qMjsv6EcMQ"
  },
  "22ptfXq-As1spLn22cutnA": {
    "date": "4/3/2018",
    "text": "PDQ has great fresh chicken and a multitude of sauces to choose from. There breading is light and chicken strip size is average compared to other restaurants. Their fries are just average and are shoestring size so being used to larger fries such as Canes I was disappointed. Overall i enjoyed it and would return. Staff here was average fast food service with no complaints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "trFzpf8Tvmr6B3Ub13-CzQ"
  },
  "snB1Sauoc_Is6ofMo3D1_Q": {
    "date": "4/18/2018",
    "text": "The food is awesome I really love the variety of sandwiches and other items on the menu.I need to single out one of your cooks there I feel bad I didn't get her name but she needs to be recognized.Monday April 16 around 1230 my mother in law aunt and my young daughter had lunch there.The food was great and my aunt who had never been there was blown away by how good it was.During our meal the chef came to our table and asked if she could make a milkshake for my daughter.It was such a nice thing to do and my daughter really enjoyed it and that's all she talked about the rest of the day!Thank you so much for making our dining experience pleasurable and for making my 3 year olds day!Oh and the shake was great also we all had a sip :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytP6rkK-QXINoCkINmXc4Q"
  },
  "8SwhzGuHcn8NdujhVN5Pxg": {
    "date": "11/5/2018",
    "text": "Outstanding service! This place is packed on the first Monday of the month due to the half price deal for military. Yet despite the huge crowd, they do an amazing job hustling, staying on top of everyone's orders, and providing amazing service with a sincere smile. Super professionals! I'll be coming back here again and again for the great food, and stellar service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nbrac5VroHNAbo6EOlDcyw"
  },
  "XC3fsvkmslOuPXXM1wjXUQ": {
    "date": "7/23/2017",
    "text": "Ordering was a breeze and food came out quickly. Enjoyed grilled 10 pc tenders, zucchini fries, a taco salad w a small drink and a \"Cherrywine\" beverage. For my hubby and I with nice take home left overs... $30. They accidentally gave us a 5 piece and quickly corrected it and gave us 2 extra tenders! That's much appreciated!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2LAtCI6mTvi1QEPJoyLLiA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Gotta try this place!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2LAtCI6mTvi1QEPJoyLLiA/o.jpg"
      },
      {
        "img_id": "perLc1LzeZ5ARVKnUkm91g",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Worth it!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/perLc1LzeZ5ARVKnUkm91g/o.jpg"
      }
    ],
    "user_id": "r1BNhoXQKv0DqI0yLp_HFQ"
  },
  "J1cn47YId4lbU6mgC_cbRQ": {
    "date": "2/19/2017",
    "text": "Ehhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh.  Honestly, ask me last month and I would have given this location 5 stars.  Staff is friendly. Managers always nice. Place clean.  However, they changed the fries - and that was one of the best parts of the PDQ experience.  Plus, the chicken was MUCH smaller then on previous visits.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "US5TnFHzeZLWHgwzArQJrw"
  },
  "MsQ03vRxKpEYRAqxqhvXMw": {
    "date": "4/20/2018",
    "text": "This place so far has been A+. I've only had their bowls so far, and I love their queso bowl! Definitely try it with grilled chicken vs.  breaded though. The saucy bowl is a really good one as well. I had the Thai peanut bowl today, and I'll honestly say it's not a big hit for me. The mango salsa doesn't pair well with the peanut flavor in my opinion. But their customer service is good, and they get orders out pretty quickly.  Strawberry shake and banana pudding shakes are delicious as well. You can taste the freshness of the food every time you order. I recommend this place to anyone who asks for a good spot to stop at, and it is now our #1 place to try new menu items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wWkIpFosPx1HJJzHvM3vIQ"
  },
  "FKHf6ptj6XUmKM4IStQzCA": {
    "date": "5/24/2017",
    "text": "Always great service when I come here. Very friendly staff and great food. Love the sandwiches, salads and shakes! Shakes are half off if you order between 3-5pm EVERY DAY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IVhd52S1wRToLVNPFQaipA"
  },
  "L0VVRNOBL141duq8t5DChw": {
    "date": "10/5/2018",
    "text": "Enjoying PDQ (my new chick-fil-a replacement). So far the honey butter chicken is my go to. I would choose the chicken fingers over the chicken nuggets, and their salads are descent (order an extra strip or two). So far not let down! I think three trips in two days will tell you I'm sold!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9dJjhCGyo9TLQKUq7LG6g"
  },
  "djInPk5X2A48DfFskYfgzA": {
    "date": "8/12/2017",
    "text": "This place is cool so far. Their grilled chicken tenders are ok. I've tasted better. But the dips are delicious. They could have kept their french fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "88ohfvWxSZOF-3fD77EvSA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Grilled chicken tenders &amp;amp; fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/88ohfvWxSZOF-3fD77EvSA/o.jpg"
      }
    ],
    "user_id": "jP6ZoWBJXEXWd2rOLKkwuQ"
  },
  "KcgOBeTZDlJ525SAUfox-A": {
    "date": "4/4/2017",
    "text": "After driving by this place a few times and checking out all the Yelp love it's received, I finally had the chance to stop by on Sunday.  I was in a bit of a hurry so I opted to go through the drive thru rather than inside.  The drive thru is set up in such a way that you order face to face which is nice so there's no miscommunication issues with a speaker box.  After I placed my order (a 2 tender kids meal with ranch and a dr. pepper), the young lady taking my order asked my name.  I told her and wondered why that was being asked at the drive thru.  When I pulled up to the pick-up window, I was pleasantly greeted by a gentleman who said in a friendly voice, \"How's it going, Tara?\"  A ha!  So that's why they asked my name - nice touch! The food.  It was...good.  Not great, not awful.  Just good.  The fries were my favorite part.  It's hard to describe some things and these are one of them.  All I can think to say is that they were cooked well - not too soggy but not hard, had a good potato flavor and despite the fact that I got a kid's meal the fry container was quite big - definitely bigger than most kid size fries.  The chicken - and I know I'm going against the grain here - it was pretty underwhelming.  Don't get me wrong - it was obvious that these were high quality and freshly made.  It was just that the taste wasn't anything to Yelp about, you know?  What really turned me off, however, was the ranch.  Thing is, I didn't even taste it.  Here's my issue.  I like cold ranch.  I don't want to dip my fingers in ranch that's as warm as the finger itself.  The container of ranch was placed inside the same container as the chicken and I'm quite certain that heated it up to a temp way too high for my liking.  If you're good with warm/hot ranch, knock yourself out.  Me, eh...not so much.  I'll be back for sure cause the customer service was grade A and the menu had a lot more to offer than just chicken fingers - burgers, sandwiches, salads, etc., etc.  I'm a fan of the place in general, jut not the chicken fingers in particular.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vpvW58vXP9xuOsWg-OCFxg"
  },
  "qE64cEr3JkXMaaerpobyDw": {
    "date": "12/7/2016",
    "text": "Why do you have to be so delicious and so far away? I found out about this place after reading a \"Top chicken restaurants by State,\" and this was on my list of places to try.  Seriously, Buffalo Blu was the best sandwich ever! I would drive the 5 hours just for another one. I ordered the creamy garlic and ranch to dip my fries and zucchini fries in, and I liked the ranch more. The Sriracha ranch was good too.  Next time I'm ordering 3 apples with toffee and 2 crabapple cookies. Seriously, couldn't get enough!  Also, they do military discounts on the first Monday of the month, at a generous 50% off.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6VzcTEyS3henXbV4-vhrA"
  },
  "m9_rZRDIiCzug4O0HECE3w": {
    "date": "1/14/2018",
    "text": "I love this PDQ. The place is spotless and the food is fresh and good. The service is friendly and fast. My favorite is the grilled chicken salad and the apple slices wit toffee. I've recommended PDQ to friends and family. I will keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LoYV1-2skOxiwrf-cdrfdw"
  },
  "66rMyaRIU-7G0BFwsLmizw": {
    "date": "4/1/2017",
    "text": "I was scrolling through my Instagram and PDQ had a $5 coupon. I had seen it before, but didn't know anything about it. I was hungry, I was passing by and I decided to go in. I looked at the menu and I figured the best decision was a chicken tender meal. I think it was $7.99 before the coupon.   I went to go get a drink and looked around. One really amazing thing is the sink by the drinks. Sinks can get pretty nasty and I was happy to see that it was SPOTLESS and didn't have water underneath it. The drink area was also spotless. I feel the need to mention that since at many fast food places the drink area is atrocious.   After I settled into a booth, I looked around. It's bright, clean and unlike most fast food (or fast casual) places, there are televisions. My food was brought to me rather quickly, so I didn't expect it to be good. I am a Raising Cane's fan and I would have a hard time saying which is better. I have no clue what people are talking about with the fries because they were so good, I finished them before all of my tenders. My visit was only about two weeks ago, so I don't know about the fry change. The ones I had were perfect. The chicken was just the right mix of crispy on the outside and juicy on the inside. I am very particular with my fried chicken since I only eat it at Cane's, CFA and Blue Ribbon Chicken (I eat one of those once a month). Otherwise, I only eat grilled chicken.   I am not one for sauces. If food is good you don't need to top it with sauce. I didn't put anything on these tenders. Any sauce should complement the food, not mask it. And the food should not NEED the sauce. I dip my Cane's into their sauce, but I don't drown it. And I use the sauce because its ridiculously good. I love honey on my chicken, so the next time I come here I'll try that. I read some of the other reviews, and it's great to know the rest of the month when I am eating clean I can come here as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oudy2U42uvQnAprRUQxUBg"
  },
  "AzppQ5Py3fBbrAoZOlTcBw": {
    "date": "11/8/2016",
    "text": "From the time I walked through the door I felt welcome and comfortable. The cashier explained the menu in great detail since I was a first time customer. I watered the Cali club basket. There are several options for science and I chose the fries. They were good and crispy. I was also offered several choices of dipping sauces, and I chose creamy garlic and ranch. I love the Coke freestyle fountain machine. So many different drink choices. While I was eating, an employee came up to me and asked if I wanted any additional dipping sauces or anything else. Very friendly staff. I will be back very soon!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gYwqh7HcAXg3rkPxXEhrIQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gYwqh7HcAXg3rkPxXEhrIQ/o.jpg"
      },
      {
        "img_id": "SWxc7MPiDHful0jgxeHJpQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. From the time I walked through the door, the staff made me feel welcome &amp;amp; comfortable.I ordered the Cali Club basket with fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SWxc7MPiDHful0jgxeHJpQ/o.jpg"
      }
    ],
    "user_id": "OfUXPtzY4qGUum1Ln6eYaw"
  },
  "KIp6TpGFHDRQMFA90sMs1Q": {
    "date": "11/2/2016",
    "text": "I like the chicken, could be fried just a bit longer. The fries are horrible, way to thin, fried hard, no salt. My 7 year old Godson didn't like the fries either. A bit pricey for chicken fingers. Love the multiple sauces.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ov0cAfPHZJa17ZrSbBc0dg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ov0cAfPHZJa17ZrSbBc0dg/o.jpg"
      },
      {
        "img_id": "keTwXO2p9rEsJTSeLQVjOQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. My ranch spilled before I can snap a pic.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/keTwXO2p9rEsJTSeLQVjOQ/o.jpg"
      }
    ],
    "user_id": "Oyvf6_sK4HwwEwDkca0vYg"
  },
  "maKxTQMSPjZk10Xtl4OmXw": {
    "date": "4/7/2017",
    "text": "This is my kid's happy place - CHICKEN!!!  Great food, a friendly staff, and nice management make this restaurant easy to like.  The prices are good - a bit more than fast food, but this really isn't fast food.  They sell Cheerwine, a black cherry flavored soda from the Carolinas, which makes me yearn to be back east.  The Honey Butter Chicken sandwich is there specialty (I think) and it is executed really well, and it knocks Chik-fil-A out.  The Buffy Bleu sandwich might be my personal favorite.  As much as I like the Cheerwine, I usually get a Peanut Butter Chocolate shake. The kids meals are good value and offer apples as alternatives to fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rJBzyJDukByX8p3omB43ew",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rJBzyJDukByX8p3omB43ew/o.jpg"
      },
      {
        "img_id": "lR1pB8JlR_s28sPOCNWufQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lR1pB8JlR_s28sPOCNWufQ/o.jpg"
      },
      {
        "img_id": "q5bJWaRH7YVYQLsIHrJreg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q5bJWaRH7YVYQLsIHrJreg/o.jpg"
      }
    ],
    "user_id": "NZ_MNakh_nK6zmxNmYg5Gw"
  },
  "LTAP14c6faGpFFufOgF0Hw": {
    "date": "4/4/2017",
    "text": "Very good clean and reasonable priced place to pick up fresh food! I like the atmosphere and the workers are so courteous . Puts you in the mind of chic-fil-a. Sweet tea and lemonade was perfect!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AIfmJ0VKdWBHd2jF1pTwJg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Thought I&amp;#39;d stop and try this place since I was staying in Vegas for the weekend",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AIfmJ0VKdWBHd2jF1pTwJg/o.jpg"
      }
    ],
    "user_id": "lUmPXqYiM6GXK6wE7eyjiQ"
  },
  "wVppuM0y7c7mNH2-XyaCYg": {
    "date": "5/28/2017",
    "text": "Love love love their fried turkey sandwich!!!! Order it every time since the first time I ever tried it... Apple slices in pineapple juice is so addictive! Fries are good too and if you don't feel like soda then get their bottle of water always cold and just right on a hot day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tl4hhVWAjq-e640FIIM6lA",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tl4hhVWAjq-e640FIIM6lA/o.jpg"
      },
      {
        "img_id": "9lbyvW83vhX4EcQ-r5408Q",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9lbyvW83vhX4EcQ-r5408Q/o.jpg"
      },
      {
        "img_id": "qDv0dk95BJrYt2VSPwj7qg",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qDv0dk95BJrYt2VSPwj7qg/o.jpg"
      }
    ],
    "user_id": "l1kcUw3h7_61R6V_7Y6_1A"
  },
  "pisaAslncvi-W8BtsXsKPw": {
    "date": "5/21/2017",
    "text": "BEST CHICKEN EVER! If you haven't tried this place, please do. The food is fresh, the sauces are made in house, the portion are amazing. You feel good after you eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c3gkbwQh3yncF-mlmVsSEQ",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. Crispy chicken salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c3gkbwQh3yncF-mlmVsSEQ/o.jpg"
      }
    ],
    "user_id": "EldgV001x1GX7I5zQbaAxw"
  },
  "3dRo0G1FrMgwYW9VnYfnjw": {
    "date": "10/30/2015",
    "text": "I must say i love this place i have a favorite drive thru cashier but i never can catch her name i will update you all next time on her name she is awesome and always in a great mood i love there chicken fingers plus everything there is awesome no need to go to canes i have pdq down the street",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCCzsKB06YpMphaHFBRdlw"
  },
  "34Z13i_4gnz4IUzQCSH7KQ": {
    "date": "8/16/2015",
    "text": "First time here but definitely prefer to raisin canes. Best tea green I had in long time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pI0SVx3uq_f1F8YWIBH3Pg"
  },
  "2YBVXAbbdLZ6iyF9oLOUmg": {
    "date": "5/28/2015",
    "text": "I really like their crispy turkey sandwich (without the sauce - I'm just not a saucy kind of gal). It's a nice change up from the standard chicken sandwich. Their coffee toffee shake is to die for... LOVE it!! The service is quick and the employees all seem very friendly. The restaurant is clean which I very much appreciate :) I wish I could go 4.5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_qxFm-sRJ1i-j9e2ql7xg"
  },
  "ozeZGN_gwkfAWTT8Vel1sA": {
    "date": "5/27/2015",
    "text": "Absolutely delicious. Chicken tenders and fries are great. Menu is similar to Canes but in my opinion is better than Canes because PDQ's offers buffalo sauce. I hate mayo which is a main ingredient in Cane's sauce so it's nice to have options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bzfn2mLU9c5-dwQyu-eJxg"
  },
  "H318uQSEpJXMPyJEVgHulw": {
    "date": "10/22/2015",
    "text": "I ate a chicken sandwich it was so good. Justine was nice and professional, the whole staff was awesome, I enjoyed ordering from a human through the drive through and not those speakers. Great fries, apples and coleslaw. Such great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OSEXy2qfVahn22XNyhAfzA"
  },
  "D6I9YpxuxB7oeaTrDG0i0Q": {
    "date": "3/16/2015",
    "text": "My husband wanted to try this place so we decided to stop by on the way home and go through the drive thru. Instead we went in because of the long line...the manager was outside talking to the people waiting in their cars which was pretty nice of him. Great atmosphere inside the restaurant so we decided to dine in. The place was packed but it didn't feel crowded at all. I ordered the buffalo strip sandwich which was delicious!! The chicken was juicy, the breading was nice and crispy, not oily at all, and the sauces were really really good!! Service was great, prices were reasonable and the food was very tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xfc2MIwud-wV-ck2hk3oRg"
  },
  "67MTXhyCn1mzGFSUM7C_8w": {
    "date": "10/10/2016",
    "text": "Amazing !!! The variety of sauces gives each family member their own choice to compliment the tenders ! 1 st Monday of the month 50% off for military! Thank you ! Makes taking out the family out for dinner affordable !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUm8Qgjh5rEEh6v1SmK8uA"
  },
  "HCh3mz4NosZeYJRpv0Pmfw": {
    "date": "9/28/2015",
    "text": "We like to rely on Yelp reviews when it comes to trying out new eating places.  I'm so glad that I read the reviews of PDQ; it led to a very enjoyable dining experience there recently.  The chicken and turkey sandwiches were incredibly fresh and delicious.  The sides were just as fantastic.  And the environment was extraordinarily clean and inviting.  You can tell that the manager and employees take a lot of pride in their artistry.  We can't wait to return again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zlxj5sTkWIs_GtcWAkBavw"
  },
  "75GPXTnMKX6nd0xSnA850w": {
    "date": "6/28/2016",
    "text": "Being a senior , my husband and I are limited to where and how often we get to eat out. PDA gives us good bang for our buck. We love everything about PDQ, food, service and value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gvVqmHPMPm4kp_zwW2fVmw"
  },
  "tpRxDkrrW9vSSCvs72iL0Q": {
    "date": "3/29/2015",
    "text": "This place is really good !!! Coming from a canes background being that I use worked there and it was the only chicken spot in the area, but enough about that back to PDQ I hope they raise up in Vegas because this place rocks my first experience their my husband and I walked in around closing time the first person we spoke to was a gentleman by the name of Daniel he was so cool and made our time there well spent but let's get to the good part the food ! Omg the chicken is super juicy and cooked to perfection the fires are natural and not a (Wendy's natural) but natural and the selection of homemade sauces are pretty good my personal favorite are the creamy ranch and the creamy garlic to die for ! And I don't know about you but u love the second day test I usually do it with pizza some pizza is better on the second some isn't this chicken passes that second day test all and all go try this place out and get some good quality chicken for yourself you won't be sorry",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqT5lLWPFaRAboI_KnNOsg"
  },
  "TRsaqghlwRSFCCaHLAAsOg": {
    "date": "9/14/2016",
    "text": "Don't go after 8 pm I got cold chicken cold fries but it was served with a warm smile.first visit and last visit next time I will drive to canes on Decatur and 215 they will be open Sept 30 2016",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYBWDj-Gmv49MiyV7I_J0Q"
  },
  "Q99b-BnwgqQIem-m5hjaiQ": {
    "date": "8/9/2015",
    "text": "My Fiance and I have gone here a few times and everytime we have gone its great and fast service. Chef or staff checks on you to see if you need anything. Their lemonade is so good! Their food is great also and the options are good too. They have so many choices for dipping sauces. I can honestly say its better than canes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4CQjjnkiWYlzGwbEsJNpDQ"
  },
  "Zphmo80MkQsD-c9UjqsL-A": {
    "date": "4/28/2016",
    "text": "A tasty and affordable place to eat!  The food is consistently good and the service is great.  They also have my all-time favorite green tea from Joffrey's.  I think it's overall much healthier than Cain's and they also offer more variety in terms of sandwiches and non-french fry sides.  In addition they have half off for military on the first Monday of each month.  It's also a bit of an oasis of a nice place in an area filled with strip malls and mediocre dining options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fRN_OqwTgaZIJevzZIC2TA"
  },
  "Re642XdNWnY9YJcah2NMJQ": {
    "date": "7/19/2015",
    "text": "It's like Raising Canes but better.  More sauce choices, the chicken strips taste a little better and the staff are just as friendly.  You also have more drink choices, especially the shakes.  If you like chicken strips, this is a good place to get them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gczcslKnGPvJ5xcGUThWVw"
  },
  "dbOsQH0Ckk4ayWOok4fw6A": {
    "date": "3/15/2015",
    "text": "Lots of workers. Wait time was quick. New place, looks great. But....Fries were limp. Lemonade is so fresh squeezed its like sucking on a whole lemon, I couldn't drink it. Chicken Fingers were like anywhere else in town. Not sure if I'll go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmUdixE_8DAGPK84gZgOAw"
  },
  "-r_PgyKh2UqB9EJ3rdF36A": {
    "date": "9/6/2015",
    "text": "Seen it and decided to try it. Super good food. Super relaxed staff and they were all more than helpful. The chicken is etter than canes and has more choices than just fries and chicken. Super clean and everything we had was great. Blueberry coleslaw was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yejsp1pk5Te_5OpS-3J1lA"
  },
  "neb-6DZKW98baLwkt2dJYw": {
    "date": "1/8/2016",
    "text": "Great service. Great real food and dipping sauces. Fair pricing. I would like to see carrots and celery added to go with my buffalo strips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NoD5ncvGvUlIQXkXZJmE1A"
  },
  "lzcIgGcQSIOUB0MRHuHr5w": {
    "date": "6/25/2016",
    "text": "Great place !  Excellent food - we had grilled chicken tenders and the most amazing zucchini strips.  Angelica took our order and recommend favorite sauces which were great.  They also have a host, Daniel, who circulates among the diners asking if everything is OK, need more sauce, cleans up.  He has a great personality and truly cares that everyone is pleased with their experience.  Vets - don't forget great discount the first Monday of each month.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TeEEvoajfGf0gJhKAqyu3A"
  },
  "9u3Nk-9xNorkZK57fgoi6A": {
    "date": "3/25/2015",
    "text": "This place is unbelievably awesome! Every single employee is top notch with stellar management to boot! Toby (manager) came and spoke with us along with other employee's. Made us feel like we were family. My daughter thought the hand washing station was so cool! The food? BOMB! An employee came by and asked my daughter what PDQ stood for and when she answered correctly he gave her a shirt! Needless to say this is our new spot. Great people, awesome food, and good vibes. Thank you guys for being you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U_2_WXkIMDKFpKC5_app3A",
        "caption": "Photo of PDQ - North Las Vegas, NV, United States. This is one happy girl! An employee came by and asked her what PDQ stood for and she answered right so she got a shirt! Love!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U_2_WXkIMDKFpKC5_app3A/o.jpg"
      }
    ],
    "user_id": "9Xs8Zj5g8P8SNjUL-Nkk9Q"
  },
  "tt7P5y6RdDGwI2Mz2dKofA": {
    "date": "1/5/2016",
    "text": "Went to this place tonight and got the best service! Imagine service equivalent to, if not even better than chic fil a. The food is always delicious, fresh, and so tender. They are very quick and super friendly. Every first Monday of the month is military days where you get 50% off of your entire bill. We did not even know this, but the amazing cashier saw my husband's military id in his wallet and made sure to give it to us. They equip you with whatever homemade sauce you would like and will get you more throughout your meal without hesitation. My favorites were the buffalo and honey mustard. Their peanut butter chocolate milkshake is the best!! I'm sure all of their shakes are good. The manager was even kind enough to give us a bottle of water on the house towards the end of our meal when we requested a water cup. Very great service and quality environment. Will be raving about this to my friends and definitely will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORahNUXqewydADwXk4T_7g"
  }
}