{
  "MeXhXQ3sO165ZXEFMeNCmw": {
    "date": "12/20/2015",
    "text": "Really good pizza at a great price - $7.99 carry out special. Nice people who appreciate the business. NOTE: the wings are the bomb. 60 during football games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "R6oSn1jeP0xuGlhk1ZPmgw"
  },
  "k4rTaxpqqQHj27GCwzfAsw": {
    "date": "1/16/2016",
    "text": "Should have listened to the other reviews about delivery time being slow!  I know it is Saturday night but when delivery time says 45 mins to an hour it should be within that time frame. And if any later, you would assume someone would call to say so. Nope!  Waited for over an hour & a half and still received no food. Finally decided it wasn't worth the wait & cancelled. Really disappointed because there are other great reviews for this place. Maybe next time!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9LUjipZxdqAVkGR5jg1AWQ"
  },
  "5b1xbo50ObJQvq0a3Vgk4g": {
    "date": "10/18/2017",
    "text": "Cant go wrong here , the pizza was out of this world the calzone was great, and the girls of course are picky about everything but that's nothing new I felt the delivery fee was a little high but the overall everything was well worth it and I will be ordering again and again and again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SsTWwLrvHhaveUtWAKwhJg"
  },
  "w_vyv_0P2rqQuEdZNftSUQ": {
    "date": "9/15/2016",
    "text": "I feel bad for those who wrote the bad reviews. This place is incredible!! You'll be happy :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G5grFwdEK69cEV5uX6gJgQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Perfect for movie night",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G5grFwdEK69cEV5uX6gJgQ/o.jpg"
      },
      {
        "img_id": "2T1qFrIoGo9Ww6IP4fbEhA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Very happy :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2T1qFrIoGo9Ww6IP4fbEhA/o.jpg"
      }
    ],
    "user_id": "9zIqRE01sX3Ez2PhweCfgw"
  },
  "OKueu5-tc_EinzW0kZQbLw": {
    "date": "12/5/2015",
    "text": "This is the best pizza I ever tried in my life!!! This is exactly how pizza suppose to be.  I ordered couple times from them and always the pizza came on time always hot and always good! I will defiantly order more and more from this place. I think it's family owned pizza and they really take care of it.  Thank you guys for great job! Keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gBzcQ-FFvEVUdIxdUdf3EQ"
  },
  "4bfIeUgPnmUfFPbgM3XzZA": {
    "date": "1/20/2017",
    "text": "I would not come here again. I ordered some food for delivery through yelp eat 24. The food was not average. It was not good. The chicken wings were chewy, the pasta did not taste fresh or flavorful, and onto of that, they messed up my order. Double of everything. Gee",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScwVhHmUFLZwVW9E5fvKjw"
  },
  "qGPMbA9-N088Dsq7YFi-pA": {
    "date": "3/2/2017",
    "text": "I ordered delivery last night while helping move a friend in this area. Delivery time was decent, and portions were pretty generous for the price. However the garlic knots were burnt and the wings made my husband sick.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m1IVpXClMox1VGw5hO2LhQ"
  },
  "CRdlWjEOOuHjerLPgJ25bw": {
    "date": "4/28/2017",
    "text": "Awesome place. I get the same thing Everytime and it works.  Pizza , wings and steak bomb is amazing !!!  I'm so glad it's so close to my house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAyeHsYIc1KlFnHfKz4mjw"
  },
  "24-iaK_9cEcUbtN1lFwBUA": {
    "date": "4/8/2017",
    "text": "The Good Greek is the way to go! Fantastic pizza, fast delivery, and amazing wings too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7C9LlbExZPbMJQNSNWw1A"
  },
  "a8tcCCItfWBalhQgtkeO2w": {
    "date": "1/10/2016",
    "text": "We ordered the 24\" pizza and that thing was amazing. With a sampler a total off 43dollars. Highly recommend this place to order.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bLt0vMT0K_YWfCgvsgNiiQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. The 24&amp;#34; size pizza.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bLt0vMT0K_YWfCgvsgNiiQ/o.jpg"
      }
    ],
    "user_id": "lxJEVNNn6iGjjxtDE9pOaw"
  },
  "owPpEj2lVEQIH4h9DLz5jA": {
    "date": "4/5/2017",
    "text": "We love this place for delivery. Food is always prompt and steaming hot! Great Customer Service whenever we place our order as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XCRLNhrt6mn7pUetiMgmAg"
  },
  "VBu0sasxR_-5UgRvIm0iPA": {
    "date": "7/12/2017",
    "text": "Their pizzas are massive!! Super delicious too. I'd definitely recommend. My husband and I nearly finished a 16in on our own in one night hahaha. Friendly staff, good prices too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QKbM4dN6GWaGCZDUGvF5Gg"
  },
  "cJoLCrR5IyOpDm5oJIYmpQ": {
    "date": "12/11/2015",
    "text": "Wow....wow...!!!! This place is beyond amazing, I just picked up a pepperoni pizza ,garlic parm wings & the smothered corn... & the ranch & blue cheese dressing that came with it...! Words really cant even express how good this place really is...  If you haven't went there yet you are 100% missing out.  The staff is also very friendly. Food was ready exactly when they said it would be:)  CANT WAIT TO TRY EVERYTHING ELSE ON THE MENU :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "MIQBdqF6A_DqkckgGVy4dg"
  },
  "HJSXxk0tMmqC9iyf1H8E9w": {
    "date": "7/8/2015",
    "text": "Based on \"iffy\" reviews on delivery, we decided on calling ahead and picking up on a wednesday evening. We ordered a pick-up special 16\" cheese pizza, a 18\" Philly, garlic balls, and Zeppoli . It didn't list sauce on the Philly online, so we asked for white sauce on it... which they totally forgot. Wait time was an accurate 30 minutes.  They only have one crust option. It's very thin with a slightly thicker edge.  . Not dusted with flour or cornmeal. It was also very chewy, and way too tough for my liking. Flavor was very plain... comparing to saltine crackers.   Toppings were of decent quality/flavor, but the cheese was SUPER greasy. Dripping off the pizza.   When we picked up our order and paid, they forgot our garlic balls, so we pointed it out and one of the guys went back, got a bagged box and brought it out to us. It was barely warm. The pizza and Zeppoli were hot... so they made the garlic balls before the pizza? I don't know. I didnt mention it and took our stuff home. After trying one of them, I realized they were dry... the cheese wasn't even melted on them... and they were hard, or overcooked, or something. I hate using the term \"inedible\" since I freaking love food, but I couldn't eat these. :(  Zeppoli was tasty, and the kids loved them. Can't go too wrong with fried balls of dough with powdered sugar on them though!  Overall, I was very dissapointed. Usually my family of four happily stuffs face... but we still have half of each pizza and all the garlic balls leftover.   On the upside, they have a very impressive selection of food ranging from pizza, pasta, salads, soups, sandwiches, pasta, chicken and ribs, and desserts.  I lowered my rating from 2 to 1 star for the location itself...it doesn't even have a sign on the storefront, was kind of dark/dirty and run down for a new restaurant. Also it is pick up & delivery ONLY. So I will not likely be recommending or ordering from them again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "o49BMRuk6Vzl8oCCK6EUFQ"
  },
  "2hur28TlnBWF0QHJhsbQaw": {
    "date": "7/11/2017",
    "text": "That's pizza place your parents took you to as a kid after a baseball game. Ty for bringing back the memories",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_QjDW_6gQEPmMpyYGvOHmw"
  },
  "cCgffdYl7Azf4zp1w4eOxg": {
    "date": "6/12/2015",
    "text": "So I was going to delete my post, but i wanted to keep my \"rant\" to show how things can be miscommunicated.  After my rant not only did the owner of Pelligrini call me to make sure i got taken care of,  Anna called me back to explain i didnt order oe pay for the wings!!  I feel dumb.  So, the moral ofnthe review, Pelligrini and the the staff are awesome and the food delcious!  (Disregard the following)  The young lady that took my call was helpful and friendly.  Explained what was popular and what her favorites were.  I ordered well done fried wings and when my wings came they were half baked wings. The young lady also told me how great the onion rings were so I ordered them.  They weren't delivered,  but I paid and ordered them.  I guess I am upset because I am really hungry and disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Uth6Ke4cxE3Mz3MOG-PjoA"
  },
  "lzYMJc2VMCKOO8c35NXp4Q": {
    "date": "6/4/2015",
    "text": "I loved this place I really did!!!!!! Until right now.... Ordered a personal pizza..... Asked for no cheese ! specifically asked for NO CHEESE. just got my pizza delivered . Tipped the guy 5$ on 15............. CHEESE ALL OVER MY PIZZA . I can't have cheese. So now I'm throwing away a whole pizza . Thank you soooo much! Bad bad bad!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkxlxIFb-0mHKOvIVPJCbw"
  },
  "N1iqthWL36nxgPxipkoPHw": {
    "date": "4/29/2017",
    "text": "My family loves ordering pizza and chicken tenders for here.  We have had many different items from their  menu and have never been disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2ULelfemFj_3E6JcTtKxg"
  },
  "RTdTKjXzaPDvl9hYBC2GHw": {
    "date": "2/26/2015",
    "text": "Received a flyer on my door for this place. The menu looked good and prices were fair. You can pick up a 1 topping large pizza for around $8 and they don't skimp on the cheese for that price either. The pepperoni tasted good and overall I was satisfied. Delivery area is limited but call to find out if they deliver to you. The guy who took the order and helped me inside was cool. I'm not a huge pizza fan however when my wife wants it from here I wont mind but I'll be interested in trying some wings and sandwiches in the future.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "G46VLqZDtX2QMTfOWkZ2Fg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. pepperoni pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G46VLqZDtX2QMTfOWkZ2Fg/o.jpg"
      }
    ],
    "user_id": "eytpwJXgg5nWU6jrlQ6qAA"
  },
  "zaQSYM4cWWRGVvTkhq9ptQ": {
    "date": "9/22/2016",
    "text": "Ordered take out here twice. The speed of the delivery is kinda a crap shoot. The first time waited well over the estimated time by 45 minute, and when the guy finally came, not even an apology. The pizza itself was pretty decent, just cold by now.  Second time the food came quickly, a bit before the estimate. Food was good, nothing fancy or something I'd write home about, but just about your typical neighborhood pizza joint kinda quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uU2B1vrqkpWJI30xoooabw"
  },
  "HZ-Vu8j_vkEhBSdH66PP7A": {
    "date": "8/13/2018",
    "text": "I ordered chicken wings. They had a drizzle of sauce on the top.  They were not tossed in sauce and I ordered the chicken Alfredo which the noodles were over cooked and chicken was  also over cooked and there was barely any Alfredo sauce.   The manager called me and gave me a credit on next order.  So they are good with me.  Hopefully they make food to liking. Thanks.   The food is great just had one bad time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7xFbUUSx30YDir8V3mozw"
  },
  "rZapEGEFOuODThbOnluTAw": {
    "date": "1/13/2018",
    "text": "We ordered here through Grubhub. Our food came earlier than expected. Pasta dish was HOT, actually had to wait for it to cool down a bit. Salad was perfect. I loved the way they packed up the food, kept the salad separate from the hot pasta dish; something a lot of places don't think about.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jhjntvVWlbHuXhMQ4-X_g"
  },
  "cbxk3Mc3qbAqsIYSS450Qw": {
    "date": "1/12/2018",
    "text": "I ordered from here a couple months back, and forgot to leave a review. I ordered their seafood linguine to be delivered through grub hub. The dish is one of the most expensive items on the menu, and was supposed to include shrimp, clam and crab with sauce on top of pasta.   The delivery driver showed up, I tipped him and he left. I opened the dish, and it was very hot (one star for the driver for being so quick). Unfortunately, the shrimp was way over cooked. Oh well, I could get past that, probably my fault for ordering delivery anyway.   What I couldn't get past was the fact that the dish didn't include crab, but krab (i.e. fake crab substitute). Krab can be good in certain things, but on top of this seafood pasta, it was revolting! Ruined the whole dish. I felt lied to. If I knew it was going to be krab, I would never have ordered it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0hxaeKlrnObsikUUMVO8Q"
  },
  "xK1GNsK9S5v5bP77BTM5XQ": {
    "date": "7/16/2018",
    "text": "Great pizzas. My favorite is the Pellegrini pie. The staff is always friendly. They always tell you it will be 1 hour delivery, and have yet to wait that long - excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JvjF7VFqyhXuWG3umtXFbQ"
  },
  "-Z2VY1QX39eg7sv7XLqnhQ": {
    "date": "8/14/2018",
    "text": "My company was in Vegas for our annual convention at the T-Mobile arena and we were looking for a pizzeria to deliver lunch to us, a group of 40 people. Because of the great reviews, we decided to give them a try. They did not disappoint. Ally & Lena had great customer service on the phone each time I spoke with them. The food was delivered on time as promised and everyone spoke to how good the food was. Arthur who delivered lunch made sure to communicate that he was on the way, even when he was stuck in traffic.  He even offered to drive the group back to the restaurant when the hotel was giving us a hard time about eating in front of their hotel. We are in Vegas every year and will be using Pelligrini again next year.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ojgb8qm2f3GIAtNIa-hQnA"
  },
  "KG05-_416DWBFLx-Adas2Q": {
    "date": "7/21/2017",
    "text": "We ordered in.7..20..17..good food...fast delivery.  We had the egg chef salad, chicken quesadilla and lasagna .  Tasty and fresh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I5Ufjsj4aHPzPYlbLIhtSw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I5Ufjsj4aHPzPYlbLIhtSw/o.jpg"
      }
    ],
    "user_id": "LTNVdxV-dju8YohtPCzbZg"
  },
  "z7yD8ic07Z_UGI5JnmHiCQ": {
    "date": "11/15/2017",
    "text": "***Review for 10/25/17  I recently moved to this particular neighborhood so I was sad to lost my previous mom and pop Italian joint. With that said, I was VERY happy to have found this place! Their menu is enormous and they have something that will please everyone. It's also very affordable, and they even deliver (with a minimal $1.50 delivery fee! what!?). With so many choices it was actually to pick one entree, however the staff was happy to offer their insights.  Speaking of the staff, they were extremely friendly and offered plenty of recommendations on their favorite dishes. My husband and I ended up eating inside the restaurant (which they are in the process of expanding, exciting!) and it was very clean. After listening to some recommendations, we ended up with garlic knots, mac and cheese, and stuffed shells. Being first time customers, they even gave us a 10% discount. It was very sweet. After quickly paying we took a seat.   Within 20 minutes we had received all of our food, and let me tell you, there was a lot of it! There were almost 20 little garlic knots, which I highly recommend if you go, plus huge portions of mac and cheese along with many stuffed shells. Both entrees even came with garlic bread (which we didn't realize so we ended up with so much bread!). Neither my husband or I could finish everything. We ended up with lunch for the next day. Love this place. Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KjMt33U4VCs84CQAEn3XUg"
  },
  "wM4u7Gt8lqY0pC3q_zJ5cg": {
    "date": "12/20/2018",
    "text": "It's a hidden gem! We ordered a mushroom and pepperoni pizza one night and once the pizza touched our palates and a moment of silence, we all agreed it was delicious! The crust was soft and buttery, very cheesy and the right amount of sauce! We ordered a side of French fries which where worth the extra calories and let's not forget the wings! Although they could of had more sauce, but the flavor was good! Next time I will only request more sauce on the wings ! My husband and I will definitely take a drive back there for some good pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QulS4N6airhCBihZlvYpJw"
  },
  "SoxKGwQTv3LG3VbDP-3FEA": {
    "date": "11/24/2018",
    "text": "Best pizza I've ever tasted in Las Vegas by far!!!! Seriously I was looking through my photos and found a photo of the pizza and I'm so glad I did because I almost forgot about this place.  So now I can order again when I come visit! Glad for my photos taking a screen shot of this delicious pizza place! And I'm super picky! I want that authentic Italian pizza like this place not American pizza like gross Dominos or Pizza Hut.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yesA9Tni-X95lq2RU7istA"
  },
  "UQ3arFB0XVV2pInc2qQw2Q": {
    "date": "7/8/2015",
    "text": "I was hoping this was sit down pizzeria. Unfortunately, they only have one table with two chairs. At that point I decided to take it home. The pizza took about 25 minutes to get ready. However, it looked delicious! The pizza was super juicy, the cheese was nicely melted and the topics were tasty and fresh. We ordered half Pellegrini and half Hawaiian. Their Pellegrini pizza is their signature item and it was delicious. The pizza was pretty meaty and the artichoke complemented the flavor. The crust was soft, but it did not bother me. The Hawaiian side was also very juicy, I'm really a fan of their cheese!  We also ordered the garlic fries which were  good, but nothing crazy.  Also dont forget to get your 15% off with your yelp check in. Overall, the pizza was good and very tasty, I would totally recommend it. The only bad thing is that it is only a delivery or pick up establishment.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "0YhXmXZr0eeeAAivCDQVEQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pellegrini and Hawaiian",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0YhXmXZr0eeeAAivCDQVEQ/o.jpg"
      }
    ],
    "user_id": "wtNopFY2ybprzk4FuEbWJQ"
  },
  "X2mAHnzIrzrSTo2To-bKkg": {
    "date": "4/7/2018",
    "text": "We moved here from Chicago and were on the hunt for a Chicago Italian beef. There beef with hot and sweet peppers and cheese was amazing. Also, their pan pizza is the best I've had since moving to Vegas. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ndS-sBhQWxi7y5zY1Ci8GA"
  },
  "-0cnQ4AA-4NgOKNx6PvCkw": {
    "date": "10/16/2017",
    "text": "Very disappointed. Nothing stood out. I'm almost certain they reuse condiments left behind from previous customers.   One star simply because chili cheese fries were ok.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1u8-eXt1wellHJ_LTTS1A"
  },
  "mwEFj5QXEiknH3LGUS8ryA": {
    "date": "7/9/2018",
    "text": "Good pizza crust nice employees a bit pricey 2 pizzas and a salad with cokes 80$ not really a kid place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3u1-gC4l7k6YEx47FaW-Mw"
  },
  "VXHTGbb0vRrg5s9r3LZE9w": {
    "date": "9/4/2017",
    "text": "Pellegrini bring the fire   this pizza  is delicious ! I ordered a Parma sub San Marzano sauce, chicken tenders and a Cesar salad.  Came earlier than promised, they said 1 hour it was delivered in 30 minutes.  FYI the pizza delivery guy super hot   food arrived hot and fresh.  I guess I got lucky today because they were having a special on the tenders today and I am Glad I got them.  The tenders are all white meat and very little breading, juicy and flavorful, the pizza? Yessss.  Thin crust, nice chewy edges, great quality cheese and the sauce was the perfect balance of flavors (I hate sweet pizza sauce) weird that I am about to mention their ranch dressing but it is really good!!   Great neighborhood pizza place that delivers to the afternoon zombies on sundays.  Can't wait till game days you guys better get ready for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vYfFmRk0IP5T2n87EtQUxw"
  },
  "1kSxOpXNYczUSvM1iUYJug": {
    "date": "5/30/2018",
    "text": "I have been a loyal customer for a few years now and I have never ever been disappointed. So delicious and not expensive at all. The staff are so friendly and it's very clean and organized. I always recommend this place to friends and family and they always agree it's the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV6wMkE_VIJDUrRTHOnTVQ"
  },
  "lXHAIOkA35ZNJ9duTGKl5A": {
    "date": "5/25/2018",
    "text": "Ordered delivery through grub hub. Delivery was okay tipped extra due to my address being out of delivery zone. Pizza was horrible like really horrible. I noticed a smell coming from the pizza box a potpourri perfume kind of scent which was very unusal but no biggie didnt think much of it. After eating a slice i couldnt get the taste of perfume out of my mouth. Yuck it made me sick to my stomach!! And if that isnt bad enough it was soggy and undercooked. Just really crappy pizza. So then i called grubhub to let them know they told me the restaurant refused to give me my $32 refund. At least grub hub stepped up and gave me a $10 coupon code via email due to this paid by cash. Bottom line horrible experience i will never be ordering from this restaurant again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uyB27ThcwC2KR-G5qWlsHw"
  },
  "SWF_GOCH41mokg_GQkQUUg": {
    "date": "8/6/2016",
    "text": "My fiance and I ordered food from here for delivery, we were so impressed! The food look gourmet and beautiful even if they were in foam delivery boxes.  The food was DELICOUS! Only downer is our garlic knots tasted a bit old. But we will order from Here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u2aDlO6LgU6Spp2jAf_TVg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. We ordered twice in a week.delivery is fast, and Alex the delivery guy is nice and friendly. The food again, is delicious !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u2aDlO6LgU6Spp2jAf_TVg/o.jpg"
      }
    ],
    "user_id": "Yi2sBdWFBdHmoPmF-3Kr2g"
  },
  "oU_VEZLW-xFL8Da1ZxxYAg": {
    "date": "6/24/2017",
    "text": "I randomly selected this place and ordered take out through Eat24 delivery app.   I had a most delicious calzone from this place. I ordered the small and it was huge, at least enough for 2. The calzone includes Mozzarella Cheese, Ricotta and Choice of Two Toppings of which I had pepperoni and Italian sausage.   With each bite it melted in my mouth. It was cheesy goodness!  Excellent.   Best one I've had in a long time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "2_JZcBO_KLAgxDQosHnt5Q"
  },
  "aMqC0RKaNC5w160QeQvy6Q": {
    "date": "5/4/2018",
    "text": "Great food and service  I don't eat pizza this much but I love this place   I had a large order for my office if 15 people and all the food came out great. Also came on time. Big portions and affordable The salad is fresh and really good.  Will definitely recommend and will eat there again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jhVTSsEzCpjra1bWqUmuIA"
  },
  "P0nkyOA5NV20fb-hZ2LAEw": {
    "date": "4/22/2018",
    "text": "Their delivery was early and the food was very good. I loved their bib lettuce salad. Will definitely be ordering from them again. VERY SATISFIED!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhoNlNXfc1KMAs_e_a43fg"
  },
  "Cogmer4fMu1kYWftXLuVpg": {
    "date": "10/13/2014",
    "text": "Their French fries are the bombbbb! Made to perfection, so crispy, the fries are the bombbb! The chicken fingers are good too, a little, ok maybe a lot of vinegar in their hot sauce... The vinegar is a bit much honestly. The people that run the place is very nice as well, it seems like they're all family which is cool. Bottom line is, I like this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QYGlsCDCO6sDzIVCkYEw9Q"
  },
  "2BgcRaRdT78hr7t7V5Hl5w": {
    "date": "12/11/2014",
    "text": "After finding one of their flyers on our door, we decided to give them a try, and we are glad we did.  Being as we have a hungry family, and we like left over pizza, we opted for the 30\" pizza with pepperoni and some garlic balls.  My wife placed the order on-line which went smoothly, and we chose to pick it up since they are only a couple of blocks from our house.  This also save us $5 on the pizza and the $3 delivery charge.  The only \"issue\" with the on-line order was after checking out it said our order would be ready in 10-30 minutes which I felt was quite a spread, kinda like the cable company when you need an install done.  In defense of Pelligrini, it was a third party web site so it's probably not their fault.    We decided to split the time and headed down to pick up our order 15 minutes after ordering.  When we got there we got a friendly greeting from a few of the employees. The guy at the register told us our order would be ready in about 10 minutes, and he was pretty close, it took 12 minutes.  Good enough for me.  The place was clean and had one table with a couple of chairs and a bench to sit on.  It's definitely a take out place so don't go expecting to sit down and eat. While waiting more employees came in to go to work and we received a friendly hello from them as well, which I thought was nice.    Our order was brought out and the first thing to pop into my head was, \"Damn, this is one huge pie\"  I mean to the point we had to take it home in the trunk of the car.  Get  the pizza home, grab a couple of slices and a few of the garlic balls and sit down to eat.  The pizza was quite good.  The crust was thin, but not cracker thin, and was light not doughy like other places.  The next time we order, I'll ask them to cook a bit longer as I like a little crunch to my crust, but that's personal preference.  The sauce had a good flavor and the cheese was good quality.  The pizza had an ample amount of pepperoni, to the point every bite I took had some.     Now onto the garlic balls.  These were quite good,  but I think they could have used a bit more garlic, but that's just me.  The outside crust was nice and crisp and the inside was light and soft.  Definitely with the $4 bucks.  While not the best I've ever had, overall it was very good and we will be ordering from them again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9qGOxS9tFI6M7QwG4JjYuQ"
  },
  "970AhQ-gKVn6cuDnrpBXcQ": {
    "date": "9/15/2014",
    "text": "Pellegrini's is located in a little shopping center strip mall that is about as non-descript as you get, but the pizza is something special. We get the pepperoni and the potato and herb and the latter is my favorite. The crust is perfectly chewy, and the cheese/sauce ratio is on point. Excellently priced! I have paid far more for far less superior pizzas. My only complaint is that the pizza is very greasy... by the time my husband and I had made the 10 minute drive home with our pizzas, there were already huge grease puddles bleeding through the sides of the boxes. It's nothing a quick paper-towel blot can't fix though :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0AI4ARKRC2ptXtDb4QT8JQ"
  },
  "N1wN3n99ORcWH1lIMG6smg": {
    "date": "7/2/2015",
    "text": "Really good pizza, the chicken fingers were great too. Customer service is top notch.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDEHGRdJyybSfagqZ_re4Q"
  },
  "-GvNv9ETsp6daJGdAAh0AQ": {
    "date": "9/12/2016",
    "text": "Love ordering food from this restaurant - I've ordered many different items and they all are delicious and hot when they arrive - I especially loved their hot subs because they do not new nuke hoagie the hoagies are fresh baked and delicious unlike other restaurants that have delivered and the hoagie wills are soft and mushy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zvXjAI7D9pNOs_mRkOKoTg"
  },
  "VWZ4BqbRvF-WpFr1madVgA": {
    "date": "5/8/2015",
    "text": "Food is ALWAYS amazing and ALWAYS on time and fresh! Keep up the great work guys! We order from here, on average, a few times a month and have never been disappointed. We've tried almost everything on the menu too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h4X30KkTuSOX9hxmZDsNZQ"
  },
  "Y7TYzSRL8N55MSwcwR4H2g": {
    "date": "2/28/2015",
    "text": "I have to say, the first time I ever ate here I fell in love. The food was so so good, the customer service rocked, and I was happy while eating. The more I order from them, though, the worse it gets. The salad is never the same from each time I order. They have tomatoes, then next time none or they'll have a ton of olives and next time only a few. The pizza, most of the time, I have to use my own pizza cutter because they only grazed the top of it. The last pizza I ordered looked like they put the cheese mostly in the middle and probably half an inch to an inch from the crust was no cheese. Once, I had gotten a pizza that was really burnt. I wasn't happy. The food is great, but I think because of the inconsistencies with the quality and quantity I will not be ordering from them again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUiisYNqV2nV7h770bpg2A"
  },
  "L4chnLZuPjcLGYWQKgltKw": {
    "date": "11/9/2014",
    "text": "I really like most of the food and the prices are good. I have tried so many places similar to this that deliver and I am rarely pleased. These guys are doing pretty good so far and that makes me happy even though there is still room for improvement. The delivery times are usually about an hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkawsUMWs-TzHfTpeBr_kA"
  },
  "tw9grPsSl1niutLI_2s3PA": {
    "date": "2/15/2015",
    "text": "First time ordering pizza from here and it was very tasty. We order a bbq chicken pizza and it was good it could have used more chicken. The overall flavor was good and the crust was excellent. This a very busy place so order ahead of time but in general the owners are very nice and prices are very reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5BcXo0_2CnOIORCFh6stQ"
  },
  "sHlSGuU_yGxf_6-rkXdgWg": {
    "date": "2/8/2015",
    "text": "This was our first time eating here. The food wasn't bad but it wasn't great. Great prices...nice people!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TduRVfCv_BXhzw15tWAFSw"
  },
  "eLMPZc6D_rJyrG87nToWBw": {
    "date": "4/5/2015",
    "text": "Decent place to order for delivery. One of the better tasting \"Everything Restaurants\". Good if you have the munchies and don't want break the bank.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "63XjNB4Htn61oGqU5jn2jw"
  },
  "nF6HgaDQSw_eaWohBJZWWg": {
    "date": "3/21/2015",
    "text": "Best steak salad!!! So delicious. Also delivery is all around amazing, fast & fee minimum is the most reasonable in this area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6wB4-Qeb6lMK6799IitdLQ"
  },
  "cK2wLGXW8tIlacQcxDR4JQ": {
    "date": "11/2/2015",
    "text": "Well when I moved back to Las Vegas the first order of business was finding a good, close pizza place. Found them on Google with good reviews and thought I'd try them out. So far I've tried 3 different types of pizza here and have been very happy with them all. Love that artichoke one! Usually a pizza place has different items on it's menu but most of them do pizza well but not other items. Was pleasantly surprised with Pellegrini's tho. I've tried about 5 different items on the menu besides pizzza. Love the ribs. Steak bomb sandwich was killer too. So I'm working my way through the menu with some confidence now. Competent,friendly staff  and good food. What more could you want. My go to pizza joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o2nJVaFjXYKnmKwOWTN4kw"
  },
  "6ee3XFjNQ23Sy2cBN3O09A": {
    "date": "7/19/2016",
    "text": "I was at Pelegrini today first time, I stop by for the lunch. I really liked it. Very delicious food, kind service, affordable prices. 5 star! I will definitely come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ocNjqzWm2WYHC9fhw8aDgg"
  },
  "9DP71HAVo7D0POx-Nz-YaA": {
    "date": "10/4/2014",
    "text": "Good specials/value, quick delivery within 30 minutes, friendly staff. Big crunchy juicy wings, but I didn't like the pizza crust that much, it was not crispy enough, kind of spongy. Good amount of cheese, but a little greasy, good sauce flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "irXUfVPNVLSXsSY-CeqERA"
  },
  "lZeH_adpoAXy-DrCk3xEFQ": {
    "date": "10/8/2017",
    "text": "i am editing this review.. its staying at the same star rating for a few reasons. the place was very appologetic that the pizza was almost 4 hrs late and offered incentives to make up for it, but i dont live there so they are no use to me. but, i have a recording of the 4th phone call asking where my pizza is and the employee says \"im sorry, i lied when i said your pizza was on the way\". and while i applaud his apology, there was 4 opportunities to correct the situation. and as starving as my family was waiting 4 hrs for food, the pizza was terrible. seriosly a 1 star pizza that ended up mostly in the garbage. and thats my honest opinion of the food and if i was given a discount in the future, i wouldnt even use it. i understand the place was busy and i even love cold pizza,  but this was a $50 waste of time and money. this review edited from 3 days ago when i have calm down and rationally thought about the situation. its always important to me to have accurate reviews on these places to make descisions.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gXshG81l0OvcT52_93yhA"
  },
  "f3zwE49sSoFOwExxAJityA": {
    "date": "8/15/2016",
    "text": "So this food is not very good.....not quality ingredients, pizza was dry. We had the Margarita pizza, the tomatoes were the small cherry tomatoes and the mozzarella was bland. Caprese salad with additional prosciutto was also dry and the meat was poor quality. Zeppoli was flavorless and needed more powdered sugar. Would not order again, so sorry!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-yZ5oU41zdk9Nq5oIRevIg"
  },
  "9RGfSl0gX42nwwaSVobKoQ": {
    "date": "6/28/2015",
    "text": "DELICIOUS. Hands down, THE best pizza I have had in a long time. Discovered them on GrubHub and I'm not sorry I took a chance. Try their speciality pizzas or just build one yourself. Their crust is perfect. Not too thin, not too thick, and just the right amount of crunch with the perfect amount of chewyness. And it doesn't taste like cardboard.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHB0De2T5zyuYTiUTsZnuw"
  },
  "O3pUbzBXooEqPEPo1FBJCQ": {
    "date": "10/1/2016",
    "text": "Most of the time I ordered from them the food was great, Had a bad experience last night, had the number 2 special wings and a pizza. the pizza was cold and the crust tasted like cardboard something you would expect from a store bought pizza. I hope it was just an off night or a bad batch of dough, The wings were okay, have had them better from there, but they were still okay. Might be time to look around and try somebody different",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8E1kj3YRNdtvpgI08NYCw"
  },
  "gUd-5Tb51wRKAk9rwW1StA": {
    "date": "6/18/2016",
    "text": "I love this pizza place! I've been coming here since it first opened. I'm from LA and you can't find such tasty pizza in LA :) The staff is friendly too so delivery is easy... Always on time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzCH-9EnfEwax7S-oGh5IA"
  },
  "433uLHaQ1pSF8D8RVuaJdw": {
    "date": "3/24/2016",
    "text": "Worst delivery service ever.  It took over 2 hours just to get my food; an hour after the estimated delivery time.  I received no apologies from the delivery person they just handed me my food as if I was just an inconvenience.  What I did receive was cold food from the restaurant.  I won't be frequenting this establishment again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FTcdRMtUwR5z0mQRdUeK0Q"
  },
  "KoiH0mXvmNNsIu9BGeIJJA": {
    "date": "8/11/2017",
    "text": "In my 14 years in Vegas I have never eaten at an establishment more deserving of every last cent I have as this place. We ordered a pie, wings, fries and everything was above our expectations and we did expect good food based on a friends recommendation. The 7.99 pie is an incredible deal and its obvious they use top knotch fresh ingredients. The cheese, meat, sauce, crust everything was good but those meatballs is what had me in love, they were delicious almost tasted like gyros. We got meatballs and mushrooms. The wings were hands down the best wings i have ever eaten, we grabbed 20, taste wise they were phenominal crispy, spicy, meaty but what surprised me most is they tasted just as delicious the next day being reheated. It didnt habe that nasty smell most reheated chicken gives off. The fries, hands down best fries I have ever had. The entire meal left me satisfied but not bloated and like i just ate 10 tons of salt. Beyond that both ladies up front were complete sweethearts. I will be back, my entire family will be back, often. I look forward to trying out the entire menu. I may not be an elite reviewer but im from Chicago and pride myself in knowing good food, and these guys got delicious food all around so far.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3LokcKH-GK4HMyQo8aLuw"
  },
  "h8e12DZuFDyTLHoPuOlVdA": {
    "date": "3/21/2015",
    "text": "Almost every time I order from here it is a fast delivery and the food is absolutely amazing, I haven't tried a single thing on their menu that I didn't like, a few times the food has taken quite a while and didn't seem so fresh but they seem like a busy place so I can't get mad at that! :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MhxsBthhagNlkU9l4H0PcQ"
  },
  "3_1mbsIJk77EcPEFX0-6wQ": {
    "date": "1/25/2015",
    "text": "I loved the pizza and the delivery was fast. Just moved here and this so far is the best we had in town. The wings are good as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ao7slMlBOME6fMe6KMzOLg"
  },
  "EIMtQzJmpA0YIiblutzH_Q": {
    "date": "2/26/2017",
    "text": "Bigger is not better.   With 5 other pizza options within a 3 block radius, do yourself a favor and DONT CHOOSE PELLEGRINI'S.  I ordered 3 pizzas and 1 pizza was wrong. I ordered a white pie and they sent me something called a Pilgrim.  I called and the manager asked for the wrong pizza back, but was quick to blame the driver.   The manager made the new pizza herself and somehow i still ended up with another Pilgrim.  I had her on speaker, so my entire party heard her confirm WHITE PIE.  When i called back, she lied and said a white pie was never discussed.   I promised her a yelp review and hung up.   To add insult to injury, she called back and insisted on arguing more.   Never have i experienced such terrible service on what was really a sub standard pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p8msSmm4yNJBcGrWRs2zEQ"
  },
  "AFvWryG8uq6nlCl9KQ5IIw": {
    "date": "2/21/2017",
    "text": "It was ok. I got ham and pineapple the pizza looked much better than it tasted. It lacked pizza sauce. I also got the parmesan wings they were cool the needed salt the driver was a little late but she was very apologetic and had a great attitude. The pizza slices were huge. I got an 18 inch. One slice made me full.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZr3xZwsWJY0jHtgBYPzsQ"
  },
  "1hnR2zxh5LutkAgGm_6Vjw": {
    "date": "5/9/2015",
    "text": "It was good.  For eight bucks, you can't beat it.  One topping,  pepperoni.   Little greasy but still good, when you need a fix.  I'd come back and try another topping or a calzone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tYdpKrpJ-pwaQk3AUAvsbQ"
  },
  "P9DZktitVncWLlDyjCS_oQ": {
    "date": "2/18/2016",
    "text": "Best pizza on this side of town. The gentleman who helped me really knew costumer service. The pizza was delicious, the wings were cooked just right and the price was reasonable. The only complaint I have (a very small one at that) is that the potato skins didn't have enough cheese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "38P4f4gKjaUlGFBPOxcOeQ"
  },
  "1c93Jkzby-G9vhnRXVJ0GA": {
    "date": "2/8/2016",
    "text": "I got a steak sub and it is the best one I've come across yet! The curly fries are also pretty delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Du7VXY2eP-wHKCuj4Tgzg"
  },
  "yCLQGL42sf6oXekf8VY65Q": {
    "date": "5/10/2015",
    "text": "I placed my order via Yelp around 7 pm. My growling stomach reminded me to look at the clock and it was 8:24 pm already so I decided to give the restaurant a call in case my order didn't reach them. They told me they received my order around 7:30 pm.. The gal on the other end ensured me it has already left and should be at my place any moment since technically it has only been one hour since they got my order, not an hour and a half according to my calculations. I didn't make a big deal because I thought maybe they were really busy. I hung up and waited some more... Then it was 9 pm. I called back and by now I am upset because I AM FREAKING HUNGRY! .. The same person put me and hold, and of course within a few minutes, there was a knock at my door.  The pizza delivery guy told me he tried to call but couldn't get thru to me (probably bc I was dialing the restaurant!!!! )  Bottom line: 1 1/2 - 2 hours is ABSOLUTELY RIDICULOUS for delivery especially if you are down the street... If you are slammed then call your customer and just inform them and be upfront. The pizza and wings are COLD and soggy. I cannot stand that!  I am writing this review as I am waiting for my oven to preheat so I can heat up my pizza and hopefully get a decent crust. Perhaps this is an isolated incident.. This place had good reviews and that's why we decided to order thru them. Here's to heating up my LONG awaited pizza and wings after waiting 2 hours for delivery. For the price, it should of been at least within a decent time range.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVvyI4GW0mKVhltAYOonoQ"
  },
  "8ahLEhuFz_5PQGA9er75xw": {
    "date": "10/25/2015",
    "text": "Ive ordered this off Eat24 so many times that I felt it necessary to give them a review... Especially to make up for the long drive for their delivery person. Pellegrino is the best delivery place I've found in the area. No matter what I order, I'm confident I'll like the entre. Thanks all! I'll keep ordering here every time I need pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bo9t0rA22dOU34A7uNuFjQ"
  },
  "3esPPnVRYcCOpL99UuyzmA": {
    "date": "7/14/2015",
    "text": "Perfect thin crust and fresh ingredients. Cant beat this. We finished it in the car, in their parking lot. Owner was nice. We called in and picked up. Pizzas were done before promised time. Saw them cut fresh ingredients that goes on our large supremes. Always a good sign!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xAmZ1ZhgnecjYpmdD_ZWQ"
  },
  "9xYXNKtZ7QO69XnN8s_VNQ": {
    "date": "9/4/2015",
    "text": "Read the reviews of this place and wanted to give this place a shot. Went in and was greeted by a nice friendly lady who took my order and was very helpful (even by letting me know that the pizza I was ordering had lamb) She gave me the recommendation of getting the 10\" personal size instead of ordering a small or medium. I ordered the \"The Good Greek\". Waited about 30mins for my pizza to be ready. The pizza overall was prepared excellent and wasn't cheaply made, as most pizza places would be as you would expect by trying something new. It was delicious and definitely worth the wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvAeZLgIP_N5w6ufb8qdVw"
  },
  "r31FBkBY_-YIGNvXhDSrUA": {
    "date": "8/31/2016",
    "text": "I previously had a problem with my order and I originally gave this company a one star review. I was very surprised that the manger reached out to me to apologize and he gave me a nice discount. This was a surprise to me because most companies don't care about the customers anymore. I would actually rate this company more than 5 stars if I could just for the excellent customer service I received. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3Y5qXY9bqXSroH5bbYvKQ"
  },
  "bETY3fVMkLpIk13V4MWGrA": {
    "date": "12/20/2014",
    "text": "Really good pizza! Had the prosciutto and it was on point. Had boneless wings and fries and both were cooked perfectly. Wings were big. Fries were crunchy. Would stop by again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y5Hl2fhl4OKvIckphulpEg"
  },
  "YZiSQ58ikPUYCDcKZHY0nw": {
    "date": "10/27/2014",
    "text": "I went theyre with my boyfriend and family and i must say the food was delicious!!!! We ordered pizza salad and sandwiches and everything was great!! I must say we didnt have any leftovers to take home lol looking forward to a return visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "B9msyD3o1FUDN5s-2QeVig"
  },
  "J9WtrYuxJruU6dd5Rn9WCA": {
    "date": "7/31/2015",
    "text": "One of the best tasting pizzas I've ever had! Pellegrini pizza with added salami=heaven",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4DhK_Dfg7Tp-ci_oszjHNg"
  },
  "LMgCKTrVqoD8KgVe1F6fKQ": {
    "date": "9/14/2014",
    "text": "my husband is a total pizza snob and has passed that obnoxious trait onto me. this is by far the best pizza I have ever had in vegas (and I'm from here). the eggplant and garlic pizza is to die for. I love love love this place and everyone is so sweet here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jDKlkP3gqb0Smi6pRXLWbA"
  },
  "kUs4i0uTsY041SlL0i_0zw": {
    "date": "9/30/2015",
    "text": "Always fast and prompt with orders,be it delivery or pick up. Love the atmosphere and how willing they are to create a good experience with each customer !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-1ZXOoZP45tZDZVARALjzg"
  },
  "YS1aCzPcHaVMkjfrK-edmw": {
    "date": "9/25/2015",
    "text": "Had a \"wedding\" at Hogs and Heifers for 30+ friends of ours. We had a double order of the 30\" pizza and 40 wings. It was perfectly on time, hot and delicious. Thanks to everyone at Pellegrini Pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gpcWg0wcDpFkxRj53ye0ig"
  },
  "-wA9UUxX9HiWrddhfUcjJA": {
    "date": "5/1/2018",
    "text": "I come here because it's convenient near where I work, the have a 30\" pizza that feeds a small army, and they have gluten free pizza. I find the cheese and sauce to be great. I have not been disappointed with any toppings either. The dining space is fairly large and spread out. Only 2 booths, and 6 tables with seating for 2-4. I'm never disappointed with the service here either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0rAbC8c3OzMRWwbMPZh9yw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Back page",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0rAbC8c3OzMRWwbMPZh9yw/o.jpg"
      },
      {
        "img_id": "NkzhzRdcqaHH50VWYKfmAQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Inside page",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NkzhzRdcqaHH50VWYKfmAQ/o.jpg"
      },
      {
        "img_id": "Jn4Ti142dnRyVEDaIP6W6Q",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Cover",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jn4Ti142dnRyVEDaIP6W6Q/o.jpg"
      }
    ],
    "user_id": "UvxDezHWAXqWv4pcb1qAPA"
  },
  "KC5ZKb4Gh3gvs_hiPK9ekw": {
    "date": "10/2/2017",
    "text": "I have had delivery 2 times and have not been disappointed yet. I love their pizza, it is thin crust similar to new york style. I have ordered wings as well both kinds buffalo and honey bbq.   They deliver on time, it tastes delicious and reheats well in the oven. They are great with the sauce to cheese ratio. They also do well with toppings not over loaded but also not sparing.   Next time I want to order a sandwich or possibly some pasta.   I like this place more than any other pizza chain and even though it is more expensive the taste is totally there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqy-OvaSX5fCiL6F6_Rffw"
  },
  "f0lHp6ZVh1j7GtBWjnWuIQ": {
    "date": "5/10/2019",
    "text": "I ordered the grilled chicken fettuccine and I have to say it wasn't creamy or anything. My noodles broke apart when I tried to pick them up. But there was a lot of flavor. I also ordered the chili cheese fries and the amount given surprised me for the price. It was a great portion size and can feed 2-3 people. However there were a lot of burnt fries. Like I could hear them crush under my teeth. Other than that both dishes were very flavor and do not get the chili cheese fries if you're not a big bean fan. Now the service was horrible. When the older gentleman came to my door he just handed me the bag and left. He didn't say they added a charge for Parmesan on the bill and he didn't have me sign anything. Just grab and go literally.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hz-gzggMtH5fYhPW8ljzLg"
  },
  "B1UwRRPdwsx8drHL3LOMcQ": {
    "date": "2/11/2018",
    "text": "This has been my go-to pizza delivery! When I'm in the mood for some zah's but don't want to move a muscle, I get delivery from Pelligrinis! This pizza is quite tasty and with each slice the size of my head, I feel better about saying I've only had two! ....or three. I also get their French fries- sounds like an odd must for a pizza joint but good god, these are some of the best fries I've ever had, and trust me, I know my potato sticks.  They are extra crispy, twice perhaps even thrice dipped in batter and fried to golden perfection. If it's a shameless night in, you can't go wrong with some of these pies and fries.  My only critique is quite petty, the toppings are a little skim. If you are going to make pizzas so large, throw the toppings on there to fill it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hGPlPuFPYmxTtjDvXExEtA"
  },
  "JU1LXPb636hcKmOyJyv_Yw": {
    "date": "11/12/2018",
    "text": "We have ordered some pizza from this place I have to say that this is still the best pizza in <a href=\"/redir?url=http%3A%2F%2Ftown.my&s=7698aec98306d7ddac20490d392affe59eb99a64507ca3a11929d4f63ad6e9bf\" target=\"_blank\" rel=\"nofollow\">town.my</a> family loves it my little boy loves it.thank you for your great service and outstanding food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DTodn7ijkJy3zSCTBHkXTg"
  },
  "lZItvB_2ad-6S0bGOUGkiw": {
    "date": "9/22/2018",
    "text": "As someone who is a Brooklynite - I am a good judge of pizza.  This pizza was pretty good(Very Good by vegas standards).  The service was impeccable and fast.  They even added a special on to my online order(pickup) which saved me a few bucks when I showed up.  Basically, good pizza, good price and seemingly good people.  Give them business and enjoy the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ztK6aIe42E4YcLN3q8GPkw"
  },
  "E_f77KZgQE7Z-8KTP7awQQ": {
    "date": "2/3/2018",
    "text": "OMGOSH-what happened to my pizza? It was like eating a salt mine. The crust was chewy and salt was considered the staple when they made this pizza. The bottom line is -My pizza was inedible. I have ordered from here before and  the pizza but after tonight I will no longer be a patron. I'd much prefer a Totino's frozen pizza. That sums it up. No Pellegrino's.  I had hoped to change this review. The manager of the store called me immediately after I posted my review and he was very apologetic for my pizza not being on point. A really nice guy! ( Thus the one star increase in my review). He told me to call the store next time and that they would comp me a pizza. So I called tonight to order in hopes that my faith would be restored in their pizza. Well they had no record of this and wouldn't do as they promised. That is poor business practice. I'll find another pizza place to squelch my pizza cravings.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NxnZP9mgWaWG5bKbgmbYzA"
  },
  "nSWQbsWX2ADa8R3gXY4BUA": {
    "date": "11/24/2018",
    "text": "This is probably one of the best pizza places in the country because I had a very good meal and I wonder why people don't go to this place because it's really good to eat at after a soccer game or football game and also It has good service, Good Food, and You get to watch TV while your watching and eating at the same time. Also this is a good place to eat at when it's Sunday because it's football Sunday of course. I wish Gordon Ramsey could see for himself honestly. I really hope this restaurant can grow really fast someday and I will some day comeback to this restaurant one day. You can also get a discount from this place and get 20% off of your food so good deal huh?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bzjyw5kL2qxuOaXtgjsRTQ"
  },
  "FcVasj5cBTg6hXxMZ1Ftew": {
    "date": "10/24/2018",
    "text": "First time in and loved it... switched my regular for Pellegrini...lady at the register was sweet nd friendly made sure we were good and food was great their wings are saucy not dry great flavor thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8H2EOmV8qYqgL4IOoeJAg"
  },
  "VzSRejibHwIDh2tgC-RqLw": {
    "date": "2/18/2018",
    "text": "Pellegrini Pizza has really stepped it up from a few years ago.   I've recently been ordering almost on a weekly basis. The lunch specials are terrific and nicely priced. I really like the Goodfellow Sandwich (cheese steak), Cheeseburger, or Chicken Caesar Salad.   Today I did something different and ordered the Supreme Pizza to share with the ladies at work. Delicious! Amazing! I will definitely order it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eji0JuMcS89D7k1is8ERSQ"
  },
  "bSDF9Gf7GcBrbkUaVgE5wQ": {
    "date": "3/16/2017",
    "text": "We received a flyer for Pellegrini on our door one day and now frequent this pizza spot a couple times a month. They have a pickup special for a one topping 16\" pizza for $7.99. The pizza will feed at least 2 and there will likely be leftovers. They also have $1 chicken fingers on Sunday and Monday. The boyfriend and I can eat dinner for under $20, which is a win in my book!   We usually get a pizza and then an order of fingers or wings plain with the sauces on the side. My favorite is their house sauce which blends teriyaki, bbq and hot sauce into one. It's a little sweet and a little spicy, but for sure a new favorite of mine. Add a side of fries for only $1. Ranch is homemade as well so bonus points for that. We also really like the meatballs. 6 come in an order and they are smothered in house made marinara. We'll keep coming back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zop6FAGyxCCUlRg75BaZkQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zop6FAGyxCCUlRg75BaZkQ/o.jpg"
      },
      {
        "img_id": "C9zpXOIFMIrYwq_sh5Jkfw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Wings and fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C9zpXOIFMIrYwq_sh5Jkfw/o.jpg"
      },
      {
        "img_id": "X46oNQjhl4MRJe3Yik5ncw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Sauces",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X46oNQjhl4MRJe3Yik5ncw/o.jpg"
      }
    ],
    "user_id": "JYcCYNWs8Ul6ewG5kCYW4Q"
  },
  "X8Lg6p77AbNGCQ8BHknPRw": {
    "date": "4/25/2019",
    "text": "Food is great and delivery is cheap.  Sweet potato fries are amazing! Pizza and garlic knots are great too.  Salads are good but a lot of cheese in them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHHhYZwzM0tD8hN6SSvUrg"
  },
  "UvhxKoBkxBVIbbxdVYJ2pw": {
    "date": "4/24/2019",
    "text": "Food here is great ! Such good flavors for everything . First time here and no doubt the best pizza I've tasted in Las Vegas . Would definitely come back next time . Staff is super friendly , kept checking on us to see if we needed anything .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyQIFYqhxgeKaz8_Hl7HNA"
  },
  "wRzZ8HW_BTMsM2RErO209A": {
    "date": "8/28/2018",
    "text": "Moved to this part of town about a year ago and have been trying out places all around the area. The pie was good the wings where great and finally a blue cheese dressing worth going back for more. I'm from Buffalo, NY and the wings had great flavor which came with carrot and celery sticks. It's a hidden gem stuck back in the plaza behind some fast food joints. Worth checking out and I know I'll be back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kt-qOJ9CaF59jA3FpHe_pA"
  },
  "vGgRjencWrIOzqA7Wm4reg": {
    "date": "9/22/2018",
    "text": "Phenomenal PiZZA! Spending your money anywhere else is just a WASTE. Chicken wings are juicy and FULL of meat, cooked to perfection! The pizza is flavorful and cheese is QUALITY, ingredients are FRESH and selection is PLENTY, they even have broccoli! Price is worth every penny and not much outside the crappy chain spots. MUST get bucket of fries with ANY order! You won't regret it, OH and the ranch... your even satisfied on the midnight or next day reheat. It's STILL GOOD. ... and the staff. Friendly, caring, authentic, family, makes me want to come back because they CARE. LONG TIME Customer not going anywhere anytime soon. Thank you for doing it right. Much appreciated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9waNEvUNg507Ri9afX8QmA"
  },
  "u81I0ANkG-GLXpmNXQ2pBg": {
    "date": "12/23/2017",
    "text": "Ordered a large pepperoni, mushroom and onion pizza and the service was quick!  The pizza was delicious.  Thin crispy crust with oozy cheese.  The tomato sauce was savory and well seasoned.  Give this place a try and you'll see what I mean :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gtEjMgcW74ZcG0zzMctmKg"
  },
  "-zJwkiZGHcp4MjHmNqtQTw": {
    "date": "7/18/2018",
    "text": "I usually drop by Wednesday nights , I love the hot wings here . Please bring back the Kens blue cheese . It's bomb .I really like that they've expanded more into a restaurant style . Now I can come in and eat . The lady in the front is super nice and so are all the workers . Every visit here has been a good one .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AytdgoOmmczWwQEcbVU3pQ"
  },
  "Yn8SQwmMVAr1jj7x2ZW0Uw": {
    "date": "9/14/2018",
    "text": "Flavorful, delicious, top quality ingredients and we only wish we discovered this place many moons ago! And so very reasonably priced. We'll definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fn61ZKpu6TZXtLCyOSHThw"
  },
  "tAizG4wh2ygfV5zmtogrFg": {
    "date": "2/17/2017",
    "text": "I just ordered pizza from here literally an hour ago. We used the coupon - 1 18\" 2-topping (pepperoni & bacon) pizza, 12-piece medium chicken wings, & a Fanta. The pizza arrived after around 40 minutes (we live about 15-20 minutes away). The food looked & smelled delicious! I need to add that the Fanta was cold when it got here which was perfect! The food was definitely delicious! We were all impressed and super happy. I usually am able to down two pieces of pizza, but because of the huge slices, I couldn't. I was so full but definitely satisfied!   This was our first time ordering here, & it definitely won't be our last!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8BcJ8S4JwHHZWnx3Asd1A"
  },
  "SWItD53zi3LYdLTqSifHSw": {
    "date": "4/13/2019",
    "text": "Love the pizza  staff is always friendly when arriving especially Lena  she's the reason why we keep on coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i86uXyYU9XEIkKLGag9jxQ"
  },
  "JQHUUtLNoicdzZxpJ-HV4A": {
    "date": "8/1/2015",
    "text": "Ordered from here last night....and we will definitely be back!  Awesome wings and good pizza.  Pizza was nice and cheesy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_dQdbFdPzuReEbB1jUZVzw"
  },
  "zX9l7YsKS1Vg6aH_bzvIOg": {
    "date": "4/16/2014",
    "text": "I just had the russet experience ever. I ordered a medium rare burger with garlic fries and my boyfriend got chicken marsala delivered and our order was completely wrong. My burger was cold and soggy, my fries were hard and my boyfriend's chicken marsala was obviously frozen chicken that was completely inedible. I called to let them know that I was not pleased and coming to return my food. The owner was so rude to me. He said he did not care that I did not like my food. He offered to remake it but they had messed it up so horrible. I will never be returning. HORRIBLE CUSTOMER SERVICE!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mEyxcgAdIq4D35RXPA1xhQ"
  },
  "Yws3Y1RA7NfoGqqt1WvXrQ": {
    "date": "7/23/2015",
    "text": "Almost 2 hrs late on my order. But the lady apologized and gave us 10% off.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CsWEzRz-wloV0eUzHDmn-A"
  },
  "tYH6YIzqD7S7xffgZv2Ijw": {
    "date": "5/31/2015",
    "text": "worst experience ever.  I placed a order at around 9pm through <a href=\"/redir?url=http%3A%2F%2Feat24.com&s=f6a43a39d83313a99e0c9648cc2dfb057d7893980b27777fec0cb32d6333a670\" target=\"_blank\" rel=\"nofollow\">eat24.com</a>.  I ordered a bacon cheeseburger, with katcup but no mayo.  I am allergic to mayo, so I can not eat it.  My order did not arrive until almost 1045, and when I opened it up I realized it was a hamburger with no cheese, no bacon and no katcup, but there appeared to be extra mayo.  Of course, since it was so late they were unable to have it redelived.  So I waited about 1 hr and 45 minutes for something I was unable to even take a bite out of.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixyCt-i6rlTMmk1vUl4xKw"
  },
  "fJ9UuiGbvmOi9mQqB6bFjg": {
    "date": "2/12/2015",
    "text": "Chicken parm sandwich was awesome, as were the garlic fries. The delivery service was horrible, chicken wings smelled funky, while the salad and pizza were BLAND! I do not recommend this place. I tried it twice and both experiences were disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRFESJD446tN9YDMtuq0Ag"
  },
  "f_q-Sl3b-57_-0rHsrVkew": {
    "date": "10/19/2014",
    "text": "This place is the bestest! After getting pizza and wings here we'll never go anywhere else. Always hot fresh & friendly...  we never get bored with them  because  they have a verity of thing to choose from. You can't beat a one topping 16\" pickup special. & the cheesesteak is the bomb! Thanks guys for always making our parties the best with your food! :D Keep it up and will keep coming! & referring to you as the BEST!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zesbI1nwVukUqEfEM9lISQ"
  },
  "FvVMMEt6lLk6Reu2Pl-P7g": {
    "date": "12/29/2013",
    "text": "Very good pizza place, the employees are very nice to you and the pizza is very good. Definitely a place worth trying.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IkecjsLE5mdJL3QqR-bBjg"
  },
  "wBpKLgx41v4KcvqZ686idQ": {
    "date": "1/20/2014",
    "text": "Had a craving for chicken parmesan, but it was 8:30p and my usual place was closing.  Thought I'd take a chance and try something new.  I didn't have high expectations, but boy did they impress!  Excellent meal...I definitely recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "STjwwpmnW0rQZd-Pm0dxjA"
  },
  "ngzI7n5KYVVxrnY0JG8GpQ": {
    "date": "8/10/2013",
    "text": "good pizza, friendly service, and a nice variety of italian food with some personal flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBxVdqnEn_ki7-OhAMFmUg"
  },
  "OPFnRQXUOB22GVA7NfrPmw": {
    "date": "10/1/2013",
    "text": "Went there for lunch yesterday with the family we ordered the lunch specials all in all came up to about 23 bucks, which at first I was saying ouch that's a tad expensive then the food came the sandwich's we ordered where huge so the price is on point I had half of mine for dinner that night because I couldn't eat it all I shall be back with more hunger to try and eat a full sandwich because of how good they are time to try the pizza now",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MiqRvMSxBWa7svFmy8CAuA"
  },
  "SDG_86_gtnDzu-93e8kgNw": {
    "date": "7/15/2013",
    "text": "The Mac and cheese is very tasty!  The garlic knots were fresh and delicious.  The minestrone was comfortingly good.  Next time ill try the pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfELcdFUHG1qHeZGxUGbvw"
  },
  "gqfSABESFcyZAAE_Nya0gw": {
    "date": "3/16/2017",
    "text": "I love, love, love this place!!!! I only come here to get the best calzone made my way!!! Only double mozzarella cheese and a large side of ranch!! The bread has garlic butter in top and it just makes the calzone 100x better than any other I've ever had. The people here are polite and have treated me like I've been going there for years. The cashier is such a sweetheart!! She knows me from the Terrible's across the way as she works two jobs. Go get it girl!!!!!!! They are open late and very convenient. The prices are not bad because you get what you pay for. I would suggest this place to anyone who likes calzones. I haven't had anything else so I can't speak on any of it but DAYUUUM I'm hungry just thinking about it lol !!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NcdAwQqK6nsq5v-UOQP5fw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Chili cheese fries from a pizza joint!!!!! Only my child lol!!!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NcdAwQqK6nsq5v-UOQP5fw/o.jpg"
      },
      {
        "img_id": "hItKv71xUuUR_4bqQRoe3g",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. On our way to Pelligrini Pizza!!!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hItKv71xUuUR_4bqQRoe3g/o.jpg"
      }
    ],
    "user_id": "NdrDF5gRt8lnstNI070F_Q"
  },
  "amfL95B6GJJ3BOJTDeWXlQ": {
    "date": "4/23/2017",
    "text": "After searching for a great pizza place that delivers we were pleasantly surprised by Pellegrini. Ordering was easy through the 24EAT, accessible through the website or via App. Delivery was fast and the food is delicious.  We recommend adding the appetizer sampler to any order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9I5PujRNe1e8qHe-lcZtZA"
  },
  "ThnD2t_tNl9MvZwGwakXDQ": {
    "date": "9/15/2017",
    "text": "We order from them a couple times a month. The pizza is the best, but they mess up or delay carryout orders literally 100% of the time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpWTenRR72Bv0RINUov92g"
  },
  "HimL9T0236gcVd-qQHL8Sw": {
    "date": "11/14/2017",
    "text": "Just ordered from here for the first time, fast delivery, good pizza, good wings, but I will say I would have liked to have some icing with the cinnamon sticks maybe on the side for dipping. All in all pretty good though!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVbBXYUG5bkoLdD8kpgi6g"
  },
  "1XZNqcwrs__tf8JQC2ne3g": {
    "date": "6/25/2016",
    "text": "Ordered pizza & wings for delivery and everything was hot and good! We're gonna use this place again for my daughters birthday party and either pick up the pizzas or delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pSCYPO9azwn007zFKfKmKQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Very very good pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pSCYPO9azwn007zFKfKmKQ/o.jpg"
      },
      {
        "img_id": "PvMSS8HvUgFn1fnqaj6sBw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Very good wings!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PvMSS8HvUgFn1fnqaj6sBw/o.jpg"
      }
    ],
    "user_id": "EcQuRZBMdQ4Sll2LxVcJkA"
  },
  "Q36YvPJd4-LhlLMhclx9ag": {
    "date": "2/4/2015",
    "text": "This place has some very authentic pizza. It has yummy burgers as well.   My favorite is the Bianca pizza . The mushroom burger was amaaaaazing . Especially from a pizza place.    I order regularly and had one issue with an order. The person who caused the issue was taken care of .  I respect that this business owner not only takes pride in his food and his customers but also his employees. If he sees an issue with something he will take care of it personally.  Try this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "11Qfaoyg3BiciQ4ffKO0JA"
  },
  "vn29z2f3onBUu-KTJ-6yLg": {
    "date": "5/3/2018",
    "text": "While I'm not a favor of alot of sauce on my pizza, this lacked the bear minimum. And the fried ravioli should have been boiled before fried since the cheese inside was clumpy and dry. They're fries on the other hand were amazing. But the vegetables that I added for $1 each were minimal and not sauteed before put on top of the pizza, rather they were few and dried out. The sample of appetizers isn't worth it, all in all tried a variety of there options and was left extremely disappointed with my food after the price I paid for all of it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQ8ldOm3m3TKW9UW_R0Itw"
  },
  "295G8h7rVafReXZABwggqA": {
    "date": "8/27/2017",
    "text": "This place....wow. Best pizza and customer service in town. Love the food!!! We ordered food early for the big fight and knew only one place to order fight night food. Needed roughly around 5pm and they delivered. Everyone at the party kept asking were we got the food they kept saying yum and this is delicious. Think they maybe got a few more customers haha. Keep up the excellent work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YB14HyfuXX5vphO5-koYQA"
  },
  "Cng5IsUWEfkYPSB2H25JeQ": {
    "date": "4/18/2018",
    "text": "Pizza was so good and the knots and mozzarella sticks  are on point. Will try them out again. And delivery was on time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjVZSDPE1ebDMhXuTCg3Sg"
  },
  "LgvuUhDjrYWYkCuacRmiDw": {
    "date": "7/30/2017",
    "text": "Ordered some pizza today and I gotta say is one of the best I've had. Cashier was really friendly. Will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M2sDFLLp8xrFJJGtHQQO2g"
  },
  "Ng7eeagz8251pVqm1x1GYA": {
    "date": "7/5/2017",
    "text": "Like I said before .. The pizza is really good here .. And after my last review of the service I received after they had messed up my food the manager called me himself and resolved it properly the way I would have expected it to be done in the first place .. My only advice would be to actually call and order instead of going through the Eat24 app because it messes up the way the orders are read.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ztdbXZ1Jd0NozyT5ukahzA"
  },
  "pn-mQH0kXtJ-WprrYP72ww": {
    "date": "2/21/2016",
    "text": "So I tried this place again because I like taking risks apparently... actually I really wanted pizza and nowhere else near was open. The wings this time were really good, no longer dry and gross, seriously improved!  The pizza is still eh.. Thin and really really greasy, the cheese coagulates weirdly, its never ooey gooey and yummy  like pizza should be. the flavor is really really heavy on the Thyme taste, possibly rosemary? I dont know im not an herb expert but it tastes weird.  I may order from here again for wings but wont be trying the pizza again. Im glad they got better, but they are still very mediocre",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHcUWmQ3nKJuT7G0z5kdug"
  },
  "lbrPcGs93bg5t21_ToOzDA": {
    "date": "7/1/2017",
    "text": "The ranch is phenomenal !!! I've ordered sandwiches before and they're always delicious, especially the fries that come with it. Ordered pizza tonight and it hit the spot, I asked for it well done and it was perfect. The crust still had some chew to it, wasn't hard as a rock like other places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gUu0uaiU7UEUVIgCdnqPVQ"
  },
  "0Mlyd6jRuBLZaLM8GlNqyA": {
    "date": "5/30/2016",
    "text": "Average pizza . Cheap . Nothing terrible just not as good as the pizza I've grown accustomed to . You can pick up a 16 inch pizza w/ 1 topping for 7.99 which is super affordable . But most likely I won't be returning as the food wasn't anything to rave  home about .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Djaa6J18tf-9lA9vV8md3w"
  },
  "fg2nkcRaFxNfFbH8kkv6LQ": {
    "date": "3/17/2016",
    "text": "Unfortunately the pizza (margarita pizza w/ sausage) was terrible. It was uncooked and soggy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFodPTpbWK7dSymxaBiUXg"
  },
  "VBoJmM_loGnJ-ZgPyqfYCw": {
    "date": "4/17/2014",
    "text": "Wow- we were so surprised by the quality of food. We ordered delivery for the one-topping, 12 medium buffalo wing, and 2 liters of Coke.   The pizza was a thin, limp, greasy, sad specimen that easily split into a congealed latticework of \"cheese\" and \"bread\". There was no tomato sauce.   The wings were cooked hard and were so plain we had to go on a buffalo sauce search. We found about a teaspoon's worth, most of it stuck on the backside of the foil.   Dipping sauce came with the wings. It wasn't blue cheese. It wasn't ranch. It actually reminded me of the homemade French onion powder you mix with sour cream.   The only thing I wasn't disappointed with was the Coke.   We took pictures so you wouldn't think we were lying.  UPDATE: On  April 21, 2014 I was notified by Yelp that my photos of the pizza and wings had been removed because the photos and captions weren't \"generally representative of the business.\" I'm hoping that means my terrible experience was one-in-a- million!",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "6w6pXL1N1q9RkmG6b4Su6g"
  },
  "ISm0h_ini4jpjK179UCQ-A": {
    "date": "11/3/2017",
    "text": "I love their food and they have the best ranch! Delivery is always super fast and they are always friendly. Always my go to when I don't feel like cooking or going anywhere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eR9-Q9mZ5nR1nUYL9zhiPw"
  },
  "1uS7-on0roQUkxOKcpjiEQ": {
    "date": "10/8/2017",
    "text": "I'm a repeat customer and never have been disappointed even when there is a problem Pellegrini is prompt in solving the problem.Fast delivery, courteous driver and excellent food!  My hubbys fav is The Steak Bomb",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFRFekPudKQFPO-tcYyLEw"
  },
  "ghDl_PyWocjkXE9e4WZNrA": {
    "date": "10/8/2017",
    "text": "Our favorite local pizza shop. Make sure you try their sandwiches, too!! The Steak Bomb and the Onassis are my favorites. They're always hot, fresh and on time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DE2UCCA75dNYKkB7GkP6oA"
  },
  "H0y3f4Qt2lJQIKOpu0xkTQ": {
    "date": "4/25/2017",
    "text": "Yummy New York pizza & I LOVE their mild wings. This is my usual go to place when we're in the mood for pizza & wings! Great staff too they're always so nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1FAw8eUl9Dkmub6L-esSWw"
  },
  "FzPL1ur7goIRGhto0UNnjg": {
    "date": "1/3/2019",
    "text": "I'm a regular and every time I order their food is always A1, see for yourself! Their wings are better than any spot I know and their pizza is always fresh. I get pizza here before anywhere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bVrVFc3UBu1FmNy4Zxif5Q",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bVrVFc3UBu1FmNy4Zxif5Q/o.jpg"
      }
    ],
    "user_id": "_K7ajiI8hIap-xbWZb2hyg"
  },
  "OSqNuRJAEXpXtfVA7fVOdw": {
    "date": "9/2/2018",
    "text": "Very good pizza. Super fresh not greasy. Chicken wings are so crispy and good. Great service. Very clean restroom and dining area. Great specials too. Will definitely be back. Place is a bit hidden off from the main Street but not hard to find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8O1P6EPCLrX-oX2d7UJgSA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Great pizza and wings very fresh",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8O1P6EPCLrX-oX2d7UJgSA/o.jpg"
      }
    ],
    "user_id": "F_0Rf6KGokgemEBep0v3Tg"
  },
  "jl0RT8smJKxvsWEm13EpKw": {
    "date": "11/25/2018",
    "text": "We snagged the pilgrim pizza, a small calzone (was bigger than expected) and some wings.  The small order of wings afforded us two sauces.  All of it was really good.  We had a couple slices left that heated up in the microwave really nicely.  Staff was incredibly friendly as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Bed_nGbgnMCEA3hJM6GmQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Bed_nGbgnMCEA3hJM6GmQ/o.jpg"
      },
      {
        "img_id": "D3rvl7GHLPa5yhK2HGqlKA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D3rvl7GHLPa5yhK2HGqlKA/o.jpg"
      }
    ],
    "user_id": "GvmgnvhaLDy1qixugYHwrA"
  },
  "saLLKZsW-dWVVTbOMhBiyA": {
    "date": "5/5/2019",
    "text": "About once a month now my family treats ourselves to lunch at Pellegrini Pizza. Today was our third visit.  Another round of Untouchable subs and a gyro for my little bro. The fries and onion rings were fresh and pleantiful. The staff are friendly. And the dining area is pleasant. In my last review I mistakenly said we had tried the funnel cake fries.  My bad. In truth,  we devoured an order of sweet and delicious zeppolis. This time we got the funnel cake fries. Soooooooo good! This is stick to your ribs, feel good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg4KKoE7_kU3R4vhn1ceew"
  },
  "ZpZ5AfYcBk1-tIwzDyegZQ": {
    "date": "11/25/2018",
    "text": "We went to eat yesterday and they have the best pizza in Las Vegas and the prices are the best too so we will be back for sure when we come back to Vegas the owner is so nice by the way !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ogTaYcDLl_BCZQr5xrMRRg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ogTaYcDLl_BCZQr5xrMRRg/o.jpg"
      },
      {
        "img_id": "roIzrDFHQQ1U4fPcnxZ6zA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/roIzrDFHQQ1U4fPcnxZ6zA/o.jpg"
      },
      {
        "img_id": "o4BODVWavAxcz4OIT1bY3A",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o4BODVWavAxcz4OIT1bY3A/o.jpg"
      }
    ],
    "user_id": "RnRPvrXgHwGLoCgYgOVaZw"
  },
  "WT8AU6fQ4paxCKl_emZoIA": {
    "date": "4/6/2019",
    "text": "LOVE this place!!!! I've tried it for the first time a few months ago and It's def my go to place now. Their pizza is the best I've tried in Vegas so far, food is amazing and customer service is great...Lina is the best!!! Always so kind and helpful.  I 100000% recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lpaqsc7Cg0kcR_FV_R5CpQ"
  },
  "3MCrm-Igp1YYdpt9sDcSVw": {
    "date": "4/1/2019",
    "text": "Such great food & fast delivery from Grub Hub. The baked Mac n cheese was really good! Would order from there again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-odcYhyX8tqdjIpX6pAlLQ"
  },
  "iXMQqjbjDkwth-gUWW6fdg": {
    "date": "7/7/2019",
    "text": "I ordered a pizza and 12 wings from here and everything seemed fine. I made my kid's plates and after I made my plate and bit into my chicken wing I noticed that it was completely bloody and raw on the inside! I immediately called the restaurant to inform them of what happened and they were VERY rude to me! And never even apologized or showed any concern about the fact that me and my kids just ate raw chicken (which is UNSAFE!). The male employee yelled at me and asked me why the hell would I let my kids eat raw chicken? He also went on to basically tell me I was lying because he knows how their oven works (as if I care ! ) I explained to him that I have ordered from them in the past and I wasn't calling to start a fight I simply just wanted my money back! They refused. The lady employee offered me more chicken wings and I told her I didn't want anymore food from them. Then the male employee got on the phone telling me that I must get back in my car and drive 30 minutes to return it or he wasn't giving me anything! He said I didn't know what I was talking about. He said it was most likely barbeque sauce! As if I don't know the difference between blood and barbecue sauce! Needless to say I will NEVER order from them again! And this is just a portion of everything that was said and how poorly they handled the situation.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OiHD8K0a5MkHlX7LlmRx5A",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Raw chicken I purchased at Pellegrini pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OiHD8K0a5MkHlX7LlmRx5A/o.jpg"
      },
      {
        "img_id": "sooEQ9QGReMQDTP753IV8Q",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Raw chicken I purchased at Pellegrini pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sooEQ9QGReMQDTP753IV8Q/o.jpg"
      },
      {
        "img_id": "wIHmC3iNAIyHyw77bssoDA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Raw chicken I purchased at Pellegrini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wIHmC3iNAIyHyw77bssoDA/o.jpg"
      }
    ],
    "user_id": "W0NVO8bJNLJ1dSHk5oE-Yw"
  },
  "jHczp0cje9g6z73JQQGpJg": {
    "date": "1/11/2019",
    "text": "I ordered a couple of nights ago through Grubhub delivery and I was happy it areived earlier than expected and te order was correct. The food is great especially their corn. Will definitely order to them again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3WlwMTXDgaVBf33CUUbQxg"
  },
  "eXBjbvWzWO8CzQxommlExg": {
    "date": "7/17/2018",
    "text": "This has been my local pizza joint that I order from between two locations that I've lived in in Las Vegas both close to each other but their transition was seamless good wings good pizza calzones that you could write Home back to New York about and customer service tonight especially is why I am writing this review.  I got the lasagna it wasn't great but I called them about it and I said just send me a good fettuccine Alfredo and we'll call it even they delivered it within 45 minutes with a real sweet message. If you want a late night spot that delivers and has quality and attention and service with a smile and most importantly accountability check this place they haven't let me down",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SNp_K7p0g8FTK-qnUa5Bow",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. My complaint answered!! Delivery fresh af!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SNp_K7p0g8FTK-qnUa5Bow/o.jpg"
      },
      {
        "img_id": "qeRHhjBlk8jxaHKdv_8pSg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Just look at this beauty!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qeRHhjBlk8jxaHKdv_8pSg/o.jpg"
      }
    ],
    "user_id": "5OUkWeJyrVYe8DqODLgUKA"
  },
  "YMAhOq_Uh8x5InR8iO3Z-g": {
    "date": "1/9/2018",
    "text": "Instead of a couple small tables, this remodel has left this establishment to accommodate a sizable amount of dining in guests. It's well decorated. The service was great, and the atmosphere is excellent. Another calzone was ordered one the favorites of mine, as well as something new: garlic knots. It's a healthy mound of fresh garlic-y bread sprinkled with Parmesan cheese and served with some delicious marinara sauce. Great job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LZhGhYFO6hdHC7Vcb9Icmg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LZhGhYFO6hdHC7Vcb9Icmg/o.jpg"
      },
      {
        "img_id": "e699bGuGVH7xO0KCbXDltA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e699bGuGVH7xO0KCbXDltA/o.jpg"
      },
      {
        "img_id": "ldni8lGgNc8iTw2XbO48GA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ldni8lGgNc8iTw2XbO48GA/o.jpg"
      }
    ],
    "user_id": "S-z0epok_cwBx5AQx9ouQQ"
  },
  "lSmknHU1FX-HXgcFzvqqMA": {
    "date": "9/2/2018",
    "text": "I get delivery from this place all the time but today's order was not on mark. The pizza is great but I got an 18inch Pellegrini. I paid for extra artichoke and asked to sub chicken for ground beef. There was exactly the same amount of artichoke as a normal order and in total maybe an ounch of chicken on the whole 18 inch pizza. It came off as being short changed. I'll be giving another chance and I hope it doesn't happen again. But if it does I'll be be looking to spend my money elsewhere. I definitely won't be getting dessert here again as the slices are absolutely tiny. 2 star  UPDATE: 11 October  We tried it again with the same pizza and the same order. We were encouraged by a manager at the store to give them another try with a large discount. We ordered the same pizza and it was wonderful! Changing to a 4 star vote. Also: order delivery over the phone instead of through grub hub. Their driver is significantly nicer than any I've had through grub hub.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sNcAkA57YexiGU6EYscrcw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sNcAkA57YexiGU6EYscrcw/o.jpg"
      },
      {
        "img_id": "FVk79JXNrOJiHViifYiZrQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FVk79JXNrOJiHViifYiZrQ/o.jpg"
      }
    ],
    "user_id": "GMnHSFWCSZrrrdhzh5iICw"
  },
  "686K0vHQR6ujmm6LFmirow": {
    "date": "5/12/2018",
    "text": "This is my go-to place for lunch or dinner when I'm too lazy to make dinner at home.  The best dishes IMO are:  -bianco white pizza -meatball sub -steak bomb sub -zucchini sticks -Italian wedding soup -fruit and nut salad -antipasto salad -baked spaghetti and meatballs  Everything's full of flavor and it's reeeeal yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "O-qCegMPqzFL6BqWJBga0g"
  },
  "M2lHVZBtxCg1P843FG4p9Q": {
    "date": "7/14/2018",
    "text": "I got the house burger and honestly it taste homemade! Everything was so fresh and delicious! I was pleasantly surprised.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wQYVWai4uEzXK4DrDEqQug",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wQYVWai4uEzXK4DrDEqQug/o.jpg"
      }
    ],
    "user_id": "n3VHEA8yBRsRwMqtb-igsA"
  },
  "whoaUqh_K7VqHhdGc67PjA": {
    "date": "4/22/2019",
    "text": "Pizza has way to much sauce and grease!!! I couldn't even hold a slice without it falling apart. The bread was soggy half way up the slice so it was all limp. And the crust was super bread-y if that makes sense. I feel like I just ate a loaf of bread. The wings were good *mine are better at home* Honestly I'm kinda pissed I just spent 30 dollars here.  Save yourself the heartache and go across the street to Verrazanos! There you won't be disappointed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBSizGLzyxRjvR-vbt-Oxg"
  },
  "hfJU1W-6prCZAttt9u4xeQ": {
    "date": "1/20/2019",
    "text": "My office orders from here once a week because they have a selection that pleases even the most picky eater.  Pretty much everything I've tried here is on point but the soups are delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9c0c9nDA6jDWiBONX_H7Q"
  },
  "tcdFyeX0A6cbOWm_QFUbeA": {
    "date": "1/19/2019",
    "text": "Walked in with a soccer team and parents, huge group, about 45 people. Everyone here was so accommodating, they pretty much rearranged the place to fit all of us! Pizzas are huge and delicious! Great place for feeding a large group! Thanks, Pellegrini! See you next time we are in Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36mp-ZvDVvYrf74nQ3Lomw"
  },
  "WMQGnovHQU9Rrh3FxsmJ8g": {
    "date": "6/15/2019",
    "text": "Best pizza, wings, and salads I've ever had, hands down.  The pastas are so good that you'd think are from a 5star Italian restaurant.  The subs are fantastic.  Easily the best burgers.  The staff is wonderful as well, and the service is better than a lot of places I've been to, and they even have televisions.  Their delivery charge is cheap and they are very fast.  Best of everything honestly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RxHGEa8mk7JS1O36S_dDHA"
  },
  "oNhTTvodbrtBY7RqUV1U1w": {
    "date": "11/4/2017",
    "text": "Love this place!! Amazing food and employees. If you are in Vegas gotta try this place.   Had to be back again for lunch to try their burgers. The place was expanded, so i decided to dine in. They have a very clean and nice color coordinated room w/a  BIG screen tv for sports fans. Had burger w/fries and buffalo wings. The food was absolutely spectacular. What a great place!!!! We'll definitely be back! Highly recommended!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ua_zB2GXSBqCVPRQiSF38g",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ua_zB2GXSBqCVPRQiSF38g/o.jpg"
      },
      {
        "img_id": "IN_A_vc1NDfXBaMXuuUJEw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IN_A_vc1NDfXBaMXuuUJEw/o.jpg"
      },
      {
        "img_id": "OWSxQUTvdJGJ1O9j3X1V0g",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OWSxQUTvdJGJ1O9j3X1V0g/o.jpg"
      }
    ],
    "user_id": "pqxMAwuakCNNWVILMVNYhg"
  },
  "-IYS3UpPY6iMDV1yWC5Qag": {
    "date": "8/14/2016",
    "text": "I was going to wait to do this review until I had their pizza, it is a pizza place......but I feel pretty good with a four star review with the wings and calzone that I had on my first visit here. I initially called for delivery, but it was an hour and a half wait so I decided to pick it up. I ordered the Garlic Parmesan Wings, the Hot Wings, a Spinach and Jalepeno Calzone and the appetizer platter. The Garlic Parmesan Wings were great!!! Hot Wings were good too..... I also was very impressed with the Calzone, the quality of the cheeses used were excellent.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "g2McpuS_70xiixtmJoBRHQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Spinach Jalepeno Calzone..... Cheese is amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g2McpuS_70xiixtmJoBRHQ/o.jpg"
      },
      {
        "img_id": "_7Szoyoz6ZsbqXmLvqW_dg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Garlic Parmesan Wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_7Szoyoz6ZsbqXmLvqW_dg/o.jpg"
      }
    ],
    "user_id": "FEwPxhjdVKxSPVQQAHX2gg"
  },
  "9wsiXxsISjtRpuVQSyC-JA": {
    "date": "1/19/2014",
    "text": "I am a truck driver and I've been in many pizza places throughout the country, but never had such a great special pizza for only 7.99 with a home made sause... Staff is very nice and helpful. The pizzeria looks very clean. Definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TLKOfsODMF_RiAGAI6IB7w",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TLKOfsODMF_RiAGAI6IB7w/o.jpg"
      }
    ],
    "user_id": "31iGWsbRvZ1zKW4TKYIbRw"
  },
  "VKIj8HdQ4fj3GASiivGBYQ": {
    "date": "9/27/2013",
    "text": "This place makes a really good New York style pizza. Good quality cheese and delicious chewy crust . Generous topping and the meat in the toppings was good quality .Delivery was prompt from EAT24. Would definitely order from here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOZSL8plD7JGsa_A-ZKiNg"
  },
  "7RZ9U64JAbR4naEK-aPYmA": {
    "date": "8/8/2015",
    "text": "I'm actually pretty pissed. I would give this restaurant 0 stars if I could. I'm pregnant. I can't eat this food. I order from here sometimes and the pizza is ok. I ALWAYS tip the drivers. I'm not an asshole and I've been a consistent customer of Eat24 for YEARS. I've never had a problem like this before. Tonight I got the garlic knots, fries, and an eclair. Garlic knots were overcooked and burnt, fries were wet and soggy, eclair was also overcooked and kind of old looking.   Because I am pregnant, I didn't want to go through the stress of calling the restaurant myself. Call me crazy, but whatever. I wasn't about to fight with a restaurant owner over food when I have a growing fetus inside of me ok? So I messaged eat24 instead and hoped they would deal with it for me. Eat24 customer support is always super sweet and easy to talk to, so they were more than willing to help me out. They understood my concerns and really just wanted to make sure that me and my unborn child were safe.   Eat24 called the restaurant and told me that the restaurant owner said he \"cooked the food perfectly.\" Um what? He said he cooked it himself so he was sure that it was cooked to perfection. I don't know how he can be so arrogant and rude. Especially over a $13 order. If he had just comped the meal, I'd probably order from here again in the future and order even more food, like I usually do. But now I'm just never going to order from here ever again. How stupid of them to do business this way. NEWS FLASH: PEOPLE ARE NOT JUST TRYING TO GET A FREE MEAL OUT OF YOU FOR NO REASON. Don't be arrogant about your fucking food and don't pretend like you know more about what good food is than your customers do.   The reason why I keep using Eat24 is because they CONSISTENTLY provide me with GREAT customer service and always take my concerns seriously. That's how you stay in business and how you keep getting money from customers. Providing good customer service will get customers to return to your business instead of turn them away.   In other words, I'M NOT FUCKING STUPID SO DON'T TREAT ME LIKE I AM. You're actually lucky I'm smart enough to know what good food is. Because if I wasn't, I would have eaten it, gotten sick, and then I would have sued you for putting my pregnancy at risk, asshole.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "EofDXGTIjqq310yIMKq67w"
  },
  "WiVtRTj-eOULrOXgrmBBtA": {
    "date": "4/15/2015",
    "text": "This place is awesome. Love the pizza with the amazing ranch sauce as a dip!! My husband love the wings that are actually hott!! We always go here for pizza. No where else compares!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lfdBhD5bxCGSTeIlDwlPNw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. This is the small calzone! I could not finish it !! So good!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lfdBhD5bxCGSTeIlDwlPNw/o.jpg"
      },
      {
        "img_id": "_rxR9WATXdAS7cGTrIEwIQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Delicious and HOT!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_rxR9WATXdAS7cGTrIEwIQ/o.jpg"
      }
    ],
    "user_id": "SMQHOgKO2G6i-Uhq_g5kDw"
  },
  "VAno-6VHUO49lypd3LR4CQ": {
    "date": "4/12/2014",
    "text": "first time tonight. We got the special 18\" two topping, 12 wings & 2 liter for $23.99 I think was the price. The middle of the pizza was flimsy and kind of soggy. Im not sure if it was because it was so large. It was better once you got to the center and the end. Wings were tasty. I may try again one day and maybe get a smaller size pizza. Also, don't plan to eat there. There is nowhere to sit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPSXDnjJ_oXoVSlkvmDItA"
  },
  "jZ6X4lsFxyyOGEUVYBJNxA": {
    "date": "6/29/2016",
    "text": "Overall a pretty good pizza place. Not much room for dine in but a good spot to pick up a pie in the way home. I though the pizza was great, though the rest of the family wasn't impressed by it. A good Italian vibe from the kitchen and nice staff. 0 complaints from me. I did order the funnel cake fries, and I think I'll skip them next time. If you eat them there I'm sure they are great but 15 minutes to drive home and they cool and become soggy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZY914kRzn2fmz5h7pRWJLQ"
  },
  "oJ7AJnyVUrC8vSZYIRjW_A": {
    "date": "4/6/2017",
    "text": "We order from here all the time, food always arrives hot and on time or earlier. Fries are crispy and not stale like with most places when you order delivery. The fries here are excellent by the way, almost like a double-fried fry, if that makes any sense. My favorite item is the Tex burger, I highly recommend it to anyone who enjoys a good burger. I have never been a big burger person myself, but it has become a staple now everytime we place an order. Super filling and cooked perfectly, it satisfies even my boyfriends huge appetite. Can't say enough good things about this place, if you haven't ordered from here before I suggest you check it out. Can't beat delicious affordable food. (:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvGckJ-WJ5OmnrWnOqD_kA"
  },
  "slOSqdX8Udp8B83lGF0DVQ": {
    "date": "2/8/2015",
    "text": "Zucchini sticks amazing! Great portions! Seriously delicious, already excited to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xG0p4dMVI8g652rXqiJ53g",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Chicken parmesan sandwich, famous Boston sandwich,  Zucchini sticks, garlic balls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xG0p4dMVI8g652rXqiJ53g/o.jpg"
      }
    ],
    "user_id": "lkC5RYGA21xN-6BlhbEFaA"
  },
  "Hu8vNZVLBMhJ0IwK6APNCQ": {
    "date": "12/15/2015",
    "text": "Even though they were about to close, they had no problem doing a late Sunday Night Delivery.. The Pie was great!  Deliver Fast and the wings were great as well.. Good Sauce and great size... I have a spot that I love (moon doggies) for the best pizza I've found in Vegas...but for when I'm home..and get a crave, Pellegrini gets the call!  Thanks guys!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TxkQr_A1rVe8zplwnm2-9A"
  },
  "g4qxtzWpzeH_Rw7tIYDsPA": {
    "date": "5/27/2017",
    "text": "My definite go-to. The Lunch Special can't be beat, great food at a wonderful price. I recommend the cheeseburger or good fellow. The fries are usually crisp and fluffy. The pizza is good. The chicken fingers can taste gamey, but are generally good. The meatballs are hit and miss, but still good in the meatball sub. The delivery is very prompt and courteous and if there are any mistakes they are quick to work with you on a solution. You might want to pass on the desert, I think most of it is not made in house.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "71kxtPFR3K0Sk1JD61Y5Zw"
  },
  "5Y3Sjk_xw8oHM1OZg8rfpQ": {
    "date": "7/3/2015",
    "text": "I have lived here for 10 years and have been desperatley searching for anything that resembles Boston pizza! Halleluhah! I've found it! The pizza is outstanding, especially if you're from Boston, chewier than New York pizza. Their steak and cheese is pretty good. Plus you can get Gyros.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gTZavDiXn-V4dFEIlvupyw"
  },
  "MKBG1DM3oeAZjsXrDwSTAA": {
    "date": "12/20/2014",
    "text": "We've had Pellegrini Pizza a few times now.  Overall the quality is great, and we'd choose them over your standard chain.  Tonight we ordered the Caesar salad and Good Greek pizza.  The caesar was tasty, but we were bummed that the gyro meat was left off the pizza, leaving us with a briny, olive and cheese pie.  As this was the first time we tried the Good Greek we were a bit dissappointed.  The meat would have definitely helped and maybe a tzatziki sauce drizzled on top since the white sauce base was lacking.  That said, this is still our favorite local pizza joint, but we wouldn't order the Good Greek again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XziqRvEwX94Bo5DSZVQDHg"
  },
  "WpMpWVKyJnGmpehAJlNWbg": {
    "date": "4/21/2015",
    "text": "ok, 1st  time ordering here.  got 2 sandwiches, garlic fries, mozzarella sticks, cannoli and baklava. would have spent over $30 if i didn't pick up and have a %15 off coupon.   wish i didnt get most of it, the pastrami was good but VERY salty even for pastrami, the turkey sandwhich, felt like we could have made it at home.  and the fries were great, if they didnt take like the frozen type from a store.  im not saying this place was bad, but it was not worth the price.  if it was cheaper, id felt better about ordering from here. everything was tasty but i could have made it all myself. when i go out to a mom and pop place i sorta hope for little twist but i didnt find it in the sandwiches.   BUT!!!! i will  be going back to try the pizza... it smelt AMAZING inside and made me want a pizza right away!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "swN7rC5IiuT576pEJeG6Cw"
  },
  "__DrsHxDN0SCFusx3toHPA": {
    "date": "5/16/2014",
    "text": "Awesome customer service!   Wasn't really feeling the red sauce on my seafood linguine so I asked if I could get the Alfredo sauce instead, changed it without hesitation & even added extra sauce! ( & no I didn't ask for it to be changed after I received it, I'm no douche)    Very popular place, I kept hearing the phone go off repeatedly. I definitely recommend this spot to anyone who loves Italian food, the food is delicious & it's a good quantity for the price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8L958l2-ZXD7c1_MmHnHsQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Seafood Linguini with Alfredo Sauce &amp;amp; a Pepporoni Mushroom Calzone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8L958l2-ZXD7c1_MmHnHsQ/o.jpg"
      }
    ],
    "user_id": "BWCOOA3O8tPF5UGqhb8JTQ"
  },
  "JcB9umlAABje-TRCUEsVpQ": {
    "date": "2/26/2017",
    "text": "Very tasty pizza and friendly service. Ordered online and it was delivered in 45 min. Just as promised.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvJg59BOeI60L8w8Nc8Vhw"
  },
  "ogFDj6fIgO4igI-sjUHRkg": {
    "date": "4/19/2017",
    "text": "The pizza is really good, however I ordered the chocolate cake and it was most definitely stale and I ended up spitting it out into the trash. It was disappointing but not so much that they will lose my patronage. It would have easily been a 4-star rating without the chocolate cake as all the other food I have tried is quite excellent! I recommend you try this place if you haven't.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6a9fSsfKg9JPbF8OY_zCQ"
  },
  "e5ZhSjGm-Zo1rZCOStHnxQ": {
    "date": "8/23/2015",
    "text": "We found Pellegrini Pizza on Yelp Eat24 and I have to say they are 3 out of 3 when it comes to 5 Star Dining, this is the only way to order Great Food in locations you would not think of looking!!! Now for our dining pleasure today we ordered the Steak \"Bomb\" sandwich & it was the \"Bomb\" one of the best we have had in Vegas & we have been here over 30 yrs, the Chicken Fingers were big, hot & juicy....need I say more!! We also ordered the Chicken Parm sandwich - excellent and finally an establishment that knows how to make a True Club sandwich \"The Triple D\"!! \"Ham-Turkey & Bacon\" no short cuts here!! Delivery was with a Smile  with current temp outside @ 105...any and all questions answered immediately from the Great Staff @ Yelp Eat24!!!! Thanks for giving our Family a reason to take a Sunday Siesta after Football watching and a Great Lunch!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5pOyEBsN-z80rQTzzFfCw"
  },
  "HYexq5YoQ4izcQUrx87nfQ": {
    "date": "3/29/2017",
    "text": "We had pasta delivered tonight. I was glad they were open past 9 that way we didn't feel like we were ordering right before closing time. I had the lemon chicken pasta and my girl had the baked ziti Pellegrini. My lemon pasta was very tasty, I will most definitely reorder it. And my girl liked her Ziti pasta as well, The potions were good for the price, we both had to save our pasta for later.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0q7gnBnpniTLETvyeGtrQ"
  },
  "z5OELmg9JuohV5K0Odz8aw": {
    "date": "5/9/2015",
    "text": "In Vegas for the weekend and wanted to try some local pizza.  My buddy wanted to go somewhere he's gone before but they weren't in business anymore.  Came here to Pellegrini Pizza and got their 16\" special for 7.99. A little too greasy for me but still a good pizza.  I wouldn't go out of my way to come here but worth going to if nearby.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OE_SshhXHJuTU24wkkuunA"
  },
  "wZiRspzfCPWqWzfdb9C9rw": {
    "date": "9/27/2013",
    "text": "Just as good as the first time. They should rename their restaurant \"Crack In A Box.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwpK7PqQX7fgTFM2Pfy61w"
  },
  "FOZoO0WpFN5CuDxyN8PgkA": {
    "date": "3/26/2016",
    "text": "Their mozzarella sticks are a must! Tried this spot for the first time yesterday.. Oh man so good. Also including very tasty garlic fries. Place is sort of hidden so you have to keep a sharp eye out",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WfdL97X0BrD3-StLJRkbA"
  },
  "-fzfSoDEIGlUEDAQLHT7Qg": {
    "date": "9/6/2016",
    "text": "After reading everybody's reviews on here I was kind of nervous going in here and trying this place out. So I ordered two pepperoni pizzas and a bucket of fries... And I gotta say the price was right, the fries were crispy and the pizza was awesome. Way better than those large chain pizzas that are made 2go. Other than that cashier being  a little hard of hearing( having to repeat myself over and over),The food was great. But they only get 4 stars because of lack of seating... there were two round tables with two chairs at each one. A little constructive criticism would be to push back that cashier's cage and put a few more tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Lh-pOke6f8p_lCu_hU-0Q"
  },
  "s7-wA9pBST81DJNe7xY_GQ": {
    "date": "6/11/2014",
    "text": "Omg amazing! I was shocked how delicious this pizza was!! I ordered the mass pike a refreshingly tasty chicken sandwich,the chicken was great perfectly paired with cucumber,roasted red peppers,basil and provolone cheese. the bread was to die for! My kids got the pizza i snuck a bite and was blown away how awesome it was!!its what real pizza should taste like! so flavorful !!i d Absolutely order from here again and recommend it to anyone!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bsy827vNyA5pDIaqVwLltg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Garlic fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bsy827vNyA5pDIaqVwLltg/o.jpg"
      },
      {
        "img_id": "zOWxQH1IkMQRj_b3QK7KxA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Big hog",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zOWxQH1IkMQRj_b3QK7KxA/o.jpg"
      },
      {
        "img_id": "IKfqBLYMc812Lp6h-UaQRw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. What pizza should be! Outstanding",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IKfqBLYMc812Lp6h-UaQRw/o.jpg"
      }
    ],
    "user_id": "NtaD2XpoErGdWAMYn7swlA"
  },
  "fmROpNvqQWeB3D2gz81JPA": {
    "date": "4/8/2016",
    "text": "The Steak Bomb sandwich is Da Bomb. I always pick up as I know they are very busy on weekend nights",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eyws3uXL9pBnxn7v6hlIdg"
  },
  "JB1MemSoxuZCZZSxS_nKKA": {
    "date": "7/17/2016",
    "text": "Calzone, the good fellow, and wings. These are my repeat orders and you can't go wrong with them. We've ordered here plenty of times and their customer service is on point! Thanks for taking care of your customers with good service and a full belly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LU3cnDOX7rJCkIwO09RfOA"
  },
  "SfbXqpqfRnw7JMwG3vFl2Q": {
    "date": "4/20/2014",
    "text": "Breathtakingly Delicious PIZZA!!! Coming from a New Yorker family, this has been the best pie we have enjoyed in Las Vegas! The staff was very courteous and sweet! The fact that they have the $7.99 pick-up special, is just an incredible gift!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZHGe95epPdgbLpbKxgs4IA"
  },
  "NbLxU1xdibk4WUuyu-xPjQ": {
    "date": "8/29/2016",
    "text": "I didn't even get a chance to snap a picture,  food was terrific as always!  Strayed away from the usual pizza and ordered meat lasagna with garlic knots.  Absolutely delicious,  lots of love put into their food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q1PU236Ra5FkzE44ZXIHgg"
  },
  "g-qCAKKmaJWq2W-_y1lcvg": {
    "date": "7/14/2016",
    "text": "This is my second time ordering and food taste good! Calzone is big and tasty, definitely recommend to try it! Took about 30 min to deliver which is pretty good for delivery! Definitely will be ordering again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "al7Cd_tI73mypEYHvDtcBQ"
  },
  "tvScwoYLY85laxw3vUyfoQ": {
    "date": "6/18/2016",
    "text": "I really enjoyed food. Thank you guys for an amazing customer sevice. I'm definitely going to visit this place every time i come to Vegas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S9MseaFEDGB8axYHkU7b6g"
  },
  "mAYKHIePlfFy_IN21w0f7w": {
    "date": "4/26/2016",
    "text": "Great tasting & very fast!! This place is awesome!!! Can't wait to order from them again!! Keep up the good work, guys!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOgfNENqqN0O-ofWA8uyOA"
  },
  "26MSvg6mevX1b8dLYY7SQg": {
    "date": "11/19/2015",
    "text": "Food was good. We had the Greek pizza which was refreshingly different than what we usually get. I really enjoyed it. We also tried a few desserts. The eclair was just from a box of frozen pastries. It was eh. The cheesecake was probably purchased frozen as well but tasted better. Might have been fresh. Kids really enjoyed the funnel cake fries but it would be nice if they could use a container that would keep them warmer on deliveries. Delivery was pretty quick but not quite fast enough to keep the funnel fries at their best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "76crp1vXF1A3LOoNP6zcUQ"
  },
  "UQAWImz3AFkZaWmnUHOz7w": {
    "date": "8/20/2015",
    "text": "The pizza is really  good and they have good pickup specials, we love their breaded mushrooms! But when you order pizza and tell them square cut and you pick it up and take it home, open the box and it was messed up because they originally cut it into triangular and then they try to cut it into square doesn't make it right. Don't butcher pizza it ruins the eating experience! But they did make it up and delivered us another one on the house!  Now that's what you call customer service! That's how you  get loyal customers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pu1_PMckwI8FMecSvvjqng",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Breaded mushrooms! Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Pu1_PMckwI8FMecSvvjqng/o.jpg"
      },
      {
        "img_id": "CfKxkqgZnJe3m3AT-FBSiQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CfKxkqgZnJe3m3AT-FBSiQ/o.jpg"
      }
    ],
    "user_id": "WOCKW0XjveidP8bZlohJRw"
  },
  "P90gpqg6KzdAFwWyPy3-dQ": {
    "date": "5/22/2016",
    "text": "Pizza wasn't bad. I read a review of it being greasy and the crust doughey but it wasn't like that at all. The toppings looked like the prepackaged stuff from store and they didn't put much of it on either. It tasted fine though. They gave a 10% discount for first time customer so saved like $4, but I'll take it. The breaded mushrooms weren't the best I've had but they tasted good. Really nothing to complain about for this place. The food was good and it was ready when they said it would be. My reason for giving three stars is because I feel three is average. There is much room for improvement in my opinion, by I also haven't eaten everything on their menu so I can't give them less than that either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jeHHgKJJC9b4z9vW34HhMw"
  },
  "mdw-NV3v4mZ9LageSJp59w": {
    "date": "11/17/2015",
    "text": "The food is disgusting the burger was a microwave patty that was greasy and under cooked they delivered the wrong food and then kept my change not even asking if I wanted to give them a tip for bringing me the wrong food! Never again for me the wings were not bad I will say that they were under seasoned but the sauce was good",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3KCZRhFcow2m-t8JBEmrKg"
  },
  "ngyP5JYgsFUbU8LEWBZINA": {
    "date": "8/29/2016",
    "text": "My pizza was delivered totally burnt on the bottom. This was my first time ordering from them, and it is my last. Who delivers a burnt pizza? No pride in their product.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQumZ9swx8WRU1aWMb38rg"
  },
  "4pZX5Id1OzUhyJP0MzzzYw": {
    "date": "8/26/2017",
    "text": "After the reviews I read, I was expecting a lot more.  The pizza is awful!  The cheese is okay but the crust was hard and it didn't taste fresh like it had been a reheated pizza, thrown back in the oven to melt the cheese or something.  I called it in and arrived 10 mins before the 45-minute window as advised and waited for 5 minutes.  I live 5 minutes away and the pizza was barely hot and that is why I think it was a reheat and not fresh.  I ordered Garlic Parmesan chicken wings and they are drenched in some white sauce and sprinkled with white cheese and parsley.  I couldn't even taste the Garlic or parmesan cheese.  $30.00 wasted.  I usually order pizza across the street at Verrazano Pizza and it is awesome but I thought I would give this a try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "82dJ017eYrdrakjLpGdJOQ"
  },
  "b6atJH0uMh_WJRSPIINxUA": {
    "date": "1/11/2014",
    "text": "Ordered a Greek salad, garlic parmesan wings, a Triple D and toasted raviolis. The raviolis were cold when they arrived. The Greek salad was filled with green and black olives. Greek salads should have kalamata olives.   The Triple D shows that it is served on a Hoagie roll. It was served on toasted white bread and was soggy upon arrival. Lunch meats seemed prepackaged and pretty much flavorless.   Ughhh the garlic parmesan wings didn't looked seasoned at all and tasted like they had been deep fried sans garlic and parmesan. Very disappointing food all around.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AGXyI_K8StzQ7CGehQ2tQ"
  },
  "_aKmlTK0ij-BLtsFxW9ouw": {
    "date": "8/15/2017",
    "text": "They did't read the special request for my pizza order, so why ask?!  Pizza could have been good if they did. I asked for it well done but not burnt. It was soggy, also wanted red sauce no white sauce. It came with no sauce. A True shame to spend $32.00 on pizza and end up at McDonald.....the one thing we were trying to avoid.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g--TZHNr9JCDr-ZCPd0EDw"
  },
  "dKGwzxnaiQl6fYgHg28TZA": {
    "date": "3/8/2015",
    "text": "online menu had items listed that this location no longer offered. Delivery was faster than expected but garlic knots were burnt and dried out, mushroom Swiss burger was decent nothing special and curly fries were a little soggy. Pizza reminds me of a good frozen brand pizza but definitely does not taste freshly made. I wasn't impressed and won't be going back, there are too many other options to settle for mediocracy.  Ordered again going on two hours still no delivery wtf two chances is more than enough",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1HoHe93ibMEVjG7vKJMhA"
  },
  "wAP-MpFQhTtkDukKSyZGKQ": {
    "date": "1/17/2016",
    "text": "Good af! Ordered for my sister and I, Sunday afternoon. Must not be a busy time as we got our food in 40 min. Delivery driver was personable and polite! 10/10 would recommend . The food was amazing, ordered the caprese salad with grilled chicken and balsamic, and it was delicious. The chicken tenders, fries, and ranch were next. Got the order of 10 and could not finish! Saved 1/2 for later. The fries were crispy on outside, soft on inside. CHicken tender white and hot. Had them mild, and were tossed in the sauce, so I would ask specifically if you want the sauce on the side. Will definitely order again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BZsmZYtQwiiJCFog-eHBUg"
  },
  "cf9vUK6UQ34Z3V8Lhh4lRw": {
    "date": "2/11/2018",
    "text": "My coworkers picked Pellegrini out as a pickup lunch option after one of them demanded we not choose Little Caesars... It's not even very close to our office but we gave it a try.   I'll say it is a better quality than Little Caesars but nothing to rave about. It's the step up from fast food pizza that you would want to eat when you've had a few beers but probably not any other time. They ordered a Supreme but I stuck to the cheese. It's not a particularly hearty pizza, and the crust was a little bland. The quality of cheese was better than expected. Let's say it was a sufficient pizza for four engineers working through their lunch. We may do takeout from here again but I'll want to explore other options before deciding the drive is worth it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yr8fUHq0CMQI0KDDV-5veQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Supreme Pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yr8fUHq0CMQI0KDDV-5veQ/o.jpg"
      },
      {
        "img_id": "15oiULnQOi6dWNUYlN5ubQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Cheese Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/15oiULnQOi6dWNUYlN5ubQ/o.jpg"
      }
    ],
    "user_id": "rYPjqZO89ABei1fsZBSUbA"
  },
  "Tmqc8c-2AEwfkkThkCGYXg": {
    "date": "7/23/2019",
    "text": "Great food . They are always quick and good customer service even if you call 10min before they close!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68c7sEHr38tc5dYuVmWu2w"
  },
  "CEcFQBI3nP8Vd5dtFrMRwg": {
    "date": "3/31/2019",
    "text": "New favorite pizza.. HANDS DOWN! I called at about 4p.. with 1000 questions. How much, what coupons, how many people will it feed, WAIT! Not that.. change to this.. wait change it back and LINA was an absolute doll! She helped me feed 15+ people with the 30\" pizza, wings, and fries. DELICIOUS! Just a little crisp on the pizza and YUMMMMMMM-O! The wings were perfect too! $70 for the 30\" pizza, 40 wings, fries, and one additional 16\" pizza. Thank you Lina! You (and the pizza) are why we'll be back time and time again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1zqY67eWCrTzP1t1bxGs7Q",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. 30&amp;#34; pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1zqY67eWCrTzP1t1bxGs7Q/o.jpg"
      }
    ],
    "user_id": "Ky46Bt6dNR-Q886nXNVksQ"
  },
  "FXI0LiUlNeH9yyrMEAi64A": {
    "date": "3/12/2019",
    "text": "Such a good pizza. So many options to make and build your own.  Always hits my pizza craving spot. And that's hard to do.   Get ranch on the side so you can dip the crust.    Only complaint is that their chicken wings are hit or miss.  Maybe their supplier is not the same all the time. But other than that, super good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsnVveOndIxCpxvHARI8AA"
  },
  "VytldD5bxsJqXFJFSkbWdQ": {
    "date": "8/26/2019",
    "text": "After trying what feels like almost every pizza place in the area I have got to say that this is the ONLY pizza I'll eat and enjoy in Vegas. I'm from NYC and I am super picky when it comes to pizza. This is the only one that satisfies. They have these HUGE pies too, one 24 inch can feed an army. Garlic knots are spot on too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xg5vys-gyHRmq9yExHO3qQ"
  },
  "6CAsixLFHInD6MpmOXkX7Q": {
    "date": "1/17/2019",
    "text": "Pizza Perfection. Got the pick-up special for $7.99 added pepperoni for $1.75. Super delicious. Tasty homemade sauce, high-quality cheese (and they're not stingy with it) and really nice texture on the crust, all baked to golden perfection. There was no room for improvement - really enjoyed it. One of the best pizzas I've ever had. Maybe the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eU_SmBD_C6Gj9e3oBs_vpA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. 16&amp;#34; pick-up special w/pepperoni. Yep, couldn&amp;#39;t wait, one slice missing.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eU_SmBD_C6Gj9e3oBs_vpA/o.jpg"
      }
    ],
    "user_id": "-nOEpxNU_5a1WJiOKqebPw"
  },
  "rqPsupiHHA47Fsx0lOKQhg": {
    "date": "9/3/2019",
    "text": "Food is not cooked to order. Will not be visiting this establishment ever again. Threw most of the food away as it had no flavor and was inedible.  I do not recommend the gluten free crust at this establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnjuxyndgpO98BM5qohySA"
  },
  "1hTfq8NmLIuBr2Dhx7TSDA": {
    "date": "7/11/2019",
    "text": "Great deep dish when we needed it while traveling in Vegas. Nice family store. Clean place and people. I would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E6YZo2Io5Pv6aP8FYiPSvQ"
  },
  "JKsmhRpgctKKjRGaIy1sYg": {
    "date": "7/11/2019",
    "text": "I love the pizza! And the fries! Only reason I wouldn't give five stars is because the garlic knots were really just harder pieces of dough, and had no taste. They also take a little longer than I expected.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9TPjfEGsNTvVILpHh0t3A"
  },
  "CvQxOaoZMcywa69yXlbh3g": {
    "date": "3/14/2019",
    "text": "I have to say and take back my negative review from before! Jacob the manager wrote me personally to apologize and gave it a second go. It was sensational! Pictures to boot. Sauce is yummy! Everything the way it should be! Thank you guys for making it right!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RBQy_UB2kbuSh3Gax41d9Q",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RBQy_UB2kbuSh3Gax41d9Q/o.jpg"
      },
      {
        "img_id": "poMPdC1UWLLk9VQzCAiosw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/poMPdC1UWLLk9VQzCAiosw/o.jpg"
      }
    ],
    "user_id": "L8TtVbCL1ltbNRe5ht8FdA"
  },
  "b-a8sJPL3MA4bu-p2U6XLw": {
    "date": "5/6/2019",
    "text": "Failure of a pizza place. First time I ordered through uber eats my delivery never arrived but I was still charged full price. Upsetting, but that doesn't mean it was the restaurant's fault. Decided to try again a few weeks later through grubhub. Food arrived was old. OLD! the crust alone was prehistoric overcooked and 0 flavor on the pizza despite paying extra for 3 so called quality toppings. The chili fries I ordered were okay. Same as the pizza very bland chili. I had already resolved to never order from them again but went to a friends house who was picking up pizza. Pick up! Yet once again the pizza was horrible I dont understand the reviews for this place, three separate occasions and Pelligrini had yet to deliver anything palatable let alone worthy as being considered a good pizza spot for late night cravings. I have been fooled too times too many. Avoid this place please.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xOeVKsTH5OEXCmD5IBw8dQ"
  },
  "gfgS5hmlyTl43VcSH-qgeg": {
    "date": "1/5/2019",
    "text": "I was skeptical when I first ordered from here. I'd gotten used to the pizza place that occupied this space previously. I have to admit that my loyalty was easily changed. The pizza was hot and cheesy and gooey and delicious. I ordered 4 times in one week after my first order. Not gonna say I ate here everyday for 3 of those 4 days but I did.  What really got me was the customer service. My boyfriend and I ordered the pickup special and the wings lunch item with one extra drink. We called at 11am right when they opened and they let us know it would take time as the ovens had to heat. I'm 32 weeks pregnant and was getting really hungry but I don't mind waiting for quality food. We waited the appropriate time and I sent my bf to go pick everything up. He came home with the wings and the drinks minus the pizza. I was pregozilla at that point and was like \"where is the pizza.\" It turns out that the ovens didn't cook the pizza evenly and the restaurant didn't want to give us a subpar pizza. They offered to make us a new one and deliver it to us for free. I was annoyed but it understood and set on the wings and fries while we waited. 10 minutes later the pizza was delivered and they threw in a couple drinks for the inconvenience. The pizza was literally so hot that I picked up a slice and piping hot cheese started oozing off of the slice back into the box. I was so surprised I burnt my finger trying to catch the cheese to eat it. It was delicious! I let the pizza cook down a little before going back at it. Me, my bf and our daughter literally ate the entire pizza in 20 minutes. I can say I've had some great customer service experiences and some great food experiences but I rarely have them so closely connected. I appreciate the quality food produced here. The pizza, wings, fries, and chicken tenders are all amazing. I can't wait to try more of the food they have to offer!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VPa6EBc-nfgogppwrHYB-g",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VPa6EBc-nfgogppwrHYB-g/o.jpg"
      }
    ],
    "user_id": "SkCd0ZkiFJXk5cbsRlfpdw"
  },
  "tPYvXIDv5WBKF-r2y5cXDA": {
    "date": "6/2/2019",
    "text": "Where do I start. I've been ordering from this place for years. Over 3years, I've always loved the food. We order from here all the time, even after a few messed up orders. To make a long story short, the last three orders they've messed up like clock work. Down to receiving the wrong pizza, the wrong amount of wings and today they totally forgot to bring my wings. The most frustrating part of all this is that they just say sorry. They don't Offer a credit they don't offer a discount or anything. If you do order from here I recommend you pick up your food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9X0leJyXgYFTxqKQyFwww"
  },
  "vBXN55Lk9FwSEUlio4HbeQ": {
    "date": "4/29/2019",
    "text": "The delivery used to be awesome and fast. Yet the last two times we have ordered for delivery it has taken well over an hour. Today it was an hour and twenty minutes and our food was luke warm. The French fries were rubbery they had cooled that much. If you are looking for a pizza place that delivers I would skip this place unless you like cold food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWN3G__v79Cd8nBnwToEAg"
  },
  "APit_U5f0NQyTjKzZvvZ9Q": {
    "date": "9/17/2017",
    "text": "Friendly Service and LOTS of Food Choices.  We ordered the 18'  Pepperoni Pizza with Half Cheese Only.  Delivery guy was nice,  polite, and arrived in a reasonable amount of time :)  The salad was a miss for me. I didn't like the bell peppers and jalapeno mix. Normally that would be a bonus, but the salads layout just didn't look so good. The taste was just off to me. Might just be me though ! I just wanted leafy greens, tomatoes, and you know basic garden salad. Somehow I missed this, on this particular salad.  Next ,the pizza was really thin, which was awesome for us! The pizza itself was just \"Ok.\"  I would order from here again. It might be a while though.",
    "rating": 3,
    "rated": {
      "funny": 38,
      "useful": 67,
      "cool": 50
    },
    "photos": [
      {
        "img_id": "P0qBu158eLsukI50pEvLBg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pellegrini Zucchini Sticks September 2017",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P0qBu158eLsukI50pEvLBg/o.jpg"
      },
      {
        "img_id": "GJcnUeUfPKuIu7lZP8GdLQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pellegrini Pizza Sept 2017 Clearly someone took a piece before I could take my photo for yelp.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GJcnUeUfPKuIu7lZP8GdLQ/o.jpg"
      },
      {
        "img_id": "z5D74Ax7arGtgdOOtqZlGQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pellegrini Menu Sept 2017",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z5D74Ax7arGtgdOOtqZlGQ/o.jpg"
      }
    ],
    "user_id": "kl_yCsj4ESbUphmpCfVvRA"
  },
  "_r2OnpeBVtsxmL5KSI0S8Q": {
    "date": "1/7/2019",
    "text": "Great People, Great Food Jacob, Edgar & the rest of their team are thoughtful and truly care.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yz0rgZ4v1J9mXEZAnJ9ySQ"
  },
  "_cmB1_79r0p2MjOzwmm3ug": {
    "date": "10/9/2018",
    "text": "I hate feeling so-so about this place. Sometimes the food is absolutely amazing and sometimes the food gets me super sick. I gamble with this place because my husband loves it so much.  This evening we got two Parmesan sandwiches: veal and chicken. We also got garlic fries and garlic knots.   The chicken one was over cooked. Both the sandwich bread and the actual meat was over cooked and under sauced. The veal one was very mushy.   The garlic fries were very greasy.  The garlic knots are definitely something you can skip. There wasn't anything great about them.  I get why my husband keeps going back. When the food is done well, it's great. Other nights like tonight make me never want to go back. Let's just say I'm not feeling so hot. Tonight is one of those nights where I never want to order from them again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "szp2U1vmBor1N_awHyP6_w"
  },
  "ISeYLiws23p0rjnOxGB8Vg": {
    "date": "4/22/2019",
    "text": "Visiting my daughter from Cali and this place was fast on delivery and the driver was very polite and the French dip is amazing and the breaded mash rooms",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JmcyIr4hmf6B9BFsLzTLwQ"
  },
  "KG3Ay2qcstQsTX9XPOHkfA": {
    "date": "1/22/2019",
    "text": "This is one of my favorite pizza place in this town. Everything is so yummy and made to the perfection.  I am a cheesy garlic bread lover and they have the Best of it.  By the way beside all the pizzas that they have and are great I can recommend you to try the steak bomb sandwich... supper",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMmIjgl47WszGo8W5bCuNA"
  },
  "E5hIf98koywer0ZkqxSvDg": {
    "date": "1/10/2019",
    "text": "awesome place, always provides over-the top service. Their staff are incredible, down to the people in the back working as hard as they do, everybody makes it well worth my while to stop in. The food is delicious and always fresh, truly a hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UwrZEBW99BT14ahKGNrSQg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Hawaiian pizzq",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UwrZEBW99BT14ahKGNrSQg/o.jpg"
      }
    ],
    "user_id": "QLu6cV16HI6imWknGOlNIQ"
  },
  "6Ehb7HipxNe5QwWSNARc4w": {
    "date": "9/6/2014",
    "text": "Had a craving for Pizza & Wings and I'm so glad we picked this place.  We ordered delivery and our food came in within the said time (1hr).  Here is what we got- 3 lbs Chicken Wings (24 pieces)-we got mixed styles,buffalo medium and BBQ,  both extra crispy and equally very tasty!!  French Fries-to my surprise the fries were still very crispy and very good (esp with Ranch Dressing) 14\" Supreme  Pizza - Pizza was OK,  just a little too greasy for me and I didn't  like the cheese much but the toppings were fresh and tasty!  2 out of 3 ain't  bad,  I will definitely order from them again!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "v0gOaRibu5Hd4w2Wdrz5ZA"
  },
  "cek-erIc0Ip0509xOkocNg": {
    "date": "6/24/2016",
    "text": "We wanted to try something new for pizza and this did not disappoint. We ordered 2 16\" pizzas one pepperoni and another sausage. We also ordered some chicken wings. Pizzas were very good. I love the taste of the sauce it had lots of flavor our pizza had the perfect amount of cheese. My kids loved it so did I. Our wings were very delicious and very spicy we ordered medium and I felt it was really spicy.. I really loved the customer service the wait wasn't so bad but they keep telling me how much longer , which I liked. I will definitely recommend this place and will come again.. 5 stars!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3KirGDzc_jWF4MR0mrRAnw"
  },
  "3c_zy5VdVHxnXtTs1qg5MA": {
    "date": "5/9/2016",
    "text": "Ordered online at 8:30pm for delivery they finally showed up at 10pm. That's after we called and they tried to tell us \"we just placed the order\" ah No! So we're sitting here thinking this better be the best food ever for the wait annnnnnd it's NOT! It's good but really an hour and a half for two sandwiches, onion rings (which they forgot), and zucchini sticks. We called about the onion rings that were forgotten (I mean why wouldn't we; we paid for them) and they asked us 3 times what was forgot. Get it together people! They then said they can bring them but it will be ANOTHER hour! We took the credit instead. The food was mediocre at best. Never again for this place. Good luck future customers and congrats to those who actually got great service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwxIAhvgoYQZr6VNz1lvhA"
  },
  "bbGsknBdE30w-ogq5Iic2w": {
    "date": "5/19/2016",
    "text": "Been ordering from these guys for a little over a year (I think) and they never disappoint! I'm glad they are super close to my house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pjYcv0ANoYaAmLd2QhYc5g"
  },
  "ciiSpWKlOD9iPGQcoWAEMw": {
    "date": "9/16/2017",
    "text": "I order the first time tonight, got the pizza with mushroom, basil, green peppers and pineapple, garlic parmesan wings and french fries. I am particular with my fries and love that it is crispy. Pizza is good and garlic parmesan wings is an acquire taste but it was still ok. Order Dr. Pepper but got coke instead. Satisfy my cravings for tonight.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ypl2D6K-gItcF3FWSqLQ9A"
  },
  "pvEFTS9KQCAt0IrniH5NeQ": {
    "date": "9/23/2014",
    "text": "I was looking for a pizza delivery place w/ more of a gourmet spin. I ordered a 1/2 sausage/bacon & 1/2 tomato/basil. The cheese had such a great taste that I liked the simple basil/tomato more. They have some good specials and the garlic knots/zeppolis are cheap and come w/ tons of bite size pieces great for sharing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Eb7XuhfPvEacgLRl2qfBHA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Eb7XuhfPvEacgLRl2qfBHA/o.jpg"
      },
      {
        "img_id": "A2_MPY5avdhREniQ7vysIg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A2_MPY5avdhREniQ7vysIg/o.jpg"
      },
      {
        "img_id": "oSg0WRSB5QyeIqeXF4BxAA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oSg0WRSB5QyeIqeXF4BxAA/o.jpg"
      }
    ],
    "user_id": "KZW0c_75fvmZ5_9iHeJAkg"
  },
  "c8YZQ1Oa2aYeEYt8OaD73A": {
    "date": "10/24/2016",
    "text": "Had a long day of work, and was looking for some good wings. And was hoping to have them delivered, Google and found this them. And very happy I did!! Good prices good customer service, the person that answered the phone(Lena) was very patient and helpful. Delivery came ahead of time, food was great and cheap. I live at least 7 miles from them and they delivered for $3.50(amazing) not to mention they were do to close at 11:00 and still took my order at 10:45 pm. I'm sorry happy I found this place, and I'm excited to try serval things on the menu. I had wings hot & lemon garlic, I had the supreme pizza, and the fries!!! All were great!!! Thank you PELLEGRINI PIZZA",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAc7sJ3Mb1C16xeGJOYeEQ"
  },
  "jPtvhnohHpV0KKip0SqLVg": {
    "date": "7/17/2016",
    "text": "The calzone I ordered was amazing! I also got some garlic knots which were tasty but a little dry. I was impressed that their chicken fingers were homemade. I enjoyed how juicy and tender they are. Definitely worth checking out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QXtasoVTQJuEjbmbLsDGA"
  },
  "bVN6tT83ud7UbUngAapADA": {
    "date": "7/26/2016",
    "text": "Had a white pizza with ricotta. Ricotta could have been better quality. Garlic knots were over baked. Honey BBQ wings were in a very  runny sauce. Delivery  took over i hour.  I will still probably try other  pizzas here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJpL4_LoObf_O6WfqnJ6zA"
  },
  "4hsJQAzOrVx_Oe0SzFuqdA": {
    "date": "7/6/2016",
    "text": "Ordered Cheeseburger and Mozza Sticks delivery for lunch online through YELP. Delivery time said 50-60 minutes, took about 70 so a tad late, but 60 minutes would have been ten after noon so lunch buzz, I forgive the lateness. I ordered the burger medium rare, came overcooked at well done, that was disappointing. The fries were excellent, but the burger should have been the main focus. Also the Mozza sticks seemed microwaved, very soggy and the cheese was hard, not melty and soft like good Mozza sticks should be. The Delivery guy was very polite. All in all, I would feel comfortable ordering again, although maybe for dinner/late lunch instead of first thing when they open.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3a8JVsABTdbJ8pLVX-Dcsw"
  },
  "ZtqkyYV6DmiDIEBJ5AXUYg": {
    "date": "10/11/2016",
    "text": "I have always ordered from this place on numerous occasions. I ordered today and the item was not acceptable It was hard as a rock. I called and received a shocking rude gentlemen. You have just lost business today!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8EvboCrnPrAsXLWpysTgVA"
  },
  "9DbBguCXPXIZzS5PEZKkug": {
    "date": "4/14/2016",
    "text": "Overall a good Pizza & Wings experience, with decent on time delivery. Had their Pizza, Wings & Soda special; the pizza was a good tasting pie and the toppings were evenly spread which for some reason is hard to find, the only thing keeping this rating at four was I thought they could have been a little more generous with the toppings. Wings were tasty and well cooked another plus, the sauce was actually a cut above most wing places and they had a little heat. All in all I will be back, if your in the area they are definitely worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L6-_EsiHFy3a1K2kGOdm1g"
  },
  "s8KNjg6eSHWFZzFDaGc_Qg": {
    "date": "1/6/2017",
    "text": "I was trying to order pizza from my usual pizza place but they closed early for some reason, so I  Yelped and found Pellegrini Pizza. I got a Mushroom and Olive pizza. It was really good. I am usually skeptical about small pizza shops and usually wondering if they have a B or lower grade, but when I went to pickup my pizza I noticed on the wall an A rating. Well the health department was not wrong, and I would give this place 4 stars. So if you are looking for a yummy pizza I suggest trying this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "20if7MTlDcD5UKnv3SIroA"
  },
  "uXAvswxm6JFfJoxmwLV7Xg": {
    "date": "9/30/2014",
    "text": "The service here was great, which I don't usually expect from a delivery order. The man who took the order made sure I knew that the lemon garlic wings were not saucy, but seasoned, which I appreciated. The wings were not for me, so I can't comment on them.  The pizza was pretty good. Better than Little Caesars or Dominos and similar places. Not like Sammy's or Settebello, but they deliver :) I would order from them again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "msxc1VlPTD6E-0Kns7bIFw"
  },
  "okqJLrpkUZSI8iMTOS0ubg": {
    "date": "11/14/2014",
    "text": "I had the best pizza ever ,I love the wings too.. And fast delivery specially for the big city ... Good job , I'll see you in my next trip :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u2P34mJwnnE0qiDrpvRUxw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u2P34mJwnnE0qiDrpvRUxw/o.jpg"
      }
    ],
    "user_id": "3GltfaMuzceA37Nz800QjA"
  },
  "4Yl1lMQ5Czba0xk6KeUPxA": {
    "date": "11/16/2016",
    "text": "Had a Goodfellow sandwich and it was tasty. The prices seem a little steep, but all around I've enjoyed the food from here. Not bad for a night you choose not to cook for the family.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G47qqGrHfkUgQmU43ZUmmQ"
  },
  "6XCx40fzQamGe109YCRyJw": {
    "date": "3/11/2016",
    "text": "Tried the lunch special chicken tenders and pizza since the min to deliver was $10 i ordered both and it was great!!! took 45 mins but well worth the time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "V0sUXQGkH-_uotiLhyxSZw"
  },
  "1RYenrz7tk1oXCGq3e7hUQ": {
    "date": "3/27/2016",
    "text": "It was ok. Much better than Pizza Hut - if that means anything. I thought I would give it a shot. I doubt I'll be back. I had pizza and chicken strips. The chicken was awful. Staff was very gracious though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8o6oWQsJ6mcDgks4EgOXug"
  },
  "o_fg-eLoUG4kLwWbsS1IUw": {
    "date": "4/18/2016",
    "text": "Wasn't a huge fan of the cheesey garlic bread.  It seemed dry.  The philly cheese steak was juicy and delightful.  I definitely think it needed the extra mushrooms and peppers. (We only got onions and cheese) but the flavor is awesome.  The ranch was good and homemade.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GV0GUHH_tj_eKrJeUi5_Pg"
  },
  "PMr6rbTsISioAVg8uMgvCw": {
    "date": "4/16/2014",
    "text": "My 50 on 50 yelp review...   I have been wanting to go here for a while and glad I did. I currently have two fav pizza joints to go to know between sabitino's pizza and Pellegrini Pizza there both really amazing places.   I had Philly Cheese steak pizza and funnel fries ..  First off let me start off buy saying get an order of funnel fries !! I haven't seen alot of places that do this and here there amazing some even have a carmel texture to them after the powder sugar sets in -- if I could cause this is where I would inset text and say there f ing amazing seriously really good. -- only thing you need with this is a nice pilsner   Pizza was really good too these are not what you call light pizza's I tend to think more on the heavy side for a definition meaning crust and dough is heavy witch is good and bad the bad meaning normally you can only eat about 2-3 slices before getting stuffed however taste and flavor was really good -- normally on a philly pizza its a little overly salty or bland tasting it stood up really good.   They have a huge menu amount of menu items ranging from popcorn shrimp,fried rav, lots of sandwich's, burgers and large dessert menu cannoli's.  This place is worth checking out at least once and forming your view. There prices are just right and not crazy lie some I have seen.  They also offer delivery and coupon threw eat 24 and I think they do grubhub.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "8hJM27VoDr3rrOqWSQfrLw"
  },
  "i2cJXcWc4Nhd52rlSqLwMA": {
    "date": "7/19/2019",
    "text": "This is probably one of my new favorites now, I ordered the Fettuccine Alfredo and the Pilgrim Pizza and they both were amazing and fresh! I even got some Funnel Fries to splurge and was supper happy with the turnout.   The whole ordering process is pretty basic and straightforward, for pickup anyways. I did see that they offered Delivery. If I remember right they even were on Postmates, Uber Eats, and Grubhub.   The wait was 20-25 minutes, I showed up on time and everything was ready and all I had to was pay, the atmosphere was nice, the workers were awesome. The lady who took my order also cashed me out, showed me the pizza that looked delicious.   I will most definitely be coming back here, also right down the street from me so it's super convenient!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdvBQuSE2OvtDEp0P7Jzqw"
  },
  "5p6DGoW529IR8FCPlbiLUQ": {
    "date": "9/22/2019",
    "text": "Sometimes it isn't always about the food. Most times, it's about the experience.  I love za.  My wife hates it.  They say opposites attract and nothing could be more polarizing about our relationship than over pizza.  I did my usual search for pizza, but wanted to try something new.  I found some great reviews about Pellegrini and decided to make the 25 minute drive to pick up my order.  Calling along the way, the person taking the order suggested getting the Take-Out special, which offered a 16\" cheese pizza to start and then build the toppings, which was about a $5-6 difference in cost from the 18\".  Awesome.  It was a phone call and already they hooked me up with a special.  I walked in and after the usual chit chat, took a chair across from Arthur, who I learned was the owner.  I've sold into fast casual and quick service for quite some time now.  On a daily basis, I talk to restaurant owners who gave me so much insight and respect into what they do.  No one sacrifices more than a restaurant owner.  It's an unforgiving, demanding, beat-you-down job that doesn't end when you close for the evening.  Most owners I meet are tired.  A few wake up and realize that they've raised their kids beneath kitchen tables and missed all their life's highlights.  Arthur was no different and our brief 15 minute conversation was easily the most rewarding conversation with a restaurant owner I've had in months.  Arthur hails from Boston.  This is his second location.  The first is by 95 and Rainbow.  We got into a conversation about clam chowder and how if he had that on the menu, I'd live happily at his store.  He confided in me that he had traveled the coast from Maine to Cape Cod learning, conversing, researching and testing the best clam chowder you could find on the East Coast.  He used to make it every day at the other store.  When his time constricted and he couldn't maintain the quality of the chowder, he took it off the menu.  I commiserated with him on the hardships of finding good talent - someone who would open/close on time and not take shortcuts on the menu in a town where the very same talent could get twice the pay on the Strip.  No one wants to make the sacrifice anymore.     Let's take a step back and take a hard look - he's working on a Sunday night with a very young family at home.  Sacrifice, people.  Finding it is like finding a unicorn in your back yard.  I ordered the pizza and some breaded mushrooms.  East Coast style pizza.  Foldable and, for this pie, easy on the oil.  Trouble with a lot of East Coast pizzas are that the cheese to bread ratio is unbalanced, so as the pizza cooks the oils seep through the crust and collect on the bottom of the box.  I believe that a good East Coast pizza is one that has that figured out, where theres enough of the cheese flavor to carry through the crust - unless the crust is supposed to stand on its own. Overall, the pizza was good, with the Italian sausage sliced instead of in chunks - I prefer it with chunks.  Arthur and I reminisced about the addition of chorizo to the pizza like they do in Southern Massachusetts/Rhode Island/Connecticut - where the heavy Portuguese influence lays into the culinary scene.  Overall, great experience, awesome conversation, and good pizza.  I recommend Pellegrini Pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fzk6lQcLZrCQWHDF1uLyJA"
  },
  "sKQ09G8UrDfhvytEdZO8iQ": {
    "date": "7/5/2019",
    "text": "I hate giving local places 1 star, but this place severely disappointed me!  We ordered a to go pizza and order of garlic knots, needless to say, they were so dry and flavorless, my fat pregnant ass couldn't even finish one slice! And that says a lot, because I love food!  The pizza was so greasy and the knots had no garlic butter on them! They were burnt, little balls of bread. They were tough and dry, my son almost choked on one!  We ordered and were given a time to arrive and we were there a bit later and still had to wait!!  There was someone who showed up like 5 minutes after us, and got their pizza before us... like wtf?  Anyway, this is a strong pass from us! The food was just, horrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJh4F1zFNJb2wXCNT1uNWQ"
  },
  "euW8TgpbpCviw-Y7qS4jPA": {
    "date": "6/29/2019",
    "text": "Ordered from grubhub and I'm impressed. The food came well packaged , still nice and hot. I got a small calzone and chili cheese fries. The portions are huge, I couldnt finish in one sitting.  The calzone that I got was ham and meatball. I saw homemade meatball dishes on their menu, so I assumed they will use the same ingredient for the calzone. I was not disappointed.  It's great for the price Good job guys and great cooking !!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Vy7gBT73czFIMUhKETt1eQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Chili cheese fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vy7gBT73czFIMUhKETt1eQ/o.jpg"
      },
      {
        "img_id": "a49E4Bm_Ex2JIw9vSoS-Fg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Calzone",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a49E4Bm_Ex2JIw9vSoS-Fg/o.jpg"
      }
    ],
    "user_id": "bTLYe1FJ4LNnwJAfaOxvEQ"
  },
  "dzGYXsMx3UQ8g3hXjpItuQ": {
    "date": "6/8/2019",
    "text": "So glad I finally tried this place. They have an amazing, extensive menu. They have a huge selection of pizzas along with pastas, appetizers, entrees, and desserts. They have create your own too, so if you have certain toppings that you like, they'll do it!  We had the Greek style pizza which was a white pizza that had lamb, olives, spinach, tomatoes, and more that I'm probably not thinking of!  I also had the corn that had the sweet buffalo sauce on it - it was super good! The pizza was great. The lamb was really tasty and it had a perfect amount of cheese and sauce. The frost was nice and crispy but not overdone.  Overall this place was great! They're big on delivery too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xghpula-O9D1zE3Bjxrplg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Xghpula-O9D1zE3Bjxrplg/o.jpg"
      },
      {
        "img_id": "AzQrcVN-JFnnc2_KJ_pFXg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AzQrcVN-JFnnc2_KJ_pFXg/o.jpg"
      },
      {
        "img_id": "WuysdGUFd6g7nAWM_POSDA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WuysdGUFd6g7nAWM_POSDA/o.jpg"
      }
    ],
    "user_id": "exI-NdAYVoA6fx9Ouu0gjA"
  },
  "5Tfl7aUQ2KzBQZUWQQAW_g": {
    "date": "2/28/2019",
    "text": "First night in Vegas, after a long trip we were looking for a quick bite. We though about trying Pellegrini Pizza since it was close by.  The prices are very cheap, and indeed, like some of the reviews said, the GARLIC Knots are definitely worth it.  I ordered  Greek Pizza.... White sauce, fetta... But they really exaggerated in the amount of olives (green and black). Honestly if I were to name this pizza I would call it Olive Pizza bc it took over the flavor of the pizza and it was really overwhelming.  Friends ordered sandwiches and they were very happy. The one that ordered pasta had to really wait for his order to arrive. They seen super busy and have lots of take out. So again, this is a good choice if you're looking for an \"economic\" place to eat.  If you do come to this place, try the garlic knots.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "jYOhEsLxWCAjCfx8gUsplw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jYOhEsLxWCAjCfx8gUsplw/o.jpg"
      },
      {
        "img_id": "_LvLSynAOodrPDXN8Ar_WA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Garlic knots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_LvLSynAOodrPDXN8Ar_WA/o.jpg"
      },
      {
        "img_id": "6YDyMRgnd3NgV-o49k2UOQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6YDyMRgnd3NgV-o49k2UOQ/o.jpg"
      }
    ],
    "user_id": "AVLJAYdoeyI81qi8ppkKYA"
  },
  "hwtUVNaBRIj-N6rkLFITTw": {
    "date": "7/21/2019",
    "text": "Pretty good pizza! Ordered online and my order was ready for pick up on time! And it was correct! The white pizza is great--probably one of the better white pizzas I have had recently. It has good flavor. The crust is better than most too. The menu seems really big. Lots of different things to try in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "aMzH2Ev7prWMJ1UMJlndCA"
  },
  "b5a1GkZggiNd76rDMLLmjQ": {
    "date": "10/9/2018",
    "text": "Found this place on YELP and threw a mini family birthday party for my youngest son's 10th birthday. We ordered the Pilgrim, Pellegrini Special, and BBQ chicken with pineapple pizza, 52 chicken wings (Garlic Parmesan, Medium Hot, and Luisiana Dry Rub), garlic fries, garlic knots, some sodas, and dessert (tiramisu, red velvet, and chocolate cake. They all tasted very delicious. We placed the order on the phone prior to getting there so the wait wasn't so long. Our bill wasn't as bad as I thought especially when you check in with YELP and they give you a 20% off your entire bill.  If I could give these guys a 10 star, I would because the staff was so friendly and helpful. The manager or owner went outta his way to run to the store and buy candles for my son without me knowing. The chocolate cake that my son ordered was complimentary and they hit the lights when it was time and sang happy birthday. These guys are amazing and I would recommend this place to anyone. Thank you for making this night so convenient and relaxing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BPMv3mc7uMncbI78bPDpUA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pilgrim pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BPMv3mc7uMncbI78bPDpUA/o.jpg"
      },
      {
        "img_id": "v1qYKJxmNu_zWYKDGuiy9w",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Chocolate cake for my son, the birthday boy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v1qYKJxmNu_zWYKDGuiy9w/o.jpg"
      },
      {
        "img_id": "B6lpb7amH3JrGfxlfxqoTg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Luisiana Dry Rub and Garlic Parmesan chicken wings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B6lpb7amH3JrGfxlfxqoTg/o.jpg"
      }
    ],
    "user_id": "iJf3KnxsC2ao1aVwmYIBhQ"
  },
  "cdIvq0UreARkXS32zO50jg": {
    "date": "6/29/2019",
    "text": "I was not going to even review but since I moved to the area near this place I really, really wanted to experience a fine Italian pizza from a small business. I am the first person to embrace and appreciate a business for their very hard work, because I have myself managed a cafe before.  We ordered a pizza with sausage and mushrooms, wings and chicken tenders. The pizza probably started with a pretty ok thin crust but there was very thick soggy cheese and sauce was hardly noticeable. The sausage was unappealing.  The chicken wings were very dry and chicken tenders were covered in a sauce but the meat was like something left over from another dish.  I want to see this place look at what could have happened.   I would be willing to try again because I want to cherish my neighborhood, but I could have had a$7. frozen pizza and been satisfied.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hd-S4mtrPY9Q6iuBJegnOQ"
  },
  "MX7IqkgfxjmdRFIO5RhhYA": {
    "date": "4/2/2019",
    "text": "I had a HUGE calzone craving and this hidden jem was near me! I was super happy with my service when I came here! The dining area was clean and spacious, our cashier was super pleasant and efficient, and most importantly the food was great! My boyfriend and I got a small calzone each (thinking they were smaller than they were). We were totally blown away by how buttery and garlicy the crust was, how melted the cheese was, and how reasonably priced this spot is! An added bonus is they serve the calzone with a big container for marinara so you'll for sure have enough  The picture I attached doesn't do it the justice it deserves! I absolutely couldn't wait to dig in and I was definitely not disappointed. I'll definitely be going back soon and telling my friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_xFxvqbKSSUdlHGICkwU6w",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_xFxvqbKSSUdlHGICkwU6w/o.jpg"
      }
    ],
    "user_id": "eMp-TRVbbZmgiSx8hVxFIg"
  },
  "v8-Pa72JamAi5AkBlesd8Q": {
    "date": "9/17/2019",
    "text": "Delivery wait was way too long for the price we paid for the food. Probably won't order  from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8igoQo55E2u_vymdNHcQA"
  },
  "QKadS3bko-mybdr_mfaNrA": {
    "date": "8/21/2019",
    "text": "I was kind of skeptical when ordering from this place. Usually low prices to me mean food that isn't that good. Boy was I wrong. The food was delicious the pizza had a lot of flavor the onion rings and fries were cooked well and the wings (from what my coworkers told me) were delicious. I will definitely be ordering from here again also it arrived on time and had no problems with delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u450nDVIBUKgGVp9rZ62mA"
  },
  "9klIGk9M9SmnFkRvXF4SjA": {
    "date": "8/11/2019",
    "text": "My food was early,  hot and DELICIOUS!!! Thank you the nice experience! Twice Excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qsc10X-H52fb-J2KFj8Xmg"
  },
  "aAjYXA8ASRT8vBMAWKt4EA": {
    "date": "8/2/2019",
    "text": "Best pizza spot in town. Love the carry out special. Please hurry up and get the best pick up special",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vC8uKhC1HtwLC9NvEp55tQ"
  },
  "nzLfICw8oPPOMfQvhvAVOg": {
    "date": "11/29/2018",
    "text": "I'm a fan of visiting small businesses occasionally. I work a few blocks from here, and occasionally visit the shopping center. It's usually for a car wash. Now, I can kill 2 birds with one stone.  Today was my local business day. As I checked out the business on Yelp, and seeing how they stand behind their product, I HAD to check them out! The restaurant is tucked away in a shopping center on the South East corner of Rainbow and Westcliff.  After checking out the lunch specials, I can't wait to get through the list! I started off with the 10' Pizza and drink. #1 on the menu. I had enough food for lunch and dinner. I'm a simple man and love a good pepperoni pizza. This was the best I've had in Vegas! It was made hot and fresh. Thank you for the desert! I chose Chocolate Cake! MMMMMMMMMMMMMMMMMMMMMMMMMM!  They are located very close to Fremont Street. If you're staying in Downtown, it's a $7.00 Uber ride. If you're at Mandalay Bay, maybe $20.00 ride.  The service was so good, I wish I could give them 10 Stars! I sat at a table, expecting to walk up when my name was called, I was surprised to have my lunch delivered to my table!  Cleanliness is very important to me. I was amazed at how clean they were.  This is the perfect place to watch sports! There are TV's everywhere.  I'm glad I found Pellegrini Pizza! I'm going to try every lunch special. I'll post pictures!  Don't pay tourist prices. I don't care if you're from California, Chicago, or New York, check them out! Fresh ingredients, awesome taste, great service, and clean restaurant. I highly recommend this business!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dHIfNP79jL2X5ZG2GXzvSQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Great lunch specials",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dHIfNP79jL2X5ZG2GXzvSQ/o.jpg"
      },
      {
        "img_id": "bwKsQLKqMl7AEwKqr7QPPA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Comfortable booths",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bwKsQLKqMl7AEwKqr7QPPA/o.jpg"
      },
      {
        "img_id": "UBOHGimDux2i-VVXO870rg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Plenty of seating",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UBOHGimDux2i-VVXO870rg/o.jpg"
      }
    ],
    "user_id": "VNYmMD-TYQM0qXdrA_Omhg"
  },
  "f4kAPHJn_Qfw0UVYnM_0dg": {
    "date": "6/24/2019",
    "text": "The food was not cooked well. I love to support local places and  I continue to do so. I may give this place a try again but in person to assure it's as it is in the images.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cf5tvNkixb4pI5j-jpDYCA"
  },
  "zfDA6OSJa8x5mdYZ-bwHMg": {
    "date": "7/21/2019",
    "text": "I've been going here for about 4 years and they never disappoint. It's actually my favorite pizza place. Food is always BOMB. The pizza is always hot, the cheese and ingredients are delicious, and even the crust is good and I usually don't eat the crust on pizza! Their hot wings are also really good too as well as their spaghetti. The service is always great. Everyone is so friendly every time I call or dine in. Food is ready pretty fast and is reasonably priced. Way better than Dominos or Pizza Hut!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fS8_Mh_RwJjQXqJqyu_v6Q"
  },
  "r-COFFD4AlF4p-pbzXEx_g": {
    "date": "3/20/2019",
    "text": "Food is awesome  , always delivered hot and fresh.  However,  they need to get their Grubhub tracker fixed, whenever the manager or owner is there it seems to work, when a certain young lady works when you call after it's shows delivered,she says the system is down and has been down for a while  my order just left the store. That's when we get cold food.....the tracker was down again today for lunch delivery BUT we got hot food,  so I figure shift change and the manager/owner is still there. Please fix your tracker cause your food is the BOMB !!!!  .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oq89wrveZYH4iJlTksti2A"
  },
  "K5XqRVRfsgAujga5Fetf6w": {
    "date": "7/17/2019",
    "text": "I've ordered a few times from the spot and this is my first review! Long overdue, this place is awesome! Good pizza great wings! I might have to try a Stromboli next time. Definitely will be ordering from them again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLS-0ATaw2O9BipkbcVwFQ"
  },
  "6sAIz-RJ8oXrIHtlGDWXxw": {
    "date": "2/5/2019",
    "text": "I have been ordering Yelp24 from Pellegrini's for the 5 years since I've livd in Vegas. Never did I think to check in on Yelp. Actually Pellegrini's isn't the only restaurant I've ordered delivery and not checked in for some reason I felt checking in was physical lol . I love their  salads. I've had the dinner salad, Greek salad and the fruit & nut salad. Being almost vegan  I stay away from meat period. But my vegetarian ways get the best of me with Pellegrini's house made daily Ranch dressing. Omg  it's just like fresh real buttermilk southern ranch, like back in the day. The dinner salad is only $4.99 and you get peppers, onions, tomatoes, olives, banana peppers & pepperoncini's. I could eat a salad everyday here, so fresh and so good. I usually eat with my family therefore accommodate for the fact they are omnivores. My granson loves the cheese pizza with pepperoni $7.99. My bad girl reward are the garlic fries  first off the smell of fresh garlic makes my mouth water. You can see all the fresh minced garlic on the fries, but this is where I take a star off. Sooooo oil & greasy, I have literally bit into a fry and grease squirted out tmi?? Lol at the bottom of the fries is a grease puddle ahhhh lawd why ruin a good thang!!! . Any time I have asked for condiments or a special food request they have definitely accommodated me. Ordered delivery tonight for dinner. Can't wait.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "bjFpELasEHWvgEeFodS5mg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Ordered delivery",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bjFpELasEHWvgEeFodS5mg/o.jpg"
      }
    ],
    "user_id": "ryqJ5re09J5u94jDVImCew"
  },
  "dLHc3ge94FYESWEpbB9v_A": {
    "date": "2/10/2017",
    "text": "This is my first time ordering from this pizza place. I was not disappointed. My husband and I ordered the fried chicken dinner and the pilgrim pizza. Chicken was cooked to perfection and the pizza was absolutely the best. Delivery was on time. I will definitely order from Pellegrini Pizza again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K8AOglLDSY47Tm_pKJtv6g"
  },
  "0jljp_NMGPXBNTA2NJtjIQ": {
    "date": "8/28/2016",
    "text": "Woke up from a late nap and was craving pizza...this was one of the few places that was still open and delivered, so I figured I'd try it out. Took advantage of a coupon for a 1-topping pizza, 12 wings and a liter of soda for $20. For this deal, I wasn't really expecting much. I ordered my pizza with mushrooms and pepperoni (only $1 more for extra toppings!) and got spicy honey bbq sauce on my wings. The food took about an hour to get here. That's pretty good, considering I ordered my pizza 45 minutes before they closed! The pizza was pretty good. Nothing to write home about, but definitely worth the money. Crust wasn't burned like most places! The wings were amazing. I'm not a big fan of chicken wings, but those wings tasted like they were from heaven. They gave 2 cups of ranch, which was more than enough. The soda was cold, which was nice. Most places give you a room-temp soda, or barely cold. This place was an amazing deal for the price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iMyNWQ5t97zqrgY97uzMg"
  },
  "W9IFwf1JsvBZJC6tC151yA": {
    "date": "5/30/2016",
    "text": "These guys are a class act! We order from them frequently for great pizza and comfort food. I have a picky 6 year old son and an elderly dad who can be equally picky and there's something for everyone!  I don't eat meat, so my favorite things to order are the Greek salad and \"Corn Addict\". The veggies are always fresh!  Their pizza is delicious and will NOT disappoint. My dad loves their burger and subs. My son gobbles down their spaghetti.  On top of them just having great food, they have super friendly service and the deliveries are always on time.  I recently made an error when placing an order on their website and I called them to explain and even though it wasn't THEIR mistake they happily sent out a new delivery with the correct items. Seriously saved Memorial Day lunch for our family!!  I will continue to order from this place and remain a loyal customer. I highly recommend them to everyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "H1g0Ij2cBqSdC-AK1yZhbA"
  },
  "MYwtJd5m5pmbCXgiX-C-7w": {
    "date": "11/9/2015",
    "text": "The food is tasty and the service has always been nice. Downside is delivery is always at least an hour and food is always cold. 5/6 of my orders have been delivery. But I still keep ordering, so it's a testament to their tastiness. Just pick up if you can. Website says no delivery fee, but I always get charged $3.50. Never ordered anything I didn't want to eat lots of!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uuQbvvR7pDlMn11KdYXwmA"
  },
  "R1GzaYCYjwru0JnOy-PXDg": {
    "date": "2/8/2015",
    "text": "I had a restaurant gift certificate and they didn't honor the certificate. I was very disappointed as we ordered the food and had to cancel the order.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W9Ba8HqDeNYkvIvnipUIeA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Certificate that they denied.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W9Ba8HqDeNYkvIvnipUIeA/o.jpg"
      }
    ],
    "user_id": "dchFjMVPQ29vDsnKWNX8NA"
  },
  "uSS-KR1IBnp_2qlmvsjHAA": {
    "date": "1/21/2017",
    "text": "Late night delivery to the Rio.. Pizza was great, wings were great and very friendly driver. Reasonable price. Can't ask for a better way to eat a chill meal in the room after my daughters 3 softball games.. THANKS!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "56QHpcIpUhJ5njkVGN9pXw"
  },
  "UR0GRgji1qryPav9eV_5vA": {
    "date": "1/14/2015",
    "text": "We ordered delivery it was delicious! Came early and still hot  steak salad was really delicious and we ordered quesadillas for the kids and they loved them",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "W290xCC1HZdXT14GYXmB2Q",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Steak salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W290xCC1HZdXT14GYXmB2Q/o.jpg"
      }
    ],
    "user_id": "ZWUxELfv4kfE9dIU6wNiHA"
  },
  "9GuqSsSN-Tv1cV5GF5p9TQ": {
    "date": "11/30/2016",
    "text": "REALLY Digging on the menu choices.  The Hot Chick Parm Sand And the Hot Meatball Subs are SALIVACIOUS!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I1VzesWeAa0ANOnYeDZkPg"
  },
  "KuSTaoEodLw7KpZtj1KUIA": {
    "date": "8/6/2016",
    "text": "Tastes like frozen pizza dough. They are something else to be charging this much for pizza. I could of paid a few bucks more and had fresh ingredients from a real Italian place. Disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSFvE013RL8Nt57YmRgFQA"
  },
  "S9D-BL0sxRLlPqXnZTKDHA": {
    "date": "6/5/2015",
    "text": "What can I say? It was decent, better than some other pizza that I had, not as good as some of the others that I have had. Honestly, after tonight I will probably never remember that I got food delivered from here.  I would have given them three stars if it were not for a few things. They delivered, they delivered ahead of schedule, they have anchovies, and holy crapballs when you order their wings, they must give you like enough to feed a small village in the steppes of Mongolia. I think I counted 25.  The food is not exceptional, a lot of it (especially wings), but kind of forgettable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HgbQqUyMAp_Q7I-ZlkyfWw"
  },
  "jCm_3vrBZDOpgMtstxeRYQ": {
    "date": "12/16/2014",
    "text": "The food angels at Pellegrini made my experience heavenly! First of all, I placed an order for delivery from a completely different state to be delivered to a friend in Las Vegas.   If there food is anything like their customer experience, then it's amazing. I will revisit this review once my friend tells me about her experience, but shout out to Edward who was SO patient with my order and gracious in helping me surprise a friend with dinner.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "t0f_3BgagS9T1UrNG_Qhqg"
  },
  "hdFDJ4QL4MRvXLWU0DZ3Sg": {
    "date": "5/10/2015",
    "text": "The pizza was great for Las Vegas. I'm from NY so I don't expect much trying new places here on the west coast. My two year old son is super picky about pizza and he killed two slices. The price was affordable and we waited maybe 20 minutes.   And for everyone writing extremely detailed reviews saying stuff like \"the sauce wasn't spread evenly\". It's a goddamn pizza... Are you seriously expecting a 5 star dining experience? Handmade pizza usually isn't the same as a frozen pizza at the grocery store.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-afiw22M_9o4jP6WeA92w"
  },
  "42b73KfCdpliQl691JkZ7Q": {
    "date": "5/19/2016",
    "text": "My friend and I were craving pizza so Yelp gave us this very awesome location. We walked in around 9 o'clock, looked at the menu for a long 5 minutes and ordered the Buffalo corn, chicken wings and the special of a one topping large pizza for $7.99 but I was able to make it a half and half for a little bit extra. Pepperoni and supreme. All they had was soda and water so we walked to Chevron across the way to get something to drink while the food was being made. The wait was not long, they had TVs and a couple tables to relax while you wait. The wait was not long at all and I could not wait to taste the pizza. The pizza stayed hot until we got home and we both agreed that it was the most beautiful most amazing smelling Pizza that we have sniffed in a very long time. The pepperoni was rich and  the cheese was stringy and supreme had a very generous amount of toppings as well. It was the most yummiest pizza I've had in a long time. Definitely better than Domino's. I definitely will be back to enjoy their sales and a large variety of food.  Do I recommend this business ?   Yes the pizza looks smells and tastes amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RSwe_5BVM5bnjQMrdSb_fg"
  },
  "_FXYBDYU_X7KxQOvE6-JSA": {
    "date": "2/22/2015",
    "text": "I don't understand how a place with zero customer service skills can have this many stars.  If I could give negative, I would. The food I received was horrible and the manager accusing me of lying about the quality of his disgusting dishes was the cherry on top of the soggy sampler and dried up pile of noodles I had the displeasure of tasting. The chicken on the fettuccine Alfredo (which by the way was covered in dried up sauce when I got it) had zero flavor and looked like it came out of a freezer bag from Walmart. And who doesn't like a bunch of limp onion rings and cheese sticks. Definitely will not be eating here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "74-7fz9lN_JytWqCUQFfpA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Dried up noodles with hardened Alfredo sauce. Yum.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/74-7fz9lN_JytWqCUQFfpA/o.jpg"
      }
    ],
    "user_id": "txzkpJLUgTvhAqxd35tKzg"
  },
  "acDKqZlgqKAKT44RopG50Q": {
    "date": "11/16/2014",
    "text": "First time ordering from here tonight...not bad!   Prices were reasonable and it was delivered quicker than promised.   We got boneless bbq wings with fries, garlic knots, and potato skins...all really good. Had the funnel fries as well. A little disappointed with those (chewy) but everything else made up for it! Will definitely be ordering from them again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "sxxL6TjvDolUE7GeWBRZrg"
  },
  "YDOifLRAm9lrIxBUNMUDAQ": {
    "date": "1/29/2015",
    "text": "HOLY SHAMWOW!  We ordered 2 large pizzas from here and they were GIGANTIC!~ Seriously! We had 10 of us, and leftovers for DAYS!!!!  The pizzas were really good. Nice thin crust, order came on time and arrived hot. Maybe one large next time! And there will be a next time!!  We ordered the Margarita and BBQ Chicken. Both were great.   Tried to order delivery while at work to feed the peeps, but alas, I was a bit to far away. So they do not deliver city wide.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "y5rqDe6uO06WKZ26-Pla8g"
  },
  "k8aPeqNtzo-qEnzH6CbPOA": {
    "date": "2/12/2016",
    "text": "#notedible#doubleyuk!yuk!#neveragain",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1UxsY29M-zcmOvPag8Cfw"
  },
  "rsuvZofyKkO-W9yktpZooA": {
    "date": "7/30/2015",
    "text": "Came across this place Sunday night when I was craving pizza but everything was about to close since it was already after 9pm. And luckily this place also delivered!!! After looking at the pictures I caved and called. We ordered the sampler appetizers, and the 17in pelligrini pizza with extra cheese. And if you spent $25 or more and mentioned yelp you got a free dinner salad. The food was good out appetizers were a little burnt but that big of a deal and I didn't feel like we got extra cheese. The dinner salad was super fresh and actually ended being my favorite thing! So happy we came across this place on yelp and we will definitely be ordering from here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MQQuUZ-KqrqANPaP8HxNhA",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Sampler app. Fried mushroom, zucchini, mozzarella sticks, onion rings, and jalapeño poppers.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MQQuUZ-KqrqANPaP8HxNhA/o.jpg"
      },
      {
        "img_id": "WIDwiwyTNMRrOK4eJ6mC1g",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Pelligrini pizza. Artichokes, mushrooms, sausages, and basil",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WIDwiwyTNMRrOK4eJ6mC1g/o.jpg"
      }
    ],
    "user_id": "SNBX_-OaklunfC-4IwfyOQ"
  },
  "zRpUVbWhUut4rK-_Y0_8QQ": {
    "date": "2/3/2017",
    "text": "I order from here all the time and figured it was time to review. Their pizza is amazing, the Greek is my favorite. The pizza crust is the best I've ever had, seriously, the best part of the pizza. My family loves the garlic knots and chicken fingers, especially with so many choices for sauce. The zeppolis are our favorite dessert. I'd never had them before, but they have ruined donuts for me! The staff are awesome and very friendly. I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQL2r9xrJS4sx2QcDKYGFg"
  },
  "oAOygwNtL4vR_vXlAcj-gA": {
    "date": "2/3/2016",
    "text": "First time ordering HORRIBLE impression!  Called in at 10:30 am and received my order at 11:45. For this place to have such high ratings is beyond me. When my food arrived I was ready to eat and it looked really good. Well the taste of the calzone I ordered was ok , I would say normal not great and nothing special. I just think they are not worth the wait of over an hour. I would not order from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hkrz6n31WKM7nl8KwNGSew",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Calzone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hkrz6n31WKM7nl8KwNGSew/o.jpg"
      }
    ],
    "user_id": "AXEUk3Be2ch9nzQACvpdqw"
  },
  "--ec7YnYDFsnHYFQdanygQ": {
    "date": "2/4/2015",
    "text": "Tried the philly was kind of dry and thin on meat. Otherwise people were friendly and sevice was OK",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjvXCIno4mr_olB_LfbJxw"
  },
  "h-iXBSY2Y8c2ls8lbqtUNA": {
    "date": "9/9/2013",
    "text": "Oh my god... I use the eat24 app and I have an unhealthy addiction to fried zucchini and garlic balls and all the other places I ordered from SUCKED!! Not only was the food on time (early actually) it was warm, fresh, and DELICIOUS!! This is my new and only go to on my lazy days, thanks  pellegrini!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rC1vacLHxNGO9eerbgL1Uw"
  },
  "9iD0MBwdSPQ4E_QbqAsRPA": {
    "date": "7/26/2013",
    "text": "We are new to the Las Vegas area and have been trying to find an authentic pizza place. We have found it here at pellegrini. Only 28 dollars for a 24 inch pizza and 20 wings what a great deal. Will definitely order from here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tMdBuapTK3hA8sEtSd6Ywg"
  },
  "Em9XIrneg0kvSHrITzscRg": {
    "date": "8/30/2013",
    "text": "This is the best Double Pepperoni pizza I have ever tastes in Vegas.  It's kind of greasy but that is a plus. The sauce and cheese have excellent flavor.   The other food is so so but still get 5 stars because of the great pizza",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SkUjCvDBA2VNnJWj8DNcdg"
  },
  "3ovgrb1A6N2ZDJKluwPufQ": {
    "date": "8/4/2014",
    "text": "Surprisingly good. Accurate with their delivery orders, on par with their pizza pricing, and the food itself isn't bad at all. The only thing I'd have to comment negatively on is the price, it's a bit high for sides. Having 5 dollars for breaded mushrooms and most sides is a lot given the relatively small amounts. Still the flavor is there, so if you're just looking for a pizza go here. I personally recommend the Bianco pizza, or their coupon for two 16 oz pizzas, quite a money saver. I think the delivery cost shouldn't have been raised like it was, but I suppose that it is the summer months",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UZ4sHcl15xfWbrPb8aAt3g"
  },
  "A0ICl_7fSNq9sbrp8KYvlA": {
    "date": "12/27/2013",
    "text": "Pizza is not bad for the price if you get the $7.99 pickup special. More cheesy than saucy, so how much you like the pizza probably depends on your preference. I've had better in Vegas, but it's decent.   I wouldn't eat the garlic knots. I'm from New York, and I've never had \"garlic knots\" like this before. Don't really know how to characterize them. Maybe bread bites with some sprinkled cheese on top? And the cheese wasn't even melted. They provide marinara sauce, but honestly was just a strange menu item that I believe was $5 or $6.   Overall decent food but not great. Seems more like a pickup/delivery place as there is not much seating inside.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4k1PakjO04IDHBOr7TLTRw"
  },
  "RB7dhLeN0jVHv917Rg-rqw": {
    "date": "5/21/2015",
    "text": "The food is good don't get me wrong but the delivery kills me because it takes so long, I would give them a better rating but delivery takes about hour an a half to 2 hours if not more and by that time the food is cold. Also they do need to work on how they take orders and write them down correctly as well as making it correctly",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qydlrCfHPaOII83LG8JlgQ"
  },
  "fQwSz8FjVGwDL7LsCkmKdw": {
    "date": "6/26/2015",
    "text": "I don't have words for how bad my experience was here. I waited over two hours to get the delivery of my, \"gyro,\" because they had run out of pitas. No one told me I'd be waiting the two hours, however. The meat on the,\"gyro,\" was unlike any gyro meat I've ever encountered. Just 4 thick strips of mystery meat plopped on a microwaved pita. Then the tzatziki was just an overwhelming amount of dill in sour cream. I'm so angry I'm out almost $20 for this thing I wouldn't feed any animal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dNtc8IcII9plv5mveNgD8w"
  },
  "myFp1J5Z9TL1aa7FgkhemA": {
    "date": "4/9/2014",
    "text": "Saw this place online and had some good reviews so we decided to try it out. There menu online needs to be updated. It says that they have kid meals but they do not. If your looking for the normal specials your find at pizza hut or papa johns this place doesn't have it. They do have good specials for large groups though. I ordered a small pizza for the kids 2 med and some Parmesan bread sticks. The pizza itself wasn't that bad, but there wasn't anything that stood out that would make you say wow this is some GOOD pizza.  I recommend this place if your having a group event, but on a day you just don't want to cook and your on a budget this place may not be for you!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fW1PRRziMg6cf2nrJtaawA"
  },
  "QNdhVIEEhZmOEYDnmV_42A": {
    "date": "12/16/2015",
    "text": "We just moved to the area and got a menu in our mail. We ordered because they delivered,and Omg I'm impressed!!! We ordered the 20 chicken fingers w fries and bread sticks for $30. They were here when they said they would be,and the food was Amazing!! All white meat chicken,no fat or hard edges. Not greasy at all!! We ordered the spicy honey bbq on the side and it was sooo good!! I cant say enough good things about this place!!! Will def be my go to for delivery!!!.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4obGHUFH8FPhskaCP4Swvg"
  },
  "_VvuHvGfiOy9mwDJNC-Scw": {
    "date": "7/13/2013",
    "text": "My wife (Max A.)tried this place earlier this week and raved about the chicken parm sandwich. Me being curious decided to give it a try. I have to say that I agree with her 100%. The sandwich was very tasty. The meat was very juicy and the bread was delicious. I look forward to having another sandwich as well as trying other items on their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OrQ7aKEGVKKx_RT7TS7fFg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Chicken Parm Sandwich. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OrQ7aKEGVKKx_RT7TS7fFg/o.jpg"
      }
    ],
    "user_id": "ttDT3NFJdDXgcXulENTnMA"
  },
  "Ho-KMQIPksan9PAVP_fBSg": {
    "date": "3/29/2014",
    "text": "I had a \"Boss Hog\" sandwich and my wife had veal Parmesan. Both were good though my wife said the sauce was a bit salty. Onion rings were OK, though a little under cooked. I'll give it another go soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YPzq48DBsWgffDuY79cSLw"
  },
  "cjtYAM2f0TW9ESH9ggEYew": {
    "date": "6/9/2014",
    "text": "Everything was fresh and tasty and the dipping sauce for the wings was 5 stars alone. Delivery was also fast. My new fav. pizza place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E90-S8MEVGC1dTSR08CB5w"
  },
  "-zO7Ls-zTB8_fMC3sxXw1w": {
    "date": "10/23/2015",
    "text": "Eat 24 messed up on the order and there was a glitch. So my pizza wasn't done when I came to pick it up. The guy at the front was super nice gave me a $5 discount. Haven't tried the pizza yet but great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p6PrlhtE6GU_zm3l-_D67Q"
  },
  "wDbiD4mcHWSU_hlTxcW0Ig": {
    "date": "1/26/2016",
    "text": "Ordered delivery from here on eat24. Got the bacon cheeseburger with curly fries as well as cheesecake.  In fact, the main reason I picked this place is because they had cheesecake and it wasn't ridiculously overpriced like the last place. Anyway, got the burger cuz I figured it's pretty hard to screw something like that up (1st time I eat at a place I always go for the can't possibly screw it up option). Now I didn't have the highest expectations, but boy was I surprised. The order arrived EXACTLY when it was scheduled, the delivery guy was super nice and actually apologized for taking too long. Haha. Then I open the food up, and there is this fantastic burger, huge portion of fries, done exactly as I ordered, still hot AND had the thickest most delicious bacon piled on the sucker. I mean, I have never seen bacon that thick on a burger from a delivery place. Or any place for that matter. It was epic bacon. BACON! Now the cheesecake,  larger slice than the other places and NOT prepackaged and frozen and still in the wrapper like the bogus place I won't name here. I'm actually no expert on cheesecake,  I just started liking them recently so I have no idea if what I'm eating is the best cheesecake ever but it sure tastes like it. Thick graham crust, creamy and tasty and delicious. I was so impressed that I actually took the time to download yelps app just to write this review.  Btw yelp feel free to not make people download an app to leave a review..the mobile site will not allow it without the app and so that sucked. In fact I wanted to use the eat24 app to review but no function in that app so I had to suck it up and jump through hoops just to tell people that Pellegrinis is awesome and I loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_0EtGiFFdeM3h56bOh2Hw"
  },
  "V5vLtw9LFDdy5jEHwyYByA": {
    "date": "12/8/2015",
    "text": "Food tasted OK but there was so much MSG in the food that everyone fell asleep 5 minutes after eating",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hmc_WzMC0OlxTWs_HGeSbA"
  },
  "wp-j9pFXiMepFtVLqxmRfw": {
    "date": "7/19/2015",
    "text": "Quality food. Even better service and delivery. Anna, a cashier, and the rest of the crew have always been help and quick to resolve any issues. I highly recommend!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZCiSbXQ27IG81_JzTdOwTw"
  },
  "J2W4zlkKETgSKMjnKAlGsg": {
    "date": "6/18/2015",
    "text": "The pilgrim pizza is good....very good. I just ordered a half and half pizza with garlic fries and I will let you know how it tastes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XwyylDM72iM6NSa6j3HbOQ"
  },
  "KJZRQu0UZIRYAKAaTPQa4Q": {
    "date": "8/28/2014",
    "text": "Very disappointed...has been good in the past, however delivery took over an hour and a half , was luke warm when it did arrive and the order was incorrect...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QRw4umcS_UHMF-l2HgPyEA"
  },
  "WdYOfHUvREPBVMaULNprfA": {
    "date": "10/23/2014",
    "text": "We ordered a Calzone and the Chicken Piccata for delivery.   Delivery was on time (75 minutes estimated, but hey, you can't cook a calzone and pasta in 5 minutes), so that was fine.   the Large Calzone was HUGE, and my husband enjoyed it.   However, the Chicken Piccata was horrible.   The menu said Spaghetti in a Lemon Sauce with Capers and Chicken.    What they failed to mention is that they also add sliced greek olives and Artichokes....both of which I like, but good gosh....all three of those things have a very strong flavor, and along with the too lemony sauce, it was simply not edible.   Even the chicken had a funky taste, although my dog seemed to enjoyed it and would have given a higher rating than I.    I ended up rinsing half the spaghetti, removing all the crap, remixed it and used the packet of parmesan that came with the Calzone to create something that sounds awful, but was much more edible than the way it arrived.  Even the garlic bread had a funny taste and was chewy.   I would love for them to respond and tell me if they actually taste the stuff they serve, because that dish needs some serious work.  First time trying the place, and I doubt we will try it again unless we only want a Calzone.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZXsfuTmIYgBNukGfFRJ6Q"
  },
  "v73rOurhPoB7DORCRENZaQ": {
    "date": "9/6/2018",
    "text": "I love this place , my little boy tried his 1st pizza at Pellegrini, and liked so much , always the best in town ... thank you guys , you are making the best pizza and I loved your ranch ...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4W8d-b2t89bc8g-kecwP8A"
  },
  "u8V4jQeL3GprU2XhZwZ6eA": {
    "date": "5/8/2017",
    "text": "Definitely one of our top favorite pizza spots. Always fresh pizza ($7.99) 1 topping carryout and their chicken tenders are real...homemade quality tenders comparable to PDQ. With them being a $1 a piece on Sunday's and Mondays it's an easy choice. Full and happy, once again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OlB38bJOPdyJBQBpm3_5eg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. A slice of the pick up special with dollar fingers (kinda small, buut fresh and quality chicken) and really great fries n ranch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OlB38bJOPdyJBQBpm3_5eg/o.jpg"
      },
      {
        "img_id": "IgvgkyginaV8VeL0mOKuYg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Yum, one topping large 16 inch pick up special $7.99",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IgvgkyginaV8VeL0mOKuYg/o.jpg"
      }
    ],
    "user_id": "zIcmvnCvZLTncC8owCM5CQ"
  },
  "2niZ7zzPWgb4GVxQCyMHyQ": {
    "date": "1/13/2018",
    "text": "Excellent food!! Great service and fast !! From Pizza to Sandwiches and Wings!!! Pizza cheese is no Game in a Hut...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSvpkLNqoY0EdRN6mK-RYQ"
  },
  "z0z6VbRCjbDgyrSJvO_JBA": {
    "date": "3/4/2018",
    "text": "The food would have been great had it not been so greasy I've ordered from here before and it was good but this time everything was super greasy even my baked ziti",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Li6FzHzN6nOsAgs276c-A"
  },
  "5CMJzMGeSZQ58gQsYcnqvg": {
    "date": "8/25/2018",
    "text": "This place is awesome!  Good pizza, the Boston Famous sub is ridiculous!  I was surprised that they had such good prosciutto, too. My go-to place for delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EuHn94fjTYfRSzZ6YU3dg"
  },
  "XeaNG_I66OfkTTdEQMowww": {
    "date": "7/27/2017",
    "text": "UPDATE 7.27.17 Had a nice call from a gentleman who works there. I took his offer and gave them a second chance we ordered the ravioli and a medium size pizza with a dinner salad! It came hot! It came correct! No complaints! The pizza is actually the best I have had out here, the first time we ordered we only had pasta!! I thank you for reaching out to me! I understand no one is perfect! Thank you again!   First of all who in the hell still cooks with imitation crab?! Don't order the seafood linguine! Also asked for white sauce got no sauce, delivery took so long the chicken Alfredo was no longer saucy, ordered two salads got one! Aaaaaaaand I won't ever order again charge me 17$ for fake crab mini super mini clams and some boiled shrimp with herbed noodles lol..... ranch was tasty tho!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g42GWZfYsq8u-XAGDVoEQA"
  },
  "mYoREjXBfokXA_EU5Yo1GQ": {
    "date": "3/11/2017",
    "text": "Best pizza in Vegas! Been here three times and it's always been very very good. Chicken wings are perfect. Good fries. Good tasting home made ranch.  What else can u ask for??",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftttLxXB10LtHJ7v0j2hDA"
  },
  "5LJrKEjcJkRXyHzjcChPsQ": {
    "date": "11/19/2016",
    "text": "This is a decent take out only pizza place.  The pizza was New York style, and it was not bad for take out. The crust was crunchy, not too thin or soggy. They have no restrooms available if you go to pick up your pie. Apparently they have been \"fined\" for letting customers use theirs. Otherwise was decent service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObQl16Vuc4sHPGKtzSGNUw"
  },
  "TknBVwqqUFswKOh8IQUiWA": {
    "date": "1/22/2018",
    "text": "Use to love this place but the quality has just really diminished. Pizza is salty now and the crust now tastes so cardboardish.  Might as well get Lil Ceasars. Gave 3 stars cause the ladies that wrk there are cool!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3AYR5tgCIqxGWaqD8STb3A"
  },
  "X6lUWBMSAXPypxla2BdwEg": {
    "date": "7/20/2018",
    "text": "Pizza is awesome! I went on a super busy night. A group of 20 soccer players and parents came in unexpectedly. Staff was friendly, food came out quicker than I anticipated, considering they were slammed in the restaurant, plus their normal Friday night rush. Thanks for great food and great customer service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Doq-Q36ArKYhyidbE074AQ"
  },
  "ayIYGKJpUPbT99Eh1tFh4g": {
    "date": "12/16/2017",
    "text": "This is one of the best places for pizza. Nice crispy crust and plenty of toppings. Will definitely recommend to my friends. Staff is friendly and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kL7C3ckZBWrMpFc_EiEc1g"
  },
  "yR9SuNpYEhrorCUomskYPA": {
    "date": "2/5/2018",
    "text": "Food was delicious and even my resident food critic had no complaints. Serving sizes were good and still have leftovers. I ordered 2 sandwiches and a salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJKkbxUpaLG5U4Iukm0a7w"
  },
  "jvhyxTk_pYEHDM4B63l1ug": {
    "date": "12/31/2017",
    "text": "The food is very good and affordable. The Chicken Fingers and Fries , very yummy. I tasted way better pizza but their pizza is delicious, I just wish the dough they use to make the pizza crust was better. Still good pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQb3cL26qaDgaXEQQTIUNQ"
  },
  "xzbKnT0bC01az2CofMXyxQ": {
    "date": "5/22/2017",
    "text": "Delicious today I ordered the pick up special and a house salad while waiting for my car to get washed.The pizza was so good.Not greasy and authentic flavors.Will be back soon Thank you !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RHPVcQpdg3FbHCOzgzlCfQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RHPVcQpdg3FbHCOzgzlCfQ/o.jpg"
      }
    ],
    "user_id": "vlR6euEG2qGhk6qU5B2hgw"
  },
  "hSzS-g_j6jDQf4Ec4EsItA": {
    "date": "9/3/2017",
    "text": "I ordered food for the office and although the food was good the order was messed up.  They did make the drink order right though.  When placing my order I told them twice it was the office yet they still called and asked what apartment.  The price was way to high so I don't think I'll be ordering from them again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EoHdx-byYkY0X3low3-Rgg"
  },
  "DQqqYrwx8bWiXCgXv-MXhw": {
    "date": "10/21/2017",
    "text": "The delivery was a half an hour early, the food is beautiful and tasty. I highly recommend the burger and fries!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wluebdU7Z-JirTrpp_7QoQ"
  },
  "hQQgJXJk25I8bACTK8adVQ": {
    "date": "12/16/2017",
    "text": "The best pizza I've ever had in my life. I used to work in a pizzeria myself and you cant beat that! Good job guys! Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uDkEw6xq5FqtGRLakCM8cA"
  },
  "-EjDcmd_HOUGtv-wh7wSvg": {
    "date": "3/2/2017",
    "text": "I probably won't be back.. It all looked better than is tasted... perhaps I'm a bit picky when it comes to pizza and certainly meatballs... pretty sure they were frozen meatballs, and just gross meat! I choked down one meatball... I had to throw out the rest. I ordered a prosciutto pizza with basil, cherry tomatoes and buffalo mozzarella... sauce was not bad and the dough just ok.  I wish there would have been more tomatoes.  Honestly not much better than a gourmet frozen pizza... which would have been less then half the price.  Just wasted $30. Wha wha whaaaa",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U__UiPMRTDam3iywoH_9Hg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Prosciutto, fresh basil, buffalo mozzarella, and I added some onion",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U__UiPMRTDam3iywoH_9Hg/o.jpg"
      }
    ],
    "user_id": "-C7dUrRVniKxQxH3a0mzgQ"
  },
  "B7x_Ez5vzjumdN9-YIhhbw": {
    "date": "10/15/2017",
    "text": "To be honest, the pizza was just ok. I ordered the Pilgrim and it was a basic pie that did not really stand out. Not really cheesy and almost no sauce. The Antipasto salad was good and the delivery was on time. I have just moved to the area, and may try them again to see if that was just a bad order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-3XmaZtkviptmrMhmgZwTw"
  },
  "p6eutvvz2UA5i2eXrFUUVQ": {
    "date": "1/28/2015",
    "text": "This place has sent flyers to my house several times over the years, but I was skeptical about ordering because Verrazano Pizza is right across the street where my family and I have been eating really good pizza for years. With both places so close to each other, I just seemed to choose Verrazano Pizza knowing I'd enjoy it. Well, I decided to order this time from Pellegrini Pizza and give them a try. Priced at $7.99 I ordered their \"pick-up special\" which is a 16\" 1 topping pizza. When I picked up the pizza, the guy who helped me was nice and showed me the pizza to make sure the order was correct. After getting home and tried the pizza, I was pleased. There was a fair amount of cheese and pepperoni and the price was for the pizza was fair, too.  I noticed on the flyer they have different lunch specials from 10 am - 3 pm and range from $5.99 - $8.99 in price. One lunch special that I noticed was a 10\" 1 topping pizza with a soda for $5.99 which is a great deal. I'll be back to try that out at some point. They have online ordering and offer delivery.",
    "rating": 4,
    "rated": {
      "funny": 32,
      "useful": 50,
      "cool": 42
    },
    "photos": [
      {
        "img_id": "asFfRIZxZ2Njai4eCe2VDw",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. &amp;#34;Pepperoni Pizza&amp;#34; @ Pellegrini Pizza - 1/21/15",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/asFfRIZxZ2Njai4eCe2VDw/o.jpg"
      }
    ],
    "user_id": "Fv0e9RIV9jw5TX3ctA1WbA"
  },
  "1KkN8j0IDuppKeqbn24J2Q": {
    "date": "5/16/2018",
    "text": "This place is really good I haven't been here in years they expanded and I can see why theee quality is still really good at decent prices...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FgATapLn_0vUktwTMCa1g"
  },
  "crEpcBUSsOAUfrmX4MeSpA": {
    "date": "11/13/2017",
    "text": "The last few times I've ordered I've asked for 1/2-1/2 pizza. It was never a problem before but now seems to be.  Originally it was ok I just paid for the highest priced side but now it's an argument every time where I have to inform the employees of the policy. It's frustrating to say the least. I order here because we enjoy this food but the employees are making it harder and harder to come back.  Not sure what's going on...  I asked to speak to a manager and the girl on the phone said there wasn't one.   Please address issues with the employees. If I'm wrong please inform me of why. Also pics on yelp show 1/2-1/2 pizzas so it's not just me requesting something out of the ordinary  11/29/2017  Still love the food...  well this was before I tasted the food tonight!  Are you making and freezing the pizza dough?  This place has been decent until now. I will not return for their food. They had great flavor and within the last month or so it's gone completely downhill. Cardboard at this point would be a more appropriate crust.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IsL7pFakPBtLAH0atyxoyg",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IsL7pFakPBtLAH0atyxoyg/o.jpg"
      },
      {
        "img_id": "iGa-LiIvZs8NjcR9bxOa-A",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iGa-LiIvZs8NjcR9bxOa-A/o.jpg"
      }
    ],
    "user_id": "e0v4eYy3R6jPRWio3F6gxQ"
  },
  "cFJjG9V-Y--LUucOHfo6Kw": {
    "date": "6/5/2018",
    "text": "Food best in vegas. Beats Amore for sure. Glad its so close. The Goodfella is the best",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NLIVImHCJYfZFN_HDvPU9w"
  },
  "mOvKLdCOvKhxGFjK2qKd2Q": {
    "date": "12/16/2016",
    "text": "I HAD to update my review of Pellegrini's Pizza. Arthur and his entire staff are just absolutely amazing! After my last review, Arthur immediately reached out to me to apologize for my bad experience and offered me to come back in and have a pizza on the house so that he could fix the issues I had with my last visit. Arthur is super kind and his staff is incredibly polite and they treated me like royalty when I came in there! I learned that Pellegrini's does have onions on their menu but the eat 24 app did not list them so it WAS just an innocent error.  I ordered the Bianco pizza with pepperoni, onions and half sausage and I must say that this pizza was absolutely incredible!  The crust was perfectly crunchy and the entire Pizza had the look of a gourmet Pizzeria. Arthur came out and showed me that they use one of the top rated Ricotta's available and I must say that it was absolutely delicious this time around. I will definitely be a return patron from this point on and I do believe that this pizza place will now be my go-to pizza spot instead of my previous pizza spot.   It's clear to me now that my first experience at Pellegrini's was a one-off experience and is not typical of this pizza place. From the owner to the staff to the pizza itself, I was very, very impressed and would recommend this spot to all my friends and anyone looking for great pizza, a polite staff and awesome value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JJ2QGroe476tZy8HH8dAgQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JJ2QGroe476tZy8HH8dAgQ/o.jpg"
      }
    ],
    "user_id": "vVDgxp44O9I0q5IsTIe_cw"
  },
  "qZ3a3BW2W306xNlmkY3rlw": {
    "date": "10/7/2018",
    "text": "Normally their Pizza is delicious but I made the mistake of ordering a potato with fixings and was so disappointed.  They also sent me chili cheese fries which was even more dissapointing, is that possible????? Than the ordered chefs salad. Although I had the kindest delivery person.  When I called the restaurant the manager said to call GRUBHUB we deliver through them. I thought GRUBHUB didn't cook the food. From now on only pizza  if I order again.  I paid 32.00 for the biggest mistake of my culinary life.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nWdF78Q9Wl3sDHnpz30qWw"
  },
  "pqFh8WFPFQD0g6OXKXLbJw": {
    "date": "9/17/2014",
    "text": "Solid pizza and wing takeout. We get ads for this place at our property fairly often but with so many pizza deliveries in the area it took a while to give this one a try- large pizza with pepperoni, olive, and artichoke was fairly priced and enormous. Two pieces is definitely the max for me, one is enough for lunch.  Wings stand out more than the pizza, with a few different flavors: honey bbq and garlic parm so far are faves. Wings aren't too meaty or too scrawny but good value for the price and packed with flavor.  Not a place I'll put on speed dial or anything, but a place I'll consider when a pizza craving hits. Way too many options on this side of town for pizza to have too much loyalty to any one place.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "bLbSNkLggFnqwNNzzq-Ijw"
  },
  "Ao6LkDRP88G13Gi9RfZ-qA": {
    "date": "4/6/2018",
    "text": "Normally I dig this place. Today was a fail. I ordered a chicken Caesar salad; and got to my post-gym destination across town only to find out they forgot to pack dressing with my salad. I had lettuce, croutons, cheese, pretty dry chicken, and no dressing. Just be sure to double check your bags before heading out so you don't have to end up throwing away an uneatable salad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G3lvnW3R3hP2_SQxEMwERQ"
  },
  "ZG74fOpEyYmUVK8xm1dzjg": {
    "date": "6/13/2018",
    "text": "Love the pizza, lady at the cash register was so sweet i love this place and will definitely be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gjCk-hTZs_aToGN0wvmuow"
  },
  "7S1iweAJNxpM8lgVj5rh5w": {
    "date": "4/19/2018",
    "text": "We stayed in Vegas again here recently. And ordered from here again. Still amazing. Large portions and low prices. The pizza is so good. Service is quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "piogkli6u0YNo2PJSAaJzA"
  },
  "LJ6c2vn4wYrEF50UQNEPBQ": {
    "date": "5/17/2018",
    "text": "Man this pizza place is great I normally wouldn't eat pepperoni but I can have slices of pepperoni from here all day with the bacon on it sausages everything everything here is good I just got a pizza from here last night and they stay open till 3 in the morning can't beat it I hope to be coming here for many many years great customer service friendly atmosphere oh yeah is good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlM9pr9QMdsdghwFlqd2uw"
  },
  "5TV27h-Cjg1dMgENe6IO9w": {
    "date": "3/26/2018",
    "text": "The best pizza we have had in Vegas we order the Hawaiian with jalapenos!! I also recommend the chicken wings there ranch dressing is really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6OF4zzvYBLENtJ2tm0Ufw"
  },
  "k_Ai8Odl7C4zAEDcjcBcfg": {
    "date": "5/9/2018",
    "text": "I live in Peccole Ranch and received a flyer in the mail. I was skeptical because of the distance/location of this place and delivery time,( lukewarm soggy pizza) and tired of trying to find new quality places. This place is awesome! Delivered in half the time promised! Thin crust pizza was hot and even the breaded shrimp I ordered to up the ticket price was still hot and crispy! I'm a pizza snob (no dominos or papa johns) originally from the Chicago area and it's difficult to find good pizza delivery places here. I give them a big  Only thing I didn't care for was thin sliced sausage. Personal preference, I prefer broken up chunks of sweet fennel sausage (snob ha ha)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIgwRvA4E1nFiQAi1-7tvA"
  },
  "nyqJd8izGz7y2-xTj7NBSg": {
    "date": "3/19/2018",
    "text": "This is my first time here, I had mozzarella sticks & a personal marghuerita pizza..Let me tell you, Pellegrini Pizza proves why you would much rather and why you should always go to a family-owned shop instead of some rundown franchise. Everything was delish and the staff was super nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dacUZI48Cvg_OXKl1LJ_5w"
  },
  "55jXkEtyD2EZGlqBxXl7NQ": {
    "date": "1/12/2018",
    "text": "Best gluten free pizza around!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQSBy4Nfs6iWbs6OBNS8_A"
  },
  "6EfvYXEdLGARE--QGgARfA": {
    "date": "4/21/2017",
    "text": "Pretty good but it is always the same with Italian restaurants when as a customer you hope for home made sauce but it always ends up being \"jar'd\" sauce  The flavor was good though and yes I would eat there again",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yo0Dlk_VuiAhiV5Gs4SK7g"
  },
  "c15lG9kvtlM3-cuBT0THTw": {
    "date": "5/5/2017",
    "text": "Tried a 16\" Supreme for my first experience and I was impressed. Good ratio of delicious toppings and a crispy, thin crust. I'll be ordering again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiUrLijprAG8EQNurGYmhA"
  },
  "Szy7j5jmYkPFfvxeJ8epjA": {
    "date": "8/7/2018",
    "text": "love the wings and ranch. always great food and above and beyond on customer service. my first go-to when i need delivery!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxLl2ch1sJkBwt5DQyV1xg"
  },
  "DjPQ_mv9AdK1IeL134JmQA": {
    "date": "3/30/2018",
    "text": "Great food, I always get their chicken fingers and their fries are the absolute best in town!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQ1rtfEgz6M8P1ELq5cbRg"
  },
  "NHDPrwOus3DtDo7j44nnfQ": {
    "date": "12/6/2017",
    "text": "I called two hours ahead for delivery and they were late. They forgot cups with the soda. I mentioned it was for around 20 people and they packed 6 plates. Delivery man was sweet and apologized.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIvSK_BbeqjgskPAJwzE_A"
  },
  "muFHOqeqrSgyGpbrW9Zd7g": {
    "date": "1/15/2018",
    "text": "I must say I'm highly impressed. I ordered the italy sub and i swear it was the best sub I ever had. They use real mozzarrella not processed and italian dressing really gives it awesome flavor. It gets very messy but you know they say the messier the better. I had juices running down my arm and I was licking it off. i will definitely order from here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "In4Skfd8yQbfCYWtjdDbcQ"
  },
  "zOpekrqIjdrXTr7H6Kf05A": {
    "date": "6/26/2014",
    "text": "Love this place! I normally just order a pizza with pepperoni and it's delicious, so much cheese. I also order the wings and they are great. My go to place for pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jPBR0iUPkoK8pXynY_KHw"
  },
  "qH8jgZbfu_l3dd_sfm1kkw": {
    "date": "6/9/2015",
    "text": "I love Pelligrinis. Their pizza is good, I  would say worth 4 stars, but their sandwiches are amazing and worth the 5 star alone. If you like a big sandwich stuffed with lots of meat, cheese and delicious toppings, give them a shot. I recommend the \"steak bomb\" and \"boss hogg\" Their pasta is also very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nmnQEiZkI_bRi3hec5Go3Q"
  },
  "EEKO7MT-Tek1lSgYfRE8Uw": {
    "date": "6/15/2016",
    "text": "The Steak bomb was bomb but the fry's taste like they been sitting out forever.  We ordered it take out though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJKl9LNyBMwHIB2tTeZnEA"
  },
  "yRcP0qNJWUWkHLfItLrbjg": {
    "date": "3/6/2015",
    "text": "Ordered a veggie pizza was average and a sampler. Sampler was burn and greasy. This is the 3rd time I order pizza is ok. Every time I get appetizer's there greasy and nasty. Pizza was not bad will keep ordering for pizza",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgbQHH7cIyf1FM88NLhxFw"
  },
  "9R3R6stJQI09ZMxaDxC28Q": {
    "date": "9/23/2016",
    "text": "Got 2 lunch specials delivered it was quick and the food was awesome super cheap my son got a giant cheeseburger and fries and bottle of soda i got a giant Italian sub and fries n bottle soda with tax and delivery charge was only $16 AWESOME",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PALf07W3mSYsAW2tk9YvaA"
  },
  "JhenPcE2t09S9qtuko5-7A": {
    "date": "7/25/2014",
    "text": "Their food used to be awesome. We just moved back to Las Vegas and were anxious for some Pellegrini's. The last two times we have ordered, the pizzas have been extremely salty and the sandwiches dry. We also had to wait over an hour and a half for delivery. The first time it was late, we got two excuses: One from the girl over the phone and the other from the driver, so we didn't know who to believe. They at least called that time. Tonight's delivery, not a call that it was going to be late and not even a 'sorry' from the delivery guy. Wow, we're trying someone else from here on out.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zFL4oW2ipBFwas8754XFGQ"
  },
  "LANm-lqdFklaT03Uaw4DmQ": {
    "date": "7/25/2014",
    "text": "Wonderful customer service, delivered within given time and Hot, great tasting pizza like New York Pizza. Only reason they didn't get a 5 star was simply because it was a little too greasy for my taste... after patting it down it was still delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "n1UBXoiXMyQxwRapupMHqA"
  },
  "NB_ZTyOEM3NAAlc3tW0k8w": {
    "date": "11/16/2014",
    "text": "worst pizza ever . this pizza is False advertisement according to the brochure. the picture displays a thick crusted pizza ,with melted cheese. when pizza arrived at the door it literally was submerged in grease. \"submerged in grease''. the crust was paper thin and the cheese was rubbery . the telephone operator is telling me the pepporoni was the cause of the pizza swimming out the box  lol . i guess we were suckered today! i wouldn't  have giving this any starts but since this is yelp u have! Btw it was pretty pricy!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zcbXb-yNfvDqE99p0Sz0lQ",
        "caption": "Photo of Pellegrini Pizza - Las Vegas, NV, United States. Greasist pizza ever!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zcbXb-yNfvDqE99p0Sz0lQ/o.jpg"
      }
    ],
    "user_id": "PYuoxQ36_V2xMR4JgoGshg"
  },
  "Y51rcG-9arbKUcCKFu4F8A": {
    "date": "3/20/2015",
    "text": "Wasn't bad for the price.  My husband really enjoyed the Philly Cheese Steak pizza, I thought it should have had a white sauce rather than a red sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5MM-H_RNKhf2XemXLx1-_A"
  },
  "hn1HDvqHX-QSBywnHKGzEA": {
    "date": "7/2/2015",
    "text": "The 4 stars are for the wings only. That pizza is lacking imagination. Those wings though. Such a torn review. Ahhhh. Step that pizza game up gang.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jArPfr38nWz4G9UZHy5L2g"
  },
  "u9RGDwoNfG96uG27Gp0Enw": {
    "date": "5/15/2014",
    "text": "Was going to give it less than 4 the driver took wayyyy to long to get here . Got lost but food was Delish. And driver def easy in the eyes....",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B8JUQrk0BMnv1URNYHbIEg"
  },
  "edyg1wBvoXf10pqF2yhPWw": {
    "date": "3/18/2016",
    "text": "Good pizza at reasonable prices. The wait times are getting longer as people discover them, so get yours now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0AZLxgFGPYZ2wDztF5uZ6g"
  },
  "4d67a3P7Gdl_l_5EazDyGg": {
    "date": "10/4/2013",
    "text": "I eat there at least at least once a week and everything I have tried has been really good. I took a couple take out special pizzas to a family get-together and everyone raved about how good the pizza was. The portions on the sandwiches and salads are huge and everything is top quality. If you want a real gut-buster try the Triple D or the Boston sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "5fQ9P6kbQM_E0dx8DL6JWA"
  },
  "13pDHlXxJ4i_H4HyF8BqEQ": {
    "date": "6/2/2015",
    "text": "I've lived in vegas since 2005.  This is hands down one of the best pizza places I've been to.  I have ordered from here 2x and both were life changing.  I had the chicken piccata the first time and the boston sandwich the next time.  My family had spaghetti, baked ziti, and the pastromi sandwich.  The ingredients and super fresh and everything tastes great, huge portions leave enough for left overs.  Plus super fast delivery.  I'll be ordering from here at least once a week!!!!! Thanks to this place for doing it right. Ps I strongly recommend the chicken piccata.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1r2cNB1v0FFrz9niiO0F2Q"
  },
  "X8m-GwqY1Q3yAP7z2qTVhg": {
    "date": "8/30/2014",
    "text": "Loved it!! The pizza was so big we couldn't fit it in the door!!! Great guest service over the phone. To the delivery guy! Super important to follow through from the beginning to the end. I'll call again!! Great job!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIPAcQqNd4FfjtBEXOvVOg"
  },
  "FKaj-q8IL3Bz6heBd2j4pg": {
    "date": "3/17/2015",
    "text": "Great pizza, excellent taste, reasonable price excellent customer service. Try it and you won't be disappointed believe me. I'm very picky person.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wOtVcE0bnIL10gETzTBVGA"
  },
  "M2ci_3QwOCKlsI54Vlr2yA": {
    "date": "3/17/2015",
    "text": "Pizza was FANTASTIC and the wings.....Oh the wings..... Everyone was full after eating but it was so good we couldn't stop!! Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "33k3s1ko2EK4NZ1NiXLqPQ"
  },
  "hVyxF3aK0mRFnhh-zpi0uw": {
    "date": "2/27/2014",
    "text": "This place is awful.  How is it even possible to have such a high rating on Yelp.....do the owners continually write their own reviews here or what?  We just ordered a Picante pizza along with some chicken fingers and fries.  Setting aside the fact that it took an hour and fifteen minutes to arrive; the pizza was warm, not hot and the chicken fingers were almost room temperature-----obviously we're not off to a great start here.  Ok, fine, let's try the food.  It was......tasteless.  Again, how is this even possible to have a tasteless pizza along with some tasteless AND dry chicken fingers?  I have no idea, but this joint seems to excel in this nigh impossible feat.  The only thing that made their food palatable was to smother it in their ranch and/or garlic Parmesan sauce.  Did all the chefs or cooks quit, get fired or go on holidays since their last review?  Were we the unwitting victims of \"take your kids to work day\"......ie a bunch of 8 year olds running amok in the kitchen?  Who knows......better yet, who cares?    This place is awful, avoid it.  I'd like to write more, but I'm busy shredding their menu flyer.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45LifV7ez9vZehhQNkAMxw"
  },
  "dofC4SLWCpelTZNx3MKh_A": {
    "date": "3/6/2015",
    "text": "So i stuck at home and hungry so I decided to try this pizzeria my friends have been telling me to try so I ordered 1.5 lbs of spicy honey ban wings now these wings were cooked to perfection and the sauce was like homemade sauce that my grandmother would make. Then I had goodfellow sub and that was mouthwatering the cheese oozed off the bread and it was a huge portion split between two people  then  we also ordered a margherita pizza the sauce was unbelievable! !!!! I've never had pizza taste this close to straight Italian pizza I thought I order it from Italy.  This place is amazing the workers are nice polite and the food was delivered before the quoted time. I won't be ordering from anyone else other than pellegrini pizza",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDZ0XufYjQHN1U4nJ_dxgA"
  },
  "pxuZeM0vKGImgd1nyXUovw": {
    "date": "6/4/2014",
    "text": "Got a menu on the door and decided to give this place try. We got an 18\" pizza (I think it was called the pilgrim) and an order of the funnel cake fries. Pizza was delicious! The crust was perfectly cooked and I was really impressed by the meatballs that were on the pizza. The funnel cake fries were to die for! I couldn't believe the portion size for the price. I am pretty sure this just became our go to pizza joint! So delicious plus we love the online ordering!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vj4RKd86LhNmtcHfKGH5Kg"
  }
}