{
  "miNSC0-XTWW4aEYO-5d_xQ": {
    "date": "7/3/2016",
    "text": "Raising Canes is one of the only fast food restaurants I'd go to when I need something cheap and quick on the way versus your usual McDonalds, Burger King, Jack In The Box, etc. The chicken there is never frozen and your order is cooked upon ordering. Their famous Cane's Sauce is made from scratch at the store and it's always perfectly consistent. For an average female, I always order the 3 Finger Combo (3 chicken fingers, a Texas toast, fries and a drink) and it's just enough to fill me up. I'm completely addicted to their sweet tea. It's a must get whenever I come here, not too sweet and no bitter or after taste. Their Texas toast is bomb! Order it butter both sides if you like it more crispy! They also have honey mustard which I occasionally replace the Cane's sauce with since I love that as well. The only downside is that their chicken fingers are a hit or miss, juicy or dry. The drive thru is usually packed and wait times can be long especially during peak times.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G8HY1glURc6CTsFhTnHBsw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. 3 Finger Combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G8HY1glURc6CTsFhTnHBsw/o.jpg"
      }
    ],
    "user_id": "gF1XjTQ2yiSJe28o60gozQ"
  },
  "jK3MQ42_IgppvtWdBofh8Q": {
    "date": "3/12/2017",
    "text": "Totally amazing. Best fast food chicken I've ever had by far. Great, cheerful staff. Quality food. Awesome place. I'd definitely work here for a first job",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Egw1w8kynsAnVrs1rol60w",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Egw1w8kynsAnVrs1rol60w/o.jpg"
      }
    ],
    "user_id": "N3mz-0Gfz6net7VTx8HFoA"
  },
  "_txAo05HA7pYkY3PBwAfEg": {
    "date": "12/11/2016",
    "text": "Raising Cane's is a chicken tenders eatery.  They do nothing but tenders, served with fries, cold slaw and a texas toast.  They do the tenders perfectly.  This location is very crowded a lunch.  Hard to get a table and then you have to have someone clean it.  The drive thru is insane and parking is a problem.  I am handicapped.  I park in the handicapped spot, but all the cars at the drive thru block your way by being in the marked crosswalk to get into the building.  One word of caution, last time we were there I took a bite of my tender and burned my upper palate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_mc5xJhrxqUxHsqyDZqRw"
  },
  "1bOvlAf4Ybh8n_NtzmSkCA": {
    "date": "11/24/2014",
    "text": "My husband ate here one time without me and said it was too salty, so for the past 2 years, I've avoided this place. While waiting in this area to get picked up, I had a craving for chicken fingers and decided to stop in AND OMG I WAS SO MAD AT MY HUSBAND. To think, for two years I was missing out on some of the best chicken fingers ever created (too much enthusiasm, maybe?). Their dipping sauce is just a simple ketchup/mayo/spices mix, but I'm easily won over by the combination apparently. I like how their fries have ridges, with a good mix of mushy fries to schlop up sauce and ketchup and crispy ones for texture. I was also really impressed with the service here - reminded me a bit of Chick-Fil-A in the south, where they'll deliver the food to your table (most of the time, the food was ready long before the customers could even decide on which soda to get). The staff does a great job turning over tables and moving things along swiftly. Now I understand why their drive-thru line is always packed, but I do need to start coming here less and remember, this place is still fast food.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rz5G_eHQO7Z7CktFFtJAxA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Caniac",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rz5G_eHQO7Z7CktFFtJAxA/o.jpg"
      }
    ],
    "user_id": "Y8adrWFzckrjuC11aAs9Og"
  },
  "P3TzhXegr_hsnPplVvRZDA": {
    "date": "3/16/2014",
    "text": "If El Pollo Locos chicken is good, this is way up there! Smooth to the throat, and tastier! Must say, one if the best fast food chicken I've eaten!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1sKQSVAll7UurvCz7-RYQ"
  },
  "4tR1pF58ZH8sCdSpbaRytA": {
    "date": "1/8/2017",
    "text": "Raising Cane's seems to always hit the spot! I like to come here for a quick bite or get some food to go. I've noticed that it's usually very busy here, but service is always good and fast. In terms of their operations, I think the simplicity of their menu is what keeps everything very consistent and fast paced. So far, I've never received bad service or substandard food. Highly recommend this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw-RuNh3HKIiQ5xb8sXSQQ"
  },
  "6Ua7qKWSsHdFE7sHkWrUHQ": {
    "date": "7/21/2016",
    "text": "Our family loves this place. It's very affordable for a large family as well as the portions are fulfilling for all of us. The food is always fresh and taste delicious. I love how you can substitute the coleslaw for extra toast if you want the box combo but aren't a fan of coleslaw like my family. The staff is extremely friendly here and always has a huge smile. They always have gotten our order right including the substitutes and extra sauces. All around this place is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddPFBOsvFjaOVRj8sTZQmA"
  },
  "xzy4tLU0oZGdtDJ1p-f-Sg": {
    "date": "10/10/2015",
    "text": "The food is great. It's always one of my top choices for a \"cheat meal\" However, what's even more great is their customer service skills. It was IMMACULATE and PHENOMENAL!  The white gentleman manager and the cute Asian girl cashier who worked on 10/10/15 around 4:45PM were amazing!!! They really helped me out today, and I would like to give a huge thank you. They deserve a raise.  They're customer service skills were genuine and rare to see nowadays, especially here in Las Vegas. Thanks again, guys :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U_ocWuKYVev4OvcA7xIGwQ"
  },
  "dhigtoFOZXWSsggyX_-l-w": {
    "date": "11/7/2015",
    "text": "Although Raising Cane's just opened one by my area in Southern California I decided to try the one in Vegas out when I was in town.  I came here close to midnight on a weekday as Yelp directed me to this one.  If I have to be quite honest I had high expectations for this place.  It isn't bad but I think it's more hyped up than anything.  It's pretty generic chicken fingers and nothing terribly special about them.    The concept is great.  All they service is chicken fingers.  Not a lot of restaurants have this concept where they serve one item.  If you're super hungry go for the 6 strip box but I really think the 4 strip combo box is good enough.  The size of the chicken strips are pretty large.  The coleslaw was decent at best but the Texas toast was good.  The chicken strips are a bit lackluster and dry but the Cane's sauce makes up for it.  Think of a creamy zesty ranch sauce.  The food was hot, I went through the drive-thru and it came out in a relatively timely manner.   Why do I knock two stars?  The food was inconsistent.  Some pieces were incredibly tasty but others just tasted like dried up chicken.   I really want to like this place but until it's more consistent, 3/5.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vwGjs-ZOgggK4hxdKFHxA"
  },
  "LKeNUaZGS4mTg7gYnavyPg": {
    "date": "1/28/2017",
    "text": "Good food, they just take a while to get your order. This location is very busy. The customer service is okay, they aren't rude but aren't exactly welcoming.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "96iVe4KJxPegDap_2S7mAg"
  },
  "KuarKV2tcg2zrTDpsIVHmw": {
    "date": "2/5/2013",
    "text": "The staff here is the friendliest I've seen at any fast food place I've been to. That applies to both in house & in the drive thru. In fact the manager stops by during your meal to see if everything is ok or if you need anything else. If a booth is dirty the staff will not let you sit down until it is cleaned fully.   The food is great & the menu is simple. Most UNLV games offer a free meal w/ a ticket here so if you're unsure about the food, try it for free. I'm sure after one taste you'll be hooked!   If you're wanting a break from hamburgers & other fast food chains, check out Raising Cane's for something new & tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lK6vU1_UCK1owB6VEIOZPQ"
  },
  "-TyhZleRqGdEgSb_q8F4qQ": {
    "date": "11/22/2016",
    "text": "Great chicken and fabulous service. Very clean and friendly. Priced right. No complaints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pJJwxIhRLyG09CsuMMemPg"
  },
  "fqx1Adh5QMVluRdATaDsEg": {
    "date": "2/1/2017",
    "text": "For me canes is a once in a while type of place. I sometimes end up feeling like crap after eating but it tastes so good going down. Go to is box no coleslaw extra toast, with an extra sauce. The sauce is really good with everything on the plate. The fries are perfectly fried and so is the chicken. Sometimes they give me over fried chicken so the breading on it is too hard so I end up picking it off. This place also get busy sometimes so seating is limited.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O9v1HPoV8YGhc3kNDmEPqA"
  },
  "DPcvOHl_2LaXzs6AnailUg": {
    "date": "9/21/2014",
    "text": "I try to avoid most fast food but let's face it, I still have cravings from time to time and wanted something different. Going to lunch with co workers who suggested this place I was on board since I have never been here. It's a pretty much what as advertised, fried chicken and sides. I had a combo with chicken, fries, cole slaw and garlic toast. Along with a drink. The food was ok except for the cole slaw. It was funny and bland, not at all good. It was just ok and now I remover why I don't eat at many fast food places.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "L8cvMZLWmM4qWTl9SkxJ8g"
  },
  "kwCGIT5r-kdsRRJCibanfQ": {
    "date": "8/13/2015",
    "text": "All my friends and co-workers with the palate of a 5-year old swear by this place.   The chicken fingers aren't that bad and the crinkle cut fries are okay, but the food gets too cold too soon.  Not a fan of the cole slaw and I like that they let you substitute for another sauce or more fries.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EHN2fcdsWLMsGbCVS3lZ3Q"
  },
  "9DkyOe5Hj9bEZj9g2zKcYw": {
    "date": "11/17/2016",
    "text": "Great quality food!! Love their canes sauce and sweet tea. If you love chicken fingers, this is the place to go. The menu is simple and the food is always fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jnkdPpcDIDbDwEE1pDNZcQ"
  },
  "S3AcUkALVLf0eT7_HTgKow": {
    "date": "6/3/2016",
    "text": "Always been a fan of Canes. Today they were packed to capacity.  You could tell the workers were racing. One tiny snafu but Our food was perfect. These employees are second to none.   I will definitely continue being a loyal canes customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9qiaWCB8NAI-_Xy7lrGBlA"
  },
  "AHjN_0HFv7pRMmUVf2LUEQ": {
    "date": "5/29/2016",
    "text": "Service is always on point, food is hot and served fast, facilities are clean, and their order consistency is amazing. I will always recommend to order the toast with \"butter on both sides\" and the fries \"extra crispy\". The sweet tea is downright addictive; the lemonade is fantastic as well, but not worth the extra thirty cent charge and charges for refills.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DuzQa5gh0qll2bFRoBpDiQ"
  },
  "TdbhmeL7qLEc6glPPW_iIQ": {
    "date": "10/10/2016",
    "text": "Arguably the worst Canes franchise out there. These employees have no idea what they are doing. Management doesn't seem to care. Shootings nearby. Go elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yklWIWfE11nk6cxWwmnEMw"
  },
  "r-wRL-JjQsXHFdNBPqcFxQ": {
    "date": "3/29/2016",
    "text": "Not what I expected, for some reason I thought the chicken strips would be more crunchy and flavorful, maybe I have been eating way to many Blue Ribbon strips. At first, they didn't seem anything special, but I quickly became addicted to them. I ended eating 9 strips in one sitting, probably the most chicken strips I've ever ate in a single meal, that says a lot. lol",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oK1v-yP9ygKWg6M19wWYIQ"
  },
  "2LNlfpnEgvPMF9mouLCW5Q": {
    "date": "5/24/2017",
    "text": "If you love chicken fingers I kid you not if you are ever in Vegas and you are a hater of Chick fil-a people because they use peanut oil, then this is your dream come True. Due to cross contamination with shellfish and peanuts there are many places I can't eat that fry food. The Rebel kids swore I would love this place and they did not use peanut oil. They were so freakin right I love this place, I need to call their HQ and ask them to come to the Bay.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "23BqHjjQdx7cx4woQM2KVg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Go Rebels! Cane&amp;#39;s loves the UNLV.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/23BqHjjQdx7cx4woQM2KVg/o.jpg"
      },
      {
        "img_id": "vqBn4igcIq-8m9QlLyWs2g",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. There isn&amp;#39;t a Rebel from UNLV that doesn&amp;#39;t eat here. Mom still begging for you to come to SF Bay. East bay that is. ;}",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vqBn4igcIq-8m9QlLyWs2g/o.jpg"
      },
      {
        "img_id": "4Ig5255sUkeSkVRDED2Ieg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Sorry to busy eating forgot the pic but next time I wont",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4Ig5255sUkeSkVRDED2Ieg/o.jpg"
      }
    ],
    "user_id": "6LvSDK7CKaSQqoltfPgRVA"
  },
  "7uVm9aKvuh3oP5NQBiI1mg": {
    "date": "12/20/2017",
    "text": "Amazing! This is the Raising Cane's that me and my family goes to! All the employee here work together so smoothly and are constantly busy! My son left his phone there as an employee turned his phone into the manager! We was so scared someone might have taken it already, my husband and son went back there and thank goodness they kept it for him. Glad the find my iPhone app also helped us to know where it was! Wanted to give the person that found my sons phone but the name was not given so this is the best I can do is put this on yelp!  12/20/2017 I was feeling disappointed I have 5 kids to feed and raising canes isn't cheap...So when I get home and took a look at my order there was only 20 chicken fingers instead of 25 so decided to call, spoke with one of the managers \"Bill\" he got me calm and told me he will take care of me when I go in the next visit...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Tl7_TqAso-o3TawrGGZUQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2Tl7_TqAso-o3TawrGGZUQ/o.jpg"
      }
    ],
    "user_id": "tRGbXOlNUg5pRhf8HbFICw"
  },
  "0O1Pq0SHFCHPNUhlorJgWw": {
    "date": "11/11/2014",
    "text": "First thing I have to put out there is that I am super stoked to be this close to a Raising Cane's! In my previous neighborhood I was no where near a RC, which was a damn shame, let me tell you! After a trip to the wonderful Home Depot, we decided to have our first taste of Raising Cane's in (literally) years.  It isn't the cheapest option available but I never feel like I just got gypped off when I order there.   Those chicken tenders are pretty damn good! For this visit we each got a combo that included 6 chicken tenders, a side of cole slaw, texas toast a slop of fries and a 32 ounce drink. This cost roughly $8 each. Not a bargain but at least you get a lot of food for that price. Besides the yummy chicken fingers, that texas toast was freaking delicious! I guess additional pieces are $1 a piece. The only thing I didn't particularly care for were the french fries. They were of the puny crinkle variety. Meh.  Also meh was the service. Not horrible, but also I felt like the young lady who assisted us was annoyed. Not quite sure if she was annoyed by our presence or something else but it was definitely a bit off putting. Maybe she was just having a bad day.   At this price point though Raising Cane's will have to be a once in a while treat and not something I grab on a regular basis. I think this place also has the potential to move to 4 stars in the future but for the time being 3 stars feels about right.  3 stars.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "qweLHL9bmG0Lyhjt30-NEQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qweLHL9bmG0Lyhjt30-NEQ/o.jpg"
      },
      {
        "img_id": "KnN-YbB4LRWjFxI_aVZ2dA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KnN-YbB4LRWjFxI_aVZ2dA/o.jpg"
      }
    ],
    "user_id": "CDvhiRiczAq0M5pktyiyog"
  },
  "xiwaT-Pf21pIexf8v59iXA": {
    "date": "3/26/2018",
    "text": "Mess up on orders 70% of times. Food is good. I recommend ordering without modifying menu to avoid paying extra and not getting what you wanted.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TNAHFvpAaEfO50uZ2g7P8g"
  },
  "kNLAj7sS48LFkp25Q77fZQ": {
    "date": "5/2/2018",
    "text": "The chicken was cooked to perfection. Moist not dry. The sauce is the best. Texas toast was yummy. I think they should add more items to the menu but every item is super good. Kids love Canes and they give out free stickers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fxqFeiWuHSgHeCSKBQhPQ"
  },
  "v3_LGMAJZ7iBVmdC8OZtBw": {
    "date": "5/8/2018",
    "text": "Thank you soooo much for the teacher appreciation food!!! It was so delicious!!! This place is great!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pnZqSNpPAO_VRiKo6K-zQg"
  },
  "0gSbWZQ0FZmV-4gEBmiYFg": {
    "date": "8/9/2017",
    "text": "Very disappointing it took my food about 45 mins to get my food! & i only got a 3 finger combo! :(  food was good though!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbylVR61IQFcFOJ5BsH9aw"
  },
  "m4_CoUFfJJoxAdUa4tLK2Q": {
    "date": "5/8/2018",
    "text": "Has been fire every time I come. Haven't had a bad experience yet, which is hard for fast food places to achieve. Always have the best customer service! They come check to see if everything is okay with your order & are always super friendly. The food itself is amazing and always fresh. Get the sweet tea when you come!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CnX8zTGfrVx1pTnSlwkVyQ"
  },
  "a3iYzm20qg9SvfUtxs27vQ": {
    "date": "3/1/2016",
    "text": "When I feel like blowing my low carb eating regimen I head to Raising Cane's, otherwise known as chicken carb city! It's worth every single carb and calorie to eat here. Their chicken fingers are cooked to order so you'll never get cold food or soggy fries. You can't go wrong with anything on the very simple menu. Your choices are chicken fingers, cole slaw, Texas toast and fries. Pro tip: when watching calories you can order the kid's meal for under $5 and get a tiny drink, a special prize, 2 fingers and a smaller portion of fries. That's my guilty pleasure and they've never given me grief when I order one for myself.   I grew up in the South and I think their freshly brewed iced tea is legit. They have sweetened and unsweetened varieties and both are excellent. Dine in and get all the free refills you can handle. Sometimes I'll swing by just for a large cup of tea.   This location is open very late and has a drive-thru. Kids seem to love it too. In fact, I've never met anybody who didn't love Raising Cane's. It's high quality food that's made fresh. I never mind the short wait after ordering because the food is being made just for me; it's heat lamp free.  Bonus points for the super duper friendly and enthusiastic staff, the spotlessly clean dining room, and the booth with a \"Wall-E\" poster on the wall (my favorite movie of all time). That's my special seat so keep it free for me guys, thanks!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "BQkC6RneYfvfG6wRe0hsvQ"
  },
  "2CSJTyC0ugi9C5XEnHjWjQ": {
    "date": "6/4/2018",
    "text": "This is a great example of good fast food: the chicken is well cooked and pulls apart easily and the fry is light and not too greasy. I'm not a fan of crinkle fries but these were good and went well with the signature Cane's sauce (a thousand islands-esque mayo sauce). Their lemonade and sweet tea are both super refreshing and the food is filling and affordable. I didn't like the Texas toast but would definitely go back for a quick meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUR4b2q9uccHHem2HHfCVw"
  },
  "wuLJ5r9dQO2jEfwNtajGaQ": {
    "date": "8/12/2016",
    "text": "Amazing customer service and the garlic toast is to die for!!!! A buttery garlicky party in my mouth! Mmmmmm.  The chicken fingers have very light breading. Not greasy at all. And the signature sauce is amazing!!!  Check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ls0ebdhhuHYVOfAVPVCqXQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. 3 fingers and the famous garlic toast with signature sauce!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ls0ebdhhuHYVOfAVPVCqXQ/o.jpg"
      }
    ],
    "user_id": "iBuWNB9koLWgT0bMPg3eBg"
  },
  "UmUk9Iz2guU-htL8nty2tw": {
    "date": "6/22/2014",
    "text": "Raising Cane's just raised the bar for chicken strips to heights I never fathomed reachable for this familiar finger food.  Chicken strips, chicken tenders- call them what you will. The name won't add any juice or flavor to these boneless pieces of white meat, coated in bread crumbs then deep-fried to mask their dry texture and dull nature.  Ironically, in the middle of the parched Nevada desert, I found the moistest chicken strips I've ever had. The chicken was coated in a crunchy cover of breading and broke apart lightly. It came with an orange-colored, slightly tangy secret sauce that might have been some house version of thousand island.   The crinkle-cut fries were cooked medium to medium-well, slightly crispy on the outside; ordinary, but they fulfill their purpose as a filler. The Texas toast was a unique surprise, a thick slice of buttery brioche slightly toasted outside while fluffy as feathers on the inside.   The menu at this small fast-food chain from Louisiana is simple: 3 pieces (The 3 Finger), 4 pieces (The Box), 6 pieces (The Caniac), or 3 pieces inside a Kaiser roll (The Sandwich). All come with the toast, fries, and a drink; the 4 and 6-piece combos also have the addition of coleslaw.   I got the 3 Finger Combo which was a good-sized lunch. For 6 bucks and some change, I learned that chicken tenders can be tender, and that food can be fast and affordable and still fit the bill for great grub.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "kpeZWGLHFZQvO7aJXUgaLg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. The 3 Finger Combo- 3 strips, Texas toast, fries :).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kpeZWGLHFZQvO7aJXUgaLg/o.jpg"
      }
    ],
    "user_id": "PSflctuopnjaIWm-P_o7YQ"
  },
  "Ol5M9QCjrBEHPuRUyAGI8A": {
    "date": "11/7/2017",
    "text": "The upside: Chicken, texas toast, fries, and secret sauce  The downside: Not being able to find a place to sit especially around lunch time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XD_JGWx8yjntSOw-yDyr3g"
  },
  "8WyqQx9RcKrbMa6zi8i0Eg": {
    "date": "12/5/2016",
    "text": "As a big fan of chicken strips this is a great place to fill that craving.  Although a chain they do a great job as they focus on one things - tasty chicken strips.  They meals are a decent price for what you get.  The service can be spotty at times.  If they are busy they get overwhelmed due the small counter they have.  The inside is nice but when busy can be hectic and messy.  I have never used the drive though as it seems to be a longer wait than going inside.      The chicken strips are good but I will say the breading is on the thick side.  They are medium in size and with the caniac sauce are pretty tasty.   The toast is really tasty and I like the fact it is not overwhelmed with butter.  The crinkly cut fries are ok but could be better.  The cole slaw is pretty good and not the mayonnaise type so it has more of a vinegar flavor which I like.      They have a really good rewards program and send out deals every couple of months.  Well worth signing up for.  Nothing beats a Bogo deal!",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 14,
      "cool": 15
    },
    "photos": [],
    "user_id": "6H4Zj-c7FqM9mCsXvwaEQw"
  },
  "ivDX0J8n_9MPZWRR1zdS7A": {
    "date": "12/30/2015",
    "text": "I got the chicken strips and fries. I love me some crunchy chicken strips. I only remember that the sauce was good, but the chicken strips were not notably special. It was just a regular chicken strip with not a great breading or crunch.   Moving on to other chicken strips...",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "B1829_hxXSEpDPEDJtYeIw"
  },
  "hAPqW8afK2q7ko8K9oRO7A": {
    "date": "9/22/2018",
    "text": "Went thus evening to get food for my kids. Service was speedy and friendly. The cashier was great and made sure to repeat the order back to avoid error. The restaurant was clean AMD received a welcome upon walking in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvPx5CH2qzj0YWRSrDH4wQ"
  },
  "Bla1TDnej85rxYjT_1Cl3g": {
    "date": "10/9/2018",
    "text": "I NEVER usually write reviews but after my recent drive through experience,I have had enough. I have been coming to this location for almost 4 years and quite frequently about 2-3 times a month even more sometimes. If you are going through the drive through, PLEASE check your order before you get too far from the location. A good portion of the time they get my order correct, but my last experience I asked for extra cane sauce, and I never got it, and mine only came with TWO chicken fingers instead of three. The sweet tea I also ordered was not sweet at all. Most of my complaints is that they usually forget to put the extra cane sauce I always order. This usually does not happen often but when it does, it gets quite infuriating opening your food when you get home and its not what you ordered. So if you are lazy like me and do not want to go down to order, I advise you to at least stop at the parking lot for a second and check if your order is correct!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4ARtj1UcVWxszjEIJcHaA"
  },
  "FGQlaURtHVMdsUTFAK-oQA": {
    "date": "2/25/2017",
    "text": "Service is getting better here. Messed up my order but they fixed it no problem. Also apparently they \"ran out\" of the peel cups and stickers cause I didn't receive one. But they were handing it out to people AFTER me??? Ok.   Update: ordered again... asked for 1 honey mustard. Gave us ALL honey mustard no canes sauce. Idk about this location.   Previous: Not pleased at all with this location. Every time I go here something is always wrong with our order. This location ALWAYS forgets my friends coleslaw.   Today I went through the drive thru at 11:40ish. I asked for a caniac combo: coleslaw for sauce, butter both sides on toast, and extra crispy fries.  My toast was normal... and my fries were soft.. my fries were like room temp. Not even warm. I'm concerned on if this location serves their food by saving as much as they can instead of served fresh. The last running the drive thru asked me to donate so she can reach a GOAL??   Anyways If you're able to go to another location, GO.  The one one lv blvd is way better than these kids.   Remember don't expect fresh fries or bread.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tlinZoSGN9tavRnhBsAIBw"
  },
  "0IxnlgoX90wUCAZ9gHgxFw": {
    "date": "1/29/2017",
    "text": "Have only been here a couple of times, but the food has been great each of them. Tenders are fresh and flavorful. Slaw is crisp. Of course that Cane's sauce is dynamite. Love their sweet tea and crushed ice. Giving them only 4 stars because of variety of the menu. Would be really great to see something fresh on there. Maybe a chicken finger salad over some fresh greens or at least a side salad to build your own.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_q_JpDNB06PaUrMvP0WwNQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Caniac Combo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_q_JpDNB06PaUrMvP0WwNQ/o.jpg"
      }
    ],
    "user_id": "yWHhNCtTULI5CwkowHT27g"
  },
  "jtgq-X0R13kTLfZVbhZcnw": {
    "date": "12/19/2017",
    "text": "Winner winner chicken dinner! The BEST fast stop chicken fingers everrr. It's always a must when we're visiting from Hawaii. Knocked off a star due to them forgetting another one of our orders a few days ago. And to be fair, they did that to us the last time we were here too at this same location lol! But whenever we've called to let them know hey you guys forgot an order, the manager (Bill in this case) is always very friendly and always says to come back for it whenever we're ready. I just hope they stop forgetting haha we love our chicken there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iyKru_EKC9eck1cm-LhRQ"
  },
  "PiYTKfpHAEc1TMoPKtkeFA": {
    "date": "11/19/2010",
    "text": "yummm.. i could eat their toast alllll day. lol  this is my faaaavorite place to get chicken fingers. the chicken is always consistently good. crispy..juicy.. and the size is perfect.   i normally don't like crinkle cut fries but i like them a lot here. sometimes crinkle cut fries can be a bit soggy but here... they are on the thinner side so they stay crispy.   i like their secret sauce but i am not like blown away by it. but that's ok cuz i come for the chicken fingers and not the sauce.   i've found that you either love or hate the sweet tea. if i could i would make a meal out of the toast and sweet tea. :)  this location is super clean.. everyone is super nice.. and i think even the manager comes out and asks how your meal is going. awesome for a fast food establishment!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SssXdhbeYJOCF6sfSFwC-Q"
  },
  "MAHDtuh_GrS0hTS1ypmImw": {
    "date": "8/9/2013",
    "text": "Just came from raising canes and we're pretty satisfied. Reality is chicken strips are chicken strips. I mean it doesn't send me over the moon or anything but it gets the job done! Wondering why I have four stars? Well for one their dipping sauce is CRAZY GOOD and so is their service!!! I went during lunch rush and it was super busy, did this slow things down? Nope! Got my food within less than five minutes and found a table pretty quickly despite the crowd. Now some other people weren't so lucky BUT their employees were nice enough to help them get a seat. I mean a worker stood there for 5+ mins holding a customers food till they got a seat! Not to mention they would also greet every single person who entered or left. Pretty good service for fast food I'd say!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSFpjl-C0fXY7h7cG8Wxeg"
  },
  "o9H867hwDxaiO5qjzLQqow": {
    "date": "9/29/2010",
    "text": "ok ... it could be the southern in me ... but I LOVE Cane's. It tastes like good old fashioned fried chicken and they serve it with this bomb -ass sauce. ( yes i said bomb-ass) .  It is a tangy and savory sauce that you have to eat with everything... including the crinkle cut fries... and texas toast ... (omg the Texas Toast)  I swear i gain like 5 lbs just talking about this place. I typically get the three finger deal which is awesome and I either get a sweet tea- OR  Lemonade ... because OMGOSH soooooo good.  hmmm I wonder if I should go for lunch.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pn4W0F3wc6B5fAEwpKY0rQ"
  },
  "FM2BzMbEvw1pvjrmKAO-Lg": {
    "date": "5/2/2014",
    "text": "One of my favorite places to eat. The family loves this place. Any of tgere box combos are the way to go...Chicken, sweet tea is so so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmxTbJGYdAhZzBHSFIJ1sw"
  },
  "ruDQeImjc3DT_qhoeWecww": {
    "date": "5/1/2011",
    "text": "My favorite chicken strip place!  Fan of the sauce the sweet tea and the Texas Toast! yes yes and yes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLoEhU6zvFzcc0erH7gfyg"
  },
  "OM85B6aAGFqIPXYpgPUNvw": {
    "date": "7/24/2010",
    "text": "\"Hello...My name is Chris and I am a Caniac\", there...they say the first step is admitting, the second is eating!!!  When I first drove by the construction for this store (blocks from my house), I practically peed myself in anticipation.  I still remember the first time I had Canes, I was baffled at the fact that the menu has pretty much 2 things on it, Chicken Fingers and French Fries. They only a few combos, but when you do it this good you don't need other options.  Their Chicken Fingers are great, the fries are good, the Texas Toast and cole slaw are good sides, but there are 2 things that keep bringing me back to Cane's.  #1-Cane's Sauce...I have no clue what all goes into making Canes Sauce, but I'm pretty sure it includes crack, this stuff is addictive, I like it on my chicken fingers, french fries, and toast, hell if I could get a bathtub full of it, I would!!!  #2-Lemonade...I have not drank a single serving of soda since in about 9 years, most of the time whenever I go out, I drink water, but Cane's Lemonade is AMAZING, they make it fresh every day, and it is hands down the best Lemonade I've every had at a restaurant (chain or otherwise)  I have also hear great things about their Iced Tea, I wouldn't know since I'm not a fan of Iced Tea.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hyIVFPfm3TyPWQf0Xh9u1Q"
  },
  "W_zjjmv7HkrztomVzVjmOQ": {
    "date": "11/13/2012",
    "text": "The best place to get fried chicken. I love the Caniac combo. I always get extra Cane's sauce. The fries and chicken would be mediocre if it wasn't for the Cane's Sauce. It's a little overpriced, but trust me that it will fill you up and you will be happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "64mkjOKjRC897Gb8Hkel-A"
  },
  "0G4fGx-nSdolCPD9o2yNdg": {
    "date": "8/29/2013",
    "text": "I live down the street and my boyfriend and I love coming to raising canes. The service is great! Aside from a few times of our order coming out wrong, still really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PAch-abVDQ3Sg9nX7V5OzQ"
  },
  "3xBsm4Gv40bEzEUyXRprFw": {
    "date": "7/22/2013",
    "text": "Love, love, love Raising Cane, sure it's not for everybody but I personally love their fresh chicken fingers and sometimes simplicity just does it for me. If you like chicken fingers I don't see how you could be disppointed with them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpOp-olt_rjZRaVuPUKG-A"
  },
  "S8_pwuVGwPPuH-Jvavy27A": {
    "date": "12/12/2010",
    "text": "Goodness at your fingertips. Flavorful breading and awesome sauce will get me working out at the gym much more to keep the cholestrol down and continue to indulge in this fried goodness.  The sauce brings it all together. Its an aioli (fancy mayonaise) with a chili pepper kick to it.  Order extra sauces so you don't run out near the end due to dipping the fries and the buttery toasted bread in along with the chicken strips! Chicken strips! Just saying it makes me smile. Chicken Strips!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rc_8FQT2jeXoo6B_AfrbpQ"
  },
  "4iw1KSqIbaWnCTbkKr1qPw": {
    "date": "1/17/2011",
    "text": "My family always would tease that if we went to a five-star restaurant, I would order chicken fingers.  And I'll admit- that was True for a number (18) of years.  I have always loved chicken fingers.  I would order them at a bowling alley, a steakhouse, a burger joint, etc. Because I was addicted.  Since then, my palate has grown and I enjoy steaks at steakhouses, burgers at burger joints and beers at bowling alleys.  However, when Raising Cane's came to Las Vegas, my excitement went full-blown and I could not WAIT to try these chicken fingers!  (Did the power's above finally hear me and create a place that would be my heaven?!?!)  With my first experience I wasn't sold on the sauce.  I like honey mustard with my chicken fingers and there being only one sauce confused me.  But I LOVED the flavor of the fingers, LOVED the crinkle-cut fries (seriously, those are the best fries!), the bread was delicious, coleslaw was good and they had Dr. Pepper!  Fast forward a few months and I gave the sauce another shot and have never looked back.  Sometimes the wait might be a tad long, but when they are fresh and cooked to order, the wait isn't so bad.  The company itself seems pretty awesome, as I always hear the owner's on the radio promoting local schools and even UNLV.  Speaking of UNLV Men's Basketball (GO REBS!), if the Rebel's win,  bring in your ticket within 24 hours of the game and get a FREE Rebel's combo.  The Rebel's combo is pretty much a children's meal: 2 chicken fingers, sauce and fries.  For Free, that is very good!  Thank you Raising Cane's for sharing my one love (besides my husband): chicken fingers!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ii1PkdRpONUNwKC3lmhl1A"
  },
  "dyZRrSTjBSogOjqmKrGTFQ": {
    "date": "4/16/2011",
    "text": "I loved loved loved their chicken fingers!! It was my first time trying this heart attack in a plate and I was pleasantly surprised by its simplicity. Chicken strips, fries, a piece of bread, and some dipping sauce. Sounds pretty simple but the combination is truly orgasmic. The chicken was cooked to perfection with the right amount of batter. Crispy and yet very soft and tender. The fries were also really good, enough to finish the entire plate, although I did not dare. I didn't get a chance to try the sweet tea, but I'll take your word for it and say it was probably pretty damn good. Overall I had a great experience. I definitely see myself hitting this place up after a drunk night but they're only open till midnight. I guess I gotta go back to drinking at noon...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_sMdxBILI96QUXx-kLFnZw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Delish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_sMdxBILI96QUXx-kLFnZw/o.jpg"
      },
      {
        "img_id": "66EKHOvNYJa0r2YMVWMmOw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Disco ball in the restaurant. Wow!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/66EKHOvNYJa0r2YMVWMmOw/o.jpg"
      }
    ],
    "user_id": "h-yMohvv5EUcp-VvOQdeEg"
  },
  "P2qP_6LmMfGmfjmy8puLiw": {
    "date": "9/29/2010",
    "text": "Gave Cane's a shot last night and really came away impressed with their staff and the food. The chicken was fresh, had the taste & consistency of chicken and we enjoyed it. The crinkle fries were good and their \"special sauce\" was pretty darn good as well. Their staff was very good for a young group and who are working at a fast food joint. At least 4 different people greeted us or said something nice and everyone was friendly and polite, job well done! I don't think we'll eat here too often just because we don't eat a lot of fried food but it was worth giving a shot and especially if you want some good chicken fingers and great customer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KeT9NKimYkHN0wlrij-dg"
  },
  "rH3muVBIhpOTOI9BMzOfhQ": {
    "date": "8/23/2010",
    "text": "Usually I get the Box Combo with four chicken strips, fries, cole slaw and the Raising Cane's secret sauce. I mostly enjoy the light breading on the chicken strips, it is similar to some corn flakes. The strips are always super hot, which is good for any quality food. Each Vegas store, from the ones I have visited, have some sort of pop art relating to Las Vegas and a famous velvet Elvis piece.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TIYFItf0WsHfUs2g7_I9eA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Inside of the restaurant.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TIYFItf0WsHfUs2g7_I9eA/o.jpg"
      }
    ],
    "user_id": "r5ggPC6OccLk6dDl5yqsJQ"
  },
  "UnZ7FDKEyC_ldX5nDxpMGA": {
    "date": "11/14/2011",
    "text": "I tried Raising Canes about 2 weeks ago and have gone back 4 more times so far. This restuarant is only a mile from my new house that I purchased 11/04.  I've had the strips alone and the strip sandwich. The cane sauce is great on the sandwich but when I eat the strips by themselves I prefer the honey mustard. Where the hell is the ranch and bleu cheese?  The chicken is fresh and the batter is light which I prefer.    My only knock on this place is a small one. It has to do with the way they take my order. Lets say I order a three chicken finger sandwich. The conversation will go like this - (EVERY TIME)  Hi can I get  a chicken sandwich with Cane sauce please?  Sure - What kind of drink would you like with that?  Huh? Who said drink? Just a sandwich with cane sauce please.  Oh OK im sorry, Sandwich Combo with no drink please pull around.  At Window - That will be $ X (about three dollars more than I have in my hand)  What? I thought the sandwich was $4.32  Sandwich? You wanted fries and toast too.  No I didnt, I hate french fries and I dont even eat toast in the morning with my eggs.  Oh Im sorry, I must have misunderstood.  Other than this, which I have gone through every time - even the one time I went to the location on the other side of town - I have to say the service is pretty good. The people are friendly and the place looks clean. I know that this high pressure approach is the result of stupid managers pushing sodas and 'combos' to people who dont want them and not due to the ineptitude of their employees.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nk8tKj3-V-7s2cbqGNwo1A"
  },
  "pXXvzFQQDrYkyhqRaxIenw": {
    "date": "9/22/2010",
    "text": "When we first moved here and I heard that there was a restaurant that only served chicken fingers I thought ,how can that work? For a restaurant to only have one 'main item', it better be the best product out there.  We finally broke down and went to Raising Cane's and were delighted with the experience! The chicken fingers truly are the best ever! Moist chicken, crispy flavorful breading- it doesn't get much better than that! The sides are excellent as well, and I love, love, love the dipping sauce! Raising Cane's gets an A+++ from me!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "fb_nXRS-sPEM2Eg_yvPS0w"
  },
  "TmRsmsjR2ujwaw2ULauyEw": {
    "date": "6/1/2010",
    "text": "Delish. That's the one word that comes to mind when I think of my experience at Raising Cane's Chicken Fingers.  The menu and concept is simple. Chicken Fingers. Everything else is sides such as fries, cole slaw and an extra helping of awesome.  I popped into this location last night with some LA friends. We were hungry after an epic BBQ and Pool Party and needed to go someplace quick before our trip to the Downtown Cocktail Room (see my review on DCR).  I had the \"most popular\" box meal. 4 Chicken Fingers, Crinkle Cut fries, Texas Toast, a side of slaw, and a drink. Effing amazing. All of it. Probably really unhealthy, but my several spin classes and high mileage running this week will burn it off, so who cares.  Couple things that made the experience epic. Real crushed ice. Coke Zero in the soda fountain. Sweet tea. And the special secret dipping sauce.  This place is worth the drive, walk, stumble or whatever. Get your ass here now. Trust me. It'll change your outlook on life.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wi0VgIrbb8vqU6weyVw6tg"
  },
  "pYx5xUFtxlNZqGdBk76S1A": {
    "date": "4/2/2010",
    "text": "I usually don't review chain fast-food places but I've got a couple gripes with Raising Canes. First of all, I respect that they have a small menu. Any place that has so few choices must have some good product to stay in business -- and their chicken fingers are 'good product'. But the price is a little on the steep side in my opinion. $7.34 for their box combo meal which comes with 4 chicken fingers, fries, texas toast, cole slaw, and a drink. Maybe I'm just getting old and/or I'm really cheap, but I remember the days when you could get a huge lunch for under 5 bucks.  My other gripe is for the temperature in the restaurant. Holy shrinkage, Batman! It's freezing in there. If I needed to cut any of my food I could have used my razor sharp nipples because it was more than a bit chilly in there.  This new location opened recently on Rainbow, south of the 215. I went during the lunch rush and couldn't believe how many people were getting their grub on at this place. Serving nothing but chicken fingers is a niche market, but apparently it's a big niche.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2C0GPKvzWWnP57Os9eQ0w"
  },
  "nJtVhNKXZ4QGG3aBrqMNRw": {
    "date": "1/14/2013",
    "text": "The sauce is definitely the boss. My #1 rec for first timers is get the cane's box and make sure you sub out the coleslaw for another sauce. Other than that, very simple formula. Great chicken fingers and a delicious sauce. The sweet tea is the best out of all the fast food restaurants. Better than Chick-fil-a's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UndIqny6MWZm4chmzrK5w"
  },
  "FT1ViRAyyVmPNba4m37gNg": {
    "date": "11/20/2012",
    "text": "I don't understand the hype. We spent our honeymoom in Vegas. In the summer. Loads of fun (and sweat. Ick). I'd managed to convince my new food-averse husby to try out this place. I'd heard stories. I'd even checked out Yelp. But why? What for? It's just not worth the price for barely flavored fried chicken strips and krinkle fries. I'm pretty sure I have the same exact types of chicken fingers and fries in my fridge. The sauce was the only thing with any flavor...and it had no kick. Very disappointing, but they do get a star for good customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E4DlioCkPHjW4vhQggDeow"
  },
  "dXm7IlMgv2jNAXaAqhSUYQ": {
    "date": "12/5/2014",
    "text": "This is the best chicken strips on the Las Vegas strip! The sauce they give you to dip in is AMAZING!!! ALL the food to be honest is awesome!! Ill go to Canes any chance I get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fb9gl08ubkB5sRIx6eWz4w"
  },
  "hIhcIo0bRiVoyImvUy2NLw": {
    "date": "5/15/2011",
    "text": "I thought if I moved so close to a Raising Cane's that I would go here frequently, but I've only been here once in the last 5 months or so.  I'm not really crazy about the food here anymore.  Fries are a little lackluster, texas toast is so salty I feel like I've run my tongue on a salt lick, and I wish there was more than just the thousand island dressing to dip the fingers in.  A little variety would be nice.  Yes the chicken is good, but that is all I like, literally.  One more thing that bugs me - they don't really have any small plates of food.  Everything is massive.  Yes I know I could just order a la carte, but sometimes it would be nice to see a special plate with a smaller bit of food.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PomQayG1WhMxeSl1zohAUA"
  },
  "18WPudSHUR8j4wNqoZkaCw": {
    "date": "9/24/2011",
    "text": "The battered fried chicken fingers are tender and tasty. The texas toast is the best ever. The crinkle cut fries are ok. The sweet tea will wash all that down! I  would recommend this fast food joint!  P.S. the coleslaw sucks! (Yuck!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_czM6RfIAeFa4doHBXzzsQ"
  },
  "4TUoEx8VctKLfiJnNUxtUw": {
    "date": "2/2/2012",
    "text": "Wow super fast drive thru and super friendly drive thru staff!! Didn't give five stars because I wish my sandwich bun would have been warm er =)) for fast food i leave a happy person.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XEoLiNhviSEMDhyWEXmLOQ"
  },
  "cgOyqKaLOxGPpxdFtq9mvg": {
    "date": "2/5/2013",
    "text": "The DEA should plan an undercover sting operation there, because whatever substance they use for the batter must certainly be illegal in the 50 states and territories. That is some potently addictive tasty chicken they serve there. The inside is juicy and tender due most likely to a phenomenal brining method, but the fried batter is what stands out. Surprisingly still light and not overly greasy.  The side sauce option is good, but in my personal opinion not what makes Cane's an outstanding fast food option.  As for the rest of the sides on the menu: Greasy carbs, fried carbs and fatty greens (Toasted Texas Toasts, french fries and coleslaw). I usually skip the sides in fear of turning to carbs myself. It is just too much of it.  If you go for a side, the Toast are good but maybe too greasy when already eating fried chicken. Fries are actually not too bad, but Cane's will never win \"Best Fries\" award. Cole slaw is better than KFC (I know. Why make a comparison to something not worth it).  As for service, the staff is always very courteous, friendly and thorough (Even though in the past they forgot 1 of my chicken fingers on a drive-thru run).  Note to any federal agency conducting an investigation into the goodness of those fingers: I'll be happy to watch over the seized evidences. It'll be perfectly safe.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MKC5kBFwZ3oAX2ZAT-9IVw"
  },
  "u0LkpOfwtPrmtvPq4AitMg": {
    "date": "4/5/2014",
    "text": "Cane's sauce is addicting. Good service, quick and juicy chicken. Never had an order be wrong, cold or gross.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cy7OR3l-0TeDAZT8XwOPRg"
  },
  "9Uj07cznftz4w4hGInx_Og": {
    "date": "6/20/2011",
    "text": "Good food, but I think its a bit over-priced, hence 4 not 5 stars. The box combo with chicken fingers, fries, texas toast, and slaw is the popular way to go. The food has always been fresh, and the staff is over the top happy. It almost freaks me out a little bit that every single staff member smiles so much. I would assume it's because the working conditions are great and not that they are robots (literally).  I have officially made the switch over from McDonalds nuggets to Raising Canes, which almost pains me to say considering those Micky D nuggs are part of my youth!  Overall, I highly recommend for a lazy, redbox sorta night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZsAw2e4Vdq88-yDCtZJPlg"
  },
  "8HI-8D9vDoHSS56OwVJdWQ": {
    "date": "2/24/2014",
    "text": "My friend brought me here and I just liked it! I sometimes buy and enjoy four chicken fingers combo at home when I do not wanna cook. Personally, I like their coleslaw and the small piece of bread. Also the staffs are friendly. Can't wait to stop by again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U2gabfuKerBmJG3JfVg7Rw"
  },
  "l_U8OOYQlqkzEjlb8RrWKA": {
    "date": "7/5/2013",
    "text": "I cant believe this place only does chicken fingers and they were no better than fingers I could pop into my oven at home from my grocers frozen food secton. If you only do one thing it should be amaze-balls, and it wasn't. Chicken was not juicy, the breading was soft/mushy, not crunchy at all. Save your money and hit up KFC, it'll be 10 times better and actually crispy!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8qlnglgNgqsJFWygkNt7w"
  },
  "pGOKwmkudkxw8TQdrsMVEQ": {
    "date": "2/6/2013",
    "text": "Writing a review of Fast Food?  Going to Yelp Hell, but I love the chicken and the magic sauce (the best way to describe it) here!  We usually order the Caniac combo with extra texas toast and no slaw.  The chicken is always tender and juicy.  The magic sauce is to die for.  It has a tangy and rich bold flavor.  Raising Cane's is the ONLY place I would pay the extra $$ for the extra sauce.  I don't believe one should pay for extra sauce, but at Cane's, I do and it is well worth it!!!  The Texas toast is crunchy on one side and soft and pillow like on the other.  The Sweet Tea is as good as they make it in the south.  5 Stars for Fast Food review, you betcha'!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gk8l75GLFUsFr0kS5uLtkQ"
  },
  "TuG2wrD3xBrRcBF4UHy-IQ": {
    "date": "5/4/2011",
    "text": "I have just moved back to Las Vegas and swore that I would get out of my structured box and try new things so instead of going to Popeye's for chicken which I love, I tried Raising Canes which someone referrred me to.  In a nutshell, the chicken is not nearly as good as Popeyes not is the quantity the same.  That is the con of going there.  Is it bad?  No certainly not, I just think you can do better.  The service is very good and the people are very friendly.  The sweet Tea is as good as the Waffle House and Lucilles BBQ.  The Texas toast is great.  The coleslaw is better than KFC's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kMi8dCXhj0i08a41DSVqw"
  },
  "ysZY0eGZ9Q0NqhS0aUa6Xg": {
    "date": "3/21/2014",
    "text": "Great chicken fingers and Bread. However charging for lemonade is nonsense and they need to get some ranch and BBQ sauce. Otherwise some of the best chicken fingers around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOMZsG5SUfpEu-WwkkKZ2g"
  },
  "w0mdARqd5WtJuqYXcKMuYA": {
    "date": "9/20/2013",
    "text": "I'm a regular here. Lately they've been inconsistent with their sauce and toast. Sometimes it's really salty. Other than that, the chicken are always fresh and moist.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5CLdqfMZtg8h4jx2CFl9g"
  },
  "KEUaOHKUKrreLkOW9ed-kA": {
    "date": "12/27/2010",
    "text": "Raising Cane's is legit. I hit up this location at least once a week if not more. I have a problem. I don't know whether it's the Canes sauce or the hot, juciy, plump chicken fingers. Or maybe it's the fresh, crispy fries. Everything is fresh and delicious.   Anyways, I always get the same thing. Caniac combo; no toast extra cole slaw. Instead of 2 Cane's sauces, 1 cane sauce and 1 honey mustard. Canes sauce has a little kick too. And for my drink I get the unsweetened ice tea and put my splendas in. I don't need the extra sugar from the sweetened tea. Trust me, i'm fat.  Most of the cashiers know my order by heart. David is a great worker there. We always have a good conversation about life. Customer service is always A+++ here. Asking if everything is ok, or If I need something. The place is always spotless too. They are always wiping down tables or cleaning the soda fountain and ketchup area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2GMLEtDo0W3xPI8_hbK2rw"
  },
  "bq3doGXMvC2X2LwMeezaxQ": {
    "date": "8/15/2011",
    "text": "If you're in the mood for chicken fingers, Cane's is the place to go for a quick and awesome meal!  Me and my husband usually get the Caniac to share.  Its typically just the right amount of food for us.  Comes with 6 fingers, fries, two pieces of toast, coleslaw, and a drink.  6 fingers might not seem like much to split between two people, but with the sides, it makes for a pretty fulfilling meal for two people.    The fingers are always tender and juicy.  It has the perfect amount of breading and is never really greasy.  Their fries are nothing just fries and the coleslaw is just coleslaw.  Their texas toast is definitely something to mention.  It's awesome.  Its toasted so perfects!  I like to take a little bit of the toast, wrap it around a piece of the chicken, and dip is in the sauce.  The sauce is one of their biggest selling points here.  It's like a spicy mayo peppery sauce.  Goes hand in hand with the chicken fingers IMO!  My suggestion would be to eat there.  The food tastes much better fresh and doesn't get soggy like it would if you took it home.  Plus, refills on the delicious sweet tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHFuMHQBLuQ3TtkWwx1bmQ"
  },
  "tksHXmJ61LbJ8Tdia0PoGg": {
    "date": "5/30/2011",
    "text": "Just ate at a buffet a few hours earlier. On my way home I still had the munchies. got myself some Cherry on Top frozen yogurt and then saw Raising Cane's. I was feeling some chicken fingers, the caniac combo with sweet ice really did the spot. it filled up whatever room i had left and more. Nice and clean interior, seems like a good place to chillax after long day. i probably could have just gone with the box combo but you know how it is when there's a big picture of food in front of you, i wanted it. i always get huge portions at Raising Cane's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vWP8-aQX0rYJszqkWVL7Ew"
  },
  "UkSnN7GQrVj6IUvTWG8TBA": {
    "date": "12/4/2013",
    "text": "Love Cane's!!  Love the chicken, the bread, and the Cane's sauce!  Service is always good, even in the drive-thru!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "42LUxWiXgD6P4FHYZ3K9tA"
  },
  "W2ZWsC-Z-Rc91a8psEvvRg": {
    "date": "9/29/2010",
    "text": "I was never an avid chicken finger enthusiest.......until I moved to Vegas and discovered Raising Cane's Chicken Fingers!    What more is there to say?  The chicken is cooked to perfection.  The breading is light and crispy, not heavy and hard like others I've tried.    Another plus.....crinkle cut fries!   May not sound like a huge deal, but I've found that the crinkles in the fries increases the surface area which allows them to carry copious amounts of ketchup.....I like ketchup.  The toast was good too!  The downside of the meal was the slaw....but I'm not a fan of slaw anyways.  I come here at least twice a week, and do not see any reason to stop.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "EMhd4Qe4zMq1iMJiGxqBUA"
  },
  "PaCkPCk_5ZhjwkN0agH5AQ": {
    "date": "9/6/2012",
    "text": "I absolutely love this place. I just heard about it maybe a month or so ago and now I am always here! The sweet tea is incredible!! The fried chicken fingers are incredible! The Cane's sauce is incredible! I love this place. The chicken sandwhich is surprising better than you would think it would be. A little messy but delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0aQKQVqcGM_uIw3ICY4ERA"
  },
  "FGGXbCFHsuwvtLuUjDjYAA": {
    "date": "7/6/2012",
    "text": "How does one screw up chicken fingers?  You're probably thinking dry, overcooked, not enough meat are acceptable answers?   Not to me.  Whether it's at a place that specializes in typically plump, tender and juicy fingers like Raising Cane's serves or whether I'm at the bowling alley eating a flat and dry piece of breaded cardboard, I usually end up satisfied.  All that being said, Raising Cane's makes a stellar example of these delicious fried treats that I have a hard time resisting.  I almost always end up with the Box Combo, which comes with a generous portion of fries, a piece of texas toast, 4 chicken fingers, and some negligible side of cole slaw.  Do people eat those?  I don't even bother asking others in my party anymore if they want it.   The texas toast usually is a good balance of toasted on the outside with with a soft middle.   The fries can be hit or miss and like a lot of restaurants can depend on if you stumble onto them fresh out the fryer.  The hotter the better.  The chicken can have the same issue, as I've had some moments where it felt like the chicken may have been sitting for a while, but this is by far not the norm.  They usually are hot and fresh as well.  I love the Cane's sauce they provide and like to mix it with the hot sauce to make my own miracle sauce.  I could bathe in this stuff.   Sure I'd have to take a shower afterwards and it'd get in some uncomfortable places.... on second thought, I would not bathe in it.  It's damn tasty though.  Service is typically fast and efficient, and the price is reasonable for the amount of calories, er food that you get with each order.  There should be one of these in every bowling alley.  3rd best idea I've had all day.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "v3YOx9T4jRSw8XP9Rd9H4g"
  },
  "2ebYCbcIWCAdHmXSdHfUrQ": {
    "date": "2/23/2017",
    "text": "It's no Chick-Fil-A i'm just sayin'. This place has chicken strips that are over coated with batter .. I ordered a chicken sandwich hoping for a piece of chicken with lettuce, tomato etc. and I got a huge bun with a couple chicken fingers on it. I can live w/out this place for sure.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zodJ1MZgg6QgCGdEgzmURQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Quick lunch",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zodJ1MZgg6QgCGdEgzmURQ/o.jpg"
      }
    ],
    "user_id": "-SjQXQd-IRfOdUdYYwWGOQ"
  },
  "toYnAHKF7-u-dlfH9D8l6A": {
    "date": "1/6/2017",
    "text": "This Cane's location is near many other good fast-food restaurants so if they are crazy busy, as Cane's gets sometimes, a very short walk or drive will get you to a reasonable alternative.   Raising Cane's pretty much does only one entree item: chicken fingers.  Granted, they have a sandwich but it is just their chicken fingers inside a bun.  Given that they only do ONE entree, it should be good, right?  Well, mostly it's good as long as you don't eat it too often.    The chicken fingers are usually moist and tender but when they are tough and dry (for whatever reason), they are awful.  Unfortunately, this was most the case in my last visit.  Their fries are crinkle-cut and just plain great.  If only they offered other entree items so I could enjoy their fries with a burger or non-chicken-finger sandwich.  The cole slaw is forgettable to me, but I'm not a cole slaw eater to begin with.  Even those who like cole slaw don't like it when the container is overpacked and bursts open when you touch the lid (not an unusual occurrence at any Cane's).  The Texas toast is ok but (of course) bready and really needs to be dipped in their Cane's sauce to be fully edible.  Fortunately, you are welcome to swap the toast for extra sauce or extra cole slaw.  Service always seems to be good and cheerful at every Raising Cane's I've been to.  Perhaps they add a secret ingredient to their chicken to make their employees so cheerful, or perhaps they just love serving chicken fingers.  Whatever the reason, I've yet to encounter an unpleasant Raising Cane's employee here or at any other location.  Parking seems to be okay but I've only arrived at off hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "kkTOV5bnE9hHb5V_zd9b9g"
  },
  "w27br1KA3zOd6D8bRfT-OA": {
    "date": "6/15/2016",
    "text": "Kinda disappointed, first time eating here. Major downside for me is the flavor of these chicken fingers. There was none actually...no flavor or seasoning in the breading. Its crispy on only some parts of the fingers, big no-no for me. I really like my chicken crispy all around. To be honest, even KFC has more flavor and more crispiness and thats just sad. Chicken fingers were pretty big in size and soft however they were also borderline dry. Hence I had to dip into the canes sauce and ketchup like crazy to make the tenders more tasty and tolerable. I kinda regret ordering the caniac combo, after eating my third chicken finger, I couldn't force myself to eat anymore, just too dry, bland, and not crispy :(  The combo came with crinkle fries, which tasted good as long as I ate it with the canes sauce hehe. The sauce tastes better with the fries than the chicken itself surprisingly. The sauce sort of reminds me of thousand island dressing mixed with lime juice. The coleslaw was nothing special. The texas bread, was just toasted bread with butter. Service was super quick and the cashier was nice. Unfortunately, I think this will be my first and last time I'll visit here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YwcAtGQR4Y9xUJsV1tNeJw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Caniac combo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YwcAtGQR4Y9xUJsV1tNeJw/o.jpg"
      }
    ],
    "user_id": "bBxm5CRxNuj1EJpQ4Go0bA"
  },
  "TGHNlvAriYQBNSl57DfIfA": {
    "date": "12/28/2018",
    "text": "This place is the biggest ripoff of 2018 I went there and got 2 orders of the 6 peace caning combos and I paid $26 and I wanted lemonade to drink so that was $.85 cent each so that's another $1.70 sorry but this absolutely BS casino prices I'm not cheap but I hate feeling like I'm being ripped off so I will NEVER go there again",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cI2uiD-drtpFY9q5NhJg5g"
  },
  "s4c4RqoChDfD8ctqeJQQqA": {
    "date": "1/7/2016",
    "text": "I think it was good but it didn't jump out to me as much as people hyped it up to. The chicken is a lot better coated and fried compared to most places. It's crispier and the chicken is juicy.  The menu is short with 4 items on it but there are some sides and you can order party platters for a lot of people ( or yourself ). When we walked in, the girls behind the counter were a playing around with the cook and didn't even notice us until one of the girls ran out to check the counter. It seems like kids were running the restaurant and the cook was rolling with it.   I think I'll choose a different place to eat next time I'm hungry. The restaurant is clean, so that's why I gave it a star, the chicken was nice and crispy so I gave it 2 stars.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "h0bzmbcTRO9R6fJYbxqWqw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h0bzmbcTRO9R6fJYbxqWqw/o.jpg"
      }
    ],
    "user_id": "rqb5abV146wcU-Z7JxfEIQ"
  },
  "vUzsmrmHUqTafk-pBo1_zQ": {
    "date": "9/18/2018",
    "text": "The food at Raising Cane's is always on point. Today I got excellent customer service to go with it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cavduh4AT8oNAQ4PH6uivQ"
  },
  "zaLXYB3odWBxf79fLGeGXQ": {
    "date": "1/16/2019",
    "text": "Food is always good at Canes but the thicker brunette working the counter tonight isn't very pleasant.   Customer service and being friendly to guests is what makes you or breaks a restaurant when there are so many options in Vegas.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xitHnt9oqD-nZoq7zlXjhw"
  },
  "-VSEjpsnYqWXP4kTMt4r3Q": {
    "date": "12/4/2016",
    "text": "Been a fan of Raising Cane's since moving to Las Vegas. The menu is simple - you either pick chicken fingers or the chicken sandwich (or both). I usually get the box combo, which comes with 4 chicken fingers. Sometimes I'll get the caniac combo (6 chicken fingers) and share the extra chicken with my 3 dogs! They love it. I always skip the cole slaw and ask for more fries. The chicken is always great - crispy on the outside and hot and tender on the inside. The crinkle-cut fries are usually pretty good, although once in a while they don't cook them long enough and are too soggy. The sauce is tasty and I usually am too full to even take a bite out of the Texas Toast. For those of you who don't know, you can ask to have the toast \"BBS\" (butter both sides, it may taste better that way).  I have never ate inside the restaurant at this location, but I go to the drive-thru. It's always so crowded. Also dislike how this location is on Rainbow Blvd, where the traffic is really bad. The employees are friendly and repeat your order back to you twice, once after you order and again right before you pay just to make sure they got things right. That's great customer service for a fast food place!   Every year during the holidays, they sell a plush puppy to support local pet organizations. This year its a white elephant puppy, I just bought one today. Still hoping that Chick-fil-A will eventually open a location on the Westside, but until then I will be back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "FOoN3DJzDUnl4EAQaTJIGg"
  },
  "Shx_x2TUe0I0uGv7GisqkQ": {
    "date": "5/10/2017",
    "text": "Cliff, the manager is the BEST! Our eight year old picked Raising Cane's for his birthday dinner. Cliff and his crew went ABOVE & beyond to make it the  best birthday EVER! They even surprised us and sang happy birthday! They were super patient & great with us!! This is the BEST spot to eat! Food was amazing also! Thank you Cliff & crew! You are AWESOME!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DrltJkO73xw4ZrXd33XIwQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DrltJkO73xw4ZrXd33XIwQ/o.jpg"
      },
      {
        "img_id": "UrSurEZ6JKYmDTTCFGLNkA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UrSurEZ6JKYmDTTCFGLNkA/o.jpg"
      }
    ],
    "user_id": "TEu0-O9zELyZZcNdFEehEg"
  },
  "qL19ZjFhU00Rjhan0joZMA": {
    "date": "12/3/2016",
    "text": "This is first time I have been here and it was quite busy inside.  The drive thru was even busier as it wrapped around the whole building.  We ordered and got our food within 5 mins, they actually bring the food to your table. I thought a chicken fingers place, just another fast food joint serving mediocre chicken.  But to my surprise, this place actually makes excellent moist and tender chicken fingers with just a thin layer of breading. It didn't taste greasy like most deep fried foods.  Each chicken finger is a good size and oh so fresh.  We ordered the Caniac combo which came with Texas toast, coleslaw, 2 of their signature dipping sauce and large drink.  Not bad for under $9. I am a fan and will definitely come her for my chicken fingers fix.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "wJI41zozjjKejNFylsm7ow",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wJI41zozjjKejNFylsm7ow/o.jpg"
      }
    ],
    "user_id": "cImvLb3Wvd5EZ8SRjKAPsw"
  },
  "mB-fBi2ZglTyooE4PugbnA": {
    "date": "8/1/2018",
    "text": "This is no mere junk food! Quality chicken breast lightly breaded and crunchy fried... Great service, clean facility.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeHbv0ZXjTWQ1CrAHcblZQ"
  },
  "xIY-J8KosF5E1CrHAOjPJg": {
    "date": "12/14/2016",
    "text": "So when it comes to this location it's not my fav . The parking and location for this location is not ideal. Especially on a weekend, good luck getting a parking spot if you are planning on dining in as we usually do and watch on the pedestrian traffic and drive thru traffic.  The service I get here is sometimes on point and sometimes it's not. Chicken and sauce is always 100% though and that and the sweet tea is why we come. However this visit the sweet tea was a huge disappointment. It's about 5:00 on a Wednesday and the tea taste old and not as sweet as usual. I have never once had to add my own sugar and I had to.... and it just didn't taste good. We poured it out and tried for the coke and that was not a crisp refreshing coke taste. We reported to the staff that it didn't have enough syrup and they said it tasted fine.   In case it had been just me, I wasn't going to say anything but I had watched two other people pour their coke choice into dispenser as well before reporting it to the staff. Saw the manager try the coke and say it was fine.  So besides the disgusting beverages it was good.  We went to Carl's Jr. to compare and make sure we weren't crazy and huge difference. Wish they had done the same or changed whatever or added whatever to please us and would have gotten a higher rating and maybe other people wouldn't have poured out so much Soda.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hI3cRw-RpNwVoJdlYxl65w",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Ice mountain from people pouring out their soda",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hI3cRw-RpNwVoJdlYxl65w/o.jpg"
      }
    ],
    "user_id": "uvkN1gf9VyVArxB-8qAaoQ"
  },
  "JwT7upQoUFUKSdfIwj1FHw": {
    "date": "7/23/2018",
    "text": "There was a mixed up with my order (wrong order) st the drive through. I did not get a receipt since it is just a waste of paper and i dont save my receipt anyway so I could not show them my order. The manager on Sunday was very kind and professional and exchanged my order right away. Their chicken finger is amazing and the sauce goes so well with the fried chicken.. even with the fries!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggwxftIvn4dv2xyc_9jfmw"
  },
  "PYT_M0PBlENZCCMe8tqhEw": {
    "date": "4/19/2018",
    "text": "This is not the first time I received my order wrong and not like doing a survey will help it because I did in the past and didn't receive any feed back. I ordered extra fries and didn't receive them. The fries I did receive were broken and looked as if they were scraps. Honestly just annoyed, especially when I'm hungry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "k8gIuQHuUYdfy4iUWGw7Eg"
  },
  "wX-TxLIbQ4j6dWG7OsvwHA": {
    "date": "5/2/2018",
    "text": "I like Cane's but at least every other visit at this location, they give you fries that are soggy, wet, and frankly don't look appetizing at all. Not sure we'll be going there anymore for that reason alone. Chick-Fil-A never has that issue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0RS9T_2NPdt2NniR08CL8Q"
  },
  "cHdpr11_NWzdSn-zdrxlGA": {
    "date": "6/5/2018",
    "text": "Amazing people and the managers are awesome. Been coming to this place for I believe 6 years when we moved to spring valley. We come here at least 6 times a month. Kind of upset with an issue that happened about week in half ago. Order my usually caniac for me and husband. Was missing a finger they were so small, fries were way too crispy our toast wasnt bbs and instead of sweet tea I somehow got coke. I never ever keep receipts they never mess up not in 6 years ive come here that's how awesome they really are. We go back and told because we didnt have receipt they couldn't do anything even though the girl recognized us from not even hour ago. They pretty much didnt believe us and I felt like I was a liar to them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6NX-rbfWtyCoTNFLS4S7A"
  },
  "muTjcPrAIvtAHvY4RdrWEA": {
    "date": "10/17/2016",
    "text": "So unhappy right now that Utah does not have Raising Canes. The food is good here.  It's the perfect semi cheat meal. They're deep fried so fat and calorie content are high, but if you can convince yourself otherwise.  They are chicken breast which is very high in protein, then that makes it ok. I guess? Just pass on the fries.  Wait.... The fries are good too! Just eat here. Worry about burning the calories later.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ap1mDOjR9-XU9en9UM4m4g",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ap1mDOjR9-XU9en9UM4m4g/o.jpg"
      }
    ],
    "user_id": "qvin_pYaNyLidXR3N2T27Q"
  },
  "I5Kd7hqkz-oRQs0Ssjo2xg": {
    "date": "6/17/2018",
    "text": "Staff is friendly and courteous, place is very clean, food is delicious, tea and lemonade machines are always full.... a well oiled machine! I believe I ordered our food from Octavio and he delivered it to the table too. Thank you for the great service!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6vdAvRZtRMz8UdmG_xIFTQ"
  },
  "qjsDQ-GT9z_rKH0O48ZRcQ": {
    "date": "8/29/2017",
    "text": "If I could spray canes sauce as a perfume every morning, I probably would.  If it was socially acceptable to bathe in canes sauce, fill up the tub.   If you could swap out my blood for canes sauce, I would probably die.   But I'd be willing to try it.     Love how quick they get the food to me.  My husband and I shake a caniac combo.  He's a teacher so we get 20% off and it comes out to about $7.50.   Not bad for two of us to eat.     FYI- You can swap out a cole slaw for a Texas toast of bonus canes sauce if you want.  We always get on that so we both get a toast.     Fries aren't mine blowing but I do like them a lot.  They are the crinkle cuts if you wanted to know.   They are fresh and go well with everything.   Fingers made to order.   Always hot, always pretty juicy.   But a little bland to me.  Without the sauce they wouldn't get these taste buds out of there seats.    Staff is always nice.   Noticed that sometimes they slack on cleaning the tables.   And when they do, they shoot the cleaning spray recklessly and it goes all over.    Always a winner for a quick meal that tastes good and won't break the bank.  Just slightly clog those arteries.   So do yourself a favor and eat some veggies tomorrow after your canes today.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NXn0RBMGCkKN_lIy7vkmIw"
  },
  "RfF_S1uLo9EtuOtuB7kuGQ": {
    "date": "6/17/2017",
    "text": "I seriously love this place. Chill place to take my son and eat some good food. I never liked fried chicken sort of food ever before trying Canes. I now go here like once a week. The chicken is always juicy and the sauce..the sauce is so good. I could eat buckets of that sauce. The fries are great and the to-go ketchup packets are awesome. You can squeeze or dip(it's the little things in life...). I really like the lemonade, but usually wait until the ice melts a bit as it is SUPER sweet. My son loves it though. The garlic bread is on point and melts in my mouth as well. Overall, just love it. It gets really busy sometimes and they close on most all holidays so their employees can have time off. Sign up for their rewards program and you will get emails for free boxes.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "NsHeN5dKRmYfJTmTxMITmQ"
  },
  "pRkgHA6Sb1oa071TiJGeHA": {
    "date": "3/11/2017",
    "text": "Wasn't sure what all the hype was, but totally get it now!! Best chicken strips I've ever had!! Sauce they give you is amazing and I see why they charge extra for it. Service was friendly. Can't wait to come back! So good!! A definite must try while in Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N2wlBZ5P0KUr_DOIfI1qUg"
  },
  "s9fkw1PlnNU5wz-Pgct88w": {
    "date": "4/7/2017",
    "text": "Canes never disappoints. I go here at least 3 times a month! The cane sauce can't be beat, and don't compare it to Chick Fil-A. There two totally different chicken strip joints! All I gotta say is don't be so stingy when I ask for Louisiana Hot Sauce. 3-5 packets doesn't cut it for a Caniac! Fork em out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ex5yG8gpjLnDi3wyrG_2sw"
  },
  "R7bDEOr5miZ3F4d5MMbxfw": {
    "date": "12/16/2015",
    "text": "This was my third visit to this location. The first two times, my only complaint was that it was WAY TOO LOUD in there. The music being turned up forces everybody else to scream at each other. Before you know it, it's a headache with a side of chicken.  One EXTREMELY good thing is that they clean CONSTANTLY. The lobby never lacks for attention and they clean, clean, clean, behind their customers. Nothing more annoying that trying to find a seat only to see dirty tables. Not at Cane's. Also, whoever trains these kids knows their business. They are positive and professional. Very nice.  The food - Let's be honest, it's fast food. So, people need to temper their expectations with a little reality. Having said that, I like Raising Cane's. I wish they had barbecue sauce, but I can live without it. I like their fries and I like their chicken. I am quickly becoming a \"Caniac Combo\" dude.  Why the two stars? Well, this visit the chicken tasted of burnt grease. Really REALLY bad! I've worked around enough restaurants (and Lord knows I've eaten in enough) to know when the grease hasn't been changed in the fryer. This is a rookie mistake and frankly, ruined my entire meal. Gross, gross, gross. Now, because of how meticulous these guys are about so many things, this was probably a one-time oversight. So, I'll be back. If they fix it - I'll adjust my review. If they don't -  this guy is getting his money back. Period.  Please fix this. I like this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9qeb4Z0BfIJ9Uz62TR2foQ"
  },
  "A8Rlteg67ncAU4Tp_1q4jA": {
    "date": "5/21/2017",
    "text": "Thank goodness for Cane's. Service is top notch. Food is outstanding. They even open at 9am for an early chicken finger fix. The best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pT5Vo7PCIpmxclsyUprV_w"
  },
  "zwRah3aNOs27pO8OwsKAtw": {
    "date": "4/26/2017",
    "text": "So, I had a long day at work and I got off around 10:50 and I was starving! I raced over to canes and my card didn't swipe! :( the girl got her manager and the manager said \"oh, don't worry about it, it happens to everyone.\" And I got so red.. I feel so bad! But they treated me nicely! I'll definitely have to go in and give them a great tip next time or something. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_Uiit3gJdBsc1Ie6yFsmQ"
  },
  "orurU3Xp7ZBC3JJ6SZa-AA": {
    "date": "3/18/2014",
    "text": "Dare I compare to Chick-Fil-A?!?  Raising Cane's is similar in deliciousness to Chick-Fil-A but they have garlic bread! You can make a garlic bread sandwich! I always get the 3 piece combo, along with their special sauce, and coleslaw - I'm in heaven. LOVE LOVE LOVE Cane's!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ukJIYNNYujvZa5bO4ONvPQ"
  },
  "iKvUjNug7seJNiQ5QF_gwA": {
    "date": "3/19/2016",
    "text": "I love chicken strips, especially from canes, especially with their canes special sauce. You can't get fresh chicken strips with good sauce and a cup of lemonade anywhere else.  The price is a bit high, but they have great service, great food, and great atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e3T9PP79lQCfu5luDoJDIw"
  },
  "StA6NsrPTL3sdUTA75_KcQ": {
    "date": "4/3/2017",
    "text": "My daughter and I visited this location last weekend after a baseball game. We were greeted by a super nice employee in line in the drive thru that chatted with us about hating the Cubs lol and gave us free samples of the lemonade (amazing by the way!). Anyway, went home and thoroughly enjoyed our dinner then after the game the next day we decided to go back because we were so impressed with the food and service!! Saw the same gentleman in the drive thru again, made fun of us again lol, He gave us a card that we promptly lost so don't know his name but he is the Asst. Manager. Kudos to you sir for the amazing customer service! I hope your company appreciates you! You have won us over for sure! We will most def be back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GY9RgQrmE3RkpwJmF1pezA"
  },
  "TK2O36MNkXKUOtf4DftqUQ": {
    "date": "2/11/2017",
    "text": "I rue the day I discovered Canes!! Have lived here 3 hrs and never once had any interest in what this place was, but seeing as the drive thru line is Always wrapped around the building...stopped in. OMG-The best chicken tenders-fast food or otherwise I've ever had-light, crisp, not greasy, so fresh-real chicken! And the crinkle fries-my fav cut of fries-so good!!! Fresh squeezed lemonade too!! The staff is super friendly and helpful-almost like family owned feel. I need to forget this place-could eat these every day!! Bad bad!!  *Tip-don't wait in the drive thru-take time to park and go inside-way faster!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGSUC1LJLOrR4iN4BauTSg"
  },
  "PFxxvsP93mjh_4-5mDdnUA": {
    "date": "2/12/2016",
    "text": "Whenever I'm craving some chicken fingers, french fries, Texas toast, and sweet tea I come here!  This location is especially busy during lunchtime, but service through their drive through is quick, customer service is great, and I have placed a multitude of orders from a single box meal to large office orders to feed an army and have never been disappointed.  Keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eEa2Az1lVfyDf416kaZBZQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. French fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eEa2Az1lVfyDf416kaZBZQ/o.jpg"
      },
      {
        "img_id": "2b_o1I1THP0f1G7FR7HVAg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Party trays of chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2b_o1I1THP0f1G7FR7HVAg/o.jpg"
      }
    ],
    "user_id": "CkqT3yGUeM_9vSbFES_O5w"
  },
  "O0Oe8C2kekGsfyruV5KyIQ": {
    "date": "2/27/2017",
    "text": "Fast and speedy service and always very friendly. Only reason it's not a 5 star is because they don't give you enough Canes sauce. Other that it's my go to fingers spot :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1UZ77YzGbA2FHPqie95vpg"
  },
  "4ueiEZoK0lERzbs-Fcq6xA": {
    "date": "9/15/2015",
    "text": "I've been to multiple raising cane's & this is probably the cleanest of all the ones I've been to.   I usually just get a 3 finger combo since anything more than that is a little too filling. I'm not really a big fan of toast but theirs is really good! The chicken is always battered correctly and their fries are amazing. The sweet tea is really great too!   The workers are a hit or miss sometimes. Sometimes they're nice & sometimes they're not. Lol",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WPcEBAbrPZxvCGlvH9XLsQ"
  },
  "kf3jpUA4ToDMxzEPhjifGg": {
    "date": "1/1/2017",
    "text": "Love the older guy with the mustache that works here. He has such a great work ethic and attitude and he will be cleaning the tables and scrubbing the floors while singing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bjxqhJy19cKeEt7ZxXs3lA"
  },
  "DwSooIkB3u8bDhrR-ZVkgA": {
    "date": "2/11/2015",
    "text": "This is one of my fast food guilty pleasures. Crispy on the outside and tender and moist in the inside chicken strips, crinkle cut fries, & Texas toast all dipped in Cane's special dipping sauce (get an extra one). Wash it all down with their sweet tea. Service is always friendly. Their simple menu and great service for a fast food joint reminds me of In-N-Out. The only reason I don't come here often - I feel ashamed and fat afterward for devouring a fattening, unhealthy meal. LOL. It sure is satisfying and tasty though so it's worth it. Just go harder at the gym the next day!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "HDOffsqzhoZ96gz6brneHQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Box combo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HDOffsqzhoZ96gz6brneHQ/o.jpg"
      }
    ],
    "user_id": "TS4RfxKny-c8QYcnMpfkiQ"
  },
  "MxFfrpAIcdCXZwAtx5fjBQ": {
    "date": "4/12/2015",
    "text": "...my friend came to visit me and bought me tenders and fries....the sauce is BONKERS amaze balls....so Yumma....I almost wish I never had it cause now I'm gonna be a bigger fatty from craving and wanting it all the time....seriously fresh and hot and THAT SAUCE!!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Xb4aKpOlHkp9dmgTa__Q4g"
  },
  "zJu6C7OAdSRswVE3tMZY6A": {
    "date": "4/15/2017",
    "text": "Excellent service and consistently good food. Andrew, the manager is a great asset to them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQcMuIWh8vHBYm9i7Z4Vvw"
  },
  "z17CyI6uo50TcSrR3Y5tJw": {
    "date": "2/15/2017",
    "text": "Mike is managing this store very well. The venue was clean and the chicken was delivered steaming hot! He and his staff had checked on our table multiple times during our lunch. This kind of service does not go unnoticed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uk4oFeDGDGWcYec6s3RAyw"
  },
  "vznJL0fG7dyOaYvK1COYCA": {
    "date": "11/27/2015",
    "text": "This is our first time at Raising Cane's.  For us, this was a lot of food.  The menu is simple - chicken fingers with fries & toast.  There were 3 of us and we each ordered a 3 piece fingers combo, which consists of 3 chicken fingers, their sauce, fries, a piece of toast.  This was a lot of food for us.  ~$20  At most, each of us ate maybe almost 1/2 of what we got.  Seriously, we could have ordered the 6 fingers one for the 3 of us - 2 adults and a 15 year old. Had we done this, it would have been about 1/2 the cost.  We didn't know but we know next time we can just order one 6 fingers for the 3 of us or if we have our son, maybe two 4 fingers.  Simple menu.  The place was teaming with people, but we were able to get a seat, so not packed.  Service was fine.  Food was fine.  We went through the drive-thru and then realized we should have ordered inside and just ate there.  Love their ketchup packets, but they are big and it can be wasteful if you just want a little ketchup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "53JHz4dbMg9JfuzakOZK4A"
  },
  "wXCaz7QsId0yosmgAMi_SA": {
    "date": "10/8/2015",
    "text": "I have been coming to this Raising Canes for a few months now and service has always been great and friendly. Food is always fresh and hot. Never disapointed and neither will you. By the way do not leave here without trying the sweet tea. Its the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zFbd0EqOsLVKjcBX3bCDtQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. This is their basic and delicious menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zFbd0EqOsLVKjcBX3bCDtQ/o.jpg"
      }
    ],
    "user_id": "Fk8c0UqT0cTBp265DHfwSQ"
  },
  "Ce7cqSF5v_PpuAjTUjn_1A": {
    "date": "11/27/2017",
    "text": "2weeks ago their Caniac without a drink was $7.89, but today they charged $9.03.. a 15% increase.. what a ripoff to us on a fixed income.. I wish ss would give us an increase like that... shame on u raising canes",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIDgEpFwDSLCplCeM_ey-Q"
  },
  "OaSn9Sd9zuFMsaLA2bhs0w": {
    "date": "3/27/2017",
    "text": "Why don't we have one of these in San Diego????? I love CANES! We were in LV for a weekend and this was one of the stop before we head back home to SD.  It didn't disappointed.  I love their cane sauce and the chicken was moist and not too much batter.  I prefer Canes over Chick Fil A.  The price is better & the chicken tastes better.  We need this in San Diego!!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AvdjhZYJvYeHknwM718_RA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AvdjhZYJvYeHknwM718_RA/o.jpg"
      },
      {
        "img_id": "uJIrI50sOS_x2YGztKysLQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uJIrI50sOS_x2YGztKysLQ/o.jpg"
      },
      {
        "img_id": "EWSgL2uPGtaM9kwbxU4COw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EWSgL2uPGtaM9kwbxU4COw/o.jpg"
      }
    ],
    "user_id": "JTnEvxSPaKYjjHyYsUsB1Q"
  },
  "laYH0STQ0D_NsLBp0LoOVw": {
    "date": "11/22/2017",
    "text": "Fried chicken is a hot topic in some circles... and I am voting to say that Raising Cane's has the best fried chicken strips!   The chicken is white meat, battered lightly and fried. It comes out hot and juicy.  I dip mine in their honey mustard, as I'm not a fan of their Cane's sauce.   There's a drive through if you are picking up to go home, but so you know, the chicken tastes better, fresher and crispier in the store.   If you sign up for their loyalty program, you can get a free combo.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 8
    },
    "photos": [],
    "user_id": "vxR_YV0atFxIxfOnF9uHjQ"
  },
  "o3oXSUAf1bhMaY8g0_8Z3A": {
    "date": "3/30/2019",
    "text": "They have gone down hill hard.  The food is always rushed and not done. The prices have gone through the roof. Will not visit Canes again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYPzwOBsZZzuWYkOCAyllw"
  },
  "fyL2zki70LCP6_X5cIqIEA": {
    "date": "7/31/2018",
    "text": "I've never been in the restaurant but the drive thru is usually busy but the line goes fast! The menus is simple which makes ordering very easy. The chick tenders come plane but you can ask for hot sauce at the window. I always recommend ordering extra Canes sauce to dip your crinkle cut fries into!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZtWi1WgfiiBlKmBA8VS4NQ"
  },
  "VxdDV60ZIMmye6nseM3TrA": {
    "date": "6/21/2019",
    "text": "This location decided to make their lemonade with the tap water. Absolutely disgusting, I can taste the difference you can't pull a fast one over me Rainbow location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhhyPP2GD7OCrxKQTG8Rtg"
  },
  "io29_xa8ShZskcZmLAlZ2g": {
    "date": "7/10/2018",
    "text": "7/7/18 Family from San Diego came by for a visit this weekend. Before heading out to shoot some rounds we decided to take them to Raising Canes which they haven't been. Not to mention they don't like chicken fingers due to their dry meat. That's what I said at first but Canes have proven me wrong. I told them about their juicy chicken fingers and to my surprise after that first bite, they were in complete shock on how good they were along with fries, toast, and Cole slaw. Haha, they look forward in coming back if they are in town again. Thank you Raising Canes. From day 1 you guys have never disappointed me...yet!! Happy Eats!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jtoi5k9Pw_L4MOP4SfJTNg"
  },
  "JvYq44DREawyITpLWX2-3A": {
    "date": "5/8/2018",
    "text": "I go to this Cane's a few times a year, and I love it! Usually I eat a mostly vegetarian diet, but every once in a while I make an exception for Cane's. It's that good!   The lines here sometimes can get long (I've never seen one of their locations that doesn't occasionally have a long drive-through line) but the staff works quickly and the line always moves pretty fast.   The fried chicken is great, much better quality meat  than most chicken places. I'm usually not a fan of crinkle cut fries but I like them here! Probably because they come with the amazing Cane's sauce. (I always get an extra when I'm splitting the Caniac combo with my husband.)   Also, it's really nice that they offer 15% discounts for teachers that show a school badge. This year they even gave free box combos to teachers on Teacher Appreciation Day! It's a really nice gesture!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "n-Hit0Y3O6FxTiEhdEEsZw"
  },
  "Ejf6GNY4Bc9R5BgIj6MuXw": {
    "date": "4/5/2018",
    "text": "I realize that I am a fan of chicken with the bone in. I prefer all white meat but not really in chicken strip form. It was my first time here and it was pretty okay. I had high hopes since everyone always says good things about their chicken. I ordered a regular 3 piece chicken combo which comes with garlic bread, fries, and a drink. Their Cane Sauce is actually pretty good and the perfect amount of flavor to add to the chicken. For the price, it is decent for the amount of food you get. I would actually prefer Popeyes over this knowing I can get some juicy chicken from there.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "F0gIIhFbHKEhpE-2UP6NNQ"
  },
  "wWzurT7i1v9aLQPbmQhc6w": {
    "date": "9/23/2017",
    "text": "I've been here quite a few times over the years my friend is obsessed with this place! Honestly I think it's a little overrated there's nothing spectacular about raising Canes. The chicken strips are decent but they are quite small. They give you a tiny portion of fries when you order the combos I thought it was a kids meal. The sauce is ok but nothing amazing I think it's just ranch mixed with ketchup. I do like their sweet tea and fresh squeezed lemonade. The prices are decent so that's always a plus. There is always an extremely long line through the drive-through so I prefer to go in. This is the Las Vegas is version of Chick-fil-A. I will come back if a friend wants to go but other than that I can do without canes.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "7-c2nUE8qaKSzCtaZ6O1KA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Box combo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7-c2nUE8qaKSzCtaZ6O1KA/o.jpg"
      }
    ],
    "user_id": "y4xrOPXEB75lJaLjr7Rtaw"
  },
  "Dhc68nGRrrE2zcnCckfHaQ": {
    "date": "3/12/2018",
    "text": "These guys messed my order up TWICE! I didn't get bread today, and yesterday they forgot my drink. I'm unsure of their business practices.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Wp6OQ8iAYWBoU_ac8l4UA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2Wp6OQ8iAYWBoU_ac8l4UA/o.jpg"
      }
    ],
    "user_id": "M4YEi9-KcBV5qJmG1_LGdA"
  },
  "a3re2EXhd8xfhGrZ6qkegw": {
    "date": "1/5/2017",
    "text": "Chicken tenders from Raising Came are some of the best out there! We were leaving LV and needed something to eat on the drive back home. And so I got a kids meal ($4.50) that came with 2 chicken tenders, their special sauce, crinkly fries, a sippy cup with a fountain drink, and a lame sticker activity. The tenders are a little small but who cares they're so crispy and good especially with that bomb sauce. Even though I'm supposed to be a grown adult they still let me get it and this served as a nice snack.  If you just want the tenders you can buy them in bulks of 25 (so 50, 75, 100+) a la carte. Or if you want a combo they have those too that come with their special toast and fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tiNk37ynxOJ2g-U_J3Bi8w",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Kids meal without the sippy cup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tiNk37ynxOJ2g-U_J3Bi8w/o.jpg"
      },
      {
        "img_id": "idzjkgmKBzVQbbS_qBCqkQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/idzjkgmKBzVQbbS_qBCqkQ/o.jpg"
      },
      {
        "img_id": "Kyr86FhzUIBHejE7onS0rQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kyr86FhzUIBHejE7onS0rQ/o.jpg"
      }
    ],
    "user_id": "pE_rKN0nhg1QRbr9dxiDew"
  },
  "b76aSnusS-zgAy0ZmPJTJw": {
    "date": "1/28/2019",
    "text": "I decided to go to Cane's on a whim and when I initially placed my order and received my food, I parked in the parking lot to eat before driving home. I opened my box and it had everything just the way I asked for and every employee that spoke to me or even looked at me through the drive through window all had a smile and had awesome attitudes! This was a great experience and I will definitely be coming to this Canes again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SRau_5vhCXplMmdWzrr6Q"
  },
  "Azw0N9ztY9RUZBBgWVI9cw": {
    "date": "1/6/2019",
    "text": "A pictures is worth a 1000 words. I've noticed they raised their prices and their portion sizes have gotten way smaller.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CSe0nkfBf808E8wjgC7i0A",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CSe0nkfBf808E8wjgC7i0A/o.jpg"
      },
      {
        "img_id": "hLDnWxNGCfeqw3KFzi_pbw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hLDnWxNGCfeqw3KFzi_pbw/o.jpg"
      }
    ],
    "user_id": "pcAHdSx-CvjVWlY6JlfA9A"
  },
  "1NYA9HTWKdGAciAUCLPVTw": {
    "date": "1/3/2019",
    "text": "The food is good quality, but I don't like to be hurried to eat my chicken fingers there are still tables open but the server was done right rude to me! Next time use drive thru!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j5_5UojgJ6NvGdGWaBcnyw"
  },
  "DZGPKk3ZEL0NQd2-B3rTCQ": {
    "date": "5/18/2019",
    "text": "I've tried other Raising Cane's, and enjoyed them. I think this one is trying to stop people from asking for big orders. I ordered the 25 piece, with 12 pieces of bread, and some coleslaw. The coleslaw was very good. The bread was missing four pieces. That made us count the chicken. 22 pieces. DON'T LEAVE BEFORE LOOKING AT YOUR ORDER!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iMffFqMl3TajdXICc5LJ8A"
  },
  "isvyIXm3ZLaxttujMqktZA": {
    "date": "8/4/2018",
    "text": "Today, I went through Cane's drive through, as usual, relieved to see that there was no other call in the drive through. I proceeded to order my 2 box combos and a sandwich combo. After giving my answer of drink selection, I mentioned to the attendant very clearly that I wanted \"no coleslaw, extra fries\" on the two box combos. I waited for a confirming \"yes\" before asking for \"extra crispy fingers and fries.\" Once again I waited to the confirmation \"yes\" before moving to the payment window. To my surprise, my order did not reflect any specification that I had asked even after the attendant confirmed every single one of my requests. It's a shame, I used to love going to this Cane's ever since my high school days, but unfortunately their quality of customer care and food has gone down drastically. If you're looking to get the perfect combo catered to you, I'd venture to guess that you'll have better luck ordering in person. :/",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9bS4dP6jDdW8Ma1anD9Aw"
  },
  "cSPULHw9-TJ718dEbvXcGg": {
    "date": "10/7/2016",
    "text": "Raising Canes reminded of Zaxby's. I think this place is a really great fast food eatery for a quick and yummy meal.  My favorite is their special sauce that comes with the chicken tenders & the Texas toast. Also, if you ever order a meal with coleslaw, you can substitute it for another Texas toast. Yum!  If you eat the chicken tenders without the special sauce, then the chicken is pretty bland. I like to order my food to go and when I get home I add some seasoning to my fries.  I can always count on my food being hot fresh and delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIHHaoF-yyIvBFEOyEQ8Pw"
  },
  "CqlqaYCIWOvS3AzlMnb2Xw": {
    "date": "5/24/2018",
    "text": "This was the first time I've had Canes at everyone's suggestion! It was really really good! The chicken strips are awesome as is the cole slaw and toast. The fries however were all very burnt. The biggest concern I had though is the styrofoam container as it appears it melted from the heat of the chicken! I'm not sure how good safe that is and would suggest a better alternative like paper containers. What fumes or chemicals come from styrofoam I'm not sure but can't be too good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8edirVEzB95QuspnKc4GWA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8edirVEzB95QuspnKc4GWA/o.jpg"
      }
    ],
    "user_id": "HwhFHGgaIF8TQrw98iSv4Q"
  },
  "qAep8zZLU2CtEUwt8jJRgQ": {
    "date": "3/25/2017",
    "text": "They have the best employees. The shift manager Mike, took care of a previous issue by comping our meal today. Totally above and beyond service. I was totally shocked and very well-fed, along with my little family. The caniac is my go-to on the menu, swap out the cole slaw for a toast (butter on both sides), extra cane sauce! The lemonade is so delicious, along with the fries. I remember when I first moved to Las Vegas I used to frequent this location because this was new to me! I would eat it about 3 times a week. Now I just have to be careful as to when I eat it, because this is definitely a cheat meal. I love the staff, love the food and the quickness and cleanliness of everything.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iLTEsZJKCOSFFqu2wvonoA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. For St. Patty&amp;#39;s Day!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iLTEsZJKCOSFFqu2wvonoA/o.jpg"
      }
    ],
    "user_id": "7L8utEpYiVj3pNNjZkQaLQ"
  },
  "WNkaAX5zd-7RwzT6uyXZeQ": {
    "date": "11/6/2018",
    "text": "Renee P, Diamond S, and Coyre C were amazing truly friendly and helpful. The best experience I have had at Raising Cane's and even though this location is out of the way, I will be coming back to this one many more times just because of how friendly the employees were.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YqebeOMbFMtEeiLUKrJLgA"
  },
  "U-VRNE5GZBeK2VzfhHYeAg": {
    "date": "9/16/2015",
    "text": "Love this place! Food is always good, service is great, and the sauce is to die for!Yum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AAbaELuBLDTaWwZUAanFkw"
  },
  "u0UaHKBNS-mCoVlqAn3hBw": {
    "date": "5/29/2015",
    "text": "Wow!!!!  Needed to feed a baseball team.  Antoinet was amazing, happy, and very helpful.  Thanks so much for walking me through it.  The hungry kids thank you too!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aO5vkWQSkpGV4Si72faB_Q"
  },
  "A3f4_0-O0UAV9UcDapC9jw": {
    "date": "11/20/2014",
    "text": "I  always wanted to try this place every time I pass by it but I always get detracted because of the long drive-thru line. But I was in the mood for some chicken strips and something to worth breaking my diet without breaking the bank.  I waited till after the dinner rush was over, which I thought was at 7:30 p.m. I was wrong. I arrive and there was still a line but it moved very quickly and smoothly. I assume because the menu doesn't have much variety. But hey when you establish a business with one main popular item that's all you need (hint in and out). I ordered the caniac box and doubles up on the fries instead of the coleslaw. It was enough to feed me twice! The chicken and texas toast was light and fluffy and did not make me feel like I was eating fast food, which was a plus! The fries could have been better, they should offer another side like mash potatoes or onion rings. The sauce was okay, nothing to crave for in my opinion. I would of preferred a spicier sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I61YSkSsxYWw48GlarYS0Q"
  },
  "jEK6ovWPTZFqO-2zfmah6A": {
    "date": "2/4/2015",
    "text": "Best chicken fingers in town. However, do not go in at lunch time. They told me to park on the front and it took forever to get the food (19 minutes to be exact) if you can look past that, it's the best place in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3i8VO5_mher30m0OcdqD9g"
  },
  "mKUTuMgS6e2RPvczR2HNmQ": {
    "date": "4/27/2015",
    "text": "This has some amazing chicken and sauce! My only complaint is that when you take food to go its soggy by the time you get home because of the restaurant using styrofoam to go containers! They need to get boxes like KFC and places like that have so the chicken and fries are crispy! Other than that. Delicious!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AREm24wH7tXEHC_FKUQIWw"
  },
  "3GP9CMQ32ep5VG0l3Q_6MQ": {
    "date": "2/27/2013",
    "text": "Not sure why everyone is crazy about this place. chicken fingers tasted ordinary for me, sauce is forgettable, fries are soggy, and coleslaw is like the one in the supermarket. the only one i liked is the toasted bread.  Though the store and location is great and neat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5rfRdc8dts77B59FWoyLvQ"
  },
  "g8kwtEKrIhObsFT5q1Gupw": {
    "date": "8/8/2016",
    "text": "So I just went to this canes around 1:30, I waited in the line for like 15 minutes only to get cold food and watered down sweet tea. This was absolutely terrible. Recommend not going there around late night unless you're down for lukewarm food. This canes doesn't display how canes really is and should be ashamed of this location. Beyond disappointed & wasted 15 dollars on the worst after work dinner for my girlfriend and I that we were looking forward to.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtN6p4tNHU4aeu3q63Y7Cg"
  },
  "i82l3623xgdgvhAw48MxOQ": {
    "date": "11/2/2014",
    "text": "The husband brought me here for the first time! Their chicken strips are delicious. Love their fries! Love the tastes of their teas. Friendly staff. We will definitely come back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w2-kUMfhtsd-VmFR7gmj_g"
  },
  "fwkXPUWNXa5RbI5hZxByNQ": {
    "date": "8/24/2011",
    "text": "Raising Cane's is great when you're on a time crunch, but it could easily be greater with better sides.  The fries are so boring, and the coleslaw is a fucking nightmare.  So what keeps me coming back?  Their chicken tenders are always fresh.  I like their Cane's sauce and their Louisiana Hot Sauce packet even more.  Sometimes I get a little crazy and double dip my fingers in both sauce.  It's really wild.  Chicken Tenders are a dollar a piece, but i'll overlook the price since i know i'll be getting quality pieces.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "pDvDLpD7CiMlIebsDPCRSQ"
  },
  "oqUcZ4DtpBhlXMpabhdivQ": {
    "date": "9/11/2011",
    "text": "You get what you pay for when you're talking about Raising Cane's.  It is what it is; they are who we thought they were, haha....  But when you get down to the brass tax, it's fried chicken fingers that we keep coming back for ladies and gentleman.  They do it well and often and I for one will keep coming back.    There is of course the people who say, \"That's all they have?\".  And I usually reply with \"yes, but they do it Oh so Well!\".  So try the chickend fingers my friends and know that it is the one thing that they do, and they are not ashamed of that fact!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "aT_AzbpcsbodNNtFzPqRVg"
  },
  "kpAkZk3LHMApezBfWPrwhA": {
    "date": "3/4/2012",
    "text": "Arnold Palmers with southern-style sweet tea? Check!  Dog treats given out in the drive-through when they see a furball in the car? Yes! Amusing, if cheesy, welcomes to the restaurant?  Indeed! Pleasant staff?  Yep!  Tasty food at reasonable prices?  That too!  When I'm not feeling up to cooking, this is my go-to place for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x2KHPyEmsg0VL3B40-xfDQ"
  },
  "kx4g5v2ORuqpSPSMqgqgwA": {
    "date": "5/17/2014",
    "text": "It's very good chicken fingers surrounded by sucky French fries and sucky toasted bread. The special sauce is good too. I really don't see what the big deal is. They have chicken fingers...period.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hq5en1N5_OKK3Wx6RU2MTw"
  },
  "XA9SpqKyzlaYRPChRYKJeQ": {
    "date": "1/5/2014",
    "text": "My kids love this place. It makes me feel better getting this for them than the golden arches. Im in denial, but a pretty good one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zqk-ye_OHeH_sS1JsdsLgg"
  },
  "vkZsrwoXoJT2XbxLVoj3vQ": {
    "date": "4/26/2011",
    "text": "Raising Cane's never ceases to satisfy my hunger!! I usually get the box combo, which comes with 4 chicken strips & fries, a piece of toast, secret sauce and cole slaw (you can substitute the slaw for another piece of toast =D, which I always do!)  The toast is the best part to this boxed combo!! It is perfectly buttery with a crunch on the outside, and soft and delectable inside! Best bread you will have in a lifetime!  The sweet tea & ice is also pretty great!! Eat there so you can enjoy unlimited refills! HAHA =)",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 13,
      "cool": 12
    },
    "photos": [],
    "user_id": "udpfGxriuoBdWRBdplJl-w"
  },
  "Hh-YISYP9Up88hFR-siADw": {
    "date": "3/9/2014",
    "text": "Eat here once a week. The food is great. The service is friendly. The drive thru is fast. All in all it is a A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kAOAntJRpTevNvjwf8aGNg"
  },
  "Hr2FA4R1_oaxN-FvFHXgNA": {
    "date": "7/22/2013",
    "text": "I had heard a lot about this place from other locals in town.  I was thinking to myself... how can chicken strips be THAT GOOD and what is this supposed CRACK SAUCE that is so good, you must order an extra sauce since they only give you just one?? The food did live up to the hype!! The menu is very small and limited, but that's ok.  You know what you are coming in for when you eat here.  The chicken strips were fresh and good quality white meat.  The \"fried-ness\" wasn't too greasy and made you feel sick from all the oil and grease.  The texas toast was fresh and crunchy, just the right amount of buttery goodness. Crinkle cut fries were on point! and this chicken sauce... HELL'S YEAH!!.. it tastes like a chipotle mayo ranch type sauce, definitely a ranch sauce with a small spicy kick! The customer service was very friendly as well and just a good fried chicken joint!! The take-out line was super busy too!! I will definitely be back to get my fried chicken fix next time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Z0b8ofZM5Q3UZmjAqy0rdA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z0b8ofZM5Q3UZmjAqy0rdA/o.jpg"
      },
      {
        "img_id": "WlDifdtqfk2jY3En5uiv2w",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. The precious crack sauce!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WlDifdtqfk2jY3En5uiv2w/o.jpg"
      }
    ],
    "user_id": "B3b42NmqmcuGgFzOoYuRCg"
  },
  "Mc3GVFzZMU19GMq5oSLBbQ": {
    "date": "10/27/2013",
    "text": "This place can rival Chick-Fil-A...that is how GOOD the chicken is!  The quality of the food is fresh and the sweet tea is the BOMB!  And not only is the food is good, when you use your credit card, they ask for i.d. so you know they make sure there's no FRAUD.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FAjCZoxiGw9HJKueB8YWTg"
  },
  "WBFsx14PuiyMczVKo-WCNg": {
    "date": "8/10/2011",
    "text": "There was a time when I went to Canes 2 - 3 a times week for a month. Oh boy, did I have a grand time. It's different now. Don't get me wrong, it's wonderful.. but my taste buds have become tolerant.. I guess I blame myself. Anything you choose off the menu's gorgeous.. I wouldn't try the burger though.. Save that for In-N-Out later.  You can also swap items such as coleslaw for Canes sauce or extra toast. Which I also do because I'm not a coleslaw-er.. lol",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jzUMLxjcSDN3dR7XWiKUyA"
  },
  "NHQHQ8MNs3BT-Re_1IBwoQ": {
    "date": "3/28/2012",
    "text": "I tried Raising Cane's for the first time today. I ordered The Box...4 Chicken Fingers, Cole Slaw, Texas Toast, and sauce. I also tried their sweet tea....and I like their sweet tea. Just the right amount of sweet yet you could taste the tea. The fries had me skeptical at first but they were hot, fresh, and good. But it was the chicken fingers that wowed me. Crispy outside, juicy inside, and cooked to perfection. And when dipped into the sauce...I was like wow, I get why people come here so much! And the Texas Toast was the first I've ate the whole piece as i usually hate Texas Toast but this was good!   Add in great service and you get a 4 star review that is really close to being bumped to a 5. I will go back and bring others with me when I do!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEvyblFw4I-UsMqgPGYY_Q"
  },
  "XSDc-FjsjrEjXCKpHnLiWw": {
    "date": "11/10/2013",
    "text": "Long story short... They were the best chicken fingers in town, until yesterday me and my boyfriend had it and now neither of us aren't feeling to well... I don't think I'll be back, unfortunately.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xx0-P18egyQ7oH5WBLWf8g"
  },
  "YC18hGlO5rKrMGpLEV7-YQ": {
    "date": "4/14/2013",
    "text": "Well who doesn't like Raising Canes?   I love this location in particular. Very clean and staff is always friendly.  I usually get the three finger combo. 3 chicken strips, fries, toast, and a drink. I have to be honest...their chicken strips are not my favorite. But I do love the fries and toast. Oh! And the lemonade. It is absolutely delicious. So delicious in fact, that you are charged some extra cents for refills. But totally worth it! One of these days I am going to buy a gallon of that stuff. There is also a huge hype over their \"special sauce.\" I think it's good, but nothing too special.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FWYjGKHmbjxrkXROctTGYA"
  },
  "dildazbLlRDDkaPGm2w51A": {
    "date": "10/18/2012",
    "text": "Fun fact:  Raising Cane's the name has nothing to do with sugar cane or pimp canes, it actually refers to the founder's yellow Labrador named \"Raising Cane\"  On with the review!  I work on Saturdays, but only a half day.  Every Saturday after I am finished with all of my work, I drive right next door to Raising Cane's and order the strips and a unsweetened ice tea with a little bit of sweet tea.  At this point, the food is too hot to eat.  I proceed to drive over to Albertson's to do my shopping for the week.  After I park, I roll down my windows, close my eyes and just enjoy the silence for about 30 seconds.  And then I eat my Raising Cane's.  This is my Saturday ritual.",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 1,
      "cool": 5
    },
    "photos": [],
    "user_id": "jX7n6KfNZ22kBh6AHhxRbA"
  },
  "sWhM0iB8VtqE02b3ev1ldg": {
    "date": "9/30/2013",
    "text": "As far as fast food goes, Raising Cane's is top notch. Like In-n-Out, Raising Cane's bolsters a simplistic menu based solely around chicken fingers. Side items include coleslaw, krinkle-cut french fries, and Texas toast. Coleslaw I have never been a fan of, so I typically replace mine with another Texas toast (at no extra charge!) which I absolutely adore. The french fries I am not a huge fan of due to their style. They remind me of the frozen Ore Ida fries I used to eat as a child. The lead singer of this band, the superstar, the show stopper, has to be their signature Cane's sauce. This stuff is the nectar of gods. I have seen some other reviews from this location describe the sauce as 'Crack Sauce', and that is an extremely apt assessment. Wash it all down with a deliciously sweet and satisfying sweet-tea or homemade lemonade and you are good to go my friend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L9XQIqvZ8LZP2RoPe0Zsuw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Box combo + 3 finger combo + Chad S.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L9XQIqvZ8LZP2RoPe0Zsuw/o.jpg"
      }
    ],
    "user_id": "pzMvoRhpuwwC3jHZtZSCeg"
  },
  "BWZjV1fvH-MTbjIC2tEYHg": {
    "date": "2/14/2016",
    "text": "Chicken Fingers and Lemonade are awesome!   The cole slaw is horrible!  It's too coarse and flavorless. It tastes like you're just eating raw cabbage.  They need to make the coleslaw like KFC's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rq9IHT9f9vUM5vFs1hlkVw"
  },
  "UhkZCDSqVUXzhiuatPpfQQ": {
    "date": "10/25/2010",
    "text": "Who would've thought that a fast food place that \"specializes\" in chicken tenders would be such a hit? Well, Cane's did!   I'd say that it's a place that is comparable, if you've ever had it, to Chik-fil-a. The tenders are so full of flavor from the breading to the meat itself. I don't know what they call their sauce but it's not bad, pretty peppery, I like it.   It was pretty cute how they decked out the place for Halloween. Service was good, they were pretty nice here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "77lef7kKkoOVupY-7AmieQ"
  },
  "mwhDxAP3nqf1aqMHVJ_dFg": {
    "date": "1/20/2016",
    "text": "I usually eat at this location. I used to be satisfied everytime but the last 3 times ive gone has been terrrible! 1 time all 3 chicken strips were tiny. The last 2 times the chicken strips tasted terrible. Smelled as if the oil was very old & smelled burnt. Was so gross! I have not been back to this location. Hopefully they get it together soon! I miss the good Canes!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fbd0dLHjXnR5ttFNGfPpiA"
  },
  "UazYT1M3TkhsaYBcYXT09A": {
    "date": "1/14/2017",
    "text": "We are always greeted with a smile and welcomed to Cane's. Customer service is amazing. Food is always hot and fresh. This location is great that's why we keep going back. Thanks Raising Cane's. The Rainbow location is the best.  The manager, Michael, is one of the best crew members and his team is lead through a great example!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MR9krmwz3TUfdVdU-zmqg"
  },
  "Iu-_BRgWW6ZjqF0EgNUAeQ": {
    "date": "6/17/2015",
    "text": "Good Ice Tea and Fresh White meat Chicken Fingers. The Staff is really good but the sauces lack on variety. NO Ranch or BBQ?? And the canes sauce is nothing special. The Texas toast awesome. Cole slaw not so much. Ice tea is great and the lemonade is good. I would come back for sure.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2IZGKF1hZaVfEPZ6D-kXXQ"
  },
  "TKTU1N3ULLVNAVnCkMJAWA": {
    "date": "8/10/2012",
    "text": "This place is so bomb. Their chicken is nice and tender... I never knew ice teas could be comparable but man this place is unmatched!! You can buy their ice tea in jugs too.. Something I frequently do!!   Sometimes I come to Vegas just for canes. Seriously.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "s167Zhf74Yz4SKrJjJFQBw"
  },
  "VWW4jgo5aszlkjoAXRcuIw": {
    "date": "12/15/2016",
    "text": "One of my favorite chicken strip restaurants. Today my fries were a little soggy but usually they are crispy and delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gnXz58PuqIM-dNN013sOGw"
  },
  "0a9BrVtHG32FwLwwqU_0sA": {
    "date": "7/30/2015",
    "text": "Yup - a chicken finger specialty place.  Shall I have chicken fingers or chicken fingers?  Pretty good stuff.  If you are nearby and like chicken fingers just a bit, you gotta go for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1i6KoGjzSkKo4iDZ5LhkEw"
  },
  "_G02KFrep54l_SO3CSdLsw": {
    "date": "10/2/2014",
    "text": "First, TEXAS TOAST here is AMAZING! The best texas toast! This is the best place to go to if you are hungry and want something quick. It is cheap and very filling. The sauce with the chicken is really yummy too. I've only been here twice and both times my chicken were pretty juicy. I will definitely be back when I vacation in Vegas again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "y3IeASQK5ofXeZaoQvuPQA"
  },
  "6m68iJ0Dsq9M3BywO8BJfw": {
    "date": "5/10/2012",
    "text": ".., probably the best chicken strips I've had to this day. A new must stop whenever in Vegas thanks to Adam & Mia!  Combos come with fries, Texas toast & their delicious dipping sauce. Damn good sweet tea & friendly service. We'll be back!  Check it out!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "AiwbmN_DcrtxC9OpERkAMw"
  },
  "hJXDMaJXcpYRyactk7gJdA": {
    "date": "5/9/2013",
    "text": "Solid food (once in a while).... First off I'm not a fries or chicken finger person on a regular basis BUT as a once in a while option (like maybe once a month), I think Cane's is pretty good. I definitely think price is decent and tastes are pretty consistent. Unlike other reviews the \"canes sauce\" is unique and tasty and I do like that peppery flavor.  Slaw is actually on the yuck side (you can sub another piece of butter toast in place of the slaw at no extra charge). It has really no flavor...needs something more it's just Bleh.  Butter toast is pretty yummy but what's not to like its bread and butter.  Fries are ok but nothing special about them.  Overall it's a good meal for lunch at a decent price.   Tip: canes sauce extra is .29",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzPvEodjvLPe-5NvV0U_cg"
  },
  "Ob9GuhfILHDc-JDUTnPbnA": {
    "date": "7/25/2015",
    "text": "It's the in-n-out of chicken! (if that makes sense) It's delicious, cheap, and the service is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYRGy665vewxYxvDq2adBQ"
  },
  "ASgEZPzetlpChlnZq0I2Qw": {
    "date": "9/10/2010",
    "text": "The secret is in the sauce...I wish they came in packets so I can take some home! It has like a peppery ..zingy taste to it . I had the Chicken Sandwich combo that comes with fries and Sweet Tea to drink. The chicken in the sandwich is crispy and juicy and is topped with the sauce. Yum! The fries are also done just right so they are not soggy . I also love the Sweet Tea here .. it tastes just as good as the Tea at Memphis BBQ. The decor here is fun with different movie and music posters adorning the walls. It gives me something to look at while I'm enjoying my meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0TOIbjjUkHXx2V8X1CBNYg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Chicken Sandwich box combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0TOIbjjUkHXx2V8X1CBNYg/o.jpg"
      }
    ],
    "user_id": "48vRThjhuhiSQINQ2KV8Sw"
  },
  "vzorwsAccb7JCR2OlFVm0Q": {
    "date": "5/16/2015",
    "text": "I love Raising Cane's! The chicken is always fresh and crispy. The French fries are crinkle cut to perfection. My favorite thing about Cane's would have to be the Cane's sauce. It tastes good with everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-05XqtNjcBq19vh2CVJN8g"
  },
  "thPhj7HB6JJZcNnE4Ags2w": {
    "date": "4/6/2012",
    "text": "Actually, I give this 4.5, of course, round half up plus infinity rule makes that 5 stars.  The half star comes off due to the Texas toast being too healthy, as in not covered in a garlic butter cheese and oil topping in order to more effectively clog my so-called \"arteries\", are those really important?    Interesting fact: Raising Cane's is based out in Louisiana, and part of the capital raised to start the business came from salmon fishing in Alaska.  Pretty cool, huh? On to the food!  Chicken fingers are pretty much the bulk of the menu, and they are really REALLY good!  And the batter isn't as heavy as other chicken fingers, so they don't feel all greasy when you pick them up.  And the sauce they come with?  Some kind of tangy mayo based dip that made it different than eating fingers with the usual honey mustard, BBQ or ranch, although I think you can get honey mustard at certain locations.    I split the Caniac combo with my wife, which allowed us to have 3 fingers each, I got both sauce cups(my wife tasted the sauce but I ate most of it) and the cole slaw, split the toast and the fries and shared a large drink. Liked that the cole slaw wasn't oniony. The fries were standard crinkle cut, but they taste pretty good with the sauce!   Raising Cane's has inspired me to find the best chicken fingers in the metropolitan Chicago area.  Fortunately I live nowhere near this place, otherwise I would probably gorge on a Caniac by myself every day that ends in -y.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "tQOVsJoOYwoPMIGkkPIfDA"
  },
  "GgCnhhS4ewCzfS6MEZb-SA": {
    "date": "5/24/2015",
    "text": "I had never gone to Cane's before last week. Then I liked it so much I went 2 days in a row! The first time I brought a friend and our kids, and day 2 was just my husband and daughter. The staff was very friendly and we got our food very fast. I love all of the movie posters on the walls & the music is good, just a little loud. The sauce! Omg I love the sauce. I've been trying to recreate it, but it's nothing like theirs! I'll definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4aeNS7bZneL43EVXnjvJQ"
  },
  "B-Z5wnV-8VpLHYeIUpz3yw": {
    "date": "7/23/2014",
    "text": "Although I wish they had a bit of a more creative menu, I appreciate the chicken finger only when I come to Canes. The fresh squeezed lemonade and fresh brewed sweet tea is a bonus in my book! Oh and yeah that sauce is the boss! Props to them for staying open til midnight, this is Vegas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xX1wftld9-ndtISAAihqng"
  },
  "m0-SEmSZ7qAxw-RrwqwlBg": {
    "date": "3/7/2019",
    "text": "Always fresh always delicious. A great value for the money.Very busy at lunchtime, grabbed a 6 piece meal to go, in and out in 10 minutes. Friendly courteous staff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5yQuQnZqLwiUcwJH44sgBw"
  },
  "aX7NFHHGoNec7hORBZ51Bw": {
    "date": "6/29/2019",
    "text": "Love the chicken but they can't get an order right to save their lives. The focus is definitely on fast with zero emphasis on accuracy. They only got one thing right out of the whole order, so I guess it's Taco Bell for me tonight.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3bRmqZIrJ0uzkmm7eAKZA"
  },
  "nqlUTDVvjApY-lWvSfRo2w": {
    "date": "12/21/2018",
    "text": "Just got home after going through the drive through and ordering a 3 finger combo. Opened my container to see bread and some fries. That's it... no chicken, no sauce. I don't know how you can miss the one thing you sell, but it happened here.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1csYUsGUX4vwHH-YmRTgQg"
  },
  "lVYspZ_hjxfg4veVnam1PA": {
    "date": "4/14/2019",
    "text": "Nice place! Excellent price! Yummy  chicken and fries !  Clean tables and bathroom too !  Definitely we love this place !  We recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nclVHbZqY12rGzBGXW-Dg"
  },
  "n9lCtGrkHgmMVuXHJuddWg": {
    "date": "7/21/2018",
    "text": "Let me start by saying this is my number one \"fast food\" go to! ALWAYS fresh ALWAYS delicious ALWAYS clean. I have been here so many times I've lost count. The friendly staff keeps the facility spotless & sparkling. The restroom is also well maintained.  Literally the 3 finger combo box is my savior. It has the perfect amount of chick fingers (3), fry's, and Texas toast.... oh and cannot forget their special Raising Cane's sauce.  But if that's not something you're wanting they have endless options. Chicken sandwiches on Texas toast, coleslaw, chicken fingers by themselves, or larger options  in the box combos.  If you're wanting chicken this is the places to try!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "J540Nnzgs2wBZvZagFbPdg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J540Nnzgs2wBZvZagFbPdg/o.jpg"
      }
    ],
    "user_id": "Arx62H_UJvGHPeDpRhIEpw"
  },
  "mS2tBlUg-dCsV0lNXgahPQ": {
    "date": "2/16/2019",
    "text": "Bomb ass chicken, bomb ass toast, and bomb coleslaw!! One of the best chicken joints out there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K8WS_brwcUddeWA5ZF0g0g",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Raising canes chicken, Texas toast, cole slaw and there so good sauce for the chicken.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K8WS_brwcUddeWA5ZF0g0g/o.jpg"
      }
    ],
    "user_id": "wVq9kzDnh6FyGRfMjVyL2A"
  },
  "6dL6JmOzTWa6SXBSLTVfeA": {
    "date": "5/30/2019",
    "text": "Crispy chicken, great service, and competitive prices! Also, don't forget the bread! So good! A great spot for the family and for our casual date nights!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4OlbGOptn6e2iPeDsLcoHw"
  },
  "x5idTexEKGTrNLJbW3BSCA": {
    "date": "4/25/2018",
    "text": "I grubbed at Raising Cane's with 3 of my co-workers.  I got the 3 Finger Combo, which turned out to be $7.00 after taxes.  FOOD:  3.5/5.   -Raising Cane's probably has the best chicken fingers I've had.  Not too much breading, not too little.  Unfortunately, that's all they really got.   -Their secret sauce mixes really well with their chicken fingers.  I'm guessing it's some sort of mayo, with a little ketchup, combined with black/white pepper.  (I'm probably wrong though.)  I think they need more variety with their sauces.  SERVICE:  4/5. -Food server brought our meals pretty quick.  Maybe 7-8 minutes.  AMBIENCE:  2/5. -It's a medium sized fast food joint.    I tend to prefer bone-in chicken (must be the bone marrow or something).  But, if I'm in the mood for chicken fingers, Raising Cane's is probably the best option.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A2bqodAmahTKzCyYwtZlAQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. My coworkers 3 Finger Combos.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A2bqodAmahTKzCyYwtZlAQ/o.jpg"
      },
      {
        "img_id": "QgxsovlhWxuHiLHhloz-MQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. 3 Finger Combo. $7 after taxes.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QgxsovlhWxuHiLHhloz-MQ/o.jpg"
      }
    ],
    "user_id": "cJETeF8DjqZYvHJpKbfc8A"
  },
  "J8dEmEK6WsRypiXTzDySKw": {
    "date": "9/21/2017",
    "text": "Finger lickin' good;) Having sticky fingers here is a given, and the only way one should obtain these is by having the chicken fingers and fries here:) Succulent, piping hot, fresh and tasty.   No variety of sauces here, one sauce is all they provide.  Hey Raising Caines, why not bottle and sell this tasty sauce please?!  You sell the ice tea by the gallon, why oh why not that sauce?!  It's as addicting as my Peter Lugers steak sauce at home (which at times I sneak a tablespoon of).  I would do the same with that sauce! It is all about the flavorful sauce, extra sauce please since I also dip and no I don't double dip the fries;) The fries are always done right, not burnt and mushy.  The coleslaw may just be my favorite;)  Made with fresh ingredients daily- always order extra:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OOpl7aD3dkZQ0d0ClBvoFw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OOpl7aD3dkZQ0d0ClBvoFw/o.jpg"
      }
    ],
    "user_id": "CZs1Eq7t1fqpXV1yox-CVg"
  },
  "_Zcmz_8NzeGFx9YfhEXUgA": {
    "date": "5/20/2019",
    "text": "Should honestly be 1 star. They got my order incorrect, and on top of that, the food looks very old.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lesWF2BRf-xiTtUVFSBoQQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lesWF2BRf-xiTtUVFSBoQQ/o.jpg"
      }
    ],
    "user_id": "BLvkXKnz_oJkuyU58BhSgQ"
  },
  "H7Ux91ob1OzkJ_Q13Oa3rA": {
    "date": "5/14/2019",
    "text": "Great! Always fresh hot chicken, the fries are perfectly crisp and the sauce is perfect for dipping. My favorite is the bread. If the food wasn't enough to keep you coming back the staff, especially the manager Alex are the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOVPh0p_2vCZCUPYO3QEUg"
  },
  "eFxYH6TS3P49wFpd7_NhLQ": {
    "date": "5/5/2019",
    "text": "Went here a few weeks ago, finally got to write a review! Andrea is extremely nice and friendly! I had a million questions about allergies and she was so kind and patient!! She was knowledgeable as well. Employees as compassionate and smart as Andrea are a rare find she's the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fy-EOyCG8LrDzULpupQ9SA"
  },
  "KdN7ZxR7lj3ca0kCHrhhHw": {
    "date": "1/17/2018",
    "text": "TL;DR: a great meal, still missing something, repetitive taste  It feels a bit unusual to review a fast food place, but I might as well since there aren't any Cane's in my area. Although Raising Cane's has a reliable list of options and generous serving sizes, their food is missing a little something to making me come all the way down here for it.  I ordered the Box Combo with a Sweet Tea.  BOX COMBO (4/5) - Good amount of food, subbed in extra toast instead of coleslaw - Chicken not as crispy as I would've liked - Fairly repetitive taste throughout - Not a fan of crinkle cut fries, but they're ok  SWEET TEA (5/5) - This is the best ice on the planet, I swear - A great pairing to any meal at RC - Free refills!  So many people have tried to convince me to convert to Cane's, but I just can't go all the way. While it is a great meal, I feel like it's missing a couple things to make it the best, even if I can't put my finger on it. This is the type of place I'd go to if it was in the area, but wouldn't be dying to go to.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "zGvKyfU1JxmPDeqYf3CfAQ"
  },
  "iN2dN_Z2x12aMhDVICfE8Q": {
    "date": "7/23/2019",
    "text": "Horrible service. Went through drive thru and I corrected them twice on my order and once again at the window. Order was still wrong. Got charge extras for two things I didn't and for and didn't receive the one thing I did request.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eSnoAzB98S41wJ0XMfW_g"
  },
  "pFDifL_eNHtTo4uC_oeK1Q": {
    "date": "11/29/2018",
    "text": "Cane's is the type of place you always know the food will be fresh, hot and delicious.  If dining alone or feeding a family it's definitely a place where there's value in no matter what you order. The chicken fingers are meaty and come with a healthy scoop of fries. I personally love the texas toast. Service is always fast so don't be alarmed if you see a lot of people. Just means the food is that good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aeZk_v9plFvKKzMabJ1H7A",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aeZk_v9plFvKKzMabJ1H7A/o.jpg"
      }
    ],
    "user_id": "ccyQe-tyGrnP8xXlXsFSXA"
  },
  "Wk47mkIGpT7AcUit875zeA": {
    "date": "5/10/2017",
    "text": "Sooooo I didn't realize that Las Vegas happened to be the land of AN EPICALLY HIGH AMOUNT OF CANE'S LOCATIONS until recently. Recently of course being after my first sojourn to Cane's back in Costa Mesa. Well, I was starving and I needed something quick and not too expensive, yet tasty and satisfying. Yep, Cane's to the rescue!  Sometimes you don't even need all the other stuff. Sometimes the only thing you need in your life is the perfectly breaded, yet super moist chicken fingers with one of side of Cane's sauce to hold you over until your real dinner. As far as holdover meals go, there are many many many far worse options than coming to Cane's. :P  Service was very very good here, especially considering Cane's is technically a fast food joint. Everyone had a smile on their face and they were quick to pick up my trays once I was done. It does help that it's not as busy as SoCal, although I suspect that's probably due to the EPICALLY HIGH AMOUNT OF CANE'S LOCATIONS in Las Vegas. Which also means seating is quite plentiful in here.  All I can say is...please open more in California.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "AbwYlR5LC-lPrJyMXSnurA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. MANY MANY MANY CHICKEN FINGERS (with Cane&amp;#39;s sauce of course)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AbwYlR5LC-lPrJyMXSnurA/o.jpg"
      }
    ],
    "user_id": "aXuxyyTDs5RGoFrhajPLYg"
  },
  "nNyXt2ZSJb3JleWYB5QvaA": {
    "date": "7/14/2019",
    "text": "Came in at 1:30 am Sunday 7/14/19 we asked for fresh food. We literally drive up to the front and they hand us our bag of food and let us know it's fresh. We open it up and it's extremely hot and definitely fresh. The service was excellent! We didn't catch any names but the two guys at the window around that time was extremely friendly and gave great service! We usually don't post on yelp but the service was so good we had to write a positive review.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgRNS6LCPbf8TbQQKLUgyQ"
  },
  "DkwN5cuCVGuISDJktt_P-w": {
    "date": "8/25/2018",
    "text": "So I moved to Las Vegas a couple months ago and had always heard the hype over Raising Cane's. I'm not going to lie, the first time I went there I was very underwhelmed. The reason why was because the chicken and fries had zero seasoning. Upon leaving and refilling my delicious sweet tea I noticed little salt and pepper packets! I kicked myself because at the time if I would've known I could've seasoned my food.  I gave it another try and this time grabbing some packets I was able to season my chicken and fries to my liking. It was DELICIOUS. I mean, if someone would've said they didn't season their food I would've been more prone to looking for salt and pepper packets. Hahah. Anyways! The meals are delicious and you can't go wrong with a sweet tea.   I prefer this location because the employees are always so friendly and eager to assist you if needed. They keep the location in tip top shape.  Oh and of course when I move from San Diego to Vegas they open a new location in Santee, thanks a lot! Haha.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AB7srw9R-P3JajSGQTw1kg"
  },
  "YkQd9PpRqRpOH_wcwDsbrA": {
    "date": "2/19/2019",
    "text": "The sauce is the boss! The chicken is just okay not really a fan but i do love the fries with the sauce",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "knYPcKp7Pl-_DVg-wT2iWg"
  },
  "uDz_sPyHM9VvbJJdnmHpRQ": {
    "date": "1/4/2019",
    "text": "Raising Cane's used to be my favorite fast food place, but since 2 years ago, everything starts to falls a part.  1. I used to love their bread, but starting 2017 they put this REALLY salty butter sauce on the bread, it's so salty to the point I can only have just 2 bites, are they trying to give people heart attack here?  2. another big disappointment, today I went and found out they raised the price of caniac to $11.79 now, for that price I could get a really good meal at other local food restaurant that aren't FAST JUNK FOOD.  In my opinion you should NEVER ever pay over $10 for any fast food, this just not right.  3. Fries and chicken are getting really greasy, I don't know why they changed what worked, it used to be not so greasy at all, nice and crispy, now it's just soaked in grease.  time to look for another fast food restaurant, but I guess I should be thanking them, with that price, it makes me want to eat healthier at other places.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "OmSz8hJI5tbG7Ww0Q9IkNQ"
  },
  "H4jq7b71AsU5Eynmw-yvTg": {
    "date": "9/27/2015",
    "text": "If I'm being honest, I've gotta say I have more respect for a restaurant that focuses on making only one thing well, than I have for places with a huge menu of mediocre offerings.  There's quite a few restaurants these days rocking the simplified menu, but I don't think any do it as well as Cane's. All they serve is fried chicken strips, and a chicken strip sandwich. Basically the only choice you have to make is how many strips you want for your meal.  I find with the sides, the standard 4 strip box combo is perfectly filling for me (and I'm a pretty big guy). The chicken is simple, but delicious and juicy. The fries are plain ol' crinkle cut, but they compliment the chicken wonderfully. You also get a side of coleslaw (decent), and a thick slice of Texas toast (awesome).   You get a cane's sauce with your meal but I recommend ordering an extra side because it's actually really good. I've always been a fan of dipping my chicken strips in ranch and I was disappointed to find that cane's doesn't have it. It didn't take long for me to fall in love with this stuff however. I'm not sure what's in it, but it's creamy like ranch, with a nice little zest added.  Their sweet tea is awesome! I like to mix it with regular iced tea so it's a little more subtle and not too sweet.   When Cane's is on a good day, you're food will come out incredibly hot. It's very rare for me to receive anything less than hot food, but I have been served warm strips and fries before. It was disappointing, but I haven't experienced this very often, and even when warm, the chicken is still pretty great. With the exception of a few off days, cane's is pretty consistent, which is a big reason I love the place.  I want to give a five star rating, but until cane's can guarantee hot,fresh food every time, I think four is the best I can do (which is still really great).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zFvW-hvtKJ7AAj_kZNXsBw"
  },
  "UDyrkDgmh3kKYKzAtOaa7g": {
    "date": "6/4/2017",
    "text": "Drive through clerk spoke fast when I apologized that I couldn't understand and asked her to repeat what she said she rudly talked really slow. You'll get better service if you order inside.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VodwE0SRHSskqNcGgAgivQ"
  },
  "KwXp8eKNbSJTMA80L-uDIg": {
    "date": "7/13/2014",
    "text": "These are the best chicken fingers I've ever had...and the dipping sauce? So delicious. I'm a big fan of the bread and fries too, although the coleslaw is a little on the sweet side for me. Oh! And the iced tea is perfect...I mix the sweetened with the unsweetened and it's the best. I've been here a few times and the service is always fantastic. The employees are friendly and personable. It's always clean even when it's busy. It's one of my go-to places for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "umJ54bzxoDsY2DSKlSrDaw"
  },
  "esMlAN21UrWJHIwWZsk2sA": {
    "date": "8/2/2014",
    "text": "Nothing bad to say about raising canes!!! The food always fresh and hot,ready to go and eat. Most of all my favorite part is the sauce!! You can dip the fries,chicken strips, and even the Texas toast. Delicious!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p0yy51-gmt4Yn8n_hHHo_Q",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Fulfilling and hardy meal for us big boys!! Lol tell ya one thing,after eating this all I wanna do is go to sleep after.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p0yy51-gmt4Yn8n_hHHo_Q/o.jpg"
      }
    ],
    "user_id": "1M8R3p4RsA-3Lz006M4TBw"
  },
  "DRs652Kvdju7P80d7aakPA": {
    "date": "6/19/2014",
    "text": "So delicious, I wish we had one at home in Colorado Springs!!  Real food, fast, and inexpensive...what more can you ask for?  I can't stop singing.....I'm a Caniac, Caniac...I know LOL",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yNsljDRacDYu3rXIkcxOg"
  },
  "bmVhNvmM4_jdTij-tH6GfA": {
    "date": "6/5/2011",
    "text": "I have been here many times, they are not the best chicken fingers I ever had but in a pinch I'll head here. After leaving a concert on Friday night I was desperate for a small bite to eat, didn't want a greasy burger or spicy taco's so late at night. I also didn't have the patience for a sit down meal. Raising Canes is around the corner from our house and was relieved when their drive thru was still open (til 1 am on Friday and Saturday). Their chicken is tender white meat pieces, never greasy, cooked to order, so they are always fresh. I hate the dipping sauce (my hubby loves it), so I've been known to take a bottle of Kens honey mustard dipping sauce with me to the restaurant (shhhh!). I'm not a fan of crinkle cut fries, so I skip em. The coleslaw is okay. Love the Texas toast though. Their ice tea and lemonade is an added bonus:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "DoRCeCcJbrsM2BiAKj3trA"
  },
  "-loy8n4UtwCnDcwMDkYJ3g": {
    "date": "7/25/2011",
    "text": "I preface this review by noting that I'm not a fan of fried food in general, especially chicken.   Raising Cane's is actually quite tasty. I just don't understand the hype. They are pretty basic and although they taste ok, I don't anticipate making them a staple in my dining rotation. The dipping sauce is nothing amazing, but it does go well with the chicken. The fries are very meh. They're not crispy in the least and lack flavor. If I was going to eat here again, I'd probably only order the chicken and skip the fries.   All in all, just ok but it's a good alternative to some fast food joints in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "UYcmGbelzRa0Q6JqzLoguw"
  },
  "pZCkIppRWZAQgMGmvpsIgg": {
    "date": "8/2/2014",
    "text": "Double the toast, minus the slaw. You can't go wrong with Cane's. Their sauce is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wj7ScpybESY7SdKwv4B4AA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wj7ScpybESY7SdKwv4B4AA/o.jpg"
      }
    ],
    "user_id": "VehPPTKsJ4dwmHZj94duMA"
  },
  "4YUp9nCk0V8z2W2XDIpqjQ": {
    "date": "5/14/2013",
    "text": "1.) crinkle cut fries!?!? come on, this reminds me of microwavable crinkle cut fries i used to eat back in the late 80's. makes the meal seem so cheap.  2.) the chicken is actually very good quality. definitely fresh. i dont like the batter and the turd like shapes.  3.) their texas toast is pretty good. could use a little more flavor though.  4.) slaw... its slaw...  5.) lemonade + unsweetened tea = arnold palmer. i love it, its the tits.  6.) cane sauce? its just fry sauce with Worcestershire sauce and pepper. it tastes so one dimensional.  7.) for the price of a 3 piece its expensive.  8.) the only reason why its good cus my MOMMY BOUGHT IT FOR ME!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "klN7Yw_aVUBscqhlkpKkRA"
  },
  "viz-ml6DMZ8QS19I_MJ61g": {
    "date": "3/3/2014",
    "text": "For pieces of chicken tenders, this place is pretty good. You have a choice of getting a number of chicken tenders with fries, toast, and a drink.   Cane's chicken never fails to satisfy me. They're always hot right when it gets to your table. Crunchy on the outside, tasty on the inside. You can also ask for their special sauce and that goes well with everything! Fries are almost never soggy and the toast is amazing. You also can't forget about their sweet tea!   The only reason I give this place 4 stars is because I feel like it'd be better if it was a $1 or 2 cheaper.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Z29fLaeLtGnNroTuHyJ2A"
  },
  "J0AnkSWG2z6dZgk4AAb2sw": {
    "date": "2/12/2016",
    "text": "It was it is and they do it the best there sauce is good and the have Louisiana hot sauce..also the Texas toast and sweet tea are amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hDaFJ_BBtd5uDeFvcWM_A"
  },
  "1328Z182UypfiF4xod3AYQ": {
    "date": "3/10/2014",
    "text": "Cane's is a good place to get lunch with friends and hang out. I almost always order a Caniac  (6 pcs of chicken, toast, fries, slaw, and sauce) I replace the slaw with toast because the fries are plenty for me and I don't like their slaw. After eating the whole box of food, I'm pretty stuffed. It's a bit pricey for chicken fingers, but I think it's worth it.  This location is usually pretty packed around lunch time, so be warned.  There's something about their caniac sauce and toast that makes me come back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utjpVFySRyXGM-X9znTq0Q"
  },
  "r8tzRAX1t1sfj_cP7oodBg": {
    "date": "12/20/2013",
    "text": "I have been to this location several times, both for eat-in, drive-thru, and for 'tailgate' pick-ups. I have not had bad service.  The best part is that they open at 9 AM, so you have chicken fingers for breakfast.   Two people can definitely share the Caniac, which is $9 and comes w/ 6 pieces of chicken. I always trade out my coleslaw for another piece of Texas toast.   For drinks, they make great sweet tea, but their lemonade is what I prefer. It is not unlimited refills for that though. Boooooo! Nonetheless, the chicken is delicious & this is a great option for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VABkVdFhHGMo7wAqfofGA"
  },
  "9VenPCw606fDBT6ZnhkScA": {
    "date": "1/23/2016",
    "text": "You're insane if you don't think this place deserves 5 stars, service and food. INSANE!!!!  It's a must try if you're in Vegas. I took my aunt and uncle here when they came to visit and they were blown away as well. Outstanding each and every time I visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "feX4HQ9YmRgd0Y-4oqvh8A"
  },
  "nMMPWTP8VQA5ZQ2LNk5ESA": {
    "date": "1/8/2013",
    "text": "Before writing this I fully admit I love Popeye's Chicken (spicy) and if Church's Chicken has it on their menu they are my 2nd favorite fast food spicy chicken joint. I was convinced to give this place a try and was sorely disappointed in fact both of us were.   First on the positive side the chicken fingers were nice and juicy all white meat chicken. The order taker was helpful in explaining the menu and options but that is were I have to start on the negatives.  No spicy chicken option. They give you a pack of hot sauce but its just a regular vinegar based sauce not my favorite and not particular spicy.   Their signature sauce is OK but nothing special. In this humble Yelpers opinion it tastes like they mixed a few condiments together. Not bad but nothing special enough to build a franchise around.   Its not a bad franchise but if you are craving spicy or even flavorful chicken you have better options available less than 2 miles away in either direction",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "Yg08tRMxm0eaL-rXyNIAHw"
  },
  "B-qt1VnyJShu-RQZfY2NLA": {
    "date": "3/1/2015",
    "text": "Good fast food chicken, prices are good and the service is very friendly. The location is very clean from inside, even with many teenagers working there. They only specialize in chicken fingers and special sauce, and its excellent. If you want fried chicken on the go then this is a must try place on rainbow and 215.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kwIhn1_cnQeUaLN0CuWWHw"
  },
  "vnGSqQw-PkRpZe1HsCj0rw": {
    "date": "9/9/2015",
    "text": "I am literally obsessed with chicken fingers, and therefore I am obsessed with this place. Not sure if I've ever seen anywhere else with a focus on chicken fingers. Not only is it unique in that sense, but their quality is great at such a cheap price! Under $10 you can get a meal with chicken fingers, a drink, fries, Texas toast, and coleslaw. If there's a side that you don't like you can just substitute it for something else. I usually dip my chicken fingers into ranch but they somehow managed to make a sauce perfect for their food. My only complaint is that they don't have a location in California!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UpxePgmy_kgOqyA9XEei2w"
  },
  "9QZpqDPaHNw_qvtjcoQk0Q": {
    "date": "5/2/2013",
    "text": "I don't know how you can not rate RC as five-stars.  Seriously.  We get this EVERY damn trip to Vegas.  Man, I'd probably go as far as to say we've probably driven to Vegas some weekends years ago just to get it.  It is like blue magic maaaaan.  Friendly service, delicious food, reasonable prices, clean dining / bathroom areas, is there anything more you'd like from a \"fast-food\" spot?  No.  It is chicken finger nirvana.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wa40Yx8wrZfiRqTgZsdd0g"
  },
  "jHCTtXczC3GmdGGVAhDoAw": {
    "date": "2/20/2016",
    "text": "High quality chicken! I've been to this location many many times and every time j come the chicken is fresh and the toast and fries are too. And man do I love that sauce! I always get extra sauce so I can dip everything in it. The customer service is on point, they are always friendly and always bring the food to you. I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5o-Occwj7-24ia5vd9hDw"
  },
  "kZTlu36hI2N6GvjeZtpnJg": {
    "date": "8/22/2015",
    "text": "Fast service, classic cane's! Great for a quick snack for yourself or the kids.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3-QoohSDMeL8-crDBvA8oA"
  },
  "D88gYi6N1muQ1Jo5bt2t4w": {
    "date": "8/22/2019",
    "text": "Opens at 9 am. Two entrances.   We've been here at both the drive-thru window and at the counter. I'd say that the drive-thru window is busier (at lunch time, anyway) than inside (the noise level is average; the University one is most definitely the loudest and busiest location that we've visited). Depending on where you park, you might be crossing the line of cars waiting in the drive-thru window.   There are tables (middles) as well as booth seating (lining the sides of the restaurant; the restaurant is shaped like a long version of a rectangle). There is a bathroom, near the back of the restaurant. The fountain drink machine (refills on soda) is near the front counter, as well as the condiments, the plastic ware, and the napkins.   No matter the location, someone always asks us if the food was good that day. When the crowd at the counter dies down, there is usually a team member cleaning the vacant tables.   The combo that we get has the fingers (perfection, it is moist inside, and crunchy outside, but there isn't a whole lot of extra batter, which I dislike; my inlaws love Popeyes, which I think is just alright) and fries, along with a slice of texas toast (thick), and a side of coleslaw (I prefer this one over KFC); the sauce is the bomb, it's one of my favorite sauces.   When we told our son we had RC's for lunch, he asked if we saved him any (but we didn't get any extra fingers, because he was with his grandparents). I just thought that was funny, though, so I thought I would mention it here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "sAKlZTlM8jwtXT2XLNtERA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Drive-thru menu- left side",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sAKlZTlM8jwtXT2XLNtERA/o.jpg"
      }
    ],
    "user_id": "fiGqQ7pIGKyZ9G0RqWLMpg"
  },
  "SK6pi4I-y7rCpIyM6VjDEA": {
    "date": "9/22/2019",
    "text": "Ok I come here often and what happened last night was disappointing. I did drive through and ordered the box combo with extra toasted instead of coleslaw, the cashier was wondering which one was my order and messed up by putting no fries extra toast, then no coleslaw extra toast.  the food I received was COLD as if it has been left out in the open for hours: fries was dried and hard, toasted breads is cold as well and looked like leftover from someone's order. The chicken fingers were warm but very oily. Somebody tried to cover it up by putting the warm chicken underneath the fries and toast in hope to make the whole thing warmer but it was not. I never waste food but had to throw it away due to sanitary concern.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ugxQEiVGuDiH-NtRFGCyaw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ugxQEiVGuDiH-NtRFGCyaw/o.jpg"
      },
      {
        "img_id": "nvu5XJr1IOVHEHdX2qkXUQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nvu5XJr1IOVHEHdX2qkXUQ/o.jpg"
      }
    ],
    "user_id": "in9VhNJUpAZv5kuXs0b_bg"
  },
  "DSAp_Y-1SFU4aVB3ZbCyBw": {
    "date": "9/7/2019",
    "text": "Im a Raising Cane's fan. This location especially. When they do everything right their food is delicious. Sadly they aren't always right. I've been here a couple of times when their drinks taste gross. The ice they serve sometimes taste nasty. It's Happened to me 3 times. It's not all the time but sometimes. At first I couldn't figure out what it was so I went back and asked them for another drink because I thought they had given me a Diet Coke instead of regular but nope, it was the ice. Months after that, I went back and it happened again to my lemonade. I don't know what it is and I hope they got it fixed because it hasn't happened to me for a while but if it's not the ice then my chicken looks soggy. I don't know do it's condensation from the hot chicken or what. But today when I got home my chicken was wet on the bottom. Weird. Other times the chicken is not fresh. I mean it's not old but you can tell it's not as fresh as you are used to.   On the plus side. Their service is crazy fast! Like I'm always caught of guard fast. I kid you not. You order and then your getting your food.   I do enjoy coming here and when my order is perfect I'm happy but when it's not, I get sad because it should be easy to have consistency in your food. All you serve is chicken, fries and bread.   **I do always update my reviews after a couple of months so I hope I don't experience any of these problems again because I would love to give them 5 stars. Their chicken is really good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2QekVEQKhNuvKMr_xr2qQ"
  },
  "p9YdD3mElRQeMor0ukz7ig": {
    "date": "8/28/2019",
    "text": "So. . .the first time I ate here was in 2008 or 2009. My brother and his crew just got residency (at MGM or Monte Carlo) and I was here visiting. He introduced me to Cane's and it blew my mind. The chicken was nicely seasoned, the bread was bomb and the fries dipped in their sauce. . .AMAZING!  I've visited many times after that and had the same experience so usually, when I hit Vegas, Cane's is my first meal. This time it was different. The chicken wasn't as good as I've known it to be and that made me very sad. Especially because I was bragging to my husband about it and he was like \"this is what you were talking about.\"   I'll check them out one more time on my next trip but it's looking like I need another go-to restaurant when I visit my favorite place to visit!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MY9PF0jEGOh2VfidjhMQwA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Lunch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MY9PF0jEGOh2VfidjhMQwA/o.jpg"
      }
    ],
    "user_id": "lctrtrQpFGFxHMk7v_hArA"
  },
  "S_4zZmKv3xwbGwkKMp8LRg": {
    "date": "8/7/2019",
    "text": "There's something about this particular location.  Of all the Raising Cane's I've been to (Santa Ana and Santee, CA), this place seems to be the cream of the crop.  The chicken tenders are well seasoned and the crinkle cut fries are just right (hot out of the fryer, crispy and not dried out).  The staff was super friendly, attentive, and welcoming.  The gold standard for all Raising Cane's restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nLUwyI34R-cAHLnmEGeLIg"
  },
  "ZJWMWYteG6bLzaSVXy6ofQ": {
    "date": "5/23/2019",
    "text": "In my quest to eat at places that we haven't eaten at before lead to this put stop. Fast food that isn't a burger? Chicken fingers? Yes, please.  Didn't want all the additional fluff that came with a combo like the Texas toast, Cole slaw and a drink so we ordered chicken fingers which is sold by singles and an order of crinkle cut fries. Sauce is a separate cost if you order Ala carte...boo! It literally tastes like mayo mixed with ketchup and spices.  The chicken was piping hot, juicy on the inside and a perfect coating to create a crispy crunch. This is not your standard dry meat, too much batter like you would get at other fast food joints giant chicken fingers. These guys do it right. It's what you would expect considering it's in their name!  I underestimated that 4 pieces wouldn't do the trick so I had leftovers for dinner because they were really good portions and with the fries was quite filling. Head through the drive thru if you don't want to get out of the car but don't hesitate to head inside if you're not in a rush.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qLi1rg5x3nIUjoL_Q5XaLw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Sign painted on rock wall exterior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qLi1rg5x3nIUjoL_Q5XaLw/o.jpg"
      },
      {
        "img_id": "k9fpKdaicX2kt4AYb3nQHQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k9fpKdaicX2kt4AYb3nQHQ/o.jpg"
      },
      {
        "img_id": "C9SDJ9X-4MiQtrbin3vYHA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Chicken fingers &amp;amp; crinkle cut fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C9SDJ9X-4MiQtrbin3vYHA/o.jpg"
      }
    ],
    "user_id": "ZDiUY2UHZBp-fx51RAcCyA"
  },
  "AsOzfSXhp5mLvzS44RaoFw": {
    "date": "8/27/2019",
    "text": "Food is pretty good, quickness of the food coming out is ok, employees are friendly, but associating yourself with the Raiders marks this as my last visit to this place. Over half of the city is against these monkeys coming to town, so to promote it on your sign boards and such is just stupidity on your part and in turn has lost me as a customer as I refuse to do business with anyone advertising their logo. You got your stickers wrong...we are all actually PATIENTLY waiting for it.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yFfOEhcmwhpXoBul6PAB9g",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yFfOEhcmwhpXoBul6PAB9g/o.jpg"
      }
    ],
    "user_id": "ReEsgGUwwHG5616YbjAjAw"
  },
  "A1L8B0MHNLtgCA5yiu4AKw": {
    "date": "8/21/2019",
    "text": "It's been awhile since we have been here. One thing I always remember is the white chicken meat coated with a nice crunchy batter. And the sweet tea that is one of the best you will find anywhere. This one particular night for some odd reason we were not big fans anymore. Something just wasn't the same. First the coleslaw , was very bland. They need some lessons from KFC! It was dry and just no taste. The fries once they get cold they just aren't too good. The chicken was good but not like we have had other times. I can't pinpoint it but something was off. Maybe the sauce. That sauce before was always so creamy and good. This seemed thicker and just not like it use to be or what I remembered. Of course the bread is always good if you like the thick bread. Just not impressed anymore. Use to be my favorite chicken place. The sweet tea was very good and what I remember. Everything was just ok. Really not sure if we will go back anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "zH6racrZ7rUqqv_Qy6dZDQ"
  },
  "Ehw_NUPYeGKLQmEjUcleSA": {
    "date": "7/1/2019",
    "text": "So Popeye's, the maker of the best chicken strips around is literally one block away and this is what you bring to the table to compete with them? How, if chicken strips are your entire deal, do you only have two dipping sauces...and one of them isn't even ranch?!!!!!!!! WTF?????!!!!!!!!!!!! The only reason that I'm not giving one star is that it wasn't outright gross but the flavor was weak, the texture was odd and their \"fresh squeezed lemonade\" (I put this in quotes because I have doubts) tastes totally watered down. This is a one and done situation. I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BR_L1ZFg4z34gAeRs2cOWQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BR_L1ZFg4z34gAeRs2cOWQ/o.jpg"
      }
    ],
    "user_id": "KiXkvugLXYtWyGHJRU8-Og"
  },
  "xThB2rG0r8Gtegq1rXecpA": {
    "date": "1/21/2019",
    "text": "I'm a new resident to Las Vegas and often see this place as I drive around getting familiar with the area.  One day I was hella hungry and thought to myself...let's see what this place is all about. My belly actually drove me there.  You walk in and can instantly smell the aroma of fried chicken. The menu is simple and pretty much straight forward. If you're a regular, there's really no need to ponder what to get.  I ordered the The Box Combo which came with 4 Chicken Fingers, Crinkle-Cut Fries, One Cane's Sauce, Texas Toast, Coleslaw, Regular Drink (22oz).  The person behind the register and every worker I came into contact with was very friendly.  You pay your bill and they bring the order to your table \"using your name.\"  Great business model.   The chicken was super crisp, very moist, and well prepared. The Texas Toast was bomb. Next time I'll order an extra one. There is a good selection of fountain drinks that's self serve, but what makes the visit even better is that they have SWEET TEA.  A great compliment to an already good meal.   So if you are looking for a quick bite or just want to satisfy your cravings, definitely come to Raising Cane's. You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vTy3r_I-TkUr8XunkoebOw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Fresh made TEA.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vTy3r_I-TkUr8XunkoebOw/o.jpg"
      }
    ],
    "user_id": "WnSF_-kTazxPASvxMKMIzw"
  },
  "GcgRyn7jSntdoV-XH2Nm2A": {
    "date": "7/22/2019",
    "text": "Every time I go here I always have to make sure the extra sauces I order are in the bag because they always forget it but today the person at the second window verified that they added the extra sauces but sure enough when I arrived home they only put 1 instead of the 3 I ordered and payed for, literally it's less than a dollar but it's not that hard.   After this I'm making a point not to go back to Raising Caine's",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SF6StNdSj1S-nSSq6dTfWQ"
  },
  "m6SJBrp8ChGhLEdYUkL7Ig": {
    "date": "11/18/2018",
    "text": "For a chicken finger joint I was pleasantly surprised. The staff was super friendly and our order came out so fast we hadn't even picked out a spot to sit yet.   The chicken strips were meaty and cooked beautifully. They were flavorful and juicy. The staff was quick to make the rounds, checking on us, and they were quick with the jokes.   If was a very enjoyable visit, I'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nqGLDFsa0t5xNpbDKsByTw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. 4 piece baskets for everyone!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nqGLDFsa0t5xNpbDKsByTw/o.jpg"
      }
    ],
    "user_id": "P2ZK_uDduvKbKgmNuyZQ4w"
  },
  "0hfKZZw8TEiFJpz1JjLaMA": {
    "date": "9/2/2019",
    "text": "Best chicken place I have found since Guthrie's of Tallahassee. Amazing service. Closed on Labor Day. That's not even a real holiday. Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d38f6MEqblbq7v6zmhVibQ"
  },
  "PFzDSYIqbz_oT7wQ1Z4YLw": {
    "date": "2/16/2019",
    "text": "Went to grab food at 11pm on a Saturday and got the unfortunate pleasure of having Michelle take my order. She was very unfriendly and after I placed my order told me that I had to sit on one side of the restaurant because they were pulling the booths. I asked if they were about to close and she said yes in an hour.   I was a little shocked by that, but then once I sat to wait and eat along with the other diners she began to pull the booths apart by aggressively dragging them loudly across the floor making a very loud screeching noise, which was unbearable to not only me but also to some of the other diners. While eating she began to sweep the floor, which I couldn't believe she would do while people are still eating their meals.   Food was good, but the dining experience and Michelle were extremely unpleasant. I'm not sure what transpired before I got there but she clearly seemed to be having a bad night or not happy with her job. This also became much more evident from overhearing her interactions with some of the other coworkers. Good food... horrible dining atmosphere and customer service.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5M6MLVulfGvRJpbHZazLWw"
  },
  "OHsjueq6i8LHrkva7Z4rJA": {
    "date": "1/24/2019",
    "text": "I like Canes but this one (S Rainbow) always messes up my drive thru order, I always ask for no slaw extra toast with my Caniac combo and they always give me their coleslaw and they've forgotten the extra toast 3 times now, the fries are always room temperature and soft.   Chicken fingers aren't that warm either but they're at least edible.  I've been to a lot of Canes in my time this one just isn't up to par with the consistent Canes quality I'm used to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2xPodUSt7mC2_yk7kvackA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2xPodUSt7mC2_yk7kvackA/o.jpg"
      }
    ],
    "user_id": "dCuyooB5vGnkzsAbu5y_fg"
  },
  "vm4Znab-ASx_rTc_FWuGVw": {
    "date": "8/2/2019",
    "text": "I came through the drive-through and requested that my fries extra crispy. They asked me to pull to the front where I waited 12 minutes before walking back into the store. My order still was not ready. The manager gave me my order and in front of him I checked my french fries which not only were not extra crispy but they were not even fresh! Although he did offer to remake it for me after 14 minutes at the store just for extra crispy fries I have had enough. Beyond piss poor!!! How nice of him to extend a kids meal for free To a adult. That got thrown out the window I hope from lucky little kid finds it because I'm never going back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jR_xO8ALS_2omCZfoBendw"
  },
  "91LmGB3-DbvjrTxaigdtEQ": {
    "date": "10/11/2018",
    "text": "No lie, I was in a rush and went here, ordered inside and 2 min later, my food was ready! Excellent service here and always friendly faces behind the counter. And how can you hate chicken tenders? And the toast! One thing I would suggest for the employees is to not put the toast on top of the sauce when packing take-out because it makes the bread go cold fast! Other than that, we're golden!  Another thing I like here is that I always order the three tender meal and it totals out to $7.00 even, so that's convenient. There are multiple locations and each one I've been to has been great and consistent.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "n7Pdj7LDxp0KXgBafuyN_A"
  },
  "6Lr5w1O7454FlWUzt5v4_A": {
    "date": "6/4/2019",
    "text": "If you want to guarantee you will have a great lunch then boom ! This is the place for crispy juicy perfect strips every time. The drive through was ridiculously fast too. Love me some canes .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3yQXT63ySU_3rHa66xDxSw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. They got the best ice too",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3yQXT63ySU_3rHa66xDxSw/o.jpg"
      }
    ],
    "user_id": "gZafQUksCjSQsUb4pukfQw"
  },
  "oqDwfkFr07V7OXbLkUOLGA": {
    "date": "3/31/2019",
    "text": "Honestly don't understand all the hype! I purchased 3 meals, it was about $25. Chicken was soggy, sizes weren't consistent, soda was flat and fries were similar to what a school cafeteria would serve.  Yes the sauce was good and actually made the food bearable otherwise it would have been un eatable.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEbJ7wYb97tYqH-V7HGrtw"
  },
  "N3ArGnb7FNtj8cqq2H37ZQ": {
    "date": "8/9/2019",
    "text": "This canes is the bomb, food comes out fast and fresh, 100% awesome staff and helpful. I probably ordered from them like 50+ times. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AZDLM2D0gCv9D2N-1huWFQ"
  },
  "8h5DizLPACJjXSnG8RV0FQ": {
    "date": "7/1/2016",
    "text": "My go to place for my cheat meal after the gym. I love The Caniac combo which has 6 strips, crinkle cut fries, coleslaw, and toast.  They have the little round ice cubes like sonic burger. Best in your fountain drinks on a hot day. The service is very good for having a all high school aged staff. The food and service is always consistent. Clean dining room area.. Skip the drive thru and come inside it's faster. Only thing I wish is if they had BBQ sauce. They have great fry sauce but I'm a BBQ sauce guy for my strips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0QfV3xDQ87R8mBqa1W7xlQ"
  },
  "2xtGWuv2wp0Ag_X4FdDPFw": {
    "date": "5/25/2014",
    "text": "Raising Cane's food is good. No doubt about that! But today they messed up my order. Instead of giving my three box combo. They gave me a caniac! Most of you would probably be like: what's the big deal? You got more! The thing is, I don't eat much. I don't even finish the fries! So the food will go to waste. Feel bad for the person who will be getting my three box combo instead of their caniac combo.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "omzK_8C8RdZoulHbC8t3Ug"
  },
  "mwUsk9Rzqwb9egiEq7JPfg": {
    "date": "10/9/2015",
    "text": "We have been coming here for a while now and we love it! The food is consistently great. The chicken is always hot and really tasty and the sauce is amazing. I love the lemonade and even though I haven't tried the sweet tea... I have been told its the best. The drive thru is usually pretty full but it goes quick and they get you through the line fast. There is a dine in area as well. Sign up for the caniac club to get points and deals.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3MH4C08ExR0nmafnHpx19A",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Four piece meal chicken, fries,texas toast,coleslaw, and amazing sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3MH4C08ExR0nmafnHpx19A/o.jpg"
      }
    ],
    "user_id": "Z6QMLvzwiFKhFe_AYO0Csg"
  },
  "NkhpEN3Icf_4KoeLwPBMCg": {
    "date": "8/3/2014",
    "text": "Really enjoy the box combo. Perfect combo of chicken fingers, slaw, fries, and bread. Love the dipping sauce. Good stuff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OKJn12p5cn3I2lz7cFBVVw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. The Caniac meal.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OKJn12p5cn3I2lz7cFBVVw/o.jpg"
      }
    ],
    "user_id": "zpwWpno3U-oZaG3AJuKqSQ"
  },
  "yi7NVuzmh9wTlNAzcKhuEg": {
    "date": "3/31/2014",
    "text": "\"Welcome to Raising Canes where the chicken is kicking, the sauce is the boss, and the toast is the most!\"  Kicking chicken? CHECK. Bossy sauce? CHECK. Most out of the toast? CHECK.  There's really nothing bad to say about this place unless you're anti-fast food OR hate waiting in drive thru lanes.  I LOVE that there's one located on the southwest side. It's very convenient for me =)  I will continue to come back here time after time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "VhkjxxBz-A4M-mMncpn1ZA"
  },
  "ssM-2OrVxWXFJFvgYdeDtQ": {
    "date": "9/28/2014",
    "text": "Well I don't usually eat fast food unless it's the only option but I do have to say I love Cane's. Love the fact that they are very simple and they have their own special sauce for their tenders. Without their sauce the chicken tenders just wouldn't be the same. Everything was super fresh and hot. They also have the option for huge family orders which is great for parties or game days. They have really good tea and lemonade and sell it by the jug too. Love their toast that comes with the meals. Service and prices are great and it is definitely not a normal fast food place which is why I will only eat here for fast food and not anywhere else.  You definelty have to try the sauce with the tenders!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JcNSd3dXmIMVHP2CUpvMHA"
  },
  "4mtOftdMM0q5xuqxKrVvSQ": {
    "date": "3/1/2012",
    "text": "Sweet tea by FAR closest comes too authentic. The only reason I know is because I been too Atlanta, GA few times in my life. Same region never knew what sweet tea was till those visits. Not many places around town that know of even have it on the menu. It really perfect pair between the chicken fingers and refreshing not carbonated drink!  The chicken fingers are awesome. They use real chicken meat nothing process like most fast foods. The batter is light not super heavy dense and settles in stomach for days. Fried right not dark but nice golden brown and the chicken hot/moist every time. They do every order fresh! The dipping sauce that comes with the fingers really enjoy and goes well with the chicken.  The restaurant if go during lunch be warned gets packed really fast. Most part people going in and out. Not that long wait too sit down. Whole staff is friendly and always have manager goes around the restaurant checking on customers. They ask is everything is ok. U feel personnel touch. Nice change pace have management going around see them present and keeping customers Happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "iSC96O2NjQc3JExGUHQG0Q"
  },
  "-cEfeEW2rbok24viGd6ZAw": {
    "date": "9/19/2016",
    "text": "Mike A.G.M Very outstanding person very professional and helpful he made sure my order was right. Please keeping hiring people like him very cool guy. Mahalo n God bless..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3N4Uk6wYXNKIq_R8VJNMnA"
  },
  "ERyMgORKhLDP9fkVlHb8mQ": {
    "date": "11/25/2015",
    "text": "It was so loud in the place we could not hear each other talk... We worked all day and wanted to enjoy our meal, but the manager never to charge of the situation and we had to say something to the kids... Granted they were not out tearing anything up but just being rude and over destructive! Until they can get this place under control eat somewhere else!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OQ8YzlWU6oOdAoZS9VB7qg"
  },
  "K0gE2ncDSOxMxiWw6uCYyQ": {
    "date": "7/25/2014",
    "text": "I love Raising Cane's.  The chicken fingers are really good, and although they are deep fried, they aren't overly greasy.  The fries are clearly frozen, they are good.  And the bread they serve with it is the best and I'm not normally a bread person.  And the service is great.  I love they stay open late, so I can go before work.  The one downside is I'm not a fan of the Cane's Sauce... at all!  As a Texan, you need GRAVY!  And it needs to be cream (white) gravy!  If the Dairy Queen is open, I'll get the chicken fingers from Cane's and I'll go to DQ and get an Orange Julius and some gravy.  LOL.  The price is the best part.  You get a pretty good meal, on the cheap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmYU_SLgpWgafgSejWdzTg"
  },
  "iC3G60oeu_yc-MwwYFGlkA": {
    "date": "12/3/2015",
    "text": "I will always be addicted Raising Cane's food, especially their house sauce. Never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1FIjrdHuJSx03BJZ9yNi4g"
  },
  "_bVfwrWGPt4BaqHBxbVfRw": {
    "date": "1/12/2016",
    "text": "I love this canes, it's the closest one to me. Anytime I feel like I need some good ole Cane Sauce and Texas toast this is the place to go. Oh how I love the chicken here. The sweet tea is also great when I'm feelin a little ache in my sweet tooth (maybe I just need to go to the dentist). The fries are also very good! Dip them in Canes sauce and honey mustard for an even better taste!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zE2LRSUBVCNz-oyFCJAI5A"
  },
  "nF9IN5qroczd-1BJIM7jPw": {
    "date": "6/14/2016",
    "text": "This was my first time here my son loves it, I got the canaic and it is a fair amount of chicken, it is also battered well but there is no real flavor to it, the fries also had no flavor and were limp, the sauce they give you to dip I didn't find tasteful at all and then to top it off the reason I rate it so low is that I got the hi-c punch to drink and I thought that my teeth were gonna fall out from the sweetness of it, I had to dilute half of it with water and even then could still taste the sweetness, it's diabetes in a cup, only other thing that was good was the bread. Will never eat here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tPm-s4L25Bt1xNUYHuiX7Q"
  },
  "dBs_iQQISx6uMVQY-EDv2Q": {
    "date": "7/14/2014",
    "text": "All they have is chicken fingers, but...they are good.   Now I will say when I think good tasty fresh chicken, I think chic Fila.  This was not chic Fila, but...it was a close second.   Their sauce was good.  Their fries were good.  Their prices were great.   I just wish they had other sauce options!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBhaCEcdbdDv76kMwm8Nng"
  },
  "SSM7-GQOTZqCGDhKWUSAlg": {
    "date": "2/4/2014",
    "text": "WHAT I HAD: A MEAL that included: 6 chicken fingers, cole slaw, fries, and sweet tea...  The chicken is (I THINK) cooked in peanut oil. The taste reminded me of Chic-Fil-A, which is great because there isn't a Chic-Fil-A in Las Vegas so this is as close as you can get. The overall taste was good but I could feel the greasiness of it sinking to the pit of my stomach. I am almost sure that if you ate a ton of these chicken fingers you'd get a sick feeling.  The fries were those classic crinkle cut \"Ore Ida\" fries you'd see in the grocery store's frozen food section. The fact that they were crispy and that they gave me so much of them was a plus. There were so many fries that it was the only thing on the plate that I couldn't finish.  The coleslaw was the only thing I was dissapointed in. It was rather dry and they give you a little cup of it. Cole slaw is cheap to make so I don't understand why they would give you a hug pile of fries enough to feed 3-4 people... but then give you this little itty bitty cup of coleslaw... plus there was no real tang to it. Some restaurants will add some type of pineapple juice to their coleslaw to give it a sweet tang whereas Raising Cane's is just bland.  The sweet tea: I cherish these guys for being one of about 3 or 4 restaurants in the Vegas valley that ACTUALLY has sweet tea.  I think it was about $8 or $9 for my meal, which seems pretty pricey, but the amount of fries they give you makes up for that I guess  The sauce they use is good, but to be honest I've had way better sauces with chicken fingers elsewhere and I'm more of a honey mustard type of guy. - If they could get the honey mustard that Outback Steakhouse uses on it's \"Alice Springs Chicken\" this place would be killer  The ambiance: This place is usually always PACKED from what I see. My daughter and I literally got the only table available. It has a modern \"cool\" factor because they have Spiderman 3 and other \"modern\" movie posters on the wall. I get what they're trying to do here. Their trying to appeal to the younger crowd by putting up posters of recent movies. This seems really pretentious to a 32 year old guy like me though.  Beware of douche bags coming in and out of this place! When we were there there was this loud and obnoxious group of 30-40 year old guys all dressed in cheap suits without the jacket... I kid you not, they all left at the same time and they were holding these \"Free Hugs\" posters they made themselves with a sharpie. Sunday weirdos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XlW0fpO5JN2CxKswMoiT2A"
  },
  "FpAY3B4Hi47TZhPpUiFMbA": {
    "date": "7/13/2016",
    "text": "Love coming to this place the food is good the drive thru is fast and the staff are really friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDlaL9IpD_K8mF0Dm7Ofyg"
  },
  "BukhWgLztZEpht6MgASAtQ": {
    "date": "2/28/2017",
    "text": "Came in the morning time the staff was so amazing I couldn't believe this is a fast food restaurant. Morning staff you're amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65QJbqsxQcz80zcg7-KL7Q"
  },
  "eBR43yDYisJkAHfv_IN66Q": {
    "date": "10/30/2014",
    "text": "Busy for dinner! Cars were wrapped all around the building and almost all tables inside were occupied. I was surprised to see how fast they move because we didn't have to wait very long. It is one of the best fast food chains so I can see why. They also have great combos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LxMHIqySFWXWhPjiLhir1g",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Busy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LxMHIqySFWXWhPjiLhir1g/o.jpg"
      }
    ],
    "user_id": "-kRQLEDxrEBVNXImyAt_ug"
  },
  "E6my8NiS0ZrTSGa2GLj3Uw": {
    "date": "3/25/2016",
    "text": "Love Raising Cane's. We eat here at least once a week. On a road trip to San Diego my 4 year old wanted chicken & french fries. So we stopped by McDonald's, he saw their nuggets and said no, not this chicken, the other one. Lol.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3VXdMB78tDvJcbGAIhqNmQ"
  },
  "HdIKihf5XB0GaDSw-lDEKQ": {
    "date": "1/17/2015",
    "text": "I must have ordered a vegetarian combo as there wasn't enough poultry in my meal to spark a PETA protest. Perhaps they were running low on chicken but my fried strips were not much larger than a French fry and contained little to no chicken. Far different from the location on Las Vegas Blvd which always has plump, juicy chicken strips. Even my dog was unsatisfied and went in search of table scraps elsewhere. 2 stars for the Cain sauce though!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e9DEAkL6PK4ICCDivQOZmQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Where&amp;#39;s the chicken? Seriously, my Caniac Combo had about one Cornish game hen breast worth of chicken. Very sad for a $10 meal.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e9DEAkL6PK4ICCDivQOZmQ/o.jpg"
      }
    ],
    "user_id": "Afbd0ey5f9dOE37pejMckQ"
  },
  "A1mLjMQWbIAVr8jFtaVJvg": {
    "date": "1/11/2012",
    "text": "Ate here two days in a row. When ever I'm in for some guilty pleasures of some delicious chicken fingers, I go here. I have to do some extra running but well worth it. ^^",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wglXRvdSv2UsPS6sxAZ4sA"
  },
  "bKqFseuZF1VxamT8Mdh44A": {
    "date": "9/20/2012",
    "text": "Was skeptical to try them as it looks as just another chicken chain popping up. Very simple menu, chicken fingers, fries, slaw, bread (buttered Texas toast). Not hard, shouldn't confuse the cooks. Was very satisfied with the plump tastiness of the chicken, not overly greasy as some places fingers become. A- in grade My only drawback to this place is I wish they would cook their fingers like an extra minute, I kinda like my chicken a little crispier and a tad more done, just for safety sake. On that note, I don't want to scare anyone off thinking they serve raw chicken, they do not, its the difference between a medium rare steak and a medium one, just personal preference. And i really wish they had a spicy strip. Their slaw is about a C, nothing special and you can get no slaw & extra fires in your meal. The bomb however which I rate a A+, their special dipping sauce which does cost a few cents if you want extra and their sweet tea & lemonade. Yum. Place has always been super clean with a nostalgic travel poster decor and the drive thru has always been lightning quick even with long lines wrapped around the building. 4 stars solid.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "e8Y8NIX1fTmM9kAan859Kw"
  },
  "1vDCwVI32jpujfvmSHkgWw": {
    "date": "11/19/2010",
    "text": "Very good chicken and toast Wish they would carry a box combo with no drink,there sauce is amazing i want to put it on everything, toast is made with garlic and very good.With the limited menu i guess you have to do it right or you wont last long.There mascot golden retreiver is super cute too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s7gMQwX2zansoCEXzvulvQ"
  },
  "RmayY_ubCo-vCTdaHqvIpQ": {
    "date": "9/28/2011",
    "text": "This place didn't live up to the hype that I was hearing. People from around here was saying this place is great! amazing! delicious! It was decent for chicken fingers and fries. The chicken fingers were ok, the sauce it comes with was pretty good tho. The toast they give you is actually pretty good too, and the fries are the crinkly ones, not bad. Their sweet tea was delicious. I probably won't come back for a while, not really craving it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZimZSy0xo1orxXlqWPtIg"
  },
  "SVWYl4ZqB_YaBuLcZkQttQ": {
    "date": "6/17/2011",
    "text": "growing up with canes in the south, it definately takes me back to eat here.  unlike some other posters, canes chicken fingers ARE the best i have ever eaten, but they are really only a vehicle for consuming the Canes sauce!  the sweet tea is also AMAZING!  i dont live in vegas, so as im leaving, i always get a jug for the road out!  a limited menu (in this case) means one thing-  you dont really need much else!  on a trip to las vegas filled with $150 per person dinners-  canes is usually the first place we hit upon arrival!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iByuhcbuYTQkXoYy8sM4NQ"
  },
  "SFUVNOS3gi1l5Bwf_6S1oA": {
    "date": "6/29/2011",
    "text": "When it comes to fast food Canes is a great spot.  Fresh chicken fingers, crinkle cut fries, fresh coleslaw, Texas toast and secret sauce.  That is what you can expect every time you come here.  I love it, my wife loves it and most importantly my kids love it.  The hardest decision you will face when your their is wether to choose the sweat tea or lemonade.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWfos3PxcrkqAJoAZHEg3A"
  },
  "drztBrmlufyQwUkRkThy7g": {
    "date": "9/4/2011",
    "text": "The food is always good. Chicken fingers and fries served with Texas toast and canes secret sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PtM2vbLoK9V-CRy2VogmQ"
  },
  "V-LMZOLzAIsnPBoo3WLdZg": {
    "date": "10/31/2010",
    "text": "I have waited to review Cane's until I had it a few times to be sure it could really be this good. IT IS!!! The Chicken Fingers are fresh tasting and cooked perfectly. The sides are outstanding. The Cane's sauce is wonderful! They give you plenty of food for the money. Nice dine in area. Great service. They do one thing (chicken) and do it really well. Just outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtRL7_SKsErz61WWLRAO8w"
  },
  "zrq4lZbIeMR5s1jASyKPtQ": {
    "date": "11/14/2012",
    "text": "Great chicken fingers and special sauce.  If you haven't tried it yet, you should.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMAq24HLlokwg-83jtK6QQ"
  },
  "6AR-WQtjhEOmVPpEMbwdVA": {
    "date": "10/9/2012",
    "text": "my only complaint is that they need to make their to go packaging different.  I dont come here unless im dining in, in the take out boxes, the chicken and fries get soggy.  I love their food and their tea!  The service is great at this location too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3ESPBcf3NQOi3NkUeSAFQ"
  },
  "sYPCop9MlFU-tdCKo9zDjQ": {
    "date": "10/19/2012",
    "text": "food is good , but it is dirty and a bunch of kids work there and they are very disorganized and unprofessional.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "enP5LsFbA-eEl_ruO53GTQ"
  },
  "Zq7kwvsujmeffXToLxGCWA": {
    "date": "5/8/2018",
    "text": "It was fast they had great customer service! And it was so packed in their but everything came out so good and fresh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R-GsTs24Ay9AzNboXF-yaw"
  },
  "_8hMc1gWD8yL-mxi9-WdFQ": {
    "date": "7/25/2014",
    "text": "I would normally never write a review for a fast food chain.   But this place is great!  1. The chicken is great... yummy sauce, good bread... not big on crinkle fries, but still yum.  But what really wowed me....  2. The service! I kinda expect fast food places with dust bunnies in the corners and lazy teenagers.... But not here! Theres someone constantly walking the floor, wiping tables, cleaning windows, throwing straw trash away from the drink station... and the kicker.... If theres no one in the line, the order taker is opening the doors for customers....  This is the way anat business should be run! kudos to you raising canes!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "n1MUh0PfMHdUmDkB1hXSYA"
  },
  "_xc9uM7E3NmQwM70WoZh5A": {
    "date": "12/18/2016",
    "text": "What can i say...WE LOVE CANES! This location is great with service and cleanliness. ..always fast and friendly.  The manager Mike, always makes us and our family feel welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "25Yq-Bndn8N2UK_kFDu6lg"
  },
  "a5WiT0F2og6LOPFwlwI56w": {
    "date": "6/5/2017",
    "text": "I dont usually write any reviews on yelp but what I experienced today at this location made me really upset. I been to this location more than 10 times since it is located right next to where i live and everytime i came here all of the workers were friendly and nice but today was very different. I ordered the box combo and the caniac combo both with Sprite(Drive thru), but the lady gave me 1 sprite and 1 sweet tea and my brother was sitting next to me and said this isnt sprite so i asked for Sprite and then she gave me attitude towards me and didnt even look at my face when she gave me a new drink and the food. I still said thank u since those mistakes are understandable but she just ignored me and closed the window.  AND GUESS WHAT, SHE STILL GAVE ME THE FREAKIN SWEET TEA AGAIN. Idk if she did that intentionally or the drink machine was broken.. but whatever it is, that lady was like the rudest worker that i've ever met at that location. Idk if i can say her name on here but her name is Lad*****.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hl6IkkWeeB-LfQNRxAeRLg"
  },
  "lDuGMKzPnE4jnEAdJvz9Vw": {
    "date": "6/19/2016",
    "text": "The caniac combo is perfect for sharing! It includes six high quality chicken breast tenders, a large order of crinkle-cut fries, a piece of Texas toast, coleslaw, a large drink and two super secret Cane's sauce. The food here is cooked to order, so everything was hot, crispy and delicious. Their lemonade is made with pure cane sugar and definitely worth the 30 cent upcharge! Although their menu is very limited to those items (there's also a sandwich available made with 3 chicken tenders and lettuce on a kaiser roll), they do it well!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WTvRzLjLnVEzRBuuXqRSUA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WTvRzLjLnVEzRBuuXqRSUA/o.jpg"
      }
    ],
    "user_id": "egeDp4KcOE75oF1FQGnL2A"
  },
  "AbXiSrmQI74ByzQ39TMdfg": {
    "date": "5/25/2017",
    "text": "One of my favorite places. But what a shame that the closes one to me has poor management. I order a 3 piece combo with 3 extra sauces excluding the one already given. When I arrived all the way back home I found only 1 out of 4 sauces. I don't really care about the sauces, but this was the last straw. Every time I go to this place they always forget something. Especially at night forgetting things such as; giving Toast instead of that bland coleslaw and requesting no ice and still given a full cup of it. They only care to get things in and out, not how you like your order.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbE9FZH9ZvEIfrSFV4zp6w"
  },
  "cdxl-YVg2k_kdCyETIuWfw": {
    "date": "6/12/2014",
    "text": "I'm not just going to Raise Cane, I'm gonna raise the roof when it comes to this chicken!! Ok, that was corny, but seriously, you can't go wrong with Raising Cane. It has been years since I'd visited here, but I was in the neighborhood, and thought, \"why not?\" I'm SO glad that I stopped in!   The store was pretty busy with a lunchtime rush, but everyone was super friendly and attentive. One of the servers even came to my table halfway through my meal to make sure that everything was good and that I was enjoying my food. What fast food restaurant does that??! The prices are very reasonable as well.   And now, the food... DELICIOUS. I just got the 3 piece box, which includes 3 chicken tenders, fries, and Texas toast. It was just amazing. The chicken tenders were HOT (I almost burned my mouth), juicy, flavorful, and the breading was just the right amount. The sauce was good for both the chicken and fries alike. The fries were just fine, regular crinkle fries, but the Texas Toast?! I think that I have reached bread nirvana! I swear, I could have eaten this bread all day. It was soft, buttery, melt in your mouth, and just perfect. I found out that I could have gotten a second piece of toast instead of fries, which is exactly what I will do next time!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "lQGJcwX105k17081f6pulg"
  },
  "3Pr0LibYtERk0oSN02GPww": {
    "date": "5/11/2017",
    "text": "I have been going to this Canes almost every week for the last 5 years. I have a debt card with my maiden last name that I have always used and it has always been fine, there are not many people with my name. After being in the er all night, I decided to get Canes and the manager there gave us hell. She said that since my last name didn't match I have to find something in my car that does. While I'm doing that she starts to argue with my husband. In 5 years, this location has never had a problem with my name on the cards. It is sad because I come there a lot, now that manager made me never want to return. I would've gave it 1 star but the food is so good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMcI7UOqMV_xaBEGcYkjQw"
  },
  "-NOGP0hDngrg77VmQ7NUAQ": {
    "date": "7/30/2017",
    "text": "I'm head over heels for these chicken strips. The food always taste fresh. The sauce is delish. The Caniac is our \"go-to\".  The service is accurate, fast and friendly.  On our most recent visit there was a line in the drive thru but we didn't have a long wait. Everything seemed to move seamlessly.  I  Raising Cane's, lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPhTayP7TohoRpmfAhM9sA"
  },
  "o3ZuptIAAf9oarX2wLkT2g": {
    "date": "1/23/2014",
    "text": "I don't visit fast food restaurants often, but I like Raising Cane's! Their chicken fingers are juicy, all-white meat accompanied with a light, crunchy batter. The combos also come with crinkle cut fries, Texas toast, coleslaw, and a delicious dipping sauce (properly dubbed \"crack sauce\") - it's good with the chicken and the fries..and the toast. It's really good on everything!!  The fries are just normal probably-frozen crinkle cut fries, so they're whatever. The bread and slaw are both fine as well. Nothing special about these guys, but they are good with the chicken.  The other menu item everyone really enjoys is the Sweet Tea. For good reason since it's yummy and refreshing. It is a bit sweet for my taste, so I normally do half sweet and half unsweetened for a great balance.  When the Rebels win this season, you can get a FREE Rebels Combo (two chicken fingers, fries, and secret sauce) with your game ticket -- redeemed within 24 hours.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "TdYKJgSgY2GF_YJnwsi5yQ"
  },
  "nII44yDPP4DBLdz_kLOW7A": {
    "date": "10/6/2017",
    "text": "Customer Service is on point! Especially when Zach the manager is around. I always get good service when I eat here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vl7UsKU2jditm5TiXKL8kg"
  },
  "ITwuiR-g4kVJKhpGSMij4Q": {
    "date": "7/22/2017",
    "text": "Great place to get chicken tenders and a meal. Service was great and enjoyed the eat in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8GQ0_rC6PiplOmHgFZYbQ"
  },
  "jTrwY_vVZmohwV8P6IeuEg": {
    "date": "8/15/2017",
    "text": "SO LET ME TELL YOU ALL!!! First time ever to Cane's and honestly the best freaking chicken food ever!!!!! I love their set up and the staff is so so so so so friendly! Clif honestly hooked it up for it being my first time! The food was and is great, the staff is all pure and sweet, and just the entire experience was excellent! Thank you Cane's but especially Clif!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6yQqGOysr-hKr1dmOQdnA"
  },
  "fqfqkVFTqEh1gIVBJFO92A": {
    "date": "2/18/2014",
    "text": "I like Raising Canes but only go there when my friends drag me there or if it's free at school. Or when I just don't care about being healthy.   The chicken is really good and crispy. Small, but 3 pieces plus the toast, fries, and slaw will make you full. I don't ever get the slaw, I just ask for more fries. And speaking of the fries...  Seriously, what's up with the fries? It's like those fries you can just microwave. Really nothing special at all and what amazes me is that I would rather eat McDonald's French fries (& I hate McDonald's). Maybe if there fries were better I would actually wanna come here more often.   & the sauce to me isn't worth another 20 something cents. It's really good but please just give us that shit for free to make up for the tasteless fries.   On the other hand, I do love me some Texas toast! Nice, buttery, crispy and high cholesterol toast. I could eat that all day.   There's no hype for me about the sweet tea though. It's just sweet. A bit too sweet for my taste so I mix it with unsweetened.   I don't come here often, but when I do, I make sure it's when idgaf about eating tons of oily goodness. Fix those fries first and start giving out free sauce, then we'll talk.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "46-qsKjqR4vptCIYrHH1yw"
  },
  "uMYEe4nMhxH6glCHSZrJ4Q": {
    "date": "7/10/2017",
    "text": "The food is good however they're playing with the prices it's all a cart so if you want sauce you need to pay for it every small things play playing with the price be careful",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kX8MjMSXB1tg-3ipmilBYg"
  },
  "QxmFftxNBqvqu72HwI4G4A": {
    "date": "9/8/2016",
    "text": "I just moved here from California and I'm so happy that a family friend told me about this place. The chicken is so juicy and not greasy.  No more KFC for me. I'm in love with this place. The tea is really good as well. The dipping sauce and bread were amazing as well. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V2Su-xF9IIl7zgp5rDczaA",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V2Su-xF9IIl7zgp5rDczaA/o.jpg"
      }
    ],
    "user_id": "WQn0yXFYkQGe_KyV-PW4Nw"
  },
  "w0yvkK0vp8SdlbqAEepX8A": {
    "date": "2/26/2018",
    "text": "Everything was delicious and well prepared, however, I found a piece of plastic in my coleslaw. I've ordered from this place several times and it has always been such a treat. The workers are pretty chill. It's just sad that my coleslaw had the plastic bit in it. The plastic was the same material as a plastic spoon and it was about an inch long. It was a blue color and blended into the cole slaw very well. It was a bit pointy, though. Good thing I didn't pierce my tongue with it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b3Thi1QTlzks2-EvJtSksw"
  },
  "fzeB1M7oLTaDx4w9HMFRWw": {
    "date": "7/17/2016",
    "text": "Horrible.The only thing I can say...  Went to this canes July 17, 2016 through drive-thru and asked for our order. The woman who was taking our order kept laughing randomly and I had to keep repeating my order. After I was done with my order, I payed and received my food and already she messed up my order with the drinks. I then told her that she got one of my drinks wrong, (I ordered a lot of food for my family), and she didn't even apologize but then grabbed the drink and gave me  some kind of attitude while handing my corrected drink. Upset at the time I just grabbed the food and go. When I got home I specifically told her to give me extra canes sauce for the box combo and I she couldn't get that right. Very bad service there. I don't blame canes because I love their food, but I blame the manager who hired that employee. Sorry not sorry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5kgDWB7uZX4jxB6dyI3nA"
  },
  "VpSr14R-aChOYbAdEzuTWQ": {
    "date": "6/7/2017",
    "text": "A Vegas staple, just wish they didn't charge extra for Cane's sauce...seems a little \"nickel and dimey.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-2hEbM6h5x3Pnnq1MY5UQ"
  },
  "YIt2xtkNc7OscZJz3tYsmA": {
    "date": "7/26/2017",
    "text": "The chicken strips are amazing I would recommend this place for  it's not too expensive",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2c0wLa_4F50_cyx_Q8Q9HA"
  },
  "vEbeknpMmceg28VCUCNY8g": {
    "date": "5/17/2017",
    "text": "If you like good food then you'll love Raising Canes! Don't let long lines get you down because they are really quick. The customer service is always on point whether I'm in the drive thru or eating in. They offer great portions and good prices.  Deliciously moist and always fresh chicken that comes with a side dipping sauce. Depending on what plate you ordered, your chicken will usually be accompanied by hot fries, coleslaw, and the best Texas toast you have ever had.  I recommend getting their sweet tea, they even have the delicious little crushed ice cubes.  Tip* Buy an additional sauce- you can thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0UcRHvNzY9oce0Zd5feDA"
  },
  "4H45HaXQ1boPNprdo_BShw": {
    "date": "4/5/2017",
    "text": "The only fast food place I enjoy going to. Always has good customer service. Chicken is always fresh. Fries are good and bread is even better. If you get something with coleslaw and aren't a fan (like myself), sub it for toast! Cheap and delicious. Way better than popeyes and kfc",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTimtxT3p1zKrtfP9JRuZA"
  },
  "KDKkPm38ukWNxZxywinxwg": {
    "date": "10/1/2014",
    "text": "It was our first time at this location, and it did not disappoint. There were plenty of tables inside, and they were quickly cleaned once the customer left.   We split the Caniac, which is 6 chicken strips, fries, Texas Toast, Cole slaw and two Cane's sauces. It was excellent. As always, Cane's food come out steaming! The cole slaw was ice cold. Perfect.   I like that this store was clean, inside and outside in the parking lot. Always a pleasure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bnk8hI3N5tprKm_lMK4I-w"
  },
  "s3CqxlQ_u9snneVyUvnqBg": {
    "date": "8/26/2018",
    "text": "I love this location! Can you guys please train your Las Vegas boulevard, near the premium outlets location how to make the sweet tea correctly?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7fYbdms83P8Ij91vcmJMcw"
  },
  "m0-CvQoH0PCfXCyz_3IJ-g": {
    "date": "10/20/2017",
    "text": "A 3 piece chicken finger sandwich, fries, and a medium drink for $6 is an amazing deal. Cane's sauce is amazing but they don't put enough on the sandwiches so be prepared to pay an extra I think .29 cents for a cup of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SvW1e1h0N47TkAcAuWGKqQ"
  },
  "AlRxlcnPoSD8RMk1TqdhLA": {
    "date": "8/18/2013",
    "text": "I love Raising Cane's!!!!   The chicken is so tender and the batter for it is delish. The toast is oh so good. And the sauce is freakin CRACK SAUCE!!! The fries is good but it's fries. Now when you dip it into the crack sauce oh then it's a whole new world.. Especially the chicken and toast. OK all three of them toast, chicken and sauce are CRACK.  It makes you want to go back for more. Just dip all of them into the sauce and hope they give you extra sauce. If not I'm sure you can purchase it. I just wish the chicken was a bit bigger or man I think they need to give more. LOL   But hey if your in Vegas or TX hope you stop by RC and if you love some chicken. I'm sure the sweet tea is good but I'm not a tea kinda person unless it's with some small finger sammie.   OH yeah this location is great and has friendly people.  They are fast and efficient.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Vt53YsNGiAmq-3Veo_ArZQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vt53YsNGiAmq-3Veo_ArZQ/o.jpg"
      }
    ],
    "user_id": "zh7sSdnM3CefK8RBRWahZQ"
  },
  "iYnZN6kmApuhtlQ0a7XXig": {
    "date": "1/31/2018",
    "text": "I already love Cane's but the Cane's on Rainbow is always so clean and the employees are always genuinely welcoming. Kaylee is the friendliest employee. I watched her clean the whole lobby the whole time I was there. She even took our trays when we were done! She provides excellent service and I hope she is appreciated!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-mDhOAzcyN_uEBGwiZY4Q"
  },
  "2c4Bt4n7frq-5duudqaLNQ": {
    "date": "10/28/2017",
    "text": "Little girl and manager were both rude as hell my card works fine else where and at other terminals  in thier store but they wouldn't take my payment or even enter it manually. Truly ignorant and annoying long day just wanted a quick meal. I come here all the time. That register has issues I see them swipe cards all the time a few times but I'm done with this low grade service. I will never return to this location the food has honestly gone down hill in the last few months customer service is not great eiather obviously. So I think I will just not go to canes any more. I have been going multiple times a week.. so I'm gonna just start eating cleaner anyways not this garbage thanks for opening my eyes I'm gonna pass the word along as well. ",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yLQqSwepH9NkQjH4luKQug"
  },
  "yuAXbyAzIe1KYA2kL56mNA": {
    "date": "7/26/2018",
    "text": "The food is awesome. If you have not been, stop and get some. Well worth it. Glad a friend told me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n9j7X0apzINOJHxd7TqoNQ"
  },
  "7gyZjQgecnQtEgP5zfIsJw": {
    "date": "6/5/2015",
    "text": "If somebody could please explain what the big hooplah is about this place? I have friends that rant and rave about coming here when they visit Las Vegas! I've lived here for about 8 years and have been maybe 3 times! They are extremely overpriced and all for some chicken fingers? The canes sauce is whatever I'm not sure why they glorify this sauce or even the chicken strips! I'm not saying they are nasty I'm just saying that a 6 piece chicken tender meal shouldn't be basically $10! I'd rather spend that at Wing Stop and be on my lucky old way! The fact of the matter is there aren't any flavored you can change to and the sauce options are minimal to none! Only way I'd ever come back is if somebody is paying for me :-)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k05XNQC22lLPpWMLrOR-Wg",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Interested In The Caniac Combo? It will run you $9.50..worth it? Not quite..",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k05XNQC22lLPpWMLrOR-Wg/o.jpg"
      }
    ],
    "user_id": "qPVtjjp8sNQ32p9860SR9Q"
  },
  "u00wS6k_lMcVqXBi_-wqEA": {
    "date": "11/1/2016",
    "text": "Vegan friendly they got coleslaw on deck lmao!! Workers are turnt felt like edc when I walked in. They were playing some jack u when I walked in. Ambiance, well if you a crip don't be walking in here place is painted red. Other than that gotta have my chicken yo",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gzvLRofjsCovIHbjSHtmVw",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gzvLRofjsCovIHbjSHtmVw/o.jpg"
      }
    ],
    "user_id": "cdB_dIYHieklXNyvmrXweA"
  },
  "g63uCioez7t_uc212GcZoA": {
    "date": "10/2/2017",
    "text": "Raising Cane's is our favorite place for chicken fingers.   That pretty much all they make.  The cane sauce is awesome and we love the consistency no their food.  The Texas toast is our family favorite and we sometimes replace the Cole slaw and get double toast.  I like the slaw (so I get some kind of veggies!).  We also love Raising Cane's because they support our local law enforcement and that is important to us.  We love this place and you will too!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XFhyeDMz4MSYuub2hRVOpQ"
  },
  "D51NEQ-kM3LeKP1YZl7fYQ": {
    "date": "8/12/2017",
    "text": "Went early and only had one car in front of us in the drive thru. We wait 15 minutes for our food to get home and see that it is wrong! We ordered two Caniac meals no slaw extra fries and then two extra sauce and three toast somehow ended up with 7 pieces of toast and a handful of fries! Between the two meals what a waste! Ice was melted because drinks were given right away, fries were cold and chicken didn't seem fresh have no idea what took so long!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYjl5n2WecRBJWSyTx6Jwg"
  },
  "xpMdaYa2ec6Ldm8t1Q54Pw": {
    "date": "8/24/2016",
    "text": "If you love chicken fingers this is a great place to try. I'm particularly in love with this location because when I was moving into my current house I stopped here for lunch and when it came time to pay for my meal the cashier told me that it was free today. Some customer before my paid it forward by paying for strangers meals. It was just before christmas. What a great welcome to the neighborhood.  Regardless of my awesome experience the food here is always great for fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1st2ltGKJ00ZcRsev-Ieew"
  },
  "RGNQ1CWwF04OwsqQHSu5Tg": {
    "date": "6/24/2017",
    "text": "This place has gone down in customer service and the amount of food they give. I came here tonight and got 2, 3 finger combos and both of them has almost no fries that came with is. Are you guys rationing?",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xMW8m4qQEclsap2FSwrNIQ",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Canes is now Rationing Fries.. smh",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xMW8m4qQEclsap2FSwrNIQ/o.jpg"
      }
    ],
    "user_id": "D6jhIuUXoLKmsF-rInBnOw"
  },
  "5sjz-zs23u8BSsAZi-9jDQ": {
    "date": "11/25/2016",
    "text": "We live on Tropicana and Decatur so this is the closest Cane's to us. We absolutely love this Cane's. The customer service and the food quality surpasses most food establishments.   Our food always comes out hot and fresh. Not sure how they get the food out so fast because it's always right out of the deep friers. The staff works fast and they are extremely helpful. They don't complain when I ask for things. Especially the Assistant GM Michael, he always has a smile on his face and is ready to help with any problem I might have. Thank you Cane's for treating my family and I so well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKwrhJTfzS4Go0pvPa7xow"
  },
  "fA8kHdw_O72wKGTrTec2zw": {
    "date": "8/17/2016",
    "text": "First time and it was pretty good! They are known for their chicken so all the have is chicken nuggets, but they're good! They have this special \"cane\" sauce and it was okay I couldn't quite figure it but but honestly I like chik-fila sauce better! Cool place to try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E63DvbIQptvI05F63F1Bdg"
  },
  "shdbTFZ0M1QkgacuVToUEw": {
    "date": "8/9/2016",
    "text": "I just wish my chicken was more fresh and hot. But service was really good and they're tables are almost always clean. Solid food, they toast is so bomb",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7sVRYWSskPEv9veCYes-g"
  },
  "XkH1_qVyn8QIpNrBrU8Eug": {
    "date": "9/2/2016",
    "text": "Best chicken tenders. Love this one, very fast and friendly service. Don't forget to get hot sauce when you come here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UJxX68pqVqltRLaWY3CB1w",
        "caption": "Photo of Raising Cane's - Las Vegas, NV, United States. Caniac Combo.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UJxX68pqVqltRLaWY3CB1w/o.jpg"
      }
    ],
    "user_id": "1uO7nwlNX3PRmdN7mxZ-PA"
  },
  "Wka5NBdOMawbbVEMzKF32g": {
    "date": "4/12/2016",
    "text": "Drive thru is always fast! Love that this place is on my way home!! Hard not to go here when they are so bomb!!!  Order the box with extra toast! Get em",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mxw5FCfuqgZmMtuqK9Uc_A"
  },
  "L-xzyRGOmlNRvbei5D4o3A": {
    "date": "9/23/2010",
    "text": "I'm not sure, if I've eaten here before. I heard so many stories that there chicken is delicious and the sauce & sweet tea is to die for. So I had to try it. I got the 4 piece meal with large sweet tea!  The chicken was fresh and DELICIOUS! The best thing ever was the special sauce! I dipped the fries, chicken and texas toast in the sauce and they only gave us one container. They need to give us more special sauce. I was actually impressed with the meal overall. I will def. eat it again in the future and maybe at least once a week. A must try, if you like chicken strips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yPrXlvbECGKHSZTy9usWA"
  },
  "qM1mgLC0Y2ZGDlddsyFqfw": {
    "date": "4/17/2012",
    "text": "My first time trying Raising Cane's.  I got the box, and I liked the chicken fingers, the dipping sauce and the coleslaw.  I am not a big fan of Texas toast in general so I can't gauge how good it was. I am not a big fan of their fries.  Overall, I like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Hhz6FGgvi9qd1q6PR0AEA"
  },
  "xovvJxJ6SxxdDxu6g-v-Kw": {
    "date": "8/3/2010",
    "text": "Raising Cane's is awesome. I always order the Big Box, The Fingers are made fresh and come out HOT. So its best to let them cool off for a bit. The French Fries are good, offering Onion RIngs wouldnt be a bad thing. The Staff are always friendly and checking to make sure everything is ok. Something about the sauce. I prefer the Sweet Tea. You wont be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2N4y0VeZ-3TtmBVCSVVnQ"
  },
  "fkyBCInit2L-KepqeP4JEw": {
    "date": "3/9/2015",
    "text": "Came in last night with the family and food still lives up to its reputation. Not much have changed except the prices went up for 2015 and the chicken got smaller. Not too sure what the deal is with that but I sure hope it goes back to how the portion sizes were before. I would still go to this location but would seek a different option for the price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQJs4-t7FIhMD3z2HkSs9A"
  },
  "JtaWnNdRE-N90EHOcHSX9A": {
    "date": "2/23/2015",
    "text": "Visiting from Michigan I believe these are the best chicken fingers I have ever had.  The fries and cole slaw were very good. And how come nobody in Michigan can make sweet tea?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWXfqZWLt9CIWqlEpJKHPg"
  },
  "AtNDrrU5HDnADQyba4EidQ": {
    "date": "5/28/2012",
    "text": "I LOVE RAISING CANES. Their chicken fingers surpasses any other chicken without a doubt. Their toast is to die for also. My absolute favorite place to eat. Their servers are very friendly also. They deliver the food to your table and clean up the tables very often. You can't go wrong with this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vS4AxqL42Y7r741YOJ62_A"
  },
  "5p9Xn10usXoFOL8xT5gfLw": {
    "date": "4/26/2013",
    "text": "I was so impressed with Raising Cane's customer service today at the location on rainbow I had to create a yelp account. Very rarely if at all do you go into a restaurant(fast food or not) and get approached by management to make sure everything is great and bid a good day by staff that didn't even see you up until you left. Even if the food was bad, which it wasn't, it was great, I would still go back strictly based on the pleasant experience I had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gX3KYFQc9NnZLPYVqlj3Wg"
  },
  "00B6W7S451nar7JiwzTXvg": {
    "date": "3/5/2012",
    "text": "This wasn't my first time tasting Raising Canes. But it's been a while since my taste buds could remember so I decided to refresh their memory.  So I got the \"most popular\" combo, The Box - 3 fingers, fries, Texas toast, Cole slaw and special sauce. I will admit the quality of the fingers is great especially for fast food. However, my fries were chewy and I could tell unlike their fingers, this particular batch wasn't fresh. The Cole slaw was nothing special (and I actually didn't even bother to finish it). The Texas toast was mediocre and I've honestly had better store bought toast.  Lastly their sauce... when I dipped my chicken in and stuck it in my mouth, I didn't experience any fireworks or any \"wow\" effect. It didn't make me want to chug buckets full of this stuff. It was just ... eh.  The fingers get 2 stars and 1 more star for service since the cashier greeted me with a whimsical chicken rhyme.  Raising Canes is great on the go but I suggest they sell the fingers by themselves. I don't need the extra fluff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "53hTHxGUy7AC8Oz7BE7-3g"
  },
  "C0yTT0-YAOcHp5LH7zmYEQ": {
    "date": "7/14/2012",
    "text": "Sweet tea and toast is the bomb and this place is famous for chicken! A lil pricey though, but good food. I still like chik-fil-a better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mayfrqKhik8Dg8GZ_7YVqQ"
  },
  "VVNRMpQvoy9ilNgmQ9-guA": {
    "date": "8/11/2012",
    "text": "Its not often that a fast food restaurant deserves four stars but canes almost deserves five. Good chicken, fries, texas toast with sauce to die (would love to know their secret recipe) all washed down with fresh brewed sweet or unsweet tea for less than $6 per person. All quality ingrediants. Served with a smile in a comfortable and clean atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBenF2ly5Ig285-9u_1EXA"
  },
  "dxlQArVNOuhK9vpd5NvydQ": {
    "date": "8/9/2010",
    "text": "I LOVE THIS PLACE!  Simple menu with tender chicken strips, fries, toast, and SWEET TEA!  YEAH!  I actually give this place 4.5 stars because I found the slaw to be somewhat bland.  Been at this drive-thru two Vegas trips in a row, now.  They should open these in Orange County.    Attention, Raising Canes Management - Portillo's of Illinois pulled it off in the OC.  You can too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORvJVxlejsZyE4HvDCGUAg"
  },
  "u1W_VA9bat8nLA1LrC0KNQ": {
    "date": "12/2/2013",
    "text": "Of all the times I've been to Vegas, I've never tried this place until today, and boy, am I glad I did! I didn't think chicken fingers would be so special but these ones are delicious. It's fresh and hot, with meat so tender and perfectly fried batter. The batter was just right, not too thick and very crispy. Better than KFC, Popeyes and Chick Fil A nuggets, even though I still love the Chick Fil A spicy chicken sandwich. The Canes sauce, which some call the crack sauce, was also pretty good. Seems like a mixture of thousand island, ranch and some peppercorn sauce. I just wish they had more sauce options. I love the Chick Fil A sauce and honey mustard. I didn't try the Cole slaw because I'm not a fan of slaw, but I'm assuming there is nothing to write home about it, like the fries. Nothing special. However, the Texas toast was yummy. Soft, buttery, goodness with a nice crisp on one side. They also have fresh brewed sweet tea and lemonade, two of my fave drinks, separate or as an Arnold Palmer. I wish this chain would come to Orange County, CA!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0urPgANj0qneKbAyaHg78g"
  },
  "Xr7VX3_K9m5xV6OnRqMgXw": {
    "date": "8/21/2014",
    "text": "I gotta be honest when I heard they didn't offer ranch in a place that serves chicken I was a little upset, I mean ranch and chicken go hand in hand. Boy was I in for a pleasant surprise the house sauce is amazing and the chicken is cooked perfectly. Definitely a returning customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a75COLntnJdY8T33GdFc3w"
  },
  "gQ22CIUTeRWQ7jgW60MHSA": {
    "date": "6/24/2014",
    "text": "After a couple of long nights of partying at EDC there's nothing better than  some deep  fried  goodness to fill the belly. I have never heard of this place until my sister's boo started to rave about how awesome the chicken strip were when passed by one . So what the heck I'm going to give this place a try with my bf.  The only thing I can compare this place to is chik-fil-a.  The boyfriend got the box combo? I believe and i got the 3 finger combo. The toast is amazing and the sweet tea is to die for. Well, not to die for but still one of the best sweet tea I have tasted in a long while. The chicken strips are juicy and the fries are just regular crinkle cut fries. The cane sauce is okay. Reminds me of thousand island and French dressing put together. But the chicken strips tasted wonderful without any sauce.  The boyfriend says the coleslaw is whatever. Overall, the place is good for the price and the portion is good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlkoEVCzt8DFHfKKbMew5A"
  },
  "026CQ_oots_uiKUzEe1U4Q": {
    "date": "1/17/2012",
    "text": "This place is DELICIOUS!! My boyfriend took me here while we were in Vegas, it is a bit off the strip but so worth the drive. I was there for three days and came twice for lunch. Their Texas toast is super addicting, chicken fingers is perfect not to greasy. The staff are funny and friendly. Love this restaurant!! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqA_JOIxAnXDNV6ccyT1UA"
  },
  "xr8Mhxmu0w3VMQpvL7HRxw": {
    "date": "5/12/2012",
    "text": "Delicious chicken fingers.  Love going here for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tyZJHeEEmGya4ucsgKsRqw"
  },
  "1nBmh3L4UHsbwSuHT5zAcQ": {
    "date": "11/13/2011",
    "text": "I came here back in February for the first time, my friend who lives out here said we all had to try it. They serve nothing but chicken fingers, I'm serious, just chicken fingers. I was hesitant to try the Cane Sauce (I heard more about the Sauce then the chicken from my friends) and I am very glad I tried it, it's amaze-balls!!!! I have to come to Raising Cane's whenever I visit Las Vegas, it's a must no matter what my plans are.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJ5iNcvHPehUfBlqqb5O1w"
  },
  "Lc7OBvpJ-DDJPtydutWqzQ": {
    "date": "2/21/2011",
    "text": "I came here not only because I saw it on Yelp but because some of my friends told me to. So I brought my neice and nephew since they wanted some chicken fingers. We all got the 3 piece meal which included, duh, 3 pieces of chicken fingers, piece of bread, fries and a drink. The bread just reminded me a little like Hawaiian bread, slightly toasted. Fries were just ok. Sweet tea was good and I could feel the cavity creeps starting to make a home as I drank it. Chicken fingers were crispy and seasoned nicely but the secret sauce was THE BOMB YO! Yeah, I said \"the bomb yo\". You taste it and wonder \"what the hell is in this?\" I was trying to figure out what the flavors were in this sauce. It could have been ass juice and barf for all I know. Actually, it seemed to have a thousand island background. Ranch too? I dont know. But it was hella good. Yeah, I said hella.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a-IAde3fcwbX8EQrkApyBw"
  },
  "UbiL8PaSWFTbyli6hZpHUg": {
    "date": "11/21/2013",
    "text": "Hands down the 2nd best fast food meal I have every had (1st is In & Out Burger sorry!) This place blows chickfilet out of the water! The chicken was very fresh and tasty and the portion sizes were pretty huge as well! Store was very clean. Only complaint that it is very tight and cramped but they for sure packed them in at lunch time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ne-7caCLAk2j3kD7tzBGw"
  },
  "9myfMSTl-hlbh8j0GVmRXg": {
    "date": "11/29/2011",
    "text": "The food was good.  I got the regular chicken finger basket that came with coleslaw and texas toast.  The chicken fingers were nothing special and the Cane's Sauce was alright, not as great as everyone led on.  I am disappointed that they don't have ranch dressing... The coleslaw was good, if you like coleslaw, not like KFC coleslaw but still good.  The Texas toast was probably the best part of the meal, as silly as that sounds, it was phenomenal.  Honestly, this is a quick stop for something different on the go, pretty good overall.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QXtasoVTQJuEjbmbLsDGA"
  }
}