{
  "lsz7XQutExfuKj8X96Yndg": {
    "date": "5/17/2016",
    "text": "Abdul at the main desk was charming and the cook prepared some of the best kubideh and shish kabob I have had. The dishes are filling - kabob, rice, pita, salad, and kachummar with sumac, yogurt dip, and spicy green chili sauce on the side.   Very fair prices, fast service, and great location only minutes driving from the Strip. I will return here when I visit Vegas again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4X9FdYlEixVRqiUKX6jNyg"
  },
  "4EK2nZIEtNgGzMd5KlYOXA": {
    "date": "9/1/2017",
    "text": "Don't come here if you are in a rush, definitely not \"express.\" We came in at 1:30 and it took about 25 mins to get food. The food is marginal, but the prices are acceptable. The chicken in the shawarma is plain and all the ingredients are also plain. Bread is 2 stars. We also got the tandoori chicken which was a little better with more flavor. The rice was the only thing that was good. We will go somewhere else next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-L6cUtD2AdBIdfsJoAHdiQ"
  },
  "vbTRjZeX39lFawxADymtAg": {
    "date": "4/6/2017",
    "text": "The wait is worth it! Your food is cooked to order. Quaint place with really good chicken kabobs that I am still craving again. I loved the spices on the chicken. I ate everything on my plate- it's that good. Great service and good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "caSVE56zYjSqXc8JAEF0HQ"
  },
  "80sxJ2w_By9413AxDvSVZw": {
    "date": "6/25/2017",
    "text": "The Shawrma was good but it doesn't fill you up atleast for that price. I would prefer to go next door to El Tizon where for about the same price you can get a pretty good sized hearty meal but thats just my opinion. The mexicans sure know how to feed people maybe one day they can master the kabob and open one up of their own mexican version of a kabob joint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EIQRQ3f6tdr7Fx6J5xOy4g"
  },
  "HZ8tbF4phunwTXO8IQ4OVA": {
    "date": "3/21/2017",
    "text": "I was in town for the asd show and I stopped by for some halal lunch. We ordered beef tikka kabobs it was delicious. Khalil was real helpful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eTnthK0fFglZr9MkofRRkw"
  },
  "EUcOq1idh2vx9cuSMRg6iQ": {
    "date": "10/11/2016",
    "text": "You need to try the Kofta kabob, made with ground beef. Very good value and good quality food for the prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "uQ45Qe1LuafoIs0p3OjqJA"
  },
  "LFn7yrtWqe2-ZVojyfNEUA": {
    "date": "7/27/2017",
    "text": "Fresh, healthy food. Excellent, authentic flavors. Friendly employees. Good value!   You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YOz6X_7H1TSXFghH7306Ug"
  },
  "m-pQS45Akn_ccZeq7pH_SA": {
    "date": "6/6/2017",
    "text": "I eat here about once a week on my lunch break.  The service is indifferent, but friendly enough.  The Kofta Meal is absolutely incredible for the price. The rice is well seasoned, the tabbouleh is fresh, the pita is crisp. It's just tasty... and it doesn't make you feel awful after you clean your plate.  Don't expect a Michelin-star experience. But if you come in hungry you'll probably leave satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSDie7Nl_CZ9mFOvjXo-hg"
  },
  "9RiChSHSwo8BHnxhCGln4g": {
    "date": "6/4/2017",
    "text": "Not a good place to eat kabob. Meat has no flavor, salad is bad, drinking yogurt is horrible",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2smi24AvUk6b8sqO3FVYA"
  },
  "w_u-kNmirkOcyPNJ-SjxtA": {
    "date": "5/26/2016",
    "text": "This is the place. The King Sultani is my favorite. I've tried many similar restaurants back in the San Francisco bay area, and was hoping to find a local one after moving to Vegas. So now this is my go to place for some nice kabobs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uOO1KxVA5thLkma6UHQepQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. King Sultani, mine has no veggies because I replaced it with rice.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uOO1KxVA5thLkma6UHQepQ/o.jpg"
      }
    ],
    "user_id": "kmnTBVGZ_rqOFfwUERmDig"
  },
  "mBtEx-bgk8pJlaCt39j6Cg": {
    "date": "11/8/2015",
    "text": "This is a small place in a strip mall. Nothing against that as long as the food is good. And, the food was very good. Not the best middle eastern we've had and the menu was a bit limited, but still good and satisfying. I took off one star because I think it was just a tad higher in price than I think it should've been given the portions.  Although it was good, we'll probably try other middle eastern places before returning. Not enough wow for the price. The 3 of us spent $40. At around $33, this would definitely would have been a 5 star experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_RlWNkoiLYpijlb89V-CyA"
  },
  "cC_fdAw2HfedRGjTWUGr4g": {
    "date": "12/30/2017",
    "text": "Not a great price to Value ratio but the food is fresh the service is good portions are descent",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MSPyS_eBA1npoTDjA3Sq1w"
  },
  "WmMQLhUa40gpAfssNspnBQ": {
    "date": "11/26/2015",
    "text": "Place was kinda disorganized and the owners looked lost, But at the end of the day I left with a smile  The chef in the back knows what he's doing. Try the kofta #4 Literally best Persian food I've ever had, yes a  very bold statement! Food came out fast and fresh. Prices are decent  And Food is also halal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yn0RWz2FBRaYNbev4wdAzw"
  },
  "S-tamWMRvljwQWNT3agejA": {
    "date": "8/23/2015",
    "text": "The owner did call me (not because of this review), but because his worker did tell him I wasn't happy, so that impressed me. Most owners won't do that.  He offered me a free meal & while it was ok, it still wasn't upto the standards when I went there the first & second time. The eggplant dish was HUGE slabs of eggplant instead of chopped up, so I had to use my teetch to cut it. It also didn't have that same taste.  Oh well, they tried.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0LHevpOrufWaU8pBiTc4gQ"
  },
  "zak3VpQbtYrd8MFsi2CETw": {
    "date": "2/3/2017",
    "text": "omg! Quality of the food awesome,taste was awesome,price awesome,management awesome, store was clean and this was my first time here  for the first time will be back!, Loved it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hwVQXnDvdngjjrPka0d2gw"
  },
  "0ZlSfV-2FDHjJZnqrRlynQ": {
    "date": "8/14/2015",
    "text": "Decent food here. Probably the best of the Arab/Muddle eastern food places in the area that I've tried. I am disappointed in the Middle Eastern food in Vegas, but this place wasn't bad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6Pw68sXrchiWGpLc0dGag"
  },
  "yOiowTHmEvp8cPw01cFEMg": {
    "date": "1/14/2016",
    "text": "Cliff's Notes: food was good but the register jockey was a d-bag and I was charged extra for food I never got.  Went in with restrained expectations based on what I read here.  I never hold service against a place, I'm going for the eats, not the conversation.  A friendly chat is nice but not required for me.  Well, the butthole at the counter met my expectations on the crap conversation.  Had an attitude with everyone he served.  Anyway, that's fine.  What's not fine is charging me extra for hummus and eggplant and not giving them to me.  I got takeout so it's my fault for not checking before leaving, right?  Wrong.  It's not my responsibility to check.  But from now on, I will.  Sick of getting shafted like that.  Anyway, won't be back.  I'll try somewhere else next time, someplace they maybe don't care to chat but at least actually care enough to give you what you paid for instead of shooing you out the door to get back to their texting.  What food I did get - a few little meat chunks on a broad expanse of rice with some undressed iceberg lettuce on the side - did taste pretty good so enjoy your second star, you unlovable bastards.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Twzyqs6uBXI8KdDVycEwVA"
  },
  "jz7Z810nygFKXnDbudAcmg": {
    "date": "1/6/2016",
    "text": "Enjoyed dinner here- fresh pita bread, lamb kabob was delicious, beef kabob slightly tough. Friendly service. We'll definitely come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EfXYp2nWE7joBtNvOz8Mjw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EfXYp2nWE7joBtNvOz8Mjw/o.jpg"
      }
    ],
    "user_id": "jDI6UGTDsReXqEs1DTQGLQ"
  },
  "6gHAWCctjUOKq4SZGXNl7Q": {
    "date": "9/15/2016",
    "text": "Great gyros and kabobs, They are very nice and up to speed on all orders, very tasty and one of our favorite places to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "trCrI8BiR9UcJ9UOFPRYxA"
  },
  "eyQlNyZ4knnS7ztYsL82Gw": {
    "date": "3/14/2017",
    "text": "We love this place. Very courteous and friendly. As soon as I order they just know what I was talking about.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WTesav74M1V8fgf4nqw3PA"
  },
  "Lo3VV1K9VU01OlZNDPGqcw": {
    "date": "8/2/2018",
    "text": "First time trying this place out and it is amazingly good! I got the chicken and beef kabob and My husband got the lamb kabob. Definitely recommend, really good food and the hummus and pita bread is yummy. The service is great!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rr50Fh_L1Xlkfe0iuxx5tw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rr50Fh_L1Xlkfe0iuxx5tw/o.jpg"
      }
    ],
    "user_id": "eoVjtojdhPzb72aJrCceCg"
  },
  "GVHDpkmyjYOEleBufUxe9w": {
    "date": "7/30/2018",
    "text": "Probably the best kabobs I've had in years .. super nice guy on register. My friend thought that they could've used a bigger portion on protein but because of taste, quality and price , we were content. Will definitely come here again when I'm vegas , simply for Kabobs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SF_OfY9Q60qgZZE5FEhsg"
  },
  "-matXD9Yq5tMM4J5D5HdhQ": {
    "date": "7/7/2018",
    "text": "I come here quite a bit and it's consistently delicious. I usually get the Chicken Beef Sultani and the meat is cooked perfect, so tender and seasoned perfectly. Definitely a place I will go to weekly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_A22aWWLfdZMufH5gLA0g"
  },
  "5xLlksb7THGYdYd95SINYw": {
    "date": "11/11/2018",
    "text": "I have been going to Kabob Express for several years. It's a casual, small restaurant and the food is of great quality and authentic, often I drive miles out of way to have a delicious Mediterranean style lunch at Kabob Express. Since they make everything fresh on the spot it may take a bit to get your order, but it's well worth the wait. You can also call ahead so that your order is ready when you arrive, whether it's take out or dine-in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sdyuFrdgBHG0JLRtM-zZmg"
  },
  "1DVpp5CIIgTlqnkEp_Wvxw": {
    "date": "11/11/2017",
    "text": "Veryvery GOOD HUMMUS! not dry its truly authentic and flavorful ... i got the king Sultani platter (3 meats) and it was delicious! The green hot sauce was one of the best hot sauces ive ever tasted, and the fish kebob was tastefull too. will be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p8iqefk6wv4ee7rJ71OWVw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p8iqefk6wv4ee7rJ71OWVw/o.jpg"
      }
    ],
    "user_id": "hReKJHrqiehycmFkBKBHPA"
  },
  "iSQ8rKIZCa1VS2eMPSLEmA": {
    "date": "6/26/2018",
    "text": "Ooooommmaaaaagaaawwwdddd!! The food is immaculate. Packed with so much flavor!!! The staff is a little rough around the edges but it might be the culture difference?? Idk..Other than that this place is heavenly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLkEHdnney1pR3_OhN0nww"
  },
  "ivevpTQRlcq5A5SCC0ZnAQ": {
    "date": "5/3/2018",
    "text": "I love King sulltani Express combo super good 3 kabobs side of salad rice and pita also must say they're kofta is very well seasoned and chicken is great so is the beef can't complain about anything if you go there be sure to order the spinach or the eggplant as a side dish both excellent as well as the side salad which is a basic salad with some really good dressing super good with the combo been here many many times live right down the street much props",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3ld1W1Lf4-qePl7uk5sBg"
  },
  "ld_y1C3kouzg_08QuSdqRw": {
    "date": "4/10/2018",
    "text": "Eaten here twice and will definitely be back! Delicious, good quality and generous portions!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zdNuc_skPb5QPfbS5IC_bg"
  },
  "br_V2osk2rE8zeRf4R-9kA": {
    "date": "3/24/2018",
    "text": "Love this place Always clean and good atmosphere  Meat fresh and delicious, sooo many choices  I will recommend this place to everyone",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZiHj3XHG3RaNz8fp-8OdbQ"
  },
  "XqgHw7aSkVikzxexRPlx1A": {
    "date": "7/26/2018",
    "text": "I am from Chicago so I know gyros and this was THE worst gyro I have ever had. I watched him take the meat out of a plastic container and throw the meat, or whatever it was on the grill. Even the fries and tzatziki sauce was bad. That's $10 and 10 minutes I'll never get back. I just oral I don't get sick from what little of it I ate.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5mG6upOI9RmPPKMYpsb3Fg"
  },
  "tDwZ_ZCYBXVj8aDUFo4szg": {
    "date": "7/3/2015",
    "text": "This review is long overdue. My family, bfs family & I have been coming here for YEARS. Out of the many \"kabob\" places in Vegas this is our #1. We love it for so many reasons.   1. Location. It's in central Vegas, close to a LOT of places.  2. Reasonable prices. This isn't a restaurant where you get a small portion for your hard earned money.  3. The amount of food you get is more than satisfying, even the gyros & shwarmas.  4. The location is spacious, you will almost always find a place to sit.  5. You can ask to make your food spicy!   Overall, if you are looking to eat \"kabobs\" PICK THIS PLACE FIRST. You won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0r8pkjv1InXWmD4lvrjRMw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0r8pkjv1InXWmD4lvrjRMw/o.jpg"
      },
      {
        "img_id": "ZKse28cgFPn2F9etOhj9Ug",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZKse28cgFPn2F9etOhj9Ug/o.jpg"
      },
      {
        "img_id": "FJfnHNLvFHls8U4k_8Bj7g",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Kofta Kabob.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FJfnHNLvFHls8U4k_8Bj7g/o.jpg"
      }
    ],
    "user_id": "n9zwrWp8EeB9ODTitKZYsw"
  },
  "UXHr2Ml8SL9-Q9Xk_ruEsA": {
    "date": "7/3/2016",
    "text": "The food to price ratio is very good. The portions are awesome should get just about anyone full. I orders the saltani basically a steak kabob and a ground beef kabob. I like the steak kabob more than the ground beef. The plate came with a basic lettuce salad and another salad consisting of cucumber tomatoe and onions. Almost like a pico de gallo without the cilantro. They also give you a generous amount of flavored rice and a small pita like bread.  I also ordered the hummus it was decent but wished they give you a little more bread to dip in. Overall I enjoyed the meal and would go again.   My only complaint no restrooms. They do have a hand washing station for the customers tho.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2cP2O7GrqGGoIdmf-fruVg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Hummus wished they&amp;#39;re give you a little more bread.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2cP2O7GrqGGoIdmf-fruVg/o.jpg"
      },
      {
        "img_id": "fiLin3QrWF1Xr7sp-WBkcQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. My saltani order a very generous portion for the price.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fiLin3QrWF1Xr7sp-WBkcQ/o.jpg"
      }
    ],
    "user_id": "ewtoMdU18BDfoEnRsQ8QiA"
  },
  "D6V0EN_XIDGPQYm72mMdbg": {
    "date": "3/29/2018",
    "text": "Good kabobs! I ordered over the phone & ran in to get my food. The restaurant was clean and the employees friendly. Would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c49xd2plcBSsBVv2l2-NvA"
  },
  "psXFG8uk6kXKBUR49Alibw": {
    "date": "6/17/2017",
    "text": "Amazing food and super fast!   First and foremost I looked up a place around where I was shopping for something different and found this spot on yelp. It was rated good so I figured why not :)   It took only five minutes to get my food ! And the cashiers were happy to serve ! I would definitely go again super yummy!!  Their beef and chicken combo kabob plate is amazing omg!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "wfQITRiY2M3H-QrkY-0E8g"
  },
  "FvzmMXRjf9MLZk3iwl0qAw": {
    "date": "12/27/2018",
    "text": "BEST afghan place ever. I recomend the bajan. Also, in a really good area. A few minutes from the strip. If you want afghan food this is the place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NJ1fVhe3BIS8gvWCxmEaUQ"
  },
  "bvgYKNAWvQogzQKvGtQC9w": {
    "date": "7/31/2017",
    "text": "Perfect Tandoori Kabob, had a wonderful experience here with a group of 4. Enjoyed to #10 King Platter which comes with Lamb, Beef, and Chicken Kabobs. The chicken kabobs were seasoned with tandoori masala and they were perfect. The other kabobs were seasoned well. Price is great for Las Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "z-IQVu0ij4hSrV_h21lhyQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. #10 King Platter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z-IQVu0ij4hSrV_h21lhyQ/o.jpg"
      }
    ],
    "user_id": "ljQYD8H5dvs1bHsAx1X3cg"
  },
  "pWBX9a8bMwNbX6q3oKmp_A": {
    "date": "5/28/2018",
    "text": "This is a great place for authentic Mediterranean food on the outside of the strip. I ordered the Sultani Kabob. It was so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dg_4VfJ9XsbjjwjbaXGNqg"
  },
  "C46WbDizYhr3kFIn1vTqtQ": {
    "date": "6/19/2018",
    "text": "Nice atmosphere. Good gyro for only $7. Gentleman behind the counter was very nice. Not too noisy, which I love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Prh7tUbHGWa82ZxFR9AfgA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Prh7tUbHGWa82ZxFR9AfgA/o.jpg"
      }
    ],
    "user_id": "2QpJXrskc4qckanknv9M7g"
  },
  "aOepZHtky5PWLNj03T6Yxg": {
    "date": "11/14/2018",
    "text": "Best Kabobs and service in town! Tried a few different dishes and kabobs here and it has always been great.  I'm an Afghan-American so I know kabobs ;-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KyoKci5VsFENbtdCM1HPdA"
  },
  "OODYrZzzUhqKBfILjCfUbA": {
    "date": "10/8/2018",
    "text": "Good food. Good customer service. Nice ambience.  Good for family. Good for Las Vegas area. Neat and clean. Decent for large groups too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOcqV3V73JNmkuL5tiWaCw"
  },
  "nQaTIyhP36dJXVc56XF0tw": {
    "date": "2/17/2015",
    "text": "Delicious, healthy food, good meat, cheap meals, clean place and nice staff. What else to expect :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GGEv6qfyF3N2pe1pIo3P7g"
  },
  "3WZ1ca0xJ9WDiaMxGK2nmg": {
    "date": "4/24/2015",
    "text": "I love this place! the food is always fresh, the environment always clean! reasonable price, Their hummus is so delicious... highly recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2T5zJA8mnJZ_i_TiV-BwA"
  },
  "1lNBaYjgP46jsjwROoygsg": {
    "date": "6/12/2015",
    "text": "They take forever and both the fish wrap and falafel are average. Service was also sub par. They left our meals sitting on the counter for 5 minutes while taking more orders. Meh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4S2TVX7iiCws9vAYG9T0Ng"
  },
  "tbQw6Dz-NRQWMsEQEYIuvg": {
    "date": "12/27/2011",
    "text": "For a place called express this place is slow as molasses. I got a combo plate with Kafta and chicken and my buddy a chicken wrap. Took almost 30 minutes to get out food and this was with the place mostly empty at 8pm on a thursday.  The food was very good when we got it but the wait was just too much to overcome.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wAqiSluTMo_2T-dTN4Bozg"
  },
  "sv7sjPG_gOLXpsZkBDQyWA": {
    "date": "4/18/2014",
    "text": "This is the best Kabob place I've found on the East Side. We usually do take out and the meat is cooked and seasoned perfectly and the rice is delicious. Very gracious staff as well. I usually order the beef kabob and I love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Kez4HyPGo0nDH-8ndaDNA"
  },
  "zdDhe1B9fi9RvIch-GJ1uA": {
    "date": "4/22/2014",
    "text": "Update: my husband went back and spoke with the manager, who insisted that there is no way they can accept paper vouchers despite the fact that Yelp states that they can. Caveat emptor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ir4Ra4dSorn3CxG2iAV_sg"
  },
  "V7Xja4qaWDRybxHfEsKZ5Q": {
    "date": "9/28/2014",
    "text": "Great food!   Awesome customer service!   The chicken and beef are sooooo flavorful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QgzTk60kzihTckmDYd1DoA"
  },
  "-9Aiq-OsTpB-DzQkwvCfyA": {
    "date": "12/26/2013",
    "text": "Kabob express was a very nice Persian experience. The attendant behind the counter was a very friendly young man. He helped us out with the yelp deal and was very accommodating. The food tasted great and the prices were just right for being off the strip, just 2 miles away from MGM. Will be back every time I want some great kabob! Chicken Tandoori kabob was the best!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v3RhNZawhgWw3l0ahI-LFg"
  },
  "DSMrnMFwwTscQfC5Qgtg6Q": {
    "date": "2/27/2014",
    "text": "I ate every grain of the rice.  The meat was perfectly seasoned and cooked.  Easy to find/park.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKaMMaZO5ThNDzJZj2_vzg"
  },
  "rmxrcN0mjokP8vXYWfkf5w": {
    "date": "11/3/2013",
    "text": "Yummz! Ya get in here and get your grub on. Clean, the owner was very personable and friendly. Reviews are accurate, so if you want a kabob, you have come to the right place..",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WPe2n-x6xBNy2GIC5LcpdA"
  },
  "bam6wHluIpbPiu0AwEtdvg": {
    "date": "1/17/2014",
    "text": "This place is amazing. Great food and a great value. Come here every time Im in Vegas for a convention. The owner/manager is really nice. There kabobs are ways flavorful and cooked perfectly. I would definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G02thS0OtzFGV2MYg0Px_g"
  },
  "kC-YLbKjNfcih3831GEuZQ": {
    "date": "2/20/2014",
    "text": "Kabob Express makes the tastiest kabobs on the eastside.   After trying out several kabob places, I've always come back to Kabob Express for lunch or dinner.  Unlike the other kabob places, Kabob Express makes afghan style kabobs.  According to the owner, the meat is marinated for 24 hours to seal in the taste.   Other kabobs, like Persian, don't do the marination and thus requires that they be eaten with sauce (like tzaiziki).   I would have to agree.   Kabob Express' beef is tender and full of flavor.  The chicken is the best from all the places I've tried because it is moist and tasty; the chicken at other places tend to be very dry.  I recommend getting #8 Chicken Beef Sultani for $12.  At that price, it is a great deal because you get two kabobs, one beef (not ground) and one chicken, along with rice, lettuce salad, cucumber salad, and pita bread.  You get a huge ranch dressing and a little tzaiziki sauce.  Be aware that the kabobs are not 100% consistent in quality.   Sometimes, the beef is a little tough, instead of tender, or the meat is cooked too much (dry).   Most of the time, the meat is tender and cooked perfectly (still moist).   So try them at least two times.  Indoor seating is spacious, though with few tables.  Parking is plentiful in the plaza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7E4iVTIsZJu8y_w4_JKg2g"
  },
  "bvytW4ylFBLF-VGQicVhuw": {
    "date": "6/22/2016",
    "text": "Great food - quilt free and healthy options available. Prepared and presented well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9LlEPR40ihQN6opJBK1PQ"
  },
  "u1xl1xpB0YLLkegvq0QaDg": {
    "date": "10/20/2015",
    "text": "Worse service ever! I came in at 5:55 and I know that time to be exact because I came out of appointment next door at that time. I ordered. It is now 6:15 and I  still waiting. The cashier got the manager when I complained and the manager argued with me over how long I have been waiting. He said \"you've been here for 10 mins max\" he I continued to argue with me and in a snotty tone said \"I can give you a refund or I you can wait just like everyone else.\" This is no way to be a manager especially when Yelp exists! I'm still standing here waiting. No apology nothing. I've never been here before and I will never return to a place who treats their customers so poorly. In a world full of options why would I spend my money and get treated like dirt!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AUhEYlUusZOt1vAMzlgBrg"
  },
  "4R5KHdhj2ZJhxbIe_3wwqw": {
    "date": "6/1/2017",
    "text": "i have never been treated worse than I was here they literary 86ed me for having one of their own coustomers kids help me pick up my change i spilled",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UkUCpuMHvJ2ASBw-yv6Aw"
  },
  "hosbrs4DO1dt8ZwFq4BmUQ": {
    "date": "1/19/2014",
    "text": "My mother and I stopped by kind of randomly searching for tacos and when we saw this place we both said at the same time... what about kabob? I turned the car around to go back.. (Sorry Mexican food, as much as I love a taco carts, middle eastern food wind hands down almost every time).   The cashier and cook were bright eyed guys that seemed much smarter then their present positions. The cashier was very proud of and passionate about the food and the cultures it came from and had quite a lot of information to share about the word derivatives spellings pronunciation and history of the same foods in different regions of the middle east. We both found him welcoming and playful, not over serious about the information, just happy to share. he was explaining the language bases of Iran, Afghanistan, and Arab states talking about how Persian language is actually an Indo- European language with a barely modified Arabic alphabet and Arabic influence.. I never stopped to think it was closer perhaps to French then Arabic.  The food...pretty awesome. It was clean, well made, and delicious. My mother was particularly enamored with the rice. The only thing we didn't finish was the pita. it was nothing special and a little dry.  The menu was limited in terms of vegetables. This was my only real complaint. I guess its better to do something small and do it well but places with limited vegetables lowers the standard a little for me. I eat meat but don't always and am a much happier eater if there are lots of  veggies. Wile there were several options for kabob there were only sides of a grilled eggplant dish, a spinach dish, and a green salad and the same green salad with chicken on it as an entree. more veggies please!  The atmosphere was well lit and clean. There was some culture specific art on the walls from Afghanistan (remember  that haunting national geographic photo of the girl with the amazing eyes?) and Iran and there was a fair amount of seating and the tables and chairs were better then usual for a strip mall restaurant but you could still tell you were in a strip mall. We carried out because we were dressed poorly having stopped there after doing some construction in the house. I  was afraid I'd get  construction dust on the chairs if i sat down. And the other diners were dressed like  professional people, some button down shirts a few polo shirts and slacks.. so it was nice enough for me in my ripped and paint covered work clothes to feel well under-dressed. I'd say its classy for a strip mall but you still go to the counter and take your order and get served on a standard red restaurant tray.  Other customers were speaking in what sounded like the few farsi words i know. To have a place be frequented by people of the same culture is always a good sign.  I would definitely recommend this place and so would mom.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XSCf9uT3ZGKU-gF79UFTNQ"
  },
  "_FOmc91VFvqJv1aKUc5Ajw": {
    "date": "5/30/2017",
    "text": "Stopped here on Memorial Day for lunch because our first choice for Mediterranean food was closed.  We were they only customers in the restaurant the whole time we were in there.  The person at the counter seemed bothered that my wife and I were only getting 2 gyros and a side of fries to share and not interested in getting full meals or soft drinks.  He seemed unfriendly and a bit rude.  We did order 2 ice waters which never came.  I also don't like the tablet at the counter that asks how much you want to tip... is tipping necessary when you order from a counter and bus your own table?  I did leave a tip, however, because I was afraid he would only become more upset with us if I didn't!  The food was good but the sauce was a bit lacking.  There is no public restroom in the restaurant, nor in the strip mall that we could find, and not even at the gas station 4 blocks south... ???  We ended up driving to Walmart for restrooms and water!  I am usually not very picky but stopping here for lunch left me feeling disappointed and ended up interfering with our plans for the day.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UHOtxx4fU7XrQk7gbz7SxQ"
  },
  "y8STGtjxHVCY4RGQrlzSQQ": {
    "date": "3/20/2016",
    "text": "Great costumer service! They're very nice and the food is really great too. Highly recommend the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j3ziBcIhmvyxs5cDVkljGA"
  },
  "hZxXvHz3Ub7M2_J1i1hkLQ": {
    "date": "6/4/2014",
    "text": "The food is really good and you can't go wrong with any thing on the menu. The staff is really friendly. We had party of 7 and they let us finish our food without rushing due to closing time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8YU0Vt6Nq3-oJKG48IBnA"
  },
  "LmpyLq6pTYL5yuT8NX5xBQ": {
    "date": "12/13/2013",
    "text": "HUGE portions!!!!!  Love the chicken and the beef... not found on the lamb, but im sure others love it.  The only problem, if you order it there, it does tend to take FOREVER!!!!  you are able to call your order in ahead of time, so that is VERY helpful if you are on a lunch break!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VacS9fgNkuZ3gDqDHViKuw"
  },
  "mK3PEJg-_lFy7KZc0sKS8A": {
    "date": "5/30/2012",
    "text": "So a few years ago I went to a party and had these Kabobs, not like the ones you put on the grill with some onions and pepers some REAL  kabobs!  OMG these were so good they have been in the back of my mind thinking about them for years now.  I FOUND THEM they are around but searching yelp for someplace different on the way home I ran across this place.  Let me just say I'm a pretty happy girl.  I had a hard time deciding between the Gyro and the Kafta Kabob because like I said I had this at a party so I didn't know the name.  So I asked the front guy (I think he might have been one of he owners NICE guy) which he thought I should have, he said the Kafta kabob had more seasoning and flavor, who's going to argue with that, right?  So it comes with a small salad, a kind of pico salsa, lots of seasoned rice and a pita, Kabob oh and a mild hot sauce (very good).  The salad was fresh no icky pieces, nice.  A kind of pico salsa had a bite or two but didn't want to waste space for the main coarse.  The Pita was lightly buttered I believe with maybe a bit of garlic? not sure on that one but it was lightly grilled just slightly browned on the edges and oh so nice.  The rice Mmmm seasoned fresh long grain Mmmmm I took a bite with every bite of kabob so it left a lot less room for anything.  So onto the Kafta Kabobs Oh My this is a blend of beef and just a tiny bit of lamb for flavor a lot of people stay away form lamb because it is quite a strong flavor but you have to trust me on this one and try the blend it is light and adds so much to it, I loved it.  There is many others seasons but come on I'm not that good ;)   Sooo years after my kabob experience I have found it, the one.    The decor is nice it is mellow you can watch the variety of people walk by.  The wait wasn't bad it is a small restaurant btw so if its packed and you don't have time you might want to move on (waited 8 minutes) but if you want food that takes time to taste good then wait.  BTW again I had leftovers big portions and they have a yelp offer check in and get a free soft drink.   I will be back for sure...",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "nQmkyLyN8zbJOCcLlKFksw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Kafta Kabob with free soft drink with check in on Yelp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nQmkyLyN8zbJOCcLlKFksw/o.jpg"
      }
    ],
    "user_id": "dOfw4EqYemgl21qtJ8D9jQ"
  },
  "rEimcQ18_vYV59Ri8J0IIA": {
    "date": "9/27/2015",
    "text": "Delicious food and always very kind people working here. I recommend it for sure! Order extra bread! It's so good that you can't have just one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ipyWOqLrC5ofuNsJkWU9nA"
  },
  "Qgu3HWILPRG7qAZ5iGvXJQ": {
    "date": "7/8/2013",
    "text": "I love kabob express, a friend told me about it and I never know what to think when people tell me about new places to eat, but I was really happy going here.   First thing you have to understand, this isn't a full restaurant, this is not like the hookah lounge; Kabob Express is a specialized place. I often compare this place as the in-and-out of the mediterranean world. In-and-out, only has a few things, but they are GREAT at what they do have, and they have KILLER Fast Food; compared to Mc.D, Wendy, Burger King, etc..etc.. In-n-out isn't as good as some of the high end burger places here in vegas ( if you want to spend 80 dollars a burger). However In-n-out is killer for great food fast. Well Kabob express is the same way, The wife and I went there last night, it was 21 dollars, and she had lamb ( yum) and I had a gyro. The food is fast, it is as good as home cooked, and we love it. We have been there 10+ times and never a problem. If you want really high end mediterranean or some place for a nice romantic dinner, this isn't the place to go. However if you want to sit down and eat some great food after shopping, or a day at work, go here and you will love it..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dFrrVYZfKlyXQ37UuyDGRA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Lamb",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dFrrVYZfKlyXQ37UuyDGRA/o.jpg"
      },
      {
        "img_id": "h1j1AlvzNnNo9b1qpzwL1A",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Gyro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h1j1AlvzNnNo9b1qpzwL1A/o.jpg"
      },
      {
        "img_id": "zthlfGT9eKXpDfu5wh7v9g",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zthlfGT9eKXpDfu5wh7v9g/o.jpg"
      }
    ],
    "user_id": "p_bo9y9kME2s9M4WroDnjw"
  },
  "9HF2Qat_rfKs9flDRBFhkA": {
    "date": "5/20/2015",
    "text": "Food is great very close to authentic. I'm middle eastern and it isn't simple to find good Arabic food. I was thrilled with this place. Nice menu and nice staff. Will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gYMLfv12KnJ4BIECghFug"
  },
  "89eqYPDO7Ou5dLl4ft-wjw": {
    "date": "4/23/2016",
    "text": "I got gyro combo with fries and soda $9.5.  hubby got chicken and beef kabob plate #10 ($11) and we shared hummus $3.5.  In my opinion, hummus and its pita bread are the best, they added lot of cumin in it, pita bread is moist and soft (really close to naan texture). Chicken kabob is moist and perfectly cooked.  The beef kabab is a little bit chewy.  I guess kafta maybe better.  Mint sauce is good.  gyro meat is not super salty like the other one.  Total is less than $25.  We finished the pita bread before our main dishes came.  We asked if we can get extra pita bread, the guy is nice enough to give us 2 small bread to finish the hummus.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DFmYBlW29FaofQdOWlsnrg"
  },
  "70j9OeS_qJ4VLDQZhEJmWA": {
    "date": "10/15/2016",
    "text": "There was a cockroach on the counter as we were giving our order. I could not believe my eyes. I would recommend not going to this place until a health inspector pays them a visit. Id rather eat horrible food that's clean than the cockroach infested stuff they're serving. STAY AWAY!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QfIzqRtIYQqX7bL5s8xYig"
  },
  "rgkF3yiRcmm5_9vSItlo0g": {
    "date": "2/20/2016",
    "text": "My husband and I found this place like 2 years ago and when we in the mood we go there for him it's the gyro combo and for me it's the lamb kabob plate. So yummy . Half way thru the meal we stwich and i get my Husbands fries and he gets my rice. The green dressing is so good (but beware it's spicy). They use a special blend of spices for they fries  and they are  so good. No prepared food they cook when u order so if they busy it can take a while.  Also the hummus is really good.  Really good middle eastern food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rnhGqN3dSPLTL1DWtkXl6A"
  },
  "ILlIj7fk6-1ia3jFMPNqaQ": {
    "date": "8/19/2013",
    "text": "Afghan place owned by an afghan person very nice and warm person with descent quality Persian  / afghan food which is almost the same they have Good food with descent price as well if you are in  Vegas and you do not want to go to fancy dinner or lunch this is a place to go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yvbBa6txT4olh-msxoxmA"
  },
  "zpD3vZXOQtLvByJkAvZA8A": {
    "date": "11/29/2015",
    "text": "Best steak combo by far. Friendly service and great options. It was my first time here and I can't wait to come back and try more!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7UT9F3ARMRIi3-glJwoxvQ"
  },
  "wxaFSzxZvA6_Sv5OhCjwzg": {
    "date": "12/30/2014",
    "text": "I loved this place. It's nothing fancy but is a very clean place with great simple food. Very delicious homey style. good variety of middle eastern food with very fair pricing. Close to strip and airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_cMARiRhmVB3CxvIljPMg"
  },
  "ya8w2de9UGN8Rj1XgXvW5A": {
    "date": "4/23/2012",
    "text": "Ordered for one of my co workers birthday who picked this place. We were the first order of the day and it took them forever to get the food done (an hour). By the time we got the food it was cold. The order was not complete, meaning they didn't fulfill all requests per order.   The food was bland, dry and just less than mediocre..  I can't really say much more.. We all had the chicken kabobs combo..",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "pkq41Qh9yGOI_4pwdVmmDg"
  },
  "zjPhN3edjk550Z80Do-Vcg": {
    "date": "3/18/2015",
    "text": "I have been eating here for about a year. I get the eggplant dish or fish kabob. My husband gets the chicken and kofta kabob. It is always delicious. The service is consistently good and the restaurant is clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_2rRSDaeAmn3v4YOaS1PLg"
  },
  "jf91U-ugb3zMLKHrdp55Mg": {
    "date": "11/17/2016",
    "text": "Be-aware its not an Afghan restaurant, just have limited traditional middle-eastern food which is avg in test. I wasted my time by driving 20 minutes to this restaurant for Afghan food. You wont find traditional afghan dishes like Qabli Pulao, Bolani etc here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LxpYxsFeLdRJtXSJK-KdeA"
  },
  "892b0qd9tObua5Xe1mU3WA": {
    "date": "6/13/2015",
    "text": "One of the best spots to eat at if your in the Vegas area. The Lamb meal is a must try #1",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C4Q8HL0pDMUTj5ioWeEsjQ"
  },
  "2Qd5xb6Z2LRjlPFeeRUcSA": {
    "date": "10/28/2016",
    "text": "Ordered two sandwiches today. The bread was fresh. Great customer service and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkYE39iD3vLdElPIhKwkqQ"
  },
  "y7sdvG6duumBLzcTQiGq6g": {
    "date": "1/24/2015",
    "text": "There's a bit of a language barrier here but that just means more authenticity to me! I ordered a gyro combo. I'm not too big on French fries so I asked for a salad instead which is usually more expensive but the manager didn't charge extra so customer service kudos there! The gyro itself wasn't very good though. Sauce was delicious but my bread fell apart immediately and there definitely was not as much toppings as I was expecting. I might come back we'll see!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbDxaA38ufvBLBUmLKV9nA"
  },
  "e6fdYfP4SAqzStcx2b7CyQ": {
    "date": "8/7/2015",
    "text": "Food and service are bith great, those guys care about their customers and know how to serve people and make good food. I only give them 4 out of 5 cause the sitting area is small and need some decorations. Would go back there for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7g742P5YT21ad5tDKsnQzA"
  },
  "mxT_g9cLwDx7Yk3sPeEcPw": {
    "date": "4/15/2012",
    "text": "I stopped by here for lunch from a conference and loved it!!!!  staff was friendly and the food good, a little bit of a longer wait, but definitely worth it.  Definitely coming back when I hit Vegas again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EID2miAhF8Z-XPHPzajhOA"
  },
  "UPeDFlSZzuEy1m3EVGkfDw": {
    "date": "2/18/2012",
    "text": "Love this restaurant and feel compelled to visit it when I am in the neighborhood.  Khalid the owner is very personable and I like the fact that he shares his Kabul heritage if you care to ask.  The food obviously is cooked from scratch.  So, be very patient, because it is well worth the wait -- especially because the prices are so extremely reasonable.  It is not really \"fast food,\" it truly is a home-cooked meal with quality ingredients.  Addendum, updated 06/03/2012: I went there again today and once again the food was simply amazing!  The care that is taken to cook AFTER it is ordered.  Everything is made like your Great Aunt would do it if, of course, she was from Kabul, Afghanistan and if she was following cherished family recipes and if she were using only the finest ingredients.  Just taste the rice and you will know what I mean.  Then try any of the expertly spiced and prepared meats.  You will be hooked.  Khalid was not there this afternoon but Tommie was and he was just as gracious.   I go to Kabob Express when I want a great meal for an incredible price and when I want to impress a friends or family.  It truly is a bonus that the prices are so low.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oQ7irCudwDr73-938pXQIg"
  },
  "y0orBk4k_yAawqL3umPVHg": {
    "date": "6/10/2014",
    "text": "Delicious! It's not authentic, but the food hits the spot. It looks more like a Roberto's, but the cooks put it down! I recommend the tandory chicken and the hummus. The price is right and the food is fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8bPJNrqCGuUAazxqO9vHA"
  },
  "iWTjmDuls1He2Ni_ybLoyw": {
    "date": "12/28/2018",
    "text": "Great service, reasonable price, and delicious food! The portion size was very generous as well. Definitely worth a trip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nFPS5V5WA-rTHdLPbwBqCg"
  },
  "9fwVL7TIveSDtGJG1bcmfA": {
    "date": "10/4/2018",
    "text": "Pros: Very good fresh tasty food  It is Zabihah halal Very good customer service.  Cons:  Restaurant ambience needs an upgrade. But I can easily ignore it when compared to the taste of the food. Which was phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D0zWNY06A1MTH9uNzhM0DQ"
  },
  "fwhNS9PduXxPFxWCbQM7HA": {
    "date": "1/5/2019",
    "text": "My husband and I come here at least once a month for lunch.  The food is always fresh and delicious.   Yesterday was my birthday and we came here for the meal.  I had the gyro combo plate (instead of fries, I asked for rice).  Everything was perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TDdpBYSfJQu9f8aZ7_JhZw"
  },
  "p4w6HC8aBr0YwwQwiFZchQ": {
    "date": "10/3/2018",
    "text": "Amazing customer service. The front man suggested a few meals. We first got the hummus. I was practically licking the plate clean by the time everything was brought out. The second was perfectly seasoned beef and chicken. Will be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3XPc87CR5NH8mz4ihhgRTw"
  },
  "Wpgj2bSfQgmKYK7-siHYsQ": {
    "date": "12/31/2018",
    "text": "Very good broni badenjen eggplant dish, and my partner ordered chicken sultani, the pita bread was not made fresh but the entree made up for it. It took 20 minutes to have our meal served. The atmosphere was quiet with table middle eastern talk and no music, walk up counter for orders and seating with 8 tables. I would recommend this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b6SO2pewrJ3WqIqDP_72CA"
  },
  "lfwJjw44ZL4h4EBGdBocGg": {
    "date": "12/23/2018",
    "text": "Terrible food quality, dirty place and poor customer service. Waste of time and money. Don't go there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tl8Ll8I4WIDfUF6OV-MlEg"
  },
  "egKnBaYnS7wfDoxIFaWXzQ": {
    "date": "10/26/2018",
    "text": "The food was delicious! Very flavorful, savory, tender chicken & steak. The chili sauce enhanced the flavor. I can't eat gluten or dairy so I handed my pita bread over to my sister along with the tzatziki sauce. She said it was delicious! Mine was double delicious! I recommend this place for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ErcVZjGqKiXHImL-U-1Ww"
  },
  "IsPVcrThbEzrsYmNeSsEaw": {
    "date": "9/6/2018",
    "text": "For people that don't know what good Kabob is they might think this is good and for people with no taste bud or that like dry-chewy chicken this is their place. I was there a couple days ago with my cousins for vacation, we come from Northern Virginia so we know what good Kabob. I read all the good reviews of this place and we decided to give it a try worst decision ever. I'll tell you that you are better off eating at In-and-Out.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BNfkTxqDUttbatPeRgmF1Q"
  },
  "TMl3czBxrZruYCeP0EFrBQ": {
    "date": "4/10/2018",
    "text": "Awesome food with great service. Definitely coming back!! My gps wouldnt let me link to yelp for some odd reason but i definitely will know how to find my way back here without it. Thank you to tommy and the folks here for the excellent customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UyGAzrviitj_GDPgrs-xHg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Food looking food here!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UyGAzrviitj_GDPgrs-xHg/o.jpg"
      }
    ],
    "user_id": "dLwxfXfDaHrp_VhQm3wJXw"
  },
  "a8u69BuYhTvb96fsm_eh9Q": {
    "date": "2/2/2019",
    "text": "Love this place.   High quality meats.   Great portion sizes.   Super friendly.    Get the king sultani.   You wont regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9voT-DV3-nbW1txrUFWkYw"
  },
  "qCfiRNKsz7Zl-AJScbxw8w": {
    "date": "11/8/2018",
    "text": "100% Halol clean delicious very nice ppl and place in general !! Good variety in menu n prices are good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvwMjybGvdTyeyG9a8nQ5g"
  },
  "IpJ1IUVsl9fnu9Nwa2uc5A": {
    "date": "1/30/2017",
    "text": "Been coming here since 2008  Always good!!  Great food!  Good atmosphere.  Wish they would sell alcohol!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gu5RTP4ie01cEyhDUou1Qg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Beef kabob #1. $9.95",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gu5RTP4ie01cEyhDUou1Qg/o.jpg"
      }
    ],
    "user_id": "RnGUBhZekRILJfbUAB8_TA"
  },
  "P27GissBJlEaRmCikSh4jg": {
    "date": "8/17/2018",
    "text": "Only reason I'm not giving 5 stars is it took longer than I expected, but then again everything is made to order. The food is super super tasty, though it could have used a bit more salt. We'll be back very very soon! Guy at the counter is great!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-Io64dxVHDeCcMNxO1lSg"
  },
  "LORsGRI3kZW9ijHVIUakwg": {
    "date": "12/3/2016",
    "text": "I keep coming here smh. But I feel less guilty knowing that it's natural and healthy :-) I've reviewed this before but wanted to add that it is indeed GMO free, non-antibiotic, no hormone, grass fed, and the list goes on... I can't help but notice my body feel better after avoiding junk. It's also a great feeling knowing I get full/satisfied.  [-] As of now, only one location. No public bathroom, however sink available. Wish area was a bit bigger since sometimes it gets busy and seating may be limited.  [+] Amazing flavors. Fair prices. Wide-ranging yet not overwhelming. Genuine with character!  I still recommend gyros, Sultani, side of lamb, and B. Badenjan",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "30DfqihxIryKTA87iUkTbA"
  },
  "Cu8xtVJpwPSVfzIL_Xg-qA": {
    "date": "4/3/2019",
    "text": "This restaurant is by far one of the best restaurants for Mediterranean food in the Las Vegas area. This type of food is for anytime of the day, the chicken, beef, and kabob are so flavorful and cooked to perfection. Inside is very clean and very comforting and is perfect for family and friends. And lastly the owner which stands behind the counter is so welcoming and very nice, he really makes you feel like guests instead of customers. Very nice and amazing food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfAkeAB_nvAPBXC1fLPhMw"
  },
  "fXmS5O-TPm2GBMW8_U3reA": {
    "date": "11/11/2017",
    "text": "Little place with big flavor. Love the green cilantro sauce that comes in a tiny cup. Hot and spicy. A real surprise to someone new to the place.   Atmosphere is warm and pleasant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CApD81_TWZpxi4H6Z9RFsA"
  },
  "YWzagCE-lnQpXXkRzJAnzg": {
    "date": "9/6/2018",
    "text": "Second time here, ordered & waited for over 30 minutes. They fulfilled 4 takeout orders after ours, they brought half of my swarma combo...guess they forgot. Won't bother coming back since they didn't seem to care about their sub par service and food this time was thrown out. Very disappointing...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CBqonJkuJ7ErbU5os8BD-w"
  },
  "KYf4wqSUQhmNTH1zY8H8xQ": {
    "date": "2/20/2019",
    "text": "This small place offers tasty food with quality ingredients at very reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN2b6TsRRKxGlVXIfWJMUQ"
  },
  "kKKSkDsj5NSgP4Qg6B05KA": {
    "date": "7/29/2018",
    "text": "Very delicious food (the king dish and the chicken salad) with a very great customer service from Twab",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nTbEtDOpWS9fFxmJYDy8Q"
  },
  "CoUULGKhSFZ1yIkl9e-CKw": {
    "date": "2/7/2019",
    "text": "Tastiest food and great service! We had the beef shawarma, gyro and tilapia entree. Each dish was scrumptious. Perfectly flavored and mouthwateringly tender meat. We'll be back for sure :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b2LjHXOxX7-H7RTBnidAFw"
  },
  "MG9dIHTFwpYLUl1BB0v6Bg": {
    "date": "9/13/2012",
    "text": "I was in Vegas for a couple days and came across this place. Amazing delicious food. Highly reccommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dBGu2vcSd7bASR3G4EYK4w"
  },
  "2uOqbxhqqlhjJm-6D_1P1w": {
    "date": "6/3/2011",
    "text": "We came in here because we were shopping nearby, and glad we did. The prices were reasonable, the service friendly, and the food really great. We both had the beef tikka kabob platter and it was amazing. Some of the best hummus too! Clean dining room and welcoming atmosphere. I would definitely come here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qld8KoyYNECC3TMXNV6niA"
  },
  "_hWIg-7C2W1GcWN_zx87wA": {
    "date": "9/14/2013",
    "text": "I loved the food here! My favorite is the borani badejan! It's my go to place! I HIGHLY recommend this restaurant, you won't be disappointed. It's clean and the staff is very friendly. The owner was the one to take my order, he was a very nice guy and the food came out promptly! Love this place :)!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoviR6O13OUawr_yMIuOHQ"
  },
  "7E0RWaxT9GVeoF3HesEClA": {
    "date": "7/20/2010",
    "text": "Food was good. Flavorful sauces, spices, and rice. Staff is arrogant. For example, we have been to the restaurant a couple times so they know us, last time I had a cast on leg, my friend and I were the only ones in there, we asked if he would bring the food tray over to us, he would not. That was both rude and odd. I guess its a cultural thing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2xSFduxuFICNORP05awjdw"
  },
  "ZDwQeh7Ps9Nrsb9H7S27EA": {
    "date": "7/26/2013",
    "text": "Ordered food to-go. Man on the phone says 15 to 20 mins. Went there 20 mins later. Man says another 20 mins - rice is not cooked. Offers me French fries instead of rice. Price online on their website and store do not match. Needs updating. Took me total 40 mins to get food to-go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THCJ65TnD6Ewz2DoyuorLw"
  },
  "NegsE3jGeAb5qNnI_4itdQ": {
    "date": "5/28/2012",
    "text": "There are very few restaurants that I eat at over and over again. I'm always looking to try something new. However after coming here my first time, I've been absolutely hooked. Kabob Express is one of the few restaurants in the Las Vegas valley that serves halal meat. If you're looking for authentic Afghani food, this is definitely the place to go. The service is great, the owner is very polite and always on top of all the orders. I strongly recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0l-mYcdzU0YclDhYeK-c1w"
  },
  "TJwu02wUagSyu-HIqFvS2A": {
    "date": "6/17/2011",
    "text": "Best Kabob I've ever had. I love their House Dressing its Delicious! I sure miss it now that I changed my job location.!! Love their spicy sauce which I can never remember the name.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0V12l6x2TA4Kw9L7k37xoQ"
  },
  "ph4yE4ZY3A8HoUd-7ytcpw": {
    "date": "2/7/2009",
    "text": "Afghan-style kebabs:  chicken, beef or eggplant.  No lamb or goat (BUMMER!)  The beef kabob offerings looked more interesting than the chicken, but I'm allergic to beef.  The chicken kabobs were not as interesting as I'd hoped, but they were good.  I would have liked dark, slightly oily, slightly stringy chicken better.  This was good-quality white chicken breast.  The salad and chopped tomato/onion/cucumber relish were both great, though.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "V33eN85b4PvAsPIQRaaecg"
  },
  "arIweJYgesbSKmGe37dNwA": {
    "date": "6/24/2017",
    "text": "This place is good.  I was concerned at first because I am used to Iranian style kabobs. I would have preferred a larger piece of pita bread but that's it.   No other complaints.  If that's my only complaint for a kabob place then the place is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BIzXry8op0oiNKvOhX1YA"
  },
  "fKGJabk3jEtAYH6uVf6Tog": {
    "date": "7/27/2016",
    "text": "Omg!! I've been waiting for this and it smells so good.  Fresh and hot off the grill I love the grill flavor!  A must try if you are in the area and enjoy eating mediterranean/afghan/Persian food. The dish I order was the King Sultan which consists of steak, chicken, and ground beef with rice, salad, and Pico de Gallo lime. VERY DELICIOUS DISH!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UZI9eO4kEHUr5jPAghkLFw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. The King Sultan!! Steak, chicken, and ground beef!! Yum!! It&amp;#39;s the best!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UZI9eO4kEHUr5jPAghkLFw/o.jpg"
      }
    ],
    "user_id": "4V5nEhLLrqNx16SXsLTqYQ"
  },
  "GtgV3P_rDM-K7UZF2q8dVw": {
    "date": "11/8/2016",
    "text": "* after leaving this review they sent me a message saying FU. This place is the worst!!!!   If you want to wait for 30 minutes then please come to this place! Unreal how poor the services is. I've been her 3 times trying to give it the benefit but it's the worst service.   Food is okay and they have messed it up all three times I've been in but I tried and can try no more. Peace out kabob express",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gO3rmVzHqfF3qXS6vJhw8Q"
  },
  "6bAGf1JD4F9JSmVCI3BLqg": {
    "date": "10/31/2014",
    "text": "The standard gyro here is a massive portion of meat wrapped in giant pita for a low $7. One of the best deals on this side of town, which isn't known for high prices to start with.   Staff is friendly, location is clean, and if they gyro isn't enough for you a side of spinach might hit the spot- topped with roasted tomatoes and caramelized onions, it's way better quality than I expected though a bit oily for my personal preference.  A complete meal with drink and side will barely set you back $10 and you'll likely have leftovers. Damn delicious gyro with tons of thick-cut meat and a hefty portion of tzatziki sauce to top it with.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "bLbSNkLggFnqwNNzzq-Ijw"
  },
  "Gjnu4FHV4l-j2qnl1HS-Pg": {
    "date": "7/19/2016",
    "text": "This is really a great east side spot. I went in last week for the gyros, as I was in the mood. The meat was tasty and well flavored, the fries were made to order, and the veggies were fresh. It really hit the spot!  Yum.  I will be back for sure. To top it off, the owner was super friendly and chatted with me while my lunch was being prepared.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "utS9ZAswZZx3QkegS_25SA"
  },
  "KncJnxXAz3wVAjC6mibEog": {
    "date": "6/15/2017",
    "text": "I went here a couple of weeks ago. I was really skeptical at first, whether or not the food would be good, because of the restaurant's location. Man, was I wrong! I ordered a Ck Bf Sultani and I was blown away by just how flavorful their rice is! I was really not expecting to have saffron rice! It's like all I can think about now! I must go back so I can obtain more of their delicious rice!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HJ7Kb7NxtajJjX3oUToOdA"
  },
  "G0j6qVLD_vKo56kOGf3jWw": {
    "date": "12/10/2017",
    "text": "A VERY delicious quick lunch. Stopped by for a Chicken Shwarma sandwich with extra hummus and baklava.  I enjoyed and the young man behind the counter was nice to talk with and pleasant. I WILL return on my next trip to Las Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Az5L3s2gZ2Am6JdNRahHw"
  },
  "lQgmzbc0TKuNOh_5BgNXtQ": {
    "date": "11/15/2017",
    "text": "Came to Vegas from Oakland ca to circus circus.. great halal restaurant ate here twice thank you!! Allah bless you brothers m!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXpMvGUp9GpHNuojBkV-Tw"
  },
  "JcfsEHmikerM30vnRBex8A": {
    "date": "5/18/2018",
    "text": "The food was okay, not really a big fan of kabobs, but still worth a try and the price was fair",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXNHOtDYc0ovg9zHch_sbw"
  },
  "neSePl1e7YzCrVUG61SUVg": {
    "date": "8/24/2016",
    "text": "Great food, good prices, speedy service .. I'll be back here in the future :-)  Best food in the area in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VesORROMMUnl1tZeFj4oDQ"
  },
  "muDhcwlFvA8AVm2xN2B0gw": {
    "date": "4/27/2017",
    "text": "After intensive search and finally got the Nintendo Switch for my kids at the nearby Walmart, I called Kabob Express to order some to go food (I originally thought this place was the same one that used to be in downtown Vegas). When I came to pick up, I realized that this place was different than what I expected. I'm glad because the food here is soooooooooooo good. I ordered the sultani kabob, which comes with two skewers of beef and rice and salad. They all tasted soooooo good, I want to eat more. The price is decent, not cheap but not expensive either, for the amount of food they give. I would definitely visit this place again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xr63tSoQeUWpgdzSIQnFYA"
  },
  "aTCLjZrGlZ9LC8KjuuVZjw": {
    "date": "10/12/2017",
    "text": "Very good food. Beef tika is my favorite. Rice is as tender as can be. Beef has great flavor.  Not a lot of tables in the place and they don't rush so don't be in a hurry. Every mouthful is worth the wait. You might want an extra pita bread because it's delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cTNd1QY9kQq8CVdq5XqWGA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cTNd1QY9kQq8CVdq5XqWGA/o.jpg"
      }
    ],
    "user_id": "_E1i0Hzko-jE4whky_ds1A"
  },
  "oWCsvB98WeyKseY0CLXb-A": {
    "date": "6/6/2014",
    "text": "Kabob express! What can I say. I crave for you everyday!  Their staff are so friendly and have good customer service. We didn't even have to wait long for our food to get served. This is our go-to place here in the office. The food is so worth the price, and I love how they have shawarma too! Yum. :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hYqEteP_BE49XnH2YCZbIA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Beef sultani",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hYqEteP_BE49XnH2YCZbIA/o.jpg"
      },
      {
        "img_id": "7MxTmTBrqZie9vDwMgVFZw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Chicken and Beef Sultani",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7MxTmTBrqZie9vDwMgVFZw/o.jpg"
      }
    ],
    "user_id": "VWxQyQo-nCx0oapaK-bAxQ"
  },
  "7CLPAV-2ORw3PLQATxlC2Q": {
    "date": "11/27/2015",
    "text": "I visited Kabob Express the other night for the first time! I live literally a 5 minute walk away and have always wanted to try it, but I finally had the opportunity so off I went.  When I walked in, there were about 10-15 other customers eating in the small dining room. There was one Middle Eastern customer waiting to order in front of me, and then a few minutes later, another Middle Eastern customer was waiting behind me. Here is where I started to have a problem: Even though there were TWO men manning the cashier stand, neither of them knew what they were doing. They did not know how to take orders, how to make change, or how to talk with customers.   Finally, after at least five minutes, it was my turn. However, the two men looked directly past me at the other customer BEHIND me and invited him to the cashier stand instead of me. I was very confused but continued to wait. After they took his order, they both pulled out their phones and started texting. I was pretty furious at this point so I marched up to the counter and asked if I could order. Both of the men seemed caught off guard that I would actually want to eat, but finally managed to take my order (amid much confusion over what I wanted, how to spell my name, and how to make change). I didn't even use my free drink from Yelp because I knew it would just waste more time because of all of the confusion.   The only reason this review is getting 2 stars instead of 1 is because my chicken tandori kabob with rice was SUPER good. I almost didn't want it to be good because I was so disgruntled, but it was amazing. Don't put much stock in their bread (it was a HARD piece of pita) or salad (a few lettuce pieces thrown in the corner of the to-go box), but the kabob and rice ALMOST makes me want to go back. Almost. Not quite.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "sjl8z9XTo0cQGnUedkzIPQ"
  },
  "D-T34RFGOOnnHMfFHic5SQ": {
    "date": "4/9/2018",
    "text": "Best gyro in Las Vegas! Friendly counter people too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fc6OV1NSVu47KopB6WUMXA"
  },
  "OaQnfFlPMB8fXhxlmtPpiQ": {
    "date": "5/27/2017",
    "text": "My family loves Persian food, so we decided to try out this place based on great reviews here. It turned out to be a disappointment. The food was relatively fresh but average taste, it was strange that they add salsa to the plate. I'd say the food is just eatable, nothing great or special about it for how much we paid.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GXfmQyilS2ErJeemjeok-Q"
  },
  "mylevGAk39iAHeK3MAe-9A": {
    "date": "4/4/2018",
    "text": "Their food is great ! The service is excellent ! I definitely will go again next time at Vegas .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HVIJLSiOz6_pR8fyB5PQgw"
  },
  "BZdjCClIVqskeic3jihv0A": {
    "date": "5/6/2016",
    "text": "First of all, the Afghanis we met here are very friendly and we exchanged a few stories about BAF and KAF. We are very happy for them to be able to survive the war and come to the USA after supporting our troops outside the wire. Congratulations and best wishes with your new life and business.  We ordered the Kafta Kabob, Tandoori Chicken and the Eggplant side dish. We ate family style and all the food was delicious  This experience has satisfied our craving for Afghan food since leaving Afghanistan over 2 years ago. Highly recommended and we will visit again when we're back in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sji0kLGqOZIJ5mdCVfK7Ow"
  },
  "AcLq7jRQjXJJMMzW6-KnRQ": {
    "date": "7/28/2017",
    "text": "Best homemade yogurt drink ever!  Had gyros for lunch.  Generous amount.  Green cilantro sauce was great.  Wish i lived closer.. server very friendly and engaging.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwLSbGeKXmomU9Jz3EKVHQ"
  },
  "vehAU8iEj5j3WoYbV3Tqjg": {
    "date": "2/26/2018",
    "text": "Great Mediterranean food. Quick and a good price. I dont have a photo to share since i cleaned my plate. I got the King Sultan plate and it was great! Come in if your looking for some delish food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d5Z2HgnjbC5UqegUcR5g_A"
  },
  "3_0SHZ-6gaoGsHr-l8YTNw": {
    "date": "8/18/2018",
    "text": "Let me just say, despite all the good reviews, I was skeptical. So many afghan or Persian restaurants make super dry kabobs. My family is Pakistani and they come from Quetta and Peshawar so we know a little something about kabobs.   This place KILLED IT. We came so hungry and this was just what we needed. Their kofta kabob, sultani kabob, and tandoori chicken kabob all tasted perfect! They also give you small sides of the little green afghani chutney that just brought it all together.   But that's just the food. Their employees are amazing! The sweetest men who greet you so nicely. They found out we were Pakistani and they played customized music for us. My mom found out they spoke Pashto and she was just right at home.   So rare to find places that transport you back home. You guys definitely had us nostalgic and we can't thank you enough for it!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "QPpyELXKU2fqZRIp1pl8SA"
  },
  "SS88pDrIbYt9QVbi9ygI8w": {
    "date": "7/14/2019",
    "text": "I ordered the saltani kabob and I'm not very impress.  I've had much better kabobs.  Everything was dry and not much flavoring to it.  The rice was very plain.  I came here based on how many stars was on yelp but I did not think it was good.  I ended up throwing away my lunch.  So disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgXf1PiFnJeYLWhVrTGfhw"
  },
  "zs_iLKWS8pLjIT2yq1GQ9w": {
    "date": "6/30/2019",
    "text": "We got the #8 and #10 they were both delicious plates. The chicken kabob was juicy and well seasoned. The beef and ground beef were also really good. The plates are big and we were very full didnt finish all of it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFLjYWaJPxI663SAkfOrdQ"
  },
  "oVLGNekGXHudsnG7_JFHIw": {
    "date": "4/9/2019",
    "text": "Amazing food and flavor, best kabobs ever strongly recommend this place , everything fresh .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3j2HZOTTX0cWrfMX8j4Ww"
  },
  "Wi_ssr2wVkVmRLMqKN1-gg": {
    "date": "2/11/2017",
    "text": "Tried this spot about four months ago because I love this type of food. I wasn't crazy about it but one of my coworkers insisted I give it another shot.   Went again Friday and once again, wasn't wow'd.   When I got there I ordered and found a place to sit. The table was dirty so I started wiping it down and the guy who took also had taken my order at the register came over and wiped it and apologized. He was telling us how he has several duties and just got behind. No big deal at all. He was super nice.   They also have no public restrooms which was kinda unfortunate because I also didn't enjoy my food as much since I had to use the restroom. They do have a hand washing station in the main restaurant area for convenience.   Most importantly- the food: My only negative about the food was that one of the pieces of chicken breast had a really strange consistency. I have experienced it before with chicken breast and I really can't explain it but it's unpleasant. The beef was very tasty and the rice and salad is good.  The prices are reasonable, the portion sizes are decent. $12.95 for the chicken and beef combo I usually go with. The slice of pita could be bigger in my opinion. Since it's so inexpensive, why not throw larger piece on the plate to fill us up a little more...  Overall I think the place is solid. If I'm in the area and really need something to eat I'd go back. But unfortunately it's not one of my top choices for this genre of food in the valley.   I'd still say give it a try for yourself though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p1g8e314jSOPNYGlJybdMw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Chicken and beef combo.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p1g8e314jSOPNYGlJybdMw/o.jpg"
      }
    ],
    "user_id": "zfP7JESA_WfKvNQzYJDa7g"
  },
  "RlA4hZ5hkNUoAvH_BB0rLg": {
    "date": "8/9/2018",
    "text": "Great little place that did not dissapoint. The kabobs were quite flavorful as well as the flatbread and hummis. Definitely worth a try if you're in the Henderson area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIb0WMMGQOW3zMbSf8YQFA"
  },
  "ES5Sz5OqzyOVk8sB7xY48A": {
    "date": "5/26/2018",
    "text": "amazing. I haven't had this kinda food since I been in Philly it's so good food amount and amazing  tandoori chicken.. don't forget to get baklava for dessert",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QvsVDsixTnFnqClMf91n7A",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QvsVDsixTnFnqClMf91n7A/o.jpg"
      }
    ],
    "user_id": "vcdSAJXAnUE6VbE_zKWzHg"
  },
  "AmxWcM1VhBVFYcvV5VYVUQ": {
    "date": "5/26/2018",
    "text": "When we walked in the place was very clean & the music and mood was set. They have really nice slab tables. The chairs could be replaced. But the food was really good. The beef was juicy and cooked just right. I'm used to having silverware and clay plates but they had styrofoam ( which isn't actually bad, unless you need to cut something ). I got number one and my partner got number 8. He said the chicken was cooked perfectly. Overall the atmosphere was good, it's in a good shopping center. I'd definitely recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g2gJWFMt-aK-cEGu0GxQDA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g2gJWFMt-aK-cEGu0GxQDA/o.jpg"
      }
    ],
    "user_id": "PFb-a2UQdwfevm1wWww5YA"
  },
  "RjkyyoTyh4_OYQQOAKoSbg": {
    "date": "3/3/2019",
    "text": "I can't believe I haven't wrote a review for this delicious restraunt!! The food is so goooood here !!! very friendly as well the best customer service !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IubXOZxWVg_W5hXguXJgBA"
  },
  "iUwsyCh5b32L_s_eMb2qNg": {
    "date": "8/9/2018",
    "text": "This is a small,  sit down or take out place in a shopping plaza.  Good gyros. Also had lamb plate, and side order of garden salad and hummus.  All good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3wTLjqYaBakYVxrdQZ6FJw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3wTLjqYaBakYVxrdQZ6FJw/o.jpg"
      }
    ],
    "user_id": "8cWBpkeBcRLZdP2HATAK-Q"
  },
  "9oRWF2zrgTbdONgnw7sr1A": {
    "date": "7/17/2018",
    "text": "Food was delicious, been here once before. We also had the hummus plate. Not pictured! They do need to serve it with more pita bread then what we received, not enough and you have to pay for extra.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vKuRqkkSWsCiRwP60MHJdg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vKuRqkkSWsCiRwP60MHJdg/o.jpg"
      },
      {
        "img_id": "XDoiRRVe5vQWqJSCdbnR4Q",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XDoiRRVe5vQWqJSCdbnR4Q/o.jpg"
      }
    ],
    "user_id": "YOF2TDOh1yFZmF0t2TMPAA"
  },
  "QvHYpEXaB_Wct9yk9JJLow": {
    "date": "4/6/2018",
    "text": "Exceptional Customer service! Delicious Persian Food! Great Atmosphere! Definitely my new fav lunch break getaway",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "grtFhXlpbqRcgp5VDvh4QQ"
  },
  "q3sXbOGp8bQfIjbBKZVuhw": {
    "date": "3/24/2018",
    "text": "Just tried this place and was very pleased the service was great and very friendly staff. The food was very delicious I had the gyro combo and chicken tandoori which was cooked just right. I'll definitely be coming back to try the rest of the menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JlJtNGjiJcIe-I40xr6hjg"
  },
  "HmlrsikDmO9j5SzDQTQybA": {
    "date": "8/12/2018",
    "text": "Ok I thought the food was ok, my husband did not like it at all. So not sure if it was the little bug that was crawling around or the young patron that was grabbing fist full of rice and eating it. But I might try it again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UFw-HoFY060vVZdqMSkZvg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UFw-HoFY060vVZdqMSkZvg/o.jpg"
      }
    ],
    "user_id": "Bqo22m7g-13HKa9yDDquyA"
  },
  "giKHe-VAvWWRQXGbqdbjUg": {
    "date": "6/29/2018",
    "text": "Really good! The guy helping us was very patient and answered all our questions. I got the Sultani Kabob and it was delicious. My sisters got the chicken shawarma and the Chicken Sultani and they were all very tasty. Quick service, tasty food. Love it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WCr3E3LqPR-2maUxRqJMoA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Sultani Kabob",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WCr3E3LqPR-2maUxRqJMoA/o.jpg"
      }
    ],
    "user_id": "HFtkDy_JPsYfMBG0O2pLtg"
  },
  "Bhhm_LPgl3Xsf3Oyu8ExOg": {
    "date": "12/8/2018",
    "text": "This place is AWESOME! I ordered Lamb Kabob and it was delicious. The meat was tender and tasty",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3RLgT4db-SGp2FWjN1PhQ"
  },
  "YzJaUULqJ_13fJLI5wV2sA": {
    "date": "12/7/2018",
    "text": "We were looking for a good middle eastern restaurant in Vegas and we found one. It is very simple and it was exactly what we were looking for. The food was fresh and tasty. Humus is a bit different from what I am used to (grew up in Israel and all) but still really good. I would recommend this place for a quick grab and eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Me_rTo61xK5ItKhJMUf_xg"
  },
  "nQKGeu2-sBLBKIK2QJFexg": {
    "date": "3/1/2018",
    "text": "Found this place on a whim... BOY did we every luck OUT!  We showed up around 8:15pm (they close at 9pm) and we were greeted from the cook in the back working on the grill.  I love a place that is so closely connected to the consumers that they all take part in the dinning experience  for the incoming customers.  I order the King's Dish... It was a DELIGHT!  The meats were freshly grilled and not over seasoned and SO moist!  Food like this makes my heart smile!  Just clean, simple and fresh fair!  Thanks Guys we'll be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "3Cd9h9T5bCzfWcl_Px4dIw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3Cd9h9T5bCzfWcl_Px4dIw/o.jpg"
      }
    ],
    "user_id": "WsfgmhdgrKhLkvKpCzrVmg"
  },
  "XKW0RM0SP7wDE3OOWGMJ6A": {
    "date": "4/16/2018",
    "text": "I got the number 10, king sultani, as recommended by the cashier. The steak was pretty tough. I didn't particularly like either of the two salads.  The chicken, ground beef, and rice were pretty good though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1KH0Hq-2ufpo5UOJCY-qVQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1KH0Hq-2ufpo5UOJCY-qVQ/o.jpg"
      }
    ],
    "user_id": "liPczx6P2xS8V8XjTePFRQ"
  },
  "Qm5_wnft_n10VuGKbJmtDA": {
    "date": "5/2/2018",
    "text": "#3 to go. Hot and fresh, ready to eat. Price are decent. I enjoy their green sauce (kinda spicy) on the side, it adds in more favor. Right amount foods and can fill you up yet does not leave you feeling heavy if that makes sense. Shrugs. Definitely will be back to this place whenever I feel eating kabobs. Oh, free drinks when you check in on Yelp",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YlOaRF1YpOdvUtm4foQlaQ"
  },
  "V8e0MTbJnh5DUvKTqevkRQ": {
    "date": "9/13/2013",
    "text": "Really yummy food!  I had the kafta kabob meal (about $9), which came with a load of rice, salad, and a pita bread.  The kabobs were spiced ground beef shaped into sausage-like bodies.  Paired with the accompanying sauce (tasted like cilantro?), the result was flavourful and fresh.  Tons of food and tasty.  The small but well-kept interior is cheery as is the staff.  My only quibble is that my meal took longer than expected for this \"express\" establishment (~15-20min....I was the 2nd to order out of 2!).  However, I'm willing to wait for made-to-order yumminess done right.  Great lunch place that doesn't break the bank.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wLsUpt-xYlAGpOSzriJLdA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Kafta Kabob.  Spiced ground beef shaped into a sausage-like body.  Really good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wLsUpt-xYlAGpOSzriJLdA/o.jpg"
      }
    ],
    "user_id": "zwhty_ZmxbHAHoDfMjNbag"
  },
  "SfaxQtk_oEdoy69tPnpdGA": {
    "date": "2/12/2016",
    "text": "Amazing food, and a lot of it too! We had the Kofta Kabob, Sultan Kobob, and the Chicken Beef Sultan  plates. All were tasty, fresh, and yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0o061AXHH4f5QtKLwMZdzw"
  },
  "cOlkdwVZkIV8GYQ_BeP_8g": {
    "date": "10/14/2015",
    "text": "Clean place. Hummus, yum!! Their lamb is so good and very tender. The bf liked his chicken shawarma. Good portion for the price! Friendly staff. All in all, good experience. Will come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5iGpA5vgaWRyt4nY4cYBQ"
  },
  "lyDu2DxdVwVvHqQwBrQghg": {
    "date": "10/10/2015",
    "text": "The ground beef and beef soltani were just about perfect, great place to eat. We will definitely be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXd9etdrN0N2FGVl2CbR4Q"
  },
  "ik5nlO0zoUsyQR0mKGHNew": {
    "date": "7/15/2015",
    "text": "Just did a take out order at this place right now. The food turned out great and plenty. 2 of us ate from 1 order of Kofta Kabob. We are planning a team event for LegalShield nearby and are going to order from here. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUDUpc5-ItXjT4kZ8AfivQ"
  },
  "i1lxUloyC7zn-uyc_MLNwQ": {
    "date": "10/26/2015",
    "text": "Really good gyro meat and portions for the combo. Came back a second time with my only disappointments relating to the lack of ice tea and public boys rooms.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iSXMeX2Se1DVp6MBQDamjA"
  },
  "XDyqNRp2okF333Mw3DIghg": {
    "date": "9/27/2015",
    "text": "Fantastic food,  highly recommend the hummus.  Service is also great,  the guy at the counter was super nice and insisted on giving us a second hummus to go when the kitchen accidentally plated it for here. Will definitely come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Mxmfj0yMpakOwfg9iY0mg"
  },
  "1ZRL3jFHBgxLk6TPUxsDhg": {
    "date": "9/26/2015",
    "text": "This place has the best beef kubideh and the rice is simply amazing. After eating here, I don't get heartburn which usually accompanies most Vegas kabob places. The order comes with two healthy portions of salad and white sauce. The place itself isn't anything to rave about but if you're looking for good food, this place has it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "00Z-tCcJVe9LVP3GakkqDQ"
  },
  "PMq9XR6f0ACdoWLJzrr42Q": {
    "date": "9/26/2010",
    "text": "We just arrived at our hotel in Vegas and I was looking for a good Kabob house so I can order to go for a nice dinner for 4 at our cozy hotel.  Rating Summary:: - 4 Stars, For Vegas Standards: Yay, I'm A Fan - 3 Stars, Compared to SoCal Kabob Houses (Zankou, Kabob Exp, Open Sesame): Just A-OK  I order 4 items and mixed it up a bit so we can try all the meats: - Plate 1: Chicken Breast and Beef Tika Kabobs - Plate 2: Chicken Breast and Kofta (ground beef) Kabobs - Plate 3: Chicken Breast Kabobs, side dish - Plate 4: Beef Gyro Wrap - Sides: Salad and Bread  Summary of Plates Eaten: [see pictures] - Plate 1: Chicken (too dry) Beef Tika (good taste, little chewy) - Plate 2: Chicken (dry, bland) and Kofta (good taste) - Plate 3: Chicken Breast, side dish (my boy liked it, finished it) - Plate 4: Beef Gyro Wrap (my boy liked it, finished it) - Sides: Salad (need to get used to the dressing) and Bread (good eats)  Did I forget the hummus and tahini? I'll ask about it next time.  We'll be back in October to give it another try and see if the meats are still cooked the same way. Hopefully the chicken shish kebabs will be a bit bigger with more seasoning so it won't be so dry and bland.  -FM",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "n4aQk9w9Ea7swFBwAwF8NQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Chicken Breast Kabobs Side and Beef Gyro Wrap",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n4aQk9w9Ea7swFBwAwF8NQ/o.jpg"
      },
      {
        "img_id": "4lRqBuhw1d7ni6fImZ_SNA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Plate 1, Chicken Breast and Beef Tika Kabobs &amp;amp; Plate 2, Chicken Breast and Kofta (ground beef) Kabobs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4lRqBuhw1d7ni6fImZ_SNA/o.jpg"
      },
      {
        "img_id": "1JxCpYNapGTWqrWtEWSiPQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. The Kabob Express menu. Hmmm, what can we eat here?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1JxCpYNapGTWqrWtEWSiPQ/o.jpg"
      }
    ],
    "user_id": "dwCg215LPTfa40nb3AIXNg"
  },
  "yEK1Ukqni-cBNRMqwHPOKQ": {
    "date": "12/30/2013",
    "text": "Excellent food! Great prices.... I love the #6 Steak and kobedah( ground Beef) with rice and salad. About $10",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ingr41ba53PsLScO2D9ioQ"
  },
  "UO9JOp1J4bCCGfnKkr-zrQ": {
    "date": "8/26/2014",
    "text": "I will not be returning to this restaurant again. I ordered 30 meals for a lunch we provide to senior citizens and had a horrible experience. To start, it was difficult to place the order because the manager was not available the first two times I called and no one else could take the order. Then, when I did place the order and told them we are tax exempt, he still quoted me a price with tax. Not realizing that he included tax, I told him it was a bit high compared to what I expected. He offered to give me a discount and brought the price down 10%. I was appreciative for that since we are a non-profit and have to keep our costs down.  Well, when I arrived to pick up the order, I asked for a receipt showing what I paid for and they could not provide me with one because of the discount. During this discussion, I discovered that my 10% discount was applied to the total INCLUDING tax! So he really gave me a 2% discount since we don't pay tax to begin with. The man who was there (Surprise, the manager was not there again) was very nice and tried to help me. He called the manager on the phone so he could figure out how to give me the receipt I needed, but the manager was very rude. When I explained the situation and what I needed, he said he couldn't do it because the register doesn't allow him to. His best offer was to charge me full price so that I could have a receipt that matched the credit card slip.  When I got the order back to the office and began serving to our clients, we were not pleased. The order was chicken breast kabobs, rice, salad, and pita bread. The chicken was dry, the salad was just chopped iceberg lettuce, and the pita was cold and some pieces were moldy. The only thing I can compliment them on is the flavor of the rice.  They charged me for 30 individual meals, and fortunately, we had a few cancellations because they did not provide enough chicken to feed 30 people. I agreed to allow them to provide the food in catering trays rather than box up 30 meals, but all this allowed them to do was short us.  This was not the first time we had ordered from them, but it will be the last after the treatment I received and the frustration of the whole experience.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFJMg9B6JyHMrT4FLHv9bA"
  },
  "gNyYlG7fzUz9QJ-eOxQzRw": {
    "date": "1/26/2015",
    "text": "Pretty good food with great prices. I had the chicken tandory kabob which came with a tasty bed of rice, side salad, and pita bread. $8.60 w/tax. This was a different type of taste for me but still good nonetheless. This location could use remodeling. If I do come back it'd be to try one of their gyros.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3pCH8DInBNtn2LKa56yVyg"
  },
  "W5hV3VW3H0PqA43Ew0H99Q": {
    "date": "11/19/2013",
    "text": "Some of the Best Gyros around town. I have been coming here for 2 years now. They have good customer service and it doesn't take long to get your food. Chick it out!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_XZv_TYcvQkXFCRWunK5g"
  },
  "uvZUs8duXdHqyl8B_8XphA": {
    "date": "2/4/2015",
    "text": "My fiance and I love this place! We usually get a Chicken Beef Sultani with an order of hummus and some Maast Wa Khiar sauce. It's one of those places where you wouldn't expect such good food to come out it, but you would be pleasantly surprised. The word \"Express\" in their name, really doesn't do them justice. The food is very well prepared. It's a hidden gem located on the east side of town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qlsq1327pDqRgUJ8D2Rx3g"
  },
  "Geq75rrrDWgDKIjoiM_I_w": {
    "date": "12/19/2014",
    "text": "This is one of my favorite places to eat. The meat is so tender and flavorful. They give huge portions. I usually order a chicken and beef combination and always have plenty of leftovers. I LOVE their sauces! The tzatziki is not too overpowering (as I've noticed at some places) and the green sauce (whatever it is) is amazing. I always ask for an extra. The service is always great. The people working there have always been pleasant and accommodating. They truly seem to value your business. I usually call in my order so it's ready when I get there but I've noticed when I don't, it doesn't take very long. I live near another kabob place but drive 20 minutes to Kabob Express instead of eating there. That is how much I love their food. I don't normally leave 5 stars but in this case I have to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BzGjSOCh21Jgs1wJnByHDw"
  },
  "OcawRbP96geo8AKeEHyGmA": {
    "date": "6/25/2012",
    "text": "The Kabob Express is in a satellite section of a Mall anchored by a Marketon Grocery Store. Right on the southeast corner of Tropicana Avenue at Eastern Avenue. It is an unassuming place in the middle of this small strip area at the front corner of the entire Mall.  Libby and I went in and looked at the menu items up on the wall. We ask the Fellow at the counter a question or two, made our decisions, ordered, and paid. We took some of the plasticware and filled out drink cups. We took a nice table with a view of the parking area and the intersection.  I ordered a Number 5, Lamb Kabob Dinner and Libby a Number 3, Chicken Breast Kabob. I do agree that it took a while for our order to arrive. The Chef cooked each order separately in a very hot kitchen area. Two families were already eating, one table of two was waiting and then us. The interior was clean, spacious, and cool. It didn't bother us to wait but, I believe that this Express is really a \"Local\".  Our food arrived. Mine was a full plate of seven pieced of wonderfully cooked lamb. Cooked and browned well on the outside and medium rare within. The pieces were about 1.5\" X 1.5 \". They were really nice sized chucks of juicy meat. There was also some romaine with a creamy dressing, seasoned rice, and a nice portion of tomato, onion, parsley salad that I usually call Israeli Salad. It was cold and flavorful.  Libby's chicken kabob dinner was just like mine with the exception of the chicken instead of lamb. The chicken pieces were a hair smaller than my lamb pieces. They were cooked nicely and had a yellow color that I believe was the addition of some turmeric to the chicken marinade. Her chicken was moist and done perfectly. The pita on each plate was about a 3\" size, warm, flavorful, and soaked up a lot of sauce.  I had asked for some Maast Wa Khfar which is yogurt and cumber sauce. It is known in Greek as Tzatziki Sauce. It was cold and had a fine flavor that went well with my Lamb. With our dinner cam a small plastic cup of a green vinegar sauce that was like fire. I am still trying to find out what is in it other than \"grated spices\". So, beware of this \"Green Dragon\"  if you have a tender palate.  All in all this was a fine stop for us and a belly full of food for $20.00 bill. It was good enough that I ordered a pair of lamb kabobs and  container of the cucumber sauce to take home.  Give this place a try. the food is well worth it. Remember though, it is running on the \"local\" track and is definitely not an express train.  My FIVE STARS for the food.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "3WHmc6WQ_jk_fIp-dJDKyA"
  },
  "H_lmMZdiH5QrQhgPQryyQQ": {
    "date": "5/27/2015",
    "text": "Great food!i usually I  get a #4 kofta kabab is really good and the rice omg love it,try them on",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3IKrSR4lwuyDomFMGMhRPQ"
  },
  "T73sci9xm2Tx9S8214tnjA": {
    "date": "4/11/2015",
    "text": "It's usually pretty packed at night and in spots during the day. I have only personally had the Gyros, chicken shawarma, chicken wraps, baklava and fries. Everything always taste fresh and flavorful. Baklava is basic, store bought. Nothing special. The place is usually very clean, but I admit I have never used the bathroom there. I would be a lot more likely to go there if some stuff was just $0.75-$1.00 less but the prices are reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RjOpvpeTg6ABGsbYe-DeIA"
  },
  "z4xuORy3j2KWk_wLg1Fb0Q": {
    "date": "1/10/2015",
    "text": "Good effort.  Had the tandoori chicken which was tasty but a bit small portion of meat.    Their fountain drink choices were also a bit limited.   Why the sign \" no public restrooms\"?   Us costumers are public.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_oU3pAMIRhMlLO8X36x8w"
  },
  "YgytoDl7j7qGUFIBDLFE_Q": {
    "date": "8/9/2015",
    "text": "Love  love love their food! I would refer my family and friends to eat here! I live in Henderson, I don't mind driving all the way to Tropicana and Eastern.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nll7Dzy0TW2daheK3_5nhQ"
  },
  "LC9skQml5bZWHUI_1klraw": {
    "date": "6/25/2016",
    "text": "We tried this place on a huntch...and been craving it every since. I like the beef kabob and the bronie....cooked perfect EVERYTIME we've come. Hubby loves the gyro. The  tzatziki sauce is the BEST. Excellent customer service. Delicious food. Always cooked fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ZiAh3i_7nADp_Cq3TQryg"
  },
  "-Es9JnA2JZd_rsobRLLpgQ": {
    "date": "6/16/2016",
    "text": "This place is a gem in the desert! The taste of the food is captivating! and people here are amazing.. I feel that I'm lucky to find it on Yelp. Coming here is a must on my future checklists for all visits to Vegas!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4cl2QdwhhPgb5OwtSZCENg"
  },
  "h5a3nGhXMu23-4OalnvySw": {
    "date": "9/8/2016",
    "text": "Amazing! The best Kabob joint in Vegas by far. Reply authentic cuisine. Consistent quality, friendly staff and very affordable food. Too bad they don't have real silverware and serving dishes. Foam plates and plastic forks are so beneath the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WIBLUOk_-Q3tn_Dkqw73FQ"
  },
  "B-ON3HmlyM7NPKbPdkgcLA": {
    "date": "4/27/2016",
    "text": "Absolutely delicious Afghani food. Everything is fresh and made on site. They have the best tea, and their meat is so fresh and delicious. The recipes are authentic--spices are perfect. And the prices are very reasonable. The dinners are hard to eat in one sitting, they give you so much food, so you'll have a great snack for later to take home. If you want to get off the strip and enjoy a meal without the sound of slot machines, head down to Eastern Avenue and enjoy a great meal at a great price. It's in a strip mall, a little hard to find. It's behind the electronics store, in the middle strip mall of the shopping center. You'll love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aw5WKTQXkSF98qQfe3McCQ"
  },
  "6oEu-ASZcqlUwjp1U9E6gw": {
    "date": "1/19/2014",
    "text": "The food was good, good service, no complaints here. If I were a local I'd probably frequent it. Loved the pita bread they serve it's the thicker kind more doughy, which is exactly the way I like it & severed warm.  Great local restaurant, no frills, simple & good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAFSh-RgctFzL0-rzBcaMg"
  },
  "UVAOgKrTJgZGtW7icnBGRA": {
    "date": "12/24/2016",
    "text": "This is what a great restaurant looks like. Instead of focusing on the fancy environment they focus on food quality. I got beef tika kobob and kofta kobob; both were great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E0PLKSXOo-Ah9YvCKktlxA"
  },
  "brdCENBgj6oPfmht8RyF-A": {
    "date": "10/25/2014",
    "text": "My fiance is Afghan and it has been completely impossible to find any Afghan restaurants here in Vegas. This place  labels itself as Iranian & Afghan. So here we are. So far I didn't see anything Afghan on the menu. Mostly your typical kabob menu. We just ordered the combo #10 with kofta, beef and chicken. My fiance changed the rice they typically serve to a rice named qabuli. We also ordered boraani as a side dip. Its made of eggplant with a yogurt drizzled on top. Food arrived. Loved the kofta. Beef over cooked but spiced well. Chicken spiced well but a little dry. Rice was not a good quality brand and had too many carrots. I wasn't into the dip and fiance had no comment really. I'm giving this place 4 stars for the KOFTA! Atmosphere is very very casual with the restroom  located thru a maze directly in the kitchen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ZklEnMBNRVmkeK3E1nM_Q",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0ZklEnMBNRVmkeK3E1nM_Q/o.jpg"
      }
    ],
    "user_id": "3EKyCSrhaJ10_qX8OREpBQ"
  },
  "KYGNahjJpzvufT5lM-1KDA": {
    "date": "9/1/2014",
    "text": "Simply Amazing!  Flavorful foods.  Nice staff.  Relaxing environment.   My girlfriend and I both had an order of chicken shish kabobs and an order of hummus.  The hummus was so flavorful and the pita bread was warm and perfectly made.  The chicken on the kabob plates was moist and very well seasoned.   The rice... oh my lawd was that great rice!  Yes, this place is a \"hole in the wall\", but dang the food is good!  Will be returning again in the future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DpGRP2GXrAaFZWJ4gro1yQ"
  },
  "CNZSHjIedmsgOL-L3DtfWg": {
    "date": "1/16/2014",
    "text": "The place is great; not fancy, but clean with service provided by a courteous staff.  My wife and I stopped here to pick up some feta cheese, olive oil and other Mediterranean groceries, saw the dining room and decided to stop for lunch.   Her felafel sandwich was terrific, my kabobs were great - both served with saffron spiced basmati rice.   It's a twenty minute drive from the strip but worth the short trip. Try it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "no0PFxKUP4XDWd_cXxtxhA"
  },
  "BhgsFIvz6zAschPTP2J7Kg": {
    "date": "9/9/2013",
    "text": "I decided to try this place because of the Yelp reviews and it was a very pleasant surprise.   I was in the area and saw the check in offer.   The place is pretty small and in a strip mall. You can't miss it though; the name is in 3 foot tall letters with a yellow background.  The decor was nice and not overdone.  The owner was there and was really nice and cordial. I asked him what he likes and he said the lamb kabob was one of his favorites. And the green sauce that comes with it is one of his house specialties.  The lamb was perfectly seasoned and cooked nice and tender. I don't eat lamb the often and this was a really delicious treat! The sauce, wow, spicy but not too spicy. The kind that keeps you going back for more.   Now let's talk about the rice. OMG, I honestly and not a huge fan of rice but this rice was deeeeliscious. it was long grain rice. I don't know what they put in it but damn. I ate all of it and would have eaten more if there was more on the plate until I was in a carb coma. I think they sprinkle the top with a mixture of cayenne and sumac.  The price was right too, I think I spent $13 including tip  I would definitely visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "6y3XgANQ4YGtR8Tv0pgl8Q"
  },
  "itgJISQB1njQlBr3TFYx6Q": {
    "date": "1/15/2016",
    "text": "I've been a regular at this place for a long while. I always get the tandory chicken kabob, it's my favorite! I also like the bread they give, it's really soft. The green chutney is also nice, kind of tangy. I knocked one star off because I've noticed the size of the chicken pieces has dramatically decreased. The meals used to have large breast pieces, now they're almost bite size, even though the meal costs the same. Tasty but too small!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "4GWkIWn4SZ438rc7fksNfQ"
  },
  "KW1ttm_FMMP614kqMzIFag": {
    "date": "2/6/2016",
    "text": "Absolutely delicious! I went for the first time and ordered the chicken kabob and I was really impressed. The cashier was friendly the restaurant was clean and the food was perfect! Definitely worth the drive if you don't live close by. I can't wait to go back yummy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGXvT48u3qyi5qwjXATqZA"
  },
  "J2_OrkmnjcMFdyykT7hgyg": {
    "date": "3/8/2016",
    "text": "Had the #10 king sultani  everything  was amazing  . One of the best lunches  I've had in a long time . I think I  have a  new favorite  spot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7R-4hVi7zsYRFeyUkiSEvQ"
  },
  "gSyR9LeB06L09agGNxkYRg": {
    "date": "8/8/2015",
    "text": "This place has the best chicken wraps EVER! So yummy. The kabob plates are delicious as well. Great food, good prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yBw4VHtZ050Td92EOIiktQ"
  },
  "5ERUysSqXaBxitPS0-3x1g": {
    "date": "10/3/2015",
    "text": "This is place to get freshly grilled food. I love their sandwiches. Order in advance if you would like to get timely order as the chef takes pride in cooking freshly made food. Friendly owner who works really hard to provide great service. I will eat here anytime..Go Kaboob..",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hQ20LJ0GDIIl4aN9RTaEvQ"
  },
  "rx2rf2QzTEooHJUOLzqslg": {
    "date": "4/20/2016",
    "text": "I have been having lunch here for a couple of years now and always leave looking forwarded to the next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eNQ4mxccKfpzfASo4wPbnA"
  },
  "9EOJXXOXp4fVjTo7LNrsxQ": {
    "date": "3/10/2016",
    "text": "Very nice people, good service and delicious Afghan food !! Good selection of kebabs like lamb, chick, beef and fish kabob. Everything marinated  in good recipe with amazing afghan taste.  Has enough table n chairs too for groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwin66lFptSakBArMSAvkA"
  },
  "bdHd9iiaiICzKJT5C1XMnA": {
    "date": "9/7/2015",
    "text": "I love the chicken beef sultani so much that I would literally eat it once a week if we ate takeout every night. The bonus would definitely be that since the portion sizes are so large, I'd always lunch the next day! The prices are incredible considering the quality and portion sizes. I never feel guilty indulging in takeout when it's from Kabob Express since it's so healthy. The dining area is small but clean. It can get a little warm if you sit near the windows at dinner time, just so you know. But the takeout packaging is so sturdy and you're out the door in a flash, it's really wonderful. The service is always friendly and speedy as well. See you again soon!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0daa3lYsz2iFumNX-Ay3Qg"
  },
  "L8Ref8iDaTL7HxHIL1JrVw": {
    "date": "1/9/2016",
    "text": "Not good. Low quality food. But it's cheap. The portions are small and there isn't much of a selection of healthy drinks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JLQaEz0qjhKi7HFb3YhnQ"
  },
  "h88Z2kn1P-1m8pU-egGAvw": {
    "date": "12/1/2015",
    "text": "Great food and great service. Not to expensive and the foods organic and healthy! People must come here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q-aDGv9h3bWeFlLq1RfZNQ"
  },
  "rwComAqM7RYJXm-uak5Pvw": {
    "date": "8/7/2019",
    "text": "Came in on a Tuesday. Place was dead. Not a single customer came in. Got the combo of chicken, steak and beef. Steak was tender although a little salty. Then moved on to the chicken which had no flavor and a couple rubbery pieces that were inedible. The beef was disgusting. I had to spit it out. No one checked on me or even asked how the food was. Shocked that this restaurant has such a high rating. The worst kebab meal I've ever eaten. I'm not a big Yelp reviewer but felt so strongly to post because of how poor this experience was.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dxe8r3k1SsVXiR2sOPCQJA"
  },
  "F69cSZyHs2sMBa1ZgRd5ig": {
    "date": "7/8/2019",
    "text": "Was in town For a wedding during the week and was trying to look looking for a healthy but tasty place to eat. Checked Yelp and and saw this place had pretty good reviews. It was later in the night so there was no one there so I got my food pretty quick. Had the combination beef and chicken and was not disappointed, everything was on point. Price was what you would expect for this type of food... Was bummed out that I didn't remember to check in and get my free drink LOL. Will definitely come back again when I am in the area again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JtFNbe-w0j6MQQaQaEB3Vw"
  },
  "MXzPmCU-wKdkPOAjw1BlPQ": {
    "date": "4/11/2019",
    "text": "This restaurant is OK, a little overpriced for what you get, the steak was tender, lots of flavor to the chicken, the rice was really good. But of all the different Mediterranean places I have had, this is middle of the road but overpriced. The service when ordering seemed as though I was inconveniencing the person. He had to get off a personal phone call after I waited for a minute or two. I'll probably skip this place in the future,",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vj6_rA8GjZDy7AnMgeRPuw"
  },
  "nUACaGYg-3efe6u13GJ_2Q": {
    "date": "8/28/2018",
    "text": "Convenient and affordable...my go-to place for kabobs when I want good food, nothing I have to get dressed up for, and plastic utensils are jusst fine.  Their eggplant (broni badenjen) is my favorite style of ALL the places I've been to in town that serves some version of eggplant, including Greek. It is served with a small fresh pita bread, cut in triangles for smooshing yummy bites into your mouth (it's definitely not dipping).  We usually get the ground beef kabobs, although they also have cubed beef, chicken, or lamb options, and even a fish kabob. Plates are served with rice (basmati or similar?), some iceberg lettuce salad, a serving of tomato/cucumber/parsley salad, and a nice warm pita. Whatever the green sauce they give you with the kabobs is called...it is awesome.  The people are always friendly and the food is always fresh made to order. What more can you want?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_6xgcbBwg-bkhnFUC5FSCA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Eggplant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_6xgcbBwg-bkhnFUC5FSCA/o.jpg"
      },
      {
        "img_id": "WdVpg-KAhPS8D8SeS_muHQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Ground beef kabobs plate &amp;amp; ground beef kabob and tandoori chicken kabob combo plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WdVpg-KAhPS8D8SeS_muHQ/o.jpg"
      }
    ],
    "user_id": "OcpxS8U7evLWyfw1K2pwng"
  },
  "YUoetPZPaOz-IicZNnsgZQ": {
    "date": "8/3/2019",
    "text": "BEWARE! My co-workers and I was in the mood for some Mediterranean food and yelp suggested this place, so we went. When we first walked in, all you can smell is the mask of cleaning supplies and dirty water. ( I should've walked out then ) but we proceeded to order. Wait time was cool, we get out food drive back to work, open the containers and boom, A ROACH! So I call them and explain to them like hey we just ordered food from there and we got a roach in our food, and the guy just kept repeating the menu to me, and I'm like no I don't want ANY food from here, I want my money back. He didn't understand and passes the phone to someone else and we have the same conversation. He finally understands what I'm saying and then says I have to bring the food back so he can see the roach, but I'm like I'm at work I can't leave, I can send you a picture just give me my money back. It was a whole big deal. My coworker said eff it I'll take it back. So, she gets there, tells him the issue, he then gets a fork, picks the ROACH out of the plate and places the ROACH ON THE COUNTER WHERE THEY SERVE FOOD starts looking through the food some more. I'm like \"oh you got ROACHES ROACHES\". Anyway don't eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rsTwCiGZytIgSfs_lwRHeg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rsTwCiGZytIgSfs_lwRHeg/o.jpg"
      },
      {
        "img_id": "mZhOAC8ntE91p5uk9x0DvQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. King Sultani and a ROACH",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mZhOAC8ntE91p5uk9x0DvQ/o.jpg"
      }
    ],
    "user_id": "d9pq2rt7ZvP5lcjAjAcIRg"
  },
  "rSDZ99oLAMiEL_qeNljfMw": {
    "date": "4/29/2019",
    "text": "Everything is good. I tried Kabab and kofte it was great since I'm from middle east so I can judge fairly. Everything in the restaurant is perfect except the waiter. He is too rude and unfriendly I don't know why!! He never smile. It seems like he doesn't know how to treat his customers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kYQr6XSOBXay6OrRHLuKSA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kYQr6XSOBXay6OrRHLuKSA/o.jpg"
      }
    ],
    "user_id": "1_eJvD2dXu9T2u1D62MJTw"
  },
  "CEdAQG7BTx0L9vP1ZeVkMA": {
    "date": "7/29/2018",
    "text": "If you are looking for a HALAL PLACE. With organized crew and clean kitchen this is your best bet....  i came here after a great work out looking for something healthy : this place looked promising and oh well it not only looked !  The food it's grilled . Very low on fat meals ! Great for gains........  i went trough  the kitchen and wow WOW I LOVE THE CLEANEST OF THIS PLACE ,  I will be coming back as many times i could when i visit Vegas !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vADrM6ekCBm5z4ycaaZODA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. #protein",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vADrM6ekCBm5z4ycaaZODA/o.jpg"
      },
      {
        "img_id": "HrpKCk3zzIEBb_nblaDK5w",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HrpKCk3zzIEBb_nblaDK5w/o.jpg"
      }
    ],
    "user_id": "FJdMhIf2w4G3qQBCcUaSxw"
  },
  "DK_1ObbFlQVg0SlPgffhlA": {
    "date": "6/16/2018",
    "text": "I came by this place on the way home to pick up dinner. Gentleman at the counter was nice enough to help me order. I ordered two plates. He asked if I wanted hummus, eggplant or some kind of spinach thing. I said hummus is fine. He rang me up and I was trying to figure out why it was so high. Come to find out the hummus was not included in it and he upselled me without letting me know. I pointed that out and he said he could refund me if I wanted it. I said no I'll take it. Let me tell you how shady that is. Not cool at all. The correct way and ethical way is to ask if I wanted a side item not make it seem as though it was included in the price. Just for that reason alone might make it a reason for me to never come back here again.....  Will update post when I get home. Currently waiting for food to be made.  Came home and ate the food. Omg it was so good. Steak and chicken was perfectly seasoned and tender. I loved it. Would like to come back but didn't like how the order processed went down",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 12,
      "cool": 9
    },
    "photos": [],
    "user_id": "lgxCqDMnowyx1Q5fLdLPCA"
  },
  "ggUqflwSMdBiY2ciGU4l9g": {
    "date": "6/20/2019",
    "text": "If I could give it No Stars I would for sure...  Ordered Chicken Kabobs which came with salad and a weird bread piece.   I also ordered several garlic sauces. The \"so-called\" garlic sauce was nothing but big glops of mayonaise. (absolutely terrible).   No dressing given with salad. The silverware arrived broken.  Chicken was so dry I choked on it.  Rice had absolutely no flavor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kOqcNFcpDl3h8vFNJ7FwWA"
  },
  "4WH5jLqqWHna4yLEbBzhiA": {
    "date": "2/11/2019",
    "text": "Greatest kebobs and baklava I've ever had. My wife and I will be back. Very authentic and well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lET5Sbd63HSsVUSEl0awrA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Best kebobs you will ever have",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lET5Sbd63HSsVUSEl0awrA/o.jpg"
      }
    ],
    "user_id": "r_GyCWJW2jWxZZD-QezE4A"
  },
  "Q2bbR1mneFuDaMEjkWiqPA": {
    "date": "6/23/2019",
    "text": "The food was really good, I pick up two chicken kabob plates for my boyfriend and I. For the price I was expecting more chicken though honestly but  staff was friendly and overall the food was tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "14aiyr5nFFqny0K_El2DJA"
  },
  "5dZFQv0Wcfr9cZsV6UjiQA": {
    "date": "6/30/2019",
    "text": "We got the chicken shawarma and the lamb kabob... so good and def worth the drive. The only downside is there isn't a lot of staff so the service is slow.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KFXWzKMm4GkW-gDX89zhVQ"
  },
  "TN75MR0hNxqB8eLChhA4LQ": {
    "date": "6/7/2018",
    "text": "First time here. Thanks to Yelp we found this place. Not too far from our hotel where I was at on the Vegas strip. Very friendly staff there. The person that took my order definitely had a language barrier, but I tried my best to understand him. I ordered the hummus plate, served with warm pita bread. Would have been great if they offered more pita bread to go alongside. I did use the rest of the hummus to eat along side the entrees I ordered. For my entrees I tried both the King Sultani combination plate of beef, kofta (seasoned ground beef) and chicken. Also serves with basmati rice, a salad that included cucumbers and tomatoes, also some warm pita bread. The other entree we tried was the kofta combination plate that included all the items with the Sultani plate. The large dining area filled up quick, but yet I was able to get in there and enjoy my lunch. Will definitely be back to enjoy more of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bWNftm8qY6YVnVxB0sS9Ug",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Pita bread and hummus",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bWNftm8qY6YVnVxB0sS9Ug/o.jpg"
      },
      {
        "img_id": "SmzHPTI6I_gySccQFPNscA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. King Sultani plate, beef, chicken and kofta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SmzHPTI6I_gySccQFPNscA/o.jpg"
      },
      {
        "img_id": "s899t9E2V2SgM-qCRaHJEw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Kofta combo plate, includes rice, salad and bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s899t9E2V2SgM-qCRaHJEw/o.jpg"
      }
    ],
    "user_id": "KdvnFdMqlalqdujAhdufTg"
  },
  "l7-mnVQ1WwS58_O4guGznA": {
    "date": "5/26/2019",
    "text": "The food is not good. I ordered the king sultani, i can not chew the chicken and the beef, the meat is too dry, no flavor, not worth the money. The chicken shawarma is better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9WX-0xNTprJwYYMUwCPdMw"
  },
  "6cGYRHxkubn7J2U1xLDAtQ": {
    "date": "10/27/2018",
    "text": "Convenient and yum food.   We come often to vegas for business trips and stay closer to the airport. This is our main go to place for food. Service is fast, location very close to our hotel, price is reasonable and tastes great.   Highly recommended to try this place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WZ-myk3fZRujY9hJ5OThLA"
  },
  "6gxPy055lSqkT7mBCLUtpA": {
    "date": "6/24/2019",
    "text": "These guys stepped up their game. Kabob places are always inconsistent, but they seem to have found some sort of a standard. Will go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sguNXRQbh-59ztjpyQoueA"
  },
  "CDALy3C2AE34rxrP8qAJyg": {
    "date": "3/20/2019",
    "text": "Whenever we're on this side of town my son insists on a Gyro plate & Homemade Baklava",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z9LgGSRpsP2rhDjPQ__lNA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z9LgGSRpsP2rhDjPQ__lNA/o.jpg"
      }
    ],
    "user_id": "3h0PlbOwn2wcGAug4pG0DA"
  },
  "uqSB64-oMCGLV3isLjobaA": {
    "date": "8/3/2019",
    "text": "we got 3 items, a chicken schwarma, a chicken & steak kebab plate, and a ground beef and steak plate.    all were really really good.   we also got the egg plant appetizer amd it was very good.    we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8EZnvQ3qBqHPu3LwvJ2yng"
  },
  "A1KJ3yxcEsZ9mSV-q9QuSg": {
    "date": "5/19/2019",
    "text": "The Giro they don't put that much beef,the use to much lettuce n tomatoes n a little beef, very good flavor",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7B0b2qp-Hdl6f9Igq0XgHA"
  },
  "V6FSeiYGx85_IlSpKT1JLQ": {
    "date": "5/28/2019",
    "text": "The cook is very unsanitary, I was disgusted to eat my food, I had to ask the front worker to ask the cook to wash his hand after sneezing, I'll probably never eat here again!! The only reason I came here is because it has nice review, which is a complete lie.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H58rpiuIYPlZZk_GHyUDEw"
  },
  "TQIwX7eVQ3GwMZrA0sJkZg": {
    "date": "2/19/2015",
    "text": "First time eating here but would come back soon. Service is a bit slow when there are to many people here but the food is worth it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pJuuAFLCCeRStnrF0L03Zg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pJuuAFLCCeRStnrF0L03Zg/o.jpg"
      }
    ],
    "user_id": "A_3c-4FUVTsNosP4B8s4Ng"
  },
  "EEXmeu0IOMrovVypStN0vg": {
    "date": "12/8/2016",
    "text": "I have been to this place twice now and both times I was passing by Vegas enroute to Utah. Both times during my visit the the restaurant was clean and the tables were wiped out well which is a positive and hygienic sign for every customer. The food tastes really good. Both time I have ordered the beef and chicken platter. The meat is always marinated well and then grilled to perfection. Served with rice, pits bread, yogurt and mint chatni the whole meal is worth your time to drive down from the strip into the neighborhood of the city of Las Vegas where this place is located. A must recommended place to everyone who love good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKR_Vt2FxKKX1eJSg0VDjg"
  },
  "7Yhst8JVQ9d7kbjyLmt1sw": {
    "date": "3/28/2015",
    "text": "The chicken shawarma wrap was delicious. The white meat chucks was full of flavor. The portion size was well worth the 5.95 plus tax price. The pita and filling were warm and fresh. The jalapeno spread was a nice addition.   This place will definitely be one of my go to's when I'm in the area. The restaurant is small but clean and comfortable. The staff was also friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnyHIBrOC19zkuIaFNpVog"
  },
  "TYD8mlBC5SKXZWPQZjV3IQ": {
    "date": "7/14/2016",
    "text": "The food is good, but the platters have way more rice than meat. Although the quality of food is good, given the average ambience of the restaurant, it is slightly overpriced. With that being said, it's still worth at least checking out if you're interested in Middle Eastern cuisine.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FR__xQdG5ApYGQsTqsnELg"
  },
  "Wrf4tzcZuttT6aTsvdpdvg": {
    "date": "8/30/2016",
    "text": "I love this place. Their chicken and beef plate is amazing! The meat is tender and the cucumber salad is mouth watering!! Have nothing negative to say about Kabob Express",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CbzG0CZn_RZyP-zPyRNApQ"
  },
  "8ZFh1mQKvvr-p22oiw2CEw": {
    "date": "10/15/2016",
    "text": "Good food at a good price.  Better than Parsley and I would put them on par with Stefano's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZ0n2p53_1CB4_eODoSRxA"
  },
  "HlWvbruKTTshHPyNvxTQDA": {
    "date": "6/21/2016",
    "text": "Love the food here, and prices are great. Love the fact that you can order just the kabob as a side. Portion sizes are perfect. Overall a great place to have some fresh Mediterranean food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FpOYsX0xvWRlKkl6sKnBA"
  },
  "VCJ22-hnVZHNcerahUkNKg": {
    "date": "6/4/2016",
    "text": "The most amazing food I have ever tried on the face of earth .. Would never ever leave Vegas without it !! Even  my husband had to bring it for me to make up with me  ..pleasant ppl good service and delicious food ..love the kofta kabob and tandori chicken",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vt51GDalNMd80jHz8xHUvA"
  },
  "A55Z4H-EKseJXgnAq1jtkg": {
    "date": "5/1/2014",
    "text": "A co-worker and I passed by this place on our way to get Chinese food but decided to give Kabob Express a try and was glad we decided to skip on Chinese.   The place is pretty small but very clean and the gentleman at the front was very welcoming.  Everything on the menu looked good but wanted to try a little bit of each of the meats. I decided on the meat combo which consisted of chicken, beef, and kefta. Each of the combo plates came with your choice of meat, rice, salad, and a pita bread. I wanted to go all protein so asked for the combo without rice but the cashier highly recommended the rice. You can certainly tell he was very passionate about his food and stood by it 100%. I also got a free soda with a yelp check in which I gave to my co-worker. Since I didn't order a drink for myself the cashier went ahead and offered me another free soda. Nice!!  As the food came out I noticed the portions were pretty big. The meats were very tender and the chicken was very moist. The beef to my surprise was so tender I was able to separate it with just my fork. My favorite was the Kefta. I believe its made with a combo of beef and lamb but the spices is what really makes it stand out. Oh and be carful because you'll get the garlic burps after eating the kefta. I didn't mind since I was able to taste it throughout the day, it was that good. Also ask for the cucumber yogurt sauce and the spicy green sauce as both go perfect with the meal.   Overall this place fully satisfied my protein craving. I would definitely come back. Awesome kabobs.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "2wyP8DL1isAG-6ApKbvDSw"
  },
  "te6q4jn5O3aqrk7aJgHdqA": {
    "date": "6/27/2014",
    "text": "Great experience here! For the connoisseur of middle eastern food, there is a full menu of standard kabob as well as some exotic selections which are served with salad, bread and rice. Free soft drink available with check in as well for a complete meal! I gotta admit that I'm not quite enlightened on some of the offerings so I got a gyro, with fries and drink for under $9! What's even better is that the portion size was so generous that I took half of it home for dinner the next day. World Cup playing on 2 screens was an added bonus. Great value and I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rHXHrGRl8HdYbq1_8Is9_w",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Gotta love a good gyro!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rHXHrGRl8HdYbq1_8Is9_w/o.jpg"
      }
    ],
    "user_id": "Lfy3FGYMyOqCyNwJ_6fnyg"
  },
  "eEwjPlPVKdGxnYEl5gfoXw": {
    "date": "6/10/2016",
    "text": "So good!! So far my favorite place for hummus and their chicken kabob was so yummy!! We will definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0CfXmLS7ZU5-M7dDDwb4A"
  },
  "o-n4Kff_HT51C6Ia6G_43w": {
    "date": "5/1/2014",
    "text": "This was one of those \"been meaning to try this place\" and I finally did.  Airy and clean and it smelled so good when entering!  I really wanted a vegetarian kabob, but since it wasn't on the menu I opted for the chicken tandoori kabob.  Seasoned nicely and the chicken was juicy and tender - and they pulled the wooden kabob so I didn't have to fuss with it.  Yea!  I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KdQq5g7AjZyCrB2gzwHsmQ"
  },
  "37BIUUReOtyHjmnQUHzigQ": {
    "date": "12/16/2014",
    "text": "Food is amazing at a great price!!!!!! Try the tandoori chicken and the hummus! ! YUMMYY",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1aRqecJexjPsPk0uD6pJWA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Hummus",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1aRqecJexjPsPk0uD6pJWA/o.jpg"
      },
      {
        "img_id": "qwdafVrz7vyDjZhKyhFnIA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Tandoori chicken with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qwdafVrz7vyDjZhKyhFnIA/o.jpg"
      }
    ],
    "user_id": "39w1YotSV0FP-uDkTbj4hg"
  },
  "cgsw_EsZAN0WiQLhaPiKaw": {
    "date": "7/4/2014",
    "text": "Damn good food yo!  This is my second time here. First time I had the Gyro and it was pretty good. This time I ordered the Kofta Kabob and Chicken plate (#7) and it is DELICIOUS!  Fast service, affordable and so yummy. The only reason I dropped one star is because I only wish it came with a side of hummus. Though you can get it for $4.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VGbw3AmOYkNgn2VkUNWCfQ"
  },
  "bFOTwdtes9itRK1w1Hok2g": {
    "date": "5/13/2015",
    "text": "Good kabobs but the pilaf needs improvement. I was very pleased with the customer service and the timely matter that the food was given to me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k2pGNVh4Ph37zusck87LOg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k2pGNVh4Ph37zusck87LOg/o.jpg"
      }
    ],
    "user_id": "qks-ypWyLMOTs5sxz-di9w"
  },
  "XMGasCgpwc7AJOhYtK9BIA": {
    "date": "6/14/2016",
    "text": "The food it's good and tasty,,  the only thing I didn't liked was that I called to order My food  because  I was in my lunch break and they still took to long to serve me! but I would  give them another chance..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sK0VbAkPzn4qchb74ebQbw"
  },
  "wBrligjZXsD0-OEYVyWSKw": {
    "date": "2/16/2014",
    "text": "I ordered delivery. There is a $25 minimum and a $5 delivery charge via grubhub. The order showed up on time as promised, but was missing 4 sodas, so that was disappointing. Opted to get a refund for those rather than make the guy schlep all the way back over. As for the food, the portions were large for the price - they don't skimp on the chicken in terms of kebab size. They use the standard take away styrofoam boxes, with the big half containing rice with your meat on top. The two smaller areas of the container had a little tomato/onion salad type thing and some shredded lettuce. There was a small pita in the box as well. Both the standard and tandoori flavors were great. I would happily order either again. I also got a side of tzatziki and it was appropriately tart and creamy. The small was big enough for two people to intermittently eat.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ltTLCzM4p-1cnC70SPNfSA"
  },
  "C232YHFbyG75Hff4fLMwJw": {
    "date": "12/4/2015",
    "text": "Just now finished and wow.  I don't know anything about this type of food but what we ate was very good.  Husband had  beef and chicken number 8 I think. The meat was very tender and well seasoned.   I had the chicken gyro sandwich I forget the name and it was definitely worth eating.   We got there little after 11 and only one other customer ahead of us.   No problems with the staff or the wait time.   I did  get the feeling that women are not important, all conversation was directed to him.   place isn't as small as I imagined and it was definitely clean.   The tables are large.   The price was a bit higher than what I would have liked.  But not outrageous and we will go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jE8f3q6WxJnU_dW-rjdHeQ"
  },
  "qsF9Kw3lgwBc5ayEmff3Ew": {
    "date": "8/9/2014",
    "text": "One of my favorite middle eastern restaurants in Las Vegas, a hole on the wall. The food is mainly Iranian. I've tried most their combos and none of them have disappointed so far, the meat is so tasty, tender and juicy, perfectly cooked. I love the salad, the green sauce and the yogurt. The owner and staff are very attentive, I've been a frequent costumer for 3 years and my experience has been great every time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BQHSnzXEGY42AnyVd59pUw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. My favorite combo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BQHSnzXEGY42AnyVd59pUw/o.jpg"
      }
    ],
    "user_id": "36JKC_Pk9bzuoiZG2LGFjQ"
  },
  "eAr1PmynHyLXRpIr8WVUTA": {
    "date": "3/9/2016",
    "text": "I just moved to NV from VA and oh boy this kabob place is awesome! For almost $8 I got the chicken breast kabob and it was a pretty big portion for one person! I'm stuffed. It comes with lots of rice, pita bread, little pico de gallo but with cucumber and lettuce. Some green sauce, ranch and yogurt sauce I think. Really good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSt4eW3soJ_3Zb8ytiprlg"
  },
  "wtH2jTn22UIiW4-8n7xrVQ": {
    "date": "8/19/2019",
    "text": "So Delicious!  Best I've EVER HAD!! the people who work. Here are absolutely the nicest people They hooked us up!!:) I would highly recommend this place  !:) great food and the service was as good as it gets. Thoughtful attention to detail and a clean dining room!! The food is so fresh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k8GMGefr7NaOOyzWanm6Qg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. The lamb GYRO!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k8GMGefr7NaOOyzWanm6Qg/o.jpg"
      }
    ],
    "user_id": "DMSPFBM1Il7B1-MVCdWvxA"
  },
  "5_ZP3Qh-9doT_sZBdWLLUA": {
    "date": "9/21/2019",
    "text": "Got the number 8 1 and 6. All were very good  Ill definitely go back and try the tandoori chicken",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4Jvmns0kDZTlXP29FWnSw"
  },
  "fMqP5gEbJYFpIrfq-hjenQ": {
    "date": "8/18/2019",
    "text": "Overall: Kabob Express was pretty damn good, and the workers were pretty nice. I will definitely be back to update my review.  Food: 4.5  Gyro Wrap: I loved the thick cuts of gyro since it let me really taste how moist and flavorful the meat was. I feel like a lot of places cut it pretty thin, and I hate it. The pita bread was soft, warm, and fluffy. French fries were hot and perfectly crisp.  Service: 5  The man that took my order was very friendly, and they were pretty accommodating.  I appreciate that they were thoughtful enough to put all the sauces in separate containers for my to go order. But I'm not sure if that's something they do for all orders, including dine in orders, or if it was simply because mine was to go.  Ambiance: 4  There's something about this little hole-in-the-wall restaurant that I like. It's rather barebones, so it's not a place that you go to because it's Insta worthy or trendy.  It's a place that you go to for good food. There's a counter where you order, a few tables, and a sink for diners to wash their hands. By no means is it dirty, it's just simple.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "scWPwwaZeZsk0OzJ856z-w"
  },
  "jsmj00trU27I5Zg4PQT6zA": {
    "date": "7/23/2019",
    "text": "So this is definitely one of the best Mediterranean Restaurants in Vegas. The flavors are rich and the food is cooked perfectly. Best hummus ever no mayo. And try the delicious green sauce it has a Spicy cilantro feel and tastes amazing with everything.   The owner is there often, he works very hard and so does the chef. Omid also does a great job. I see he always gets everything perfect and timely.   Reasonably priced with generous portions.  I am a regular here and have seen consistency every time!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "1TVRWrTrqC8xHbNFj9Eq5A"
  },
  "2Oeh_wxe0WR9ZkXofNZ1Yg": {
    "date": "9/24/2019",
    "text": "Best Fast food Mediterranean cuisine in Henderson. I usually order the rice over the fries for a side but that's my preference.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAD1dDYSuMSk9BWXKlbl4g"
  },
  "d_0sWeoioR-md7Qv1XVY8A": {
    "date": "7/9/2019",
    "text": "Good food and fast service. I got the chicken shawarma and it came with 3 sauces. It was a bit pricey at about $9, no sides included. They do offer a combo with fries and a soda but wouldn't sub out the fries for a salad so I didnt partake.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3vTutBYgpzO3sdV6o8Ry8w",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Chicken shawarma",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3vTutBYgpzO3sdV6o8Ry8w/o.jpg"
      }
    ],
    "user_id": "JDMRe32HHKuP5OVnQdxX9Q"
  },
  "_VZMz4ce5qgni5eGNlMh6g": {
    "date": "2/2/2019",
    "text": "This place was great! Hidden gem tucked away in an obscure little plaza. Check out this quaint little spot for some big awesome flavor and super high quality food. You get a great portion for the price and the meats were not only seasoned very well, but they were also cooked to perfection.  Nothing to complain about here. If we were locals we would be frequenting this spot on the regular. Actually the following days, we compared other restaurants to this one. Do yourself a favor and check it out! A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Ze7yk_UytQ93_FWGCbeZig",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ze7yk_UytQ93_FWGCbeZig/o.jpg"
      },
      {
        "img_id": "9VLcFMBF03c5852_Lo1FXg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9VLcFMBF03c5852_Lo1FXg/o.jpg"
      }
    ],
    "user_id": "W7Y42iEV4I9zQL1Ui1O1hA"
  },
  "T2SwlZE9FfrzDv7-joHvcg": {
    "date": "8/16/2019",
    "text": "Found this hidden gem on Yelp. Saw no signs of bug infestation, and waiters and cooks washed their hands in plain view of customers. I had seen poor reviews based on cleanliness, but the staff was cleaning the whole time we were there. Lots of people in the restaurant late at night on a Friday, and the gentleman working up front seemed to know everyone who came in by name, which was refreshing. Ordered lamb gyro and hummus (which was so good), and my husband ordered the King Sultani plate, which came with salad, rice, bread, chicken tandory, beef kabob and steak. Everything was flavorful and the meat was juicy. So glad we found this little place. Would recommend to anyone who doesn't want to break the bank and get dressed up for an expensive night in Vegas.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Jt8QwaT4PeutIpyAGRtMqg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Gyro Combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jt8QwaT4PeutIpyAGRtMqg/o.jpg"
      },
      {
        "img_id": "CxeExlpBRCBF-GMe27DH7Q",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. King Sultani",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CxeExlpBRCBF-GMe27DH7Q/o.jpg"
      }
    ],
    "user_id": "qRTqjIxc9x-dgYvBQ1VvTg"
  },
  "eiD8VtIKKHa5uzUVBG4p_A": {
    "date": "1/20/2019",
    "text": "Stopped for lunch and this place still has great food!  I got the ground beef Kabob plate and a drink.  Love it!    My only complaint is the music they were playing was way too loud!  The place is relatively small, but I couldn't hold a conversation with anyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2DOZisOYoEGCTdE7_U8G9w",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2DOZisOYoEGCTdE7_U8G9w/o.jpg"
      }
    ],
    "user_id": "q0wcFMDeV57s-Xi-eXZmFg"
  },
  "zepx4jMTAubAhIwhBOOc6w": {
    "date": "12/22/2018",
    "text": "I am so glad that we found this little restaurant. Don't let the outside stop you, the food is delicious.  The interior is modest but clean. The service was fast and friendly. The person that served us was chatty and told a bit about him.  Now the FOOD was so DELICIOUS. Such an authentic taste, the portion was very generous for the price we paid. The meat was marinated, full of flavor and so tender. Definitely will drive across town for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "4-3VRooS1Wm8F4yfs2wmsw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4-3VRooS1Wm8F4yfs2wmsw/o.jpg"
      }
    ],
    "user_id": "N2OaEXUFicr6LH3m4lXsNQ"
  },
  "YpW-u0Qm1igPbedmkCvRYw": {
    "date": "4/26/2019",
    "text": "From a purely visual standpoint this place raises some red flags. It's in a more \"run down\" shopping center that doesn't look well maintained. Inside is pretty much the same story but the place has good reviews so I kept an open mind.   I ordered a beef plate with rice. The food itself tasted good. The meat was well seasoned, tender and juicy. I also received a very large amount of food.   As I was eating I look up and see a black speck moving along the wall. As I look closer I realize that this black speck is a cockroach running across the wall. It made its way to the galley door leading to the kitchen and disappeared just like my appetite.   If I hadn't tasted the food prior to this ghastly sight I would have given one star.   Kabob Express, please look into the pest issue I noticed. I hope you can take the necessary steps to irradiate the problem so people can enjoy your food worry free.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "222_8pOPN2Ogy-gLNjudHw"
  },
  "W_EnonzjM8uRdc7V95ijmA": {
    "date": "4/27/2019",
    "text": "This place is amazing! By far the best i've had in CA and Nevada. The flavors are authentic and all the food was perfectly seasoned. The staff was friendly and accommodating to my questions regarding the dishes. The portions were more than generous. I honestly can't wait to return for my next meal!!  Good job guys",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AaK8nIi-p6gF2TU74UOJqA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Hummus and pita is sooooo good!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AaK8nIi-p6gF2TU74UOJqA/o.jpg"
      },
      {
        "img_id": "5Rkgspxlt7eSVNDSrMEzLA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Rkgspxlt7eSVNDSrMEzLA/o.jpg"
      },
      {
        "img_id": "ZxOF5VlTgA50Q3GExIfz0g",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZxOF5VlTgA50Q3GExIfz0g/o.jpg"
      }
    ],
    "user_id": "6vW2BUWuN_Lp-YFz4kZJig"
  },
  "TRZk88Z3fHHRVbkeMzI6iA": {
    "date": "4/24/2019",
    "text": "Been here a dew times now, lunch and dinner, to try different item and have never had bad food or service issues... The same couple seems like they are always here, and they are friendly and helpful when I want to mix things up a bit. Have had the Kabobs, Shawarmas, wraps and a mixture of these. The Lamb is tasty, as was the chicken kabobs. The beef kabob was filet mignon, I'm pretty sure. The salad was large and everything was fresh in it. A great addition to the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGfs1wP0ENl4oZCqGxH6zA"
  },
  "4y3Ot0P8dv0j_eDY6vMRjg": {
    "date": "7/16/2019",
    "text": "The food is TO DIE FOR!! I've sampled the chicken tandory plate with a side beef tika kabob. A-MAZ-ING!! Everything from the price to the presentation were great. The food was cooked to perfection! We will definitely be coming back here",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FjvJEUMDT7_RCbEfMeOTCA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FjvJEUMDT7_RCbEfMeOTCA/o.jpg"
      }
    ],
    "user_id": "TVaRLJPv-kg_cQ7DuqOJBQ"
  },
  "XTsFzGH7E_PzAyM8HR91pw": {
    "date": "10/18/2018",
    "text": "Had a craving for kabobs and happened to be in the area. The whole menu looked delicious and the L prices were quite reasonable. I ordered the beef tika plate, which came with rice, pita, salad, and sauces. The portion size was great! I was barely able to finish my food. The meat was seasoned and cooked well as well.   I think if you're looking for a solid kabob, definitely check this place out. It doesn't blow you away, but it definitely hits the spot if you need that Mediterranean fix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rXYAPT0Cl_rkCj-NmDEFRA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Beef tika kabob plate.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rXYAPT0Cl_rkCj-NmDEFRA/o.jpg"
      }
    ],
    "user_id": "WXhpzdiu3w8LHFlZrUFaeA"
  },
  "hCx3yBDcaxX6KThsiPBlOA": {
    "date": "4/24/2019",
    "text": "This place would be 3 stars if it wasnt for the ridiculous amount of rice they gave and the small portion of meat :(  Walking in.. its very plain and simple and straight to business. Limited on seats and tables, but I noticed while dining in that majority of people pick to-go. After discovering that it does take a while (about 20-25 minutes) for  the food to come out - ordering ahead is ideal.   One thing that was kind of unique (lack of a better term) is that there was a sink by the kitchen door (assuming a place to wash your hands)? I then questioned if they had a bathroom or not... so i asked.. and i was instructed to walk through the kitchen doors.. pass where they were cooking and towards the end.. (not a fan of that) but, it is what it is..  The food itself was superb! The flavor and the spices were there and it did not disappointment at all. Again, just wished that they gave more meat and less rice - especially for their prices.  Not sure i would be back, but if im hungry for some rice.. then i know where to go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A0Sy2srGc-AhXEuFoErDkw"
  },
  "UMZXhEwG1pSPcoussfA68A": {
    "date": "4/12/2019",
    "text": "The place was beautiful great esthetics  Cultured music   very clean   Service was very poor It seems as if he was mad or annoyed idk  Food was for but tried way better   Price here is also a bit much for the amount of food",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6GB9wXvKk2jEcpOflIoKRQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Gyro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6GB9wXvKk2jEcpOflIoKRQ/o.jpg"
      },
      {
        "img_id": "OU11sKU5cZDloQOREUO-bA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Gyro",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OU11sKU5cZDloQOREUO-bA/o.jpg"
      }
    ],
    "user_id": "ac0mP-jQxnJbXTHQB0Dvdg"
  },
  "3Z9pJ0K0tfhaHXfF9Q1jOw": {
    "date": "7/7/2019",
    "text": "The food is just so-so I ordered a little bit of everything so I know. Should have been 3 stars, but too many other things are lacking.  All the 4 and 5-star ratings here are just overly hyped and people being nice.  The food is just decent. The Rice is made right, it's nothing special.  It's ok. The meats aren't super juicy, not entirely dry either. A little bit dry I would say.  The ambiance is awful. The restaurant is like a hole in the wall pizza joint. The menu is just a few poster boards.  There is no air conditioning.  The ceiling fans are dangerously wobbly.  The floors and tiles look filthy and the garbage and tray return area is pretty dirty looking.  The TV is off and there is no music.  There is a famous poster of an Afghan girl with the green eyes taken from national geographic in the '70s on the wall.  I suppose the rest of the decor and sitting in the heat while eating in silence should remind us of war-torn life.  I would come here sometimes if I worked in the neighborhood. Otherwise, it's not worth the trek as the food really isn't better than any other Mediterranean joint in a food court.  If this place was as clean as a decent pizza joint and played a little music with the air conditioner on.  It still wouldn't deserve more than 3 stars because the food is just ok.  it's NOT amazing.  Pretty sure anyone blown away by the food here would feel the same about Denny's.  Either you haven't traveled or you were just too hungry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "udSgW1BGOjP4lw9_Fsqqpg"
  },
  "uYvnw4-5PNGRLh7sBG5WjQ": {
    "date": "7/17/2018",
    "text": "Kabob Express is on my top list for Authentic Afghan cuisine. I greatly enjoy having delicious comfort food and good service here. The restaurant is very clean. There's about 7 to 8 tables which can seat 4 people. The environment has more of an earthy feel with simple floral decor and beautiful artwork. They play a nice selection of mix songs from Afghanistan, Iran, and India. It's nice to dine in during the day because there is so much lighting. Also it's great that they keep the fan on. I like the cool breeze inside. The only downside I see is that there is no public restroom available.   On my first visit, I had the Broni Badenjan ($8.95) which is a cooked eggplant dip that is topped with yogurt and serve with basmati rice, salad, and bread. The eggplant dip has a good flavor and it's tasty with the basmati rice. I got a side order of fries that are big and crispy which I love. On the menu, they have a Homemade Yogurt Drink ($2.45) and I was curious about how it taste. It came with a lot of herbs. I was under the impression the drink would be sweet, but it taste like drinking a cup of watered-down Tzatziki. I'm just not used to this drink, maybe it's an acquired taste? I think I'll just stick with having an iced tea.   My next visit is a better experience. I ordered the Chicken Shawarma ($6.95) and a second serving of fries ($2.45). The Chicken Shawarma has lettuce, tomato, and chicken wrapped in a soft pita bread. The meat is nicely seasoned and grilled, it taste so good! I would love to order one more just like this. I notice the fries look smaller than my first visit. It seem a little flimsy and not as crispy. I am hoping they bring back the bigger size fries. The small fries just doesn't work for me.   They do have a soda fountain and a small fridge where you can choose your drink. I've also tried #3 Chicken Breast Kabob ($8.95) which has great flavor. It's serve with basmati rice that is fluffy, a green salad that is mainly chopped lettuce, some dressing, and there's tomato, cucumber, and cilantro. Even if it's just a simple salad, it's still refreshing to have and it goes well with bread. They complement the meal with Tzatziki and a jalapeno chili pepper sauce that taste amazing.   Overall, the food is flavorful and delicious. Plus the staff is very welcoming and friendly. They acknowledge and greet every customer that walks in. They are so polite and accommodating and make time to check up on the customer. If you decide to order for take out, they offer food delivery service. They pack the food well and they will go to great extent to ensure the order is correct.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "ujg-DvYYhmc6QNmX7UaZBw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Chicken Tandory With Basmati Rice, Salad, and Pita Bread ($8.95)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ujg-DvYYhmc6QNmX7UaZBw/o.jpg"
      },
      {
        "img_id": "1viyx6qvYXisCrNX96sknQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Chicken Shawarma ($6.95)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1viyx6qvYXisCrNX96sknQ/o.jpg"
      },
      {
        "img_id": "rVO6XrALemzSZaOlDaMm3g",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Arizona Watermelon Tea and Crispy Fries ($2.45)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rVO6XrALemzSZaOlDaMm3g/o.jpg"
      }
    ],
    "user_id": "dpvR4LYXr0CYHtHf8BeCKg"
  },
  "yOmUMGhTVjqebZpa3jYN6w": {
    "date": "8/12/2019",
    "text": "The food here was not that great. As out of towners, we needed some halal options. As east coaster, we know what kabob tastes like with its wonderful flavors and this place does not have them. The food was really bland and just chewy. I would not recommend if you're a kabob lover and know your chicken and beef. Customer service was slow in getting our 3 entrees out of the kitchen.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_ehXMvuUnDEf3iu0n65Kg"
  },
  "1P3trA5pDyx2X30bl6SyfQ": {
    "date": "7/10/2015",
    "text": "This place is a dump. The place was totally empty! The inside needs a makeover. I ordered the chicken wrap it sucked all I can taste is lemon and its wrapped in a tortilla it's more like Mexican food than middle eastern food.   I won't be returning to this establishment.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qKJEQrFtW33HWqKzvn3U4A"
  },
  "wBqaOgz8QnJEq7W0SlSy5w": {
    "date": "10/21/2016",
    "text": "I got chicken beef kebab and it was so delicious recommend it for sure. nice people and nice service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pZz8MtU-70kXD4g5x_aeIA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pZz8MtU-70kXD4g5x_aeIA/o.jpg"
      }
    ],
    "user_id": "Fb2C1xrKXNgHzayrH_Q52w"
  },
  "qWB556xgYOQW8DivJk1N-Q": {
    "date": "11/23/2013",
    "text": "The beef was tender, cooked perfectly! The place was clean and busy when we got there at about 1 on a Sat. The service was friendly and the food arrived  hot! There's a little cup of green spice sauce that had an after kick...so watch out! Interesting enough, they were playing Christmas Music softly in the background! Made for a nice atmosphere on this cold rainy day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z88aMy717IMI_HmzEriBhw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Such a cheery place!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z88aMy717IMI_HmzEriBhw/o.jpg"
      }
    ],
    "user_id": "OJA-15Qvh9OqSRqwrdGNeQ"
  },
  "1mgfDO4-RloEGyHgK4uM4w": {
    "date": "8/15/2016",
    "text": "It was a very hot day in Vegas and we craved something fresh. The food was great and there was awesome customer service. I would definitely recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Lk8S7N82fVi2Lej5FJocWQ"
  },
  "Saf0AQv5kiowgaeSa6FFDw": {
    "date": "2/12/2016",
    "text": "Omg!!!!!! So delicious. My daughter got the lamb kabob and it was absolutely delicious, perfectly cooked. I got the gyro and I thought it was fantastic, it tasted divine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tJFVdcNc9qk2En08BCGCIw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tJFVdcNc9qk2En08BCGCIw/o.jpg"
      },
      {
        "img_id": "E1QraWE_LnpTZPJ0DWlDdQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E1QraWE_LnpTZPJ0DWlDdQ/o.jpg"
      }
    ],
    "user_id": "fSQuIqdY4p1WWRGgkKTBLw"
  },
  "yxWArmzj1FL_Ac3gQnm0AQ": {
    "date": "11/29/2015",
    "text": "Get the #1! You won't be disappointed! Never had this kind of food before...probably one of the best meals of 2015 and its already November. Definitely been sleeping on this spot! Not anymore!    Yelp! For a free drink too  #Halal-Lejuh #ItsLit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5DvLHin6QLeR6-FunbT2g"
  },
  "zk8izBIBrh8OjebAXkZHyQ": {
    "date": "3/24/2017",
    "text": "Best kabob place in town hands down. Had beef kabob w egg plant and spinach food tastes very  authentic  can't beat that!!  Lot of food enough for two people to share @ a reasonable price. Highly recommended good customer service too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t5w-3w_jwmmpP3JQ0uvzxg"
  },
  "qlWWGNVTape3hSb9ZU-b0A": {
    "date": "3/20/2016",
    "text": "We ordered beef kabob and ayran. Beef was juicy. Everything was delicious, for sure we will come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7IDUFCDrXlTdm_ERkRVtjw"
  },
  "8jtTunH2Z6PVSPzD9LsYJA": {
    "date": "10/3/2015",
    "text": "Might be the best halal place in Vegas. I don't give too many 5* reviews but this place deserves it. Service was outstanding. Our food was a little late to come out so the owner gave us another entree for free. Didn't need to but did it anyway. That's awesome. I got a chicken shawarma wrap and it was outstanding. Meat was seasoned really well and everything was just very fresh. The sauces that come with it are really really spicy. I can handle my spice, so this was perfect. Prices are very fair and the portions are reasonable. Will always come back here whenever I'm in Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLm3B6LeboEZWX_4otpILA"
  },
  "32TPiG3t4tyThoKQ3p8G2A": {
    "date": "3/27/2015",
    "text": "Good food.  Lousy customer service..",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7-7SFrfLEHf-BuI4EiUI2Q"
  },
  "NbhO_GEMOTd4_bZ7pw53Yg": {
    "date": "6/29/2015",
    "text": "I saw this and checked on yelp to see if that had any coupons. My coupon was for a free refreshment if any choosing but when I went to pay and use my coupon my little one had snuck my phone away and I couldn't find it. They were nice enough to honor the coupon anyways.   I got the lamb plate, my son got the combo meat plate, my daughter got the wrap. Everything tastes fresh. The only that tasted off was too much seasoning. I cook most of my meals and can't cook with out my spices, as I hate bland food and my kids are the same way. However, the meat at this place seemed overly seasoned. The yogurt sauce helped tone it down.   I also try to stay away from soda/pop and it was nice to see that they had refrigerated refreshments other than just soda pop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjFVBA91HKGkNzTbHRQNSw"
  },
  "bw2Hwf270I5QqmMetBdnQA": {
    "date": "12/18/2014",
    "text": "I came here today for lunch with my husband he got the beef wrap and I got number 8 it was chicken and beef cube with rice salad pita and they had this wonderful spicy green sauce that taste so good with the meats, when I got my food the portions are pretty big and I actually finish everything I would definitely come here again..",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aRE-tMyXSu3I3Tx7Ujqm2A",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Yummy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aRE-tMyXSu3I3Tx7Ujqm2A/o.jpg"
      }
    ],
    "user_id": "h_c7PjnpUnF_-LAegBv7CA"
  },
  "RInL2MapAK_KfvqyrcEpWA": {
    "date": "2/22/2016",
    "text": "Must go here kabobs always fresh to order with the best seasoning. Nice portion plates, reasonable price. One of my favorite kabobs place.  Nice employees too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a2m59UvWMur6EvWO2HIzmQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Awesome kabobs best seasoning an plates. Always fresh to order",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a2m59UvWMur6EvWO2HIzmQ/o.jpg"
      }
    ],
    "user_id": "ohlLG5t7_9X9g-vWjDJItw"
  },
  "VqhHUNaOWsJYnxHQL3dJPg": {
    "date": "1/19/2015",
    "text": "I've been going to Kabob Express for a couple of years now. If you're in the mood for delicious authentic kabobs complemented by awesome service that is reasonably priced, this is the place to eat. I would suggest the Kofta Kabob, but anything you order from their menu you won't be disappointed.   Side Note: This place serves all Halal Meat, which is an added bonus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cI596HQsfYTGOthUTtqnIw"
  },
  "25RQxiv5rkMrdcjBRqQs3g": {
    "date": "2/15/2017",
    "text": "I keep looking for a restaurant that offers better service as the employees are not Americanized and don't care if you come to their establishment or not, but in looking for a place that can compare...I've been hard pressed. The food is great. Its always fresh, well prepared. They don't have a menu that is so extensive that you can't ever decide what to order. Its very simple and very well done. Doesn't ever seem to be too busy either, its an excellent choice with good food at a reasonable price. The only other thing you could ask for is slightly friendlier service however at the same time, it definitely keeps it low key. Show up in our pajamas if you want, wear a suit and tie if you want.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KklIJ4SvLfpYj9Z4VywYQw"
  },
  "gOOjQwsrhH6WsY-ys7ReaA": {
    "date": "10/21/2017",
    "text": "Love this place! The best place to obtain 100% authentic Afghan food. Service is always awesome because they make you feel like family. Recommend this spot for any occasion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NZT2qmtYMAie74SYHwYCHw"
  },
  "xCpX3unMJKDWbMoRODWRXg": {
    "date": "7/28/2016",
    "text": "Only ate here once but I plan to come back. We ordered take out and got a combo platter- the lamb was good, nice quality cuts not full of grizzle. The chicken was tender and not at all dry. The sauces were tasty and the portions were perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2t6SrtIv2MzxH2SZZuOucQ"
  },
  "ezVSiIgFR3G9rAkHpBN9rg": {
    "date": "10/29/2014",
    "text": "Always a pleasure to come in and eat. All the negative reviews always complain about customer service but never have I had issues and the reason being for this is because I am not picky and rude to the staff. If you come here, sit down, take your time, and enjoy your food as it should be then it will definitely be worth it. All the food is made from authentic family recipes and made fresh from full kosher (halal) meat. This restaurant is a hidden gem. My favourite recommended plate is the number 8 (chicken and beef sultani). The chicken is marinated in a delicious yogurt based marinara and the food is cooked over an open flame grill. Delicious. Another recommended plate is the chicken shawarma wrap with fries and a drink.   If you love small genuine places to eat this is one. The manager and employees will remember you and they will become your second family.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Fy1ASW-F80S5pB7_jgTC5A"
  },
  "oASG7cBcYQ97ly_x3chrvA": {
    "date": "8/2/2016",
    "text": "We are visiting Vegas and the kids really wanted some halal food. Thank you yelp reviewers for pointing us in the right direction! This place did not disappoint. It was just a few minutes off the strip, excellent prices, good portions and delicious fresh food.  We did take out, but saw quite a few people dining indoors. We had the chicken tandoori kabob, chicken breast Kabob dinners and chicken shawarma sandwich. The food was ready in 10-15 minutes. They packed extra sauces (I especially liked the green sauce - it has a bit of a kick to it!), utensils and napkins. The man at the counter (Agha) greeted me warmly and had the order ready.   The food - the kids ate it so quickly, I didn't even have a chance to take a picture! The dinners came with naan, rice, a generous portion of chicken and salad. The sauces were a good addition. The chicken wrap was pretty good too.   We would love to come back and try other menu items. They have a halal certificate. Good food and great service. Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sD1R31CZZJqASSfZPBdBQA"
  },
  "f0_soCbJi_K-mUi1fJE9RA": {
    "date": "2/4/2017",
    "text": "Not the best but also not the worst. The best cucumber yogurt I've had in years, could improve on the beef kabob. Place was clean, but no air conditioning so it was warm to almost hot inside.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-LrLxQts6vNvB9dXdCPyIg"
  },
  "Mcqsd_psDvlSK1TJBzxtZw": {
    "date": "4/14/2015",
    "text": "I was pleasantly surprised but Kabob Express.  The food was tasty delicious and the service was fine.  Its not a place I went to because I expected wonderful table service. All in all it is excellent and I would definitely go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EguOaUdv_cYHG2h8KzAyrQ"
  },
  "4qeHtrV-cwVCnhKMTqN-Kw": {
    "date": "12/15/2012",
    "text": "Kabob Express is a great spot for a quick healthier lunch. I usually get the chicken wrap, the combo comes with fries and a drink. The wrap is very flavorful, a little messy but very tasty. Make sure you get the hot sauce to go with it. I've still got the kabob and other meals in my list to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IU6Q4D8e7MiErTNOaiFkKA"
  },
  "fTWzwyzGzcvwIg2cQZz7VQ": {
    "date": "12/26/2014",
    "text": "Love this place, I always stop in when I am in the neighborhood. Never had a bad meal at Kabob Express. The place is clean and the owner is pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Z0uXJn_uP3U0h-e31sTKw"
  },
  "PsmtkjcCCiv-6gqT2QtDQg": {
    "date": "7/23/2015",
    "text": "A \"no-frills\" place (e.g. plastic utensils) but good, inexpensive food, a big menu, and friendly service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8Xe4-LcfK-lH-hEX1mGNg"
  },
  "16xr3ybJhOZZhSRfSpIMtQ": {
    "date": "2/16/2009",
    "text": "Very good place to drop by for lunch. Prices are reasonable and portions are ok. I wouldn't go there for kabobs if I was starving. Cashier was very friendly and gave me a free drink for being a UNLV student (no idea if it was an official student discount they offer).  I ended up ordering the chicken kabob plate. It was good, but I was expecting something more juicy and tender. Still, I liked it. The beef kabobs are probably much better. I'm going to have to drop by again to try the gyros.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "qe1GaPBOSOXqCVIuQRYvKA"
  },
  "8IAVWOJMh0sqr5vDWaeqMQ": {
    "date": "3/21/2015",
    "text": "Wonderfully prepared food. This was my first time at Kabob Express.  I am absolutely satisfied and thankful we tried the resturant. Service was great, food was great, very clean spot anf overall JUST satisfying!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbZt6OmUklxXPbNui2VHIQ"
  },
  "dRHcNZQbyN_BXYP-KNdU6g": {
    "date": "6/20/2013",
    "text": "Ordered falafel, gyro, and fresh tzatziki. All very good and earned a solid 4 stars until the metallic tasting hummus that came with the falafel dropped this foodieview down to 3 stars. It's common foodie knowledge that hummus has citrus juice in it, but don't store it in metal containers without first lining the container with a barrier between the contents and the metal. In any case it's a good practice to use a lining in all metal containers when using them with food. The metallic taste of the hummus had me wondering how long they've been serving that batch before making a fresh one. A&E Foodieviews plans on stopping by Kabob Express again because well made falafel is far and few between, and hopefully the guys in the kitchen will have some proper hummus ready to serve.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ql0mzE-9YVs42QIKgcemuw"
  },
  "_rgCDGFSjasmcAN24_0nOQ": {
    "date": "2/18/2015",
    "text": "Excellent food!! Rice is soft and chicken shawarma wrap is an excellent tasting Persian burrito",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmKqsCC8gvJsDGP5idFt5A"
  },
  "Oyj0aLtQwWj_N1IhaybqGw": {
    "date": "5/24/2013",
    "text": "always quality food, they care about it a lot, and show you your dinner before you leave if it is to go so you see the quality and there is no mistakes etc. Friendly people too. I go here lots, always good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDvmtMpjBrPKsKapv8xznQ"
  },
  "0oKqIC_rzz9XLrJaS5_KEQ": {
    "date": "4/11/2015",
    "text": "Excellent Middle eastern food at a low cost. Staff also very friendly. Probably the most valuable place in Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fLwUxz51sPke-yDDotTPAQ"
  },
  "iTWGB0NBBGQfbaGDyuLCkg": {
    "date": "3/24/2015",
    "text": "We're visiting from out of town and this was a great meal! Delicious flavoring, fresh delicious food. The home made hummus is worth it, it all hits the spot. Very affordable, kind employees. I definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KqXceFlQqmXCXVLwosu_A"
  },
  "nJ98GJFdp7hfERs5eQjIWg": {
    "date": "6/15/2012",
    "text": "Great gyros, but the lamb and rice is to die for. Prices are reasonable and the service is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hd5h-uSjhGzSmH2GwFybXA"
  },
  "NejzQ3iLTduN9qrrXp28cw": {
    "date": "7/24/2011",
    "text": "Excellent food, amazing service! I ordered the Chicken & Beef plate, it was so good with their special green sauce..hummus is also great! highley recommended!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-EPd9FW8Qil1ILqPwenonQ"
  },
  "BAphCBAOFGP8CVltFAOPGw": {
    "date": "9/22/2011",
    "text": "This place is my new boom. Their kabobs are seasoned and grilled to perfection, tantalizing the taste buds with every bite. The great portion sizes are suitable for two, which makes sharing a plate ideal. I pass this restaurant frequently but am glad I actually stopped this time",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-QvZmW58raEV2qTVFJb2bA"
  },
  "vVcVA76eVS0uohEa5G5GFA": {
    "date": "7/16/2011",
    "text": "I really enjoy this place. The chicken and steak are well seasoned. The rice is full of flavor. Great portion sizes.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DB7CcWXIyJ16F2wmK0r9hw"
  },
  "ztpPyyAGhz76oUwz6Drztw": {
    "date": "2/7/2015",
    "text": "Don't try tandoori chicken it was way too spicy and I when asked the person on counter (not owner) his response was that's how they make it which is a lie.  I have eaten tandoori there before and it wasn't spicy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXHSlBj23aBVftZ0dWu2RQ"
  },
  "KMtrtb3zs01Ygx6we_0OnA": {
    "date": "3/16/2012",
    "text": "It was just amazing.. especially for veggie guys like me who dont eat meat. fresh and different ! try the eggplant dish - too good. Nice customer service and was friendly too !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFB415ApiD7LmbUWAIDDdQ"
  },
  "RSep8QJKW8ER11MiI1OI7Q": {
    "date": "9/15/2013",
    "text": "This place needs to update its look but the beef kabobs are mouth-watering and that's all that matters! The wait time is long but the food is always fresh here and the portions are big.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1mqSuP3IaT_nmR_GuJ92hg"
  },
  "UTX9Og4V8toKo_emYB9YDQ": {
    "date": "12/23/2014",
    "text": "I've been coming here for years and the quality and service of Kabob express has never faltered.  Khalil is a gracious owner who knows how to run a business, treat his customers well and ensures that the food is incredible.  The servings are always generous and you can pick how spicy you want your food.  I always ask to get my food spicy and topped with grilled onions.  You can't go wrong with the chicken tandoor or the fish kabobs.  Both are cooked and seasoned to perfection.  Afghan rice is always perfect with the various meats.  I could eat the rice by itself.  If you're looking for real-deal Kabob then this is the place.  Skip the competition.  None of them even come close.  Furthermore, you'll always be treated like royalty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y2ZFaYmS3-lwmDP85dxmhw"
  },
  "mcNhhdecth9bnVVgh_06VQ": {
    "date": "12/24/2011",
    "text": "As an Iranian, I say that the lamb, beef and chicken Kabobs are very good. But Koobideh (Kiftah) kabob is just beef which is not the Iranian style. They use their special spice in kabobs which I liked, but it depends on your taste. It is a very clean place with very respectful owner. The sandwiches are good, but not so special. The food is Halal. I will come back for the kabobs on my next Vegas trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VPnVPlSTP7UefXNMyVlw2A"
  },
  "0i0N2A9l9Pxb_UO5z7DnjQ": {
    "date": "11/10/2015",
    "text": "When a place knows your name and your 2 year old son's name, recognizes your order on the phone, and puts a big smile on the toddler's face as you pull into the parking lot ... you know it's a keeper!  Okay, the kafta kabob plate here is my half-Palestinian half-Israeli son's go to meal. If he's screaming, whining, or even being super cute and we're east of Decatur, we're going to Kabob Express.  I sometimes order the Tandoori chicken, which is a hit or miss on being cooked properly, but the flavor is there and either way the rice is delicious.   The shawarma here is not shawarma, you should know that ahead of time. The hummus is super Americanized and the pita is always dry/hard.   My issue here comes with the guy who is apparently the weekday cook and even the owner. The weekday cook is rude and whistles while making the food - a very bad omen in the eastern end of the world. Regardless, it's plain old annoying in such a small place and when a customer, especially a regular, brings it up, the owner should do something about it.   This is going to potentially sound racist here, but it might be smarter to hire people from the region of the cuisine you're making at your eatery rather than people you try to train who don't know what the flavors are supposed to be.   Well, the 'front of house' staff is amazing and Kabob Express always makes my toddler happy, so, hey, it's an overall winner in our book.  Tip: Call 15 minutes before you get there so your order is ready to go.   Bonus: Halal certified.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aPxgfSimpZ8TPK0EF_M7Cw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Tandoori Chicken Plate to go.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aPxgfSimpZ8TPK0EF_M7Cw/o.jpg"
      }
    ],
    "user_id": "CbLusGsbKTaiJrKygkRAtg"
  },
  "NTCr1vXKFwLFM_WAodp54A": {
    "date": "9/22/2016",
    "text": "This place was a quick stop after a workout  The kabob plate has all the protein and carbs you need ! The chicken is well marinated  The rice is good quality  The salad has a tasty dressing  The hummus is excellent  All in all a good quick bite and the price is very reasonable  Will be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7uCqJxakEFqWGPHnvhPwnA"
  },
  "GJWPRsfU1eOdZmjVWR1gIQ": {
    "date": "4/10/2017",
    "text": "Went here based on the reviews and wasn't disappointed   Fresh,  very flavorful food. Picked up for lunch for my colleague and I and we both really enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pfrAdqrgW6uJO2qkirNItw"
  },
  "tmum_LuMmdYR3h1gYJkQxA": {
    "date": "1/8/2017",
    "text": "Great Afghan food! Very tasty and reasonably priced. Reminded of of Pashtun cuisine back home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D5mrJLVWy2N_P6FlJoD6CA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Mixed combo plate served with rice and salad!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D5mrJLVWy2N_P6FlJoD6CA/o.jpg"
      }
    ],
    "user_id": "1IQuC5NxWEHZjMt91XI03w"
  },
  "sNo3-ANlf1HT7menfMnvzQ": {
    "date": "12/16/2017",
    "text": "When it comes to Kabobs, I am really picky. This place knocked it out of the park. The staff greeted me when I walked and helped me navigate their menu. He made a couple great suggestions for me to which I ordered a little of everything. The food was freshly prepared and only took about 10-15 minutes. I will definitely be back. Thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-n2_-g_OOYh5HWVeGi-gjw"
  },
  "Jh99lIxdiGA9aHd2N-uNpg": {
    "date": "1/7/2017",
    "text": "This place is always busy but good food places are always busy the kabobs can't be beat best gyros in town add the green chutney sauce on it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tpp5r_ApSogBZZq6JbxdzQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tpp5r_ApSogBZZq6JbxdzQ/o.jpg"
      },
      {
        "img_id": "YqCvl1ERp4C4YjASyHdRyg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YqCvl1ERp4C4YjASyHdRyg/o.jpg"
      }
    ],
    "user_id": "3VhgucLK8pxeJeGdKX0qLA"
  },
  "esAIGDbj-m5uo6kDKIiTjg": {
    "date": "9/2/2016",
    "text": "I love their chicken kabobs.  They seem very fresh and tasty.  The price is reasonable too.  I've always gotten takeout.    The only reason I don't give them 5 stars is that communication on the phone is challenging with this company.   However my order has always been correct, and the cashier is pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "lf00pYEXIGjpfGtoOr5yOA"
  },
  "lXaBtiSSSIDtsGTCdDHFfQ": {
    "date": "10/7/2017",
    "text": "Amazing x100 on customer service. I placed the order over the phone. Went to pick up and I was just pleased with everything. He read out my order and open each container to make sure everything was there, labeled the containers with everyone's name. Even asked to help me carry out my food. I ordered the fish kabob with a side of fries. Food was tasty I was a little sad the order came with pita bread but no hummus. (Hummus is a side dish) I also order grilled vegetables which was only onions, one whole tomato and  jalapeno I expected something different. Over all I would recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_tKckzzITu2XYyDfxqqqpg"
  },
  "E7nsRgdkHbu9WPmsri-enw": {
    "date": "8/19/2016",
    "text": "Best Persian food I've had in Las Vegas. The Kabobs were cooked perfectly and the meat tasted so fresh and like they got it from a very good butcher. Their basmati rice had so much flavor and it was perfect with the grilled meats. I ordered their King Sultani and it was definitely worth the price. Not only was their food great, but the price was awesome too. Wish I knew about this place when I was still going to UNLV. Definitely will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "R9r_affsu_pn-gbApOXX3A",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. King Sultani for my post-workout meal!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R9r_affsu_pn-gbApOXX3A/o.jpg"
      }
    ],
    "user_id": "W7mlkL3Onw_ZjJIOjrphDA"
  },
  "n_D1NdDZcsw-3N-DDYqabQ": {
    "date": "7/8/2018",
    "text": "Best kabob spot in town! Tom is really polite and helpful. Will definitely be coming back during future visits!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5lFQeulUXwESslcRpmPLzw"
  },
  "VO-ZK2wlSevE35tDcLIvmw": {
    "date": "7/28/2018",
    "text": "Order the king sultani which is a combo of chicken and steak.  Very healthy meat with zero fat. Love this place.  They even remember my name and order when I come in.  When's the last time that happened for you? Great customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3p-vF_A88i6bOeafESw3-w"
  },
  "dRdFh_iRqW6Ll31nOGhfMw": {
    "date": "8/27/2016",
    "text": "Service was friendly I checked in for the free drink which was awesome. I ordered the kind sultani. The portions were very good for the price and they gave you a ton of rice. The food tasted fresh. I referred my friend to check it out and he loved it too. I will be back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "KGazZYHoWmFKZss3Q0KY7w",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. King sultani",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KGazZYHoWmFKZss3Q0KY7w/o.jpg"
      }
    ],
    "user_id": "0QfV3xDQ87R8mBqa1W7xlQ"
  },
  "ONU4ObbF0d8To8WKA71nCw": {
    "date": "6/30/2015",
    "text": "Truly a hidden gem located closer to the east side area!   Today was my first time trying kabob express and it definitely won't be my last. I'm already planning when I'm gonna make my way back out to this place.   I had the tilipia kabob. It comes with rice, pico de gallo, pita bread, and salad. The Greek yogurt dressing was delicious and they have a house sauce that is green and a little spicy.   Not to mention the prices are amazing, 8.95 for the fish kabob and when you check in you get one free soft drink!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B7ACYkkBbxxWtfy-wkv8YQ",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Fish kabob",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B7ACYkkBbxxWtfy-wkv8YQ/o.jpg"
      }
    ],
    "user_id": "eZNm34nCZkQY6jEaEmQMEA"
  },
  "WFww21pxKNHsC-bHSxpCmA": {
    "date": "5/10/2017",
    "text": "Clean place. Fast service. Portions are huge. My favorite hummus in the city, not too much lemon, drizzled with oil & flavored perfectly. King sultan I is delicious & a chance to try different style of meats.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uXejCc1Z_bhQjDE5FzEdww",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Hummus. My favorite in the city. Spiced and oiled and not too lemony.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uXejCc1Z_bhQjDE5FzEdww/o.jpg"
      }
    ],
    "user_id": "ejPlmOEPDsl0wHTqGau6Mw"
  },
  "q-S7i5jRqhn8jTZEbWcRRg": {
    "date": "7/17/2018",
    "text": "Best afghani food in Las Vegas. Waiters are nice everyone greets you nicely. If the mess up they apologize nice and will give you something you got free.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TAznW7bSPqhzIhptCpSL3g"
  },
  "KEx4xbTMCG_f5yfRc6bfFA": {
    "date": "7/11/2018",
    "text": "They have pretty good food and ambience here, worth a trip! (I got a #6 it was delicious!! Also someone here has my same so that was awesome.  You must stop by and eat if you like Kabob!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYUAQQRddscXwEAB6kohSA"
  },
  "OWlW1FohppDroevNFWeIiQ": {
    "date": "12/12/2017",
    "text": "This is probably the best afghan restaurant in las vegas. The food and the service was great. I recommend this place if your looking for best kabob, and do try the yogurt drink.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LEe2B-_4Mk--oE3l4TsIog"
  },
  "jOLaXEbYSsxyTvP5gQZMuw": {
    "date": "8/20/2017",
    "text": "Few years ago I would have given this restaurant 5 stars. But it seems like as their prices go up, the cut of their meats gets smaller. Though I still think they have the best kabob in town with regards to flavor but I just don't if it's worth the trip to go to that side of town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5T2YCUTqYdYq0lE_Dk00DA"
  },
  "0zZd7FC3-k_bFYOmlnYJKA": {
    "date": "4/25/2015",
    "text": "Today was my first visit here and I was not disappointed. I had the gyro sandwich which was made up of beef and lamb. There were red onions in there and other stuff that I couldn't really see because it was tightly wrapped in the bread. It was very delicious and I thoroughly enjoyed my lunch.  I'll be back to try other items on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ArRL0POUjPPdm4Kz8rtduw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. My gyro",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ArRL0POUjPPdm4Kz8rtduw/o.jpg"
      }
    ],
    "user_id": "jIH2fzQfXY7RW3C3W1Z1iQ"
  },
  "eGG6tULCMjIN2-GK90E7AQ": {
    "date": "12/29/2017",
    "text": "I am giving 5 star for the food, 3 star for the service. The man took the order was not energetic and the other guy was not very friendly. We had to ask for extra plates twice and got a very shy response. Now, lets come to the food. We tried the plate with chicken, Shish and Ground meat kabob and they were really good. The rice was less in quantity but tasted good. Fries are kind of average but the mint chilli chatney was excellent witth the fries. If we go again at Vegas, we will try the place agai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYiQ7P1c2llpIvmHvHmLow"
  },
  "5BybiESScnd1de0szldYUQ": {
    "date": "3/12/2018",
    "text": "I smelled this place while I was actually driving to another fast food restaurant. It was an amazing smell that superseded the other unpleasant smells in the area. So I went inside and ordered the #8 which is a chicken and beef kabob. Comes with saffron rice, one 6\" pita circle, lettuce and a side of what looked like greek pico de gallo (I didn't eat it). The meats were flavored so well! The rice was really good too. The staff was friendly and I ordered to go. It took about 15 minutes to get my food and there wasn't anyone else in there but I wasn't in a huge rush. Good food takes time to cook so I didn't mind. But the name suggests (to me) that you should be in and out of there in 5, no later than 10 minutes. I'll be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EkAAxp_VeF1YOXqow0F_Rg"
  },
  "v2OiVWBJlurh3_xKZhfrtg": {
    "date": "5/4/2018",
    "text": "Wow. Just wow. Amazing flavor and great quality food. Awesome prices also. Friendly people, great service. I live in CA, I wish I lived closer to come here more often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONJix2tuc2CLCPO0F1Z9-g"
  },
  "P1EOAfk2vc4SUuYG9XlJEg": {
    "date": "4/10/2018",
    "text": "Delish!! Fresh and tasty. I highly recommend this place. Courteous and friendly staff. Service was on point. This place is clean and smells amazing when you walk in. My new go to Persian spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1260f7xjSSujYqT2ImiHg"
  },
  "RLdeLCLYsLyk33Ew8zV_WQ": {
    "date": "3/14/2018",
    "text": "From the time I placed my order to the time I finished my meal it had hardly been 25 minutes. Despite some woman complaining her food took too long, I was very satisfied! It's been 6 years since I've had shawarma and I had a regular place before moving to Vegas, so I was nervous to try a new place. I'm so glad I stopped into this place! If I wasn't so full I'd be ordering another! I will definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8fpiTkK4MO5jJIXHFV4t5Q"
  },
  "4KIWwMhSFxkSns8IcTMrFA": {
    "date": "8/9/2014",
    "text": "This review is for food alone since the boyfriend is the one who checked in and picked up the food .   Beef Gyro - Standard pita stuffed with beef onion and tomato. Maybe they dont put lettuce so it wouldn't get soggy wrapped in the warm pita and hot beef. For $5 I would eat it again they definitely didn't skimp on the meat. Smother that bad boy in some of their yogurt sauce and it's <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>.   Kofta Plate - ground beef seasoned yummily ( I just made that word up ! ) and made into almost sausage. Then it's grilled and served with rice , a salsa which is almost like pico de Gallo except it has cucumber and parsley instead of cilantro. Also comes with bread and Tzatziki sauce.   Been meaning to try and take it off my bookmarks. So great success !",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5XA105imP2AYoml14i4xLA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Beef Gyro !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5XA105imP2AYoml14i4xLA/o.jpg"
      },
      {
        "img_id": "6Q5IhmDq055wxCe0XQ0ymA",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Kafta Plate !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6Q5IhmDq055wxCe0XQ0ymA/o.jpg"
      }
    ],
    "user_id": "r0j4IpUbcdC1-HfoMYae4w"
  },
  "7jcEXNOSpOpzrw7_lLgP9A": {
    "date": "4/15/2018",
    "text": "Went there yesterday after 3 years and food was still as I remember it! Awesome food Great service  Had the tandoori kabob platter and it was so good Hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tf3F8eGi_W2OqEWdLZH3tg"
  },
  "8uS5YgJBRPesvN_HGszecA": {
    "date": "11/4/2017",
    "text": "Fresh and great food. Gyro and chicken sharwama are really .... Will come here again to try some other stuff",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ANfHQvDW7iOU95KOJgiXnw",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. All done! Delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ANfHQvDW7iOU95KOJgiXnw/o.jpg"
      }
    ],
    "user_id": "d07gr3rpajilvli3xcTEog"
  },
  "Rz0Ud3fVfYKMer-uBD8ocw": {
    "date": "1/22/2018",
    "text": "I love the chicken tandory kabob  I order delivery from this place often and it's always great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGFHEaomhByJxhWq26mXOA"
  },
  "5oUtLHFKxvEUbva2IoX5Zg": {
    "date": "6/23/2016",
    "text": "Absolutely delicious.  The salmon was prepared perfectly. The rice and vegetables were tasty. The colorful plate looked beautiful. We will definitely be back.   My BF has been wanting me to go for awhile and now I know why :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xQvLncTzhIVDHbmaL4DyBg",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xQvLncTzhIVDHbmaL4DyBg/o.jpg"
      }
    ],
    "user_id": "4DY1zLS6qBpBM6EmLOdjwA"
  },
  "JPHrBX3nEWDL3A6p8gdf1Q": {
    "date": "1/13/2018",
    "text": "Always a convenient spot to stop for a good kebab. The place screams fast food but the kabobs are all prepared daily fresh on site and cooked to perfection over coals at the time you place the order. Great place to take out a good kabob and rice dish...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6YmRpoIuiq8I19Q8dHKTHw"
  },
  "X9tNt4Bevwf5fDqy7I7mvw": {
    "date": "1/27/2017",
    "text": "I love this place. Clean place and excellent customer service. The food was amazing, me and my wife had lamb and chicken. It was jucy And tender. This is my first time eating lamb. The price is affordable and the portions are very big. My recommendation to anybody.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "F8IyQnlucv_A_RRBUajUXQ"
  },
  "sWrh79XFQnWJ42Dlk-hSjA": {
    "date": "10/11/2017",
    "text": "Best kabob in town, miss going to this place. Basmati rice great with sultani kambo",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bnrV-_9okpkzTqrT_p3b8Q"
  },
  "iC1zthBrM8qybCOyAEwnEA": {
    "date": "10/6/2018",
    "text": "Had the chicken breast kabob with hummus. The food was definitely overpriced for quality & quantity. The hummus tasted about as good as store bought. Actually, store bought might be better. The \"salad\"-fattoush- was under seasoned and did not taste like \"Mediterranean\" style. The only reason I'd give them one star instead of zero is because the chicken was flavorful, well seasoned; however it was still dry. Would NOT recommend this place plenty of other \"Mediterranean\"-like places to choose from. Save your money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vP_xu1Ex7T8CjzokXz6GQA"
  },
  "9vz0Kj-AnhpGI0wKKXDBaA": {
    "date": "11/28/2016",
    "text": "This is one of those quick serve, dine in, or take out places, but it doesn't quite feel like one of  THOSE places.   It's very clean and inviting on the inside. The men who run the cash register/cook here are friendly and work fast.   The food is high quality and fresh. I ordered the combination plate with chicken and steak kabobs served on top of a heaping mound of rice. The meat was tender, moist, and hot off the grill. A small salad and diced cucumber/tomato is served on the side along with a thin, spicy,  green sauce which you can tame with their cooling tzatziki.   I recommend ordering a side of the hummus. It's not grainy, stale, or bland like the hummus at other places.  It's blended smooth,  served with a sprinkle of paprika and drizzled with oil. You can actually taste fresh lemon and garbanzos.   Light eaters will be able to split their plates into two portions.  Others won't leave hungry either. I will be returning to eat here soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "INHFOcLzPBFAEO9QHbQ6Pw"
  },
  "PvjT0LEOUIESBZM4M4jlBg": {
    "date": "10/5/2018",
    "text": "The price of the foods that they advertised with yelp is more when you walk in to the restaurant, and they don't honor that. So I just walked out with out dining.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZ-_52lbfgFUiDqCar_CLg"
  },
  "KyMywUW2ZWmycHciADtVfA": {
    "date": "12/28/2017",
    "text": "Great freshly made and grilled kabobs! The server was super friendly and so patient when we couldn't decide what to order. I've had a lot of kabobs and this one is a definite keeper! My entire family really enjoyed the meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFO-OSFhbTqUO342jDyo4w"
  },
  "5mVP-vf5DhFvczeJryOsrw": {
    "date": "4/27/2016",
    "text": "Pretty big let down - what are you thinking Yelp people?! Chicken was super chewy and had a sour taste. The beef was chewy but flavorful. Yogurt and cucumber dip was inedible. Also, there's Spanish soccer games blaring while radio with tons of static is playing. Real unpleasant. Skip this one, 4.5 stars is hard to understand.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QpG3mjbxDteoqFC6m20WMw"
  },
  "AswbWnwbLmzg1zWNxKmVFg": {
    "date": "11/27/2016",
    "text": "2nd Best kabobs and gyro I have found in Vegas and I have been on the prowl because I love Mediterranean food. I got the chicken and beef kabob plate and a gyro. The kabobs were both so tender and delicious and the gyro although it looked plain upon first seeing it, did not disappoint! Plenty of protein which is a big thing for me. I hate when they skimp on the meat and I eat mostly carbs and filler veggies. But they did not skimp on the meat.  The employees were not the most friendly or welcoming upon entering the establishment, and even told us to hurry when giving us our food because they were closing which bothered me a little because that has never happened to me before and they had over 30 minutes before closing but the food was so delicious and priced extremely fairly so they still get that 5 star rating. Definitely check this place out if you love kabobs or gyros just maybe not on a Sunday night so the staff is a bit more cheery.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "siWY8a46R5ZpqVCo4C22Ww",
        "caption": "Photo of Kabob Express - Las Vegas, NV, United States. Yum",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/siWY8a46R5ZpqVCo4C22Ww/o.jpg"
      }
    ],
    "user_id": "u79cavRKIQkeSvwSEKb26w"
  },
  "rSseeNZRhFpRhzaOK9O42A": {
    "date": "12/30/2017",
    "text": "I found this place via yelp. Place was clean and deserted when i got there. Except for myself the person tending the cash register and cook there was nary a soul in the place. Wasnt sure what to expect but the reviewed looked really good and so did the previous reviews of their food. I had the sultani platter, a side of fish and hummus. Food was great and cooked just right. I really like the fact that the side salad had a bit of kick to it with the chopped peppers.    Only thing that turned me off was the hummus, it was slightly on the grainy side & had a similar texture to chunky peanut butter. I prefer mine to be smooth in consistency. But i was quite satisfied overall with the meal & will re-visit again the next time I am back in LV.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ho05kEp49FX8YXWO6G5_9A"
  },
  "U7PYfHEwiHKasJAqcbGhCw": {
    "date": "3/23/2018",
    "text": "The falafel wasn't the greatest. The gyro was on point but I really had a craving for falafel the service was nice and the place was clean. But the food while not bad was not great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2NOXd650VEA7kPx5jLrmw"
  },
  "JpmoQlOyjTgElu-Hpciz0Q": {
    "date": "1/8/2014",
    "text": "The chicken breast kabob and chicken beef soltani were great! Best kabob I had in Vegas so far",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4Y6fygbD5pdA4JD8FdLBA"
  },
  "-IzKTXtb9CSYfuTHGRQrdA": {
    "date": "6/29/2014",
    "text": "Easy to find, SE corner of Eastern & Tropicana. Small restaurant promotes friendly service. Good food at a reasonable price. Beef and chicken Sultani platter - $11. Large portions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E5wyQGK7TuSI-2IKcplgBA"
  },
  "FeyodXylZzhll2sbFwifpA": {
    "date": "9/25/2013",
    "text": "Great kabobs! They have great afghani food here. Its between a take out place and a formal restaurant. The food quality is definitely restaurant but the atmosphere more of take out. They do not have authentic Kabuli Palow or other more traditional dishes as entrees but the kabobs r amazing. Be sure to ask for white sauce. We came here twice on our trip to las vegas. Highly recommend if your in the mood for some amazing chicken shish beef kabobs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPv176CEXCl7Ggls98FebA"
  },
  "FEWfoAIQ5DnUeqDYkzcTcA": {
    "date": "6/12/2014",
    "text": "The food was great and also the service. We ordered almost every type of kebab on their menu. The meats were tender and tasty. Chicken was well cooked and moist. I was very happy with their rice as it had a subtle taste of a spice which is popular in Afghanistan. The manager was also very nice and friendly. Just beware they don't have a restroom, just a faucet to wash your hands.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pIG6qyGNhW86r4FC-fBxsA"
  },
  "cwYArxQhAqCCaIC5uu0UfQ": {
    "date": "10/18/2013",
    "text": "Not good. Beef kabob was gross and gyros was blah. Fries were cr@p. Stay clear of the combo. Waste of time and money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dmk6ITEyMmAoZWpOsQapGQ"
  },
  "h3eyW5m_6OswsrEL6-MZYw": {
    "date": "3/11/2014",
    "text": "Good food, don't pay attention to the building. We had a chicken and beef kabob dinner that was great. Lots of food. The hummus had great flavor but was thinner than what I'm used to. Also had wonderful, fresh bread!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jcgqIJnWh-uLiv37NjqZHA"
  },
  "7xHKiJpSZWsDgRopcUCJjg": {
    "date": "8/25/2014",
    "text": "Stopped in for lunch today and was happy to be greeted by friendly staff. The recommendations were delicious and I will be sure to stop in for a quick lunch the next time I'm in the area. Had both the chicken and beef kabobs, both were great. Five stars for great food and great value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZDYlLRF9Yu40wbg3LDrsow"
  },
  "eeP4cyaJfPWXegQ2GPjLhQ": {
    "date": "12/20/2015",
    "text": "Food was excellent. Service was a little subpar. Person taking orders seemed disinterested and not willing to help us.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHtugqJn1uWg9zknh7c9uQ"
  },
  "ttX7QXXzbiPKBGnhT6FhTA": {
    "date": "12/14/2012",
    "text": "Simply the best, can't lose with anything on this menu. But my personal fav is the chicken tandory kabob 2nd the kofta.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IvBFoLH1HOpDcZBY-NpJg"
  },
  "rCZkNbTdFQTE8GQU-L6_fw": {
    "date": "8/7/2015",
    "text": "Great fast persian / afghani food.  The dishes are smaller than a typical persian place so order extra.  You won't be disappointed.  Great value for the price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_l_0gWScRSk5tyCgYaToA"
  },
  "IzGzUvElgYQMxdC5Hgnxlg": {
    "date": "4/18/2013",
    "text": "The lamb kabob is great this place is always a good pick for the lunch crowd highly recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3gB92ZdM-35rV6ZJoTkEQ"
  },
  "pxHYZTDwS1mRmlSEe3JgqA": {
    "date": "12/10/2015",
    "text": "We have been frequenting Kabob Express for several years.  We found it when we were visiting and looking at property.  Our Best find in Las Vegas!!!  The food is always consistent and we visit here at least twice a month when returning home from the Airport.  The chicken kabob is always moist.  The Kafta Kabob is the best we have had.  The staff are always pleasant.  And in comparison to similar restaurants you can not beat the price.  If this was closer to our home, we would frequent much more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDeEVoEObXIyZ7jMMEJH4w"
  },
  "LlyHUcEuV8aN_x9W_IK64w": {
    "date": "3/2/2013",
    "text": "Their chicken salad is very delicious.  What makes this is the yummy chicken skewer pieces, with great spices and it must be curry to make them a little yellow.  The dressings very good - the owner (I think) gave me three.  I was on my lunch hour and their were quick enough.  They have other items I would like to try - I want to come back.  Check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqbmLC9CgThBKGc-aNaeqA"
  },
  "ovJwxs6n4Q3lOMS_gZFWKw": {
    "date": "1/5/2013",
    "text": "Love there chicken kabob. Rice quality is very good. Delicious healthy fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rdZESSPeqypxSk1tQuttIQ"
  },
  "iuxuty_DmMAx37BH3kicJA": {
    "date": "9/16/2015",
    "text": "Love the food but I'm gonna have to stop going there since they switched to plastic cutlery and styrofoam plates. Styrofoam is BAD for the environment and I don't want my food served on it. Will have to find a different place to eat until they go back to a more sustainable way of serving dine-in guests.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "351JBO0L-BUsRNwaHQ5Ftw"
  },
  "8UcPrbSrSI0ijv8bukP-nw": {
    "date": "6/20/2013",
    "text": "Quick, not too pricey, and excellent quality.  Their rice is unbelivably good.  Salads too are off the hook!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z9eJ4Q9g2RIfF5o1JyiH-A"
  },
  "XCscoacnxLF_VrK1y0zt3w": {
    "date": "5/23/2015",
    "text": "Delicious! Ordered the Chicken Tandoori and it was amazing! Good customer service. Clean sitting area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pashe1ceOMZFpWX5CoLhQ"
  },
  "4e4uDQVfrVTbBWdtiec3dg": {
    "date": "9/21/2011",
    "text": "Every time I came to Vegas, I have to stop to Kabob Express at least 3 times during my visit. There food is  fresh, gooooooooooooooooood, Deliciousssssssssssssss and verrrrrrrrrrrrrrrry affordabbbbbbbbble. If you're looking for exotic, delicious, tasty, appetizing, mouth watering and affordable food then you need stop to KABOB EXPRESS and you would not regret.  Bon Appetit :)))  Phone :702.433.7499 Website <a href=\"/redir?url=http%3A%2F%2FKabobExpresslv.com&s=0f5b400830290d7e473eba1d8c0f994914c83ad2e906bcffdf7be221a1178b65\" target=\"_blank\" rel=\"nofollow\">KabobExpresslv.com</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fufp3lb_tHhD7hwd6KyrDg"
  },
  "KD_N5T7uzrQiHtm4B_8jqw": {
    "date": "9/24/2012",
    "text": "Last few times I have gone here, the food just has not been very good.  Last time I noticed the \"B\" from the health department on the wall.  No more Kabob Express for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8M4TrpX2jPcz4_Wd7S4qcQ"
  },
  "wd8OsSpfQhcnipHdVWz9pw": {
    "date": "12/27/2011",
    "text": "The food is delicious, and the owner (who is usually working the register) is polite and courteous.  Kabob Express was the first place I've ever tried kabobs (or Afghani food in general), and I've been addicted ever since.    I've tried the chicken breast plate and beef plate, along with the one that comes with both.  Both were delicious, but I think I prefer the chicken.  Been to the place a couple times already, and it never ceases to disappoint.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "4hvdAWpu0CW4l7xo3I80cA"
  }
}