{
  "D3Ed2wt1E1SHQIBAklIcfQ": {
    "date": "2/26/2017",
    "text": "The grilled fish tacos are really good! I have them add avocado and  I always ask for lime wedges. The best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tl38LR3s2YCCB6r5nwvkhA"
  },
  "TuThGxdy_3ETMRI0vnHMaA": {
    "date": "9/25/2017",
    "text": "Great local bar! Great service, especially if you get Rhea. She is amazing and sweet and just a great server. The drinks were great and the food was delicious. Loved the filet mignon sliders. They are all over the city but this one is my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b2hAEFUVGDXFv5KsbMYrVg"
  },
  "5wwRtwk9Zl9oLrT1MRca-g": {
    "date": "7/28/2017",
    "text": "From the moment i walked into this bar, ive had very exceptional service. There very sufficient and never make me wait longer then 4 mins for anything. The bartenders and servers are awesome! If your coming in for a bit to eat or to grab a drink. Anytime of the day is perfect my favorites to come see is Nicole & Chelsea they works in morning and at night John, Erin & Elliot are great too. Any of the servers are great too!! But if you are looking for great service, and good laughs come see these wonderful people at Distill.. (:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIRsIoCptJANi2lakFOg2g"
  },
  "yzSc7xYc6yjyjEUYsZywww": {
    "date": "9/23/2016",
    "text": "Everything about this establishment was excellent the food was great , the beverages were reasonably priced and the staff had an awesome energy and willing to have a good conversation at the same time even though they had regulars across from me they still spend time to conversate with me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rm2McDqXQr2JJOtMIf15PA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rm2McDqXQr2JJOtMIf15PA/o.jpg"
      },
      {
        "img_id": "voHn2ty7GE4lHqtsvZ_peg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/voHn2ty7GE4lHqtsvZ_peg/o.jpg"
      }
    ],
    "user_id": "EMZljoR9fc3kxtu5f3Lz5Q"
  },
  "zFrTor3Ob3cYZg0l7dY88g": {
    "date": "9/23/2017",
    "text": "What can I say ?! WOW is this a great place ! First off my first time and I'm not usually on yelp but I have to spread the word on this place. Go in and ask for Nicole or Rachel they were so cute together what an awesome bar staff :) the food is fantastic huge tvs and a great layout of the bar, by far best time of the year for football, good drinks, great food and great service. Don't skip this place for your weekend spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BtZmcND2nMCFb-zWxIHDNw"
  },
  "prN48XadoXCUKAB_C47OTw": {
    "date": "9/23/2017",
    "text": "Randomly stopped in here for a midday drink. Breakfast served all day! Steak and eggs is a great choice. Friendly servers that aren't too bad to look at either (winky face). Cheap drinks. All around a good time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NREuz-mnHdg-ELUK2HD9Bg"
  },
  "VwRJcwkCUJN5CcL2iyiHDA": {
    "date": "9/20/2017",
    "text": "Havent been in to my favorite bar in a while and I missed it.  Elliott and Nicole we're awesome by far my favorites this place kills it try the IPA shrimp it's fantastic all around ghr food and service is beyond great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWtypIemwvKMxbVxhwR5nQ"
  },
  "LssYR5YVP10QjaqZcjjA6Q": {
    "date": "1/11/2017",
    "text": "Went here on Monday night football. It wasn't that busy, but the volume was so loud, you couldn't speak to the person next to you. We ordered several items off the happy hour menu. Without listing everything, nothing on the menu was good. I'm not even going back to give it a second chance.....",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DkCIL93oNibJqtC1vETucA"
  },
  "RG2uzaO9Qi6zGbSlq0hhUg": {
    "date": "7/21/2017",
    "text": "I just love this place. The food is always amazing (especially the Lemon Pesto Chicken) and the service is great. Especially Erin, she remembered us and our drinks which makes it even nicer to hang out here. The free desert we earned with our Red loyalty card was the icing on the cake tonight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tuCE0__ZY_Yc3UIVe4JYlg"
  },
  "b3W7qCuawcVaY2k59Pg3Ag": {
    "date": "9/9/2017",
    "text": "This is such a great spot best place for football. Stopped in with some friends to watch the college games and the breakfast was fantastic. I'm a long time distill regular so I'm stoked for this season. Nicole was my bartender and she's awesome. Best bar in the neighborhood with the best bar menu in the city. Go in and ask for Nicole you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Y64oGB-680GbzGyZeM2ew"
  },
  "pAyM2B83ABRRH8VH7V-EjQ": {
    "date": "9/9/2014",
    "text": "I love coming here. Good food and just a great place to kick it with your friends.   Also the bartenders and wait staff are really cool. Next time I'm coming here with a cigar.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mzdPYZkrmVJ3_U0m2_OeDg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Meatlovers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mzdPYZkrmVJ3_U0m2_OeDg/o.jpg"
      }
    ],
    "user_id": "P6ugbSC-bK4emE79rVrUbA"
  },
  "O4R5Gdh6oOTMintrwuQovw": {
    "date": "7/10/2017",
    "text": "It's a bit off the beaten path but can't be missed when taking Decatur south towards southern highlands. I was greeted by the adorable daytime bartender Nicole, who was super bubbly and attentive and got straight to pouring my mimosa. The menu looks delicious but I can't lie, I'm a simple bacon and eggs girl, and by simple I mean PERFECT bacon, crispy hash browns, and eggs- country scrambled. My food came out perfectly, the service was friendly and amazing and I even hit a jackpot! I will definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0l9_u82OXVKeaEpjIqE_fw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0l9_u82OXVKeaEpjIqE_fw/o.jpg"
      }
    ],
    "user_id": "qdvxXm-uPImhmhen_AZMrw"
  },
  "IEBWQe7gHEO3tzxkFf62dQ": {
    "date": "7/9/2017",
    "text": "an atmosphere with such whimsical floating in the air. the staff is just as friendly and generous as the machines. Nicolas rock it with a full bar she never missed a beat with my drinks. this bar rock screw the log those guys need to take a lesson from these bartenders.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJ0p6_jj8P-Y9XLa75W2wg"
  },
  "KvsBy8QlltKekc8eUE9QRA": {
    "date": "9/4/2017",
    "text": "Maybe it's a good bar at any other time than Saturday night at 1155. Went there with some friends. Took a long time to get first beers. Ordered food. Ordered Nachos 5 sec after my friend did. They came out 15 min apart. Then my Nachos were noticeably smaller even after friends have been eating the other Nachos. No portion control or consistency. I ordered a beer with my Nachos but it seemed like the bartender didn't want to pour it, cuz he took forever to do so. The bartender acted like he didn't want to serve us and focus on his friends at the end of the bar. Idk but for the first time here wasn't that great. It wasn't even that busy. I was surprised for a Saturday night. All in all not worth it unless you live next door to one and can walk.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7a310ZBwdxxKreeqYXGqg"
  },
  "a2VwxINlBzu9t3dkvcNFQQ": {
    "date": "1/10/2016",
    "text": "Pretty solid place for bar food.. They stand out in drinks and atmosphere. As most local spots go, they are way above average With a solid menu, great drinks, and a even better wait staff. Pretty reasonably priced items with great game time menu. The biggest standout is friendly atmosphere and awesome wait staff, defiantly a go to local joint to start the evening out right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2qzI8cd94nza1baUN9eEdA"
  },
  "-Jj4jwdw3pjZ6zDw_8ojIg": {
    "date": "10/26/2015",
    "text": "This is an alright neighborhood 24/7 bar. It's part of the Remedy's family. Nice decor and ambiance. A little loud, but not obnoxious. Slightly better than average beer offerings. Decent food and a good selection. And they have Big Buck Hunter. All in all, a good place to hang out.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "YMgZqBUAddmFErxLtCfK_w"
  },
  "CAETg-kP15xZ7uS0otzAZA": {
    "date": "10/21/2015",
    "text": "I don't sugar coat things cause I'm no willy wonka so with that being said, shout out to the guys who really turned my experience here around - Eliot, Jon and Ryan.. you guys are True startenders in my book. I wholeheartedly appreciate how they are so attentive and fun whenever I stop in. far from the previous service experience before. you guys are the real MVP's.  since my last review, how things have truly turned around since then. service has stepped up and i can honestly say I haven't been disappointed. so, let's begin..  beverages are of the essence, so even though I was heartbroken of great white being removed off the menu, the seasonal pumpkin shandy they now have is the BOMB!! it's sweet with hints of cinnamon and is so delicious. safe to say I've drank plenty of these already and you should too if this fits your flavor profile.  food was so much better this time. the gyro was on point. cooked to temperature so it wasn't too dry. my sister got the bread bowl and she enjoyed it. nice new addition on the menu and good choice of mash and stew to put inside. my friend got the steak and eggs plate and it looked great as well. it's promising that breakfast is enjoyable here at any hour.  well played distill, well played.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "ejp_hsI7DKF-fF_jZji9lw"
  },
  "UebRIyyO9gELk09By5c4aA": {
    "date": "10/27/2015",
    "text": "Terrible service. The food was subpar (got the short stack with a side of scramby eggs) and the waitress seemed either tired or high on something.   Not sure what other people see in this place to give it good reviews but I guess earlier in the day, it's better. Either way, I won't be giving this place another try.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SoJQibSoDN9hTPVasYkH7A"
  },
  "u2Mdi7XVSfWpX2FmK2hltA": {
    "date": "10/26/2016",
    "text": "I came here about two weeks ago and the manager/bartender said our \"pitbull looking\"/dogo Argentino SERVICE DOG had to leave the general area of the bar and go to the restaurant area where no other paying patrons were. We assured him our trained and certified SERVICE DOG is allowed to go anywhere the owner is by LAW. He said the owners rules are we cannot be with the general population, which is against the law. We decided not to fight against his ignorance and went to The Lodge on Cactus. I decided to come back tonight with some coworkers and discovered a HUGE DEAD COCKAROACH in the woman's bathroom next to the kitchen. Next time I'll try the Distill in Summerlin! Dog lovers stay away!!!",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "J2V34bb0Ee6Xf3oMEmEkPA"
  },
  "gCvqUhZxUYqgSyxT336KGQ": {
    "date": "7/20/2014",
    "text": "The food we had was pretty good, chicken street tacos and chicken quesadilla, and the drinks were reasonably priced. The music was a mix of classic rock and current country, which we liked. Atmosphere is really nice and we are hoping this will be our new hang out come football season. Excited they are in the neighborhood.  The parking lot is a bit small, and the place can be hard to find or seem out of place just sitting off by itself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yxChdC6cP7xIgpZlbQK-Bw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yxChdC6cP7xIgpZlbQK-Bw/o.jpg"
      }
    ],
    "user_id": "1GbtKqRpDAfv13fUYIBBmA"
  },
  "PP1CJpQsnPwLCxLRYNMd1A": {
    "date": "7/24/2014",
    "text": "Food awesome!  I loved the street tacos and the calamari.  This place has a great vibe.  Love the decor and great tunes are playing on the juke box.  Bartenders were attentive and very friendly.  The place is great!  I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hohy4XEEopaTUtAAMibB0A"
  },
  "-noW_WFQuFUYBzbUIdN1mA": {
    "date": "12/10/2015",
    "text": "Best local bar in town. Our graveyard bartender Scotty was awesome. Never had an empty drink always on top of it even with a busy bar. The food and atmosphere of the place was also great definitely gotta check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxJbHSKyVK0yMnDUToy7GA"
  },
  "hopzFh22eo-97NEzdHTvGA": {
    "date": "4/11/2015",
    "text": "My 2 friends and I sat at the bar. The bartender took a while, but finally got to us. We ordered some drinks and then all 3 of us started to play the machines. As usual, the first drinks were finished quick and we're ready for more. The bartender was busy, but didn't seem to have that sense of urgency.  He would talk to people for like 5 min and then finally go to the next group to get the next groups drinks. Finally round 2  is served. Meanwhile, each of us are down over $40 in these tight machines.  The food comes and looks delicious.  Unfortunately there was no flavor in any of our pasta dishes. It was weird, cause it looked so good and I wanted it to at least taste ok, but NO FLAVOR!   Round 3 was served. No one asked how the food was. Maybe they know what the answer would be. Just to cut to the chase and finish this story, we had about 5 beers each and 3 shots. They comped 2 drinks!!! We were playing the whole damn time!! The absolute worst was when my friends girlfriend came to pick us up, there was some fight in the parking lot and a guy pulled a gun on the other guy! All these police came and had the guys on the side of the road!  Bartender was super slow to serve, machines super tight, food sucked, didn't comp drinks for players, and guns and police!  NO THANK YOU!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L8HxAAoWn2wTBc_xn2BXCg"
  },
  "gZSf4DixyAfGAe27HcD4lw": {
    "date": "4/21/2015",
    "text": "We had a great time at Distill on Thursday night! Eliot was the best bartender and extremely entertaining! We'll definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xdyS2tBd5FNAWhFO2AXG3Q"
  },
  "r2Zy2difTFww_EoiMqwtiQ": {
    "date": "11/3/2015",
    "text": "Really good Brisket dinner. The meat had great flavor and it was priced right. We sat in the bar and they did a good job making sure it not not smell like smoke. They used to have a weekly poker game here but I guess it stopped. That to bad. I enjoyed it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-d1-LUHXVOw2t3bdJHg26Q"
  },
  "1VZUR5hDccUxjHrHMuGVRA": {
    "date": "8/24/2014",
    "text": "Horrible place. I've never been treating so terribly in my life. You should be ashamed of your employees.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EoJTqLgc67u0NzbUlo48dA"
  },
  "fUtbrCfiNUj4d5-bYttucw": {
    "date": "9/10/2014",
    "text": "We just had dinner at Distill and it was exceptional! I was extremely excited for Distill to open especially because I knew it was owned by the same people that own Remedys. The food was so so yummy! I had the gyro and it was so much better than I even imagined. The meat was so tender and the pita was warm and soft! It was really good. We also had the fish and chips, beef tips and country fried chicken sliders! It was all really good. Everyone just kept commenting on how good the food was. We love that there is a separate entrance and section for the restaurant so you can bring your kids. We had Megan as our server and although she was busy she was extremely sweet, attentive and all around a really great server! A couple other ladies also came to our table to help with things and everyone was beyond friendly and attentive!! Definitely will be going again and again!! We really loved it!   So ecstatic to have Distill in our neighborhood! We needed another good place in the area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U4OvG7ZB4-go6j1AJAGAjA"
  },
  "dJLZtVTQRxtyHsmMkO0DJg": {
    "date": "10/20/2015",
    "text": "This place is my favorite local bar in town the food is awesome  and a solid staff to go with it! Distill chicken sandwich  is sooo bomb and it's not your typical bar food.  You have to check this place out asap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_M3TauKBbg9X1FV4xIE9kA"
  },
  "e6JUDwoqaKPuYTqYA8od6A": {
    "date": "12/19/2014",
    "text": "This is the frat time eating here near our house in southern highlands and the service was good but there is a very rude loud mouth cook yelling from in back. I was hoping for a new favorite place but this will never be. Will not return",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4j_G2MQ_65YOAwUSqx4JWA"
  },
  "Opj_ETkveWoHjqs04vbaRA": {
    "date": "7/31/2014",
    "text": "Two of us went on a Sunday night just for appetizers and drinks and to check the place out. I was a little worried it would be hard to find because there isn't much in Southern Highlands, but it's well lit. The only suggestion I would have is to put a sign right on Pyle and Decatur so that Pyle is easier to find. The bar was pretty full so we sat at a table. Server arrived right away with menus. The specialty drinks all looked pretty good. As far as cost they were a little more expensive than I expected but not Strip prices by any means. We ordered the Distiller's Delight and the Mad Mule. Both were tasty. We also ordered the mashed potato bites and the crab bites. The crab bites were a little on the pricey side but they were tasty as well. The mashed potato bites were bomb. I could have eaten another order of those if I had been so full. Our server was attentive, refilled our water, asked if we needed anything, so no complaints there. We moved to the bar after we ate as space had opened up. I overheard someone complain about how smoky it was, but I completely disagree. There were maybe three or four people smoking in the whole place. Bartenders were very attentive and checked on us several times. Really the only thing that keeps me from giving it 5 stars are the prices. If you live in the area I would suggest you give it a go! We will go back again for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWzl8y3rE_l9QdEOQMFvew"
  },
  "TKN8k39vrUQoyF31HJCvBQ": {
    "date": "8/16/2014",
    "text": "Bartenders are not attentive unless a customer(not me) hits a royal. Three work a shift and cannot handle less than 25 customers.  Also cannot deal with players cards.  Took over 30 mins to get one.. Then  misplaced the next time we go in and we have to get another one. Not organized.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DcYGmm225WxAukjBi4oKcA"
  },
  "wqZQmFmZ27ieYhVgrTNJ7w": {
    "date": "7/30/2014",
    "text": "not sure what I'm missing but 2 visits so far and not impressed! I was there the first weekend and service was awful. food was so so but i found it and cocktails pricy.But its new and was very crowded. i understand. Tried again last nite and not much better! service was better but not very friendly. this was noticed by all 4 of us there for dinner. Again not impressed with food and drinks are pricy for what tbis place is! glad to pay but make it worth it. i live very close and was excited to have it in our area. i will try again because i want it to be good and its close. i will review again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QDLbgHaqLcp76kmwdCfChA"
  },
  "dkyt0vcuobARcGrHFGmA7Q": {
    "date": "8/2/2015",
    "text": "Here for lunch and the food was great.    Ahi tacos were yummy and the burger was good.  We will be back.   Nice to have a good local place for food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmgL33ib5baPmYREggqoug"
  },
  "kAR_wz3_9hHHkW8CoQax_Q": {
    "date": "3/29/2015",
    "text": "The food is amazing the bartenders  are great and I love that you can play the jukebox from your seat.  Great atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBtftAeb4ibj9JVzwnN8KQ"
  },
  "STfhgMD8yoUOeb3KeM3jZg": {
    "date": "3/22/2015",
    "text": "Absolutely love the friendly staff and the food! I now always try to visit more often and bring friends who haven't been here yet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFv_tmLQ9upFUVxf81ewmA"
  },
  "2ps6Y5xRmUrzAjGgSEv14A": {
    "date": "6/8/2015",
    "text": "The service is great!  The food was very good especially the avocado egg rolls.  My kids loved the burgers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IGaB2JZ21h4RTiJQ1bhNQ"
  },
  "vnJ1fhpz5UJlnMBtrV2e7Q": {
    "date": "10/2/2014",
    "text": "My Monday and Thursday night home. Erin and Alysia both are awesome servers. Won a jersey! Good times!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F-trB_t19kQDe460uz9idA"
  },
  "rcc4denDzY6F54qgGlHVOA": {
    "date": "4/23/2015",
    "text": "Rhea is the best server ever!!!! I've been coming here since opening and I love seeing Rhea when I come in. Great service and an even better person!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKpcULyc9lh44k6toN6N-A"
  },
  "YYVmhL8MNoK5aHjItQxfGA": {
    "date": "10/28/2014",
    "text": "Very clean. Great atmosphere. Excellent beer battered fish & chips. No disappointments.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YtYbh7MzrK25Az1qaBiK7w"
  },
  "mtbEmRFFxB-Xyg-ym-hqSg": {
    "date": "9/17/2014",
    "text": "I really do like this place a lot! Been waiting for a cool local hang out and this fits the bill!  I have been there 4 times now and have had very friendly attentive service every time.  Love love love the Mad Mule cocktail :). The food is pretty good too.  Didnt care for their salsa or their avacado egg rolls but really enjoyed their fried artichoke hearts (minus the mayo dipping sauce-surely you can come up with something a little more creative).  The fried calamari was excellent! Not rubbery and not overcooked-perfect coating-nice and crispy-yummy.   Prices are what you'd expect at a place like this meaning it was reasonable.  Super cool bar area!! Cozy and inviting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lMIsJYvkn4BD5wTKcOSQcQ"
  },
  "milYAJ_7wPGjisQvEt2C0A": {
    "date": "11/27/2017",
    "text": "Im new to town and decided to try something new for  dinner, and came here when the game started and the food was great! I ordered cracked bread for my appetizer and for my entree i had the most delicious beef tips and mash potatoes!! Oh man pretty freaking amazing!!    But on that note the bartender woman sucked, the gentlemen was very sweet!! One i didn't know i was in Twin Peaks the woman  bartender walked around with her boobs all out and kept saying \"I gotta make my tips somehow\", if that was the case why doesn't she work at a strip club if she's so worried about her tips then her customers.. Im glad the gentlemen bartender was around because without him i would not been able to order a drink..   But i want to thank you for amazing food and amazing bartender, i believe his name was John. Ill make sure to come back in when he works!!   Thank you!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eq4Aa8lbeFawnY2rrJIoRg"
  },
  "gVKNsWcUg8WpefRIgQRjtw": {
    "date": "7/18/2018",
    "text": "Distill is my favorite bar food in Las Vegas.  It's nearby so I've been there a number of times - generous drinks, good food, friendly and attentive servers.  The Avocado egg rolls are a must try item - Fish and Chips aren't bad and the Hamburgers are really good.  The one thing I've had that I didn't care for was the burnt ends sandwich, but I'm sure others might like it - wasn't bad, just not my favorite.  AND if you're local they have a loyalty program with generous rewards.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jey1B1Xn27k142f8pOjDHA"
  },
  "ljNo3wMwyaRtu_iF7p7vJg": {
    "date": "6/29/2018",
    "text": "I REALLY wanted to try this restaurant tonight based on the pics and reviews of the food.  It was 12:30am and although it has a HUGE SIGN SAYING 24 HOUR FOOD, we were told the restaurant was closed!!!   WTF?  yelp said it was open, their 24 HOUR FOOD sign outside was lit up brighter than the sun but NO FOOD?  Seriously?   Talk about False advertising!  If your restaurant is only open certain hours then SAY SO!!!   EXTREMELY DISAPPOINTED as we were not told why or WHEN the restaurant is even open!!!!  I live in Southern Highlands so this would be a great location for late night food......too bad we couldn't get any!!!!!  Someone needs to address this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfAhG-GcZ0Fo7-rroee5IA"
  },
  "xiFAGLDmswPi0XiA_iw11Q": {
    "date": "2/12/2019",
    "text": "Ryan D. is the best! Good beer, good food, and great service. One of the best bartenders in Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yj1U4L-mvgJirSdeL9mZ-Q"
  },
  "2B_BpC4pNtOPYX2q4052oA": {
    "date": "4/24/2018",
    "text": "Ryan the bartender charged me over $20 for food and drink that wasn't mine. Refused to take it off and gave shitty attitude about it. Stay away from this place unless you want to get charged for stuff that isn't yours when you leave your card at the bar, better off closing each tab after each drink.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzJoojcNGG41zwiUYO3AuQ"
  },
  "6Apwp90rxDUCyyPMZrKkzw": {
    "date": "6/3/2018",
    "text": "This is one of my favorite local bars. The graveyard bartender scott is super friendly and provides awesome service every time I am in. Distill has the best bar food. Their buffalo cauliflower is my go to. I've had it other places, but no place is as good as this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CwYLTJU9eKbQOTlzYO9FdA"
  },
  "dwzmOvNf9w6sFrSmf9nJ3w": {
    "date": "1/28/2019",
    "text": "Love love love this place!!! Bar staff is amazing, foods great, great service! Beer on tap is refreshing! John and Erin are my 2 Favs! I highly recommend their Caesar salad wrap is yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2eFGQ7MRtaZSVkY9TDHTw"
  },
  "vUPwHbk6BUZLJNBR69lQIQ": {
    "date": "1/24/2019",
    "text": "Stopped by Distill after work this week to decompress and was very impressed by the late night bartender, Ryan. I was greeted as soon as I walked in the door and promptly served an outstanding Michelada (which I'm very picky about). He suggested the empanadas and they were great! I even won a little money on the machines :) Inviting environment and impeccable service, which I don't always find from graveyard bartenders. I'll definitely be back! Thanks Ryan!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CC3_ErEO3GKENPJB_NGELg"
  },
  "E46oiNwaoKC0clI_M1FtGQ": {
    "date": "1/12/2019",
    "text": "Love this bar! Ryan is amazing and makes us girls feel so welcomed..... Aaron is hands down the best cook in vegas! This is definitely our new late night spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppc6Lzmg8Zx1RjS06AVJ8g"
  },
  "F8tY9Pa_KuamwdeeAD4w3A": {
    "date": "6/4/2017",
    "text": "Always amazing !! Love the food and most of all love the service !! They always take care of us and love the fact I can play some great music and have a great time !! The staff is always awesome!! Been coming here for 2 years !!!  Heat local atmosphere and nice to hang out !!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PCZSrFAJapmJx0I6CI6gGQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PCZSrFAJapmJx0I6CI6gGQ/o.jpg"
      }
    ],
    "user_id": "-OqFOjD_8RP5nZ7VdADONA"
  },
  "d7XDUTnIJqn_yi8hYvmdLA": {
    "date": "1/7/2018",
    "text": "Nicole is the shit! Lose or win she makes it a good time! If only the poker machines were as sweet as she is I would probably live here! Best bar in our neighborhood",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D35Wgtlc38QhZhlf1wuegA"
  },
  "lvwpynCAH0CjsBpABYJLtw": {
    "date": "11/18/2017",
    "text": "So this is my third experience at a local Distill.  The BEST experience so far and DANI was the best sever!   She has a great personality.  Friendly and so attentive.  Made our morning drinking and breakfast even more enjoyable.  The beer selection is great, as is the bartender.  Then the food comes and WOW!   Best chicken fried steak in Vegas. An excellent way to start the day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XaCP_EsiszVbMGyLs9k3xA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XaCP_EsiszVbMGyLs9k3xA/o.jpg"
      },
      {
        "img_id": "A_iobfxKwqRKLd_edtjPUw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A_iobfxKwqRKLd_edtjPUw/o.jpg"
      },
      {
        "img_id": "0nelZUNPKirZ8WNjyCp_Bw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0nelZUNPKirZ8WNjyCp_Bw/o.jpg"
      }
    ],
    "user_id": "Iqpk0MGGBvFDXp0fDCKS4w"
  },
  "fwjhf2OaMGGLe56UepTDyQ": {
    "date": "11/11/2018",
    "text": "Great customer service from Rick at the bar this morning!  Thank you for the friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iw8_1qjDBfyDpzwDxt8gjA"
  },
  "24KRKpXhbw6OioXUGIRsiA": {
    "date": "9/30/2018",
    "text": "Yeah.  Make sure you count your drinks when you are here. If you do not gamble the bartenders will charge you twice the cost of a drink. Bartenders will definitely take care of the regular gamblers. Just not the regulars. I even gamble for shits and giggle today and still got fucking charge.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TYIqH5GCze4AvyGXYuEiKg"
  },
  "-mv334-OqnCNj8U9Wo4H0Q": {
    "date": "5/11/2018",
    "text": "Erin was our bartender at 3 pm today. Damn, she knows how to make a kick ass Old Fashioned. Definitely coming back to this place. Awesome drinks and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHUFehYcNYY7D-L-YlC_Jg"
  },
  "29Y3EGX6qyA29oMFw-VtqQ": {
    "date": "4/21/2018",
    "text": "So I am only giving this place 3 stars because of the pm guy bartender.. he is just not nice there is one that's nice Scotty and the Chelsea 5 stars for those two. The food is good always hot. The bother bartender is just so shot and rude. Careless not friendly at all and we go there all the time and the first thing we think is oh man what bartender is it..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_USfyQ11AKAA-wFryKjaw"
  },
  "BrckkzZpvaP-86kqOI-nlw": {
    "date": "9/13/2017",
    "text": "Distill? More like Dis still the best bar in Vegas!  Food here is amazing especially the wings. I have an odd obsession with their french fries as well. Did someone say YUM?!  The drink deals here are great as well, and the service is even better. All of the employees are friendly and attentive, especially the wait staff. My server Rachel was probably the best waitress I've ever had, she deserves a raise. The extra side of ranch she brought really made my sandwich (as well as my day) a spectacular one. Thanks Rachel. 10 points for Gryffindor.   If you've never been to Distill before definitely give it a shot, you won't be disappointed. Between great food, great entertainment, and even better service there's no other bar I'd rather spend my money at. Seriously all I can say about this place is...WOW!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a3EOWPzDnZKAWsbTONgERQ"
  },
  "slrPU_fR4G0Sc2Z6637zKw": {
    "date": "6/10/2018",
    "text": "Good food, service and friendly staffs. Can't wait to try other items on the menu.  Nachos and cheeseburger sliders are exceptionally tasty and reasonably price.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHvZGMxGuqkQP20pahWbBw"
  },
  "RV_eXrMNanrmDmj9-QuK7Q": {
    "date": "12/3/2018",
    "text": "The most interesting thing about this bar is that it is a True gaming bar with all the perks. You can feel comfortable here with your friends and family with no Interruptions from the normal Grave Yard shenanigans. Ryan makes it a fun, safe and happy place where you just unwind and relax.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWiD0S4dR5aFyeoVxB2-zg"
  },
  "smOehz4a4fs0hplMCVLv6Q": {
    "date": "12/3/2018",
    "text": "What a beautiful bar here in Southern Highlands. Love the Atmosphere and the food after a long day working on the strip. Mostly make it in graveyard which is my favourite. Ryan is always making sure everyone is having a great time. Thank you RyanG and Distill for your awesome hospitality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_HUOSTIvuagMh45LONR7w"
  },
  "AeZsj8JtRusaKSGynPGDNw": {
    "date": "1/8/2016",
    "text": "This bar is five stars to me. Good service from friendly bartenders. The food is good.  I'm always treated right and want to return.  I highly recommend if you want to chill with a few cold ones  and relax.  TVs everywhere for games, too, with specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "66nrGA7mLxNzxqL0iAL-8Q"
  },
  "FWwsnWLRDb5vuvu6MpGPoA": {
    "date": "10/11/2015",
    "text": "I mean...it's mediocre food with hurried service, which Im coming to understand is pretty much a constant in this city.  The mashed potatoe balls which many have recommended were less about the potatoes and more about the cheese, jalapeno, and generic Italian'esk breading, which strangely enough tasted like the same breading used on the mozzarella triangles.  The fish and chips were coated with a heavy thick batter which was soggy and undercooked and the chips were bland tasteless soggy luke warm bag fries.  Awesome.  My martini arrived on the rocks in some kind of mixed drink / beer glass, which, considering they have like 6 different kinds of martinis on the menu, theyd at least know how to serve them.  Having sat down in the bar area, we at least anticipated being able to have a few drinks and hang out, its not as though there were no other tables open, and we did have a 80 dollar cheque open.  Needless to say, as soon as we opted to not have dessert, our bill immediately arrived and the card was wisked away and returned 60 seconds later, which was THEE fastest service of the night.  I guess we're more interested in turning tables than having people order a handfull of 12 dollar drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NdOowgN5r4Q8VRtJXQoo3w"
  },
  "BWdfZXF0MpWlBndzz-JqAg": {
    "date": "11/18/2015",
    "text": "Good spot. Nice inside. Not too smokey and the machines don't suck your money real fast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRkfT1_6dVouyUVfN4R-Pw"
  },
  "Ao1KkHYZiUZ5BO4efIAADg": {
    "date": "4/11/2015",
    "text": "Patrick and Mo rock! They make awesome Martinis, make you feel so comfortable and always have our drinks ready when we walk in. We definitely return because of them. Great happy hour as well! Buffalo sliders are tasty.  The bar is always clean and love the atmosphere. Great pool tables area.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "yvAYprNnakItO2O4zjDHtw"
  },
  "fW8r_mAFkkDr-SDhoccyXg": {
    "date": "4/13/2016",
    "text": "Came to grab a drink with friends, drinks were great and surprisingly cheap! My cousin asked if she could use her South Point employee discount, the waitress said they don't do that anymore.... But she introduced us to the Indicard. If you're apart of the food or hospitality industry you can get the app. You get happy hour food and drinks ALL DAY with the indicard. Def gonna be the go to spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QSx1cIoAlJ7aBfGbwHMyTw"
  },
  "FzhXrwoAHhIRJiSWVPCseA": {
    "date": "12/4/2015",
    "text": "Have been here 3 times on the restaurant side. Always great service and food was great for everyone in the group. They have a lot of different options to choose from. They also have some type of reward card gets you points for discounts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EW2So0HMefCyxC8S3Lt2pw"
  },
  "UQ3gb03OjoTSTznmEMM1Zg": {
    "date": "2/10/2017",
    "text": "Love the atmosphere and how it's away from the cluttered shopping plaza. The food here is great.. I sometimes go here just for the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LCVGvYcIJNTyCrSTPnDbMg"
  },
  "qTjK20_okz8MVI7dmD3Azw": {
    "date": "10/20/2015",
    "text": "Best bar food in town. Mashed potato bites and sliders are amazing. Bartenders are super friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_oPUgLKI_rEearNecj3DUQ"
  },
  "XoyEMYH15gvf4uNbP8QwCQ": {
    "date": "2/28/2015",
    "text": "Came here once and no more .... about 2 1/2 months ago I came to test the food .... The bartender/chef were cool ...  The bartender said customers always order the Ahi Street Tacos ... Ok Ahi Street Tacos it is .... The Ahi it was freezer burned !  Very dry and like cardboard ! sucks ! Junk ! never again !",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "k-2W7oUj8zrESLM98pykGA"
  },
  "E7uj0uG8pxtw0dpOXncN3w": {
    "date": "1/23/2015",
    "text": "Friday night. Asked to get a waitress so we could order drinks and food at the table. 3 times we asked and no one came. Got our own drinks from the bar all night. Bartender with the beard is a metrosexual douchebag. Started making fun of me for asking for service. It's been 3 hours jackass. Do your Fu**ing job.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "xOjeLU-hAnFiQMr43b6iWg"
  },
  "ZnTlxY6yd7SDBzEyylNbVQ": {
    "date": "8/17/2015",
    "text": "Distill had great food. Also a big selection of appetizers. Their nachos need a little Xtra beans on them but other than that it's all good. Nice little spot in the middle of the desert. Alisha the server is the best",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxM-8adzEIfQmKgsYBEZrg"
  },
  "xHstLxMVPDoMaXdoMQK1DQ": {
    "date": "3/12/2016",
    "text": "Best spot in town!!  Keepin' it LOCAL!  Great job Elliot & team...you guys are awesome!  Remember us by name & treat us like friends!  We only get to go out once a week & we always choose this spot!  Keep it up~ ~Chris & Heather!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J12KAZrqtLirdfVeVeuwHg"
  },
  "hgp9ktFS4L7ZSXNXsSn43w": {
    "date": "1/12/2017",
    "text": "Went in on whim after work- service and food were great- machines were friendly too!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4DFWRZrduR2VVS9M4ACqPw"
  },
  "ZzNbAGCpiGnFxszovp-lvQ": {
    "date": "10/15/2015",
    "text": "Great food and good service. We came here a few days ago for breakfast since is in the neighborhood. I had the breakfast burrito and my wife had the sausage and eggs. Everything was cooked perfectly and had a lot of flavor. The hashbrowns were the stand out to me, since it is really hard to find good hashbrowns in vegas for some reason. They are buttery and seasoned well. We are definitely going back for breakfast and to try other menu options. I have to add the the menu is 24 hours so you have a lot of choices at all times of the day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qVj7JaSwDgDBkDyxhwBTBQ"
  },
  "ziqeswcY2zAkqHAYDHtvKA": {
    "date": "11/29/2015",
    "text": "The first time I came to distill I was really happy with the service. It was around grave yard. The food was really good. I recommend this bar to everyone in the southern highlands.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAr4XqU7-LJSDqYVoQXF9g"
  },
  "fr3fkH275v_4mQUtUpkJsw": {
    "date": "12/12/2014",
    "text": "There was some ridiculously high expectations for this place coming in due to a friendly recommendation about an awesome happy hour and great mashed potato bites. After those two items .. nothing else is even worth mentioning. Mediocre soups lacking any kind of seasoning and a dry BLT that left my girlfriends face sadder than the amount of bacon on her sandwich. The worst part of all was the customer service. Our waitress was designated to the restaurant section away from the bar and struggled to manage the few tables that exist in this section. She managed to make us wait 15 minutes prior to greeting us or taking our drink down followed by an additional 15 minutes for delivery. This place was an embarrassing experience to say the least . I wouldn't recommend it unless I was already hammered looking for good bar food to sober up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "LecfRnAJmBMiL2xlzpjQBg"
  },
  "8eCsv4mr1Rn3A2o1MPtJAg": {
    "date": "7/25/2014",
    "text": "Just meet Chris general manager and he is awesome!  Bathrooms are small but there are two. Food is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M44DLuvFVCuQ6W526BG4qQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M44DLuvFVCuQ6W526BG4qQ/o.jpg"
      }
    ],
    "user_id": "ggKmJZGsu2GnFgIrbM7LsA"
  },
  "YfvEmE4-MDLwD3INn02CfQ": {
    "date": "4/6/2015",
    "text": "Excellent food and service. Patrick is one of the best bartenders around and his team is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-BCJcJ73hm9tiIGMolpT_Q"
  },
  "pReCXSFyLxlnQKk4N8nFXw": {
    "date": "10/27/2015",
    "text": "The couple times I've been here the bartenders where shitty took forever to get drinks the waitresses were mean muggin all night I just don't get why. Definitely would never come again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d68XiN1KBLbcV7WVR8RS4Q"
  },
  "1T5Tpq1uXy-j2pKm7KC3hQ": {
    "date": "4/21/2015",
    "text": "A friend and I wanted to watch the NBA playoff games  at a bar so I suggested we check out Distill, glad I came up with that idea. Great TVs around the bar perfect for watching sports, having drinks and eating good food. I order the fish and chips and my friend ordered the cure burger, both were great. I will definitely come back to watch more games. The food was great and so was the service. Our bar tender Eliot was awesome, a really funny guy that made sure we had everything we needed. I like to play video poker and appreciate good service behind the bar, this place has it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qtmidfrk8M1H4bFVfqujbw"
  },
  "AC_9ev6k3LyII5WHGjSCaQ": {
    "date": "4/13/2016",
    "text": "Excellent service, delicious food, great atmosphere. Our server was Rhea and she was very attentive and made us feel like we had known her forever. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Q4CY16AR-qN__hlXrUS1g"
  },
  "RXzgp1nT3A8JOvJV-z72lA": {
    "date": "7/9/2017",
    "text": "One of the best places to come and enjoy a cold drink, great atmosphere, wonderful bartenders and great food!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JtA9vYSGwYEAB0RraqDBmw"
  },
  "8Wr9dewgebTdel-D2uyJEQ": {
    "date": "8/31/2014",
    "text": "An outstanding new addition to the Southern Highlands Bar scene. Staff is friendly and courteous and the food is great.   The place is also configured well and you don't feel crammed or worried about having a place to sit.  Pool tables are nice and parking was easy.  We found our new place to hang out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lyFkHd30nTs1bWwyqo931w"
  },
  "T9XK7OT-ivDn6WPKiekijw": {
    "date": "10/24/2015",
    "text": "Great place for drinks and a late bite. I would recommend to leave the dining area open later than midnight in case people need some quiet time",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2f4kHTB8t5jcGse2ebLT5Q"
  },
  "lKUqaacclorWbmIrH4Jx1g": {
    "date": "5/6/2017",
    "text": "Great customer service , chill spot for Henderson locals . Wish outside sitting area would be a little more welcoming and add another lamp or two . Food is a bit overpriced for what's served . Love interior design.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdWdUdbvW2BzmZYcD0bWZA"
  },
  "qLzY1PAF-eUqv_xoYeuMhg": {
    "date": "10/4/2015",
    "text": "I came for the first time today... a little disappointed.  I played the machine a bit at the bar, ordered the tostada platter which were pretty much tacos with a hard mini tortilla. Service was blah. Took forever to get a drink and it also took a while to get someones attention to remove my plate from my machine area.i won't be back....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSnmCCljHPJ4BhbYBFbG3Q"
  },
  "5p_JAMXlSYaOZe2OsF8Xvg": {
    "date": "4/26/2016",
    "text": "This bar offers amazing food and great drinks. The atmosphere in the bar is energetic yet cozy, a perfect place to meet a group of friends or just have a drink at the bar. I love playing poker and keno here. The bar tapas & food is high quality and really good. I recommend the mash potato bites, the chicken sandwich and the fish tacos. Ryan and Jennifer are really great bar tenders here and Aaron is an awesome cook. This is arguably one of the best local bars in town. (also they have a pool table and a juke box).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAKWWShaL9Qe2eAE29fetA"
  },
  "dAfovt5eh985H5ZfAkM1UQ": {
    "date": "9/11/2015",
    "text": "First off the food is great(sober or drunk). Eliot or Jon behind the bar are excellent. They remembered me and my girlfriend just from our first visit, which is nice.  Seems this bar is always packed and thats because of the service, food and loyalty the bartenders give to the customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MGgq1WjgmiOL4Vow5fPmgQ"
  },
  "vS7FTS2S_smC73ZdnHXEkQ": {
    "date": "10/29/2016",
    "text": "Friendly bar with good food. This bar has a friendly staff every day. The bartenders are friendly and welcoming. They're not just friendly to gamers they genuinely make it feel like a neighborhood bar. Jen is the best bartender in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "egiANc-4LGXwYdSuM198rg"
  },
  "KIodcK33JWkjHGF_z0BmdQ": {
    "date": "3/14/2016",
    "text": "Love this place. Its near my home and its always clean and friendly. Food is good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TkWlxoEFtT_MdcDvPzBDQQ"
  },
  "H2EswQjdnSV5Y9Lk855kRg": {
    "date": "7/24/2015",
    "text": "Slowest food service you can imagine. 40 minutes for a salad. No manager or ticket expeditor directing the kitchen. And no one seems to really care. Fried items come out faster because according to our server \"it takes less prep time to fry stuff\". There is no manager on duty. No one helping. No one caring. Customers in the restaurant area have waited longer than we did and just gave up and left. Food is delicious though, unfortunately the service ruined our entire night.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K0xSWNpExO9Pn2xc5GfjFQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. This side salad took 40 minutes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K0xSWNpExO9Pn2xc5GfjFQ/o.jpg"
      }
    ],
    "user_id": "mzKg1jlHONLgsP-rPL4OFA"
  },
  "HzeWg0WfCplZ9Hi-oARxTA": {
    "date": "7/8/2017",
    "text": "Best bar in town :) I love distill and everything about them! Nicole and Elliot are great out here in the southwest ! I drive all this way just to see them but centennial distill is my home spot love everyone there too :) happy to  call distill my second home !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5mPvf905qXsxWYO-RlKuA"
  },
  "S7oeu50Y9eJEWWhrAmoW_A": {
    "date": "5/31/2017",
    "text": "Love this Freakin' place!!! The food variety is insane & consistent. I rarely do reviews,.. but the food merits one. I've had the pancakes several times & their the same incredible taste & texture!! Don't get me talking about the mashed potato balls,... HOLY Moley!!! Well,.. back to eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJ2S3vxI4D19C3fPxPf9xQ"
  },
  "twuiAAgPXk5web5yteYSzQ": {
    "date": "8/31/2015",
    "text": "Horrible food service was rude. Never again. They should be ashamed of themselves. Disgusting. Go to BJ's food is better and service is great. This place sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eifw1A1AuFrcyxSW8QjjwQ"
  },
  "GncVOWGzk8vE1MxuN1ODTg": {
    "date": "11/18/2015",
    "text": "Third time here everything was great until midnight when the graveyard bartender came on shift. I have never felt so disrespected In a place of business in my life. I had a French martini with the previous bartender, who made it well (9:30pm John) my drink was perfect and it tasted  exactly like it's supposed to be made. I re ordered my drink at midnight as we were with a group of friends and the graveyard bartender delivered my drink tasting off. I  went over to the bar and asked the bartender what he made my drink with. He begin to explain what he thought was in the drink (wrong) instead of asking he was pissed off when I told him what was actually in the drink. He then prepared a new drink, as i waited at the bar. The new drink was prepared and delivered in front of me looking completely different and tasting different as well. When I asked the bartender If he thought the drink looked different than the previous prepared he ignored me... I proceeded to taste the drink and told him that the drink tasted differently as well. I told him I had no problem paying for both drinks but the first was almost undrinkable. He then swiftly grabbed the drink from me and immediately and abruptly poured it out in front of me... ignoring my concern. I sat back down with my large group of friends astonished by his disrespect and unprofessionalism. I told our waitress my concern who was very busy and a complete sweetheart. She notified our table that his name was Ryan and that she was very sorry on his behalf. How is \"Ryan\" about to work graveyard at a bar in Las Vegas and not know how to make a french martini.. Even so.. How do you allow yourself as a bartender to be offended when a customer patiently and politely tries to inform you on how to make a certain popular drink... And be rude and disrespectful to the customer. I am blown away by the lack of professionalism what a poorly run establishment if they allow rude bartenders to treat paying customer with disrespect during after hours... Is this how you train your employees? I will continue to notify everyone I know of this bar and the graveyard bartender and his lack of respect to customers. I am embarrassed for you distill. 1 star how horrible",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DT5XO2CozUFJl30eI5lxmA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. New drink after I had to coach the graveyard bartender on how to make this martini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DT5XO2CozUFJl30eI5lxmA/o.jpg"
      }
    ],
    "user_id": "GmXOSEbXy8JXmvo9hM5WWQ"
  },
  "q4Q63pKC9RWrgsHnFtUh-Q": {
    "date": "11/2/2015",
    "text": "Great food & great service!  Bartender was very helpful with assisting us with the video machines. Only downfall is they need more gaming. Their 10-15 machines don't really suffice for a busy night",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JfepqzyY6SizduStIfEofg"
  },
  "zmIAgS0AJXbckgnmQMT8sA": {
    "date": "5/29/2015",
    "text": "Came here on a packed Friday night with a group of 8 for dinner. We all shared two types of apps (avocado egg rolls and mashed potato bites) and for an entree I had the Seared Ahi Salad. It was delicious. Wasabi dressing was refreshing, just the right amount of tuna, crispy won tons, savory warm roasted red peppers and cucumbers. AJ was our server and she visited our table numerous times to make sure our food was good or if we needed a drink refill. I definitely recommend this establishment and will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "VDqP7RluIWZhmv4vtJ1Y8g"
  },
  "d5O3CHqAclgIe8d7MSwwcA": {
    "date": "7/10/2015",
    "text": "Terrible sports bar in the vein of PTs. Tons of sports and terrible music. Terrible service. Hard to get a drink and never clean your ashtray. They have a few more beers than the Lodge.  Terrible burgers. Terrible in general. There's just nothing much down this way, lest I would never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "750rhwO7D_Cul7_GtO9Jsg"
  },
  "CvDzemQ08iy2vOO_AuuMYQ": {
    "date": "9/21/2015",
    "text": "Love distill food!! Great country fried chicken the best great staff .. Very friendly !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9d2nHTp-txs4INOyKDrf-A"
  },
  "pk4QKszPE_ymhzLX6Lzqkw": {
    "date": "3/11/2016",
    "text": "Great place in Southern Highlands area. This has become more of my local bar but it's a great spot to have a drink or get a bite to eat for anyone in the area.  Industrial decor which I like, very clean.  The food has been good each and every time we eat here,  lots of TV's to watch games, it can get busy but mostly you can find a comfortable spot to stay awhile!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DnvqlcsuiUZ5kIyqzRx1XQ"
  },
  "KbPrG8qjOnWjO6XQhtdovA": {
    "date": "5/23/2019",
    "text": "Waited in the restaurant area for 20 minutes with no service. It was busy, but the blonde waitress never acknowledged us, even after passing by our table several times. I even got up and got our menus, but still nothing!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YrLwOQg1_sulRvgxeBxiNw"
  },
  "NHb4vNfQnf0RiELKqllwyQ": {
    "date": "1/15/2019",
    "text": "Nice clean atmosphere, nice menu selection, and really good wings ! My only issue is that service can be slow if they don't  know you. If your a regular there, your golden!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGmWtQeYkdJGGFHnyogzOA"
  },
  "CV19vFJwvmgBvh8Otn5PSQ": {
    "date": "5/23/2018",
    "text": "This review is based on the food and atmosphere only! I love coming to Distill when I can't decide where to eat. They always provide delicious food using quality ingredients. Their staff is always polite and gives you that neighborhood vibe. Of all the gaming/local bars this is my go-to for the best food! My favorite thing to get is the Distill chicken sandwich it comes with bacon and avocado and I like to add jalapenos. Their bread is Always very fresh as well! (I always admire a place who uses fresh jalapenos over pickled) Everything from their house salad to wings to dessert are all quality items nothing is ever lacking! Thanks for being a staple in the Southern Highlands Community!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zO_axlS-5y6-W16426qZdw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Huge bone-in chicken wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zO_axlS-5y6-W16426qZdw/o.jpg"
      },
      {
        "img_id": "mRmXt94KTf1q3zwxFtTJUA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Distill chicken sandwich w/ fresh jalapeños",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mRmXt94KTf1q3zwxFtTJUA/o.jpg"
      }
    ],
    "user_id": "055mHXHyW4wE3dwVSNMs9g"
  },
  "nUibaVw3pd0Mgco5NIBxHQ": {
    "date": "3/30/2019",
    "text": "Ordered medium burgers through Postmates, both were raw and one wasnt even the one I ordered. Wont be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbWLyJPmIaWLsxFgGbq7PA"
  },
  "M5ehFBrIUHlEgvyndcrQEg": {
    "date": "10/28/2018",
    "text": "Worst place to go for food At 3:00 am after 22 minutes waiting the bartender refused to serve food  bcz was no servers at the time, definitely not a place for food after midnight, they advertise as a 24 hours food service and is not",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CBx1i1R6QGqsQXa4MLvUHA"
  },
  "Jil6V3lhntyw8ur_AZirIw": {
    "date": "6/13/2017",
    "text": "This bar is one step above your average PTs in Vegas. If you are looking for a chill bar, dim lighting, TVs for sports watching, a few slot machines, plenty of seating, a couple couches, two pool tables, and light background music, then you would feel comfortable there. The ambiance works for a local neighborhood bar.  The food was overpriced and full of lackluster. The pretzel bites were equivalent to something you would buy in a grocery aisle and spray too much Pam on before microwaving. The mozzarella sticks looked really good, but were unremarkable. The buffalo sliders were more bun than chicken and the chicken was overcooked and very crunchy. The fries weren't great, they had no crispiness or flavor, and tasted like they had been frozen for a long while. The service was quick and attentive.   Don't go there for the food or expecting a drink selection beyond every other local bar. Go there because it's close and you just wanted a place to hang out, otherwise don't go out of your way.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uso43PtZRUPcYxgxs12U1g"
  },
  "_R2RFFt3-70Xvb80Ow4vUQ": {
    "date": "11/2/2018",
    "text": "I've came in several times when Sean H has been the bartender, and I have no complaints at all. The food was great and he always made sure my friend and I had drinks. He's an awesome bartender! I'll def be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "su2-Dv1nzirUqurTf-DC5Q"
  },
  "A7jcs1TmUzNH6PnDJVjm5Q": {
    "date": "4/29/2017",
    "text": "Honestly, this is a pretty great bar!  DRINKS: It's a bar...do I need to describe what drinks they have? ;) You name it, they have it!  FOOD: Talk about food worth your dollar. Everything on their menu is huge! I highly recommend the buffalo chicken wings. It is a great big portion and it tastes great. I like to get their house salad. It is only about $5, but it is sharing size. You can't go wrong with the sliders either, there are various types to chose from. The worst thing on their menu is the chicken pot pie....just don't order it or you'll regret it.  ATMOSPHERE: I love to come here with friends and play pool. It's one dollar per game. The staff is super friendly and quick with orders. It is a great place to hang out so it does get busy daily.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "ZB0_Y3gpSj1xVC3lUOePbw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Shirley Temple",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZB0_Y3gpSj1xVC3lUOePbw/o.jpg"
      },
      {
        "img_id": "n1ZjP9ABVtQH4hrQEqk1OA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. House salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n1ZjP9ABVtQH4hrQEqk1OA/o.jpg"
      },
      {
        "img_id": "ZhwthT6iPWujDXLyH1HyMQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Bacon cheeseburger sliders",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZhwthT6iPWujDXLyH1HyMQ/o.jpg"
      }
    ],
    "user_id": "LTCxnnAQGaGZPHZx4KbvGA"
  },
  "L1WHC31_I4F8-lJzOt6ocA": {
    "date": "10/12/2018",
    "text": "This place is niiiiiice.. a perfect spot for good food and great ambience. Theres plenty of tvs for sports, pool tables and all the ppl that work there are hella chill..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsJKgW79PxkH6Dx9bsHr3w"
  },
  "2Slfda88MXznBr_4plosWw": {
    "date": "4/9/2018",
    "text": "We came in for dinner Saturday night. There was only one waitress for the whole dining room, but she was quick. The menu is great, and the prices good. We ordered everything at once: appetizer, main course and salad, a burger too. The salad arrived, then the appetizer right after, and not two minutes later, the entree and burger, which was pretty much everything all at once. We had to ask the guy who brought them out to take them back until we could start the appetizer. My salmon was great, but the burger was almost raw.  We like the location and everything is new and clean. We will come back, but make sure to just order one thing at a time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eACbdNnkPKim79TynjLdRA"
  },
  "vB0QVmC58Dns1v6tXcu5Dg": {
    "date": "9/1/2018",
    "text": "Great bar with a great vibe. Love all the bartenders they are great especially Chelsea. Food is also amazing! Always a good time here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WjMJ3guGcVELBfbRZ_LWag"
  },
  "lUqOi0VLfbLi1msysaFt6A": {
    "date": "2/23/2018",
    "text": "I keep coming back because there is a lack of options and I make excuses for why I was disappointed previously ( maybe they were training someone, cook had bad day, etc), but no longer will I do that. I could go on forever at problems; bun charred for to go so bad I had to use bread at home, wrap cut at such a diagonal angle it all falls out when you pick one side up, staff is fucking around and doesn't seem to care about customers et al.   Proceed with caution.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Tiv_nVNvRlrAHdsvXWrRGA"
  },
  "mkmBCHfMkMklz4m83p_Z9g": {
    "date": "5/24/2018",
    "text": "We had the buffalo wings and a Philly cheesesteak. The buffalo wings were by far the best I've ever had! And that's saying a lot! The prices were inexpensive and there is a ton of meat on the wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P5Upj8XPcou5uv5o5zMp0g",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P5Upj8XPcou5uv5o5zMp0g/o.jpg"
      },
      {
        "img_id": "kYZGABinEY3zL32M3dcVUA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. We had the Philly and the wings. Hands down the best wings I&amp;#39;ve ever had!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kYZGABinEY3zL32M3dcVUA/o.jpg"
      }
    ],
    "user_id": "vLNyG9e6mwzsgUCyseCXrw"
  },
  "F2AxU9i29DhgqjNnVrce2Q": {
    "date": "5/3/2017",
    "text": "I've never had a bad experience here. So close to the house, clean, great drinks and prices. Pool tables and more! A glassed-off, non smoking dining section makes it nice for family visits as well. The food here really is not your typical bar food, it's great quality and delicious.  All the employees here are great peeps, can't go wrong! Great atmosphere and fun alone or with friends. 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qfP7mVenCRYqijLiWOIWUQ"
  },
  "59qfkHlqiUkDyclC6FWO-w": {
    "date": "11/7/2018",
    "text": "Really did love this place, but recently let us down big time for a party we were planning there.   Also took our favorite appetizer off the menu.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a7UqAXrs2lWqtjTa-3-QQw"
  },
  "I4bluabzS1R6pZFKH5vCPg": {
    "date": "2/10/2016",
    "text": "we went to Distill in Summerlin and loved the atmosphere, live band music, and food options so when we saw this open up near our house we were excited.    WARNING:  this place is NOT poppin like Summerlin.    This location is much smaller and more low key.  I have to admit unless you're familiar with the area it's secluded and might be difficult to find. However, as a local bar to start coming to ... I enjoyed it. There are pool tables and different seating areas. If you just want to eat, or appear you're not in a bar, there is a restaurant section blocked off for non-smokers.  Our server was super friendly.  Since it's Ash Wednesday, the fiance and I decided to try the fish and chips.   The fish was a little too oily for me, but the fish portions were huge.  The drinks were reasonably priced.    Overall, I would come here again, bring friends, enjoy some drinks, and hang out !",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "QuoyOY2zv2UWmh9Nwu_UpQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Fish and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QuoyOY2zv2UWmh9Nwu_UpQ/o.jpg"
      },
      {
        "img_id": "SmQoqtx95UQmLQ4NwLtr-Q",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SmQoqtx95UQmLQ4NwLtr-Q/o.jpg"
      },
      {
        "img_id": "2ivcRcdCs2-bFcO6GXR35Q",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2ivcRcdCs2-bFcO6GXR35Q/o.jpg"
      }
    ],
    "user_id": "7P6t9qnhKLOa8SqGb85B7w"
  },
  "opSPGvkMmJByMR8t_7UrPQ": {
    "date": "1/28/2018",
    "text": "My boyfriend loves this bar but I find it overrated. The prices for drinks I feel are pretty high, for what the place is I'd rather go to a Timbers or PTs. The place is normally pretty busy, plenty of places to sit. Only two pool tables, which are usually taken. Servers/bartenders always friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzgAFIonfQZpArNuqrHYkQ"
  },
  "zbW61iihGvHaH65VycLOOQ": {
    "date": "10/14/2018",
    "text": "Not impressed. There were several people on staff, but only 1person working. The females had bitchy attitudes, and the one male bartender was the ONLY one helping customers. But I will say he did a great job. The music was way too loud. The drink prices are good, the ambiance is not too bad. But they should consider hiring people with better personalities and turn down the music, just a bit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IK0gTPM43C1wHyt17dCiQ"
  },
  "lteF37TKw1UDlVUBoRKvpA": {
    "date": "1/27/2018",
    "text": "Nichole is very nice and a great bartender always friendly with A great smile and accomodating.She always knows all of our drinks and is great conversation and helpful.She always recommends great food to eat and is prompt and attentive.This is A busy place and she pays attention to everyones needs.The food at Distill is always delicious and the gaming is great.This is a great place to watch A game or have dinner or just relax after A long day at work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HItxQKPMF5aRSRgAH8pafA"
  },
  "DYgh9MZhasbmEMndjPI0Kw": {
    "date": "6/16/2018",
    "text": "AMAZING FOOD AND EMPLOYEES! Decent prices as well! Also, not a crowded bar and pool tables. Definitely our new spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljUrOmqnUjKEBDJlj1xL2g"
  },
  "bK5lZ99-iH456uB-sdeoVg": {
    "date": "9/12/2015",
    "text": "Such a great local bar... One of those where they make you feel like welcome and special.  Mo and Eliot are always there to greet me with a smile and a cocktail.. I've been a bartender in town for over 15 years and this is definitely one of my favorite local hang outs...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qYwxLoljgNbkZr4uxNmf1A"
  },
  "3xLDkKY3fOpBsoAi4XluDA": {
    "date": "11/7/2014",
    "text": "Been coming here since it opened a couple months ago.  It used to be a Carmine's.  The wraps are great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFww5fsOH9KEj5hnhSgNTw"
  },
  "mMH9D9U6SVlx3aswTAc3BQ": {
    "date": "10/18/2015",
    "text": "I love hanging out and drinking at this bar. If anyone goes to Distill try the potato bites.  They are so delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wo9LTKYvnQloaGris1b3eQ"
  },
  "cwYlcutIk027Bb4Et8gakQ": {
    "date": "11/14/2014",
    "text": "Service was really helpful and friendly. The Santa Fe Chicken Sandwich was delicious. The fries could be better, crispier. I'm looking forward to trying other things, there were several I was considering. The dining area is pretty small.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4X2mc4UWuCn0lZPJ-989eQ"
  },
  "15yMJRTTx99jxajs4mq1kQ": {
    "date": "4/6/2015",
    "text": "I love this place! Food is great, the service is exceptional. There is a warm comfy feel to the atmosphere that has a gravitational pull that will keep you in your seat for hours. Thank you for the wonderful experience. Kristal runs a bar with a friendly atmosphere and a welcoming ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4y7jRQYshPu_S3zaj1YYw"
  },
  "XYwDe8qyDS1zCOBbMXZCWQ": {
    "date": "3/31/2015",
    "text": "Consistently phenomenal. All Bartenders are on their game. Super friendly and accommodating.  Menu is great. Not to mention that handsome Tuesday rocks. Yeah for John and Patrick",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnQ1dkvTgSKynPz75xzSpg"
  },
  "Yz82exGl6g1E4x5jUFqlOw": {
    "date": "11/7/2014",
    "text": "Loaded pints- cool idea. Take your 16 or 25 oz draft and top it with a \"floater\" Bacardi, vodka, liqueur. I had Great White with Marilyn Monroe and hubby Great White with mandarin. Spiced up the beer a bit. Food is - bar. Slightly overpriced. Calamari are equivalent to chicken fingers. Ahi - 2 oz for $12. Pretzel bites were pretzel bites. Pickle straws were mediocre. The bar is smokey and the \"restaurant\" is mini and enclosed in glass. From the bar the restaurant looks like a feeding zoo! Out of the 6 items we ordered (including drinks) they were out of 2. Cool light fixtures. Nice staff. Would return if I was taking someone home from the airport on a late night flight who lived in southern highlands and we needed a bite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1r-1hH9ewwQnVilyhJv5fw"
  },
  "CxVyRZ1968Au3niyI9Dz8w": {
    "date": "10/20/2014",
    "text": "Great place!  Friends and I started coming here at the beginning if the football season   We've been coming for most Monday and Thursday nights to watch the games and take advantage of specials during the game..... 100 ounce tower of beer for $12!   You can't beat that..... Not to mention the awesome food..... Regular menu is great too...... Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z39MZwIO0ZXs3ihoX9Hr3g"
  },
  "-1_xdfwAGlH62IFBX20TgA": {
    "date": "4/28/2015",
    "text": "Reviewing just the restaurant here.  If you go in the east door you are in the restaurant.  It is a little weird to just walk in and seat yourself, but having been there a couple of times, that is the way it is done.  Service is quick and friendly.  They have great hamburgers and bar food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k85Wj5y6gqs5K9P5joUEBA"
  },
  "HMA7PRtBumFcXq1ZogtnvA": {
    "date": "8/7/2014",
    "text": "First time we came here was for the opening and it was a blast ! Had a great time with friends and yummy apps , decided it's only fair to try it out again before I write a review . Me and my  boyfriend came here after work for some food and drinks , I was craving their infamous mozzarella triangles we ordered those chicken wings and fish and chips .our bartender Aby suggested the fish n chips over another thing on the menu we were in between and let me just say I'm not the biggest fan of fish n chips but this order was amazing the fish was so fluffy and the batter was incredible ! Thanks again ! The wings were just as great and the mozzarella triangles never disappoint ! The service was great everyone behind the bar was so nice and helpful (for as busy as the bar was ) which was awesome I would definitely recommend this place to anyone in the area :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlOGoN84Ls-PUTCxMwPH3g"
  },
  "jtMRduB33ep9JAqIugIeUA": {
    "date": "4/15/2015",
    "text": "Little gem of a place with friendly staff and yummy food. Only complaint would be portion sizes. I like to bring food home and I usually don't have much leftover... smaller portions compared to other places, but delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dE4QyNkv8BXLzzJxFIzKNg"
  },
  "ylfMCDi2-32z_4AU8RDrAw": {
    "date": "10/13/2015",
    "text": "This was our second attempt to try this Distill out. The first time, the service was so bad that we left before getting our first round. This time, there was no staff in the bar when we arrived at 3pm and we waited for 5 -7 minutes before ANYONE showed up. Our waiteress, Crystal, was nice and attentive. The manager ignored us, since we were only sitting at a table and not gambling. I mention this because he made a point to greet all of the guest that were playing video poker. Also, for the majority of the time we were here, the TWO bartenders could hardly stop talking to their friends sitting at the bar to wait on customers in a reasonable amount of time. We watched as multiple customers walked in, took a seat at the bar, and waited while the bartenders finished chatting with their friends to look around to realize that there was a new customer at the bar. This is the exact reason that we left without getting a drink the first time we tried this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_TLyAsR9J4ih1X4dF--WQ"
  },
  "UA7QVfvJnyB2t6RIEGfIWg": {
    "date": "11/20/2014",
    "text": "Bartender Kristina was rude..No concern with customer service!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77N1mGKqZZcs1LR6m-t5ng"
  },
  "5hltgh-YJunbHFCSOGeDcQ": {
    "date": "7/21/2014",
    "text": "Great spot, nice decor. Not smokey which is a huge plus for a gaming bar. The menu looks great and they serve breakfast all day. My only knock....how in the world do you not have any Mexican beer on draft? It's the little things;-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBp5UzcZS7XH0IpmzAeWjg"
  },
  "R8qnmhqcd8dnkfk-QxaNuw": {
    "date": "8/3/2014",
    "text": "Absolutely love this place, wonderful atmosphere and great workers!! Food has been great! Been back twice already, and tell everyone about it!! Great addition to southern highlands!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AREm24wH7tXEHC_FKUQIWw"
  },
  "g4HlwHbYDU3F8Q1uAKZRSg": {
    "date": "6/1/2016",
    "text": "The food is what brings me back time and time again. Recommend almost anything on the appetizers, think I've tried them all. Ok spot for a last minute date, they have pool tables and the staff is pretty laid back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qzW61_UBDjvV9e594JJYTw"
  },
  "IRMXNT41ndDXUR-yzlquXQ": {
    "date": "8/14/2015",
    "text": "The food was great, my friends and I shared the mashed potato bites which were fantastic, myself and another friend had pizza and my other friend got the seared ahi salad. We all enjoyed the food. But I ordered a well vodka tonic and it tasted like straight tonic, I couldn't taste any vodka. Also we had to wait a looooong time for our check and it seemed like we were being ignored for a while. But all in all it had great food and a great atmosphere, just wish the service was a little better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-uNickuvqJZW6oSB8ExA8A"
  },
  "8GGcji_561Sc09RR2fxvlw": {
    "date": "9/7/2014",
    "text": "Went for a late lunch with friends at the bar. The bartenders a really nice and attentive but the food is lacking. The pretzel bites were way too chewy and tasted microwaved and the dipping sauces were not good. Hoping the kitchen improves as it's a good location and the staff are nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o6MESxOVwEfL3QauN0d08w"
  },
  "hlx6kCbfOIescL1OqoJZUA": {
    "date": "3/10/2016",
    "text": "Over charged for drinks for gaming play and said it was to cover the bartenders tips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlbWDFc6LTSCi0nTPq3_RA"
  },
  "5LOxnOaMmdC2FWzcDJpCPw": {
    "date": "3/22/2015",
    "text": "First the Likes. Liked the hamburger (it was tasty).  Liked the beer (it was cold).  But even with that I won't return but perhaps I'm just not the clientele they want.  I like a neighborhood pub with video poker, decent food, and a chill ambiance - this isn't the place for that.  that jukebox is nightclub-loud!  A good chunk of people were hollering to communicate with one another in perhaps an attempt to ensure they were being understood but it just added to the cacophony of the place.  Some people might dig that and feel at home in a place where you can't hear yourself think but that's not my thing.  What really soured my experience were other rowdy patrons.  Not rowdy in the fun way but rowdy in the obnoxious way.  People who angrily scream f-bombs in some sort of misguided attempt for attention.  Looking 'round, customers and staff all were clearly annoyed but no one from the bar took the initiative to quell the brewing storm.  I cashed out and bailed from what I saw as an inevitable confrontation between those folks and the patrons who came to have a good time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OLd25x0N_CgF5053Iqs8xA"
  },
  "bOWHVoGd6Q0OXakuVsOZwQ": {
    "date": "9/24/2017",
    "text": "What a dump. Caught the server runner and what looked like the cooks all smoking weed out back!!  No wonder the service sucked!!  Also found out the manager was the bartender on shift. Lol 3 of his employees were smoking weed together out back on his watch!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3YAsLpbykHxYKunBpIjGNQ"
  },
  "c9rOQWs2HqVEaYNpCGlwpg": {
    "date": "5/31/2018",
    "text": "Great place! I live about 5 min away so it was perfect to go get a bite and some drinks. The service was impeccable sorry i forget her name bur she was on it, never had to go find her. She had our drinks out to us before we finished the ones we had. Great place i will definitely be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y81lXzh_ObRPhnu08cvqHw"
  },
  "-AkqEMykKMvvLqrMMSxBtA": {
    "date": "9/9/2017",
    "text": "We live Distill! They have a rewards program that gets you money back. There food is yummy and service is always point on!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g_r39OLw8zoTCP7aqJZwfQ"
  },
  "AGf_sp-2x7Ho35tevDl9mw": {
    "date": "11/16/2017",
    "text": "Friendly staff and great comps. Lots of tvs and food is not your normal bar food. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0g335GZC5N1KjjO8qfjrQ"
  },
  "jU2yhHIRkuqZACXykihx5Q": {
    "date": "6/22/2016",
    "text": "Good beer selection and drinks. Food good too.  However, don't even think you'll hear one of your songs on the jukebox. They feature the Touchtunes Julebox which you can use your phone app to play music.  Bartenders will skip your songs to satisfy their best customers that get drunk and gamble their $ away, in hope to receive a large tip from a drunk person that doesn't know otherwise.  Even on a slow night, they cater to their friends and regulars, and leave the new patron out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmExiS5rVxvv1sE7QgU30w"
  },
  "PaIJz9_oHwGr4Nd0igil5g": {
    "date": "11/11/2017",
    "text": "Very nice atmosphere waitresses were very pleasant I will be going back there soon and that bread pudding  the people had next to us looked awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iB2bFnF6cen45mmCqunV9Q"
  },
  "j93H8vuGjP8wQVcyoXxtfg": {
    "date": "11/30/2017",
    "text": "The entire staff took care of business but Nicole the bartender was super dope!  Definitely come down to Distills in Southern Highlands if you're looking for good food, friendly service and a solid bar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1zY0Rz-KDo01Wzq5regCnw"
  },
  "UXNjA7eOz-gxbDW_4-J5SA": {
    "date": "7/27/2014",
    "text": "I was highly impressed with the food. I expected typical bar food, but I couldn't believe how good my chicken breast dinner was. The potato medley that came with it was excellent. I asked for the creamy dijon sauce on the side. I am a health-conscious eater. One of the bartenders asked me how I liked it, and she said how much she loves the food there and gave me an extra tip. She said she orders the chicken \"dry\", to avoid the oils/butter they use when making it. She also recommended the egg white omelette. Breakfast is served all day, so that is awesome.   I will definitely be getting the chicken dinner again and I will be trying an egg white omelette sometime.  Atmosphere is cool. Service was good. Beer selection is decent, but I'd prefer even more craft beers. Great addition to Southern Highlands, and I am looking forward to many visits here.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "2t__HKqBFV1-2eIW2Nom9g"
  },
  "g31t7cagKISjk30E4yojZQ": {
    "date": "8/2/2014",
    "text": "Came here for the first time tonight. From the outside the bar looks pretty cool with a lot of signage. Inside was pretty busy and we found a table near the bar. We were greeted immediately and asked if we knew what we wanted, however we just sat at the table so wanted to look at their menu. Server came back and I ordered an Redd's Apple with Fireball shot (25 oz) and my boyfriend ordered a beer. Another server or manager came over and checked on us. She was very friendly. We also ordered the medium chicken fingers with sweet potato fries. It was pretty good & yummy. I enjoyed my beer. It was recommended by a friend. The cinnamon from the fireball shot kind of made my Apple cider taste a \"little\" like Apple pie.   Anyway, we received great service. They were very attentive and friendly. Also chatted with us. Plus the food came pretty quick. So that was good because I wanted to eat while I drank.   The atmosphere was cool. Not smokey in there at all or anything & had nice decor and lighting. Everyone seemed to be enjoying themselves there. I think there was also a birthday party going on in the lounge area. They also have pool tables & gaming machines in there.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "hJK57D9gY3qkEd20feSSZw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Redd&amp;#39;s Apple cider + fireball shot. Pretty good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hJK57D9gY3qkEd20feSSZw/o.jpg"
      }
    ],
    "user_id": "XTEmaVwAkdRyrYP45zd7iw"
  },
  "SUlLDYNp45xCqJYNuI3gqQ": {
    "date": "8/31/2014",
    "text": "I only come for breakfasts on the weekend. I like to take my little girl out and we rotate between here, Rise and Shine, and The Lodge.   Breakfast service is good. It is typically very slow so it's easy to get attentive service. At bars I typically get bacon and eggs. At Distill that also includes hash browns and toast. They are both fine. I believe the hash is probably frozen, but it is still tasty. There is no kids breakfast on kids menu so order one egg and bacon side a la cart for my 4 year old. Works out well for us as hash and toast is a lot of starch and we can split that easily enough.   Coffee has always been good. I take it with two creams so have to remember to remind server to bring more cream with refill (they consistently bring 3 with first cup).   Only real complaint - Door faces east and metal handle is not covered. Really?! It's Vegas that metal gets hot. Cover it for goodness sake.   Bottom line I'll keep coming here for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sLWRTE822H4A5vNpXapn5w",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Breakie!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sLWRTE822H4A5vNpXapn5w/o.jpg"
      }
    ],
    "user_id": "4mN1Gdo2B2HfSEP4QZIFuw"
  },
  "7Ly4vNudzQFn-NnlmuzQkA": {
    "date": "10/5/2017",
    "text": "If you're looking for a dark smokey bar with plenty of TVs and average bar food, this is your place.  To be fair they do offer something for the non smoking crowd. Similar to their sister restaurant Remedy, they offer all ages family dining / a non smoking environment in a small fishbowl of a room just to the side of the bar.  Of course, you have to walk through the smoke to get there - smoke so heavy that you need to change clothes to get rid of the smell.   Don't get me wrong, I love a dive bar.  I lived at Dinos for about a month.  But Distill falls somewhere in the middle of a dive bar and a restaurant- and unfortunately on my visit they fell hard.   As for the food, I had their new braut which tasted very off. And the seared ahi, which was underwhelming.    Despite the taste of the food, the service was friendly and prompt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A63h_7zL1phcQvrRuwEpvw"
  },
  "KwL80DQ9qQD-Ys97FZq8eQ": {
    "date": "8/10/2014",
    "text": "Great place, came here tonight to pregame for the night and to get some food. From the road it has a good location, stands by itself with awesome signs that you can see clearly. There is plenty of parking and the outside looks nice.  Inside is a rectangle center bar that is pretty big in size, has alot of seating along the walls with booths and chairs. You seat yourself but the servers greet you very quickly. The drink selection is great and the menu has a big variety of food. The prices are pretty awesome, 4$-$20, for appetizers to full meals. They carry craft beers and the normal beers. Have great sounding cocktails.   They have a good music selection and it's not too loud inside. Many televisions and casino games to be entertained by, they also have arcade games and 2 pool tables! They have a personal jukebox for the entire place where the customers play the music they want. Just download the app. Nice atmosphere with cool lighting. They even have a nonsmoking area. They got a cool lounge area with classy seating. The booths are very well made too.   Highly recommend this bar to everyone, tourists and locals. Will definitely be coming back here! HIGHLY RECOMMENDED  for a great night out without breaking the wallet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ap9XOfbYBJbfNMXkmdQzjw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Simple yet tasty. Worth it. Came with a choice of salad, fries, or sweet potato fries. I got the field green salad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ap9XOfbYBJbfNMXkmdQzjw/o.jpg"
      },
      {
        "img_id": "EkbtuvMOEW-33xsjSsBnUA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Classy lounge area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EkbtuvMOEW-33xsjSsBnUA/o.jpg"
      },
      {
        "img_id": "8fiYbhzVhQQ0AajpzcqcNw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Pool tables in the corner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8fiYbhzVhQQ0AajpzcqcNw/o.jpg"
      }
    ],
    "user_id": "4wSQtIUTcogmff31YW265Q"
  },
  "ep1zPIwY-UT5fTgNy7hVjQ": {
    "date": "7/24/2014",
    "text": "I'm a fan.  Great atmosphere and the Philly CheeseSteak sandwich was very good.  I ordered it with the sweet potato fries and to my surprise they weren't greasy and I devoured them fast!    Nice hardwood floors all around, nice seating when you want to chill with a group of friends and PLENTY of awesome HD TV's all over the place.  There were a few smoking and I didn't smell anything (thank goodness- hate cig smell).    I'll be back for more!  Oh before I forget, there's plenty that can't find the venue or it's 'hard to find.'  Goodness how do you people survive?!  Don't blame the venue on the maps systems not having it in their database yet.  Here's some advice- use your brain the old fashioned way.  You can see the location on their FB like page.  At night it's lit up VERY well by the signs and the words on the building.  I could see it from the intersection of Silverado Ranch and Decatur easily.  Since this part of Vegas doesn't have many street lights, slow down and you'll see the side street Pyle that your turn on from Decatur.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o5QRweNlK0P-bG4znoVsqA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o5QRweNlK0P-bG4znoVsqA/o.jpg"
      }
    ],
    "user_id": "DyGjPveXMndYLRcKllBc3w"
  },
  "Xp73_oXyK8aGgdSMdgbPGA": {
    "date": "3/26/2015",
    "text": "This is a good bar with good food.   I have been here twice now, and it never seems to be very crowded, but that's a plus for me because I never have to wait. I like that the restaurant is glassed off from the bar, so it is quieter and appropriate for families. If you are looking to watch sports, this is a good bet.  I love the decor. The light fixtures are unique, and everything is dark, but it still feels clean and cool.   As for the food, it's all quality. I like the fried chicken sliders in particular. It's what I crave if I am craving bar food.   The service is a little touch and go. The servers are quick to take your order, and the food does not take very long, but once you have your food, the servers really seem to not check in too often. It's hard when you need something for your food or need a new drink. On the second visit, my order was also wrong. They were apologetic, but everyone else was done eating before I could even begin.   I will likely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgUCtSaxZ4Mt_3k691UU2A"
  },
  "I6ITktDokXXhTeqXF0pJhw": {
    "date": "5/15/2016",
    "text": "This is a great place to hang... good food, good atmosphere....and Princess Kate makes a great  bloody Mary. Erin, Crystle and Rhea will help you feel at home. So far all the food I have ordered has been good. Just don't steal the Distill glassware.... Brittney will not be happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iaWVOisZziOICieJjsPzMA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iaWVOisZziOICieJjsPzMA/o.jpg"
      }
    ],
    "user_id": "-SISdpV3Q202NW50EISxWQ"
  },
  "1ABpU7A3ZNJUGA0XcwJMUg": {
    "date": "3/17/2017",
    "text": "We're giving them 2 stars because we've been here many times before and the food has been very good. However service on the weekends is always lacking. While we realize it is St. Patrick's and it was busy, there is no reason that we should be sitting at a dirty table  (with the prior patrons' drinks, dirty ashtrays, and paid bill) for nearly 15 minutes, with at least 4 separate wait staff (3 girls, 1 guy) walking by without so much as an acknowledgment. We live 5 minutes away, as do a lot of our friends. We will suggest The Lodge at Cactus from here on out. We will not be back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5YrYeFpreSHssQ5HeXWnQ"
  },
  "eWkYG1GV_t3ww-lT9SuMMA": {
    "date": "2/22/2017",
    "text": "My BF and I visited recently for happy hour, so this review is based on this. Service was pretty good. We were greeted promptly after finding a table (seat yourself). Happy hour drink prices were just OK. I was hoping that cocktails would be a $1-2 off, but no special on those. Just your regular well and cheap beer. We only got appetizers and they were decent for the price. The patio looks amazing (it was cold when we went) so we'll be back for drinks again.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "pOGoWnHqeV_XkW1IEH0TsQ"
  },
  "SFbxelP-p0I_Eu9F_HA9XQ": {
    "date": "9/9/2017",
    "text": "Best breakfast in town! This is by far the best bar in the south west I can not wait for football season here! The food is amazing especially the breakfast ! Nicole and Chelsey are super awesome by far the best in the neighborhood ! Love it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhxvctDejDdqYN6xlbJa_g"
  },
  "qAeNG28giyt0yxS9wVKJ2Q": {
    "date": "3/11/2017",
    "text": "Where is the \"10 star\" option? We LOVE Distill! The food is absolutely fantastic. Every time we go here, we leave raving about the incredible food. Tacos, steaks, beef tips with mashed potatoes, salads, soup, I have never had anything at Distill that wasn't incredible. The presentation of the dishes is beautiful and food delivery is very fast as well. Each person that we have recommended has loved the restaurant, and I'm sure that you will as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "67uIOWOgL4pet_b_COL1Lw"
  },
  "TEoaBDTkIXwRIfKiGjXxeg": {
    "date": "8/9/2017",
    "text": "Love this local bar!! Right next to my house and a must go to in Southern Highlands. Great service and cool vibes. Food is always delicious, I love the french toast and buffalo cauliflower. Nicole and Elliot are awesome too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "grDHKy8_VjXAchUguppoAA"
  },
  "-JiP8tYtxAOlhbYuSo55Yg": {
    "date": "12/28/2018",
    "text": "We've been there twice. They have good bartenders and delicious drinks. We've had appetizers, breakfast, and entree and all of the food was eh. I was looking forward to one thing both times we went in and both times they were out of it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Big6v3kgoqVixTnz8cFSlw"
  },
  "SaQTTIHX9gLvH9UU_jZ9Ag": {
    "date": "4/12/2019",
    "text": "I ordered from postmates and got a Cuban Sandwich Buffalo Wings and a Basket of Fries. Wings were great so was the Cuban Sandwich but was very disappointed with the Basket of Fries, first off there $5 and got them in a small to go box which was less then what the wings and sandwich had in them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I1nE45mPD6Tr8joCfMobKA"
  },
  "oAo8i0zljishikGf7oEFaQ": {
    "date": "4/9/2019",
    "text": "Distill is one of my favorite bars to go to, whether it's in Centennial hills or southern highlands. Food and service was good, thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pUQadsVDKrkK7bTZuJwKrQ"
  },
  "9UMQycuFYRltnIWMdiJtSA": {
    "date": "2/2/2019",
    "text": "Seat by the bar. The sliders are AMAZING. Cooked perfectly.  So why the 3 star? When you are seated by the bar, you expect the one out of the 2 bartenders to check on you every now and then.  Here was the picture: bar not fully packed. Drink requests from other customers - not frequent.  So with all that time on their hands and 2 bartenders behind bar - I had to flag one of the bartenders down 2 times in 1 and half hour I was there.   These guys if they worked any bar on the strip - they would die.   Please improve service.   Food - still good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HeA0Zz-Ly_Af12vv-BIfRQ"
  },
  "O5nNKAXm-cXH1vTZix7Hnw": {
    "date": "7/8/2019",
    "text": "Just updating from my last review... Staff has been great every time I've been in, and the food and atmosphere is still always on point",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "35xJVMXpOqWum7-TlrkIfw"
  },
  "bk0nZn03Gw4PvzMq8uZt-A": {
    "date": "1/14/2019",
    "text": "The bartender Jon completely ignored me to the point it was rude. Terrible service! I left and went to PTS were the staff was friendly and it's so close. When there are others bars so close it's the customer service that makes the difference.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CnXQ4Z0s3TvblzWEJilCIQ"
  },
  "zZv6KCphUA4I-FbEIL9ozQ": {
    "date": "3/6/2017",
    "text": "Love the local atmosphere!! This place is close to home !! Great Food and beer !! Nice  place for music and to hang out !!! John and Elliot are great guys !!   Just want to give a shout to this crew !! We go here a lot and always have a great time !! Get yourself a RED card !!   Food is amazing and service is Great !! We have posted before but just wanted to say thank you to the Team for always taking care of us !!   Atmosphere is amazing with local vibe , music, food and great choice of Beers !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rw8X8kRW7WehIkdUslrXcQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Elliott is a great Guy !!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rw8X8kRW7WehIkdUslrXcQ/o.jpg"
      },
      {
        "img_id": "TNCMcKEG1rOQwkoBR41eFg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Love this bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TNCMcKEG1rOQwkoBR41eFg/o.jpg"
      },
      {
        "img_id": "DtWnLnXN_agjdfoaGF96OA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DtWnLnXN_agjdfoaGF96OA/o.jpg"
      }
    ],
    "user_id": "O7t9GbtERsewRDS-t9cv5g"
  },
  "a3r6t3jeNhZvjTtbJXOZjA": {
    "date": "6/29/2019",
    "text": "We came to this location and we've eaten here several times before. I had a coupon I tore out of a magazine. They refused the coupon due to it stated a location with a code. Nothing on the coupon stating this location only or restrictions apply. We asked for a manager. He explained it was a promotion for the new location. We expressed it doesn't state that on the coupon. We stated it's a marketing ploy to draw and build new customers. We were spending way more than what the coupon offered. The manager hands us a coupon for our next meal at his location. No, we should have been compensated for the coupon we were wanting to use. The food took forever to come out. My steak was tuff and cold. Instead of this chain gaining 3 new customers, it lost 3 customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "viz_uXMoNFdrsO0rYZGUEQ"
  },
  "C9MPU8JtDiK4TQp_ObLD8w": {
    "date": "7/19/2018",
    "text": "This was a diamond in the rough for us tonight! I went on a hunt for mashed potatoes and saw this place on postmates. It was so good! From the sliders that were absolutely delightful to the medallions with mashed potatoes I was in a best food coma ever!   And to top it off homemade bread! It made me feel like I've truly found the perfect go to for my comfort food fixing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6amR7obmvnJWT-D-J6u7A"
  },
  "V_JmEQ68_O0d7yXy0-Fsvg": {
    "date": "5/2/2017",
    "text": "Went to take advantage of happy hour. Had the short rib tacos since I had before at another location. Also had chips n salsa.  Tacos here were not great. Total bummer. The chips were AMAZING! Clearly freshly made there. Service was ok. Also had a tequila sunrise since it was happy hour & recommended. Honestly, not good at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NqtjM1tRVr4f9YlURfCqqQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Chips &amp;amp; salsa. Salsa is nothing special but the chips are delicious! Made fresh there",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NqtjM1tRVr4f9YlURfCqqQ/o.jpg"
      }
    ],
    "user_id": "WvanLjQlrp1OBScCI5o4Qw"
  },
  "zK9vgUgV2i_x8Q2E9XbTQw": {
    "date": "6/7/2019",
    "text": "Love everyone here! Chelsi is the best! She is always spot on and friendly as can be! Totally awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XepYQUHIyWxUQY2MZeL3gw"
  },
  "YZOAB-sEYR7Tc5AxKdm0mA": {
    "date": "12/3/2018",
    "text": "Walked into this bar on a Sunday grave with a group of friends and it was busy! This is obviously an after hours industry bar and RyanG the bartender was on it. Ryan Made sure everyone was having a great time and making winning or losing fun. Next was food and once again we weren't disappointed. Look forward to next Sunday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0ir16xpWfBtu2wSElBllA"
  },
  "1TcvHq6IdMHuHBM079k9-w": {
    "date": "10/17/2018",
    "text": "So we've tried this place three times in the past year and every time was a NIGHTMARE. last year just before 2017 Christmas time we came in about 1am and tried to get a beer and pretzel bites. Signed up for a players card , got a beer each for two of us. There were two male bartenders who both dissapeared after giving us our one beer and someone else delivering our pretzel bites. We had put in HUNDREDS each to the IGT machines and still not even a check in from bartender. After well over an hour after snack delivery (probably hour and half after initial beer delivery) I got pissed and went around bar to other side by bathrooms where the oversize graveyard bartender was chatting with a group of girls leaning over there machines like a king pin and hadn't moved for a LONG time. I told him umm excuse me but I want to close out my check since I can't get any service what do I owe you. He responds with ohhhh  I'm sorry no no no  you don't owe anything because you were playing. Even with the bad service I STILL tip him well and leave with NO intention to come back after such poor shit service and let it go figuring it was a one off. Had a similar experience shortly after and never came back.  Well today (grave 10/17) we came in around midnight after a long day of activities/work figuring hell with it we'll give it another go given it was so long ago. Well, said fat bartender who had NOBODY else in there did give the three of us our beers fast. We had two others in our group join us right after who weren't even drinking. Of the three of us drinking we had two drinks and a simple one shot cocktail. We had one small order of pretel bites and decided to go play pool since we were not game ling and the two non drinkers wanted to play.   This ended in disaster. Nobody EVER checked on us after two very long games of pool (none of us are very good players although we love the game). So eventually one of us went up and ordered a few more drinks from the bar for the drinkers. He said he came out of bathroom and stood by bar FOREVER while bartender bullshited with this group of three that had come in and sat on backside by bathrooms and caught his eye THREE times before he loudly said umm excuse me can I get another round of drinks??? Before bartender says oh oh oh yeah I'm sorry buddy. Keep in mind this was our first drinking stop of night so besides enjoying our game of pool we hadn't been drinking or out anywhere, just enjoying meeting some friends!!!!!!  After second round drinks we quit the pool, two of our five left and we went back to sit quietly at bar, pay our table and finish drinks to leave. When we went back to sit a new group of 3 had come in and start near our old chairs. One on our group  of remaining 3 made a joke with them to break the ice and sat near them with back turned and carried on our own conversation. We paid the tab, tip included and finished our beer. At this point one of the girls in this new group nearby us stumbled by us, plopped drunkenly in a chair and said to her friend very loudly \"I failed the breathalizer outside I have to order a ride\". My friend in our group of  three joked quietly still fcaimg us and I mean QUIETLY with back still turned to our new group of nearby patrons \"yep you failed\". That's it. He DID NOT engage in a conversation or nothing just made a QUIET remark over his shoulder to their loud stumbling drunken comments. Well the fat barkeep who refused to wait on us all this time decided to come running over from nearby and LOUDLY yell for all to hear \"hey buddy DO NOT yell at my other customers like that.\"  Embarrassed as all fuck because we had received SHIT service, been embarrassed and berated while these drunk dumb sluts got served on spot we walked PROMPTLY out the front door. We we're FURIOUS at our treatment especially after our shit service for the couple hours we were there. This fat bartender needs to be FIRED and I want a resolution!!!!! We will be taking this to management!!!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ohCw4z23BeBPMCz5zaGyg"
  },
  "WJOCSzyGUvIaCEYvFVctDw": {
    "date": "5/24/2019",
    "text": "The Jalapeno Popper Burger was really good and so was the Calamari! Service was really fast good drink selection. The location is Southern Highlands seems pretty safe so I felt comfortable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eafBAd2R8UUzWHL6t0AMag"
  },
  "DIjf1Zelam-ZneIJt87vtA": {
    "date": "6/3/2019",
    "text": "I'm here for Dani Dani Dani but Let's talk food too FANTASTIC let's just say not your average \"bar food\" all the servers and bartenders are incredibly friendly and accommodating from the managers Chelsi and Paul to all the girls not your average \"bar\" service either ! Check this place out !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SoIp0QE0-w265U2xRLvDDQ"
  },
  "-b9B7lT4R8VpyFKCla670w": {
    "date": "2/8/2019",
    "text": "Food was phenomenal and our server, Dani was absolutely super! The atmosphere inside is real cool too, definitely will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ROd19MTy8AqVg39oWTMMeQ"
  },
  "k53i2T-gGd1Cdpq8Y47l2g": {
    "date": "10/19/2017",
    "text": "Great little hidden spot. They're menu is awesome with a lot of variety, very reasonably priced and full bar. You can dine in their dinning room which has booths and tables or dine in the bar area which also has the bar top, tables, and smaller tables with lounge/chase chairs. It's was incredibly loud in the bar area so we chose to eat in the dinning room so we could hear each other chat but then went into the bar area for drinks after dinner.   Menu: MUST TRY THE MASHED POTATO BALLS. Omg they're unreal. it's basically a baked potato with chives and butter, mashed up, and fried into little balls served with a ranch dipping sauce and a chipotle sour cream dipping sauce. I we had them in both the dinning area and bar they were that good. The grilled cheese is served on big soft texas toast with a generous amount of fries. I ordered the western burger with the black bean patty which was tasty but i was a little disappointed the black bean patty wasn't made in house so the patty was kind of slim. And of course its served with a generous portion of fries.   Drinks: Very reasonable priced drinks and they also have happy hour! i looked a few of their house wines and the pinot noir is their best quality. I ended up ordering that and was very pleased. They also have about every flavor vodka and flavored rums as well. The bar area is very relaxed with serves in the area in addition to the bar tenders. They even offered us water bottles on our way out the door while paying our check which i feel the gesture went a long way.  Top notch in service and genuine for sure.   Bill: We split the bill, signed for my half of the bill and somehow i was still charged the full bill so i have to give them a call and get that fixed. So may just be sure you check your account before leaving the parking lot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sVeckgbREDZfCr9TtM1GXA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sVeckgbREDZfCr9TtM1GXA/o.jpg"
      }
    ],
    "user_id": "AeGPePY0FG7_Mu0CHck3GA"
  },
  "EuuSIMfPiGwVKceNpdS9sQ": {
    "date": "11/18/2018",
    "text": "We came back here the other night to give it another chance because we love the food here, as we said in our last review. We sat in the little smoke-free room (although we were dying to go sit out by the bar, but still too smokey for us, womp.) The new expanded menu was impressive! I went back to being vegetarian and my partner still eats meat. The vegetarian options here are AWESOME. I ordered the bean and cheese dip, avocado rolls, and in the past I've had the buffalo cauliflower. And my partner had the nachos and some other dish that I can't remember because I was so involved in enjoying my own food, I don't think I even looked up to see what he was eating ha. Their bar drinks are good, a little weak on the EtOH factor, but definitely tasty. Still wish they had a larger beer selection, especially of local or west coast brews. Hopefully with the changes they're making, this could be something they'll work on (please?)     Look forward to coming back here soon :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vqBErKDBU6_6GJHFUE0yQ"
  },
  "mB3dhp3y-uEn4GFIKP1mcg": {
    "date": "8/1/2018",
    "text": "Love Distill!! Great place for dinner. Excellent service! One of our go to places.  Love their fish and chips and their burgers are all yummy!! Avocado egg rolls are a must!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVXWF73eOKxN7iFC2zg8rg"
  },
  "IMeM_WtJCT9YxGn5BSO0oA": {
    "date": "1/19/2019",
    "text": "Just had our food delivered by Postmates. HIGHLH disappointed. I asked for crap cakes sauces to be on side...no side sauces. Plain crab cakes and spring mix. Crab cakes are fishy like imitation crab (expected) but without sauces not good. Husband liked his French dip though. No siracha suave or anything ruined it for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lE28KKcxqyXfkxBXNVS6WA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lE28KKcxqyXfkxBXNVS6WA/o.jpg"
      }
    ],
    "user_id": "cb7oKc_BiVd99d4PMWBIVg"
  },
  "ay3FhkgiKzVMJEWE9ck4HQ": {
    "date": "3/13/2015",
    "text": "My favorite local bar in my neighborhood. Great atmosphere, good service, and an outstanding happy hour. They have a great rewards program too that will get you free food in no time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-URAJU5BQAM2F1_SNna81g"
  },
  "uW1uFaNFy6rYU6ow5R2mQw": {
    "date": "8/10/2017",
    "text": "Excellent service by Erin and awesome food! Both barrenders made sure everything was ok and continuously checked up on us. Shrimp tacos are excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxtaWW8I1m-ht-KjXLddAg"
  },
  "9RkXqy8H3yCHDZtZuxoKdA": {
    "date": "4/19/2015",
    "text": "Big bar lots of room. Watch out for Rheya though. This waitress will eat you alive with her quick wit. Every comment you make she has a counter. Fun times will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HhmWLWbcNBaOYk-wYXgzcQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Big bar lots of room.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HhmWLWbcNBaOYk-wYXgzcQ/o.jpg"
      }
    ],
    "user_id": "rkTWORipKi7m3GzkvpS6Fw"
  },
  "Z-l-mtxgE7mLcZvpYkfTtA": {
    "date": "5/27/2016",
    "text": "I've said it once and I'll say it again this is the most awesome bar in Las Vegas.  I love this place.  The staff is out of this world.  They are friendly, they make you feel welcome, and always make me want to come back again.  The food is phenomenal; not your average bar food.  If you've never been here, trust me you won't be disappointed. The only reason I gave five stars is because six stars is not an option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9K0fZeOG8onVzG5JZRwQkA"
  },
  "AHxJ8a9P8J-FCAqyYtlC1w": {
    "date": "2/9/2016",
    "text": "Elliot is the absolute best! Come visit, ask for Elliot and you will not be disappointed! He ALWAYS takes care of me and my group!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0riGDpjLwqqD796_TbXkg"
  },
  "YvMEi4qrUVXLfq8v3bsgKg": {
    "date": "3/21/2017",
    "text": "Food is terrific so I have no complaints there. Over the last week, I've visited Distill at least 4 times. Each time, I've grabbed a bite to eat and played video poker. On all of the previous visits, my drinks were comped including a visit earlier that day. When I came for dinner, I bought a friend. We ate dinner and when we got the check, I was charged for 1 of my 2 beers. I'm not upset that I was charged but I'm upset that I wasn't informed ahead of time that I was being charged. Inconsistency and lack of communication impacted the tip. I'm one that regularly tips above 20% but think I may have left $2-3 this visit. Great food but not sure I will continue to visit. I also went to Fireside and the food is just as good with a better beer selection which is free while playing. Gonna miss Distill because I really liked the place.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zMrNnCiUtdXLOj1lJwsJLg"
  },
  "RmOXmmODD3D7LoGx_Kkg0g": {
    "date": "7/16/2014",
    "text": "Was here last night for a Family Soft Opening. This used to be Carmine's but was gutted and looks great. Plenty of TVs to watch the game.   The food and drink selection was excellent. The \"Mad Mule\" was a great cocktail. Food was excellent, very large portions. I enjoyed the Chicken Salad and it was delicious.   I have high expectations for this bar. Hopefully becomes the new local spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O28AiIhdjmCeW8eOZNMr7w"
  },
  "PP6Y5GrdcM53Lt1jX6PLxw": {
    "date": "3/27/2016",
    "text": "Great service and the food is always great. It's quiet so we can visit and when you ask for certain items they always take care of you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0Jn0ZjqL-dWi7Brs0bbmg"
  },
  "YwkZVuwQNBz2eTxT1WXw5g": {
    "date": "3/19/2016",
    "text": "Friendly bartenders and amazing food! Jen was so nice! And the pickle fries are <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y4hZEeaoTjKhB1-NJyad1g"
  },
  "_4OwtSU3pv5x6horz8UyEA": {
    "date": "7/11/2017",
    "text": "Eliot and John are amazing, Brotha's from anotha motha!!! They were awesome!!!  I am used to the awesome service from Remedy's in Henderson, In which Patrick, Chad, Sean, Ryan are amazing!!! They recommended Distill which is owned by the same company and closer to my home.  That being said, support our local businesses, PT's, \"The evil empire\" is building restaurants on every corner, the McDonald Monopoly effect.  Literally, PT's will go into an establishment and offer the owner 50,000 cash to put their machines in.  In other words, you might not be at a PT's per say, but they have a hidden control, monopoly effect wise.  Golden gaming  owns PT's, and indirectly owns small business owners with their machines in their establishments.  All in all Distill is my home away from home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "on19NnW9ezK6BnZt8K2hmw"
  },
  "P5vIyMdSoSvDrfdz6VJP4A": {
    "date": "7/9/2017",
    "text": "Distill is just the best!  Great bartenders!!! The food is really good, the drinks keep coming, gaming is fun!  But really the company is the best!  Highly recommend. Ask for Eliot, Erin and Nichole.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c176SUBBDVy1MZhgUIIs-g"
  },
  "EYmkepHdeeNibX5k8atnug": {
    "date": "2/9/2016",
    "text": "Great food great beer and great service!!! The food is literally restaurant quality at a bar any hour of the day. Wide selection of beers on draft and bottles. John and Elliot are awesome!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yg2bypj1eWvtQPN6dlx44g"
  },
  "n0Fa3TV4LLd--x5fT3xZgg": {
    "date": "8/27/2014",
    "text": "Great addition to the southern highlands area!  Food was just ok, clearly a lot of frozen stuff and service was a bit slow for the place being empty when I went. But that said, I'm excited to go back and try some other things!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5P9jQUbG-uFNNJKD8c7KA"
  },
  "JhazYBgv4rYQCCyZjCvamA": {
    "date": "3/30/2016",
    "text": "Food is good, they have gaming, pool, buck hunter etc. it's a fun place on this side of town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFyOUOeGTRZhFPF9uTqrTQ"
  },
  "SvR-2G-FlVln1IS0b0BxLA": {
    "date": "5/28/2016",
    "text": "Nice sports bar! Came in time for happy hour and food is decent. Service was attentive and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vv4nzt3ygkA_bnaC1Qufbw"
  },
  "i5WOkuj7oDuZxFKLKjxljg": {
    "date": "3/4/2017",
    "text": "This place continues to impress. I just discovered my favorite new drink on the menu (the name is awkward so forgive me) the \"slippery when wet\". It has watermelon and it served up in a Martini glass and is very refreshing. The staff is always very friendly to everyone, especially Eliot.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ICNAt-xmlr3kwDpNocuOzQ"
  },
  "hA78VWy7gUQ0w1YrMZHxTA": {
    "date": "1/12/2016",
    "text": "Great venue to have some apps and drinks in a low key/chill setting. We ordered the calamari and mashed potato bites, both very yummy. The Irish mule I ordered was just ok. There was a large group of young and loud (obnoxious is more the word) guys and girls who were overly intoxicated sitting at the bar behind us and were so over the top we left after the following series of events. My boyfriend had gone to the bathroom and I was approached by one of the guys from this group not once but 3 times creepily trying to talk to me about hooking up with him. When my bf got back to the table the guy hit my head with his arm (not sure intentional or not) but when he was asked to be mindful of his surroundings the creepy guy almost started a fight with us. I've been here many times before and never had a problem and food and drinks always hit the spot. My only request is that your staff be more aware of the customers and how intoxicated they get, as well as if they are in a smaller area where they are encroaching on other guests seating area to be mindful and maybe move them to a space that fits them. We were sitting by the fireplace and we were there way before this other group came in.  Just realized this is for southern highlands location when it was meant for summerlin. I do apologize but it won't let me delete.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZaTExw4m0O25mKrcsW5A6Q"
  },
  "cHBDXVYzx2gRGd9wM2Z-nw": {
    "date": "4/17/2016",
    "text": "This used to be a Carmines gaming bar which was closed down for ages. Distill is a much welcome addition to the neighborhood. It does get very busy, but it is a nice place to relax and have a beer. Can get a little smoky at times. The food is typical bar food, good enough and the staff have always been friendly whenever I've been here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMyARv0J3NZpHH5Vbx0pLg"
  },
  "QS-u_lXOXRnazvhT_OTueQ": {
    "date": "6/11/2017",
    "text": "Great environment, friendly people, and good food.  Seared Ahi Tuna is my favorite.  If you're in the area you should definitely check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rEELLTRzxbGKW6zgK1rlGA"
  },
  "iFpHcvlV0qNRnhL80Ojnxw": {
    "date": "7/27/2014",
    "text": "Not a bad little place, we've been 3 times now since it opened and haven't had an issue. The food is good, very reasonable prices, beers are only $5 for a tall domestic. Nice decor, and plenty of room for sitting or hanging out. Two pool tables and a TouchTunes for music. Happy Hour from 3-6pm & 3-6am for all your drinking needs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a-GQO7EZfbv8EzXdQvTYVA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a-GQO7EZfbv8EzXdQvTYVA/o.jpg"
      },
      {
        "img_id": "-ni2s2uk12MbmUneapqieA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-ni2s2uk12MbmUneapqieA/o.jpg"
      },
      {
        "img_id": "we_ahFd9vaSsikTokURM7w",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Country Fried Chicken Sliders",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/we_ahFd9vaSsikTokURM7w/o.jpg"
      }
    ],
    "user_id": "hOUXgXGHEBbleF01CTULIg"
  },
  "IDslxI0E78dQwBvSwncjOA": {
    "date": "2/24/2015",
    "text": "The hamburger was great and the beer is ice cold! This may be my new spot. I have heard good things about this place from friends before so I gave it a try. I highly recommend checking them out of you haven't already.   PS.  The bartender was cute too",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YcrhR6TQvZ54QmRy9MZu9A"
  },
  "kmarkE-qTT5Sb45-I-UDNg": {
    "date": "12/3/2014",
    "text": "I've been visiting Distill for a few months now, and I have nothing but good things to say. I'm here mostly for the pool tables and Sunday Ticket however the gorgeous interior and friendly staff are equally important. Tonight, a very friendly server named Maria motivated me to write a review because she made me feel right at home even though I wasn't ordering anything. The crew is great, drinks are reasonably priced and the pool is cheap. Come check it out!   Bonus: this joint isn't smoky like most gaming bars, it's really well ventilated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hYUFOAGiXCiifyynS2XT5Q"
  },
  "5bKBftY8KiUbSBGZQ_-ufw": {
    "date": "9/4/2016",
    "text": "First impression when u walk inside was the bar was pretty and looks like a chill place to hang out. However, there was definitely a lack of service. We walked in and sat ourselves at a table. The bartenders saw us walk in but no one greeted us. We waited for at least 15 minutes until someone went to our table. We went here on a Sunday afternoon so it was pretty dead. We contemplated on leaving to go to another place because no one bothered to check on us.. Not even a quick greeting to tell us that someone would be with us shortly. We ended up staying and ordering food & drinks. The server was not bad, she was polite but the service was very slow.  I ordered a margarita from their speciality cocktail menu.. Probably one of the worst margaritas I've had in while. Overall, the place has potential as the inside looks good. The experience was not so great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8KD7lYCfcWssj7HxcJpp1w"
  },
  "fskwwfvOTlLIwv0EQ08mXw": {
    "date": "9/7/2014",
    "text": "Walked into Distill and thought we'd walked into Eden. This is my first and last visit. Decent prices during football hrs so we were planning on being there at least 3 hrs. Until about maybe 30 mins into it when I was asked to move from a unique (1 of 2) machine at the bar so a woman (who had just won and cashed out a decent amount, I can assume at the other,) wanted to play where I was sitting. Not one for playing a a machine while my hands are dirty, due to the appetizer sampler that had arrive 5 mins prior, I was waiting to play until finished. Though my boyfriend next to me was playing his machine, and having already been asked if we were playing, I was asked to move to a different seat. Thoroughly upset I was too polite to say no and speak my mind.   Felt it appropriate to add as well the women's restroom was in poor order. One of the two stalls was not only out of paper but had toilet seat covers covering the floor of the stalls. As accidents and people happen, I would have not paid attention to this if weren't for the fact I could hear myself even speak out loud due to the loud music. I don't often mind this being in my mid 20's but really?  As good as the food was (reason for the 2nd star), and as regular as we would have become living and working just down the road, we won't be returning. Which is saddening since Molly's closed and the food was good.   Don't expect to stay in the seats you may choose or get common courtesy in this establishment unless it's from Brianna.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "f0m9xU75ZyRq9uKnQqsxbg"
  },
  "LKoFtTQ0kNpV2_iX_nTYsA": {
    "date": "8/2/2014",
    "text": "Ive been to the one in Summerlin and really dig the layout and patio especially and was/ hoping they did something similar with this location....nope!   Walking from the side door that said restaurant entrance i felt like i was put in time out as everybody was in and around the bar and i had to eat in the glass bubble. I can appreciate this was to separate the smokers from the non but still a little weird layout as it really looked like i was in an aquarium by myself. The service was just ok, a little too much standing around and gossiping for me (should be done out of sight of guests). And the food is similar menu to Summerlin with basic bar food and nothing that really screams.... gotta come back for that except the dessert. Bread pudding ... YES! no raisins...YES the the 3rd power.   Id come back but not that often... id actually drive to Summerlin from SW to have the layout and atmosphere more comfortable then to come back to this location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "LvLaYXjvzdrPDXC3Zv3XoA"
  },
  "VIJUTliM4U7gkgE6aZqOhg": {
    "date": "5/25/2016",
    "text": "Service was very quick and attentive upon entry. Grilled fish tacos were delicious and French fries were crisp. Overall a great experience for bar food and drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SyLWNhVp2PSVKWDN_Ukdpw"
  },
  "bK4AAyM81Rekys5wvUObGg": {
    "date": "5/26/2016",
    "text": "I was excited to check out the new place... Guess we'll have to try it a different time. Unfortunately no one answered the door last night after ringing the bell a couple times (it was after 12) and hearing people laughing inside. Looked nice from the outside tho.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MuLPdU0GYhdGWV71PTJW-Q"
  },
  "YrYjmnvOOnpR_T5fbaMqhA": {
    "date": "4/12/2016",
    "text": "When first Distilled open it was was great! Good food and service and gaming, but now that its popular the gaming is just terrible!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EBcdHxTafAgyRWOyn-Df0A"
  },
  "rclxlWxTvZeeJ81wGOBj9A": {
    "date": "5/13/2016",
    "text": "The staff is stand offish. Boarder line inappropriate staff comments coming from bartender and staff members. Will most likely card you if you are under 50 years old looking. Very smokey at times and will most likely come out of Distill smelling like an ashtray.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A4NE4TzA5323c9m9nbayJA"
  },
  "M5FvqM-Xwu8Vpm6B1HDgYQ": {
    "date": "8/14/2014",
    "text": "On the next episode of Cougar Town...I mean wow, this place is it in Southern Highlands for social action. Place was packed!  Used to be an Italian place which was pretty bad, Distill certainly upped the ante with the whole reclaimed wood, Edison bulb feel that seems to be the go to look for a restaurant that wants to be \"different.\" Layout is clean, good place to watch games with multitude of screens, pool tables, and an enclosed dining area.   My food experience was a bit of a letdown though. Had the fish tacos with it being rubbery and over seasoned. My wife had probably the most disappointing fish and chips ever--soggy and greasy. I mean, it's fried guys, hard to mess up. We have a theory that it sat at the pass and just drowned in its own oil. The positive was service where they recognized our displeasure and comped us the meals. I'm going to give them a pass and will try them again, chalk it up to it being new.   Anyway, they are trying. Next time I'll just sit at the bar, have drinks, and enjoy the view...rraaar.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YLiMJ0xeWxqny9O9YKzoA"
  },
  "VXoJR2ZCO23erOIL9GkAtQ": {
    "date": "6/8/2017",
    "text": "Just had a horrible experience. My boyfriend and I came here to gamble and grab some food. It wasn't packed but a good amount of people in there. We found machines to gamble out right away. The bartender was friendly we ordered drinks and food. The problem is when the food came out. I got a western burger the bacon came out barley cooked it looked raw. My boyfriends food came out with a bug on it! It was dead laying on his plate in the middle of the food. It took us a couple minutes to flag down the bartender and we informed her of the meal. She grabbed the plate said eww and what do you want me to do? Grab you another one or just take it off. At this point we were so grossed out we just wanted to leave. We grabbed the bill and the food with the bug was still on there. I had to ask them to remove it. No one ever said sorry about it or a manager didn't even come talk to us. We will never return here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0m7CDy76OonQYgU0dl9wag"
  },
  "cU-IoxjsLgXSHJVNtQWURA": {
    "date": "7/16/2014",
    "text": "I would have given this bar 5 stars but finding this bar was so frustrating!  My mapquest took me to a residential area in the middle of nowhere on W Pyle Ave.  I had to call Distill in W. Charleston to get the cross roads.  So for those looking for this local bar......South Decatur and W. Pyle Ave.  Whatever you do.....keep heading south on S. Decatur until you see Distill sign on your left.  Anyway, the service was really good.  Our waitress,Danielle was very attentive.  She made sure our glasses were full and our plates were cleared when needed.  As for the food, I really enjoyed the fried mashed potato and the grilled chicken with vegetables. The chicken was very flavorful!  The vegetable was cooked just right!    As my stress reliever drink from getting lost trying to find the bar......it was so soothing and comforting that I forgot about being stressed out!!  LOL ( I had the Cinnamon Apple Sour- Infused Orange Cinnamon Whiskey, Redd's Apple Ale and Sour.)  I enjoyed my dinner and service.  I would recommend this bar to my friends and family.  Looking forward to visiting again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "JFnNd9Ak1E0mHv5_IT5vSw"
  },
  "y4EClhloyJwUz5IJVnvXXA": {
    "date": "12/16/2016",
    "text": "This bar is very friendly with good energy! Food is good although somewhat slow when it is busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FYf0Tc6FRSkuYoFxuXQlFg"
  },
  "Tg82FytIhTLxHsH8QLPEOw": {
    "date": "1/21/2015",
    "text": "First time here, loved it.  My only complaint is that I came with the family initially and it was unclear that they served families.. So we left at the door, thinking it was 21 or older.   I came back to try on my own and enjoyed thoroughly.  Who knew you could get good fish and chips in Nevada!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBhaCEcdbdDv76kMwm8Nng"
  },
  "yIFooJCbm3aiw33323pyoA": {
    "date": "7/26/2014",
    "text": "I've been living in the area by South Point for the last couple years and haven't had anywhere nearby to hang out since I'm not really into the casino and tourists scene.  Distill's changed that for me, though!  Minutes from where I live and a great atmosphere.  You've got a good-sized bar in the middle, some tables and lounge-type chairs along the outside walls and a couple of pool tables just outside of the separate dining room area.  I stopped by for their grand opening last week around midnight.  Missed the main crowd but it was still super busy.  Despite the volume of people I had no trouble getting up to the bar and being served in a timely manner.  Went back again today for lunch and tried the Western Bacon Burger with fries and washed it down with the Redd's Apple Ale they have on tap.  Delish!  I've only been waited on by two people so far, one of them my friend Kristina who's been serving me for close to a year now, but it seems like everybody on the staff is on top of their game, friendly and happy to work there.  That's a big plus because I've been to my share of bars in this town where there's drama going on with the employees and employers and that just kills the vibe for me.  Distill's a great place and one of my new favorite hang-out spots!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dpr6pJo-OkayVuoYkmf2hA"
  },
  "VTnqn7cuhTI6j4D8VbzScw": {
    "date": "4/22/2015",
    "text": "Aj was the absolute best. So nice and very good service   The vibe of the bar is really chill, love playing pool there",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6sQNb0V0mQs5v0o-2LuDQ"
  },
  "q7NgGDsVdQHZryKqA5RORQ": {
    "date": "7/27/2014",
    "text": "Eh ok. Sweet atmosphere (5 stars). Ordered the pretzel bites, total FAIL. These are the same frozen ones at the store I microwave at home. Chips and salsa, chips are super stale and salsa is super good. Lol! Go figure. Do yourself a favor and get the pretzel app at Molly Malone's or Black Mountain Grill, both freshly made. Otherwise this is just another bar with bar food, so 3 stars. It's pretty blue collar.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CQ3LVoY-R6jyL2syBYTHuQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Happy hour daily",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CQ3LVoY-R6jyL2syBYTHuQ/o.jpg"
      },
      {
        "img_id": "htGFl2AhGCdVZXyZyKZnag",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/htGFl2AhGCdVZXyZyKZnag/o.jpg"
      },
      {
        "img_id": "bmbkM1hfUDdpdw1AOP7vmQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Bar seating",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bmbkM1hfUDdpdw1AOP7vmQ/o.jpg"
      }
    ],
    "user_id": "vg5nkkwchEPASXDSQsNHwg"
  },
  "vyY7Gs1McTaSNuRePVv6-Q": {
    "date": "8/1/2014",
    "text": "I heard that Distill was opening in Southern Highlands and was excited to have another option for food and cocktails in the South West.  The atmosphere was beautiful and really fun!  The service was great and we had a few people check in on us as the night went on.  We ordered cocktails and a few appetizers and I was impressed!  The cocktail menu was a little different and right up my alley.  We ordered the street tacos (which were some of the best I have had in a bar type atmosphere) and the mashed potato bites (so decadent and delicious).   I'm happy!  We will definitely be back.  Next time for happy hour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QRn8ELZmvP8S4evnSRU9bQ"
  },
  "HboKdAIKPyaGaknn4QEtrw": {
    "date": "10/7/2017",
    "text": "Thought this place got better. I was wrong. Must of just went on one of their FEW good days. Done trying, looks like PTS it is!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aat7AAw1PVLaM2AhHd9MAQ"
  },
  "f97tkqafdN8iCNBJnm3VlQ": {
    "date": "2/27/2016",
    "text": "The decor is cool and has a relaxing atmosphere. Great music selection. Happy hour is twice a day, 7 days a week and has a decent selection of food and drink specials. Service is average at the bar and somewhat tolerable. There are two bartenders; but only one actually took my order, gave me my beer, and asked how the food was. I order HH priced short ribs tacos which were tasty but dry. I might try this place again to see; if I have the same experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bxPlCsoHCIOrBl0wmno4Wg"
  },
  "zyHlptcaSGAPbO9a8cwfHg": {
    "date": "6/11/2019",
    "text": "This is an amazing bar, especially on grave yard. Ryan G is fun and on his game. I have never been in here and it hasn't been packed with industry. Great energy, amazing crowed and awesome food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5IBBZS7EvG4yZBrxvqsH3A"
  },
  "-87eEVXBFy9i1bFBDLIasw": {
    "date": "2/24/2019",
    "text": "Great spot for a drink near home. Always a good atmosphere and dun people. Tried the Cuban sandwich and it was delicious....a must try. The artichoke on happy hour was awesome and something I would have again. Great happy hour prices!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QWnPrgrrS5YtRON9GWdMqw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QWnPrgrrS5YtRON9GWdMqw/o.jpg"
      },
      {
        "img_id": "kVlvBgKZzP4iv8g94Zqdfw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kVlvBgKZzP4iv8g94Zqdfw/o.jpg"
      },
      {
        "img_id": "iUlMcu44Xxv-vuKGk3s97g",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iUlMcu44Xxv-vuKGk3s97g/o.jpg"
      }
    ],
    "user_id": "tQ_37kagDfucvT2_Kn7DaA"
  },
  "4BX0rRVRN0X1mWg5vieIng": {
    "date": "3/14/2019",
    "text": "Idk about anyone else but I don't expect mold when I order a burger. How do you even miss this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ssMyrqtfSZI5bg4NvsU9nA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Moldy burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ssMyrqtfSZI5bg4NvsU9nA/o.jpg"
      },
      {
        "img_id": "6mwMhSNHuYPdXJwC816yXQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6mwMhSNHuYPdXJwC816yXQ/o.jpg"
      }
    ],
    "user_id": "I7qUhn_SBcANEULT-fZ5kQ"
  },
  "DbRL7ZibkTg0IUc8q0-3gQ": {
    "date": "6/22/2019",
    "text": "I ordered buffalo chicken sliders with fries off of Postmates. I paid $18 for sliders that came with literally only a small chicken tender in between the bun. That's it. Nothing else on them. And on the side there were 11 fries. I counted. ELEVEN. 11 fries that were cold and stale. I'm very disappointed. Save your money and go else where for food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YqGxtfGtcDQuKmSDnL-ZNw"
  },
  "YPvGGMJEV-vltQAZiU5qlw": {
    "date": "6/1/2019",
    "text": "Great food, quick service, and plenty of options. Deep fried Oreos were amazing. A good hangout spot to watch sports games and play video poker.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5cwkXRcKRjqNHNCq2ouuhQ"
  },
  "bV5s85dr794pQj6y3tuJKQ": {
    "date": "1/16/2019",
    "text": "Love coming to this bar for a chill hangout with friends. You can sit in the bar either on nice comfy couches or directly at the bar and play machines. If you are looking for a little more privacy there is also a separate dining area more ideal for dining. They offer a couple pool tables. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DfMMunsk4Kg3EJpFJakwDg"
  },
  "jYQYlQJRvecoZzQ6a8DD3A": {
    "date": "7/10/2019",
    "text": "What an amazing bar right in my neighborhood. Me and a couple girlfriends heard about this bar and wanted to see what the hype was. Let me tell you we weren't disappointed at all. Ryan the Grave bartender was amazing. Totally fun and made us feel like we were one of the regulars. Even his Chef Aaron was above and beyond. I will be back next week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8oo36F3jrYVy7BkbQrmqxg"
  },
  "KE1eiWM-SXqM9V9vO0iXQg": {
    "date": "6/21/2019",
    "text": "Sweet little local bar with great food & cool bartenders. They also deliver thru diff food delivery apps.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHz7cn9zP4l8h1PByYcF-g"
  },
  "ylVaaMKQo9DZtok-pbMxLg": {
    "date": "10/29/2017",
    "text": "Sports bar in the neighborhood with happy hour and pretty darn good food!    Been here a handful of times and have tried new foods every time.   This past time, I had DELICIOUS pot roast egg rolls. Yes, you read it here -- egg rolls stuffed with mash potatoes and pot roast. All of which, you dip in gravy. It was so yummy even without the gravy.  Buffalo cauliflower was pretty tasty, as well.  Basic Greek fries, chicken wings.   TV screens everywhere! Great for sports watching.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "gUcEqz4nKXbgsKJsxseWVw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Pot roast egg rolls = MUST EAT",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gUcEqz4nKXbgsKJsxseWVw/o.jpg"
      },
      {
        "img_id": "lfT3akXD5uFIZiwHmLmaww",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Buffalo cauliflower",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lfT3akXD5uFIZiwHmLmaww/o.jpg"
      }
    ],
    "user_id": "uERlyO-ASZag6XXouCrkhg"
  },
  "CnWMGVnfZWxU-bP8IyOsxw": {
    "date": "11/14/2018",
    "text": "I found this place as it is very close to home.  It's a nice relaxing little bar with wonderful seating and games at the bar.  The staff is super friendly and drinks are great.  We had the brisket sliders and wings.  The sliders were incredible.  The wings did not disappoint.  Highly recommend this place for a nice get away close to home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "khC-KFL_z77NwaQXyoDBGQ"
  },
  "SwxjxT3BxSBfFqo-4MAirg": {
    "date": "10/28/2018",
    "text": "Ordered the Beef empanadas and Ahi Poke Stack. The Ahi poke stack was good but the bad thing about it was it literally  came with 9 chips lol... The beef empanadas tasted good but not much filling. Overall ok food",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0Z5iz30WZJvxVL0AjA36XA"
  },
  "X-nuhu0N71pJb2f3OLS2pA": {
    "date": "4/8/2018",
    "text": "My first time here and I'm very impressed.  Great menu (unlike a lot of other local bars), great atmosphere and they have a lot to offer.   Erin was our bartender and she provided me with the Lovelady Golden Knights beer and the pot roast stickers.  Soooo good.   I'll defiantly be back here as I wasn't expecting to have such a enjoyable experience in a bar located in the middle of a desert around a bunch of homes.    Very cool",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "keBv05MsMFBd0Hu98vXThQ"
  },
  "C29dsgu_EdRVw30fHc-JiQ": {
    "date": "4/16/2019",
    "text": "Never again!  We have been going to this bar since it opened.  I have always had a great experience. Spent a lot of money, drank and ate dinner.  I don't know what happened to the \"If you are playing you get free drinks\" rule but it is gone now.  I put in over $60 and was winning. Plus I always throw a $20 tip out just to keep the drinks flowing.  My husband put in $80 and lost it.  We get ready to leave and are given a bill for $128.00 for our food and drinks!! Our food was basic wings and fries which we planned on paying for, of course. I was told I had only gambled $40.00 and they didn't see my husband gamble. We were required to pay for all of our drinks at the end of the night.  I paid it and told them we wouldn't be back.  I guess if you are winning, you have to pay for drinks. So disappointing.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMsWv3BIHZDcYxR-utYURg"
  },
  "tkK91OaDmvyGke11XkMs0Q": {
    "date": "7/27/2019",
    "text": "We always go for the food. Food better than the other bars in the area, but if you get food for pick up, check your order carefully, they always forget something.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "294_npQI1ceto_vGeRyYLg"
  },
  "CGq2tET0FDyXop92qDxJoQ": {
    "date": "1/10/2019",
    "text": "This place is not your typical neighborhood bar. It's steps above the rest. Great food and even better service. Stop by and ask for the Chelsi special!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4wAWq6A0Q37P7CMlfRRxvQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4wAWq6A0Q37P7CMlfRRxvQ/o.jpg"
      }
    ],
    "user_id": "lIfDW38GxOkEgaio_2j29Q"
  },
  "mRiK_Ui-KyadEujkjZ2LGw": {
    "date": "3/27/2018",
    "text": "Came here around 8:30 pm on a Wednesday night. It was pretty full for a weekday. Then again, that was my first visit so I'm not sure if they get more packed than that lol. My friend got seats right by a tv for us.   It was a little weird because I didn't know if we were supposed to order at the bar or not since I couldn't tell if there were any workers actually waiting on tables. It took a little while for her to get to our table, but she eventually got there. Their menu is pretty big, plenty of things to choose from! I never crave burgers... ever. But I glanced at that part of the menu and was suddenly craving lol. I opted for the western bacon burger (or something like that) with sweet potato fries. & my friend ordered a (chicken?) quesadilla. We also got a couple or Jameson & ginger ales. Honestly, the burger was goooood & so were the fries. The burger was a little too drenched with bbq sauce but still very tasty! I'll probably get it with bbq sauce on the side next time or just tell em light. The fries were perfectly crispy.   Service promptness was okay but very friendly! I will definitely be back to try other things on the menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WPcEBAbrPZxvCGlvH9XLsQ"
  },
  "6xEOtr1xsQ5kwRalo1FuGg": {
    "date": "2/27/2019",
    "text": "Worst treatment ever. Came here for my Husbands going away party food and drinks are good as is the atmosphere. However, the treatment me and my guests received from the bartender was completely unacceptable. We had over 30 people there that we brought in the party. Easily spent over $700 for everything. After being there for probably four or five hours, one of the regulars began to sexually harass all of the females in the group. When one of the females stood up for herself, the regular became aggressive. At that point the bartender, instead of standing up for the females that were getting harassed, decided to tell off and cut off the female claiming that she was harassing his regular and that we needed to leave. When I came up to ask the bartender what happened and to explain to him what the regular was doing oh, she got an attitude with me. Multiple times trying to contact management and let them know what happened and just got the runaround from management. It's a shame because this place was a great place to go. But I will not give a dime of my money to a place that does not protect Women or even attempt to rectify a bad situation.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZjN7a4JT_rw8Lx7foatiWA"
  },
  "RHk0I6MRb3t7qNPDj6wIyA": {
    "date": "3/13/2018",
    "text": "This place has a great atmosphere and the lighting and seating is perfect for dinners and get-togethers. It's also kid friendly!The staff are always friendly and accommodating. I definitely love the menu and the consistency in quality and taste.  The pot roast spring rolls are a must! Packed with pot roast flavor and crisp pastry. I order these everytime. The Mashed Potato Bites are also amazing! I've like the Jalapeno Popper Burger. Very delicious. The cream cheese and bacon toppings are so good.  The Pot Pie is flaky and the roasted chicken and vegetables inside are delicious. Definitely up there with chicken pot pies of tried. The fish and chips are not bad. My gf likes to order them here. We never have room for dessert! We once made it 1/4 into  Bread Pudding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f587WkOuLAotgXOVAybylA"
  },
  "glbw4uaYiQWGnlRgVzBqSA": {
    "date": "5/13/2019",
    "text": "This is the best bar in our neighborhood. I go when Sean is working... he is great and always a good time. The food is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUsqMdlKx2chmzlZMN0ihQ"
  },
  "LUZiCl8A3zGVStxHG46QzQ": {
    "date": "8/29/2018",
    "text": "When you first walk into the restaurant area, you need some time to adjust your eyes. We were greeted by Aida, I apologize in advance if I'm misspelling her name. She was wonderful! Very attentive and even brought us a lit of Sushi places that her coworkers recommended for later in the day. I originally thought they still had cheese curds on the menu, unfortunately it was an old yelp review that I had seen them on, but she talked us into getting the mozzarella sticks instead and they were just as satisfying! We ordered the gyro to share, which was so good and a salad which tasted so fresh and yummy! My 4 year old had the sliders which she gobbled up. Very awesome food and amazing service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hfYQFS4q502frraNsnn14g",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hfYQFS4q502frraNsnn14g/o.jpg"
      }
    ],
    "user_id": "xwNBTsI6BBwU-O10IcZw9Q"
  },
  "apjkQdTBUQ9JEqXyA0JfGg": {
    "date": "10/24/2016",
    "text": "MNF Review- I'm here more often then not for MNF for the last two years. I've noticed on more than a few occasions that the bar staff gives the giveaways/raffles to their friends then to actually draw and announce the winners. It's kind of disheartening to see this and is happening more frequently now then last year. Let's keep it fair for all your patrons that come and spend money at your bar. Just happened again tonight at the Broncos/Texans game. Never heard one announcement by your female or male bartender.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "4Yj3uQBzdP8SFxxAkOnxgw"
  },
  "b0Y15eUXv2P2EV2DK2KPlQ": {
    "date": "10/26/2016",
    "text": "The bartenders here are just down right unfriendly. We are locals. Most of us in the business. Lighten the hell up. I've tried three or so times and I have given up. I'll take my money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B0HqRf0IzytfenpG2-VwLw"
  },
  "vn2gf0bkMMQ8Km9LEZ504w": {
    "date": "4/28/2015",
    "text": "I love this bar! The food is fantastic and the service is great! Everyone that hangs out there is really nice and it has a very comfortable vibe.  They treat their gamers right, and that means a lot to me! We always have a great time with Eliot and Jon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "iQXOTWoxXv1594HJ0UGddw"
  },
  "ig7pIayePWeyOJ17mJxeMg": {
    "date": "2/6/2015",
    "text": "After starting an episode of Pretty Little Liars @ 5:15 I found out HH ended at 6. So we grabbed our shoes and rush down Blue Diamond to get our HH on!!! We arrived around 5:35ish. It was a Sunday and the same playoff game was on every TV. We walked in and it was really loud, I'm going to assume it's because of the playoff game, because after it was over i could actually hear our waitress and talk to my party without yelling.  We came here as a group for bro beers. We grabbed the big chairs and put them in a circle with two tables in the middle for the apps. We started with chips and salsa and a personal pizza. The chips and salsa were a good choice nothing crazy special but it was perfect thing to keep me from ordering all the other delicious looking items. I was trying to be good. However, i tried the pizza and it was yummy. We order some HH drinks and started the night. I started with a vodka redbull. They have nice heavy glasses. We joked when it was close to 6 that our waitress was avoid us. She came back right at 6 and said she had a large party and she would add another drink for HH. NICE! After everyone showed we just chit chatting and looking around. They had some really funny signs. One of my favorite was the big D that pointed to the bathroom. hehe, I thought it was funny. After a few cranberry vodkas I had to use the bathroom, I walked in and thought I was in a club. The music is super loud in the bathroom. I just couldn't understand when it transformed into a club. After walking out of the club I noticed they have Buck Hunt!!! I am awful at the game but it's super fun. I wish i would have had some cash to play. Distill was a fun adventure that will defiantly be had again.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "gNtluRqUceMt6VuVZPVrpg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Chips and salsa. $1.95 at HH",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gNtluRqUceMt6VuVZPVrpg/o.jpg"
      },
      {
        "img_id": "WUk1gitx7tkKw3w9-cgGYg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Vodka redbull during HH",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WUk1gitx7tkKw3w9-cgGYg/o.jpg"
      }
    ],
    "user_id": "MZ70U0pR16IiZEfxVmkyyA"
  },
  "1TXR0v0jSf9dRbAANC2Omw": {
    "date": "5/4/2015",
    "text": "Close by to my house, being a fairly decent spot to eat at, it's definitely fun and have enough tv's and slots to hangout at",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NJxfyWtbOi9WDxAvfgqLIg"
  },
  "DdGD971iTXSWxaLtbdvLTw": {
    "date": "12/24/2017",
    "text": "Came Sunday for grave got cracked bread it was really good. But the best thing about the bar was the bartender Ryan.  He was so polite and respectful even made sure i made it to my car. He went above and beyond will definitely be back only if he is working!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0QlagmjiHe4vlS-F6JlCw"
  },
  "Lylbfk6aPI2jE4l6ZDR8OA": {
    "date": "4/28/2017",
    "text": "This is my favorite place for food in So Highlands BUT.... What happened within the last two months?  The food has always been delicious.  I eat here often.   Now, the food is always overlooked.  Pancakes, always dry and burnt. Ordered pancakes at least five times in the past, and always so bad.  Last hamburger bun, burnt.  Meat so over cooked and dry.  Beef tenderloin skewers, so overcooked and dry, couldn't even bite into them. In the garbage they went.  Avocado eggrolls used to be big and nice presentation.  So yummy! Again, overlooked and smaller.  Fruit bowl was slimmy. I hate writing this but come on, please have the kitchen step it up like it used to be!    What happened lately?  Also, bartenders, acknowledge a customer when they stand at the bar. I know you're busy, but at least say I'll be right with you.  And don't keep having a conversation with other customers talking about the weather, etc, when you have customers waiting.  Bad customer service!   Waitresses in dinning area are great! If the above was fixed, I'd give this place ten stars!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bgvIAYuNv4xf0wpD5axrOg"
  },
  "83EYH4n-VIl223__rRhH_A": {
    "date": "10/5/2015",
    "text": "Great local bar.  Food is several notches above bar cuisine.  We were quite surprised with the quality of the burgers and the homemade soup was amazing. Our waitress was very friendly and attentive until it came time for the bill but we can overlook that because we left satisfied and a bit shocked at how good the bar food was.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0hZfE2He1YssM_wEvKhfcA"
  },
  "pc4OegFYvROjgspqwSWQLA": {
    "date": "12/4/2016",
    "text": "My boys and I enjoy this place. Perfect for football Sundays and to get out for drinks. Great service, good food, great specials, and best of all an upbeat ambiance by the regulars. Chanel, Haiti, and Mariah are amazing waitresses! Sweet, great customer service, and great smiles :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6odSQdRUGDfCVk8kLuHSw"
  },
  "oc9VztlzXKO2QSsgMFTNqA": {
    "date": "12/13/2017",
    "text": "Love this place!! Service is always amazing, especially from Ryan G.! He is the reason I became a repeat customer. Very friendly, warm and welcoming and willing to go go out of his way to create a great experience. And the food?! Always awesome!! Better menu and quality than you will find at any other bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jv-xqcZKj3SaOMn8Xj3VDg"
  },
  "oZyW3RN9qtH13wGtldEE2Q": {
    "date": "12/24/2016",
    "text": "A big group of us got together to celebrate the holidays as well as a good friend's birthday. The atmosphere is casual and they were kind enough to set up reserve signs for our party. Our server was prompt and organized with separate tabs. The food and drink service was quick and exact. We have been here before and we will return again. Thanks for hosting us distill!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i3DlMB5g4zfrV5SYiGrDsQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Getting in the Christmas spirit !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i3DlMB5g4zfrV5SYiGrDsQ/o.jpg"
      }
    ],
    "user_id": "vIrKveNAm95YqwvrCqy4Qw"
  },
  "YUeUSeIbq3XXZTu0vapEHA": {
    "date": "2/10/2015",
    "text": "I ordered the same dish sorry its that Good! Grilled chicken with veggies we need to come here more",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4w92lK3YplfY5CkrFi5gkQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. First time eating breakfast here eggs bacon and English muffin pretty good start to our day!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4w92lK3YplfY5CkrFi5gkQ/o.jpg"
      },
      {
        "img_id": "i0n8aXDkTuYMHyszRbfUXA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i0n8aXDkTuYMHyszRbfUXA/o.jpg"
      }
    ],
    "user_id": "Xb0NtBLY-2GfJ8DT_4noAg"
  },
  "9ShiUL-0frDB2DdYcNCrzw": {
    "date": "9/29/2015",
    "text": "Never had a bad experience here.  Great food and even better customer service.  Mo and Eliot are great behind the bar. Definitely worth the drive!  The wings are amazingly juicy.  Fried just right, my only compliant is that the nitro isn't hot enough! But I'm a guy who takes heat for pain so they might be too hot for you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z83jLEE3J_m7G4Ye9DIGSA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Pot roast special. Thursday nights. The corn was so good it took the thunder away from the pot roast!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z83jLEE3J_m7G4Ye9DIGSA/o.jpg"
      },
      {
        "img_id": "wqH0Ib0E8ugDv1JNlDocBA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Side salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wqH0Ib0E8ugDv1JNlDocBA/o.jpg"
      },
      {
        "img_id": "MSR505O1uHTMPQdbxGBxJg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Chicken Bruschetta. Delicious.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MSR505O1uHTMPQdbxGBxJg/o.jpg"
      }
    ],
    "user_id": "OLR4DvqFxCKLOEHqfAxpqQ"
  },
  "usP9amTp_yrvfoxicM4L2A": {
    "date": "10/15/2017",
    "text": "Great food!!! The style of the place is amazing! They even decorated for Halloween! It's now my new Friday night out  bar !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lNwrYZ10B4M2Nn2oCrWfyw"
  },
  "h3Gj3UVeEHdMJnoF5iefJQ": {
    "date": "10/31/2016",
    "text": "Lovin this place...can't believe I just now found it. Great service, chill vibe, yummy food. 5 bucks for bomb brownie dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9-yx-svqt1fawSyrLbPVw"
  },
  "h7atVxROh0LhrS4qorGG4w": {
    "date": "3/21/2016",
    "text": "Seriously. You gamble and dont get free drinks?  Max bet the entire time nonstop and win and you pay?  Hell no. Never again. Dude bartender was a jerk. Chick was cool but still wtf kinda bar has that policy?  Ive lived here my entire life and have never heard that. Never. Again.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "zbRjeEkON8EXFk_VrcTAiA"
  },
  "HLbcx8UjagTkhAuDrIK0WQ": {
    "date": "3/28/2015",
    "text": "I was in the area working yesterday and my customer recommend Distill to me. I came over for lunch sat at the bar I was first greeted by Patrick. I was told about happy hour specials us a few minutes of light conversation it had that everyone is special feel. I ordered the black & Blue burger with sweet potato fries.  While I waiting for my meal I was able to watch nascar qualifying at Martinsville, VA. Burger was good, fries were nice and crisp. I would stop by and eat here whether I working in the area or not.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_XRwhR824qxBRYBCwWwVgQ"
  },
  "xUx0w6WniD0Lv7dLjivBeg": {
    "date": "4/28/2016",
    "text": "The food was pretty good, but the bar staff is standoffish. My bf and I have been here a couple of times and it's always the same.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeRFpYjNGgPYEDyy8j39Cg"
  },
  "cavZp-N_NLlOIniNcNMYYg": {
    "date": "9/12/2015",
    "text": "So we had stopped in here last year and I was very impressed.  I forgot to write a review so... I had to come again and make sure I knew what it was like:). This restaurant is everything that I wanted, not too crowded, good food, great service and best of all nice people!  I will definitely come back:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "psFQrzj-vk5wjCmVgYy9oQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/psFQrzj-vk5wjCmVgYy9oQ/o.jpg"
      },
      {
        "img_id": "JJEwqS0NNjjhexg6-bT-hw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. When you come here, you&amp;#39;ll have to try the AHi... Outstanding!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JJEwqS0NNjjhexg6-bT-hw/o.jpg"
      }
    ],
    "user_id": "xSzzLeT71fxejEiMhkvORA"
  },
  "B_JPSm2YPLmXQYLEbbp2Ag": {
    "date": "1/8/2017",
    "text": "Great 24 hour local sports bar. The bartenders are friendly and professional.  The kitchen is consistent and delivers a good variety of breakfast, lunch, and dinner selections. The Southwest salad and bacon cheeseburger sliders are especially yummy. Nice furnishings, TV screens, and overall atmosphere.  NFL specials make games fun. Really appreciate the drinkable house cab!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCLFoiHUy3FsQgarr4bL3w"
  },
  "krRoD-ik4PrppmB7KsbvDg": {
    "date": "7/28/2019",
    "text": "I haven't lived here all that long. Heard good things from locals and was not disappointed. The place is so cool inside. It's like your in a really cool whiskey commercial or something. Moody with leather chairs, comfy sofas and pool tables. Super friendly bartenders and staff ... the food...was really really good. Looking forward to trying other things on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAGt82fiNFtGiqsG_ywUJA"
  },
  "z7nng_M3OusVhhXOQPUAHw": {
    "date": "9/22/2019",
    "text": "We use to love to come here...especially on Friday nights because of their Clam Chowder....Now they add TABASCO SAUCE to the Clam Chowder (can't find one recipe that has that in their Clam Chowder recipe.  My stomach does not tolerate spicy food.  This past Friday night, we went there, and I didn't get the clam chowder, but my boyfriend did.....he said it was so spiced that he almost couldn't eat it.  I understand that some people enjoy spicy food.....but shouldn't tabasco sauce be a \"condiment\" that people can add, and not the chef altering a traditional clam chowder?    This past Friday, I went there specifically to have their Buffalo Cauliflower, but not tossed in the spicy sauce.  The pieces of cauliflower were small, the were deep fried to long to the point they were almost burnt, AND they, too, have been altered to have some type of spicy seasoning added to the breading.  I was talking to my daughter-in-law about it yesterday, and she said that the last three out of four times they went there, their food wasn't any good.  They, like us, are not sure we will continue to go there....which is a shame as we use to frequent it at least once a week.  There are other options out there, and we are probably going to take our business elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUUOllovCmPyzcgBwUM1vA"
  },
  "NO5lo43FfuXFO9xkIC4obA": {
    "date": "9/9/2019",
    "text": "I used to always stop here with friends, loved the food and drinks and the service was always on point.  We went last night for a friends birthday. First football sunday of the season and it wasnt that busy. The bar seats were mostly full and there were a few tables, including ours. My first drink came out with lip marks all over the rim of the glass, and my friend's shot of jameson was watered down with the mixer... no alcohol at all. They were replaced, but then at least three of our entrees just flat out didn't come. We had to seek out the staff and ask where our food was MORE THAN ONCE in order to have it brought out to us. We were still charged for all of it. I might think again before coming to this spot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXfFtPOBc5v_sNCo_wzKfQ"
  },
  "QWopczg2GiL5A7BnDq0w4g": {
    "date": "9/2/2019",
    "text": "Used to go here all the time couple of years ago and LOVED it. Couple of friends and I would come for casual drinks and great bar food and service was always impeccable. The good memories are probably salvaging this review to two stars to be honest because these last two trips are far from accommodating.  Came couple of days ago on a Thursday during happy hour after not being at this location in awhile. Bar wasn't particularly busy with maybe 10-12 people inside at the time. Sat at the bar and ordered a pretty standard cocktail. Bartender was very attentive at first and when it was time to order my second drink I ordered the tacos on the happy hour menu after she gave me the spiel on them. Around 30 minutes I was pretty anxious on when I would be actually receiving my food. It was around the 45 minute mark I noticed the couple next to me almost done with their food who ordered their wings about 15 minutes after me. When I asked the bartender politely if my food was on the way her response was, \"I actually forgot to put in the order but I can put it in now and not charge you.\" I assured her it was okay and don't worry about it. I didn't think too much of it and closed my bill.  Just came back from this location again maybe an hour ago on a Sunday night because my friend wanted to have a surprise birthday shindig for her boyfriend who is also a close friend of mine. Me and a friend ordered our food which consisted of me getting the shrimp stir fry and he ordered the Thai turkey wrap. Again, same bartender, around the 45 minute mark of waiting again we addressed politely when our food should be arriving. Her response was, \"it should be coming out, someone must've put it to come out at the same time.\" She was the one who put in the order, no reason to deflect the blame. The food promptly came out maybe 10-12 minutes after asking. The stir fry was okay, the vegetables seemed a bit sturdy for a stir fry. My assumption is that they maybe forgot the order and tried to hurry up the order. While we were eating our meal we weren't checked up on after to see if our food was okay, kinda seemed like they just didn't care.  Another friend from our party also ordered the buffalo cauliflower maybe an hour after we did. After waiting an hour and a half she also just decided to close out her bill without receiving her order of food. Preparing a cauliflower dish should not take over 10 minutes. The traffic for the bar wasn't anywhere near capacity.  Maybe I'll come sometime in the future but these last two visits were very disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PV-ScmorcLD3YWHCLveDhQ"
  },
  "dfepljDz9ML6HIMdCHytcA": {
    "date": "9/23/2019",
    "text": "TOO DARK!!!  I have been to many Distill in the valley and this one is way too dark. It is unwelcoming and it is hard to read the menus. Just turn the lights up a little bit. I could understand if it was midnight, but when you come in for a business meeting lunch, it is not a good setting.  I will probably not come back to this one. Summerlin location is the best.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7vtlhdaNw98WHv7x4ENJQ"
  },
  "gw-oY7BrAjemSNOweRbZxQ": {
    "date": "3/21/2019",
    "text": "We stopped by Distill last weekend for a little dinner and some drinks. Our roommate had tried Distill via Postmates a few days before and raved about it, so we decided that we wanted to try it out.  The place was packed, but we were able to find a table to seat the 6 of us.   We had:   appetizers:  Mashed potato bites Fried mozzarella  BBQ Beef Empenadas  Mashed potato bites are 100% the star.  It was our favorite dish of the entire night.  Believe me, you need this in your life.  Served with a chipotle sour cream and ranch (although they are great with the BBQ sauce too), they are little bites of potato heaven.   All the apps were good, but those were definitely the best.  For entrees, we had the Cuban, which my husband said was pretty standard.  The steak tri tip platter, which was to die for, and the cajun chicken alfredo, which was good, but a little too spicy for me.    We enjoyed our visit, and definitely plan to come back for happy hour and pool!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "P3O_rxgU18B-1IBofzgMbQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P3O_rxgU18B-1IBofzgMbQ/o.jpg"
      },
      {
        "img_id": "Bi012gsH9RZmgzagOjc2Yw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Bi012gsH9RZmgzagOjc2Yw/o.jpg"
      },
      {
        "img_id": "_FgT21NiSsRuhiuAQEASww",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_FgT21NiSsRuhiuAQEASww/o.jpg"
      }
    ],
    "user_id": "renPzRDqMZpMaHiCD_e1_A"
  },
  "cHS25l9kaxDz8Nwn-1wVeQ": {
    "date": "11/25/2018",
    "text": "This is a great place to hang out and unwind after a Looooong day. We also come here on weekends to watch our sports games, play pool, and try to WIN BIG on the bar machines! The food is pretty good, definitely improved over the years. Minus 1-star for the service at the bar, its very inconsistent. Sometimes its superb and sometimes it lacks. It depends on the day, who's working and what mood they're in!? Happy Hour is 3pm to 7pm or 3am to 7am.  Overall cool bar to check out.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 23,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "CQh1WXtjABmbvYmfuyt07A",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CQh1WXtjABmbvYmfuyt07A/o.jpg"
      },
      {
        "img_id": "I5AoeKnYrIU02ytahotXnQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Beer tenderloin tips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I5AoeKnYrIU02ytahotXnQ/o.jpg"
      },
      {
        "img_id": "iC53vUI0_PVO0awxPRqn8Q",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Chicken nachos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iC53vUI0_PVO0awxPRqn8Q/o.jpg"
      }
    ],
    "user_id": "23WZsw0pLiEMm1nHSqFlKg"
  },
  "8NRoPZyPpwT62YJIhD_Qug": {
    "date": "9/8/2019",
    "text": "I typically order food to go.  This is the third time where a take out order was said to be done / ready in 20 minutes.  It is Sunday 09/08/2019 9:35pm..  I called the order in at 8:55pm..  Been sitting at the bar with no updates and patiently waiting.  Management needs to get the kitchen in order, this is some horsesh*t.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BI1lmo-4VTbDUdQV2bhWJg"
  },
  "U4jiRTY62_Z5jYpxFpM48Q": {
    "date": "7/15/2019",
    "text": "Refreshing drinks for these hot Vegas summers - reasonably tasty priced as well. I didn't ask about their happy hour.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uPA-1s4sqfPiE4ozcFXkmQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uPA-1s4sqfPiE4ozcFXkmQ/o.jpg"
      }
    ],
    "user_id": "kEBRvb2ZCJDyWgk7M8OWVA"
  },
  "LpyMsYiyrGgfW773c1kJaQ": {
    "date": "4/8/2019",
    "text": "I ordered food from here via Postmates one day after work and I have no complaints. I had the Nashville fried chicken sandwich, the avocado egg rolls and the bread pudding. I think the bread pudding tasted great but it would've been better if I had it fresh versus having it delivered to my house. The fried chicken sandwich is one of the best I had. Even after being delivered and not being hot and fresh, the chicken was still very crispy. I loved the flavor of it and the flavor and heat in the spicy slaw. I still get fried chicken sandwiches in other restaurants trying to find one as delicious as the one I had here. The avocado egg rolls are delicious. They reminded me of the ones at BJs. They came with a dipping sauce that went well with the flavor. I can't wait to come back when I'm in town to try more of their menu items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jq28YWZnULSqt7vWtBp4AQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Nashville fried chicken sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jq28YWZnULSqt7vWtBp4AQ/o.jpg"
      },
      {
        "img_id": "y1lYh2-4uix4StPqiJ94og",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Nashville fried chicken sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1lYh2-4uix4StPqiJ94og/o.jpg"
      },
      {
        "img_id": "DPxFkz_RNvCfBbet1FBHfg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Avocado egg rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DPxFkz_RNvCfBbet1FBHfg/o.jpg"
      }
    ],
    "user_id": "xTimtxT3p1zKrtfP9JRuZA"
  },
  "C3I3gDGF3RGMCas_6q1ZLw": {
    "date": "12/11/2018",
    "text": "We had a table reserved and the crew at Distill was waiting for us. The server was obviously stretched thin, covering a lot of tables. By the time she brought us our drinks she was settling into a groove and she was able to breath a little.   The appetizers by themselves were delicious. The calamari was some of the best I have ever had. The fried grilled cheese was a flavor explosion! Such a creative dish.  The main dishes crushed my expectations. I was expecting bar food and instead I got a \"90\" Fat Boy burger that was superior to anything else in the area. It was one of those that is so good you can't stop eating, even though your gut is about to bust open. I'm looking forward to getting back to try another burger.   It might be a little out of the way and off the beaten path, but Distill is definitely worth a stop. If you like a quieter meal, head into the dining toom side. If you like some noise, the bar side will suit you well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_clIb3NVQsNzE9teOQgTXA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. The &amp;#34;90&amp;#34; Fat Boy Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_clIb3NVQsNzE9teOQgTXA/o.jpg"
      },
      {
        "img_id": "rk9QZkvTwsUy0z30D_xI5g",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. French Dip with Tots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rk9QZkvTwsUy0z30D_xI5g/o.jpg"
      },
      {
        "img_id": "hb9PhAXWxaHylO5ta0n2uQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. The Cure with an egg on top",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hb9PhAXWxaHylO5ta0n2uQ/o.jpg"
      }
    ],
    "user_id": "P2ZK_uDduvKbKgmNuyZQ4w"
  },
  "K0-YmbjqioyuHtHIr0XLgw": {
    "date": "6/29/2019",
    "text": "Love this place! They have the best people and food. Have to try the potato bites. They are awesome. The only bad thing was some annoying people next to us complaining about not being able to use a coupon because it was for the new bar and then they had the nerve to complain about the food after they ate it all. Crazy. Our server was very sweet and checked on us many times. Our drinks were always full. They were short a cook and she told us ahead of time but we weren't in a hurry and it didn't seem like it took that long to us. We Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwPVK_DV_vNM3qZmXV3Afg"
  },
  "Z99E8CVK_iFiRXFHMbJ9Kg": {
    "date": "6/25/2019",
    "text": "Went there for gambling and dinner tonight. The food was good.   My family and I are usually here a few times a month and the food and servers are always good.  My issue is with the bar. This is the second time while gambling and eating I have had an issue.   The service  Had to wait just to get refills and the bill. I almost got up to go get the bill. Then... and this is the second time this issue has happened.   After I am done gambling and I give the bartender the paper from the machine to get my change...  the bartender only gives me my CASH and not the CHANGE!!!! I do not care if it is only 1 penny it is my fricken change.  I and my family will not gamble here again",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikn2UaPexvfWu0w0-PbIaQ"
  },
  "G0y3UEGMG74a6whNXfZ4-Q": {
    "date": "2/22/2019",
    "text": "The food is good however the bar tenders now I believe are understaffed because the service was horrid. I came in for happy hour and I might as well came in at normal hours.  For a Friday night this place looked like it has gone down hill. I'd blame that not on the staff but on the lack of staff. The management is highly to blame.  They have 2 bar tenders on a Friday night, when any person could think 3 would be apparent. It's commen sense.   3 stars for the very bad service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "3ksckin_3S3SqU-W_W5P3A"
  },
  "VCXQNe2pUDVL_2Q8zeB5aQ": {
    "date": "6/13/2019",
    "text": "I will always wanted to try this place I was passing by  this place home from the movies and decide to go in with family .... loved the The atmosphere and the service was friendly and amazing ..... plus the food was top notch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eolJSaeaZIUEQM68p2xM4w",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eolJSaeaZIUEQM68p2xM4w/o.jpg"
      }
    ],
    "user_id": "hRRox4eyEUIFsESB32wehA"
  },
  "gtEGm77CJOnXqVUWybhqkw": {
    "date": "12/15/2018",
    "text": "The wings were great it came with 12 plus fries and celery and carrots.. the food and drinks came out p fast but my michelada.. noooo...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XBEdO_F0sBAfhmP5B86G2g",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. $2 Michelada upcharge yikes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XBEdO_F0sBAfhmP5B86G2g/o.jpg"
      }
    ],
    "user_id": "o7sVRYWSskPEv9veCYes-g"
  },
  "bfYMFxm8Q6APFlF6Y7LNbg": {
    "date": "4/26/2018",
    "text": "Update: how convenient of this bartender to not give receipts to the individuals of our group after they've paid. Definitely need to file a dispute somewhere to make sure this doesn't become a common occurrence!  I would have rated this place a 4 stars if it wasn't for the end where our bill was incorrect and the bartenders' (Ryan G.) response was \"that's the way it is\" just because we are the last ones to leave. We leave a tab open for ourselves (group of 5 people) not for others to charge their shit onto our card and the bartender had no right allowing people to charge onto our card or even to add items that weren't paid for because he couldn't pay attention. Did he pocket cash and we ended up responsible for the two added items, very possible. That constitutes fraud and management should keep a closer eye on this guy. If it's not this guy, then this bar is taking advantage of large isolated groups that come in and adds on items that weren't ordered to increase profit.   We ordered two sex on the beach, a pomagranite punch and a whiskey sour and ordered one water (not bottled) before shift change. Then at the end we ordered two tequila shots, somehow wings and an AMF drink were added to our tab when we decided to leave and close the tab.   I tried ordering my tequila shots earlier in the night, but Ryan was too busy showing some customers what was on his cellphone instead so I left and returned to the counter a bit later for it and to get quarters for the pool table again. I tried to hand him his tip after getting my coins, but he just turned around and walked away after handing me quarters, so it ended up being placed under the rubber mat on the counter. Kind of explains why our tab ended up incorrect because of his negligence and lack of attention or he pocketed the cash that was paid from our other group and decided to use us since we paid with credit. Make sure to keep/ask for receipts if part of your group pays cash.  AGAIN BEWARE of leaving your tab open, for the reasons above which is why I was skeptical at leaving it open in the first place, but since it wasn't busy(Monday evening) I thought we would be ok. How terribly wrong I was. How is it fair to overcharge customers because you couldn't do your job properly?  Pool tables cost $1 each game (uses quarters only or maybe it just works better with coins). We came in a little before 11pm and unfortunately I didn't get the names of the original bartender or waitress. He was great, seem to have a sense of humor from our brief encounter and waitress was good, could have been better, she seemed like she didn't want to be there and didn't seem too happy when I told her my sister was still deciding what her first legal drink should be, it had only been a few minutes since we arrived. She warmed up a bit later and was very attentive, frequently coming back to check up on us and apologized for taking long in bringing my boyfriend the water he requested. Both were definitely better at providing service than Ryan did.   Restrooms were clean, a plus. Large area to hang out and yes a bit smokey. You can smell it once you pass the first set of doors. I may or may not return to this establishment.. since our first experience here turned out like this.   I was really hoping I could come back to this place and take advantage of their loyalty program versus going to PTs/Sierra Gold or all the choices in Downtown area. But there are plenty of other bars with more games and better service around town that will gladly take their customers",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kmurdAFmq3Cl4D4LR3eNNQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Pomegranite Punch (right) is good!!! Sex on the beach. Whiskey Sour.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kmurdAFmq3Cl4D4LR3eNNQ/o.jpg"
      }
    ],
    "user_id": "qIJ2iA9JwRYZD0akh1nyRA"
  },
  "vBjlKWC0kWrKCthAJrakSg": {
    "date": "7/13/2019",
    "text": "Friendly bartenders and good ambiance & design. There is a restaurant area separated from the bar, so also good for kids with no smoke. I tried the buffalo cauliflower and it had the perfect zest & spice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir0h7FjMvE7v2ZHtk1YuZA"
  },
  "UQsy38nRGX3wwvQX3HqqoQ": {
    "date": "3/28/2019",
    "text": "One of my fave bars to watch the Knights games! It's usually not too crowded and they have some great deals (including shots every Tim VGK scores, which can be verrrrry dangerous if our guys are doing well!). The staff knows our family pretty well now because of how often we frequent there and they're always so great. The beer selection is . Definitely a great bar if you've never been!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Scmyz7MK4TbXXYcaLZxIxQ"
  },
  "QJDN1Fegc7ro0jc72JriLQ": {
    "date": "9/1/2019",
    "text": "We went in at noon on Sunday and dined in the restaurant. Not a fan of walking in on the side of a venue into a dark room with no greeting and completely empty space. All the action was in the enclosed bar. Many people sounding drunk and a little crazy which was odd for noon on a Sunday, but hey, it's Southern Highlands right? And they were having fun. A Randomly located bar/ restaurant but seemingly clean and didn't smell of smoke. To start we had a cider and I ordered a Sams 76 which was printed on the corporately designed beverage list. \"Sorry we don't serve Sams 76\". Ergh! I had an Oktoberfest and it was cold. We ordered a Rueben sandwich and a melted cheddar cheese brisket sandwich as well as the daily soup: jalapeno corn chowder. The corn chowder was 20 minutes away from being a dip. Verrrry spicy and we couldn't finish it. The Rueben tasted like a little too much vinegar and the meat was a little tough. The brisket on the cheese sandwich was basically 'deli' meat. The bbq sauce smothered on that sandwich saved it to some extent but we would not order any of  those items again. We will try for breakfast and see.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-3YwmFgBeUPMRpRJ0rHng"
  },
  "MQauMkUQ4WYrXcDdEddUZg": {
    "date": "8/4/2017",
    "text": "Walked in on a rainy Friday afternoon and was greeted by the friendliest bartender ever ! Nikki was so sweet and fun! They are doing this great donation of by a red Cosmo and all proceeds go to the American heart association, and the drink is delicious! Defiantly check this place out if you're in the neighborhood and ask for Nikki ! You won't be disappointed :)  also try the mash bites !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0I5FNu85SBaVNGp4QrnWbA"
  },
  "6PSuU0Bu28RsgGaJPenkMA": {
    "date": "5/31/2017",
    "text": "Typical smokey dive bar with an updated facade. Food was decent but if you sit at the bar you will leave smelling like an ash tray. You can tell there are a lot of regulars who just like to drink beer, gamble, and smoke their cigarettes.  Want to avoid the smoke? Sit in their non smoking area!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7x3YVlAXqQwrenwGfpDxpg"
  },
  "xz-vfIbfSDnmsqZmV3QuJw": {
    "date": "2/28/2016",
    "text": "Came here on a Monday afternoon to grab a bite. It's kind of in the middle of no where with nothing around it. It's a little dark when you walk in but I like that, I don't like a well lit bar. The atmosphere was very laid back, there's a separate dining area off to the side if you don't feel like inhaling smoke the entire time.   The service was great - our server was very nice and attentive. The food was also pretty good. They have a happy hour menu with small bites and beer for good prices. We tried the chili cheese fries and we added a fried egg on top, delicious! We had the chicken dinner and a burger... The chicken dinner was a chicken breast with a creamy sauce on top with a side of potatoes and veggies. The burger wasn't cooked how I liked it (the other person likes it medium instead of medium rare) but it was good, came with fries too.   Would definitely come back for more beers and good food. Great place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOsvZjfdr3ebl0gwEhDpZg"
  },
  "3J7C9ksYV0hKc_cmllS5Eg": {
    "date": "7/9/2017",
    "text": "Best bar in the area ! Great industry spot, foods great machines are just as friendly as the staff two thumbs up. Is there a 10 star button ? Cause you guys rock it, been coming here for 3 years now happily.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3n_lfgbJLiZDtEtsnls7w"
  },
  "BEGig_83ejiXvD4GnodNfg": {
    "date": "5/1/2017",
    "text": "Great friendly staff and the Best calamari ever! I'm not from around here but I'll be coming back here when ever I stay at South Point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0bkAaj62_jGbdl8J5PSsw"
  },
  "ST50XfWzz4UOCWmXjnjnyw": {
    "date": "7/8/2015",
    "text": "I still come here frequently but the food has gone downhill since the beginning. The sliders were so overcooked, well done, and just a step above high school cafeteria food. The bacon was hard and too well done. I hate overdone bacon. No wonder my friend offered me one! LOL. Even the deep fried mashed potato bites which I love were not as tasty as I remembered them. The potatoes weren't mashed and there were potato cubes inside. The seasoning was off too. On another prior visit, the tacos were just mediocre. What happened to the food? I guess I'll just stick to drinks here. Service is still attentive or decent.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "TS4RfxKny-c8QYcnMpfkiQ"
  },
  "odEcTytKgvlKDMWFi-z3Aw": {
    "date": "1/26/2017",
    "text": "Nice locals spot for those who live on the south side of town. The bar is isolated by itself and it always seems like there are alot of people parked here every time I've been. The food is decent, the bear is clean, the staff is friendly and it is a cozy area to watch sports to to meet up with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RSLTG7N0wYJhRTW5CGEm5Q"
  },
  "jiEnVoS498fAFf-pzGOoLQ": {
    "date": "2/3/2018",
    "text": "Came in about 3 am I cant remember the bartenders name but he had dark hair with the a kinf of spikey cut..youll know him when you see him. Great service and even thiugh it was late GREAT food thank youuuuuu",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ww5nYvbQeRW8gLADXOwgyA"
  },
  "leegZZe1qPQNnWycX4rfiA": {
    "date": "10/23/2016",
    "text": "It's a perfect little three-star restaurant and pub the food is good not overpriced place is comfortable and clean the staff are polite and courteous and friendly the chef is pretty good the food is better than OK I would recommend this restaurant for the price the food is very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CtlCcf5AacLmJlOdrM17kQ"
  },
  "4pMKHgYDubHwUzQadmcPfQ": {
    "date": "7/14/2017",
    "text": "Disappointing. NO SERVICE.  Arrived at 4:45 pm. No one in restaurant. Sat ourselves. A guy came by and gave us menus. Told us Crystal will be our server. Did not take our beverage order.  Waited 10 minutes all alone in dining room. Staff all laughing in kitchen having good time. Called the restaurant on our phone and let them know we were waiting. Waited 5 minutes nothing. Called again, finally the guy that seated us came to the table.  Some excuse about Crystal being busy with 30 people. Yet he peeked out of the kitchen 3 times. Something about he thought Crystal was handling us. He took our drink order and left.  After 5 minutes we left. So sad, we heard the food was good. Service counts guys and staff needs to step up and help each other. If someone is handling like 20 people, then YOU take care of the others....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RoJeErivU6c4tr_vba_cHw"
  },
  "yIcrKy1CGdc35HlPQGvuFA": {
    "date": "8/28/2016",
    "text": "I have had such a great time here. It was busy but Sean made sure that I was taken care of and that I never felt ignored. I will be coming back here for the drinks and the atmosphere. Thanks!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eF8nd9pLNP9gb8LZ3LZT4w"
  },
  "iOsdTpp3KxuU2tnTD2fpWw": {
    "date": "12/26/2015",
    "text": "Our first time here. Wanted to check it out. Saturday night about 7. Bar was full. But as usual most people were eating or on the phone. Not playing machines. Wish bartender would ask them to move to one of the many open tables. We sat ourselves and Jennet was very quick to bring menus and get our drink orders. The food was awesome service not so much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DOF-nczmkmhP0b_tHxwlA"
  },
  "s7P-LG3hSp2230hBNMlc5Q": {
    "date": "5/14/2015",
    "text": "I was excited about this place when it opened because the menu sounded really interesting, and then we brought home dinner one night and literally everything we ordered tasted frozen and bland.  Okay, maybe not the Caesar salad. That wasn't frozen, I don't think.  But everything we ordered was mediocre and dreadful, so we won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "n-U5fa4B0hKfmRSZ-M7BMg"
  },
  "Y8JAeytfte2bc4quypxOFQ": {
    "date": "5/14/2017",
    "text": "Great local spot for chilling out, gaming, or just putting down some shots and beers. Bartenders are all locals, all super friendly and take great care of everyone. The food can be a little hit or miss, but then again I'm a picky New Orleans boy, so there's that. I will say that the buffalo blue burger is the bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rH8C1ZjnDatTwLt1_hDg-A"
  },
  "g5vUWBVUN_UDcxKLk7IP5w": {
    "date": "4/22/2015",
    "text": "I've been here a few times and have never been disappointed. It's in deep southwest on Decatur south of Silverado Ranch, it stands all by itself just east of, it's hard to pass or miss.  Each time I've been here it was for breakfast, I haven't drank at the bar yet but if it is anything like its breakfast then I look forward to it. This is one of those separated eating area/bar places which is pretty cool as I don't like to inhale a plume of smoke when I eat food.   I ordered the Ham and Eggs (poached) which came with hash browns and roast. The food was delicious and the hash browns cooked just right, I was going to order pancakes with it but decided not to because I was stuffed! The portions are definitely healthy as I was satisfied.   The service was superb, she never left us alone for too long and refilled our drinks when they started to get low. The prices were very reasonable for what you get, my check was under $8 for my breakfast. The decorum was very modern and lighting matched the ambience, there is a semi-private dining are off to the side that was suitable for my group.   If your in the area and looking for a reasonable good breakfast spot this is it, I'll have to check out the bar one of these days and see if it pairs up with its dining room service.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "A8TRpa--43-mbig73xfhrA"
  },
  "fwwF55NCemLAHK-cMVA5mw": {
    "date": "1/18/2016",
    "text": "Not a big fan of this place the burger I had here taste like firecrackers like sulfur it was weird , bartenders are anal and not very friendly. I'm A bartender myself at MGM and I usually have patience but wow.. I won't be coming back sorry guys",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gVzGxqPgRq5bOrCHLLIjfA"
  },
  "COeihoxAq02uMiAHNFBwRw": {
    "date": "1/14/2017",
    "text": "We live near here and needed a decent meal on a Saturday night. Place was busy but not crazy. Staff was friendly. Better yet, the food was delicious. My husband got fish and chips and loved it (I tried it to and agreed). I got the beef tenderloin and it was fabulous. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "67DNUfIkkRUD9MYAQ_piiQ"
  },
  "vuOjjgOCm0vE9eavdssTsw": {
    "date": "1/14/2017",
    "text": "Great breakfast deals, and also burgers are on POINT!!! good spot to watch the NFL and sports games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fbKDa3ObAH0R_O8LIk28Ew"
  },
  "DGQhVlcCr3BHUwLvSU3nng": {
    "date": "9/9/2016",
    "text": "Awesome place to enjoy drinks and play boardgames with friends! Drinks are fair priced and the atmosphere is chill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l9FhTx_Q8VtWmGc2IdN3Vg"
  },
  "hB9m_BThgiikYiLFb6p1yA": {
    "date": "8/30/2016",
    "text": "Ryan is a awesome bartender... he welcomed me and my roomie to this side of town always looking forward to drinking his tasty shots it's been a long time... he also introduced us to the awesome menu.... sweet potatoe fries are addictive with the special dipping sauce... still waiting for a hangover to try the hangover burger... its cozy not that big but $1 pool some comfy lounge chairs... I never hit on the Machines at the bar...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hk7khaUDZ1xsu7BqO11BfQ"
  },
  "IP33CYdJYBHlCftwPjLHKA": {
    "date": "12/6/2015",
    "text": "Awesome place to hangout with a great atmosphere!!Graveyard bartenders are legit. Ryan and Scotty are two of the best in the business. Don't understand why people are making a fuss about a French Martini...You won't find a bar in town that serves better food.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CZxQNmM7-4Tp1Z7NizFd9A",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Jalapeño burger!!!!Thank you Ryan G for the recommendation.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CZxQNmM7-4Tp1Z7NizFd9A/o.jpg"
      },
      {
        "img_id": "JAzgsRF9lXtr1z79Z-cweA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Great night at Distill with amazing food and great service from Ryan G!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JAzgsRF9lXtr1z79Z-cweA/o.jpg"
      },
      {
        "img_id": "o-IRCVOc6RuKDXhw9up7XA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Ryan G serving up great food and margaritas!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o-IRCVOc6RuKDXhw9up7XA/o.jpg"
      }
    ],
    "user_id": "J1_AakhtrHOhZAarCx_PVw"
  },
  "YioSoBLxMPLS_D-K1O0rOg": {
    "date": "10/6/2015",
    "text": "I love their food! Great prices, the service was alright. It's busy so I totally understand they are dealing with others. Overall great place and scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_GZFgwBMI0hD5TOQPWyh9w"
  },
  "eGBkpROaHKaNi5U2QYEYgA": {
    "date": "7/25/2014",
    "text": "Awful experience. I waited forever to order a drink & told them I wanted to order food and was given the wrong drink that tasted horrible & then ignored to fix the problem with the drink & ignored for my food order. Finally upon getting service, they got me a new drink & messed up my food order & overcharged me. I let them know & they said oh! No apology! Upon getting home, no butter or honey for the cornbread & no salsa for the tacos & they look like they were shaken up in the box!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "H_ZgtoeSgisKyAQTcFvkxA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. A big mess of my chicken tacos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H_ZgtoeSgisKyAQTcFvkxA/o.jpg"
      }
    ],
    "user_id": "km4G2uBmegYYv5wBvT0uTw"
  },
  "pwxkuUBkHRnjJXjceIn7DA": {
    "date": "11/30/2015",
    "text": "I come here for drinks and a little gambling after work.  Ryan the bartender on graveyard always treats me and friends good.  Aaron the cook makes a good pizza. Service is great and the staff is very friendly.  Also, Britney and Mo are awesome when we come in the afternoon. Always a good vibe in this bar. I like that they have an awesome jukebox and good music available.  TVs all over the place to watch all the games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PwaKncZ-PmHUyqUwClv0Q"
  },
  "PKi42qKKDQ0hVrYNZv0JZw": {
    "date": "11/22/2015",
    "text": "Been here on and off since it opened. I dealt with their weekend grave guy at a different bar and was u happy with him, but gave him another chance. My husband and I each threw in 50 to our machines maxed bet and had two drinks and two apps and got charged for everything. I don't think everything should have been comped but maybe a drink or two?!? He stood staring as we looked at the check. Like I said bad experience in the past with him.. You can never get his attention unless you shout for drinks and your check good luck. Last time dealing with him and last time at distill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxg0_dYURbrPeOD1SBH83g"
  },
  "xltdZHtjc9K9QkRT47KhYA": {
    "date": "4/22/2015",
    "text": "Seriously has the best time here! amazing atmosphere to hang out, eat, and have a great time! the food was outrageous and everybody made you feel welcome. The prices couldn't be more reasonable. Go for the great food and beer, you'll stay for the amazing service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R00c-ymRO3CR9-Y-TcUHeA"
  },
  "H6Ghz_itlHi87E3Fgu5-yg": {
    "date": "4/10/2015",
    "text": "Nice team I was greeted and welcome to the bar I was told about happy hour and Wednesday are DJ night. I got a players card plus $10 for first $20 cool place I would bring my friends parking might be token but you can park in gravel. Bartender even shock my hand I will be back soon! Cool place to take boss or co-workers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "im08R32VfU1In2i-TWpt9w"
  },
  "8YTZpUIW-qU9SNbalp5bIw": {
    "date": "9/11/2016",
    "text": "This is my neighborhood bar....love the atmosphere and offerings. Rhea is the best server and only person we rely on for our orders!  Management is pretty good but could cut some of the lack-luster employees.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_YnqZySExnM-IPOcs7UyQ"
  },
  "vE9CzGi1uBHbnEWLL9I71w": {
    "date": "7/23/2014",
    "text": "It's definitely a plus that this bar is so close, and so far the service has been good and the menu is really great. Definitely looking forward to industry Wednesdays after 10PM, awesome food and drink specials with your industry ID. Favorite thing on the menu: Avocado Egg Rolls $7.99, Mashed Potato Bites are good too. Yum! Of course they are still working out some kinks, and I'm not super crazy about their beer selection, but I will hopefully be able to update to 5 stars soon. Yay for a new local bar!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jJtMKVIUzdDG4xagIOSraA"
  },
  "kHsXHmscGxuvjyiiaM_4oQ": {
    "date": "1/30/2015",
    "text": "Well waiting an hour and a half for bar food is unacceptable....Friday night is apparently not a good time to come because \"the kitchen is backed up\"! Our order was incorrect and they substituted at their own discretion rather than ask what I may have wanted.....one of the three tacos was seasoned ...however over seasoned....the wait staff is inattentive and the bar staff is slow making drinks",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAf4gaxpWe2dM4ehN3NtbQ"
  },
  "bzeTEmE_djaBb3paWQkNSA": {
    "date": "7/16/2016",
    "text": "this is the greatest bar that you can go to in southern highlands. the staff is good and the drinks are tasty. it's down a secret road so you can hide from the coppers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zx5-bx_y3GlwZLdbTCUB1g"
  },
  "HZpDN5tSUYDMOCzh8h_JQA": {
    "date": "5/27/2016",
    "text": "cool little spot which I'd like to go more often if it's not for our server who reminded me of Debbie Downer.  holy cow lady put on a smile, at lease fake it or something... you're in the customer service business.  looking at her face made the experience depressing.   the sauce used in the calamari was delicious.  the place is spacious.  Maybe I'll give it one more try. however, if I encounter Debbie Downer again then I'll have to go elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_hUvw2z0R-Rv0yZb6QCZA"
  },
  "NeEMlVKOKkUwm8orlVLICA": {
    "date": "7/16/2015",
    "text": "Good service and delicious food. Had a good night hangin out with my softball buddies. Hopefully my review doesnt get taken down like all my other ones. The bartenders were pretty cool guys. I'll come back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u4AdE7s34rKaIsBJ1dejaA"
  },
  "kuCA06WLP-PUHwqYqfnajA": {
    "date": "10/10/2015",
    "text": "Don't believe the mediocre reviews. Excellent food. We live in Southern Highlands and as all the locals know we have very limited options. Great value and excellent food. They make all their soups and dressings. Always a good sign. Try anything Poke. Jenna was our server and she rocked it. Thanks! Finally we don't have to settle for mediocre bars like The Lodge and McFaddens.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvebbiReLv28MTvkry-YcQ"
  },
  "Id7UPlYfm454ickb-3nBBw": {
    "date": "4/22/2015",
    "text": "Rhea, Alicia, and of course Kristal are the reasons to come here.  Best service and food.  Such a fun place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p8IaEyetI0zU-svHSi7p2g"
  },
  "OyNDAlkFIhzDxa1Rlee17w": {
    "date": "4/22/2015",
    "text": "Bar is pretty awesome, art on the wall and the pool tables are always fun. Had a great server named AJ. Awesome with drinks and as well as good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_28wVYL7-_Yod1FwwCV7g"
  },
  "F0XC9bUmEalL61NU5R-RTA": {
    "date": "10/3/2016",
    "text": "We eat at Distill at least twice a month and I have tried probably half of the menu.  Everything is either good or really good but you have to try the fried pickles and mashed potato bites!  The staff in the dining room is always super nice and the staff in the bar area is great too.  Awesome place to go and hang with friends or take your family.  They also have a little side room if you have a large group.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sEe4HE7ZU4m7kX3IJV3xg"
  },
  "Y3PG3F-a3QSix45IOo3GKQ": {
    "date": "8/15/2014",
    "text": "Horrible!! Ordered something simple a patty melt! Dried out bread over cooked patty and 14 French fries, My guest ordered fish n chips all breading and few fries ( must be shortage if potatoes ) never go again over priced crap",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2ljjj4W8NNQoK0_KLR5OQ"
  },
  "hnRX8hPqoh1ZrSLynn_FsA": {
    "date": "11/4/2015",
    "text": "Just moved to the area and drove by a few times.  Very happy with the selection.  The presentation was awesome, loved that the food was run out by multiple people to make sure we were all served together. The food and pricing were great.  Jenna our watress was lovely and very sweet.  If I could say one thing, the lady we encountered first was not very nice and quite rude, we almost walked out because of her, glad we didn't.  We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gZIFYbEb3NUDHc60xCSymw"
  },
  "mAYvLGgOGUYpA2OnnMY8wA": {
    "date": "12/28/2014",
    "text": "I absolutely LOVE this place.   Don't listen to all the naggers If you look all they do is get on here to leave nasty reviews! This place has wonderful service, great atmosphere, and even better food!! Have been here multiple times and will always return.  I love their southwest chicken salad and I order a side of the bbq sauce. Soo delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QlcvBJynpv6Twz_RFjSfqA"
  },
  "cfIBUGa-kxR3SVQM0FXRbw": {
    "date": "7/9/2017",
    "text": "There's a few options for bars around my neighborhood that are much closer but I choose to drive a few more miles and come to Distill. The staff there is second to none. I've been there all different times of the day and always get exceptional service.  I like to come and gamble, eat, and have a few cocktails. I haven't had the best of luck on the machines but that's nobody's fault. The machines are always clean with a great selection of games and bonus money you earn playing with a card.  The food is unbelievable considering it's just a neighborhood bar in the middle of the desert. On top of a top notch menu they run specials daily and have an awesome happy hour.  Without a doubt my favorite bar in the city of sin! If you don't know now you know!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2G6vmVhK5-A4tskXPRckOg"
  },
  "n-sKspfEnY5Avbx9VN8sbg": {
    "date": "2/11/2018",
    "text": "I know this is a property of Remedy's, but this location has better food then the Remedy's at 7 Hills. We live in 7Hills and would prefer to drive over to Distill than go to Remedy's.  Not sure, but feel like Distill off Decature really cares to give good  food and Remedy's at 7 Hills figures they have a captive audience so even though food ok, that's just it. Get by. Better than a lot of bar and grills, but get your Distill chefs to teach each others about passion to make it right",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kowvnIuHSxO_T-2dtyWfEg"
  },
  "jFfrrrIdeqS7c_rBCAXnvA": {
    "date": "8/23/2017",
    "text": "This is the best bar and restaurant in southern highlands and the girls here Chelsi, Haydee and Drea hit a home run with service, I love coming here and seeing friendly faces!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fpIFSvZu1SBREnTbfe3rnA",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fpIFSvZu1SBREnTbfe3rnA/o.jpg"
      }
    ],
    "user_id": "Y_eEP89aTA2aabyWWrDk7w"
  },
  "uD-Z1bikdkthNOEfmop9dQ": {
    "date": "1/12/2018",
    "text": "Best local bar . Ordered chicken wings to go with Elliott. Great customer service provided. I'll be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWrczYdgzLUkBbjwA_K2Uw"
  },
  "V1lvyQBneTy5abGosUvpSw": {
    "date": "6/12/2017",
    "text": "The best staff as well as the best food. I live nearby and eat there at least once a week! They have plenty of healthy meals as well as amazing sweet potato fries! You call and order and be assured your order will be exactly as you ordered it to be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_PzvmWF4PnBrPFqMsMi_7w",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_PzvmWF4PnBrPFqMsMi_7w/o.jpg"
      },
      {
        "img_id": "A6Zpv1uvIxN2S95x4b-Dsg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Kids Menu on Private Family Dining (non-smoking)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A6Zpv1uvIxN2S95x4b-Dsg/o.jpg"
      },
      {
        "img_id": "vcAeNpWB2xa2np0rOhMmLg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Winner winner !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vcAeNpWB2xa2np0rOhMmLg/o.jpg"
      }
    ],
    "user_id": "t0SsACYBpRz-wk7W0UQQDg"
  },
  "IlaGFUUs54WCM_73tpjlvg": {
    "date": "8/6/2017",
    "text": "Nicole is the sweetest bartender I have ever encountered, in love with this place Joe the bar  ambassador is great and had us laughing our asses off. The food was amazing and the bloody Mary's were on point!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q33Cb0JwQ7Z1wxKsa7Bgag",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. #daydrinking",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q33Cb0JwQ7Z1wxKsa7Bgag/o.jpg"
      }
    ],
    "user_id": "1MxGWQK1o2gQLNm2TTJn2g"
  },
  "4S2vAPK7ZznOk15H09_Kew": {
    "date": "12/25/2016",
    "text": "If you live on the southwest side of Vegas (Southern Highlands or Mountains Edge area), this bar is tucked away in a corner off Decatur and Pyle. But worth the find!  My friend Olivia introduced me to Distill a few months ago. We started coming here after work to de-stress, eat and have a few drinks. There are two parts to this place: there's the actual bar, which takes up most of the space here. Large TVs for sports, tons of tables to sit at, the entrance is the main entrance at the front of the establishment. The second part is the actual sit-down, restaurant section. It's separate from the smokiness and loudness of the bar area. And much more intimate. I prefer to sit here. And the entrance is off to the side.   Seating is by choice. We usually love to grab an open booth. Happy hour is from 3pm to 7pm! My roomie ordered the chicken lettuce wraps off the happy hour menu. And my goodness. I honestly think those were THE BEST lettuce chicken wraps I've had in Vegas. The chicken was shredded and so juicy. I couldn't take a pic because I was way too hungry, unfortunately. I ordered a side of sweet potato fries - which were nothing short of amazing - and a whiskey ginger ale off the happy hour menu for $3! My coworker ordered a BLT and she seemed very pleased with her food. But then again, I've seen her order multiple items here and she seemed to thoroughly enjoy the others as well.  Please order the chicken lettuce wraps, even if you don't make it in for happy hour.   And ask your server for a loyalty card! It gives you points on all your future visits and access to their other bar properties around the Vegas area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIQjl4ckL2lWPrqV2ZGAtA"
  },
  "u9aLs1stcD5HSrDPkMVFfQ": {
    "date": "12/17/2017",
    "text": "Great bar !! Fantastic food ! Great staff! I came in on Sunday and Nicole was super nice ! I couldn't believe how good the food was! This is not your average bar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITv82fJ1F-F4p-MU6C8M8A"
  },
  "ZruC7NfNiHR0UO0VXGPS5g": {
    "date": "8/27/2018",
    "text": "Came in for a late dinner, food is amazing! Erin was quick to take my order and serve drinks even with a busy bar. When the night shift took over the service was still spectacular, Ryan was very attentive, friendly and just an all around great experience!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cK2TxQxhRhXNOK1j5nuTlA"
  },
  "WuhPta72YUx3e8_V1gOqqw": {
    "date": "11/18/2017",
    "text": "We came to Distill on a Saturday afternoon. Absolutely starved. I mean, I'm withering away at this point.  They put me on a commercial telling people that for only 50 cents a day, they could help me... Then A beautiful bartender named Nicole clearly saw that I was in dire need of food. She recommended some turkey waffles. I have never heard of such a contraption. But the way she described the succulent Turkey, mashed potatoes, cranberry, gravy, and syrup topped on a breakfast waffle had my mouth watering.  I didn't need a menu. I ordered before she was even done explaining what it was. This is Thanksgiving on a waffle the week before Thanksgiving. This was the best invention at the best bar in town. Thanks Nicole!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6jt3VjysALKc-If-TMj6lQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Thanksgiving on a waffle at 3pm. This may or may not have been the best recommendation ever given. Thanks Nicole! Best place in town !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6jt3VjysALKc-If-TMj6lQ/o.jpg"
      }
    ],
    "user_id": "YfktDnqtfZqz7Ohn2XiXaw"
  },
  "A6jt1IAG6QToPcH_xd4tfQ": {
    "date": "8/16/2018",
    "text": "The service here was the worst I have seen in a VERY long time! Went through 3 bartenders and each one was progressively less responsive and rude! Food was shocking!! Never again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyUF8PtUeY1vElH1KUVdRQ"
  },
  "u3gV7GhLg0sraYjtJn6X5g": {
    "date": "12/3/2017",
    "text": "Wow ! Do I love this place ! The best bar staff in all the city, no wonder Distill crushes all the competition. Whatever they do here as far as bartenders; it works ! The food is also fantastic and this place is like family. I love my Sunday football crew Nicole and Sean shout out to my little duo ! For sure the best bar around, thanks Distill for being my version of \"Cheers\"!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NldDEIGPNjfuudHQssomcA"
  },
  "5B2YsjJDbOzAe5vVLH6rzw": {
    "date": "8/30/2015",
    "text": "Location is a bit random I think. The place is half the size or even smaller than the Summerlin location. It was super duper loud on Friday night, to the point that you need to yell to talk to someone next to you. I don't know why it was so loud. Either way, it's the same old. Drinks are actually reasonably priced. I think a vodka tonic is $6 and long islands were $7.   Would I come back? I think not. Not a bad place to come with some friends to hang out. It was nice that you can sit.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "B1829_hxXSEpDPEDJtYeIw"
  },
  "Wj1S1GAB49bebtR9oGDwUg": {
    "date": "7/24/2018",
    "text": "Amazing service, staff, drinks and people to talk to.  Only my second time here and I can't rave enough about this place. My friend recommended it and once a week I'll be back for their 24 hr kitchen. The wings beat anything you can get at a generic chain restaurant and the service is out of this world! I came mid afternoon and into the wee mornings and everyone is upbeat and helpful. There is no reason I wouldn't bring a date here let alone come by myself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8zqMF9mVchex5xm5AlKwA"
  },
  "hq2_okfep9TWPFtQSW2AKA": {
    "date": "10/13/2017",
    "text": "Great food great service and great chiropractic needs were met.... talk to John for a good back crack.  I know random but seriously AUHHHMAZING",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "imvgkYTGpkZeKrHHkNeSHA"
  },
  "9gvNAzhLChhzoy2SfL7UUQ": {
    "date": "6/12/2018",
    "text": "We had a GREAT time. Burgers were delish the service was outstanding.  Our server, Ines was wonderful.  Ines was fast and courteous.  Thank you Ines for a great evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHriFK3oKUhUhBNlkBfIfg"
  },
  "czEWrYD_nG9BhXHEWygWPw": {
    "date": "5/28/2017",
    "text": "Great diverse menu. The Cure burger was awesome! Mmmmm.... Tater Tots! Delish house salad. Breakfast 24/7 with Chicken fried steak and gravy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ter3rLDw8ihpgPTpogKmmQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Mmmmm... Tater Tots!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ter3rLDw8ihpgPTpogKmmQ/o.jpg"
      },
      {
        "img_id": "jJvU8Qm8egPeFBP-TLgkbg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Mmmmm tater tots!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jJvU8Qm8egPeFBP-TLgkbg/o.jpg"
      }
    ],
    "user_id": "7m3mJnFr33KgYODtirrCaA"
  },
  "Lz_AKLKJjC4eZigsUA-Beg": {
    "date": "10/14/2016",
    "text": "We had the cheese steak sandwich, chicken Parmesan sliders and the mashed potato balls. Everything was yummy. We ordered two mules and they came in pint glasses (boo) they honestly didn't taste very good either. At least the food was great! I'd come back if I was in a pinch for a place to take a few people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JtEQn7KEH0Uvs4DjlvdQOw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Mules in a glass",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JtEQn7KEH0Uvs4DjlvdQOw/o.jpg"
      },
      {
        "img_id": "Ejf8pmYy75nnIOkUfjsYSw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Chicken park sandwiches",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ejf8pmYy75nnIOkUfjsYSw/o.jpg"
      },
      {
        "img_id": "pz0nbIu3c_ZGnGUtWi_nEw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Cheese steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pz0nbIu3c_ZGnGUtWi_nEw/o.jpg"
      }
    ],
    "user_id": "WwoM6hQbgPnzcX3taqK-xQ"
  },
  "DexRQbpdbjHNwJ-7_O2D5g": {
    "date": "4/11/2018",
    "text": "I had ordered a veggie burger, fries and a salad for delivery from Distill. I have NEVER gotten such bad food poisoning from vegetarian food. Now how that's even possible is beyond me (someone isn't washing their hands who's preparing the food or not washing the vegetables properly). 2 hours after eating this, I became VERY SICK and began puking. Classic food poisoning. Generally this is my favorite veggie burger, but I usually go to the summerlin location to get it....this was my first time having it delivered and it came from this location. Again, when food poisoning comes from vegetables there's a clear lack of washing.....gross. WASH YOUR HANDS AND WASH YOUR VEGETABLES! What restaurant gives customers food poisoning from vegetarian food?! Disgusting, I can't even imagine what the meat products do. In fact, maybe management should check out that entire kitchen or the health department because again FOOD POISONING FROM VEGETABLES ISNT NORMAL. Avoid this location unless you want to be sick.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zIjkNjVm8HxdmRemIMlaOw"
  },
  "TnKoDG8QXXCuyRSILFflDQ": {
    "date": "6/4/2018",
    "text": "The waitress was so rude.  She could have cared less, one of our orders was forgotten when our food came a guy brought it then showed up with my salad, wrong dressing .  I said I didn't want anything because everyone else was already eating. After the rest of the party was almost done he showed up and literally threw the food in the table!  No one ever checked An awful experience!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D2ZFZCUUJfeY4KwnKdcasQ"
  },
  "hQA0IQeygBPJfTsxc-8qeA": {
    "date": "8/27/2017",
    "text": "Happy Hour is awesome here. Cheap drinks and food. Service was friendly. The place inside is dark and cool..but relaxing. Will definitely return to Distill again. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f_5VRh79aew1cVWUmC1PJA"
  },
  "8Fl3GYfnKJ5H_ZwQ6lIWAQ": {
    "date": "11/21/2018",
    "text": "2nd visit to this establishment.  1st time we weren't there long enough to leave a review. 4 friends gathering for Friendsgiving should be a joyous occasion.  Nope. The bartender Ryan was quite possibly the worst we've seen in any local Vegas bar. An order of a Cosmo on the rocks was delivered appearing as pink lemonade from the \"gun\". When he was informed that it wasn't satisfactory, the attitude began. Attentiveness was abandoned and it was as if we were 4 customers with an incurable disease. Another drink was ordered and we were \"informed\" if we didn't like \"this drink\" we'd have to PAY for it, as if we couldn't scratch two nickels together. All in all, we won't be returning.  Ryan, Sir, don't get so butthurt when someone says they don't like how you made a drink.  You surely missed out on good money from us. Cheers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jhsXZfBrTyFGA2ClIjMC8Q"
  },
  "PTk3SnwfJiJcty81CogSJw": {
    "date": "8/6/2014",
    "text": "You'll need a compass and Dora the Explora's map to find this place, but it's worth the trip.   Distill is definitely going for that 30 something crowd with its old school video games and \"loungey\" vibe. This is enhanced with multiple large cozy chairs and soft couches lining one side of the bar. To quote my GF, \"it didn't feel like a sleazy Vegas bar\". This is True, the sleaze factor in here is low, but so is the excitement level...which isn't a bad thing. Sometimes you just wanna sit in a dimly lit location, drink a few craft cocktails, and just chill with friends.   The decor is modern influenced with giant letters, canvas \"paintings\" and random light bulbs on the walls that you're starting to see everywhere. Distill is also very clean, which sadly can be a troublesome thing to find with most local bars in the Valley. The staff here are super attentive and make sure you've always have something in your hand; my glass was never empty for more than a minute. I was going to give this place a 3 star rating, but the food won me over and welcomed that coveted extra star.   I'm not a big carb lover, but this place got me right in the feels; fried Mashed Potato Bites and Mini Soft Pretzel Bits, yowza! These might have had meth in them cause I just couldn't stop eating; then I found myself getting fired up when finished them. My food anger only subsided when the Seared Mahi and Carne Street Tacos were placed in front me. These were good, but I definitely have had better seared fish and street tacos. Trust me go with the Mashed Potato Bites you won't be disappointed!  If your not hungry try the \"Distiller's Delight\", a very good and refreshing drink for a whiskey based cocktail. It has Bulleit Whiskey, orange bitters, Sprite, and some other tasty items. Very good in my whiskey drinking book. Great especially after a long day in the Vegas heat.   Distill is a great spot for a laid back weekday night cap or for the upcoming football season. They have copious amounts of TVs. Party on dudes!",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 9,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "B7qYuQwmvKDOiI8XRmXR8w",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B7qYuQwmvKDOiI8XRmXR8w/o.jpg"
      },
      {
        "img_id": "itZ1icug30CPuMz_KfOlFw",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/itZ1icug30CPuMz_KfOlFw/o.jpg"
      },
      {
        "img_id": "DOkvPI9njBEaTmr4eoje5g",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DOkvPI9njBEaTmr4eoje5g/o.jpg"
      }
    ],
    "user_id": "i_DR3vdE73nVm2GlMbGpGA"
  },
  "0X2WBNbT1j2t5PAnZmFbgw": {
    "date": "7/8/2017",
    "text": "Came into the bar and patiently waited about 45 minutes before even having a bartender approach me.  After finally being given a menu and a drink waited another 25 minutes before he came back. I understand it being a little busy but at least some acknowledgement would have went a long way.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MI7IJHdWfX70XbaofFTo4Q"
  },
  "8FwRYrSV-N5PSdumuBMJ6A": {
    "date": "3/15/2018",
    "text": "We love Distill.  Great place on the family side or in the bar.  Large menu and great brews, service and food.   Try it for breakfast, lunch or dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDiu4o9QdKjQP_ccmjzu7g"
  },
  "XpJlGBX0VTffnubIY2o7IQ": {
    "date": "11/3/2017",
    "text": "JON the bartender IS THE MAN I appreciate you and the phenomenal service from everyone here from start to finish was first class i love you guys",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4b0Bcv_vA_tEZPgttfl8DQ"
  },
  "05-ytOxeYcFCFu0TbrFDUg": {
    "date": "10/31/2018",
    "text": "I usually don't take time and write a review but this place is amazing. I always get great service on all shifts but the graveyard goes above and beyond. RyanG (bartender) and Aaron (chef) are amazing. If you're getting off work after a hard day this is the only place in Southern Highlands to relax at.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "18WSordBesl3cb3ocZdSMw"
  },
  "tArUtmxX8J2vRrXaqU2z9g": {
    "date": "9/6/2017",
    "text": "This is a restaurant only review as I am normally with family for a quite dinner when I visit Distill. The best thing on the menu that I end up craving is the happy hour fried artichoke hearts. I also enjoy the rueben. I can only give it 3 stars even though I eat here often. As other reviewers have mentioned the level of service quality depends heavily on the staff that is working that evening. Some of the staff are excellent and some are not. Also the food can be somewhat hit and miss.   My wife and I agree that the salads are all very basic and not worth the money however I will reiterate that some of the more savory dishes are excellent. I love the Cure burger as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQ8LwkgXUoPgdBEyF5heTQ"
  },
  "J1rHqHJcyAAz_xWprbqruw": {
    "date": "2/24/2015",
    "text": "A huge fan of this place.  It's a great local bar with a cozy atomosphere and awesome bartenders. I come here with friends quite frequently to enjoy a few beers, play video poker, and share some pretzel bites (you have to try, they are the most addicting little nuggets - they come with the cheesiest cheese and a horseradish honey mustard). Distill is also a good spot to watch games, although it can get pretty packed like most bars.   Patrick and Mo are two of the bartenders we see a lot and they are great! Quick and readily available if we need anything. They engage with us too which always adds to our positive experiences here and are also why we enjoy coming back.   Would definitely recommend checking out Distill if you want to grab drinks and appetizers, bar food, or even dinner with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WJhQpdUHoFCtpU6gHFjVlQ"
  },
  "qkPBnix1BIydtkBcYtlPwA": {
    "date": "2/6/2018",
    "text": "Scotty G. runs a top notch place(Graveyard), as always. Perfect drinks, good machines, great food, what more can you ask for?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxyyTYuL7KrrBFg8a14bEA"
  },
  "Qpzs-eFBue7jyOB7htR_lg": {
    "date": "2/12/2017",
    "text": "This is my second time at this location and I'm so happy there is one on this part of town.  New, elegant, clean and fun!  Pool tables, and a non smoking dining area.  The service here is always on point no matter what time of day.  As far as food?  I've had a chicken wrap and built my own breakfast burrito in the middle of the day!  I love that.  Breakfast anytime is always a plus in my book.  TV's are all over the place, and you can definitely get whatever game you like on at any time.  Well over twenty beers on tap, Red Bull, crown apple and the latest and greatest.  The only downfall here is that sometimes they are too packed and if you like to gamble, it can be a bit hard.  But other than that, I typically never have anything negative to say about anyone or anything here.  Out in the middle of nowhere in southern highlands, so it's not hard to miss!  Check them out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1T-rePv-lLJDO5gVGFyfFQ"
  },
  "kC2DYZu2dv_WtvoF8lxPCQ": {
    "date": "3/12/2018",
    "text": "My husband and I have only been here a few times and the food had yet to disappoint! We got the mashed potato bites as an appetizer and shared the sliders! Great service! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGGeh-G4UUxh1QKVWcV_UQ"
  },
  "KdL_wr28Lz6pVb4tZVEf8Q": {
    "date": "1/26/2018",
    "text": "Love this place ! The food is beyond bar food! Seriously best food in the neighborhood. Staff is great especially the very attractive Nicole. Best place for lunch or a Sunday game. Ask for Nicole you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbwObZ5t-zXUO0jBj0vTZQ"
  },
  "Mu_WIneXafqGWNZrhY-fuw": {
    "date": "9/5/2018",
    "text": "First time to Vegas visiting a friend who lives in Southern Highlands. We got into town a little late so we came in for the after hours around 3am. Bar was busy and fun but that did stop Ryan the bartender getting to us right away. Ordered some food which was amazing (Ribs), the chef  Aaron brought it out with a smile and asked if we needed anything else. I recommend this bar to anyone in town locals or visiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4aQuamyMSwusWVhKTZ8ig"
  },
  "la0ZUlSRV68fTHm7RNzKwA": {
    "date": "9/3/2018",
    "text": "Great bar. Great service. Machines pay nicely!! Ryan G is the man!! Made it worth while staying here! Super attentive bartender made sure we were happy! Be back for sure!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fcwBRuyHWD3KLPRKzSEWQ"
  },
  "QJzV2R8-ggKUS_spG85a7Q": {
    "date": "11/21/2017",
    "text": "I love going to Distill because of there Wings!!!        Friendly Bartenders and waitress!!!! Enjoy watching Football on Sunday and Monday.   Smoke free dinning area is great for the whole family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUt5kjj2-MkrTNJxliqUUQ"
  },
  "XPAsQqTV9oHnhio6hbe_fg": {
    "date": "9/26/2018",
    "text": "Always surprised by this bar and its atmosphere. Ryan the bartender is always on his game when it comes to making sure everyone is having a great time and has no problems getting ride of the few that do cause problems. Best grave bar in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgJYO9PqYnUP4mWLEH8BYQ"
  },
  "B9MII7ZIlq5Xm24TjBWyDg": {
    "date": "2/6/2018",
    "text": "Nice, clean and not crowded. I went with a friend and we shared the IPA Imperial Shrimp and Avocado Egg Rolls, both were really yummy! Service was good, not great but I gambled $40 bucks, playing dollar hands and they didnt comp even 1 of our 6 drinks....last time we played $50 each and not a single comp as well. Like...not even 1 drink? Won't go back again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xf05MTuWj2iLaSwLbhU0dw"
  },
  "WyH7HPjux_hhInb5L_000A": {
    "date": "7/20/2017",
    "text": "Come and check out Distill in Southern Highlands. The food is wonderful the drinks are great! The bartender Chelsi couldn't be any sweeter!! She is always a joy to be around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bv71gjKmUWTSKcCQUxlwRQ",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bv71gjKmUWTSKcCQUxlwRQ/o.jpg"
      }
    ],
    "user_id": "OS4BsiHBdrnAn0Qn5Gz5YQ"
  },
  "dhxCpOXI9R-ZFCTTwX_Zrw": {
    "date": "12/27/2017",
    "text": "Used to like coming here for football....Unfortunately, it's NHL season too, if I wanted every TV in the bar to be on NHL, I would go to the game!!! Now, it's college football bowl season and every TV except 1 is on NHL. Time to find a better bar!! Oh....and the men's toilet has been leaking for at least 6 months.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9rSSwmD_xRnSFirMn3e4A"
  },
  "074bC6KkZUhZkI4TPK4L7g": {
    "date": "12/6/2015",
    "text": "Been here the last 3 Sunday's it's usually pretty busy but great atmosphere bartenders do a really good job keeping up with the flow of business I never had to ask for refill on my drink they were on top of it! Which is impressive considering how busy they get. Brittney has been great very friendly and helpful. Shaun is equally awesome and very funny they compliment each other very well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EtvYSMIuGhS8xmp3KR6JKw"
  },
  "-UrrmKxXOhwJr6BBW8PyCw": {
    "date": "9/18/2015",
    "text": "Great, laid back spot. The wings were awesome ! Excellent service, what more can you ask for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6ymJMv36VX62JIzj3ciGg"
  },
  "a3ZQzOgMpvURt23ZT06fig": {
    "date": "8/1/2015",
    "text": "I was disappointed with the meal I had on my recent visit. I have come to accept that this establishment is best left for drinks and fried bar food appetizers (French fries, wings, etc..) Entrees...not so much!! I ordered the steak with demi-glaze that came with a medley of roasted potatoes (red, purple & sweet potatoes) and grilled asparagus. I ordered the steak medium rare & it came medium. I had to send it back. The second steak came back a True medium rare. The steak was \"tough\" though...like from it being frozen too long & then defrosted days prior to cooking. It did not have that \"fresh meat\" taste. The demi-glaze was a little too salty & the asparagus looked & tasted like they had been frozen & not fresh prior to cooking as well. I was disappointed. On the bright side: the potato medley was good as well as the side Caesar salad. Stick with the traditional bar foods & skip the entrees. Also, stay away from the ahi tuna...does not taste fresh & has a metallic fishy aftertaste. I have ordered it twice & experienced the same problem.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RBnjbf0wG_ymIX9FbF8rYg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Caesar Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RBnjbf0wG_ymIX9FbF8rYg/o.jpg"
      },
      {
        "img_id": "y0_l2OHpoffH0mYKSmIlTg",
        "caption": "Photo of Distill - Southern Highlands - Las Vegas, NV, United States. Steak with Demi-Glaze served with potato medley &amp;amp; roasted asparagus.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y0_l2OHpoffH0mYKSmIlTg/o.jpg"
      }
    ],
    "user_id": "82kxXl_1K8M3cU66dhB8lw"
  },
  "m1HHmEJfJK8CMDt7GxYeag": {
    "date": "4/24/2016",
    "text": "Atmosphere was good. Fun pool table. Decent happy hour. The food looked amazing at first. Chicken fried steak and the 90s fatboy burger were good but after I had the burger I got insanely sick. I feel like there was a poor preparation of the meat and mishandling of the avocado in the burger. I don't know if I would consider going back if they don't know how to properly cook and prepare food",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "opnHNc9X83Kpx6JmL4fuSw"
  },
  "b_t4AlS26i_b4cU1ghbtlw": {
    "date": "10/21/2015",
    "text": "Eliot & Jon!           They are both awesome Bartenders. Have the best personalities and always on top of their customers. You get greeted as soon as you walk in the door.       The last time I was here was probably about four months ago. I was here with my girl friend and it took 20 mins to get a greeting and finally took our drink order. Then it took another 20 mins to just get a menu. And they weren't that busy and there was three bartenders and two servers working that night.   But since then I've had a wonderful experience here and will come here more often now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aHMAQdj4hCjW5FOZ1ggMyw"
  },
  "wnPX5jhXjdTmxcUBdUFPGg": {
    "date": "5/21/2016",
    "text": "First time at Distill.  We ordered off the happy hour menu.  We were not disappointed!  Decided on the Mashed Potato Bites, which we never had before, and they were amazing!!  Came with ranch and another dipping sauce with chipotle base (I'm guessing).  Also, I ordered the Chicken Quesadilla which was blissfully delicious!  The combination of flavors included a little spice , pico de Gallo, cheeses some herbs and a whole lot of taste! I will frequent the place and enjoy the ambiance of a locals bar, friendly welcome of the bartender Elliot, and the quality of good food at great happy hour prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w1n5BvmEuM7c81h1oTTv0g"
  },
  "hbqyklJXc_SQ4S6lOLyKng": {
    "date": "9/1/2014",
    "text": "Has the potential to be awesome, but unfortunately extremely disappointing.  Bartenders were awful, not nice, and had no idea what they were doing. Medium rare burger came out well done, with cold fries. It wasn't even busy in there and the whole staff looked flustered. Will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "-1ksPJf0Eppmxj9ZNCkMRw"
  },
  "FZJb48nKxYjDgE7nB59KCA": {
    "date": "2/27/2015",
    "text": "My husband and I love this place! It has a great atmosphere. Great service, great drinks. They play good music and the slot machines aren't bad. Sometimes we do very well. The bread pudding is phenomenal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvwgyvbnn6pjn4n6AryZVw"
  },
  "B0LiqhYAFJO-b4BzUDLfHg": {
    "date": "3/17/2015",
    "text": "If you love smelling like an ashtray then this is your place. Smokers paradise and no ventilation.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtWZIOklPpj5UjLuIk8ADg"
  },
  "6zt_4A1PtrERi7pzav2lXA": {
    "date": "12/22/2014",
    "text": "Great service, loose machines, good food, cool atmosphere. What more do you want in a local bar! Also music on point!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvOOuw79pEMXQ0nI5DHQjA"
  },
  "94IXPUr7ljf03AZr5ykNig": {
    "date": "7/22/2014",
    "text": "This is the worst bar I've ever been to. I was looking forward to checking it out, but was extremely disappointed. It took ten minutes for us to be acknowledged, and when we finally were, I didn't even receive my drink at all. We were planning on ordering food, but couldn't get anyone to take our order. So after waiting for our bill for another twenty minutes, we left and will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 1
    },
    "photos": [],
    "user_id": "xOfgabh7eRlllaVZMDIxjg"
  },
  "SXnDLyxWPeAKUXoamMc0KQ": {
    "date": "7/22/2014",
    "text": "The one star is because that's the absolute minimum I can give. Sat at the bar near the POS for fifteen minutes, watching other guests who arrived after me receive immediate service. Finally was able to place an order, which the bartender Chris got wrong when he was repeating it back to me. He forgot to bring my girlfriend's drink, and we waited an eternity for the bill. I can't stress enough how angry I am to receive such dismal service. Will not be back.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "e5TE9m_cgKYyq4kJf9CRzw"
  },
  "dcJDpCtKTVBt1zDH86bx0g": {
    "date": "8/31/2014",
    "text": "The service was terrible! I went with a group of friends for a bon voyage lunch. It took them almost an hour to get me my iced tea. We had to practically beg for silverware.  Our food arrived after about 40 minutes.  They completely forgot one of our group members order and they charged an extra 1.50 to someone who ordered extra gravy. Despite everything we went through the servers did not so much as demonstrate a hint of empathy. They didn't seem to care at all. That was the worst part if it. I am not exagerating. I definitely will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "5o0m_NwV46iCkXD9c1PTTw"
  },
  "0_GHJCusCSTk32jHGBqz6g": {
    "date": "8/30/2014",
    "text": "We love the food, our second time here. Unfortunately, we sat at the bar and the people just not friendly. We sat at the bar and I think the guys name is Chris, very antisocial, etc. But at least the food is great",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMLE55W0-ZAnf2J1np1tUw"
  },
  "iVX4qBW9HgGCWvDLECm7Zg": {
    "date": "10/31/2015",
    "text": "Have tried to give this place a chance too many times with zero improvement!!! Food = average Bartenders & waitstaff = poor",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1lP3uywTnSZkKyz6LVp8w"
  },
  "sP3AaSYlaFcwPsCzZM-pAA": {
    "date": "10/16/2014",
    "text": "Sitting at the bar with an empty bucket over 10 mins is never a good sign of service. Needs help with recognizing customers needs over fraternization",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1zQi7Njha0-qpGoh6f3TA"
  },
  "KOkq_oU9Q2xlJxEWqsR2rw": {
    "date": "1/26/2016",
    "text": "Very good menu and food!  Wonderful Chef!  My son Always asks me to bring him here to eat.  We have yet to be dissatisfied as it is usually to dine in when we do stop by!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hqxLRdsHX5zoFIaVjbfLg"
  },
  "4U43my6aUVNXGM8NSx37kQ": {
    "date": "10/16/2015",
    "text": "I love hanging out here! All of the bartenders are on point. Great food, great atmosphere, and amazing people. So happy this place opened up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWPAnwbi3p4wZ0zlFxq2gQ"
  },
  "tX1jA7duDnrwl8KoNubezg": {
    "date": "9/6/2014",
    "text": "So we are local Southern Highlands residents since 2001 and we were excited to see Distill open up.  A new bar and restaurant so close to home. So the good news...great sports bar.   Cold beer, great setup, nice servers, clean, open and airy!  Perfect local hangout.   The bad news. ..The food is HORRIBLE...ordered pretzel bites and medium wings.  Pretzel bites were clearly frozen and reheated, gloppy poor excuse for cheddar cheese and a disgusting \"homemade\" beer mustard that was a soupy gross mess...sent that back.  Wings were ok...sauce was a little too vinegary.   Ordered avocado egg rolls at Servers recommendation. ..bad idea...it was a wonton wrapper filled with guacamole. ..looked gross...kinda like baby poop in a wonton wrapper.  Had zero texture and was just gross.  So we will be back for beer and cocktails..only.  Sadly I feel like they could have done better.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eq1EdGxvhcTlslhgFf9I_A"
  },
  "KGpHpMbISEnLN6sSmZm3gA": {
    "date": "12/10/2015",
    "text": "Had a great time! Good service! The mashed potato bites were fabulous! My friends had mozzarella sticks and Ahi Tuna and both of them raved about their appetizers. Our server was very friendly, helpful, and attentive and looked festive with her red Santa sweat shirt! I would definitely return to eat at Distill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXUshuAYcyuL8z9caf4ZAQ"
  },
  "LeT9nH1s-HXWPzPJtFw7tQ": {
    "date": "8/26/2014",
    "text": "After reading some of the mixed reviews we decided to check out Distill for ourselves. Things started out great but quickly went downhill. First off the place is nice with a huge bar area and lots of TV screens. We sat in the restaurant area during happy hour and started with the Mashed Potato bites-and they were great, had a couple of HH beers and wells drinks to go with our food. We all got different sliders with sweet potato fires. One of the fries was very dark and the others which looked freshly made were hot but loaded with salt. The sliders could have been made out of cardboard as we never tasted anything so dry. The chicken cordon blu sliders was a chicken tender topped with the driest ham ever. We could barely eat any of them and decided to take them home to the dog and see if he could choke them down. Our waitress disappeared after we got our food and we sat for at least 10 minutes before we asked another waitress for to-go boxes.  When the bill came it was wrong-our HH drinks were at full price, when she came back with a \"corrected\" bill it had some of the drinks corrected but added another at full price. Not wanting to waste anymore time  waiting for a correct bill,we deducted the overcharge from our bill out of the waitress's tip and left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "535H0AVY41CWfHGjYhEoKQ"
  }
}