{
  "lIhLfsx0gWpXZaw-0kf1qQ": {
    "date": "5/13/2018",
    "text": "Sushi was great for the price.  Not a ton of ambience but lots of variety, fresh tasting and delicious. Friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KeJlFtXAr7qjhaUQiN3tHQ"
  },
  "mERzvCDssuWdLlvoPH0DLg": {
    "date": "7/2/2018",
    "text": "Definitely a jewel in the rough (the rough being a Target parking lot/strip mall). The rolls are power houses and the service is spectacular. Plus, if you buy the special rolls, it's buy two get one free, so you can really check out the interesting ones on the menu and take some chances. Definitely a great/budget friendly place for casual dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GG_dZ5QWa9-3r90rIuYbQA"
  },
  "NZafjpF-IIi9i_ZhZIGwrw": {
    "date": "8/14/2016",
    "text": "I am a regular.  We know sushi.  We have been to all the the top Las Vegas places on the strip.  In all honesty there isn't a place that can beat Sawa Sushi.  The owner is a super nice guy.  Knows where to get the best quality pieces of meat.  We literally eat at Sawa and the next day we were on the strip and tried a top sushi place.  Didn't even compare.  Consider this your Las Vegas insider tip. Sawa Sushi is the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xWssiWv-39wNfzFGaawQNw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Fresh ahi is about as good as it gets",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xWssiWv-39wNfzFGaawQNw/o.jpg"
      },
      {
        "img_id": "aqX_4E3OeQKnbVY7iwaxaA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aqX_4E3OeQKnbVY7iwaxaA/o.jpg"
      }
    ],
    "user_id": "Wb-knmSJqSGoehcL_d8LGw"
  },
  "i2UQp0Q1X_CJQ3YT4Oahxg": {
    "date": "12/27/2016",
    "text": "Um, 5 blue point oysters for $6.95!!???!!!???? Heck yes!! And they had an incredible light sauce on top. I'm coming back here for just them. And they have a great \"buy 2, get one free\" on the special rolls, which are a decent portion size. Spicy garlic edamame was perfect too. Quality and service was spot on. Coming back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hgk9BMafxbJRrXraJR22PQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Coconut shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hgk9BMafxbJRrXraJR22PQ/o.jpg"
      }
    ],
    "user_id": "bWd-qkqysfWuLKJ-dqlgRA"
  },
  "wxpN9vlvJCoK3OlNAKaQBw": {
    "date": "7/28/2016",
    "text": "This place serves really good food at a very reasonable price. Operated by Japanese, staff are polite, and it's clean. We ordered a Teriyaki Salmon Bento and 2 rolls special with Spicy Tuna and spicy Scallop roll all for under 20 bucks. The teriyaki sauce is by far the best that I've ever tasted in long long time, tempura in the bento were perfectly made, I would say, food made with heart. If you are around area and like Japanese food, this place is a no brainier. Definitely gonna come back for other stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x2f4ZO9ns75jv0IO_OSzzg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sushi counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x2f4ZO9ns75jv0IO_OSzzg/o.jpg"
      }
    ],
    "user_id": "YHxp9jy4RudoEprj9wRrwA"
  },
  "OFMgYs_21z98G0Szij0JeQ": {
    "date": "8/5/2017",
    "text": "I absolutely love this place! My family and I have been coming here since the beginning! They always remember who we are. Great friendly family place with even greater food! I love the all the rolls here and always get SUPER FULL!! Thank you sawa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3z6fu5aZWG68fj4zbka_mg"
  },
  "1MIE0ET_GGuSx8PrnoFheQ": {
    "date": "5/12/2016",
    "text": "Walked in with my daughter and sat at a small table. The waitress was great. I got the Japanese Lasagna and In & Out roll. She recommended the Volcano Roll since the rolls are Buy Two, Get One Free. The first one that she brought over was the Japanese Lasagna. It was delicious! Even my 1 year old loved it. The 2nd roll was the Volcano, and that was by far my favorite of the 3. The In & Out roll was very good too. This place is near my home and I will definitely be back. The service was fast and great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MH825INVEnkbmFbmxrbKcA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. In &amp;amp; Out",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MH825INVEnkbmFbmxrbKcA/o.jpg"
      },
      {
        "img_id": "CJu-C9k9uaruu9r0K5k5hg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Volcano....soooo delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CJu-C9k9uaruu9r0K5k5hg/o.jpg"
      },
      {
        "img_id": "bpbdnMDjQOiIOx3qYeoc4A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Japanese Lasagna! Another favorite",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bpbdnMDjQOiIOx3qYeoc4A/o.jpg"
      }
    ],
    "user_id": "xTBUId9XTSXh6ZNgz_GPjQ"
  },
  "luv0H-SnzBp7--jMEzBzRQ": {
    "date": "4/1/2015",
    "text": "Quality and freshness wise I would say this place is on par with the \"all you can eat\" deals you find all around town here.  I thought the portions are a bit small considering the prices.   They are running a buy 3 speciality rolls for the price of 2 as a grand opening special. If you're able to take advantage of the special deal, the place seems more worthwhile. I don't recall seeing if they offered an AYCE option at this place.   Service was fine, servers were helpful, courteous, and attentive.   I've not had a chance to try the bento boxes or salads, ultimately I will be returning for another meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3A7EEiQ5Q-M9pkrsxW0xfw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3A7EEiQ5Q-M9pkrsxW0xfw/o.jpg"
      },
      {
        "img_id": "pnrZkFYZ1OaTjwFZAHa8Bg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. &amp;#34;Aloha&amp;#34; roll, $11.75, delicious.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pnrZkFYZ1OaTjwFZAHa8Bg/o.jpg"
      },
      {
        "img_id": "0LKCpP4s9PHuRfEL1A_3Yg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. &amp;#34;Mistake&amp;#34; roll, this was uniquely made with sticky rice, $9.50",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0LKCpP4s9PHuRfEL1A_3Yg/o.jpg"
      }
    ],
    "user_id": "qy0Ujcv9-t_pnQ1w5QJgcQ"
  },
  "QPBrvNd8ClTIsrloR8wNew": {
    "date": "5/28/2016",
    "text": "We have forever been an I Love Sushi and only I Love Sushi fan until a co-worker told us about this place. First of all free sake with a large Sapporo then buy 2 get 1 free on all rolls. It was fantastic. Good service. Great fresh sushi especially for my special requests. We highly recommend this place for delicious sushi !!  ~ a self admitted sushi snob!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxiOt0Ci30S8g52sO9q_YQ"
  },
  "KTHo6aXbBb-oPPbNbrq8sw": {
    "date": "2/20/2016",
    "text": "This place is my new go to sushi spot. Not only was it delicious but everyone there were so welcoming and friendly  AND it's right down the street from me. Dangerous, but oh so good!! They had a buy 2 get one free special. I had their Red Volcano, Japanese Lasagna and one with scallops on top (sorry, can't remember the name). I'm sure regardless of what you order, it'll be just as good.  I ended the night with some yummy fried banana and green tea ice cream. Great, now I'm craving for more sushi from this place.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tU2qGSudL7R9JWR92RXwwg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Yum. You&amp;#39;re welcome.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tU2qGSudL7R9JWR92RXwwg/o.jpg"
      }
    ],
    "user_id": "VJkOegC9kOv4cnX52cduYg"
  },
  "4KYda0oz-NarLxorgek_vQ": {
    "date": "8/4/2017",
    "text": "Best place ever. Britt you Rock. This sushi place has the best fresh quality fish. Amazingggggggg",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOOnVcro2vvCggqkNELJCQ"
  },
  "ZxnzdXUNMA8sLrXATx_M_A": {
    "date": "7/11/2017",
    "text": "Went to see what Sawa was about pulled up and a sign on the door saying we will be closed on 7/11/17 with no reason given they did not update their yelp to show they were closed and we drove all the way over for no reason.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ka2VMEwLf_uZuRAxGSRZlg"
  },
  "SGRzRH1LgQuv_c7e_SQXpw": {
    "date": "12/13/2016",
    "text": "The food was quickly served, the fried items were hot and crispy, appetizers we had were awesome. Flavor and texture on Gioza was right on the money, the Adamame was hot and perfectly seasoned. We came in for a simple lunch and ended with a experience. We enjoyed the Bento plates. My wife and daughter enjoyed the Salmon and I had the tongkatsu element choices for us. Very well priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fe7cNj_ySXNEnpTcsNhnUA"
  },
  "2aIaR2macC0YTAvH8erSyQ": {
    "date": "6/25/2016",
    "text": "Ugh, what more can I say? Always come here for the fresh sashimi, Shikoku shooters and whatever else after that....Oops, forgot about the amazing service from Steve, Feng & Meetchi and Brandi three thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jcy_qPVXurrG8-yOpNEoDQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Shikoku oyster shooter with Hirame (flounder) sashimi . In my small heaven right now",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jcy_qPVXurrG8-yOpNEoDQ/o.jpg"
      },
      {
        "img_id": "cJrlhlksyMgSfsHG8JS9NQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Super #yummy #sashimi #tuna #salmon #yellowtail &amp;amp; #Japanese #fresh #redsnapper #addicted  #chefsteve #cheffeng super server #meetchi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cJrlhlksyMgSfsHG8JS9NQ/o.jpg"
      }
    ],
    "user_id": "fX6gIKx7anuGUSqmkUUJ9w"
  },
  "W2ITNOnieZFtQQUb1mRscQ": {
    "date": "6/13/2017",
    "text": "Awesome place, friendly people and just outstanding food, I will defiantly be back when I'm back in town. Thank you Sawa Sushi!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M8467WE9QE9twnd8XnrTog"
  },
  "5_Y5JrGholBJ-xOSsOUKNw": {
    "date": "4/15/2016",
    "text": "Excellent! We drove by Sawa Sushi and spontaneously decided to give it a try and are so very glad we did. Great service, delicious food (we tried Sushi & Bento Box)  Chef/owner is a humble happy man.  Absolutely recommendable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Plk-GgQVC3vBJTpVEj1Q-g"
  },
  "H5mWwi5Mp2bLiBkfo_gs-g": {
    "date": "2/24/2016",
    "text": "This will be our new sushi place to go! They may not have all you can eat but they have a boat for $40... which is cheaper when you look at quality.  Very friendly and yummy food.... I am sold!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bGNNgnOyhL4PghbBXaaiUQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bGNNgnOyhL4PghbBXaaiUQ/o.jpg"
      }
    ],
    "user_id": "bxPlCsoHCIOrBl0wmno4Wg"
  },
  "aMu96rRXojh5I-J8T6bcSg": {
    "date": "8/7/2017",
    "text": "LOVE coming here! The service is always speedy and friendly, and the food is always fresh. Love the large Sapporo and free sake, and the buy two rolls, get one free.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9ze6GOqwaD300lSAnCVuw"
  },
  "1hc7euLYmglw_c_z8xhoUg": {
    "date": "5/1/2016",
    "text": "Checking for a great sushi place in South Las Vegas we came across this great find!  The Sushi Chefs and waitresses greeted us as we walked in the door.  The rolls were fantastic and the sushi was amazing.   We had 6 rolls between the 4 of us dining and each one was awesome.  5 stars for the Dragon, Rainbow, Garlic Albacore, (2) Red Volcano, and Spicy Lobster Rolls - all highly recommended! Can't wait to come back and it may be tomorrow night.  Simply stated:  Great atmosphere, great service and great sushi!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C0FpNYpvnsCygBhup1byLw"
  },
  "AylFVxqv0MUYCDmm7EFsxA": {
    "date": "7/30/2017",
    "text": "This is one of the best sushi places we have tried in Las Vegas. Nice small location. Great specials on food and drinks. We will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMSRoQFI8pgrcUJ9PIUzsA"
  },
  "cwXD8BnibURePrhydQwqsQ": {
    "date": "11/15/2017",
    "text": "This is now one of my new favorite neighborhood sushi places. It is easy to miss this little restaurant as it is swallowed up by a huge strip mall boasting a Target, Kohls, Big Lots and many more large retailers and fast food franchises alike. It is tucked away next to Kosters finance on Blue Diamond between Arville and Decatur. They have a great lunch menu offering bento boxes, sushi specials and the usual protein or veggies with teriyaki sauce and the fixings of miso soup and salad. They do not offer AYCE but their speciality rolls are buy 2 get 1 free making it very reasonably priced without the pressure of stuffing your face to get your money's worth out of AYCE prices. The fish is fresh, and rolls  wonderfully crafted with the right amount of rice to fish ratio. They also have a special on their beverages; buy one large Sapporo and get a free bottle of sake to share. The rolls vary in price, but average at about $10/$11 per roll.. of course if taking advantage of their special that brings the average prices down by a bit. The staff is courteous and attentive and the restaurant appears clean with simple, modern decor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "7tpZVkiYuMbDP4-NufK2Iw"
  },
  "BJp8Z8FM82Df1dbSTBjvag": {
    "date": "1/18/2017",
    "text": "Our first time visiting, have been wanting to try them since they opened. We went in for lunch around the holidays. It was pretty dead, so we got great service. We got the buy two rolls get the third free (In and Out Roll, Winter Roll and Crunch Shrimp Roll) and an order of Jalapeno Tuna Poppers (not sure what they call them). Everything was really good. I can't wait to go back and try some more. Prices on par with most for a Special Sushi Roll.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "DoRCeCcJbrsM2BiAKj3trA"
  },
  "_8fCehGwb3WChdba5moQCw": {
    "date": "4/4/2018",
    "text": "I have never had such bad service...  delivered our food to another table that had just walked in and haven't even ordered yet.. then tried to redeliver to us as it sat at their table for 2 mins... next when we asked about swapping sashimi... she delivered it with the wrong fish..... we said we only wanted it if we cld have it with octopus, she never asked just delivered it without the octopus..  I ordered there special that comes with a beer and hot sake.. she delivered the beer with a warm glass .. and the hot sake never came out as we sat there for 10 mins..  When we watched new guests come in and order the same drink special.. they got icy glasses for their beer.  The manager was a joke and wasn't any help. We go 3 times a month and the last waitress was amazing... it's the worst service I have ever had.. we won't be going back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDbistDIZsXKYyKPT2Vl2g"
  },
  "oBDXjxa5WT3OCbNueApC_w": {
    "date": "6/12/2017",
    "text": "Great Spot Good food...enjoyed the Bento Box Great Value for the Money Good atmosphere as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aLA-EpjBroULLP1ZiFyNwg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Fried Bananas  And Green Tea Ice Cream  Yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aLA-EpjBroULLP1ZiFyNwg/o.jpg"
      }
    ],
    "user_id": "bwhT5K1ypyQpNiBeJFHuog"
  },
  "yaOlpVhXk6uMp32YoLMZKQ": {
    "date": "7/7/2018",
    "text": "We tried this place for the first time and it was really good! The steamed shumai was delicious, and the dipping sauce was spot on. The cucumber salad was refreshing and the crab on top was a nice touch. We did the 2 for 3 special rolls and they were all good. The Red Volcano was both of our favorites...just the right amount of spice. The coconut shrimp roll was different and unexpectedly tasty...the coconut flakes on top were a nice touch. The shrimp lovers was a nice, standard roll. We'll definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "umJ54bzxoDsY2DSKlSrDaw"
  },
  "i03iQBY7tBhZ3XJV75k5TQ": {
    "date": "8/17/2018",
    "text": "Been coming here for awhile. The sushi is good as well as the service.  My only complaint is the annoying loud hip hop music with expletive lyrics that plays whether it's an early lunch or dinner.  It's on every time too. Super annoying!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OSd5tjLtGHT5SKO8P2TZ0Q"
  },
  "4CrFGY3bXg2UrcFeOiJlow": {
    "date": "7/2/2017",
    "text": "This is my first time here and it's really amazing wow!  It's delicious!  The food was FRESHLY PREPARED and  the food was delicious! Came here to visit Las Vegas and was craving sushi!    Here some photos of the amazing food!  If you're craving sushi this is the place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PRYk6-MlgKIXo4WC-uLmtw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PRYk6-MlgKIXo4WC-uLmtw/o.jpg"
      },
      {
        "img_id": "AWWvrpY7ikKqbpu-h83UyA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AWWvrpY7ikKqbpu-h83UyA/o.jpg"
      },
      {
        "img_id": "MXc5_dUbB37DDQ4O1BxcVw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MXc5_dUbB37DDQ4O1BxcVw/o.jpg"
      }
    ],
    "user_id": "5btPi5FsRYhyU3VDTEr49g"
  },
  "b9nTo-X9mYj8pFvOCk86lw": {
    "date": "4/17/2017",
    "text": "First time here, very nice fresh and will come back, had the Salmon Bento box. My wife have the beef teriyaki box, plenty of food and prices are very reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Qv8h86P0jf_10dR73mvDA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Qv8h86P0jf_10dR73mvDA/o.jpg"
      },
      {
        "img_id": "sJIcq--3Q16ad2OlZl9M9w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sJIcq--3Q16ad2OlZl9M9w/o.jpg"
      }
    ],
    "user_id": "s-vyjNZQKZyJS57t6Jivyg"
  },
  "g5Kq0-27PmofJZlHzT4wfw": {
    "date": "3/1/2018",
    "text": "Convenient location. Food comes out fresh and hot. Love the Buy 2 get 1 free sushi rolls and you can mix and match. Friendly waiter. Pretty small location  so try not to come with party of 15 at that point you should buy the spot out for an hour . ( got greedy and stoped taking photos but these were pretty delish)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qk5lzhm6_RMdvsx0DqQaqQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qk5lzhm6_RMdvsx0DqQaqQ/o.jpg"
      },
      {
        "img_id": "0CfnLFSdYPdESwzrQZlErA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0CfnLFSdYPdESwzrQZlErA/o.jpg"
      }
    ],
    "user_id": "1Bn90QO4jP5QTSazfsB8Fw"
  },
  "03NJKzOKincMQCqBJ2iU4A": {
    "date": "10/23/2016",
    "text": "The place is small but nicely decorated, great atmosphere and comfortable. Our server was a nice lady - we think she was Japanese. And that made me all excited because it's gotta be authentic! Most sushi restaurants here now are mostly own by Korean or Mexican sushi chef, although that's not necessarily bad at all but I'm just saying I'm expecting something authentic here at Sawa.   However, I'm extremely disappointed at their sushi. It was very tiny and seemed poorly made. I said that because in Las Vegas now there's AYCE sushi everywhere. If you're not doing AYCE, you should provide higher quality or quantity of ingredients, and better presentation. For what I'm paying for, I wasn't satisfied with my sushi at Sawa.   I ordered 3 different sushi, but they were made and delivered in 3 separate times. I have never been to a place that done that unless I sat at sushi bar, which felt little odd. So they were just tiny sushi, tiny fish on top, and no presentation what so ever. The fish was good though very fresh.  We also ordered hamachi kama. That was very very good. I would recommend order this instead of sushi for sure.  Hot tea is NOT complimentary - it's $2.25 per person. It was authentic good quality matcha.   So if I'm craving for sushi - If I'm really hungry I would go somewhere AYCE. If I'm just having a little crave for raw fish, I would go for Soho because they're always generous on their portion with great quality. I wouldn't come back for sushi at Sawa again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yeYsJ1mfWJKEAIRzuF_dAA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Hamachi Kama - YUMMM",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yeYsJ1mfWJKEAIRzuF_dAA/o.jpg"
      },
      {
        "img_id": "dk1Hzif0u398V4U2COhHuA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Fatty Salmon / Yellowtail / Smelt Eggs Sushi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dk1Hzif0u398V4U2COhHuA/o.jpg"
      }
    ],
    "user_id": "_KJRnZAxwEPyPhgJzQOxYA"
  },
  "Su3lnannRtEKW_rBw6XFuA": {
    "date": "7/3/2018",
    "text": "We have come here at least once a week for a while now. It's our neighborhood go to! It is very clean and everyone there is so friendly best of all the food is delicious!! Best deal in town is the Bento box lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lmy1D_bXZEIV-7BgklI7sg"
  },
  "SpbKqugIXNmgxawLBAj5SQ": {
    "date": "2/13/2019",
    "text": "Delicious sushi. Very fresh. Very fast. Good buy 2 get 3 special rolls deal. The Snow White and Aloha rolls were so fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8ViMRhFt5fF3HVUJvp--w"
  },
  "zV8qWyk7U_1ImgkiVeIQpg": {
    "date": "3/10/2019",
    "text": "Really cute location in the Target shopping area. Johnny Roll was good. Great service and rolls came out very quickly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bKf9vCjQq3dccTYcG6j-TA"
  },
  "CaLkSQHQh2GpVcHq_dcI4A": {
    "date": "2/8/2019",
    "text": "Awesome service. The soft shell crab was especially delicious. The bento box came with a great amount of food. Menu is a bit pricey, but the experience overall was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3enM1Jx0N1zuzqom97NfBQ"
  },
  "irHQhGi5DMRFFx4ZUHvmZg": {
    "date": "10/13/2017",
    "text": "Unbelievable! Can't describe the food enough to do it justice. It was so full of flavor and freshness that even after I was full I was still trying to eat more! The service was fantastic! Beyond words! We are 'out of towners' and swear we'll come back just for the food here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fIP_QAaoikwxbbhdbuAH9g",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fIP_QAaoikwxbbhdbuAH9g/o.jpg"
      },
      {
        "img_id": "R8qJJlltxtpJdHisH-_JiQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R8qJJlltxtpJdHisH-_JiQ/o.jpg"
      },
      {
        "img_id": "MNybwrITWUsAG2RsFUjnnA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MNybwrITWUsAG2RsFUjnnA/o.jpg"
      }
    ],
    "user_id": "vBbYLWdvuGjRml8t53pazA"
  },
  "03Q4unlQRVrxydewHIf09A": {
    "date": "8/28/2018",
    "text": "Excellent sushi, very friendly and prompt service. Lunch special can't be beat, definitely a place to visit if you are hungry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QEDqnakOpIcNDNhcu6EMng"
  },
  "zOEukcgCBq7sd27bshsCLg": {
    "date": "11/13/2017",
    "text": "I came here for the first time to order lunch special Togo. I came home disappointed. Whoever pack the food are sloppy. The sauce got all over the rice. We order 2 beef teriyaki and the beef portion was so little for $10. Would not recommend this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L1xP8l922MijHMgEI2eyig",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L1xP8l922MijHMgEI2eyig/o.jpg"
      }
    ],
    "user_id": "iWnlJmMBJw5ELJP8Mu1qDQ"
  },
  "cqcR52qtobhbeTkDqQ-V5w": {
    "date": "10/8/2015",
    "text": "Ok, this place is small and unassuming...located in a strip mall in front of Target!  You might miss it if you are not looking for it!  That is where I wonder whether I should Yelp this from the rooftops...or stealth Yelp to only my dearest!    So, let's start with Michi...amazing service!  She makes you feel like the chef is working just for you!  So very attentive..never a glass empty...never a dirty plate to linger...wish I could take her home!  The sushi was absolutely out of this world! I could not ask for anything better! Fresh, well-managed, so flavorful! They have specials buy two rolls can't one for me! Appetizers are perfect! We really enjoyed The spicy garlic edamame  and then we ordered the Ichi Bon, spicy garlic albacore roll and the red rock volcano roll! All of them absolutely delicious!  Super Secret yelp tip!! Try fresh wasabi root! Really makes your food Pop! This place offers it and doesn't charge extra! At Nobu it's $12! Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IZLVqaDbTlRyl4ZAd-uBHg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Yum yum scallop hand rolls!  One on soy...sorry one has a bite out it!  Couldn&amp;#39;t wait for the picture!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IZLVqaDbTlRyl4ZAd-uBHg/o.jpg"
      },
      {
        "img_id": "9fe23iqYTyyJbVk6A36_Lg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Red Volcano roll!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9fe23iqYTyyJbVk6A36_Lg/o.jpg"
      },
      {
        "img_id": "Bz3A89MjVMkhh8hkuwVBSg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Ichiban Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bz3A89MjVMkhh8hkuwVBSg/o.jpg"
      }
    ],
    "user_id": "ATb8ZtptDb2jH3P4L6YP5w"
  },
  "icnkkY8kqKeZwK2pG3prMw": {
    "date": "7/8/2018",
    "text": "Sushi was good until I saw the sushi chef was on his iPhone at service in front of me and my wife! I ask the waitress if he is the owner? She replied yes, this is the most disgusting thing I have ever seen  the chef was using his iPhone in front of guests  at the sushi counter.  Are you kidding me?!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "StazLzgpxTp-hzdHohoEtA"
  },
  "9_uaWX0uR9IvCe_SWaeWVg": {
    "date": "7/30/2016",
    "text": "Its one of those ideal hole in the wall restaurants, doesnt look much from the outside, but the ambiance inside is a game changer. The oriental feel, the sushi chef within eyes length, the friendly staff, coupled with amazing food, is a well-earned 5 star.   PS. Their Las Vegas Roll is AHHmazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "6PEdPk7tTqbjtybVtdSsJA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6PEdPk7tTqbjtybVtdSsJA/o.jpg"
      },
      {
        "img_id": "PMrj18Ji-Uv0Xkc2fRApsA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PMrj18Ji-Uv0Xkc2fRApsA/o.jpg"
      }
    ],
    "user_id": "2jaFhftqpph7X3bB1_fYHw"
  },
  "7SgLVKWgeEOtvdg3OvamQA": {
    "date": "1/12/2016",
    "text": "This place is so good! Great customer service. My husband and I go gee often. We love to get the Snow White roll. It's amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XwUE2W8FhjewkUSKYFZg5Q"
  },
  "imnPtWjKTEEX0xAUVWG9hg": {
    "date": "3/9/2016",
    "text": "By far one of the best quality sushi places we have ever been to. Good service. Great sushi. Fresh. Great portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BzBMvq3hfe4hbqwtwxCUnA"
  },
  "31vyEQAU-0HOTjH21XVoug": {
    "date": "6/15/2016",
    "text": "Decent for the price but the server and the owners are really nice and friendly but the fried tempura kind of sucks besides that the sushi is good",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GYnP9_1iqQngWZ-7cZbWHg"
  },
  "yjr83U-gU0VQwPNvh8AZNQ": {
    "date": "7/24/2015",
    "text": "Who knows how it is?  I came in, sat down at 2pm. Only 2 other tables occupied. Was handed a menu. And never saw a waitress again. Waited about 5 minutes. Then I left.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "750rhwO7D_Cul7_GtO9Jsg"
  },
  "HSvjWwHPZzXOTZaKUq_UoA": {
    "date": "2/17/2016",
    "text": "Sushi is always fresh and tasty. I never see it extremely packed, which is great around dinner time. Its nice and quiet, and not too noisy. Purchase two specialty rolls, and receive one FREE.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k5kDc_z3Noir6zfPmQXpVQ"
  },
  "-noYknl4sqAkN_avFVc3Vg": {
    "date": "12/18/2015",
    "text": "I love this sushi place! The service is great and so is the food! I haven't had anything I didn't like! They have a great special buy two rolls get one free! I am super allergic to avocado and they made sure to do additional sanitation on both the sushi equipment and the bar! I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YSmQwvMzRwhsRhY8NqkpdQ"
  },
  "bKRdIzQe4SwZX8eolDVx-g": {
    "date": "8/11/2015",
    "text": "Amazing!!! 42 different sushi rolls and I've yet to taste a bad one. My lame girlfriend also likes to tag along but she lacks the refined palate to properly review this joint.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sM-E4uwQp2TXEq1w0tXBtA"
  },
  "k5PtvItRGssJpvFPv27p_A": {
    "date": "10/26/2016",
    "text": "I really enjoyed coming here. It's a very small and not easily noticed location, but I felt very much like they wanted to make sure I was taken care of and that I enjoyed my dinner. Everything I tried was very good and I even had repeat orders of the garlic tuna nigiri. I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aaBUCQJWIsJTNW0LwAGsUw"
  },
  "-km2GRbMReCymveiFQWSLg": {
    "date": "3/25/2016",
    "text": "Worst service ever! I ordered a take out, but 2 rolls get 1 free. Came after work, wanted sushi, good deal... I waited for 35 minutes! I kept asking about my order... I understand if they are busy, the server could at least say about 30 to 40 or so wait! So I asked for my $$ back and left after waiting 35 minutes! Waste my time! Good food but service is not great- going to Sushi Mon way better service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkopcQlAKWjpPCTnZKIwtA"
  },
  "dA4NAsB2Ltk0YL0zAICe_Q": {
    "date": "5/25/2015",
    "text": "New sushi restaurant with pretty decent sushi. I'm not too crazy about this place but I come here to enjoy the Sawa Boat. The boat comes with assorted nigiri and a two rolls of your choice. The fish was pretty fresh. I was a bit disappointed to find out that they font have AYCE though. I feel like this place isn't special and worth ordering individual order and so I only wish they had ACYE. The Miso Soup was average and the Cucumber Salad was extremely sour. The Philadelphia roll is made with Smoked Salmon so be aware if you're not a fan of it. Their varieties of crunchy rolls were pretty good and the size of the rolls are pretty big. The sushi chef is highly energetic and quick to make our orders and I was impressed that he memorized the orders based on the waiter just telling him. The waiter was amazing too. She was a quick worker, extremely friendly and always attentative of her surroundings. She would engage in conversations with the guest but as soon as an order was ready, she brought it to the tables immediately. If we were unhappy was any dish, they were kind to redo our orders to satisfy us. Very good service and food, but don't know if it's worth it unless they had All You Can Eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RwM1dOCyc2qUGZvdmLAC3A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Orange:D",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RwM1dOCyc2qUGZvdmLAC3A/o.jpg"
      },
      {
        "img_id": "iibQV2_RTl8psO4YTwjrfg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Philadelphia Hand Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iibQV2_RTl8psO4YTwjrfg/o.jpg"
      },
      {
        "img_id": "y9x5mXM8pHYqW82YEZViog",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sawa Boat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y9x5mXM8pHYqW82YEZViog/o.jpg"
      }
    ],
    "user_id": "LTCxnnAQGaGZPHZx4KbvGA"
  },
  "AdyqNQ3hP4yojnsMZL9yHA": {
    "date": "5/16/2015",
    "text": "This was my first visit and I really enjoyed it. The food was excellent. The staff was very attentive and nice. And the chef was very funny and interactive when yo sit at the bar. This is my new go-to sushi spot.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "EbIHwK0zjLZVSdissSXEOQ"
  },
  "e86SKjjT1yEVfOMtUojGZA": {
    "date": "3/9/2015",
    "text": "Had some really great rolls! Dha, mistake and rainbow were all very good. Sashimi was very fresh. Highly recommend the salmon sashimi.  Staff was very friendly and attentive.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ks4YILcmJ8nrnGn49-K22g"
  },
  "Gcq5GMgRrRAA0c6hKxcWGA": {
    "date": "4/8/2015",
    "text": "Very fresh and very good quality sushi! Chef Steven is a very humble and friendly sushi chef! Highly recommended if you want sushi that is not like all other all-you-can-sushi places! Prices are well worth it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "a8lfRW4aQBHX1RBB4Z4VmQ"
  },
  "qxEqDY9qpfcwPCfgPaVT7Q": {
    "date": "4/12/2015",
    "text": "We stopped here on our way back to our place and got sushi to go.   Looked at the menu and didn't really see anything we liked (we really like fresh fish on top) and a lot of their rolls were cooked or had tempera in it.   So we decided to create our own rolls--and they said they wouldn't mind doing it!   The staff was soooo nice and helpful with getting the order together.  The sushi chefs quickly accommodated our requests and got the sushi made and to go quickly as we had our baby with us ready for bed and getting a little fussy.   It as really good sushi and very fresh. :)  We were very satisfied and would definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "aq3eWQsvtm1AhtbRhos0Qw"
  },
  "zrlvUV9pbtse1pHku_F1TQ": {
    "date": "12/11/2015",
    "text": "Favorite sushi spot. Chef is awesome and quality of the fish and rice is above other sushi bars here in vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_DY23fwe3cZ7Jo3S_F8Zg"
  },
  "XvZMVAtASQgiTCj7qDHg4w": {
    "date": "9/11/2015",
    "text": "I love Sawa Sushi! This is definitely my go to place when I get the craving for some Japanese food  I usually order the chicken teriyaki bento box and everything in it is super delish! You get soup, salad, chicken teriyaki, and some tempura for a low price! Plus, we always get such a warm welcome we go. Two thumbs up for Sawa Sushi!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dtE6YqYbN1xgKy0VawYIsg"
  },
  "TSAUuFP-7h6cBI0G0TiNng": {
    "date": "3/19/2017",
    "text": "Came here with my lady and we are never going anywhere else. The ichiban and red volcano rolls are addicting. Chef Sawa and Aaron- you're killing bros!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k7sPR6dbOpUAT5YvrTgX-w"
  },
  "DjszcFCU9c98mrnq7OfpsQ": {
    "date": "11/2/2015",
    "text": "Excellent sushi, great service very nice atmosphere.  Met chef Steven at Ohjah years ago,  it was really nice to find him back behind a sushi bar :) Definitely a new place to hangout.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rB_NQC2X2Luov0Xq6bj4lA"
  },
  "FuDqmzGyBgG0d6PtIs-cZA": {
    "date": "3/13/2016",
    "text": "Great Sushi! In town for a week and this is our second trip here already. Great sushi, great service and good value! I would highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSMq6NBhbFl_veQHzfQF_w"
  },
  "Vt9Djj1kMWfcYRUrNCIlZw": {
    "date": "3/4/2016",
    "text": "This place has been great! It was new and had a good special going on so we checked it out. The service has always been very warm and friendly and will keep us coming back. The sushi has been very enjoyable each time and tastes fresh. I also particularly liked the baked oysters, baked scallop roll and coconut shrimp roll. It has a local neighborhood warm feel to it too. Definitely check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ge18kyS5cWzejjPlQc7Inw"
  },
  "no1Lbu_ojEVEvVnilimkZQ": {
    "date": "5/19/2016",
    "text": "Awesome place. The staff are all super friendly always without missing a beat. The fish is always very fresh and tasty.. I even see how they are on point ordering it as they need and not over ordering .. Definitely a place to try..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMnSOlxbRUEIFqhKGoFCvg"
  },
  "I2Ks_ap_JiMEvja9E6peBg": {
    "date": "4/18/2016",
    "text": "Amazing volcano roll!!!!  The presentation is beautiful & taste great!!!  Friendly staff, clean, great prices & everything is really good quality.  Hard to find good sushi spots like this close to home.  So glad we found this spot... Even better that it's next to target lol",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hlzRHpakrtb57aUMU3k5Qw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Volcano roll... Taste as good as it looks, amazing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hlzRHpakrtb57aUMU3k5Qw/o.jpg"
      }
    ],
    "user_id": "LNcq3O2fbcjCUGE_A_U0uQ"
  },
  "_ajJ5TAwooGaXrkTwg99SA": {
    "date": "7/29/2016",
    "text": "Sawa Sushi is awesome. We eat sushi all over Las Vegas and Sawa is now my favorite. We ordered a Chicken teriyaki bento box for our two boys (6 & 4) they LOVED it.  We ordered Krabbi Patty, Japenese Lasagna, and Crispy Shrimp.  All AMAZING. ILL BE BACK.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4BRRcqnaeagiKdE10roJvQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Krabby Patti at Sawa Sushi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4BRRcqnaeagiKdE10roJvQ/o.jpg"
      }
    ],
    "user_id": "0ECgy9CRjdeqH6b8GQElVA"
  },
  "SlMnHSOorOz00AdQuP5uOA": {
    "date": "4/30/2016",
    "text": "Great local spot and great service...everyone seemed to be greeted when they came in. Yummy dragon roll, spicy tuna roll and the mistake roll is NO mistake! Our favorite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tPIdhRIOODwNi31SmZJcog"
  },
  "Jp2TygrTMRYv4Q5V1iPoVA": {
    "date": "6/11/2015",
    "text": "Sawa sushi special roll buy 2 get 1 free lol Everything very good. Fresh fish.good server. Nice chef",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChuallHX8O8pz4rFWIcTIg"
  },
  "TzYEhaF3DCuTVri5_RzhVQ": {
    "date": "12/9/2015",
    "text": "Such a lucky find! Food is delicious and the staff was great! We will definitely be back. The Snow White was my favorite!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hltCnxRt4SFkdQwOzgDN9A"
  },
  "07T3WoX3IJCf1hJuU3mJPQ": {
    "date": "12/27/2015",
    "text": "Two visits here. This place is solid for service and quality. No AYCE and no draft beer are my only issues. Very clean. Friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HXhKWfj6Y1xkBjDkn0t3KQ"
  },
  "PeNv4Xz5WkKE0qEmThEFNQ": {
    "date": "8/28/2016",
    "text": "Best local sushi but it beats the strip with the quality & the amazing good vibes with the restaraunt being family owned it lifts up the quality over quantity!!  The sushi chef Nikko was at 10/10 with quality of the grade of sushi & his positive energy!! I'm definitely coming back here again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H1sNYUmXI7sF3lLumntRCw"
  },
  "0VoI2ilIDI1SlaWYdawabg": {
    "date": "12/29/2015",
    "text": "People  are great,  fast service.   Food is excellent. Stopped by twice while in Las Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1YPTHiKKrA8U4_Az5jDBA"
  },
  "2oWBIy5ilqdlsiSnCil6Ug": {
    "date": "4/29/2017",
    "text": "I don't know why it took me so long to find this place ( i guess the exterior was never eye catching ) BUT food was amazing and so fresh ,definitely be going back soon .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S3KJ9f91ZruF6iffx2vb9w"
  },
  "sRItlsfvBMCCJcEBTWSQdw": {
    "date": "8/29/2016",
    "text": "This place is solid. Great to have high quality sushi in the area. Im coming back often. Highly recommend this spot if you are picky about sushi places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y9RtkzhiK8vAMQnBTFhNmw"
  },
  "_0kTwgJ-tANJw5tvGfu6ZQ": {
    "date": "7/28/2016",
    "text": "Delicious!!! The oysters are amazing. A wide variety of choices and the staff is very friendly. A regular sushi stop for us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PJOfI2AwCuLGsShHf0TAXg"
  },
  "dqbfes0bhHLCkv4P0HYb8A": {
    "date": "4/15/2016",
    "text": "Best sushi place I've been to in Vegas. Very attentive staff and not very crowded on a Friday around 5:00pm. Very fresh sushi and great beer and sake deals. Not to forget the buy 2 rolls get 1 free special they have. Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "waCSaJGEhCTC0dxWWt3P7w"
  },
  "eRP9GR6U0TTfZ_39BRd4Tg": {
    "date": "12/30/2015",
    "text": "If you like cucumber wrapped rolls... The Red Lady Roll is heaven. Buy 2 get one free specialty rolls? Yes please. The sushi chefs are charismatic and friendly as well. Love my local sushi spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jkvag_X705204sSQIOpkTQ"
  },
  "-cTVWHXAZOkWiafDKadxNg": {
    "date": "4/9/2016",
    "text": "Excellent sushi restaurant.  Prices just right. Wish they had an all you can eat deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-S0Zk7CL5xxVgiSoCESgLg"
  },
  "ki_qiYxPh5u4vnB4hhCx2A": {
    "date": "5/28/2016",
    "text": "All I can say is, Yelp let me down on this one. Everything we had was mediocre.  The staff was very nice though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JevEHlUyriLsYDGL7dGRQg"
  },
  "a2L0reInoozZG3eQQbbtOg": {
    "date": "2/9/2016",
    "text": "Awesome establishment! The sushi chefs here are really passionate about their craft and value quality over quantity. Their buy 2 get 1 free is a great way to try a variety of their rolls. Definitely a nice change of pace to all the AYCE sushi in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OLBFrzQV9WfkrxYGGI1E-Q"
  },
  "0zb4A_JRfIw8hooaQwXHPg": {
    "date": "1/27/2016",
    "text": "Sushi was good, and so was service. The seafood tasted and looked fresh. The buy 2 get one free is definitely a plus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zuiM8dt9bq-1oHjpiEfrg"
  },
  "sqRijt9rtTMPw5wfaVhfqw": {
    "date": "5/12/2017",
    "text": "Simply excellent. Sawa definitely rises above the typical sushi clutter where every roll begins to taste the same; unique flavors, well balanced. You know the food is good when you don't need to add anything (sauce, spices, etc.). Staff was incredibly friendly, attentive, and welcoming. Best sushi experience I've had in Vegas. Must check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-Z0YtF4SqoZok_Sw27msA"
  },
  "LK0fGgr5w-QemYjT4PcjlA": {
    "date": "3/19/2016",
    "text": "Excellent rolls!  Fast, fresh with great service!  My fave was the garlic albacore roll!  Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pn5GXaLfZvnWCrmDQxC1kQ"
  },
  "a0L7uUxDZYvQRvClQK-0jg": {
    "date": "6/3/2019",
    "text": "I will start off by saying the restaurant is very clean and the staff is nice and service was good. The reason I gave it three stars was I don't feel the specialty rolls were very special we ordered three rolls off the specialty menu and they seem very bland we also had the spicy garlic edamame which was good but messy. One of the rolls we did not even like at all It was kind of off from what the menu described and they still billed us for it and did not offer to replace it with anything else. All in all it was an OK experience but I do not think I would be very anxious to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "43qvtgJyxBp_WyYI7DHr5A"
  },
  "ybwJ_Z7nmYv2pImJ6i1BlQ": {
    "date": "9/3/2017",
    "text": "The service was friendly and attentive (5 stars).  Their buy two get one free roll selection is extensive. We ordered the Monkey Brain, Caterpillar, and Spicy Girl roll and the lowest priced roll was free. All 3 rolls tasted fresh and had delicious sauce. Come here for their rolls!  The sushi was a hit and miss. The Chu Toro sushi (one piece) was fantastic! The Uni (two pieces) was good but small. The Aji was ok. The Hotate (two pieces) lacked texture (more like mush) and did not taste fresh. It was also missing a citrus seasoning. This was listed on their blackboard special but turned out to be a disappointment. Also, the sushi rice fell apart easily...  Overall, it's a 3.5 stars place due to their sushi quantity and quality. The service brings it up to 4 stars.  Plenty of parking available in the shopping center.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "I-ZpbSsOwL8-I_LkAYq5mA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Aji",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I-ZpbSsOwL8-I_LkAYq5mA/o.jpg"
      },
      {
        "img_id": "XBsKmBZ21LvvNc5cQ5GRXA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Spicy Girl roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XBsKmBZ21LvvNc5cQ5GRXA/o.jpg"
      },
      {
        "img_id": "Ua0piofsGJXCSM9hR6r5IA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Caterpillar roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ua0piofsGJXCSM9hR6r5IA/o.jpg"
      }
    ],
    "user_id": "aG6Q_IKp5qLu0uV7LHaR_A"
  },
  "h8drEILYfhrsNgoGcBuadA": {
    "date": "11/10/2018",
    "text": "Great food, service, music and ambiance.  You wouldn't know it from outside, but there's some magic going on in there!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TW9H5pByN2tbDNrzxpp8ow"
  },
  "jWTB5ElbR6eg-8PhNJOSFA": {
    "date": "10/19/2017",
    "text": "We discovered Sawa pretty randomly (because it's near Target LOL), and my girlfriend's coworkers were eating there! It's Really Good, awesome friendly service and the prices are very reasonable. The nigiri and rolls are made with nice fresh ingredients too. Check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5tQrLICwJENArlvAf2yqAQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5tQrLICwJENArlvAf2yqAQ/o.jpg"
      }
    ],
    "user_id": "qBglSXgeGcXE5RZPc5k94A"
  },
  "s0MnELtdeAd_ktlm-RKrag": {
    "date": "3/24/2018",
    "text": "We've come to this sushi restaurant a few times now and each time we love it more and more! They always have the deal for 3 speciality sushi rolls for the price of 2! All the sushi is fresh and perfectly prepared.  There are so many different rolls to pick from! All the ones we've tried are delicious.  Today we were in and out within 40mins. Service is amazing. We always have Brittany as a server and she's amazing! Today she was the only server on shift with 8 tables and she was still on top of her game. Her service is impressive.  So happy to have found our date night spot. Highly recommend coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "pWNIcge9NjOsX2qwRNs0bg"
  },
  "MSFx8hTeprTAk8AcEs-_Jw": {
    "date": "4/5/2019",
    "text": "Sawa sushi is the small sushi joint with 10 tables and fantastic fruit. Excellent Scottish salmon and very unique rolls and also over 60 rolls to choose from. They have a buy Two rules get one free all day every day. You can't go wrong with that deal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkIGCm4ElVkjiOMIZcpRAg"
  },
  "f6V1pXn1fz0tinNaie8qvg": {
    "date": "7/16/2017",
    "text": "The services was awesome and the sushi chefs were fast and energetic! Unfortunately, the sushi was just ok. The nigiris are what make me decide if I like the place or not. The fact that as simple as their ebi tasted \"eh\" made me not want to return. I've been to okay sushi places but they always have atleast the cooked shrimp right! I ordered a couple rolls too and they were just okay. I don't know how else to describe it but mediocre.   Just like the other comments on here, I agree that the sushi wasn't tasty enough to be a la carte. Their sushi tastes more of an AYCE quality. Even then, I found really good AYCE places that should be a la carte! So overall, it was just an okay experience!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "CZnuW6YeZg7ZIiTbmI58BQ"
  },
  "O86GR4yCxin_omI4ftHCeA": {
    "date": "4/22/2018",
    "text": "I wasn't expecting much.  But was very Suprised by the quality of the sushi.   Prices were reasonable and very good service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GtiUVfth9qmd-U8fC_RdBw"
  },
  "zYRCRYPji7Al-KTLM7mOZw": {
    "date": "11/3/2018",
    "text": "They gave me the wrong fish!! Order sashimi and gave me two orders of white tuna instead of yellow tail! I've Ben trying to go but getting the wrong fish just does it for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtNUpRqWgWQ8FfiEAMaoYw"
  },
  "tNAHysDG7rztUbqkKnM_ig": {
    "date": "10/4/2018",
    "text": "Excellent sushi, ramen, and oysters! The staff was so friendly and observant. What a find! It's worth the drive, even if you live in North Vegas.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BN66UgGOmQSHG6FkIBMEhw"
  },
  "IvNBA34hPjz8AI-lOXiTng": {
    "date": "6/5/2018",
    "text": "After drinking all the night that a best place to fix a hangover. Udon soup was is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "67_T_bLwQ29vEE-r2S8VFA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/67_T_bLwQ29vEE-r2S8VFA/o.jpg"
      }
    ],
    "user_id": "37ZWcaxuEEl1LGvFeB4E7A"
  },
  "aKTnoWV2oO1NdnwXDfiMzg": {
    "date": "3/21/2018",
    "text": "I would drive past this place all the time. Glad recently I went in. The service was great. Food was affordable. I had the tonkatsu ramen and spider roll. Not busy so my food came out quickly. The specials look like something I'll order next time. I will defiantly be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rjf3LNFkC4kr39jxpm7xEA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Great service!!! Ramen was great!!! I had the tonkatsu ramen and it was amazing. I will be back for more.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Rjf3LNFkC4kr39jxpm7xEA/o.jpg"
      }
    ],
    "user_id": "r-OzYtC6gLuuU9JRIFNhVQ"
  },
  "2hvyKhKkJPXmRnf5jn3P1Q": {
    "date": "5/16/2017",
    "text": "Stopped in with a client based on the reviews. I ordered a seaweed salad which was your standard prepackaged fare and the but two special rolls, get one free special.  I went with the Bonzai, Oishi and Starfish rolls. I found the Bonzai and the Starfish to be overdressed with a bit too much vinegar-based sauce and the use of pickled jalapeno instead of fresh jalapeno.   The Oishi was the best of the rolls as it allowed the flavor of the fish to stand out.  A very generous 3 stars as the service was very good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "uZbIzVlYLu8Etg8wUXyRlQ"
  },
  "FAnu4e8ewo_XNoUzdu8NvA": {
    "date": "6/20/2018",
    "text": "Always enjoy lunch or diner. They change the menu as needed. I like the change and it lets you try new things. Love the super white tuna. Only reason it doesn't get 5 is sometimes the sushi is not as cold as I would like.  Fresh wasabi is always on point to add a fresh spice. Order Godzilla roll every time. My wife likes the cooked rolls. She loves the lasagna. Location is perfect, just wish they had more tables when it's slammed. Don't change the way you do business and we will keep coming in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "825nApynG7_I42AOZ6ALxQ"
  },
  "yLPfGnqjEg2FK2lYQdOIBg": {
    "date": "3/4/2018",
    "text": "It is my second time here. All dishes are as good as the first time. Great price with great service. 100% satisfy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hya5Xp47FCbE_369lkozWQ"
  },
  "Ni_ixbfq73wGMd9Bmy9rpw": {
    "date": "4/28/2019",
    "text": "I wish they had the option for \"real Wasabi\" and either a house made/non-commercial Soy sauce. This would for my taste, give this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BV9z-oB_u40FroGqkDqmNA"
  },
  "60EAKDOYBngBQPkraW0IPw": {
    "date": "7/16/2017",
    "text": "This is a cute little sushi spot that has a couple great specials that run all day every day.  FOOD-Their signature rolls are always buy two get one free which is great deal. I find the quality of the sushi extremely delicious for the price. Taste like most sushi joints around the city . My boyfriend, my cousin, and her friend all enjoy this place as well. They also have some great combination platters if you don't want just rolls. They do not have all you can eat sushi.   DRINKS-If you buy a large Sapporo you get a house sake for free. In my personal experience with ALL house sake's, they are never the best tasting sake's but it's free and it taste great for free. They also have delicious Arnold Palmer's which can either be raspberry flavored or regular depending on what they have that day.   SERVICE-Every time I have been in they have the same kind waitress with dark hair who always has a smile on her face and it's nice to everybody. The chefs are also very friendly if you choose to sit at the bar. Great service all around.   PARKING-Plenty of parking as this place sits in a shopping parking lot  ATMOSPHERE-Small, cute and clean. Nice music playing while you eat.  DEALS-Listed above under food and drink",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HoUpmH3Eoqp8wKqgJnLIlQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. ICHIBON ROLL",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HoUpmH3Eoqp8wKqgJnLIlQ/o.jpg"
      },
      {
        "img_id": "AuGaMIMgXucrlY0b68kCiw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. DHA PROVIDER ROLL",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AuGaMIMgXucrlY0b68kCiw/o.jpg"
      },
      {
        "img_id": "WmdLEl3G0uHSx3Pdp_udIQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. CRABBY PATTY",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WmdLEl3G0uHSx3Pdp_udIQ/o.jpg"
      }
    ],
    "user_id": "OWDbl6g1TTEy_X6wnLp9iQ"
  },
  "pAoIuO5EgbR_-FyPgYeARg": {
    "date": "1/15/2018",
    "text": "I hate when cooks and servers are already ready to leave before the establishment closing time. It makes me feel rushed and can't even enjoy my dinner. I wouldn't recommend the udon. I order udon a lot when I go to sushi restaurants and this place was just meh. The rolls are just okay too. We got a sushi boat and two sashimi platters. Hubby said sashimi was good but nothing to rave about. Service was okay too. Hubby and I came here once a couple months ago and had such a great experience we wanted to bring our family when we were back in Vegas. We all agreed this time around everything was just \"alright\" so i don't think we'll be coming back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RH3hD9tt5A47cVfQ01OfBw"
  },
  "GGu9QqMcu3WHafpWjSccPQ": {
    "date": "12/13/2017",
    "text": "Came across this on yelp and decided to give it a try for lunch on a Sunday, each of the dishes were very fresh.... and they have a special where you order 2 rolls and get the 3rd for free! Not too bad! Service was good and very clean! All staff are very friendly! Will come back and try other items on their menu!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "slXxxuO4G6R2uhDa30MeKA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/slXxxuO4G6R2uhDa30MeKA/o.jpg"
      },
      {
        "img_id": "_3Y0JIbY0KRlL20ZzCUTAQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_3Y0JIbY0KRlL20ZzCUTAQ/o.jpg"
      },
      {
        "img_id": "tr0SVWIBtKD-V1xOTuBA4Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tr0SVWIBtKD-V1xOTuBA4Q/o.jpg"
      }
    ],
    "user_id": "UHHraFRu5NKvZqIHp2O02w"
  },
  "WyOD-v2j4fCpviq7wqfqVw": {
    "date": "3/29/2019",
    "text": "Best Sushi in town!! Quality is always excellent, staff is friendly and atmosphere is great. Don't pass this one up LV!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O74HO5XXeIOka7AOLeq1tw"
  },
  "I9uqiVikCg_mkLSLqJVcAw": {
    "date": "6/8/2016",
    "text": "Was on my way out of town when I found Sawa on Yelp. Lived up to their great reputation! Had their buy 2 get 1 free Sushi Rolls and they were very yummy! Tried the Ichiban, Hawaiian and Dragon Roll and all were excellent - Hawaiian was my favorite (very unique flavor). Also had very friendly and quick service. Definitely will come back next year during my annual trip to Las Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rtLoj864Kp8XLCRKIxSWSA"
  },
  "tAlUUb2DKqEmgnW41luAgg": {
    "date": "6/6/2016",
    "text": "I always come here for my lunch break since I work right next door . Their food is delicious and not to mention when you buy two rolls you get one free of your choice!! Staff is always great and never overlooks a customer . I always get the crunchy dragon roll and I never get tired of it . I give my money and business to them happily every time !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MkTo0vfnLa0Xp4XH3JAmxg"
  },
  "DX8wzwyAuE_BJrdksxS8Dw": {
    "date": "8/30/2015",
    "text": "Not that good, the roll was tiny and overpriced. The fish was pretty fresh but the portion size was horrible, i was still hungry.  The service was ok but if your on a diet come try this place.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOcsM_yM601_zgcz3nguDA"
  },
  "0CiywKZPpIoISIwOh8oNXQ": {
    "date": "12/10/2015",
    "text": "Great food and very good service! They are super friendly and I was very pleased with the quality of the sushi and appetizers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2CedS9z085wDv1oQvxbuw"
  },
  "KWqqzRNIY_ltmHbYrhBnaA": {
    "date": "9/10/2015",
    "text": "My go too Japanese restaurant that is not all you can eat, which I do not always want to eat. Quality is good, love there white tuna nigiri and there bento boxes. I'm sad my favorite waitresses seems like she no longer works there anymore. The owner/sushi chef is very friendly and recognizes his usual suspects. Come support them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDWXMczMOcR20febmuM88w"
  },
  "wEUDbqXdGTBaS_1A3i0vEw": {
    "date": "12/4/2015",
    "text": "Great local spot!! Owner chef is a talented and nice guy and the food is perfect for a neighborhood sushi spot!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGGgzhvsYJo2bP6Wy-abBw"
  },
  "JfXW_0RRtIyiNxAlVc_jUw": {
    "date": "7/14/2015",
    "text": "Love this place. Excellent, fresh fish. The sauces will blow your mind. LOVE the garlic albacore roll!!The chef is way friendly and knows his sushi. Cool interior with a laid back feel. Best sushi in the area no joke",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYWI6QqFTvhLozpGeiD2xQ"
  },
  "8aamhtXE3JTDrPgaoSsJbg": {
    "date": "3/12/2015",
    "text": "Grand opening and reasonable price! Great place to eat sushi! Good services! I really like their special maki!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6AXrMFyuDEKNdHgjjOL5LQ"
  },
  "wupzQ2R4IYOZMDmG-i6MVg": {
    "date": "5/25/2015",
    "text": "Small place but the food is really good especially the bento box. The server Rose is very accommodating and knows what she's doing. This service with a smile even in crunch time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Cal7fFjlg7rWHMHz1NGKg"
  },
  "4nHTHe6_wBrpSSGD_E6GXA": {
    "date": "5/13/2015",
    "text": "Great Sushi! Bring friends, Chef has over 30 years of experience! Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RkZ2G5yuXx-GXF60HNUxGw"
  },
  "DPzOne9bZPm1kQdfysa8Yw": {
    "date": "7/6/2018",
    "text": "The three rolls I got were absolutely amazing and totally hit the spot for me. Wait time is minimal, and staff is friendly. Overall I recommend and cant't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NB0iFgrfEWSW8PAob1q_iA"
  },
  "7FydzDuHIo8OaKuZd_gHdQ": {
    "date": "3/4/2017",
    "text": "Rates up there with one of the best meals I've ever had. Fresh fresh fish, ingenious rolls, authentic yakisoba, excellent service. We're from out of town but we'll be back asap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KJXg6XeCmgN5sq7pWVWNyA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Red Volcano",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KJXg6XeCmgN5sq7pWVWNyA/o.jpg"
      },
      {
        "img_id": "wOd_KIpVIcicCNWrZBPn0A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. DHA provider",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wOd_KIpVIcicCNWrZBPn0A/o.jpg"
      }
    ],
    "user_id": "LaF8wiTRp6O42-wBhQIphA"
  },
  "Ng59LpkJmJaafhn99gJ_Rw": {
    "date": "8/4/2015",
    "text": "Went here the other day for lunch and Sawa Sushi did not disappoint!  They are much like other Sushi restaurants offering similar foods, however, the quality of the servings, quantity and presentation were totally top notch!  The room setting is somewhat small, but comfortable enough and cozy enough to have small talk conversation.  One thing I noticed is immediately when you walk in, you're greeted with a banner in your face.  Not a bad thing, just kind of different I guess.  I'm not sure if it's there on purpose or a gag, but something we chatted about at lunch with my colleagues.  Aside from that a very easy menu to read and order.  My entree consisted of the Teriyaki Chicken Bento Box and let me tell you it did not disappoint.  Check out my picture posted to see how generous the portions were.  I didn't leave an ounce of food unfinished.  I especially really enjoyed the side salad part of my dish.  Usually the side salads at Japanese restaurants miss the beat in my opinion, but Sawa Sushi delivered ten fold.  It had a hint of thousand island and Italian vinegarett?  It was a very good dressing whatever it was, forgot to ask.  So good I've been craving it again for the last two days.  The wife had chicken potstickers and that was just as good.  Very few times do I enter a restaurant where I'm truly amazed at every dish that comes out.  All of it was delicious!  I haven't stopped thinking about come back for two days now.  I guarantee I'll see myself coming back many more times.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Uj3nCEvPtbSwLiGMK-_75w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Teriyaki Chicken Bento Box.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Uj3nCEvPtbSwLiGMK-_75w/o.jpg"
      }
    ],
    "user_id": "u90s9wJ9pMK2FMpy5F8Wpg"
  },
  "q8Gj7bEyp7VzY99QPK1S1g": {
    "date": "11/14/2016",
    "text": "The customer service here is great, all the employees are so respectful. Miso soup always cure hang-over for me so I been there multiple times for miso soup (ha ha) I also had their barbq green mussel(it's amazing try it). GREAT SERVICE LITERALLY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hMX6qTXWfWYioVTF06a9iA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hMX6qTXWfWYioVTF06a9iA/o.jpg"
      }
    ],
    "user_id": "F5IZ8sxDIcEDPqzk3Nv6BQ"
  },
  "2PmFSNXpqZMsOONDU_pQHA": {
    "date": "10/25/2015",
    "text": "Wow Wow Wow, I was driving around really looking for some take-out after my conference ended and I was driving back to the hotel.  I saw this place as I was about to turn around and then looked it up on Yelp and figured, what the heck, it was already 9pm but on Sunday they were still open.   i was immediately greeted by 2 sushi chefs in traditional Japanese style like you mostly get in Japan.  I told them you give me what you suggest.  They gave the DHA roll and it was great, the other roll was very nice. the rainbow roll wasn't the best, they use imitation crab which isn't my favorite.  I also had some squid salad that was nice. For 3 rolls and some fresh sashimi I was bursting and couldn't nearly finish it all but with a beer, a free saki under $50 out the door is pretty good.  I wanted to give them 5 but the Rainbow roll at the end locked in 4, but this place for Las Vegas is seriously good, it is a hole in the wall but worth finding. If I'd bought this much sushi at a srtip hotel it would have 2x and no better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlqQQhm0FFfbEoj66Sf1cQ"
  },
  "2mNADJStLuTo6zm-OWJX7Q": {
    "date": "10/7/2016",
    "text": "Thank you Yelp! I was in town for an event and tried this place based off the reviews.  So good that I have been twice in 2 days. Dinner and lunch.  Hopefully I get by one more time before I head home. Food and service is Fast, Friendly & Fresh! The interior is nice, clean, quiet and with an unassuming atmosphere. I really like cooked sushi so, that is what I had here. The menu has a good selection of both raw and cooked plus the other usual items. Yes it is located in a strip center but the food is perfectly prepared, presented and oh so delicious! Extra bonus at lunch I sat at the bar and got to enjoy the Chef who was singing along to the Pop R&B music (very well I might add) and just loving life!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kjnwLndBIluWNLHf3mWTqA"
  },
  "F3ren8NSWLDpt2JyMe_jew": {
    "date": "2/14/2017",
    "text": "The best Japanese Restaurant/sushi bar I've been so far in Vegas! Everything tastes fresh and so delicious, the ambiance feels like you're really in Tokyo! A must must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MbPW9Hd7BAah_wTevHSwQQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Chocolate mochi for dessert! Soooo good!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MbPW9Hd7BAah_wTevHSwQQ/o.jpg"
      },
      {
        "img_id": "sKDlEKFJUzfh25PCc0jxAw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. In N out Roll, a must try!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sKDlEKFJUzfh25PCc0jxAw/o.jpg"
      },
      {
        "img_id": "rjUfbvZWaSol-vvCPtArHQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. The Red Volcano!!! Best Roll I&amp;#39;ve ever had seriously!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rjUfbvZWaSol-vvCPtArHQ/o.jpg"
      }
    ],
    "user_id": "S13p4YdS77NpP7MeHA4hnA"
  },
  "MN0NEhke54172orcuG7EPw": {
    "date": "4/18/2018",
    "text": "I'm obsessed!!! From the the Spicy Lobster Roll, To the classic a California roll which I never order, and I was pleasantly surprised, everything was so fresh.  Steven the owner was a class act, Jane was friendly and so genuine.  Brittany was also a gem!!!! Loved the whole staff!!!! So impressed... will make it my new Joint!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M23Z2oYY9GM8JeMg5B7AaA"
  },
  "jHMp0_UShp-adLcwtcVCgg": {
    "date": "10/25/2017",
    "text": "One of the better sushi restaurants in the local Las Vegas area. Fish is quality and they have very good special selections that vary.  No cheap fish here, I've seen them pull out the whole steak and slice fresh strips for their front fridge! Love the Chu Toro hand roll, it's a must try.  Great food, Great taste and good prices!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZBF1oAb9LdvSx2Ehb-LNA"
  },
  "0l4NOhGKF5ngSjj5VpAa7g": {
    "date": "9/28/2016",
    "text": "Some days you get really lucky and the day finishes with wonderful people like Steven at Sawa.  The Salmon Toro was heavenly.  Hamachi, Kani, Unagi Nigiri all amazing.  I've been in a different city almost every day and frankly not feeling quite myself.  One hour at Sawa, and I was not only smiling, but just enjoying every taste.  Thank you Steven and Sawa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Si1Y8mJyO5Zetto4ApUHFg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Amazing salmon Toro by the master chef!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Si1Y8mJyO5Zetto4ApUHFg/o.jpg"
      },
      {
        "img_id": "U_8Y5P2qRwzvaTpno0t0YA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Chef Steven serving me the amazing salmon toro - smooth like butter - exquisite taste!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U_8Y5P2qRwzvaTpno0t0YA/o.jpg"
      }
    ],
    "user_id": "EBDWVh0sE3HgiqgMuXBsuQ"
  },
  "NI8jgkzzLMaandEaJqGUDQ": {
    "date": "7/9/2018",
    "text": "Hands down one of the best sushi restaurants I've ever been to... and I'm all the way from San Diego! Great food and great service- couldn't get any better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytyIZKVQdzwnRFaLNWoteQ"
  },
  "R56jFKY1cA5nxMdbz2XTcw": {
    "date": "7/8/2015",
    "text": "I was up in the air whether to eat there or take it to go.   When I drove up, the Sapporo sign, showing through their front window was soo inviting that I decided to eat there.  As a matter of fact,  Sapporo was the first thing I ordered.   Unfortunately,  they ran out of Sapporo.   What a bummer... that's ok cuz I decided to take a bento box to go and drink my own beer at home (cheaper).    I ordered the teryaki beef bento box and added an order of  spicy tuna roll.  They did not hold back on the amounts.   Geez, for under $20 I felt I came out winner.   Teriyaki sauce and tempura sauce were on point.  Didn't care too much for the salad and the california roll.  Everything else is what I expect of a bomb bento box; vegetable and shrimp tempura,  miso soup and rice.     My goto spot for Japanese take home for sure.  I suggest calling your order in instead of waiting.   Gets uncomfortable waiting for food to go when there isn't a waiting area.       I'll give another review when I actually eat there but definitely going to call first to make sure they got Sapporo.   Can't imagine stuffing myself with sushi without it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6GUZ4e7qORxF2Nl5zZwm3A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Love how generous they are with the portions of their bento box. $12.95 + $5.50 for spicy tuna cutt role.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6GUZ4e7qORxF2Nl5zZwm3A/o.jpg"
      }
    ],
    "user_id": "_enjdNDnH6MlLIOT6G7Jsw"
  },
  "phoV7ksUOjxXnzCiz1a7DA": {
    "date": "9/3/2016",
    "text": "Nikko is the man!!! The staff was great and the atmosphere was spot on! The sushi was amazing; Innovative, fresh and flavorful. I highly recommended the Omakase - let Nikko work his magic, you won't regret it! I am definitely coming back! Party.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LAIh83dCCJ9xh0S1OIMXKg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LAIh83dCCJ9xh0S1OIMXKg/o.jpg"
      },
      {
        "img_id": "Q6Hng0MeCayCvI_yr5jk6A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sawa Sushi!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q6Hng0MeCayCvI_yr5jk6A/o.jpg"
      }
    ],
    "user_id": "EwnFS5gO74rsdkVUlF2wng"
  },
  "p_U2MHJl6r97Gga6f_gRyg": {
    "date": "7/25/2015",
    "text": "Steve, Master Sushi Chef, selects and prepares all the fish himself.  He gives each piece his full attention and love...yes, love!  We taste the love in each dish he serves us, and because of this, our lives are even more filled with love!!! Have a seat at his sushi bar and get ready to have the Very Best Sushi Chef serve you the best of the best!!! Neil, Whinnie, and crew help Steve with serving and our cravings are more than satisfied!  When we leave, we are planning our next visit.  Go see for yourself!  In Sawa Sushi, you are treated as honored guest with True Japanese spirit.   Sawa Sushi is our treasure!!!  We go in, sit at his bar, no need of menu...just trust him to provide you the most heavenly treats!  We have learned so very much from him, how he selects his fish, his uni, and we try anything he offers.  This is, by far, our most favorite and loved Sushi in the universe!!! Love from Patti & Steve  And yes, they do serve alcohol, the best oyster shooters, sake, beer, and wine!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sURJ4N4QCZ0GiW_5LwopHQ"
  },
  "uNo4FpRM7l6RkmgWZ_NTGw": {
    "date": "10/28/2017",
    "text": "Really good service you can pretty much seat yourself not a big deal which I like! I had uni for the first time ever and it was surprising good!! I adore the buda roll and appreciate the fresh wasabi! House saki is bomb and good raspberry iced tea. My new go to",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwG1mX7YBSw-N4MjDkCvpg"
  },
  "jaNia-53AM4_DGUHhrdvCA": {
    "date": "5/4/2015",
    "text": "Sawa Sushi just opened up not too long ago and I decide to give it try. (FYI this visit was back in March.) Any hoot and holler I always thought the location was an odd choice to open up a sushi place because it's not the busiest shopping center but hey let's hope it helps attract business.   The small Resturant was just that \"small\" as soon as you open the door you have to duck under this Japanese curtain thing they have over the front of the door whenever entering or existing the establishment which is kindda in the way in my opinion. Staff greets you immediately and you don't go far to be seated. There is a sushi bar with pull up stool in the back right corner of the Resturant which makes up most of the place and table with booth type seating on either safe of the room.   The menu is simple with quit a few options to tickle your taste buds. I came with my pregnant wife and 1 year old daughter. So naturally we asked for cooked sushi roll suggestions and the waitress was more then helpful.   We order a few Special sushi to receive a free roll and a Teriyaki chicken bento box. Ok so it is pretty awesome to find a good, affordable place to grab a quick bento box I mean this box is a perfect fix and comes with all the goodies. Teriyaki chicken, rice, salad, tempura veggies and shrimp and a good size sushi roll. A great portion of food all for about $11 or $12 on top of that you get a cup of miso soups as well. With had a great taste with small bits of tofu floating in it.   Besides the curtains in the entrance all in all it was a good little joint that I will defiantly come back to. The food was good, the Resturant was nice and the staff was friendly. Please come and try them I would love for them to stick around.   Good luck Sawa Sushi hope you are here for a long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tFImDPdOawptnSsDs9lNJw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Everything I crave in one Bento Box. T.chicken was juicy veggies and shrimp was yummy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tFImDPdOawptnSsDs9lNJw/o.jpg"
      },
      {
        "img_id": "CyqXj6FuHlFJ7hF0Fc_MdA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. I think this one was the lava something not sure but it too was really good lots of salad and sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CyqXj6FuHlFJ7hF0Fc_MdA/o.jpg"
      },
      {
        "img_id": "pCWLLLUzbu_0wpcg_I_0SQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Some crunchy roll really good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pCWLLLUzbu_0wpcg_I_0SQ/o.jpg"
      }
    ],
    "user_id": "YLeDSZ1Nh1N0hNsSyQdE3A"
  },
  "NEwPnHD4Zad38UsgyJsM1w": {
    "date": "11/3/2017",
    "text": "I LOVE this place.i happened to come in the very first week it was open & loved it ever since . The owner is very friendly & welcoming , both waitresses are warm ,helpful & friendly & the sushi is amazing . You buy two rolls & get the third free. I love the peach cold sake, light & very flavorful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYO9KHRtmnsJ3U6dkmKdfA"
  },
  "vY7B944amsbymUV9NSr3Bw": {
    "date": "5/16/2018",
    "text": "So just grabbing a few things at Target and hit up the Yelp app for a quick nearby bite. Loved this place, cozy, very friendly staff, sushi Chefs were super fast and made awesome rolls. Definitely recommend this place for any fellow sushi lovers out there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7T2FFtVr68W2gvc9xLEnA"
  },
  "GaNaTgVAS6_ZAJEegcX_Ig": {
    "date": "3/8/2015",
    "text": "Casual, ok service, nothing special, sushi tastes ok, fresh because it is still new (grand opening in March).  BE PREPARED to smell like fried food after dinning in (seriously need a better ventilation).  \"DHA, In & Out, and Mistake Maki\" are the best out of everything in the menu (if you only order maki roll).",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CWLLEnGDkAn3aZu5LPxTDg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Take out order! DHA, In&amp;amp;Out, Mistake Maki.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CWLLEnGDkAn3aZu5LPxTDg/o.jpg"
      }
    ],
    "user_id": "P82Q70L1SOkWOMYL6xczLQ"
  },
  "mXZAlDdmp5iyCrmyb4PKEA": {
    "date": "3/16/2015",
    "text": "I'm glad I tried this place because it is close to my house, but never again...  DRINKS * This place does NOT serve alcohol. NO SAKE and NO BEER.They say they are waiting for their liquor license... So maybe that will change. * They do not have fountain sodas, only bottles. * They have Pepsi products. (I like diet Coke)  SUSHI Seaweed Salad - It was tasty but extremely small. It was the size of a seaweed salad you would expect at an AYCE (about a half cup, maybe less), but it was $4.50. For that price I would expect a good sized portion.  Las Vegas Roll - Deep fried rice. I like deep fried rolls but I like them when the rice is on the inside of the seaweed. The rice here is on the outside, there is a lot of it, and a lot of tempura. There is a small amount of salmon and cream cheese on the inside. I felt like I was eating fried dough, not sushi.  Ichiban Roll - The garlic sauce tasted nice, but lots of rice.  Oishi Roll - Yummy, but small and lots of rice.  This place adds rice to rolls and portions their items as if it is an AYCE, but it is NOT. For $12+ rolls, I expect better quality and quality of fish. They have a special going on now, buy 2 special rolls get one free, but you can go down the street to Ohjah and get their 3 roll special for the same price (and they serve large seaweed salads and sake at Ohjah)  There was one lady at the place talking about how much she loved it and how she had been there multiple times, but she also asked the waitress what NIGIRI was..? So she obviously has not had much sushi. Otherwise, we were on only customers there.  SERVICE The waitresses were nice and quick, but the place was dead.  This place might be okay if they were an AYCE and you were ok with lots of rice, or if they had a happy hour, but definitely not a la carte at their current prices. There are so many better options.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GV3K1MG6trsi0R9t-Qr3Rw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Oishi roll. I enjoyed this one after picking off some rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GV3K1MG6trsi0R9t-Qr3Rw/o.jpg"
      },
      {
        "img_id": "30xt_yK1XVeKXDBlleR0tQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Las Vegas roll on top, Ichiban on bottom. Lots of rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/30xt_yK1XVeKXDBlleR0tQ/o.jpg"
      },
      {
        "img_id": "HpKWMOHc63bJQ0_I5PzYgw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Pepsi products, non fountain",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HpKWMOHc63bJQ0_I5PzYgw/o.jpg"
      }
    ],
    "user_id": "Y9MQoKoHkD62iGT1_hikag"
  },
  "aCTPSfoVjx-NONGx6RfoVA": {
    "date": "2/27/2019",
    "text": "Yum Yum and  Yum!! The sushi was deelish! Fresh, colorful, flavorful and fun! So many varieties to choose from and they were running a special... Buy two rolls get one free What a great way to try an variety. The restaurant is small but it's soo 2019 with the sushi chef kicking the tunes up w/hip hop beats. So if ur in the area and wanting some fresh sushi w/a cool vibe  This is ur spot. P.S \"The Spicy Girl\" is my favorite",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJUuZMsE37K2D9kOldOyAw"
  },
  "oVVr71nGWE8hpHeFncPahg": {
    "date": "1/4/2019",
    "text": "Sometimes you find a Gem! Fresh Salmon, crabstick, beautiful plate, two chefs hard at work can tell they take pride in their work! Very tasty, great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIDNlH_ZMrDpDUzPJPzQZg"
  },
  "P7k4SVosRC40JICe9UZ_qg": {
    "date": "1/19/2019",
    "text": "Tasty, quaint, good service, and fresh fish. I am rarely in Blue Diamond, but when I come back to this side of town, I will come again. They offer buy 2 get one free.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BEE2u5krVuRG7kaAfx4cMw"
  },
  "yjFjq6TYlT8X2vmymr1D9A": {
    "date": "1/30/2019",
    "text": "I'm from Hawaii so to me there's levels to sushi, I rate this exceptional! Thanks for the ono grinds! Mahalo!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zvgVhgnLQ0YLZf5zTGYyhQ"
  },
  "okjXOQb7wR7XlHVh_7kFUQ": {
    "date": "2/13/2017",
    "text": "Went here on the fiance's whim, and I was pleasantly surprised at how awesome customer service is here. Sushi was pretty good too.  I liked our waitress for her attentive and friendliness. I could also tell that the sushi chef we got to see at their opening hour likes to recognize his regulars. He even acknowledges patrons seated away from the sushi bar. Granted that the restaurant is small for size.  We didn't get to eat a lot 'cause I wasn't very hungry that day, but I did enjoy the Red Volcano sushi the most.  In terms of pricing, we spent about $37-$40 (not including gratuity) for 3 rolls, 1 seaweed salad and 2 waters. Trust me when I say that I went easy during this meal. I'll update after our next visit when I'll grub down more.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "DgyEkGJIHf-tJerJCweWiQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Red Volcano",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DgyEkGJIHf-tJerJCweWiQ/o.jpg"
      }
    ],
    "user_id": "WdD8hWn-NjSyDYoHqin_tQ"
  },
  "IjyiRqZAACtzyrWc9dSKjg": {
    "date": "10/7/2018",
    "text": "Roll over Nobu!!!! You've got to come check out Sawa Sushi! Unreal how amazing this place!  Top notch quality of food and hospitality. By far our favorite sushi spot in Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LScYoKD-wE4vROR1i4OZvw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Such a good time with these folks!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LScYoKD-wE4vROR1i4OZvw/o.jpg"
      }
    ],
    "user_id": "XycdWrt8KgD6WqOLRapfNg"
  },
  "xDwvjOfNGTnqWElfLsJhUg": {
    "date": "6/13/2019",
    "text": "Our new sushi place!  Prices are reasonable and service is awesome.  Tried the ramen and it was really good.  Definitely a place to try :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3dgN8R0y0lPkSA5UcOWbsQ"
  },
  "c5d7tUeRVEXpDMScOtUupw": {
    "date": "1/14/2019",
    "text": "This place is really really good... tucked away in the Target shopping center on Blue Diamond. Fish is really fresh and the staff is super friendly... I haven't been back in maybe a year and the owner remembered me... Sawa Sushi is a definite visit... I def will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HTbpiXgfRaNPMLCVKJip6w"
  },
  "_EfxRWI-3NQg5wSKagUcDg": {
    "date": "6/5/2018",
    "text": "It's time for you to hire a new chef. Tonight we heard repeatedly that the chef is new. I would give you zero stars if that was an option.   My husband and I ordered the Chicken Teriyaki and Tempura Bento boxes. I ordered the yellow tail collar for my daughter (13). We ordered soda and tea for each of us as well. $12.95 bento boxes x2, $9.95 yellow tail collar, and $1.99 drinks x3. Not worth it.   We waited for almost an hour for our food to be served. People that had entered before us (they ordered sushi) were finished before we were served our food!   Finally the two bento boxes came out. FYI: they do not have regular soy sauce. The rice was delicious. The California rolls were good. The salad was yummy. However, not all was great. Like, the lack of tempura in my bento box. There were 4 pieces of what looked like donuts with a vegetable in them. They were either oily and doughy, or oily and over cooked. Then there was the fact that they missed the shrimp tempura completely. On a bright note, my husbands bento box had all the pieces. The teriyaki chicken would have been better if it was hot, not luke warm.   The yellow tail collar eventually came out. The yellow tail was meaty, but the center was cold. I could see there was uncooked spots but fed my daughter enough of the cooked spots.   At this point, our food had come out and the servers who were very polite had to hear my complain. They repeatedly stated that the chef was new and that he was confused. Our server contacted the owner, Steven, and tried to get the entire bill erased. But -- that didn't happen. He did take off the yellow tail collar.   It's time for a new chef because you'll lose your customers with this kind of food that you're serving.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bh6e3oeMTM3oGs1h4PWlhw"
  },
  "8xAfglIXq_c4bO6LMNgEDA": {
    "date": "3/26/2019",
    "text": "Good deal on rolls! The DHL roll is one of the best rolls in the city! My wife like Sawa better than some of the fancier sushi restaurants in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EN1lGSOe9bHRanOwEfgNUA"
  },
  "DGwdgxAZZ0I6vl6g_NO3mw": {
    "date": "3/15/2019",
    "text": "We came to dine before a basketball game. Short time allowed. We were in and out with amazingly fresh sushi dinner. If you are staying at South Las Vegas be sure to try this place excellent food and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6I3HfpS1DPtH17DE1N9bA"
  },
  "MBT6YFjbopHtd3iQZFkyqA": {
    "date": "3/24/2019",
    "text": "Love the buy 2 get 1 roll free. Delicious rolls! The chefs are great and fast service. Try the King Cobra or Krusty Krab.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bE5mKeaHbtd6oyq-fcRZ1w"
  },
  "LOo_USTmHe95-8Ys4EeQ6g": {
    "date": "12/3/2018",
    "text": "First time here and I was impressed. The service was great and the sushi chef was entertaining. The atmosphere was cozy and They had great music. They are reasonably priced and offer buy 2 rolls get one. They offer an array of rolls including party trays. Great neighborhood spot for good sushi close to home without it hurting the pocket...we will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQ_37kagDfucvT2_Kn7DaA"
  },
  "ZPP3dBynhrLDhbPzCxNNPw": {
    "date": "6/14/2019",
    "text": "I ordered a teriyaki box and four Ikura sushi. It took over 45 minutes for a to go order. They acted like it was nothing when I said it was taking quite long. The sushi was very small. Half the size for each Ikura Sushi that I am accustomed to. The food tasted good. I will not go there again. There are plenty other places that respect the customer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsTXWn0ptE8YtlYi6_GMYQ"
  },
  "5_4staOcONEPwYTILdJE8Q": {
    "date": "5/25/2018",
    "text": "Place had the most amazing customer service. Yellow tail was super fresh. Music was great. Staff was attentive. I had my 3 kids with me and the waitress was so helpful. My son didn't want the salad that came with the bento box but I did. I told him to put it on a plate and pass it over. The waitress seen him struggling and came and did it for him.  It's the small thing that set them apart.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BG35iH9ajh_XEpZZxoob7Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BG35iH9ajh_XEpZZxoob7Q/o.jpg"
      }
    ],
    "user_id": "sW5ubhE3aJFcz1r-ecTLUA"
  },
  "mfDVaSZlW5dhXPFtfcXkiw": {
    "date": "9/28/2016",
    "text": "Age is getting the better of me as I am no longer able to devour plates and plates of AYCE sushi. In a sense i'm glad no more having to find ways to hide my last few pieces in miso soup bowls or flattening them under two plates hahaha oh boy.... My friend wanted to get some sushi, and she saw sawa and guys it is sowwwaaa  Setting: A decaying \"grand opening sign\" is latched on the back of the restaurant, its right by the in n out on blue diamond. When you first walk in, they have that japanese mini curtain hit you in the face which my first instinct is \"this is covered with face and dirty hair\" so careful of that when you walk in. Pretty standard looking with the sushi bar and a few tables around.  Service: We had a younger white female server that just dropped off the menus to our table and walked away. So i was like ok.... morale here is bad. A different asian lady had come by later who provided better service by just being cordial. They had served as cucumber salad, and i asked if i could just seaweed or just anything else (i had cucumbers) and the chef had told the server he would charge me to replace it. Not a big deal but it would've been appreciated if he had accommodated.   Food: They have deals here if you buy 2 rolls you get 1 free but I am not a roll eater whatsoever, so we got the Sawa Boat. $40 boat (chef selection of fish) but we were served standard pieces of nigiri and sashimi (tuna, salmon, yellowtail). The quality of the fish was pretty decent.   Overall: Don't come here. It's really below average with nothing about it to spark any interests.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "XV4gRUljg3K6jxqjKEJd_Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sushi boat with roses",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XV4gRUljg3K6jxqjKEJd_Q/o.jpg"
      }
    ],
    "user_id": "lXZ7aziyUJyA6V0FlIR1Wg"
  },
  "EZT_LG8zjJrz7e3CPM1TMw": {
    "date": "6/6/2019",
    "text": "I tried to stay away from AYCE sushi places because they usually have bad service. So I tried Sawa Sushi. This is one of a good Sushi place in Vegas with much better service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VPDyejT-dV_MB8yNUd23nw"
  },
  "xx-GK4ig-rf64BEedlv-PA": {
    "date": "11/20/2016",
    "text": "I have been without sushi in 6 months (working at a lake in Oregon) & needed a fix. We used to go to Hamada's on Flamingo but they are no longer open. So we checked Yelp! and found Sawa.   It was in a shopping center so I wasn't so sure but we were starving so in we go. The sushi chefs are so friendly & welcoming! I'm getting more confident! And if you get a large Soporo, you get a free saki! That really says welcome!! Steven was our guy. He was fast & they were made well.   Big menu with all the standard sushi selections. We started with 2 nigiri salmon (me) & 1 nigiri red snapper (him). The pieces aren't huge but a good one bite (2 for me). The salmon was very good-favorite and the red snapper was topped with a very tart marinade-not my favorite.   My husband also got a Bento Box with chicken teriyaki. It also came with salad-good but needed more dressing, miso soup- so delicious we got one to go , 2 pieces shrimp tempura-good crunch & excellent flavor & 2 pieces vegetable tempura-amazing (the sweet potato-YUM-another favorite! It also came with a scoop of rice & a California roll (which we don't normally get but was really good!)  I also got a spicy tuna roll. The nori was too chewy like it had been open too long but the flavor was still ok.  The beer & saki, 3 nigiri sushi, HUGE bento box of food, the roll & extra miso soup to go came to $50. Good price for all the food we got. Maybe not the biggest or best we've had but good- food 3.5, Steven 4.5 so round to 4. We were full  & definitely will come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x0ZEWRtAcQFC9jmhQpokrA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Menu page with Nigiri Sushi &amp;amp; Regular rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x0ZEWRtAcQFC9jmhQpokrA/o.jpg"
      },
      {
        "img_id": "Rr1MYlnc3uR8cH8jh7Dp8w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Decent price for all the food.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Rr1MYlnc3uR8cH8jh7Dp8w/o.jpg"
      },
      {
        "img_id": "PwenASlXxqsNfVc-FmXjPA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Menu page with Special rolls.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PwenASlXxqsNfVc-FmXjPA/o.jpg"
      }
    ],
    "user_id": "2z2A6ayPZmlVwZFK-uz60w"
  },
  "TvSQvxw9LR_AWgrFix5IKg": {
    "date": "1/31/2019",
    "text": "Incredible sushi!  Love the buy 2 get one deal!  Very good- kind staff. Tempura was light and crunchy not heavy fried. We'll be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X65FOMJtT79JwHjxHt7Jzg"
  },
  "SXkB1-vBMFGANG4dUswpUw": {
    "date": "2/21/2019",
    "text": "This was delicious!! Everything we ordered was amazing!! The spicy girl was my favorite. That's a must if you are ordering sushi. Best sushi I've ever had :))",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a7rGUe_0KHDKj_pS0neIZQ"
  },
  "Xyy9QOyB-KcLUQjrtczOCQ": {
    "date": "9/28/2016",
    "text": "We are repeat customers and love this place.  The quality and hospitality are top notch.  You can't beat the everyday special of 3 rolls for the price of 2.  Fantastic flavors and selection.  Definitely go there if you can.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLxm_YTXqSda6aRBj7gDgw"
  },
  "FCp5wZ30fXybqEvdXPL_hQ": {
    "date": "9/23/2015",
    "text": "Food was really good.  Service was awesome.  I only rate it a 3 because the ambiance is a little boring and they should really offer AYCE.  I'd actually give a 3 /12 if I could ;)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KQ1_iJjSy0z9_sR1B6Ax2g",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Chicken teriyaki bento box",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KQ1_iJjSy0z9_sR1B6Ax2g/o.jpg"
      },
      {
        "img_id": "FOsQzdqNpT_uWY23wz_Yqw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Snow white and garlic albacore rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FOsQzdqNpT_uWY23wz_Yqw/o.jpg"
      }
    ],
    "user_id": "NmvtdD1v3P3wj4E79_UQCg"
  },
  "JA0z1DyZbacy1m27dZ5HAA": {
    "date": "6/12/2015",
    "text": "Reasonably priced. Not excessive, nor cheap. The girl who complained about liquor, they serve it now not a reason to give them low stars, it's a new place and the were waiting for licence also if you prefer coke products more than Pepsi you shouldn't give them bad rating just because they carry Pepsi....that's personal preference and doesn't define a spot.    I mostly order to go, I ate sitting down once, they are fast, listen well, and super friendly!  I love close this location so to go works for me.   The Vegas AYCE mentality isn't present here to which all I can is thank goodness!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p8eHROuRDiStavK6iEkS8g"
  },
  "nBDkb-M9hnEmMMJASX4yQA": {
    "date": "3/20/2015",
    "text": "This place is the bomb!  Not too crowded yet and still the freshest fish on this side of town. Taste sushi at the AYCE places then come here. You an taste the difference!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hDbOvhKJcrfNNxiieUIwXw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Half eaten lunch Bento box",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hDbOvhKJcrfNNxiieUIwXw/o.jpg"
      },
      {
        "img_id": "GHeHlVjR-lFuiXTCpKId4w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GHeHlVjR-lFuiXTCpKId4w/o.jpg"
      }
    ],
    "user_id": "S05KFI7tM37ANsbjOWSewQ"
  },
  "MbQkylJadvZ9D52GkRPpHA": {
    "date": "7/25/2016",
    "text": "Bought the Red Dragon and Crabby Patty. Got a third roll free. Best Sushi since The Sushi House in Alameda",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAE6Wt_n37Njs7VR4pNAtA"
  },
  "u1zZfrJNQGb2tmJNVXeWPg": {
    "date": "8/18/2015",
    "text": "Best sushi ever! The people working here was so welcoming and nice!! The food was amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yKq_0VXJYW0CPMTxySaNiQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yKq_0VXJYW0CPMTxySaNiQ/o.jpg"
      }
    ],
    "user_id": "ne_-EUhczMEKXJJQ0g6jPw"
  },
  "tebexy3JyJCFXECd4-kljQ": {
    "date": "5/8/2016",
    "text": "This review is solely for the Chirashi Bowl. At $18, it is a terrible deal. Just a few pieces of fish and a ton of rice. We told the server about this at the end and she just laughed and walked away (she was quite pleasant during the meal, maybe it was a nervous laugh, after all she doesn't make the food). We've ordered lots of Chirashi Bowls in the past and this one was by far the worst. Advice to the owners - please don't be so stingy with the amount of fish in the Chirashi Bowl going forward.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbrgwqwKyCUAVeQMSE7Lvg"
  },
  "WZSBA3sX8HYyt-xMuOxXtw": {
    "date": "10/6/2016",
    "text": "Very intimate and friendly.  We had an in and out roll, dragon roll,  and Rainbow roll as well as uni.  Everything was fresh and delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDbCIK-eGOZzGpAwhh4F7g"
  },
  "fR2GLgjyv8NiflnwqcjCQg": {
    "date": "6/20/2015",
    "text": "Fresh sushi, good service, great deals! I think I found my new sushi spot in mountains edge!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hcW9lY_0wWIFgrpdN1Q_dA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hcW9lY_0wWIFgrpdN1Q_dA/o.jpg"
      }
    ],
    "user_id": "LCynaLpi2vwYsx9Ts6PlDQ"
  },
  "Qe9JEuqJUkHV-4GUjAG7SQ": {
    "date": "9/10/2015",
    "text": "The best ever. The Tuna is Ruby Red, not pink!  Open a yelp account just for this review. Don't waste your time with other location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X4cSMur-sV-jNWcPuY6Wwg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X4cSMur-sV-jNWcPuY6Wwg/o.jpg"
      }
    ],
    "user_id": "9ZguBICaaEvoqu0jmrbKrA"
  },
  "D6HwjSRgZCeI6m6Z2eV6IQ": {
    "date": "9/8/2017",
    "text": "Been wanting to try this place for a while and I'm glad we tried it today. My kids loved it too. The bento boxes are very generous and the rolls are yummy. The service was great and great ambiance. The buy 2 get one free a great deal. Will definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5J16qrHHfYS5zoAib8WpQ"
  },
  "WvF1JenHJcNbJmXH1a1EmQ": {
    "date": "3/8/2015",
    "text": "Awesome place! Everything was fresh and so good!! The staffs are very nice and welcoming as well and gave us an exceptional A+ service. I highly recommend this place, will come back for more for sure :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "piApksb6rcF1dPS0jR6_HA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/piApksb6rcF1dPS0jR6_HA/o.jpg"
      },
      {
        "img_id": "FkG21P62S8akWpbnnEWrhg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FkG21P62S8akWpbnnEWrhg/o.jpg"
      },
      {
        "img_id": "aMCDkd11ZI4m-O-E26SNjg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Chicken teriyaki bento",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aMCDkd11ZI4m-O-E26SNjg/o.jpg"
      }
    ],
    "user_id": "oUROKgLd3HVKwaMWVRDZQQ"
  },
  "Hl-kAw5lwvumjM6TZ5S3xQ": {
    "date": "6/8/2016",
    "text": "Like the other reviews this place is great. Very friendly staff. Very reasonable price. Everything was extremely fresh. You should try this place at least once if you have the chance!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdTpi9uyx6Q_XRZGGgPOfw"
  },
  "BjMrA1VIrd3ySFrcfM4kPw": {
    "date": "9/4/2016",
    "text": "Were sushi snobs and loved this place. Their sashimi was incredibly fresh. The tempura was crispy and delicious. Will come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k38FdG9tqpPoEbyIPODx2Q"
  },
  "DvuvsRwXBjg6rBHDsNkyNw": {
    "date": "8/29/2016",
    "text": "Everytime I go in, the owner makes me feel like I'm an old friend.  I'm sure he does that for everybody, but it's just refreshing to see someone respect their craft that much.  And, the sushi is legit.  Keep it up Sawa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORSPx7h1FOmz_uJca-J18g"
  },
  "Icyvg7gsV9aQn25Zh_-QIw": {
    "date": "8/29/2016",
    "text": "I LOVE SAWA SUSHI.  They always greet me with a smile and deliver the freshest cut fish I think Vegas offers.  Best value for the money!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOUsm9RmSdWO-buzak9wXg"
  },
  "qPr5aI8VyKdmFVcHT9aezA": {
    "date": "8/28/2016",
    "text": "Great sushi and great service kinikko is a great sushi chief definitely will be back. Great prices really good fish",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8lX2l6q3IxckVBDByJPPbA"
  },
  "dNbHndihE1wnoxf-gJByvw": {
    "date": "12/11/2015",
    "text": "I was excited to have another Sushi place nearby.  I was disappointed they did not offer AYCE....but that's ok.  I have not had a good bento box in a long time.  Let's see how they do.   I ordered HOT GREEN TEA to drink and it came warm.  In fact barely warm.  I could barely taste the tea- tasted more like just water.  Started with CALAMARI and it came like onion rings.  No tentacles- and the only dipping sauce they gave with it was this tabasco looking thing.  My son had YAKITORI and it was hardly tasty.  It was good it had sauce on it.  My Godfather ordered this this SUSHI COMBO.  We both had MISO SOUP....it lacked taste but at least it was hot.  It tasted like those instant MISO SOUP you add water to and like too much water was added.  My BENTO BOX- omg...the so-called Grilled Beef Teriyaki ...looked like wet beef- no taste.  The salad was your typical mixed greens and the  dressing is really important and that was like it was mayo mix IDK what flavoring it had.  The Tempura: Shrimp looked like it was on the skinny side, one tiny sweet potato, one tiny broccoli and I think a small zucchini.  The Tempura dipping sauce- it was not watered down correctly because it was too strong, and too sweet.  The Cali Rols was ok.   I would have ordered more to see if maybe something else might have been good...but at this point I was already turned off.  I usually try a place a couple of times just in case they were having a bad day with their service or whatever but BLEH!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "LT1Lsa0zLR7RkPUGsLiy3w"
  },
  "fV_5tckrD_kAEmlNDnCtqw": {
    "date": "6/28/2016",
    "text": "Chose to stop here because of the Yelp reviews. Charming decor. Staff was very friendly. We had the seafood salad and 3 rolls. 'd the Volcano roll. The buy two get one free is a great deal. We'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0v1VRx5Sw7MZkAP4pXAMZA"
  },
  "hfWt4OICU-ct4Ta8mEis6A": {
    "date": "8/18/2016",
    "text": "Excellent sushi! The fresh fish is delicious and the service is great! I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6xiJFQhMVO0gcUhmoBjSQ"
  },
  "EjMVyLg-WwkbXm_gzcP06g": {
    "date": "7/4/2015",
    "text": "We've been here three times and we've found the food to be consistently of good quality and service reliable. The place is kid friendly as well.   They have special rolls with an ongoing buy 2 get 1 free offer. We've tried something different with each visit and so far all is good. Nigiri is fresh. Bento boxes have generous portions and appetizers are good.   I usually go for AYCE Japanese places but will make an exception for this which is now our go to sushi place in the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "llWp9CUGgO1U92G16CBJ9w"
  },
  "RSCJNrQ96UmtK8f7ESfcVg": {
    "date": "4/26/2015",
    "text": "Great little sushi bar! Love the small, relaxed atmosphere. The sushi really was very good. The girlfriend and I split a few special rolls and left full. They currently have a deal of buy two special rolls and get the third free.   No, it doesn't have AYCE  nor do they have a happy hour. Not every sushi bar in Las Vegas needs to be AYCE!  It is fairly average-priced for a sushi bar, but the quality certainly appeared to be excellent.  We spent roughly $40 for four large rolls and hot tea (before tip). Roughly $10 less than AYCE - but we still left full and it was better quality than most AYCE places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgNk-sjMMrM1JRp_-06zlg"
  },
  "Onp7ZVQtA27-QJcSc6MSfQ": {
    "date": "2/19/2017",
    "text": "Wonderful sushi at buy 2 get one free. Alaska my favorite. Crab patty okay but hubby loved it!  Tempura bananas with ice cream are great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HF0nnQ1OifESPRQgu61duw"
  },
  "eE2qDtjylauZC3linLoYUg": {
    "date": "10/16/2016",
    "text": "My wife and I come here anytime we are in the mood for sushi . They are always super friendly and quick to help you. We have tried a few other places in the area and this is still or favorite. They have a great deal on rolls and they taste great. If you want something made special they will put it together for you. Great place for sure will keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mfVpQYxtYiRcnLoa3M7X5Q"
  },
  "yTg7q3g8subgBHlrihSsPg": {
    "date": "4/27/2015",
    "text": "Fresh fish, and excellent service by the nice server rose, chef took time to make our order nicely done and the rice is not too much",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ix9WjDUSODlV0-VBp89TBw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Big cut for their nigiri, &amp;amp; their ginger is fresh &amp;amp; sweet.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ix9WjDUSODlV0-VBp89TBw/o.jpg"
      },
      {
        "img_id": "xfk_MHdOFpsTkDS6xZeARA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Excellent service, fair price",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xfk_MHdOFpsTkDS6xZeARA/o.jpg"
      }
    ],
    "user_id": "5qG3wXOF1X94taoqiusVbQ"
  },
  "hYE75AmHU2dAyB42OUJ6AA": {
    "date": "4/27/2015",
    "text": "Stepped in for lunch during work. I wanted to treat myself so I orders one of the sushi combos for $9 dollars and it comes with 4 nigiri sushi and a spicy salmon roll. The miso soup flavor reminded me of the miso soup that I had when I was in Japan back in 2001. Great memories.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8Sutt6hJtmEtNOy93cZHaA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8Sutt6hJtmEtNOy93cZHaA/o.jpg"
      }
    ],
    "user_id": "HTTn15w4c5Yfp4YzrZqd3g"
  },
  "umWexnMdpnm8xO9VxPCYUg": {
    "date": "2/9/2017",
    "text": "Driving around not knowing what tI wanted for dinner. I opted for this little spot sat at the sushi bar, I was greeted  with a smile, I asked for recommendations on the food and I gotta say I was served with some very very DELICIOUS dishes.  Shikoku Oysters, Uni, Otoro, just to name a few.  I defiantly will return on my next trip to Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fAOyogfdU2H62wUqTAOWYA"
  },
  "3V0KvhTzQInIIIpLUBWoCg": {
    "date": "8/10/2016",
    "text": "Tragically I was just visiting Vegas when I stumbled across this place.  The prices and the sushi are excellent. The Las Vegas Roll is one of the best things ive ever eaten. Will definitely return next time i'm in the state.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "VLdyCzO1hUWfk_lmmfQcGw"
  },
  "BrvglmZzi14Z1eVhdEf1fg": {
    "date": "9/30/2016",
    "text": "Such a great place. Sushi rolls were delicious and they have a wide selection. A large Sapporo, which I usually get anyway at a sushi place, comes with a free glass of saki! Service was amazing and the price was great. Get the #39 roll. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "broKgO_RX8k9Jf0Ixf3MJw"
  },
  "PIb8NAQjho8g8ItLwjOBUQ": {
    "date": "12/3/2016",
    "text": "First time at this place ! Loved it, great service and reasonable prices.  Very much a hole in the wall.  Definitively will come again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ilLGUCUHk4aZb7Mrh63NZQ"
  },
  "IX8FP0HnY6x_Mcuk166FYQ": {
    "date": "3/14/2017",
    "text": "Always fabulous food and friendly staff. Love their Buy 2 Get one Free! Their Salmon dinner was LARGE and delicious,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-nOo6oa4yV1zakcdpN1pQ"
  },
  "n00jLxzhd2zCrJv6aS95pA": {
    "date": "11/28/2016",
    "text": "Fresh fish here!!! Whenever I'm craving real sushi, I'll come here to Sawa and they never disappoint. The head chef is amazing and entertaining. Staff is attentive. They've been having the buy 2 get one roll free for awhile now. Still the best deal in town if you want fresh sushi!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vv4nzt3ygkA_bnaC1Qufbw"
  },
  "tIu5nJ8SmNMOO2GlIj7rKQ": {
    "date": "8/4/2016",
    "text": "Fresh food everyday and consistent with servings and proportions. Come in and be greeted with a Japanese gusto lol chef and server are Japanese. This place is one of Las Vegas' hidden gems if you want to get away from the crowded strip like most locals do. 5 stars. Indubitably.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RT768sPSTI2BRSq-1aF2Fw"
  },
  "no7ZAj3Cs5JM8zlYrjIVig": {
    "date": "4/8/2015",
    "text": "Decided to dine here after trying many other sushi places in the area. This is definitely the best! Everything we ordered was amazing & tasted very fresh. The service was great.   The restaurant is decorated nicely and is comfortable, whether sushi bar or table. They have TVs that were playing the games. Overall great restaurant! Can't wait to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9pX12OfRtQukbFNvjwwAA"
  },
  "71t2YZlCKPAM5ZwNNzdYgA": {
    "date": "3/13/2015",
    "text": "Just came here for a quick lunch and had the spicy tuna miso salad. Not that much to Say about the salad you see what you get in the Pic I posted. Salad was nice and fresh and so was the sushi. The service was great, chefs were attentive and asked how everything was and waiter kept refilling my water. Time to try the lunch specials next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c5UMQ-zICOUXNOp3YnAYCg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Spicy tuna salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c5UMQ-zICOUXNOp3YnAYCg/o.jpg"
      }
    ],
    "user_id": "IVMyXI7PoDXcp2mc8Qsaxw"
  },
  "AhnBeoeZG60DYlBfGkNfwA": {
    "date": "9/27/2015",
    "text": "Had the Dragon, Catapillar and Unagi and they were all top notch. We will definitely be back real soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bs3IDgeeSjwqZPnHZq5ZPg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Look for yourself!!! Awesome",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Bs3IDgeeSjwqZPnHZq5ZPg/o.jpg"
      }
    ],
    "user_id": "HLFA33xO2Y3QnO28QiZGJQ"
  },
  "rpIYNB7fXjYrl1UI-dFgYA": {
    "date": "10/28/2017",
    "text": "This place is great! I live in the area and come here often after doing shopping in the complex it's in. The staff is fantastic and attentive! My glass is never empty and I never have to wait long for my next round of sushi. The Hawaiian roll is a must try!  Fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D96vP_gikrBH7CJICPSWzA"
  },
  "9xtlgD4FfRMQ1EGs817nCg": {
    "date": "3/25/2016",
    "text": "We're here in town visiting family.  We came here for lunch after we landed. We were greeted by at least 2 people when we entered. That's at least three stars from the get-go for me!  My cousins ordered bento boxes and a roll, and we ordered rolls which were buy two, get 1 free.  The food came out fairly quickly, and the portions were on point!  I  know we ordered the ichiban, Krabby patty, lobster roll, and I can't remember the last. They were all good though!   Definitely a good lunch to start off our trip!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "BXblmcSOLS1x085DY1G3AA"
  },
  "DoDKk2xzkbOJsbaiiraHLw": {
    "date": "2/24/2017",
    "text": "The service was good, and the food presentation was good. HOWEVER, I ordered 4 dishes which were oysters, and 3 rolls. EVERY SINGLE DISH WAS DRIPPING IN THE SAME SAUCE!!!! Their disgusting orange vinegar sauce was not only in all my oysters, but also smothering all of my rolls! I literally couldn't taste anything in any of my food except their disgusting orange vinegar sauce. It's an Americanized sushi restaurant for sure. Great people, horrible fish/sushi.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_NIHpwQaR1OQ7zh3jCHIog"
  },
  "MtVd4uoVVIlxSQ7gVegBIg": {
    "date": "8/6/2015",
    "text": "Place is amazing friendly staff, great service. Sushi is delicious. Had the DHA and volcano rolls. If you buy a large Sapporo you get a free sake perfect for bombs. Also buy two rolls get one free which was more than enough for me and my wife. We will be back soon to try the ichiban.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9BAT-MBItlJRLu74BP8hZQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sushi Awesome",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9BAT-MBItlJRLu74BP8hZQ/o.jpg"
      },
      {
        "img_id": "X_z9EbFmWLdMsf9JJCy18w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X_z9EbFmWLdMsf9JJCy18w/o.jpg"
      }
    ],
    "user_id": "HRIb0iFXXbA1qEtBzYS2jg"
  },
  "tfQl9SONuXZ3wcr3auwltg": {
    "date": "3/28/2019",
    "text": "Hidden gem in Vegas. Away from all the chaos on the strip. We make a point to come here whenever we shop at target on blue diamond.   Service is amazing, fish is fresh, all the ingredients are fresh with delicious homemade sauces (try the salad with fresh ginger dressing). Music is on point. Has a great, chill atmosphere. Great roll special (buy 2 get one). Prices are great. Two people can eat for under $40 and walk out comfortably full.   My favorite sushi spot in Vegas. By far.  And I eat sushi like a champ.   Go here. You won't be disappointed.  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VIoE9bMuety2TJo2sgkdPA"
  },
  "zfEtXuBbU7EYLI4txMTwxg": {
    "date": "3/24/2019",
    "text": "This place is my favorite sushi place in Vegas and I am very picky about sushi. It's made to perfection, very affordable. Great deals on Sapporo and buy 2 get 1 free roll. Usually quiet and always great service.   I come here usually at least once per week. If you're bringing a big group of people it's probably not the best place because it's small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "COXUiPOSdrv0XVUW1WjRqQ"
  },
  "GTTCYcYEs80rWhyjvjJXAg": {
    "date": "8/22/2019",
    "text": "Why 5 stars? 1 the FOOD is really tasty and authentic.. 2 the service is good... 3 the variety is plentiful.. 4 location, shop til ya drop then have sushi.. 5 the special deal...buy two and get third roll on the house!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4SQ4tzIYmsNyxk-v4eRtg"
  },
  "NbfCZZy_YdTKszgIatvb7A": {
    "date": "2/4/2019",
    "text": "What an awesome sushi spot. On our way home to California from Vegas stopped here and it did not disappoint one bit. I would recommend their box.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lgTGqj-ZQ3eZ-s0goI2KnA"
  },
  "6CdA0D9smHISZZ7OvSb0CA": {
    "date": "3/12/2018",
    "text": "We stopped in here on out way out of town as we headed back to San Diego. It was about 2om, so it wasn't very busy and we got seated right away.   The place is small, but the ambiance is nice. There is a small sushi bar towards the back and tables in the rest of the space. There was only 1 waitress, but she was prompt on serving us.   My husband ordered a Tonkotsu Ramen, and I ordered the Tuna Tataki. My sushi came out about 5 minutes before his ramen, so I waited for his until I started eating.  I loved the tataki. The sauce had just enough of a kick to make the dish appetizing but didn't make the taste unbearable. There were 12 pieces, which for $13 (I think) is a deal. The tuna was on top of a bed of rice noodles and they were also delicious.  My husband's ramen was a bit plain. There was no egg, no hearts of palm, no seaweed, no pickled ginger, none of the regular items you usually find in tonkotsu ramen. On the upside, the pieces of meat in the soup were very generous. He ordered his spicy, and said the same as my dish, that it was just spicy enough to make the dish taste really good. He was disappointed though about not having an egg and asked for one on the side. They apparently didn't have any boiled so he ended up finishing his soup before our waitress came back over and apologized that the egg would be another 5-10 minutes. She offered him another piece of pork, but he passed on it since he was already finished with his soup.  Overall, we may be back when we come into town again, but he won't be getting the soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OzGqFKFPcDQG-vD2-H8vIA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Tuna tataki, yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OzGqFKFPcDQG-vD2-H8vIA/o.jpg"
      }
    ],
    "user_id": "JqaIH8O6i9OOXgEvwzLVsg"
  },
  "wlpXxHAmUEGq545Ets47yQ": {
    "date": "12/24/2018",
    "text": "Hidden Gem off of Blue Diamond!   It's authentic and cozy with a huge selection of rolls, appetizers, udon and ramen.   Service was good, despite it being busy.   We ordered the gyozas (steamed) and the salmon teriyaki bento box with came with miso soup, salad, California rolls and veggie tempura.   All was yummy and we definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQv6zHBlSy_zMX3pZaq01w"
  },
  "b_0uVLbgQckkJU2V2C0MQg": {
    "date": "5/26/2018",
    "text": "Came here because I was in the area running errands and was thankful I got to try this place. I got their salmon bento box to go and it was awesome! The lady was very friendly and greeted me when I came in. They have special going on if you buy two special rolls you get one free. Definitely have to come back here to dine here. I was so happy with my lunch meal. The salmon was delicious and they give you a good amount of food. They aren't cheap on the food they give you. You also get 8 pieces of California roll and some fried tempura! Everything was delicious! Loved this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "luVNIjSNtV_0LvQERIVFeg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/luVNIjSNtV_0LvQERIVFeg/o.jpg"
      }
    ],
    "user_id": "lQBZo8_mm80dbwI5bo5c_w"
  },
  "6ljTwLcxrUuaNLZCjxUzEQ": {
    "date": "10/24/2018",
    "text": "AMEX not accepted Good service.  Paid $33 for 3 rolls (not including tip) The DHA Provider sushi roll was delicious. The other two rolls I had were average.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "loiJR1bn0_H5iBUrSK9SXA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Rocking Roll... okay",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/loiJR1bn0_H5iBUrSK9SXA/o.jpg"
      },
      {
        "img_id": "aXERJfqLJtgU7pMy7pZ51Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. DHA Provider roll delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aXERJfqLJtgU7pMy7pZ51Q/o.jpg"
      }
    ],
    "user_id": "TtL9L8piP_l1WIKUTAn4iQ"
  },
  "xasMb6SwbrW_2jwnmObxBQ": {
    "date": "6/27/2019",
    "text": "Their sushi never disappoints. They always have great service and great deals! The buy 2 get one free on all of me and my family's favorite rolls. A big Sapporo Japanese beer also comes with free saki which is very welcoming. The staff is always nice and I would highly recommend this place for all your sushi cravings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "apa0TscD7QS6ZCz2-a44mw"
  },
  "j7qzPewqNeMIbEo_UUFx4A": {
    "date": "1/12/2019",
    "text": "My sushi roll is basically frozen. I'm very disappointed. I got a dha roll and it looks and smells amazing but I tried it and it's all still frozen. Update: I threw up 20 mins after eating here. Cool",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AQLoRbwpHggMTV1K0Jvz3A"
  },
  "jdHDQ5_XpjFfEZmoWKDBKw": {
    "date": "5/17/2019",
    "text": "In and out roll is great! Maui roll is weird and vinegary. Rainbow roll was just what you would expect. Extremely nice waitress! But 2 get one free house rolls:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xePBAmyWcG0uFEqLhFuBPQ"
  },
  "2LYzw7s4wal5zwXq4E-tNQ": {
    "date": "6/21/2019",
    "text": "This is my favorite sushi restaurant in town. Always fresh and staff is so friendly. Small and cozy the best place is to sit is at the bar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6aiuWkajMewDd3LmDTmuA"
  },
  "kJH3ehYYAhGSxfOv25uFVw": {
    "date": "4/30/2019",
    "text": "I loved this little spot and ordered the bento box based on reviews and very pleased I did. Be warned it's a lot of food. Miso soup, rice, salad, two pieces tempura shrimp, few pieces of veggie tempura, 8 pieces California roll and I had the teriyaki beef. The beef was ok a little too chewy but nice flavor not to sweet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FVSFU0bYUO4iVOBnRuPEMA"
  },
  "3vha-cAH1M9mGMd32w30yw": {
    "date": "7/10/2018",
    "text": "Very good sushi. The staff are really friendly and courteous. They bring the food quickly and it tastes fresh and good.   Recommend their spicy garlic edamame and Love Roll.   They have ongoing special buy 2 get 1 free which is a good deal too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K51XeJP_faNP1BKlLq_w-w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Love Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K51XeJP_faNP1BKlLq_w-w/o.jpg"
      }
    ],
    "user_id": "934dvJnpS8O2yHPVjCDOcA"
  },
  "2uTYcH_tMY-aYQ1UncSdhg": {
    "date": "8/12/2019",
    "text": "My favorite sushi in Las Vegas, which means a lot because sushi in Vegas is ironically outstanding. Just odd because we are nowhere near water. Service is fast, friendly, and real. This strip mall location is very underwhelming, but the food is what it's about and they consistently hit the highest marks at Sawa. A bit out of the way from the strip, but well worth the 7 mile Lyft/Uber, particularly when the meal is under $70 for 2, including drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "keYVr4OWw3UF5fCdmw3AGw"
  },
  "JAHUzMLFIfMCVE7CGD32cA": {
    "date": "5/20/2019",
    "text": "Unbelievable. Out of this world amazing. If you're in Nevada please do not miss the opportunity, if you're not in Nevada please come TAKE the opportunity!! *heart eyes*",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5s82Wg53K5LCwfgzz-jOtA"
  },
  "-_DqK066FDMFhH-CyxiPRg": {
    "date": "4/9/2019",
    "text": "Visiting from out of town. They have multiple types of ponzu sauce! I tried the spicy ponzu sauce. It was really yummy with a kick. I'm def coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eZmIV5HcpoVnuAx9n-Xp-Q"
  },
  "TCSzJM8WK2mStJ8I-_8wyA": {
    "date": "4/13/2019",
    "text": "First time going & i really enjoyed. Really good & friendly service. Decent prices on their food as well. I ordered the sashimi salad, the rock star salmon roll & salmon nigiri. i really enjoyed the salad, it was fresh tasting. I would definitely go back & would recommend to anyone",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_DwK4INQ-Kf3TjlJu4x3A"
  },
  "go8Rr5slHyuFXUtXis8ZSA": {
    "date": "7/17/2019",
    "text": "Wow first time eating here and we had the Godzilla roll, DHA and the Bonsai roll. Man was it good, we will back for sure. Service and food were amazing. They had the buy 2 rolls get one for free special so it was fairly priced as well.  May just have found our new favorite Sushi place. Well done Sawa Sushi!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I56nyk_kbI_C9LTYS2s8uQ"
  },
  "HA6eM-s5IZgRWdC_ZuNB_Q": {
    "date": "2/27/2019",
    "text": "Love them. Everything i ate so good and i ate almost the entire menu. I would recommend them for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WkqGxsONFLF-f_m2Zb4G5Q"
  },
  "vVTf-1rXW1u0Hc1ymiRIKw": {
    "date": "11/16/2015",
    "text": "I come here free work to get the Spicy Ahi Tuna salad. It's always fresh and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2lAp-vd-9pIV1wug3mJDg"
  },
  "DCfucCvIPENShVusX493-Q": {
    "date": "5/22/2016",
    "text": "This place is delicious! The sushi is all fresh and so good. My kids split the chicken Katzu bento place and they loved it. The staff was very friendly and attentive!! Definitely my favorite sushi spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i4O4U-Fav1d2k5eV-qVwfg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Japanese Lasgna",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i4O4U-Fav1d2k5eV-qVwfg/o.jpg"
      },
      {
        "img_id": "hxJkTpJ3EK_umwqJgUioZQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Dragon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hxJkTpJ3EK_umwqJgUioZQ/o.jpg"
      },
      {
        "img_id": "QJuVYyiS4lms6WQS1fiDPQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Caterpillar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QJuVYyiS4lms6WQS1fiDPQ/o.jpg"
      }
    ],
    "user_id": "TXNz99TfLtgkQ50aw-Zy0Q"
  },
  "2A2Vn0qVNLhTaFWaUsu-Jw": {
    "date": "12/4/2017",
    "text": "This great little sushi restaurant is tucked away in a nondescript strip mall about 10 minutes from the Strip. The sushi here is really delicious: everything is super fresh and beautifully presented.  There is a huge assortment of rolls available, and prices were extremely reasonable.  I highly recommend leaving the strip to enjoy this much tastier alternative.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tW7MU918KtKEOH0E-iUpw"
  },
  "Q8lLU_K7yfx7EUXXrUpy-g": {
    "date": "9/7/2015",
    "text": "I would actually give this a negative star if I could....we ordered the boat, a couple appetizers(yakitori and mussels) and the crunch roll. The boat fish choices was at par, small cuts, one of the shrimp nigiri looked like it was dropped on the floor coz there was some dirt on top. The mussels were burned like rubber, yakitori was actually the highlight!   When I ordered the boat, I specifically asked if they include some Cajun tuna...not one came with it! So disappointed, asked for a ponzu sauce, server gave us some chili garlic sauce! Ordered the Sapporo w/ free house sake, never came!!! I know it's a holiday but c'mon now, all we want is a little service, if you didn't want to work today then u should've jus stayed home! You can't even get napkins at this place, I was with my 3 kids smh' ...I don't know if it's just us coz she seemed to be very attentive to the other tables, maybe she don't like kids but I mean my kids were well behaved, no mess at all! Our bill came to $77 n change....left a $15 tip only coz it's a holiday today but we will never come back here again! Too many great sushi place in Vegas",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "lfAMlhaacqHsHjUfeTrj-A"
  },
  "2nbkUnGlr6YJolauk08yaQ": {
    "date": "12/20/2016",
    "text": "Great find on our vacation. Our favorites were the dinner bento boxes (good amount of shrimp and veggie tempura and quality beef and chicken teriyaki). Great sashimi grade fish (we got the deluxe/sashimi B). Our favorite rolls were the Bonzai, caterpillar and the In-and-out (they have a buy 2 rolls get one free promo). Iced and hot green tea were good.   You can't see inside the restaurant when you are walking past it so it might discourage some folks to come in but they are open. The staff are welcoming and warm. We went to this place twice during our 5 day vacation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RuF-EE8Xbnzp0pQ4sSKN8g"
  },
  "5mTlfng-9lFeaAfbSnzf6g": {
    "date": "2/7/2017",
    "text": "Good staff and great sushi. Other than the one customer making all the noise being rude and saying he was such a regular there, great time out. The buy 2 get 1 free special rolls is a good deal. Try the ibachi roll and garlic albacore roll.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T4zc1hkb1fynb3Ms4KCXSg"
  },
  "RGbqdPfn8VVmy0n0mAQgaQ": {
    "date": "10/17/2015",
    "text": "Omg I love this place! Best sushi bar in town- hands down! And buy two get one free on speciality rolls? My husband and I literally pay $25 and we're stuffed! It's amazing.   My favorite is the coconut shrimp roll- so damn good!   He's obsessed with the Hawaiian.   The 3rd roll is always something we haven't tried yet and we have never been disappointed.   Staff is always so accommodating and so welcoming. If you live on this side of town...you should definitely try it. You'll be pleasantly surprised. You'll see.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6vN2RkLbY8cv3QUw0EDiA"
  },
  "Kaups_8IBqJMR7qsyNqWog": {
    "date": "3/13/2016",
    "text": "Kept it simple ordered the spicy tuna roll and Alaskan roll. Very good and quick service !! Can't wait to go back and try the rest of their rolls :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eVyE_iSNpi3dgLIZXRo7nQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Alaskan roll (salmon,asparagus,avocado &amp;amp; crab)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eVyE_iSNpi3dgLIZXRo7nQ/o.jpg"
      },
      {
        "img_id": "hGgwZ3FSKqfMJm4LXv6JIQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Spicy tuna roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hGgwZ3FSKqfMJm4LXv6JIQ/o.jpg"
      }
    ],
    "user_id": "0iPzc4ZCuCvAequGZHvbZw"
  },
  "73typfScl6skF4QoL4U5Qw": {
    "date": "1/1/2017",
    "text": "Sushi here is really fresh. Service great. But what really Won me over was the garlic albacore roll. So good. Garlic lovers you need this roll in your life. I will come here every Vegas trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jk3OnHng8ycPC7q4rbrk7w"
  },
  "yLnl_uA-gz3V7_jKCmo4Ag": {
    "date": "1/9/2017",
    "text": "This was my first experience here and I loved it. It's small but very cozy.  The staff is all very nice and accommodating.  Their house hot tea is matcha and excellent quality.  They have a unique roll called the coconut shrimp roll which was amazing.  I also loved the Hawaiian roll that comes with fresh thin sliced lemon on top.  Will definitely be back!  I sat right at the sushi bar and visited with the chefs the whole time.  They were so nice!  Go and enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g80MBNnAsR2K8ZJvg7L1Qg"
  },
  "OS4ZalNqhvixhBJQXapd1w": {
    "date": "2/28/2017",
    "text": "I was visiting Vegas one weekend and yelped this sushi restaurant.  The food was delicious and their prices are more than reasonable.  Will definitely visit this place again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3n8tjc0-BEboRrU_1ffzw"
  },
  "3ERPMv0qZ_NgHpiELZLuAQ": {
    "date": "1/2/2018",
    "text": "There are not many restaurants in the area but this is definitely a good one! Plus oif you order 2 rolls, the 3rd one is free.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MirqeVRRWQfUPoAF2gIPiA"
  },
  "QRcDWe-E83gr26982oPZ3Q": {
    "date": "11/1/2015",
    "text": "LOVE this place.  The rolls are unique but they have a lot of traditional stuff.  Staff are SO nice.  This place is pretty new and a lot of the staff are from a different place that we used to go to but stopped going to once the staff for bad.  For sure come here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZIrx3pIa_gDyTV7TXyENcQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Yummmm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZIrx3pIa_gDyTV7TXyENcQ/o.jpg"
      }
    ],
    "user_id": "JQlzHruOqwMuueStY_9_DA"
  },
  "6zPzR31qtmClZoGu6F_vUQ": {
    "date": "12/15/2016",
    "text": "My husband and liked this place. We stopped in on a Tuesday around 2pm and had a pleasant lunch. We had the spicy California roll, gyoza and spicy garlic edamame. The edamame was VERY spicy, but I liked it. We also got free sake because we ordered a large Sapporo. The prices for special rolls are steep, but if they are as good as everything else we had, it's worth it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WwoM6hQbgPnzcX3taqK-xQ"
  },
  "ijPU9OcGZUwsewh7qFiGTA": {
    "date": "1/20/2016",
    "text": "I wish they had all you can eat!  Decided to try instead of driving across town to an all you can eat and it was really good!   They didn't have a tiger roll, so they created that for me!  Awesome!   The chefs special rolls were buy 2, get one free, which I wish I knew at the time of ordering the tiger rolls!  I was told after I'd piled all our dishes together and asked if I wanted the free one!  Regardless the food was really good.  My toddler had the kids chicken yakitori which came with 2 scoops of rice and some veggies on the side.  She ate almost everything , which is unusual.  My teen son had the California roll and loved it.   Overall everything was really good!  We will definitely be back!   Ps. Consider doing AYCE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-iuEllF--jRXfhcf1CZIg"
  },
  "NVht9SN-tRggZEBTU_JAxQ": {
    "date": "9/12/2015",
    "text": "Went to this place last night for the first time. Very sub par. Service is good, but the fish is not fresh and also they are very short with the amount of fish given. Price is too high for the amount of fish they give. Biggest factor is that the fish isn't fresh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5X80Lkieh8faTXoLB8AZjQ"
  },
  "FPlNt3d2h2mkpHVjfj_6fw": {
    "date": "3/26/2017",
    "text": "Honestly blown away by the loving staff, good service & great food! For sure my new fave restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9Kd5tk_pFinDpEQdgWE4g"
  },
  "PIrIAQGJRK2aSQs94T7KeA": {
    "date": "11/25/2016",
    "text": "Sushi was really good.  And service was super fast and very friendly.   The tempura asparagus roll was awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EcRQmIFdW7ynvLthjnLINg"
  },
  "gXxG6k_M63i7N1oVKp9ieg": {
    "date": "1/12/2018",
    "text": "I was not impressed with this place, their barely busy but when they are the sushi Chefs take their sweet time watching tv. When I order one roll to go on my dinner break from work and it's $8 that has literally 4 pieces and it took them 25 mins to make and it wasn't great and just bland I won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnRosel2fUvuIoDJyBoVvw"
  },
  "RCmoNVjyB37eKJnQjTkkHA": {
    "date": "8/15/2016",
    "text": "I loved everything. The fish was sublime. The rolls were great and the vibe was AWESOME...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "92CP-vlCBthFKuc--cq6XA"
  },
  "BBIA0Lga_bbiA-AS1c3l2A": {
    "date": "5/21/2019",
    "text": "I rarely give out five stars. But I've been here three times and I will continue to go here because the sushi is so bomb! The host and waitress are so professional. Has A keen sense to pay attention to detail. Friendly and welcoming. The quality of the seafood is so for for filling. The deals are amazing! Make two purchases of a sushi order and you get one for free!!! And when you order a large Sapporo you get a large hot sake! I am truly in love with this place. I'm glad I found a better sushi restaurant in Vegas. The bathrooms are clean, and a sushi bar is very clean as well. They have two TVs so you can watch sports. Or you can zone out on the elevator style of relaxing music. Seriously no complaints whatsoever.  Overall: 10 out of 10  Red",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q-ZJEEQKKGjudtq7MplXyw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Yellow Tail.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q-ZJEEQKKGjudtq7MplXyw/o.jpg"
      },
      {
        "img_id": "6Q2uxfkdsHngCAPFTJzUVg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Back again",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6Q2uxfkdsHngCAPFTJzUVg/o.jpg"
      },
      {
        "img_id": "bX_bvXI1NNsDztt2jE-e5w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Oh yeah!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bX_bvXI1NNsDztt2jE-e5w/o.jpg"
      }
    ],
    "user_id": "iReDOg4-q65MbMNgZYwvTA"
  },
  "wnl4cBq8uUAoXKd_d9Yutg": {
    "date": "8/12/2019",
    "text": "I recently moved to Las Vegas and my wife & I are setting up our new \"Go To\" list of restaurants. I put AYCE (all you can eat) into my Yelp search engine and wa-la Sawa Sushi came up nearby.   Let's start by stating that Sawa Sushi does NOT have AYCE fare. Instead they have a bunch of rolls that - you buy 2 of and a 3rd one is free. Hmmmmm? How many people want three rolls of the same thing? That's another issue that didn't really affect me.  I ordered the Chicken Teriyaki Bento Box, Fried Gyoza, & Eel roll.   All great sushi starts with the rice. It's not the same as rice used in a rice bowl. It is sweeter, and stickier than normal rice. This is to enhance the filler and keep it together while you eat it. Both my eel roll and the California roll from my Bento box fell apart when picking it up with chopsticks. The rice had the same flavor/texture as the scoop of rice in the Bento. Not good! The rolls had a good flavor but did not hit the mark.  The chicken teriyaki was moist and flavorful, but the portion and appearance was less than ideal. The tempura shrimp/vegetables were well prepared and flavorful.  The fried gyoza was the prize of the meal. They were well prepared and larger than normal. There was also 6 pieces as compared to most restaurant's 5 pieces. The dipping sauce had a nice bite to it. Just enough to make itself known and enhance the food.  The high point of the meal was the service. Our waitress was efficient, friendly, and thorough. She was almost too much. As soon as we might need anything, drinks, napkins, etc she was there!   I gave this restaurant 4 stars as an average between the food (3 stars) and service (5 stars).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UtDCyaJzz44-BjZqUpZG7A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Chicken Teriyaki Bento Box &amp;amp; Gyozas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UtDCyaJzz44-BjZqUpZG7A/o.jpg"
      },
      {
        "img_id": "WIh15HHIagHf71r5vyXEdw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sushi Bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WIh15HHIagHf71r5vyXEdw/o.jpg"
      }
    ],
    "user_id": "1n_LqzFKNMDGuLRfaDXrjQ"
  },
  "Yx6ycvJkljzTqJmc12DyJQ": {
    "date": "5/1/2019",
    "text": "On Sunday I was craving sushi but didn't want to pay a ridiculous delivery fee to Postmates or DoorDash. I had seen some really positive reviews about Sawa Sushi and I was pretty happy about how close to me house it was. So I went with some good company to see what was up.   First thing I saw when I got there was a buy 2 get 1 free deal going for their special rolls. That was all I needed to know to continue my adventure into the building. When we got in, I was immediately at peace. Sawa has a nice, intimate feel and wasn't too loud or crowded (though that might be because we beat the after church rush). The nice hostess sat us at the bar where we noticed the next great thing: free hot sake with the purchase of a Sapporo beer. I'm not a beer drinker but my company is a fan of Sapporo so it worked out. When his beer came... it was a humongous bottle, not like the smallish ones you get everywhere else. The sake was delicious and smooth.  We ended up ordering the green mussels appetizer which was surprisingly spicy but the spice was more than welcomed. I love spicy food so that was a plus in my book. I ordered the baked spicy lobster roll and the garlic albacore roll. AH-MAZ-ING! The spicy lobster roll was basically an orgasm in my mouth and I will definitely be ordering it again many times. The garlic albacore was really great too. I really didn't even need the soy sauce or other condiments in order to eat it, it was just that good on its own.  Aside from the great food, the chef and the hostess/waitress were very attentive and accommodating. The chef struck up a conversation with us and was just a pleasant spirit to have preparing our food. Sawa Sushi will definitely be a permanent fixture in my foodie rotation and I recommend making them a part of yours.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "__yBbI1Vhz853QUJpPjO0A",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sapporo, sushi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/__yBbI1Vhz853QUJpPjO0A/o.jpg"
      }
    ],
    "user_id": "HfUauM3NFobW9WMs9UgXxg"
  },
  "uiIeOKXuNXS5P8l8uYeAzw": {
    "date": "9/12/2019",
    "text": "All the staffs and chef are really nice, they even know make the joke in not making you embarrassed way.  Blue fin tuna and green mussels are the best among the food I ordered. Beef udon is so tasty, is more delicious than most of udon I think. Sushi are good too, little bit spicy but it's my plate for sure. Sawa sushi is a really good restaurant and more than I expected, even thought far from china town and school, but it was deserved me to go again! I'll definitely come back to try more good food there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9HU5umq_PrPZibdDM7yrpw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Beef udon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9HU5umq_PrPZibdDM7yrpw/o.jpg"
      },
      {
        "img_id": "n7YOgku37-7XEoehOzkyvg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Green Mussels taste so good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n7YOgku37-7XEoehOzkyvg/o.jpg"
      },
      {
        "img_id": "Tyo8WViZ_yGoQhP1qj5D1g",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Tyo8WViZ_yGoQhP1qj5D1g/o.jpg"
      }
    ],
    "user_id": "co1iqcD6BlUvRMF_LLXfWQ"
  },
  "XsOnXBVfC1OmtjIKfyYd5g": {
    "date": "4/18/2019",
    "text": "This is my latest Saturday night hang out.  Very Friendly Staff and the Owner Steve is a super cool and friendly guy, dropped my wallet one night and I called and he was excited I did as he found it...everything in it, so I had sushi 2 times in that weekend.  They have fresh fish and ingredients,  order 2 rolls get one free cannot beat that!  If you have never tried real wasabi you need to ask and it is better than the fake paste, trust me you will like it.  If you order the Large Sapporo Beer you get a free house Saki...also they have really wonderful Gingo Saki it is filtered Cold and delish...  They always have fresh Specials on the board and if you get there early enough then you get a seat at the bar also if you go later say 9 pm you can get a bar seat also.   Been here many times and will do the same in the foreseeable future",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GVUEdCDndoaOYmPgQWn8DA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GVUEdCDndoaOYmPgQWn8DA/o.jpg"
      },
      {
        "img_id": "cTAJVwLwDDGDcgLkoplc6w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Free sake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cTAJVwLwDDGDcgLkoplc6w/o.jpg"
      },
      {
        "img_id": "fXfsxlQawPjvluVekThoIw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Buy a sapporo get a free sake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fXfsxlQawPjvluVekThoIw/o.jpg"
      }
    ],
    "user_id": "kv3yrDkT6ylqC01NlMDuzQ"
  },
  "P20-acXa_-3Bloa7JjAbXg": {
    "date": "8/12/2019",
    "text": "Today's lunch stop was to Sawa Sushi, a place that husband wanted to check out after seeing positive reviews on Yelp.   I'm not the finicky self-described sushi snob that my husband professes to be, but I can always find something good to eat at places like this.  We entered the establishment during their lunch period and was greeted/sat by our pleasant server.  Husband was a little disappointed by the lack of standard iced tea (only green iced or hot tea) availability and settled for a Pepsi.  I had the iced green tea.  We placed our order from the lunch menu, each of us ordering the chicken teriyaki bento box with a side of fried gyoza.  Husband ordered an additional eel roll for himself.  Our miso soup was brought out and soon thereafter, our plate of crunchy gyoza's.  Both were delicious.  Curiously, the dip for the gyoza had a slight \"bite\" at the end, making it a surprise and making me wanting more.  Once our bento boxes were delivered, but I was a bit put off by the lack of teriyaki sauce covering the chicken.  I would have liked to have all pieces of my chicken generously tossed and covered in teriyaki, not just the center pieces having the sauce quickly squirted on.  The edges were bare naked grayish brown cooked chicken.  The teriyaki sauce beneath the bed of cabbage (beneath the chicken) was of help so I could scoop some sauce with the bare chicken pieces.  The salad was topped with a nice creamy \"Japanese Ranch\" dressing, which I found pleasant.  Overall, the bento box combo was delicious and I had a great lunch.  Our server was friendly, spot on when it came time for drink refills and efficient in her table visits.  I would definitely like to return to this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5meP1xjfhI1Mmtg-iirk6w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Husband&amp;#39;s chicken teriyaki bento box that looked identical to mine (I started eating mine and forgot to take the picture)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5meP1xjfhI1Mmtg-iirk6w/o.jpg"
      },
      {
        "img_id": "NTJzzv9-1-P2BoRRCEuv5Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Our final bill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NTJzzv9-1-P2BoRRCEuv5Q/o.jpg"
      },
      {
        "img_id": "SfhuNbEPXZXdSugsoBaZFw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Crunchy fried gyoza with amazing dip",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SfhuNbEPXZXdSugsoBaZFw/o.jpg"
      }
    ],
    "user_id": "cSf9WaSdTIBd6bTIsesaHw"
  },
  "9TplLIbcfDElgX-x2udLGw": {
    "date": "12/23/2018",
    "text": "I visited Sawa Sushi before leaving Blue Diamond Crossings shopping plaza while Xmas shopping. Not sure why I made this decision as I wanted nor dim sum rather than sushi and ended up with ramen.   When my tonkatsu ramen was served, it was a large bowl. As I  expected, there was no wow factor. I was hoping the broth was going to be good but lacked flavor. But that is what I should expect as this is not a ramen shop.   I do plan to visit again to try the sushi in hopes of raising the number of stars.   I do think that the restaurant is a little too dark even at 2 pm.   And why this review is at 3-stars and not any lower is the good customer service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "z98hx6sOrCAY5FRB-cCiWw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. No fuss tonkatsu ramen- pieces of tonkatsu, a boiled egg, green onions and noodles.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z98hx6sOrCAY5FRB-cCiWw/o.jpg"
      }
    ],
    "user_id": "leyNDNVu09Ldbg5ujPWMhQ"
  },
  "nW_K-xJ0QVWupanqTIh_pw": {
    "date": "4/20/2019",
    "text": "Just to clarify this is NOT AYCE. I would not recommend; not because it's NOT AYCE. Sushi was less than desirable - tried Red Lady roll, King Cobra and Krabby patty. All rolls we've never tried before and never heard of before. Not taste nothing special. Ordered bento box - ok - teriyaki just cooked with sauce poured on top and not marinated. Now their tempura was excellent and dipping sauce was good. Also tried their karage chicken - ok but sauce did not match; needs a ton/chix katsu sauce. Something else new and different - deep fried crab sticks - ok but again wrong dipping sauce and they should warn you it's spicy. Slow service for a small Restuarant. I'd rather pay more for AYCE - paid $67 for TWO people with a discount. Staff nice.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SLfP0WMpUTStbamG4nunJg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. HS roll page 2",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SLfP0WMpUTStbamG4nunJg/o.jpg"
      },
      {
        "img_id": "B1U-0xh3-fgVxlEtc2fDxA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. HS rolls page 4",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B1U-0xh3-fgVxlEtc2fDxA/o.jpg"
      },
      {
        "img_id": "okIMiM2sRZuKGHv_Kyvbew",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. HS rolls page 3",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/okIMiM2sRZuKGHv_Kyvbew/o.jpg"
      }
    ],
    "user_id": "5ArMzPUBncPqDrB7PmZBCg"
  },
  "HpScIuoRYrehu3bL9hcCAg": {
    "date": "10/5/2018",
    "text": "My first experience with a NON All you can eat sushi restaurant, and I have to say, I was extremely impressed.  Sawa Sushi is super close to where we're living now, and my roommate decided she wanted to have sushi for dinner, and that I was joining her last night.  Who am I to argue with a sushi date?!  Sawa is a small restaurant that is open, well lit, and very clean.   It has a few tables and a small sushi bar with seats.  We opted to sit at the bar.  We ordered the Sawa Boat, which was chef's choice of 9 pieces of sashimi, 6 pieces of nigiri, and 2 special rolls, with a cucumber salad.    We received:  Super white, Tuna, and Salmon for both nigiri and sashimi, and also had yellow tail nigiri.   For the special rolls we chose a Rainbow roll and the snow white roll, both with no avocado.    Let me tell you, this is some of the best sushi I've ever had.   Everything on the boat (and it was literally served on a giant wood boat.) was perfection.  They were great about avoiding the avocado, too.  We also ordered a couple things a la carte:  Uni Amaebi (with deep fried heads) Quail egg nigiri  Quail egg shooters.  Everything was absolutely delicious.   Service was impeccable.  I cannot wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "N-4PYsebt20Gd2ql1CD3DA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Fried green tea ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N-4PYsebt20Gd2ql1CD3DA/o.jpg"
      },
      {
        "img_id": "V9Nuhi7P7NMtnmcw3tsH7Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. FRIED SHRIMP HEADS!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V9Nuhi7P7NMtnmcw3tsH7Q/o.jpg"
      },
      {
        "img_id": "5QkDYJeWmM-s5IvbFYlscg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Amaebi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5QkDYJeWmM-s5IvbFYlscg/o.jpg"
      }
    ],
    "user_id": "renPzRDqMZpMaHiCD_e1_A"
  },
  "_REhiLVwuH2z6mZ2g9xyGw": {
    "date": "4/15/2019",
    "text": "Can't wait to come back and stuff my pie hole full of more deliciousness from here... Appetizers of himachi collar and the crab and cheese cake was sooooooo good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YDJt8mDMIdqYzMf2F-gNqg"
  },
  "FtgDl0kcebN7rMMaFBbAZg": {
    "date": "9/2/2018",
    "text": "Although this place has received some good reviews, sadly my experience was pretty average. I was running errands in this strip mall and got hungry because that is what shopping does to me. So I spied Sawa Sushi and went inside.  First of all the Spicy tuna roll was falling apart but it tasted decent. The rice was crumbling when I was picking it up with my chopsticks and YES I know how to use chopsticks.  The fish was fresh but I like my roll to stay in tact, fresh fish or not.  My ramen also took awhile. It was 30 minutes (I checked my phone) from the time I finished my spicy tuna roll and when I got my Ramen. It was quite a wait inbetween dishes, I was starting to thin that maybe they forgot my ramen. The people who ordered after me had received all there rolls and were eating happily. I was jealous, a little,  The Tonkatsu Ramen was nothing special really, I had better at Ramen places for the price. It was just plain Tonkatsu Ramen but if I wanted Ramen I should have gone to a Ramen place, I know!  It was okay. I do not think I will be coming back to Sawa. Sorry Sawa!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "qjXLWQD6MNbLWHN7Opu6TQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Tonkatsu ramen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qjXLWQD6MNbLWHN7Opu6TQ/o.jpg"
      },
      {
        "img_id": "OclSyT-kCKxbBa7JWsIhQA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Spicy tuna",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OclSyT-kCKxbBa7JWsIhQA/o.jpg"
      }
    ],
    "user_id": "quDu_Z0-i9TCYvdHRnULEw"
  },
  "3IPSlf62REwX13t_FgD04Q": {
    "date": "9/7/2019",
    "text": "This is a hidden gem located in the Target parking lot. You walk in and it's a cute, Asian style cafe. We ordered Gyoza and bento boxes. The gyoza was perfect and it had this sauce that was really tasty. The bento boxes were huge and delicious. I have no complaints. Staff was really friendly. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i5ew-XZD4SYZ6j3gbIwHPw"
  },
  "v3C6YWm8_RreaMLaFmNMBg": {
    "date": "6/11/2019",
    "text": "Authentic food.  Clean.  I highly recommend this place. My wife absolutely loved the sushi and I loved the teriyaki chicken plate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PuY7pvSpvRtssE2-9vqizw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PuY7pvSpvRtssE2-9vqizw/o.jpg"
      }
    ],
    "user_id": "YodtjKTBpjwm_PHD_SYgmw"
  },
  "y7AqApvWqPsNdtMb_r2qdg": {
    "date": "8/6/2019",
    "text": "I waited a long time in between each dish I had ordered while everyone around me was happily eating. The sushi was okay at best.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeMxvPGkxb9pyerB0B2RPA"
  },
  "MERDwC52OGJk_sBvZeI7ig": {
    "date": "1/10/2019",
    "text": "Pretty stoked on this place. First time here and the nigiri and sashimi was very fresh. My mom just moved here from Japan (where I grew up) and I've had a really hard time finding a sushi spot that impresses her. We were both really happy tonight. Not only were the pieces really fresh but they were nice and thick as well. Looking forward to coming back. If the quality is always this good then I'd have to say that this is one of the better sushi places in town.   Update: Went back exactly one week later and ordered the same sashimi platter and the cuts were not as fresh and were not nearly as thick. It was still fresh but with the cuts being smaller, it's going to be hard spending the money on the sashimi platter again. Also the nigiri was smaller as well. I'll give it another try. They had two chefs there and I'm not sure if we had one the first week and then the other the second. Notice the slits in the nigiri in my pictures. The nigiri didn't have those the second time we went which makes me think it might have been a different chef. Hmmmm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "sJQabxpKBfrz6LfoeMReXQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Hamachi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sJQabxpKBfrz6LfoeMReXQ/o.jpg"
      },
      {
        "img_id": "_KvOSJvU2LyCwe8cKezdjw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Blue fin tuna",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_KvOSJvU2LyCwe8cKezdjw/o.jpg"
      },
      {
        "img_id": "DfWIDoEWU0rIX12GpHv9Yg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sashimi combination. $30 but so worth it. The cuts were really fresh and thick.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DfWIDoEWU0rIX12GpHv9Yg/o.jpg"
      }
    ],
    "user_id": "day9dFcIcPr0KjcxjugKaA"
  },
  "O2MUxGZAR32oBmNN1t9hCg": {
    "date": "5/19/2019",
    "text": "Excellent sushi and very reasonable prices! The Cajun tuna is excellent, we had the bonzai, titanic and Snow White, buy 2 get the third free. Perfect lunch and friendly staff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "H6eTQAFhMIdPl9aWGSKqAw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Cajun tuna",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H6eTQAFhMIdPl9aWGSKqAw/o.jpg"
      }
    ],
    "user_id": "u3AqPkVAD7nwomoD5ip1LA"
  },
  "_RbarYX49sve4j42LDCT_g": {
    "date": "5/8/2018",
    "text": "It has been two years since last eating here and I finally found myself in this area again for dinner.   Craving sushi, I revisited this location and still found good value in this meal.  An offer for buy 2 get 1 free on special rolls posted right outside the complex is what convinced me to dine here.  Special rolls average around $8.50 and up to around $13.  I had the DHA roll again, a shrimp tempura crunch, and a Philadelphia roll.   The DHA roll with spicy yellowtail inside, tuna on top, with the screaming O sauce was good.    We ordered shrimp tempura, green mussels, gyoza, and a cali roll for the kids.   All portions were good for the money.  The total came to be right at $50; good for feeding a family of four.    The restaurant was not busy at all so getting our food and server's attention was fairly fast.  An improvement from my last visit, I would return to eat here if I find myself nearby again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Mho2GibREwsPesKEyQbt8w"
  },
  "GNBl-azkEfVOGLcvugX3aQ": {
    "date": "6/25/2019",
    "text": "Easy to see why Sawa has so many great reviews!  Great food, great service and reasonable prices.  This is a small restaurant with a great sound system pumping out smooth jazz tonight.  Located in a small outparcel at a large shopping center, it's easy to miss it.  Located straight out from Big Lots and ROSS.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v6CKIUCUQYm4LZPFxgvMww"
  },
  "hqVf1FdaXZW8vm7HxAHInw": {
    "date": "9/1/2019",
    "text": "This place was really good, did not disappoint. Everyone was very friendly. I will definitely visit again next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t02KsJvIC5oMd82JEcT1LA"
  },
  "lZnQ8VM75CCdG180UtdH_g": {
    "date": "2/21/2018",
    "text": "My husband and I were running errands in the area and found this sushi restaurant in the same parking lot. We were very happy with the sushi and service we received here.   As soon as we walked into the restaurant we were warmly greeted by the waitress and the sushi chef. The waitress gave us a couple of seating options and took our drink orders right away. Our food came out quickly and our drinks were continuously refilled. The waitress was friendly and attentive.   The menu here is great, offering a large selection of sushi, 55 types of rolls (!), and ramen among other items. Everyone will find something to enjoy here.   I started with a House Salad with creamy dressing and Edamame. The salad was packed with greens and other vegetables. The dressing on top was delicious.   We shared a Crispy Rice Roll, a Spicy Girl Roll, and a Godzilla Roll. All of them tasted great and tasted fresh. The Crispy Rice Roll was my favorite. It was crisp without being greasy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "8llwf_JHbRRh8hlDe58frA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Godzilla Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8llwf_JHbRRh8hlDe58frA/o.jpg"
      },
      {
        "img_id": "_1DhLF2roBnbtB3hFXGWMA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Spicy Girl Roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_1DhLF2roBnbtB3hFXGWMA/o.jpg"
      },
      {
        "img_id": "KNbnl7GFWWK5A_G1yW9S9Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Crispy Rice Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KNbnl7GFWWK5A_G1yW9S9Q/o.jpg"
      }
    ],
    "user_id": "3nIuSCZk5f_2WWYMLN7h3w"
  },
  "6ivoib_efB42zMzEbaVm1A": {
    "date": "9/16/2017",
    "text": "This is some of my favorite sushi I have ever had. The quality is fantastic. The flavors are amazing. And the price is totally worth what it give you. Totally worth the 5 stars! Go here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EE4_RwlFNJ4iOc5pyau4uw"
  },
  "gfzgE95BYaogHjj2ic4j0A": {
    "date": "3/22/2016",
    "text": "Amazing sushi, WOW is the correct word i wanna use for this sushi restaurant.  my 10 yr old and 7 yr old, wife and i...  Good every bite  I order 8 sushi varieties and all i can say is... i'm coming back for more...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hebSyuC8IQ-PfK2Umuawjg"
  },
  "jFDJQ6LQU3LiCnEpgbwEXA": {
    "date": "8/22/2016",
    "text": "Chief Nikko is the best, he goes out of his way to make sure your needs are met. Great food at a great price!!! The crew is like family and you feel welcomed right at the door. Love love love it here, we will be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SuswrSfQfmHUrZmXJevoYQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Great price great food overall great people. Nikko is the best, easy to talk to and goes out of his way to make sure your needs are met.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SuswrSfQfmHUrZmXJevoYQ/o.jpg"
      }
    ],
    "user_id": "dpQk5WeFhmmIbhagtkowiQ"
  },
  "EkrWIMjUXjNhjQJ4Rl649A": {
    "date": "6/29/2017",
    "text": "The sushi was good, and we sat right at the bar with no wait.  The chef's are fast and friendly, as were the waitresses.  The price is the reason for a 3 star instead of 4.  Two of us racked up an $80 bill and we ate less than normal knowing it's not AYCE.  There are better options for AYCE at a lower price point.  If they ever offer AYCE, I will be back.  Too pricey for average sushi as is.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q-j11rYzZZ_OnwI_5WaOKg"
  },
  "-VtJ0qoouJPmlL1uYsKKlg": {
    "date": "1/21/2016",
    "text": "I've been looking for a laid back sushi place near my house that's not too pricey! Great food! And greet service! The sushi chefs are very nice and when you walk in they great you.  Only thing is I wish their rolls were a little bigger. Then run a tad smaller than what I'm used to from the places I've been to living in Orange County CA.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5j4vSyAiRu7BZROdchdKA"
  },
  "X7yRrOYIofOrkUf1nUZo-Q": {
    "date": "11/30/2015",
    "text": "Really quaint sushi establishment off the 15. We stopped here craving sushi on our way back from Vegas.  After complimentary pickled cucumbers, we got the sashimi salad (selection of shrimp, tuna, salmon, white fish) and the sashimi platter (3 pieces each of salmon, tuna, white fish).  We also got plain edamame  Overall it was nice was to satisfy our sushi craving but definitely a little pricey for lunch and the quality of the fish, especially given the selection we're used to back in LA.  Very quiet and great service, though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yYrd4GxDjlodoVvYc2O37g"
  },
  "eLjpN58jWobBlx3NKlT7lw": {
    "date": "3/11/2016",
    "text": "Happy this place is here! I love the selection and they're deals are great. Sushi is buy two rolls get one free. Also, if you buy a large Sapporo you get free hit sake! Yum it's so perfect and right down the street from us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ema6BjcUJz7GEafLaSsjVw"
  },
  "SJ007HkzA_6JWjKmkSTAEg": {
    "date": "9/2/2017",
    "text": "I love this place wonderful food  great service Best Sushi ever. Love it 100% recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ad-qSpSkYs_QxWFfDKX7zg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ad-qSpSkYs_QxWFfDKX7zg/o.jpg"
      }
    ],
    "user_id": "2s1ErxvFVQsw4LyqFGlxVg"
  },
  "LJ0Fe-gPQzcjZbt8sK_OOA": {
    "date": "11/25/2015",
    "text": "I'm new to the area so I decided to Google sushi Sawa happen to be less than a mile away from where I was.  Boy am I glad that they there. The fish was so fresh the customer service was excellent I will eat there again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "--gRfh1L_s9HTbIVQFBvJg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Wonderful -",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/--gRfh1L_s9HTbIVQFBvJg/o.jpg"
      }
    ],
    "user_id": "-B1eD9vmgIhLOqpg_FuTew"
  },
  "V30NJbPtUiv5_tV8LvwKlA": {
    "date": "7/9/2017",
    "text": "This is the only place I get sushi anymore! The staff is amazing and friendly, always give me a warm welcome. They just added a new roll called the winter roll and it's my new favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNZ9m7FpG1osNVjchCnTLw"
  },
  "xZDSjN5xvPiewtwwBqSokA": {
    "date": "10/25/2015",
    "text": "This was my first time at Sawa Sushi, my  friend had gone with his son & enjoyed Sawa and today was my lucky day....he decided we would enjoy it this evening. Wen was our waitress and Steven the owner was as gracious and welcoming as could be. We proceeded to order several rolls & each that came out was better than the last. We closed the restaurant and even though late our timeliness was met with s smile and graciousness. Thank you Steven for making my 1st experience at your quaint restaurant very enjoyable.  I will tell all my friends!!! After  47 years in Vegas you will be on my radar!!! Again thank you!! And... Thanks for the smile!!!   P.S. Wen is great!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "7EKqhxd0VKNTqOIlfB8D0g"
  },
  "H5Rhha_SaVgDmXUXxHXZyQ": {
    "date": "3/31/2017",
    "text": "Wow what a great place! So friendly- but most importantly fresh! Found this little gem yesterday and we are back the next day it's a must try!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AV05TRVlOnd_HP3TX-xs-w"
  },
  "w_VhUTgClUMB8gVjAdprEA": {
    "date": "8/14/2017",
    "text": "This is a pretty small simple place but the customer service is excellent! They greet you as soon as you walk in the door and are very polite and always offering to refill your drink or even give you some advise on what they recommend on sushi.  The sushi here is excellent and has a very unique style and taste.  They make it very quick and it looks like a work of art.  Prices here are really good and have some pretty good promos for ex. They have buy 2 sushi rolls and get one free.  Honestly there's nothing I could think of to improve this place. It's just a great place to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_lY1Kq9SlOgRbQ3SIlYyw"
  },
  "ys4AoNAB94gRM7u0BL5iNg": {
    "date": "3/27/2017",
    "text": "Defianately recommend. Excellent service, great sushi. One of the top dragon rolls I've had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQDsHEsb-edV-EjaEo67SA"
  },
  "2r-OjNx1dl30Gd6txcfdaA": {
    "date": "9/23/2015",
    "text": "$8.95 for a Lunch Teriyaki Bento box (incl. Rice, salad, teriyaki chicken, veggie and shrimp tempura and 4 pc California roll) is as good as it gets! Its fast and there is always a table, no wait time whatsoever.   Here is my take on this place 1. Bathrooms are clean  2. Wait staff are always sweet, fast and attentive  3. Food is great  4. Great price for the food",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "-pCIK2f47lHXiAw-uiD-aQ"
  },
  "DtEAVHGk-zdaTZo-QWSD1A": {
    "date": "8/27/2016",
    "text": "This place is #OUTOFBOUNDS #FLAVORTOWN with a great staff. Food is fresh as can be and bottom line its fantastic. Call ahead and see if Niko is working you wont regret it. I had the Ichiban Roll and the Miso, they were both outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bSaZqFClSyuNq6PdBJa_xQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bSaZqFClSyuNq6PdBJa_xQ/o.jpg"
      }
    ],
    "user_id": "KeBOB_nbTCGPbM4kkl1_EQ"
  },
  "6h58k7bg2O8FGpvP7Rpx5g": {
    "date": "7/28/2017",
    "text": "This is by far my favorite sushi place. They have really good quality fish and ramen. I had the crunchy shrimp roll and the tempura was excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mpAvXTVqpcWsDktZZgoxkw"
  },
  "ZC4E-GB53hj6rH61wQ4YNQ": {
    "date": "10/8/2016",
    "text": "They entice you with their Buy Two Get One Free sushi variety but nothing stands out on taste and the sushi portions are SMALL!  Pricing is $$",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_9ZXdxlJtzoXMtG39z8nA"
  },
  "laEMvm9lVgnYD2M1zl5_mg": {
    "date": "3/3/2017",
    "text": "This place is a little pricey since it isn't all you can't eat. One roll with miso was $16 before tip. The music was a little annoying to listen to and kind of loud. l don't know maybe pick music that isn't talking about a girl trying to hook up with another's girls man and how she could love him better, but anyways... The Baja roll was really good! It has Spicy tuna with salmon and avocado on top!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXg65ayKrgpsC_0fM5jMyg"
  },
  "-jQw09OJ8FtSACaB0rbPAQ": {
    "date": "4/5/2016",
    "text": "Husband and I had the bento salmon lunch! Also had the chicken skewers Great as well.....   Delicious great service! When in the area will come here to eat!   Restaurant and restroom clean!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpRO8Z-Xs8ydJPh59aUJQA"
  },
  "enbEw5wuJtFws5Hd98F23w": {
    "date": "5/4/2015",
    "text": "It's a Japanese sushi  place that you will not be disappointed.  I will definitely come back.  I highly recommend it.  Server was so hospitable, friendly and nice.  Chef was great!!!!!  My whole entire family loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ozIB3sL55-XAVR4h7B3bsA"
  },
  "QQYGdzjGArDdK_qfIeG9rA": {
    "date": "1/8/2016",
    "text": "Food wasn't bad, service was lacking though.  There are too many good sushi places to waste time at a mediocre establishment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wriUMvZpZa3VwcIo8D3xA"
  },
  "rEhBpU1LkfbIm6R3ijl_tw": {
    "date": "3/19/2016",
    "text": "Very fresh sushi. Great prices. And amazing service. Doesn't get much better than that!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "75-UkmS4uTfpsRsQ-cdcxA"
  },
  "uwZzA2VEG1__STlIqo4BjA": {
    "date": "11/21/2015",
    "text": "This is a newer place but fantastic. The Dynamite baked roll was the best I've ever had. I love sushi and this was top shelf. Well done and I hope they do well there. I will be back! !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wW3ZJU38TtE97OAa_9A37A"
  },
  "Lhw5DBNfH7DKEvGVK8RxVw": {
    "date": "8/9/2016",
    "text": "I will definitely go back here ! Everyone was so friendly and attentive. It was Nikko's first day and I felt like he had been working there forever lol .. He made my sushi PERFECT!! Thank you Nikko :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sFwBx1CRa4lfHMZbGB-KHA"
  },
  "Llq5YBZ4DSrYntYdIQ6T4A": {
    "date": "9/29/2015",
    "text": "Have been here a couple times now...food comes fast and is really good, tho i wish they had \"all you can eat\".  So why only 3 stars? Both times i have come here i have had the same waitress who has ZERO personality!  So much so that it made us feel really uncomfortable.  She barely says anything to you and instead of asking if we were ready to order, she walked up to the table and just stared at me until i got uncomfortable enough to just order.  Despite having tasty food, i dont know if we will come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AoyhM-KUx2DfKH5DgLS5kQ"
  },
  "FWoKZFS7ncPq3t_7gyBiTQ": {
    "date": "9/21/2016",
    "text": "Great Customer service by Nikko the sushi chef! Highly recommend this place when your in the Area! The rolls are fresh and the best part is you buy 2 and get the 3rd one for free!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NsN2oRXiBOgLBMKmXxeNwg"
  },
  "k7WuK_3qEmigetypAUyWXw": {
    "date": "7/26/2016",
    "text": "honestly one of the best sushi i've ever bad. these people know how to make sushi. the rice is supposed to fall apart people, not stay compact. thats the first sign of poor sushi skills and this place was perfect. flavors were great. highly recommend the dynamite roll!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9ZeJYe1ATkxfScIuIfnaw"
  },
  "5OmU7vX1nj7BopRkfAIYXw": {
    "date": "10/31/2016",
    "text": "Excellent fresh sushi in a cozy atmosphere. Owners are super nice and you are always greeted when you walk in the door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s6l50cUpguxECtpyAYO1ww"
  },
  "e9hm6fDaK4lb3I8cjfpEwQ": {
    "date": "10/25/2015",
    "text": "The rolls were fresh and had a great combination of subtle flavor. The overall vibe, was relaxed and great for a dinner date. It was an amazing experience, great food great service. will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KH1hq7My14B8ipuIy-lWHQ"
  },
  "hPSU6_G8JAQrKQJvGnVB0w": {
    "date": "8/27/2015",
    "text": "Juust had a very enjoyable evening at Sawa Sushi. The food was awesome, sashimi was fresh and clean tasting. Beer was ice cold and Sake warm. Have eaten Sushi all over the US and this place is a little gem! Prices are decent service good. The spicy garlic Edamame are Slammin! A Must Try if in Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H101_sdlRPLAxXEkdWjLpw"
  },
  "lLRsS4mpXy-318KLzLKEGg": {
    "date": "8/7/2015",
    "text": "Great service and food!! The communication from the waitress to the chief was amazing. Very friendly and family oriented place. Tried the Aloha ,\"Mistake\", and the Rainbow roll. All were great!  My 6 yr old son plowed through the Bento lunch box and was happy. Would definitely eat here again the next time we are in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QHoG7LKyPvnC1XPAF7wX-A"
  },
  "g1PccWTn_yguage93xFQOw": {
    "date": "9/30/2016",
    "text": "Thanks for a great lunch I appreciate the service. I recommend this place for quick bites.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Ncus6f3U3U4luRofVrnrQ"
  },
  "MH0mEl9s7zSfpuMk2KMAvw": {
    "date": "9/30/2016",
    "text": "We've been coming here for about nine months now, we love the food, service is excellent, we manage coming for Binto Box often, we were just there and brought a friend, she was amazed, we will continue to come and continue to bring our friends.  Thank you for opening the great place so close to us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1gpbAS4jQp09ZqhbmLBbKg"
  },
  "ggLKr90NduhSZ5q4Mf3KAA": {
    "date": "7/2/2015",
    "text": "This was my 2nd time there for lunch break and I was really disappointed with the service there again. They took 40 mins for me and  my work mate just to get 2 sushi rolls each for the lunch special. They didn't even give us the miso soup that comes with it! We just left because we missed our lunch. Not cool.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TINvhA3QP_qc5gviMMnetw"
  },
  "ivwmr9ZY-nza0-X-pxgJyQ": {
    "date": "3/12/2015",
    "text": "good place to dine in!Had several great rolls!Dharainbow and in&out are really tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xU1j2Xt_yQYKoeMAOM3s8Q",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sawa boat！really good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xU1j2Xt_yQYKoeMAOM3s8Q/o.jpg"
      },
      {
        "img_id": "oGn716FdNzxnhnEaTbLVUQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oGn716FdNzxnhnEaTbLVUQ/o.jpg"
      }
    ],
    "user_id": "hhiIqXC9w3Z0tNU4yqz2Xw"
  },
  "mQhILyb9Y6LwZG7d5veO9Q": {
    "date": "9/30/2015",
    "text": "Kind service--prompt and courteous. I loved it. Food was so good and they have the best cucumber salads around. The miso was great and even though I was a simple \"to go\" buyer, I was treated with the same care and quickness that a person eating in would get. Well worth it and great value for what you buy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vk7ot8zRnmaLfK0SY2ZNRg"
  },
  "-8H1CVz8hiXrhKDmrJ8VDQ": {
    "date": "5/17/2016",
    "text": "The tuna was not as fresh as I hoped for.  It's not a bad place for fast sushi service.  I would go back but stay away from tuna.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZqNahR0UjLDQcGANw-q3A"
  },
  "U1JgnFkQJ9oZLpMAHqeuow": {
    "date": "8/11/2015",
    "text": "I love this place! Every time I come the sushi chef make sure to be real kind and full if joy! The sushi is real fresh and melts in your mouth! Happy happy customer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_WXd0lAUNk0nFeUOTAKsQ"
  },
  "GL6Mzqs342Gflv-bYfwBXA": {
    "date": "3/6/2016",
    "text": "I am really hesitant to write this review, because I am afraid this place is going to get too crowded. Probably the best Sushi place I have been to in a very long time! And believe me, I can distinguish between good and bad sushi. All the fish tastes like it was still swimming 10 minutes ago. The rolls are awesome and selection is huge. I will be a regular there for sure. The owner is the sushi chef himself and the staff is friendly and welcoming. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDN2Z_5fF6Igt0rSuJb8cg"
  },
  "qY1NPLjkhPMtZNjyAqR1Kg": {
    "date": "9/18/2016",
    "text": "This place has some good quality sushi .  It's small and cute and the music is great . The servers were nice and it facilitates great conversations .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zZ5tvQxMMffafZGNQFIAjg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zZ5tvQxMMffafZGNQFIAjg/o.jpg"
      },
      {
        "img_id": "91szguNTGRuWmKp02NEDVg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/91szguNTGRuWmKp02NEDVg/o.jpg"
      },
      {
        "img_id": "9ONO3UmN212qlSbG9MMnhQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9ONO3UmN212qlSbG9MMnhQ/o.jpg"
      }
    ],
    "user_id": "EcE0TDJnA7Mk6Spi_09Utg"
  },
  "EzQ8o1xKp4n3fuXJF-aoYg": {
    "date": "3/18/2018",
    "text": "The food here is amazing. Everything I've ever order is great and I highly recommend the chicken ramen.   The service however is consistently terrible. There is always only one server working no matter how busy and I think once she may have also been helping in the kitchen because it took us over an hour to get our food. One visit, we gave up and just left, because we had to get to the airport and in my opinion waiting an hour for food in a restaurant with only three tables is a little ridiculous.   I'd love to give it 5 stars but the management clearly needs to hire more staff to avoid long wait time and food coming out cold.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFPErN_p_BLB_aacA8IklA"
  },
  "xeBDgfc8J5_ovXpkZnPzYg": {
    "date": "6/18/2016",
    "text": "Sushi was very good. Had 3 different special rolls and the service was very quick.   The bento boxes are a good size portion and deal for people as well as two of my coworkers had that.   Only here for the week but I'd Come back if I came back into town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RNb7C8V_4r3d8JYdzLoGCQ"
  },
  "3H9FhHT0YDd_DJEUfdfJbw": {
    "date": "2/2/2018",
    "text": "Amazing sushi at Sawa Sushi. What a find.  We didn't want to go to the strip and we ate here. Steven is the owner and his real  name is Sawa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooQrYVHxTQ9xG1hEIocmkA"
  },
  "I8Nhlpns0nPi7Pw973cA4w": {
    "date": "4/19/2018",
    "text": "My new Sushi place! Not crowded, good music, sports on TV, and the freshest sushi outside of SFO. #DELISH",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ldGSi5QeiuSNt0AWj3dzAQ"
  },
  "MiY4wbcdiguu0X4rsglLoA": {
    "date": "3/18/2017",
    "text": "The food here is so amazing every time I come the food is just as irresistible as last time! The quality is consistent! Steven and Michi offer such great service! Some restaurants are good sometimes depending on certain times of day and different cooks.  Steven the owner is here 7 days a week making sushi so there is quality control 100%. I have been here many times. Here is the Cajun Salmon Salad",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RxSv_Iyw_LASBrbUaGb2uQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Cajun Salmon Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RxSv_Iyw_LASBrbUaGb2uQ/o.jpg"
      }
    ],
    "user_id": "REDgNK7Ikr9BGhJKAujoiA"
  },
  "8TijHDGeRp4pttmMOJYy2w": {
    "date": "1/17/2016",
    "text": "I've been out of touch for a while but I will say this. The rolls here are delicious. They have this buy 2 get one free deal so that's cool. But it is a little pricey. We had 3 rolls 4 hand rolls and salmon Kama it all came out to about $70 that was including tip. The way they make their Ponzu sauce here is awesome and they are really nice. But I'm giving this 3 stars because I feel you can get more bang for your buck at an AYCE. I didn't even order any nigiri so that should tell you that I didn't leave feeling full.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GRCh9wRy4Ovw2TD4zbZrLQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GRCh9wRy4Ovw2TD4zbZrLQ/o.jpg"
      },
      {
        "img_id": "7ZVdB-nAedP4e1unDcIFcQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7ZVdB-nAedP4e1unDcIFcQ/o.jpg"
      },
      {
        "img_id": "yEMToNqEDJel-Kk62YRKgA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yEMToNqEDJel-Kk62YRKgA/o.jpg"
      }
    ],
    "user_id": "aWXGwath_dSGPwNdFiy9BQ"
  },
  "kk4obkeZTxvw7mnnmCHQdw": {
    "date": "2/9/2017",
    "text": "What a gem! Did not expect a little Japanese restaurant located in a mini mall to be this delightful! Everything is great; sushi, udon, teriyaki, tempura... all standard and moderately priced. A surprising item on the menu is the sashimi salad. YUM! The salad dressing is delicious... light and crisp, hint of sesame. Gotta try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AKWPQLa4QxKOVE_FBRtUA"
  },
  "CA0eZtYUMF95q36ZzAddjg": {
    "date": "5/4/2017",
    "text": "Excellent. Great prices and nice portions. We had the fried chicken appetizer. The breading was light and the dipping sauce spicy. Mister ordered the ramen, which was just ok (but he was comparing to Monta-not fair). The seaweed and cucumber salads were healthy portions. I had the Himachi Kama...yummy! We had a couple of nigiri and fish tasted fresh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SYHEE-9S1-N5DJ7PCT1uLA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Hamachi Kama",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SYHEE-9S1-N5DJ7PCT1uLA/o.jpg"
      }
    ],
    "user_id": "eFQPgNR6wbHFZNgGqNP04A"
  },
  "DzaXy3sqGGnDlxVrUSyNNA": {
    "date": "1/12/2016",
    "text": "Simply Brilliant.   Cold winter nights ignite my adventurous side to seek out new dining. Craving sushi I stumbled upon this humble & unassuming restaurant.  The moment you walk through the door, you're greeted by the booming voice of the sushi chefs hard at work creating their masterpieces. Wait staff got me seated immediately!   A personal favorite, the chu toro is quite simply brilliant! Soft, succulent & quite delightful, the chu toro is something that I'll be fantasizing about tonight.   The broad range of specialty rolls & the buy two get one free will leave you feeling stuffed. Craving spicy tuna after the chu toro I opted for the Baja roll, bonzai & spicy sea. Whilst the Baja & spicy sea delivered a little heat, neither came close to bonzai's. The siracha & jalapenos are subtle enough & meshes with the overall flavor. Their creations are for all to enjoy. Only the freshest of fish will do & sawa delivers.   With prompt service, personable sushi chefs & the freshest of fish. Sawa has found themselves a loyal fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DCnLXdhQYTvFy7SvyERtZQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Spicy sea &amp;amp; bonzai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DCnLXdhQYTvFy7SvyERtZQ/o.jpg"
      },
      {
        "img_id": "8OiYFgA1kFmDyIlsDLlhXg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Baja &amp;amp; spicy sea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8OiYFgA1kFmDyIlsDLlhXg/o.jpg"
      },
      {
        "img_id": "6zdMfs759WGZCToJ2SC4rw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Chu toro",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6zdMfs759WGZCToJ2SC4rw/o.jpg"
      }
    ],
    "user_id": "kQBm9uDYVv_1cg34uu802g"
  },
  "dVl6AnTKmktRNMDjoIYEBw": {
    "date": "8/25/2017",
    "text": "This place was amazing. Great food and service. I would highly recommend it. I will Def  go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CPJPLcVjBV7GUa5wM9JHyA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CPJPLcVjBV7GUa5wM9JHyA/o.jpg"
      }
    ],
    "user_id": "9O3GzOCF0gE-_dH1sxAFeg"
  },
  "FXL0n4cEbhyIAHlcq536GA": {
    "date": "10/26/2017",
    "text": "One for a great and personal waitress servicing our table she was the reason why we actually stayed to taste the rest of the food we ordered since... Minus a  for  -the sushi chefs who were rude and not accommodating to our requests (taking the skin off of the sashimi salmon as it should be especially with this price $25 for 5 different types of fish -the albacore looked spoiled  -the yellow tail didn't look fresh.  -while looking over at our table whispering words and shanking their hands definitely made us feel as tho we shouldn't have done what we did such as return food that as not suppose to be served! DID I MENTION-they put that fish back into their fish area after being out on our table(how did they know if we didn't touch it?) We actually ate/touched the pieces GROSS!!!! Sorry I am Japanese and just returned from Japan and their service was impeccable along with their food! High expectations I suppose!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WjIXP3LNCQ99RcaxC7XYdA"
  },
  "gr2DZAjpkmxpTfi7-PxXpQ": {
    "date": "8/28/2018",
    "text": "My sister and I ran across this little Gem while my vehicle was in the shop,we had to kill a couple of hours.  We were so happy we came here the atmosphere is calming and the staff were very friendly.  We ordered 3 rolls, Spicy girl,Alaska and Baja    All were very fresh and yummy but our favorite turned out to be the Spicy girl.  We also had Unagi, cucumber salad with a large Sapporo and a glass of wine all for the reasonable $53.00.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rqUtDXhFfelyAZI81D9Lw"
  },
  "Z1KfB2g6PJQeRzOf7_3boQ": {
    "date": "6/13/2017",
    "text": "LELV! we are all the way in the SouthWest side of Vegas.  Hanging out in a very nice and quiet spot Sawa Sushi.  You won't be disappointed here,  the fish is fresh and service is excellent. Pick anything on the menu and enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JtU5J5CzADM-lPLqyshqow",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JtU5J5CzADM-lPLqyshqow/o.jpg"
      },
      {
        "img_id": "25r4175Aa6v8s7zJM9KtFg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Sawa Sushi Two thumbs up!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/25r4175Aa6v8s7zJM9KtFg/o.jpg"
      }
    ],
    "user_id": "1mEKsO6KO_5TPLPiXByk_A"
  },
  "73CxdAyYQNNcueZHw3YG2g": {
    "date": "10/20/2015",
    "text": "I am an extreme sushi snob, so I don't think the food is exceptional here. However they give you a lot for your money here and for that, this place is a good value. I usually come here for lunch and the lunch specials (bento box) are $8.95 or $9.95. it's never crowded there during lunch hours. The food comes out very quickly, which I like as well. They also have good specials such as buy two specialty rolls and get one free. Again, it makes this place a very good value. I don't know if I'm reading into this or not, but there seems to be an extremely high turnover rate among servers here. I don't think I've ever seen the same person twice. My only other minor gripe about this place is the very old-school Japanese music that is playing on repeat in the background. I don't think my parents would even listen to that anymore. It could be a little livelier in there but for the money, it's fine.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "0cDInrhQdgqisr3uLUyWyg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Salmon Teriyaki Bento Box lunch special. $8.95. Lots of food. Good value.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0cDInrhQdgqisr3uLUyWyg/o.jpg"
      }
    ],
    "user_id": "mmUsLiQDb--7BBAxA6wKrA"
  },
  "hDfOYQ5bzB3yzIyZJzP2-A": {
    "date": "11/13/2016",
    "text": "(Late Review) Small place and small menu, but nice atmosphere. They chefs were nice and friendly. I would go back again! Give this place a try!.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "g8pBcxOp7QGS3xIYUKJ4ZA"
  },
  "GdU4ZFhPs1wsYIYFOOgwvA": {
    "date": "3/16/2018",
    "text": "My husband and I order out from here frequently, and we never regret it. We always arrive early to pick up our order and it's truly hypnotizing to watch the chef do his work. We always have the same sweet lady to help us, and it's always the same chef as well, which is nice. This place has great food, great service, and a great environment as well. Would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "afEG5KgEFi5wfi_Jrbza-w"
  },
  "SQppnj3gDJZ9RQF4ticHnw": {
    "date": "2/15/2017",
    "text": "Lots of frozen fish just like other all you can eat places. Then what is their special? Do they make their own sauce? What's their original? Nothing is unique. They use the same stuff as AYCE but charge us more because they are alacarte? Doesn't worth it. Also I felt uncomfortable the chef/ owner?s attitude to the customers. RUDE. It's funny. Oh what was that I saw near the bathroom behind the kitchen? Was that a roach? Eww. Right after that they were on dirty dining. I gave them one star because the service was ok.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NwxLE2dI2bPT2zDwMcbd7Q"
  },
  "dxfmMs9QaVlUcoxZULq-eA": {
    "date": "11/4/2016",
    "text": "The chef/owner of the place is Chef Steven. He's cool. The sushi he makes is a perfect balance of rawness and cooked goodness. I, personally, do love the taste of raw tuna and salmon as long as it doesn't taste too 'raw'  if that makes sense. We loved all of the rolls we ordered (DHA, Maui Maui Roll, and red volcano). I highly recommend any of them. You can taste the great quality of the fish they get. Chef Steven is also very friendly and passionate about his restaurant so just him being there creates a great atmosphere.  Unfortunately, there was one server that kinda killed he whole vibe. I read one review and it seems they've described her as well. She basically just dropped off the menu on our table and left. The older Asian lady was much, much nicer...so she saved it.   Judging overall, we'll most likely come back here. We really liked the restaurant, the food, and the chef. Feed me with some good food and engage me in some good conversation, and you've won me over. That's good enough for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "25ZG4JxOEyNLyg_NfrfJGg"
  },
  "F_EgJd0FWZqDfeUbvMTifA": {
    "date": "8/18/2017",
    "text": "This place is very good,I've liked sushi since 1998,and I just relocated to the Las Vegas area,and this is by far the best sushi place I've eaten at. The chefs and waitresses are very nice,small but clean and very comfortable place,and I will be going there for lunch today!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XNAlKNy7LoTB5O-XsqKQ3Q"
  },
  "QOUpjl46swKyoaoEiOkglA": {
    "date": "10/1/2018",
    "text": "Excellent sushi restaurant. Friendly servers as well as sushi chefs. I like this place over many other sushi places I have tried. To me the rice tastes well prepared as well as good fish, also the ratio of fish to rice is perfect to my tastes. Its also very close to me. 5 star food 5 star staff its what I judge other sushi places by",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhea4Yl35Pic1Udx9H2zZg"
  },
  "A_tCpGvWvDBButs8G_xdMQ": {
    "date": "6/7/2018",
    "text": "Poor service. Only one waitress serving the whole place. Seated ourselves.  Got menus ourselves.  Sat for 10 mins before ordering a drink.  Got part of meal before appetizers.   DO NOT try the lunch special rolls. You'll get better ones at the local supermarket.    My husband had sushi he said the quality was excellent but portion size way too small.  He loved the salmon cakes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Z3-YUPBOqD4u9CihyTL5w",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Z3-YUPBOqD4u9CihyTL5w/o.jpg"
      },
      {
        "img_id": "MEsr34grqKcRoej3EEA0Yw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MEsr34grqKcRoej3EEA0Yw/o.jpg"
      },
      {
        "img_id": "6KRkeVTDkWN8Q6kHk_9JHw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6KRkeVTDkWN8Q6kHk_9JHw/o.jpg"
      }
    ],
    "user_id": "Qadj9HeoT21LFQK5_kSK0A"
  },
  "5Pw8VpYjk30wD79ZV77rSQ": {
    "date": "3/25/2018",
    "text": "Excellent food. Good quality. Great service. Reasonable price. Generous portions. Satisfyingly delicious. Friendly and relaxing atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wxq2r7KEs1AFNBb3v3Z6Hg"
  },
  "UgAs1V9se4VSnLjWzY7aZw": {
    "date": "8/29/2016",
    "text": "Nikko is UH-MAZ-ING! He made our first experience awesome! His \"Special\" (The onion lover/Vampires nightmare) rolls were outstanding!! We were celebrating my friends birthday and had a great time!  We didn't know what to expect because it's located in a strip mall parking lot, but after reading reviews, (which were good) we decided to give it a shot and so glad we did! If you don't try this place, you ARE seriously missing out!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kI_iKLVD2Fvxyh4D3LfLgg",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kI_iKLVD2Fvxyh4D3LfLgg/o.jpg"
      }
    ],
    "user_id": "ggYB0jJmtegJK1avBVXozg"
  },
  "yEnVXhe1hxHNnBb7g19dXQ": {
    "date": "3/4/2018",
    "text": "I'm not sure which was worse, the food or the service. The rolls were small and tasteless. When asked to switch out one type of fish for another (allergies) we were assured no problem and it came back with the fish I was allergic to! Waitress was apathetic at best, and indignant, rude, and completely inattentive at worst. Would never go to again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KSlBBoXH_1hNhZ0pL48K1w"
  },
  "QkDg10GRGvuqqUY8LXQO0w": {
    "date": "12/15/2017",
    "text": "Highly recommended. They tell you how fresh their seafood items are and very friendly staff. Sit at the bar when you dine In. Ask for sushi chef Steven and go for the specials. Ohh and if y'all like uni or Spanish mackerel... one of the freshest in town! Oishi Kata!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bChFbfNBpiBBH0MxwvhIIw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bChFbfNBpiBBH0MxwvhIIw/o.jpg"
      }
    ],
    "user_id": "vggu52keUv8t5IHEYKpVsg"
  },
  "eoglPU3HnScrXjGn_hwCOA": {
    "date": "7/8/2018",
    "text": "Ordered takeout. Wasn't prepped until I showed up to ensure freshness! Tasted great!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-5IU5okmn4T7DmvwTq-Pw"
  },
  "BgnozqjUTTWcjFjPqxQmrw": {
    "date": "5/31/2016",
    "text": "There are a lot of high reviews and 5 stars for this place and I am confused as to why. I in no way consider myself a Sushi snob. I even like sushi from the grocery store in a crunch.   Let me start by saying, this food here is good it just wasn't 5 star good. I have been looking for a new AYCE but haven't found one that I'm in love with so I thought I would give this place a try.   I ordered the volcano that everyone raves about and was given something else entirely. When I mentioned to the chef that I didn't think that this is what I had ordered and I thought that it had shrimp tempura in it (as opposed to the crab/mayo mix), he told me \"oh, that's something else.\" -Well, not according to the pictures on Yelp. I'll never know how good it is because I wasn't given one. I didn't hate what I got. It just wasn't my thing and unfortunately it didn't appear that I had a choice and for $13.95 I was annoyed. Look at the picture that I posted and the picture of every other volcano...  I also ordered yellowtail and scallop nigiri. Both were okay but there was too much rice and the rice seemed chilled. (NOT a good thing) Since I was still hungry, I ordered a Salmon hand roll. Again, nothing to write home about, cold rice. I spent over $40 with tip and didn't even get what I wanted.   The food was average. The atmosphere was average The service was just below average (but came with a warm smile) -and this is the kicker -  The price was above average.  I don't mind paying top dollar for top quality, presentation and atmosphere but it just wasn't there. I regret not trying out a new AYCE place instead, at least if I didn't like it much, I would have gotten to order more Nigiri, soup, salad AND a roll for less $. Overall, I've just had better.  It might be okay for the buy 2 get one free roll deal or bento boxes or various soups, but for the hardcore sushi lover, not so much....",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "O1IRT6nlaHDSAKtsAHt7QQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Ordered Volcano, got this. Was okay, just not my thing. Cost $13.95 Look at the other pix of volcanos. Yes I mentioned it",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O1IRT6nlaHDSAKtsAHt7QQ/o.jpg"
      },
      {
        "img_id": "PMwLDrV52LGK8GYE3ezlAA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Yellowtail and Scallop - with a bit too much rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PMwLDrV52LGK8GYE3ezlAA/o.jpg"
      }
    ],
    "user_id": "CiPLSXLY2T3-bufr8ml5DQ"
  },
  "TD6tKebwzqkNlscAHoFXXQ": {
    "date": "11/2/2018",
    "text": "I wish I could give this place 0 stars. At first everything was going well our server was kind and very attentive we were seated quickly and the speed of the food was good. But when it came to paying we did two separate checks. I paid with my card and my friend went to pay with hers and the guy doing the sushi was telling her that they couldn't accept her the fee to pay for an American Express is too much. And then the guy behind the sushi bar wouldn't let us leave he kept pretending to call someone saying that they would have to charge my friend double because the fee as too expensive. Yet there was no sign anywhere stating that they don't accept American Express. He refused to let us go. And we had ordered dessert and didn't even get to eat it because the man behind he sushi bar making the sushi was so rude and refused to let us go telling her she has to pay double or call someone to come bring her money. He refused to give us his name but we went today around 3pm. Will never go back there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_dvrOCCUS9rZDRU_g-Dqw"
  },
  "emg92hvik0aaj01YtC0hTg": {
    "date": "11/27/2017",
    "text": "The freshest sushi on the west side of town. A hidden gem. I've been to this shopping plaza on a weekly basis and never saw this place tucked in beside in and out. Dynamite roll and the garlic edamame were delicious. I'm going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6ydglMHap6bC3MBuNXHnZw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Dragon roll. So yummy!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6ydglMHap6bC3MBuNXHnZw/o.jpg"
      },
      {
        "img_id": "x0DWKCnMIKwSkkoIjkYkUw",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Dynamite roll - delicious! Salmon on top is so fresh",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x0DWKCnMIKwSkkoIjkYkUw/o.jpg"
      }
    ],
    "user_id": "mqMVozSHhyAUgyr9K5Ritg"
  },
  "ondQq6IzMAwZzxiPcX6F6g": {
    "date": "9/17/2017",
    "text": "Really enjoyed the sushi here.  It was a yelp  find and we did the buy 2 rolls,.get one free.  Great deal for the money, and the rolls were delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uT0LFKI3viZFXc9WqWldSQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uT0LFKI3viZFXc9WqWldSQ/o.jpg"
      }
    ],
    "user_id": "zDfCJdmkVO-O5P9zD9q0Fw"
  },
  "zyvgENLsS5jvjkR1c9gAjw": {
    "date": "8/29/2017",
    "text": "This is my second time ordering Sushi from this restaurant and I feel they deserve a review. I've enjoyed every meal so far. Actually, it surprises me how full you can get on sushi. They are very friendly here and helpful to their customers. I've ordered the usual California Rolls, Spicy Tuna, Volcano Rolls, and Japanese Lasagne Roll. ALL were delicious. The Volcano and Japanese Lasagne Rolls were  amazing. The awesome part is when you order two specialty rolls, you get one free. The California Rolls here are not bad. I liked the Spicy Tuna Rolls, but they kinda bored me. I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f587WkOuLAotgXOVAybylA"
  },
  "ZNUKp07BEquT2HbZ_HzxNQ": {
    "date": "2/1/2018",
    "text": "This was super amazing sushi. Very Japanese, very fresh and the staff was extremely friendly. The most basic thing about good sushi is the rice in the rice was flavorful and perfectly cooked. I asked for a piece of sushi with Shiso leaf And they obliged happily. The squid salad was exceptional, very crunchy and the squared was battery at the same time. I will stop in every time in Vegas to sample this treasure of a restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpIvaBh__grjXYAMVpu2Gg"
  },
  "ogqjdu7QQIPtUbDHICYQ2g": {
    "date": "12/1/2018",
    "text": "First time here and the staff is extremely fast and friendly and the food is phenomenal. You definitely get your bang for your buck here. Definitely should check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjw-zTZN0xkmu1eczi9V0Q"
  },
  "ukorfPn4AFQ5nfcF3fL_kA": {
    "date": "1/18/2018",
    "text": "Was shopping and decided to try something new. When we walked in it was a cute little spot and the staff was very friendly. We looked over the menu and order water. When the waitress came, we both ordered bento boxes which were recommended. I don't like miso soup, so I asked for a double serving of the ginger salad, and the waitress said not a problem. I also ordered a Sapporo. The waitress brought out our salad and soup, and there was a creamy white dressing on my salad, I asked what it was and she stated it was a creamy dressing, I explained that I asked for ginger dressing and she ran to the back to fix. After a few minutes wait, she came back with a salad that had what looked like a soy sauce/oil dressing on it. I have to say it was absolutely awful!!! It tasted like salty, oil and dirt. I then motioned the waitress to let her know I still hadn't received my Sapporo, which I now needed to wash down the dirt taste in my mouth.   After about 15 minutes, we were served our bento boxes, which although looked appetizing had no flavor. I stopped eating and so did my friend. Within 10 minutes, both of our stomachs were turning, and we immediately left the restaurant. As of this morning, we were both up with horrible stomach pain all night, and I'm pretty sure we both have food poisoning.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZqmyxWoq0B7xqg6dlbbtg"
  },
  "sHI6T-SEtdAjuZq0Q_q-BA": {
    "date": "10/30/2018",
    "text": "My boyfriend and I have been going to Sawa Sushi since they opened a couple years ago.  They have great fish at a great price and a wonderful staff.  The service is always good, even when they are very busy.  We love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TdBtBfHLsJAWwuJ2rvBGIw"
  },
  "Tx_rRqyu13MiHg_aDCAplQ": {
    "date": "4/3/2018",
    "text": "First time in was with my wife. We were in the mood for sushi so we stopped by Sawa and we can't stop eating here..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Lez_yWPylyZh7tBd0xbuA"
  },
  "WB3tntTEe5WZB0rzfn-RdA": {
    "date": "10/23/2018",
    "text": "I wish I could give 0 stars. The service was so horrible. We actually got up and left because after 20 minutes no body acknowledged us. Wouldn't go back. Not to mention after complaining to management I was then yelled at and called a liar instead having my concerns met. Very disgusting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "slbU5EX1utoz6oTKg6EwQw"
  },
  "MqMofYjuNpXVNr8DUoOk6w": {
    "date": "2/26/2016",
    "text": "My boyfriend and I wanted for sushi for lunch and Sawa was close by his house. So we decided to give it a try. It was a good choice because they have buy 2 get the 3 roll for free! We really loved the Volcano Roll. That was one of our favorites. I'd definitely recommend it if you like spicy! The service was amazing because our server kept checking in with us to ensure we were satisfied with our sushi rolls.   I'd definitely come back again! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qTzFYKnEs7TIqLWEnhhvqQ",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. The Volcano Roll and Ichiban Roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qTzFYKnEs7TIqLWEnhhvqQ/o.jpg"
      }
    ],
    "user_id": "V9g-w9qcCJYEOE7MjDpUdQ"
  },
  "WJJ5k6V-CjFEzWhiKdFq3A": {
    "date": "10/15/2018",
    "text": "OMG THE BEST SUSHI IN VEGAS! This place is open 7 days a week and the owner is an excellent sushi chef! All of his rolls are delicious a few of my favs are the garlic albacore roll, the king cobra and his special the tai red snapper and the salmon belly! Everything is so fresh and no it's not all you can eat because it's quality over quantity you will love it! I come at least once a week and I even have a vip seat because I'm just that important",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1Qoaq2LY2R97Z6bQjYNOg"
  },
  "ztFIFRyCPGmpyCdc4bbHNA": {
    "date": "8/2/2015",
    "text": "Sawa is a small, clean, and inviting sushi restaurant. The staff is friendly and attentive and the sushi chef is knowledgeable and very talented. The sashimi is delicate and pure tasting. Very fresh and an excellent variety. I highly recommend this little gem to anyone that likes True Japanese style sushi.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cw5C2_RC7yk1o7ix5D4WMA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. House specialty fish, Japanese style. Beautiful and tasty!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cw5C2_RC7yk1o7ix5D4WMA/o.jpg"
      }
    ],
    "user_id": "SBZfkBEWKv66Pyjc4uGmFA"
  },
  "9kV-85GM8IyyJ94m3y3O1Q": {
    "date": "4/25/2015",
    "text": "Fantastic sushi! My new local favorite! Great service, modern traditional decor, comfortable seating! The staff remember me each time I go in. I highly recommend the rainbow roll for standard traditional favorites  and aloha roll for nice jalapeno zing! There are other varieties as well. Whenever I hit a new sushi place my test is the nigiri. Perfect cuts of fresh fish every time! They are consistent, but willing to create as well! Try this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAHIw75Ko2t583i2Qex7cw"
  },
  "sf3aJfBuOmV55675WLa4Cw": {
    "date": "1/8/2017",
    "text": "I ordered the 7 piece sushi combo, two of the pieces are not what I would expect, one was tofu and one was the fake crab fish you see used in place of crab. At 18.00, this was a disappointment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m3AqU6kLMDai5M2HBCcX4Q"
  },
  "xEWJIqDmQIUOU7ut-ICbgw": {
    "date": "10/11/2015",
    "text": "We were greeted upon entering the doors with a friendly traditional shout out! Our food came out really fast, the service was exceptional, prices are very reasonable, and the food was delicious and fresh! Definitely recommend this place! There was a grand opening special where you get one special roll free when you order two special rolls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZv_MNna1UFvVJGL1fracA"
  },
  "meXygroA7X0pX4LUH9cAww": {
    "date": "5/13/2015",
    "text": "I've been here twice and they haven't let me down! The chef and hostess are very friendly and welcoming. They remembered me from about a month ago which is always a plus in my book. I came for lunch and got the Sushi B combo. It was the perfect amount of food and was very affordable. The quality of fish meets my standards!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ESblLBPUGU5nr7S1hN-91Q"
  },
  "gPmm1oJGEV4RVmymYZsEEQ": {
    "date": "6/17/2015",
    "text": "My wife and I tried it for the first time today, and we were DELIGHTED! The food, the prices, the service, EVERYTHING was spot-on perfect. VERY impressed. I actually liked it better than \"All You Can Eat\", and we left satisfied, with a very small tab, even after Sapporo beer and sake for us both. I'd give them a sixth star if I could, because every member of the staff was so friendly! When we told the server we liked something, she went right over to tell the chef, and he came over to our table and thanked us! This is now our new sushi place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "crL0l0Jq2s9E3AudnsUzvw"
  },
  "Ez3ctvlTjmcJ5gjotCVPYA": {
    "date": "11/14/2015",
    "text": "Sooooo good! I go on my breaks every once in a while and I love this place! They always greet you when you first come in! The sushi is probably the best I've had in Vegas. And I love their buy two get one free deal!!! Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGP8W1rCyn3e5etCuaEmUA"
  },
  "jgwmasyyIaXtKw8pO7jZrw": {
    "date": "3/31/2015",
    "text": "I thought the food was top notch. I understand opening a new restaurant is tough so maybe more training for the servers would go a long way. Overall the sushi was actually high quality standards which that is what I'm reviewing because when it comes to sushi that's what is important.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ni-OwsMtwmeOSib8n7TszA"
  },
  "j2PaFD_1TqVddG8WDvPDGQ": {
    "date": "11/6/2015",
    "text": "Quiet and Quaint. I like the vibe. There are so many rolls available as well as a nice Noodle selection. The Toro (Fatty Tuna) Sashimi was awesome. Great flavor and fresh. Also can't beat the: Buy 2 Specialty rolls, get 1 free.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hektn4nFrv8BJ76DDNP26Q"
  },
  "H4HpC6PNHJUO1PZIpmkLPQ": {
    "date": "4/11/2015",
    "text": "Would never go back. Terrible quality food. Bad service. Ignored allergy requests. Rolls put together sloppily.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "opbIGwiOlaVdQSfIuXto-Q"
  },
  "flPixKE8UD7gKf3cnRudaQ": {
    "date": "9/6/2015",
    "text": "Received excellent customer service , they have a great special for a free sake with the purchase of a large Sapporo which was awesome since I wanted a good beer anyway , wife and I ordered the Sawa boat it was awesome , presented very well and was delicious we chose the rainbow roll and the oshi roll we were very happy and will come back again ! Thanks for making us full .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1kF56xr0A_eF7G1bIPyCg"
  },
  "GU-QmROM54ef8ltYrg8zPg": {
    "date": "10/16/2015",
    "text": "Visiting Vegas with my son and he loves sushi, tried the dragon roll, rainbow, also the crab appetizer was amazing. Fresh and great deal located across from Target, small family owned business stop by if you like sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "83OB3l19h9paQldoOtbmuQ"
  },
  "cL5UlnGwCjeWv27IAitIVg": {
    "date": "10/9/2016",
    "text": "Buy 2 rolls get one free!!! There's no all you can eat but the service is great. Nikko and Aaron took real good care of me at the bar. They gave me good recommendations and they really know their stuff. If you're looking for an intimate setting or a good time this is a great spot to check out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9flyij-hbelqyqLl8e3cw"
  },
  "n07sfBQhOZjooXnh7ThdyQ": {
    "date": "2/14/2016",
    "text": "The food is delicious, they have a decent amount of items in their menu, and have good prices and a buy 2 get 1 free deal on their sushi rolls. The inside of the building is full of Japanese decorations, the employees are very friendly and all say hi to each and every customer that walks in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxMb9hzrEV3uSgh7h3hzgg"
  },
  "5RaTWbn6b4377IMGaMdtBg": {
    "date": "11/29/2015",
    "text": "Great little sushi bar. Affordable and quaint. Service was exceptional and food tasted great. Their rolls are a decent size and they offer quite a variety. Can't beat the buy 2 get 1 free special. Bento boxes also come with a lot of food at a decent price. Overall, our experience was great and we'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "deqTVsvVTPq1xEabWC5kmA",
        "caption": "Photo of Sawa Sushi - Las Vegas, NV, United States. Shrimp tempura roll. Delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/deqTVsvVTPq1xEabWC5kmA/o.jpg"
      }
    ],
    "user_id": "OSynCvw8UgyL_h63R5hR7w"
  },
  "pISPLZb4cCi11OAy0sG2JQ": {
    "date": "10/5/2015",
    "text": "The food was good, Bento Box portions were very generous.  The sushi was good and came out quickly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJc664pNSG9e4KRpLhwYyA"
  },
  "CM1XVE_7iM8QDiyzyVW8uQ": {
    "date": "4/30/2015",
    "text": "Great place! The food was very good and the staff were extremely friendly. I'll come again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "o6MESxOVwEfL3QauN0d08w"
  },
  "JrHKWorDDnrWbHjLV9Fo0w": {
    "date": "6/18/2015",
    "text": "Love this place! The sushi chefs are super friendly and make incredible, fresh rolls. Was really happy to find such a great sushi place close to home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q86DXnuJfVBtaf4z_JMdPA"
  },
  "fwFNIaVfzFohjmQhjvKy0w": {
    "date": "5/31/2015",
    "text": "Food was great!  We will be here again!  We had the salmon poke and the Sakura sushi convo.  Tasty and fresh!  The ginger was very fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IX8mam81dgMmRS9TZWRLyQ"
  },
  "_yAurFoGcd_3iGZXwitDiQ": {
    "date": "11/3/2015",
    "text": "Decent choice for sushi for the southwest area.  The buy two rolls, get one free is a good deal. And in my opinion, helps balance out the small-ish portions.  The nigri portions were also a bit small, but made up for by its freshness and buttery texture.  Service was prompt, attentive, without being intrusive.   Place seemed to attract some regulars, which is always a positive sign.   Just wish their mug for their hot tea came with a handle. When the tea is piping hot, the handle-less design of the mug made it difficult to drink the tea without scalding your hand/fingers. Oh well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XYSMRBNxdOOvJCkWyCZUfw"
  }
}