{
  "8SRAxuUhJCxscofAmGkH6g": {
    "date": "1/21/2017",
    "text": "Great local place for pizza that isn't a big chain. Chicken wings are average but the pizza definitely hits the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2l3L1-b8je4zWDlETvuwQ"
  },
  "ipffc4geNU0EUtgRsOZJrg": {
    "date": "8/29/2016",
    "text": "Pizza tastes amazing and service was just as good. Pizza was so good that my mouth desired the crust even tho I'm on a low carb diet. I sacrificed my one pack for this pie. Delivery man was on time and super friendly. Life is pizzalicious. My go to in Vegas. Pls go and support our amazing local small businesses.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QmLarKR0UJ-42g86OLEXHw"
  },
  "xxbWHGU_-dcOhjQUOWoOEg": {
    "date": "1/7/2015",
    "text": "Took off a star for delivery time. Ordered online which was super quick & easy. Estimated delivery time was 45min. I called at 60min when order still hadn't showed up & I was huuungry-they told me the food should be there any min bc delivery guy already left. It wasn't until another 15min til my order came.   Other than that, food was great! Wings were flavorful, cheese pizza was awesome :)   Will be ordering again when craving Pizza!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DcP7H1BRhPbRE30eic26Vw"
  },
  "XLI1HIDAgMy_WfcFABokXw": {
    "date": "10/20/2016",
    "text": "Great new York style pizza. Nothing fancy. Small order of bbq wings and a 16\"pizza. Half cheese half pepperoni & mushroom.  Classics done right, and they deliver. Nice to find another good option near me. Fries that came with the wings were ok , but that was just a bonus, and besides fries don't really travel well. But you can tell they were good quality fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ig4SpbxDIZwkQR2IPxxnLw"
  },
  "VYpe0H8LXi6lAYA5wy7nmw": {
    "date": "11/1/2012",
    "text": "Okay so I am from the East coast and lived in NY. This makes me so particular about my pizza.  Most cases I don't eat pizza in Vegas. When I stumbled upon this place I decided to take a risk. Boy I am glad I did. It is truly NY style pizza.  The cheese is fresh and you enjoy it by the slice. Most other places a slice of pizza taste like Pizza Hut. The cheese pulls with each bite.  Ummm Umm.  I have had other items from this place including wings, fingers, fries, and salads.  I have not been disappointed. The chicken tenders are huge. You can only eat one or two.  I love this place and it is the only pizza joint for me. I have gotten my friends hooked on this place too.  I try to explain there is a difference in East and West coast food especially Chinese, Mexican, and Pizza. I have converted them...lol  I would eat here everyday if I could but I had to cut back on my fast food till I get myself in shape but best believe when I want to cheat a little and want pizza this in the only place for me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ddE5jwtiu5_DpfktXo43ug",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Chicken Tenders",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ddE5jwtiu5_DpfktXo43ug/o.jpg"
      },
      {
        "img_id": "1wZDiPxwZitmt-B45xhylw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Cheese Pizza delivered in 30-45 mins....yummy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1wZDiPxwZitmt-B45xhylw/o.jpg"
      }
    ],
    "user_id": "-d-7l0r-kXhYf9MZaqo4cA"
  },
  "POwMc0IKfgDYbdMRc1uxgA": {
    "date": "7/8/2016",
    "text": "First time customer tonight,  ordered a large pie it was large and well worth the value,  it was good to finally find a decent local pizza place that isn't a chain or gourmet place. Pricing was good too. They have a great menu selection and the place seemed to be busy which is a good sign too.  I'll repeat and looking forward to trying some of their pasta dishes.  Originally being from the east coast these places were on every street corner but out here they're far and few.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "grnJwZM1tCkPe8EVTMlmsQ"
  },
  "bxTytZrz6MgVunDt-vawLQ": {
    "date": "7/25/2016",
    "text": "I just had their meat lasagna delivered by Postmates and it was excellent. It tasted fresh and wasn't swimming in cheese and sauce. It arrived hot. One portion could feed me for 2 days. The cheese they used inside was so good I could have drank it in a bottle. Absolutely delicious. It wasn't overly seasonsed and probably the 2nd best lasagna I've in the last 20 years I've lived here. It came with a salad and some bread. I was just so happy to get some take out with flavor. It really tasted like someone put some love in their food for once. I have had their pizza and it is equally as good. A little greasy but hey it's pizza what do you expect? Thank you!! I'll definitely order from here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ShxOMknbYAR3hSmMJ_jaLA"
  },
  "vEsJhy73CGlkytIYCprf-g": {
    "date": "1/15/2017",
    "text": "Food was excellent and very large portions at reasonable prices. I had spaghetti with meat sauce and my friend had eggplant Parmesan. Came with a salad, bread and drink for about $13 each. They bring your meal in a take-out tin because the portions are so large. Had leftover spaghetti for lunch the next day. Friendly service. I would highly recommend this establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-NFq3g87YZlJPtzqNuN1A"
  },
  "FtrMzQdipCAhoi_PtpPnjw": {
    "date": "6/8/2013",
    "text": "We ordered the fried ravioli and Sicilian style pizza, both were pretty good! More of an herb sauce, not too sweet.  The square Sicilian dough wasn't as fluffy as I wanted, but overall was a good pizza, very fresh!  Owner is from Long Island and definitely is east coast style pizza  This place is tucked behind another building in the plaza, but I'd say worth the find",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W_tjMUxrc_-FWi04XlDQmg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Sicilian style pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W_tjMUxrc_-FWi04XlDQmg/o.jpg"
      }
    ],
    "user_id": "EMo6jQHr_VyMfwg_9BQosw"
  },
  "XCqEAf12F47DlEOsy29V8w": {
    "date": "6/4/2016",
    "text": "This place is a hit or miss, sometimes the pizza is on point and sometimes it comes cold, greasy, not sliced, and toppings falling off. They don't bring parm or peppers and always forget when you specifically ask for them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1LAWL4Te4S8VaoXxoIKj0w"
  },
  "NfInXJLnQs3AG3n8stgo4w": {
    "date": "4/20/2016",
    "text": "Originally from Astoria, Queens, I grew up with daily slices from the pizza place right downstairs from my mother's apartment. I consider myself a pizza snob. That said, this hole-in-the wall is a gem! The dough is crispy and chewy, and the reheated slices taste pretty damn close to the ones you get in NY. Whenever I order pies, I personally prefer them \"well done.\" It guarantees the crispness. Try it well done if you haven't yet. If you're nostalgic for authentic NY pizza, it doesn't get much closer than this. Bravo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NRK6uJKr3jnOBgImw9oa6g"
  },
  "N8bOs7hsAjf9g73eCVc3VA": {
    "date": "4/20/2016",
    "text": "Great East Coast Pizza not NY \"STYLE\" But True NY Pizza taste & texture. A True hidden gem for all of Las Vegas glad I live  on this side of town. Subs & Cannolis are also good stuff. Wings were surprisingly really good as well. Haven't tried any pasta plates but I rarely order pasta dishes from the pizza joint even when I lived back east. Final verdict Great Pizza Place if you live or happen to be in SW part of the valley skip the franchise joints & go with Familia Pizzeria!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cn3hPBTBmghyeYMLoBQgAA"
  },
  "P8z9tGROG9bZCF-jJWgOZQ": {
    "date": "8/18/2016",
    "text": "Best pizza I have had in Vegas, by far!!!  Thank you for a great experience - we'll definitely be returning soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zoihk6ZSy0tgf6_GHirttA"
  },
  "zkvfVZZIJgfKPBS8xPfeDg": {
    "date": "6/6/2015",
    "text": "I wouldn't eat pizza in Vegas because nothing compared to the little downtown pizzeria that I grew up with in NY.  Finally, one day I caved and looked up Familia. I've been passing by it daily for a few years and figured I'd give it a shot. I was sold with a Sicilian pie especially since my husband had never had one before.  Wow, it was a little taste of home! Next visit was a cheese pie and some ravioli for the kids. Hands down best sauce. Love it!  As for the pizza, finally, a crisp bottom the cracks when you fold it! That is how a slice should be!   Familia is a staple in our home now!  We typically get the margarita pie because it really showcases the sauce. Even better, my daughter will always ask to go to the 'pizza shop' for a slice over any fast food joint!  Kid requested earns Familia five stars for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uJLNBBkHDsoKnSUQev5uQ"
  },
  "XabuDNBSnkD4PWm5QZxF0g": {
    "date": "2/2/2016",
    "text": "My family has decided this is the best pizza in town; we keep trying others and nothing compares! My daughters school even gets their pizza for \"pizza Friday\" every week! The sauce has great flavor, they don't use too much cheese and their toppings are perfectly placed and portioned. I love their sausage pizza, but it's not chunks it's like sliced sausage. My daughter loves the chicken strips. They also have something called a PIZGHETTI!! You NEED this in your life...sure sure it's tons of carbs but you only live once! It's basically a spaghetti calzone...a piece of heaven :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-QZUJr0kLsSc5PfiQYh_dQ"
  },
  "sq-DAMaVETPrejBWa1pVCQ": {
    "date": "9/3/2016",
    "text": "This is one of my favorite pizza places in town I can get a slice if I have lunch or order a full pizza of meatball and mushroom with a dinner salad and 30 chicken wings.  Love the wings too.  I've had a birthday party there with 20 people, wasn't really designed for that since the seating can be limited but most people get delivery or take out I've noticed and is really convenient to Rhodes Ranch residents.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pdZXxfn3u-qBz0bPeEtD2A",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. New York style pizza toppings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pdZXxfn3u-qBz0bPeEtD2A/o.jpg"
      }
    ],
    "user_id": "b3tK3CkLOfrWpSuvn9Yo1g"
  },
  "Pzh5-qqCKR-19UmiXyCwFg": {
    "date": "11/10/2016",
    "text": "Really bad pizza, the BBQ wings were somehow worse than I could have made at home. I will never be returning, staff wasn't the most friendly either. I ordered a personal 4 slice pizza and 6 wings with fries. After the first bite of fries you could tell these weren't seasoned. They gave a half full 4oz cup of ranch for the entire $20 order. Threw away at least 3/4 of the food and warmed up some frozen breakfast croissants from my freezer. Sick",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_9aemtm4bZmgj-43hDrECQ"
  },
  "mNo6auoefSH7mHXIrXbxSw": {
    "date": "8/31/2016",
    "text": "I love their pizza! And the wings, OMG! I often order delivery service here when I want a cheesy flavorful delicious NY style pizza and crispy flavorful buffalo wings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcWeMHDPVSr-IFfDm5F_rQ"
  },
  "CSbYv6nuLPVcxJBnksXP9Q": {
    "date": "10/13/2015",
    "text": "My favorite pizza place on this side of town. Broadway is my favorite in the city but this is a good compromise. Ordering online is super fast and easy so make sure to check that out instead of calling because when they are busy (which is often) you may wait on hold (which is a good sign if you ask me). Pizza and chicken is all good!!  Update: still good but the pizza seemed to be lacking this last time we ordered. I will try again and see if it was a fluke.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ido0e_IpsyYSUgJyDPMq9A"
  },
  "s2tPdC-NZLK3-inDshOxeQ": {
    "date": "1/27/2014",
    "text": "This review is for DELIVERY only:  This could get 5 stars. This is a solid 4 for me. What would make this better? 2 things. 1. I dont like canned sliced mushrooms. I dont think they go on anything, let alone a pretty good pizza. Can the canned mushrooms please! 2. Better sauce. It's not bad, and I'd rather have it taste the way it does, than a gross sauce. It's just....bland. I prefer a sweeter sauce.  The dough was very good. Crusty and doughy and chewy at the same time. All in a good way. It isnt a thick cut crust, but not think either. Just right in between, and I loved it!  I called my order in, and a few things worth noting. I was able to pay cash and not give any personal credit card info, they were able to break a $100 bill, and the best part......they delivered 10 minutes EARLY! How cool is that.  They have a $12 minimum delivery per their website.  I will try them again, and maybe try something else.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "8OeTLey-p-WaL9ErNEci1Q"
  },
  "XOzOkiKlB5EafKNNeikVtg": {
    "date": "1/7/2014",
    "text": "I came in and ordered a lunch special chicken fingers.  I was looking forward to eating it and got to work and had only fingers.  I looked at the special and stated that I wanted the special, but oh well...I was a long time customer since I work down the road but I hear there are other places in the area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tR7HS5fVg__8QdwYP-Zlg"
  },
  "SNDN4eHv1qxdafWwKWVn6g": {
    "date": "10/10/2013",
    "text": "I don't usually leave reviews but this place was so awful I felt inclined to leave a review to save other patrons from making the mistake of ordering pizza from this place. Thus was the worst pizza I have ever tasted. The crust was like hard like cardboard without any flavor and there was hardly any sauce or toppings. Whatever you do, do not order a pizza with spinach on it. They used frozen spinach that tasted like straw so my pizza was inedible. I asked for a refund but they only offered me a store credit that I will never use because the pizza was so horrible",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymC0PFMYFXXeOjZgd5QH9w"
  },
  "pD7ldYmOcFtyh7p4Cm_k1Q": {
    "date": "3/28/2011",
    "text": "This place rocks! Food is beyond amazing!! Ny'ers prove once again(:-)) how to do italian right!  pizza IS OUTRAGEOUS, but try the sandwiches and stromboli too! Oh, and the zeppoles? yummmmmmmm! Great food for great prices!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-cY4QxN1qkwF5-_Lmi21A"
  },
  "_L2EtRUdZV7Hgn5dAylBMQ": {
    "date": "4/26/2011",
    "text": "I eat hear all the time and i really love the food, it could not be any better. i live within a mile of the store but i will still have it delivered if i am working. they used to have a super nice guy Jordan working for them that would deliver. i always tip 5 bucks for like a 20 dollar order, but the last time was this new guy with a pony tale. i have to say what a d bag this guy was. i told him thanks and to have a good one, and he just like grunted at me. what a joke i gave him a 30% tip and i don't even get a your welcome or have a good one. i will defiantly eat there again, but i wont have it delivered, i just hope he doesn't give the same kind of service in store.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2qB1ME-Kzj_VI7oKYEdfg"
  },
  "G2-bbpHN-kZrEbSIFn1kgA": {
    "date": "3/2/2010",
    "text": "Found this place after I moved to the Southwest a few years ago when it was the only thing in the area. Years later, even after new owners and a name change, it's still the only pizza I've needed. Good South Jersey style red pies and they have a very good white with ricotta as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "as34MUkSmX14WqHtOo0DLg"
  },
  "wcGTgkGgFh8x-ur0prvjuA": {
    "date": "1/30/2010",
    "text": "Another great place for NY style pizza.  This place is kind of hard to see from the road - it's located behind the restaurant/bar/casino at the very northern end of the shopping center.  Friendly staff and they delivered quickly when I lived in the area.  If you're in the southwest area of town, give this place a shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "XOSjRes1mDv5H2e3mWKCOw"
  },
  "tNAWeUPO7m8jTcQxYk6gIw": {
    "date": "1/17/2010",
    "text": "Best delivery pizza on the west side in my opinion. The crust is delicious. The cheese is plentiful. The sauce is very tasty. As an added treat, the cannoli was perfect. I'm a fan.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "lJAp6PY4TTak7YyY-TplPA"
  },
  "p8vJy1N7Vqw1miCWzQqKZQ": {
    "date": "12/12/2010",
    "text": "New to Las Vegas, gave Familia Pizzeria a try, since it was highly reviewed and nearby. The food menu on the web site was easy to read =]  + Delivery seemed quicker than expected Great taste Quality of cheese and chicken (Buffalo chicken with ranch)  - cheese and toppings seemed loose from pizza crust (easily slid off after a few bites)  Looking forward to trying out the other pizzas! Very affordable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byX-BZzD1ZB3fQMQNpGeOQ"
  },
  "HDrDBVMN9RhQITaPij1SSg": {
    "date": "2/13/2011",
    "text": "I love NY style pizza and when i saw all the positive reviews for familia pizzeria from native New Yorkers, I had to give this place a try.   I used to think Rocco's Italian Deli was the best place but Familia gives Rocco's a run for their money.  It's also a lot closer to home so I'll definately be visiting Familia more often.  We ordered the Pepperoni and Familia Special.  Both pizzas were awesome.  Lots of cheese but not too much.  Sauce was right on.  But the best part was the crust...thin crust but not too doughy.    We also ordered the chicken wings..bbq style.  It was ok, I've had better at places like Yard House.  But, the Cheesecake was out of this world.  Not too dense, but rich and creamy with a graham cracker crust.   They offer a wide menu and I wish they would have more sandwiches like Rocco's does.  But all in all, a great pizza joint.  Delivery time was exactly as they said and not a minute over.  I will definately be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XYy7o-sRCJ9_XqzACDk7iw"
  },
  "F_J_E95djx64iV4I-Q5lNQ": {
    "date": "12/15/2009",
    "text": "Good NY style pizza plus they deliver. Is it authentic NY style pizza? I have no idea. The last time I ate a slice of pizza in NY was about 20 years ago. But compared to similarly styled pizza in Vegas and other cities, it's top-notch. Huge slices, lots and lots of toppings, and the crust is a little crispy on the outside and chewy on the inside. I usually just get pepperoni (it's hard to screw that up) but last time I tried their veggie pizza and it was delicious (although it was weird to have broccoli on it). Their garlic bread is pretty good and the meatball sub was decent, although it could have used more sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2C0GPKvzWWnP57Os9eQ0w"
  },
  "M_O3_Mg51JxxoMK5xcwi5Q": {
    "date": "3/3/2013",
    "text": "Was craving NY style pizza so I thought I'd try Familia. Although the flavors were good and the delivery was on time, the pizza was greasy and soggy when it arrived and the cheese and toppings had slid all over the pizza. The zucchini was crisp with the right amount of breading, but I wish they served it with ranch instead of marinara. Overall, I'd say it was \"ok\" and I might be willing to try it again, but I think there are better options available.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHsvSzAopCgnWJ7Zmy_sLg"
  },
  "iER37P0rElB1g0HovpVBbQ": {
    "date": "5/5/2010",
    "text": "I have lived in Vegas all my life. This is the best pizza I had in Vegas. My husband is from New York and he thinks so too. I'm now 8 months pregnant and we go at least once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J3HW7s9lNHMW5ENjkxUvfQ"
  },
  "bpoV5f-Ybnt5fWN_ZcbrMA": {
    "date": "1/17/2010",
    "text": "Though the pizza maker wasn't the friendliest of cats, the pizza was ultimately outstanding. I was looking for something authentic and I found it here. Huge, thin slices of premium crust, mixed with the right ratio of cheese to sauce.  I decided on a 16 inch cheese pizza and wasn't disappointed..... I could have eaten the whole thing by myself but decided to share. I will try other things on the menu but will continue to prefer just the slice!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMOoq0Nh5PhJHNsnHzZ5Og"
  },
  "tctD_H-KaKv2zv23ByRQ3w": {
    "date": "11/19/2009",
    "text": "I happen to pass by this place everyday so i decided to pull in and try it. Not sure what NY pizza should be like since i never been there but i love the crust. I always get a pepperoni and mushrooms and it is so hard to stop eating it. They dont open up till 1100 so breakfest is not an option. The service is also friendly and helpful. It is something i could eat everyday but since i dont want to get fat I try to stop by once in awhile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l4-hkTpRJHdpyQ4FNC3leA"
  },
  "zgw6S8nJJu11xMEJ0bNVlw": {
    "date": "3/14/2011",
    "text": "Growing up in Long Islany, NY, this by far the best NY Pizza I've had in Las Vegas, so far. The Pizza has the NY oil dripping from a slice and the fried zucchini's are off the hook. I'll definitely will be back to try the calzones!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92xbY5gwCbi-vO4VxDHQ7Q"
  },
  "jQIvBD-o4wux2r64D53h9Q": {
    "date": "4/21/2010",
    "text": "Familia is in a strip mall on Durango and delivers to the surrounding area super fast.  Good service & they always get your order right.  Love their garlic knots, greek salad, and pizzas (cheese w/ ricotta & basil is our standby).  They also have calzones and stromboli.  Good cannolis- thick cream with cinnamon and chocolate chips, filled to order in their homemade shells.  Spumoni ice cream for sale by the tub.  Way better than Marcos or some of the other chains in the vicinity!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "dEgO4_n8thLMbG1dKfFMHg"
  },
  "0Sq7czRipkKz62s9w-ZMRQ": {
    "date": "5/21/2016",
    "text": "I came here late one night about 1/2 hr before they closed. I just wanted to try the cheese pizza. I got the special and I ordered some fries to go as well.   The pizza was good enough for NY style pizza. For my taste buds the cheese flavor was more of an American cheese flavor rather than of a mozzarella flavor. Maybe they use both cheeses, idk. Overall, $5 for two slices and a soda was not a bad deal. The fries were not what I expected. They were airy and a little too fried. I won't be getting fries here next time.   The lady at the counter was friendly and the service was good. I'd go back if I need to have a quick late slice, but mostly because they're close to my house.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "vSezVoyk6SabkWrlGBrIcw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Pizza special with a side of fries to go.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vSezVoyk6SabkWrlGBrIcw/o.jpg"
      },
      {
        "img_id": "EG2dJriRseX7Ccx4_Clzdg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. I came about 1/2 hr before closing time. This is the counter where a nice lady took my order.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EG2dJriRseX7Ccx4_Clzdg/o.jpg"
      }
    ],
    "user_id": "SXqNU1SWcjI-thbZkoxrsg"
  },
  "OoTczctKSsTDk-18p5UoYA": {
    "date": "11/1/2018",
    "text": "Really good pizza with lots of options.  A bit pricier than other places, but definitely worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0XIRqQjgIJc5slgxitUiQ"
  },
  "Qy-5ik41BzMRA-D47NcbDw": {
    "date": "2/2/2017",
    "text": "I was so hungry when I received my order that I forgot to take a picture! That seems to be my problem, I need to work on that! Anyway, I ordered for delivery during a weeknight and they showed up quickly. I ordered 2 regular gyros and a Philly cheesesteak for under $20. The gyros were giant! They are not shiesty at all with the meat and they really pile it on! It was also served on their freshly made pita bread. The cheesesteak was really good as well and it came with plenty of meat. It really hit the spot and you can't beat the price! My only gripe is about they lettuce the put in the gyro...it was iceberg (which is okay), they didn't put so much of it, and it was wilted. I don't think it had tomato either. Other than that, it was good! I will be ordering from here again :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hqTVG-jmbYrw1pFZJa7y7g"
  },
  "13hGCm7ZlEJo31pRhnpE1A": {
    "date": "5/16/2017",
    "text": "This is one of my favorite pizza places in town. They have a large pizza and boneless wing special that is really good. Sometimes delivery takes a while, but they let you know beforehand. If you're craving appetizing pizza at a good price, give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vSnYdIYsF6SJ7mHS9ESSjQ"
  },
  "_hZ1VZ6r7UWotYS1cDaMYQ": {
    "date": "10/25/2017",
    "text": "Best pizza in town! Always fresh, authentic NY pizza.  We normally do take out, but today we ate in for a change, and what a nice evening we had, great surprise. Owner is super attentive and generous, today made our little daughter's birthday extra special! After dinner came to our table with a delicious treat: Zeppoles!!  Thank you La Famiglia Pizzeria, from your Rhodes Ranch Neighbours!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtHWESNcMC5GJZPvl-ptLw"
  },
  "VWmMsW8gdPnUsS_TbebZZw": {
    "date": "3/14/2018",
    "text": "The most authentic New York style pizza in the LV Valley.  It's all about their hand-tossed crust - perfection!  If you're a NewYorker and lookin for a pie like you used to love as a kid - you've got to have this pizza.  Great prices, fast friendly service.  Convenient access off of Durango.  An extensive menu too, if you want Italian without the fuss.  It's a family favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4Ws6P31NFZpz1alh29ESg"
  },
  "wnkjTbgNDb3w0RWVhQTtsw": {
    "date": "5/27/2017",
    "text": "Not legit. Not really worth the calories either. Places a to go order. Was ready on time. The drive home was torture smelling the delicious aromas. I barely got through the front door before I ripped the packaging open and got to it.   Welp... There were highs and there were lows.   LG. Meat stromboli - Large indeed. Very large. Also very, very greazzzzy. But I'd get it again maybe not the meta one though. Marinara sauce is on point.   Eggplant pizzghetti- cut it open and to my surprise... It was chicken!#@*! The sauce was good. Dough was soggy. My kid liked the chicken. Better review next time on that.   Greek salad - Fabulous. Delicious dressing. Quality feta.   Kids spaghetti with meatball - Picky two year old ate it in a flash so that's a win.   Jalapeno poppers & Garlic Romano fries - both tasted old or from old oil. The poppers were blah. Like they had Kraft American cheese in them. Pass. Fries had potential. Even old tasting they had great flavor. Garlic was fresh!  Ranch dressing - They have that good, good ranch. That keeps you coming back even if the food is lackluster.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sdHcxgztMqhrWOAbznDlHA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Meat stromboli and &amp;#34;not eggplant&amp;#34; pizzghetti",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sdHcxgztMqhrWOAbznDlHA/o.jpg"
      }
    ],
    "user_id": "uMh4aDyruj0Awh85lAVgIg"
  },
  "R2aF6_wn-5bSh1DPHez8xQ": {
    "date": "2/8/2018",
    "text": "Get the spaghetti sandwich thing they got. Its crackin! Pizza is ok but i totally skimped my order more and more where i started getting this item. This is where its at!  Easily the best thing they have dont sleep on it. Everything else... average. But its ok. Pizza is like p***y. Its always good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GaVbk22NpC0zgQro33IjVg"
  },
  "c04QQKdV5-QdfTHa4Ho_Tg": {
    "date": "3/19/2018",
    "text": "I love pizza and have probably gone to every pizza place in town and this one was right under my nose..I can eat here everyday! Best spot ever no lie!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1kVUG0y4ZBoWVMj2JmUtgw"
  },
  "yJZkIQi52S02tLzcdMut8g": {
    "date": "4/18/2017",
    "text": "Was craving some pizza & found this place on yelp. I loved how you can place your order online & they even offer a new customer discount. I ordered a large meat lovers, personal cheese pizza & wings. Everything was freshly made & ready in the estimated pick up time I was quoted when placing my order online. They also deliver but I was already out so opted for pick up. Will definitely order from here again. It's tucked away in the island flavor parking lot in the in the north corner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bf-MBZUzp-arMSKvcp_3AA"
  },
  "pZHfrnUGGwKowMsVen6rQw": {
    "date": "7/11/2018",
    "text": "I've been ordering from Familia for YEARS. It's my family's go to spot, and we order from here about once a week. The garlic knots are always great, and the salads are very fresh. Unfortunately they seem to have recently changed ownership and something has changed with the pizza recipe. We just ordered our usual, and I actually spit out a bite of the pizza and couldn't eat it. The dough is a little thicker, which is fine. But the cheese looks different and tastes VERY different. I *think* it's the Romano cheese... the pizza had a very rancid flavor and tasted the way Romano smells, if that makes sense. I love pizza, and I'll eat just about any. It's not often that I get that turned off by a bite of pizza, but this was not good. The garlic knots also used to be saturated in oil and garlic, which was awesome. Now there is just a very small amount of garlic. No big deal there. I just think overall, if the recipe has changed, I'll probably not order again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kyfVuHpmT_ohZcYdvRTTyQ"
  },
  "lIr0vWqrbmMcllNKbCknqQ": {
    "date": "9/19/2015",
    "text": "Ordered pizza and wings for the first time here for pick up and I love it!   I search for near by good eats on of coarse YELP and found Familia Pizza. Read some reviews and was sold on the price for food. I have return and will continue coming to this new found hidden gem.   The pizza is dreaming amazing the slices are huge and the pepperoni was home made I think or sliced on house at least. The pie is thin and when you pick up each slice you kindda have to fold it because it's a little heavy per slice and had the perfect grease to cheese to dough to everything ratio. The wings were meaty and yummy. So the food is great I haven't tried any of their pasta yet but will because I've been here like 5 times now in one month.   The place is small but you get a real newyorky deli feel and the pizza and wings you get is amazing. I'm in love and I will keep coming back and encourage others to as well. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "tKqh5kxvdWafCRXHJZrsOg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. 30 buffalo wings...great party pack deal!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tKqh5kxvdWafCRXHJZrsOg/o.jpg"
      },
      {
        "img_id": "sydkM8Ec-9hkb91fLxvFDA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Large I mean LARGE pep pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sydkM8Ec-9hkb91fLxvFDA/o.jpg"
      },
      {
        "img_id": "uwEwMBXGkIAXu4AzQZbqLw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Ordering menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uwEwMBXGkIAXu4AzQZbqLw/o.jpg"
      }
    ],
    "user_id": "YLeDSZ1Nh1N0hNsSyQdE3A"
  },
  "I3g1dlqkaI5MBNWPTp9K-w": {
    "date": "2/4/2018",
    "text": "I know La Familia is the bomb that's why I ordered from them on Super Bowl Sunday!    BUT ..... they had cheese pizzas and chicken wings pre cooked, not cool, I expect made to order food, this was not hot when we came to pick up, WOW !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fR9lyE-J127_ePwnbqFZAg"
  },
  "Z-rSqImEJMiMiavEkL_mVg": {
    "date": "2/23/2018",
    "text": "Love this place! Great chicken parm sub. I've had them all over the valley but this one is the best. Staff is really nice too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2b2VaydRoDCkozYuCIgRQ"
  },
  "AY77IuUPzzsRkZzMENj5aA": {
    "date": "7/20/2017",
    "text": "Avoid delivery at all costs. Ordered 2 items. Says it'll be 60 minutes approximately. Really? To drive 3 miles? Okay fine. After 1hr 10min later, I'm told \"oh, it's going out with the next driver, about 10min it should be there\"  So, basically tell your customers approximately 1hr 40min, since that's what it took.  Food arrived cold, big surprise. Thank god I have other pizza options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1LsquG7LwUy37VUx9OxTzw"
  },
  "CjkRwwBkQnVHCRzKIKUFfA": {
    "date": "7/16/2017",
    "text": "My husband and I went cause of the last 4reviews and yes your right..yay were happy cause it's close to our home. We ordered the stuffed shells, cremeni mushroom raviolis loved the sauce..the salad was fresh..the bread was very well made..i loved how they didn't just use the same sauce for both dishes..TIRAMISU was verrrry good there's fine dining restaurants that can't even get close to it..we will be coming back for pizza &wings yay",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TXMOMgqNNzC_2uDKQQWdWw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TXMOMgqNNzC_2uDKQQWdWw/o.jpg"
      }
    ],
    "user_id": "utn_ukPtXc9gqmn8MkBEIg"
  },
  "66R9UgNDJ4eoQ_GAWGq7QA": {
    "date": "8/28/2017",
    "text": "Really fast delivery! Hot food and yummy as usual. Stuffed shells were delicious! Meatballs could use some improvement they were very dry and chewy but we just wanted to try something new. I'll stick with my shields from now on!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "oFyOUOeGTRZhFPF9uTqrTQ"
  },
  "5Xk_AYaMBwNZ0Ox-Fk8wHQ": {
    "date": "8/18/2013",
    "text": "Man, it's been awhile since we've had a GOOD NY style pizza. Dag nab it I wanted it so bad I could taste it. Being that our family is from Rhode Island, I haven't had much food out here that's tastes half way decent because the water in Vegas just blows.   We walked in to find this place almost quiet, one other family in here before us.  This is a small place with maybe 5 tables to sit at.  We waited for the gentlemen behind the counter to finish up making their order.  The boyfriend mentions, \"look at the Familia House Pie, that sounds good\".  We all agreed a large would be decent to try minus the onion and easy on the green peppers.  While the pizza was cooking my mouth was watering just from the smell.  We loved the crust, I mean don't normally eat the crust at all because I usually hate it.  Not this crust, I'm not sure what they do differently but man KEEP IT UP!  The ingredients here are fresh there's no doubt about it. I posted a picture of the left over slice because we just couldn't resist digging into this pizza when it came to the table.  Thank you for making me hold out 2 years to try this place.  I for a minute while I was eating I actually felt like I was back East.  Great work on the atmosphere, service, quality and quantity. We left so full..   The only thing they're missing is seating outside for when it's nice out.  **THEY HAVE A GLUTEN FREE OPTION FOR PIZZA CRUST**",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8KzB0_yZJhLL5alX97zYiw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. This is what&amp;#39;s left of our Familia House Pie without onion and light green pepper.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8KzB0_yZJhLL5alX97zYiw/o.jpg"
      }
    ],
    "user_id": "_ykg4Fp8j_tU83q2tYC2FQ"
  },
  "X9rlPUl6tTFK4XULBTNJxg": {
    "date": "3/28/2017",
    "text": "I have yet to have something I did not like. The food is very good quality. Online ordering makes everything so easy. Their delivery seems to be earlier than ETA, cause I've yet to feel my hunger escalate. The people are very kind and helpful during phone orders also. BE AWARE: the zippoles are very yummy and addicting!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gZRkcQp3SJgVRAC7nlgJw"
  },
  "sM51tUbw604wSmQoLLr2JQ": {
    "date": "11/8/2017",
    "text": "They're pizza is really good and they also make Sicilian pie which is an A plus in my book",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omRhiJFc8qTlexSBBEoXTA"
  },
  "3RyaYj4PagPiq7Srqs5kUQ": {
    "date": "4/11/2011",
    "text": "I ordered Subs here for the first time and I gotta say I was impressed. I normally don't order subs out in Vegas, as they are not usually done anywhere near like a pizza place in Buffalo, NY does theirs, but took a chance on these guys as they do other food proper.  The Subs I ordered where a Philly Cheese Steak, Veal Parm, and Italian Sausage with Peppers and Onions. All 3 were a decent size with meat falling over the edges. The Philly Cheese was AMAZING. My wife never had one before and wanted to finish it herself after a couple bites. (we split all 3 among the family) The veal parm was very tasty and not dry like some can be. And the Italian Sausage had a good mix of red sauce.  All in all they go from four to five stars now that I know how good their subs are.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "x16Fl_5h9aX4tn38kKSGHw"
  },
  "hFrvmrrj2IBr6pdWgOC2Vw": {
    "date": "6/16/2012",
    "text": "Good NY style pizza!  Don't forget the fried ravioli, garlic knots, and Greek salad...all winners in my book!  My only dig on the place is the way they do sausage as a topping.  Instead of chunks of sausage scattered about the pie, the sausage is cut in thin slices lengthwise.  Eh, not my preferred way to go, and it really doesn't look good that way, but it still tastes good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4J4KrUINsgWJuQFQmDJQuw"
  },
  "9CEiuYOsXF_IsRKVz9f3cQ": {
    "date": "3/16/2016",
    "text": "This place is as good as it gets for a neighborhood pizza/pasta shop. Love the pizza, Greek salad, and baked ziti is fantastic!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TjgjuPSXy-mr43okGX49gg"
  },
  "IXkMsUEVzaed_BZ1SuVZGg": {
    "date": "2/1/2016",
    "text": "The pizza here is delicious! Authentic NY style pizza made right here in Vegas! After speaking to other friends who have asked where the pizza we ordered came from I know they will be calling to order from here also! Everyone at our pizza raved over how delicious the pizza was!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7q3NRmxmjE44RQcTpnvbA"
  },
  "r8OtP4rf74FlMlcA-vNEaw": {
    "date": "8/25/2014",
    "text": "Came here to get what I read was great pizza but was very disappointed. We had a Sicilian pizza and it was over cooked, very dry and had little flavor. At 27 dollars for a 48 size we threw most of it out. Was concerning based on the positive views and experiences others have had but this was one for us was horrible,  1 star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHt-DmrbBPBXQs1kGLkz2A"
  },
  "46YJGCHjy96ZA90urlQjmQ": {
    "date": "8/9/2014",
    "text": "I love the pizza and finger special. Very good. The reason this is a 4 instead of a 5 is for the delivery service. Wow terrible. I have order from them many of times over the past few years and it is always a hour to a hour and a half. Since I currently live 5 minutes away I order carry out now. If you are new to the area or have never tried them, give them a try but  just go pick it up yourself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iO_aqTX7V88O_gh4epqSiw"
  },
  "8T1ifgoULZ6C3amNmqQLtA": {
    "date": "12/11/2012",
    "text": "Ordered delivery, pizza came right on time & this pizza spot is no joke. Metro pizza was my favorite but there was a few things I'd change & this spot read my mind. Only thing I wish was that I ordered a larger pizza so I'd have more left overs for later. Good stuff, perfect amount of sauce, perfect amount of cheese and all in all a perfectly prepared pizza, can't wait till next week so I can try the Sicilian style.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6qIzjw9HduuANN362xd9MQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. 16in double pepperoni",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6qIzjw9HduuANN362xd9MQ/o.jpg"
      }
    ],
    "user_id": "6mGF-hiLKy6izzaFisWDkQ"
  },
  "25qI2lrkpWCQH8IBvqf3WQ": {
    "date": "11/5/2013",
    "text": "So although last review I was disappointed by the deal. I thought id update with my rating being based on taste and quality. We ordered a plain Sicilian cheese.....OMG super cheesey and yummy!!! Crust was perfect...sauced just right.  They do not charge was delivery which is nice but then again we live so close by (less than 5 min). You pay a but more than Pizza Hut or Dominos but it's quality and the taste is really good!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzPvEodjvLPe-5NvV0U_cg"
  },
  "8nrrhA8zU16pLOmOIhvKMg": {
    "date": "4/23/2014",
    "text": "Very fresh salads, and excellent pizza. Had a meat stromboli, love the pizza dough! They have a pretty good size Calzone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bCb7qEdUTQwp0dg50LwPA"
  },
  "u4uaX4tWOK1UBSEZi_8JgQ": {
    "date": "3/29/2016",
    "text": "This food is immaculate! For starters the portions are HUGE and the prices are great. And the do free delivery so I have no problem tipping big! I order here at least 3 times a week. I am hooked! And they are fast. My favorite Italian in Vegas. I spent 30 bucks on a pizza because I love the toppings they offer and will quickly order it again. Gyros, salads, lasagna are to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fpgfZYdHU7jJw--jQUUBw"
  },
  "-hcLbH4IyRVbXS19N26ZFg": {
    "date": "12/11/2012",
    "text": "I Ordered delivery from this place & let me tell u it's the worst calzone I ever had its like they just dumped cheese inside the bread and when u slice it looks like crap & they even forgot the marinara sauce its already bad enough that it doesn't have any flavor. Waste of money I tell ya",
    "rating": 2,
    "rated": {
      "funny": 7,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "DVyEHrFu1i5GXxv8edUWRg"
  },
  "__Uscts3157pTyZd2dINGw": {
    "date": "6/22/2014",
    "text": "Only giving three stars to the food. The food is great and fresh! But I'm only reviewing because of the service. We called to order today and was on hold for 10 minutes. Decided to hang up and call back and still wanted to put us back on hold. And when they answer the phone it's with NO happiness or pride. And this kind of service is everytime. My family and I eat/order from here very often and we are contemplating taking our business where people smile and appreciate our business. Food is great like I said no complaints, but the staff needs some customer service help or we will not be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iw6l8cjvrAsvdJ27Kqxgxw"
  },
  "HBueVv-otLNtce03x_mWPw": {
    "date": "5/22/2013",
    "text": "Tried it for the first time this past weekend based on a friend's recommendation. Had a large pizza delivered. Very good quality for a local non-chain pizza, and reasonably priced. I will definitely order again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTo8HUbXmifjIT-hH1JSwA"
  },
  "C_kgVYLwnh7COCGP_CMasg": {
    "date": "10/18/2010",
    "text": "I'm another New Yorker reviewing the pizza here.  I can't tell you how many pizza places I've tried before I happened in here one night. And I am SO glad that I did. I figured I'd leave disappointed - like usual - but holy shit.  This pizza reminds me of the place that I used to go to around the block from my house in New York. It's literally perfect New York pizza. I am SO thankful that I found this place, because I couldn't stomach choking down another slice from another stupid NY pizza knockoff place.  I mean it, no other pizza place in Las Vegas will have my business from now on. If you're from New York and you're really craving a slice, I don't care if you're driving here from Nellis Air Force base. Get your ass over here, splurge on your gas bill, and enjoy a mouth watering slice of authentic New York pizza.",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 8,
      "cool": 9
    },
    "photos": [],
    "user_id": "-k5yFUChotBMGQgHdFZvLQ"
  },
  "J9Zxf-PN6FxDeORBRNZZFA": {
    "date": "1/19/2013",
    "text": "After coming back from New York city on a trip, I've conducted a frantic search in Vegas for a passable replica of that NYC Pizza flavor. Trust me I've tried all the so called \"best\" in town but Familia has that sauce and cheese which make you feel like you're in downtown Manhattan. OK so maybe I'm being a little dramatic, but the pizza is damn close. If you want that NY taste, get a cheese pizza. I always order delivery from here, and service is fast, friendly, and hassle-free. Haven't actually dined in yet, but I'm content enjoying their food from the comfort of my own home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hu-zRvfB81eM-Js5DRGDxg"
  },
  "-fb_yl8gdS9m7NIrnhISgQ": {
    "date": "7/31/2013",
    "text": "First of all, you really have to call your order in. We didn't call it in and walked in on a Saturday night at 6 and waited over 30 minutes for our personal pepperoni pizza and lasagna order to be done. Ridiculous if you ask me! The pizza was a bit tough when you bit into it. and the lasagna was just ok. Not the worst I've had. but I wouldn't go back. and it was soooo hot inside the restaurant. It was cooler outside if you could believe that! They really should invest in some table and chairs so you can also dine outside if you wanted to since there is only a handful of tables inside.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUg-5mA-G0J51tFMgU1b4w"
  },
  "s89dFkMbqx2aC5yAsntgeQ": {
    "date": "2/26/2013",
    "text": "I'm a pizza person. Normally when I'm in Vegas the only pizza I eat is from the frozen section of trader joe's. however, I recently found this hidden little gem. It might be the closest to ny pizza I've had in Vegas, and it's pretty darn good. Round, Sicilian, pizghetti sandwich, zucchini sticks...everything surprised me. Bc who knew Vegas has a good pizzeria?! Happily, now, I know.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEYmHinZRVXiOFfqWCkuFA"
  },
  "BBWTGJ3vswwQ8DLZMJr6Fw": {
    "date": "12/21/2013",
    "text": "If you crave New York pizza, then this is the place for you. Just like I used to get back home. Even the Sicilian pie is great. It's definitely my favorite pizza place in vegas. You should try their garlic knots & their Pizghetti. They also offer fast & free delivery. Great owners & a great place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0vxRtjRrbiTDcQ5qe4ecg"
  },
  "TtcKl-FoQoigBXmEexsSOQ": {
    "date": "10/5/2011",
    "text": "Great place to eat I love there, chicken fingers they are the best.   The pizza is great also, they add a ton of cheese...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kP9Vy4l13mp-XOwuS8DYvQ"
  },
  "vSCeOszYu9GN9fyQpbJNsQ": {
    "date": "2/24/2015",
    "text": "Service was quick when we dined here and I've never had any issues with pick up. I'm from the east coast and this has become my go to spot for ny style pizza. Have also picked up some of their calzones for a parks and rec night! Bonus, they have little italian ices in their freezer that are way better than the kind you get at the supermarket.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPcfkN0rdBOiK-A8Nd76bg"
  },
  "kuVrda8POtPVj0P1qVXK5g": {
    "date": "9/4/2014",
    "text": "This place is great!! Just like NY!!! Thank goodness that I found this pizzeria. Their pizza pies are thin and delicious!!! Their buffalo and ziti pizzas are great and filling. Their sandwiches and salads are great!!! If you're looking for great tasting food and an actual  NY style pizzeria you have found it. It's like a piece of New York in Las Vegas. And I'm loving the ordering online availability!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4gcibNIax-YDMr7mQZBLyw"
  },
  "RljyQGVkmmGXvEIgt2XgOw": {
    "date": "4/27/2014",
    "text": "Tried this place for the first time and was quite impressed.  We ordered a meatball parmagiana which can go either way at most restaurants, either it's really good and flavorful or bland.  This place got it right!!  We ordered 12 wings, half teriyaki and half medium and they were both great.  My fiancee ordered a personal pan pizza and he said that was tasty as well, not authentic New York Pizza but great nonetheless.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lNr7ktxvbn0LxDvwkoQs3g"
  },
  "P_t5edm1r9sbIGLk47OIXw": {
    "date": "12/20/2011",
    "text": "This pizza is delicious.the crust is new york thin and the ratio of dough sauce cheese is <a href=\"/redir?url=http%3A%2F%2Fperfect.my&s=4c2433597bada496ed4655bd2fb09ba8dd5da878aeeff97dd7d22d72345e2fef\" target=\"_blank\" rel=\"nofollow\">perfect.my</a> favorite pizza in vegas since I've moved from new york eighteen months ago. Will continue to order from here when I want a slice of home.  Another thing, I ordered delivery and when they quoted my price I thought out was a little much.when the driver arrived at my home he had said that he had taken my order and made a mistake on the price, and I didn't even mention anything about money....I thought that was honest and fair.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QUrqnrfRkCmLhMwFCnBRcg"
  },
  "ohibyK7kUlQ6YgtS1DzX6Q": {
    "date": "8/23/2014",
    "text": "Delicious big pizza slices! Good fried mushrooms! Friendly staff. Place is small but looks clean. Will continue to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jTQnF3nEnCNEGpepSYcPWw"
  },
  "bVdLY2JX5X80HtDnUhjZ6g": {
    "date": "8/12/2014",
    "text": "When I moved to Mountain's Edge the first thing I did was start looking for my new 'go-to' pizza place.  I'm a bit of a pizza snob so I was very disappointed in the initial choices I saw.  This was made worse by my friends in the area saying there were no great pizza joints around.  Then, in comes my wife one night with a large cheese and some garlic knots from Familia.  Fantastic!  Great classic NY style cheese pizza and everything we have tried from them has been delicious.  If you're in the Mountain's Edge area and need a NY pizza fix you probably won't be sorry for trying Familia Pizzeria.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1zDVvEM-GEbcDaFXACq2g"
  },
  "mjWgnQv2pvoVlIlpkoVgDg": {
    "date": "4/20/2015",
    "text": "My first time ordering from Familia Pizzaria and I was very satisfied. Not that it stood ubove  the rest I've had but definitely stood next too the best. I had the naked ziti, grandma style pizza with ham and pineapple along with the chicken strips, all very good. Good job Familia Pizzaria",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qmcql8siFVMB7CJinM91eg"
  },
  "U9LXVj6yUkdmccmQ6wrvbg": {
    "date": "8/2/2014",
    "text": "We love this place! The spaghetti calzone thing rocks! We love the gyros and tatziki sauce too! It's all home made and freaking delicious. Super reasonable prices and quick delivery keeps me coming back also. Oh and the teramissu is amazing! It's legit! No whipped cream and dry lady fingers here. It's real espresso soaked with thick cream and whatever else is in there. So good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zb10UXC7hYFl0Hli-KOY4A"
  },
  "bhQ3BNA4oNt3qVue_gHSRw": {
    "date": "10/13/2014",
    "text": "Literally as good as it gets in Las Vegas for NY pizza.  I have eaten pizza from all over the country for the last 20 years and this place is among the best.  I'm so lucky to be in their delivery zone.  If you are craving an authentic NY style pie, this is your place in this area.  Order one.  You wont be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Vuv5uVfe3HzYSbkq_8n0w"
  },
  "b2bKrV5RB1fxKCaCNNDxCw": {
    "date": "5/7/2014",
    "text": "Love the pizza and homemade soup. We even had my sons birthday catered and they did not disappoint.  The garlic knots are yummy to. Definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RZ0PcLIO45hV8QjCK-tIBg"
  },
  "3asj2Dr_d0cpwONieysJ1w": {
    "date": "9/16/2013",
    "text": "Haven't ordered from here in a while...definitely went downhill. Pizza was soggy, fingers were gross and garlic knots hard. Oh and they forgot my fries that I paid for.  Never again :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DI1wpZbtWlu9Y9jRewYK5g"
  },
  "CgvjgYsQL2kew6bTcgqkEg": {
    "date": "8/12/2011",
    "text": "Holy garlic Batman!!!! We pulled up (windows rolled up, A/C on) and could smell the garlic before we even pulled into the parking space!   My response to said pungent garlic aroma? THIS IS GOING TO BE GOOD! (haha)   Nestled in an up and coming strip mall (shocker for Vegas), this Southwest hidden treasure was on Yelps suggested pizza joints so we decided to give it a shot. Boy are we glad we did!!!   It had your East Coast hole-in-the-wall \"feeling\" with it's size, lack of detail in the decor, but I'm going to be completely honest when I say the guy making the pizza with the tattoos on his neck and the Asian guy working the register really threw me off... Needless to say, I had my doubts.   $19.99- We got a 1-topping LARGE pizza, garlic knots, and a liter of soda.. great deal!   I know, I know, get to the point already, how was the food, right?   DELICIOUS!!! The crust was east-coast thin and crispy, sauce or \"gravy\" as we Italians call it, was shockingly fantastic (not too sweet, not undercooked), my only \"eh\" moment was the cheese. Trust me when I say the cheese was not a factor when it came to devouring the pie and knots.   Let's see, it's 5:27pm the following day and.....yep, I still can taste a slight hint of garlic in my mouth resonating from last night. (Mind you this is 3 tooth brushes, 2 mouth washes, and 2 meals later)   I happen to LOVE garlic so this is not a problem for me, but if you are not in the market to ward off vampires for 2 days, pass on the garlic knots ;)   TRY IT! You won't be disappointed if you are looking for a (close to) NYC/East Coast style pizza pie.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9ktB1WEZx6ytMsRxRIMiJg"
  },
  "ZPRqsWw2j2mT4ElWo9THFg": {
    "date": "7/14/2014",
    "text": "My families favorite place to order pizza from.  There's no need to go anywhere else, seriously everything on the menu is delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qIelmM4NjI5Y5b_VQI-Qg"
  },
  "ZW-Yt1xK4jAw11pD25GCYg": {
    "date": "11/16/2011",
    "text": "On my ongoing quest for the perfect gyro, I decided to try this place out.  As I have heard they served Gryos and verified it on their website.  I was too busy with work today, but my friend went to visit this place and he picked it up for me.  I eagerly unwrapped the well packaged gryo and dug in.  Good!  It is not the same as the other greek restaurant gyros, but it isn't bad either.  The size and the value are on par. I was not disappointed.  There was a bit of lettuce in it, but just picking off some of it made it more manageable.    The things that stuck out to me: The meat, the onion and the cucumber sauce.    I am going to be dropping by this place for sure and ordering another!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLrMDYQ9TwfodJxYLfaKDQ"
  },
  "EI29g392C5l3JuAFAjpr3Q": {
    "date": "7/3/2014",
    "text": "The food was delivered to our house and was very good the only complaint I really shouldn't complain about is that it took an hour and a half to get our food but all in all very good and I will order from them again for sure... Thanks for filling our bellies with good stuff!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAwlgeJpWY_-RUqHLGTx3w"
  },
  "pzjaPQmWnumQaNlZoLJfcg": {
    "date": "7/31/2011",
    "text": "Been here dozens of times, mainly for their pizza.   PIzza: Cheese was on the mild side with some bite, sauce slightly sweet, dough/crust nicely balanced flavor and texture. NY style, got that chewiness and droopiness, made to fold, then consume. Pepperoni, Mushroom, Sausage.. Toppings are typical and plentiful any size. One of the better pizzas I've had here in Vegas.  Spaghetti: I've ordered it with marinara and sausage / meat sauce and meatballs. Both combinations were Delicious and had that Comforting good ol' spaghetti flavor. Came with bread (garlic would be nice). One order could feed 2.  Delivery was always on time and prices fair. One of my 'go to' pizza joints",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mY3mROf28N-vY1fpR-FFUw"
  },
  "WuLSRvh-Vx6QQdF4qVJDZw": {
    "date": "3/6/2015",
    "text": "I have to say best pizza and wings in town. You can't go wrong with anything you order from here. The owner puts his heart and sole into this place making sure the food is delicious. You can tell in his pizza he uses real cheese not that imitation cheese that most places use. I could eat here every day if my fiance let me. Don't take my word for it , go try it for yourself.  But beware you will be addicted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjaNZX86oGOvZ5fHhbKG8A"
  },
  "g2iPSD-euZDlqkljT-YsYQ": {
    "date": "5/14/2011",
    "text": "OMG!  I am 42+ years old and will tell you I am officially stating that this is the BEST pizza I have ever eaten.  No bull.  I dont even know what to say it was so good it was orgasmic. I kid you not.   We ordered the house specialty \"familia\" pizza and it was breathtaking.  I have not found anyone who can make NY pizza in NV or CA until now.  They actually use garlic and you can taste it!   I am so in trouble..... I am going to gain 40 pounds.... this place is like 4 blocks from my house...... Lord help me.....  If you have not tried this pizza yet, get over there.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "9kMi8dCXhj0i08a41DSVqw"
  },
  "aQsHe9Q9tKO6sSNa1JCK7Q": {
    "date": "11/22/2014",
    "text": "Food is always amazing. From the pizza, to wings to calzones, to cheese sticks to salads...mmmmmm i can go on and on. Definitely a great weekly treat I look forward to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "14SiWTnnPOZnnGc0vbecNA"
  },
  "x6_036tdVq3GNaPkPCZhZg": {
    "date": "4/22/2016",
    "text": "Tried this place for the first time tonight and let me say... AMAZING!!! We had the Familia and a pepperoni for the kiddos. Garlic knots and a small salad too. The garlic knots were a bit small, but loaded with flavor! The salad was basic, but I'm a ranch lover and it was divine. BEST pizza we've had in a long time. This will definitely be our new spot!! This place is a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "haRacJ74QuhauXwxKRMFnQ"
  },
  "v_etF-LwfHgCtYU-I1oj5w": {
    "date": "8/11/2011",
    "text": "My boyfriend and I discovered this place only a few months ago, and have been getting it delivered at least once a week (which is terrible for my diet. Whoops.) They are a little curt on the phone at times, but efficient, quick, and remember to ask for all the information. I lived in NY for a while, and this is the only place I've found in Southern California or Vegas that's pizza truly tastes like NY style pizza. I recommend getting just cheese.   I get the Baked Ravioli dinner pretty much every time now. It's delicious, has plenty of pasta, and has more cheese on the top then I know what to do with. I also recommend the mozzarella sticks and wings (medium and BBQ are delicious!). The pizghetti had a strange texture, and was a little too bizarre for me.   The reason I'm actually going through the trouble of writing a review is because last time they came, they forgot to bring me the side salad with the ravioli. It wasn't a big deal, so I didn't call them up about it. They had delivered everything perfectly every other time, so I was going to let it slide with no hard feelings.   While my boyfriend and I were finishing up the meal, there was a knock at the door. The same delivery guy had come back with the salad and an apology. Most places would have either 1) not noticed 2) noticed but not done anything in the hopes that we would let it slide or 3) sent another salad, but with a different guy because the original one felt awkward about it.   It was the perfect solution, and really showed us that they care about customer service and satisfaction. We will absolutely continue our once a week \"diet.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-N24SEuVGLXufkhJW3QRuQ"
  },
  "Ue-6VEk5vfP9-tpMoYpb-w": {
    "date": "7/20/2018",
    "text": "Best pizza on the South end of town hands down.  True NY style pizza.  Not much more to say",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pkZuWyCuc_OD46YpdA8O5A"
  },
  "v3AHcMYVr7cCqREqOpWlmA": {
    "date": "11/12/2017",
    "text": "I was so excited to try this place for the first time after reading so many great reviews and hearing word of mouth recommendations. I ordered a chicken parmesan for myself and spaghetti with meatballs for my two nieces to share. About halfway into my meal I bit into something that felt hard, I immediately spit it out because you can never be too safe nowadays. I'm so glad I did!! I but into this aluminum piece that was IN my food! The second I saw it I grabbed the food from my nieces and threw it away. This is one hole in the wall restaurant I will not be returning to again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t0ehRES09k9ZsRdXWuzJ3Q",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t0ehRES09k9ZsRdXWuzJ3Q/o.jpg"
      }
    ],
    "user_id": "2vDSIya9GE1-ej5zn8zpYA"
  },
  "dWf5yrBBZyYMnq-oDm6kBw": {
    "date": "7/28/2018",
    "text": "All I can say is I am disappointed. I left a good comment before because the food WAS good until I got my food tonight . The food was burnt ( see photo below) and my cheesecake was said to have graham cracker crust ( that didn't happen ).when I called to tell them the guy I spoke to had no regards and was slightly rude . I may or may not give them another chance only because I have had their food before and it was delicious . I had faith in this place up until tonight . I will try again later but probably not for a while ...... oh btw I never got my drink that I paid for ... although this place only let me down once I do have to say the owner was genuine and wanted to fix it but at this point I just wanted to get something else ... will try you guys another time .. I hope that when I do I will be happy like I once was .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "agerVnCF4UzwdNLSWrN37g",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/agerVnCF4UzwdNLSWrN37g/o.jpg"
      }
    ],
    "user_id": "Gz4bMHEc9zaQEND2DgUFFQ"
  },
  "2XpwliCaBYFZjOzJ4rih9A": {
    "date": "8/7/2018",
    "text": "Awesome pizza place! Great prices, great quality. This pizza place has flavor and their crust is perfect for my taste. My new go to pizza place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NSk8UC3nxIKp1g55_ryvug"
  },
  "KvR1dUtXim9ifUrp7PM4rA": {
    "date": "5/7/2018",
    "text": "This is our favorite neighborhood pizzeria... so the only reason for the 4 stars instead of 5.... the pizza is inconsistent... sometimes it's on point and just good, and others, it's just off... wayyyy too salty! But I think they have the best chicken wings! It's the best bag for the buck and... they're fried perfectly! oh! and they have that \"bar\" ranch.... that super smooth runny ranch... the one you can't find in a store (lol)...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6_RJTX02GGzwkTfhbtXrg"
  },
  "q_jEvozB1711GD-f9dgwNA": {
    "date": "3/13/2018",
    "text": "Absolutely wonderful Italian food. We had the calzones, house salad and bread knots. They were fresh and flavorful. Definitely recommend...calzones especially were to die for. Cute mom and pop place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OD0ZXHK4fV4JwpSdPk-xQw"
  },
  "5rI8bZTi1FjDtyhX40ZtNw": {
    "date": "6/1/2018",
    "text": "Not a good choice for gluten free pizza.  Edges were burnt, middle was properly cooked.  Gluten free pizza crust is thin and hard to cook properly, but this was a big miss for me unfortunately.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aVBVGzLJfOA3t7xI-UgXfw"
  },
  "qZTdRVpk3JL3NJF3KG6_ug": {
    "date": "3/1/2018",
    "text": "Came in here got a good deal for me and my son.. 2 slices and a drink for 4.99...... good size portions good pizza... simple place good pizza left full and didn't break the bank.....",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C2ag9SJutX9ZMgxCDEsCVQ"
  },
  "b0_R7_DPUh5B86ARl4t6LQ": {
    "date": "11/25/2017",
    "text": "This is hands down the best pizza in Las Vegas! I travel a good 30 min. Cause i live across town just to come here...It's def. worth it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "06txGFjmZtNZ8QlYTGifsA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/06txGFjmZtNZ8QlYTGifsA/o.jpg"
      }
    ],
    "user_id": "Yxrp5I9ETAwI52sgAviDVQ"
  },
  "9G8dBGwUQJC6nhbHcaU_kA": {
    "date": "3/24/2018",
    "text": "Ordered pizza, salad, and fingers..everything was the bomb!!! This will definitely be my \"go to\" place for a good cheesy saucy pizza!!!! Fingers were super crisp. And the buffalo sauce was nice and buttery!!! So happy to have found a place that delivers it all!! Looking forward to trying new items on the menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1i5O10CI7rbhMWp659n4pQ"
  },
  "C-7v9vtngryli9ngBhKJEQ": {
    "date": "1/4/2019",
    "text": "This place use to be amazing.  Tonight is the 2nd time they forgot the extra ranch I paid for.  They also put sauce on the chicken fingers instead of the side.  My daughter doesn't eat hot sauce so it was a waste of money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPulifi7QvFBta8hqfFd7A"
  },
  "vs-gfr4AEbxZAgg7v0EezQ": {
    "date": "8/19/2017",
    "text": "Best pizza for delivery!   Fast, hot, and never a disappointment!    Today I ordered the pizza deal, 2 pizza special!  One was a Hawaiian with extra pineapple extra cheese extra ham and extra sauce.  The Second was extra cheese extra sauce.  Gooey and cooked to perfection.     Don't forget the zepolli.   Dough fried and covered in powdered sugar.    Perfect ending.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eTZeN2cJwEsIIR4PE0zu0w"
  },
  "n2fbo52tuRql4267Ne2bWQ": {
    "date": "3/25/2017",
    "text": "I have ordered pizza here multiple times and i have always enjoyed their pizza.  I called to place an order for pick up and wanted to order a garden pie.  I ordered the 14inch and the guy on the phone said 18.95. I said, wait.. how much is the tax because on your website, it says the 14 inch is 14.95. He said no its not, its 16.95.  I said well on your website it doesn't say that. He then said, \"Well i dont know what youre looking at because our website is ________ & you clearly arent looking at it\". I told him once again I was on it & he said, well you need to scroll down etc etc etc. He continued to raise his voice and had an attitude and I am not okay with that.  Terrible customer service.  I will not be ordering here again. You have just lost a customer",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5oekGH_X4uerHQ6ZroV-ig",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. The 14inch garden pizza clearly says, 14.95",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5oekGH_X4uerHQ6ZroV-ig/o.jpg"
      }
    ],
    "user_id": "pwBUydxjpG1H4Wtg7umyMQ"
  },
  "2pN0uyqAo5AmU74f2L1Ilw": {
    "date": "5/7/2018",
    "text": "I work in the same plaza and I love how convenient this pizzeria is! The lunch special is great-$4.99 for 2 slices and a soda! Sold! I have recently tried their fries....so good! Perfectly hot and crispy and the portion size was huge! Definitely shareable! I would've given 5 stars, but I get heartburn every time I get the pizza!  I'll keep going as long as I have some antacids for afterwards!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGGeh-G4UUxh1QKVWcV_UQ"
  },
  "2EY7PfxNOr68BOzGx2XEWw": {
    "date": "8/20/2018",
    "text": "New owners. I recently stopped in to see if anything was new on the menu. Nothing is new on the menu. The new owners attitude is terrible. He seemed annoyed with me from the start. If that's your attitude I'll find a different pizza place. Good riddance.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pwQ1TrJPz1eTXnxjhAKHQ"
  },
  "6G5keCiRIRVmVAyNtBdZmw": {
    "date": "2/3/2018",
    "text": "The kids had pizza and loved it. I had a gyro and it was delicious. They have a large menu and everything looks great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_cckJrwtpuHDAhk6ORVoA"
  },
  "RXsy0aUxr9XYSCgAkt3QBg": {
    "date": "8/9/2018",
    "text": "Ordered from this place several years ago and when our order was delivered, it was someone else's. So, when I called in to report it, the manager said \"Nope you're wrong, you got what you ordered\" and that was it. No apologies, no double checking, nothing. WOW!!! So, several years go by and we decide to try them again. Well this time they forgot toppings that we ordered in the Pizghetti. The lady we spoke to was very apologetic and did not offer to remake the dish, but instead she would \"credit\" our account. Well today I called in to place an order and had the displeasure of speaking to a very rude gentleman. (Probably the same manager from our first experience). Anyway, the credit to my account was $.75. 75 cents! Who accepts going to a restaurant and ordering something that is not correct and just being credited for the ingredients that they didn't put in??? Well, I can attest to this place being very consistent with their horrible customer service. Amazing how they still keep their customer base. They should take lessons from a competitor that offers a WAY better spaghetti calzone!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nMuuWnro8loQQv9Q9I8Gw"
  },
  "EHXerSf3vak0pDqa35z2Rg": {
    "date": "5/3/2016",
    "text": "YASSSS ! Let me tell you, I have not had pizza this good in a long time! I mainly got the 2 slice lunch special and drink for $5 but I did order the Sicilian and take out personal pizza and garlic knots as well.  You are not going to find a better slice, garlic knot or Sicilian slice around! When they say Sicilian, it's the traditional thick breaded square slices. Garlic knots are small, so get a dozen and don't expect anything other than them to be loaded with fresh garlic and topped with parm! I wish this place was in Florida but I'm glad I have a place to come back to visit!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FNK64nfSN0f_rsBWnA7oSg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. I wish I got a dozen! These things are amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FNK64nfSN0f_rsBWnA7oSg/o.jpg"
      }
    ],
    "user_id": "oKjYwXEkqYB9CwA65TcGbw"
  },
  "FMs-AEEVA17MY6BVWqeyMg": {
    "date": "1/23/2018",
    "text": "It's absolutely fantastic. The pies aren't greasy, the wings are crispy and meaty and I had the tiramisu for dessert. Not too sweet, yet flavorful. Outrageously delicious. I'll be back to order for Superbowl Sunday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9HGGR2HHLMU_Zv48hiaRKA"
  },
  "AEGFou2a6Pl-LdX6EAdsfA": {
    "date": "3/9/2018",
    "text": "When we want to order pizza, this is the only place we go. Amazing and fresh!  It's even delicious leftover, cold or heated up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gCv4zLP4o21pkQF__6vM5g"
  },
  "vgI96Zmu_8l5GFy0Bx8mmQ": {
    "date": "7/9/2011",
    "text": "This place is awesome! Pizza is great...not to greasy...not to saucy...crispy...just great! Baked ziti is out of this world....ESP when its cold!! Yumm:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGoYq9EufN34Es2r9i5mpg"
  },
  "Cq6Y5esvMLVMullmEO2GOw": {
    "date": "12/22/2009",
    "text": "I have had the pizza in the past and it has been really great - the cheese doesn't taste like processed and the sauce they use is not too sweet but not too plain. I tried the wings the other day and wasn't impressed - They are breaded wings wich I do like but the wings tasted kind of dry and were a little hard to chew. The hot sauce they use is pretty good however.   I think I will stick with the pizza next time I come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rgPpseopRnL7OemuToyVDQ"
  },
  "EruVpbNAopTHJHtCvIO1xQ": {
    "date": "1/22/2012",
    "text": "I was looking forward to some real good Pizza. The man on the phone was pleasant and helpful. Today was football playoff day so I knew he would be busy. Told me it would be an hour which was fine. Pizza arrived relatively when he said it would...but it was soggy and lukewarm. I got a large with about 4 toppings. There was little marinara, hardly any mushrooms or olives and tasted like cardboard. The sausage was like lunch meat. Nothing like the good Pizza I have gotten at others spots in town like Boston Pizza or Metro, or Verizannos. I wont be calling these guys again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5mkRo6VhwdYQ0X2qbBFE_Q"
  },
  "-pcjnqpE6FIKNOzvTeDSOw": {
    "date": "11/28/2011",
    "text": "Good pizza with LOTS of toppings. Tried the meat lover's pizza and BBQ wings (amazing sauce, btw) and they were good. I must say they do take their time when delivering (over an hour) but the overall service is courteous. Definitely a place to try if you are in the mood for home-made pizza and italian desserts!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gn9jmujma9SyDirweX1c6g"
  },
  "ouAp6zDmGKzoWZI--25BTg": {
    "date": "8/4/2009",
    "text": "I love pizza places where the first thing I see when I walk in are freshly prepared and sliced pizzas just waiting to be popped into the oven and served to me on a paper plate. This place is no different.   I didn't try the garlic knots, which I regret, but I do plan to return and give them a shot. They do serve pizza by the slice, which requires you to choose toppings. I generally grab the standard \"veggie\" slice, but without that crutch, ordered a slice with peppers and spinach. It was a good decision--the pizza was pretty good, not too greasy. The rest of my party ordered sandwiches.   I will note that the restaurant was pretty warm--not sure if this is due to the constant baking of pizza or the weather in general, but for someone not immune to high temperatures, it may be uncomfortable.   I was most impressed by the owner, who came by the table to ask how everything was and wrapped up our leftovers himself. He was very friendly and invited us back. Overall, this place has good food and good service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFl0Cg7anF3yVN6dcX2Tbw"
  },
  "HGs7SDoQP884WB-jEnpjGg": {
    "date": "10/13/2010",
    "text": "I was very suspicious of the claims made about the Pizza.  I'm originally from New York and when I hear N.Y. style I have come to learn that I'm usually in for some bad pizza. This place is great, perfect cheese, perfect crust and the sauce was just right(not to sweet), was so good went back the next day for more.  Owner Vincent was very hospitable, great service.  Also tried the zeppola which were awesome, next time out will definetly try the pizzghetti.  If you love good NY pizza and don't try this place you will be doing yourself a dis-service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bx5hb16PeDYXUxV0Afm1jQ"
  },
  "CMQmAXPpGohXw8ly47r9aA": {
    "date": "5/3/2014",
    "text": "This is my go to for pickup/delivery. Always order it uncut, and add spices as I please. I used to drive up to North End or Marc Rich for a good old school pie but no point anymore, these guys are the real deal. Pretty killer deals for those looking on their website. My belief is to always support small business's and they certainly epitomize my reasoning. Thank you guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dM5kSPCm7vFuAsRyLCWhaA"
  },
  "82vusGkeO0EKiqOfnsHmXQ": {
    "date": "4/21/2011",
    "text": "If you live in the mountains edge area like I do, you know there's really not any really good pizza places around since Rosatis shutdown, thank god for Familia Pizzeria, great food, fast delivery, even if Rosatis were to come back, wouldn't go back, Familia Pizzeria is 100 times better and has the great mysterious calzone called the \"Pizghetti\" .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpfCj839-MPcxM8FKkW7GA"
  },
  "U_GE0BjMkQNKxGJbj3U0Ig": {
    "date": "10/18/2010",
    "text": "I am writing this review while eating a fresh slice of cheese pizza from a 14\" pie I just ordered from here. And now I am taking a bite out of their crispy chicken finger coated in medium buffalo sauce and blue cheese....sooo yummy. I don't care if my keyboard gets dirty from my greasy fingers!  This is not the first time I've had their pizza (I order a delivery every month or so) but this IS the first time I'm actually writing a review for yelp. Not sure exactly why I decided that Familia would be the one because I've been eating here and other super yummy places for months now and have just been too lazy to review, lol...  ...maybe it's because I'm really missing NY right now and this is the ONLY place in Las Vegas that serves an authentic NY-style pizza...crust has that perfect balance of crisp and chewy, the sauce is very flavorful and they put just the right amount on the pie (I hate pizza that's oversauced and soggy), the cheese is the way it's supposed to be...nice and melty with just enough stretch when you pull it away...DELISH.  And yes the pepperoni pizza is oily but cmon, it's pepperoni! The best pizzas are the ones that take up 5 napkins to soak up the excess oil.   Other Menu Items: - I usually just get plain or pepperoni so not sure what their specialty pizzas are like but they do sound delicious.  - Chicken fingers (sauce on the side so it stays crispy) over their wings...fingers are better than a lot of other places - Their house salad is huge with large chunks of lettuce, tomatoes, slices of pepperoncinis, . I usually get the Greek dressing  - The zeppoles are AWESOME but you definitely have to eat them while they're hot....I tried to eat one the next day and almost broke a tooth hahahaha (what?? they're really good!) - I recently just tried their Classic Gyro and it's actually pretty decent. I've had better elsewhere but I would order this again. It had a lot more lettuce than other gyros which I liked and the tomatoes were thin slices instead of chunks which I also liked.  - I've tried the cannolis once and it was really good but I'm the only one who likes them at my house and I can never finish a whole one by myself, lol so never got to order it again  They have some really great anytime and lunch specials also. This is seriously the only pizza place I go to since discovering it a year ago. Every time I get that craving for some NY pizza, I call and order...and then get nervous that I'll be disappointed but I never am!! Love this place =)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "GxB_VQ8GaffGnXiUfQubHA"
  },
  "gb2qjgxfrLcMox8s58fDqg": {
    "date": "6/21/2011",
    "text": "New Yorkkkkkkkkkkkkkkk. Thats what I think of!! From Bay Ridge Brooklyn, to the Cross Island Parkway,,,,,You can get a slice @ any corner thats top notch. In vegas, not so much! This place is filled with cheap imitations of what a real New York pizza is. Familia hits the nail on the friggin head. Love this place. I walk in and say \"How ya doin\" and get an immediate response. I order my pizza (or call for great delivery) and get a pizza the only way it should be ordered. Half pepperoni, half xtra cheese, and well done. Boom. Dunzo. Best pizza in Vegas. The place could use an upgrade, but who cares. I dont pay for decor, I pay for a quality product @ a fair price. A large pie with a dozen knots with a 2 liter for 20 bucks....cant beat it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZsAw2e4Vdq88-yDCtZJPlg"
  },
  "dk62_mkXUQgEUckJOap7_w": {
    "date": "6/21/2014",
    "text": "Terrible service, very rude and sarcastic over the phone. I called to order food and was looking at the menu online. I tried to order the \"anytime\" specials, I was told they don't have that, and they would not honor that, it was wrong, well I can only go off what your menu has. Lost my business for good and I'm sure I'm not the only one nor the last, beware",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "upFHrTdfWZGiZ84_bLzY9w"
  },
  "TFo-w9UfCnmr9OkgzW_vLQ": {
    "date": "1/15/2011",
    "text": "Hands down the best pizza in Las Vegas!!!!! I was born and raised in NYC.I moved to Las Vegas 4 years ago and I have been in search of pizza that tastes like it does back home. I am 100% Italian and learned to cook from the best. So as you can see I am VERY particular about my pizza. The sauce and crust were amazing the cheese was perfect. I will never ever eat pizza anywhere else!!!!! I can't wait to try all of there entrees go there ASAP Ciao :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lXm6nuqLZIQpIifGVrjFNw"
  },
  "MP1zEH1EIAleEOVdM0YfYg": {
    "date": "2/25/2011",
    "text": "Was craving a calzone or something tonight and stopped here for the first time.  After much confusion on my part, I ordered a Stromboli and a cannoli.  The Stromboli was delicious! About to have the cannoli now.  Will definitely be back for more! Probably zeppolli in the morning!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EIbHEWZmQq96v0g6FV46ng"
  },
  "0FX7ociVSIFNpa33Q6zZYQ": {
    "date": "11/17/2011",
    "text": "We ordered delivery from here tonight, and as always, the pizza and knots ROCKED!! As others have said though, if you're afraid of garlic, you may want to skip the garlic knots. They'll definitely keep the evil spirits away!! We almost always order the sicilian style thick crust pizza and it is the best in town. The crust is crispy with a soft chewy inside, just the right amount of sauce, and extra gooey cheese...perfecto!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7KdP3DoTloxgmac0rmQcrQ"
  },
  "6Qt4SnA4NtO0Avp3r0p9OQ": {
    "date": "11/12/2011",
    "text": "The pizza and the chicken cheese steak were great!  I'm super happy they deliver to my area!  Being from the east coast, this pizza ranks pretty high up on the list.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g2lWa_iVPoXxNfgKO6j9-Q"
  },
  "eq3rWprd8rFAdprQHbpFog": {
    "date": "6/14/2012",
    "text": "Pretty good pizza.  I had the pepperoni with extra cheese.  Excellent cheese, pepperonis and decent crust.  Not the best I've ever had, but for the price this is good pizza.  Also the Philly cheesesteak sandwich is one of the best in Vegas.  The Philly chicken is good also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "svbWpiDlAVFQa6dwfMtgQg"
  },
  "dp9zCixUmxom3Fs4Yj4XmA": {
    "date": "8/9/2010",
    "text": "We love this pizza(and everything else). We're from the east coast and it's hard to find really good pizza but we lucked out because here it is and not far from home. Worth the trip and great specials.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "eHgvaxXZ-Cr0yIKN544d1A"
  },
  "oiICuidr_XhVawooeVRdCg": {
    "date": "2/3/2012",
    "text": "Just ordered from here and was very happy. The pizza (1 cheese, 1 pepperoni & peppers) was delivered quickly, fresh and hot while the chicken fingers and fries where perfectly crispy. We will definitely  be ordering from here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VRSw-jG5qk2qei7GJNvmA"
  },
  "FgY95tROOJbJ2Tv5GEmGCQ": {
    "date": "3/1/2011",
    "text": "This is a place that without Yelp, I would have never tried.  I have driven past it hundreds of times and never given it a second look.  I guess you can't judge a book by its cover.  While nothing to look at from the outside, the pizza was good.  While not the best pizza in town, it is one that I would be happy to eat any time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cFubXywYZHvmwwKb5spgQQ"
  },
  "5waALY0hkyVodl11HFX9Kg": {
    "date": "9/28/2010",
    "text": "This is my favorite pizza joint by my house. Their zepolle donuts are to die for. It's only 3.99 for 24!  I buy it for potlucks and it always becomes a fav from my friends. C-Los and Mike (friends) sniff up the powder from it like cocaine. That's how good it is. And oh their pizza is great too. Try the NY cheese pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kvGowEk1AvUUwWHLkJyNg"
  },
  "SGhds1jSvDCzm5ZvV6h4ZQ": {
    "date": "7/26/2017",
    "text": "Pretty decent food and pizza.  Will make an occasional stop here from pizza take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vef-mhDgJP7FzFCdTTds-w"
  },
  "1z8FppWgqLHyhcL6BUlOkQ": {
    "date": "12/17/2016",
    "text": "I was introduced to Familia by some friends who moved here from New York. It is by far the best pizza I've had in Las Vegas. We get the pizza and wing special, and it never disappoints. I have ordered pizza from here for many parties and everyone goes crazy over their pizza. I have turned many friends on to Familia and they order from here all of the time now. I truly don't understand how some people can leave negative reviews for the pizza. Some clown said they would rather have a frozen pizza from the grocery store. Oh, and Pappa John's is their go-to! Hahaha! Whoever would say that is either an idiot or has no idea what good food is.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6RVRH9sXqwEgcCkakyWmrw"
  },
  "BCLromO1HRAWPPE-HHL3RA": {
    "date": "1/8/2014",
    "text": "Their hot wings are heaven. Also, their bbq ones are too. I haven't tried the pizza yet, nor do I think I will after these wings. They deliver to my house in a decent time.  But seriously, get the hot or bbq wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z1dxENaKdh9Ya5IleBm3BQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z1dxENaKdh9Ya5IleBm3BQ/o.jpg"
      }
    ],
    "user_id": "Or2-61utFzG9yF0ys67RUg"
  },
  "IdqvSK4FG7gEYMdR8ryMTA": {
    "date": "9/7/2015",
    "text": "Prefer to come here over Pizza Hut, little Caesars or any other chain pizza place in town. This seems family owned and operated. Reasonably priced and always fresh. Made to order. Staff is quick and phone orders are always ready upon arrival. Whenever we are in the mood for pizza this is our spot. Def a fan",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sJego2RM7bR2zdPtxkXJhQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sJego2RM7bR2zdPtxkXJhQ/o.jpg"
      }
    ],
    "user_id": "GmXOSEbXy8JXmvo9hM5WWQ"
  },
  "y3tuaikuRkD-qlS0mzUU-g": {
    "date": "11/23/2016",
    "text": "We tried this place last night for delivery just to try something new. Papa John's is usually our safe place for pizza because we know what to expect. Wanted to be adventurous and hopefully nail finding a pizza place with the delish mom and pop taste.   We ordered the special of (1) 18\" Pizza with one topping, garlic knots, and a soda. In a nutshell I'd take the frozen grocery store pizza over this place. The pizza was super greasy and crust was kinda stale. The garlic knots were burnt and overcooked, and the delivery came about an 1 hour and 45 minutes after I placed the order (we're about a 8 minute drive from the where the place is). The only non-disappointment was the soda.   Glad we tried the place but doubt we'll ever try it again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ROnn2lPOx2jdXvlXSGRvag"
  },
  "9rDXQaco45r7ibAVt-tn6g": {
    "date": "6/28/2017",
    "text": "Ordered garlic nots got pizza dough in a twist. Walked in and the whole staff was sitting at tables. Waste of a good NY pizzeria!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_5p21TqYruhU0mGmEPSgg"
  },
  "kf7i0bkM0Zvy3sC4-mnFwQ": {
    "date": "8/24/2015",
    "text": "We ordered 2 large pizzas for delivery.  Neither one of the pizzas were cut through.  They put way too much cheese on the pizzas.  All of the cheese slid off of both of the pizzas.   It's amateur hour over there. They don't know how to make a pizza.  They don't know how to cut a pizza and they don't know how to deliver a pizza. Other than that, they are ok. NOT!!!  I highly recommend, for you to NOT use this place!!!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PwS260gy26l3LDIoNa_lqQ"
  },
  "iiPo8PXx8GHIyAxvuHDzgw": {
    "date": "3/11/2016",
    "text": "First time trying this family owned pizza spot, it was delicious! I got the pizza/wing combo $20 the pizza was HUGE! The wings were delicious too. We will definitely be ordering again from here. Quick service, location is hidden in the corner of the parking lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jgv_LVIxEWZQQXmQlB84bA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jgv_LVIxEWZQQXmQlB84bA/o.jpg"
      },
      {
        "img_id": "B4p0SluKUy1xtodBa4qk9g",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B4p0SluKUy1xtodBa4qk9g/o.jpg"
      }
    ],
    "user_id": "4CzFr8rxRF72azntCwdsKg"
  },
  "9C2JNjiHCMuGhIILO0nNQA": {
    "date": "5/20/2017",
    "text": "Sandwiches were dry. French fries like cardboard and a rude unfriendly man at the cash register. My husband tried the Sicilian pizza. It was just ok!  Not a good experience. We won't be coming back here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5QZeNCpoCxGIdqaZmKCYA"
  },
  "ZwQKV_xaOBanysCIBd3JcA": {
    "date": "3/24/2016",
    "text": "Pizza is my weakness! So I am a critic...  Well this place is the best, truly home made. I am from the east coast and I can tell these guys are too! They do the pizza right!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C690KeIEqm1K0U97MHVMWQ"
  },
  "7_g4IgE40YlZZxp6MVe-nw": {
    "date": "6/25/2018",
    "text": "whoever the delivery driver is they need their license taken away, reckless driving is never okay I don't care how hot or cold a pizza will be so ridiculous won't ever spend any money on this kind of business",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eEoaTw5pKmYnHVaU65AHgw"
  },
  "3hsUtlHs_U1sSwllfHDA1w": {
    "date": "6/23/2015",
    "text": "This is a gem of a location for authentic NY Style Pizza. A little hard to find because it's hidden behind Bomas. If you don't like the pizza from here, maybe a Chicago Style Pizza or heaven forbid a Dominos Style Pizza is more to your liking. I haven't tried everything on the menu, but I can provide a review for what I have tried. I love pepperoni pizza. When comparing pizza from one business to another, pepperoni pizza is my litmus test. The crust is the traditional thin crust. It's cooked in an authentic brick lined pizza oven that produces a crust that is slightly doughy on the top yet crusty enough on the bottom to be compared to a cracker. The sauce is extremely flavorful that balances the sweetness of fresh ripen tomatoes with just the right amount of zestiness. The mozzarella cheese and pepperoni are the finest quality.   I've also had the pleasure of having there canolli. Originally, it was lacking in chocolate chips. Now it does have it. If you like the chips, you're welcome, or maybe they were just out that day. Now if I could only get them to put ground pistachio nuts on the ends it would be perfect. Just like the Italian bakery around the corner from where I grew up.   The prices are also amazing. They have Specials that compete with the chain joints, but are infinitely better because they are coupled with a premium pizza. My favorite is the 18 inch (that's right not 16) one topping pizza with one dozen chicken wings with hot sauce (my favorite of the handful they offer) and ranch dressing for $19.99. Can you dig it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KqbowpYkOxkpFNuEd-rTnw"
  },
  "-rJMsqO252pxpZZAZaVSeQ": {
    "date": "1/22/2016",
    "text": "I love getting the grandma style with anchovies delivered. I always have to heat it for 5mins in a 450 oven to get it crispy, but it's the closest thing to a NY slice this far West. I read some of the other reviews and yea, the guys answering the phone are a bit of a C U Next Tuesday but you want a New York slice? Don't be surprised getting a New York attitude with it. You guys complain the Chinese menu is written in Chinese too?  The wings are meaty. You can tell they buy nice quality product. Nonna is always gonna be the way to go. Don't forget your grandmothers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uaDuEUElim16e8KNXqU0Bw"
  },
  "o_EFC-pIW57h-tf-2Qzx4Q": {
    "date": "5/20/2016",
    "text": "I placed an order for a last minute sleepover party.  Customer service was excellent over the phone and they said 45 minutes for delivery.  The pizzas actually arrived 25 minutes later.  I had a bunch of happy 12 year olds.  The slices were huge so I cut them in half and everyone got plenty.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "1dWLN4Mr4hKhu8MQUCKqXQ"
  },
  "HRHljcECEwLucW1ZJzVZ7A": {
    "date": "8/21/2016",
    "text": "Order a 18\" Pepperoni pizza .... was awesome , crust chewy and good not too oily , definitely will order again ....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTLEyQtdIdMmJS0sE1LxIg"
  },
  "1PVbJlvrY_XPQ9geYXTNMQ": {
    "date": "6/8/2015",
    "text": "This place is amazing and the prices are great for the quality.   We usually order a large pepperoni pizza and chicken wings and they have never disappointed.   The staff there is nice and if you are a sports fan there is always sports on in the seating area while you eat or wait for your food to be ready.  This place is a little hidden behind another restaurant but it is on the north corner of the shopping center. I encourage you to give it a try if you are missing that real pizza.   -Brian (Vegas native)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jKuKXRLmFY30mFo6oldsnA"
  },
  "lnjT9MZ8sAzl3_h8mK3Jcw": {
    "date": "10/1/2015",
    "text": "Ordered the house pie and a dozen wings. The wings was not bad with ample amounts of sauce and cooked appropriately. The pizza however was saturated with grease to the point to where the crust was no longer crispy. The vegetables on the pizza tasted raw making it not palitable at all. Stinks I paid $20 for a pie that was below in quality of a $5 hot and ready pizza from cezars. Much better pizza joints in the area if your having a pizza Jones.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3fOi-5w4intrUTWXzIQew"
  },
  "mWkS1bNT_60ZXqMqBhoKZQ": {
    "date": "4/26/2013",
    "text": "LOVE LOVE LOVE this place! Coming from NJ, I'm always looking for a good NY style pizza that's close to my house & I've found it! The workers are very friendly and it's never too packed or crowded. One time they even gave me a free cannoli. But what really keeps me coming back is their Philly Cheesesteak. I've tried around, but Familia has the BEST and it's really big compared to other places who charge ten bucks for a skinny breadstick looking thing. The only downside sometimes is the wait time but it's really well worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "46-qsKjqR4vptCIYrHH1yw"
  },
  "UIjom2PA7DIDcwCi_QQ_hw": {
    "date": "8/6/2016",
    "text": "Ordered a pizza for delivery, it got here with in 30 min which was nice but when we opened the box all the toppings had slid to one side of the pie, there was a ton of grease and the center of the pizza was so soggy that when I pick it up everything fell off. Never again!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qm7dsDTogy9yzSnUGi1Lng"
  },
  "coYfvWOHuwF4ZjEzjKYy8A": {
    "date": "12/4/2012",
    "text": "As I ate the pizza and garlic knots, my main thought was \"average.\" It was simple as that for me. I've had better, and there is little doubt in my mind that I would not bother to try the place again.  I guess my biggest beef was with the Garlic Knots. I've had some REALLY amazing garlic knots before, but these were just soaked into garlic/butter sauce and topped with a ridiculous amount of generic parmesan. Tasty to an extent, but when you slather on all of that, little else is to be expected.  The pizza was decent, but didn't measure up to some of the better non-chain places I've had. Sometimes you just bite into the pizza and can't stop eating it because of how good it is. This was not quite that good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "KbwOwQZTOfrtaeJdmucALQ"
  },
  "K7rEWpxXgUHTW61NM1B7-Q": {
    "date": "8/24/2017",
    "text": "Pizza being one of my favorite foods, I am always on the hunt for my new favorite pizza place... and this might be it! I don't really have much to say except the pizza is AMAZING. Kind of greasy but really really really good. We ordered a Large pepporoni & jalapeno and it did not disappoint. We also ordered a side of garlic fries which were pretty good, but you must try the pizza!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "txMZ5pZ2C--gxmbgkCyI6w",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/txMZ5pZ2C--gxmbgkCyI6w/o.jpg"
      },
      {
        "img_id": "Nm-vl17-enwwZ4PHUmcngQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Garlic fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Nm-vl17-enwwZ4PHUmcngQ/o.jpg"
      }
    ],
    "user_id": "bvzwsK8u5i0Kvvyfy7aT1Q"
  },
  "9aiXzv7umAB2yntURoOBCg": {
    "date": "7/16/2017",
    "text": "We ordered a pepperoni pizza and it was SO GREASY. I won't be making that mistake again.  The vegetable pizza however was great. Lots of fresh vegetables. Fresh (not canned) mushroom, spinach and broccoli. If I ever return ill order that again.  The garlic bread was pretty good. Fresh ingredients make a difference and I could def taste the garlic.  The greasy pep took it a star down for me. For that price I should have had a better quality pizza at my door.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TfofCo_xEwY4am19d8lGYw"
  },
  "_f7wxO8bK0Gs9EmVue_tAA": {
    "date": "4/11/2018",
    "text": "I really like their pizza - if you like flat, floppy New York Style slices, this is the place for you. They deliver and are usually pretty quick - if it's going to be longer than 45 minutes, they'll notify you in advance.   Also, their zucchini sticks are great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2MD7YF90xxjqPIAS4vcWjw"
  },
  "1DSgR-rYNIvwlCKAUYBOOA": {
    "date": "9/15/2018",
    "text": "I have yet to find a better ny style pizza in Vegas. Very consistent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0A1xfJ8NFSymnqXNBlDPbQ"
  },
  "Nozj0q-2oQeA_XYFY2WgPw": {
    "date": "6/26/2017",
    "text": "My husband and I live this plotter pizzeria so much!  Being from New York, my husband is very picky when it comes to Italian food. As after we moved to Mountain's Edge area we were hoping to find decent pizza place near by... and thankfully, Familia Pizzeria never disappoints!  Highly recommend!  PS Our niece tried their gluten free pizza and was amazed. She said it's a lot better than the ones she eats back home in New York!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aR-DT8veWutWMBp6ow_msg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Yummy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aR-DT8veWutWMBp6ow_msg/o.jpg"
      }
    ],
    "user_id": "x_kJi2ozLPgXhckevtjStA"
  },
  "7x1Fp3HHY6rCSA91PR2DwQ": {
    "date": "3/17/2018",
    "text": "I had a pizza delivered, first time trying this pizza, I must of had 3 pieces of sausage on the whole thing, no flavor!! Absolutely awful!!!  You just lost a customer and I'll be sure to spread the news!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKpq6xGxO-VtSvCn4o_L4w"
  },
  "YhaV3jlAeftBfU5r9aHP7Q": {
    "date": "3/9/2018",
    "text": "It's hard to find good pizza in Las Vegas when you grew up on the east coast... I won't eat any of the fast food pizza chains, so we had to do a little research online to find a place that looked like it had potential.  I ordered a plain cheese pizza and my husband ordered sausage, banana peppers and green peppers.  We both were pleased with the taste of our pizzas and will definitely go back, as the rest of their menu looks quite appealing as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ajYEDNvhbmk8AHVObIDhA"
  },
  "-VHl8-8KMORI4JyiVrqDCg": {
    "date": "4/25/2019",
    "text": "This place stated I refused a order after a wait of an hour.  Then he had the complete disrespect and hung and lied directly to my ear on the phone stating a driver was here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Mv-Qq-TdU7ry0sUGI-VmA"
  },
  "J43ALmBunRaBIR_XaAlLBA": {
    "date": "11/5/2018",
    "text": "BEST. DELIVERY. PIZZA. EVER! I absolutely love this place. Staff is always friendly and kind, store is always clean and it gives me the old school pizzeria vibe that I'm used to from growing up in a small town. Food is off the charts. Pizza is amazing, so delicious AND it's even good the next day as left overs. All who go MUST try their garlic knots, a little greasy (which does not scare me) but so worth the calories. Get them for every cheat day I have. So bomb. 10000/10 love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flG7WRzTe55TBbTmffTXag"
  },
  "5daeAOAykCS47O3Fu9iOyQ": {
    "date": "9/7/2018",
    "text": "Maybe not the most elegant pizza place but good food and very nice staff. My husband is from NY so naturally he is very picky about pizza and this is the best he has had in Vegas. Wings were good and salad was very fresh. I would check them out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zpBZQ2gvdCcPQaayXs520Q"
  },
  "0gYmoCoByQrV8mj816gdrw": {
    "date": "10/18/2018",
    "text": "I am from Brooklyn, NY and I tell you this is the closest pizza to NY pizza I have found. I eat there 2-3 times a week for there 2 slice and drink special (4.99) incl. tax. My wife loves there chicken wings and there chicken parm is great. Home delivery was quick and the food was still hot. Recommend highly  Marvin L. UR Mail Box",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9u9NcJZ4SL2pgh6QaT9ug"
  },
  "5yAAtC2jMl4F-SwIkhc2Ww": {
    "date": "4/4/2019",
    "text": "Wish I could give this place 3.5 stars because actually it was pretty decent. Fist time visiting Familia Pizzeria so I wasn't really sure what to expect. As far as atmosphere goes... well it's not the newest or most modern place but it didn't stink and I didn't see any bugs. The table I waited at, though older and kind of cheap looking; was clean. The staff was really friendly and the pizza was fairly priced. As for my pizza, it was good. Just ordered a small pineapple pizza. Took maybe 10-12 minutes to be ready. The best part about my pizza was the crust. Really good and flavorful and didn't taste like dough like some other pizzerias. I will say I was pleasantly surprised because I didn't know if it would be good or horrible. Sauce was cool and had good flavor. Pretty sure I'll be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6lyGEezr9oSmrAvLSF-TQ"
  },
  "5fgyAbteMTa7PrN6mDm0JA": {
    "date": "9/13/2018",
    "text": "My bad for trying the pizza just recently, if not because of the reviews in yelp I wouldn't be able to locate this gem of a pizza place. I ordered 2 huge size pizzas plus garlic knots, it came out very good: the taste, the crust, everything was just splendid. Would recommend the place anytime!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "trHDz-edSGm2Cgn2JgK1FA"
  },
  "eFIZj8qMulD1V7nqIHHKAA": {
    "date": "6/17/2018",
    "text": "This used to be my favorite! Now there is a new owner and things have already changed for the worse. Just got my sub, pizza, and ranch delivered and the ranch literally has the consistency of water. You can tell that either the cook or the supplier has change for their toppings too - didn't taste bad - just not the same. Please please please change the ranch back to the old stuff and don't let your cooks turn it into water - it's disgusting!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_ktRwLQ6VKI_HIFcqy64g"
  },
  "TvX45nU5n-3CV6Tg4XUKBw": {
    "date": "11/11/2017",
    "text": "The only bad thing i can say about this pizza is they don't have one in the northwest.  The pizza was so good and the prices were not crazy! They have very good specials!  Will definitely continue to go to them when I'm on their side of town!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bI67_CVxFy8PPL7E3BLqw"
  },
  "jqPsJJIVe0aBk03TZ-VxkA": {
    "date": "7/30/2018",
    "text": "Loved the quick service and the guys really knew their pizza!! Highly recommend getting their wings and fries, not only are the wings huge but they also give a generous amount of fries! Pizza was delicious for the price! If I could give this place 100 stars I would!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvTjlky6KcICeTJBtcaoIg"
  },
  "AAh_t8vXgxS54vFdiAi1EQ": {
    "date": "4/25/2018",
    "text": "Great neighborhood pizza spot, but the food definitely left something to be desired. The garlic knots were bland. We ordered a double pepperoni and it seemed to just have a normal amount, but not really a biggy, since $30 fed three hungry people.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "84xp7RvchUw1bGjsI8RKRQ"
  },
  "52LUgFWIl0FWoBhjwQjTiw": {
    "date": "7/4/2018",
    "text": "As a native New Yorker I'm always searching for good, solid pizza. For Vegas this was a good NY style pizza. Crust was a little chewy, but it was nice and thin and tasted fresh and cooked with love.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5s3URNOOJkwEnaJdgSSq2g"
  },
  "7OOEFibFGFXCq1ZEGkF9aw": {
    "date": "9/3/2018",
    "text": "We received our cheese pizza in time, hot, and delicious. If your looking for a great pizza place made to order as if you lived in New York you must try Familia Pizzeria. I have been looking along time for a place that services good pizza and I finally found it. The quality and taste of our pizza was excellent and the price was worth every bite. We will definitely order again and cannot wait to try some of their other items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dvljt3a-hsP9ucVhRJMjgw"
  },
  "N4Pjv9gjop3QmmC-DQrECA": {
    "date": "8/11/2018",
    "text": "Waited over an hour for my order only to be told that my pizza was taken by the delivery driver and had to remake my pizza. But it's ok you can have free drink on the house. Probably the last time i come here. Never had this issue with previous owners.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TYUyP0M4baxBk3dfGXpoEQ"
  },
  "FVjgIgfDSY2KbQWgCmsJNw": {
    "date": "2/26/2015",
    "text": "So my Fiancee stumbled upon with awesome place when she wanted pizza but to lazy to drive anywhere. Sometims laziness can be good, anyway she ended up ordering pizza and I orderd some wings, which are price awesomely, and a gyro, freaking awesome. We go there to get our gyro fix and my wing fix. Also they don't have a minimun on their delivery. Place is a gem",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fH3EC8mf_fi6eB8OraRj3Q"
  },
  "IPDrH2N0FrQXZNq-S9ZWZw": {
    "date": "8/7/2014",
    "text": "Awesome food! Great prices! Thank Goodness there's a mom n pop pizza place that actually makes food w/ luv on the southwest side of town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLvEB01Gd_079C6ElG4L7w"
  },
  "G2t1KwQslQvlTYGxq9hFMw": {
    "date": "7/7/2016",
    "text": "We happened to be on this side of town and looked on Yelp to find a new pizza place to try, glad we found this one!  There pizza was very good. Crispy thin crust with great tasting cheese and toppings!  The garlic knots were awesome also!  Give this place a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqlzHtyz2BwW7kjHqsaEug"
  },
  "S0ZODty3Kq7HLlFjllYQMQ": {
    "date": "1/1/2015",
    "text": "Another delicious pizza experience! Their sausage is the best!!! Yummy garlic knots and authentic gelato- how can you go wrong? Friendly, fast service- Vincenzo we love you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jpu5KX95HLWJdztLq53uQ"
  },
  "ADwopa1jPbwtAKCeE4ZLMw": {
    "date": "7/8/2014",
    "text": "This is the best Italian food delivery in this city! It is very home style food. Comfort food at it's best. They deliver hot fresh food in a timely manner. The meatballs and pasta were so fresh, It was incredible. The man I spoke to over the phone while ordering was so receptive to any questions I had and helped me choose what would be the best item for me personally. I thought everything about this place was amazing. I am a Italian food lover to the fullest and could not be happier with choosing to eat here. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DwYGxx13rXJmp9qNzNVFPw"
  },
  "LSLhZ2DWJXwbWl4SJklUSA": {
    "date": "11/7/2014",
    "text": "Business owner handled issue with an employee professionally and in a timely manner, some hard to find good work ethic definitely found at this spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mVn849K6CF9H8FD65jQTdA"
  },
  "y2S-LaG30tLqkzOx7Lj1nw": {
    "date": "3/6/2015",
    "text": "Man is this place a hole in the wall, but it's an amazing hole in the wall. The store is located in the corner of a small strip mall and is mostly out of view of the street. Boy do they know how to make a good pizza though. I got 2 slices of the cheese pizza and they were good. Im probably going to go here more often now since I only live five minutes away",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oz1Hebjzbw55Wbsc1z51-g"
  },
  "7jjPZuRFiIJr_DOYagCBQg": {
    "date": "6/20/2012",
    "text": "Can't complain about this pie.. YES! I said PIE and they know what you mean... ;) Some of the best PIE I've had in Vegas if not the best! Reminds me of the small Jersey spots I miss so much.. Big Slices, thin, crispy, great cheese!! Order a large PIE with some tiramisu.. also great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY_VYm82XCBfoztC084Xow"
  },
  "2neBAJvLaFhRxCa4afBV9w": {
    "date": "7/21/2012",
    "text": "Decided to give this a try after craving pizza and pasta after church one Sunday.  I looked on my trusty yelp app to see what if any of my Yelp friends had to say about this place.  After reading a stellar review from my friend Nelson S. I knew this was going to be a good place!  We ordered a pasta and pizza combo for about $20 + bucks! Great deal! First we had some spaghetti w/ marinara.  That's always the best way to tell if the sauce is going to be good on the pizza.  It was pretty darn good! Meatballs were very tasty too! Then we ordered a large pizza (pepperoni and mushroom) and had no problem scarfing that down. YUM! Very friendly staff.  Food was priced very reasonable and the portions were plenty! We decided to sit in the small dining room and enjoy our meal.  We were too stuffed to try the donuts that Nelson had talked about but I'm going to save that for the next trip back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PtEQ6LrPT4qO5L7sno95Hw"
  },
  "69XEszZkfRYN16Ub9KYx8A": {
    "date": "8/8/2015",
    "text": "This is the BEST pizza in Las Vegas. Always made to perfection.  Why we just had it the other night and I'm ready for more this weekend. Very nice and professional employees.  I get the Margarita and it is delicious I ask light on olive oil.  I love garlic and basil this is a perfect balanced pizza.  I don't care for pepperoni but had a piece from there and it was GOOD.  Must give this place a try I might add.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_CEW_CBGw8AgxHnamdWuQ"
  },
  "iateVcWgdIBlqZ-QrigxfA": {
    "date": "6/22/2014",
    "text": "This pizza is really good. I order from here all the time and maybe one time out of a hundred I get a not great pizza. It's greasy, crust is soft and toppings are more than serviceable. All in all, I dig it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SnemO243DdmqwqrAUkZgoA"
  },
  "faYEkSY2vHTgse3zDcnK_A": {
    "date": "7/22/2015",
    "text": "Glad we found this place on yelp! They have the best pizza, fingers and customer service!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7i341AMBopd3tO5iZWJjeQ"
  },
  "QiH2rPjWRJxp_nmuWBWG9Q": {
    "date": "4/19/2015",
    "text": "Just.... Meh... Ordered the Mac and cheese pizza. The idea of the pizza was far better than the actual taste. Also ordered the chicken gyro which was full of tough/hard to chew pieces of chicken and overly sour sauce. Their fries are pretty tasty and they have the \"good\" ranch. Ordered a child size cheese pizza which, for the price, was a good deal. But ya, all in all... Just...Meh. Won't be ordering again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qVKVwjVQVJkKax-HoU0j3A"
  },
  "FcXqQxBCBMCRudduyuEOCQ": {
    "date": "7/5/2016",
    "text": "Worst customer service I have ever experienced. They made a mistake on my order a couple weeks ago and I went today thinking they would just credit me the 2 toppings they did not add to my pizza. They did not. The money is not the issue. It's the principal. Not the way to keep regular guests.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lC_NlZuI_BTW8c4qbCVP8Q"
  },
  "NVc4QmAFEWvG9oMEsm6H9g": {
    "date": "9/8/2012",
    "text": "I can only give this 3 stars although in the South West Region of las vegas it is by far my favorite pizza place.  They also have great wings and some other assorted fried options.  I would highly recommend them for your Sunday NFL Party.  There pizza is good but not great, the price is great for what you get, service is above average but don't expect to be greeted at the door and made welcome, it is a local pizza joint.    It loses a star due to a lack of originality in the pizza.  However the thin crust is done very well and has a nice texture.  It loses a second star for not offering some healthier options on the side.  You are going to get pizza and fried, fried, and more fried food.    I do recommend this place.  It sits right behind Bomas Bar and Grill off of S. Durango.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RgkE4axKKeLW__unMFEB6Q"
  },
  "az9VtLqO5TGzpf6Egz9fPw": {
    "date": "4/8/2015",
    "text": "The best pizza! Love the thin crust! OMG!! The calzones! The eggplant parm! Mmmmmm! Love the friendly staff, too. If you love NY style Italian this is your place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QcPr37VzvBFXb-Ymd_iQUQ"
  },
  "-arURnJruPqoDrO8gPc8LA": {
    "date": "4/19/2014",
    "text": "Ordered the XL pizza and wing combo and an order of mozzarella sticks. The pizza was just average and the wings were above average. The sauce and cheese weren't anything to write home about. I have definitely had better, and also worse. The mozzarella sticks were the frozen kind. Not made from scratch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "otCx_9SYFiMaObxYbOnbQw"
  },
  "ywjOeY0MjN-Ikxzk8w6_zw": {
    "date": "3/12/2015",
    "text": "I recently moved to mountain's edge neighborhood and did a quick search for local pizzerias-famila came up. I called and the person who answered was very nice and professional.  Their delivery service is excellent; my pizza was hot and fresh. The quality of the sauce was remarkable and I love the NY style they offer. The house salad with fetta added is really something special. The prices are competitive and are worth the quality of their product",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kheMWYZ3KGy9wZTGmDY7Kw"
  },
  "4hyxUXMDAxO_OBmgUZ_6GQ": {
    "date": "3/1/2015",
    "text": "Not bad at all!!! Pizza lil oily or id rate a 5. Prompt service and a great salad. Took about 35 min and that was awesome since it was fight night. I'd use em again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "syp2NKiNDA8Lfj6ArV3bJg"
  },
  "KUlNHJZbyfLHyjiPhTI7kA": {
    "date": "5/21/2015",
    "text": "Thought I ordered from a fantastic place, but proved me otherwise.  I called over the phone today  and the person who answered did not even name himself or even care about the positive things I have heard about the pizza place.  I then gave my order and nothing was said, just a total and 1 hour delivery.  Delivery then came and the kid had earphones on.  No greeting, no nothing.   Just wanted the money.  Terrible service!!!!!  First time trying the thin crusted pepperoni pizza and supreme.  The pepperoni was really delicious, but the supreme was terrible. Will not order from them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kY03_R1HVVILd3PEzgKm7Q"
  },
  "hGNaar30imkS8I1sYKmagA": {
    "date": "10/12/2014",
    "text": "I just moved in the neighborhood and needed a bite to eat. Then I seen this restaurant on yelp. I ordered the lasagne with garlic bread. It came with a salad, I loved it. I ordered it at 9:30pm and was satisfied and sleepy by 10:30. My lasagne was delicious, my salad was fresh and my garlic bread was wonderful.  great job Familia.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTo7mLiCasJ5TAmWpIpqeg"
  },
  "VOOzbSayP3hodjPg7nWLWQ": {
    "date": "7/19/2012",
    "text": "We've ordered from Familia about 6 times now. Unfortunately, they're a bit hit or miss. The last 2 times, the pizza has been too salty; even one of my friends whom I recommended familia to said that she thought it was salty. Secondly, the last two orders, the pizza has been ridiculously soggy, even after I ordered it well-done in efforts to maintain a crispy crust. We typically order around what would be considered \"rush hour\", especially on a weekend, so they may be busier than usual, but I hope that they can once again provide me the delicious, non-soggy, NY style pizza I've come to love.   By the way, I love their pizza & fingers deal (we get 2 toppings on our pizza and it comes out to $22 after tax). We usually get sauce on the side because the fingers can get soggy (incase you can't tell by my review, we are anti-soggy food people), and they do it no problem. Their ranch is delicious, perfect for fingers & crust alike. I'd love to update my review when they become more consistent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "EKEtbkIswDNQqxcy8vy8Kw"
  },
  "98rvKkw8PEbP2UNaATFlmA": {
    "date": "10/6/2015",
    "text": "I ordered the wife, the cheese was mozzarella but the texture seemed to be like a ricotta feel. It was still good, I have to say the crust is definitely on point. I probably could eat it just as is no dip or anything. You know most crust are the least favorite on a pizza, but this is just the opposite. I will be going here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fMpCMnongqONAFCPliDOAw"
  },
  "XuP9T7cuVG8yGTwVUwt1dw": {
    "date": "6/18/2012",
    "text": "I wouldn't be surprised of one day they just said \"Hey Tristan\". It's ridiculous how much time I spend in this place. I love pizza. I still think it should be a food group. I'm so lucky to live in their delivery zone. The best NY pizza I've had in Vegas...since I moved from NY. I've probably had half of their damn menu, even the salads (went thru this gotta get fit phase. Failed miserably).   Buffalo Wings? Delicious Fav topping? Meatball  What really takes the cake tho?? That Meatball Parm sandwich??? Should be a crime for anything to taste that good. Trust me, I'm fat. It's delicious. When I leave this town, I'll miss this place the most. Lol.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "Cwkkowhq9MZue1Xyk57BMg"
  },
  "ukvZ7lW5FEC5DqtrNBa62w": {
    "date": "11/12/2016",
    "text": "Fast fresh hit pick up in clean busy place.  Nice staff.  Delicious pizza. Glad we tried this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYPSR56c7C1aPh_zGD_DJA"
  },
  "h_myW5f0I8taA6fmodoVtw": {
    "date": "7/1/2014",
    "text": "I've ordered the specials from here a handful of times. The first time I ordered here, I liked the pizza and the wings were so meaty and cooked perfectly. However, the last two times, I was disappointed in the pizza. Also, ordered the chicken fingers and they were hard and overcooked. Sadly, the ranch dressing was the best part.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "TS4RfxKny-c8QYcnMpfkiQ"
  },
  "hU-kEHXkcisZnXC7HQgRcA": {
    "date": "7/15/2015",
    "text": "The cook time was quick, the pizza was delicious! There was a perfect amount of ingredients on top of the pizza as well! When I went to pick up my order the customer service was great! I will definitely have to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xcdT5GxG7oGEWEBH4uM-Cw"
  },
  "psDhXyfmpHUof9Dx4YDz0w": {
    "date": "6/15/2012",
    "text": "Nothing special.  I don't get all the extremely glowing reviews.   I found this \"NY\" pizza to be barely edible; I didn't even finish the whole pie. The crust was dry and bready. The toppings were ok but undermined by the hard, tasteless crust.  I still haven't found a better NY pizza than Sicili on Twain, which is 10 times better than Familia, not to mention less expensive.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "yi_4YTVS6XL7s5atKPbmpA"
  },
  "G94moWusw4ForkbgRXuxnQ": {
    "date": "6/25/2010",
    "text": "Heard about this place from the Vegas Talk board and decided to try it today for lunch.  I ordered 1 Slice of Cheese, 1 Slice of Pepperoni, and 1 Slice of Sicilian Cheese.  All three came out hot and fresh.  NY Style Cheese - This was the best of the 3 slices.  The crust was cooked perfectly and the Cheese & Sauce proportions were perfect.  NY Style Pepperoni - I thought the Pepperoni was undercooked for my tastes....I like it slightly burnt.  It was very oily and was beginning to get soggy.  I wouldn't recommend for delivery.  Flavor was good, not great but good.  Sicilian Cheese - The crust was a little dry for my tastes.  The edges of the crust were very hard due to the overall dryness of the dough.  It was my least favorite out of the three.  The menu had other Italian dishes that looked interesting, the Pizzaghetti Sandwich looks very enticing.  Overall, the Pizza was pretty good, but nowhere near as good as the competitor that was mentioned in the talk board.  This is where I wish there was a 1/2 Star rating system as I would give this place 3.5 Stars.  The NY Style Cheese was a 4 Star in my book, but the other 2 were 3 Stars.  Will I return?  It's in Egypt from where I live, but I might make another trip to try the Pizzaghetti Sandwich.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zOyqoUMH7KHe4dZVmifWFw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zOyqoUMH7KHe4dZVmifWFw/o.jpg"
      },
      {
        "img_id": "wY32oq6iEbx-lvKgOSI45g",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wY32oq6iEbx-lvKgOSI45g/o.jpg"
      },
      {
        "img_id": "oPJBGRNClK-R_ViABJbqmw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oPJBGRNClK-R_ViABJbqmw/o.jpg"
      }
    ],
    "user_id": "QJI9OSEn6ujRCtrX06vs1w"
  },
  "7a95JG6YFEp9ebWQwslR2Q": {
    "date": "8/10/2012",
    "text": "Been all around the town for pizza, Villa used to be our favorite but this place ROCKS!  Me an my son are picky pizza eaters - the crust stays crispy, the cheese is high quality, and the service is quick.    Good things come in small packages, small joint with dee lish pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1Kxd26Vw-W8vUN6fvbRbQ"
  },
  "qgdGfnuAks8PYBwKL4mG2A": {
    "date": "12/3/2015",
    "text": "Nice pizza place near Fort Apache and Warm Springs.  The Stromboli is my favorite.  It is ways fresh and delicious!!!!!!  They also have good pizzeria style thin crust pizzas and gluten free pizza if you like that.  The antipasti salad is also fantastic.  They have been there for a long time and the good food is why!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uL0-qCTIi21KWQPZZCzmzQ"
  },
  "YPQzX_9gC3M-XOTpGjN0ZQ": {
    "date": "3/3/2013",
    "text": "I had my first margarita pizza in Rome, Italy. I have tried many margarita imitations in Vegas. This place makes the BEST MARGARITA PIZZA. And it taste just like how they make it in Italy. The familia house pie is also amazingly delicious too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T5CuHTT1OTreYShM0J7Y0Q"
  },
  "_YC0Ad0PUl1mRS5aJuiY9Q": {
    "date": "5/27/2010",
    "text": "I love! Delivery once and pick-up once.  I'm born and raised in NY and have become bi-coastal and pregnant (!!!) in the past few months.  I lived in Vegas for less than two years in the past, and I am sorry to say, the food in Las Vegas (unless we're talking about cheap Vietnamese, Thai, Filipino, self-serve froyo, and kind of pricey Middle Eastern) has always depressed me.  No Jewish or Italian delis, no diners, no good Greek, no one has heard of a bialy, no good Indian, no gastropubs, no French (off-strip, that is), and no pizza!  Until now, that is...  This place was a google hit.. no joke.  Best google hit ever, that is!  It was about 10 and my little sister was starving and tired of shit local sushi.  Now, the names kind of tickle me, but whatever... we ordered a Mamma Mia-thin crust pie with tomato slices, garlic, olive oil, and mozza, a veal parm sub, and a cannoli.  Delivery time was less than 35 min... The kid on the phone was the sweetest thing ever, and he may have been the one to deliver, if not, he was just as sweet, like 16-18 y/o's.  Pie was the best pie I've had in LV, reminded me of home, I was so happy to be stuffing my preggo led zep self with a familiar thin pie with not too much cheese and a yummy bottom char... an NYC/New Haven, CT hybrid pie.  Sub was good, cannoli, ehhhh... I'm not a big cinnamon fan, but the shell was really crisp for closing time, so it was still good to me.  Second time around, pick-up was a breeze.  They're located in a totally unassuming strip mall.  They're so sweet in there, it's so nice to have your ass kissed, lol.  This time, Mamma Mia and the Margherita with some garlic... Margherita was a little bland, but still a really good pie.  I see that they've gotten some less than favorable reviews.. I can't speak for getting any kind of produce or meat on my pie, as I really don't eat anything other than tomatoes, garlic, cheese and oil on a pie, but if they use canned mushrooms, then that does suck.  If you're iso any of the things I have tried, go for it, you won't be disappointed!  Oh, and pizza by the slice!  Another east coast thing that just made me smile.  R",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FM-RcaTENaXVBTLqYBw5SQ"
  },
  "_3cRVZ5gP3HWUPs03qUfwA": {
    "date": "7/20/2015",
    "text": "This is one of the worst pizzas I've ever tasted! For starters the guy that answered the phone was rude, I should've known then. The only plus is that the pizza arrived in good time. The pizza was HORRIBLE about a pound of oil on it I had to take for paper towels to get some of the oil off. On top of that it was salty and the pepperoni tastes fake. We also ordered spaghetti it didn't have enough sauce we had to add some of our own. The plus to the spaghetti was the meat balls were good. Last but not least we had a side of garlic bread that was cold and Tate's horrible. I just moved here from California and I was looking forward to finding a good pizza place that myself, and my family would love; this will NOT be the place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HirA62oUo3mIf6LLlhVYDw"
  },
  "4Gm7updz_8OyIXSLRoAs5Q": {
    "date": "7/16/2015",
    "text": "I order a special combo that had 2 16\" 1 topping 20 wings and a 2liter soda I was at the Westgate casino they came quick pizza  was hot and so good my family said we will order again the future keep it up",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "feXLy1RIVqb_3n0S4qzDdA"
  },
  "hyiSYEAQDnQZIDukaGXT9A": {
    "date": "7/16/2015",
    "text": "Pizza is as good as you can hope for, which is still pretty good, second only to Grimaldi's and Pizza Rock that I've had so far. Def way better than Pizza Hut or any chain pizza.  If you get the 19.99 special, 1 lg tray of pizza and either 12 wings or 5 fingers, get chicken fingers instead of the wings. The chicken fingers are HUGE and meaty with no cartilage or giblets at all. They are tasty and awesome! I've eaten nothing but chicken tenders (I am as close a chicken tender/nugget connoisseur as you can get) all my life and I'd put these in my top 20. They actually are comparable to raising canes' tenders. These are meatier and thicker than Canes, just not as flavorful, but sauce can make up for that.  Their pizza is decent NY style pizza. I recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "feX4HQ9YmRgd0Y-4oqvh8A"
  },
  "h9b5zpl5XWIKPnTFsBLfCw": {
    "date": "4/18/2015",
    "text": "The best NY style pizza this side of the strip! Nice little Italian style restaurant in the southwest of Vegas with awesome pizza, lasagna, Stromboli and more! Reasonably priced with delicious flavored dishes. If your in the area, definitely give them a shot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XRRtCnUqa3L4oVFNLiswQ"
  },
  "GPUgL-3g83eXHwsv9a2s7w": {
    "date": "9/17/2015",
    "text": "My family and I eat  at this place alot  it was probably one of the first places we tried since moving from New York  and we love it and we also love the fact that they have good specials it's a cute little neighborhood spot.   Pizza is very good.  Close to home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3P22ft7DcKaYy_F07FmVGQ"
  },
  "5Wdhp0avCMuVuUoXtHE6cw": {
    "date": "6/26/2016",
    "text": "Definitely one of the best pizza places in Vegas!!! Our pizza is always cooked perfect and never soggy! Also we order wings well done with sauce on the side and they are soooooo yummy!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KneAzUb1DhCObKEWklgYlg"
  },
  "NaAIRorIyLbrHYC37lSRLw": {
    "date": "10/29/2014",
    "text": "I ordered food for delivery last week when I was dog sitting in the area. I got 1 small BBQ chicken pizza, 1 small meat lovers pizza, 12 teriyaki wings, and 1 large order of fries well done. Total came to about $45. Quoted 40 mins for delivery, food arrived right on time. The BBQ chicken pizza left something to be desired. It was a pizza, with BBQ sauce, and cut up chicken fingers, that's it. No onions, no cilantro, no flavor! The meat pizza was OK, the fries were soggy even though I ordered them well done, and the wings were, well, wings! The food wasn't bad but there was nothing memorable about it either.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYcCYNWs8Ul6ewG5kCYW4Q"
  },
  "wEYASsNRL1Wje560ESkiHQ": {
    "date": "9/10/2018",
    "text": "Delicious NY style pizza. Not sure why it took me so long to find this place but glad I did.   Ordered 3 slices of cheese pizza and a side salad. Asked them to cook it a little extra because I like my pizza crispy. They did and too perfect. Crust was good, sauce was tasty, and just the right amount of cheese.   Good side salad also. You get 2 slices of cheese pizza and a drink for just $4.99. Great prices and friendly staff. Will definitely be coming back many times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E6iHuccxghB8WxZt0mCZxw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E6iHuccxghB8WxZt0mCZxw/o.jpg"
      }
    ],
    "user_id": "zz9rIM0FmlWYvAzr6dGwVQ"
  },
  "-HBTu9Gd1zZZUrQUg1uZ7w": {
    "date": "1/11/2019",
    "text": "Awesome store. Awesome pizza. New York style. The best pizza I have had in a long time. And the wings are amazing too. I would eat here every day if I could. Highly recommend this place to any one who likes good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2lY2VpihmkFNRCLsEgktRg"
  },
  "hA4ewgobOdT5rEZAMQVHvg": {
    "date": "9/14/2018",
    "text": "First things first if you're a little low on money this is a great place where to eat good pizza and chicken wings.  But well when it's cheap don't expect everything to be a \"buck by a buck\". I had a decent meal despite the money I spend .  Pros Good food Cheap Fast  Cons Well their service sucks they didn't provide us fork & knife.  Their hallways is messy  Their tables is not well kept clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mNqKk5GJUKTB77EHz2K2eg"
  },
  "wGH7HZ9kbmXgceZvb8-KKA": {
    "date": "5/18/2019",
    "text": "Great service and ABSOLUTELY the BEST PIZZA IN VEGAS. Staff is awesome. You will NOT be disappointed. The other food is great as well if you aren't wanting pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGKVwyWuZ6-mmj-kLsFiew"
  },
  "o3z_QKJNQBIxiFvl7tPvcQ": {
    "date": "5/8/2019",
    "text": "I've just recently found Familia, and it's definitely the greatest pizza restaurant in the area that I've found. I've tried a couple different pizzas, but my favorite is now the Mac n cheese pizza! Who would have thought. Haha it was amazing, as crazy as it sounds. Definitely try Familia out if you're like me, and hate papa johns and all those typical spots. The employees and owners are also very helpful and nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrsDXRHriCjvnoi13JIV0g"
  },
  "ngvdEiDZ7NC-opWqqbsWlA": {
    "date": "2/26/2018",
    "text": "We had some friends over who requested \"no chain pizza\".  After consulting Yelp and finding Familia, we placed an order for two large pizzas.  They arrived lightning fast and were the hit of the party.  The thin crust was exceptionally good.   Since then, I've ordered delivery several times and every single item has been delicious.  The deliveries are always quick and friendly.  They are packed well and there has never been an error or packaging mishap.  The entrees, soups, and sandwiches are very good.  I love the Italian Wedding soup and the chicken alfredo.  The lasagna is a winner too.   I'd definitely recommend giving this local owned business a shot.  The quality and service were a great surprise and we wished we had tried them sooner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TFfFBvt2GM7uj3LmLie_7w"
  },
  "6VQaRJs78ZWw0j59wuE2bg": {
    "date": "6/11/2018",
    "text": "I tried coming here with my family and was greeted by this sign on the door.   Not sure what exactly is going on but it looks a mess inside.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S7C4YQWHJG_Os-G5f_k7sA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S7C4YQWHJG_Os-G5f_k7sA/o.jpg"
      }
    ],
    "user_id": "uwRd0buZlfjPWbmNK7kGhQ"
  },
  "cIBIzItUVw0oslYgEVUGGw": {
    "date": "1/4/2019",
    "text": "Got 3 slices of pizza. They all turned out good and not too expensive either. Guy on the phone and at pickup was friendly and food was ready on time. Will be returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9qaJPwTOLw0Im-xntRgiww"
  },
  "tYlin-BAU2-Z8ZEn9a2-Mw": {
    "date": "3/9/2019",
    "text": "We have ordered from here a few times and the pizza is pretty tasty, also the Stromboli and philly steak are on point. They make a to die for cannoli as well. Only negative review is that every time we call we have to wait like legit 5 mins on hold...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WT8B8157L9-3--BjSiGRVg"
  },
  "Oyb92Q-IUjGtLPvMzwkfIg": {
    "date": "3/8/2019",
    "text": "Very upsetting! I order from Familia Pizzeria ALL THE TIME-- picked up pizza for me and my guests tonight and one of my guests found a long piece of light hair in a slice of pizza! I was so embarrassed. Called pizzeria right away to inform them and their response to me was \"we don't have anyone working here with blonde hair\"... wow! Not one of us has light hair either and it was inside the pizza. Later says \"I don't know what to tell you\"... So disappointed. Just lost a couple frequent customers...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azDFcwiV0yhae5G-ab_9Rg"
  },
  "DzakJxvPWB2Ld_6zE3HYrw": {
    "date": "5/29/2018",
    "text": "This place has been one of our go to spots for nearly 10 years. My wife lived in the southwest area when we first started dating and back then, this was miles above the rest. Now, there's comparable places and we also love Grimaldi's! After having authentic NYC pizza many times, I would say this is a pretty good attempt but doesn't bring you all the way back. It's thin, floppy and very fresh. They also deliver which is awesome!  Our usual go to pizzas are the meat lovers and guests seem to really like the bacon chicken ranch pizza. We haven't been able to try anything other than their pies, but we'll be continually ordering from familia. We ordered a couple pies during the Stanley cup finals game 1 and western conference nba finals game 7 and the wait was 75 minutes! Good on them though, because they said it would take 75 minutes and like clockwork, they were here in 75 minutes.   If you need some pizza delivery, don't hesitate and you'll be extremely happy you chose this over any chain.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UsK-DNdFlw-TEzcdkVcgA"
  },
  "UZmFLP6jlTCGYA8tLIHcew": {
    "date": "1/12/2019",
    "text": "The food was just okay. The mozzarella sticks sucked. My sister's baked ziti was baked penne. But it was good. Felt sick after eating my eggplant Parmesan. They forgot my 2 litre which I payed $3 for. I don't know...just not worth it to order from them again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "024QyZSicd9V5-9pVPyXLA"
  },
  "tPYX11n1Iig-wwnCxNNv7Q": {
    "date": "2/16/2019",
    "text": "This is dangerous... I literally live less than a mile away from this place and it's seriously the best pizza I've had in Vegas!!! How did I just find out about it now?? Even their fries are amazing! The small is HUGE! And when they say the large is like a whole meal for 2, they weren't kidding. Very affordable prices and really good food! Goodbye Pizza Hut, papa john's and dominos! Everything here is good! So if you're in the area or want good pizza, try this out! You won't regret it. My husband and I ordered 2 nights in a row already",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q9bAPLeBxNSQ2tlycmOEnQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q9bAPLeBxNSQ2tlycmOEnQ/o.jpg"
      },
      {
        "img_id": "e8YXZVLmqc2lDw-ZJbTR9A",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e8YXZVLmqc2lDw-ZJbTR9A/o.jpg"
      },
      {
        "img_id": "rpfN-x97SZ7_LOAfEJS0vg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rpfN-x97SZ7_LOAfEJS0vg/o.jpg"
      }
    ],
    "user_id": "wsrxm02UVfqiAA-O_rv01Q"
  },
  "H3OYWPdvC86X8F8VHDhXHQ": {
    "date": "2/9/2019",
    "text": "This is my new favorite pizza place, the crust is thin and crispy if that's how you like it this is the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTO1WwnotneNB7EEahZplA"
  },
  "O0xtjjlGrnhZLxjLJ4RjTg": {
    "date": "8/3/2018",
    "text": "Great pizza! It's the only pizza my son will eat. He is very picky eater. The sauce is flavorful, good quality cheese and great crust. This is our go to pizzeria.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NBgKXSXLbICPzflkJDfKNw"
  },
  "6b5gn-oJu3KhgWTB18ofpA": {
    "date": "10/21/2017",
    "text": "DUDE! I have lived in Vegas for almost three years and couldn't find a good east coast pizza until I found Familia Pizzeria. Hellz yeah!  Familia pizza makes a kick ass pepperoni pizza. They cook with a gas oven which makes for a consistent cook. The sauce is delicious and the pepperoni is perfectly sliced.The crust is just like home too! (I'm from the east coast)  I would have given this place five stars, but the staff was a little rude, which honestly, is fine with me because thats what I'm used to from an east coast pizza shop.   If you live in Southwest Vegas, don't go anywhere else but Familia. It's a small shop tucked behind Bohas restaurant. You can dine in or take out. Either way, you'll be pleasantly surprised.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XbH0p_szGwUhHDW2w8y3Xg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XbH0p_szGwUhHDW2w8y3Xg/o.jpg"
      }
    ],
    "user_id": "ssOoXFDC4ObeQKF2TvHNCw"
  },
  "2LkSQC_TXWBaNJHBg3ildA": {
    "date": "12/5/2017",
    "text": "Man with an Italian-ish accent picked up the phone so that already had me hyped. Ordered a personal size with mushrooms, onions, and garlic so my breath was gonna be kickin'. Toppings were incredibly fresh, crust was nice and crusty, and the CHEESE PULL was insane!! I wish I caught it on video but was too impatient and ate the pizza in about 5 minutes.  One knock was that the pizza wasn't as thin as I normally like my NY styles but I think that had to do with me ordering a personal size making it more condensed. It didn't matter too much to me in the end since the pizza overall kinda blew my mind. Would definitely return. Woo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qdYzw5odxCEN6SELVkRmcA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qdYzw5odxCEN6SELVkRmcA/o.jpg"
      }
    ],
    "user_id": "PygrfoaY-0u7uE3Ojy9h0Q"
  },
  "srHSPCcH5JjOC2u19z28yw": {
    "date": "3/28/2018",
    "text": "Having family from back east, and eating pizza back east, I'm always on the lookout for great pizza. First, any \"real\" NY style pizza place will always blow away that fast food crap pizza. That's a given. The problem though, is most of these NY pizza places are just clones of one another.  Don't get me wrong, the pizza here was pretty good. Comparable to most local NY style places, and 100x better than fast food pizza. However it didn't stand above the rest. I ordered a large pepperoni pizza and an order of chicken fingers based off of another Yelpers review. The pizza was great, however I wasn't a fan of the cross cut pepperoni. No this is going to sound weird, but the chicken fingers were too large for my liking. It was almost like breaded chicken breasts instead of manageable chicken strips or \"fingers\". Most people will say \"but thats a better value dummy!\" Sure, you probably get more chicken for the money, but the are supposed to be chicken fingers, not deep fried chicken breasts. The taste was good, the spice was good. Breading was a little soggy, possibly due to the massive chicken chunks.  In the end if you live close to this location GO THERE! Especially if you are thinking about fast food pizza. This place is much better. However if you don't live close to them, chances are you can find a closer NY style pizza place nearby.  I'm still I search of the most authentic NY style pizza place in LV. I think I found one, but way to far to drive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gij38wU44AZtOq8AXSeKaQ"
  },
  "14nNkSvhrkxDwKerUAWpHg": {
    "date": "11/8/2018",
    "text": "I live right by this pizza joint and i love the pizza here. When your done waisting your time with all those chain company pizza places, you come here. The pizza here tastes authentic, and ive been to italy! A large fills up about 4 people, so its great if you have a group. They also have many different items such as chicken parmesan which is fantastic! I highly recommend this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-GI_JnBjhAduS6pjHdfVA"
  },
  "I_iXLyxsUBO-_bE7Xt5K7g": {
    "date": "10/14/2018",
    "text": "I have always enjoyed this pizza joint. But recently I got a order of chicken fingers and got bubble guts all night. So not sure if it was dirty grease or the watered down ranch dressing. But boy it was uncomfortable..!!! Hopefully it doesn't happen again or else it's diaper night or sleep in the bathtub. Thank you Charmin.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-FfJyEz16ZgMOJ3bFGDgeg"
  },
  "JU2EQJAcT8tFa957VK70DA": {
    "date": "2/14/2015",
    "text": "Worst customer service I have ever experienced!! If i could give them a negative 5 stars I would!  I ordered a gluten free pizza with eggplant and when it arrived, the eggplant was breaded.  I called to explain that I have a gluten sensitivity and cannot eat the breaded eggplant which is why I was ordering a gluten free pizza.  Duh!.  When I ordered the gluten free crust, no one told me the eggplant was breaded and it does not state that it is breaded on the menu.  The manger Hawkins told me there was nothing he could do for me.  He refused to refund our money or remake the pizza.  I asked to speak to the owner and he refused to let me speak to the owner or even tell me his name.  I was in total disbelief and completely shocked by their lack of customer service.  My husband called back a few minutes later and spoke to someone else.  He asked for a refund which they would not provide but stated they would now remake the pizza.  My husband decided to not eat his pizza and wait until my new pizza arrived so we could eat together.  They NEVER delivered my new pizza, they simply did not show up.  We live literally 1 mile from their store and waited over 1 hour.  We called back to ask for a refund again and they were closed for the night.  Are you serious??  I will NEVER eat at this place ever again!!  Hawkins should be fired and the owner should learn how to treat customers.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kYHuzdSWatEfXVhGdw7GCw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Online menu where it does not state the eggplant is breaded.  They would not refund my $ or remake my gluten free pizza!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kYHuzdSWatEfXVhGdw7GCw/o.jpg"
      }
    ],
    "user_id": "WnmIG3Afbd2XH8yw7xJvAA"
  },
  "dm9E1tYjFI_QPPoeyb8STg": {
    "date": "1/25/2013",
    "text": "I started to write a 4-star review on this place and thinking about the food made me hungry, especially seeing that they offer pizza by the slice,so for the first time I drove down there (I have only used their delivery service) and decided pick up lunch.  My first impression was the place is incredibly clean.  I would trust them with my food based on this alone.  The staff was very friendly, quick, professional.  I was amazed by the enormous menu.  This is not a pizza joint; much more a restaurant.  I sat gazing at all of the choices on their menu for the entire time I was waiting for my order and will probably be calling them for dinner.  It does not seem that their online menu does justice to all of the options they offer.  The pizza is always stellar, the baked ziti flavorful and .... screw the adjectives... its just good.  I would recommend this to anyone.  Hands down it is the best pizza establishment in my area.  I would probably even call these guys over Rosati's if they were still around here.  It is nice seeing a family run business with good food and friendly staff.  I would give them my business for that reason alone.... it is a huge bonus that the food is phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "dM2Pvd9v-hewm3oZpLczNw"
  },
  "bjPkCAhqS8Kn8HepGP_c8g": {
    "date": "2/23/2017",
    "text": "Best local pizza place I've tried in Las Vegas so far.  The sauce is delicious!  The pizza is really good, but the stromboli is even better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fyQe6CftQPavWJI17Mlv8A"
  },
  "tVPqoeFytkWQetNoomfMOw": {
    "date": "4/30/2016",
    "text": "One of, if not the best pizzas I've had here in Vegas.  Got the Sicilian and was definitely impressed.  I will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Q4HGzcXSCeiqvmY2mg-aQ"
  },
  "tvQbpq26n6C7j-qvN_bkJg": {
    "date": "7/23/2013",
    "text": "From Western New York and really don't like pizza out west. Was crazing pizza and wings and decided to try this place out. It was awesome!!!!!! My new favorite!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K7WUWe1pqU5u-kjPhXYEcw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K7WUWe1pqU5u-kjPhXYEcw/o.jpg"
      },
      {
        "img_id": "j91fITabbXonTcDM4QjXXw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j91fITabbXonTcDM4QjXXw/o.jpg"
      }
    ],
    "user_id": "J-hCmHTQO0PWtsBxWmdqHQ"
  },
  "QOjGTGQSMOtTk_K2ik326w": {
    "date": "1/9/2011",
    "text": "I just got home from NY. Of course I had to try a slice of real NY pizza while I was there!! I must say, pretty tasty!!   So as soon as I signed up to yelp, I HAD to find an authentic, real deal pizza place... With only a couple minutes away, Familia Pizzeria had such awesome reviews! What sold me what the native New Yorker who gave this place a plus.   I ordered a \"Large NY style pizza\" within 35 minutes it was at my house! Smelled sooo good. Just like any pizza does when you first get it. All I kept thinking was \"wow this is gonna be great.... I've been craving pizza!\" Well I would say it was what I imagined what it would be, but the cheese just didn't do it for me. Hoping that I was going to get lucky and find legit NY style pizza, but instead I got a \"nothing to brag about\" pie.   Since the service was great over the phone and I only tried the pizza, I will be ordering other things from the menu, gotta try more than one thing!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "siECXHEIV60ShhvZoYWqgg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. My first NY style pizza. Had to see for myself what reviews said were so NY authentic!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/siECXHEIV60ShhvZoYWqgg/o.jpg"
      }
    ],
    "user_id": "hlVWGy_t796fbk_iETH5kA"
  },
  "gzEmZfYbBz6BPwaY1a2rxg": {
    "date": "2/5/2017",
    "text": "Used to be really good! But the owners seemed to have sold the place and the quality has fallen off considerably. Really sad as it was the best pie in the area for sure...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJgz79TsBkMxayng9_bGsg"
  },
  "RkDiLgcYjryPRXk5eCTUmg": {
    "date": "9/18/2013",
    "text": "Reviews were great for this place so we ordered on a Friday night....pizza was ok...no flavor really. Chicken finger and garlic fries were good. Nothing special...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gLAjpSE6Cw092SGqZliNg"
  },
  "nk35xx0LVq_jdZ8xdZbhcQ": {
    "date": "3/10/2015",
    "text": "I got pick up the other week and arrived when they said it would be ready. It wasn't ready yet had to wait like 5-10 min which isn't a big deal. The pizza however was horrible it looked like someone poured extra grease on it. The biggest problem- the crust in the middle of the pizza (about half the slice) was soggy to the point where everything fell off it when trying to grab the slice which was pretty much impossible to do. My wife ate about half a slice and I forced 2 down-after soaking up grease with paper towels-trying not to waste it but ended up having to throw away 75% of the pizza. I was very disappointed after reading all the great reviews. Maybe it was an off night for them. It definitely wasn't busy inside (in fact it was empty). Either way we aren't getting it again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EO0U-uHwXK1zsiuhtiaXVw"
  },
  "KXCPrLhYs7jhj8PszWIFVQ": {
    "date": "9/25/2012",
    "text": "A slice of pie and a drink for less than $3.50? WOW! The pizza was excellent, the gents working the dough were very nice and professional, and they have a large menu of all sorts of Italian food. Ill definitely be back!  Note, fried cheese raviolis live here... YUM!",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 12,
      "cool": 12
    },
    "photos": [],
    "user_id": "Ulu3wyEJCry7MLhAK3lsUw"
  },
  "-wuebnQ0nY2-O8Z_2POZEg": {
    "date": "10/12/2015",
    "text": "Honestly Marcos pizza is way better and for the price if much rather get what I like. It's probably better than dominos though so with that said I do like that they deliver.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cg_BJB0x-Vv4qYVqowWyLw"
  },
  "fmPAqhvHc_862MSci8SX2Q": {
    "date": "10/19/2014",
    "text": "If I could give these guys NO STAR review I would! The only reason being is the customer service is BEYOND HORRIBLE!! I called in for pick up. While talking to the chick on the phone, like most people, I asked her if they had any specials. Her exact reply rudely was \"well yea we have 6  a day\". So I asked ok what kind are they? She then said \"well what do you want!\". Um hello? I asked you what are your specials. You ask me what I want.. as if what I want will be a special. Then she sighed really loud then told me all their specials so fast I felt like I was at a dam pizza auction! So I let her finish her rambling and told her no thank you. Needless to say she mad me so upset. All I asked for was if you had any specials and what were they. Didn't realize it was so much trouble to ask. I'll never be ordering from them ever!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "2YIHEy1hlnYnHcJx8rooAQ"
  },
  "DI1J-VuXCFTu9dAfuMvvOg": {
    "date": "10/8/2015",
    "text": "I am not a huge fan of NY pizza but this place is soooo good. Super excited on trying this out and definitely will be back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TYN1lMrQDI1s8Ej9j1FnSA"
  },
  "Ucui42GMbKSeoKUVXtYqRA": {
    "date": "5/10/2015",
    "text": "We were yelping for some close pizza places since we just moved to the westside and are not that familiar with everything durango and onward yet. I would have usually just orderd roccos but wanted to find something closer.  Thank god we found this place. We found a deal on their site for 1 large 1 topping, garlic knots, and 2 liter soda for 21.99. Awesome. Then placed the order and was told at least a 45 min wait for it to be ready for delivery. It got here in LESS than 30 min. And damn this did not disappoint. One of my favorite parts of it all is that the pepperoni doesnt have the generic pizza hut processed and get dry in 10 min aspect to it but instead has the authentic deli pepperoni taste and awesome and fresh flavors. Can't wait till the next fight night for our next order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "7MDGYbmT66en9_TjNxyYDQ"
  },
  "gosWELT4uf2j3crn8BqLUw": {
    "date": "8/4/2015",
    "text": "Fair prices, good service,  and classic delicious pizza. If you are looking for weird fancy healthy pizza, this is not the spot. If you are looking for delicious pepperoni pizza, you have found the right place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5Raewi1iYCr2fF6gEciw"
  },
  "U6VI7gh8lB3BvswFodYlxw": {
    "date": "11/9/2012",
    "text": "Tried Familia this past Wednesday due to the great reviews I've seen about them on Yelp.  Very good East coast style food.  Being from Philadelphia, it's good to know there is a place to get strombolii, antipasto, pizza etc in our neighborhood.  Very extensive menu and friendly, helpful employees.  The only thing I would like to see is a bigger seating area for eating-in.  That's probably not practical given the limited area in the shopping center they are located in, but other than that, this place is very good.  If they keep doing things the right way, maybe they can expand to bigger property someday.  We will definately be trying their food again, the White pizzas looked good, (I had the stromboli, which is a very good size. so there was no room left to try it this time).  If we don't eat-in next time, we will definately take advantage of their delivery.  I would certainly recommend Familia Pizzeria to others....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "U-05lj3UvME4JQ6mQ1rREA"
  },
  "Pbl-tKMPsltmBMTv8v-Gxg": {
    "date": "10/30/2015",
    "text": "The pizza was so greasy that when I grabbed it the grease would run down my hands. I prefer my pizza less greasy so that I can enjoy the flavored",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kn6sTL7bZSdWqrDbFekZGQ"
  },
  "Kvjg2y0MLSAkVckEBj7-CA": {
    "date": "7/22/2015",
    "text": "The spaghetti and pizza here are really good! I recently discovered this place and have gotten food from there four times. The service is fast and the employees are nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7IVrhHuaPFMoxQ75dTdzCg"
  },
  "vgRxsICFIbygF0PagutO1w": {
    "date": "1/19/2015",
    "text": "We always get the pepperoni pizza with wings special for about $20.  Even though I have never ventured past these 2 items, I've eaten here enough to know that their food is always consistent. When I'm craving for this type of pizza (vs. a thin crust), the crispy yet chewy dough and the super cheesy pie just hits the spot. Their slices are usually pretty substantial so 2 slices is enough to get your belly full. The wings are really impressive as well for such a little eatery. They give a pretty good size order of wings and it come freshly fried and slightly crisp. I hate when wings get fried in advance and just some lukewarm sauce is thrown in when you order. Makes for some dry and unappetizing wings. Their buffalo sauce is pretty good as well. I can appreciate the way they pack the wings when ordering to go. We never finish the portion in one go, so it's nice to be able to pop the whole container (sans plastic lid) in the toaster oven and have some yummy leftovers.  Try their lunch special. 2 slices of pizza and a drink for about $5. You wont be dissapointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tw3_-eahwaTZJjEsos1gpg"
  },
  "EsWy1wP4BznTnDTkqyEgqg": {
    "date": "7/5/2015",
    "text": "Delicious! Been looking for a new pizza place that isn't your typical thick crust. This place was nice on the phone, their prices are great and they got here in under 45 mins! I will definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G917VZT12pVqinRFdNpFlA"
  },
  "13LzCwMrydBLAVzPdZn7Uw": {
    "date": "9/23/2019",
    "text": "It took 10 years but I finally found it!  Moving here from New Jersey and Boston, I know great pizza.  Not over-priced gourmet pizza.  Just normal, Sunday night, cheese pie.  Yes, on the East Coast, they're pies!  After 10 years in Vegas, I finally found it!  The crust is nicely browned on the bottom but the top still has the chewy bite to it.  Sauce is plentiful, but not over-sauced.  Cheese stretches when you cut or bite into it.    The mushroom pizza is fresh mushrooms, not canned, cooked then put on the pizza so it does not create a saucy, watery mess.  Price is right for the size and even better when there is a special.     I love this place and can't say enough about it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5XxElS_QM90f7t3ap9vsag"
  },
  "vxKvb7Fia-QKVMlKE53i9w": {
    "date": "9/5/2019",
    "text": "Well isn't this place a little gem! We had some family come into town and instead of working hard in the kitchen I just decided to order a couple pizzas! ( I mean what else do you do when your feeling lazy ) We ordered a 16inch with half sausage and the other half Olives, peppers and garlic. And the other pizza for my Aunt who likes Gluten free so we did a Gluten free Margarita pizza. Also topped it off with zucchini.  The 16inch was super delicious. It saved me from my Hangry kids losing there stuff anymore then they were already  Overall everything was delicious and we will be back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgopHBWdIgcRdVtymwq3NA"
  },
  "_N8IgXJWw2EDBQhtLOZIKQ": {
    "date": "3/31/2019",
    "text": "It's our favorite pizza place because they are very customer service oriented and the ingredients are fresh and tasty.  Plus they have great desserts. We are there at least once a week....  I get the personal size vegetable pie with extra garlic and well done. We usually save some for later and reheat in a cast iron pan which tastes great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IX8mam81dgMmRS9TZWRLyQ"
  },
  "s1jL9PKM23sBG7IV5C13Aw": {
    "date": "9/11/2019",
    "text": "Came into town visiting my brother and this place is in a strip mall basically across from Rhodes Ranch!! He was not telling a story about the wings. I did the spicy teriyaki sauce and sooo yummmy!!! Great staff. Place is small and looks to be great for pizza too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ULfxEjn-qP-HFQYhMnxSiQ"
  },
  "ctclxAnHhZx-CZziMzVyEg": {
    "date": "9/17/2019",
    "text": "My family and I love this place. They have great lunch specials and great everyday specials as well. They give you a ton of food.The lunch specials come with a slew of fries. We usually get the gyro or the meatball sub or the pizza is delicious if you like new york-style thin-crust. They've got an everyday special where you get two large pizzas for like 20 bucks and it's a good deal they're huge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YiutVyblSGa9oYyEscFPdg"
  },
  "36EQBn7GFYiv5ua_sBABBg": {
    "date": "7/13/2019",
    "text": "HOLY PIZZAS OF PIZZA found my new favorite pizza joint! It's off the chart. Pizza is cheesy and greasy, ranch is bomb, chicken fingers full of flavor I could go on and on. Can't wait to come back! I love authentic New York pizza",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "80IDhoNPXA81Tjn2bfNRcw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/80IDhoNPXA81Tjn2bfNRcw/o.jpg"
      }
    ],
    "user_id": "ERblCwVPezXbwRKgkJFT3g"
  },
  "OcdTVI6e3ZCdin7Oxtx7iQ": {
    "date": "3/16/2019",
    "text": "Been ordering takeout here for a couple of years now. Guys behind the counter are really friendly. Even when they're slammed, they do a great job of hustling and communicating your order status.   We always order online. It's extremely convenient and the website is easy to navigate. The food is always consistent. Some of the best pizza in the westside (been to Biaggios, Bambino's, Those Guys). Crust is crunchy and buttery outside and soft and chewy on the inside. They also have great specials available for online ordering. Highly recommend them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWHhNCtTULI5CwkowHT27g"
  },
  "phQnnYmgwsGak6WyeMux1g": {
    "date": "12/3/2018",
    "text": "I found out about this pizza joint from my dad it's the only place he will order from in the Southwest. Being new to the Mountains Edge area I decided to give it a shot. I would also add that finding a mailer in my mailbox with a coupon on the back for 1 large cheese pizza also helped in my decision to order from Familia Pizzeria instead of my usual place as well.   The guy that answered the phone was very nice and took his time with me. He suggested that I get my fries with old bay seasoning and they were AMAZING. Pizza was delicious and crispy not soggy. Appetizers sampler platter was just alright. The cheese sticks, zucchini and raviolis all seemed frozen and not fresh (but I expected that). Chicken wings were saucy and not dry which I love. I would also add that they were very meaty!! Ranch was a little watered down but we made it work.  I'd totally recommend this place for pizza. Oh and the mailer with the FREE large cheese pizza can be used for delivery. Ww will be ordering from this restaurant again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZtWi1WgfiiBlKmBA8VS4NQ"
  },
  "mLePR1ftIgDojzO9neYflQ": {
    "date": "10/25/2018",
    "text": "This review is for their delivery. We called around 6:21PM and ordered their family special which includes salad, chicken tenders, 18in pizza and two toppings, with these beignet looking donut holes and 1 liter of sprite. It was all under 30 dollars so that was actually pretty amazing. The delivery doesn't cost extra. However...  So they tell me its about 45 minutes. Around 7:48PM I call again and wonder if maybe the guy got lost. The guy just said they were busy and its going out now and then hung up. (I guess he was having a rough night?). I called to also confirm the address to make sure the guy doesnt get lost.   Well around 8:21PM. We finally hear a knock and WOW two hours later our food is here! yay. Mind you this place was only about 1.7miles away from the apartment.   I suppose they were super busy. However, I wish they weren't so abrasive over the phone. No one can understand someone who speaks 70mph over the phone--no matter how busy you are--. Slow down, communicate, if you were busy that's fine, I would have understood that you were busy because your pizza is delicious, but talking abrasively as if I'm a nuisance to your business does not make anyone feel good about their experience.  The food, was delicious. I would like to update my review again. Maybe when I go in for a physical visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "_UczakmbJlCal7mCXuq7og"
  },
  "glmPExRJqTTz8jDs3JrvHg": {
    "date": "8/14/2019",
    "text": "I want to like this place, I do but pizza inconsistent. Ordered Familia Special well done. Too many veges which made center of pizza watery and not hot. Chicken fingers were as good if you bought frozen at Sam's Club. 30 bucks for pizza and fingers. No bueno.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EuSjFrvdXQz2G9lgaAPnUw"
  },
  "FE7Sb20I4ShPWQvkhcyhjw": {
    "date": "8/4/2019",
    "text": "I love this pizza, my favorite in Las Vegas. Everything is always good and the staff is always super friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0t-YVLG7gEL28027mKBjeA"
  },
  "CHSbHw1qHC8FCv6lFhmPiw": {
    "date": "7/26/2019",
    "text": "Pizza is mediocre. We gave it a few tries: just cheese, grandmas pie, a few pizzas with various toppings. We are from Long Island, NY and know good pizza. The pics of their pizzas look promising but they DO NOT deliver. Also ordered penne a la vodka (my absolute favorite!): no flavor, watery bland sauce, overcooked pasta, barely no bacon (but bacon doesn't belong in this dish in the first place). This was completely not worth what we paid for it. I wish I could get my money back, that is how unhappy we are. I bothered to give the one star because delivery was fast. So disappointing!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9y1A31amq3QAVsD_62NTYw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Penne a Penne   la Vodka.. gross",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9y1A31amq3QAVsD_62NTYw/o.jpg"
      }
    ],
    "user_id": "SadH2tQh5jHut4nRlwWcsQ"
  },
  "2X0XQOB-2rmvnrfR0mxtdQ": {
    "date": "9/8/2019",
    "text": "Best marketing tool ever! We got a flier from them offering a 16\" cheese pizza FOR FREE!  No purchase necessary.  But I also ordered an appetizer sampler because i love zucchini sticks. Being new homeowners in Mountains Edge, we are  trying out a new place every week.  I'm very glad we got that flier. Everything was amazing. The crust is fresh and handmade.  They use flour rather than cornmeal to coat the dough,  super bonus score with us! The sauce was pretty good,  not sweet like alot of places. The cheese, the cheese, the cheese, omg the cheese! Real, fresh, thick cut mozzarella cooked perfectly.  The amount of food in the sampler was generous,  and included marinara for the mozz stix and ravioli and zucchini which was all amazing, hot, and juicy.  The staff was very friendly and the place was clean. It was lunch time on Sunday and they didn't seem stressed. I am very glad for the flier, as I might not have noticed this place just driving by. We will be back!! Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YLRhuGso3nlntbcamthnZg"
  },
  "sCh45bJChxZiBjDW_vowvA": {
    "date": "7/3/2019",
    "text": "This is our favorite pizza spot! Tastes just like pizza from NY. Delivery always comes in about 30-40 minutes. Had a issue with delivery once (forgot part of order) but they quickly remedied the situation and we were happy! Recommend to everyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VQTsBtiGpsqyrsbW3LcTw"
  },
  "TWfQTo1xFuNJ4_4JdDVehg": {
    "date": "12/14/2018",
    "text": "I used to live on w.34th st. in NY. There was a favorite neighborhood pizza joint of mine on the corner called Bros. Pizza. This is the closest to that authentic NY style pizza where the cheese stretches after folding it and biting into it. Sooo good! Awesome lunch deal for 2 cheese NY style slices with a drink for $4.99. Can't beat that, am so glad its close by to where I live so everytime I get a craving for it, its easy access for me lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qpv6ENrNV2lxmjNWNjnCkA"
  },
  "SQ6uIQ9huRrNDrd2DedT2A": {
    "date": "7/6/2019",
    "text": "Amazing NY style pizza. Their pizza sauce is very tasty the crust is neither too soft nor too crunchy. Their hot wings are a must and I get them with every order. Only giving 4 stars because we had 2 issues with delivery ( cold food ) but they made up for next delivery. Recommend this place to everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KEf4X0fxC_UITSiTQpHKYw"
  },
  "WgLtllVHKaqV-Gf5NDlypw": {
    "date": "7/6/2019",
    "text": "Just found out under new management about a year ago.  Thank goodness!  The pizza is not only better but it tastes just like NYC pizza and this is coming from a New Yorker.  I feel like I'm back east east right now!  Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BF8Vh0Sfl4VyzxY3AC7oLw"
  },
  "FESqEiUgZ08F6iTQK6MWvA": {
    "date": "8/19/2019",
    "text": "Being from out of town and also Italian sometimes it is hard to find local good food.  I ordered on the phone for delivery.  The young lady on the phone was very helpful and pleasant to talk to.  I gave my address and she said 30 -40 minutes.  The food arrived on time!! The delivery guy was also very nice and helped me with carrying the food.  We ordered wedding soup, eggplant parm, kids spaghetti, calzone and zeppoles.  Yum yum.  Soup was like back home the calzone was very tasty with pepperoni and mushrooms.  If there was just one thing that I would have done different is the sauce but that's because I'm used to my own homemade sauce!!  With that being said I would definitely order from Familia Pizzeria again and not hesitate to recommend them to everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAUy8Tk5QlxiRga5-fcCbg"
  },
  "SUylrguxkhcNAxKExt9UyA": {
    "date": "12/8/2018",
    "text": "Pizza here is so good!!! Their sauce is like no other and they don't skimp on the cheese and pepperoni (big slices). We have also tried the bolognese pasta and anti pasta salad and it was awesome. Portions are big and price for the food is great too. Our new neighborhood pizza/Italian go to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AN9uENVaNTBMQUuPzLZCrQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Pepperoni Sicilian pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AN9uENVaNTBMQUuPzLZCrQ/o.jpg"
      },
      {
        "img_id": "3DABjFlxW0dIUlsIkYWnNQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Antipasto Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3DABjFlxW0dIUlsIkYWnNQ/o.jpg"
      },
      {
        "img_id": "qwahE7I1ijhuIdYrNuoXMQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Bolognese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qwahE7I1ijhuIdYrNuoXMQ/o.jpg"
      }
    ],
    "user_id": "k2DDqGULlYoC59GrAxC2Aw"
  },
  "EknBhJpXNr9MUSfknrNf1g": {
    "date": "8/4/2019",
    "text": "Love this place!  Chicken wings and pizza are always a family favorite.  Delivery is on time and staff is friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "il8gB_-Gm-w0VwxkZdLxTw"
  },
  "i0bHpCIvG0zKxb-aW4fnOQ": {
    "date": "1/22/2016",
    "text": "LOVE this place ! I've been living on the southwest side of Vegas for 3years and we had tried numerous Pizza spots before but we had no luck , then we came across familia and my oh my how are luck turned around ! This pizza is absolutely delisshhhh ! The chicken fingers are great and tasty Philly cheesesteaks too !! timely delivery and very nice employees!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlOGoN84Ls-PUTCxMwPH3g"
  },
  "f2KYYUdbx1Bvw50vc6Q6aQ": {
    "date": "1/19/2016",
    "text": "Whenever we order  for delivery, we order from these guys. They are nice on the phone and delivery is within 45 minutes. It's new York-style pizza and is as good as we've had in Vegas. They also have other great food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C_DFGgxjfciqbOvlMLGTHQ"
  },
  "5O1r94WDxrsVs9QqEAa28A": {
    "date": "1/24/2015",
    "text": "Love love love their buffalo chicken pizza. Best pizza crust in town. All the pizzas we've tried have been superb. I'm not a fan of their pasta dishes, sauces are very acidic and not well balanced.   Don't forget to try the zepollis for desert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "61zbqpiFM6wy0Cw5w5SCIA"
  },
  "uE_Gh4BNGtmEdOuL0l1Z0Q": {
    "date": "5/23/2017",
    "text": "Their thin crust pizza is really good, and the cannolies are too. This is our go to pizza joint, much better than the chains.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uKGTMvlduAItImA5DCEfTg"
  },
  "rqjFGA6zEOSPuiCsqOrrCg": {
    "date": "8/10/2017",
    "text": "Very good service the pizza was amazing I'm writing this review because they really deserve it will come again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ocy4N83xc9FVDKNfyRlBfA"
  },
  "gsgNotzaj4G3QuANYMW2jQ": {
    "date": "6/26/2016",
    "text": "Any negative reviews are just wrong. Clearly a family owned business, the pizza is incredible BUT they have a HUGE menu, everything on it is great and they provide great service. This place is a weekly visit in our household and we recommend them to everyone we know. Best pizza we've ever had in Vegas. Order from them and you won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRdpm_a9H60Qo5w6FLkUDQ"
  },
  "ijjuz0yBfQN4y0pVz6sg7A": {
    "date": "1/4/2015",
    "text": "Service  Never ate in the store but delivery has always been good. The delivery time varies but always close to what was promised. Bonus: no delivery fees.  Food  The two times that we have ordered from them did not disappoint. So far we have tried pizzas, wings, and garlic knots; all of which were very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kyrv2t1d9UpYtU-Hp3OIpw"
  },
  "sNzk0BsICR4OqND1llU4lg": {
    "date": "1/8/2012",
    "text": "We've ordered delivery from this place a couple of times. Their website has a good listing of their Everyday Specials, which come highly recommended from a value standpoint. For anywhere from $20-30, you can feed yourself for SEVERAL meals or feed a group of hungry people.   Good ingredients, great prices, free delivery, consistently good service. This is a good place to order from if you're feeling fat and want to eat a ton of food! The Pizghetti sandwich and zeppoles are especially good for that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QcyEorhDESf2PsIo5oN0nA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Sicilian style pizza to-go!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QcyEorhDESf2PsIo5oN0nA/o.jpg"
      },
      {
        "img_id": "7U0fK7jTe_jhTIGx6AmjNA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Fettuccine Alfredo with grilled chicken!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7U0fK7jTe_jhTIGx6AmjNA/o.jpg"
      }
    ],
    "user_id": "67RZcwJAxtx73GQz9km5IA"
  },
  "lD89noiLxWmJK1F21ppRTQ": {
    "date": "4/1/2016",
    "text": "Ordered two large pizzas, one cheese and one 1/2 Hawaiian 1/2 pepperoni with garlic knots last night for our family and guests! Everyone from our two year old daughters to all the adults enjoyed! We will absolutely be ordering again! So happy to have found this little gem so close to home!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgAL7CCy38LTO6Pm58Os5A"
  },
  "aXniXqcChZ1PhgFOv6MHNA": {
    "date": "6/2/2016",
    "text": "My husband and I LOVE this place!! We moved to the southwest a little over a year ago and stumbled on Familia when we were looking for some good pizza. We found it! Thin crust, tasty sauce, always hot (even delivery) and the wings are soooo good. Tonight we tried a couple pasta dishes and were not disappointed! This is our staple for take out and pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MNylkPjdJIdBSe2QqzyglQ"
  },
  "pG7cSI0gNn2lWL4vmPiXUw": {
    "date": "3/30/2014",
    "text": "I feel bad for giving this joint 3 stars but I was just disappointed with the service. The pizza is very delicious. I'm not too meticulous about whether it resembles NY pizza but the pizza is large and tasty. On top of my pizza, I ordered a meat lovers calzone without sausage. Well, I think I did?  Upon unwrapping my calzone I noticed that there was no meat whatsoever. So I called to ask to see why I didn't get my proper fix. Turns out that the calzone is only cheese and nothing else basically holding the responsibility of knowing that on my end. So why wasnt I told this in the first place? If you had at least told me, I wouldn't have expected it. But I specifically said over the phone that I want a meat lovers calzone with no sausage. And the employee just said \"ok\" which confirms that the order is fine. I might order food from here again, but I'm disappointed with the lack of customer service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jCUqHcg4xvFtsG6ah6RcRA"
  },
  "WpIkxfNcs57HwLpPKvUB9g": {
    "date": "8/10/2016",
    "text": "Good pizza!  just tried this place for the first time. Love how thin the crust is and all the ingredients were fresh. Price was right too. I'm def gonna be ordering from them again and trying the garlic knots next time. Really fast delivery around 6pm on a week day. I'm loving this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iT529wuypB1F8h_tv-IRQg"
  },
  "RJzjNwuWR1eNGAYajSKTMA": {
    "date": "12/13/2013",
    "text": "Amazing garlic knotts & Zeppoles! Definitely going back! Food was nice and hot! Very flavorful and delicious! :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "TT5E2hDsfiNs6BB4AE6qQw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TT5E2hDsfiNs6BB4AE6qQw/o.jpg"
      }
    ],
    "user_id": "l9FhTx_Q8VtWmGc2IdN3Vg"
  },
  "60c7bzE3yigqXIRF4d2L9Q": {
    "date": "3/13/2015",
    "text": "Very good place to eat, I am pleased with it. Will go here again. I am so full right now I can't process a good paragraph.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6cswuD0Qpsyy0s9CQEDHRw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6cswuD0Qpsyy0s9CQEDHRw/o.jpg"
      }
    ],
    "user_id": "isSdaFb7ZHkxevCzhck0Bg"
  },
  "VHiyWYqPBB1bT4vFcMiKkw": {
    "date": "7/29/2017",
    "text": "I was extremely disappointed after reading the comments and reviews. I ordered a slice of pepperoni pizza with extra cheese. It was frozen pizza quality at best and seemed like the cheese was thrown on top and then microwaved. The slice was rubbery and poor quality. Even the pepperoni was underwhelming. I also got garlic knots which were very small and flavorless.  All around disappointing experience. Would not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k7sPR6dbOpUAT5YvrTgX-w"
  },
  "T_cpkD87E2bcRL0rjgrw7g": {
    "date": "2/12/2015",
    "text": "Very pleased! The location is very hidden so look for it, it's definitely worth it! Food is really good. Pizza was perfect, wings are perfect. Ranch is great always a plus in my book. Also I can't forget to mention the guy who works here is really nice. We were sitting in the sun and he was nice enough to ask if we would like the blinds closed. I will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D9aQhyIPsunjb9HxNLMZbw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D9aQhyIPsunjb9HxNLMZbw/o.jpg"
      },
      {
        "img_id": "6_Y57RjnIBpOIbq53gVc4A",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6_Y57RjnIBpOIbq53gVc4A/o.jpg"
      },
      {
        "img_id": "d-pWF63q3yDyyJ8mAUjjVA",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d-pWF63q3yDyyJ8mAUjjVA/o.jpg"
      }
    ],
    "user_id": "nFQb5WVcM66gSsZp73SBPg"
  },
  "1FvJB8zY1jL1xLizp5g8Ag": {
    "date": "5/12/2016",
    "text": "Got the \"wife\" pizza and it is absolutely delicious ! Such a good white pizza. Would definitely recommend it to anyone !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EecJPOc1IrFGE1XcsuUQTw",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. The wife pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EecJPOc1IrFGE1XcsuUQTw/o.jpg"
      }
    ],
    "user_id": "idDkHP1koa0XI74xGYlMTg"
  },
  "iNZtAfrUxHV1il-Xb-RWYw": {
    "date": "9/7/2015",
    "text": "If you are looking for awsome chicken fingers, this is the place, i hate slimy chicken, Thiers is crunchy even delivered, i have been looking for these for years, and the ranch is on point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yJ6WeBTpM0izbF_UemihTQ"
  },
  "uwazt5rb-CGmERlUm2pXmw": {
    "date": "6/16/2015",
    "text": "Ordered the penne ala vodka with chicken, garlic bread with cheese and was supposed to get a side salad with the pasta. Vodka sauce is extremely bland along with the lack of a presence of the sauce. The chicken is almost nonexistent and the garlic bread tastes like it a French bread that is barley heated not even toasted and no cheese. Not to mention my salad didn't even come.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "J76G1F_jJrVn5qDsVct9-A"
  },
  "ubPTvwxjVEdEOo80gMQOFA": {
    "date": "7/22/2015",
    "text": "The food is just \"ok\". When I first started getting delivery from this place the pizza was really good.  But in the past few months the quality has really declined.  I gave it 3 stars instead of two, only because they honored their \"free pizza\" deal for me (a few months before when I ordered, a pizza arrived with all the ingredients slid over to one side, like their driver had dropped it)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HHNFl6jkyDclqSUD43-aHQ"
  },
  "gqVdvF_ZfLKSpYnrRfHziA": {
    "date": "5/7/2012",
    "text": "If you are craving a New York-style pizza, this place has pretty good pizza. I have ordered from this place three times now, and the last two times, there was something left off my order. Last time, they forgot the sausage on the sausage/pepperoni pizza. This time, they left off the pepperoni on the sausage/pepperoni pizza and also forgot to include ranch with my order of chicken fingers. The crust is hit or miss. When it is good, it is REALLY good. However, the last couple times I have ordered, the crust was slightly undercooked.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F0nR2cEBLSZtBb2hlxnpoA"
  },
  "l5IaV5rRgqN58E6Xwpgu_A": {
    "date": "5/12/2015",
    "text": "I have moved here 12 years ago from back east. For 12 years I tried to find a good pizza in this town. Hard to do till I tried familia. All I have to say is wow. I got the 18\" pizza with chicken and garlic a couple of times really good. I just got a couple of slices of the Sicilian today. That's the best Sicilian I tasted in 12 years. I will not buy pizza anywhere but at Familia    You guys rock the pizza world.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uNzDGkzxVFcxIFo4ZajRfw"
  },
  "gYMvNq0ARLdXonZowChuBA": {
    "date": "11/20/2014",
    "text": "As far as the food goes I love their pizza and gyros. Their fries would be good but they are always soggy. The reason they are getting 3 stars is because of their creepy delivery guy with the tattoos on his arm that looks like a convict. He always makes comments when he comes to my house such as \"where is your old man tonight\" or has brought me free sprite even though I didn't order. So I started to do pick up only because I didn't want him at my house if I was alone. One day I walked in and placed my order and had told the guy behind the counter about how uncomfortable I was and he told me that the delivery driver I was speaking of would not be working their much longer and I could order deliver again soon. Low and behold when I was waiting for my order the creepy delivery driver walks in and says \"is my delivery too slow for you\" and makes me feel completely uncomfortable. I no longer order from there unless my husband is home because he has shown up a few times now and I refuse to answer the door. We order from other places which is a shame because we do like their food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9WCgoi4rHTAowPHwuwk5tA"
  },
  "2Os-vcQBiszzIZX-9gz6rw": {
    "date": "11/16/2012",
    "text": "Really yummy crust. Cheese was delicious. They do it right. Even the service was good. Thanks guys!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JwN-Wqdp55zhjlhsdQH--A"
  },
  "nmqtMzZgaIUlJMaKk83ILw": {
    "date": "3/26/2010",
    "text": "It's been a little while but I just called to confirm that they still use CANNED mushrooms! We liked the pizza but when you don't use fresh mushrooms, our favorite ingredient, then it kills the whole deal.  Start using fresh ingredients and we'll be back!  EDIT: My intention isn't to start a pissing match with the company but what you're stating is False. My wife and I ordered 1 of your pizzas and picked it up ourselves, it came with canned mushrooms, not fresh. I called to order again on the date of my original \"review\" and the person on the phone stated that F.P. still uses canned mushrooms. Please take note I said that we liked the pizza and we'd be back if this changed and so far, according to YOUR employee, it has not. We'll place an order in the near future and see how that goes. I will be sure to update my review at that time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KeT9NKimYkHN0wlrij-dg"
  },
  "hGYNrjsSiovz4JloTc0WLQ": {
    "date": "7/20/2015",
    "text": "Ok, so...I actually had a dream, the night before I discovered this place, about buying pizza by the slice. Weird, I know, don't ask. Anyway, I Googled pizza by the slice in my area and was surprised with this little gem. I went immediately. Knowing what to look for since I'd worked at a pizza by the slice shop when I was in college, I knew I was in a good place. They had the already, sliced pizzas under glass, ready to be reheated with your choice of topping. Slices were $2 and .50 cents for each topping, I think. Either way, it was reasonable. The crust was legendary, New York style, thin. My toppings were pepperoni and sausage. Truly amazing. I had 2 slices and a drink and was on my way. The guy at the counter was courteous, conversational, and clean. I was so impressed, I went back for 2 more slices for dinner. Only drawback, and it's really not a drawback, is that they closed at 9pm because it is Sunday. They close at 11pm the rest of the week. That's just poor planning on my part. I showed up at 850pm. I didn't want to mess up a table or their closing activities so I got my order to go. Going back tomorrow, for lunch. Going to try the garlic knots, possibly the chicken fingers. Great place, check them out. They're on the corner of Durango and Windmill, behind Bomas bar. There is also a chevron gas station there. You can't miss it. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0Z01eVkXdGSbz-U9UFNhg"
  },
  "O9XI41pw22WYDj8-oiKZvQ": {
    "date": "4/3/2009",
    "text": "Solid.  If this place were in New York, it would be the best pizza in the neighborhood in most neighborhoods.   Went with cheese pie and it hit the spot.  Good crust, not brick oven but lighter and with a little chew.  Cheese ok.   The pizza sauce was very good and fresh.  Solid pizza but not mind-blowing.    Also ordered 6 garlic knots.  I've never seen them literally covered in minced garlic.  Seriously I thought it was a heavy layer of grated parmesan cheese.  Nope.  Delicious raw garlic and olive oil which is great if you're a garlic-head like me but if not, be warned.  Surplus garlicy olive oil got poured on the pizza.  Oh and also the knots come with a good-sized side of marinara (and there was extra of that for dumping on pizza too!)  Finally, surprise-surprise, the canolli's were great.   I really didn't expect much as even at a good pizza place in NY the canollis are 50/50 at best.  But here the shell was crisp, crunchy, and almost light.    Instead of delivery I picked it up after reading yelper warnings about possible long wait, but next time I'll prob have it delivered.  Haven't priced out pizza in a while but was like $20 for pizza, 6 knots, and canolli.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "ybcBGlRG0qYHI9DbXjfznA"
  },
  "pK_Qofj9LZ4UB1EngZ3AYA": {
    "date": "4/1/2009",
    "text": "Finally!  Being from New York, it's been SO hard to get good pizza around here!  Yeah, people will tell you a bunch of places, but they really are disappointing.  There's more to pizza than putting, \"New York\" in the name...  Familia pizza is really good.  The owner is a super nice guy from New York, and his son helps out.  The pizza is big and thin.  The crust is a big issue, and they have perfected it.  Great texture and taste.  By the way...you must must MUST try their cannoli.  His son makes the cream from scratch, and it's the best cannoli I have ever had in my life.  You can taste the riccotta instead of tons of sugar.   AND they sell pizza by the slice, which is hard to find in Vegas.  Go there.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "4EKW1EdJpoB-RMcuhbxqQA"
  },
  "d1DHBz30WulOnMq8EiacWw": {
    "date": "12/28/2011",
    "text": "At the suggestion of a friend tried this place for.first time last week and already back again. Last time we had familia house pie which includes: pepperoni, sausage, meatball, mushroom, black olive, onion, green pepper & garlic. Super yummy! This time we are trying the 'anytime special' 2 16\" cheese for $17.99. Finally a place like I can find in NY, basically delicious. A tiny bit pricey and not a huge place to eat in but perfect for a quick bite or take out.  They also deliver. Most importantly they are friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6oOu_qWnWbdBhyOgIySlvg"
  },
  "ZEJuUpTQjKk1yT0BQuCcLg": {
    "date": "8/23/2014",
    "text": "The pizza is hands down the best NY style pizza in vegas!!!! There's a lot of choices in their menus, subs, calzones, wings, cheese cake, salads and more! I've only has the pizza because it's so good. It's very inexpensive!! We got 5 slices of pizza and two soft drinks for $13!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "umAGJDrBVOzii_QM-9iKwQ"
  },
  "U6kCsbK8xxyegHWOnOIsQA": {
    "date": "4/19/2015",
    "text": "Great pizza, great prices and friendly service. Only negative was the length of time it took to get our delivery. It was worth the wait though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgpge7OxzS3OMj57YEA6dQ"
  },
  "ZsjP9eJS7skeAlOz6jifDQ": {
    "date": "1/19/2013",
    "text": "Our family moved to Mountains Edge in 2006 and this was the only pizza place that would deliver when we had no food, no fridge, nothing unpacked.... We have been loyal customers ever since. Being from Brooklyn, NY, we like a thin crust with a good sauce. We probably have ordered at least twice a month for the past 7 years. We go through phases, sometimes we like plain, sometimes pepperoni, once in a while we will get a white pizza or a pizza with eggplant. Zeppoles are good and icecream sandwhiches. I do wish they would have benefits/coupons for frequent customers. And there salads aren't anything special. But overall, one of our favorite pizza places, especially for delivery!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRuYvoDFTajw7wyXOj4imQ"
  },
  "X0XmkwBVhFGN6i-jLdEqwQ": {
    "date": "10/6/2012",
    "text": "You can never go wrong by choosing to try familia pizzeria. The staff is wonderful, their food is amazing, and it's cheap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VC-p7oYP3wUWMak1tHmA-A"
  },
  "zlnwY0Pg2nb1dL3KZjFbSg": {
    "date": "5/12/2011",
    "text": "-I ordered the classic gyro and it was a pretty decent size. My 1st time having lamb and I wasn't disappointed. -The pizza for kids is also a good size and it's also pretty good. -linguine and clams wasn't so great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH2uB_kHozuJwXGf9deVHA"
  },
  "qN71lEjW_Loapt59DgmvDw": {
    "date": "11/4/2014",
    "text": "This place sells a lot more than just pizza.  Gyros, ravioli, spaghetti, subs, mozzarella sticks, and so much more.  High quality preparation and speedy dine-in service.  Almost everything I have tried on this menu so far tastes excellent and is fairly priced.  I could eat there every day.  Have not tried their delivery yet.  The kitchen is clean, but the bathroom and dining room need a remodel.  Not going to ding them for a star over the old building because the food is really good.  Best gyros I have ever tried.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BDFgyvmmYWVxdMMcUae5aA"
  },
  "tftendLq_jz0Mc5Cb5uU-w": {
    "date": "8/18/2011",
    "text": "Great New York Style pizza! I hate that I found this place because it screams return trips. When we first parked and got of the car, first thought was \"Sweet Jesus, now that's some Garlic!\" If you're a garlic fanatic, try the garlic knots. Those little suckers were awesome but had me searching for Tums afterwards because of all the garlic.   There's nothing special about the decor in this joint, most people place deliveries or carry-out. For $20, we got a 1-topping lg. pizza, order of garlic knots and 2 liter soda, which was a great deal in my opinion.  Give these guys a shot and tell them Yelp sent you their way. They will appreciate it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IxEMT9rqzG6n4EJhqXSMvw"
  },
  "0hTpiPB5ZRAr5_fzZH4p4A": {
    "date": "5/10/2016",
    "text": "Worst customer service experience I received and to my surprise it was from the owner vinny as I walked into the store this asshole vinny was on the phone with never the less a complaining customer as I waited and stood directly in front of him not once he acknowledge me standing directly in front of him as he was on the phone he made me wait five minutes before I said I need to order some food and he basically points at his phone telling me he's on the phone when he can easily had another employee put the food in the oven instead he made me wait another good 15 minutes along with another customer behind me as he disputed with another customer on the phone that was complaining about some issues about his food this guy is a total asshole it's guys like this that give us New Yorkers a Bad reputation maybe I'll just build my own pizzeria down the street in front of Rhodes Ranch and put this asshole out of business!!, dick wah!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a7NHLCabnrnG05eIWqob7w"
  },
  "9oLl0yaVdOT9_nJzS5PnTA": {
    "date": "9/18/2011",
    "text": "I come here often for pizza and the amazing garlic knots!! The cheese pizza is delicious as is the garlic knots and their ranch. Ranch is a necessity anywhere. The owner is super nice and gave me free cannoli for their anniversary this weekend and it was delicious!!!! Love here. I've never had ny pizza but I love this!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPdz-T8ckX50rAopsOs2bw"
  },
  "EnWU3ktsIA98RWT29iiwBw": {
    "date": "8/17/2012",
    "text": "Pizza is very good, one of the better places I have tried so far.  The employees are really nice and professional.  Looked really clean and reasonable prices.  One of my favorite places for pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XZWL8CrZp3yxTCTV7T30sw"
  },
  "5Zv15YWChT-IrwAiZBhJFg": {
    "date": "1/4/2012",
    "text": "A little pricey but well worth it. I got the Sicilian pizza with pepperoni and it seriously has to be one of the best pizzas I've ever had the pleasure of devouring.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duI_fqBTFY8z2Xu3Iq5-Tw"
  },
  "YalWXZt3k55TgHRFC1aT_g": {
    "date": "9/9/2014",
    "text": "I always love ordering from familia Pizzeria . I've been coming here for about a year now and most of the time the pizza is very very good. The prices are nice and inexpensive, and the service delivery is always pretty decent.   Recently I have gotten the white pizza, me and my girlfriend like it because it has no marinara sauce on it. However, everytime we have gotten it I feel they put way too much garlic on their white pizzas which kind of kills it.   They do have a very good special that we get all the time which is a large one topping pizza and an order of wings for $27   All and all it's a very good place to order from and I will keep ordering from any other pizzeria. I just wish they would ease up on that garlic.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M-gk1_lMGMP7ZkFQ77ixrQ"
  },
  "liKw98z15vM96YrXWIxmBg": {
    "date": "6/21/2017",
    "text": "This was my cheat day-AMAZING menu-awesome pizza and it is definitely up there, odd to find near Rhodes Ranch. I'm soooo happy. No more Marcos this is my new go to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DmtgMXZTKmTILg6OyzhJbQ"
  },
  "J5zYuWwL7yVU7Aa7W7TMhw": {
    "date": "5/10/2015",
    "text": "All I can say is Holly Cannoli! This place is a hidden gem, I mean it's literally hidden! If it weren't for Yelp we would've never known it was there. After reading the reviews we decided to give it a try today. We ordered the 6 piece garlic knots and 2 slices of cheese pizza. It came to just under $7, which was a steal. The pizza is super thin but not too greasy. The sauce has the perfect consistency and spices, very flavorful but not overbearing. The cheese is melted nice and is fresh.   The garlic knots were like little bites of heaven. Perfectly cooked and just the right amount of garlic and Parmesan. We ordered the 6 piece but could've easily devoured the 12 piece. I'm so excited to say that we've found our go-to pizza joint! Make sure to check out their lunch specials and full menu. Can't wait to go back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y8-KhdTbRWM4A2Y6b8Dxog"
  },
  "k2DmlPA8sxrPme7OMeONZw": {
    "date": "1/14/2017",
    "text": "I don't know how this place has such a high rating. I ordered online, which was convenient, and it gave me a delivery time of 75 minutes. The driver was right on time. On a Friday night, that's acceptable to me of a small place. We were VERY disappointed in the pizza, however. It was $50 for two 18\" pizzas, first of all. The crust tasted burnt, the sauce was almost non-existent, and the spinach tasted funky (like it was already old and slimy before it was put on the pizza). We peeled the spinach off and it still wasn't good. I hate Little Caesar's, and I'd have rather had that instead. From now on, only Rocco's or Grimaldi's for us. If we're going to pay through the nose for pizza, it had better be good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmy2Y7CazBa3t_469KYAbw"
  },
  "y7yrsyUvHiER1vvjsBKOag": {
    "date": "3/20/2016",
    "text": "It's been one year since my last review. This place is great. I've never experienced bad customer service, a bad meal or anything that would reflect negatively on this neighborhood pizza place. The pizza is always crispy like it should be, cooked to perfection and we love ordering it well done. Is it greasy? Is it pizza? Does it consist of cheese & meats? So yea there's grease. No more than any other fresh made pizza. You want to talk about grease? Go to Marcos. That's the greasiest pizza you can find. It's good but it's like grease with a little pizza.  Obviously the great reviews more than outnumber the very few bad ones. And for good reason. This is a great spot! I think I just talked myself into ordering it for dinner right now! Yay!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qiA5QI85-A2WB5lKRlyCIQ"
  },
  "OKw498Ke9ESFwtyK7vNh6w": {
    "date": "12/14/2014",
    "text": "Delicious! And delivered quickly !  Quality food! We will definitely be ordering from here regularly. The pizza is huge. Garlic knots soft and covered in garlic. Add a side of their ranch... It's the good ranch, different from the ranch you buy in stores. We also got tiramisu .. Which also comes in egg nog and peppermint mocha! YUM! Love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D6LqC6EyRJmfkNPh8cxd1A",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. AH-mazing tiramisu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D6LqC6EyRJmfkNPh8cxd1A/o.jpg"
      },
      {
        "img_id": "hCF_3kB1ucAF7h3gH3gM7A",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Almost done, it&amp;#39;s so good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hCF_3kB1ucAF7h3gH3gM7A/o.jpg"
      }
    ],
    "user_id": "9HmyXuLLpLRe32S28o5R2Q"
  },
  "NozxUC6B3Qfs-IuCfy53KQ": {
    "date": "6/26/2016",
    "text": "Proper NY style pie! Highly recommended!   Just moved back to the west side and glad to have this as our go-to pie delivery. Get some!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "citGmwyhLfUmtqUR4tgeKg"
  },
  "OxB6Hpdr73m2HegUKELWVQ": {
    "date": "8/1/2016",
    "text": "From the moment you park outside, you start smelling all the goodness!  Their food was amazing. We ordered spaghettis and jalapeno poppers (I'm pregnant but my husband was CRAVING spaghetti, lol). Everything tasted really good and fresh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wwOcbaKLfqSJHrEgb5LDg"
  },
  "uwVuBrVkazIMIZ2IP5QFiQ": {
    "date": "6/22/2016",
    "text": "Love this place ! It's different than anywhere else. Has a real Italian taste to everything. Highly recommended. Everything on their menu is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N80DLI1sPwg2pfZU_j-Nxg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Tortellini Bolognese. Soooooo good!! So much flavor.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N80DLI1sPwg2pfZU_j-Nxg/o.jpg"
      }
    ],
    "user_id": "Dtqr3AcEsyqhLQzwkgypOw"
  },
  "NTXMIK8CvDLgu7xa-z8Y4A": {
    "date": "1/16/2016",
    "text": "Clearly from Russell's review, I'm not the only one who thinks the woman answering the phone is rude!  Never again!  Placed an order online for a 90 minute delivery. When I called after 90 minutes passed, I was told that it would be another 30 minutes. I would not have ordered from there if I knew it was going to be TWO HOURS! Then while talking to the woman on the phone, she rushed me off and hung up on me. When I called back and asked for the manager she was rude again. Then when the manager came on the phone, he backed her up and made no apologies. Seriously???  We have been ordering from here for so long. After tonight.... Never again. I told them to cancel my order and now I'm waiting on the credit back to my card.   That horrible service will not fly with me.   Number one - your \"web confirmation\" was wrong and you should apologize for that being incorrect and then you should apologize for your rude employee. Honestly, sometimes all that is needed is an apology to correct the situation.   If you want NY pizza than I would call Rocco's. Their pizza is better anyways.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7bLDV2RGKF5KJyasrwZ6A"
  },
  "FmO8dBqgnGdSEBg6Gp2-kg": {
    "date": "4/27/2017",
    "text": "I ate here for the first time today. It's so cozy and the food is delicious! They sell pizza by slice which is pretty convenient for my kids. I got clam pasta that was delicious and I can't wait to try all the pasta dishes and more. Clean and good customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6NZC4uF1AlgSaley-Zi5gw"
  },
  "bUTIY8-ivDZz5V2AV8_-_Q": {
    "date": "12/27/2015",
    "text": "We have been spending our hard earned money for 2 yrs here however tonite i was told that i was lucky there still taking delivery orders...  just trying to give you my money. Whomever was on phone tonite needs to be off the phones.. attitude sucks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j6izHF5RzBBuiZb63izvZg"
  },
  "-bnJm4507cXu04gGxb4XGA": {
    "date": "11/22/2015",
    "text": "There is something about the cheese at this place. Just a standard pepperoni and cheese pizza here is so delicious. I am a freak about ranch and I smother my pizza and wings with theirs. 50 cents a cup sounds more than perfect to me since it tastes so delicous. The pizza and toppings are a bit pricey here but I look past it since the quality of food is worth it. As long as there's UFC fights, I'm going to keep ordering!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "bRzr5YuEIncFzG6_vYSwcw"
  },
  "a5_DPK8kRH0AewvnJB6BoA": {
    "date": "3/5/2018",
    "text": "Amazing pizza! And heir salads and chicken fingers are SO good too! We probably order from them once a week. You can tell how good a pizza place is by their ranch dressing and theirs is AMAZING. Seriously I wish we could buy in bulk lol. Happy to have them in our neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnb776302PWsATjthcrycg"
  },
  "GSAd4vXvNmGau5cWkVhy4g": {
    "date": "7/27/2017",
    "text": "I love this pizza and the wings are excellent. We are From New York and very picky with our pizza. This is the best we have had in Vegas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EaOWhmJs40sJLVbh9ygScg"
  },
  "lbcsafL8q-nx0ihkV6jTHg": {
    "date": "4/23/2017",
    "text": "Loved the food, pizza was great. Ravioli was delicious and the garlic knots were amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9EkWz0QFbjkx_z2L_-0aw"
  },
  "EGsDkjOdddWbzLyEOlnF2g": {
    "date": "5/17/2017",
    "text": "Insanely delicious and I didn't realize how huge the largest pizza was!! Loved the pesto chicken pizza and the price is more than reasonable. I'll be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7deiJECG8AIbmiltXYtE-w"
  },
  "PhA7MP-KYoABNdHG_G8oEA": {
    "date": "5/5/2017",
    "text": "Love their pizza and their food  As close to New she York Style Pizza and Italian Food They're fast and friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tuyqm64DiSVuYBX2Akwusw"
  },
  "TeLL6TFWLJXzAFyb6qlz0w": {
    "date": "2/13/2016",
    "text": "I love New York style pizza by the slice and this spot is my go to for lunch nearby work.  They have decent prices on their lunch specials for slices.  I always get a slice of pepperoni and cheese pizza, an Italian salad, with raspberry iced tea.  Service is always top notch, getting order is quick, and I'm in and out in a flash!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dFhW5pRBiNlPjARjBDJdGg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dFhW5pRBiNlPjARjBDJdGg/o.jpg"
      },
      {
        "img_id": "NBP8rH7K83-FrtNpcC6Xmg",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Pepperoni and cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NBP8rH7K83-FrtNpcC6Xmg/o.jpg"
      }
    ],
    "user_id": "CkqT3yGUeM_9vSbFES_O5w"
  },
  "h1qcParr4Q1kK7UNDiR-KA": {
    "date": "2/27/2017",
    "text": "This place has authentic NYC Pizza and food. It's the closest restaurant serving authentic East Coast Italian food. But, they have much more then Italian food! Wings, Subs, Gyros, and amazing Salads. EAT HERE! KEEP THIS RESTAURANT OPEN! The service is amazing. They have NEVER messed up my 75 plus orders. The delivery is extremely fast and always faster then the approximate time. Great family food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QzCE7ZG2BZY8A039GreiBA"
  },
  "gsaKndx18NKRQAAHzrM6NQ": {
    "date": "11/25/2017",
    "text": "Best pizza in town, by far, hands down. I've moved 20+ miles away from this place and still drive across town to satisfy my cravings! The owner needs to expand all over the city! Please!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1SRDhbaevbQZc0NleHUCA"
  },
  "cvuMOqFAX0Rj4byRv2NDwg": {
    "date": "7/4/2018",
    "text": "Ordered wings well done and I got some pale undercooked wings. Sad, this place used to be good. I would suggest finding someplace else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8qnHcAlkimpch0RTThOF0Q"
  },
  "DA71yAM1tcO1_FyACRY03w": {
    "date": "10/30/2017",
    "text": "If your looking for authentic NEW YORK style pizza in Las Vegas, look no further! They even have the infamous white pizza, my favorite. Their pastas are amazing as well, the sauces are very authentic Italian family recipes. I always order the tortellini bolognese. I found this place when I first moved to Las Vegas and have been eating here ever since.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytsz3KGny2NoWxPepTOqTA"
  },
  "Zg8LEHaTijW9r2urQXQDMQ": {
    "date": "1/28/2018",
    "text": "Very small restaurant..maybe 5 tables..great lasagna...just like Brooklyn, awesome sausage and peppers, and the only pizza we eat in s.w. Vegas! Big menu, friendly staff...the best!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBb5kNzSID4S99vWmqiCnw"
  },
  "b2CUef01vfQrRmV1faa6yw": {
    "date": "6/17/2015",
    "text": "How you dream of pizza tasting! Homemade ranch, and zucchini sticks that aren't soggy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "50qhHeZqbVPFbVMMECp34g",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Medium cheese light on sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/50qhHeZqbVPFbVMMECp34g/o.jpg"
      }
    ],
    "user_id": "WbFk1imKyG8zg8jRFpXMAw"
  },
  "EjLrVP3SaX2yObYR5K4cbw": {
    "date": "6/6/2016",
    "text": "Our first order here, the Yelp reviews were very good so we gave them a try.   We really enjoyed our pizza, but the service was NOT very nice. I called in a phone order and was put on hold for a very lengthy time, only to be talked to in a condescending manner. It was like taking my phone order was a huge inconvenience to the guy on the phone. The pizza was delivered on time by a rough hoodlum looking kid in a Mutant Ninja Turtle t-shirt with a whatever attitude, who was so rude. After handing over the pizza he seriously waited several seconds staring at us as if to imply he was due a tip. Nope! Not after the phone service and his attitude! I'm sorry, but a tip is for excellent service, it's not an obligation.   I really hope this place talks to their employees about how their delivery of customer service is SO IMPORTANT and makes an attitude adjustment. We love ordering from and supporting local businesses. The pizza is great, but they're so much nicer over at Grimaldi's, and that's where we are happy to do business.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "-95gDpECFDSjWEL1AIrkAA"
  },
  "4eWlI6IHNFBdmg3kFZPQsg": {
    "date": "7/16/2017",
    "text": "Great local pizza joint. The employees are very friendly. I've placed an order 30 min before closing with no issues. I have only tried the pizza but the other items look good as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "86pNYOl58dZCq32KL-XBjA"
  },
  "7OQkGOexMdTqczeuvDvfzg": {
    "date": "8/15/2016",
    "text": "Every time I come here I enjoy my food. It's a small little authentic pizzeria. I love how amazing it smells when u walk in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5YAttnVd3l4saVICjoV3nQ",
        "caption": "Photo of Familia Pizzeria - Las Vegas, NV, United States. Best calzone I&amp;#39;ve had in years.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5YAttnVd3l4saVICjoV3nQ/o.jpg"
      }
    ],
    "user_id": "ssdpsyEklRIdXVBtoY7q6Q"
  },
  "ooCVuksMB-hPvYPtwTy0wA": {
    "date": "6/1/2016",
    "text": "I got tired of hearing a co-worker of mine raving about this place, so I finally tried it and I wished I'd listened to her sooner.  The pizza was great!   The crust wasn't too thin or too thick.  It had the perfect amount of cheese, sauce and pepperoni and it had lots of flavor.  I liked it so much, I had it two days in a row.  The delivery takes about an hour or more, so if you get delivery, just be willing to wait.  My pizza was still piping hot when I got it.  So no worries there.  Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gmYU_SLgpWgafgSejWdzTg"
  },
  "cph_GE_CvO1Z-OpSVAmmuQ": {
    "date": "8/6/2017",
    "text": "This spot is the best Pizza in the area, hands down. If you're from the northeast as I am, you can compare this to that good, real, New York pizza. Now, the eggplant parmigiana. This is an amazing dish!!! I don't order pizza from anywhere else anymore. Trust",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J33rdeIeABHlNjp8yGmCOw"
  },
  "g4XD9w3pyyoDyxzagN-xLw": {
    "date": "10/4/2017",
    "text": "Love the mozzarella sticks here!! Tastes like NY pizza in the desert.   All of the employees are very nice and helpful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFBcBstgo4gPMqwcYo9gvw"
  },
  "FWauzmFhYsVCFdgnvzH_hA": {
    "date": "7/28/2017",
    "text": "Won't come here again. Tried it out on a whim for lunch and was awestruck that they had 2 dollar slices but after a couple of hours I can see why. I feel like Ted and Marshall from how I met your mother when they ate at that god awful pizza place in Chicago. I've had food poisoning before but what I'm experiencing now is like something wrenching at my stomach trying to tear itself out.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q_kn-6ELPx3bvPsjIXpzlw"
  },
  "l7FPcOlLIO45VA1Mf9vIig": {
    "date": "11/4/2017",
    "text": "I seriously love this place. They have the best NY style pizza in Vegas, the slices are huge, and their Pizghetti sandwich is so good! Definitely large enough to share with 2-4 people. They have awesome lunch specials too. Love Familia!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KNy-qOk0Q9oMXn5ne7oI_A"
  },
  "fD_sHbNYRk4ALxwmZW2t3w": {
    "date": "9/16/2017",
    "text": "This was our first time visiting this neighborhood restaurant. I decided to go instead of having it delivered as I wanted to check it out. I was the only person in there but they did have a lot of delivery orders lined up. I waited about 15-20 minutes for the order (chicken Caesar salad and mushroom ravioli with added chicken). Not a bad wait time. However, I was the only patron in there. If I ran a restaurant, I would offer the only person in the restaurant, waiting for an order a drink. But I know that might be considered above and beyond. I took our order home and was disappointed in the amount of chicken given for both orders. Additionally, while our orders were pretty basic so was the quality. We probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jcp1Lk6UuiGFam0qQv2Rhg"
  },
  "OYD4Rp8NL7ism4HIdGhucw": {
    "date": "7/14/2017",
    "text": "Great pizza, wings, zucchini and cheese sticks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PHWpDdjCywINyKx2ymzCeg"
  },
  "bQpIjn-CzzuRiqRSYyOxdQ": {
    "date": "7/11/2017",
    "text": "Accurate orders, great prices, good food, cheap and fast delivery- definitely worth checking out if you're looking for a pizzeria!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ufNLecgIV4GC6oJsoO-Fgw"
  },
  "sMYcNfpNqNY-nbhR7FWXNQ": {
    "date": "10/30/2017",
    "text": "Love this place!! Everything from their pastas, pizzas, and the wings. My husband and I get delivery from here 1-2 times per week. It is always excellent service and food! (Would be awesome to have a rewards program!) This is hands down our favorite and go-to place for takeout in the Rhodes ranch area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2MoY4QvD_15RFnFjpV8FQ"
  },
  "Rn81ltwxY59rypPGv7QobQ": {
    "date": "4/27/2018",
    "text": "The pizza just was bleh. It really needs some seasonings! And sadly the crust was burnt badly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aMLNUZBRa2azrV0JQNKkhA"
  },
  "jg_RTZeSwmwmKTGQX7UIJw": {
    "date": "1/31/2016",
    "text": "Have ordered delivery twice and enjoyed the food both times. Had their pepperoni, familia house pie, fries mushrooms, garlic knots, and a couple of their salads. Loved the flavor of both pizzas, not sure what a real Italian pizza taste like but I would think this gets pretty close. My children absolutely love the garlic knots! The fried mushrooms were ok, not the best I have ever had. I am a ranch lover and I must say the ranch is finger picking good, so good I ordered 7 big cups of it!!!!  Delivery was a little over an hour which I think is king of long but hey great things take time! Prices are a little higher compared to other pizza places but I think it's definitely worth it!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 15,
      "cool": 10
    },
    "photos": [],
    "user_id": "JcNSd3dXmIMVHP2CUpvMHA"
  },
  "7SJPYibL1leM9n58ZGYK9Q": {
    "date": "11/5/2017",
    "text": "Familia is the best NY Pizza in Vegas. Their additional items on the menu are just as amazing. Chicken fingers, all the pastas and gyros. The employees are amazing and I'm sure the delivery guys know my house by heart. Will keep coming back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "825nApynG7_I42AOZ6ALxQ"
  },
  "3YiqekJtyVDaJGoVrnnb_A": {
    "date": "4/11/2015",
    "text": "Chef salad, pastas, and pizzas... You can't go wrong! & don't forget the garlic knots",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "m7tdFf2FOjTyqgsB1t7J4Q"
  },
  "zvN7saMducKvliQkyH84xw": {
    "date": "8/24/2013",
    "text": "This place is tough to review because the pizza can be inconsistent... When it's fresh out of the oven its pretty darn good; but I've had some bad slices from here too... I am really hard on pizza reviews because I feel there are way too many bad joints out there and people just don't know what good pizza is anymore... So, with that in mind, i'll say that this pie is more than passable...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDKZdAN37c9OZyZ0jR9ZfA"
  },
  "m28GXn-oGr1bK9NKS5v6IA": {
    "date": "2/22/2015",
    "text": "These guys have been a recent staple for us. But despite the quality of their pizza, I have to chime in about the cheapness of their entrees. We ordered the 16\" pizza and spaghetti and meatballs tonight. We received the same quality (albeit greasy) pizza as always. But the spaghetti and meatballs included only two relatively small dollops of sauce. We called them, and they told use \"the family\" tells them how much to serve so there's nothing they can do. It seems this \"family\" does not want you to enjoy their pasta dishes. Stick to to the pizza. I suspect that even their staff think their phoning it in!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jP6DSjkBCn5GGwGF2SRS8Q"
  },
  "fwnJDOB4o0Y5-ymC9_kuDA": {
    "date": "9/23/2012",
    "text": "Jackpot I got a large New York style and a large Sicilian. Both were solid, nice and crispy definitely my new pizza spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PqpLCIytJhnLE_xOKQs1Dg"
  },
  "lFkbnQbH0yLSZZUsn8XUDw": {
    "date": "5/10/2013",
    "text": "Great pizza close to home. I love getting the pepperoni pizza with extra pepperoni and cheese. Their tiramisu is awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lFFIpfkox55FQ-wZD6BBVw"
  },
  "eeZkanXgwI-vUvRHmC8zgg": {
    "date": "7/24/2012",
    "text": "This is my new favorite local pizza place!  They have really good pizza that's not too greasy but still can maintain an authentic \"new york style.\"  Also I LOVE LOVE LOVE their zeppoles.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kK5G8Un_cGkm1Q6aXzdgUA"
  },
  "NsmO7SyDKp1BYSZZ5teDJw": {
    "date": "6/19/2012",
    "text": "Went to this place on Sun for Fathers Day with my wife and two boys (16,9). They have been on my Yelp radar for about 4 months to try and it's only 7 min away. My wife said \"pick the place you want to go\", so I did. They are in a corner of a strip mall. Went inside and it is small. 3 four tops and a 6 top, but it was clean. My wife said she thought it would be a little \"nicer\", I thought it was great! Old school, like back east. Restroom was clean and maintaned. On to the food:  You order at the counter and they bring your food to the table. Self serve 20oz styro cup fountain service, $1.35, 8 flavors Coke products, iced tea sweet or plain.We ordered:    Lg dinner salad, $5.95. Very big, romaine, tomatoes, onions, black olives, banana peppers, pepperocinis. Each of us had two servings! They serve on paper plates. Cool!    Lg (16\") cheese pizza, the deal was 2 cheese for 17.99, we added pepperoni, 2.00 extra each pizza. Not bad. Pizza was crispy on the bottom, crust was chewy, plenty of toppings and sauce. Really good pizza, worth the money. Took more home than we ate, 'cuz too much salad before.     Staff was very nice, we asked for an extra container of creamy Italian dressing (yes, one of the few places that have it). When the guy brought it over, he said \"It's on the house, it's Father Day\" What a nice dude! I complimented the mgr as we left. I wanted them to know they were doing it right. They do alot of take out and delivery, having 2 delivery guys. Oh, and they still have a 4.99 gyro, add fries for a 1.00. That's what I'm getting next. Check out the online menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rhH1Cqta8lb3n-t0fTRm5w"
  },
  "Il3ysuyvRtJ1ie1vfBgeDg": {
    "date": "11/13/2010",
    "text": "The pizza here is amazing - real and authentic.  Excellent service and the family that owns the place is super friendly!  A place that does pizza right - very refreshing here in Vegas",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WD8jE11b1jaXaGgrMM-gnQ"
  },
  "4Pi_pXMSLFBwJRgK494RKw": {
    "date": "12/17/2014",
    "text": "Very unhappy with the customer service we order food often from here and I called because my sauce was forgotten for the chicken wings the food I ordered was 35$ and the person who answered the phone was very argumentative to me and said I never put it on the order and then said that oh wait you did I cant guarantee that we can bring the sauce back to you even though I paid for the sauce and also tipped them very well WILL NEVER ORDER FROM THIS PLACE AGAIN VERY UNHAPPY AND I WILL MAKE SURE EVERYONE I KNOW NEVER ORDERS FROM THIS PLACE AGAIN ASWELL",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JkTaMwH4_9P_cRQj9pSLw"
  },
  "ycymKAiPs1HdwosKckTZeQ": {
    "date": "10/9/2015",
    "text": "I ordered pizza from here last night, I live in the middle of nowhere pretty much mountains edge and the pizza came within 30min... Perfect. I ordered the garlic knots and a 18\" pepperoni pizza. The cheese all the way down to the pepperoni was perfect all real ingredients... I would def recommend this place the pizza is bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dx6DqyKWSHQRK37G54MWfw"
  },
  "LaVoL03qkd5WyTn_jdhLkQ": {
    "date": "9/24/2015",
    "text": "Absolute great pizza and nice customer service. Nice homey feeling to it and even my first experience here I felt really welcome it's a great pizza place and a nice place to have lunch! One guy keeps staring though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ycOBKsrqam1LUaoH4NAEog"
  },
  "D2qwVwdoMV2oDiyiYoaK_Q": {
    "date": "9/9/2015",
    "text": "Had been underwhelmed by Pizza in Las Vegas until I tried Familia tonight. I got a pizza and a calzone, both were two thumbs up. Well-priced and tasty...think I've found my go to pizza place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kIX7XhNqgcQTrijLUV13Nw"
  },
  "16LGcNaYA_JRiMTeYbdaMg": {
    "date": "6/21/2010",
    "text": "I've been driving by this place for the last year and didn't give it much thought given its' location and signage made me think it's just another \"sysco\" pizza place ( meaning, pizza in a box/can like chef boyardee )   saw the place mentioned in a pizza thread a few months ago - i think Matthew gave the place props so i opted to try it  i'm glad i did.  I've tried:   the 10\" mini-pizza with soda special ( $7 ) ; The two slice with soda special ( i believe it was $6 ) ; Large Sausage pizza ( i believe it cost $14)   I'm a fan !  The crust has that crispy yet, chewy texture that works for me.  The sauce needs a little more \"zing\" to it but that's a personal preference not really a ding on the pizza itself.  Good service.  and conveniently located for me.  I probably give ciao ciao a slight edge on flavor, but not on convenience and cost.  pic added",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N044aCKJv3G5WuvwT5AJcA"
  },
  "uM0n_O9D1DTHxJ-7qHNPOQ": {
    "date": "5/22/2013",
    "text": "Had one of their specials this past weekend. A large 18 inch pizza, a house salad, an order of chicken fingers and an order of their lil donut things for $30.  Not a bad deal for the price and the food was all good. The medium buffalo sauce on the chicken was really good and the pizza was decent. Overall we liked it, even though not a favorite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1tGfRDgfhfkV8ehNLiJrQ"
  },
  "gdQMkbZhTbtUBlxKL3emxw": {
    "date": "3/23/2016",
    "text": "I used to love this family owned business.  We started to order from them when I bought my (first) home in 2009. They catered several events I had at my house.  We loved the food.  The staff were always wonderful.  Guests frequently requested them.    I don't know what happened, it started with the service going downhill for several months, but we still used them since the food is great and a guest favorite. Delivery times got longer and longer.   This weekend did it for me- I was made to feel like I was a nuisance and a jerk for simply trying to place an order for 10 people- a full day ahead of time no less.  The restaurant discontinued catering apparently (even though as of this weekend it was still on their website).  I had called on Friday in advance of a catering order for Sunday delivery (we are talking a half tray of lasagna,  pizzas, chicken fingers, salad and knots to feed 10 people, about a $300 order).  On Friday I was told that they no longer do catering (trays of things).  I said no problem, we will just order individual meals and I was told \"if that's what you really want to do\"  call the next day and speak to the now ex-catering manager, whom I believe is the owners son.  He was incredibly rude.  I told him i was going to be ordering for delivery the next day for a group of ten (read: spending alot of money with your business).    The first thing i wanted was five orders of lasagna (on their menu, mind you, as an individual option) and he cut me off and said \" I can't accomodate that.\"  Dead silence. No other suggestions.   Umm, Ok, \"well what can you do?\"  \"I only have 3 orders right now.\"  \"OK may we have those three.\"  \"NO. they will be gone by tomorrow. look, we are a small business and we can't afford to keep alot of ingredients around like that.\"   I'm sorry, aren't you a restaurant?  this isn't catering a wedding.  It's an order for ten people called in two days before, and again the day before. The tone was angry, hostile, and annoyed.  At that point I tried to explain how much we loved them, had ordered from them for years,  this was a big deal, could they maybe set any of those three orders aside for us.... NOPE. NOPE. NOPE.  Total jerk, could care less.  Made it very clear they don't want or need our business anymore.  WISH GRANTED.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8P9tanfLFfBvt4uxplSwHQ"
  },
  "FkHN68GUIfnVVgkr22j9WA": {
    "date": "7/1/2012",
    "text": "Hole in the wall kinda place. Good food, enjoyed the pizza very much. Not much for ambience, just a TV.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_rstnXWAGj43r_ssPVKlHg"
  },
  "vmoU_b_qs98OKbGp6f882w": {
    "date": "7/13/2013",
    "text": "Good place for a thin crust pizza. Also try the Sicilian deep dish. Garlic knots are tasty and I'm usually not a fan of marinara sauces but they seemed to put a little love in it and it's actually tasty. Good staff and quick service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3RfE3tw-icJ-5gUt4v8TQ"
  },
  "iwwxvaKVcghAhSnd08PuuA": {
    "date": "3/20/2012",
    "text": "Food is Good, Not GREAT, especially when you consider the SERVICE is Horrible. every time you call to place a delivery the guy answering is rude and short, dont ask for reccomendations or specials, he will chew your head off. Make sure to know everything when ordering and have CC payment ready or he will lecture you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "AATHKmFxQCLKcBIuEnwycQ"
  },
  "tsepBYZgAOr4dXZz2qXlJg": {
    "date": "10/25/2010",
    "text": "Proper thin crust New York stylee pizza. Crispy on the bottom, chewy in between. Great service! Pops is the coolest guy. Bonus for me is the 2 min. drive from home.  Deep dish should be abolished from this Galaxy. I'm just sayin'........",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rc_8FQT2jeXoo6B_AfrbpQ"
  },
  "lfincw3786yn2OSjTJrhYQ": {
    "date": "8/28/2015",
    "text": "We've ordered from here a few times and the food has always been great until 2 weeks ago.  Previous times we had delivery from here the pizza has been great; the last time we got pizza the sauce was liquid, the toppings slid off and we weren't impressed.  The mozzarella sticks, chicken fingers and fries have been great - the pizza this last time was disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oai9K7yIcH6sCEk0I5nDCg"
  }
}