{
  "PYUuy_ku57-eZ7VEu6RHNA": {
    "date": "6/3/2018",
    "text": "Best Fish and Barbacoa tacos in town... Great service good micheladas. Would come back again and give it a 5 star rate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YnHoZ6DEhuQFbDOWHtJpFQ"
  },
  "ItY5qmPk5IV7PRp6wBZebw": {
    "date": "6/6/2018",
    "text": "The staff was so nice and helpful! I got the Asada Gordita and the fish taco and loved both of them. My daughter got the Barbacoa taco and also enjoyed it. Very good prices for what you get.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pFK3sTFoOuNibT4YekYn_A"
  },
  "zURaVXaB8qyev3HArhrD8Q": {
    "date": "5/19/2018",
    "text": "Love their tacos! Been going for years & never a disappointment. I just wish sometimes they were opened later lol but that's just my fat side speaking",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-n23YwUw68zHQjuY9yv99w"
  },
  "gRSRbM5IV-e287xmS1Ym6Q": {
    "date": "11/21/2017",
    "text": "Sunrise Manor is full of good tacos, but these may be the best. The barbacoa is divine. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHlGC-bEU6d-1WhQJworzA"
  },
  "-nAuRouFz0UTaPmjj_cg4Q": {
    "date": "10/20/2017",
    "text": "The food here is great and the service is fast and polite. I get there asada torta almost every time I visit because I love it so much.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "SvW1e1h0N47TkAcAuWGKqQ"
  },
  "3Usov9guIv39bJiovbHTCw": {
    "date": "9/17/2018",
    "text": "I really enjoyed this place!! They were friendly and our food came out quickly. Their homemade tortillas are awesome. Definitely going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mohg5CHpXVCdumkg2gSARA"
  },
  "BZ99ukIkvJADrISKCggrjA": {
    "date": "7/3/2017",
    "text": "From Paramount, California everyone in Vegas this is a must for me the menudo and the chili Verde chicharones off the chain so yummy hmmm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IrU-LyAepet84qTqUmVLGw"
  },
  "K3nwqTjH3SfqA59mvmGhVQ": {
    "date": "5/4/2018",
    "text": "Food is great!!! very fresh and always consistent. I love the fish ceviche and it is always fresh any day of the week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XabuZ5FSc_u78SpyxLuHg"
  },
  "8LZJBpCUAPc7akzKS7wahg": {
    "date": "6/13/2018",
    "text": "Best tacos ever... drove all the way from California to try them... did not get disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ByGqi_-G8jnSTEMeqpQWg"
  },
  "Icr_FequIrplw83Pm4N8Rw": {
    "date": "9/1/2018",
    "text": "I love the Hot Cheetoh tacos! Thank you for some of the best tacos! The churros and flam are on if the best thing you have!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4AnV5TU9ufybeCYtqWRjg"
  },
  "je86G4q6MJhfi4UOT_IvuQ": {
    "date": "11/2/2017",
    "text": "I absolutely LOVE abuelas tacos! If you're looking for REAL Mexican food this is 100% the place to go! My favorite thing from here is the pozole it is so good and they always have handmade tortillas and it's not pricey at all I wish I had this place in my kitchen!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wBKQPPcEyfm6tqIkNOJP1w"
  },
  "C6hn33Gro8vVqEAqfX9hVw": {
    "date": "4/6/2018",
    "text": "Great place to go eat some authentic tacos and homemade tortillas!  Everything was delicious had tacos, carne Asada fries!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hkvU3W3VlZv8fo96iuiyKQ"
  },
  "tsLC7FfO4n0tbb6lhSQ4Wg": {
    "date": "11/2/2016",
    "text": "Very good food and staff. family recipes and hand made tortillas. Found this place while working in Las Vegas and it is worth your time if you enjoy Mexican food.  Keep up the work!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqhCET1bDyU7ve5bTn-leg"
  },
  "ji89y_lyBKrwrhHK62mJ1g": {
    "date": "4/14/2018",
    "text": "I've been craving authentic Mexican food for weeks and this finally hit the spot! The handmade tortillas were an unexpected bonus too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zRfxNOLHKtoiycQqoiGI2g"
  },
  "C5mqON9C2F3bI80PURym7w": {
    "date": "10/27/2015",
    "text": "I was a bit apprehensive trying this... Sometimes I get fooled by Yelp reviews.... Not this time... It was refreshingly outstanding... Service was very good and the place is clean and near my house. I ordered the Asada enchilada combo with green sauce... Had a nice kick to it and was delicious!! I am picky about food but this place absolutely rang the bell for me. The rice and beans are normally a throw away... Not this time... I slicked the plate clean! Do a check in and get a free churro.  Like Arnold said, \"I'll be back\" My only reason for 4 stars vs 5 is that the plastic utensils are worthless.... They cannot even cut the enchilada...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gy6W9VtYtsYObtiNe1C4EA"
  },
  "kWU7v8K21TqkuRIk6LayIg": {
    "date": "4/25/2015",
    "text": "I've have seen this place many a times and never thought to stop by. I even had my windows tinted years back next door. My boyfriend said he was taking me somewhere to eat after Costco this morning and this is where we needed up at. The area is a bit out of the way for me but it's well worth it. I had no idea what to order but my boyfriend had mentioned all their tortillas are handmade. He mentioned the Gordita combo and it sounded great so that's what I ordered. He ordered menudo. Available on weekends.   The Gordita combo comes with beans and rice,a Gordita which is like a sandwich and a taco. For the taco I got Barbacoa and the Gordita I ordered carne asada. The Gordita was stuffed with meat, beans and cheese along with lettuce tomato and sour cream. The bread in the Gordita was perfectly fresh and soft. The taco was dripping with meat juice from the Barbacoa and the tortilla was fresh and hot. Beans and rice were standard but well done. Boyfriend thoroughly enjoyed his menudo and even though I'm not a fan, I appreciated the fact that it wasn't swimming in oil and fat. They offer salsas by the register. There were three to choose from. Green salsa verde standard, a red sauce not very spicy but garlicky and delicious and a creamy orange sauce super spicy I'm guessing it was habanero. I ate a bit of it then switched to the red one because I couldn't handle anymore. The red one was overall my favorite because it had a very nice garlic flavor to it that I loved. We'll  definitely be back, my pregnant taste buds appreciated every morsel and my picky palate is hard to satisfy these days.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "j8GLfdK7_K1Wv0tX0ovY2A",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. They are very good indeed.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j8GLfdK7_K1Wv0tX0ovY2A/o.jpg"
      },
      {
        "img_id": "80_2031UyBN-Kj-Phq7JEw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Menudo. Not swimming in fat and oil like other places.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/80_2031UyBN-Kj-Phq7JEw/o.jpg"
      },
      {
        "img_id": "ADKLPjeintXcsguArKCZXQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Gordita taco combo. Barbacoa taco, Asada Gordita. Freshly made to order tortillas. Yes please!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ADKLPjeintXcsguArKCZXQ/o.jpg"
      }
    ],
    "user_id": "r0j4IpUbcdC1-HfoMYae4w"
  },
  "zF7qCeIC5jal8kYQ0yfUhQ": {
    "date": "5/13/2018",
    "text": "Such a cool find. The food was amazing, and the service, equally amazing. Our server made spot on suggestions, was friendly, and the food was ready quick! Thanks for a great meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3iTAkMhj6758aiVQ8TVC2Q"
  },
  "la89b6YSibR-UJtdquGEgw": {
    "date": "4/29/2015",
    "text": "This is it! My new Mexican food spot. We've been here twice so far, and we are seriously impressed.   The first thing that has impressed us both times as we've walked in was the overwhelming friendliness of the staff. You are literally made to feel like family. I'd be hard-pressed to name another place where everyone there is so cheerful, helpful, and friendly. It's like they honestly enjoy working there, lol.    Friendliness is nice, but if the food sucks, I'm still not coming back. We've tried 4 different combos, and they all rocked. Last time I got the burrito, and this time I got the quesadilla (stomach is still a little tender coming off Hawaiian fish food poisoning). Both were really good. BF is hooked on the gordita. We both got a churro last time- we got the nice surprise that they are caramel churros- even better than they sound. Unfortunately their flan is so popular that they were out last time, but I got some today- I don't think I've ever come across a flan that was creamier than this is.     The decor is pleasant and the environment definitely matches the theme.    I think what pushed it over the edge was how incredibly nice they were to me in helping me out with my tender stomach- this was the first solid food meal I've had since the food poisoning, and by far this was the right place to go to.    Thanks, Ladies. We'll be seeing you soon   :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "62c0jTJbR29yCddScmZG2g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Truly homemade flan, $3",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/62c0jTJbR29yCddScmZG2g/o.jpg"
      },
      {
        "img_id": "tCRdW3DU5RIm6awJtLOxcA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Churro  :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tCRdW3DU5RIm6awJtLOxcA/o.jpg"
      },
      {
        "img_id": "6SWbD_yVLZ5Wz3-N6m7a-w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6SWbD_yVLZ5Wz3-N6m7a-w/o.jpg"
      }
    ],
    "user_id": "nr2QuEyY_ZKicxnF4eCmLQ"
  },
  "xreWZmJQ3GbCVU-y8tUgnw": {
    "date": "3/11/2017",
    "text": "I came for the menudo .. it's good , not great . It was served almost warm . I should have took the bowl back and asked that it was served hotter.. it is served with cilantro, onions , and 2 wonderful homemade warm corn tortillas.. the menudo is good .. l just can't find GREAT yet here ..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_OSus7feCaXopUvS-w7EHg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Menudo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_OSus7feCaXopUvS-w7EHg/o.jpg"
      }
    ],
    "user_id": "RzMq9tHzxZoo3bHfn8Vu1w"
  },
  "vv8NF13Qj8VoAn-kTbu1RQ": {
    "date": "5/22/2013",
    "text": "Fresh homemade tortillas anyone?  I think thats all they really had going on here. The meat in the Chicken Bowl(6) was dry as if it was sitting out. Tried their Fish(6) and Shrimp(7) taco which werent too bad. Decorations are pretty and give the store a more welcome/clean look.  Had fun chatting with my Yelp buddy too!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pIKTPxogIVZEnrkNrtnDMQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Chicken bowl. Fish taco. Shrimp taco. Free churro.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pIKTPxogIVZEnrkNrtnDMQ/o.jpg"
      }
    ],
    "user_id": "A1yK1QyPaahfwp38zqn2Bg"
  },
  "cxF9JbW8fxwWkpFS2FDJ3Q": {
    "date": "1/20/2014",
    "text": "Don't let the small size keep you from eating some of the best tacos within our borders. Fast and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsMg3By4RjU7mLZIOVDyKg"
  },
  "K9BJNBzAfzeEAThCkW3QRg": {
    "date": "6/7/2012",
    "text": "This place is amazing. Hand made tortillas and amazing food! Love it. Finally a legit Mexican food place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "gtwWHvJbNJcB5_v7mawWrA"
  },
  "BOKqHU2j2j1dcD6cXOCDvA": {
    "date": "11/3/2013",
    "text": "Oh man is this place good! Every thing is fresh and tastes slow cooked. the beans are the best i've had, and the lenga is melt in your mouth tender!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1vscIC7QSmvMrikAR54o1Q"
  },
  "MXAfZwyWH5aDtYM_WKNRXw": {
    "date": "1/20/2013",
    "text": "Best Taco's and Ceviche love the homemade corn tortillas this place never dissapoints. The Service is always excellent very friendly and welcoming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiBjQgWuZKmICBLejY0siA"
  },
  "gF5XuVpSNv83aV6Vmqptvg": {
    "date": "1/14/2012",
    "text": "Got the shrimp, asada, chicken and fish tacos. The tortillas are to die for! Went back and got another shrimp and asada order. Been to Los Tacos, Wahoo's, and Zabas. This is the best so far in the Vegas Valley!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cilFYR79uwgi2KUQfbmCdw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Fish, shrimp, asada, chicken tacos. As good as it gets!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cilFYR79uwgi2KUQfbmCdw/o.jpg"
      }
    ],
    "user_id": "0bxhFDejroFj6hNLcGK7ZQ"
  },
  "3DktTztVjBmooAhJrYTAvw": {
    "date": "7/23/2012",
    "text": "After seeing the good reviews we decided to try Abuela's. First impression when I  walked in was comfortable & welcoming. The cashier  (could of been the owner, with the passion & pride she showed for ingredients and menu items) was very welcoming, and after quick chitchat finding out we were new customers she was very informative on ingredients and preparation for items we picked.  I wasn't quite sure about the combination of ingredients for my shrimp burrito. It was great. It can't be compared to other shrimp burritos I've had in the area because Abuela's shrimp burrito has a different flavor combination that's refreshingly different and it does make other shrimp and rice burritos seem plain. As for what my family had, I can't remember. We didn't share and no leftovers. Lol.  I wish We would've tried Abuela's sooner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "reDk21yGrkUGAVZx4Fg8Tw"
  },
  "H2cEcfECNJyifO_Q4A8P3w": {
    "date": "8/15/2012",
    "text": "Steak burrito was awesome.  Highly recommend the menudo as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "du6dytVw-4nNW1SKuzOwNg"
  },
  "Cyg60zXpLRNYpaJL2kenvg": {
    "date": "3/27/2013",
    "text": "Love their food! We tried the tacos (carne asada and Barbacoa), salsa and chips, and a shrimp tostada. It was all very tasty and we will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BQW30_rGFFhYyv6gNTuTw"
  },
  "EwLOXNvWFNx0TcF54qOrYQ": {
    "date": "8/7/2016",
    "text": "had 10mins before the bus so I ordered carne asada fries to go. restaurant wasnt busy (3 other people there) and I've always been in & out of robertos and viva el taco in less than 10mins so albeit risky I wouldn't have come if I didn't think it'd work out. 10 minutes came and went, as did the bus, and after another 10 minutes finally got my order (staff was polite & very apologetic). next bus came in half an hour so I ate it here and it was delicious  fries were steaming hot and covered in TONS of warm gooey monterey jack cheese (unique--ive never seen on carne asada fries before!) and all the other toppings too. not a /whole/ lot of meat but it was perfectly cooked & tasted just like asada I ate growing up. generous portion too--I'm the only one I know who can finish an order from viva or robertos in one go but I was starving and still only managed half of this!! I'd give 3.5 stars if I could. GREAT food different from similar places and friendly service too but rating 3 stars instead of 4 bc waiting 20 minutes was kinda sorta ridiculous. will definitely be back sometime when i get a chance!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKpLT1Je03t7BNP_7Fyd9A"
  },
  "g3HSQe_H3P0WeMC5v6Hpdw": {
    "date": "7/7/2014",
    "text": "Great place! Everything is good, not to big of a fan of the barbacoa though.  But everything else is amazingly good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYQbKLk6sKYOKxKTPS2Aew"
  },
  "PX_4NpvUbFThKbkKc4cNOA": {
    "date": "2/17/2012",
    "text": "Although, it's all the way on the east side - a pretty good haul for me, I've been here a couple times with my son for carne asada burritos.  Great flavor all the way around.    The only reason I'm not giving more stars is because the asada was really tough and gristly -- both times.  They use cheap meat.  Great horchata & great salsa!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Io6WpnGPg57Fq25v_b4Kyg"
  },
  "_rnahDojXIF7PPouuZxo2g": {
    "date": "8/10/2012",
    "text": "I was really excited about trying this out bc of the reviews... I ordered the shrimp quesadilla combo. The price was awesome but I was disappointed in my meal. It was kind of bland. Service was great so I'll give it another chance and order something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXWbfXVGjegNL1nRSkL1Pw"
  },
  "JBJGTLrrPswSvHMRBkGEqg": {
    "date": "2/6/2015",
    "text": "This place has some good tortillas for the tacos! They're homemade which is always a good sign. The tortillas are thick which helps them not fall apart. The carne asada was of good quality beef for the price, unlike other places that used cheap greasly beef. The shrimp tacos are made with deep fried breaded shrimp which I did not know because they aren't advertised as such, but they were still good. All in all they were good tacos, for a fair price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ey7I8HrjnmfPWURkEDBTPQ"
  },
  "kYD_N1DqX0DVzzGldAP84A": {
    "date": "1/9/2015",
    "text": "Abuelas Tacos is the best Taco shop in Las Vegas. Their food is delicious and the staff is awesome! Their food is made authentic and everything they offer is delicious. They really care about the Las Vegas community and their customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6GFSDoHl2Z1eQsyZ5G-0Q"
  },
  "PztxTmOc-3ODdlilMnN8hw": {
    "date": "6/23/2012",
    "text": "On this side of town where decent food places are few and far between, Abuela's stands out as a total gem.  We went for a terribly decadent lunch choice that involved the asada fries and a steak quesadilla.  The fries were as great as it gets - huge portion, fresh guac, fresh pico.  The quesadilla was also wonderful with it's fresh tortilla.  The staff were older ladies, very friendly.  I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lMRtPdqFb56xtP8OxaYR6w"
  },
  "2zAOcuBHgXyI2t8fFGhYkg": {
    "date": "1/24/2014",
    "text": "After reading reviews, we choose Abuelas for lunch on our way out of Vegas.  The whole family loved it!!!  Amazing food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ww-kvj7eLGKHvMMo_lT1pg"
  },
  "_mGQAoEM47BgmY61nIzDyw": {
    "date": "7/4/2012",
    "text": "Best tacos ever! Homemade tortillas, and the owner is really personable. Fantastic service, food, & overall experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhOfwI_B6wJMK812Bzc9yA"
  },
  "zUUctsaaI_PdQchioQTkPA": {
    "date": "2/18/2013",
    "text": "I haven't written a review in at least over a year, but this place was so delicious it compelled me enough to get on here and make a statement. This place is by far the best Mexican taco shop in town! And I mothereffing love Mexican food with a passion. Add to the fact that it's a mom 'n pop place, with all abuelas cooking in the kitchen? The tortillas are hand made, all soft, warm, and will make you salivate more. The fish taco is a reason to venture out to this east LV location alone. The gorditas are super filling, I had the chicharone one last time, and it nearly put me in a food coma driving away. The carne asada is juicy, flavorful, and not dry/overcooked like at other places, I love homemade refried beans and this goes right up there with my favorite beans in town from Pepe's Tacos. The only thing I didn't love about this place are the tortilla chips. They weren't bad, I've just had getter chips elsewhere or at home. But you know what? It's a freaking tortilla chip. No big deal. Well worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "T5vVvAqlZiKcPIXS857kQg"
  },
  "PRwnUqK9F6DF53jIN11NJg": {
    "date": "9/19/2012",
    "text": "After seeing an advertisement on a transit stop, I decided to stop and try the food. First of all, I was greeted with a smile and great conversation. As I ordered my tacos (Lengua, Fish, and Chicharron Verde) I didn t notice the young lady making FRESH tortillas for my tacos. My food was ready very quickly...I made it home, propped up on the couch with my tacos and OMG!!!!! They were AMAZINGLY GOOD!!! The best I ve had since moving from Los Angeles. The fresh tortillas, perfectly seasoned, fresh meats, pico de gallo.....everything was right on point. I will DEFINITELY be going back OFTEN!!! Abuelas Tacos gets 2 thumbs up and a HIGH FIVE!!!!! I totally recommend them :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9BUyjaJbjDb-H2P2OpMREQ"
  },
  "QZL-E-DsYB-Ko7qBfLn74w": {
    "date": "6/4/2012",
    "text": "Clean restaurant and incredibly tasty food. It's a must eat place for me, even though it's 10 miles out of the way!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ETcumjPCkLLvb7xSsqLOuA"
  },
  "Alpq5yPK7mdsEOkNrjxwPg": {
    "date": "8/30/2018",
    "text": "One of the best mexican restaurant in town! Not only writing this review because of the free churros but writing this because they deserve to get this 5 star review! Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TRdINN3Ui3rzJCeo0onZ8A"
  },
  "uOEyXBp0wjikNSWP4rW_ag": {
    "date": "8/30/2018",
    "text": "Amazing food!!!!! The food is more like what im used to in Los Angeles! Prices are great to! Also love the salsa selection!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bLdRosP3ug7Bg8XARSYcqA"
  },
  "gBONiy8UzSPyD35bTPZhQQ": {
    "date": "12/29/2018",
    "text": "I havent had abuelitas in a while.. I forgot how good it is. Good food, sweet people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Wzc4mZjDDLmPYVq5q4fuQ"
  },
  "w5114UbYSC7Ovjpb2NBe3A": {
    "date": "7/22/2018",
    "text": "Amazing food! Great service! Friendly place! Tastes great! Love the owner! She remembers her customers every time they come and things they order. Love that!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5-WuyTOcwEF-X88MI_Rsvw"
  },
  "g0IOP5g4ZaWcn19XbHt-3Q": {
    "date": "9/20/2018",
    "text": "Abuelos is amazing. I have done both dine in and cater business with them and both were a homerun.  Leslie has created a great culture in her restaurant and it shows. The cater I mentioned was for my wedding. The food was delivered on time,  with proper condiments, fresh and seasoned well!!! If you're thinking of going here, do it you won't be disappointed *",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7L9OJf_-B5es9qDOj5Pvw"
  },
  "cfzMgGJ5pHjawV2QpHkYLQ": {
    "date": "9/8/2018",
    "text": "My wife and I were referred to visit this little gem and we are so glad we took the advice. The food is fantastic, the staff are adorable, helpful and super friendly. We had a wonderful lunch break and the vibe put us in a great mood. I can highly recommend Abuela's Tacos if you're in the mood for quality Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vhAS6XGtwGHpMLlSfWjsoA"
  },
  "uTFEENvvb-G1msMkdPgBYQ": {
    "date": "9/17/2018",
    "text": "I was driving  by and saw this place after craving tacos for a week and it was definitely worth the u-turn and stoped by I got the bowl and the hot Cheeto tacos and by far one of the best tacos I have had in Vegas. ! They are very nice and kind inside also ! Decently recommended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MaA8cmPSdIb740G0o4sIVA"
  },
  "3M5heGYpkRciX1K3eZWI8Q": {
    "date": "9/14/2018",
    "text": "Wonderful little family owned taco shop.   Everything I've had so far has been delicious.   I came from Texas and have been missing my local taco truck.   This place definitely hit the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sy3rRrGtCuNd-6HFVeJXjQ"
  },
  "HaUjxdm_Aots2TN78xCHSg": {
    "date": "9/25/2018",
    "text": "Love love love Abuela's. I eat there a few times a week. I walk in they know my order and treat me like family. The food is amazing and fresh! I see them cooking the food like my mom and grandma would. Maybe that's what the special ingredients are :-) Growing up in a Hispanic home has made me picky about restaurant food. Abuela's gets all thumbs up in my book. See you tomorrow",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nNpgnFl4_3IjFDC3cINj3A"
  },
  "3G9rJ0U819yHmIM8ID1b-g": {
    "date": "7/26/2018",
    "text": "They're great at resolving mistakes! I appreciate it. We came here last minute and my Family loved their food. We will be back again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_eKzZVsuUyDbXkq6nr01g"
  },
  "ILxpfNnpTYqPgtbRyP-Tbg": {
    "date": "8/30/2018",
    "text": "This place seriously F'ing kicks a$$. Steak tacos were fantastic as well as the salsa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nrlDlVpcsR7k7lGngEyqQw"
  },
  "ed36rE8Rv3hozrXCoXg27Q": {
    "date": "9/20/2018",
    "text": "I adore this place, feels like home with my tias. Everyone is very kind, answer my questions and will customize any order when needed. Food is fresh and if by any chance you didn't like how something was done, they fix it no questions asked. Everyone greets you and treats you like a guest not another number. Home of hot cheeto tacos I mean c'mon how can you not try it! Thank you for great service always.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R8_MlZUzloZV-dycJhYJLA"
  },
  "k_123CtSYRn6z0cA-P7j7g": {
    "date": "11/18/2018",
    "text": "It didn't live up to the hype but the management is genuine and that means something",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rSjwZZNNYkiWIs0dIdPBTA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rSjwZZNNYkiWIs0dIdPBTA/o.jpg"
      },
      {
        "img_id": "_B0G9ZAVWoMKAyxuSK3WGw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_B0G9ZAVWoMKAyxuSK3WGw/o.jpg"
      },
      {
        "img_id": "EDIu4mzKFwtJYox4hSQGGg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EDIu4mzKFwtJYox4hSQGGg/o.jpg"
      }
    ],
    "user_id": "RIAyIJgnRBIa7WT2fQrvCw"
  },
  "m4rWw8m4aa4euIroXA9YsA": {
    "date": "10/6/2017",
    "text": "I heard on Facebook that its one of the best taco place in Vegas, so I finally tried it.  I ordered 4 carne asada tacos to go with \"everything\" on it.  \"Everything\" on it... but it DOES NOT come with Guacamole. LOL  They make handmade tortilla... it was good! But the carne asada meat is bland and not juicy.   The taco is pretty much tasteless and dry. I \"think\" (not 100% sure) its because they cooked a big batch whenever and just let it sit there, unlike other taco places.   $2.50 per taco (decent price for the size), but I can get with the same price, better seasoned, and freshly cooked carne asada meat with \"Guacamole\" at Pepe's or Tacos El Gordo- and they cook the meat there when they get orders and not make big batch.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QwN2J6E-0U3gnoZXfICq6w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. The carne asada is okay! Taste bland, not juicy, and &amp;#34;everything&amp;#34; on it means no guacamole",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QwN2J6E-0U3gnoZXfICq6w/o.jpg"
      }
    ],
    "user_id": "K-6hCQ6loRdQcIU3KTV_Ig"
  },
  "2vS80pr3TeBeJcjiq3MAPA": {
    "date": "7/5/2018",
    "text": "Ok honestly wow! You guys gotta check this place out they have the best hot Cheeto tacos. The meat was so tender not lacking any flavor. There michlada was honestly the nest one i ever had i drank mine so fast before the food even got to us. There gorditas are really bomb as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2ToQ5eT91v2hkIT7I4X7g"
  },
  "g-TNEZGEdmI8npl1kxxSmQ": {
    "date": "7/6/2018",
    "text": "I had the asada enchiladas with beans and rice, the chili was actually hot! I was very happy with my food. I love when my chili has a kick to it and doesn't just taste like tomato sauce. I definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "85s-omBPo9lKWJfCz0qrhg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/85s-omBPo9lKWJfCz0qrhg/o.jpg"
      }
    ],
    "user_id": "OmRBk3vw1lrOaQCxvWumFw"
  },
  "ob_oKaShY9E_Da7ZZdEVjg": {
    "date": "8/17/2018",
    "text": "San Antonio is known for tacos, AND we love visiting Vegas. Abuelas is even known in San Antonio as I see facebook friends always checkin in at this little hole in the wall amazing place! Employeed by grandmothers, what a great concept and they had a car wash going on the day I visited to help a family in need, love that they help the community too. I had the Al Pastor tacos, generous serving of 2 tacos with hand made tortillas, rice/beans and chip& salsa for low cost. LOVE IT. My husband had the shrimp cocktail and loved it too. Place was super clean, gets busy at times but they are making everything fresh so worth to be patient. I recommend this cute place to not only the locals but tourists too! It's off the strip but TOTALLY worth the trip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7aVC9Ao1sYYGAYJV39U4Q"
  },
  "8M3yLruiIydaAE8IDI0WQA": {
    "date": "9/6/2018",
    "text": "My go-to spot for a quick bit , I work in the area , so it good and convenient for me. I usually get the steak quesadilla or burrito. My son loves the quesadilla also. Team green sauce lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aYMMgtfJRhibP5AavyVoDg"
  },
  "ohsBuz1hSdgFb5VDtaJSVA": {
    "date": "8/24/2018",
    "text": "Awesome food Awesome atmosphere.  The green enchaladas i bet are as good or better than,anyone in las vegas. Located at lamb and sahara   they have a fountain drink machine in lobby.   A+  Come by check them out. Great food killer burritos carne asada. Hands down the Best Carne Asada Taco ive ever tasted or eaten AMAZING",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzpFv5GP5vzEOY2xYg1s2Q"
  },
  "eV_6mupgpajn1Nu-xsJ6nA": {
    "date": "9/5/2017",
    "text": "I order through uber eats. Carna Asa Nachos and a Quesadilla. The meat was rotten. Smelled bad it made me gage!!!! The Quesadilla combo came plain. No sour cream and guacamole. Stale chips and bad salsa.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NG76pA2DV2EQgM1Y4L_qJA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carna Asa Nachos with old rotten meat. Dried up beans!!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NG76pA2DV2EQgM1Y4L_qJA/o.jpg"
      }
    ],
    "user_id": "anwmW5m3Q_ZvDK50-RMGbw"
  },
  "vRBclitPbSSNE8hvVyd7mQ": {
    "date": "9/26/2015",
    "text": "Literally 3 grandmas working here, food was pretty good and very nicely priced, service was definitely better than anywhere I've ever been, highly recommend this place, yumm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OLJUOM2uMw_00tBxnMmrTg"
  },
  "aO61ib5KWlVvrAjrVHXe3Q": {
    "date": "3/16/2016",
    "text": "I was hoping this would be my go to place for good Mexican food based on all the reviews.  So disappointing.  Tacos and enchiladas were our selections. If you're looking for good food at value pricing look elsewhere!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLvEcHoPxez1rI5LHU4pfA"
  },
  "-f9Bb8bIuXTfQWyDzypcfQ": {
    "date": "4/29/2015",
    "text": "After finally ridding myself of the heartburn that I've had for the last 2 days, I decided to venture off on another food adventure to a place called \"Abuela's tacos\". I was surprised to see an older female at the stove tending to whatever was in the pot. Another woman appeared and took my order. She was very pleasant and informative when I asked her what they put in the tacos. The first thing she said was that the tacos are not spicy and they don't put sauce in them.  What a relief ! !! Anywho, I got the number one which is your choice of any two tacos, plus a side of rice and beans, and a drink.  This meal only set me back 7 dollars. The corn tortillas are home made and they are the best tortillas you will ever eat. I got a fish taco and a taco de asada.  After picking off the cilantro, I dug in. Both tacos were delicious!  The fish and asada were perfectly seasoned(not salty), the rice was not soggy, and the beans were so fresh. I checked in on Yelp so that I could get a free churro with my combo meal. My only complaint is that they don't make their own juices. If you want authentic Mexican food, go to Abuela's Tacos. I promise you won't be disappointed. The food is just like how grandma used to make it. Not my grandma, but somebody's grandma",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mq83zbvH0qOkTCn3-iwHEA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. #1",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mq83zbvH0qOkTCn3-iwHEA/o.jpg"
      }
    ],
    "user_id": "fLnkI1uHtXEsjtF6KoBHbQ"
  },
  "_GftNLxEuS5fTjG8W87K8A": {
    "date": "4/30/2016",
    "text": "Every time I have been to Abuela's Taco's it has been a great experience. I love  that the tortilla's are homemade there at the restaurant. Service is nice and friendly we well. Whenever I have a craving for Taco's, I always think of Abuela's first.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Djvw1BzkhMJbvm6FHqNQg"
  },
  "PPpMD9szTHmJNwCMMM2n_Q": {
    "date": "9/24/2016",
    "text": "The burritos were great in size and filled with a good quantity of cheese and sour cream.  The Guac was extremely fresh.  I ordered the california burrito and was disappointed in the amount and quality of fries that were included.  Next time, I won't order fries in my burrito.  But the asada was tasty!  I also tried the veggie burrito and it tasted super clean and non-meaty.  I enjoyed how much pico, sour cream guac and cheese were included in the bean/veggie burrito!  Salsa was also on point!  It was garlicky and fresh!  Prices were approximately $6-7.50 a burrito.  They charge you when you add additional items like sour cream and guac.  Still not bad.  I'd come back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ptv3b4b_nbpF0SlTWlUdWg"
  },
  "wG4TwQ51PPs_okaA53NVdQ": {
    "date": "4/14/2016",
    "text": "Undeniably great food. Try the tortillas they are made there and are unbelievable. Great preparadas guacamole and salsa.we drive 45 minutes to get this awesome food. If you haven't tried it you need to.the carne asada is so so good as well as the chicken. Once again great great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AcaK9H4TbklooeWEnDiE7w"
  },
  "R1_SM-a6wsVKCPfuMvpZ-Q": {
    "date": "7/13/2015",
    "text": "Nice and SUPER clean restaurant, the service was exceptional, marie was very nice. I ordered the carne asada tacos and gordita combo with chips and salsa and a drink. The carne was top quality 5/5 and the meal was huge! I think next time I can just order a la carte and be perfectly satisfied. Chips and the salsa was just ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IVMyXI7PoDXcp2mc8Qsaxw"
  },
  "K6v8wTtZ5SZrVj9dpqG8WQ": {
    "date": "3/8/2016",
    "text": "Fresh and fast! I am never disappointed when I come to abuelas ! The gorditas are the best! If you are ever on this side of town you must stop here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MYmaimq7awhugskP7vLiMQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Bomb.com",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MYmaimq7awhugskP7vLiMQ/o.jpg"
      }
    ],
    "user_id": "EBzQIjwLyxD8ReYnizfF3Q"
  },
  "26moixR9zeJMyVtnVHolLg": {
    "date": "7/3/2015",
    "text": "This place is amazing, but the amount of food isn't always the same. Sometimes you get more, sometimes it feels like the taco and burritos are empty and for the price, an empty taco isn't worth it. I'd say, figure out a size and keep it that way.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBe9fodpxpxMpi4vck6VHw"
  },
  "4XARazEL5UXemAj4DhZXhw": {
    "date": "8/13/2015",
    "text": "My Family came out to Las Vegas for vacation staying off the strip. I searched for restaurants and the name Abuelas (Grama ) caught my attention. After 4 days in Vegas this was our best place we ate at for TRUE Mexican Tacos. They make fresh corn tortillas for the tacos with authentic taste. The asada was made right and the chicharron verde fabulous. Try the flan before leaving. The ladies are real Abuelas making the food. You want to know the real deal, come to Abuelas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDJPILgaU7YAYkAkNWNqoQ"
  },
  "-CfMPIs5_9RWnUbOgaBsKA": {
    "date": "1/3/2015",
    "text": "When it comes to Mexican food I food I do not eat it often. Therefore I am really picky. Only when it comes to Mexican food.. My husband and I never heard of Abuela's before, we were just hungry and saw this on our way home. We stopped in and it smelled so good inside. Like our moms kitchen. We order our daughter a Quesadilla de Lengua and I got a carnitas burrito and my husband got a burrito of barbacoa.  Let me tell you that my daughters quesadilla was so bomb. I wished that she didn't finish it so I can finish for her. It was amazing. It came out hot and cheesy. The cheese was so good.  My burrito was also yummy. The size was perfect and it didn't fall apart.  We went back and I got a Gordita de Chicharron and language taco. I loved the Gordita. You can tell they make everything from scratch.  The Lengua was tender and juicy. My husband and I are always pleased and are surprised that we don't go there as often.   I really like the fact I always see women working the kitchen in a lot of Mexican restaurants it's always men. I feel like it puts a \"motherly touch\" in our food ^.^",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BGwwoQ06R348ktKbvo8pTA"
  },
  "VHt9kg_yvp_2pHnUh-rLTw": {
    "date": "9/18/2015",
    "text": "Enjoyed myself from the moment I walked in to the moment I left. The food and service was and is excellent. They walked me through the menu, explained the portion sizes. Was a great experience can't wait to go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "miJszi-cAWF9myRi7F1ffg"
  },
  "x0_-VrjmKBS2ER7ngKlAkg": {
    "date": "10/22/2015",
    "text": "Unassuming, little strip mall joint making maybe the most delicious retried beans I've ever had. An asada torta with fried cheese?! Heavenly. Flautas that melt in your mouth. Super clean, great service... I can't wait to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhLB4wkLKjUZb9lbqkxGfg"
  },
  "K9jt9zDnSWH0sCY1gQrkVg": {
    "date": "5/11/2015",
    "text": "Great tacos best in las vegas! I love how the tortillas are hand made, thats the classic touch of the abuela ;). Great place i highly recommend this place. I just wish they had tacos al pastor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9dF1yuEW7wGaTcmc9ASUA"
  },
  "R7LZQ-VTU__HF_8R-80Jew": {
    "date": "1/12/2014",
    "text": "Traveled off the strip for this one. Good menudo. We like to drink and love some good Mexican food after drinking all night. Looked on yelp and headed here. Delish! Thanks yelpers! Being from LA and Mexican we know good menudo :0) this was awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zGMKAHIaLPVu-7b_upo5bg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zGMKAHIaLPVu-7b_upo5bg/o.jpg"
      }
    ],
    "user_id": "usb9Qggy72lO5QIt-nSWWg"
  },
  "FoVgAjs3MGGu0FPDquaRTQ": {
    "date": "10/29/2015",
    "text": "Good place too eat..quality is always fresh. Tortillas made in the kitchen..just busy sometimes..but wait is well worth it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJcici429Ou2jGtI2xeesw"
  },
  "5v-7cKxTr6MwIuHxX0xyUw": {
    "date": "2/17/2014",
    "text": "This place is one of the best in town! The staff is very friendly and the food is super delicious! My favorite is the carne asada fries which are packed definitely a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eQGygM_Jvika74o1vy6-Ww",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada fries!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eQGygM_Jvika74o1vy6-Ww/o.jpg"
      }
    ],
    "user_id": "2W4UvRSxnkQ5q-MwVhoSbA"
  },
  "quxwkvtOiZJSMDIpn3lD0w": {
    "date": "6/5/2015",
    "text": "The shrimp ceviche was out of this world and the flan was heaven on earth good and I am not exaggerating. Prices are reasonable and affordable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybXrMlDz3W751td7szvn-g"
  },
  "KXIcfFzL6k6rMTazeL3qPQ": {
    "date": "3/18/2015",
    "text": "I'm so excited to have found a good Mexican restaurant on the east side. Awesome service, amazing food, and all at affordable prices. I love that they have shrimp ceviche on their menu! Everything tastes fresh and they give good sized portions. Their churros a must try. I will be back here often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Rw51rVP-8MNzj-qlzJeIQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Shrimp ceviche!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8Rw51rVP-8MNzj-qlzJeIQ/o.jpg"
      },
      {
        "img_id": "ZSf0xQbEOk-wFI60rtpjAg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZSf0xQbEOk-wFI60rtpjAg/o.jpg"
      }
    ],
    "user_id": "4mRn8s8SnFnqxFeb0jKZoA"
  },
  "Xxa86mhjpHgmgX0irXutBA": {
    "date": "9/3/2013",
    "text": "Best tacos in town! Great service! The tortillas are sooooo good and freshly made!! It's not best location but worth the drive to go eat the tacos!!! Yummmmmmmy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRV7SEXY_rGhqdvErXEKYQ"
  },
  "WYOwKlzMeiecaZhts3YoZA": {
    "date": "5/11/2016",
    "text": "I had the tacos Al Pastor this past weekend at the Lee's Liquor Wine Tasting and I was absolutely impressed.  I will recommend your restaurant to all of my friends and probably will never have tacos anywhere else again.  lol  I wish I had known about your tacos years ago.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "knst3K5kSWNFhUYNY1jqEA"
  },
  "_8k64P1maQhLtO_DhlEw1A": {
    "date": "8/1/2017",
    "text": "Our fist time here was an awesome experience.  From being greeted by a very friendly person when we walked in to the atmosphere was inviting.   The food was absolutely delicious.   Best Mexican food in Las Vegas.  I will be returning many many time.  Recommend  this to everyone.  Delicious A+++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5OOFWQDl89slnDnE7UWyaw"
  },
  "6Zk5wALv8Raf4KpVtqYSoQ": {
    "date": "3/27/2015",
    "text": "Food was great and had a authentic mexican taste to it. Restaurant is clean and staff is extra friendly.. Had a Gordian and taco combo and was the best I've had ever",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n_flaunalSL8qwgh6bUBsw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n_flaunalSL8qwgh6bUBsw/o.jpg"
      }
    ],
    "user_id": "kM4NdCzRrt6oZlZdNhoc6A"
  },
  "fL-ZPcpArgb3EDlDXnf7LQ": {
    "date": "5/15/2016",
    "text": "Seriously one of the best taco shops in the Las Vegas area. I usually get Carne Asada Tacos with no tomatos, not to mention they have Shrimp Ceviche all for a reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nk06xo8KkGqssYpeu4qWDg"
  },
  "Dl317jwDxUfk1_9UcLdweg": {
    "date": "8/5/2013",
    "text": "I was a bit skeptical in trying out this place. I can be very hard to please when it comes to food. I remember someone recommending Tacos El Gordo to me and to my dismay, they were the nastiest tacos I have ever tasted. I threw my whole order away and walked out. So when I stepped foot inside this joint, I was hoping I wouldn't have to do the same.  I ordered the asada quesadilla combo and  my husband ordered the asada tacos. We additionally ordered one shrimp taco, fish taco, and a side of fresh guacamole. All the food was very appetizing and full of flavor with the exception of the guacamole. It was too bland for my liking but I shouldn't knock down a star for that.  Overall we were very satisfied with our order. We will be coming back again to try out the other items on the menu. The food did not disappoint and the homemade tortillas were a plus!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "RUa2_2yuSwJtU7sTXz-omA"
  },
  "wT9dVb1yxhs4K4Z-vAx-OQ": {
    "date": "7/3/2017",
    "text": "Mmm... fresh, tasty, great service & value, what's not to love? Highly recommend this place. Set humbly in a small, unassuming strip mall east of The Strip, this restaurant is a gem. We loved every item we ordered for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NmYRA-gqn4ykLvfaMJAyHQ"
  },
  "0koSnMNy5dfSjfapzv84Pw": {
    "date": "8/31/2013",
    "text": "This place is awesome for a second I thought i was in my grandmas kitchen, the staff is nice and welcoming I will deffenetly come here again:)) all their food is fresh and delicious!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GrZa3mgAEbwW4ZMxrqM0hg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Stop by this morning for some MENUDO.Took it to go! It arrived in my kitchen fresh,hot&amp;amp;tasted like menudo should taste Authentic",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GrZa3mgAEbwW4ZMxrqM0hg/o.jpg"
      }
    ],
    "user_id": "Oc2QqAaONIW-UbOvfWZtrg"
  },
  "5U56FWoUjWFDl1agwp7uqQ": {
    "date": "3/30/2016",
    "text": "I wanted to like this place, 8 really did, but they are not good at all seasoning there food.  Watched them make guacamole which was just smashed avocado.  Salsa pretty good though. Carne asada fries almost gave me a heart attack. Way too much cheese.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SkUjCvDBA2VNnJWj8DNcdg"
  },
  "nBU-5hNZQ0dTS2zItxZdww": {
    "date": "10/22/2013",
    "text": "Good tacos are hard to find. Glad this spot (in my eyes and stomach), lives up to the hype. Handmade tortillas already gave it bonus points. The good food, service, and decent prices are more bonuses. Look forward to being a regular and trying several things from the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "egjIOKwk895XVokrEYLu9g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne Asada Fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/egjIOKwk895XVokrEYLu9g/o.jpg"
      },
      {
        "img_id": "WLf-ByHIVkEuKoHrjpwSvQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne Asada Burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WLf-ByHIVkEuKoHrjpwSvQ/o.jpg"
      }
    ],
    "user_id": "MRm9c4LGd6ImjMmt_iYY2A"
  },
  "swnYQj_sqLkdwwFYbEwBsQ": {
    "date": "3/26/2015",
    "text": "Food was fantastic just like grandma's. There really friendly and super fast service  I order the combo of gordita and taco and it was the best hand made it taste just like home.  A place I definitely recommend and encourage to come check out",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Es-3X3xnOkP4W5uzjTT5Q"
  },
  "XkwfgX3_EsPtcVuBq63u5Q": {
    "date": "1/25/2012",
    "text": "How do I love thee? Let me count the ways! 1) Fabulous tacos....carne asada, fish!  2) Homemade corn tortillas, soft,moist, delicate. 3) Homemade salsa, I could lick the bowl...oh yeah...I did!  4) Chips fresh and hot. 5) Rice and refried beans are tasty, not just a plate filler. 6)  Great prices- Combos- $7 includes 2 tacos (your choice of meat) rice and beans or chips and salsa, and a drink. 7)  Friendly owner- I felt like family. The way she cooks...I wish I was!  I love thee to the depth and breadth my tummy can stretch! And Yes, I am leaving fat and happy and truly in love with Abuelas Tacos, you will be too!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aEmTLxOsWkF_WWiGD276dQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Churro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aEmTLxOsWkF_WWiGD276dQ/o.jpg"
      },
      {
        "img_id": "PaW8BWgxkIn6s_VZF0rrHQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Chips and salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PaW8BWgxkIn6s_VZF0rrHQ/o.jpg"
      },
      {
        "img_id": "nwncajWAMi3__zMAJWWifg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Tacos combo: choice of meat (2 tacos) rice and beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nwncajWAMi3__zMAJWWifg/o.jpg"
      }
    ],
    "user_id": "tHfzfBpny0xXoxaVfAWoOQ"
  },
  "sWZvC1Ns-mbPxKH3nvrEyA": {
    "date": "5/17/2016",
    "text": "Don't get me wrong anything grandma cooks has to be delish...... too bad that is not the case for this place. Tacos are too expensive for the taste. Will not give them a second try.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KcuI-Hbz6l5MauH3XaC92w"
  },
  "wylITZRBjRNafL0pT5Iw8Q": {
    "date": "3/22/2016",
    "text": "Delicious food fresh tortillas and tacos are not greasy now that's a plus!! Carne asada nachos were loaded with everything from meat to toppings. I'll definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bihc6rtzrl9o_RJ_ZEhJMg"
  },
  "u32NuwtZS_K97yZfDuQ-oQ": {
    "date": "7/30/2013",
    "text": "This is more so a 3.5 as I really dug the fresh tortillas and the carne asada bowl was rather yummy. However I wasn't really digging the churro. Churros are hit and miss-and this wasn't Disneyland or Costco standard to me. But heck it's a churro...what should matter is the real food. So maybe I should really rate this place 4 stars.   You do get the option of what meat to get: chicken, asada, chicarron, fish, shrimp, & there was additional however I can't recall. The combos range from tacos, gorditas, quesadilla, a bowl, and carne asada fries. Combos come with a drink and chips & salsa or rice & beans. I think the next time I come back I'll try the asada fries.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "FBlKK57447Wt-EUR1TfENw"
  },
  "xiKpoaTsopgT6OwIbB9Zcw": {
    "date": "6/20/2015",
    "text": "I will make it really simple. Very Poor portions and bored staff. Food taste is not even great. I have no reason to comeback.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6NZC4uF1AlgSaley-Zi5gw"
  },
  "ye_p0N5EO1ELyQ1GYFmyrA": {
    "date": "6/26/2013",
    "text": "WOW! This is a great place to go, this is another place that I will visit over and over again. Very authentic, reasonably priced, great service and great atmosphere.   One of us had the asada taco's which were great, the other had the quesadilla which was also excellent, very filling though with the mexican style cheese. Both were cooked to perfection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-EJorVxe7h2GSxdiRyMmDA"
  },
  "UB5o3h_voB87wBFrK-y8yg": {
    "date": "5/28/2016",
    "text": "I took my kids there for breakfast. We ordered carne asada burritos and to be honest meat tasted like if it was two weeks old. I didn't like it at all. Flavorless, old food & expensive.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UZdFo-EIZrNVxvmtidepFg"
  },
  "jqlBQ9VQDXVdNn7VCSvdTw": {
    "date": "5/17/2011",
    "text": "Are you kidding me?!? This place is so deliceouso!!! I ordered the carne asada taco combo and this guys are official! Packed full of asada, pico & tasty-ness! I'm from san Fernando California so I've had my fair share of legitimate authentic tacos and this place brought me back home.....- the gang fights. I was also really impressed with how sparkly clean the bathroom was! (sorry, I'm a girl that's all about a tidy & cute bathroom) Anywho ifyour ever in the area (ie::cgr getting your glass fixed ) Do yourself a solid and get in here! Great food, great staff and nice clean bathrooms, what more can u ask for???",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kdtktMir1wlKxql27pStyQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada taco&amp;#39;s with rice &amp;amp; beans",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kdtktMir1wlKxql27pStyQ/o.jpg"
      },
      {
        "img_id": "Ow070H2clx_5eqYEKOENBQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada taco&amp;#39;s with rice &amp;amp; beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ow070H2clx_5eqYEKOENBQ/o.jpg"
      },
      {
        "img_id": "e4iQz2sF5XnVY904AkmyCw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada taco&amp;#39;s with rice &amp;amp; beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e4iQz2sF5XnVY904AkmyCw/o.jpg"
      }
    ],
    "user_id": "gNLc1atcn7jw9jxvHbDvKw"
  },
  "l4T3Ivm7KiZgrjoJ_Fopjg": {
    "date": "3/4/2016",
    "text": "The best chilaquiles that i ever taste, the rice and beans are like my grandma use to make, really homemade food great portions and excellent prices!!! I would bring my family and friends 100% great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R96UtQQz2sU5ks5WcTlAaQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R96UtQQz2sU5ks5WcTlAaQ/o.jpg"
      }
    ],
    "user_id": "ZE9p95vyrE9c_cN8QeDycQ"
  },
  "CHiVi9DKPQjK32DSs8Yw7g": {
    "date": "4/7/2014",
    "text": "What a great place.  Extremely affordable, excellent, fast service.  Asada so tender, tortillas fresh pressed, beans are excellent.  Had the asada burrito, huge portion.  No way I could finish it all.  Just wish we hadn't found this place on our last night in town.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRtMSAiuViehepUxenp0yw"
  },
  "QvgDO4c9oB3HUzwiZ_FMSw": {
    "date": "7/14/2018",
    "text": "OMG. Everything that was said.. Very very good authentic Mexican food. Fresh Tortillas are so good.. Salsas very good. Will be back when in town..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hNZdOjktl4GEMA6R7fhYow",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Split with Husband So So good..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hNZdOjktl4GEMA6R7fhYow/o.jpg"
      }
    ],
    "user_id": "gd2dUCOe2zUPc_ivjQO97A"
  },
  "Lpvd_gu_tfFSH7I5VDku9g": {
    "date": "1/17/2019",
    "text": "Their tacos were good! I love the lengua tacos and the horchata. The service is great! Everyone was nice and smiling. The only thing I didn't like was the place was kind of small and the tables are kind of close to each other.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3lOaOyu0vomtzoK6u7hlJQ"
  },
  "yFWBVgf0mEXguHfKe6m6IQ": {
    "date": "7/20/2018",
    "text": "I live 35 minutes away and this place was so good! I'm going to make this a weekly tradition to come here for good tacos and great and fast service :) thank you!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Db61cY3ggH1twCLm65Btw"
  },
  "5AQEiLm9Qia_vqZLhObL3g": {
    "date": "4/11/2019",
    "text": "Authentic Mexican food w/ real \"abuelas\" preparing ur food. The limited menu is perfect at ensuring ur burrito, taco, flauta, etc is made to order. I felt like I was back in Guadalajara, MX! Yum! I'll be back as I often get lots of rides (I am a partner w/ Uber and Lyft). Maybe I'll be ur driver one day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A7PeF8bI0hZ_7Mv9eTWPLQ"
  },
  "D6m-AfNOySBDukGJYA7VfA": {
    "date": "4/26/2019",
    "text": "I love that they actually have real Mexican grandmas making their homemade tortillas. I got two hot Cheeto carne asada tacos and they were honestly the best !  The steak has great seasoning and isn't drying at all. I totally recommend this to anyone who likes authentic Mexican tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUavn2JArmF7cMbUq-Oluw"
  },
  "bcc1dAGSPOZpn2eWy7I7pA": {
    "date": "6/11/2018",
    "text": "This place is one of the best place to get Tacos at if not the best in Las Vegas. Clean and well kept up property, super friendly workers, I felt like they treated me like family when I was there. I grew up spending a lot of my time at Latin/Hispanic houses growing up and it for sure reminded me being at abuelas (grandmas) house without a doubt.   The food is absolutely amazing. I have had most of the menu and have yet to be disappointed. The spices they use on the meats can only be found in grandmas kitchen and that's where I am reminded when I eat at this place. Although this place is small the food is one of the best I have had in Las Vegas. This is definitely a place I recommend to anyone who is looking to have a one of a kind experience in this town along with great food.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 19,
      "cool": 16
    },
    "photos": [],
    "user_id": "_GVfHFESIDKYO-WX3332ig"
  },
  "Mdg-vAjp2cV9yKwJAg8kag": {
    "date": "6/25/2018",
    "text": "Wow I don't know what to say, I'm in awe!!! When you walk in this place, you can feel the authentic traditional vibe. And the music is so chill and beautiful. The staff are impeccable they make you feel at home and you'll start appreciating your family more especially your grandma lol. If you see Tatiana make sure to ask for their specialty the Gordita. Lastly she made my visit that much Awesomer and yes I know I just made that word up right now that's how amazing she is lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "gbP0THM6xABtxM6ZiwLgow"
  },
  "x0zqAIpcRwCOHi4y2ujA1w": {
    "date": "4/23/2019",
    "text": "Abuela's Tacos is my go to for chilaquilles. They are a must try. I prefer them with green sauce but have tried them with both red and green. No complaints",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQnxrl_EbhBa8rCvwhUblA"
  },
  "j8dyTPTN2tREgDuAql6Jmw": {
    "date": "6/14/2018",
    "text": "I want to give abuela's tacos 3.5 stars, 3 stars seemed too low so i gave them a 4.I feel like i had a bit of a roller coaster experience. I came on a saturday night around 6pm and it was packed. The sole motivation for my group was to give these hot cheetos tacos a try. After placing my order despite the long line, my food came out right away, which was steange because there were at least 5 people before me that still hadn't gotten their food. We let this slide because it seemed as though they were slightly understaffed. But lets talk THE FOOD. The carne asada itself to me was delightful, not too fatty, full of flavor. But the letdown to me was the hot cheetos shell. We all felt as though it was red food coloring. There was no heat, there was no flavor, it may as well have been a normal tortilla shell. Then they advertise if you give a yelp review you get a free churro. Don't waste your excitement. It was hard, only had cinnamon on one side and lacked flavor. I was disappointed because they tried to step out of the box and weren't able to commit. I think if you are in the mood for a chip shell you are better off going with the doritos taco at taco bell. Sure your meat won't be anywhere as good as abuela's but at least you will get what you were expecting. OVERALL, i would come back for a regular meal because the PRICES were great i payed $8 for two tacos rice beans and a drink! so i say i'm 50/50 on this one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dX7nr8Co3qvR0q-v4RVi1A",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dX7nr8Co3qvR0q-v4RVi1A/o.jpg"
      },
      {
        "img_id": "-qDrb2vHM2nX6VyZewvskA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-qDrb2vHM2nX6VyZewvskA/o.jpg"
      },
      {
        "img_id": "cG4tTzT1n7I3HfewRh85_g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cG4tTzT1n7I3HfewRh85_g/o.jpg"
      }
    ],
    "user_id": "ES44985DEfdG3HVU8_Ro9Q"
  },
  "hhN9fBt4e7bq7caS_mrkSA": {
    "date": "6/19/2018",
    "text": "Been here many times and my reviews will not change, great food, good prices. Don't pass this place up, menudo is awesome, see you again soon Abuela's",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TrwR93T2apKzmSmdBhNHng",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Menudo, finally get to try it",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TrwR93T2apKzmSmdBhNHng/o.jpg"
      }
    ],
    "user_id": "UK79bUmm-F199ymaJtP_ow"
  },
  "r8XjOjMRjukbSm7ehZ7Cmg": {
    "date": "6/30/2019",
    "text": "Was going to get my windshield fixed and decided to stop at abuelas tacos. I ordered the enchilada combo and chips and salsa with a taco on the side. I got my food very quickly which was a plus but when I opened my enchiladas they were tomato red not like the normal dark red almost burgundy sauce that I'm used too. I still tried it and was disappointed that it had cojita cheese inside instead of mozzarella or shredded cheese that I'm used to.  I took my plate back up and told the girl at the desk that I didn't like it and could I have tacos instead she yes and told me it would be 9.50 I said ok and paid her. I loved the tacos but I just though it was really weird that she made me pay for them even though I took the enchiladas back. Nowhere in the Restaurant does it state what kind of cheese is in the tacos. Otherwise I wouldn't complain. Didn't have the best experience but would try other things on the menu Injust know to ask what kind of cheese is in certain items.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DcbwB8y65glBPUGcwAp2cw"
  },
  "a2AKqdNyj_Bokavalon2sg": {
    "date": "3/18/2019",
    "text": "Really good food. Nice workers. The salsa was not too spicy but had good flavor. We had quesadillas. Asada burritos and flautas. All were big portions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_OhOKDSbjQifoKOVBpSJw"
  },
  "yokkEalri3GWHXq1w5Oo1A": {
    "date": "12/8/2018",
    "text": "If you want great Mexican food this is the spot. It is family owned and it shows by the pride taken in every dish. I have been coming in for a about one year and have never been dissapointed. Great food and great service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N7hko0G6NUvmmDOT9kG4RA"
  },
  "O4i4OrI9lbeWxnUcyVU6rA": {
    "date": "12/5/2018",
    "text": "The place is small but clean. And because I am a very picky customer, it is great to go to a fast food place where the food is prepared fast but in the quality of a restaurant, and where the cooks are always friendly and willing to serve at any demands of a customer. In addition, the portions are always great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uEHCO6NUfjotZuwOxju_TA"
  },
  "nMlfyKgWDwuTWEYdcz8TyQ": {
    "date": "10/2/2018",
    "text": "Super delicious tacos! I watched chefs table and wanted try barbacoa tacos! Did some searching and decided on Abuela's Tacos!! The barbacoa tacos were awesome! Meat is tender, moist and flavorful! Also got Al pastor taco and a bean and cheese burrito! Everything was very good! Staff is super friendly, place is clean! This place is worth trying. I don't know why the other people on here complained. Try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SstmlGADYTRtz2-5KxAFfA"
  },
  "W0FbaYQuvMu7vHi_5mAFjQ": {
    "date": "11/3/2018",
    "text": "Super yummy!!!! Nice staff and really friendly!! The hot Cheeto tacos were delicious and the burritos are huge!! Will definitely come back time and time again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyrRLZfJ9eSqN86zWbhvzQ"
  },
  "Kjii1mTbQtkxIOfFNLovYA": {
    "date": "10/30/2018",
    "text": "Great service . Home made shells for tacos . And they have hot Cheeto tacos which are great . Def would come back !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSOvXjTLPt0su5qHmQbtSA"
  },
  "4edgTPNPaqsGkA4EnFoDWg": {
    "date": "8/30/2018",
    "text": "We just moved from LA to Vegas and craving some legit Mexican food. Saw some amazing reviews for Abuela's and drove on over. Loved how friendly the staff were and how clean the location is. Best thing is the fact that they allowed me to do a 50/50 split on my choice of meat in my burrito cause I couldn't decide, mind..blown...Ended up getting half lengua and half al pastor - so amazballs :) I think we found our new local Mexican fix, yay!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ffgalsV45r5-ZJH4pz7RNA"
  },
  "MM2Bmn2NFmoppEY4ZDzLtQ": {
    "date": "10/28/2018",
    "text": "The place was small but CLEAN. You get handmade tortillas, the carne asada was well seasoned and not dry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZBHFYO79ze9UnE5HI-hpg"
  },
  "s-48zilRvwVThyf6sPpV9Q": {
    "date": "10/6/2018",
    "text": "This place is sooo good! I wish there was another location in Henderson. But honestly, I'll still drive down to get some food lol not a huge fan of the churro however. But, the service is great the ladies there are the sweetest!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LuAnvEbFcFPkCqmke54EoQ"
  },
  "SEDO4BbMqjQrTwPi6ohkpA": {
    "date": "6/3/2012",
    "text": "Had a chicharron taco, Shrimp taco, and a breakfast burrito. Didn't really taste the chicharron. More sauce than anything. The fish taco was good. Breakfast burrito had rice beans n chorizo in it. I like my breakfast burritos with just egg, meat n potatoes. First time I've had retried beans in my breakfast burrito, wasn't a fan. The chorizo was tasty, egg was minimal. Thought the food i ordered was \"OK\" at best. I'd rather eat at pepe's tacos.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "1JEXL5K6VTx01tAs6Jskkg"
  },
  "B_2SAGuDwPT4U3h1Qv8i2A": {
    "date": "12/30/2014",
    "text": "This is by far the best Mexican food I have ever eaten. I ate a carne asada taco and a fish taco with rice and beans. All was flavorful and fresh. The homemade tortillas were amazing. The churro was very good as well. The service was friendly and fast. I will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMU3FfDmZj-bSzmNIkvy5Q"
  },
  "kSS7kFuxRH1K7T9XUmYN3g": {
    "date": "4/7/2016",
    "text": "Authentic homemade yumminess. Clean, friendly and priced right. What more could one ask for?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5dsBBeO51V0hdhkgSkbFw"
  },
  "X7OI4sWuGnqk2nWXVkNU4A": {
    "date": "1/8/2012",
    "text": "Wow the tacos very good, love all the food and the price nice thank you Mary Jose and Robert from Binghamton, ny",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kN5esJNp2jLKUEgKxhrKpg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kN5esJNp2jLKUEgKxhrKpg/o.jpg"
      },
      {
        "img_id": "uhFHx888QWe6ztpQF_uReA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uhFHx888QWe6ztpQF_uReA/o.jpg"
      },
      {
        "img_id": "e6Dk9VoWTJ3yfWIi2hlP8Q",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e6Dk9VoWTJ3yfWIi2hlP8Q/o.jpg"
      }
    ],
    "user_id": "PogKijXI09zYyvEXW5Oyqg"
  },
  "gJEYz83fLtq2AcpBQB5TkQ": {
    "date": "7/22/2014",
    "text": "Great food, great service. Home made tortillas. The red sauce was very tasty! I would recommend to all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ll3tesKuGFKE86MiTzwVhw"
  },
  "y70iBsqj3MMLDtXv6giESQ": {
    "date": "6/5/2012",
    "text": "Really great tacos here. Ordered the Fish tacos and the burrito also. The ladies there are really nice. So if you haven't been here check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0T2htyRbIvFZwsfMqV-Ohw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Fish tacos!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0T2htyRbIvFZwsfMqV-Ohw/o.jpg"
      }
    ],
    "user_id": "Y6pycfvqxt_ILVq3UE-KTA"
  },
  "if9HroQJHWtEXco_RtbgYg": {
    "date": "11/15/2014",
    "text": "Service is amazing, we love the lady that runs the place, she is always so welcoming. The food is just awesome!!! Rice and Beans like grandma used to make. Fresh tortillas are amazing and the fresh salsa just adds the cherry on top!!! Its a bit of a drive for us (20 min) but we are hooked now so we make the drive!!! Great job guys keep it up!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ZnxCDZvu0pNM6V2QhIRcg"
  },
  "rsIaS1LLF3MKXoBNF5iF1w": {
    "date": "1/4/2014",
    "text": "This restaurant is amongst the best I ever had. Sauces were great. Service was great. Food was outstanding. Probably more authentic then most. The place is a must ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pjXqGmxw5kSNos_emZ80-w"
  },
  "vXEXjZUaZk5-1oDQzSvhgQ": {
    "date": "10/11/2014",
    "text": "Outstanding tacos, handmade everything and made to order. They need to franchise as the only time I get to eat here is when I visit my brother across town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ml8Zptvm5l-UepZxWotNJA"
  },
  "EpSI-vKq28xc5a-mIk4Yjg": {
    "date": "4/17/2013",
    "text": "Carne Asada burrito is the best! Very friendly helpful staff. My wife and I eat here at least once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FCAQiQLvjTkt0oG4s4BgA"
  },
  "aQFg5AK8LP3l6pgRTmlWNA": {
    "date": "9/21/2015",
    "text": "Best Mexican Food in Las Vegas! I would highly recommend that you try it. After I tried it the first time, I was hooked. I keep coming back again and again. Great Carne Asada Tacos, Gorditos and Burritos. Fresh Rice and Beans. Great prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFAkgMYtIsyIJPCPgZ48Jg"
  },
  "dlzMoXNto5oHOdPs4tUCMA": {
    "date": "3/12/2016",
    "text": "I ordered Carne Asada Fries to go. Upon arriving home I realized they gave me the wrong order, therefore I had to drive all the way back to get my order fixed. The Carne Asada Fries were not even that great. My advice is check ur order before leaving this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks0HGk6sDnoc_n1_2fBEGg"
  },
  "TC2fbHYgr9rSVfgFTd0gqA": {
    "date": "6/23/2015",
    "text": "Hands down the best Mexican food in Las Vegas! My friend and I had the menudo which was BOMB! It came with hand made tortillas which made it that much better. We also ordered fish and shrimp tacos, EVEN BETTER! The flavor with the handmade tortilla & fresh shrimp & fish (which was fried) was so delicious. We will definitely be back for more",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "06g833_wa4fYQX17so7ohA"
  },
  "5yxCKbFYKSmTvT8LjYwhLg": {
    "date": "5/6/2014",
    "text": "The homemade tortillas are amazing! I'm glad I came here. They won best tacos in Las Vegas 2014 and didn't disappoint. I was blown away by how much the homemade tortillas made a difference combined with the perfectly cooked carne asada! Nice friendly staff and very clean on the inside. Make sure you stop by and enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Dv00ERmvszemE9PhLEYFNQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada tacos with rice and beans",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Dv00ERmvszemE9PhLEYFNQ/o.jpg"
      },
      {
        "img_id": "w9_icGBrpcsdwttXbgLOGg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Chips and salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w9_icGBrpcsdwttXbgLOGg/o.jpg"
      }
    ],
    "user_id": "rUF1kmoZWeRb4Bgr2grFzQ"
  },
  "4AZJVV_A6oOSsq9cgNNTHw": {
    "date": "3/2/2016",
    "text": "Best authentic Mexican food in town, home made tortillas are the best, friendly service and make sure to try the flan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJtESEGcfkO4B0HWfPc7kQ"
  },
  "Ixf0jBlkmy1hbnMAX9jeNA": {
    "date": "7/17/2013",
    "text": "Very good homemade food, guacamole is bomb!! Kinda cold inside but good makes up for it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "egloSm9_5IaxShz9aX1-bQ"
  },
  "IZd0GrSqbwu1qFlTxjLezg": {
    "date": "4/12/2014",
    "text": "Food was delicious! Waited awhile for order, but it fresh and homemade.   Worth the wait.  Another plus, bathroom was very clean. Highly recommend it. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuH--Q7I1Mh1N2wN6WZjoA"
  },
  "Iv96K2J64WdpSa1mOleaBQ": {
    "date": "6/25/2014",
    "text": "Nice place quiet polite and attentive service. I ordered the quesadilla combo which included rice, beans, grilled jalapeno, lime, regular drink (Free Refills) tortilla chips and a large quesadilla with a lot of carne asada. I paid like $7.50 good deal and hearty serving. The ladies were very nice and had my food ready in a matter of minutes. I had the red sauce which was not too spicy but subtle in flavor I liked it and I'm usually a green sauce kinda guy. I had gone in for the albondiga soup but decided on the quesadilla when I saw it. Ill be back for the soup soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h4iPN4TWksMntu93CI_CMw"
  },
  "8U0LS0akEL3SuNqUMe-ibg": {
    "date": "5/20/2015",
    "text": "Excellent food. Not from Vegas but found this great place near the Boulder Station casino. Had the asada quesadilla plate and it was excellent. Clean, friendly and good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSm9e-s1Fn-po3y6VG-Gzw"
  },
  "ha-ZPHHAgiOXESHwKu63Xg": {
    "date": "6/1/2011",
    "text": "Abuela's Tacos is awesome! The handmade tortillas are the bomb and totally make the taco. The nacho's were really tasty as well. Everything tastes fresh and authentic.   The environment is nice too. I'm pretty sure the owners 17 year old daughter was running the place, but she was so nice and professional. All the food was served quickly and I can't complain!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OX87JReNiD2yuFr8SISIrw"
  },
  "rIL4v3VvhsfqZfUWd-GecA": {
    "date": "9/20/2017",
    "text": "They have wonderful customer service and there Horchata is the best I've taste so far and don't get me started on the food.. GORDITA IS FIREEEEEEEEEE......",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dQraRkUR8jUcCscvkfGVfw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dQraRkUR8jUcCscvkfGVfw/o.jpg"
      },
      {
        "img_id": "v_a29SOKW6iLHb-NBM8Yzw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v_a29SOKW6iLHb-NBM8Yzw/o.jpg"
      },
      {
        "img_id": "9eKju-jAF5BohN2Mm2kZcA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9eKju-jAF5BohN2Mm2kZcA/o.jpg"
      }
    ],
    "user_id": "ymm1iQt4-5G8Lh59igiSeQ"
  },
  "mMOeMv46i1PC7C5pXYoFeg": {
    "date": "9/30/2018",
    "text": "This is THE BEST taco shop in Vegas! Food is spectacular and the service is top notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_xjqfXjOa0UewyN2zpsyg"
  },
  "viBiR01V7sX6pjAjnnQ3HQ": {
    "date": "1/3/2018",
    "text": "Bomb tacos with fresh tortillas, and consistent every time! I  always get the Carne Asada but everything I've had is good and the staff is super friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6fi3rP8VIdCVZi2F9hO_Pg"
  },
  "eKkxFk3RmCbgVLGh0v4YBg": {
    "date": "9/28/2018",
    "text": "The best authentic Mexican food joint in Las Vegas. Las Abuela's know exactly what they are doing. Been there several times ordered almost everything on the menu so far all has been top notch. Very Clean And Flavorful. I recommend this place to everyone and anyone that loves Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "opmh_M2kZLU21ozvHCUsPg"
  },
  "zHZoOQ3r4Wtq-HbF43LlLw": {
    "date": "9/25/2018",
    "text": "The food was great, service was awesome and super friendly! The place is really clean, the cashier was super friendly and welcoming. I live on the opposite side of town but if I was closer I would be here multiple times a week! Check em out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfUwjs6eXIvx7xamkqCXrQ"
  },
  "GfI0bZKkTAr9K1R4MqILfA": {
    "date": "5/13/2018",
    "text": "If your sign says all combos come with rice and beans, then that's what it should be. Girls at the counter with a funky attitude. I'm sorry you hate your job. I'm just trying to order food and move on with my life. It's unfortunate , because the food was good. But I will never be back. Thanks for the horrible service and nice bait and switch. It's funny. You lost a customer over a tiny scoop of rice and beans. Not to mention. She rang my order up wrong. I ordered the quesadilla , they brought me out flautas, which I hate. Of Course the flautas were more. After she argued with me and rolled her eyes, they brought out the right order a few minutes later. And I didn't get the refund on the cheaper plate. Don't waste your time. The foods not that great to put up with bad service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iqlhUOWDeS3KE9L76P_mA"
  },
  "LP9ZR5WhmlM_rVSUUQ_imA": {
    "date": "2/11/2016",
    "text": "First time I came here it was really good. It's decently priced and looks family owned which is a nice touch.  The next time I came here it was disastrous. It was very busy but not busy enough for this place to take 30 minutes to bring us 2 burritos and fries! We waited all that time and they ended up giving us the wrong burrito. There was no apology or anything. I work in customer service so I know mistakes happen, we're only human. However if you mess up i expect an apology or a little humility but they acted like they didn't care and it happened all the time.   My last experience left a bad taste in my mouth so I probably won't be returning ... Lo siento, abuela.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "11Qfaoyg3BiciQ4ffKO0JA"
  },
  "Eh9qCK3hxO44bp2SEH1qeg": {
    "date": "8/26/2018",
    "text": "Tacos and the pozole is on point!! Totally recommend this place to any and everybody. Staff is amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkbYWwpqy8oM-DMWZ34EzA"
  },
  "nKw7BdY8qVVNmclF708g6w": {
    "date": "1/12/2018",
    "text": "This place was great Korina has a terrific smile the shrimp tacos were fantastic. The horachata took me back to when mi abuela made the rice pudding and I would drink the fluid. The Mexican music in the background added to the ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6Wht97bCSuN4UyoxbTwiw"
  },
  "eYuP14VfSCTMtpgymaskEg": {
    "date": "9/5/2018",
    "text": "Delicious food , with amazing hand made both corn and flour tortillas. Very friendly!! And delicious preparadas too . Must try ! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMqcULPw2wesg4YUJ_Y_Tg"
  },
  "joW8Zh95XCDEkWAXyjUXew": {
    "date": "12/11/2017",
    "text": "I found this place at project taco a taco festival in north Las Vegas. They had the longest line at the festival \"and not because they were slow\" they are amazing I live up in the north west side of town and will definitely continue to drive all the way over here passing some pretty good taco shops to get these tacos love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fCY7SN6UJzpF5vg7IZxhPA"
  },
  "acESVVlS17Kstl767SsQAA": {
    "date": "12/29/2017",
    "text": "THE BEST TORTAS EVER .... great customer service and all of the lobby was clean. No attitude when our order was changed. We ordered the wrong item, and they kindly switched it over without hesitation. I will definitely come back with more people or possibly order for catering!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LM14zu0zlcrNxrLCWYzgRA"
  },
  "zdkP4qk1tFvRBddFcyEyBg": {
    "date": "6/2/2018",
    "text": "I love the atmosphere here. They actually treat you with respect. Very friendly service and the food is great. Will be coming back here again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXJBYnVs84JBviP1ZSlljQ"
  },
  "Nk28XqQp4RKBJ0Tf0gAGLw": {
    "date": "6/12/2017",
    "text": "Homemade tortillas. Clean seating area. I tried the shrimp, chicharron verde, fish, and lengua tacos. My favorite were the shrimp and chicharron. The fresh tortilla adds a sensational taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "22CBjraW2DBcZf2v5F65PQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/22CBjraW2DBcZf2v5F65PQ/o.jpg"
      }
    ],
    "user_id": "dhWM1BnzXvAvsQlCqa9ZXQ"
  },
  "AUCyR2jmJvCG8ZBWDwSt-w": {
    "date": "10/25/2017",
    "text": "order 3 tongue tacos but they came with a hair the lady did not apologize and said that it was my hair and I am not blond and I do not have hair Ala verga este lugar.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4TpOcSotv5qElIc12R7sA"
  },
  "XR45-3rNhC6WPi3qKu2KFw": {
    "date": "12/27/2015",
    "text": "Service was really nice and friendly. We got a carne asada burrito and asada fries. I didn't get to taste the burrito, but the bf didn't like it. According to him, it was dry and bland.  I wanted to like the asada fries since the meat was very tasty and delicious! But it was almost all fries..very little amount of meat..  We got a free churro for yelp check in, it was too hard and there wasn't enough sugar..  I thought Abuela would replace Roberto in our hearts.....lol i guess not. Might come back to try other stuff on their menu though.  PS: free horchata refills here!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "14A7uDQYUX9-luO8vFtXBA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne asada fries, can barely see meat in there",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/14A7uDQYUX9-luO8vFtXBA/o.jpg"
      }
    ],
    "user_id": "W5iGpA5vgaWRyt4nY4cYBQ"
  },
  "rbAsSceWsKEUZOfMt-1Uhg": {
    "date": "6/18/2018",
    "text": "The tacos were amazingggg! As well as the rice and beans. I traveled 30 minutes to get here, and I'll definitely do it again. Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mBNmIyr2xa3hn6pD-j07gA"
  },
  "4beNnnnqnrXUxwxJ41GgVA": {
    "date": "11/7/2017",
    "text": "I wish I could say 5 Stars (updated to 5 stars 11.7.17...below is update)to this little gem of a place... I did try. I went in 4 times.  The 1st time I ordered the cheese enchiladas with verde sauce(mind you it was real mexican cheese!!!! Yummy).  I am hard to choose meat my 1st time into a place, until I can taste my man's order :) He ordered the Carne Asada Bowl.  The Carne Asada was the BEST I have had in Vegas....probably any taco shop. It was well marinated and melted in your mouth tender.  They come with chips, salsa and a drink. Great combo (Or I guess you could have tortillas also) So my next visit in I thought...I have to try the Carne Asada, so I had the carne asada buritto, with chips/salsa and a drink, my man again had the bowl.  I was so happy, it was as good as the 1st time. The burrito is perfect. Beans, rice and carne asada...LOVE it!   The 3rd time I ordered to go, 2 carne asda burritos, chips/salsa, 2 drinks. I was sad. The meat was not as tasty, had fat and grizzle, had to take out a few pieces from my mouth...that is the one thing I cannot do. The 4th time I went... I went on a saturday.  It was busy as I expected it to be. I ordered a carne asada quesadilla, I thought I would try the meat one more time.  My order got lost and I finally went up to ask when it was coming out and they said the ticket wasnt there so they would get on it, this was after about 15 mins or so of waiting.  Then another 10 minutes and it finally arrived. :( sad again.  Meat was nothing like it was the 1st two times I went.   The service is great except for the Saturday.   I love the beans, rice, salsa, chips, and enchiladas...so I think I will stick to those items.  It is just so hard to find carne asada the way it was our 1st two visits... If it stayed like that... this place would be impossible to get into because it was delicious.  I do however want to try the barbacoa...that is hard to get perfection as well...but I am going to try. Great job ladies...delicious food!  Went today (11.7.17) had the barboca bowl with chips and salsa, but ordered 2 tortillas on the side...my man had the Carne asada tacos...he loved the tacos but he really loves the bowl...my barboca was delicious...cooked to melt in your mouth perfection!  As I said before...I am just super picky about my meat but this truly is the best Carne asada I have ever had and the barboca is something I would definitely order again!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQkyAtAiSAfxSQ3GCd0QUw"
  },
  "xvJyn_6RnaLWmh1Gjl8mgg": {
    "date": "12/16/2017",
    "text": "Yum yum yum. Started with Their great Micheladasand ordered the Gordita and taco combo! Every thing is just like your aguela would make it! Simple and delicious authentically good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3m1vNDW4yQxonTqkranPAQ"
  },
  "FH6gh_7Us-o3My7WTva2tA": {
    "date": "6/9/2018",
    "text": "Came with a large group of friends to try the hot cheeto tacos. They were pretty great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lh9HB0Ln_tmIgdJap4lKQg"
  },
  "YkKPi6fmTnB-Wd_VfbqGJQ": {
    "date": "7/11/2019",
    "text": "Let me start off by saying that this place has THE BEST Micheladas ever, aside from the ones I make. They are authentic and taste just like the home made ones. Almost Everything from this place is authentic Mexican food. Just like how grandma would make her beans and tortillas. The tacos are amazing! I usually get four tacos al pastor. You can taste the home made tortilla flavor. It's amazing. The prices are good. The staff is friendly and they bring your order up to you. They are very good at answering your questions and helping you make a choice. Overall I am satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xp8cFWLwE-n1bCY4lCuB1Q"
  },
  "m9ZawxsauE1zzQpmJyEw7w": {
    "date": "6/12/2018",
    "text": "I am mixed about this place:  1. I like their carne asada it tastes more like steak(tender and full of flavor)  2. I like their tortas- they put melted burn cheese in the middle (great touch)  3. Horchata is not homemade  4. guacamole was not tasty   I will give it a few more shots and will update but I like it but it didnt wow me. The staff was incredible :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqy-OvaSX5fCiL6F6_Rffw"
  },
  "e5TbbgKjQNW77Y4f1Va-4A": {
    "date": "7/5/2019",
    "text": "Their carne asada plate is to die for. Make sure to ask for extra beans and rice! Their green sauce is incredible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkVeGc7BDWHiJf_x_5u57w"
  },
  "9ARYEgYZcuOe0fjzA8tHqQ": {
    "date": "7/4/2019",
    "text": "Went for the first time and ordered a burrito so dry nothing in it smh and the horchata was water down  that is taste like water sugar ewww and I will not be back no thank you",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GLVlpetFJUg-oRnAVYAnEw"
  },
  "KlgfbpjIY8g1EAXf8HEsow": {
    "date": "12/24/2018",
    "text": "Came here during a vacation stay in Vegas and everything was delicious. The hot Cheetoh tacos were the best! So unique and flavorful, and great customer service. Very polite and friendly. Highly recommend to anyone who's visiting and looking for a good cozy spot to eat. We will definitely be coming back before we leave, to try their ceviche as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GJxTFolAG2aaba3VDSy_Hg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GJxTFolAG2aaba3VDSy_Hg/o.jpg"
      }
    ],
    "user_id": "8riSoUWbtIcz051tVmF5nw"
  },
  "Zu4joemecYFVbnJztgSZVA": {
    "date": "3/2/2019",
    "text": "Mom likes coming here often enough for the host to know what she likes with her tacos, I really admire that little extra touch of great customer service they provide.  Their gorditas are great, their tacos are also tasty! I've also come with other friends who share the same delight.. I do recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tc3VZmVBeCSOHctMyBn1w"
  },
  "pKSW1DY85UJuR95hyNIhVQ": {
    "date": "3/20/2019",
    "text": "Delicious! Just like grandmas cooking. Authentic, fresh,and extremely reasonable. If you are ever on this side of town it is a must. Plus menudo, and Posole on the weekend. If calories didn't count, I would have everything on the menu.. plus beer!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2J3KqWZpEgd6bbnpSLPEFg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Hot Cheeto fish taco. Fresh homemade tortilla with jalapeño (toreado)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2J3KqWZpEgd6bbnpSLPEFg/o.jpg"
      }
    ],
    "user_id": "wnOvL0QV18qNdXZuRiqaWg"
  },
  "1U3JRN36ROqmQhxIX3I0Og": {
    "date": "10/11/2018",
    "text": "If you haven't eaten here, you haven't experienced the best tacos in all of Las Vegas. The staff are polite, courteous, patient and professional. I am one of those annoying customers who likes to ask for recommendations from the servers, and I have never been steered wrong. Everything tastes fantastic and fresh. It's very, very affordable too. It's hard to pick a fav totem from the menu but the gorditas de asada is fantastic... the rice and beans are the best I've ever eaten.   Love this place. Love the team.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "hFlE4hbh6QFuU965nOzLLA"
  },
  "XkNltA2i6P8sZsQUzhZqaA": {
    "date": "4/28/2018",
    "text": "1st time here have missed this place in the last 2 Taco festivals since it ends up selling out. Being here now I know why, from the handmade tortillas to the perfectly seasoned meats. It's a delightful fiesta of flavors that entice your palette.  Thank you Abuela tacos for making my Saturday morning a great one. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zftttnj2JHn87RvhC6Strg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. #4 taco y gordita combo. Fresh handmade tortillas just like abuela use to make.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zftttnj2JHn87RvhC6Strg/o.jpg"
      },
      {
        "img_id": "irbzoeF6I_Dpy0KRIJFiWg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. 1st time at Abuelas tacos, finally.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/irbzoeF6I_Dpy0KRIJFiWg/o.jpg"
      }
    ],
    "user_id": "Nq9oLD866o5Reh2-SxvmgQ"
  },
  "e4kusIZpoCMIKcls-ogLqQ": {
    "date": "10/25/2018",
    "text": "Stopped by this place for a quick morning breakfast. This little spot is a great find tucked in a small strip center on East Sahara. This place is super clean and the small staff was super friendly. Grandma is behind the counter making handmade tortillas and everything is cooked fresh for you as soon as you Order. I got the Breakfast Burrito with Chorizo and it was totally delicious. I ordered it to go and it came with some fresh chips and a roasted jalapeno. Try this little gem out. You will not be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4BMgg88yRLhe_BBi1u8sA"
  },
  "K0UB-SYShsmBgG1ZkSQUTQ": {
    "date": "1/25/2019",
    "text": "Awesome HOME MADE salsa!!! Quesadillas are the BOMB!!! Clean very clean...owner great customer service!! Try this place out worth the drive...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xVlY-LVQnnUV6vqud_Rw3g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xVlY-LVQnnUV6vqud_Rw3g/o.jpg"
      }
    ],
    "user_id": "EiDsrb_79FvwaVP8-8hyJQ"
  },
  "-lZSaWh5ifF-TvIgQ3P4ow": {
    "date": "5/5/2019",
    "text": "Read the previous comments on Yelp and they were correct food was very good, fair price and nice and clean.   Will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOpwEYt94LF27PNCRrVMfQ"
  },
  "M3PnFYgUfH9fqxfKi4SaWw": {
    "date": "2/6/2019",
    "text": "The food is so delicious and authentic, everything about this restaurant is great. Silver, the young man who took our order, was very nice and had outstanding customer service! Amparo the woman who cooked our food even interacted with us! She was very sweet and makes handmade tortillas. Overall great food and clean restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "69uvIAfGXc4v88gGUXVXzw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. hot cheetos tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/69uvIAfGXc4v88gGUXVXzw/o.jpg"
      },
      {
        "img_id": "B9U50-HhefNHkiba2x2CxA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. hot cheeto tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B9U50-HhefNHkiba2x2CxA/o.jpg"
      },
      {
        "img_id": "iVBtGMua_6f01q-0DZmRYw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. hot cheeto gordita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iVBtGMua_6f01q-0DZmRYw/o.jpg"
      }
    ],
    "user_id": "ErhG0DEh1pGHDYTc3JbiCw"
  },
  "jMyPw8jl794S2vTiiITHFQ": {
    "date": "3/3/2019",
    "text": "My Michelada was over priced. But other than that it was pretty good so far. Have to go back to try something else since I just had a burrito. I liked how they play music. It is somewhere I will go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oZ1g_Jhmext4rjRmTZSiTw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. About to enjoy this.......",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oZ1g_Jhmext4rjRmTZSiTw/o.jpg"
      }
    ],
    "user_id": "mxW_fW2iu1J8hvvs7t9xfw"
  },
  "_s4YyyhIGup0bQResAA_YA": {
    "date": "11/4/2018",
    "text": "Abuelas tacos from my experience is the best taco place here in las vegas. Extremely nice staff and the food well I will get to that in a minute. I want to talk about the employees first, so the young lady greeted me in a very pleasant manner and didnt seem annoyed of her job and what comes with it. She explained to me in detail what any item was specifically when I had asked about them and never pressured me to \"hurry\" and make a decision. I had purchased a breakfast burrito and a bowl of menudo. Upon completing my purchase I was told that the food would be brought to me vs having a number called out or my name like fast food restuarants. Extremely happy about that and the young man who brought my entrees to my table was very respectable and made sure I didnt need anything else and if I needed condiments he told me where I could get them. AWESOME CUSTOMER SERVICE! The food now was amazing as well, I checked to make sure the burrito was cooked thoroughly and it was and tasted each individual part of the menudo. I had no complaints when I left I highly recommend this place at any given time!!!! You know what Im going right now to get me some tacos!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6omBVbpH12xYoF9FoOZbIw"
  },
  "EplAbhIGu8TOTz40MljPkg": {
    "date": "12/20/2017",
    "text": "We have eaten here twice. The tacos were alright, the lengua had no flavor, the Chicharron Verde was VERY spicy which is not a bad thing at times. Today I had a barbacoa quesadilla.... It looked disgusting, but I took a bite anyways and it tasted as bad as it looked, I'll post a picture. There few chips they had put in the container were alright and the roasted jalapeno is nice. Would I pick this over Taco Bell? Probably.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RQAs77TVEQHybuY5TOR76g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. This is supposed to be a quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RQAs77TVEQHybuY5TOR76g/o.jpg"
      }
    ],
    "user_id": "MopyJvrcBSgQYfyA4wyP7w"
  },
  "B0ndlfAXASSs7hXSDI9SzA": {
    "date": "5/3/2019",
    "text": "Great food as always!! Even better service !! Best place to eat in the east side !!  Dinner for 2 under 20.00 can't beat it .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ODViQGVA_w4kJAt3PCKj9g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Great food !!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ODViQGVA_w4kJAt3PCKj9g/o.jpg"
      }
    ],
    "user_id": "GkEzJB9MlCWUjPjDcdxvwg"
  },
  "VVzS0LH1zw9QLRnKrCMcbA": {
    "date": "9/27/2018",
    "text": "Amazing. Very pleased with this place. There is a lot of hype about the Cheetos tacos and honestly it deserves all the hype! It's delicious. I got an al pastor and asada Cheetos taco. I crushed them both. I also got an horchata. I'm very picky about both but omg I loved it. The tacos were perfectly moist and dry with amazing flavors and the horchata was literally perfect. I'm extra picky about my horchata but to be completely honest it might be one of my favorites ever. I definitely will be going back and telling my friends about it. Friendly staff, ample seating, delicious food. Nothing more you can ask for really! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IozPIMx5pmLi9a_woa2_eA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IozPIMx5pmLi9a_woa2_eA/o.jpg"
      }
    ],
    "user_id": "7RpW7om7sd-G-yI-Ms0Llw"
  },
  "E4hKkUIhnDvyAj4kgojekw": {
    "date": "7/31/2018",
    "text": "Very nice clean place, food was really good had an asada hotcheetos taco and a gordita de maiz with asada. Meat was juicy and the beans tasted like my mom's So delicious! The customer service was excellent. Definitely coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1BKmhm1qCX84UEMvDOXMAw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Everything was delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1BKmhm1qCX84UEMvDOXMAw/o.jpg"
      }
    ],
    "user_id": "pQWQ9ujNfnXqrcKT6ntlXA"
  },
  "JJeVKEvJu1mkRWMHPptrTg": {
    "date": "8/16/2018",
    "text": "I was in the area and I've always seen this place when I pass by so I decided to try. The place is clean and simple and so are the menus. Prices are reasonable compared to other places. The person who tooked my order was friendly and very attractive. Unlike some places they are not and don't even care how they look. Food came out quick and presentation was decent. Although it was fast it didn't taste like those fast food places. I had the Burrito combo which had a choice of meat. I chose the Al Pastor and chose the sides of rice and beans. Everything was good and tasty. Definitely would come again and try the other menu items like their Menudo or their Lengua.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CkNzjjBrxNEjQdBiy3dJWQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Burrito Combo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CkNzjjBrxNEjQdBiy3dJWQ/o.jpg"
      }
    ],
    "user_id": "d2N7JLie3_Eqh9V7CNr2kw"
  },
  "hh2dVVXDlkO_pfLl3VKmIg": {
    "date": "6/16/2016",
    "text": "Very yummy breakfast burritos. Good service. And quality Mexican food. When in Vegas and need a quick place for breakfast, I'd say come here instead of the buffet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRGzT7ygFls_PjNRkYEo4Q"
  },
  "VPbAcl0PanPrQuu-oloRLQ": {
    "date": "5/30/2012",
    "text": "I like the people that run this place.  Really friendly and it's almost like walking into your grandmother's kitchen.  Unfortunately the cooking's not as good as grandmother's.  I came in with Angela on a Sunday afternoon and the place was empty.  We ordered 4 different types of tacos.  They were all just ok.  Not amazing nor terrible.  But they are pricey.  $2.50 a taco is really pushing it.  That's what you'd pay for a gourmet taco.  What's a gourmet taco?  I don't know but if I was ordering a gourmet taco it'd be $2.50.  So I wasn't too please with the price and honestly, this alone is enough reason for me not to come back though I'd have to try something else on the menu.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "np_PA4ejejVhk4klYvnMDA"
  },
  "FF80kMWuBSNWiDo5srj5sw": {
    "date": "5/8/2012",
    "text": "Deju vu, Flash backs, and memories of a blurred period came out of the wood works when I walked into this place.   It was Sunday morning around 10:30, and there were three cleaned out bowls of Menudo on an empty table.  This is when I  looked back at the front door to see if I warp back to the past decade, and was about to get mobbed by a group of kids trying to sell me Chicklets.    No Twilight zone episode came about on this visit, but this Taco experience was pretty close of bringing back some memories at back street hole in the wall in Esenada.  Thanks to groupon, I bought a 5.00 for 10.00 special from them, and ordered a Taco and Gordita combo, and a couple of tacos from the front counter.    The counter girl was very friendly, and took my coupon with a smile, and told me that everything will be out very shortly.   As I sat down at the table, again I got another flashback when I looked outside...damn, this part of Sahara looks like Ensenada.    I had some pretty incredible party times in that part of Mexico, and started to remembering about those Tequila girls slammers, which was next door to a place that looked like this restaurant.     My meal came within 7 minutes, and most of it was Carne Asada gordita, and one Barbacoa taco.     The went after the Gordita first, and this was my favorite of the entire meal.   They do grill it over a gas open flame, and it had good flavor, and more than ample of amount of meat.    The Barbacoa was very moist, and they almost can pull this off without any salsa with their version of this meat.    The rice, and beans were pretty generic, but isn't most places in Las Vegas at this price point.  Why a four start?   They forgot to give me my chip and salsa, and didn't tell me where's the salsa bar was located.   I walked up the counter, and was about to asks for salsa, but I noticed the three ketchup size squirt bottles in front..   They do serve most of the top Mexican beers, but this was the last thing I wanted to drink in a place like this.( For personal reasons..lol)  The food is great, but I didn't want Rod Sterling coming out, and telling me...you just drank a case of Tecate and giant bottle of Tequila , and you just entered the twilight light zone.      I'll come back to eat, but no drinkey, drinkey for me.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "rP07Hd8PH89gRLMoZ9VIpA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Gordia and Taco combo, and Barbacoa and Asada taco...but they forgot my chips and salsa.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rP07Hd8PH89gRLMoZ9VIpA/o.jpg"
      },
      {
        "img_id": "PFVGH7rhLnfQa15EoJmB9w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Front counter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PFVGH7rhLnfQa15EoJmB9w/o.jpg"
      }
    ],
    "user_id": "ePWsbOWDTJcgIus-BFuKpg"
  },
  "iGJd8WIJXEpWEabbKXeXMA": {
    "date": "6/30/2015",
    "text": "6-26-2015 - I Ate at Abuela's Tacos for the first time.  This location was small, clean and no waiting line.    I ordered the Burrito combo and it was made fresh and came with small serving of beans and rice and a tasty pepper, and a medium drink.   It was served in a styrofoam container and plastic fork.  I am not a big fan of either and the plastic fork was hard to \"cut\"  through the burrito and the fork was too small for my personal preference.  The medium sauce i was given, added little flavor to my food and I probably should have used the hotter sauce.  The waitress was friendly and I have no problem with service.  I try to be fair about my reviews and would say the food I ordered was OK, but nothing to write home about.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5JFnETi16y2gNiESXBYeA"
  },
  "R-nREAafOpYsTbCfAQ-OQg": {
    "date": "8/11/2016",
    "text": "Tortillas are the best in town!!!! Homemade food made with care from abuelas!  Great customer service and friendly staff!  As close to authentic tacos as you can get.  My new favorite local spot in Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3w6Gaq-SiVJwr7BOSRcu9A"
  },
  "6LO56vgKPAzRvvFcySWFrw": {
    "date": "10/23/2017",
    "text": "This is a really good restaurant if you are looking for Mexican food , the burritos are great and everything else , I usually go once every week because it's really close to my moms house and I love Mexican food . The staff is very friendly and they have fast service . The restaurant is always clean and organized , really good experience to go eat with family and friends or give yours of a treat when you are craving something delicious to eat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Ei-h7T2woA2MHQL5Mh7SQ"
  },
  "1SpfU4jAFe_NAEV9intl1Q": {
    "date": "4/13/2016",
    "text": "For the price OMG so good!!!! Wow! I had the Gordita and Taco combo. Fresh tortillas that were so so soft. Carne asada had flavor. I'm so happy. 2 tacos rice and beans that are fresh and a drink for 8 dollars!!!! Amazing value for real and a free churro with combo purchase no can touch this price, value, and taste!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iMVHqFAY79af29FgZceOGA"
  },
  "xjdtf-IPfRoMf9F2UoEGZw": {
    "date": "6/27/2015",
    "text": "Very authentic Mexican restaurant. The service was great. I came to try the tacos but ended up having the Menudo since it was a weekend special. It was delicious and I'd definitely come back again just to try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LuZIuxVBnxnbHMnTpv6IVA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Menudo. Served only on the weekend.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LuZIuxVBnxnbHMnTpv6IVA/o.jpg"
      }
    ],
    "user_id": "R1c36da9V6BVX8vanN8WoA"
  },
  "7iUgAvMYkE8UDPJz_QwU-A": {
    "date": "6/23/2015",
    "text": "I just recently moved to LV. I am looking for an authentic Mexican restaurant. I found this one and I must say I was a bit disappointed.   My husband and I ordered the nachos, gordita, & fish tacos. The only thing we loved was the nachos. The gordita had such a horrible taste. Fish tacos were okay per my husband. If I do come back here it will be only for the nachos nothing else sadly.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5S95wseAWCqwwjFkhlgdg"
  },
  "ptRYrCIy9GccVd3NdmBtgQ": {
    "date": "4/2/2014",
    "text": "Tortillas are home made. You will actually see the ladies in the back making the tacos.  I had the carne asada burrito and carne asada tacos. Both were really good. Literally the best part was the tortilla.   Chips and salsa with your meal of course.   This is definitely a must try!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "eYW6HKDCOLAf1COkxhVG5g"
  },
  "vooCVf5gBtomYwmDuqsHgA": {
    "date": "10/30/2015",
    "text": "This place is great. The Carne Asada fries are loaded with meat and other toppings. I honestly think the carne asada fries here are better than robertos. Micheladas are also pretty good here. They were just standard micheladas. Very simple and refreshing. I have also had tacos here and they were good.. not the best, but good. I would give the tacos an 8 out of 10.   Also, the cashier is pretty",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4r_4feU3sXI4K-U-T1pPdw"
  },
  "EOGlw1O1C8PgFRZ_G0FnNQ": {
    "date": "7/14/2016",
    "text": "The food was ok.  But the service is excellent.  Everything was a bit greasy and there is only 1 person working at a time.  I would not come back unless I was forced to eat it again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y3fSCjsHTLOh65E1hAaxDQ"
  },
  "ROSSlXDwQ1xuHtRAmG0AYg": {
    "date": "8/13/2017",
    "text": "So I ordered food to go . I ordered 2 carne Asada fries , menudo , and caldo the camarones. It was my first time ordering from Abuela's . I must say my kids ate every bit of their order and I loved the caldo. The establishment was very clean and had friendly staff . I definitely will be going back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YH857mFEKYBVPQYKV9-wYw"
  },
  "cB11Z_N9nkqNPmqXsd4AUg": {
    "date": "6/26/2015",
    "text": "It was good. We all cook differently , depending where you are from. The hand made tortillas are good, the beans n' rice was good and their meat is tasty. The Coctel de Camaron was superb!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDTl-rOyaRaPr4x7tk1ahQ"
  },
  "5BoTcEIkfPwf7eHgN6Bf-g": {
    "date": "2/19/2015",
    "text": "Excellent gorditas and tacos made on home made corn tortillas.  Reasonable prices.  Nice people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hJcRRx780uAH2RDnUWYZfQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. #4 Gordito y taco combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hJcRRx780uAH2RDnUWYZfQ/o.jpg"
      }
    ],
    "user_id": "3mZFkwfa6XV0BBazRTva9w"
  },
  "C4bYWK-YgiVztF_Uqtk43w": {
    "date": "9/11/2014",
    "text": "Wow! What a Gem! A place nobody would not go to just driving by.  But we decided to try a new place. Great, real clean, Great bunch of ladies! The food took hardly no time, hot, delicious food! I came twice in one day to take my daughter,  she loved it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xHj5Kf1fw6ZMBKN5lD-r-w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Yes, excellent! Gould This Place On Yelp Near the house. Beautiful decor and very clean! These ladies are so nice and friendly!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xHj5Kf1fw6ZMBKN5lD-r-w/o.jpg"
      }
    ],
    "user_id": "yrxfpCKpFa7pnHEAxudYXQ"
  },
  "vRjOGkiulr8OTMHtZC4_QA": {
    "date": "6/18/2016",
    "text": "Everytime I'm in the area it's a must stop for me. This place makes the best tacos in town. Hands down. The lady's working there are very customer friendly and obviously know how to put good food out and run a business . For Mexican food, this place is the best I've found.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MFMj2SPGyqz0dQGK42U7UQ"
  },
  "RnbxqCAIdKgpeXIfysVbZg": {
    "date": "10/5/2015",
    "text": "I have had better food. We were very disappointed when we dined in. I understand the cashier was new but there was no manager or anyone else to help this poor girl.  It threw me off the the tacos come with beans inside. I have never been to a place that does that. Service is slow and nothing extraordinary. The pineapple agua fresca had an aluminum after taste so I don't recommend that either.  They have decent cheap combos but make sure to tell the cashier you want the combo because she said there were no combos and everything was a la carte. Just overall disappointed with the food and service.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Z2PbsDSNq_AUv8m-IEkFA"
  },
  "D4-Bj105MorBwwT-6PpVKg": {
    "date": "8/24/2014",
    "text": "Nothing comes close to this place! If you enjoy tacos you will love this place. The dinning area is like your typical taco shop, but who cares when you have 2 grandmas in the back getting your plate ready!!! The BEST tacos in Vegas and I have lived in Vegas all my life!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pzRriGxYM23yfRU8EZnisw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. #4 is the best taco and a gordita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pzRriGxYM23yfRU8EZnisw/o.jpg"
      },
      {
        "img_id": "-AJwZBbjqJxGzE7pWpFt-Q",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Simple and to the point menu style",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-AJwZBbjqJxGzE7pWpFt-Q/o.jpg"
      }
    ],
    "user_id": "JUN6ulfdluN1XMDqZznoDg"
  },
  "KQYg3jeJKbp3KJJ_hYC6uA": {
    "date": "5/13/2016",
    "text": "Ordered the Barbacoa and asada burritos they were wonderful.   my favorite is the asada fries",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhGHycElZczP27Te93UvSA"
  },
  "WptrdgR33XFjpzBXq0qoBg": {
    "date": "5/12/2017",
    "text": "I do not know why this place will earn best of las vegas and not live up to it, there tacos are not good and the gorditas are full of lettuce and not meat and there sauces are not good either, the best thing i had there was there pineapple water but that was it...please save your time and money and go somewhere else!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IefMD13T80I4rD3fz0yI0g"
  },
  "27VsfImkXx245PkT3_EZmA": {
    "date": "3/28/2011",
    "text": "The area is sketchy but the inside is nice. It is located in Sahara and Lamb so don't be surprised on the cop cars always driving around.   I had a Groupon to spend at this place. It's totally out of place for me. I ordered the #1 combo that comes with two tacos, a drink, and chips and salsa (or you could get rice and beans). I ordered another taco cause I thought two wouldn't fill me up.   I got two asada tacos, and one lengua tacos. Man oh man, the tortillas are defo homemade and handmade with love. I took a bite out of my asada taco and surprise in the bottom, refried beans! I wasn't expecting that!  The chips and salsa...well the salsa was also unexpecting full of sweet and spicy. The tomatoes were cut not into diced and square norms but smashed. I actually enjoyed it. It had a taste of sweetness from the tomatoes and actually spiciness of it being a salsa.  I definitely recommend Abuelita's when you in the east side of Vegas looking for some good Mexican food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BsegVPnT4m6h_8B7819KlA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Lengua (top) and carne asada (bottom 2) tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BsegVPnT4m6h_8B7819KlA/o.jpg"
      }
    ],
    "user_id": "oS2O8YQ31HTSTQgPQKc7Cg"
  },
  "Ls-STSMz5SQJ0dzqMj0X5A": {
    "date": "6/23/2015",
    "text": "Every time I've been to this location I've tried something different to see if I really like it, but it's always average. Nothing different from other Mexican restaurants. Last time I went I had the breakfast burrito..which won't get again it wasn't horrible but there are better things than that. Customer service was good the lady at the counter was patient while I decided what to order. The salsa was far from spicy just adds a little bit of flavor.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "f-_jRZyJOGHr2dB_c2UniA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Breakfast burrito and horchata",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f-_jRZyJOGHr2dB_c2UniA/o.jpg"
      }
    ],
    "user_id": "Lqa-U3bSO1wtYXnHLLjXCg"
  },
  "elAFQr1Q2amcEeX_il2qDw": {
    "date": "10/23/2015",
    "text": "Finally I made my way there.  I was craving pozole, and I have to say I wasn't disappointed.  I really liked it.  One thing ,it was missing the radishes. But over all great flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZvDUHf_HwkkRXgECeqeJEQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Pozole",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZvDUHf_HwkkRXgECeqeJEQ/o.jpg"
      }
    ],
    "user_id": "B-8t_fwRqMaHQWlafPD8jw"
  },
  "9-J87MdHsfXPxejCozbQAw": {
    "date": "3/22/2011",
    "text": "I tried this place for the first time last weekend, and I was happy I did. The staff was super friendly I ordered the carne asada tacos, delicious hand made tortillas. Great portion sizes.  I definitely wanna go back and try the other menu items",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "xBMH3N0Fbua5pDtG1Y1mYQ"
  },
  "gQZkgsbC70sUgu73TYZFsQ": {
    "date": "9/16/2016",
    "text": "Delicious, fresh homemade food. You can taste the difference. The only reason they didn't get five stars was the lack of a salsa bar and the fact that i only got one slice of lime for my tacos. But delicious food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "G69bboYuOJtlV_XFvxVfmQ"
  },
  "ERzuA0ESScVEaKPBS64UZQ": {
    "date": "9/16/2016",
    "text": "Had the tacos for the first time tonight. They are amazing! Each tortilla is hand made one taco at a time. I've never seen that before & you can tell the tacos are fresh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_U8xifC6Eg2yB_jMWMY0hw"
  },
  "YDaLsC2CDEKLc7X22GKAVA": {
    "date": "1/8/2017",
    "text": "Ordered 3 tacos. Chicken, and two asada. They were okay. They honestly lacked flavor though. I don't know if I will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "un5LELsWFeTx8-B8hcArRg"
  },
  "vOg_sCQYe7iZCfgvDiIvBg": {
    "date": "1/4/2015",
    "text": "Came in on a Saturday evening and it was pretty empty except two other folks besides my boyfriend and his parents. We got an order of carne Asada fries. I've definitely have had better in San Diego and LA. The fries were perhaps the best part of the meal because the entree was loaded with sticky cheeses that harden easily and  meat tasted a little too burn and a little bit of refried beans (no even 1 tablespoons of it) at the bottom of the plate. The presentation really needs some work... the side of these Styrofoam plate was dirty with food, not sure if it was ours.  Overall I would not go back but its an ok place to eat at.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "TyepNPbEnMCy1_IhsT0YAg"
  },
  "VvgU9EL_zr9L6dejzuwmGA": {
    "date": "8/7/2015",
    "text": "As soon as you walk in the place is remarkably clean. The interior is simplistic but nice and not tacky like a lot taco shop tend to look on the east side.  The menus is easy to understand and makes it easy to order: the slideshows with photos makes everything look extremely appetizing. You definitely get your money's worth.  The tortillas are handmade for the tacos and the enchilada sauce taste homemade! The brand don't taste like canned decried beans!  Truly delicious!  Coming back and bring everybody and their mommas here :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3VpOuE7enV82Dnk1BfW88A"
  },
  "XEkoiNllHGJ6wMCDAZ8g8A": {
    "date": "3/27/2017",
    "text": "I like this place, it is as authentic as it gets, old fashion but real Mexican food, a place where the locals go. I love the hand made tortillas. Very friendly people here! Found it by looking next door to have my windows tinted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F2av57ztcbYiPADtT-YpdA"
  },
  "SmcsAJfyOsQjOIL5GkljkQ": {
    "date": "7/22/2015",
    "text": "I have been passing this gem for a long time and finally I stopped today . I ordered the carne asada fries , which I had to wait 5 minutes for but let me tell you , it was Worth the Wait !!! I love hot sauce and homemade sauces hers/theirs is delicious.  I will be stopping back by as much as I can . Sorry other taco vendors,  Abuela's has my vote , now.  By the way, I love the owner , she is z sweetie.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "63ZFmYlj_DcHEQJa6hnyFw"
  },
  "0yRovLTTDFyX8e0nNWWU3A": {
    "date": "12/29/2016",
    "text": "A friend of mine recommended and I was pleased. First time trying Ceviche. Also, their tortillas are made fresh. No grease. No drippings. Will I return back? Yes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DlssIuh_ZSYg2Dsfxo3YdQ"
  },
  "_sNnDlLF43fRm70wmhIVyA": {
    "date": "11/19/2016",
    "text": "Authentic mexican food like real deal lol want bomb gorditas de chicharon or pozole or hsnd made tortillas bomb as place for that !!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SkoQa04GkvvlkCfRBLD9BA"
  },
  "3UX6TA-xBDb_RzENoUCnaQ": {
    "date": "2/12/2014",
    "text": "So the homemade tortilla's are really good, but everything else is just sort of decent. But that's not a bad thing. The menu is pretty basic, so don't expect your standard array of Mexican combo plates, because they don't have them. You basically pick your poison--taco, burrito or a bowl, with a meat choice and if you combo it for $6-8 you get rice, beans and a drink. That's it.   My mom really wanted a good tortilla with beans, so I went searching for a place with just that. She had the tacos with the chicarrones verde and lengua. She loved them both. I'm not a meat-eater, so I had their breakfast burrito, which is usually made with eggs, chorizo, rice and beans, but they were very accomodating and made the burrito to my exact specifications. I only which I would've gotten my burrito fillings in a bowl and just ordered a side of tortillas.   The food is simple and basic, but still very fresh (one HUGE exception being the chips, but you didn't come for that anyways, right?), affordable and not in the least bit greasy. Oh and the service was awesome! The lady working the register was very nice, very attentive, and personable. It really was just like eating at a friend's place you've known for years.   Do yourself a favor. Don't come here with super high expectations, because this place isn't trying to revolutionize the taco. It's not their schtick. But do still try them if you're in the area, because the tortillas were pretty damn good. Word to the wise, the red salsa/sauce that they have in a squeeze bottle wasn't that great. If you must drizzle a condiment on your food, the green sauce was much better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IKW2SOztzmmRpNoIQ35Ajw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. A custom-made burrito! Woohoo.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IKW2SOztzmmRpNoIQ35Ajw/o.jpg"
      }
    ],
    "user_id": "8zb_IBPGPJjh97qe98BDWw"
  },
  "pTbnlgA-aT7-gc3wyno61g": {
    "date": "1/22/2017",
    "text": "Dariana is a wonderful and amazing person. She suggested the vet Nd knew what a customer wanted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "86Fx3fc8wUKuEgoZsJ4YyA"
  },
  "PGIMiWahZB-W4eoRta_qpw": {
    "date": "1/31/2015",
    "text": "I searched for some real authentic Mexican food in Las Vegas  let me tell you ..This is the best I've found!! Your not going to get any better than this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "vZANowIqmzoEE0AtKzgj6w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. This is the menu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vZANowIqmzoEE0AtKzgj6w/o.jpg"
      }
    ],
    "user_id": "kfG4007LhjKKuQKAm2Z58w"
  },
  "wcgLHyW4-Y0-L0J1-rpdHA": {
    "date": "1/6/2016",
    "text": "This is my go-to taco shop!  Everything here is hand made, including the tortillas.  The service is absolutely outstanding, the ladies at the counter and the kitchen are the best!  I have never been disappointed with anything here, but the carne asada fries, ceviche, and on weekends, the pozole are always a winner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xH-7NxpGlb56eOVeb3mqpg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. My go to ceviche!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xH-7NxpGlb56eOVeb3mqpg/o.jpg"
      }
    ],
    "user_id": "KCFb6pyJc7U9ARHxRD_jLA"
  },
  "r54iOSHlwTyMz6HbLgDjog": {
    "date": "8/2/2015",
    "text": "As always great food. Here for the carwash and took a break inside and get a couple of tacos. Always enjoy  the food here. Ill be back for more great stuff soon. Thanks again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yTS-1_KG3HUAyYlYNZUVrg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Gettin some tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yTS-1_KG3HUAyYlYNZUVrg/o.jpg"
      }
    ],
    "user_id": "STqgzYFl57tpkdTesAnX5Q"
  },
  "hfwnYsySypINrlmnossRoQ": {
    "date": "6/7/2012",
    "text": "They made their tortillas fresh and thick which are nice to see.    A bunch of us came by after whacking some golf balls at the range and we took up the entire middle dining area. I think there were 16 of us all together and we basically put some tables together and made one giant table to accommodate us which was also nice.  I ordered the two asada tacos with rice, beans, and fountain drink combo.  It was good but nothing really stood out except for the tortillas. There were nice chunks of steak but not a lot of flavor. The refried beans and rice were also very basic.  They did 4 or 5 different hot sauces.  I like there pineapple and fruit drinks that were next to the fountain drinks selection. Which I drank a lot of because I was very thirsty and they were delicious.  You might notice a few deals for this place. 1 free charro with a purchase of a combo when checking in with Yelp app, which I passed on at the end, filled with drink. $5 for $10 Groupon which I also passed on.  They have weekends specials for menudo and 2 other items, I am a fan of menudo.  When making your tacos, burritos, etc you have a choice of asada, chicken, shrimp, tongue, barbacoa, chicharones, and maybe 1 or 2 more meats.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "vWP8-aQX0rYJszqkWVL7Ew"
  },
  "YFyXd_mEcQBl7xb7ftfqgw": {
    "date": "6/21/2019",
    "text": "While waiting for car being tinted next door. We visited Abuela's Tacos the place very clean and the food was delicious for lunch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aKWTPC1Pz6d5EDvPk5HECQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aKWTPC1Pz6d5EDvPk5HECQ/o.jpg"
      },
      {
        "img_id": "sXrzMU4piSNDpgSnnIJVUg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Fries cheese is great",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sXrzMU4piSNDpgSnnIJVUg/o.jpg"
      },
      {
        "img_id": "QWSvj8lbx8MxgTNYGkbMOg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Dining area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QWSvj8lbx8MxgTNYGkbMOg/o.jpg"
      }
    ],
    "user_id": "btR23RRAQJ9JrVvYtHmhMA"
  },
  "iyTgpLO-Y890sC5lFRcIHg": {
    "date": "10/16/2018",
    "text": "Customer service is always great here. The food is amazing. Love coming here at lunch because your food is made fresh but quickly. It's not noisy or crowded, but there is a perfect atmosphere here. Bring the kids because ''tis kid friendly. Bring your friends and family too. Try the flaming hot Cheeto tacos. They're the best. All the food is made fresh. I love their hand made tortillas.  #AG",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EOlYde0BHZQ4caePzvDftw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Flaming Hot Cheeto Tacos.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EOlYde0BHZQ4caePzvDftw/o.jpg"
      }
    ],
    "user_id": "-R-ma1FagNEotaxEuiJ2ag"
  },
  "KKBRYApMdeBH7knB2jbj4A": {
    "date": "7/8/2019",
    "text": "Absolutely Wonderful people working here. Great food for great prices and a nice welcoming atmosphere. I had their cheese enchiladas w/ green sauce.. ONLY THE GREATEST! This is definitely my to go spot now :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-e1q1x1G-lHH-xp8n64KsA"
  },
  "Zu5VfeqTg0emr9Gu8qgkJw": {
    "date": "7/27/2019",
    "text": "Great food! Love the chicken floutas! They were delicious! Very busy because they are very good. Will go back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eZ6YvJJTQUQGOxhPh5pIog"
  },
  "C71dVrhYEyM_kxKtlewRJg": {
    "date": "4/28/2019",
    "text": "This place is a hidden gem. I will eat here when ever I am in the area. The rice the bean the carne Asada tacos soooooo good. The staff are so polite and nice. My husband got verde chicharron  Tacos he said they were amazing! You have got to try this place. It's very clean as well and the hot sauce is the best!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_USfyQ11AKAA-wFryKjaw"
  },
  "afUQlhfZENKh-K7KbxKQXQ": {
    "date": "3/14/2018",
    "text": "Why ohhhhh why?!?! Another hyped up place in my opinion. I had high hopes. One, given the high ratings and second because we actually got first hand recommendation from a friend.  I decided on the Gordita and taco combo. Great choice I was told by the helpful lady manning the register. Carne asada Gordita and fish taco to be exact, meat had okay flavor but was kinda tough the fish taco was abysmal. I would've taken Del tacos fish tacos over it any day. Husband had the carne asada burrito, let's just say my sons McDonalds quarter pounder was preferred over finishing the said burrito. A big deal as he lives for Mexican food. The highlight of that meal was the chips and salsa.   Another disappointment was the flavorless horchata and them running out of flan which as the lady said is made by the Abuela herself but have been out for 2 weeks now. Unfortunately that does not help my situation here. 2 stars for the food and 1 star for the personable lady. The quest for tacos continue...",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 16,
      "cool": 12
    },
    "photos": [],
    "user_id": "JqjAthJThuVYgTh4iWDZ2A"
  },
  "QzLcT1SfpYX1Sx2Dkf2aZw": {
    "date": "6/1/2019",
    "text": "It's was good everything homemade very unique spot here. I know people have their preferences not my favorite for homemade tortillas though and beans inside your tacos is also something new to me hot Cheeto MASA was a little better than the regular just cause it actually had flavored also my regular taco came with a little traces and fingerprints of hot Cheetos Which kind of bothered me",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2wzhIsThlS4fjDGzriKpcg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2wzhIsThlS4fjDGzriKpcg/o.jpg"
      }
    ],
    "user_id": "R61oTj8qA5QZExLdyrbYRQ"
  },
  "PQxfbfudN4N_qCUBh7ly8w": {
    "date": "5/13/2019",
    "text": "Friendly staff, good food! My husband and I drove from Summerlin to an automotive shop to have a small part of his car fixed and we stumbled upon this place . Everything tasted fresh and had that \"homemade meal feel\" which was nice.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScwVhHmUFLZwVW9E5fvKjw"
  },
  "I7iCTYcSNY03FKTGmk1CcA": {
    "date": "5/2/2019",
    "text": "This is the best Mexican food I have had since Fresno Ca. And Nipomo Ca. Been living in Texas and Oklahoma for last 13 years. They may know BBQ, but dont know sh@t about Mexican food (Texas Mexico really). Beans and rice are great, had steak and chicken tacos, great flavor, hot made fresh, corn tortilla thick with great flavor. Busy place, I see why after eating there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TahQMngqbtjSLDz2wpl_fg"
  },
  "pwZW1q3wemm5Rtzt7N8Ltg": {
    "date": "8/15/2018",
    "text": "Well, the hype is like... a no from me dawg. This place was not worth it, honestly. The pricing is high for the quality and quantity of food offered. I ordered a few different items, and all were wrong, yet I got charged for what I ordered. It took a long time, so I wasn't about to ask for a remake. Plus the cashier and cook were busy on their phones.   When people say this food is authentic, they must have never eaten at a real Mexican restaurant. Also, their tacos are not the biz, the carne asada was dry and the upcharge for the hot cheetos tortilla is NOT worth it, you can't even taste it, might as well put red food coloring in the masa and call it a day.  The one thing that was not the business was how dirty it was inside, a lot of the tables were dirty! I had to get a napkin and wipe the shit down before we ate, no big deal, right? FUCKING WRONG. I spent over $30 and the food was shit, and I have to clean my own table? NAH.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "cJh4F1zFNJb2wXCNT1uNWQ"
  },
  "aJAJ4EPOusIeNLUSkOr-pg": {
    "date": "8/7/2019",
    "text": "This was my favorite taco place last year (when food was fresh). Now they serve meat that was cooked days prior, and recooked, and left heated  until the asada is more like jerky. I've had to let them know my meat is a little old and dry, for the cashier to tell me \"you let it get cold.\"The place has gained notoriety because the food was actually amazing but lately the customer service is poor and the food isn't fresh. *******The owner (Leslie) contacted me in regards to the review, apologized and have no further action has been taken besides saying \"sorry, you should never be treated this way\".********",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BmgICbFp1UDuTNWKpIBvNQ"
  },
  "ePwcPDQyr80h_7eUbGw2rg": {
    "date": "2/17/2019",
    "text": "Some of the best taco's in Las Vegas, and I've tried nearly all of them. The taco portion size could be a bit larger, for the price, but the fresh tortillas are The Bomb!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2g4m4LePt0HquqEFdWHVDw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Hot Cheetos Pastor &amp;amp; Asada.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2g4m4LePt0HquqEFdWHVDw/o.jpg"
      }
    ],
    "user_id": "XxyyTYuL7KrrBFg8a14bEA"
  },
  "m8vNJoGhv9jEfweSZOuuHw": {
    "date": "5/19/2019",
    "text": "Ohhh yeah... Their gorditas, tacos and burritos are so delicious. Good price and good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4oyQHrNxFHIBZTHtcRFUQ"
  },
  "q-wpEdOyxCva6lrXGZQpvg": {
    "date": "1/22/2019",
    "text": "Came to check out the HOT CHEETOS taco hype. I am a Hot Cheetos super fan. I used to eat them every day for \"lunch\" during my high school days and miraculously, I am still alive. As an adult, I don't eat them as often due to the heartburn, stomach ache, etc. When I came across a photo of this amazing creation taken by Daniel Dong-Kyu K, I knew I had to go ASAP. I wondered if I would hurt after eating this or would I be In Hot Cheetos heaven. The hand made tortillas made by the abuelas working in the kitchen have added Hot Cheetos crumbs worked into the masa to produce the red tortilla/Hot Cheetos coloring. The taco is topped with Hot Cheetos chips that add the beautiful final touch. Let me say that I ordered a regular carne asada taco and a Hot Cheetos taco and of course I immediately regretted not getting two Hot Cheetos tacos. The carne asada was on point. The regular taco was very good and would give it 4/5. But duh, the Hot Cheetos taco took the win and was the highlight of my day. Overall, the taco was not as spicy as I anticipated. It has been 6 hours since I ate the Hot Cheetos taco and I have no heartburn or bad stomach ache...a major plus! Now I can get my taco and Hot Cheetos fix all rolled in one! I am already planning my next trip back to this taco shop. I wish they had one on my side of town, but for now, I am willing to drive over here to get my fix. Ugh, as I type this, I wish I was eating those tacos. The reason for the 4 star review is because we ordered a side of nachos and they were not good. We ate a couple of bites and threw away the rest. They were too soggy. Chips that are overdressed in sour cream and beans and become soggy AF are gross. We did not enjoy this dish at all. Hot Cheetos tacos.....I will dream of you until we meet again.",
    "rating": 4,
    "rated": {
      "funny": 13,
      "useful": 22,
      "cool": 23
    },
    "photos": [
      {
        "img_id": "8mKVEuzF80I8F1UlwG6DFQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8mKVEuzF80I8F1UlwG6DFQ/o.jpg"
      },
      {
        "img_id": "J9qUjlVDsDXQusJTfNvGPg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J9qUjlVDsDXQusJTfNvGPg/o.jpg"
      },
      {
        "img_id": "6plV_UKzey3gXtpBDsFTEg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6plV_UKzey3gXtpBDsFTEg/o.jpg"
      }
    ],
    "user_id": "n9fNWJpWvOLyuAxgMHL9JQ"
  },
  "3fZjWGBxXkHMEVKRreu9EQ": {
    "date": "6/12/2019",
    "text": "Best breakfast burrito I've had in years! Food tasted so fresh and homemade. Highly recommend it! Can't wait to go again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PNBBzfxfqcf-fOLvUPMzqw"
  },
  "zo5faToSCqZJx0hsxxNCzg": {
    "date": "6/14/2019",
    "text": "Delicious homemade tortillas..hot Cheetos taco surprises you with every bite. Carne asada was tender and flavorful. The salsas complimented the meal, good place to take out of town guests.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OWxS7xvBdI8XS8AMTErpeQ"
  },
  "bbiM1fzRrIGfDyPNhZRrJw": {
    "date": "1/4/2019",
    "text": "Went here at 8pm and ordered asada, barbacoa, al pastor and hot cheeto taco with rice & beans. I love Mexican food but honestly this was so disappointing. I was expecting great quality, freshness, and flavor due to the reviews. But they must be fake or have a lot of family that post reviews for them. The meat was so old dry, cheap, greasy, and i don't know what served me but it was not all pastor it wasn't even in its special marinade.   Honestly robertos is better. I drove 30mim just to try this place will never go here again and do not recommend. I get it was just the hot cheeto hype that made them popular, which was also dissapointing. They must pay for advertisement.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "51bdpaKUHsEl2SuCg1aVlw"
  },
  "Wh47vR9G6JQIof6si9KfQA": {
    "date": "8/24/2018",
    "text": "Huge let down! The place itself isn't in the best area and they don't keep the restaurant clean. The tables don't seem to look like they get wiped, the napkin holder was super dirty with dust along with the salt & pepper containers. A family got up before we got our food and the table didn't get cleaned the whole time we were there.   We were drawn to this place for their hot cheetos tortillas, I ordered the gordita & taco combo plate. The food wasn't even warm when we got our plates. The flavors were off, it wasn't properly seasoned. The tortillas themselves did not look or taste fresh when they advertise they make them fresh. I ordered carne asada and the pieces were in chunks which made everything fall out and a lot of the pieces had more fat than meat. The horchata was so watered down it tasted like sugared water with a faint hint of cinnamon.   The food did not meet the expectations of the price we paid for. Not going back and I don't recommend this place at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QBkwmsC2AD8Pga6U-RpIDA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QBkwmsC2AD8Pga6U-RpIDA/o.jpg"
      }
    ],
    "user_id": "RhU4n9Ow5PPF1bHHTx8lIQ"
  },
  "deEIgecDReZXB9vgVpMgxg": {
    "date": "7/15/2019",
    "text": "This place is awesome! Best value for my money. The food was great, and a little different. I LOVE different.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMcSQfL9z5iLHboOHiM7fw"
  },
  "nIskWxA76Nj0K_KN4pbehw": {
    "date": "7/5/2019",
    "text": "Barbacoa tacos, oily, tasty, makes any other tacos taste dry, this place is awesome... Nuff sedd...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hdFnNWjdwmyB2ZVmKWGm7A"
  },
  "vjN_5H_FiHZxAon7Gd02xQ": {
    "date": "5/12/2017",
    "text": "I've been coming here for a while now. The food is always freshly cooked and the service is superb. They bring the food to you, didn't expect that. It does get packed during lunch hours and the line can get a tad long. Other than that this place is my go to lunch spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtZuWMG8HAfHpqaMRIb0iQ"
  },
  "S8TpuHlKd-GitNj-DZCGhA": {
    "date": "9/18/2017",
    "text": "Yo. If you haven't been to Abuela's Tacos I don't know what you are doing with your life! Best tacos in Vegas! The tortillas are made fresh, the meat is delicious and the staff is very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1rg1oYakeVewReuT2sPgA"
  },
  "8W5XWqF6TPxXxy70v3Th-g": {
    "date": "3/1/2016",
    "text": "Really really good. Best Mexican food I've had in Vegas so far. We've been here for a year and I've eaten viva el taco, rilibertos and Roberto's and Abuelas kills all of them. It doesn't taste cheap. It's fresh and it's real. They make the tortillas  themselves. It's bomb. I will definitely return to try more things!! Why go anywhere else?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0H62jpibX39JyxJBYyrHxg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Flan!! Super duper rich. Totally splitable",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0H62jpibX39JyxJBYyrHxg/o.jpg"
      },
      {
        "img_id": "9EnuXQQp0ePXEyv-QcqyUA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Asada tacos meat and cheese only",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9EnuXQQp0ePXEyv-QcqyUA/o.jpg"
      },
      {
        "img_id": "ZrdEVHu1D9m1xZ4cKF6Mlw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Asada gordita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZrdEVHu1D9m1xZ4cKF6Mlw/o.jpg"
      }
    ],
    "user_id": "cVHtZVFWksqKy2nAgAwm_w"
  },
  "nVsA7XKTHWptrJQPV_zQEw": {
    "date": "1/28/2018",
    "text": "It's like actually going to my Grandma's house and eating, it's a great environment and I love coming here with my family and friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfUiUX55BFGh-CZtzFxwwg"
  },
  "4YXzN-t9foGyxSZPxnO3qw": {
    "date": "8/30/2017",
    "text": "These carne asada burritos are the best and totally worth breaking my diet for. Me gusta!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Vq8qOw-MZ4l9XB7601lsQ"
  },
  "BH-4VhnSYH7Pq7-7omBoYQ": {
    "date": "12/20/2017",
    "text": "Went here one time and food was great! If you are on a lunch break it's better to call in to order ahead of time because like a lot of places during lunch hour- it gets pretty packed. But if you're not in a rush then eating in is great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsNISC_A7SbP9j2vf3vfeA"
  },
  "KRM8wmnGTPX-fEJPTmcQKg": {
    "date": "8/17/2017",
    "text": "I live in Henderson and I drive out here for the food. Authentic Mexican food and abuela really works here! lol I recommend the trip out here to give it a try for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bl13BVOTLMUxIWTsvyuxgA"
  },
  "FjaNlvwrAGtWlb2RhhDOkQ": {
    "date": "12/28/2017",
    "text": "Abuela's catered a holiday lunch for my staff of 85 people.  Everyone raved about the asada, chicken, and el pastor tacos!  There was plenty of food (and I have some big eaters!) and the price was very reasonable.  Thanks for the great service and food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Htluh0VVjhh6-j--3fk8Kw"
  },
  "0MnxfY-VyPDUdlcflbBw9w": {
    "date": "6/5/2017",
    "text": "Always the best customer service and food when I go here!! Love that the tortillas are made fresh. I will definitely be back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PsIYNrQpfXZD7ZJqzz8JMg"
  },
  "UU9B5aWLsYbe-niVTcTsqw": {
    "date": "7/4/2016",
    "text": "I've been back a few times and the place is amazing. I'll chalk up my first visit as an anomaly. Since that time Abuela and her staff have delivered some amazing tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hyBENyHJ43GH8OsTRiT6kw"
  },
  "PIm-xn3hAiTjjU229B1QgA": {
    "date": "1/22/2017",
    "text": "Came in for some menudo for my hangover and god it was delicious it really hit the spot and Ariana(I think that was her name) was super nice as well. I would definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "10idAVDAnUSP16mBGf7yQw"
  },
  "9st4oQVim93yGcNjK9gjaQ": {
    "date": "8/9/2017",
    "text": "Great tacos, went here because a few friends said it was the best tacos in Vegas, a bit far of a drive, but they are good tacos the quality of the taco reminds me of the good spots in Southern California.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TDl6t-SlxixB48JgbTgbQ"
  },
  "O_ypiw-IABTfLwokN6Cgng": {
    "date": "12/29/2017",
    "text": "first time going here and i'm in love with their food. haven't had a chorizo quesadilla in a fat minute and was impressed with Abuela's cooking. 12/10 would recommend going here. also, their restaurant is the cleanest restaurant i've been in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZ1mP8yjftU-Oyh2ZQ4r5Q"
  },
  "nX5UcL6XA9ua9rlUEb6TeQ": {
    "date": "3/7/2016",
    "text": "Great place, food is awesome and   employees are friendly.  I love their fresh salsa, chips, ceviche   tostadas are loaded (mi favorite)  My kids love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssDG0uFR6LEqAqrohHcxRg"
  },
  "9pcFsRUt4m-lHcELl6bPGQ": {
    "date": "12/9/2017",
    "text": "1st time at Abuela's tacos. Everything is fresh. I love the food it has flavor. My dad had the tacos. I had the huevos-rancheros. Service was excellent. Friendly and clean atmosphere. I recommend this resturant to anyone lookin for good food fast service!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAjhqJxLeU0-hAVqYhlJxw"
  },
  "35pgJA7BI_-ikKg8ycaxlQ": {
    "date": "8/27/2015",
    "text": "I got the tacos combo... I was low key shocked of how good this place is. I was saying to people being from So. California, I have yet to find a good Mexican restaurant. All that has changed seriously the food was so good my plate was clean. The tortillas was light and fluffy. They make them or at least press them in house. The Carne asada was on point. The beans and rice were so delicious as well. The hotess was extremely nice. Also, ordering the combo I got a free churro, I don't know what's in it...its gone. I will travel pass all the other Mexican restaurants to eat here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "A-hT5lzGS1zxDRETJ_QeYQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. The restaurant setup.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A-hT5lzGS1zxDRETJ_QeYQ/o.jpg"
      }
    ],
    "user_id": "p7_sJUPcljGYXmPZifVFLQ"
  },
  "8HAeCgWpsuQrGBJze_YVyg": {
    "date": "7/1/2017",
    "text": "Best place I've found in Vegas super great costumer service amazing food made better then any other place I've tried when even in Vegas I highly recommend it give it a try and you won't be disappointed first time I've ever made the effort to give a review and that's saying something",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8ioQ3DyRvEriQtP21Wjng"
  },
  "YBhlxqdQ5LHT6UjgWCSchg": {
    "date": "12/7/2015",
    "text": "Second time here a friend brought us. It's good authentic Mexican food counter service. Nice ladies, friendly and clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tSzouw-xuL23oUgsioUzJw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. For making fresh tortillas.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tSzouw-xuL23oUgsioUzJw/o.jpg"
      }
    ],
    "user_id": "Tt2h1fjs6uLn-tWVHIfUfQ"
  },
  "6gXcAIgVrVMIRdsMzuQFGA": {
    "date": "8/29/2016",
    "text": "Any time I am on the East Side I have to stop by.  The green chile is awesome, the food is very authentic.   Even the little old ladies making the food argue like family.   Seriously though, if you eat here one time you will be hooked....",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUCaxUBcruhxU4XhCF523w"
  },
  "3bOwimJdgcCvZogluMc6vA": {
    "date": "11/12/2016",
    "text": "Just tried these amazing tacos at Lee's Wine Experience and I'm hooked!! Some of the best tacos I've ever had. I'm definitely gonna stop in at the restaurant when I'm in the area. Yummy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tuCE0__ZY_Yc3UIVe4JYlg"
  },
  "IyeYQPyKVvrgIJS8KFKehA": {
    "date": "9/5/2019",
    "text": "We came after we got the munchies ! Lol Got the $8 combo that was a hot Cheeto taco de asada, a gordita rice and beans . BOMB . The tortillas are hand made and got a michelada . The service was good , the ladies were cool  Definitely recommend the michelada .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9AUg2_wdHbZo97s03ai3WQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9AUg2_wdHbZo97s03ai3WQ/o.jpg"
      }
    ],
    "user_id": "G7Z5GiBjQIG1RDpNl4hgmA"
  },
  "Rf28NOp7h24LRV0eD4Gvkg": {
    "date": "9/11/2019",
    "text": "Wow, the pricing here is amazing.   For a two taco combo, it is $7 + $0.50 more for a hot Cheeto tortilla. Comes with a choice or rice + beans or chips + salsa. One taco without the combo is $2.50.   Meat choices:  -Asada  -Chicken  -Lengua  -Barbacoa  -Fish -Shrimp  -Chicharron Verde  -Al Pastor  I ordered one hot cheeto asada taco along with an order of beef flautas (choice of beef or chicken).   Meat in both was tender, juicy, & flavorful. I expected the hot Cheeto tortilla to be better; however, it was good enough. I wish they were able to make it a bit crispier because it's super soft but it would probably come out like a tostada.   The flautas were so good!! Not too crispy, just perfect. Comes with sour cream & pico. $0.75 more for guac.   Would do the flautas again and try other options -- hot cheeto taco was good to try once.   Service 5/5! Restrooms & interior also clean.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOy0Qrkw54VKDEWIw7T-jw"
  },
  "bPexaLvgPnRUq3D-4mdsLQ": {
    "date": "9/6/2019",
    "text": "This was quite a trek, and I wish that it had been worth it just a bit more.  We ordered the carne asada cheetos taco. I don't really feel that the cheetos added anything, not even any spice. The carne aside needs a bit more flavor. It was also a little bit on the chewier side.  We also tried the chicken...This is the best choice here, by far. The flavor is smoky and would compliment a spicy salsa well.   My husband did not feel well after eating here. I had the same items, and I felt fine, so I can't contribute it to them.   I can't say we will be back, but maybe, we just came on an imperfect day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgUCtSaxZ4Mt_3k691UU2A"
  },
  "rbDr2hqTEy7soU7ZKJ3L2g": {
    "date": "9/3/2019",
    "text": "Amazing! Everything we ordered, carne asada fries, lengua tacos, and al pastor tacos, was phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tbZJxMG_CjRT5I1_lS10Qg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne Asada fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tbZJxMG_CjRT5I1_lS10Qg/o.jpg"
      }
    ],
    "user_id": "23OY4uHubuHSZ4aC8sZ5DA"
  },
  "Kzcen_ttXxH4y1SUUlnYcQ": {
    "date": "8/31/2019",
    "text": "This place is legit. No BS. Old ladies in an open kitchen taking their time to make outstanding Mexican food. The handmade corn tortillas are key! Don't snooze on that. Had the barbacoa and a safe and was impressed. Get some chips and salsa cause it's not quick. They take their time and it was like a 20 minute wait for the food. Every minute of waiting was worth it though.  Also - much love to any grandma out there. Te quiero abuelas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WJjfk7TDPgIgQB6cacxtFw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Handmade corn tortillas and asada and a barbacoa gordita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WJjfk7TDPgIgQB6cacxtFw/o.jpg"
      },
      {
        "img_id": "CcDNv78Hmuzhp0IT0WOg3w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CcDNv78Hmuzhp0IT0WOg3w/o.jpg"
      },
      {
        "img_id": "U6sL2NiUMa7ZqAhvphaczQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U6sL2NiUMa7ZqAhvphaczQ/o.jpg"
      }
    ],
    "user_id": "EruDFtupf02mY0Xgv22frQ"
  },
  "8n_AojBVYDFLSROXB-JzpQ": {
    "date": "9/22/2019",
    "text": "If you are starving on the Sunday and there's three people waiting in line plus people waiting for their food to be picked up. You might wanna go somewhere else because it takes them a long time to make your food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pdeXFLI0Lx9Pd90cY3X-Qg"
  },
  "PBR8auLw_zuWdTEIEUp1gg": {
    "date": "9/16/2019",
    "text": "These ladies in the back make some good Mexican food.  I had several different Tacos and all were fresh and tasty...my tummy was just right.  Overall a place you can trust for good food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rw1QE99aazERB_z3S8D8nA"
  },
  "6lVO2m1aJIH_nfyx4RkEuA": {
    "date": "9/13/2019",
    "text": "I am a taco conisseuer and for those of you who like to try the best of Las Vegas' tacos, this is a spot for you. I recommend all of the tacos - the Asada, Barbacoa, Chicken, Lengua, Chicharron Verde. And, if you want to make it fun with you and your friend or a date, get any one of these tacos with the hot cheeto tortilla. Thank you, Abuela's tacos for never letting me down when I am in need of a good taco.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gALcG_TrF-dtC_SYebvAg"
  },
  "_Z7GnAsX8ZrDrHoE_9c4lQ": {
    "date": "12/17/2018",
    "text": "Every time I come here and it's a lot!, I fall more and more in love with the food!! I can honestly say I'm obsessed and it's our go to spot. So we finally decided to switch it up, we still got our usual, however, this time we ordered the hot Cheeto carne asada fries. OHHH Mmmmmm Geeee!!!   You know that feeling when you taste something for the 1st time and it's so good that your eyes open wide and you just smile with how good it tastes? Well this is the feeing that my husband and I had forkful after forkful! The fries were perfectly cooked, non greasy and crispy. It's a huge portion that is definitely shareable (if you want) the meat is juicy and tender and the right amount of hot Cheetos are put into the mix. This place definitely is doing something right.   I can't ever get on a diet, knowing that this place exists! Abuela's Tacos, keep taking my money as I am one happy customer!!!  The Klasey's + Abuela's Tacos = Love Forever",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9ckllPyEVQ-bkaD3e2KuqQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9ckllPyEVQ-bkaD3e2KuqQ/o.jpg"
      },
      {
        "img_id": "b6-433xKPdifuXXQt-Y--A",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b6-433xKPdifuXXQt-Y--A/o.jpg"
      },
      {
        "img_id": "HCE4ULnmTBotapA1lBdcww",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. This is Heaven on Earth!!  Hot Cheeto Gordita with carne asada, beans, pico de gallo, Hot Cheetos and sour cream",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HCE4ULnmTBotapA1lBdcww/o.jpg"
      }
    ],
    "user_id": "U28VstjRdxyoTp423t5JcA"
  },
  "iiueTq-kS-tSmSPbUL4-aA": {
    "date": "7/25/2019",
    "text": "Super yummy, no attitude just very fresh homemade and authentic. Great servings and prices too, kind and friendly staff. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2e4IyNNASI31ctUrXkWI_Q",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. From best of Las Vegas, we are trying the tacos, I trust abuelas!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2e4IyNNASI31ctUrXkWI_Q/o.jpg"
      }
    ],
    "user_id": "hMzr1Yl-GZbpZug6tp7-0g"
  },
  "YINdhEprqdSg6zDe9CiLFw": {
    "date": "9/13/2018",
    "text": "I first tried Abuela's years ago after seeing Dyanna L checking in all the time.  Back then I thought it was good but not necessarily worth going out of my way for.  Then I saw Jason L. review about a life changing bean and cheese burrito so I ventured back.  Got the bean and cheese burrito, couple hot cheeto asada tacos and and a taco/gordito combo plate.  Again the food for the most part was solid just not amazing.  The hot cheeto tacos were a disappointment.  You couldn't taste any hot cheeto at all.   No cleanliness or service issues like I have seen in other reviews.  The restaurant was clean when we went and the young kid who rung us up was super cute and helpful.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "l_b-_-2vPMoqYjEFczn_HQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. 2 flaming hot cheeto tacos.  Didn&amp;#39;t taste any flaming hot flavor at all.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l_b-_-2vPMoqYjEFczn_HQ/o.jpg"
      },
      {
        "img_id": "swu1PssDoQbwARszpi8dPw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. #4 taco gordita combo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/swu1PssDoQbwARszpi8dPw/o.jpg"
      }
    ],
    "user_id": "XXKjsdglgwSs9kWtK6ZWUQ"
  },
  "IKdf8m-iiPGphBWhPMHebQ": {
    "date": "1/4/2019",
    "text": "Stopped by this place and ordered a lengua burrito to go for lunch. Big portion and only cost $7.50. The burrito came with some chips and a roasted jalapeno. The lengua was nicely cooked and tasted fresh, not chewy or smelly at all. I noticed this place was very clean and the service was very friendly. I will come back and try their tacos the next time I'm in the neighborhood. Great local mom and pop place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AJro038KiKFZtj56JMzsKQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Lengua burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AJro038KiKFZtj56JMzsKQ/o.jpg"
      }
    ],
    "user_id": "A5RC8s-n2FEbAR5GRUNHDA"
  },
  "yJ0v-l294CTzVtmrXPbblg": {
    "date": "8/3/2019",
    "text": "Abuela's tacos definitely wins my heart for the best tacos in Las Vegas. My favorite meats are the lengua and chicarraron verde (my mouth is already watering). My family and I literally come here about 3 times a week and abuelas ALWAYS exceeds my expectations. My favorite special on the weekend is their amazing menudo, yummmy and don't forget to order a michelada with it!! Go abuelas!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gNp2Y7vpaFHPmzh0EgmCgw"
  },
  "ZwvQDbIYgG4y-7feX8uxaA": {
    "date": "5/4/2019",
    "text": "Very clean establishment. Food is great quality with phenomenal corn tortillas. We enjoyed the Hot Cheeto Asada & Tilapia taco combo. With your Yelp checkin you also get a Free Churro!!! We highly recommend Abuela's!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tUYz3d170bEO3Tu1K5Nn9A",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Hot Cheeto Asada Taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tUYz3d170bEO3Tu1K5Nn9A/o.jpg"
      }
    ],
    "user_id": "-ArFk24i3tBeFHYRXHjamg"
  },
  "6t-cjZI4DtMf_dCNwBYrFA": {
    "date": "5/23/2019",
    "text": "One of the best little Mexican spots in Vegas!! Flaming hot Cheeto tacos!! Best quesadilla in town! Flautas are incredible",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KvK77Ao6-z28QTrNhlzwFA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Flautas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KvK77Ao6-z28QTrNhlzwFA/o.jpg"
      },
      {
        "img_id": "VMhCktO4lRRmPJt67n3dSg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Shredded beef quesadilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VMhCktO4lRRmPJt67n3dSg/o.jpg"
      }
    ],
    "user_id": "N78782Cts6fWwBoL2e6s1A"
  },
  "JOrHAxwatoUENAR98NKPnA": {
    "date": "5/27/2019",
    "text": "The hubbs and I were looking for a place to have breakfast and came across this lil gem.. Fresh, Tasty and Homemade - Yum .. I will say that if you like it  try all the salsas Abuela makes one just for you. Will try the lunch menu next time we're in town..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VEqy5fMXjskFXq00dP0_qA"
  },
  "LJppCH5MZIH8c68dAE-G0g": {
    "date": "5/10/2018",
    "text": "I HAVE FOUND IT!   It took 16 years, but I finally found the place that serves a bean & cheese burrito like I used to get in San Diego. Seriously, you would think this would be super easy to find. There are nine million taco shops in Vegas. Probably close to the same amount as San Diego, but the food just has never been up to par.   Step in Abuela's.   So I have to admit. I have a weird thing I do at taco shops. I totally understand if you judge me after reading this. I ask to sample the beans. I know, it's silly, but my favorite thing in the entire world is a bean & cheese burrito (I'm a simpleton). So if I'm going to commit to a 1/2lb pile of beans I want to make sure they're the goods. More times than not they're okay, just not great. I knew my world was going to be rocked when I asked to sample the beans and the girl up front got super excited and said I would love them. I did. The burrito was absolutely amazing.   The only thing I'm sad about is that there aren't more Abuela's locations in the valley. This spot is pretty far from me, but worth the drive.  Also, the chips & salsa were killer. Salsa was fresh and flavorful, not a ton of heat, just the way I like it.   I'll be back, many, many times!",
    "rating": 5,
    "rated": {
      "funny": 15,
      "useful": 34,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "4Whhpo9vSaXKKvMV9dsvPg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Bean &amp;amp; Cheese burrito is life changing",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4Whhpo9vSaXKKvMV9dsvPg/o.jpg"
      },
      {
        "img_id": "p0tbfzzCwi9seSLnHLmWAQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Chips n dip. Killer dip.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p0tbfzzCwi9seSLnHLmWAQ/o.jpg"
      }
    ],
    "user_id": "6mYfeB7ZxsgNq0Peyt_eFg"
  },
  "zTWbK65onvfuH1KKTOmNtQ": {
    "date": "5/11/2019",
    "text": "I took my car to alternator depot and happened to pass by this hidden gem surrounded by auto shops.  Classic Mexican food recipes made by grandma.  Abuela's indeed.  If I ever had a grandma that made Mexican food this would be it.   I enjoyed the carne tacos and huevos rancheros, what makes it delightful is the homemade tortillas.  The carne was cooked authentically, dry and crispy.   The waitress was super nice and friendly.  She gave us some shrimp chip tortilla taco and it was delicious.  This is a restaurant I would recommend if you like authentic Mexican food.  I'm more of the Americanized Mexican food guy though, but I like this place and worth a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SyyYQfNQ4a4Lua5RBlggmQ"
  },
  "OayYIb5-IvElB9HwfPiltQ": {
    "date": "8/7/2019",
    "text": "Abuela's Tacos is an delicious authentic with a twist family owned restaurant changing the game , My new favorite taco spot ! Amazing service with delicious fresh tacos ! The chile chicharone relleno pepper taco was by far my favorite, but the carne asada & al pastor were also almost equally tasty. The star dish I'm holding ? HOT CHEETO AL PASTOR & CARNE ASADA TACOS. Made with fresh hand made hot Cheeto tortillas, perfectly cooked, and seasoned carne asada or al pastor with onions, cilantro & ACTUAL HOT CHEETOS . Do yourself a favor and try these tacos !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9hokuWq2acRLWyKGpsiuKA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9hokuWq2acRLWyKGpsiuKA/o.jpg"
      },
      {
        "img_id": "k-BYiE_eQNmrdJYSJa5b6Q",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. CARNE ASADA / AL PASTOR HOT CHEETO TACOS !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k-BYiE_eQNmrdJYSJa5b6Q/o.jpg"
      }
    ],
    "user_id": "et4b5y1dLpNGEehltI33Iw"
  },
  "K-wuA0WMPVCuRNqCPBM2Hg": {
    "date": "4/12/2018",
    "text": "It is currently Fiesta in my hometown of San Antonio, Texas and though I am not there, I am empathetically craving gorditas, which are readily available from street vendors and at festivals. Unfortunately in Vegas they're far harder to come across. Luckily I was working on the east side and Ranae W reminded me of this spot.  Abuela's is clean with a simple menu of tacos, burritos, gorditas, and combos. They also appear to have recently added enchiladas, another favorite of mine. Order at the counter, help yourself to the salsa bar, and wait. My takeout was ready quick and the ladies who helped me were friendly.   I tore into my order- 2 gorditas, one asada on corn and the other barbacoa (another hard thing to find in Vegas) on flour, $3.75/ea. If you're familiar with arepas, they're a similar pocket filled with beans, cheese, lettuce, tomato, sour cream, and your choice of protein. The corn holds up a bit better and the asada is more flavorful but both were large and filling, but I'd come back to try the lengua or shrimp.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 29,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "V3V62f6CW0-1Wjc7nc26bQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Dining room",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V3V62f6CW0-1Wjc7nc26bQ/o.jpg"
      },
      {
        "img_id": "Qkc6gjlxx8G36mwqRA2Wpg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Churro with check in",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qkc6gjlxx8G36mwqRA2Wpg/o.jpg"
      },
      {
        "img_id": "dqc3L-VpZ7g0AkJ-iFuaTw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dqc3L-VpZ7g0AkJ-iFuaTw/o.jpg"
      }
    ],
    "user_id": "bLbSNkLggFnqwNNzzq-Ijw"
  },
  "xzbZEpJ-pnUOq8_aV33Y7A": {
    "date": "5/18/2018",
    "text": "Stopped in Vegas for a couple days on the way to the west coast. Stopped here because of the high reviews and we were not disappointed! We loved the tacos (had 1 steak and 1 fish) and the service from Karina was excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ug2SfDILCLffZC8kZeBUag"
  },
  "fi8rL_-Nww0tsI_gpZOwdQ": {
    "date": "7/11/2017",
    "text": "Awesome place with the nicest little abuelitas serving! If you are over on this side of town do not hesitate coming here! The homemade tortillas are delicious! I had 4 tacos 2 asada 1 lengua and 1 shrimp. The shrimp was probably my favorite! It was fried which is different than most of the shrimp tacos I have had in the past. But they had fresh ingredients and the food came out piping hot! I can't say enough about the service! They were great! I would definitely come back here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "23fqm3Ur_qFWRU92JwtD4Q"
  },
  "7QHxSw71g3v6E_dYm7pBIg": {
    "date": "6/5/2016",
    "text": "The homemade corn tortillas and the salsa are the high point here. The service was friendly and the small dining room was clean as were the bathrooms. This was the first horchata anywhere that I really didn't care for. Their was a lot of meat in the taco and the flavor wasn't bad. The enchiladas were cold and the cheese was far from melted. The beans and rice were a pass as in hard pass, no go. Take the chips and salsa instead. The sauces are not thickened with flour which makes a nice option for the gluten free folks. No offense to their abuela but my abuela would beat them hands down, as would several other abuelas I know.  Update:  I did receive a response from the restaurant owner which is always a welcome surprise. I'm hopeful that next time I'll get burned by some hot cheesy enchiladas! I also upped the star rating based on the attentiveness. Love to see that! Thanks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKcEkBB6y05O_lI89NZeXg"
  },
  "7CCw5xk4zvvi-jhGqJdfbw": {
    "date": "3/29/2015",
    "text": "My new favorite taco spot in Vegas!   Don't be intimidated by the distance from the Strip - there's nothing close to this good anywhere else in Vegas.   Authentic, inexpensive, and delicious.   They also have outstanding customer service!   I recommend the #4  I'll be back tomorrow before heading home...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lWwYS666Yiu6Ut1F0SXExQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Off the beaten path (the Strip), but worth the drive. These were, easily, the best tacos I&amp;#39;ve had in a year!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lWwYS666Yiu6Ut1F0SXExQ/o.jpg"
      }
    ],
    "user_id": "WtpTteo_RD-AsFsUmCD1Wg"
  },
  "y3KFno_eUw6j17Vd1Mg5kQ": {
    "date": "12/11/2012",
    "text": "Edit: she made my albondigas and it was great. 5 stars!   No need for Roberto's if you're anywhere near Abuleas. I mean, the owners Abulea is literally in your view making tortillas. They always have specials like shrimp cocktail, or menudo. But their basic daily menu of fresh ingredients impresses me every time.  They have 3 different house sauces, all BOMB. I asked the boss lady to make albondigas in the winter months and she actually agreed! Amazing service, small spot, worth the trip for the authentic Mexican grub!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "DezuzrSV_loxI0r1jYabWA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Albondigas soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DezuzrSV_loxI0r1jYabWA/o.jpg"
      }
    ],
    "user_id": "NjNJ1JLnMlOfnDI6Oz6Qew"
  },
  "NvPMI5ET8ZlAd4vkmiuH9w": {
    "date": "6/23/2015",
    "text": "A lifetime search for amazing Mexican food and I have finally found it. I found this place by accident when I needed to have my car window tinted and I was reluctant to try another Mexican store front but decided to give it a shot.   I ordered the number 4 which includes a Gordita and Taco. Everything from the rice, beans, salsa, Tortillas, meat and even the jalapeno was to die for. The best of the best.   The only thing I would change is the chips. They looked like they came out of a bag but other than that...Everything is O-amazing. Will be back to visit again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nIKxUMHBAWq6WFkcYYmniQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nIKxUMHBAWq6WFkcYYmniQ/o.jpg"
      }
    ],
    "user_id": "FwXFqSdCwYu84iuxsY85wA"
  },
  "AsbmtgQwbvcDqtrbiS82yw": {
    "date": "12/14/2016",
    "text": "GREAT food! The tortillas are handmade! I highly recommend this spot on the Eastside. Very clean and somewhat small, but it makes for a better environment. They've got television playing for you as well. They sell; tacos, sopes, burritos, carne asada fries, flan, seafood and menudo (on the weekends). Plus, the sauces that they provide for you are so tasty, specifically the green hot sauce. The staff is great as well and always attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R7mPYLXWIxVUwsdO10xzXw"
  },
  "4Rp0a-S2aCaykb0VueSOYw": {
    "date": "11/8/2017",
    "text": "Great food! The employees have great customer service. This place reminds me of my grandmother kitchen.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0E4f4eLiI5d4Db6Mm3-Uw"
  },
  "OmZSyEU14Tucc8u0Jj2WeQ": {
    "date": "10/8/2017",
    "text": "Food was really good, great friendly service. The shrimp ceviche was outstanding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lyYEqqCgxrNQYJLX_yi8IA"
  },
  "kLxpqxcTWi1yT4GwUAaMYw": {
    "date": "9/22/2017",
    "text": "Super Delicious Food! The atmosphere is nice for dine in, we were jamming to Selena and other amazing music. The tacos are outstanding! And the Gordon's seemed authentic and yummy. And rice and beans were actually quite amazing! They have yummy Mexican fountain drinks too! Overall it's pretty darn awesome, we will be back'",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_LfdeIdx-gRRrqgVGgxSg"
  },
  "WWZopvpyAG2_TYBhL99ngQ": {
    "date": "6/3/2014",
    "text": "The tacos here are delicious! They are bigger than what you are used to if you get tacos from a truck! It is twice the size of that. I have tried the chicken and carne asada tacos and both were able to satisfy my hunger at the moment. The chicken tacos were okay.. it could have had more of that grilled taste, but nonetheless, I would eat it again. The carne asada tacos were my favorite! It was filled with a lot of meat and toppings on top! At the restaurant, they have a few sauces in bottles. Its fun to just try a whole bunch of sauces, but be careful if you do not like a lot of spice! The bottles are just red and green and you do not know what the spice levels are!  My favorite dish from this place that I crave all the time like a pregnant woman (i'm not expecting, however.. I just love this dish that much...) is the CEVICHE!!!! Their shrimp is made perfectly and it is so juicy with the sauces they put on top! It is dry-- not your typical wet ceviche but for sure.. THIS IS A MUST TRY dish! It is so addicting. It does not come with a lot of chips so make sure you ask for extra on the side.  Overall, this place is one of my favorites. It is a bit pricey, but I think it is definitely worth it!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "SWCLYANLMiXiPhW0mzicVQ"
  },
  "IzA0fqRWzPvGptNN5LtdpQ": {
    "date": "3/22/2017",
    "text": "I come here often and always enjoy everything i order.  Im not a big fan of chicken tacos,  but the ones from abuelas are delicious!  The gorditas with pork, chichironnes and green sauce is the best,  my only issue with that is sometimes they are spicier than other days but no biggie, i can deal with that.  What makes everything so good is the homemade corn tortillas,  truly the best in town.  I will be back again,  and again,  and again...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qCr6cLbNFJsr9U26DspXwQ"
  },
  "Yn3xipCZYIC0XrCv4WZs7w": {
    "date": "6/5/2012",
    "text": "We all stopped in after a day at the driving range and decided to  give Abuela's a try. I've Taco'd well over 500 times, in various taquerias, roach coaches, and street corners, and any time fresh tortillas are made, it is always a good plus when looking for a tasty taco.  We shared a taco combo which came with two tacos with rice, beans OR chips and salsa, but a few of us didn't see the OR part and we asked for chips and salsa as well...Oooops! The chips were stale and we just pushed them to the side. Wifey got an Asada Taco, and I got a Lengua Taco which was very soft and tasty, and the sides weren't bad either.  Don't forget to use your Yelp Check-In offer for a free Churro which is filled with a dulce de leche cream...ALOHA!!!  YELP 365 CHALLENGE-(270/365) \" Gracias Abuelita!\"",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "e-UTP6pZh_6A1ss4Hwws9g",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Asada(left), and Lengua (right)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e-UTP6pZh_6A1ss4Hwws9g/o.jpg"
      }
    ],
    "user_id": "3nDUQBjKyVor5wV0reJChg"
  },
  "zdUlc82QYRwzb4lrSsuxwA": {
    "date": "5/23/2016",
    "text": "So awesome! Food really tastes fresh. Worth every penny. It was my first time trying a chicken quesadilla and I can really taste the flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZx0Yl1uGStDvt_t-5SovQ"
  },
  "dzzS5jxhEqWwTMfcFe958g": {
    "date": "2/28/2018",
    "text": "Excellent place for seafood, specially ceviche, 100% recommended, worth the drive from the strip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5y-TiP1u2Pg7aEqsuGjmg"
  },
  "OcuZv6TboTCTHnAjBdXd7g": {
    "date": "12/29/2014",
    "text": "Loved this place! Super friendly staff -- definitely felt like I'd wandered into someone's kitchen.  Come here for the tortillas if for nothing else -- we watched someone in the back making them and it certainly made all the difference. We tried the grilled chicken and the asada tacos and both were great. Be sure to try out both the green and red salsas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yam3Fh52QaOC54J7BywQpg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Pollo &amp;amp; Asada Tacos (Hold the Onions) -- delicious with fresh made tortillas!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yam3Fh52QaOC54J7BywQpg/o.jpg"
      },
      {
        "img_id": "X6Iybk-CGQK4ttOvHdg0PA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Abuela&amp;#39;s exterior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X6Iybk-CGQK4ttOvHdg0PA/o.jpg"
      }
    ],
    "user_id": "Dj-pjIbe90yBlCPjSoUNrw"
  },
  "dVJ7MUulQYSDSrZAbaGG2w": {
    "date": "8/22/2017",
    "text": "Amazing food! Homemade tortillas set this whole meal off! I have had a gordita in ages and they def satisfied my craving! Karina was great and she provided excellent customer service we will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PyMDEwuVIExwqrt6lfloFw"
  },
  "MM4_lKGTg6z0_F4d0F3bJw": {
    "date": "10/4/2017",
    "text": "The best Mexican food in town The carne asada fries are the amazing. Highly recommend eating here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sl9vq-uwflcE-qN401Hheg"
  },
  "vCZBH90ivmZUCZPpUUyBgA": {
    "date": "9/20/2017",
    "text": "Wow. Awesome food. Great place. Stopped by with my wife and decided to go with the menudo and a taco combo. Delicious. Hand made tortillas definitely make a huge difference. Overall great stuff. It is just slightly over priced but no prob.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iczcUVYWT4Rdl7gHtmtjLA"
  },
  "fUrY9oBc0lPctRQcHrLjZQ": {
    "date": "2/3/2018",
    "text": "It was my third visit to Abuelas ! The food is super delicous and fresh ! I am always happy with the food and service!  Abuelas deserves 5 stars for sure ! This fast food eatery is clean and the customer service us awesome ! I ordered the taco and gordita combo. It comes with a drink, rice, beans or a choice of chips and salsa. Tbe taco was delicious! Was not able to finish my meal. So I took the rest home for later!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DRUrpC86_4LoA-m-5k6iiA"
  },
  "yr48aRGNLvjsBVL_91ZePQ": {
    "date": "4/18/2012",
    "text": "OK, the parentals came up from Southern Cal for a visit on the way up to Salt Lake. They wanted something quick to eat but not fast food (you know, the Taco Bell / Burger King crap). I recommended Abuelas since its down the street from the house. They said OK.   (Now just a primer here -- My dad is a semi-quasi professional chef (has pro training but just uses it at the house) and a very finicky palate - junk food just doesn't cut it. My mom likes the finer things in life but will eat Taco Bell and such if forced)  So we arrive on Taco Tuesday around 3p, a few people inside. Pops was kind of thrown off by the walk up and order from the counter (as he is a menu and full catering type), but the lady by the counter was extremely friendly and had Dad communicating. Mom was in awe that the gal in the back was actually hand pressing home made tortillas. The order was 2 carne asada burrito plates (me & pops) and mom gets 2 carne asada tacos, chips/salsa & side of guac.  Mom's easy, plows into the tacos. Loves it. Loves the pico salsa that comes with the chips, liked the green hot sauce but didn't care for the red thicker hot sauce. Guac was good, real avocados but not much else, no problem. Roasted pepper devoured.   Dad kinda picks at the plate at first and I think, ut oh. Then he says the beans and meat are very good and well seasoned. Hurray I didn't disappoint the pops. Ate everything but the grilled green onion (I stole that). Didn't care for the rice and chips much, but as he says, those are fillers and he thought the chip salsa was good but a tad too much salt. Overall - he was impressed and said he would return if/when they come back out. After 2 hours ago of Abuela's dining and chatting about stuff & life, it turned out to be a real pleasant afternoon. Thanks Abuela's.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e8Y8NIX1fTmM9kAan859Kw"
  },
  "pSe3aEIsaFR-s1g2idMCBA": {
    "date": "2/28/2015",
    "text": "Went to get Menudo and Pozole since we just move to Vegas...place is small but well decorated. Place was clean. Service was ok. The girl taking my order was very straight forward and not friendly at all. I had the Pozole and flavor was ok but too garlicky and not enough meat flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y23eCc3ZxK_VxfH61ptxaA"
  },
  "Hw179qMsOUR4JiAkUhOsLQ": {
    "date": "2/26/2015",
    "text": "I got the taco combo; delicious. The tortilla was super good -hand made!! So it definitely gave that grandma touch! Checked in and got the churro. The service is awesome!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvwaU1x-ZB9-nkjEc4CUPA"
  },
  "-zVMGMAqN-SIRtD7qe9FEw": {
    "date": "12/29/2014",
    "text": "I didn't order much so it's hard to review. I got chips&salsa... the chips weren't that good but the salsa was delish. We got a side of guacamole to eat with the chips and it was very bland, we added salt, pepper, and salsa to it to make it better. I also ordered a churro which i didn't care for. The place was clean and the ladies were nice so that's s plus!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rEn7w8PdIM7tQbPJf9Wi-w"
  },
  "mPHy_JzarBW-P2Y8JbmSXQ": {
    "date": "9/11/2014",
    "text": "This place is soooo good! I've never been to a Mexican spot like that looked like fast food, but still takes the time to make tortillas fresh!!!! I've tried the tacos, burritos, quesadillas and a gordita...all very tasty! No doubt my favorite in town  Mexican restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3BlHMpbWYi58tfDnZ2zUg"
  },
  "7GquRrMKcusmBQ2J-eiukw": {
    "date": "5/28/2012",
    "text": "This time I brought my girlfriend. It was her first time here and she loved it...said she'll bring her boyfriend next time. Everything was delish as usual!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jIH2fzQfXY7RW3C3W1Z1iQ"
  },
  "r8sEeRN84_czUVhIv6ehmQ": {
    "date": "12/12/2014",
    "text": "Great tortillas  I had the three tacos de Assad combo and got me a free churro with my order. A+ in my book.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D1vzReIX94CMjZLkpdFN5Q"
  },
  "MBMEqonXu9TcfhMExnNpLw": {
    "date": "3/24/2015",
    "text": "The food was amazing!!! Reminded me of my hometown in East LA! : )))",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f6692bhC-n5iupRVzYgvEg"
  },
  "cW_ZoitTN5sPk1XIxQyjGA": {
    "date": "6/23/2015",
    "text": "Abuelas is my favorite place in the world, I would never go anywhere else. The tacos are so delicious, omg that handmade tortillas (I cannot believe I just said \"omg\") are so freaking good. When I took my mom here she was so surprised, it reminded her of her moms food. That's how good it is, I  suggest going here for REAL MEXICAN FOOD!!! If you're a Roberto's person , I feel bad for you son, I got 99 problems but tacos ain't one !! Abuelas for life !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2vljP_LAtF2s8jq9cxESA"
  },
  "p6ay7mLZwnzkN9GdxlKb_g": {
    "date": "11/9/2011",
    "text": "A rating of 2.5 would most appropriate.  The family that owns this small, casual cafe-style Mexican restaurant makes everything from scratch.  We had some difficulty deciding what variety of tacos to choose - eventually settling on (2) shrimp, a chicken and a Barbacoa (beef). While waiting for our tacos, we enjoyed the complimentary salsa (spicy) and chips.  The shrimp tacos were by far the best though the others were very good with each being served on a homemade tortilla.  Prices are bit higher than the comparison.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3R0IXD7hw8Nt0BC8uj5aLw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3R0IXD7hw8Nt0BC8uj5aLw/o.jpg"
      },
      {
        "img_id": "d2LIndb6QVwc9BnDMgN1cg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d2LIndb6QVwc9BnDMgN1cg/o.jpg"
      },
      {
        "img_id": "zzEYwX7j13zWdpdtBSz7Cw",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zzEYwX7j13zWdpdtBSz7Cw/o.jpg"
      }
    ],
    "user_id": "L8P5OWO1Jh4B2HLa1Fnbng"
  },
  "sRY3fCNDPbQQp96oR0DxJw": {
    "date": "2/3/2014",
    "text": "If you're looking for authentic Mexican home cooking in Las Vegas, Abuelas is it! I do like the tacos, but I love, love, love the gorditas and pozole. Abuelas is the only place in Vegas that I have actually found real handmade tortillas (which are fresh and delicious).  Perfect with horchata. I just wish they had more salsas. YUM!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-95gDpECFDSjWEL1AIrkAA"
  },
  "p2kUB_sYRnWE5ZVVyt7UOg": {
    "date": "4/5/2015",
    "text": "A frequent lunchtime stop with my friends. Always delicious no matter what I have tried.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19n2stWoXoVdBDITcnQDAg"
  },
  "phkkhlPYzYRkkIjz5CF4dA": {
    "date": "10/30/2014",
    "text": "Very good tasty food.  My first time of many.  Outstanding service and a very clean place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LLoV9ORWjVJG-GR5HOQVqw"
  },
  "Knxv1AQPCAO2Cptwn-MUKw": {
    "date": "12/27/2014",
    "text": "This place is absolutely amazing. Authentic Mexican food indeed! Great prices and the staff is very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPvwjARiAwhazMxa_No9Ag"
  },
  "_9Q-JCRFuDo-uDnbqQWILg": {
    "date": "8/25/2014",
    "text": "Best Bean and Rice burrito I've ever had in my whole life and I'm born and raise in Mexico! A must try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZLCxTAptSBxfWcyAgh07Q"
  },
  "wtsLkNhtNWEwO4ejtt4Xjw": {
    "date": "5/9/2011",
    "text": "I was in this end of town running errands recently, and jesus, this was one of the worst areas of Vegas I have seen.  This is one of the reasons why I am marking this business down a star, just based on distance and the fact that I was scared to get out of my car.  However, if you do feel brave enough to go here, they have some of the tastiest carne asada I've had, but I am by no means an expert.  I also tasted the al pastor, and I was not a fan of the immense saltiness.  I would go back to try the shrimp and fish.  I am unsure if this is worth driving out of the way for, but for what it is worth, I'm still dreaming of that carne asada.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "PomQayG1WhMxeSl1zohAUA"
  },
  "5qPQTYcnXO1c3F88GZsc8Q": {
    "date": "10/4/2014",
    "text": "LOVE LOVE LOOOOOOVE it here!!! Can always tell good Mexican food by the homemade tortillas and beans",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XqNVaP8JqJjaP7OZr7xxfw"
  },
  "L7Bctw4GeoQEL9LrtRQLNQ": {
    "date": "10/3/2014",
    "text": "One of the examples of mediocre tacos in Las Vegas. Oh well, the search will continue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H9Uox-zvwLMkw8hwdFiJzA"
  },
  "akVez7y6zp5gTpzKi8X9Fg": {
    "date": "9/24/2014",
    "text": "I love this place !! Good service, great food and I love the HANDMADE tortillas! Yes handmade, it's hard to find a good place in Vegas like this taco shop !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NKhIvf8FiqyMWFkVomQcAg"
  },
  "XjysfZRSddemXxEsGq3ZWQ": {
    "date": "8/24/2014",
    "text": "One of the best \"hole in the wall\" Mexican spots I've been too!  Reminded me of my Nina ' s home cooking, home made tortilla' s and all!  Definitely worth it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFnbIhkfI4SOBh_1W9qNRw"
  },
  "hWDWoFrCXkiXmIB7zmdVfQ": {
    "date": "6/3/2018",
    "text": "Delicious tacos on handmade tortillas.. what else could you need in life? I'm on the opposite side of town from this place, but it's totally worth the drive, especially for their hot Cheeto tacos! Everything tastes fresh and the owner is super nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIZNrA256rP0x6qkgakFFA"
  },
  "9jynHJHorra-Ufl5zVxuRQ": {
    "date": "3/11/2019",
    "text": "I got the taco combo everything was good , the tortillas taste good since it's handmade the meat isn't bad , they could've hooked it up with extra limes though but overall pretty good , the younger guy that took my order is super nice and is a hard worker (yo go glen coco!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "muUdljmrSzRPbTl2mJk3cg"
  },
  "X0b47VPwtXGV-XkyFOGllg": {
    "date": "6/23/2018",
    "text": "This place is amazing! Food is amazing, service is quick. The staff are super friendly and the place is really clean, it does get busy sometimes which makes sitting impossible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ATPz8ZiP1Q97y_EMzjZTQ"
  },
  "Ii2t8LHLtlDubgJNSSp3wQ": {
    "date": "5/9/2018",
    "text": "The most amazing Tacos!!! Recently used them for my retirement party. They treated us like family. Only place I will use for our family parties. Beat any one else's prices we looked at. They make tortillas fresh right at party and they are incredible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJTJInHN9NuugMDowj_fYA"
  },
  "9mkLUzKLLU8yuv5Yy-U2cg": {
    "date": "6/8/2018",
    "text": "Decided to try this place out since I saw it on Yelp. Ordered the Chicharron and Barbacoa taco combo.... SUPER DUPER SCRUMDILICIOUS!! The green and red salsas are <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> and the made to order corn tortillas make the tacos!!!! Definitely will come back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6At_HMt5HhNkdf8CBNa2-A"
  },
  "_klY2jTFnkP-4hwjDE6hYw": {
    "date": "5/4/2018",
    "text": "Food is always great and fresh. Just wish they were open later, but it's worried the trip. Anytime I have out of town guests I bring them to Abulela's tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QvZZNPzLLgO9_MZp63xKhg"
  },
  "UrG0lIcd0SlouHWr1DUk6g": {
    "date": "12/9/2018",
    "text": "DELISH!! I have a new favorite Taco Shop and absolute go to! Abuelas saved the day for my husbands 40th birthday party by catering the best street tacos in town. This was my first venture to Abuelas and I am so glad we found them. Everyone at the party loved the selection of chicken, carne asada and pastor. You know you have good food when most of your guests are asking where did you get the tacos! We will be ordering Abuelas for all of our events from here on out! Top notch food, great service and early delivery. Everything was PERFECT!! Cant thank you enough again ABUELAS!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1_tNDbmvVk71v_LIri39w"
  },
  "t8WaYpfnbMsCZewZmtyK2g": {
    "date": "7/2/2018",
    "text": "Still one of my favorite places in town - if not my favorite. I'm always so glad to return to Abuela's. Snag yourself a breakfast burrito one day. You won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSvS8kdbZ_TrzYXxIGssaQ"
  },
  "pDgHNVrOsAtpTYiysmceIA": {
    "date": "4/2/2018",
    "text": "One of the best places I ate on my trip in las vegas  I would be coming here every time I visit again food was so good and the prices are perfect for the amount of food you get very fresh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8n25wvmWHsW9fRUthGNNzQ"
  },
  "Kd5LvXfg30U380j6EGEiLQ": {
    "date": "4/22/2018",
    "text": "Finally! Menudo with hominy! It's hard to find a place in Vegas with great menudo made with hominy and this place delivers! Best part are the homemade tortillas made to order.  Been here twice and been very happy with service and food. It's no wonder they've been voted \"the Best of Las Vegas\" twice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "q0uLuUn64AQEEwaUtWfUCg"
  },
  "Dr21nF-LIbcLCNfh6uzUHg": {
    "date": "3/30/2018",
    "text": "We love to stop in at Abuela's every time we are in the neighborhood.  Mason says they have the best bean burrito ever made and I love the chicken bowl. On the weekend you can pick up some posole or menudo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "C-30sGcrst1FBu1x-AzYcQ"
  },
  "KDyEiwbgWY9zmEXhY7vZ7g": {
    "date": "8/15/2017",
    "text": "I can see why Abuela's has been voted best tacos in town before. It's a step above your usual Mexican fast food and well worth going to if your a taco lover. I also don't know anywhere else in town that makes their own tortillas to order for tacos.  Abuela's has a fairly typical menu for a fast/casual Mexican place. They have taco's, burritos, quesadillas, nachos, etc... The one notable thing they have that most other places don't is gorditas. If your only experience with gorditas is taco bell, then your in for a very different experience trying one here. The gordita is pretty much a taco with a much thicker tortilla, and they aren't for me but many people love them.  They have all the usual meats that most Mexican places have. My two favorites are the carne asada and barbacoa, which are both well seasoned and juicy. One meat they have that isn't that standard is the green chili chicarones (fried pork skin), again, not my thing but very popular.  I've had a few different things here, but the tacos are what stand out. This isn't one of those places that serve small street tacos. The tacos here are fairly large and a two taco combo meal should be more than enough to fill you up. As mentioned above, they make all their tortillas in house and to order, and that really is what makes their tacos stand out amongst their competition.  Their prices are also very reasonable and you can't beat the $7 dollar price tag on the two taco combo meal. You get two tacos, a drink, and choice of beans and rice or chips and salsa (I would go with the beans and rice). if you want to try a gordita you can get a taco and gordita meal for only $1 dollar more.  All and all, Abuela's is above average for Mexican food, but has truly fantastic tacos. If your a taco lover, you really should try to come here some time for some of the best tacos in Las Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGGTEoAQ214j3ReN8Pwy4g"
  },
  "mUlxCPkTvvgjCVV4-dympQ": {
    "date": "3/10/2018",
    "text": "Yelped this place while in Vegas. I was happy I did. Have the tacos! Corn tortillas are handmade! The service was good and the place was very clean. The rice and beans are really delish too! The prices are great. Beware! The green chilaquiles are So spicy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rDUZ5QqnKge0UOYZ5JrSgg"
  },
  "c8j1MVqcf4oJyUmsTTYPdQ": {
    "date": "11/5/2018",
    "text": "Abuela's came as a recommendation for a last minute catering order, and when I say last minute, I needed it the next day to feed 75 people. OMG not only were they able to take my order, I was also able to get it delivered. My team tasted the FOOD we were in heaven they came back for thirds and fourths. I know when it is time for another team meeting/function/activity, we will look to Abuela's. The staff was friendly, the location is super clean and the homemade tortillas are out of this world!. I can't give it enough praises. THANK you we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEjrJtj0oeJL-W5ZWdJzBw"
  },
  "8yKo282rb4JtUULtK0Wk6g": {
    "date": "4/15/2018",
    "text": "Best homemade burritos and tacos in the city ,,. These ladies are amazing !! I visits often !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WT1o-WExWnoZmegyBkrRQA"
  },
  "S_agO2xg03qB_Fzbv2Z0DA": {
    "date": "3/12/2018",
    "text": "We had an order of pozole ,  Two combos of 2 tacos de lengua with rice and beans and we had another combo of gordita de harina asada and taco de asada with rice and beans, Last combo was a Omelet de asada with rice and beans.  It was our first time there and we were satisfied with everything that we order for sure we will return once again. great customer service and restaurant was well clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0aRe70LY36hmnlx8-t7vw"
  },
  "fqgC__AvUECI_sTQJQC8UA": {
    "date": "11/8/2018",
    "text": "Great amazing authentic Mexican food.  Today, I picked up a #4 combo: Carne Asada Taco, Gordita with rice and bean and a drink.  Sometimes I go for breakfast.  The menu has plenty of options for everyone.  You won't be disappointed. The tortillas are handmade, which you can't always find here in Vegas.  Always fresh and made to order.  The staff is always so happy and helpful.  Very clean place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwoh4XInzp5sctHW7wqL2w"
  },
  "YLSo1x7j4sANZbq2OaLZDg": {
    "date": "9/22/2018",
    "text": "My roommate saw this place on instagram being hyped up, being a couple blocks away we got the craving for some fries, not just any fries, HOT CHEETO FRIES. Yes, shocking. At that point we were sold. It's a small restaurant, family owned it seems which is cute. I would say the service was so so, the girl could have been more attentive instead of a bit dismissive. We placed our order then I realized they had Sangria and when I wanted to order it the girl seemed bothered to have me place a second order, just told me to wait in a dismissive manor. You shouldn't make your customers feel like they are bothering you. Anyhow, most important part of it all, THE FOOD. We got our food to go, by the time we got home (were like 5 or less minutes away) the Cheetos were a bit soggy. No crunch to them, you could barely taste them. We also got a quesadilla for our niece, which was a regular plain quesadilla, nothing special. In all honesty I've had way better carne asada fries, this left me disappointed and did not hit the spot. Their churros were good though, one out of three.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XwMAw2owHRlHxgX7MBkuQ"
  },
  "9FrnvRG0UX3tHhJKiS3Q-w": {
    "date": "4/29/2018",
    "text": "Great tacos!!! Fresh and very friendly staff super clean and very convenient salsa was good too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBsRYkjYZOXRR4odFvEWfg"
  },
  "sSo8sxFXwExXvMLt1yYSnA": {
    "date": "3/2/2018",
    "text": "This place is wonderful. With the amazing food with the affordable prices, it is definitely worth it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pq-zbSlT2KqRdd7uzhkPqQ"
  },
  "1kd7NQ2IjLWcQtWsmewpFQ": {
    "date": "3/17/2018",
    "text": "Great food!  The salsa is amazing!  We had the carne asada burrito and juevos rancheros.  The burritos have rice and bean inside and I'm not much of a fan, but for this place I make an exception.   The beans are delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xQZLcsWDoxAHLI9IpNOdXg",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xQZLcsWDoxAHLI9IpNOdXg/o.jpg"
      },
      {
        "img_id": "cjeq22cr35Kn5POfEC_-Ng",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Juevos Rancheros",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cjeq22cr35Kn5POfEC_-Ng/o.jpg"
      }
    ],
    "user_id": "IypMi1C4ONRxGlsgv05a5A"
  },
  "lV12YKkiwodR-12wtTGGhQ": {
    "date": "3/2/2019",
    "text": "wtf are these carne asade fries???? Where are the toppings??????????????????????????????????????????????????????????????????????????????????+++++????????????????????????????????????????????????????????? Inedible",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ah6LefpF8LuDWKsi72dYLA"
  },
  "W-z3_xeChm2Wu1_qSXhIDg": {
    "date": "8/26/2018",
    "text": "OMG I cant stress it enough how much I love this place I swear me n my hubby come by every week this is our fave spot .specially since Leslie n Tati treat us like family .there tortillas are the bomb my hubby loves the enchiladas are delish. If u ever in town n need great customer service n bomb food hit this place up u won't be disappointed much love",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCvr_QS_mvvXxtD7Ds1Wsw"
  },
  "bIJ7XWTXJqIl09PK1nUjsw": {
    "date": "1/3/2018",
    "text": "Good good & great prices But over all friendly staff. Food was out fast. When making an order staff recommended i get the combo that was only a few cents short then what i was ordering and came with a drink. I would definitely come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZcCm6bboknqHdK58RgIcA"
  },
  "9aR2V1uSBEJD9RcBwlh3gQ": {
    "date": "9/24/2018",
    "text": "This Place has been hyped up too much!!     Ordered the 3 Tacos De Asada and Carne Asada fries and it was horrible and this is crazy to say but Roberto's Asada Fries are way better.. The Tacos are just \"OK\", Don't recommend coming here!! not worth it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_am0zr9waB7sWSNiOPDnEg"
  },
  "XLhYjQAx8toEDszhyKlMGg": {
    "date": "5/18/2018",
    "text": "First time here, and food experience went well. Food was delicious and the wait wasn't that bad. Local east side Hispanic food, this is the place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Re8hggUlDPdjBqh1D_jNTw"
  },
  "cOvgYwK-Av07SBG7tt9BLQ": {
    "date": "9/1/2018",
    "text": "not bad i like the texture of the chilaquiles they didnt have ass them like alot of places do here in vegas where they just throw sauce on chips ...not the best ...i woundt say its authentic...but more of a tex mex vibe ... would i come again ?? probably not ... i wiah theyed hook it with a slab of carne asad but they cut it up and ended up tasting like precooked overcook meat ...meat isnt real high quality...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cO2LPzXO74BYvCxMY2UfgQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cO2LPzXO74BYvCxMY2UfgQ/o.jpg"
      }
    ],
    "user_id": "bHufZ2OTlC-OUxBDRXxViw"
  },
  "DCjhpptucKfy-LlzkwMBRQ": {
    "date": "7/30/2018",
    "text": "Delicious and refreshing shrimp ceviche  tostada on a hot day! Love it! The gorditas are yummy as well!! Place is clean and staff is very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xlcNF5lm7ygc8Y4xYTBmhQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xlcNF5lm7ygc8Y4xYTBmhQ/o.jpg"
      }
    ],
    "user_id": "zQVVKSql0Ch9ObwbP5DHSQ"
  },
  "eBnSNrAJTArPvzynMP5Jug": {
    "date": "12/24/2017",
    "text": "Such amazing food and service will be coming back !!!:) I recommend the flauta plate!! Salsa is spicy but you can't go wrong with anything",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lalmMwgIp-YP7kQEYmhz-w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lalmMwgIp-YP7kQEYmhz-w/o.jpg"
      }
    ],
    "user_id": "gGxeKsITzBAYmti7dfvzCg"
  },
  "kUo-xDeIOWn-17uBDOcMPQ": {
    "date": "7/17/2018",
    "text": "The food was delicious and the service was great. I has the torta and a michelada. My kids tried the hot Cheetos tacos and were fascinated by them. I will definitely refer this place to others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3A_4s7kepmf01Ion3VVW4A"
  },
  "VjyJpXEB8VOAjDG2hYeKhQ": {
    "date": "12/16/2016",
    "text": "Decided to check this place out for lunch while in Vegas one weekend. It was everything a 3 star rating suggest, A-OK!   We ordered the 2 taco combo, one taco with carne asada and the other with barbacoa. The combination came with rice and beans OR chips. I chose the rice and beans The taco with barbacoa was really tasty! Nice and moist! The carne aside was just ok, and same for the rice and beans.   I felt the price was a little hefty for a whole-in-the-wall-esque type of place.  I mayyyyyyyyyyyyy stop by here and try something different but I'm pretty on the fence about it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BV-8bchEixuSb7ccocBYtA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BV-8bchEixuSb7ccocBYtA/o.jpg"
      },
      {
        "img_id": "-lGz5l8RCBZu9E40ad7w5A",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Carne Asada Taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-lGz5l8RCBZu9E40ad7w5A/o.jpg"
      },
      {
        "img_id": "cYqmwV56ZzmRy1hEtnKA8w",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. 2 Tacos Combo Plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cYqmwV56ZzmRy1hEtnKA8w/o.jpg"
      }
    ],
    "user_id": "gTQEvdmFvjpMR0KUmXQzzQ"
  },
  "DFtLBRoEh1EAeKmm74y9nQ": {
    "date": "3/27/2019",
    "text": "My new favorite taco place! All this time I've been wasting my money on Roberto's just because they were a 2 minute drive.  I love the tortillas, they don't fall apart! I always get the chips and salsa side, the salsa is so delicious! Great prices too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaNV-IFarllW1fbneGi8KA"
  },
  "ND7wguKqw76NWwj2W5SKlA": {
    "date": "7/25/2018",
    "text": "This place is bomb! Definitely go if you're in the mood for amazing food & great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvcthLdhPujf0IHk4dNSPw"
  },
  "j-iK4kHDyZoEklSR1wVhZg": {
    "date": "5/30/2018",
    "text": "Stopped in was showing houses and saw the abeulas car and remembered my coworker would say it was fantastic. I chatted with the owner and she recommended the Chile verde gordita and fish taco... I loved it and will definitely be back.  Very friendly staff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1YOIYjkoKY30FVEY78o4Q"
  },
  "FH8rmcQCK7y2ZkiiPHsvhA": {
    "date": "6/2/2018",
    "text": "Very good  tasting food and fantastic customer service provided by staff working at this establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2_Ld61IFU2DnGQnXBltCxA"
  },
  "KivzJeoFDjMcG8TYTRjMrA": {
    "date": "9/10/2018",
    "text": "The fresh tortillas at Abuela's, really makes the difference.  Everything they serve is delicious, especially their barbacoa burrito, and asada fries.  The salsa is a little mild for my taste, but I plan to ask next time if they have something spicier, as I've found most mexican food places do.  ;) been there twice so far, and plan to go back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wrcs2m93P5miHofO9TOacQ"
  },
  "clcYy4VougbvbvxEqD1MLA": {
    "date": "8/19/2018",
    "text": "For a taco resto it's very slow. Waited for our food for 30 minutes and wasn't a lot of people eirher. Food wasn't up to par, the beef on my taco was overcooked. Not coming back here fo sure.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-e3bt8FUmqOQYHt4Rhheg"
  },
  "0BXrmEHSnTQVBSda5nfgrQ": {
    "date": "7/21/2018",
    "text": "Abuelas has never let me down. From burritos to carne asada fries, they never fail to surprise me. And by surprise i mean the Hot Cheeto Tacos/Tortias theyve recently started serving. I wish id tried them sooner!!!! abuelas will always have a place near and dear to my heart.  If youre not eating here, youre missing out for sure. P.S. the micheladas are killer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PxKmXsV8O3HqI-FzrUj8oA"
  },
  "kXMPLNXW_IvMO0PnblAHxw": {
    "date": "11/10/2017",
    "text": "First time at Abuelas Tacos, they exceeded my expectations. I ordered asada taco combo, with rice and beans. The tortillas are fresh, hand made and the carne asada was very tender and well seasoned. The rice and beans are delicious as well. The restaurant is very clean and staff very friendly. I highly recommend abuelas tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cj79Ma1SG_wTZehz1_DdwA",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cj79Ma1SG_wTZehz1_DdwA/o.jpg"
      }
    ],
    "user_id": "lkSe_7a_VWgjYUOWgUAEfw"
  },
  "on2U0JAWRU9wz5Z96OR_5g": {
    "date": "7/3/2018",
    "text": "Thank you for delivering to Dean Petersen  . Our office staff loved your food. I knew I was feeding them the best food in town . Thank you Leslie , you are the best !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TE_ixc6tIq_lMTqKjfQ0cw"
  },
  "Q1XY81SbddKCkX6F5eK3zA": {
    "date": "5/10/2015",
    "text": "Good food. Authentic. Not too expensive. The cashier was awesome. The carne asada fries are gooooooood! Come and see! Chicken Quesadilla was also very good. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "enM3tPNAVCKY2yvrtsFHQg"
  },
  "iGAMSdcSthi4d8lqUSs_gg": {
    "date": "6/6/2012",
    "text": "The asada tacos I ordered were not bad however the only thing worth coming here for is their homemade tortillas.  Also had a bite of a churro which came from the freezer and not Abuelas:( so cant say that's how my abuela would have served them as their slogan reads... They also need to set up a better delivery system because coming out with plates of food calling out to the dining area \"who ordered this\" is not efficient.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lT49-Xggq_VAB2E9dce0yA"
  },
  "vdBmfPD2UC4XMO-6qOZjUA": {
    "date": "11/7/2015",
    "text": "Very fresh, very fast and very taste The steak burrito had a smoky flavor and the salsa had just the right kick.  I will be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Y_w90hJsLlBqyAm-DDeFg"
  },
  "jFuty4oEf05KUMrQikO2gw": {
    "date": "11/23/2014",
    "text": "Amazing!!  The ladies were so sweet and the grandma was making homemade corn tortillas on site.......delicious!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ApZMgqR6Fi-SrjksQ_wYrw"
  },
  "nuwEJIRGbb9s71IEwTO64w": {
    "date": "9/27/2013",
    "text": "I'm giving this place three out of five stars because I tired five of their tacos and I liked three of them.   Since it was my first time eating here, I ordered an Asada taco, a fish taco, one chicken, one barbacoa and one chicharron verde taco. First, the ones I liked. The beef asada taco was amazing. The chicken was good. My favorite was the chicharron verde (although it's spicy so not everyone may like it, but I LOVE spicy. Bring it on!)   The woman who took my order said they're known for the barbacoa. I wasn't impressed with it. It was bland, like it needed salt and pepper. The fish was also disappointing: pre-cooked and oily with really thick batter and very little fish.  Despite the two so-so tacos, I'll definitely be back. I was particularly impressed by watching them make the tortillas for the tacos right in front of me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2wGkrX311rMD9vUH23FvQ"
  },
  "tabUwxyESDggNmM-ka57RQ": {
    "date": "7/6/2015",
    "text": "This place is the best tacos I have had in town! Very affordable with great customer service. Tried the carne asada fries,the pork and chicken tacos as well as the flan and all of it was delicious! Also had the horchata which was good too. Would highly recommend this place to anyone looking for a great taco at a great price!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_4Nf0DBSSSKZb3gRdujrA"
  },
  "RNQDSwgBNYLA-RE0y6hMGQ": {
    "date": "11/3/2014",
    "text": "I'm not normally a huge fan of Mexican food but Abuelas Tacos hit the spot!  Definitely order the tacos, we had the fish and shrimp combos. The shrimp was slightly breaded and the fish was battered. The taco itself was homemade and was thicker but had a light, crispy taste to it.  Even the beans and rice were well seasoned.  Try the shrimp soup too,  it was a red stock, very yummy.  Don't forget to check in for free churros! They were hella big!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EYcrZxm0A9VKGjR-yizDvw"
  },
  "is9ucFHg0jL-DIOhREE9LA": {
    "date": "12/13/2015",
    "text": "5- Stars!!! They catered my 40th bday party and it was amazing! The food was fresh and delicious and the cooks were professional, polite, and very clean!!!! I love dining in the restaurant and now they are on my list for Catering! Working in Food & Beverage in Las Vegas tends to make very picky, but they rocked it out for sure!!!! Thanks again to Leslie and her family",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uB7FJzbdpC50oWuuic4k7A"
  },
  "5y5DSegPsqGzUJ-DTewWYg": {
    "date": "12/5/2014",
    "text": "you can never go wrong with anything u choose on the menu. I love their yummy preparadas. They always have grilled onions and chiles verdes if you ask for them :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0YFN7or2isuZV_L2SqiKA"
  },
  "i5C-LKLLNgd93ZnKCbg6YA": {
    "date": "4/18/2015",
    "text": "Definitely try this place out! I've been here several times now and their Gordita meal is my favorite. The food is great, service is friendly, and it doesn't smell like crap inside the store (a problem with a lot of the fast food Mexican restaurants in town).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YiufjtSsr7lQc9Mfv4bbcw"
  },
  "afEbNy7d324pKZpF4wI_Ww": {
    "date": "8/4/2015",
    "text": "Over rated.... for 2 tacos 1 fish 1 barbacoa n a preparadas...$13... They were good not great ...not worth the $$ Maybe I tried all the wrong things? ?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2IY-k1TP5YeS9_qw0EeI6g"
  },
  "9c5Li60DrIm34pm2qaD_2g": {
    "date": "5/29/2015",
    "text": "I stopped by this place for lunch. It was just OK. The quesadilla was a little off with this thick kind of gordita type of tortilla. I don't like thick tortillas, especially on my quesadillas, and it made it thick and stiff. The meat was also pretty grizzly although it had good flavor. I tried a new type of pork taco. I don't remember the name but it was saucy. It was OK. I'm actually surprised this got the Best of Vegas award. I've had much better Mexican food in Vegas although there aren't many.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5YNzZwQuYxgE-jSDcZLxA"
  },
  "-kTkSjUDis1W8lQld812HQ": {
    "date": "4/20/2012",
    "text": "Discovered this place thanks to Now Deals on Groupon, $5 for $10. Most, if not all the combs were under $10.00. I had the taco and gordita combo which comes with a drink and a choice of chips/salsa or rice/beans. You get to select what meat you want and looks like there is no additional charge for shrimp. I picked the carne asada. I added the chips and salsa and flan. All of the food was delicious and reminded me of homemade meals of my grandmother : )  I especially loved the gordita. Instead of a deep fried thick corn tortilla it was made out of thick flour tortilla. A way healthier option without sacrificing taste. The beans were flavorful and the rice moist. No skimping on the meat, it was lean and it was some of the most tasty, I have ever had. They also included a grilled green onion and grilled jalapeno. Although, I live in the Centennial Hills area, I will be going back here regularly and recommend you try it for yourself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lpXqKfx9WeDjHuTRb9iljw"
  },
  "_k14Gyjo7yRPWWlhGnxong": {
    "date": "7/1/2015",
    "text": "I love this place! I've been here several times and have never been disappointed.  This time I took 3 friends with me and the owner came out to meet us.  She was very friendly and laughed with is as I ate a large cooked jalapeno! Be prepared for the heat if you try that! I had the pork burritoand it was definitely a winner. All my friends enjoyed themselves too. I recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-P35D4c5Z8cCAFyRvbw-A"
  },
  "ymUmnIY10nyI-ba4v3jypQ": {
    "date": "10/3/2013",
    "text": "The best Mexican food I have had in vegas. I am from San Diego , so I am used to good authentic Mexican food. I was beginning to think I would never find it here. Great food, friendly service , I will drive across town to eat here .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8LsASv9DpkAiJBSQHX6SQQ",
        "caption": "Photo of Abuela's Tacos - Las Vegas, NV, United States. Asada, fish, and barbacoa tacos. Delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8LsASv9DpkAiJBSQHX6SQQ/o.jpg"
      }
    ],
    "user_id": "-GRsDKYqYfFTgf2ZlSDU1w"
  },
  "o8wnenWevmiW-AGsXuJv0Q": {
    "date": "10/5/2014",
    "text": "Definitely worth going out of your way for yummy homemade tortillas. Tacos are the best! its not fancy order at the counter and take to your table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UV-pwUM9wn57exkH5Ftihw"
  },
  "I08KhEHIUB9uYtd5N_JXTA": {
    "date": "4/24/2015",
    "text": "Been looking for a real good taco place for about 3 years. I gotta say this is my new hit that craving taco place. Tortilla feel so fresh n can't find anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghNWOY7OTXnWLOQZQz5FUA"
  },
  "wNi8AgA55rJWSA9xIT62HQ": {
    "date": "6/18/2016",
    "text": "good stuff, carne asada fries were very cheesey. They make their corn tortilllas from scratch, which is pretty rare these days.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYW6iL6dzzvWWgzGc1rYkQ"
  },
  "NO8ezn13e7m-Vo6VN3GYDg": {
    "date": "1/3/2015",
    "text": "Great food and great service. All tortillas are hand made. Everything is fresh. You always know good Mexican food because there are a bunch of Mexicans eating there. That's how this place is. It's very clean too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ushQ_FaM5s2u8tOf2z5T0Q"
  },
  "7cxMN2J_py2CN1CVugDkUw": {
    "date": "3/3/2015",
    "text": "As I was searching for a chicharon burrito today I happened to run into this little hole in the wall... great and friendly service.... Although there pork was not chicharones I will come back... slightly deceptive but on a good note I will return... love the fact that older ladies were cooking my food... makes me feel like I'm at home... good job ladies!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJNahEx4noGJ5OYaD5Dd2Q"
  },
  "dy5titxIxeyQ9BgnG0GjHQ": {
    "date": "8/25/2014",
    "text": "This place is the perfect atmosphere for relaxing and taking in a TV novella or two while waiting to get your auto glass tinted or repaired. The abuelitas are adorable and welcoming, and the food is as good as it gets if you are looking for something rich and authentic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "87Wsw5fwbMKa79vwdT5alg"
  },
  "7N-9FF1Q2ijCwSNDdknwNA": {
    "date": "10/19/2013",
    "text": "What a find!  Small mom 'n pop place with GREAT food.  Lengua and barbacoa were wonderful!  Fresh, housemade tortillas, and great flavors.  Reasonably priced combo plates.  Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P51Kkt3jwj99b-I37qQyzg"
  },
  "zPraBuVjZ7HEuc-MJAbiDA": {
    "date": "4/15/2013",
    "text": "Abuela's Tacos recently catered a party for us. The food was amazing and fresh tortillas were made on the spot! I would recommend Abuelas to anyone looking for a unique dining experience for a house party or bbq.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqUJxJ2YmHz_Yp4T_K_wOA"
  },
  "P5-j2vpee--P4NFx5Ltqsw": {
    "date": "6/27/2011",
    "text": "Ok, had a groupon so I decided to take my best friend tonite and all I can say is YUM! We both got carne asada burritos and chips and salsa...then the sweet/beautiful owner brought us a side if beans for our chips...complimentary! We both absolutely loved all of it and then I also bought us churos... Scalding hot but couldn't stop eating lol.. Love fresh hot yummy food and dessert! And everything was super clean especially the bathroom! Sooo going back soon to try the shrimp tacos...oh and they are very reasonable priced!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QnK4dcZIMGikTeG9aXPYSw"
  },
  "hyVPbkHK8g7P66PYUGdA1g": {
    "date": "8/2/2011",
    "text": "What can I say, simply good food! The salsa is really good you can just drink it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3BZfEkRXHn2t7id_cbOJrg"
  },
  "F2zGu_GQIvtJDgySudhfHQ": {
    "date": "3/4/2011",
    "text": "I went to Abuela's Tacos with my family. The tacos de chicharron verde are the best I have ever tasted and to top it of they have handmade tortillas which even made them better. My husband had the shrimp tacos and said they were very good, but  I knew he really liked them when he asked to go the following weekend for more. I really recommend this Abuela's Tacos to anybody who likes mexican food and even if you don't you will there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_U4-A6lIdq-6_Yo59INM7w"
  },
  "nKh2ZyeOkte69VLY58CXDg": {
    "date": "4/21/2013",
    "text": "I was disappointed with the chips and salsa - stale chips and old salsa - the tacos were OK nothing great.  Good place for a quick lunch if you're close by but otherwise  I wouldn't eat here.  As mentioned in other reviews the tortillas are amazing but that's where it ends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EuTR1cZ8Sg-LdJdL40SeCA"
  },
  "0wWJO90MhIrc5XcYgD9cMw": {
    "date": "7/26/2011",
    "text": "I just came from this place on my way home from work and I will be going bsck religiously. The food was awesome and the girl that own's it was such a sweet heart and offered conversation while I was waiting. Im gonna try to snap a pic of my abuelita ( they put your abuelas pic on their wall ) and bring it in soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2SY5ML2NJivHmXVx2mdEHg"
  },
  "mLbsfnPyjC9OvhhshNl_9g": {
    "date": "8/16/2012",
    "text": "WOW! This place is good. I found a 2nd favorite Burrito place. My favorite is Carlito's Burritos but this place ranks right up there. Its a little cute place and gives off the home feel when you walk in. They have a basic menu, Tacos, Burritos, Quesadillas, Carne Asada Fries, Nachos and etc. Very clean and they even make the tortillas fresh. The staff is very friendly. Had the Chicken Burrito with rice, beans, cheese and pico de gallo. So damn good. I had to stop myself from inhaling it. I wanted to enjoy it. My wife had the Carne Asada Nachos. Them and the Carne Asada Fries are among the best in town. Just every layer has so much meat, cheese, beans, and im guessing they use Mexican Crema instead of regular sour cream. So dang addicting. We been there a couple times and we keep going back to what he had even though we keep saying we gonna try something different lol. If your tired of Roberto's i say give this place a try. Nice to have a place that has food that tastes like mom or in this case, Grandma makes :-) Until next time, Let's Eat!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sX_PPJHVCo6P0Jbm7jxd6A"
  },
  "HEcHtRKig-nUal2Qp7CqOw": {
    "date": "4/29/2013",
    "text": "The food was really good. Service was great. My mom and I ate the red pepper without fully knowing what it was. We learned it was super hot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nDoX5fjsoHekROpeUZvyA"
  },
  "eD7sicWmZkLjbA6iVGozSw": {
    "date": "7/27/2011",
    "text": "OMG the best shrimp tacos in town!! When we got there it wasn't much but the food makes up for itself. The service was friendly and comforting. The prices are amazing. I was in Vegas for the weekend and I ended up going there twice. Their shrimp soup is good!! It had a lot of shrimp. The owner was so friendly. Their tacos, nachos, and quesadillas were also good. My friends and I were all completely satisfy and amazed. I love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vAXmKU5XQAY5OytJcIq1zQ"
  },
  "phl-Q2m_DQpzwJHZl-cLoQ": {
    "date": "2/26/2011",
    "text": "All I gotta say I have tried everything on the menu I come here at least twice a week and I love it delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wi6LgBG2HjDHCcFLT2sprg"
  },
  "sfnndRZ7NBepLx8yzjTsvQ": {
    "date": "8/9/2012",
    "text": "Outrageously priced!  Ask for a receipt and make sure there is an understanding between you and the person taking your order.  We ordered two plates of the huevos rancheros, which were far from traditional, and paid $25!!!  I was not very happy, epecially since it was just two cooked eggs (not the way I ordered them) on top of two tortillas (not hand made) and an abundance of chopped up tomatoe and onion on top! WHAT!? Are you kidding me?! and for $8.95 a plate... I was better off cooking breakfast at home! On top of that for some odd reason we were charged for 6 xtra sides of tortillas!!! WHY!!!??? On top of -THAT- there was no cheese or sour cream added to the huevos rancheros, which is a pretty traditional part of the meal.. I wouldn't dare to ask for them to add that, because then we probabably would have surpassed $30 for a BREAKFAST for two people. We won't be going back that's for sure.. you can find better quality for that price.  This was a to go order, I did call and complain and they agreed to refund my money charged for this \"extra side\" of tortillas.. It won't make me or break me, but I would rather put that money in my jar which is used to buy toys for the less fortunate children during the holiday season, than to give it to a ridiculously over priced business.  They also downgraded me when my co-worker went to pick up the money..  I guess they didn't appreciate me for complaining.. Well did not appreciate them for over charging me for less than a satisying meal!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV8KJITfaiACQp7e04vZKA"
  },
  "OpDdj6i0yMTUEIptBsuTYA": {
    "date": "6/29/2012",
    "text": "stopped in while getting my car repaired very friendly place I had the number 4 combo taco and gordita combo.  Very tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pcY4u-I67GoHAy7Zo0VDIQ"
  },
  "F59xQeQzpwRSQ09tWb3IPQ": {
    "date": "6/25/2011",
    "text": "My husband and I were visiting for a convention and I decided to get the groupon just as an excuse to get away from the strip. We are from San Diego and we have pretty good Mexican food in SD, but Abuela's totally topped anything we have ever had! The hand made tortillas were so fresh and had amazing flavor. We had the carne asada, fish and shrimp tacos. The fish was good, but that is the only one I would say San Diego has anyone beat on. The meals were not overly salty, all the ingredients went together so well, we are very impressed. A day later we were craving Abuela's tacos again, but this time I had one of each flavor to go. oh my talk about deeeelicious, and The barbacoa was AMAZING! We ended up going back one more time for our drive back, for total of three visits in our six day stay. We are definitely going to have Abuela's on our list when we come back. Mary was so nice and made us feel at home. All three times I did not find the restaurant to be in a dangerous area, maybe just a little bit of an older neighborhood, especially if you compare it to the strip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GeVbqCZ-zOyLNTDOTzphGw"
  }
}