{
  "woTV1nO0dA7NyQ54P_o39A": {
    "date": "10/18/2016",
    "text": "I was visiting Vegas over the weekend and always wanted to try a sushiritto so gave this place a try. Interior was really clean and bright. I liked that it was new. I got the shrimp tempura roll and the regular size was enough for me. What I enjoyed the most was the sauces. I thought the chili garlic aioli was good with the eel sauce. Clean set up and highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "__03G2ZPgOFwxRgphyaKpg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Inside clean",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/__03G2ZPgOFwxRgphyaKpg/o.jpg"
      },
      {
        "img_id": "jqQ7Dmr1YZoDdVOAk6XXWw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Store front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jqQ7Dmr1YZoDdVOAk6XXWw/o.jpg"
      }
    ],
    "user_id": "JM0ruxkRPAZ0LvPh2xAXwg"
  },
  "Owv_kJoBsvRZGLpalEi0rg": {
    "date": "9/2/2016",
    "text": "First this is not the type of place I would choose to go but I let my Grilfriend pick after picking he up. She picked sushi so I said let's try this new place. More truth is this is far from the food I like to eat. Walking in it was clean and had an industrial look. We were greeted as soon as we walked in.     Salads, Rice Bowls ok I get that, I don't like that kind of food. So I ordered a Sushi Burrito sat down and thought her we go. Shock is best word I have after the first bite, so took another one, it tasted fantastic. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VP9C8feJFSZEKLNSMf_KNQ"
  },
  "7OYjFZjNKhCI67uxi6D7Xw": {
    "date": "10/18/2016",
    "text": "Love their sauces! My favorite one is Yuzu Miso sauce!!!  I go to Tail n Fin once a week :) Thanks for opening in this area!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uiHiOP9JKdVrd2kBJ-htxQ"
  },
  "tZHhLMU9_LPFYyBLG5ef9A": {
    "date": "7/23/2017",
    "text": "First time not bad.  The Bowl needed more lettuce since it's a recycle bowl & it's dept.  More balance w lettuce and protein/ options.  Everything was great! Felt the shrimp tempura should of been less tempura. You couldn't really taste the shrimp. I tried the build your own bowl and will try another tomorrow . I didn't want anything heavy for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHhJTn0glStWUpsmKXBsqQ"
  },
  "SmTcN-gtdmSjSxAlGE1pbg": {
    "date": "8/17/2017",
    "text": "Easily the absolute BEST poke I have ever eaten and I'm from California where poke joints have exploded. I had a build your own sushi burrito and it was absolute heaven.  Here's what makes them amazing: THEY HAVE SOFTSHELL CRAB which you can put into your sushi burrito.  It is a transformative experience.  Their variety of sauces is also fantastic.  Here's my creation: Salmon, Softshell Crab, seaweed salad, cucumber, green onion, furikake, pineapple, avocado, tempura flakes, chili garlic aioli, and poke sauce.  I'm telling you, they wrapped it so tightly that all the flavors melded together.  I am willing to drive all the way from California just so I can experience this place again. Prices were great, too and it's located on the 15 South so if you're headed back to Cali after a crazy Vegas Weekend, it's a great stop for lunch.  Trust me, it will change your life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "znFaHK4pY0ywjonIIZJg0w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon, soft shell crab, seaweed salad, cucumber, pineapple, green onion, furikake, avocado, tempura flakes, chili garlic aioli, poke sauce.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/znFaHK4pY0ywjonIIZJg0w/o.jpg"
      }
    ],
    "user_id": "ZYKjLBXqQZEYntpA3FYnCg"
  },
  "tQy8LiSwlL43a746VhFbeg": {
    "date": "11/20/2016",
    "text": "Not good at all.   Fish smelled and tasted old, burrito is about $10 and not worth the price.   The poke is a bowl of rice with fish dumped on top.   Zero care about preparation   Looks like they are trying to cut costs already and they've just opened.  Really let down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vf3ZyTw1927vMo_QLsHTKA"
  },
  "PCAD24v453-NulSI2Pp7wA": {
    "date": "2/16/2018",
    "text": "I'm perplexed at the \"cooking\" style of this place. They use cold rice in their bowls and burritos (white rice in a container at room temp, brown rice in the fridge). Yet I see over 200 review with average rating of 4 stars. Could it be that people actually prefer cold rice? Every other poke bowl place I've been to serves rice hot from the rice cooker. I highly doubt cold rice is how it's done in Hawaii. Looks like a couple months ago quality was on par but recently, management has been slacking and food quality is gone. Chef Karu - do you know that cold rice is being served in your restaurant???",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pal9a6sj1xeUq6ORYysqA"
  },
  "Dio2kfJWebc5rd6DmjsS3w": {
    "date": "3/26/2017",
    "text": "I visit this spot by myself once in a while for lunch as well as with my family for dinner. But tonight the sushi Artist made our bowls pretty and showed pride in his work. It made it more enjoyable to eat because he didn't just dump the ingredients in the bowls.  This guy should be teaching the rest of his co workers to make a bowl. I normally dont tip when i do take out but you deserved it.  Great job..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQp2i4ZYGDHCSHfWC18SdA"
  },
  "FrFXjlDIKRbtaX6h1vKK_g": {
    "date": "6/17/2017",
    "text": "Big portions, friendly staff, clean and well lit what more can you ask for? The fish is always fresh and the same goes for the sides. I have tried many sushi burrito places and none pack the burrito as full as this location. The rice I have never had a problem with which has been hard at other places I have eaten at. Overall 5 out of 5 and I will keep returning here unless something drastic changes. My favorite thing to order is the \"omega\" with some added green onions and jalapenos.. delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRyxVfR-GEC72wS0zKtgxA"
  },
  "Q8QlzG22wV6HJN2L-kkmFA": {
    "date": "10/26/2016",
    "text": "Love the burritos and the avocado boats! Great food, great taste and the staff top notch, very friendly and takes the time to explain the menu and suggests alternatives if needed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wK2UyiRYSdUomgSVsJgGxg"
  },
  "kqzCVyPdFWL34K34hS9ukg": {
    "date": "5/19/2017",
    "text": "Ive tried a few different rolls and their always on point. They don't skimp on the fish either and it's always super fresh. If you order the yo Adrian be aware the jalepenos are spicy so if you want somewhat spicy tell them to put less on it. If you don't like spicy at all maybe sub cucumber instead. Only issue Ive had is placing an order through yelp24. I guess the staff didn't see it but they made my food right away so no big deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoZtrrJRH3ukUjciyi3sVQ"
  },
  "1OM_KTwJIlDss5vnhnvvsg": {
    "date": "9/25/2017",
    "text": "This Tail and Fin in Henderson has to be the best in town!!! Although, I find myself going more often I truly fell in love with this place my first time visiting. I have visited other \"sushi burrito\" style restaurants in town but this one overall has to be the best!  After a long day at work I didn't feel like cooking. So, I thought to myself this would be the best time to not only treat myself but to introduce sushi to my daughter:).  While walking in we were greeted with a warm hello and a kind smile by a team member named Sophia. As stated, my daughter has never had sushi before and Sophia was kind enough to go through the menu, make suggestions and described some of her own likes and helped my daughter figure out what she should order. Needless to say my daughter was very happy with her selection. As stated, I find myself stopping by more often to pick up lunch before I go to work. If I have the pleasure to be assisted by Sophia she asks me about my daughter and always remembers what I like to order!! So, this place to me has to be the best in town not only because of the great food but because of terrific team members like Sophia who help keep an establishment like this running!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qj2S_kwPEixPr48GHesFuQ"
  },
  "Xo4ZR-hazSWEGS0uzAbX7Q": {
    "date": "3/1/2017",
    "text": "I was so excited to try Tail and Fin since it is so close to our home and I have been back at least 15 times since their opening.  I originally made weekly visits to Poke Express on Eastern to satisfy my poke cravings since I was quite disappointed by Tail and Fin's neighboring predecessor Soulfish Poke.  I think this place really hit the nail on the head when it comes to these non traditional poke bowl restaurants. The servings are exceptionally generous which is my problem with Soulfish Poke.  Love the fresh ingredients and most importantly the quality of the fish.  The staff is always so friendly, greets you immediately upon arrival and always efficient!  Excited that they have expanded with a second location, as that indicates they are doing well.  Great food and service, I also love that they allow Postmates to deliver for a low fee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LcjbUhhe6-dPJreO9aJ0cA"
  },
  "koPXisvIq8fjPjHQUwxLSg": {
    "date": "8/29/2017",
    "text": "This was my first time trying this place, so i wasnt too sure about what To order. Travis, the young man behind the counter gave me some awesome recommendations. Everything he suggested was amazing!  The fish was super fresh and everything was delicious!  It's got a nice clean atmosphere. I would highly recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wsXtgONpRltBnNxCI8KpTQ"
  },
  "Hk6AA2xMaWaVv_x-eJLT-w": {
    "date": "1/31/2017",
    "text": "I'm not sure I entirely knew what to expect with Sushi burritos.  I guess I had conjured up some idea of sushi wrapped in a tortilla with avocado and hot sauce. What arrived at Tail and Fin was a massive sushi roll.  Gone were the dainty slices of sushi roll that we have come to love, and nowhere in sight was anything that truly resembled a burrito.  However, when tasked with eating this enormous sushi roll one must engage their knowledge of burrito consumption in order to take it down without a mess.  This experience was different from other sushi restaurants, and pleasant in that all the flavors are delivered in each bite, and one roll is enough to satisfy.  Strong work.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V6fWM24mP46KwJ5_zpEWNQ"
  },
  "poatfm58l13LCuieEBAe9Q": {
    "date": "9/22/2017",
    "text": "I never had poke before so I was extremely confused on what to even get when I walked in.. it was pretty slow in there so the menu was explained well enough to make my choice and I will for sure be back to Vegas very soon and will have lunch there again!! The girl Sophie working was very helpful and friendly which made it even better even though she was working alone she was killing it!! 5 star for this place!!!! :))",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsmdBtC37e3RkHxDNSWnuQ"
  },
  "UOw3DugbxDIme5-iknbCuw": {
    "date": "11/13/2016",
    "text": "I love this place so much! Staff is very friendly, and food is very fresh. My favorite roll is The OG. I have tried it both in burrito & poke bowl. Both delicious. I get brown rice with mine. It comes with fresh salmon, yellow tail, ahi tuna sashimi, poke sauce, cucumber, green onion, romaine lettuce, and I add avocado to mine & sometimes shrimp tempura if I feel like it. It's $9.95 for regular size & $11.95 for large. I feel it's worth the money. You get a lot of protein & rice. Portions are amazing. And sauce selection is to die for! I'm obsessed with their Chili Aioli I could put that sauce on almost everything it's so good! I go once or twice a week sometimes! I'm obsessed!!! Give this place a try & you won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IfVZFO7yAPa2mjwI_uY-_Q",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The OG",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IfVZFO7yAPa2mjwI_uY-_Q/o.jpg"
      }
    ],
    "user_id": "7PbqTCP6uphZtZzFhH091g"
  },
  "xDM8SI0pe2NO7wfYBlkiSg": {
    "date": "7/6/2017",
    "text": "I have only had the sushi tacos here and I love them! Only reason I couldn't give 5 stars is because of how much extra an avocado slice is:/ but other than that the service was great and the place was very clean. I think two tacos are around $4.50? I know they are under $5!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fTif0A6kIjPh1v8brXraBg"
  },
  "pc6VdUO53T6xrLB5pmSMog": {
    "date": "9/17/2017",
    "text": "I got sushi burritos from here on postmates and they were really good. I did not know if I'd like them or not but me and my family really enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfkaDHwCjCRg4xQB4LGP-Q"
  },
  "o313Z_Abg_L6FFHZXV7UOA": {
    "date": "8/16/2017",
    "text": "The food was on point. Fresh clean and deliciousness.  Well worth the drive, Dominick made our visit exceptional and is the man.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0Ppu-_BL4JtiJSZyNxB-A"
  },
  "HJ3qgFAfrnkjEyIwa27eNw": {
    "date": "6/13/2017",
    "text": "Today was my first experience here and I must say it was a GREAT ONE! I had a large sushi burrito and is amazing! The fish was soooo yummy! Chris gave my cousin and I AMAZING customer service ! He was really friendly and helpful. To me, if the food is great but customer service is poor I won't come back, but because my overall experience was a GREAT one I'll definitely be back to this Tail&Fin so I can continue receiving exceptional customer service and super delicious food!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2SljYahmLPc0c3TFNqh4Q"
  },
  "XpVusd9YULZC6B5Bq53D1g": {
    "date": "4/21/2017",
    "text": "I got a poke bowl with spicy tuna, seaweed salad, green onions and avocado. This meal was so perfect! Really fresh and clean tasting, it's always nice when you are craving something and it turns out to be completely satisfying. The restaurant was clean, the staff very helpful and willing to explain everything. It was an all around great experience. I definitely have recommended it to others and will continue to do so.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZLSqfmHiHeuLs98TkeQYhw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Clean and fresh.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZLSqfmHiHeuLs98TkeQYhw/o.jpg"
      }
    ],
    "user_id": "S6QB1zPmeTNOKktO8nrS0A"
  },
  "7ejnER1EGXRFtN5El_RJDg": {
    "date": "7/3/2017",
    "text": "Stuff wasn't friendly, super slow and the guy in training didn't know anything I like that they're generous with the amount of fish on the same time I tasted  better quality before and I think that 4 scoops is in the boritto is too much  Big like for fresh mango/ pineapple  My borrito didn't taste too good over all and for some reason was very salty too",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1uN-NOhDkvzqB6wo4pz0w"
  },
  "5StYYr_46x93jPnT6eaRnQ": {
    "date": "4/17/2017",
    "text": "We went just for the sushi burritos and left a little disappointed. I thought the \"burritos\" would be more burrito sized but they use standard sized sushi nori. We could have made these burritos at home for much less $$$. For 2 burritos and 1 drink we spent $30. To add 1/4 of an avocado to your meal is $1.49. You could buy 3 avocados for that price at the supermarket. They keep all condiments behind the counter, which is ridiculous. I was afraid to ask for any because the answer to everything seemed to be, \"It's addition, is that okay?\"   The food was fresh for the most part and delicious, but placement was poor and the whole thing falls apart in your hands.   Not impressed. We will not be returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Xt2ERQqJk8cKUXXlyoJJw"
  },
  "3dY5tUQhe-3fXqUs8sNy_w": {
    "date": "7/14/2017",
    "text": "I came across a video on Facebook about this place, so I was like \" why not try it while I'm still in Vegas.\" I was really excited about the pineapple boat. I don't anything that's raw but today was the day I faced one of my fears haha. I rate this place 3.5 out of 5 because this was different for me. But to all the sushi/poke lovers out there I do recommend y'all trying this place out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gptd5Tl571VJ1cVDN2C76g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Pineapple boat &amp;amp; a poke bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gptd5Tl571VJ1cVDN2C76g/o.jpg"
      }
    ],
    "user_id": "a9WIs58qd_pnPHvK9lqtRg"
  },
  "-9q2I7JGC2d8myMJHseQkw": {
    "date": "2/19/2018",
    "text": "Got the Yo Adrian, the spicy mayo went well with the cream cheese and made for a tasty sushi burrito. I added sriracha for the extra kick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LFB8jFCxtlO04pX9uisWw"
  },
  "Romjt_RmmYz_xgh5fFYCEQ": {
    "date": "3/8/2017",
    "text": "Super fresh ingredients! Young man at the counter was extremely helpful and friendly. My Crabby Bastard was very good. They were out of pomegranate, which sounded like a strange thing to put in a burrito. But they asked if I wanted a different fruit component added and I chose mango. It actually works. Delicious food and an inexpensive way to get a sushi fix. Thanks all!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gbikhZT4QC6r39Ea4OLKDw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Crabby Bastard with mango. Excellent!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gbikhZT4QC6r39Ea4OLKDw/o.jpg"
      }
    ],
    "user_id": "DCAi-GeI94fiDLC3l3acEQ"
  },
  "XtP1G4EQu1OXclUeCe0-Yg": {
    "date": "9/5/2018",
    "text": "I really WANT to love this place, but inconsistency is one of the issues I have here. Could possibly be every time I come in there's always a new person. Tonight I had was not pleasant. To have your meal being prepared by a person who was complaining to another coworker about how they didn't want to be there. I told this person about going light of some of the items in my burrito but my small requests were ignored. Example i asked for light ponzu and this person drowned my meal. As I'm sitting here writing this review I am currently eating my burrito as a bowl because it all fell apart because of how soggy it was. The food don't get me wrong tastes amazing, but the inconsistency and the unprofessional staff make me want to seek another sushi burrito place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uo2nMHQitW-5VFxBPcWjKg"
  },
  "gaGA7yiye_c5ZBiYLGeKZw": {
    "date": "5/27/2017",
    "text": "I came here because one of those Facebook videos hyped it up. The two stars are ONLY for the food. My first time in Vegas/the first place we decided to eat after our long drive and both the girls serving were unwelcoming and not helpful. They both gave me different information (when I asked if I can do different protein for 1 order of two tacos the first girl said yes and the second girl said no). She had to throw out a whole scoop of spicy tuna because she assumed that's what I wanted on all of my tacos. I ended up with four tacos with 4 different proteins and the girl who took my order put my tacos in a bowl. Who puts tacos in a bowl?? When I took the tacos out of the bowl they were soggy because the bowl gathered the sauces into a puddle. Tasted as good as any other poke place and the concept of poke tacos seemed awesome, but this place didn't do it justice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kxOYVY7v83WU7Gg9mYXupQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kxOYVY7v83WU7Gg9mYXupQ/o.jpg"
      }
    ],
    "user_id": "0QlcJrIKGXpMPIfITLVaAg"
  },
  "otkkZ4_KX2gSkDqxGPpXIg": {
    "date": "1/25/2017",
    "text": "Really 3.45 Stars.  The staff here is great.  Super nice, and friendly.  The quality of the ingredients is good-very good.  The downfall is twofold: sushi burrito compositions are unbalanced.  You'll get a bite of all fish, then a bite with all extras.  Kinda of a drag.  The other downfall, I'd like some more topping options.  That said, what is available is fresh and tasty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DiEBu0Fob4Hrcsxn6BFbAw"
  },
  "4Actox0-nRoyg1k3W_AlJQ": {
    "date": "9/2/2018",
    "text": "I'm pretty bummed out by the experience because of the bad customer service.  I've tried Tail and Fin at the TMobile Arena during a Golden Knights game and it was great, so I thought the restaurant would be the same.  I was so wrong!  My 10 year old and I each ordered a bowl to go and one had shrimp tempura.  The two young girls were nice, but had forgot to turn the oven on.  Mind you, this was 1:00pm and the location opens at 11:00am.  We cordially waited for the oven to heat up and the shrimp to cook.  They then remembered that my meal came with a free drink (which I had no clue that it did).   Then one was on her cell phone non stop, laying it on the bar where the food is kept, and then I noticed that her long hair was in her face and not pulled back, nor was there a hat or visor or anything to control it from getting in the food.  (The things you notice when you are forced to wait.) To top it off, on the way out the door, the music was explicit and my 10year old heard the \"N\" word,-asking me about it.  Seriously?! Very disappointed and will NOT be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eS6-8plwkXyDw576e8Oj7g"
  },
  "IxXkrcNOy-Jzc3LE9LzD_g": {
    "date": "12/22/2016",
    "text": "Two stars. Good atmosphere. Workers were friendly. However I do wonder about prices.   I got me THE OG, a combo of my fav sushi which is ahi, yellowtail, and salmon, which runs about $12.95. A drink added to it brought the total to $15.   Good! However, I wasn't impressed. Left still hungry. To be honest, another $5 more and you could go across the street and get all you can eat and leave absolutely full.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "AkSd4bV8E1aOswL-IcNB4w"
  },
  "RWNj3cIXWqK0OljqB-rwBQ": {
    "date": "4/29/2017",
    "text": "I'm gonna have to drop a star because I came in to get my favorite thing, the OG bowl with half salad/half brown rice. I'm not sure what kind of dressing or sauce is on it this time or if they changed it but it is basically inedible. It tastes strongly of wasabi and I think I burned off all of my nose hairs in the first couple of bites. I'm a big fan of spicy and pour sriracha on everything but the horseradish fumes are too much to handle! I'm hoping this was just a mistake because I typically love it here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SVH0qJBvYGLxrt6YuUdyyw"
  },
  "oNdm-lUQUnXOcJ22j-e8XA": {
    "date": "12/2/2016",
    "text": "Kind of awkward closed in line for ordering service seemed rather slow, but I did get a tasty bowl after a slight wait. The menu is smaller than most but I like that. \"keep it simple stupid\" is a saying I live by. They definitely need to do some decorating in here I feel line I'm in a warehouse breakroom.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "YzLndeVqkkILXPCkX-2t2Q",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Stupid good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YzLndeVqkkILXPCkX-2t2Q/o.jpg"
      }
    ],
    "user_id": "ACwN_B8nl4yJ4FlqCGR9yg"
  },
  "tOpsdwNEQO6xRhF_NDKNsw": {
    "date": "1/3/2017",
    "text": "Place is awesome, they asked if we were new and we are and walked us through the menu and prep. Team was friendly and smiling. The place is a winner. Burritos are amazing.   Sophia is so friendly and gives good suggestions. Keeps a very positive conversation. The guy ( tall with beard ) was not friendly. I placed a tip in jar twice and he saw me and never said thank you. When I was paying I said thank you and he said \"yup\". Rude.  One bad apple can spoil the bunch.   We will continue to come on a weekly basis due to team members like Sophia.    Thanks PAt",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fAXfD1o75wZPkHPaeIOJA"
  },
  "24AL1AIpPkB_ECXMiPjY5Q": {
    "date": "1/25/2018",
    "text": "Really, really wanted to like Tail and Fin. Waited months to try it and was finally in the area. Right off the bat, not impressed with the building whatsoever. Smelled a little funny the second we walked into the door, and the cutting mats on the counter didn't look clean. Wasn't impressed with the restaurant itself. I tried the sushi tacos, which I actually liked, my teenage daughter got the pineapple burrito and only took one bite. She loves sushi but didn't like the burrito.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJZ50FeJW1G47yvQd2Phvg"
  },
  "DiDAjkmeqKBcKCqKtdaUZw": {
    "date": "11/11/2016",
    "text": "I came in today at ~11 am to order some lunch.  I got the Crabby Bastard Bowl for myself, and the Shrimp Tempest for my wife.  And there were just problems with both of them.  For the Crabby Bastard, I wanted brown rice.  Which they were out of.  Yet again.  You advertise that you have both sushi and brown rice, yet every single time I go in there for brown rice you are out.  Why?  How can you be out of one of the foundation staples of your menu?  For the Shrimp Tempest, I ordered as a salad with mixed greens.  I added spicy tuna and jalapenos, and had them put the sauces on the side.  I thought they would be able to handle this, but when I got the item home, my wife noticed that they forgot to put the surimi crab on it.  IT'S PART OF THE NORMAL ITEM.  How do you forget how to make the Shrimp Tempest when you've got the menu right in front of you?  I think the biggest issue is that they don't write anything down.  I'm constantly having to repeat my order to whoever is behind the counter multiple times, in addition to reminding them to add this or remove that.  It's not that hard to write down what someone orders and then make it, is it?  All told, I doubt we'll go back.  The food is good when it's right, but it's almost never right.  Either hire people who know what they're doing or at least have them write stuff down so they don't screw it up.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "g8j4NyIgPeXCuMtM5qDh7w"
  },
  "5GOS_a-oLMJj_AkiHNhiWw": {
    "date": "12/17/2017",
    "text": "This is probably my least favorite sushi burrito place. They lack customer service and the meal was very plain. I ordered a burrito but the lady ended up making me a bowl. Not sure how that happened but it makes me question who and how the food was prepped when the lady can't even get my order correct.  I had a few bites and tossed it. Not worth $11.50. Eat here if you're really only craving fish, otherwise in my opinion, you have plenty of other better options to eat in that area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iuw5x8CEAAJch1jD2SjYAQ"
  },
  "6sdUmFrkIUNYAu7yE85YFQ": {
    "date": "8/19/2018",
    "text": "The only reason I gave 2 stars is because it has been pretty good in the past, hence my return. Every time I have been, they over do the sauces... Even though I say- LITTLE sauce! Today, my family and I simply could not enjoy our meal. We ended up tossing 2 sushi burritos and a bowl. It was more sauce than anything else. My recommendation is, ask for ANY sauce you want- ON THE SIDE",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hfrq87lHCk7ZwLaMP_LHLg"
  },
  "T8-3Cyic0enHDOQNYslvSQ": {
    "date": "3/25/2017",
    "text": "The sushi burrito was delicious! Loved it! I came here excited to try the sushi tacos, but I probably wouldn't order that again. It was difficult to eat. Couldn't fold it because everything fell out. Seaweed was too soft and was too small for the ingredients (and I only got 2 items as recommended). But I would definitely come back for either the bowl or burrito! DEFINITELY THE BURRITO FOR SURE THOUGH!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c4HlMn7xZsNX0n7Qw4G3ZA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Sushi burrito was delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c4HlMn7xZsNX0n7Qw4G3ZA/o.jpg"
      }
    ],
    "user_id": "gXvjVJ5MGw7eZho1UZcv8g"
  },
  "-8wm2pfcZRQC-w8olI0S1A": {
    "date": "9/8/2016",
    "text": "Very impressed with the friendly staff and the awesome menu. Very fresh if you ask me. Price was excellent as well compared to others around town or an all you can eat sushi which I felt equally as satisfied! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f0sz0LNTQkr1GYgQ6mNf7g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f0sz0LNTQkr1GYgQ6mNf7g/o.jpg"
      }
    ],
    "user_id": "3yXyto3yjSHZNBG2cVGAkA"
  },
  "BEMEksrTK91KcQed-JVfxQ": {
    "date": "10/26/2016",
    "text": "Sushi and Poke Burrito spots have been popping up all over town like hotcakes. Lol! While each spot has their own unique combination flavors and styles, Tail and Fin is the only spot that has me absolutely addicted, where I crave my sushi bowl like a maniac. The Crabby Bastard is the object of my obsession...the mix of the sushi rice, soft shell crab, crab meat, pomegranate seeds, avocado, furikake, eel sauce, and mango (a special added ingredient a little birdie suggested to me) is absolutely delicious!!! My mouth waters just thinking about it. The ingredients are always super fresh and the portions are enough to provide me w/ two meals. The staff is always friendly and welcoming and the vibe of Tail and Fin is awesome! I love Tail and Fin and suggest everyone stop by at least once...or once a week like I do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7YrALuOe7Z1xYTI995SfA"
  },
  "TsvD-KD8vlMkC7o247Io-A": {
    "date": "9/4/2016",
    "text": "Fresh find!! Love this place! Great people good food!   I am a big sushi fan and this ranks very high in my opinion!! The fish is fresh, plenty of different options to choose from. This is the place to go when you are craving sushi or fresh lunch or dinner!!! Every time I'm visiting Vegas, this is where I will be!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7R6G3vxXOJGdJiRQ1JkrQ"
  },
  "oqT7vTcD1uUsBgIUyA5D2g": {
    "date": "10/22/2016",
    "text": "Had the stupid good tuna burrito today and it was amazing. The high quality of fresh ingredients is amazing for a place so far from the ocean. Staff were helpful and store manager David was very friendly and engaged in conversion at will. With seafood you get what you pay for, it may be a little pricier but well worth it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOWir-DVuDCiJuAbreyNcA"
  },
  "6q0-JkcQ06-kyCAGrq3RRw": {
    "date": "10/8/2016",
    "text": "Amazing! First time here, tried the poke bowl with spicy tuna and crab. The miso sauce on top is a must! Great service, great food, and a great concept! Looking forward to trying everything else on the menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMm4Vd0tqSaYJ75CMnsApg"
  },
  "4yZdT8gYGojOS0AtIM-rVg": {
    "date": "9/27/2016",
    "text": "I order a large sushi burrito name LBO (i guess) I forgot the name... it was delicious and fresh... i will come back again.... but the price just so expensive $16 more....  but i will come back for sure...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yqyT-aP0ONn4poYOJX3V5A"
  },
  "VtC3yoYeUKMvR-av7R_Mng": {
    "date": "9/26/2016",
    "text": "I anxiously awaited the opening of this place and I was not let down the Crabby Bastard is a must have. I'm super excited to try some of the other choices they have the only problem is when I try something I like I have trouble straying from that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qVxt8K-E2fHZxjb0VnJ5ew"
  },
  "TVGmBx3sYV51H1DK3SAu4g": {
    "date": "9/14/2016",
    "text": "The staff is great. Very patient. The food is amazing. Generous portions, and awesome sauces to put in your sushi burrito! It was our first time there, but definitely not our last! We LOVED it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cMeKeA87_hL24apDPbv-A"
  },
  "lTdPy4-zCPVMXPsxc-HrqA": {
    "date": "9/8/2016",
    "text": "They've been open a little over a week and I've already been here three times. At first I was skeptical but everything about this place is exactly what you want to find at a sushi restaurant. The fish and all ingredients are super fresh and you can see them. Everything is super clean which I also was happy to see. I always make a build your own and am very pleased with it. This may replace my favorite sushi place due to its low cost and the easy ordering and quick service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BcFDYNoIqggFU6pMNM31MQ"
  },
  "ovzuQA3oUpY5tzgivzMv7A": {
    "date": "9/5/2016",
    "text": "First time having a sushi burrito... 1 word awesome. ... I  loved it , so much went back next day had a Crabby bastard the bomb! Awesome experience.  My new must stop when in Vegas!. They will be catering my next show when I'm in town.  Scotty Noyd Comedian",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J3WOxF3PKsDOfZ2Cdr3Qfg"
  },
  "euPd2A-IP1KGHqkKtOmaRw": {
    "date": "9/3/2016",
    "text": "This place was highly recommend by several friends to me, being a sushi lover, I just had to come and try it myself. As usual I order more than I can eat. Can't help it when everything being served around me looked delicious. My first time eating here and all I can say is \"I'm hooked!\" Delicious food and perfect portions. This is my new favorite place. Can't beat the great taste and excellent friendly service. I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWfKC0rj_ngmzWx1GcHxow"
  },
  "noutYrMA44bTjcNg9SxE9A": {
    "date": "9/3/2016",
    "text": "Not a huge \"Yelper\" ... I read reviews of places I want to go but have NEVER written a review. Just not my thing ... But this place?!?!?! OH MY! I'm a HUGE sushi person - could eat it daily. But the AYCE places can get expensive. I've eaten here twice already in their first week of being open. Fantastic both times! I go for the \"Stupid Good Tuna\" but add avocado and substitute the Poke Sauce for the Yuzu Miso Sauce. Love it! I will gladly spend $12 for this burrito. Gives me my sushi fix at less than half the price of AYCE. Great value ... I struggle to finish the whole burrito. As it's the first week of being open, I expected the staff to be \"figuring things out.\" But I have to say - they've got it figured out. Stupid good ... Stupid fast ... Stupid friendly ... Stupid clean ... Stupid fresh. I'm sure I'll be there tomorrow.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eoWC5KgnnjqMyCKGh0VcIA"
  },
  "DFy9mwKvPl76nRQ_DwcXsA": {
    "date": "9/1/2016",
    "text": "Very cool healthy concept. It feels like a treat. Amazing ownership. Employees were super friendly and full of smiles. Great energy! Everything vas very clean and the space felt very bright and open. It's a very easy location to get to. Prices were very reasonable and food was delicious. I love the \"I like it raw\" fun and playful!Will def be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z_AJq7NBbkmibtelCgOpDA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z_AJq7NBbkmibtelCgOpDA/o.jpg"
      }
    ],
    "user_id": "P5vcdQykE9fUcJwEdw6fSA"
  },
  "AAaHN9bZgOYoVYw42abs0g": {
    "date": "2/21/2017",
    "text": "Food was great as always but one of your employees (Daren/Garen) came off as very rude.  He had a \"whatever\" attitude that left my family a little a uncomfortable and asking each other \"Are you serious?\"  Anyways, food was still good and his off-behavior made for a good conversational piece.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kApx_rTK6aPW5uWcwHQvoQ"
  },
  "ZJVXEorJBSuTZrChIyugKg": {
    "date": "1/19/2018",
    "text": "I have been to this place 3 times and two out of the three have been terrible experiences. The staff is by far the most rude I have ever encountered. My second visit was the only time that I had received good service and the staff was welcoming and helpful, but the other two time were the total opposite. On my most recent visit, the guy became extremely annoyed with me because I asked for shrimp tempura, but I guess \"at 8 o'clock they shut down the oven to be cleaned\"... which doesn't make sense because they're open until 9. If this is the case, there should be a sign posted saying last call for baked food is 8pm or at least make the customer aware of the situation prior to ordering. (Sadly none of the employees wear name tags so I was not able to recognize the employee by name so that I could give a high five to the good ones and a thumbs down to the not so good ones... or management could). He then proceeded to touch everything like the phone, his hat, his hair, all of the countertops, his clothing, utensils, and then began handling my food. I had to ask him to change his gloves because I witnessed all he had touched and realized he was then going to attempt to make my food with the same gloves. The rest of the time he was very short and rude because \"he had just gotten in trouble by his manager for turning on the oven past 8\" although he kept saying \"oh it's no big deal. Don't worry about it. It's not your fault.\" But clearly I could tell he was annoyed. You know how they say \"third time is a charm\"?... well yeah this is probably the last time I will eat at this place. Unfortunate because it's right down the street from me but it's their fault that I am going to take my business elsewhere. This is the definition of \"hit or miss\" and I've definitely missed on this one. I am one to rarely go online and post a review because I am very patient and do not like complaining, however when it comes down to service like this.. I have no other choice but to let others know what to expect before eating here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZL3iRf1zkl3PjNX_wOIS3Q"
  },
  "JUkmwmGN7zjSCyAoYh7D9A": {
    "date": "9/19/2016",
    "text": "Got my poke bowl through post mates. My avocado was not fresh. It had black marks on it. Getting charged $1.49 for unfresh avocado.... Awesome surcharges for rotten veggies. I wanted the salad mix and my bowl was drenched in poke sauce. Can't even eat it. Disappointed!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "O3W6RjX28UQeBA8TmyMtKg"
  },
  "BCrAUmHWDxabKLH22eErqA": {
    "date": "11/28/2016",
    "text": "Wow Sophia was so amazing and very helpful it was my second time here and she definitely made it up for the first time I came in, which wasn't a good experience. I got the crabby bastard and added a few things to it and she was patient with me and took her time not trying to rush me which was nice. Will come back more thank to her!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJEpXUhRtuaoWKQCp0Fs_w"
  },
  "wlzdu-rWF9-DjMESPVMc6A": {
    "date": "3/16/2017",
    "text": "ABSOLUTELY LOVE LOVE LOVE TAIL AND FIN! My co-workers and I have become regulars here because we can't ever get enough of it. It's quite a drive for me but I go the distance at least once a week because it's so good! I've tried other poke places and not a single one comes close to how good this is. Always fresh and their choices are great! A gentleman named Chris usually helps me when I'm there and he is amazing! Remembers my name every time and always makes me feel welcome! If you haven't tried it, you're missing out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTVXjSkEWOhBoPLEeKCPKw"
  },
  "QthkgtccdRYxLO7pw_y9Qg": {
    "date": "5/20/2017",
    "text": "In town for a conference.  Had seen this place on Facebook a few months back and wanted to try it.  Loved it.  The food was great.  Staff was excellent and very friendly.  Answered all our questions while me and friends tried to figure out what we wanted. They told us they were franchising and looking to spread out to other locations.  Would love to see one brought to Baton Rouge, La.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiuhLwt1WcoYRpJUMTux6g"
  },
  "Wc4yYCb1Qo2rQEkL-vNB8g": {
    "date": "9/14/2016",
    "text": "I want to start by saying three stars does not mean bad it just means average. And this place gets more like a 3.7, it's good there's just nothing that really separates it from the other sushi burrito places that have opened before it. It appears to be the exact same replica, with a little less in terms of roll selection and the prices are about the same. It's clean, the fish quality is good but one issue with the place is the small servings of protein you get with a bowl. With one bowl I had two tiny scoops of protein and maybe half to 34 cup of rice for about $11. The quality is good to justify it, but if you're really hungry you could probably eat three bowls and at that point you may as well just go to sushi mon for that price. All in all, if you live on that side of town it is a great addition to that side instead of having to drive all the way out to the other sushi burrito spots. It will just need to step it up a little if it's to compete with the quality of those that are already established.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "09Jn_afJxwZ20eukds1nxA"
  },
  "fJNgcQRbsxqDfgu3wPULHg": {
    "date": "9/6/2016",
    "text": "My sushi burrito was awesome and customer service was fantastic! The staff was very friendly and welcoming! The hawaiian girl that works here is super awesome! Definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b--Ej-XH7tA7mkJhFqwtkw"
  },
  "TFOv8bGI6FGlWejodNRm_Q": {
    "date": "1/15/2017",
    "text": "Am not a fan of \"fusion\" food concepts.  If I crave Sushi, I want a restaurant that specializes in Sushi, likewise, Japanese, Poke, Seafood etc.   On positive note, the ingredients were fresh,  diligently prepared and assembled, while you stand by and watch; cafeteria style. Ugh!   Diners who want something light and healthy to eat will find this fare appealing.  Those wanting something more substantial should pass.  Probably good choice to place in same strip mall as a 24 Hour Fitness Center.   Partner ordered the (unique) Crabbie Bastard Burrito and liked it.  I had opposite opinion of Chicken in a Bowl (blah).  Although, sauces were quite flavorful.  I had difficult time understanding Menu Board's main menu options and add-ons. Suggest improvements.  Also, found \"stripped down\" appearance of Tail & Fin a bit to spartan for my liking.  Will, however, try again when in mood for something healthy, and this time try the \"burrito options.\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQIWg2FMeMHoNzli2KVo7w"
  },
  "0ymQ7YSlKe8CtOtMj8zhCw": {
    "date": "9/4/2016",
    "text": "Everything was fresh. I had no major complaints. my inly small niggles are the portion sizes seem a bit small for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gLu4IWgmU0LHFGzzRmlyAw"
  },
  "25GbyqEQzicxk_DPpn7bhQ": {
    "date": "9/1/2016",
    "text": "Tail and fin was amazing! The sauces were on point!  Make sure you go check this new spot out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBdPz4Fu2a2ujTSANXvU7Q"
  },
  "TUgfNnaGgFqW-nF8wD9-6g": {
    "date": "10/5/2016",
    "text": "There were 5 workers and three more in the back and I am standing there with two others not knowing what any of the items were no one was offering suggestions. One man just left and I asked a couple of questions but maybe some great customer service would have helped. The employees can offer suggestions and explain what the ingredients are for rookies. A hair net would be nice since you are watching them prepare the food up close. The food was good and I will try it again. Much luck.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANXa9HKFOSBwKsIOp5E54A"
  },
  "aiklXomc2BHaCsh-oy4v9g": {
    "date": "11/19/2016",
    "text": "Friendly staff willing to go along with my creation ideas! I asked for the new sushi taco and Emily was so helpful giving me ideas for sauce and toppings. It turned out great, even though I'm no sushi connoisseur. Casual clean modern atmosphere. Good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D74Q-AYU9eRPsX2N7SV4DQ"
  },
  "05QNx-gOFU_w_OLTvfK-RA": {
    "date": "9/30/2016",
    "text": "Very impressed with the food. I had the Shrimp Tempest bowl and it was amazing. All the ingredients tasted fresh and the service was great. They asked if it was my first time and explained how all the menu items worked. I will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LmUXvb035YNfaq5LP3V_nA"
  },
  "3QyGkPeExlfzp-Q0ZefirQ": {
    "date": "9/23/2016",
    "text": "THIS PLACE WAS AWESOME. Definitely going back soon and will be trying something new. I got the tempera temptest and it was very good and fresh. The service was quick and friendly, highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u40XIZ1CII5WBqID8JHHOA"
  },
  "c1lQmqMK4_MxXjLHLP6Mew": {
    "date": "9/22/2016",
    "text": "Great spot. I had a custom bowl with ahi tuna and tempura shrimp and it was really good. My girl had an angry birds burrito and loved it. Definitely will be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nbmb4dYsfRBn2x-g-9_K5A"
  },
  "BIkmE86imUZbkH4y7oiSow": {
    "date": "9/21/2016",
    "text": "The perfect place,  excellent help,  nice layout,  great menu, and everything tasted wonderful. Next time I'll ask for more flavor sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cs_syt7ksaQq_6zG_cLyYg"
  },
  "I9ODNF6vssGgH555O814pg": {
    "date": "1/19/2017",
    "text": "Tried my first sushi burrito at tail & fin and fell in love with the OG. Definitely a spot to check out, great selection, friendly staff & great food! Will be back soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foyF56QJtt2PVZi5mrDsmw"
  },
  "rAau016yFX2KddJEt4wfww": {
    "date": "9/6/2016",
    "text": "So good ! Tried the angry bird if you aren't a fish person which is made with chicken and also builded my own with spicy tuna and yellow tail.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KehqRbJyWDLBvjwqG52gQg"
  },
  "q0PGdYwlZZ7l0r3Jifk9dQ": {
    "date": "9/3/2016",
    "text": "Super fast and friendly service. Defiantly satisfied my craving! This is defiantly our new sushi spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cLPbQI8da8vHGGOfTqNbGQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cLPbQI8da8vHGGOfTqNbGQ/o.jpg"
      }
    ],
    "user_id": "JeB743IM4osdiOTS8FwFyQ"
  },
  "nCFib-weFsh7Ds6jfsre-Q": {
    "date": "9/1/2016",
    "text": "The food was amazing. I've tried other burrito places before and the rice was either off or the fish was so so. This one finally had everything right. Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPg0mFK5OscJDIAVGc_xMg"
  },
  "RXnwsdddVIuOOchTsVfLhg": {
    "date": "9/1/2016",
    "text": "Food quality was great and service was even better... Even though there were plenty of different set combinations I decided to BYOB (Build your own burrito). It was my first sushi burrito experience and you can say Tail & Fin definitely set the bar high.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dbCZvLAv8S2aUh2YhHA-JQ"
  },
  "E-KSeOewHPNA4fyHQ4fo2Q": {
    "date": "9/1/2016",
    "text": "First time trying a sushi burrito and I'm hooked! The food was fresh and the service was great. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N65pJziW731z93FDTj_UPA"
  },
  "Tb_eEySIMr6ddVjDHKJOJQ": {
    "date": "10/5/2016",
    "text": "This place is new to my block all the staff is welcoming and helpful, I love the location. A bit expensive but overall good poke!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jct9xIXvwxB7fjMAHT1hWQ"
  },
  "1Vvg5bYaqQhNwEVDzF1yCQ": {
    "date": "11/22/2016",
    "text": "I was in the mood for a sushi burrito and this place popped up! HIGHLY RECOMMENDED!!!! I ordered through Eat24, when I got there they were just about done making it!! Delicious sushi burrito, friendly staff, very clean! I will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qOaEsi8vKwc-r_YnbnZCIA"
  },
  "y3gB_Ai2SDJhvDQTmRf1nQ": {
    "date": "11/8/2016",
    "text": "Out of all of the sushi burrito places that have recently opened, I think this one is my favorite. I love their build your own option where you can get 6 (DIFFERENT) scoops of anything. This makes it way better than the others that offer like 1 or 2 options and charge for additional. I'm so happy we finally have a place like this on this side of town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3VXOINTlBjSVMor7CEm0rA"
  },
  "ZoICYIg3WkbOXcYpkw-bkg": {
    "date": "12/2/2016",
    "text": "Every damn bite explodes in your mouth with a different pleasurable taste! Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urUTHHXOPAbLy_De8AMQbw"
  },
  "kVk41dHgKZQTuqa6IIIs_A": {
    "date": "8/8/2017",
    "text": "I normally do not write reviews on places... but today I felt the need!!! I have eaten here many times and never liked the service... very slow!!! But I did love the concept of this place and thought it was healthy eating.  On my last visit a few days ago I got major food poisoning... for the last 24 I have been sicker than a dog.. had to call out from work. Needless to say I will never come back to this place again nor will I visit another place like this.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsSMFScTIFSF8qydZ7FVKw"
  },
  "3YpZLpoaTawe18MS55B4Ng": {
    "date": "7/14/2017",
    "text": "So, had to come and try the sushi tacos since I see it all the time in Facebook.    You got to choose your protein and toppings you wanted for them.   The only down fall would be if you added any sauce to it, it would make the nori break apart very easily.  Maybe trying to double up on the nori would help.   Over all, the fish was fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9PEontQwy_ZlwDHdmOZ73Q",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Sushi tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9PEontQwy_ZlwDHdmOZ73Q/o.jpg"
      }
    ],
    "user_id": "ve_Hbp67wIvWFNEiwV2vuw"
  },
  "JgUtaxXkK6i1GNT93fz6GQ": {
    "date": "10/10/2016",
    "text": "Second time here! it was good! Everything is fresh!   ordered: the burrito and a bowl, both were very good!   would definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4z1BB9Aw54NH3BLeYiz1lw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Flaming tuna bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4z1BB9Aw54NH3BLeYiz1lw/o.jpg"
      }
    ],
    "user_id": "UHHraFRu5NKvZqIHp2O02w"
  },
  "18XePiix9m6vBVwel3UMKA": {
    "date": "5/21/2018",
    "text": "This is the best place in Las Vegas for a Sushi Roll or Sushi Burrito however you want to call it I've been here  just once but for my first experience It was awesome and the taste of the food was magical and of course it doesn't damage your wallet that much. TRY THE ANGRY BIRDS BURRITO OR THE YO ADRIAN TACOS",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MVjBaItXTzxFCBV3wGGag"
  },
  "Ht90JDfeTISBWquTrXN20Q": {
    "date": "6/4/2017",
    "text": "It was alright. We've been to different poke place and this is my least Favorite. They have special/signature bowls and what i got is not special at all. Bland bowl, needs more side dishes that are free. Other poke places you can throw in different toppings / side dishes for free to add more flavor. The serving was plenty but i prefer quality   Won't come back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlb8zu0hOuYgcBM4BRSBog"
  },
  "LttevJL6zFAAeW1fjDzoBQ": {
    "date": "9/9/2017",
    "text": "this place is off the strip no fighting for parking and the sushi burrito is very filling they dont skimp on the portions. They have alot of traffic coming through but the staff works fast and effectively we barely waited.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Np9wi6DNEwnIxP_Z-jCPWw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Np9wi6DNEwnIxP_Z-jCPWw/o.jpg"
      }
    ],
    "user_id": "OvCq9mGsdbUHJj_ywsvQjw"
  },
  "TlXYBQU33FT7F7dZ3uomaQ": {
    "date": "8/2/2017",
    "text": "Learned this place from Insider. I went an hour before closing time so they already ran out of salmon. They have grilled chicken as part of their meats. Spicy tuna was so fresh. The pineapple bowl was so cute and ate it as a dessert. Finished my bowl in less than 10 minutes. I would surely drop by again when I hit Las Vegas. Servers were so nice and helpful.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lfymor3nV9LXMbDC2HqdZw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lfymor3nV9LXMbDC2HqdZw/o.jpg"
      }
    ],
    "user_id": "b1ZlLo-cxBgrpn93h_iwQA"
  },
  "jcPtWxC07ANzqpnZtShmNQ": {
    "date": "4/9/2018",
    "text": "The amount of fish they gave was more than expected, which is a good thing. The quality of the fish was good too. There was nothing that really set them apart from other poke bowl spots. Their decor was mediocre. I guess I just expected more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQkSo6F4awKlC5tSLwxS5w"
  },
  "DLZBdXB3xrzL-BaaV1-Jog": {
    "date": "8/17/2017",
    "text": "I have been craving a sushi burrito from here for a while! I went around 3:45pm and they weren't busy at all! I was helped immediately. Everything looked fresh and clean. I took my order to go and when I got home, I was surprised that my sushi burrito was nicely made! It didn't fall apart on the way home!  I decided to build my own burrito, I had gotten the 4 scoop which I'm guessing is a medium? Not sure. But, I got the surimi crab and shrimp tempura with some cucumber, lettuce, unagi sauce and some garlic aioli! It didn't seem like much but it tasted amazing! My favorite sauce has got to be their garlic aioli. I also got a drink so everything came out to be $12 and they have a loyalty program that you can earn points towards some money off your order!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hHt6wioMezMQerEFGJvQmQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hHt6wioMezMQerEFGJvQmQ/o.jpg"
      },
      {
        "img_id": "5t_E4Y_txoEdUyUjzmsrWA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Everything was still together &amp;amp; nicely made!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5t_E4Y_txoEdUyUjzmsrWA/o.jpg"
      }
    ],
    "user_id": "Q4fqLPsh2l_7yrRylvw-eg"
  },
  "3IwiKh8dZ1xlsc5U08zUPA": {
    "date": "11/19/2017",
    "text": "There portions got smaller since they opened and there employees look Miserable... And I SERIOUSLY HATE when Managers, got paper work to do or just trying to catch up with work in there regular clothes and they let there kids wait for them, at one of the tables with a coloring book, crayons and electronics... Then make there kids something to eat, while your in the middle of being assisted!!! SAD FACE!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-d58OXG-bluCO4-9T4x1SQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. If you LOVE Poke... Go to &amp;#34;ISLAND FLAVOR&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-d58OXG-bluCO4-9T4x1SQ/o.jpg"
      }
    ],
    "user_id": "QoLSIEecATWpRcAvOHyGFA"
  },
  "Mz1IpijJTA-meTm_by-yVw": {
    "date": "4/15/2017",
    "text": "Yet another poke/sushi burrito place in Vegas~ I built my own bowl for $10 and had the choice of picking 3 types of meat. I chose salmon, ahi tuna, and shrimp tempura. I wouldn't recommend the shrimp though since they only gave me one! I could've gotten way more poke instead. Then you have your choice of veggie toppings and sauce. I tried the yuzu miso sauce which went pretty well with the poke!   The hype for poke and sushi burritos has definitely died down for me with the over-saturation of the market here in Vegas after the great success of SoHo so to me, Tail and Fin was just an average experience that didn't thrill me but wasn't horrible either. Also, I wish the seating was more comfortable!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCWeUsUzgoF8XLenbNeICA"
  },
  "SGoGBHS6-vRzbPNE4PJiMg": {
    "date": "8/30/2017",
    "text": "It wasn't what I expected since I saw it on insider food served in a pineapple! But no...not today y'all!   I ordered the sushi burrito and it was sloppily made. It didn't taste as fresh  ran out of a lot of ingredients it was only 1pm... Not a fan.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a4h05jmWKIaMD3G5QSGTYA"
  },
  "2TneKhGOrxjLcdXL_OF8vw": {
    "date": "11/15/2017",
    "text": "This place is awesome in person but treats any kind of to-go order as a second class citizen. Seen it in person and had it happen to me a few times. I don't know why I try and keep ordering to go from there.  Good food, but bad if mobile ordered.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nXEgfv5PLOejEXjPdaqhA"
  },
  "05FGUAYrylZr0xsR1veKFw": {
    "date": "2/16/2018",
    "text": "We had The Crabby Bastard bowl which is soft shell crab/surimi crab and toppings. The guy helping us was nice - he went over the menu for us first-timers. But 1) he left out the pomegranate (one of the toppings) and 2) the rice was cold. We asked if it's normal to serve the rice cold. They said their brown rice is refrigerated and their white rice is at room temp. Wow this would have changed our decision to order brown rice, because as Asians, you never eat cold rice!! It's criminal. Rice was starchy and difficult to swallow. Ick! The lady offered to give us a bowl of white rice but we declined because we already ate most of the toppings and quite frankly, our experience was already made ..  We wanted to like it. But we won't be back. Also try this place in comparison to Soho Sushi bowlrrito -- Huge difference!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnvYQBeZR_hdbYvD_GpiUQ"
  },
  "WszgBXfqDYkXWQ2Hz2SMXw": {
    "date": "12/8/2016",
    "text": "Awesome Awesome  Great food with fresh items perfect lunch or light dinner. The staff are great and very helpful. I would go here every week if I lived here- a perfect mix of food and fast friendly service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XDLeyD90-rltJ3XyHdlLZw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Perfect meal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XDLeyD90-rltJ3XyHdlLZw/o.jpg"
      }
    ],
    "user_id": "DseMSHa6-YuUxvvE9Is5Hg"
  },
  "rPv8EKi0r6BgCYUT_TguPg": {
    "date": "4/14/2018",
    "text": "This place is awesome. You get to pick your own custom sushi burrito! I have eaten here before and it's always good. If you have never tied a sushi burrito then you are missing out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QnfnKN0bXlXn3kNOfDDkfg"
  },
  "vek991tTQhfzmeKw49Nbjg": {
    "date": "8/8/2017",
    "text": "My daughter wanted to try this while we were in vegas. The food was very good and reasonably priced,they give you add-ons to choose from free of charge..it's a small location, but it wasn't crowded when we went. I would definitely eat there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mwmqHp7D6SU6dKBvb9ZHlg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon with sushi rice cucumber, cilantro,mango with unagi sauce.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mwmqHp7D6SU6dKBvb9ZHlg/o.jpg"
      },
      {
        "img_id": "0heMolip5eHtX2sZXVqgPw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon sushi rice seaweed,mango,cucumber, green onion with sweet chili sauce.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0heMolip5eHtX2sZXVqgPw/o.jpg"
      },
      {
        "img_id": "985tjQTBV-JF14R2cMct8g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Ahi tuna with sushi rice,seaweed,edamame, cucumber ginger with sweet chili sauce and teriyaki sauce..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/985tjQTBV-JF14R2cMct8g/o.jpg"
      }
    ],
    "user_id": "PeCF29Kc0s7g8UadgvnBrg"
  },
  "DKMZAt7DGRqDUqs58h8boQ": {
    "date": "1/3/2018",
    "text": "Such unique choices and i love that I can have a fresh healthy meal leaving 24 hour.  The omega bowl was really satisfying.. wash it down with some non sweetened green tea and call it a day!  Can't wait to try the pineapple bowl that everyone has been raving about",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aozEZnVzXqtAIZdbzvUPAg"
  },
  "olDsgRzxF4PAKeEwmlf5Pw": {
    "date": "2/28/2017",
    "text": "Small shop that can be easy to miss but so worth going out of the way for! Had to go twice on our trip because it was THAT good.  Food was fresh, delicious, and they offered the option of going with traditional choices as well as the possibilities of new options you may want to try. I got a \"build your own\" sushi burrito and my husband got the stupid good tuna one day and the crabby bastard the other.   Seriously so good and when you're from Hawaii, you're picky about things like poke! Great customer service + cute shop + delicious food = YASSS.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "xvtb35uBwzNC8IhKUZctNQ"
  },
  "G0vKxHpC2LvzpETjbgOgqw": {
    "date": "9/10/2018",
    "text": "The food was alright but was very disappointed when I found a fish bone in my raw salmon. There is a way to cut fish to avoid bones. I have never had this happen and I eat sushi very often. I have ONLY had bones in COOKED fish. Will not be returning. Staff also is not very friendly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIqnXvQMzEm3n4HYH2MJsA"
  },
  "UO7qtyrYzumtC7OZZr0NAg": {
    "date": "9/2/2016",
    "text": "Just moved from Seattle and found out about the grand opening of Tail & Fin through Instagram. Was greeted by friendly and attentive staff upon arrival. The ordering process is similar to Chipotle and is streamlined which makes the experience a fun and interactive way to the finished product. I ordered The Crabby Bastard (CB) Burrito and The O.G. rice bowl. The CB was delicious! I was surprised but delighted with the addition of pomegranate seeds. I wish I had gotten the O.G. in a burrito instead as the presentation of the bowl was not as impressive. But its only opening weekend so I hope that can be improved. Although it is a bit of a drive from Summerlin, I will be visiting Tail & Fin again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "27EGe-SAQJxfjytX7e5nXw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Crabby Bastard burrito and O.G. rice bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/27EGe-SAQJxfjytX7e5nXw/o.jpg"
      },
      {
        "img_id": "yWcnVStoo0O8PZS7aw7m-g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The Crabby Bastard burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yWcnVStoo0O8PZS7aw7m-g/o.jpg"
      },
      {
        "img_id": "zwERFP4BuGPCXKl9cov5Uw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The O.G. rice bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zwERFP4BuGPCXKl9cov5Uw/o.jpg"
      }
    ],
    "user_id": "XB3jLxGXzD7euz3cGKdkMw"
  },
  "uGSAwFLnpxZuf1TneZ-YaA": {
    "date": "9/1/2016",
    "text": "The key is fresh fish and Tail&Fin delivers just that and more. I built my own bowl with ahi tuna and spicy tuna. All the ingredients in my poke bowl were very fresh and tasty. The decor of the shop is simple and quite pleasing. Staff was also very friendly and helpful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HHWTQ9srC-2Fl8b9DRjm7Q",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Build Ur own bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HHWTQ9srC-2Fl8b9DRjm7Q/o.jpg"
      }
    ],
    "user_id": "GyfQPmcTJlj_6fz0a3s6lg"
  },
  "4unONcGnKztWZNfMYBDpiw": {
    "date": "11/23/2016",
    "text": "Since my son wanted sushi burrito so we gave this place a try and he loved it!  He ordered The OG and he says it was delicious!  Friendly services, but it kinda pricey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "54nLYrcqwLaoZeUjgU5qgA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The OG with avocado...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/54nLYrcqwLaoZeUjgU5qgA/o.jpg"
      }
    ],
    "user_id": "02OEHTLPT-OHckqvKsa8GA"
  },
  "WZjbllbqGzLjwUluW2fMEw": {
    "date": "9/24/2016",
    "text": "Quick, customizable, fresh, with great sauce choices! Everything was good. Everyone was friendly and the place was clean. My only complaint was that my poke bowl rice was cold and my husbands was warm (much better).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8NAFTFvRTeYGy86ddiQYpg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8NAFTFvRTeYGy86ddiQYpg/o.jpg"
      }
    ],
    "user_id": "GoqI1zpowQeBoUrmSm9cEA"
  },
  "_VuIryZbNC6Q-QkV-vYADw": {
    "date": "9/21/2017",
    "text": "I ordered a bowl. The girl that made it had her hair down. Then she had gloves on but was picking each item for the bowl up with her hands instead of using the scoops. Then the other employees were talking to her so she wasn't listening while making my sloppy bowl. Then after she made the bowl she told me she could only take cash because the computer was down and she had no change. I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMFVwmGkEXuP62KznvHAjA"
  },
  "z-CZmQj_8-_UbQsspMhziw": {
    "date": "7/3/2017",
    "text": "Great food and service. We enjoyed it!!!  Sushi was fresh and the concept of this was amazing. My family and I had to buy 2nd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqmBeYHCBNVCa89NQZso-A"
  },
  "fT64WpUeVP_MW-tGhHdNBA": {
    "date": "5/2/2018",
    "text": "So ok my first impression trying this place was lukewarm.  Came in around 3:45 pm on a Wednesday and it was empty. The modern, simplistic, upscale decor is definitely attempted, but it wasn't enough for it not to still feel oddly industrial, and like the space didn't fit the vision. It was just off. Especially behind the counter it all seemed very homemade so it was hard to be convincing that it was upscale modern when you look behind the counter and it looks like someone's home kitchen.   The young girl who greeted us was very nice, explained the menu, but couldn't tell us about their most eye catching, IG famous menu item which is the Pineapple Express, served in a half pineapple. But she was very sweet and didn't charge me for adding avocado to my burrito because we had never been there before. Which I'm certainly grateful for because the amount of avocado she added to my burrito wouldn't have been worth the up-charge.   The service was pretty slow compared to other poke places, and my friend got the half pineapple item which required someone special in the back to cut it which extended the preparation even further. My burrito which had been waiting at the register in the meantime, got handed to another customer who left and then had to be tracked down to retrieve it and it was kind of a mess for a second there. We walked out of there like \"whew we made it\".   That all being said, the food was tasty, but it didn't rate so well in every other way. Hey, if it tastes good then maybe that doesn't matter. But it did affect my overall opinion.  I got a burrito with brown rice and the rice was slightly hard but surely nothing that would make me stop eating it. The seaweed wrap became so soggy from the time it was made to the time I began eating it that i couldn't take a clean bite. Each bite resulted in this catastrophic avalanche of ingredients falling out all over my hands and onto the paper beneath.  lol it was a friggin mess eating that thing!! I had stuff falling out all over the place and sauce all over my hands. So it tasted good, YES. But it was messy AF to eat and simply knowing sushi burritos shouldn't be like that was something I can't ignore. I think the girl added way too much sauce and really didn't wrap it that well so it was kind of a bummer to have this good tasting meal that was a mess and falling apart. I finished my burrito with a fork so in my humble opinion, burrito skills not on point here, guys. Do it right or don't do it at all.  Thank God they give you wet wipes in the bag because I needed one like I had just eaten a half rack of ribs.   The price point here is good, you certainly don't feel like you've been over charged and the food tastes good if nothing else. So it's worth trying but in my opinion I'd have to have a much different experience overall for them to merit 5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P28OrLTcpxU0eOlwizYKeA"
  },
  "Nz1T0RES8MryyXHeDyzjOA": {
    "date": "8/1/2017",
    "text": "Where do I begin... One of the staff had her evil eye/hand bracelet dangling in the food when she was prepping the burritos (namaste more like you nasty). We ordered the crabby bastard but the soft shell crab had a funky taste to it like it wasn't fresh. My daughter has been having the runs since we ate here. She was so excited about this place but I highly doubt we'll be back unless they improve on the quality and freshness of their ingredients (and cleanliness).",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WCqsTpVsX3g_5-eI_dZKQ"
  },
  "FQ1pYVw9Jv6AebOC05Nn7Q": {
    "date": "3/2/2017",
    "text": "All the ingredients were so fresh! Great food and service. Crab and ahi with pineapple! All the sauces were great as well. Definitely will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dLlSWYZMAXtNCIUCWdBmSw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dLlSWYZMAXtNCIUCWdBmSw/o.jpg"
      }
    ],
    "user_id": "P6L1opwx66ZGcV9pWMjr9g"
  },
  "PtiDaqxUex7AZ5derx1TSQ": {
    "date": "8/9/2017",
    "text": "Wow it was only my second poke bowl, but so delicious!!! I love that you can get it on a salad instead of rice. Also online ordering is very convenient for me--I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZIBE8LOf3q97F3Es5OsFw"
  },
  "NRv-bOc1_JjR3UId_LRhJw": {
    "date": "11/12/2017",
    "text": "This place is going downhill. We have eaten here several times since it first opened. Was one of our favorite go to places for dinner. We've been out of town for four months and I couldn't wait to have dinner here. Was SUPER dissatisfied and disappointed. Place was dirty. Girl took very long time because she had no help. Just isn't what it was. Maybe we will give it one more try....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MVuauXCM4rQpJJAHNWkPoQ"
  },
  "UxvYdJHLavDsHYWfRSgucQ": {
    "date": "6/23/2017",
    "text": "I was excited to try this place. The decor is nice and the employees were helpful. I got a custom poke bowl and it was delicious while I was eating it but a few hours after I had the worst stomachache followed by vomiting. I'm never going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "au7rKWhMugLK4qX1edmFSg"
  },
  "CLQ3YcC3IEzcKfy516evfw": {
    "date": "8/3/2017",
    "text": "Great sushi burrito for this part of town. The large is big enought for both my wife and I. We will be going back, Fair price also",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSOgLykZuZUfVvGORTNNEA"
  },
  "INYFvC_gp98uM3PJXrQxPA": {
    "date": "1/19/2017",
    "text": "First off this place is amazing!!! The customer service is A1, the quality in the food is excellent. The whole staff will welcome you and make sure your first time won't be your last. I had the OG burrito with seaweed wrap. 10/10 This will be my sushi burrito spot for now on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "td2LlymJ8D-mF8-WkCBzVw"
  },
  "ep6BI51n-4RCkH33-cS0bA": {
    "date": "9/22/2017",
    "text": "I love the convenience of this place being right across the street from work. I've come here a few times already and every experience, Sophia has treated me with excellent customer service and always made great suggestions on what to order. My food is always put together well and never messy. Thanks Sophia for always making me feel welcome and fed..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "czAbSzMPMCjyfOmU4blgig"
  },
  "cwgdg4Q9tlig9Wl1O1a0sQ": {
    "date": "8/31/2017",
    "text": "postmated the IG poke bowl. Food is really good! Lots of fish and fresh ingredients. The ONLY thing is... i didnt know the poke sauce had so much wasabi in it!!!! Thought it would be like a tangy ponzu sauce like other poke places. Regretting hard not tasting the sauce beforehand and ruining my food TT my nose is on fire and my eyes are runny lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJs9FDBhtTsSNa_0R3i5bQ"
  },
  "b0KeItH5fkYR8V-jRHgDtg": {
    "date": "9/30/2016",
    "text": "It's my 1st time here. I tried the Krabby Bastard. It was refreshing. I'll try another kind of burrito next time though, or possibly create my own. I would come here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1dNs3sk8Z0d0XmbTMpbRxg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Krabby Bastard",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1dNs3sk8Z0d0XmbTMpbRxg/o.jpg"
      }
    ],
    "user_id": "-CsCHO54CGllgyy1ilrjSQ"
  },
  "3IsbfsgiIAnwtOz-0-ruWg": {
    "date": "6/11/2017",
    "text": "This is the only place I've ever tried a poke bowl, but I don't feel the need to go anywhere else.  Kinda pricey for a bowl of food, but it's so good every time!  I have been wanting to try the burritos but I know how good the poke bowls are so I haven't tried yet.  The staff is always friendky and fast.  Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "q-j11rYzZZ_OnwI_5WaOKg"
  },
  "O3Wksn9MVt9R4YvkkBNIlw": {
    "date": "3/11/2017",
    "text": "Wow this place has it all! Tip when ordering the sushi tacos make sure to ask for the scraps and have them make you a great sushi bowl with them! If not they just throw them away! Ask for the garlic chili Aoli sauce and top it off with some spicy salmon! Tail and fin is off the hook good!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uwnE8036cwfAaOyOzetwyQ"
  },
  "bF_urIq9OuP0a_bXzYuTpA": {
    "date": "9/8/2016",
    "text": "I've been waiting for this place to open and when it did, it exceeded my expectations by far! First thing you'll notice is the modern decor that immediately connects you to the sophistication of the name itself... \"Tail & Fin\". They deliver quality ingredients followed by a more than awesome staff that provides utmost customer quality experience. You have the choice of carefully crafted items on the menu to creating your own bowl or roll. I highly recommend coming here if you're ever in the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SX6OZipSVfKO3qCTDc5XUg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. &amp;#34;Flaming Tuna&amp;#34; &amp;amp; &amp;#34;OG&amp;#34; are a perfect combo to share! And the fish is amazingly fresh as well!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SX6OZipSVfKO3qCTDc5XUg/o.jpg"
      }
    ],
    "user_id": "UF5S9-XHsCBaPBL_ShBvkQ"
  },
  "Ys3nIsjhnB_WCFu-5bz23A": {
    "date": "10/14/2016",
    "text": "Finally a sushi burrito place on my side of town! Also it's awesome!!! Tail and Fin sushi burrito & poke. Got the stupid good tuna burrito for my first time. The name says it allwith lots of different sauces to try I'm definitely doing a build my own next time. It's off of Maryland parkway and silverdo ranch for my fellow southsiders. The staff was very friendly and the ambiance was chill. Think I found my new favorite regular place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tnTL0M5po1K9-qECksmAoQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Avocado boat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tnTL0M5po1K9-qECksmAoQ/o.jpg"
      },
      {
        "img_id": "A0Eemrlx1mrTR0i756yLTA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon/Ahi avocado boat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A0Eemrlx1mrTR0i756yLTA/o.jpg"
      },
      {
        "img_id": "QGG-WIP4ZeJsM6um0LjHpQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Stupid good tuna burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QGG-WIP4ZeJsM6um0LjHpQ/o.jpg"
      }
    ],
    "user_id": "X8FXx55SqlUqE4h4vcSLtQ"
  },
  "vMTs-pUVQybl3hI7HDTqjg": {
    "date": "9/2/2016",
    "text": "The grand opening of Tail & Fin was everything I thought it would be... and more!   Upon parking easily right out front, we walked in and immediately jumped on line (it was understandably busy) The restaurant is in a small section of the strip mall and neighbors Teriyaki Madness, Subway, and a pizza place.  It has minimal modern decor that caters to us ridiculous social media addicts (Photo op wall, and a snapchat geo tag).  There's only about 8 tables, if that. So, I expect it to always be full. We opted to take our food to-go, instead of waiting for a seat to open.   The food is to die for. My husband and I got two different burritos. We semi customized both.  We ordered The Crabby Bastard- soft shell crab, surimi crab, cucumber, tomato, furikake, avocado, pomegranate, unagi sauce. We subbed the  pomegranate for spicy tuna and cilantro.  Also, The Omega- salmon, surimi crab, romaine, tomato, avocado, red onion, ponzu, honey sesame aioli. I added mango, raw jalapeno & chili garlic aioli.  I highly recommend adding mango, it adds a nice sweetness.   We were in and out in 10 minutes, on the grand opening day, including our wait time on line. Impressive! The staff was organized, happy and on point!   I anticipate eating here at least once a week!   Happy Yelping!",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 19,
      "cool": 26
    },
    "photos": [
      {
        "img_id": "bwuxXTNUIgn8A3pYIWcMxg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bwuxXTNUIgn8A3pYIWcMxg/o.jpg"
      },
      {
        "img_id": "1QgiJOEVPgzLf83AQFhOKg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1QgiJOEVPgzLf83AQFhOKg/o.jpg"
      },
      {
        "img_id": "G_pZTL6Kzs_88Qfmm3gpqg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Snapchat Geotag :-)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G_pZTL6Kzs_88Qfmm3gpqg/o.jpg"
      }
    ],
    "user_id": "UUVbV8XmTzNksBOPaiO3pA"
  },
  "bVTByCBRQIm22ZBgVFQoUQ": {
    "date": "9/13/2016",
    "text": "I must say I can't eat raw all the time. But when I saw that a sushi burrito place was opened by my house I knew I had to try. I always look at the yelp pics to see what looked appealing. I saw mangoes. I love mangoes. So I picked the \"Yo Adrian\" burrito (I like spicey) and added a bunch of veggies and mangoes with extra sauce. Just like how I would make my subway sandwich. Lol. I was a bit afraid of how the sushi will taste. If it's fishy then you know it's not fresh. I took a few bites and there was no fishy smell. Thank goodness. It also makes sense why the place is so cold. They needed to keep the freshness of the raw fish.   Wanna know if it is good as leftovers the next day? So I kept the other half of my burrito in the fridge. Left it for about a day/24 hrs. The next day I was starving and forgot I had left it in the fridge. I decided to take the challenge and took a bite. Wow. it tasted even better?? my fridge is turned on pretty cold which made the texture a bit firmer, not soggy. So it didn't feel like raw fish. So good!  Note: I am a big rice eater. Most places have dry rice and the people/places here in Vegas don't understand how to eat/make proper rice. It needs to be moist! Dry rice is the worse thing. And I love how this place knew how to make amazing rice. I just want to order it alone and eat it.   Had this place 3 days in a row...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "OxzN8KCId2KCyX2ykziXXQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Yo Adrian burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OxzN8KCId2KCyX2ykziXXQ/o.jpg"
      },
      {
        "img_id": "DP9o7v_zLywQtwRwZdcj9Q",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. She&amp;#39;s trying to roll my fat burrito together.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DP9o7v_zLywQtwRwZdcj9Q/o.jpg"
      },
      {
        "img_id": "ikEwdodzfkhH6FlKGfHlLw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Yo Adrian sushi burrito with extra veggies and mango. Delish!! Too big to wrap lol.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ikEwdodzfkhH6FlKGfHlLw/o.jpg"
      }
    ],
    "user_id": "xedHsPfMpBr-WUKEwlb8rA"
  },
  "pqEHUemMkSOc5tYLGijcgw": {
    "date": "9/7/2016",
    "text": "My review is on the Vegan sushi burrito I ordered, vegan life. I have to be honest, I wanted to love it because of how close to my house this place is but unfortunately the sushi burrito place I went to yesterday was waaaay better. I was so impressed with my vegan sushi burrito at Ted's Sushi Burrito on S. Rainbow cause of the texture of the Panko tofu & the flavorful toppings that today's sushi burrito at Tail & Fin Burrito didn't satisfy. It made me crave another sushi burrito but didn't feel like driving far so I was driving past this place after we left my son's school & figured I'd give Tail & Fin Sushi Burritos & Poke bowls a try.  I didn't like the texture of my burrito. It seemed kind of soggy. The rice or something gave it a weird texture. I didn't enjoy the taste of the tempeh. Maybe it was the combination of everything in the roll. I'll have to try another sushi burrito again with a different variation.   The employees were really nice & friendly & it looked pretty busy in there.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LQid9hUaUqTY_Ud7CbxGrg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. I wish I read the ingredients before I purchased it. Hydrolyzed vegetable protein &amp;amp; high fructose corn syrup is not good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LQid9hUaUqTY_Ud7CbxGrg/o.jpg"
      },
      {
        "img_id": "HlW14HjMceyOAlnKPIHdEA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Seaweed salad. Looks good but it has msg unfortunately",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HlW14HjMceyOAlnKPIHdEA/o.jpg"
      },
      {
        "img_id": "3AmCAbU1MF1rSL5wt16mSA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Vegan Life burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3AmCAbU1MF1rSL5wt16mSA/o.jpg"
      }
    ],
    "user_id": "G0hKae1fj3M3CGz7EpTqEQ"
  },
  "LcwgGipXQFJcdlyGd5STZw": {
    "date": "1/3/2017",
    "text": "Man - I wish we had a place like this in the DC area!! I love the concept and was blown away by the delicious sauces and fresh ingredients. You have your choice of a sushi burrito, poke bowl or even tacos. I opted for the spicy sushi burrito bowl and asked for an extra side of sauce. The service was impeccable and the price points are spot on compared to the amount of food that you get. I was only able to finish half of my burrito!  You can make your own creation or choose from one of their options. They even let me add crunchy tempura flakes to mine and my husband was able to modify his burrito as well. This place was very clean and they have both indoor and outdoor seating so we were able to enjoy the nice day.  I will definitely be back the next time I am visiting my family in Vegas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9-5Qb4NOG3dBvdZ32zO8Q"
  },
  "SVzensx9Q2KimFUtojwRzw": {
    "date": "9/14/2016",
    "text": "Mmmmmmmmmm! One of my biggest issues of being a big tuna lover is the lack of quality options when it comes to getting high quality tuna establishments. Usually you need to go down to the strip in order to get a good tuna poke or at least a higher end restaurant. The problem with this is the time it takes to get ready go down and then sit wait for the food. Well NOT anymore!   Tail and Fin combines the best of both worlds high quality product, and I mean high quality the fish was literally as good as Nobu, and the convenience of a quick service restaurant.   I walked into the Restaurant and was greeted politely by the entire staff. It was clean well organized with the tables on one side and a lineup for people to order on the other. It's similar to a chipotle where you get to choose what kind of protein and toppings you want on your burrito or burrito bowl or salad. The choices to put on we're very diverse and let me have many options for my most favorite poke variation cravings from the classics like avocado to a little more unique like pomegranate arils. Next up the sauces, the classic poke sauce is delicious but let me tell you what, YUZU MISO SAUCE is the business! Finally you get to end your choices with a combo upgrade which lets me pair my favorite side dish ever cucumber sunomono.   So in conclusion..... This place is a going to be a giant franchise very shortly. It's fast it's clean and most importantly is so good it makes you want to go everyday. All I can say is thank you I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P7lVRBrUDoppZGXfxJK71w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The line backing up, don&amp;#39;t worry it goes really quick.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P7lVRBrUDoppZGXfxJK71w/o.jpg"
      },
      {
        "img_id": "YXhsa3TpvNuERW3biBo0cg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Mmmmmm! Stupid good tuna",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YXhsa3TpvNuERW3biBo0cg/o.jpg"
      }
    ],
    "user_id": "7y9xossD3vSrerZsKwgLug"
  },
  "Hh0FD7K2T1bJGXt0h1nEow": {
    "date": "6/13/2018",
    "text": "It was just ok. Like it fulfills the idea of a poke shop, but doesn't really stick out from the other poke shops. The choice of ingredients was very slim. The ingredients also didn't taste very fresh, and the guy just poured the sauce on to mask it. It wasn't inedible so that's somewhat of a plus. Overall, it was a very disappointing meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "se5TbD_CVpJgC16V7H7uSQ"
  },
  "wy_jW4pnlWPjrwkQvhZryQ": {
    "date": "4/7/2018",
    "text": "Best poke this place is soooooo cold make sure you bring a sweater but super clean and great for summer that's for sure...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "scQBrQJbxWZ6telqJTc6Kw"
  },
  "v-WluaaNNE8iT1nOWna2ZQ": {
    "date": "9/2/2016",
    "text": "I had high expectations for this place because of it's  very convenient location. We are regulars at Soho Sushi and JaBurrito so we are not new to sushi burritos. They don't have as many options as the other places. The portions are very small too. I'm ordered a build your own salad bowl. Very small. Didn't satisfy me. My husband ordered two burritos and wasn't satisfied. The prices were also a little higher than their competition.  They pass for good but portions were a huge disappointment. Overall...we were disappointed. Didn't hate it, but didn't love it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z3AT75PbYbneprFxpdcqZA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Don&amp;#39;t come when you&amp;#39;re hungry. Portions are much smaller than the other sushi burrito joints.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z3AT75PbYbneprFxpdcqZA/o.jpg"
      },
      {
        "img_id": "paLAboIwiHYsLQtXulWDnQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Build your own salad bowl. Too small of a portion.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/paLAboIwiHYsLQtXulWDnQ/o.jpg"
      }
    ],
    "user_id": "ZXK6wSoYbrcG9xf4ZlaR6g"
  },
  "KTfESCeLTIpBf0_bHN8RWw": {
    "date": "11/14/2016",
    "text": "Poke bowls are all the new hype. so many new poke restaurants are popping up it's hard to decide which one to go to. Tail and fin delivered with food quality, portions, and friendly customer service. the owners were at the restaurant personally ensuring a smooth opening, and took the time to talk with us and ensure we enjoyed our experience. I recommend their mochi pops for a fun sweet treat after enjoying your poke bowl.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "C-5SR-FL0c3qudzV_cNFgw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Customized poke bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C-5SR-FL0c3qudzV_cNFgw/o.jpg"
      }
    ],
    "user_id": "L6nrDwHJDyV0KThjON-Kog"
  },
  "XzEjivXCmB-U65RT5jHeDA": {
    "date": "5/30/2018",
    "text": "I came all the way from New Jersey to Vegas and had a list of places I wanted to visit to eat, and this place was one of them. I was dying to try the sushi bowl in the pineapple bowl. When I arrived to the restaurant and asked for the pineapple sushi bowl they told me that they were out of pineapples and this was the beginning of my disappointment.  I ended up getting a regular sushi bowl since I was already there. The salmon and the tuna did not taste fresh and the rice has a weird texture and strange taste as well. Both my girlfriend and I were very disappointed by the food and we actually got sick by the time we got back to the hotel. I literally threw up everything I ate. If I could give this restaurant a 0 star review I would. I definitely do not recommend going here. If you want a good sushi burrito definitely recommend Jjanga.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yh4JDAnI7UN3KzT-HfC1_g"
  },
  "JMp2NTZe6vCo7OvAF139-Q": {
    "date": "9/14/2016",
    "text": "Before I came in, I yelped the reviews and wanted to try it myself. They didn't provide a menu online that I could skim through. So I came in for a quick lunch. The menu wasn't very big but they have a decent variety. I ordered the Shrimp Tempest and added tuna ($2 extra) the burrito was a good size, the length was as big as my forearm. They're pretty generous with their portions. Upgraded for a combo which came with my choice of miso soup and a fountain drink. Total for lunch cost $16   The taste was good but not great. I've had other sushi burritos that were delicious. This was pretty basic. The flavor didn't hit me like WOW like I expected. It was mediocre. Which I felt a little bummed about.  I like that the restaurant is clean and has fresh ingredients. The staff was friendly but they didn't pack me a spoon to go or napkins in my bag. Good thing I ate there, I had to help myself. Although it's a new establishment, I feel this business can thrive over time and experience. I will be coming back to try other items they have to offer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZOlY_EjvnB2Qa1K_yJtZwQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZOlY_EjvnB2Qa1K_yJtZwQ/o.jpg"
      },
      {
        "img_id": "zdyjr6YWoVgkjeHNwh5hDw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zdyjr6YWoVgkjeHNwh5hDw/o.jpg"
      },
      {
        "img_id": "40lFjhM67pNQkGrz8Cwxfg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/40lFjhM67pNQkGrz8Cwxfg/o.jpg"
      }
    ],
    "user_id": "UsTgwTLRDbQx6gp-qjMmmg"
  },
  "m6wxjnzoOva6KxXBRAtWxQ": {
    "date": "11/25/2017",
    "text": "This place was really good a year ago when I first tried it. I really loved their sushi burritos and their portion sizes. Now however, the portions are small, it's not filling. Their rice machine that dispenses the rice onto the seaweed paper was broke and I don't blame them for that but the worker put the rice manually on the seaweed paper and began smashing the rice down. This causes the rice to become mushy and quite disgusting. Would not go again until something changes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zxhEmQGQFprCkKKkhN9KZw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Mushy rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zxhEmQGQFprCkKKkhN9KZw/o.jpg"
      },
      {
        "img_id": "453oWUVp9mo-8Dk2NUUMLg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/453oWUVp9mo-8Dk2NUUMLg/o.jpg"
      }
    ],
    "user_id": "GdqPyjhdy4cr03ZJ76m-pA"
  },
  "ZUUjZd848Id0WU6AKf0IVQ": {
    "date": "10/12/2016",
    "text": "If you change your music selection, I'll came back and change the 4 star, to a 5!  Also, for $10 more, you can get, AYCE at Sushi Mon.   Hint.....drop the price a little.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E2-rQsTo1fa_AO7-JjX6ZQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E2-rQsTo1fa_AO7-JjX6ZQ/o.jpg"
      }
    ],
    "user_id": "WafLZXglc1pAQJs9zW__6g"
  },
  "ou1wSkwIi98HCRPvl9y4zg": {
    "date": "8/17/2017",
    "text": "5 stars.....  These five stars aren't for the food, although the OG bowl has no rival, the food is just sushi done fast. They aren't for the establishment either, I'm not sure what has changed as far as ownership or management, but I'm in there after crossfit 4-5 times a week and have seen the definitive difference.       These 5 stars are for the OG Bowl...or anything else on the menu, made by Sophia!!!  Customers don't repeat based on food alone, we can get it anywhere, we repeat because of the interaction and service... Sophia doesn't disappoint..... 100% character and conversation, 100% of the time... from the crazy amazing smile and greeting as you walk in the door, to the casual, out of left field funny conversation while you watch the food evolving into your favorite sushi bowl, Sophia will not disappoint......      Whoever made the decision to hire her....Well Played!!!! Well played indeed!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3492dglQ5IsSQgVwJLN3Sg"
  },
  "umOzFKhUMe_5St18zhCeeQ": {
    "date": "11/14/2016",
    "text": "My first time eating a sushi burrito and it was so delicious!!! All their fish and ingredients are really fresh. All their sauces are amazing too. My new favorite place to eat hands down.  Update--- I've gone to a few other sushi burrito places around town and Tail & Fin is by far the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pemAfk1CTYgykCs6YNnqow",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Create your own sushi burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pemAfk1CTYgykCs6YNnqow/o.jpg"
      }
    ],
    "user_id": "UeD6oq1zCBxG0eK7E21uRA"
  },
  "z8exg4qbQ_f_TIxMb1KOfQ": {
    "date": "6/29/2018",
    "text": "Pretty decent sushi burrito. I came here yesterday to check out some food options near my new home. It wasn't the best sushi burrito I've had but it definitely wasn't the worst. I ordered the Flaming Tuna and it was definitely flaming. But it was unfortunately a little messy and started to fall apart mid way through eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2zGaG5EfZPcHSd8XaL9gw"
  },
  "EIiqcqYkD2WdLdlMwe8-fQ": {
    "date": "8/31/2016",
    "text": "I inadvertently came here on opening night for a private event. The owners were super cool about it and let me stay to try out the food. I must say it is some of the freshest tuna and seafood I have had here in Vegas and definitely rivals jaburrito.   I have been looking for a sushi burrito spot near my neighborhood and I will definitely be back I am hooked! I also love that they make it as a bowl or a salad option! What a healthy spot for lunch!!   Looking forward to returning and bringing some friends to try it out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tLc2bB82sN5SfQkbUx3uIA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tLc2bB82sN5SfQkbUx3uIA/o.jpg"
      }
    ],
    "user_id": "ylku-3TJU62S1mnKlxDDtA"
  },
  "mzinX9vOI9jR_mdKxXeGNg": {
    "date": "10/7/2017",
    "text": "So good!  I've been waiting to try this place and it didn't let me down.  I've never had mango with tuna before and it's crazy good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "seS2ayUpYx7K_wGipVhnww",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/seS2ayUpYx7K_wGipVhnww/o.jpg"
      },
      {
        "img_id": "IE7qh00V2wHj1EsTVSpa3w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IE7qh00V2wHj1EsTVSpa3w/o.jpg"
      }
    ],
    "user_id": "geyDs4I9nPhZO8fcWE5rAw"
  },
  "5O6zZNR9dADwsQrdrCSw3Q": {
    "date": "4/6/2018",
    "text": "Really cool pineapple bowl, what a fun way to eat poke. The staff was sweet and the fish was really fresh and so was the pineapple. The portion was really great. Definitely bring a sweater it's really cold great for a hot day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2ToQ5eT91v2hkIT7I4X7g"
  },
  "pqDEsK-3sp5XaipjajR-1Q": {
    "date": "12/20/2016",
    "text": "I love this place but tonight we found long hairS in the bowl. So disgusting. I don't understand why they do not wear hair net when they serve food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pn236elGmz2ydhlYgHbcwA"
  },
  "RSAw2wbxzaG4x3XAMZnl-w": {
    "date": "3/25/2017",
    "text": "First sushi burrito I ever tried was here. It reminds me of subway but for sushi. The staff is very helpful and friendly and the atmosphere is so laid back. Definitely a good place to check out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n3I7DuSCNivt3VuJy80vyw"
  },
  "JWUd18p6gilS9FWsceP8LQ": {
    "date": "12/18/2016",
    "text": "LOVE this place! The food is fantastic. I love every roll and bowl. The food is fresh and tasty. The staff is awesome, always a good time when ordering. The process is easy, order your food at the counter, customize it, pick it up and pay, find your seat. Nice quick way to grab some amazing sushi!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dtQWgO3leMcn6nomD_mgVg"
  },
  "mjZWSvh9zPnhzIRHboNh9g": {
    "date": "9/6/2016",
    "text": "Yummmmy! We tried the Stupid Good Tuna Burrito and it was delish, fed two of us. The Hawaiian looking girl was super friendly and gave us a laugh or two(:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-ysK0UOeolUYoU_nio0ojw"
  },
  "8ZjtihGB01aJvIs6ZbnCqQ": {
    "date": "9/1/2016",
    "text": "I got the poke bowl and was able to create my own bowl. I ordered the tuna, salmon, avocado and crabmeat with a drizzle of their sauce. It was delicious! If you want fresh sushi, tasty sauces, and a friendly staff, go to tail & fin. It's simple and very convenient. New go to spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "q0t6wdIzDjtwQMSx3fEn_g"
  },
  "ifyQbZbLoF-B9f_CFf2mgQ": {
    "date": "3/10/2017",
    "text": "After calling in, I went to pick up the 70$ order and waited an hour for it!  Didn't even get a discount!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8wHRBR1buu1Gjg3Piwr9Ww"
  },
  "vPs8WBwsipVObN9eXb3Wng": {
    "date": "1/18/2017",
    "text": "My experience at this location wasn't the best. I feel like the workers were new and inexperienced. There wasn't many people in line during the time I went, yet to took about 20 minutes just to get my burrito. I wouldn't recommend this place if you're looking for a really good sushi burrito. In addition the lady put too much sauce for my liking. I'd say try Soho Burritos or Jaburritos",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8iMAkT9rYoCeBiuwsgcDLg"
  },
  "Ptyg2570HVRsqCDFuCeTMQ": {
    "date": "10/3/2016",
    "text": "I was so happy to hear that a poke place finally opened up in this area so I don't have to drive as far whenever I'm craving a sushi burrito.  The atmosphere is pleasant. As you walk in, everyone immediately greets you and everything looked clean. The menu board is pretty straight forward and easy to understand. I went with the OG and didn't add anything extra.   I looked away for a few moments and saw that my burrito was drenched in sauce. Oh well. While unwrapping the burrito, I noticed that it wasn't tightly packed. The seaweed didn't overlap and there was a big gap with fish and rice falling out. The sauce was a bit overwhelming and overpowered everything else. It even leaked into the wrapping paper making everything sticky and a big hassle to eat. Everything was also soggy so there wasn't much texture to anything.  The customer service here is great, however the food - not so much. The prices are also a bit high compared to others.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IPGCGImT5tsLWWpLbvmLZQ"
  },
  "hRNUsw636CdeOvdQKeReuA": {
    "date": "1/15/2017",
    "text": "I absolutely love this place the Crabby Bastard and the Shrimp tempest are my favorites the OG and yo Adrian are great and I love the atmosphere. Congratulations on the expansion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wtIDc-n5s2WesrWFB3LWIQ"
  },
  "o5qvnH-1fOc7DiORmri2vg": {
    "date": "8/31/2016",
    "text": "Thank goodness this opened around the corner from my neighborhood.  Delicious and healthy sushi burritos and bowls at the tips of my fingers.  Their spicy tuna burrito and shrimp tempura burrito was absolutely incredible...lastly, the Mochi ice cream pop was the perfect end to the meal. Great spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3fuGa0bP6ozAA4Hnymq2Q"
  },
  "uNsWg7iFblqI8Jxk9GBaQQ": {
    "date": "11/14/2016",
    "text": "Wow! My first time and it's absolutely amazing . Food was unbelievable , I had the flaming tuna salad , which can be done in a burrito or a poke bowl . I love how you can build your own if you wanted to. Great spot , will be coming back . #ilikeitraw",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w_KUT03jV4HYgjTi9903Yw"
  },
  "ENa9jV04GiHOyiOZvJ_6EA": {
    "date": "10/8/2016",
    "text": "I came here based on Yelp's recommendation and wasn't disappointed.  The staff was friendly and made suggestions when i asked. I got the Omega roll in seaweed and it was very good except for it falling apart but that seems to be the norm for sushi rolls. I will definitely go back and try a poke bowl next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcmMeT_3fnjJniILAg7jHA"
  },
  "reeuSaopuaGdnkOuej8qYA": {
    "date": "10/3/2016",
    "text": "Hands down my favorite sushi burrito spot. You can create you own or choose for the amazing option on the board. One of my favorites is Flaming tuna a must try. Generous portion, fresh fish, Great ambience and they offer desert too. Variety flavors of Mochi ice cream pops. Wait I forgot to mention the variety of sauces that they offer. You have to sample them all. My favorite is the chili garlic aioli. If you haven't been there yet you must go. Definitely be back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvmCC-eGDxZI8D7ML5CqYA"
  },
  "X93tZh8G7XES426ItplDlw": {
    "date": "11/4/2016",
    "text": "It's such a quaint little place and it's so relaxing! The staff was very kind when I ordered and the sushi burrito I ordered was delicious. I would definitely come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fT62XN7PyYj6HxCWN_qAA"
  },
  "Jk_R5ciO6FjlFeQn96WkwA": {
    "date": "9/27/2016",
    "text": "Amazing food for at a ridiculously affordable price!  The ambiance is clean and sleek fast casual.  Get the stupid good tuna burrito with soy paper!  Go check this place out, asap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXX9P6PQ8Y_3rKRIn_XKOg"
  },
  "8a0_3A6RMBIi-tW-oO42RQ": {
    "date": "12/9/2016",
    "text": "Really wanted to enjoy this place because I work in the area and pass it multiple times everyday...  Unfortunately, it was subpar. I enjoy sushi quite a bit and have visited a multitude of sushi bars, poke spots, and sushi burrito establishments all around town. This place is second to last on my list.  In comparison to other sushi burrito spots... Portion size is terrible here.  Taste/texture is nothing to rave about.  Topping ratio is COMPLETELY off.  I got a bowl and when asking for certain toppings, they were counted out and nowhere near what I would like (5 cucumber pieces and 2 Yama gobo spears).  I also ordered a burrito which I believe had more seaweed salad in it than all other ingredients combined.  Price is fairly consistent, if not slightly higher, than similar stores, but not worth it for the amount of food you get. Myself and my friend were both still hungry after our meals.   I will say they are still fairly new, so maybe things will get better as they mature. I will give them A LOT of time to figure it out before/if I try it again though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OKpRDoUGAlxrUI-GWeP2g"
  },
  "FoXTU-vdAQwUbhtCcXjWVg": {
    "date": "2/24/2017",
    "text": "Yummy.  My husband and I have had this delivered by postmates twice now, and both times the food was fantastic!  Tons of fresh fish on a big salad with awesome sauces.  I have never been so satisfied from a salad!  Delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8omhNH_OghXuy1fnqniWw"
  },
  "eOnF8V_B7McHGMKQlA_Gvw": {
    "date": "10/18/2016",
    "text": "So soooo good!!!! So fresh and every menu item I've tried is delicious :) Staff are all super friendly and knowledgeable. Super happy to have this restaurant close to home",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cu48Qs7SBOeloshkgdQmKg"
  },
  "xRniJMpJ-KxIVRmoQAuQJg": {
    "date": "10/17/2016",
    "text": "I tried the Yo Adrian. It was just okay. the burrito was soggy and fell apart after the 2nd bite and ended up eating the burrito with a fork. $10 isn't worth it for the size you get. Go to the other sushi burrito places for better quality and value. This place definitely is not a place I would drive across town for, but if I were in the area I may try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMR_80-KWRIlaKyjm-yU8A"
  },
  "-ll2gPSNx7EQ-8wBcUag0Q": {
    "date": "1/16/2017",
    "text": "Kinda disappointed with this place, the pricing is absoutely ridiculous. I did the build your own and got something really basic as there wasnt really much of an option of proteins. And for $10 a piece plus added charges for avocado which are a must on sushi items in my case, thats absolutely absurd. I spent $30 on 2 crab, shrimp tempura with added avocado, where one was like twice as big in proportion to the other one. It was good food but if youre looking for sushi burritos specifically try Soho Sushi Burrito on Sahara, its way better than this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QETKDWcS0gFoD_qeTFL3Mg"
  },
  "kl1us-j7s6E9nu1rXLdPYA": {
    "date": "9/1/2016",
    "text": "Bombbbbb! I ordered the shrimp tempest burrito and let me tell ya...super good! I even ordered a second to take home.  There's no shame in my game! Staff was very friendly with great customer service.  I will definitely be back...like tomorrow!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GUrAmaxmPY1p3-Hz2WInYg"
  },
  "gqXiuvrNg-wn4qJBQtI5FA": {
    "date": "4/4/2017",
    "text": "As a poke fanatic I have looked all over town to find somewhere fresh and reasonably priced. This place has it all! Great employees, a large selection, and very friendly employees! I've become a regular!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zEJJghCjya0xgXGzJPX4QA"
  },
  "5CTk8MI_dWX_lbaMBgrXPg": {
    "date": "1/11/2017",
    "text": "Best sushi burrito I've had anywhere  I had build your own with crab, tuna & spicy tuna and for a slight extra cost you can have mango chunks added! So fresh and so delicious! This place is perfect before the movies, after a basketball game, after a workout at the gym!  The mango mochi topped off our meal! What a great find!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJZvhgxpZtdOQtmVdVKKVw"
  },
  "Ez2PxnEl3FSwu-JXE8CQZA": {
    "date": "9/28/2016",
    "text": "Incredible Sushi Burritos !! Got the O.G. with 3 different types of fish with Sushi rice and Seaweed wrap. Delicious !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ia1lWvBNdgGySyB2VSgNQ"
  },
  "flKl5O0_whiFIYqdZ1dvVg": {
    "date": "12/12/2016",
    "text": "Super yummy, their prices are a little high but their service and food is great! I will keep coming back for the simple fact that ALL of the staff on duty went out of their way to help me calculate the carbohydrates of the sushi burrito I had built. AMAZING. I have type 1 diabetes and count my carbs so eating out can sometimes be a task, they were so amazing, nonjudgmental and helpful. I will continue to go back because of that service. Also their miso is very good, does not have tofu though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRLqHBA0Z-jnlTvWJ4aoZQ"
  },
  "xl9qrkobAG9nvgKuUa1BVA": {
    "date": "9/23/2016",
    "text": "I like the convenience of this place. They have a limited selection of things to choose from although, they had things to make it a burrito. I was disappointed the food lacked flavor. I found myself dumping soy sauce on my burrito after I had them put Unagi sauce on it. In fact the only thing that had flavor was the ginger. I ordered a miso soup all it contained was green onions and broth. I found it very expensive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SP4IbHkYTcZEgJZPniFZrg"
  },
  "e67J1NLNImk2L-RAB-DCQA": {
    "date": "10/14/2016",
    "text": "I saw this place trending as a hot spot so I jumped right on it! Went by and tried the ahi poke bowl. I asked many questions about the freshness of the ahi wondering if it came in frozen. I was told by the cashier it was fresh and freshly prepared in the restaurant. Now, the place does not \"look\" like anything \"freshly\" prepared happens here. Don't get me wrong, it's cute and it's clean. But it has the assembly line, fast food feel. But what REALLY made me curious is that I read online that Executive Chef Wedhaus of  Nobu Las Vegas and Nobu Beijing fame was behind the menu. That certainly struck my fancy. Nobu is my fave! Well, tail and fin did not disappoint, it was very good and very fresh. What I would want to add is the availability of toasted sesame oil and a dash of pink salt for those of us who choose to bypass all of the sauces. Other than adding a dash of those which I did after taking my bowl home to go....it was supurb! The service......definitely needs some polishing (speed and knowledge of sauces and food items). But again, the ahi was the bomb dot com.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BmpsO9idC021hIthF74_Aw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Ahi tuna poke bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BmpsO9idC021hIthF74_Aw/o.jpg"
      }
    ],
    "user_id": "lbomijqM_BT-6mtBaFyGWw"
  },
  "h6O22PR6cDVuAMuMXjtWSA": {
    "date": "9/28/2016",
    "text": "Tail and fin has by far become my new go-to meal! My gym is right across the street and the poke bowls at tail and fin are the perfect after workout meal. The staff is always friendly and the food is fresh no matter what time I go. This is the best addition to the area in a long time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5xDDwkEE5CwysdWeb9ifA"
  },
  "-4fKwKhajv0KLjz6vzpEWQ": {
    "date": "1/20/2017",
    "text": "Ooooo mmmmmm ggggggg why did I just find this place. My partner and I were in this last Tuesday night. The food was amazing and the team members we funny. Love all the ingredients wish the team members would have explained the menu would have helped us out pick our food. Other then that the food was amazing!!! Thanks you will see us again for sure!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yv5ej_9Yjer_IpdKip5gig"
  },
  "L485oshlwOcPXBo77OrriA": {
    "date": "10/12/2016",
    "text": "Place has def become 1 of my favorite spots. Everything looks amazing on the menu but can't bring myself to not always get the O.G bowl with added spicy tuna and spicy mayo on top . Portion size is great with just the regular size, I got the large last go round and had to save some for later. Restaurant is always very clean and staff is nice. Mochi pops are great, my girl is a big critic of mochi having lived in Japan for a year and she loved them!! Do your self a favor and stop by you won't be disappointed!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1cvi1nTcJSbIn4Ma5vydw"
  },
  "zgCVMCa9PYZ9Sf1tqwH4Tg": {
    "date": "9/4/2016",
    "text": "I love the freshness of the food And how clean it is . I totally recommend tail and fin for anyone who wants healthy clean delicious choice! Poke is on point . How can u go to Vegas and not eat there its a must !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rd3dJGiMVsYVF1uN3klQBA"
  },
  "IS9IX_mtWAtb7r-8L6bIRw": {
    "date": "10/25/2016",
    "text": "Little disappointed at the \"burrito\" concept.  The ingredients were fresh, tasty but in essence, you're devouring an uncut sushi roll.  Too much filler and a little on the pricey side.  Dinner for two will run you about $50.00 (with drinks and salad).  I went during their grand opening and the \"chefs\" were still piecing together the items using cheat sheets.  I could've done that at home.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zgP9fjWWD2UMVbiYOWIBQA"
  },
  "XDiex2Q6tKIocAUuzgfHow": {
    "date": "1/16/2017",
    "text": "Just moved into a house right up the street from Tail and Fin and this could be dangerous!! I absolutely love this sushi burrito shop. The restaurant is laid back and the staff is great! The signature creations burritos/bowls are so tasty (I recommend the flaming tuna... YUM!!) and are totally customizable to what you like.   The owner was in the last time I was there... what a great guy!! It is easy to see how proud and excited he is for this restaurant... it's always nice to see an owner that is present and eager to meet the customers.   10/10 would recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKazOMU_ca08COl2NAHC5Q"
  },
  "2oxn2S41F6dbZKKKnOY-bg": {
    "date": "2/26/2017",
    "text": "By far the best sushi burrito I have had. I tried The Crabby Bastard, a flavorful combination of soft shell crab, cucumber and just the right amount of crunch and sweetness with the addition of pomegranate. The quality of ingredients was great! I will be returning soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52OiLBrxtzB3ec_ZA2MJ2w"
  },
  "HvSwnno2GfCXQAV-ZZkNsA": {
    "date": "9/4/2016",
    "text": "WOW! I read the reviews and decided to try this out. This just opened. It is new and very clean. The staff was so helpful. I ordered the Angry Birds and I was impressed. The chicken was very flavorful. Everything was very fresh. What a great experience. I highly recommend it. Don't be fooled by the 1 stars reviews. They must be from competitors as this place is really knows what it takes for a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVZOGZGQUZCrrTDUlDotmg"
  },
  "myy7PBK_sDX9-54nRam0Dg": {
    "date": "9/4/2016",
    "text": "First time ever trying a sushi burrito..absolutely loved it!! Great taste and the freshest ingredients. Restaurant was very clean and staff friendly. I will definitely be back on my next visit to Vegas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zs3sF8aZE84nsqVXdiiWOQ"
  },
  "R4jIsBS_5ah3H5vTYAzfCQ": {
    "date": "4/5/2017",
    "text": "Amazing food! Creative and tasty. Used to be my favorite place, but now that they've opened the other location and hired new staff, you have to wait a decent amount of time to eat. If you have time, the food is well worth waiting for, just be prepared to be there for a while even if you're the only client there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IbuBl3TMMakZx-_8Kpqi4w"
  },
  "LnzeVb1nPe2zMaAE6g8XHg": {
    "date": "10/14/2016",
    "text": "I had been waiting for quite some time to give this place a try...definitely worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9xQ4yXdZEtYHvm5KwrjqOQ"
  },
  "QdB8IsVkDORtxQwaQX6_PA": {
    "date": "9/1/2016",
    "text": "Let's just say hello to my new favorite spot. The food was .com. The rice was cooked to perfection not too hard, mushy or grainy... But just right. The ingredients were fresh and amazing.  It's conveniently located next to 24hr fitness so I'll definitely be coming back here more often. This place is a must try. Health and tasty for the win!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "PXOj05hwEUK4hnS25Qaytg"
  },
  "_Xq2hFy91VS9zsufXPzzCA": {
    "date": "3/28/2017",
    "text": "The food is great. The three star waiting is just because of how ridiculously long it takes to make a burrito.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W05w5S1fzxRu3fSs9tAIaw"
  },
  "zA6lXZV0Yh4zNcwch6pQ1A": {
    "date": "3/1/2018",
    "text": "Always friendly, clean, and fast. My only real issue here is that they don't have cream cheese or spicy mayo as a sauce option. Their \"Mochi Pops\" are an extremely cute touch at making this specific location stand apart from others.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fOD0IW5P076KyYQwnNahVA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fOD0IW5P076KyYQwnNahVA/o.jpg"
      },
      {
        "img_id": "VRSZ7aWuyPjYJTO7N7sr4w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VRSZ7aWuyPjYJTO7N7sr4w/o.jpg"
      },
      {
        "img_id": "4tngg1K5PJKSXDawYLJaxw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4tngg1K5PJKSXDawYLJaxw/o.jpg"
      }
    ],
    "user_id": "XScMHiIKlX9PSmLeOIRsNA"
  },
  "nJc1hoJQ4SkI83rYhVM0Hg": {
    "date": "9/26/2017",
    "text": "I've been to Tail and Fin 3 or 4 times now and it is one of my fav sushi burrito places around town!! The staff are always extremely friendly and understanding of my allergies (can't eat shellfish so they wash knives and cutting boards real quick).   The restaurant itself is modern & trendy. It's very clean looking, which I've been to some that just don't feel that way.   Anyway, I always build my own bowl (usually half salad, half rice) with ahi tuna and a variety of veggies. They do charge extra for avocado, mango, pineapple, etc. Sometimes I've found myself wishing they had more variety of veggie toppings, but I also don't know what else I'd want. I avoid the creamy dressings, so I can't speak to those, but the other dressings are pretty tasty!   Overall, I love Tail and Fin! I'll definitely continue going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQxahO21JB6-C32lYgcHaQ"
  },
  "d2HT73JmltbrU7U50QR6pg": {
    "date": "8/27/2018",
    "text": "Brown rice undercooked. It was very hard and not easy to eat . This place used to be good  . How can you mess up rice?- def won't come back anymore",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aYxP1OtfMyYVkrNu4AYwdA"
  },
  "nXq_xWYL2-Z_kB0M5yrg_Q": {
    "date": "3/27/2018",
    "text": "So....kind of awkward when you walk in and get to witness a show...a GrubHub driver upset for (unknown/unidentifiable reasons) going at it with the owner - even the employee felt awkward and apologized.  That being said, that scene could have been handled so differently so that employees and customers didn't feel awkward or have to witness it.   Pros: -The two male employees and once the owner got back on track were very friendly.  -Serving portions were decent.  -Spicy tuna was flavorful and not too overly spicy.  -Spicy crab was really good too. -Fish tasted fresh.  -They bring out mocha after you're done eating so that it isn't melted if you chose the combo option and are dining in the restaurant.   Cons: -Both our sushi and brown rice were rock hard and cold.  (Biggest negative here) -Fish (salmon and tuna) wasn't mixed with poke sauce; just added on top so there wasn't much flavor to it.  -Cucumber was bland and oily tasting. -Avocado upcharge...we got 1/4 of avocado each so kind of disappointing.  -Salad was a little brown and wilted looking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FFWbDbfQUyW83n-i_SmXg"
  },
  "ESIhQpTttH-kPenG1rl4rg": {
    "date": "9/5/2018",
    "text": "I love this place. Everything is always fresh. Tee is the best girl ever. She is so fast and gives great customer service. I go eat there once a week because I love their bowls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "qQr4kwtGzOKZj__Qqa997Q"
  },
  "bTr45oIv3Q_G_4gk7gyKew": {
    "date": "6/19/2017",
    "text": "Up next on my quest to try all the sushi burritos in Vegas is Tail and Fin.  I got the Crabby Bastard.  I wasn't sure about the pomegranate seeds but ended up loving it.  Ingredients were fresh and worked well together.  They have much more than sushi burritos.  Like most other places you can get your burrito as a bowl or salad.  They also have those sushi tacos you see all over Instagram along with avocado bowls, ceviche and acai bowls.  They even have kids meals!  Love that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "N3zv_JiU9CW8cMH_myPpOA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N3zv_JiU9CW8cMH_myPpOA/o.jpg"
      },
      {
        "img_id": "CvI3OHinuRMj1sZEpTLESg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CvI3OHinuRMj1sZEpTLESg/o.jpg"
      }
    ],
    "user_id": "XXKjsdglgwSs9kWtK6ZWUQ"
  },
  "LrqPFvZc6k2Aj5XXONPz0Q": {
    "date": "2/3/2018",
    "text": "I knew I was in for a disappointment when the server pulled out a container of brown rice from the fridge. If you know anything about cooked rice, it's that rice will be come dry and hardened if it's refrigerated. How can you be serving refrigerated rice in a poke bowl? It was very unfortunate that I had to eat this food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f0TN5yZ7JBMKIzr3hSuwFQ"
  },
  "9AmCIVNPAwKDfquxCIn5ng": {
    "date": "10/2/2018",
    "text": "I have always heard about this place. We decided to try it after a couple of nights in Las Vegas. We liked it. The sushi tacos were good. I had the spicy tuna tacos. My wife got two different tacos. I would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKk_WUBi9ckkX_z1Jgovzw"
  },
  "CIkpfuupNtzNjEgd7QzS1Q": {
    "date": "5/20/2017",
    "text": "Stopped by this place on my way through Vegas, and it's definitely worth checking out! I got the salmon and tuna tacos and the fish tasted quite fresh. The tacos were on the small side, but they didn't skimp on the filling and for $6 for 2 it's not a bad deal if you're looking for a solid snack.   Everything is set up Subway/Chipotle style with all the fillings/toppings/condiments in front of you to choose...the only problem was that there were no labels. That would have been nice, since I had no idea what I was picking.   ADVICE: If you don't know what you want or what pairs well together (like me), I would recommend asking your server for suggestions. That's what I ended up doing and my tacos were bomb. Still have no idea what was in them, but they tasted good and that's all that matters, right?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HMTy9VoBfyHrO8TzId0Xvg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon and tuna tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HMTy9VoBfyHrO8TzId0Xvg/o.jpg"
      }
    ],
    "user_id": "Fe6KLb-3ud8Uzci_r4426Q"
  },
  "hpzgtvrQ-cfUC1zKomvHbA": {
    "date": "8/18/2018",
    "text": "Foods really good but apparently they close at 8pm now rather then 9pm...kinda annoying considering I would have ordered earlier and everything they have advertised says 9pm. I will not come here due to the timing, but they should change it so people don't waste their time driving from southern highlands for food only to find out they are not open.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CwYLTJU9eKbQOTlzYO9FdA"
  },
  "EI-aJ9gYOmoSPUjS3sjH_g": {
    "date": "4/18/2018",
    "text": "First time coming here I got the shrimp tempest in a pineapple bowl, the food is delicious and the staff is very friendly and a very simplistic design very laid back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cSGh_rahK791kQGGC_3U_A",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cSGh_rahK791kQGGC_3U_A/o.jpg"
      },
      {
        "img_id": "q8Y4bkmkJUOfKd54mKMduA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q8Y4bkmkJUOfKd54mKMduA/o.jpg"
      }
    ],
    "user_id": "oqqRF4INwM63GfW7P_Z1Yg"
  },
  "pGBkX7m3QmiR6n8b-OSboA": {
    "date": "3/23/2017",
    "text": "I got a regular sushi burrito with tuna, spicy tuna, crab, shrimp tempura, cucumber, seaweed salad, furikake, tempura crumbs, avocado, spicy mayo, eel sauce.   Overall it was really good. My only complaint was the placement of the protein and toppings on the burrito. It was placed so that I would get huge bites of crab, then once the crab was gone I would reach the next layer of protein. I would have preferred to have a little bit of everything in one bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e4ETIH8TsO-AKoFJ_vJkNw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e4ETIH8TsO-AKoFJ_vJkNw/o.jpg"
      },
      {
        "img_id": "9YOfSUWJuy5R28bBLL2WFQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9YOfSUWJuy5R28bBLL2WFQ/o.jpg"
      },
      {
        "img_id": "AMzWkg04RjuTc_jGDy4ODw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Protein: ahi tuna, spicy tuna, crab, shrimp tempura. Toppings: cucumber, seaweed salad, furikake, tempura flakes, avocado.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AMzWkg04RjuTc_jGDy4ODw/o.jpg"
      }
    ],
    "user_id": "GifQxLHtPlKjizmvICjjjw"
  },
  "a6AW7nb-380Cctedl4H6mQ": {
    "date": "1/13/2017",
    "text": "Went back for another sushi burrito and they hit it out of the park again. This time I saw everyone ordering their poke bowls with crunch. I added that and wow, game changer.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "prIFTPwnigVsWCqSKxGvNw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/prIFTPwnigVsWCqSKxGvNw/o.jpg"
      }
    ],
    "user_id": "mMK3y_QlUlneZmh9belgCA"
  },
  "0LtjIiJ6niT8tchVUvpWxg": {
    "date": "1/11/2018",
    "text": "Eeek! I'm so so sad and disappointed. I don't know what happened from the first time around BUT the quality just wasn't there for me this time.   I ordered the Stupid Good Tuna which comes with ahi tuna, surimi crab, romaine lettuce, cucumbers, tempura flakes,yuzu miso sauce and unagi sauce from their signature creations. I chose the sushi rice and it was mushy. It's probably because the container they put it in is plastic and the condensation makes it mushy, so it's not fresh. The ahi and crab was ok, the veggies didn't seem as fresh and I was not digging one of the sauces. The miso wasn't too bad had a little kick to it.   Overall, I don't think my $17 dollar meal was worth it, sadly. Quite pricey for a meal for one. What was I thinking? Solid Pass For me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QzPiZuxz0ALsUxjs2vNSpw"
  },
  "28JQ7424zGxl3w08d1u8CA": {
    "date": "5/21/2018",
    "text": "Closed 12 minutes early or even earlier. I got there at that time because stupid Apple maps took me in the wrong direction a couple times. Sad I won't come back here. Not worth it. Closing so early. Screw this place. You guys looked good.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SURCK1A8WEcBbmhl-gyJYA"
  },
  "Ipxyj9Xbdft1CryaKx9g4A": {
    "date": "8/20/2018",
    "text": "My brown rice was hard and cold and also the portion was small.   Not as fresh as other places.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_exlKyMUT1tRowFvGu7KMw"
  },
  "qfYHdzPrRNll2IlbMqiGsA": {
    "date": "11/1/2016",
    "text": "I hate poke bowls if they are NOT made in Hawaii.  There I said it.  Rant:  Poke is the dish.  It is more than just raw fish.  Don't be throwing raw salmon and tuna in a bowl, squirting aioli and eel sauce on it , tossing fresh cucumbers and heaven forbid, avocados on it and call it poke grrrr.  That said, I'm totally digging these sushi burritos and what's served at Tail and Fin is a step above.    The chef is from Nobu Vegas and the cut above flavors in the sauces, rice, and genius combination of ingredients shows it.  Yes, it's more expensive but definitely worth it (if you're into this \"stuff\").  Example of the creativity?  The \"Crabby Bastard\"; deep fried soft shell crab, imitation crab (stop calling it surimi another grrrrr), cucumber, tomato, avocado, kabayaki sauce and pomegranate that adds a burst of freshness and texture that cuts through the oily, richness.  The \"Shrimp Tempest\"; two large shrimp tempura, imitation crab, lettuce, green onion, avocado, kabayaki sauce and yamagobo whose earthy, vinegary taste adds complexity and clears any oily finish.  Brave enough to make your own combo roll?  Well chosen, un-daunting list of ingredients and sauces that all work together.  You don't need to worry about making a disaster.  Rolls are 90% filling, 10% rice so the flavors stand out.  Not into pressed rice and laver?  If you must get a \"poke\" bowl.  Friendly off Strip service.  You won't feel rushed if you stumble over your order as a first timer.  Simple and solid.",
    "rating": 4,
    "rated": {
      "funny": 19,
      "useful": 19,
      "cool": 20
    },
    "photos": [],
    "user_id": "oeAhRa8yFa9jtrhaHnOyxQ"
  },
  "IpeBT2CEyimBU2oVkG5FTw": {
    "date": "10/9/2016",
    "text": "This place is good. Just like the other poke places that opened up recently in last 6 months. Sorry but they are all the same to me, those 4 or 5 places, you know. (Oh, no no. I'm not including my Poke Express. They just relocated.) I had OG bowl. It was fresh and delicious. To me, it was more like \"chopped sashimi bowl with sauce\". If you are used to poke bowls in Hawaii, you would probably feel this way, too. Anyways, I enjoyed it very much :-) It was a perfect healthy lunch for me! As some said, I felt it's a little pricey side for the portion you get. (I'm used to Poke Express's price tho...) The staff were very friendly and super helpful.  I'm happy that place like this opened up close to my house (+1 star)!! I'll be back :-)",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 9,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "i6FLlaLe-AvpNzoRNaFTGg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. OG brown rice bowl (sauce on the side)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i6FLlaLe-AvpNzoRNaFTGg/o.jpg"
      },
      {
        "img_id": "TzJR0D-rmIGtpOoZgd0yPQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. My OG in process...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TzJR0D-rmIGtpOoZgd0yPQ/o.jpg"
      },
      {
        "img_id": "wdosWO2kkL-oeX415bffTg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Pay here",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wdosWO2kkL-oeX415bffTg/o.jpg"
      }
    ],
    "user_id": "RpLeX_kRHbrW5v5YH-R0nQ"
  },
  "UGhzpHoGZ609ZzAdki1X6Q": {
    "date": "9/24/2016",
    "text": "Talk about another solid Poke bowl and sushi burrito spot in Vegas. I am more of the Poke bowl guy then burrito style. So on my second visit made my own poke bowl style. I went with  tuna and spicy tuna. The portion size they go by scoops one or two scoops. Ironic cause for the most part all the Poke Bowls popping around Vegas the scoop is the universal measuring tool. LOL!! The toppings not much different from one Poke Bowl spot to another come notice. Some common items tomato, cucumbers, lettuce, edamame, avocado, seaweed salad, and can go on and on. They also are some toppings that make one place stand out from the other but it more about the sauce then the toppings separates one Poke Bowl spot from another. Tail and Fin Sushi Burrito and Poke has a nice selection. Too many that can not remember them all. I went with spicy mayo sauce for my bowl. I really liked it! It tasted more like sirachi aioli. It was the perfect compliment. The topping were all refreshing and fresh. Everything looked great when going down the line making your selections. It was very clean. The quality of the fish was solid.   The staff is awesome. The service nothing but five stars all around. The first visit came here to my second visit. Everyone staff member was friendly, positive vibes, answered any questions I had from my first visit talking burrito to my second poke bowl, and welcoming.  No doubt if am on the other side of town. In need for Poke Bowl fix coming back try more sauces and more Poke Bowl action.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "67dSZ0o7stlCNq_HEq-0rg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Poke Bowl....tuna, spicy tuna, cucumber, tomato, seaweed salad, lettuce, and spicy mayo sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/67dSZ0o7stlCNq_HEq-0rg/o.jpg"
      },
      {
        "img_id": "CR4UEOeJAXR2OvNb1WQReQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Yo Adrian",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CR4UEOeJAXR2OvNb1WQReQ/o.jpg"
      },
      {
        "img_id": "Z85LUH6FYarZaelfkG5w0A",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z85LUH6FYarZaelfkG5w0A/o.jpg"
      }
    ],
    "user_id": "iSC96O2NjQc3JExGUHQG0Q"
  },
  "1ige9h9UQ7PLqRTKjKgm8A": {
    "date": "10/21/2016",
    "text": "My first time trying this place! I had ordered off of Postmates, which is a fantastic delivery service. Anyways, I decided to make my own sushi burrito.  I got the sushi burrito with Japanese sushi rice, ahi tuna, spicy tuna and salmon with cucumbers, seaweed salad and furikake. The sauces were the wasabi one and the poke sauce, both very good!   I wish the sushi burrito was bigger, it falls apart easily as well, but it's still good.   I also had ordered the junior meal, the chicken teriyaki with the Japanese sushi rice. It was alright...the sushi rice doesn't mix well with it though.   Overall it's good, I will try it again though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CO-hrvV8pwxWufDqgtVrdw"
  },
  "G9pRcqtYb7DymybkSWaYeA": {
    "date": "9/8/2016",
    "text": "The Staff is extremely friendly and fun. I got the Stupid Good Tuna and it was amazing. Soooo Good. Nothing like Sushi in a Burrito #ILikeItRaw",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lT0qnK_9ZP2N_ACWTNMikA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Stupid Good Tuna Burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lT0qnK_9ZP2N_ACWTNMikA/o.jpg"
      }
    ],
    "user_id": "nPtg6wFLg-bGSYTG1mJRrw"
  },
  "wrUa-87RR6vNbkcT05WdEw": {
    "date": "3/23/2017",
    "text": "The burrito was really good but look at your receipt before you leave, they tryed to charge me $1.49 extra for something I never got. I got some edamame but tryed to charge me for masago. I went up for a refund and they tryed to give me massgo but I ate my burrito. After a few mins of demanding my money back they finally gave it to me",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCIxW0QNA8k4F04z-d-WKw"
  },
  "gVrfSbTbvVnDfRcfnHAPOA": {
    "date": "4/24/2017",
    "text": "This is a cool place -- fusion of Asian with Mexican cuisine. I ordered one of the specials (can't remember the name) and it was really good. The service was friendly and helpful.  Will try it again if I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXStquxGXbbOtTMvIrE02w"
  },
  "y6y8_bpCCm5g0V_Y9XVVkw": {
    "date": "11/16/2017",
    "text": "I ordered from this establishment through eat 24. I was initially impressed when I received a phone call from one of the employees stating that one of the items was unavailable and they suggested an alternative. I proceeded to pay online and had a verified pickup time of 5:20pm. As I arrived at the scheduled pick up time of 5:20pm, the food was not ready nor were they even busy to not have my order ready. The whole point was to pick and go, because I had a scheduled appointment. They proceeded to make my burrito, which they got wrong. They forgot about what we had spoken about earlier. So I waited 15 additional minutes for them to fix the order. In addition to this, the food is mediocre at best. I had the O.G which had day old rice and no seasoning. The burrito was dry and flavorless. My wife got the shrimp tempest, the shrimp was bland and just overall blah. There are plenty of other alternatives to this sushi burrito establishment. I suggest not to waste your time, money, or sushi burrito craving on this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_IFynPUA8W_onKmsxvmng"
  },
  "N0KgYlO_9y_kkS2YtwQ7jQ": {
    "date": "3/10/2017",
    "text": "I chose to make my own burrito. It was amazing. I couldn't of asked for anything more. Great service. Chris made me a great burrito. Especially since I don't eat anything raw and I like the soy paper. The shrimp tempura was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Y4AJLLuCfg_YlFVzVcS4g"
  },
  "_LQ0luEdUrtCFEKEi7aLsg": {
    "date": "12/15/2016",
    "text": "Enjoyed the The OG on my first visit,would like to see nutritional info added to menu. Employees very attentive and Friendly- will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TRJUhNa3YS3ZP8vq8EGJmw"
  },
  "bZPZBugBNhHsJHX91g-CdQ": {
    "date": "9/11/2016",
    "text": "I wanted to like this place, I really did.  Pros: - It is conveniently located across 24-Hour Fitness in the Albertson's plaza on Maryland - The staff was friendly and attentive - The raw vegetables (my bowl had red onion, cilantro, and cucumbers) tasted fresh  Cons: - The seafood in my bowl didn't taste fresh and had an unusual texture (probably a good idea to get some after-meal Pepto-Bismol if you decide to ignore my review and go here anyways) - The bowl was drenched in sauce that was extremely salty - The seaweed salad was really low quality, another issue with its texture and it being abnormally slimy even for seaweed salad. If you read the ingredients you find out it has a bunch of additives like corn syrup and hydrolyzed veggie protein - The green tea mochi was good... initially, then I was surprised by the aftertaste of rubber glove (probably mishandled at some point by one of the servers) - The tables are awkwardly low. I'm 5'3 and I had to hunch over to be in a comfortable position to eat my food - The structure of the restaurant just doesn't make sense- the dining side is cramped while the section you're supposed to wait in line is way too wide, so wide that it's not functional and it was hard to figure out where the line actually started - The \"vibe\" in the restaurant could use a lot of improvement- white walls, no decor, cheap interior materials and furniture all topped with \"ambient\" (trying way too hard) loud house music  I'm guessing this place has a high-star rating because of all the nightlife industry people that get comped by the owner (who's partner is an Omnia promoter)  Side note: I'm giggling at the first image posted here where there are people all texting at the table. (Say hello to the promoters that were comped and asked to write a five-star review for this less than mediocre place.) It's obviously staged.  Tip: Drive about a mile from this place to get the good stuff at Island Sushi's Poke Express.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "rsYlXrd3IvPdzir6XOhkJA"
  },
  "jogtMRktks6CqeT8_BBVWQ": {
    "date": "2/22/2018",
    "text": "Unbelievably great food.  Crazy good.  Just found my favorite sushi spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1jutK9k0mrJ2EqE0zBjvQ"
  },
  "uEtWtLRTGeDqeJ6n9qhClg": {
    "date": "5/2/2017",
    "text": "Absolutely amazing!!!!!! Food is great; what a great concept. The quality seemed to me to be as good as the expensive sushi restaurants. While there prices reasonable and there portions are on point a good size, they also are excellent quality. I would have taken a picture of my food but I just couldn't stop myself from eating it long enough to take a pic. Soooooo good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpyjsCx_O4x_kMJPnp4I5w"
  },
  "LFa7e-SXBmGioA5ynPn2YQ": {
    "date": "10/16/2016",
    "text": "So the whole concept to me is weird. I like sushi and I like Mexican but together, no. At least that's what I though. So it actually has nothing to do with Mexican food at all. It is just high quality sushi. It is not your typical sushi bar but rather a nice little place to grab a quick delicious bite to eat. We were kinda skeptical so we ordered a regular build our own roll and for the kids a teriyaki bowl. We got a roll with soft shell crab and shrimp. Absolutely fantastic. The kids bowl was chicken teriyaki wth sushi rice. Theirs was also amazing. Bottom line is definitely worth a try. Ingredients are super fresh and delicious.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GAU36dtwF5VN1YNGC58frQ"
  },
  "q0446XETWAM3Ux0p_GpW_g": {
    "date": "6/17/2017",
    "text": "I drove past this gem one day and decided to stop by. I walked in not knowing what to expect, luckily the staff was able to help me make a decision! I ended up creating my own sushi burrito. Spicy tuna, shrimp tempura, sea weed salad, tempura crunch, spicy garlic aioli and ponzu. This was amazing! The best thing I've ate all week! I'm definitely coming back   2/14/17.. I ordered pick up through Eats24 scheduled my pick up time to be 7:15pm. I arrived at 7:17pm.. wasn't greeted by any staff members, finally was greet by a rude cashier saying my order wasn't ready and it just came through. Watching orders being made I saw one staff member repeatedly pull up his pants and touch the food he was making with the same pair of gloves! I was super disappointed! It's now 7:30 and I just received my order. I come home and the wrapper is drenched in aioli sauce that I ordered on my sushi burrito, it was falling apart. Barely able to eat it. I've ordered here 10 plus times and never received the service I had today. I quite disappointed cause I really like this place. I hope they resolve these issues with scheduled to gos and other orders.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7KApOtTheVzLRvLgbphHA"
  },
  "yrwuG40IA-vSelqSAKfYDA": {
    "date": "9/5/2016",
    "text": "Great new spot! Had the Crabby Bastard and it was perfection. Definitely going to come back. Food was delicious and service was fast and friendly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "A3719sp1feNIJ073MUWhVg"
  },
  "Tta9hy4X95TIdv7qeJS1Ww": {
    "date": "9/16/2016",
    "text": "Ok ok I'll admit it... I'm impressed! Found this gem on yelp and am so happy about it! Opted for the OG bowl. So much flavor and such good portions! The staff is friendly and welcoming, I look forward to coming back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LKP0Yq9T7Ss6oiDZnVtQwQ"
  },
  "okU5TZeTXGqeuSDYAmfKoA": {
    "date": "9/3/2016",
    "text": "Disappointing! I wouldn't call this measly meal a burrito by any means. I've had bigger hand rolls. The portions are so tiny - the \"burrito\" barely had anything in it! If you want to add avocado, it's $2 for a quarter of a whole! And they have the nerve to be so expensive? No thanks. The staff were unprepared and slow. Not to mention, the cashier dropped the tablet on my friends hand as she was paying. Hot mess!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6ij443jJsqE0oMPzyX8gQ"
  },
  "6m7ykig42XkWWoajtRC5UA": {
    "date": "1/20/2018",
    "text": "This is my favorite lunch spot. The crew is always very friendly and helpful even when I take longer then I should to order. I don't like picking favorites but Dom always makes the best bowls!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n6iNVT4pRXDk8xsLc-8Fkg"
  },
  "iQOD2GFSrfaUbXGY-uNaYQ": {
    "date": "4/16/2017",
    "text": "I am seriously the BIGGEST fan of this place. NO kidding.... I could eat lunch and dinner here through out the week if I could. AND they have a member program that you can rack up points on and get a free bowl!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvWEQF54gRds2D2iGR94Cg"
  },
  "BIpC84MTrvfQ8ggxfenUcA": {
    "date": "8/31/2016",
    "text": "Brand new sushi spot in Las Vegas and it is a must try. Not the typical sit down restaurant, more like fast food style, but definitely has places to sit. I had the build your own burrito and was very happy with my choice. I was impressed with the amount of protien given vs the price point. The fish was high quality and tasty for sure. Staff was very friendly and inviting from start to finish. I will be coming back when I want to grab a sushi burrito on the go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9SkCxhSPFVr28xkPXFAPCA"
  },
  "ufh3bswXmC0fyAyyx-4f6A": {
    "date": "10/13/2016",
    "text": "Yes, yes, & yes.  So happy we have something like this now. This place is absolutely delicious. I was raised on steak & potatoes so fish is a very new thing for me. I am huge on textures & I've had fish before that has something funny or stringy in it, when that happens I literally have to focus on holding back gags. This food is absolutely amazing. My boyfriend & I did build your own burritos with soy paper & they didn't even last long enough for us to snap a picture. We will become regular here for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EI7U-iM4Y5d7B8Z1iabn7w"
  },
  "EtKpt3qyjpY1GC6jCXHvWw": {
    "date": "11/10/2016",
    "text": "Loved it all! Please try this place. Its a fresh & unique approach to raw fish. Employees were all super friendly & helpful. Crabby Bastard burrito with a couple modifications for my taste made it perfectly delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tzXEEtIeUIMNvZ5-n63mfA"
  },
  "nOoGf3rl5RO0oS6EPuTiig": {
    "date": "12/22/2016",
    "text": "Fish is always super fresh plus service is really friendly and fast! Never disappoints. Great spot to grab lunch. I really like how they offer bowls, salads and burritos-regular or large! Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPljm95fiQQ1TeZ-uskJKg"
  },
  "JKNVv60lkl379yislTCtPg": {
    "date": "6/14/2018",
    "text": "Soooo good !!!! Didn't know exactly what to add to my burrito and the employee making it definitely helped me out and it was soo tasty !! Def recommend this place if you love sushi . also our twins loved the mochi, so good!    Instagram- @wykes_twins",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fiG9tb36-8xxoyqeGyNtwg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fiG9tb36-8xxoyqeGyNtwg/o.jpg"
      },
      {
        "img_id": "cHixL0n-xst0m6XVCe5mOw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cHixL0n-xst0m6XVCe5mOw/o.jpg"
      },
      {
        "img_id": "jyY7T30UQPjuEjzAdxD8ug",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jyY7T30UQPjuEjzAdxD8ug/o.jpg"
      }
    ],
    "user_id": "nRdDCaTDxCm_UEL3LQIgRw"
  },
  "FRImBY23htOaG0B8wcqyvA": {
    "date": "7/5/2018",
    "text": "Stopped in for lunch before setting out to Fremont. Wasn't sure what to expect since each poke spot is different in their own way. Luckily they had a pretty big selection of pre made burritos and bowls. We could add additional items that we wanted or make adjustments to the ingredients.  I went with their stupid good tuna: ahi tuna, spicy or regular crab, lettuce, tomato, onion, cucumber, tempura flakes, yuzu miso and unagi sauce. I got with with soy paper and brown rice. They even asked if I wanted to additional fillings for no charge. The burrito was already busting at the seams but I added on more. It was messy to eat but the flavors were really good. The sauces were good and not too salty or overpowering. The fish was fresh and cut into nice chunks. Seriously these ladies did not skimp they loaded us up. BF got the OG burrito with sushi rice and seaweed wrap. His was stuffed to the brim too! OG: ahi tuna, yellow tail, salmon, lettuce,green onion, poke sauce, and cucumber.   Overall service and food was great. We got two huge stuffed burritos. Got our money's worth for sure. The shop is well kept and clean. Keeping this spot bookmarked for the next Vegas trip.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "m6g_qfFYb8a0umQ3nlYH9g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Stupid good tuna with spicy crab meat burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m6g_qfFYb8a0umQ3nlYH9g/o.jpg"
      },
      {
        "img_id": "XuMyZBKFN-CTwuzfaIq3mw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The OG burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XuMyZBKFN-CTwuzfaIq3mw/o.jpg"
      },
      {
        "img_id": "gOlnyFImKDCH23VJgFcIQA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. How they roll your sushi burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gOlnyFImKDCH23VJgFcIQA/o.jpg"
      }
    ],
    "user_id": "RfXmL2DsYE3oAeyiWdQ0iQ"
  },
  "Ck3Rq1skOuI3YzFht1fE1w": {
    "date": "6/7/2018",
    "text": "This is the closest poke bowl/sushi burrito restaurant near me. I've been here 3 times now and thought I'd finally write a review.  I ordered the poke bowl with sushi rice, spicy ahi tuna, crab, seaweed salad, and spicy mayo sauce! Everything tasted good except the rice was a bit hard. The last couple of visits I've noticed that the rice is always like that.   I've been to other poke bowl restaurants similar to this and I can say that nothing really sets them apart. I've noticed that I pay almost the same price (maybe even less?) at SOHO Sushi Burrito and they fill the entire bowl so that I get my money's worth. The portions here seem a bit small for the price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4RdWyZSTs3_YiazneM3s5w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4RdWyZSTs3_YiazneM3s5w/o.jpg"
      },
      {
        "img_id": "uPFi8hF0FE_OyUQ6n7EIuw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uPFi8hF0FE_OyUQ6n7EIuw/o.jpg"
      }
    ],
    "user_id": "iXMMo0nHX-hI5LVQ8z3JBQ"
  },
  "BFFly5JPFGKXyPpd8EqPmQ": {
    "date": "7/13/2017",
    "text": "I continue to see this amazing looking pineapple poke bowl on my feeds. I didn't realize it was from here, in Las Vegas. Looked it up, and it was not too far from me.  I'm very particular with my poke. I realized after all these poke bars that has opened up everywhere that I'm more of a traditional Hawaiian poke kind of girl. Honestly, the only poke shop I fux with in Vegas is Poke Express on Stephanie in Henderson. I mostly have had bad experience at these create your own, overly topped style poke spots.  Tail and Fin has similar concept to those poke shops that have been trending. From poke bowls with endless topping, to sushi burritos.   A couple distinction stands out here though. They also have sushi tacos and the pineapple bowls. The best distinction I can say about this place compared to its similar shops, the fish taste fresh. I had the salmon, ahi, and spicy tuna for my $9.95 build your own + $2 for pineapple bowl + $1.50 for masago. The fish were perfectly cubed. Not too big of cuts like other places. The pineapple bowl gives the whole bowl a refreshing level of extra freshness.    Although I enjoyed my meal here, it didn't quite make it my #1 poke spot. However, I will return when I'm down to my 2nd option whenever I'm craving poke.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "D2sVpPtIaFaau2gsViTBHQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D2sVpPtIaFaau2gsViTBHQ/o.jpg"
      },
      {
        "img_id": "9nI3v_b4JPmJ9Fw_2t5oSA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9nI3v_b4JPmJ9Fw_2t5oSA/o.jpg"
      }
    ],
    "user_id": "LgFDWZTLi1w9OGi5BtKORg"
  },
  "_N1gbTAjhNKbSO7lLZC_jQ": {
    "date": "7/11/2017",
    "text": "I saw the Tail & Fin Sushi Taco's on Yelp, then tried it the very next day on my lunch break. Coming from the strip, this was a bit of a drive to this location, not sure Summerlin would've been any closer but it was bomb.   They had unfortunately run out of salmon, I'm guessing this place gets busy..figured it might be a good sign. I got the little left with a spicy tuna, and ahi tuna tacos with the chili garlic aioli, wasabi aioli sauces, I also got the Avocado Boat with yellowtail and the yuzu miso sauce. It was a good ripe avocado and has lettuce and spinach which were just the right amount like a mini salad bowl. The person who took my order was super friendly, and nice enough to offer to take my tray when I was done.  I particularly like you get to choose from a variety of delicious sauces! I also like that with the smaller options this place offers, I can try more fish options. If only they were closer to me, but I could see them opening up even more locations in the future. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wR-u4YE1StHtRnDnvCvZ5w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. second time.. within the same week it&amp;#39;s THAT good. also tried the spicy sea weed salad, rare find.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wR-u4YE1StHtRnDnvCvZ5w/o.jpg"
      },
      {
        "img_id": "nQCJ2SjS-RFTBugJ5GyvRg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. first time, salmon, and tuna sushi tacos, avocado bowl with yellowtail.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nQCJ2SjS-RFTBugJ5GyvRg/o.jpg"
      }
    ],
    "user_id": "NcUMNz6tAahD6mDmuKwYIA"
  },
  "bnZ84AHYVbieF7kgpCxP8Q": {
    "date": "7/29/2017",
    "text": "4 stars for presentation! Okay maybe not just presentation, but I would like to say that they do construct a beautiful looking poke bowl.   I got the Pineapple Express. I wanted something different and I thought the pineapple would add a nice contrast to the bowl. Now, I didn't love the bowl but I won't blame them for that, it was probably because I didn't love the pineapple so that's my fault for the choice.  When my friends and I came they ran out of salmon. Unfortunately my friend ordered a sushi burrito with tuna and salmon. They added some extra tuna and then more salmon came out! The guy was nice enough to also add salmon because my friend really wanted it.  The service was friendly and very patient. It took us awhile to order but we didn't feel rushed by them. I'll definitely be back to try something else!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yY52s7_5-mSXULScC8KFrA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Pineapple Express with added edamame, unagi sauce, and seaweed salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yY52s7_5-mSXULScC8KFrA/o.jpg"
      }
    ],
    "user_id": "ERcsc0YO5CCUbkC8EV2INg"
  },
  "mAoTxPjn_3-Ln_Jp0Q03Sw": {
    "date": "6/13/2017",
    "text": "My go to for poke bowls.  Usually a 5 but today I was a little irritated.  I ordered a large bowl and got it in a different bowl than normal.  But watever.  Ask him to mix the fish with the sauce.  He just swishes the fish around in the sauce like really.  And he gave such little seaweed and little edamame.  Like really.    My usual at the top and what I got this time was way smaller.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5CI5jiD-YO8HWuPj4KwoYQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5CI5jiD-YO8HWuPj4KwoYQ/o.jpg"
      },
      {
        "img_id": "ZAFPEcyIsbUZmLr_It20rg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZAFPEcyIsbUZmLr_It20rg/o.jpg"
      }
    ],
    "user_id": "iF5FuC-6n618DMkg1PaXkQ"
  },
  "M68C5e-U-d0io9fG__D5tQ": {
    "date": "8/16/2017",
    "text": "Since I'm vegetarian I only really eat imitation crab which I'm glad they had and so far so good. The burrito was big. $13- they add avocado for $1.50. They charge extra for tomago as well. I like this location because it's right next to the gym I go to and it's really fast and convenient. I will eat here again. I would give 5 stars if it was a better price or didn't charge extra for things that normally come in sushi.   So I came back and I tried it again and they made the mistake of making my sushi burritos large but they didn't charge me for it. They didn't charge me extra for any of the extras either. I know that's just by chance but I'll have to give it five stars for this. The food the second time around was equally as good. My fiance loved it. I was really full 3/4 of the way through it. I also got a dollar off with the loyalty program they have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Bs1BZcD6_wo_sUiAGe7FA"
  },
  "99uV4GF6vEDmhzqkJuWzCQ": {
    "date": "1/10/2019",
    "text": "It's closed, tried to go 1/10/19 for lunch and sign on door saying it's closed for remodeling, no other info posted. Would be nice if they updated their website before hand.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vcg-DRliuCjYFdiEAuhamw"
  },
  "fYUpcCEgzM-ymog1xMYknQ": {
    "date": "7/28/2017",
    "text": "My bf and arrived when they opened on a Friday and they were still setting up. Though they were slow, the staff was helpful and nice.   The food is fresh and good. I went with the sushi burrito and my bf got the sushi tacos. The tacos are messy but he said they tasted good. The sushi burrito was good...it's just a giant sushi roll lol We didn't get the chance to try their poke bowls but you have the option to build your own bowl or choose their combinations on the menu. I wouldn't mind going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FJVG28RN25fE2xbpot0I5A",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Sushi burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FJVG28RN25fE2xbpot0I5A/o.jpg"
      },
      {
        "img_id": "8fSCGG0h_aED3JN2-S5V6w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Sushi Tacos and sushi burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8fSCGG0h_aED3JN2-S5V6w/o.jpg"
      }
    ],
    "user_id": "hbM_DrKp8QoI86-WIQZX3w"
  },
  "Dcjm2oMgB4k6d_HxCgjMrw": {
    "date": "8/9/2018",
    "text": "Service was excellent and I was greeted upon arrival!!  Seaweed salad is delish and the employees were super!! I'll be back for sure to try the burrito next!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LDtUo8-uDHxL-ELDropgHQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Yummy lunch/dinner!! The portion for the large was 2 meals for me.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LDtUo8-uDHxL-ELDropgHQ/o.jpg"
      }
    ],
    "user_id": "U8FRbLM803Nz8uZs5qTGcQ"
  },
  "wMtNtaAuY9lHohR_KPIR_g": {
    "date": "1/20/2017",
    "text": "DELICIOUS. I'm a huge fan. Ordered takeout twice and I'll definitely be back for more. I created my own bowl and I love that you can add whatever you want with ease and creativity. I have so many food sensitivities that places like this make my life so much easier.  Highly recommend the yellow tail. The first time I ordered it on the avocado for my bf and I to split as an appetizer. We were both a little sad that I didn't order more of it. lol The soft shell crab is breaded and/or deep fried or something - it's good but I forgot that's how it is prepared and accidentally ordered it a second time. it's good but not my favorite. The ingredients are fresh and plentiful.   Last time I ordered they did forgot my togo sauce. I was super bummed when I opened my bag, but honestly the yellowtail is so delicious combined with the seaweed and it was good enough without it. But note to self - confirm order before I leave :)   The bf does not recommend seaweed on the CYO burrito - he said it makes it so hard to eat. :)",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "Ad-v2Z4vvuzxZxbpywIm0A"
  },
  "bGDoX02k9y3bszOPpFzgFQ": {
    "date": "9/20/2018",
    "text": "Food was sooo good and fresh . I would definitely visit this place again. The cashier was friendly and very patient with me as this was my first time here. If you love poke you will love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LQetXFwYoLQeUV5wqO3PTA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LQetXFwYoLQeUV5wqO3PTA/o.jpg"
      }
    ],
    "user_id": "vLP5c_3x7B1PuAe8jUwNDA"
  },
  "RKbuIDd725Lsz9x_8Uaa5g": {
    "date": "12/13/2016",
    "text": "The poke bowl and sushi burrito trend is crazy popular in Vegas- but Tail & Fin is one of the strongest contenders.  Sure, they've got friendly service, clever menu names (like the Crabby Bastard), and fresh fish like all the others. But they've also got a ridiculous attention to detail, a stellar sauce program, visible and involved ownership, and an adaptability that'll keep them in business even after the trend dies down- menu items like avocado boats (to bring in the low carbers), mochi pops (simple but fun), and sushi tacos (all over social media) make them more than just another sushi burrito place.   Keep an eye out for a Summerlin location opening soon!",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 18,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "zX6F5Mg9F525mIViJxzwEA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Mochi dessert",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zX6F5Mg9F525mIViJxzwEA/o.jpg"
      },
      {
        "img_id": "k9wQAlVd84FReq6SCU7tEQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Logo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k9wQAlVd84FReq6SCU7tEQ/o.jpg"
      },
      {
        "img_id": "pWzx70qnbGj0tu3IEwRHyw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Avocado boat with ahi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pWzx70qnbGj0tu3IEwRHyw/o.jpg"
      }
    ],
    "user_id": "bLbSNkLggFnqwNNzzq-Ijw"
  },
  "LJ3JDThBmOhFZnFTYis2Jw": {
    "date": "12/10/2016",
    "text": "So hubby and I actually tried this place only a few hours after our first sushiburrito experience. So we couldn't help but compare. This place came in second due to to two things for me:  1. The burritos created were just a little less exciting and delicious in comparison. For example, the only non-fish options were chicken or veggies. No beef? No egg? Sad face.   2. No side dishes I could get excited about. I'm just not interested in wasabi peas.   However, sushiburritos are always awesome and this is a fine place to come. Especially considering that the service was super friendly and accomadating.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "D7GWQKJ7k2djCBAQaHpMDw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D7GWQKJ7k2djCBAQaHpMDw/o.jpg"
      },
      {
        "img_id": "XHVQ1PpbCb11_AAwxY5mzQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Angry Bird",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XHVQ1PpbCb11_AAwxY5mzQ/o.jpg"
      }
    ],
    "user_id": "zQTEbn5nWGPypxOf2uRPmg"
  },
  "tFTl3pmBkZn60-lvNUA6rQ": {
    "date": "11/9/2016",
    "text": "Another just OK sushi burrito / poke place. My first visit would have earned a 4 stars, but the flaws that I thought would pass were still present at my last visit. I cannot look past the ridiculous amount of time it takes to make a sushi burrito. It was forgivable the first time because they just opened, but now it is not. Please get another staff member to help with workflow.   Items tried: Shrimp tempest (shrimp tempura/surimi crab) burrito Stupid good tuna (ahi tuna/surimi crab) burrito The Omega (salmon/surimi crab) bowl  The shrimp tempest is one of the better cooked sushi burritos I've had. Overall, it's not big on flavor, which is not a bad thing for this burrito. I feel like it needed more than just unagi sauce though. I did like the sushi rice, which was done well.  I did not enjoy the stupid good tuna. The mushy ahi was flavorless. It was hard to get one bite with all components of the burrito. The way my burrito was made, I had to endure many bites of plain mushy ahi. Instead, the veggies had all the sauce.   The Omega was tasty! I really liked the ponzu and the salmon was fresh. Having it as a bowl allowed me to make sure all the flavors get mixed together.   A word of advice: I've seen other poke places mix the raw fish in a bowl of sauce or seasoning before adding it to the burrito.   With so much competition out there now, it's hard to say that I'll be back until I try other places to see how they compare.   *****Yelp 2016 100 Challenge***** 60/100",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "JE1RnfesSWl-6AJuNVzOvA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Stupid good tuna sushi burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JE1RnfesSWl-6AJuNVzOvA/o.jpg"
      },
      {
        "img_id": "NAMvtREJCSQEIrm25e0xGg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The omega. Salmon &amp;amp; surimi crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NAMvtREJCSQEIrm25e0xGg/o.jpg"
      },
      {
        "img_id": "tiq-ia4_UVOiMfTD2K6gdQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Shrimp tempest - surimi crab &amp;amp; shrimp tempura. No raw fish.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tiq-ia4_UVOiMfTD2K6gdQ/o.jpg"
      }
    ],
    "user_id": "OPJ0TW8tt5UanY2_YpCgIQ"
  },
  "ELcEMF3Aeib8noOs6lN6Iw": {
    "date": "11/9/2016",
    "text": "Tried this place for the first time and it's so good. I ordered the shrimp tempest bowl and substituted the avocado for mango and added garlic chili aioli. My boyfriend ordered the stupid good tuna burrito and he loved it.   When we walked in the staff welcomed us and went over the menu with us. The food is super fresh and the service is great. Give this place a try if you're looking for something fresh and good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "KMPd1vdvLhTGdA8aOSPUiA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Shrimp tempest bowl sub mango for avocado and added chili garlic aioli",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KMPd1vdvLhTGdA8aOSPUiA/o.jpg"
      }
    ],
    "user_id": "miClbIxZOkKbOhNmbCetSA"
  },
  "GTjc3LI9kUVy-K5ifeuzBg": {
    "date": "9/4/2016",
    "text": "Although they had a shaky start, this newest sushi burrito and poke spot in town won me over on the second visit.  Tail & Fin is the latest attempt to capitalize on the trend of poke bowls and sushi burritos. Given that it's headed by a former Nobu executive chef, I expected great things. The interior design looks the part - modern and clean, although the loud music tries a little too hard to be like the Bacchanal Buffet.  Like the other places, you can choose from a predesigned menu of dishes or build your own entree as you walk down the assembly line. Whichever the case may be, you'll be able to make the creation a sushi burrito (choice of seaweed or soy paper), poke bowl (sushi rice or brown rice), or salad (mixed greens or Romaine lettuce).  If building your own, you'll go down the line and pick your proteins (two for a regular portion, three for a large size, +$2 for additional) between ahi, spicy tuna, surimi, salmon, tempura shrimp, soft shell crab, yellowtail, grilled chicken, and tempeh. Then you get to add veggies and other toppings, including some premium options if you so desire (+$1.49). Finally, you can pick from a variety of nine sauces - more on these near the end of this review.  The first time I stopped by was in their first hour of their grand opening. I made some picks from the \"signature creations\" menu to see what was up.  Crabby Bastard sushi burrito ($11.95 for a large): soft shell crab, surimi, cucumber, tomato, furikake, pomegranate seeds, avocado, unagi sauce. It was a pretty good sushi burrito in all regards, but didn't distinguish itself in flavor or quality from other sushi burritos that I've had. No complaints about the pricing, which seems par for the course and provides a good lunch portion (let's be honest, you're not going to do AYCE lunch if it's to-go or your time is short).  The OG poke bowl ($9.95 for regular, confusing in that it says $12.95 on the menu): ahi, salmon, yellowtail, Romaine, green onion, poke sauce, cucumber. I actually skipped the Romaine this time since I figured that it wouldn't add much aside from texture. The poke sauce was awesome, and although the employee couldn't really explain the ingredients to me, it seems like sesame oil, teriyaki or some other sweet sauce, and wasabi. The fish were all tasty if not too high in quality (Soulfish had awesome cubes of ahi) and the green onion and cucumber were nice.  There was a significant issue with the sushi rice in my bowl though: most of my bites had hard grains of rice. My coworker noted the same in her order. A chef with the pedigree of Nobu should not be putting out something with flaws in a fundamental part of sushi.  Thinking that this was a fluke, I returned with friends to give them a second try. I built my own poke bowl this time. The sushi rice was better today, with no hard grains at all. The salmon and yellowtail were both good, but I still wish that they wouldn't cut up the fish so finely. I went with a majority of the toppings possible today, and the standouts were the seaweed salad, red and green onions, and furikake. These were fresh, alone with Romaine, cucumber, tomato, and cilantro. I disliked the tempura flakes because they seemed like more of a puffy cereal type of thing than what you'd find on the outside of tempura fried goodies.  As promised, a discussion of the sauces I know this goes against traditional sushi thinking, but we're talking about glorified handheld rolls anyway, so let's embrace sauces. They're the real star of Tail & Fin from what I've had. I'd already enjoyed the poke sauce, and I was able to try three more on the side today. The yuzu miso was the best, with a citrus kick that's hard to find elsewhere on the menu. The chili garlic aioli is pretty much their version of spicy mayo, and it fills the role capably. Last but not least, the honey sesame aioli is a sweet thick sauce that reminded me of what you'd get on my childhood favorite walnut shrimp dish.  That said, they've been a little stingy with the sauce in general. If you ask for multiple sauces on the side, they tend to fill the plastic sauce containers halfway at most. If they could get it to 2/3 at least and are cool with providing extra sauce for sushi burritos (my Shrimp Tempest today could've used more sauce), then I'll definitely have an enjoyable third visit and more.  Judging mainly from my meal today, Tail & Fin is a fairly successful foray into the poke bowl and sushi burrito space, with fresh toppings and excellent sauces carrying the load of a menu that's otherwise fairly indistinguishable from its competitors. I can't say yet whether it's worth driving across town without giving all of the other places a try, so stay tuned.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 17,
      "cool": 15
    },
    "photos": [
      {
        "img_id": "yjQy-f2MqRTTV1hUIsfGjw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Built my own regular poke bowl ($9.95) with sushi rice, salmon, yellowtail, several toppings, and sauces on the side.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yjQy-f2MqRTTV1hUIsfGjw/o.jpg"
      },
      {
        "img_id": "GbgkUjYyPcMuilFgNOaK-g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Crabby Bastard sushi burrito ($11.95 for a large): soft shell crab, surimi, cucumber, tomato, furikake, pomegranate, avocado, unagi sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GbgkUjYyPcMuilFgNOaK-g/o.jpg"
      },
      {
        "img_id": "ANvOg5RSm1aTLAMbcpP9zA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The O.G. ($9.95 for regular size), but without Romaine and with sauce on the side. The default poke sauce is great, so don&amp;#39;t skip it!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ANvOg5RSm1aTLAMbcpP9zA/o.jpg"
      }
    ],
    "user_id": "_VMGbmIeK71rQGwOBWt_Kg"
  },
  "t1wNMVEf8ulnab4QKdPkfw": {
    "date": "9/5/2016",
    "text": "A sushi burrito place on my side of town? oh yes! and they offer poke bowl options too? oh yes yes yes! but a second time back? no no no!  Sushi burrito to me is slowly losing it's excitement i mean I still think it's an uncut sushi roll and we've had jaburrito/soho around to establish their dominance as the sushi burrito spot, nonetheless sushi burritos are still tasty.   Setting: Interesting how lots of sushi derivatives are forming around gyms (poke express/eos, tail&fin/24 hour). The restaurant size is normal, maybe a little bit bigger than the old soho location. Interior is clean with plenty of places to sit.   First impressions: I noticed a lot of people who look like they worked at a night club, shaking hands with the owner, and taking selfies all over the restaurant. I asked the worker if she noticed the same thing and told me that the partner is an omnia promoter so go figure lol which coincide with a lot of positive reviews on this place but hey that's expected.   Food: The burrito is small compared to the likes of it's predecessors. I got the crabby bastard which was nice but not mind blowing. The crispiness of the crab was good and the pomegranate seeds added a nice sweet accent.   Overall: Convenience of course is great but I wouldn't mind driving a few extra miles for food that is more substantial and tasty. Nobu executive chef turned sushi burrito chef? hmm... doesn't make sense to me.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 15,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "np2DfMUCIe5oO9aZHwz7Kw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Crabby bastards. Seems smaller than jaburritos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/np2DfMUCIe5oO9aZHwz7Kw/o.jpg"
      },
      {
        "img_id": "QqEEA2D6GEqLLYziZvqNAQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QqEEA2D6GEqLLYziZvqNAQ/o.jpg"
      }
    ],
    "user_id": "lXZ7aziyUJyA6V0FlIR1Wg"
  },
  "BfEyPhQZMgnH2-9akLlURA": {
    "date": "8/13/2018",
    "text": "Heard about this place on Facebook and wanted to see what the hype was. SO DELICIOUS. I was helped by Tee and Joseph. They were so nice, helpful, and knowledgeable. No matter if I live in Cali or not, I will definitely be back!(:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mpaX6ah85Jiq1BtLSeN8rQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. $10 for all of this!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mpaX6ah85Jiq1BtLSeN8rQ/o.jpg"
      }
    ],
    "user_id": "ZGF-iZFeGdmXfy6c2MPm0Q"
  },
  "M0cZaJ-uz4tigtEBBoc_Lg": {
    "date": "6/25/2017",
    "text": "Best poke place ! Me and my sister always come here and everyone is really nice and doesn't mine giving us advice on what is good. The food is amazing and has so many flavors!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eqd76yC6TSNJjvy0BCxVFg"
  },
  "z_VrEvEXB2Iu7FURBsfRmQ": {
    "date": "9/26/2016",
    "text": "Not fresh. Lacking flavor. Dirty when we went in.  Way better off going to Sushi Burrito or To See Roll !!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2zv4vgkJqMyBTADRmDeoQ"
  },
  "zHwqxQlDfA8sOYaq-3d91g": {
    "date": "12/6/2016",
    "text": "Not a fan of the food. Tried both the regular and spicy tuna sushirito and it was a tasteless mess. My dinning companion did not even finish theirs. The fake crab was tasteless and overwhelming. Sorry I spent $25 with no drinks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQHp4XCP3Cqi0h2vfcjTzg"
  },
  "wsdvlIaIGgQEnIC9xYyuhQ": {
    "date": "9/8/2017",
    "text": "Omg just came here about a month ago and had the pineapple bowl dish since I saw it on FB. Tried it and it was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uUoLeyAP0El8uYyNpdBXUg"
  },
  "0Wb3bYieQb5XrDZ4Cfas5Q": {
    "date": "5/4/2017",
    "text": "This place is so delicious! I just recently tried their avocado boat with the ahi tuna and wow is it delicious! Most wraps or bowls are between 8 and 12 bucks. Nothing too over the top. Service in this place is always great. The staff is always willing to help explain sauces and combinations. Each employee has a favorite that they recommend. Place is always really clean and their really isn't much of a wait time either, but then again I usually go later in the evening. Overall great place and amazing food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhAgDTqGIp8jAYKDsAv5Ug"
  },
  "39RmvOfzsoghrJQDTfUhfw": {
    "date": "2/27/2017",
    "text": "It was my first time eating at a sushi burrito cafe & my BFF chose the right place! Vincent was great in explaining to us how to order & also put our poke bowl & sushi burrito together beautifully! Not only was our food put together perfectly, but it was as we say in Hawaii, Ono-licious! If you're looking for a great poke meal, I highly recommend Tail & Fin! Aloooohhhaa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oGfwN6BfB80zxZnXzw8WSg"
  },
  "nGViqzz9-fMx3_VvUKaOaw": {
    "date": "4/27/2017",
    "text": "Service was perfect! Food was awesome! Fish was cold and the rice was great! Tried sweet poke and not only were we treated horribly but the fish was room temperature and the seaweed tasted old . Tail and fun was excellent and a great place to get your sushi craving without over indulging in ayce . The two people working today were both young , male and female and I believe they both wore glasses. Very polite and extremely friendly. Can't wait to frequent this spot more often !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oNIaAW9_L7R3IyRrtpU86g"
  },
  "998KMGEZH7u6XQ-es0fUIw": {
    "date": "8/31/2016",
    "text": "Awesome food, a must try! My favorite was the Angry Bird dish, it wasn't too hot and the portion was perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K-U5ncEargC3SE2G67cqHg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K-U5ncEargC3SE2G67cqHg/o.jpg"
      },
      {
        "img_id": "jVhCI7axQHu4moR4lCJKuw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Only place to eat a sushi burrito..",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jVhCI7axQHu4moR4lCJKuw/o.jpg"
      }
    ],
    "user_id": "VfjwvHbJ_whW9I_ukzZ6mw"
  },
  "tdcciqth6dRKly0cVIbW2g": {
    "date": "8/30/2017",
    "text": "We come here a lot. Everything is fresh and the prices are reasonable. I wouldn't say anything is outstanding but it is all around pretty good and the employees are friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-L6cUtD2AdBIdfsJoAHdiQ"
  },
  "K7zWRpYKgX88nZJFrJx0bQ": {
    "date": "11/2/2016",
    "text": "Nom Nom Nommity Nom! You give me all the burritos NOW!!!! And load on that sauce, because that ish is legit! Big ol' burritos with quality af ingredients. No mushy bs here or skimpy pickled jalapenos (gross). Nahhhh. Get out. This is fresh to death! I decided to make my own combination because i'm picky - and it came out perfect. San Diego hasn't perfected the sushi burrito game yet, so whenever I come to Vegas I NEED this in my life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "BJw7sMunTB5uAfvgI4_HIQ"
  },
  "bvdQuEROqyqbHzJvlrfOBg": {
    "date": "11/2/2016",
    "text": "great simple clean spot.   soup could use some sea weed and tofu in the miso.   staff very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "angEr2YcXmCl20s8WQu32w"
  },
  "8N0nJcxVf4d50LgtPdR_Tg": {
    "date": "12/14/2016",
    "text": "Found a new favorite! Shrimp Tempera, spicy tuna, crab meat, romaine lettuce (for xtra crunch), with Eel sauce and Siracha.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fS86t0IvNj-kDBae2mJHSQ"
  },
  "zZNri2B-BMLa9poVNn0lMg": {
    "date": "10/7/2016",
    "text": "I have to give this place major props on the item names-Stupid Good Tuna, Crabby Bastard, The OG.  I mean who wouldn't want to get items with funny names on it right? It was funny until I actually ordered...I got myself the Stupid Good Tuna in a sushi burrito roll. I got my little girl a kids chicken teriyaki bowl. Service was excellent and very helpful. **TIP- if you're new to the place, let them know and they will walk you through it and even recommend getting the already established choices.***  For the Stupid Good Tuna, i opted out the jalapenos and subbed it for the mango. SO GOOD!!! Why oh why must you be so far away?! Food was so fresh and tasty. Honestly, this place was better than SoHo Sushi Burrito. Even my kid liked their made to order teriyaki bowl. She is such a picky eater so when she was chomping down on her chicken I knew another star needed to be added. Prices aren't bad and I think next time I'll do the poke bowl instead and see how that tastes. I could only imagine just as good or better.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "Znid_azpcHmdRMHGicmkWA"
  },
  "5pBRfkaUq_z9ywoRkg0yOA": {
    "date": "8/15/2017",
    "text": "Super delicious - coming from the beach the quality of sashimi is great. Very helpful staff - definitely frequent this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_Zval54OL5cFCW3aJUgYA"
  },
  "S4xij82hQ-2c_cl3exRMOg": {
    "date": "2/22/2018",
    "text": "My family and I went to tail and fin last night. The food was so fresh and the Service even better, Sophia and her partner made us feel at home and will bring us back with there smiles. Great work ,it is nice to see team members that value customer service!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lv-M2DnNGtLSdtDGi8VPGA"
  },
  "WVvO1pP9CEBy-c-S4I3U0g": {
    "date": "9/17/2016",
    "text": "WOW!! I had the Stupid Good Tuna Buritto and it was just that, STUPID GOOD! This was my first time coming here and I was very impressed. I wanted to try something from the menu to get an idea of what they have to offer. Next time I will go back and get wild by making my own creation! Very happy with my choice  For the quality and serving size it was a great price. I even finished it off with a mochi pop! So bomb   If they open more of these I can see myself eating here all the time. You could literally eat here everyday and not have the same thing twice !!   I'm a Fin!! I mean a FAN",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wBqOP7-S6pHEzBKKXOyUPA"
  },
  "KwNlXGxj5ssBExKlksT9Xw": {
    "date": "8/8/2017",
    "text": "Love this place. Great service. Great quality. I love the selection of sauces and they do not skimp on anything. Really nice, will be back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIKxZRDQZPvwkxkxaSk1kw"
  },
  "RCAjIDJnUlIph3BvF1D13w": {
    "date": "6/19/2017",
    "text": "I eat here 2-3x a week. Food is incredible & the staff is super friendly!!! Neighborhood favorite! Try the Stupid Good Tuna Bowl!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OM5tbAaHReBvzkVtkZ3DyA"
  },
  "ZHDnwjZAEfaeWeHH-OhdCA": {
    "date": "3/27/2017",
    "text": "First time eating here & it was great!!!  I hade the Pineapple Express made with soy paper which was wonderful & my husband had the Stupid Good Tuna which he said was very good. Everyone was super nice. We will be going back soon :-).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N31s2QdqxR1_YwZYQt_G0A"
  },
  "Lww8npE5_5Td4OTXNSiCLg": {
    "date": "9/28/2016",
    "text": "Customer service was really good so this review has nothing to do with the workers. They're doing a great job. Onto the food.  Pretty small portions. I guess I'm used to Sushirrito in SF. The portion size wasn't even the biggest concern to me...it was the quality of the fish. The salmon tasted SO fishy! I was burping it up later and could still taste the fishiness. It's like I had just popped 4 fish oil pills. One thing that turns me off of a sushi joint is the lack of freshness! Quality raw salmon should not be this fishy! It was gross! When the worker was scopping the salmon he was trying to get a perfect little scoop, and that's fine but he was scraping it against the canister to do so, pretty much squishing the salmon. He kept re-scooping and scraping to try to mound the perfect little salmon ball, so that might also be why the quality of the fish was subpar. IMO it's not worth it to mash up the fish just to avoid giving the the customer a little extra (and I'm talking like 2 cubes extra here lol). Raw salmon isn't like beef from Chipotle where you can just crush it and it will be fine (maybe even more tender lol). Texture of raw fish is so important! It's not even his fault though, he was obviously just trying to follow instructions given to him. He was really sweet...but that raw salmon was just plain ol' bad. But hey, I don't really see anyone else complaining so maybe I just got a bad batch. I'll give them the benefit of the doubt. Maybe next time it'll be better.  I was also kind of annoyed that when I opted out of pomegranate as a topping (included in \"the crabby bastard\") and asked for masago instead (they were both premium toppings that costed $$ to add in), they still wanted to charge me for it. Even though I asked for no pomegrante already! I feel like if it's the same price point ($1.49) it should be an equal substitute.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "SbzpL48_peoFEPJApFsV4g"
  },
  "PYxSsWfyAypVykkT9v6izA": {
    "date": "9/14/2016",
    "text": "I was in the area and stumbled into what I would call the find of the century in terms of a new fantastic place to eat lunch (probably dinner also). The restaurant is called Tail & Fin . It's a combination of sushi and burrito and everything in between. You can have the meal served in a traditional burrito or in a bowl (watching my weight so that's the direction I went in)  The food was so tasty, fresh and it was the perfect sized portion.  The employees could not have been more helpful in helping me with food suggestions.  Over all a great experience. I will definitely be back and we bring my entire family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKf7FFlDKJIBTYFEXTsnKw"
  },
  "PHU79xABajldrCkwh05ZJw": {
    "date": "9/21/2016",
    "text": "So been to a few \"sushi\" burrito places but this one was by far the best... Love the ambience of the venue, all white making a must to be super clean.. and then the food execution was awesome. They give you an option or regular size or large size burrito, which while watching it get made was not at all sure how all the fish was able to be stuffed into the burrito.   Definitely be back on a regular basis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIaSEqQ90JVjJbPRoQlFWw"
  },
  "AvC1u9SppXOy58Va-OF7zw": {
    "date": "9/7/2016",
    "text": "A friend told me about this new place so we decided to give it a try when we were out this way. The staff was super nice and patient while stared at the menu trying to decide on what we wanted. I ended up getting the shrimp tempura roll and swapping out the crab for spicy tuna. It was so good and I went back for seconds on exactly the same roll! Definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MyOdCL8KBzrDH1XzCNkIQg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Shrimp tempura roll w/ spicy tuna substituted for the crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MyOdCL8KBzrDH1XzCNkIQg/o.jpg"
      }
    ],
    "user_id": "_JqLjrgNEe9y0DpjoBwNQQ"
  },
  "wrtnosN6YBjJQGo0yAMEuw": {
    "date": "1/8/2018",
    "text": "The first time I went, the customer service was average. I was hesitant about visiting again, but I'm glad I did. The fish is fresh and delicious. I ordered a pineapple bowl and 2 sushi tacos. This time the customer service was much better. I'll be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSYS4smKLCm4AjHT1D0zVQ"
  },
  "UgGJe7cA3XIdEO5SnIO2-A": {
    "date": "1/2/2017",
    "text": "Great little spot off strip close to south point. But worth the drive! Not your typical poke/sushirrito place the chefs creations really put a spin on things.  The crabbie bastard is what I had, delicious ! Oven roasted soft shell crab with a heaping load of the crab meat salad (not heavy of the mayo which was great ) with a nice salad melody of pomegranate, romaine lettuce avocado topped with furikake and Eel sauce that wasn't too heavy. Overall would come back again.  10 for a reg 12 for a large",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NmEk3zGobLzYQOgVumHcpQ"
  },
  "tF7RqbWSMaAV6MuMuXtv4g": {
    "date": "1/2/2017",
    "text": "First poke / sushi burrito spot I've had that offers soft shell crab and shrimp tempura ! They even heat it up for you.  We got A large Crabby Bastard and the regular Shrimp Tempest with extra spicy tuna and the cucumber sunomono which came out to about $28. We did it with the salad and it was actually pretty filling. They put a lot of imitation crab in the bowls and the presentation was great.  The eel sauce looked like it could have been too much but it actually turned out to be the perfect amount. Definitely worth checking this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BSFN-xN6mYtCEMbcNQYCqA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Regular Shrimp Tempest over mixed greens with extra spicy tuna",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BSFN-xN6mYtCEMbcNQYCqA/o.jpg"
      },
      {
        "img_id": "sA0Ison_8Y3RpEZcz66tyg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Large Crabby Bastard over lettuce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sA0Ison_8Y3RpEZcz66tyg/o.jpg"
      }
    ],
    "user_id": "cEnOlQ3bdabBNCMZA69fHg"
  },
  "di4JD_ISL3jxedVgELkDwA": {
    "date": "9/5/2016",
    "text": "I do not get the hype here.   I came here with high expectation because of the high ratings on yelp. I walked in to this store around 3:40pm, there was only one person in line. Lieterally took them 10 minutes to get that person's order. The employees who make the rolls or burritos seemed like they just started working there. They were looking at the menu while they were making the rolls/burritos in front of customers.   I stood in line for 5 minutes and finally it was my turn. I ordered the stupid good tuna burrito and the crabby bastard burrito. I waited about another 10 minutes to get my orders. Again they were looking at the menu I was standing in front of them thinking I would have been faster if I were to make one. I get it that they just started the business but come on, think about a lot more customers waiting in line waiting for their order. I wish they can speed up their orders. Finally I get to try both burritos. Man! Those rice were sticky as hell. Like chinese sticky rice!!!! These are not sushi rice for sure. It is one of my pey peeves when it comes to sushi. The rice is the most important factor but here nahhhh. I was very disappointed. Overall the flavor was okay but man that rice just ruined everything.   Another thing I did not like was their portion. I am not a big eater but when I saw those burritos, I was bummed. Jaburritos offer almost the same price but their portions are as twice as more. I paid freakin 23 bucks for tiny sushi burritos that were not even good. Not worth it!!! Totally not worth it :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MzF5oKLkhTkYsraqKw-Riw"
  },
  "3cVxvijq5Q3c1QTE4Vzjng": {
    "date": "10/30/2016",
    "text": "This is my new go-to spot for poke. The place is clean, customer service is proper, and the OG is the one to beat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSb2BagZ5lOBBS-X_bzFPQ"
  },
  "eAIaOh9kvCpn1CTETfcJRQ": {
    "date": "10/15/2016",
    "text": "My friends and I were so excited to have a sushi burrito spot in our neighborhood, and we really wanted to like this spot. I did give it two attempts, but sadly we will be going to Soho from now on.   My first trip I ordered a shrimp burrito on seaweed paper. Right away the woman putting my burrito together pulled out soy paper (I have a soy allergy) and started assembling it. I got her attention and asked her to please make it on seaweed paper because I am allergic and her response was \"But you asked for soy.\" Why would I ask for something I was allergic to?? I reiterated that I cannot have soy and needed seaweed. She became very agitated, aggressively threw the soy burrito in the trash, and started making it on seaweed. Then at the register we literally stood there for over 5 minutes while the woman working it had a conversation with her friend. It was not busy and they were discussing something personal. I nearly walked out. The food itself was passable at best... the burrito fell apart completely after one bite and the whole thing was extremely watery.   Last night I ordered again through Postmates, and the yellowtail was DISGUSTING. It was definitely not fresh. It tasted like one would imagine a dirty fishbowl tastes like. One bite and I actually got physically ill. I ended up throwing the entire thing away.   Needless to say, I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GytLpb49JEL8SaH5xUMvcQ"
  },
  "yF6J4DsSpcTuhXaf8YTO5Q": {
    "date": "10/4/2017",
    "text": "My family and I went into this place. We were greeted by a very nice woman that explained the entire menu and waited till we decided what we wanted. My son ordered the chicken teriyaki for kids. I ordered after the him, the vegan wrap. The male told the lady they are out of the temeph. I informed her that I only eat plant based foods. Since they were out of the product I came there for, I informed the female that we are going somewhere else. As we were leaving, he yells across the restaurant \"do you want the chicken teriyaki bowl? Well, if I said we were going else where and walking toward the door, I probably don't want the bowl.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uwRd0buZlfjPWbmNK7kGhQ"
  },
  "9WxcHsegPFSwtO4wsUZd_g": {
    "date": "9/3/2016",
    "text": "I can't say enough wonderful things about Tail & Fin! First off, I am not the biggest sushi eater, but this place just changed my mind!  I am a sushi convert!!!  I had the OG Bowl. The fish & all of ingredients were so very fresh and tasty and the presentation of the food was very pleasing to the eye. The staff was so very friendly & warmly greeted me as soon as I stepped In the door. I also quickly noted the cleanliness and nice decor of the place.  The staff was so helpful! They made it so easy for me to order each ingredient so that I would have the best experience. I love that I could add  additional avocado! I am not only a convert but will also be a regular customer! Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MJ_rMYepClU1i7A4hrfE4A"
  },
  "O_hA5IHZjpFr-zp02eGG4Q": {
    "date": "9/2/2016",
    "text": "This is my new craving...absolutely fresh sushi and other healthy ingredients.  We shared two Signature Creations, the Stupid Good Tuna (ahi tuna, surimi crab, romaine lettuce, tomato, cucumber, red onion, tempura flakes, yuzu miso sauce, unagi sauce) burrito wrapped in seaweed and The Omega burrito (salmon, surimi crab, romaine lettuce, seaweed salad, furikake, jalapeno, unagi sauce) also wrapped in seaweed.  Both were delicious and satisfying.  The side of Miso peas was addictive.  Although the place is small, it is stylish throughout and definitely is NOT a fast food spot.  Think Nobu in a casual style.  I cannot wait to go back and create my own burrito.  They encourage you to add your own selection of ingredients including a variety of sauces.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RCIjuS0G3GPyb98XulFubw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Amazing Mango Mochi Pop",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RCIjuS0G3GPyb98XulFubw/o.jpg"
      },
      {
        "img_id": "JYPZFwgCv9BwaYGNeKLsNw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JYPZFwgCv9BwaYGNeKLsNw/o.jpg"
      }
    ],
    "user_id": "J-bdQF6uPmM2U7oBGOVaMg"
  },
  "Z7weJ6iBpmjLkeulwEqBtA": {
    "date": "8/13/2017",
    "text": "Never been to a sushi burrito place before and this was my first experience... customer service was awful, the two workers, a female and a male were so unhelpful and looked very annoyed at the questions we were asking. They did not explain the menu nor how it worked or the options we had even after asking us if we had ever been to a place like this before. Food was good but I won't be back until they hire people who actually look like they somewhat enjoy their job. Those were the most two miserable and unhelpful workers I've seen in quite a while.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDEuv0DmLbP3D6t_b2iO-Q"
  },
  "Vl7Df9Wva-gMlJXusuCxKw": {
    "date": "7/28/2017",
    "text": "Came here and tried the sushi tacos. They were good but the seaweed was chewy wasn't able to tear into it. With all the sauce and everything it got soggy quick but overall it was good",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "idkiOWam_lobHnIeZEs1rg"
  },
  "xNUhN7ZVHME5l4VuyB1ulQ": {
    "date": "9/22/2017",
    "text": "Fresh food and decent pricing. $10 for regular size and $12 or the larger size. I took two stars off bc the place is incredibly slow making the food. Anytime I walk in and there's more than 1 other person in line I just walk out. I'd say it takes them 10 mins on average to complete an order even when I know exactly what I want.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CidTnTmSYL8l8iYyQkRJbw"
  },
  "PkK0YQTnk3jETFHkOWtZvQ": {
    "date": "9/10/2016",
    "text": "The OG was amazing.  Hands down this is the best Sushi Burrito place in town. Its better the SoHo and JaBurrito. It's was quality and fresh and the atmosphere was great.  I will be coming back and I will be a regular. Great Job TAIL&FIN!! The Food is I highly recommend, if you haven't been your missing out. GO CHECK THEM OUT!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j4Z66YVy4CFsHS2GhSoJNw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The OG was amazing.  Hands down this is the best Sushi Burrito place in town.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j4Z66YVy4CFsHS2GhSoJNw/o.jpg"
      }
    ],
    "user_id": "YesQzBdBmri3xSQhbE7Hew"
  },
  "fKHbvPEcHch8Wy4eRSFKMg": {
    "date": "11/16/2016",
    "text": "Found this poke place on yelp. Walked in and was greeted by staff. It was nice and clean! I did a large BYOB. The fish was fresh and tasty. Portion size for the large was great for the price. The staff was super friendly and helpful. I will definitely come back if in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BETo5YdpW-gCMQpVATo-Aw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BETo5YdpW-gCMQpVATo-Aw/o.jpg"
      },
      {
        "img_id": "zOPo7ynI2TRBTqgNQ7MpVQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon, Ahi Tuna, Spicy Tuna BYOB Large",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zOPo7ynI2TRBTqgNQ7MpVQ/o.jpg"
      }
    ],
    "user_id": "TPdkCBODh7FCDez54bjiLw"
  },
  "iUyZF02ckCFhAOKB8AM-oQ": {
    "date": "8/17/2017",
    "text": "MAN! What can I say tail and fin is good but \"Sophia\" make it so much better ! I absolutely love her costumer service! Like 10 out of 10 HANDS DOWN THE BEST! When I walk in she remembered my name and made sure I got everything I wanted on my bowl!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "39dy9kJcO6p5nhEDmMfntQ"
  },
  "VX2G2u3L2heqkSQK3NmPHQ": {
    "date": "1/15/2017",
    "text": "I loved it soo much! It tasted soo good! Place was clean, & they greet you right when you open the door!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qf3lib6uIBY1JzgzMXDF5A",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. The Crabby Bastard with Spicy Tuna  loved it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qf3lib6uIBY1JzgzMXDF5A/o.jpg"
      }
    ],
    "user_id": "FXAuVD-Z9ImpG2PgXAGt8A"
  },
  "EdOBMRUaaZCaUWxdQrhy7g": {
    "date": "9/14/2017",
    "text": "One of he better poke/sushi burrito places in town. Quality is great, cleanliness is very good and service is ok. Place is a little messy on he inside but not bad. I recommend trying it out for yourself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQoeZRet8wyhpiVwTsnRcA"
  },
  "BYtIX09J9vwbKhWr_vxvDg": {
    "date": "1/11/2017",
    "text": "Friendly staff, clean environment, simple setup, fresh ingredients (rice, fish, veggies, and sauce), and delicious food overall! This place is a 20 minute drive from my house, but I would definitely go of my way to come here again. By far the best sushi burrito/bowl place I have been to in Vegas. I ordered the OG bowl and added red onions and seaweed. It was delicious and everything I had hoped for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5M9sMWKDzmzBa9QpU_ec7g",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5M9sMWKDzmzBa9QpU_ec7g/o.jpg"
      }
    ],
    "user_id": "ScwVhHmUFLZwVW9E5fvKjw"
  },
  "rt26BqJcyNNox3D39-DCrg": {
    "date": "10/29/2016",
    "text": "Very convenient and fast device!  Excellent food and service! The owner Dan is awesomely em. Everything's very fresh and nice variety. We'll definitely be back again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gaBZk8zmH0F_F5DQsZZqjw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gaBZk8zmH0F_F5DQsZZqjw/o.jpg"
      },
      {
        "img_id": "BBI139O7Gu02rRQPF-OiCw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BBI139O7Gu02rRQPF-OiCw/o.jpg"
      },
      {
        "img_id": "1E1-L2IL4Bsk0qEliNPcaw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1E1-L2IL4Bsk0qEliNPcaw/o.jpg"
      }
    ],
    "user_id": "NQffx45eJaeqhFcMadKUQA"
  },
  "fauvwKoTAtKoL8YYsdG7yw": {
    "date": "12/21/2016",
    "text": "I just came to Vegas from LA to visit my sister. Felt like sushi. Found this place yesterday. Had to come back again today becuase the food was the bomb! Customer service is also excellent. Bomb food and awesome service. What more could you ask for?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EQJ0fYcpuQTwZgbU0FdqLQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Flaming tuna",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EQJ0fYcpuQTwZgbU0FdqLQ/o.jpg"
      },
      {
        "img_id": "fOaM1Bt3-27H_t5IhA3NNw",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fOaM1Bt3-27H_t5IhA3NNw/o.jpg"
      }
    ],
    "user_id": "Dh8E6F8L20WswgP-mbaang"
  },
  "KaV4MhEEmPyzEHyaOWugSg": {
    "date": "9/17/2016",
    "text": "Came to Tail & Fin with my husband. I ordered the Build-Your-Own tuna burrito and my husband ordered the Build-Your-Own salmon bowl. I noticed that one of the workers with my order as well as others in front of us were handling the foods without any gloves. She was touching the fish, rice and vegetables with her bare hands, touching other squeeze bottles then wiped her hands onto her apron! I mentioned to the girl per SNHD, all ready-to-eat foods had to be handled with gloves. When another worker heard that, she confirmed I was right and remade my burrito. She had to squeeze out a lot of the water that was in the tuna and salmon container which made my burrito a bit soggy. Flavor was decent, but not rolled correctly so it fell apart with the first bite :/",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "068Q5Xor9FZgGIKwFvOqqA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/068Q5Xor9FZgGIKwFvOqqA/o.jpg"
      },
      {
        "img_id": "9Z9oAWtDe0_pDQibi_0oSQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Build Your Own tuna burrito, big soggy and not rolled correctly so it fell apart with the first bite :/",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Z9oAWtDe0_pDQibi_0oSQ/o.jpg"
      }
    ],
    "user_id": "dA0QWjx56wIVbGaL_r52mQ"
  },
  "IBO_JJwL5QvRYQ4FPD8pzg": {
    "date": "10/12/2016",
    "text": "This is the second time I have been to this spot and had the same impression. There are alot of people working but the service is SLOW. There has to be a better expediting process. The girl in front of me was ordering a few items and the guy at that station was still checking the recipe card on the wall. The other worker was at the rice station (behind) just watching the other guy struggle to multitask. There was a girl at the sauce station and a cashier. Seems like they could organize it better so it's not just one person working while all the other stations just watch. I know this place is new but recipes should be memorized and made with confidence.  The first time I came in I  had the same experience. The staff seems nervous and unsure;lacking in efficiency for sure.  I got  the  best tuna burrito (forgot exactly whT it's called) it was just ok. The first time I came in I got the omega, which I liked much better. The food is ok and the service is slow.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LyqdQUtcJJx1DWv3TF_xg"
  },
  "7Cxm2IMap4PQuZpaFUoxvA": {
    "date": "4/11/2017",
    "text": "Amazing!  Tried the burrito today and was overwhelmed.  They got so much stuff in it!  It was huge and tasted great.  I'm now so full I am not sure I can fit my Green Tea Mochi pop. But i'm going to give it a shot. I will definitely be back.  You can't beat the prices here. No idea how they do it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "34ipstfxPXr5f2CKZoFnRg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Dinner before it was rolled.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/34ipstfxPXr5f2CKZoFnRg/o.jpg"
      }
    ],
    "user_id": "2zZQCyO-FAxRT2iUh1Whxg"
  },
  "2Zrm3luE7_jsd2OaF26kag": {
    "date": "10/5/2016",
    "text": "This place is the absolute BEST!!!  I love that we finally have a sushi burrito place in Vegas that is worth going to over and over again!   I love the poke bowls and sushi burritos!  The best part is being about to customize it so I get everything I want.  I was skeptical but my friend recommended this place to me and I'm so glad she did.  I could see this being my new addiction!!!   Yummmmmmy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U2dI4xqg-rrmG24IP45F6w"
  },
  "aAV_OgLCfmyHKx-PIOVaIg": {
    "date": "1/12/2018",
    "text": "First time eve entering a poke bowl place and have to say I love that they have vegan options! They were clean, food tasted good. Although definitely think it's a few bucks overpriced as I can pay the 7$ for the same bowl basically. Also, the staff members were extremely rude to one another which was sad to watch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j04idgSKnN5s6lDxDIVrDg"
  },
  "VG_gEIk8WPFVFCR2hYoeZQ": {
    "date": "5/16/2017",
    "text": "Build your own poke bowl?! Yes please!! Loved all the different options and super fresh ingredients",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1gNpxPSyndfO6OHtdpV_9Q",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1gNpxPSyndfO6OHtdpV_9Q/o.jpg"
      }
    ],
    "user_id": "_P7CUSecUMs8nqHWrZ5Y4Q"
  },
  "ASUJtS1bKrX_fhPjKLTOJQ": {
    "date": "9/22/2016",
    "text": "I am new to the sushi burrito concept and this place was a great first experience! Fish was very fresh and they have a great selection of add-ons. Menu is simple yet has plenty of options to choose from, including the \"build your own\" burrito/bowl. Very happy to have this healthy dining option so close to my house, I will be back soon :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "noTayG9wRokKrLboqlE50w",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/noTayG9wRokKrLboqlE50w/o.jpg"
      }
    ],
    "user_id": "SD7PXVfRrHOQPgytmjNAyg"
  },
  "bbSP0DTddEg2Fp81xIV_Rw": {
    "date": "10/6/2016",
    "text": "This place is really close to where I live compared to other sushi burrito/bowl places! I had the spicy tuna bowl. Great customer service and the bowl was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PSSSDtItCaiBUxNalqz8zQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PSSSDtItCaiBUxNalqz8zQ/o.jpg"
      }
    ],
    "user_id": "eoclNgxfpc0e4xOjWQE0Zg"
  },
  "9H5B6qd2p_reW7LRrBkcuQ": {
    "date": "4/30/2017",
    "text": "Wow. Very impressed with Tail and Fin. Ordered a build your own burrito. The salmon and toppings were very fresh. The sauce was amazing. Have to say this was the best burrito I've ever had. Awesome healthy meal and the restaurant was very clean. Customer service and meal gets an A+. I highly recommend trying this place out. I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zKopVmh8HTN3H84M_Y4uUA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Salmon burrito with my own toppings.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zKopVmh8HTN3H84M_Y4uUA/o.jpg"
      },
      {
        "img_id": "fqZZxVJLU_mjvFd86035RQ",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Very cool place.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fqZZxVJLU_mjvFd86035RQ/o.jpg"
      }
    ],
    "user_id": "w7eOdRGtzksfy4xtFXCxTg"
  },
  "-5yZItrRPIki2UUoAo8mLA": {
    "date": "10/2/2016",
    "text": "I love that so many poke spots are popping up! But sometimes it's just not quite right.  The atmosphere when walking in is pleasant. Everything looked clean. Simple menu board uptop when you walk in. We were greeted pretty promptly As we walked in.   My bf and I both ordered poke bowls off the menu, we didn't add anything extra, since it was our first time we just wanted to try the food as is.  He got Stupid Good Tuna: ahi, crab, lettuce & fried flakes. He didn't really end up liking it, the fish didn't really have any flavor, even after topping the bowl with unagi sauce. He got sushi rice with his bowl and felt like there should have been more for a \"bowl.\"  I got, Flaming Tuna: spicy tuna, crab, seaweed salas & jalapenos. I enjoyed the spiciness element to it. I really love almost anything spiced. The salad was good, couldn't taste much of the crab and the tuna wasn't that spicy or really couldn't taste much as I ate the bowl. They serve sushi rice with the bowl which I'm not a fan of at all.   The rice have too much vinegar and over powers the rest of the flavors in your bowl. Opt for brown rice or any other option if they have it!!!!   You get a miso soup with your bowl; I didn't like it. It was flavorless & had no tofu bits. It was just pasty water.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qBbw4ubSDWU6n62Opjvsw"
  },
  "sJULSabdw_77d2WJN1zWqg": {
    "date": "11/5/2017",
    "text": "Tried this place again after giving it a bad review its opening week. Not much has changed. Service was EXTREMELY slow on my 30 min lunch break... I was only behind one mother and daughter and It took almost 20 minutes just to get up to the window. Bowl was not full and fish still didn't taste fresh. This place still needs work. With all of the poke places that have opened recently, I say try one of those places instead!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xRtiQA_H4O3FqbUYRvzHQ"
  },
  "a6OmTeimbJ_EJD5gSAOOKQ": {
    "date": "8/31/2016",
    "text": "Three words; Stupid Good Tuna! And that is exactly what you will find on the menu here, everything is \"stupid good.\" I must admit I was skeptical at first (I'm not a huge fan of seaweed paper), but Tail & Fin has many options and I am now a soy paper lover for life! Bowls, burritos, and salads...affordable and fresh! I love the fact that they have salads so I can eat lighter when needed. Next time I will either build my own sushi burrito or bowl, options are endless! I can most definitely say #ilikeitraw =P",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "diMGimF7s7gixC821CEVzA",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Best Strawberry Mochi!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/diMGimF7s7gixC821CEVzA/o.jpg"
      },
      {
        "img_id": "duhQN4g86JN5pM6rFxH7Vg",
        "caption": "Photo of Tail and Fin - Las Vegas, NV, United States. Stupid Good Tuna...with a little seaweed salad added :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/duhQN4g86JN5pM6rFxH7Vg/o.jpg"
      }
    ],
    "user_id": "Ru3XlA1NeRAYgtE0KUK7tg"
  },
  "pe60m4eCSb4Aeeq_enErQg": {
    "date": "9/25/2016",
    "text": "I was skeptical at first, but I'm an open minded guy.  I'm glad I came in. They were extremely friendly and  Melanie was extremely helpful & sweet. It turns out it's freggin delicious!  I'll be back agin soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HsLItODUCfGh5u5Oml9_ag"
  },
  "2kmyxFlI1R1obTBTW0CT7A": {
    "date": "11/10/2017",
    "text": "This was my favorite poke stop... til today.  They changed product vendors and all fish and etceteras, even edamame, arrive frozen. Yuck!!!  You've ruined your restaurant!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFT9OrEDiR34_E3r3LWqMQ"
  },
  "4t1iYNJ7xmK8FSsCZ_pnwA": {
    "date": "9/1/2016",
    "text": "I got the stupid good tuna.. So good! Everything tasted really fresh and the sauces were amazing.  New favorite spot!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lMVoJvyNmnLShbWIgr_WeQ"
  },
  "n2bMlCyJsH0I4KNRTUJWsw": {
    "date": "9/4/2016",
    "text": "The poke bowls were underwhelming and uninspired. And for the first time, the bowls looked so empty. The small portions were just so very disappointing. Very friendly staff, but it's just unfortunate that their bowls lack the great flavors that Pokeman near Chinatown has.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MghRQ6h95OSD5so41-SPBA"
  },
  "K2XodUGB1ulCK6nDtVmdvA": {
    "date": "2/17/2017",
    "text": "Had one of the best experiences of my sushi burrito life!! Chris helped us out with our burritos and was one of the best examples of great customer service I have ever had. He was nice, informative and rolls a bomb burrito. Please request Chris if you go!!  Besides the great customer service, the burrito was delicious. I had the spicy tuna burrito, because everything is better when it's got a little kick in it. My gf got shrimp tempura which had a nice crunch. We added some avocado to both of ours which added a creamy texture. I highly recommend asking Chris what to add in because he really knows every great combination. We also got some strawberry and mango mochi which was like an volcano explosion of flavor with a cool finish.  I will definitely come back!! Nothing better than great customer service and excellent food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MwMmIYRBjI34UXMCYI7Bg"
  },
  "4dbZtsYT1m27_G1fSc9LXQ": {
    "date": "3/14/2017",
    "text": "Omg this place was awesome! The fish was fresh and they give you great sized portions. The fruit is extra which isn't bad, but they charge $1.49 for a small scoop of fruit which seems a bit extreme. I really liked the food besides that, their Unagi sauce is to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F-fH5zwAXhiSF-1BM92c7A"
  },
  "M2W-X9icOXAAUrY9BaYiCQ": {
    "date": "2/19/2017",
    "text": "Excellent service, friendly staff, and delicious food. My friends and I will definitely be back again to explore other things on their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HglGYzPTN81wE8jDIVrAIA"
  },
  "spWpEXc44uo94g0EGxIZXA": {
    "date": "9/5/2016",
    "text": "I got to say this is sushi burrito was fantastic. The service was great ! I'm definitely coming back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "loCaTkfsv_DS3rzOZVkf0g"
  },
  "e7RX18TBOy7CXNg_S0_V6g": {
    "date": "3/20/2017",
    "text": "Excellent service from Chris and I think his name was \"Keem\"...extremely knowledgeable and pleasant. The food was great but the service is what is getting me back in the door THANKS GUYS!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ww5nYvbQeRW8gLADXOwgyA"
  },
  "wcwWSXfzRDrAReynPYGTPA": {
    "date": "3/5/2017",
    "text": "Actually was going to Subway, but it was too crowded so I waked in here and boy was I pleasantly surprised. The place is very clean and the workers were very knowledgeable and helpful. My bowl was so fresh! Def will be back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHMKCUt49bFe-xS5pv72KA"
  },
  "SovrTF08eytBLSsnnn4ACw": {
    "date": "12/17/2016",
    "text": "Hands down best spot in Vegas to grab sushi bowls or burritos.. I've been to a few others that just don't quite have it down. Right when I walked in the door before even trying their food, I was turned on by the great vibe and music that was going on. There were people working on their laptops, just enjoying the environment. The staff was amazing!!! The food, fresh fish and a great menu. It's not just your basic stuff, which they have too. But, they also have unordinary choices they brought to the table. Try the Crabby bastard. Soft Shell Crab and Pomegranates. Unbelievable!!! I will definitely be going back as often as possible. Thank you Tail and Fin",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UCvw5I3TYC0N6Cl1JwpEDQ"
  },
  "XklzBWSHeA6wYttYcNNPgQ": {
    "date": "10/11/2016",
    "text": "Awesome place, good customer service great food. Ample portions of protein and it's very fresh. Veggies crisp and tasty. Good too place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3UAyABO0Wkfn9v0NQrnYA"
  },
  "5TtRiYl-J-cLyeXhwKydOg": {
    "date": "1/21/2017",
    "text": "I have to stick with 3 stars. Not the best sushirito place but not the worst. Was very bland, lacked good flavor like most I've had. Staff was friendly though and quick, place was clean, food was fresh. I was happy a spot opened next to my home but I won't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2WSZrlN1od72NnMZZs5Tg"
  },
  "g_Wytyu2vb_CtcJJiVvNYA": {
    "date": "10/29/2016",
    "text": "Head awesome things about this place, the service is great and the fish is fresh! I was there a few days ago and totally worth the money and trip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VYKFMUH5af83nvDw2cD20Q"
  },
  "k0e_HgHaBL0fjjVV8LyN3A": {
    "date": "9/1/2016",
    "text": "BEST new sushi burrito spot by far. We ordered the stupid good tuna, crabby bastard, shrimp tempest, and a strawberry mochi of course! Each burrito had so much flavor, and all the ingredients worked well with each other. I also liked how there was minimal rice so it didn't take away from the good stuff. The place was very clean and in an awesome location. This will be the only sushi burrito place I visit from now on!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ANmlu80D7ApI0iRaIiPag"
  },
  "UT3Iv4gcaIh7szxMEEmATQ": {
    "date": "9/21/2016",
    "text": "If you want the freshest Poke ingredients in town, look no further. Tail and Fin has what you want delivered in a package that's convenient, delicious, and fairly priced. I drove all the way from summerlin just to see what all of the hoopla was about. I wasn't disappointed and you won't be either.  Great job Tail and Fin. Nailed it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxnfT0Fc-mMxQekai53Q4Q"
  },
  "i2zNHuBfkteilKY48p0HLg": {
    "date": "9/13/2016",
    "text": "Originally from the west coast, I feel like my sushi standards are pretty high compared to most. I stopped by this past weekend on my way out of town and got 'the crabby bastard' burrito and it did not disappoint! The crab was so fresh, and they didn't cut corners on the portions (as often happens with the most expensive ingredients), and the combination of ingredients and flavors made for the perfect, filling yet refreshing Sunday meal. This would definitely be one of my regular go-to quick dining options if there was one in Denver!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4lkkybdtB14e3XbfzSfHA"
  },
  "Ji5B2aQKfojthrPEY_seGQ": {
    "date": "9/4/2016",
    "text": "Sooo good!!! I had the OG burrito and it was delicious. I'm excited to try everything else on their menu. I especially like that they don't fill the burrito with a ton of rice like other places I've been to. Two thumbs up",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJ1rZdXjNsdDiuYRMswl9Q"
  },
  "tBsPPqxPuYR0fU8PgV7pmA": {
    "date": "9/1/2016",
    "text": "Wow! Food was amazing! Best sushiburritos in vegas. If you like spicy I recommend the Flaming tuna",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXrjb4gc_aEAm-pUaOS2kQ"
  },
  "UUeVlkUGVREGCy6u_OrSDQ": {
    "date": "9/1/2016",
    "text": "I just got done eating at the place and I highly recommend it. Excellent quality of fish, they do it the way you want, & most importantly it tastes great. This is a great place to go for a lunch that is healthy and light. I had the OG poke bowl.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzUcV_V3a_YT_XNnCT85Lw"
  },
  "D9CLimqayWK7IyRJgaogdA": {
    "date": "8/31/2016",
    "text": "Excellent food and easy to order. I had the Flaming Tuna Bowl, a must have!! Very clean establishment with a great staff! I can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kr-koi5p-66pf4rmNZ9iMw"
  },
  "YIOQJp1tZTTtWyalA18_kg": {
    "date": "10/10/2016",
    "text": "This place is just ok when you compare it to other sushi burrito places around town. I thought I would give it a try since it was new, but I wasn't too impressed. The line wasn't that long, but the workers seemed confused - which is okay if they are new. The food was a little bland and the Crabby Bastard could've used a little more sauce. Everything in the bowl was fresh, which is a good thing, but there was just nothing exciting about what I had gotten. Not sure if I would come here again knowing that there are other places that have better tasting food combinations.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-p3t6eTYgVFiU17XkzttHA"
  },
  "kgFQoiDnJlNrznL0-35a8Q": {
    "date": "10/6/2016",
    "text": "Very good place to eat at, hopefully they figure out the employee situation..... but good experience overall does not deserve anything less than 5 stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77R53RbRU5iqVHQoeMG_tQ"
  },
  "3lNOrzPA-tW6gtEs-aQjIQ": {
    "date": "9/8/2016",
    "text": "Amazing food, I personally like the build your own and get double the amount of spicy tuna... Great place to grab and go... 10/10 would go there again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOSSz8WPjr_okm-xsd2QaA"
  }
}