{
  "dB6kLB0doNIZYPYFjWfz2Q": {
    "date": "4/1/2016",
    "text": "This place is a local institution. It used to be run by Fatty when it was on Rochor Road, and the business has since been handed down to his children. Most of the dishes are pretty up to standard. In particular I'd recommend the pork ribs, crispy stir-fried noodles and the homemade beancurd. It's probably a bit better for lunch than dinner as it fills up with visiting air crew in the evenings. Service is gruff but efficient. Good value for money, lunch was like $15 per person for a party of 6.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "rg01HUesX7iBIAanD3Zx6w": {
    "date": "12/27/2017",
    "text": "A friend who grew up in Singapore recommended this place for authentic Singaporean food. We came in for an early dinner and got:- spicy chili crab: delicious. Sweet and savory tomato-based sauce smothering meaty pieces of crab. This was exactly what I wanted.- water spinach with garlic: good, subtle flavor. There were pieces of garlic in the sauce, but it wasn't overwhelming. This was recommended by the proprietor and I'm glad we took it.- fried rice with salted fish. This tied the meal together. Rice had good wok-fired flavor and the pieces of salted fish gave a nice texture and salty bite. They're like little pieces of fish bacon.Add a large bottle of Tiger, and you've got a fantastic meal. We paid around 80 SGD, which is incredibly reasonable for the amount and quality. Would love to come back with a bigger group to try more dishes next time!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7_0fBvdt1pri23y_K3M64Q",
        "caption": "Photo of Wing Seong Fatty's - Singapore, Singapore. Chili crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7_0fBvdt1pri23y_K3M64Q/o.jpg"
      },
      {
        "img_id": "iCriSe5F7nQy7pQf634YEg",
        "caption": "Photo of Wing Seong Fatty's - Singapore, Singapore. Chili crab, garlic spinach, fried rice with salted fish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iCriSe5F7nQy7pQf634YEg/o.jpg"
      }
    ],
    "user_id": "xax0BUVHbUHbF42JSxPaUQ"
  },
  "tK3OadJOmBpeMV-y2sgV-A": {
    "date": "7/17/2017",
    "text": "Ignore the haters. This place is great. Great food and some of the least expensive prices for beer in Singapore, which is saying something.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_dex36V_olDYO-2i95mZbg",
        "caption": "Photo of Wing Seong Fatty's - Singapore, Singapore. The grub",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_dex36V_olDYO-2i95mZbg/o.jpg"
      }
    ],
    "user_id": "1WJXybreDWoxZrqssgIxUg"
  },
  "3RYWtShj_xzQdYPQSMZyCQ": {
    "date": "4/17/2016",
    "text": "Haven't been here for a Long Long time.Ownership has changed because Skinny won't let my Husband call him 'Boss' anymore.Corn & pork soup - nice, meat tenderSweet & sour pork - not crispy. Used to be very good. Not worth eating.Kangkong with sambal - flavour is nice but too saltish.Claypot liver - a bit too hard. Used to be very good - tender.So disappointed.Don't think I will ever come here again. There are better places to go to.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "V4slSxZzxKfISgZRx5REwQ": {
    "date": "2/14/2016",
    "text": "Some of the dishes were good some were awful. Service so so. It's actually quite busy, busy with tourists. Nothing special about this place to be honest. Maybe I'm eating the wrong things..",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Vu56bAIP2cULjY38_uhHzA",
        "caption": "Photo of Wing Seong Fatty's - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Vu56bAIP2cULjY38_uhHzA/o.jpg"
      },
      {
        "img_id": "rZ9vVSsgxFt4v_U85Pn-9A",
        "caption": "Photo of Wing Seong Fatty's - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rZ9vVSsgxFt4v_U85Pn-9A/o.jpg"
      },
      {
        "img_id": "1mL-77DDRp1RyoVasJLB9A",
        "caption": "Photo of Wing Seong Fatty's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1mL-77DDRp1RyoVasJLB9A/o.jpg"
      }
    ],
    "user_id": "0gBy-cIXe0DQKhFjifu68Q"
  },
  "WfieCV7J2_2fbaIea5mLDQ": {
    "date": "10/27/2015",
    "text": "This is a very old restaurant, serving  more traditional menu. The restaurant it self is located on Albert St. not Prinsep St. as in Yelp's map. First impression this is quite a big restaurant but very busy even off time.  It is not clean nor dirty, just average of Chinese restaurant. The decoration is also similar to other Chinese's style street restaurant. The owner speak little English but still able to understand and give good food recommendation. Very lovely old lady. The food..looks plane but the taste...magnificent!! I don't know how to describe, its the best Chinese food I had in years. The portion is also quite generous. We ordered every dish medium size but they looks like large size to us. We ate until we are stuff, can't believe we were able to finish all the food. Even more surprising, it taste so good since the first bite till the last. And then came the bill....lest than S$80 for 4big dishes and 2 big bottle or beer thats S$20 for person! Awesome!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "836o1C5bqZJvZ5kD3ltVDA"
  },
  "Rya9Ezs9QpCPnirkkc2Nyw": {
    "date": "6/20/2015",
    "text": "I love this place. It is some of the best Chinese food I've had. Their Chicken with cashew is great. I also love their sweet and sour pork",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e2FeiNiSuVpcpCuOsNF1jg"
  },
  "1_Mn68GgkPqBNXMO-jN5pQ": {
    "date": "8/6/2015",
    "text": "The food is incredible and very reasonably priced / downright cheap for Singapore. Will be coming back here every time I visit.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VymbYEPwXSiTjUhvdgnAIA"
  },
  "6ByuZ1XmVfsgCMZdg-4hHg": {
    "date": "9/25/2013",
    "text": "I've  been going to Fattys for 10 years now. Every trip to Singapore I go there at least one time to eat.  It's famous among airline crews. People from all over the world eat there. My favorite is black peppered prawns and a side of garlic spinach. Top it off with the tiger beer and you have a great meal! The staff has been there as long as I can remember. Very helpful, very nice. Try it ...very reasonably priced, all around great place.Full bar? I don't know but I do know there's plenty of beer.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dmyIr7VJt5OqzbaL-9a4NA"
  },
  "Uv_hfnU5TsXkscekcMB7Bg": {
    "date": "11/19/2013",
    "text": "good singaporean-chinese mainstay near bugis. guys, this place is a local institution - it's the sort of old-school restaurant your grandparents and their grandparents went to (depending on how old you/they are) for their birthdays and weddings and chinese new year celebrations.in short, eating here is like paying respect to nostalgia and all your forefathers stood for - and it doesn't hurt that the cooking is fantastic, classics executed perfectly, and service efficient (as it always was in the old days).it's the kind of food most of us chinese in singapore grew up eating, a little more polished and extravagrant than mum's daily cooking, but familiar enough to feel as comforting.that also means that while there is a lot I could tell you about how soft and yielding the tofu was, how sweet-savory the sauce on the pork ribs, and how those individual grains of fried rice were expertly seasoned and delicious, I could just as well say nothing much - silence here as implicit approval and agreement with the esteemed expertness of this place.if you're curious, we had tender sweet and sour fish cooked with a medley of fruit, a simple plate of fried rice, pork ribs, a dish of sauteed mixed vegetables, their house specialty of beancurd with mushrooms, and some salt-and-pepper squid.but be more curious, and come visit. it's not posh, it's not refined - but it's fantastic old-school cooking that reminds me of big family meals as a young kid amongst a big lot of other grandchildren, and it takes me well back, in the best of ways.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "vc3DC5vl9k0j7ZECSrX1Pg": {
    "date": "1/12/2013",
    "text": "This restaurant was named after the original owner Fatty (Albert,  a great guy.. sadly he passed a while ago) and has for some time now been run by skinny his brother and extended family ) All the airline crews have been going there for years, they know a good thing when they see it. There is not a time when I visit Singapore ( over the last 28 yrs) that I do not eat at Fattys as do many others. My all time favorite dish is the baby Gai lan and Prawns with Salted Egg Yolk...delicious... accompanied by lime juice, very refreshing. This place is casual and fun with reliable food. Do try it.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ITkkhagHBxhwWx0ZHxfREg"
  },
  "QMZRQzXp-DPktefnDz8KIA": {
    "date": "10/22/2012",
    "text": "Fatty's is across the pedestrian street from Sim Lim Square - a notorious place for rip-offs. It seems ol' Fatty himself has been taking lessons from the cowboys there.Ordered up two main courses to share - firstly, the medium assorted vegetables ($8) was very nice and full of a bunch of different vegetables (to be expected I suppose). Secondly, got the fried kway teow with seafood and gravy ($8) which was pretty spectacular. Picked up a Tiger ($6.40/ lg bottle) and were in and out of there in 30 minutes.Got the bill, and there is a surcharge for the towels (60c). We didn't use the towels, so I have no idea why they added it to the bill. It is a shame, because this sort of penny pinching just sucks, and where I would have thought about returning to this place - I think I will try something else. If the manager ever reads this, please stop being a cheap bastard and charging for standard dining items.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyiSA0yxVGN8zSRaYHoyMA"
  },
  "1ep5q2xuciqGF4Vyu93eTQ": {
    "date": "11/22/2012",
    "text": "Good array of Singapore-like Chinese/SEA fare at reasonable prices.  Laid back, kampong feel gives it some charm.  Good place to just casually kick-back with some mates and enjoy food done with integrity.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6JElsXl7wKTCcEsGR6rcFg"
  }
}