{
  "XoXN9zVbkJ6xnKUs58Uc5w": {
    "date": "1/26/2016",
    "text": "Great little Thai place with reasonable prices. More authentic than all the other Thai chains. I don't bother going to Golden Mile anymore, and all the Muay Thai krus from my gym eat here too. Green curry fried rice is a winner, as is the basil pork with rice. Caveat is that the standard has a fair degree of variation (it's cooked quickly and without much refinement) - too salty sometimes, too much Chilli other times, way too much garlic etc. But for the most part the stuff tastes good. Just don't expect good service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "PhHX06GjmAxJBAas86TSXQ": {
    "date": "6/18/2018",
    "text": "Another Thai Food Restaurant Off the list! We used to talk about having Aroy Dee for meal everytime when we pass by Middle Road especially when this Kitchen is just located next to LE Cafe. We all heard good claims about the kitchen and perhaps why it was there for such a long time.Interior is rather modern with semi open concept kitchen. Furnishing are made up of metal chairs and wooden table with tiles flooring. They also include a mounted television for diners to watch and enjoy their meal.Thai Coconut - $4.90Clear Tom Yam Seafood Soup was appetizing and even though we forgot to instruct the server to make it less spicy, I would say that spiciness was mild and the soup really whet my appetite for more. Ingredients include fish slices, tomato, lemon grass, coriander and Sotong, which were nothing out of the normal soup we had.Tom Yum SoupPineapple fried rice portion was generous and good for sharing. Tasted mediocre with chicken floss, raisins, eggs and mixed vegetables. A bit disappointing!Pineapple Fried Rice with Chicken Floss - $6.50The pandan chicken leaves were fried to crisp and required some efforts to unwrapped before we can get hold of the meat. The turmeric used was a tad too much and meat was rather soft. Overall, tasted like chicken satay to me. Dip them into the sweet and sour chilli sauce and enjoy it.Pandan Chicken - $10Phad Thai, which is always one of my favourite under the Thai Cuisine Menu was really to my liking as we prefer to have a dryer version than this. However, in terms of taste, it was still alright with the fragrant of peanuts and sweet savoury sauce coated on the noodle.Phad Thai - $6.50Thai Fried Fish was something I always wish to order but always get turned off by its expensive pricing. Due to promotion, it cost $19.90 instead of $28. Fried Garoupa was well presented with vegetables as sides sprinkled with few stalks of coriander and soaked mildly in their three taste sauce. The sauce was not too bad with sweetness, saltiness and a little sourish.Garoupa with Special Three Taste Sauce - $19.90Last but not least the papaya Salad with salty crab. There was a promotion to this item at $9 instead of $15. I'm kind of fool by the menu as I thought that it was salted egg crab. This appetiser wasnt too pleasing to us, firstly it was served when we almost finished our meal and secondly, the papaya salad was too spicy for us. In the end, we left almost 90% of the food on table.Thai Papaya Salad with Salty Crab - $9The good thing about the eating place is good for supper goers as it opens till as early as 6am in the morning. If you want to have pocket friendly food that comes with generous portion, this can be one of your choices. However, if you are particular about taste of Thai food then you have to be selective of what you are ordering in the menu. Personally, I have expected their standard items like Pineapple Fried Rice and Phad Thai to be better. Therefore, it is less likely I will be back for other items on the menu.Do note  that payment terms are only Cash or NETS.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "w91OgyE6GjOuZ_MtBk21uw"
  },
  "pTlJu63vjmEUVTJx23krsA": {
    "date": "2/7/2018",
    "text": "Great little Thai restaurant,  always seems busy good prices on food food is tasty,  green curry chicken is my favorite with a Thai ice tea.  Service is good and friendly as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "IgpP3au3UNP5yWY3igWYBw": {
    "date": "11/22/2015",
    "text": "Great food The waitress was so cute. Kelly Worth coming toOpen late which is awesomeCheap too me n my man both ate and had 2 tigers for less than 50",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HKs7b2aViCSxDok32zJVLg",
        "caption": "Photo of Aroy Dee Thai Kitchen - Singapore, Singapore. Thai food in Singapore finally",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HKs7b2aViCSxDok32zJVLg/o.jpg"
      }
    ],
    "user_id": "-bHOYbH0P2KUj3lotQtMaA"
  },
  "U1T5p1sI8CK6KXqNNxn4gA": {
    "date": "7/21/2016",
    "text": "My colleagues and I went saw the lunch deal ($6.50) and were excited to eat here. This place has an industrial look to it. I ordered the pineapple fried rice but it tasted mediocre.The portion is not that big and I was still hungry after it. A bit disappointed! They didn't have the authentic Thai spicy sauce.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3gDIzBT6tF6I5DeVX-agaw",
        "caption": "Photo of Aroy Dee Thai Kitchen - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3gDIzBT6tF6I5DeVX-agaw/o.jpg"
      }
    ],
    "user_id": "2lQP-Ss2cXN5l904ORG6KA"
  },
  "ty298HPbR5hmuzzu07EPFA": {
    "date": "6/30/2015",
    "text": "Place is clean and prices are very good but the Thai food at orchard towers is much both taste and meat quality wise for the same price.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fDqZx7U59DKQwHR9CBIiEg",
        "caption": "Photo of Aroy Dee Thai Kitchen - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fDqZx7U59DKQwHR9CBIiEg/o.jpg"
      }
    ],
    "user_id": "xQ5ei5X-cfRX1sTHc0apSA"
  },
  "FcClkgBLYb08O5gGscTsPA": {
    "date": "4/22/2015",
    "text": "The whole place is very hot but the price is decent. Pad thai 3/5 . Curry rice (3/5) too spicy. Mango salad (4/5) steamed fish 3.5/5 green curry (2.5/5) fried toufu (4.5/5). Overal decent for the price but not certainly not authentic thai",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dfs3FSyWbqviCSIPL1-7GA",
        "caption": "Photo of Aroy Dee Thai Kitchen - Singapore, Singapore. Padbthai n curry rice( very spicy)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dfs3FSyWbqviCSIPL1-7GA/o.jpg"
      },
      {
        "img_id": "cOimxUySMSzfFJkmn-DqtQ",
        "caption": "Photo of Aroy Dee Thai Kitchen - Singapore, Singapore. Mango salad n fried fish cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cOimxUySMSzfFJkmn-DqtQ/o.jpg"
      }
    ],
    "user_id": "Z4jj0eCpeAodQ6RcxgyvzA"
  },
  "rGdcW7GysAIGHl8w6Rh-oA": {
    "date": "9/19/2015",
    "text": "We have been struggling to find good Thai food in Singapore, but this place really hit the spot. The flavours are bold and fresh. Green papaya salad is as close to authentic as you can get. I really enjoyed this place and would recommend it highly.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nQRJuIksJ4LGs-T8Z9-aqA"
  },
  "YD289CEy5Lh374e1N-HzYw": {
    "date": "10/20/2013",
    "text": "Went with a group of 10 and ordered 9 dishes and drinks for everyone. Each of us paid $15.30. I ordered the lemongrass drink with aloe vera bits. Very refreshing! Tried my friend's ice milk tea. It is great. Not too sweet, just the way I like it.My favourite dishes were the green curry and tom yam soup. Overall, the food was reasonably priced, decent portion and delicious. I would have given it 4.5 stars if it was possible.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t62KNJ36AZjLhgycA6Xz0A"
  },
  "ey_EmGJBKVxavjxMvL9ROg": {
    "date": "3/1/2015",
    "text": "This is our local take out spot. Menu is a hybrid Thai / Chinese offering. Spice level is high just as in Thailand so be clear when ordering if this is not for you. Prices are reasonable and serving size meets western standards. Our favorite is the soft shell crab.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MMzE2p8FwNt_xDt4ZqFi1w"
  },
  "4DKohARJlxrU7Bs4LJAtFw": {
    "date": "11/13/2013",
    "text": "Our local Thai kitchen ... Love this place for both eat in and take out.  Menu is clear and the staff are mostly friendly and helpful which is not the norm in singapore! Highly recommend the phad seeyu (kway teow) and the phad thai",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "v6aGAahbKL_VIHKsJDr9XA"
  }
}