{
  "DuT7KJh8861-_C0XqQGQsA": {
    "date": "4/3/2014",
    "text": "I can't believe I've never heard of this place till recently! A good friend of mine is a fan, and has been coming here and raving about their dimsum for ages, so it was only natural that we would end up coming here eventually.Apparently queues are a common sight to behold but we were here at 10pm on a weekday night and there was none!Loved their steamed custard buns, xiao long bao and chao shou (Sichuan wontons in chili oil). The custard buns came at just the right temperature, and were packed with the divine yellow gravy which was viscous and oozed out just barely as we bit into it. (In comparison to a recent version at another shop where it was so watery and hot that the both of us got scalded). They were generous with the meat in the xiao long bao, and it was flavorful and I'd dare say comparable to the ones at Crystal Jade. Would have had more of this if not for the limited stomach space!The chao shou came lying in a very tasty chili oil mix and were more spicy than other ones I've tried. It was good but could have been better. It came in a shallow dish, making it quite difficult to scoop up sufficient amounts of the chili oil to go with my wontons. Would have preferred to ladle some more into my spoon for that additional kick as I was eating it. Perhaps next time I'll ask for some extra oil on the side. Dessert was mehhhh. Had the yang zhi gan lu (mango/pomelo dessert) and I've had better.Dinner came up to be about $25 for 2! Affordable and good- I'm definitely going to return someday!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "JuSNvjJcrS9t4lXbYRdXLQ": {
    "date": "7/25/2012",
    "text": "Swee choon's an OK place for late night supper with friends or family. Although the dim sum variety here is extensive, I feel that taste-wise, it isn't as good as other dim sum supper places like Crystal Jade at Holland Village. Their staff service is pretty bad too. One of the waiters got pretty pissed and went away in a huff when we asked for our drinks to be served after ~10 mins of waiting. I'd say a good place to hangout for dinner/ supper/ early breakfast if you are just looking to fill your tummy. Do not try: pumpkin pastry (see picture)Do try: fried carrot cake",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jmPPw-yhyk9hRtaQAYT-Fg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Xiao long bao",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jmPPw-yhyk9hRtaQAYT-Fg/o.jpg"
      },
      {
        "img_id": "mLBgHN7-gc-ekYcbzmo57A",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mLBgHN7-gc-ekYcbzmo57A/o.jpg"
      },
      {
        "img_id": "ider3lacSO8qYl1ikkT-Rw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Fried carrot cake- must try!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ider3lacSO8qYl1ikkT-Rw/o.jpg"
      }
    ],
    "user_id": "-gSBIKGqb13BjdR7hylOzQ"
  },
  "2Mgl8aMTOCfrHIXVf9Z4qA": {
    "date": "9/14/2012",
    "text": "This place has the ambience of a poorly maintained public restroom, but my wife and I are regulars here anyway. I don't think their dim sum is anything special, despite the name, but their northern-style dumplings and hand-made noodles are very good.  For me, the star dish is their spicy chili wontons. The dumpling skins are thin and silky, they're generously filled with juicy pork, and the sauce is a perfect mix of black vinegar, soy, and chili. Also, there's this one waiter who runs around the place like a madman, yelling \"Beep! Beep!\" to let people know he's coming through.  Even when there's no one in his way.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "ouBdbXdi8_jmXJbgQ5Jq4A"
  },
  "JqWfG8SPTV2cz2ayFWAX-A": {
    "date": "5/9/2013",
    "text": "I first started going to Sweechoon Timsum back in 2010. Three years has passed and this restaurant is one of my favourite go-to places for late night supper and dimsum cravings.Some of my favourite dishes include:1) Salted egg yolk custard bun- I don't think this needs much introduction. The bun is small but full of goodness.2) Beancurd skin prawn roll- I love how they deep fry the beancurd skin with fresh shrimps and minced meat. But this dish is seriously one of their most inconsistent dishes; some days it's served cold and soggy... I guess one can only hope for the good days.3) Spicy chili wanton- Nice and soft wantons in a spicy vinegar sauce, what's there not to love?4) Mee sua kueh- This exclusive Sweechoon dish has mostly mixed reviews with some thinking it's too bland, but I LOVE the texture and crispiness of the kueh.. It's like fried carrot cake but better!Food aside, it is good to see that their business has improved tremendously throughout the years, but it is depressing that the queues have gotten ridiculously long as a result. My most recent trip there last Friday saw me waiting in line for more than 45mins before I got a table. While the food may be relatively cheap and good, I can no longer justify traveling all the way down to Jalan Besar and then waiting another 1h before I can have my food. Guess I'll be on the lookout for other supper alternatives.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mqcQfgcIquaxc1lvPw5VLQ"
  },
  "abuOfQfR7-vZKWpu0LWnxA": {
    "date": "4/3/2014",
    "text": "Best Xiao Long Bao and Har Gau in S'pore and they open very late. Though the queue is always long, the staff are very nice to arrange for us. Quick serve and good food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xZ88uejWt_p-7BKpkT5gbA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xZ88uejWt_p-7BKpkT5gbA/o.jpg"
      },
      {
        "img_id": "XmYfCS9cFwPSyUtLenXgzw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XmYfCS9cFwPSyUtLenXgzw/o.jpg"
      },
      {
        "img_id": "QJcl0w5SgMH5Hin-ba9Btw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QJcl0w5SgMH5Hin-ba9Btw/o.jpg"
      }
    ],
    "user_id": "0TKbsw2xVBBV8gk4UwTsQg"
  },
  "YTe8TBkRZDdPw_V6C0Y2WA": {
    "date": "10/8/2012",
    "text": "You can't always have it all and Swee Choon definitely does not have decor AND good food.  But as long as you come for the food and not the furnishings, you'll be fine.Swee Choon's hours (6 pm - 4 am) and menu (dim sum and lots of dumpling types of fare) are as good at 2 am as they are at 8 pm.  They have typical dim sum dishes like shu mai and those egg yolk custard buns, but they are mediocre here and the selection isn't extensive (e.g. only plain cheong fun is offered here).  But they brought in some Shanghai trained chefs who turn out hand-made noodles and different meat filled pockets of doughy goodness (xiao long bao, spicy wanton) with a deft hand.  I wish they had a few more meat or vegetable dishes.  But if I can only order dan dan mian and delicate, tender spicy wanton, I'll still be happy and full.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bWYTvHxF8MO4k_Anqf5nPQ"
  },
  "ztAEagRXQ-K1N08-GjKLQQ": {
    "date": "8/5/2012",
    "text": "Recommended by a close chef friend of mine who insisted I should give a try, I finally made my way down to Swee Choon after a night of partying and was left impressed. One of the few places to be open past 3am, it's quite common to see long queues and full houses on Wednesdays and throughout the weekend. In fact, its more of a nightspot than other usual tim sum places that open in the morning (they close at 10am!). The service staff are attentive and quick, and food is served within 10minutes of ordering, regardless of the crowd. Decor is kept relatively simple and tables are well spaced, allowing for comfort while eating, though it can get a little noisy. So far, the fried mee suah, liu sha bao, prawn rolls and chee cheong fun are the dishes that I find myself repeating whenever I'm there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "ILJxoKEzC6qw0outSUW3Lg": {
    "date": "7/16/2012",
    "text": "This is my favorite place to go to for Dim Sum. When I'm bored at night, I find opportunities to go for a walk at Mustafa's. Along the street was where I found Swee Choon Tim Sum; brightly lit signboards on the outside + huge crowds of patrons queuing outside = definite must try!My favorite's the golden tofu cubes top with a little pork floss, these are to die for! Their soup dumplings and pan-fried dumplings are my bf's favorites. If you are a congee lover, you won't want to miss SC's century egg congee. Yummmm!If you hate queuing, here's a good hack: go behind the restaurant and volunteer to sit at the back alley. You get good food fast and sitting in the back alley gives a more casual feel to the dim sum experience.Opening hours are weird here, they open everyday (except tues) from 6pm until 10am. Fantastic for the owls in you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a08_Y_Ay9a5S1ZMr82ph0w"
  },
  "Sl-eC2sYVgEsoMp1A-nyyw": {
    "date": "8/24/2012",
    "text": "This is a wonderful place to get good quality dim sum at weird hours. You can choose to sit indoors which is airconditioned, or outdoors if you are a smoker. I love their Har Gao (prawn shrimp dumpling - comes in pairs) as well as their custard buns - which comes in thress. Their chee cheong fun is smooth and thin, not the typical machine processed kind which is laden with flour. Do not forget to try their special fried red bean pancake. They also serve mango sago dessert, and a plethora of drinks such as barley, ice grass jelly and more. For a group of four, if you eat to your fill, it probably will cost about $10 per pax.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6dB1jzTHSMumn9z_f20L2A",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6dB1jzTHSMumn9z_f20L2A/o.jpg"
      }
    ],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "oAIWoIqRE2a7I9JGa_DpzA": {
    "date": "8/11/2012",
    "text": "Swee Choon Dim Sumis one of those places my local friends always talk about and recommend, though after a few visits, I cant see what all the fuss is about. That's not putting the place done, I just have had better dim sum in other parts of Singapore and even in Melbourne. There's always a queue out the front, but walk through the store and sit out the back is your best bet for a table. While you go without aircon, and any real artificial light, it adds to that real SE Asia dining feel. Be warned though, if you don't like rates or mice I'd give the back tables a skip, as they will often be running around the gutters and under tables in the dark!!! Food is decent while not spectacularly good, extensive choices is a plus, drunken chicken is fantastic!!  Good place to hang out for late night dim sum!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZqj0zcaOXV63mVVVLAhhQ"
  },
  "t-i-_4HjbBYUfQ3HV7JnJg": {
    "date": "10/27/2014",
    "text": "Authentic, that's for sure. A bit run down a dirty as well, which I guess is part of the experience but don't expect a nice dining experience : the setting is definitely simple, especially in the tables in the back where roaches are never far. Still it's a nice place for late night chinese cravings as it's open all night long. Food is good, just don't expect it to be Din Tai Fung.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8MG-wLehos4jnMfV1Rn7Q"
  },
  "N9MBy5-bwkTZrnXKZZC5qg": {
    "date": "11/3/2014",
    "text": "down for dim sums at swee choon anytime!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X9V2JocmyjBfRuLGMLU2UQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. There you go",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X9V2JocmyjBfRuLGMLU2UQ/o.jpg"
      }
    ],
    "user_id": "MTq8Hoaf1EnCWPvy25ZQqg"
  },
  "28JslveqnodGSY4kti1k2w": {
    "date": "9/9/2015",
    "text": "Really local place where it is possible to try a peace of local and hong Kong food. There is always the queue when I come but if u like eat outside, u can make the turn and ask a table outside. Fifth star missing because it is only possible to pay by cash or nets which is not always convenient",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXqCvcijJQNeUuyKjGtXpQ"
  },
  "wMphSAq6nxNL7xggzlLCLQ": {
    "date": "4/23/2013",
    "text": "Overrated. Used to be good few years ago. But the word got out and it got crowded. Oily food. Overpriced. Who cares if no decor. U can get better elsewhere. Let the uni kids queue for oily food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYk89bcKbeRfER-P7YaRig"
  },
  "hldMKndnkjuuHg2vOIiujg": {
    "date": "9/4/2012",
    "text": "This stall is actually located near Tekka mall and Sim Lim Square about a 10 minutes walk away, facing the macdonald's on the other side of the road. It only opens after 6pm but do be reminded to go early as even if you reach at 530pm there might be a queue there already.I went about 630pm and it took about 20 minutes before we could get in to be seated, but at least the staff passed us the menu to place orders first so that we could pass the waitresses the order chits when we got in. There were some new items on the menu that i never saw before like the fried mee sua which tastes rather interesting but it was really delicious at the same time, who would have thought of fried mee sua wrapped around some carrot cake.There were other usual dim sum items like the black bean pork ribs, char siew buns and siew mai. All were pretty good but the price however came up to about $30+ per pax so be prepared for that. I will still go back nonetheless for their quality of dim sum.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5giEryaio2xzYX6qKraPQ"
  },
  "z2WXZsnB_dymibx7Tu3P9g": {
    "date": "9/27/2012",
    "text": "One of the best timsums in town. Was surprised when seeing a lot of people inside the restaurant at midnight! I surely will be back soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXy4m5JDEegBLk5x9aiViQ"
  },
  "1lYQyB8zG3BqvmL5VaPeOg": {
    "date": "8/19/2012",
    "text": "Swee Choon is the place I go to with my friends if we're really hungry at 3 am and we're craving cheap and good food. The food they serve is okay - with dim sum standards like siew mai and chee cheong fun being decent enough to satisfy your cravings, and at 3 am in the morning, you'll be hard pressed to find another restaurant which serves better dim sum. That being said though, don't go to Swee Choon expecting mind blowing, Michelin star worthy food. It is what it is - an after hours restaurant, serving the needs of night owls.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDcJsT-IhVMH6sO19V_nbg"
  },
  "2AvZ9xsZltooSoaLIe1irQ": {
    "date": "7/5/2013",
    "text": "Where would you go if you're so sick since you can't find dim sum in Singapore in the middle of the night? To the hospital of dim sum! This place is seriously looked like a doctor place, bunch of people waiting on the road side sitting on the plastic chair staring at the electronic ticker praying that their numbers to be called next. I was surprised that the line was long when finding parking in this area should also be a separate challenge. Can't really miss this place on Jln Besar since the shop almost occupies the entire block. Go to the podium outside to get a number by telling how many in your party, wait while filling in your order in the form by looking at the big ass laminated menu sampler (not all the things are shown there), hurry back to the podium when your number is shown on the ticker, sit on whatever table the bouncer tell you to, press the bell on the wall when you're ready to order (be warn that nobody gonna ask you about the order unless you do that - I sat for 5 minutes getting confused why nobody came around to ask), and enjoy the fast service, cheap and good dim sum! By cheap I really meant it, I pay just above SGD 20 for 6 items and 2 drinks - it's been a while to find a dim sum place so popular but so cheap in Singapore. Tried the chicken feet, fried shrimp dumpling, fried shrimp in tofu skin, xiao long bao, mixed veggie, and siu mai. Portions are small (most items only has 2 pieces on them) but they didn't skim on the meat - the fried dumpling and tofu skin were pretty packed with shrimp. The veggie looked liked blah when I 1st saw it (we ordered it since it's the only veggie item available on the list), but it was surprisingly tasty and good!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "K175l53A-ciYnt0xS_V4CQ"
  },
  "R-lAIRMRBIWAN4jL_cuPKA": {
    "date": "4/24/2015",
    "text": "I came here a while ago so I know this definitely needs a revisit and a review but all I can say is from past experience I highly recommend this place because, it just wasn't what I expected. I love how its open late at night, I love the casual ambience and the food was delicious. I came in with around 12 people and were accommodated very nicely - we played games, we ate good food, what more is there to love? ALSO - THE MOST CRUCIAL POINT.Up to that very moment in time I was convinced that red bean wasn't for me. After tucking into their red bean pancakes (and tuck in I did) I literally made a 180 degree turn and now can't get enough of red bean desserts! They are so so delicious, we had to order more! I would go back just for that. In fact I'm planning to make a massive trip with my sister and cousins the next time I am over.Looking forward to it already!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gls8nDq3hEhgAUEebGuL2g",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gls8nDq3hEhgAUEebGuL2g/o.jpg"
      }
    ],
    "user_id": "cfWkhUiMnwaMstTbvAYLUQ"
  },
  "kWHvPcvq1W8SFXYf0cjl9Q": {
    "date": "11/4/2015",
    "text": "Don't expect refined food and you'd be enjoying yourself. The food is generally decent and what I think Swee Choon has going for her is:1. Cheap affordable pricing2. Decent variety3. Efficient dining experience4. Supper spot! No 4 is probably why most people are here. Although there are some good competition around the area (Da Lian noodles across the street and Tim Ho Wan at lavender and both opens 24 hours), Swee Choon definitely has their own following. My favorite is also the fried mee suah, which most yelpers has pointed out. I have never seen this dish anywhere else. Savory rice noodles pan fried. It is certainly interesting.Everything else on the menu you can probably find a better version elsewhere.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "jt2B_5T1nh6mwcf7PgjJRw": {
    "date": "11/7/2015",
    "text": "Cheap and cheerful dim sum with character! Think din tai fung crossed with a nice hawker centre.Their Xiao Long Bao (soupy dumplings) are fantastic and a must try, and the wanton dumplings with the chilli oil is also a favourite. Only downside is there are no alcoholic drinks on the menu :(",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9AsZoivkVP5rlL6Vq6DK6g"
  },
  "4hFAg2nz3d5IxqyQd743ug": {
    "date": "11/30/2015",
    "text": "Dim sum madnessssssss.-order the Liu Da bao -order the congee-order what other tables are ordering.-order the horfun if you wanna prove me wrong.Mine severely lack the nice wok fragrance and needed more seasoning.One time, I wasn't feeling too good and had watercress soup. It wasn't too bad.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "lGWuEnldvAYRBcuBlkC7VA": {
    "date": "12/7/2015",
    "text": "Quaint little dim sum store near little india! Me and my friends ordered some dishes like the legendary xiao long bao and the typical siewmai. The dishes tasted almost flawless and is honestly one of the best dim sum around Singapore! The only downside is the price and the seating. The prices are quite expensive and the seating is quite limited due to the crowd. Highly recommend! Xiao long bao- 9.5/10",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "r0QB_cBSApIM7JCEUV5EVw"
  },
  "tn5VLqUNW_3SWYRNZXbJSg": {
    "date": "6/26/2014",
    "text": "This was my first visit to this place and as a tourist to this country I think Swee Choon Tim sums are the best. Their menu is so different and the food comes to your table piping hot. It's fresh and so authentic that if I were to live in Singapore, I'd visit this place every fortnight. I was very luck to have been taken to this place by two locals and they showed me exactly how to eat each dish. As you all know dim sums are better enjoyed in a bigger group, so one can try more varieties. However if you are visiting Singapore and are clueless about which place to eat dim sums at, look no further. At peak hrs this place does get crowded and wait times can go upto about an hour or so.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G06-9TKjWLsZeG_e2YZYBw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Prawn dim sums",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G06-9TKjWLsZeG_e2YZYBw/o.jpg"
      },
      {
        "img_id": "Sv8opNslddOmgYocEdbmhA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sv8opNslddOmgYocEdbmhA/o.jpg"
      },
      {
        "img_id": "iC7Uq-xe99JdNs1M-kjoHQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Egg Custard pao",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iC7Uq-xe99JdNs1M-kjoHQ/o.jpg"
      }
    ],
    "user_id": "oqtHokBIoQnJ21MbUJnuHQ"
  },
  "E6r9PLqfN-CfxpCp691ZDA": {
    "date": "7/16/2015",
    "text": "I love Swee Choon. It's affordable and delicious, with a no-frills get super efficient style that doesn't waste time on pretensions and just gets you your food!My favourites are the carrot cake and the pan-fried dumplings; I have to get those every time. Swee Choon does get very crowded in the evenings; be prepared to take a number and wait! It's a smooth system, though: you get your number texted to your phone and you can keep track of how long your wait is.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s3Nuy5SgmS8ceTV-yqfLSg"
  },
  "Y-tjA6pKz7e8u4qI6p1ooQ": {
    "date": "9/13/2013",
    "text": "Swee Choon is kinda famous for the Mee Suah Kueh (2 for $2), which is a deep fried rice cake that is wrapped in a salty rice vermicelli. But that has never been my favorite. I wasn't all too impressed with the food the first time i went and i was glad that i returned with my food kakis after a long hiatus. Since every dish was pretty small, that allowed us to order up a storm even at 3 in the morning. Oh and this was after i had my Peanut Butter French toast and Hazelnut latte at midnight. We had the Salted Egg Yolk Custard Bun (3 for $3.60) which wasn't all too bad. I liked the Sichuan Chili Oil Wanton (4 for $4) which had the right amount of spice and vinegar. The Steamed Pork Ribs ($2.50) were also tender and well marinated. I rather liked the pan fried carrot cake (2 pieces for $2) that had the right chunks of radish and dried shrimps. No Chee Cheong Fun for me because it is the regular kind and not the steamed Cantonese sort. Yes i'm picky that way.You MUST order the Fried Golden Tofu ($3.50) that is lightly crusted on the outside and seasoned with pepper and salt. The silky texture is simply amazing. The steamed beancurd roll in oyster sauce ($3.20) is also very good. I'll definitely be heading back if hunger pangs strike in the middle of the night!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "SmiKFARhyJH-q2ZVqkPQHg": {
    "date": "5/12/2014",
    "text": "The best place for \"Dim Sum\" and other Chinese food. Absolutely delicious and its definitely worth the money. Do not know where to go for supper? I would definitely recommend this restaurant which is conveniently located along Bendemeer Road. Very suitable for dinner gathering with large group, only problem is its difficult to find parking and also long queues during meal times and weekends!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vtdm-QpN5yYxT-O00cuqFg"
  },
  "-nSCS5hE4NYA7zCxFP4zLw": {
    "date": "12/21/2013",
    "text": "It's Swee Choon Tim Sum, I dont think I need to introduce it much except the fact that it used to be just one unit, non-airconditioned and a little raw and dirty...which has it's natural draw of a very authentic chinese late night dim sum place. Though it small and slightly rundown, it was usually packed cos the food is good.Lo and behold, a few years down the road, Swee Choon Tim Sum has expanded across 3 - 4 units with 2 of them air-conditioned. Despite the expansion, it's still packed and please do not expect to get a seat straight away cos you will definitely still need to wait to get a table, it's just a matter of, how long is that waiting time.Classic dim sum menu, the hargao (steamed prawn dumplings) and siew mais (steam pork dumplings) are really not that great, but, you gotta try their Salted Yolk Custard bun. For the uninitiated, there is a way of consuming these salted yolk custard buns that will NOT cause a mess or an unexpected explosion of hot buttery custard all over you. To prevent unnecessary embarrassment, remember, you \"attack\" this heavenly bun from the bottom. Slowly peel off the paper cup base, and slowly bite into the bun. Savour each drop of creamy salted custard before taking another bite.The rave seem to all be abt this custard bun and really that's pretty much about it for me. I dunno why people flock here all the time cos the parking is terrible (not many parking lots around) and the food is only average but it still one of the few places that I will always go for late night dim sum craving. What a sucker I am!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "Wt-Qj33BRGS1TubVjO4aTw": {
    "date": "12/2/2015",
    "text": "Food served in small portion and pricey. Taste is just average. Don't understand what draws people here. Presentation of food is bad too. Servers are not friendly and attentive.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kAvICt3D6ml6wSfcAwE06w",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Plain Chee Cheong fan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kAvICt3D6ml6wSfcAwE06w/o.jpg"
      }
    ],
    "user_id": "1KV1vE1VkGclAyFmnaPUWg"
  },
  "Qr8W6tkYcnVXw2wj_t8ppw": {
    "date": "7/12/2015",
    "text": "The best dim sum in the city! Although the queue is crazy, but the waiting time is quite short tbh. Food is great, place is oldies but I was amazed by the way they use tech to assist their work. Very recommended place for dim sum lover.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ZIXPuVW0PvOQdHiKM2CqA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZIXPuVW0PvOQdHiKM2CqA/o.jpg"
      }
    ],
    "user_id": "LOW8fI73b-eQSozRtCot5A"
  },
  "JdDFN4z6orwd89uoU6_C7A": {
    "date": "6/19/2015",
    "text": "The most affordable+good variety of dim sum in singapore. And best part is that it opens throughout the night and is a very pleasant option when the weather is a bit cooler. Good service, nice prices and some unique stuff as well. I liked the udon in onion oil.. nice flavour and goes well with the clean soup. I am a regular.. wish they had a couple of more branches but not in malls and only in shophouses.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "NQzqMOSY8JnreFDJiUB1uA": {
    "date": "4/7/2016",
    "text": "Great cheap food with no frills! Be prepared to wait at busy times it's definitely worth it",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G4RnpGSk7Ro2xss5WIazPQ"
  },
  "-OQ9_Yjm8TUcrGAiZoV6Pw": {
    "date": "8/20/2016",
    "text": "I love Swee Choon and find any excuse to go there. I especially love the green beans and the chee cheong fun. I recommend washing it down with less sugar chrysanthemum tea. They are a bit slow with the water, so remind them. Also, the picture menu doesn't match the order sheet exactly, which can be frustrating. The line gets crazy! So don't come when you are in a rush and it's best to come earlier. It's great for groups!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQPvv2LgPXMNMQUrz3va3A"
  },
  "rPy5zValDne_wS7c9lFhuw": {
    "date": "7/1/2016",
    "text": "Some portions might be small for hungry people but everything is super tasty. Must try: Har Gao, Century Egg Porridge, Xiao Long Bao.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NKNvE_kg0EzDypYjJedKNQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Century Egg Porridge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NKNvE_kg0EzDypYjJedKNQ/o.jpg"
      },
      {
        "img_id": "Dp-j8P026GMi5NLMoisyyQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Fried Prawn Dumpling",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Dp-j8P026GMi5NLMoisyyQ/o.jpg"
      },
      {
        "img_id": "tRfVICComl8KGDhNywv1eg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Minced meat noodle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tRfVICComl8KGDhNywv1eg/o.jpg"
      }
    ],
    "user_id": "mpigMI9Z-aKpohpCBFX5ww"
  },
  "6q_2vq402_wzx16k-6UQcA": {
    "date": "4/15/2016",
    "text": "I went here last night and it was amazing. I was in a group of 7 and we ordered a ton of food and I was not disappointed in anything. The salted egg yolk custard bun was a new item for me, but it was great, and the smoked duck with black pepper was my favorite. The duck is the stuff of dreams. I can't go into all the food, mostly because I don't know everything we ordered, but I can say that I am confident you could go to Swee Choon Tim Sum, order whatever you want, and be really happy with your decision.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQ86xTrQTrqsHvboBVfWXg"
  },
  "v3sHzTG4mjF-sxtPueYAjw": {
    "date": "4/18/2015",
    "text": "Definitely overrated dim sum and would not recommend to friends. The presentation of the food is bad and the taste is not that good as people mentioned. Maybe we ordered the wrong food...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mPHx51LQfTTNfJewSwh8tw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mPHx51LQfTTNfJewSwh8tw/o.jpg"
      },
      {
        "img_id": "cRskx-lKx1p8TJY4V-zaZA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cRskx-lKx1p8TJY4V-zaZA/o.jpg"
      },
      {
        "img_id": "5_hnflJCGM9PvHLb-4eHzA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5_hnflJCGM9PvHLb-4eHzA/o.jpg"
      }
    ],
    "user_id": "RE-55HvYTTg6xIZRXLDkHw"
  },
  "rET9oY9DEjMQfM_6RuXHuA": {
    "date": "9/7/2012",
    "text": "I've gotta say, Swee Choon is a great place for a drunken post-party supper. Especially if you get a seat at the tables in the dark little alleyway behind the restaurant. It's so shady, it has a specific charm to it.I prefer sitting outdoors anyway. Even though there's airconditioning inside, the fluorescent lights are a pet peeve of mine, and the floors are oily. Service is curt and efficient, but don't expect a smile. They guys working here are so busy they don't have time for niceties. They shout out orders and commands into a walkie talkie, striding about busily, serving and clearing plates and taking orders at the same time. I am honestly quite impressed at their chaotic system. Somehow, it works.Be sure to come early if you're coming for dinner or an early supper. It gets pretty full up! The dimsum here is affordable and of decent quality. It is also served in small portions, so couples can come here to eat by themselves too.I especially like thei Liu Sha Bao - it's bun with some kind of custardy salted egg filling. The golden filling oozes out of the steaming bun as you bite into it. Their Char siew buns are also pretty good, with a fluffy, light bun, and tasty, meaty fillings. Another thing I like to order is the char siew pastry. The pastry is light and buttery, with sesame seeds sprinkled in top. Super tasty.The har gow and siew mais are pretty good as well, but the century egg porridge was far too bland and uninspiring. The non dim sum dishes are alright as well, so don't be too worried about ordering different things to try!Another dish that deserves special mention is the Orni (yam paste). It comes with pumpkin and gingko nuts... and it's divine! Served hot in an individual bowl, it's a generous portion for one person. It's fresh and fragrant, with a thick and consistent texture. I love that it's not too sweet as well.Love it here, will always come back for more dimsum in a dark dingy alley. Parking here is tedious business - only on the street. And this ebing Little India, people are walking around everywhere, and you also have road works to contend with. Good luck!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kkzfvtF-006WCB1WOJaIVw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Yam paste",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kkzfvtF-006WCB1WOJaIVw/o.jpg"
      },
      {
        "img_id": "7GRFvDJxYaJIs-6ZyYy9oA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Back alley seating",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7GRFvDJxYaJIs-6ZyYy9oA/o.jpg"
      },
      {
        "img_id": "f_urzuWJ6QJxOtnnyEkRoA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Char Siew pastry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f_urzuWJ6QJxOtnnyEkRoA/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "Yjs5tjSRAKKX_0dHm9H9Og": {
    "date": "1/23/2013",
    "text": "This is the place to go to for late night dim sum. Instead of the usual morning dim sum, Swee Choon opens only at night and serves dim sum besides noodles and dumplings and other dishes. The food is pretty much average. This is not the place for fine details or quality food. It is just a normal place with food which will suit most. The highlight for me, besides the opening hours, is the liu sha bao (custard bun) which is done pretty well. Eat it while it is hot and you will get the soft custard filling flowing out of the soft bun. Another dish which is not commonly found is the mee sua kueh. It is similar to fried carrot cake, except it is made of mee sua. Strands of mee sua are fried till crispy. It is good though oily. You will need to share this as the grease can make it a bit heavy on the stomach. The har cheong gai (prawn paste fried chicken wings) is pretty good too. Don't bother ordering the bean curd. It is pricey at $2 or more and is very average. You are better off having bean curd somewhere else. The other dishes we ordered are not that memorable at all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "kHUtLxHs5VVq7zX_7UNKHQ": {
    "date": "7/21/2018",
    "text": "Great food!Great service!Good for expatsThe picture menu helped.You need cash or a card that's used in Singapore to pay. Luckily there's a ATM across the street. We had fun and will go back when in town again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PC9CXgfC_-NascnQBwesoA"
  },
  "JGcGp3thMQYwu79vqz7BSQ": {
    "date": "8/20/2018",
    "text": "I'm a big fan of dim sum! I have tried a lot in different country. The line is really fast, there are a lot of place inside, with AC. About the food, Siu Mai is Ok, Ha kao has two big shrimps inside, they come by 2 pieces.  Xiao long bao, skin soft but the soup wasn't there, just a little bit.., prawn chee cheong fun only for dinner (...). For the rest ( fried dim sum and desert ) were just Ok. So I won't come back for sure. There are many better dim sum restaurant in Singapore. Go there only if all the others dim sum are close (they open all night).",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4mZWgazqwYImWV8Lzezmmw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Xiao long bao 5/10",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4mZWgazqwYImWV8Lzezmmw/o.jpg"
      },
      {
        "img_id": "8Y-Zr1ZR4KwqOgzyjNpUEg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Our lunch",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8Y-Zr1ZR4KwqOgzyjNpUEg/o.jpg"
      }
    ],
    "user_id": "7Vw54Uw5T72CuuXPGzCQyQ"
  },
  "wUH8NKrAd1XGCmFmliM-gQ": {
    "date": "6/16/2018",
    "text": "Pretty solid dim sum place with a variety of dishes. My favorites were the pork ribs, the big bao, and the mango dessert. They have a ton of options so you can satisfy any picky person.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mAByhDtc3C5X2dgKE6Hfeg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mAByhDtc3C5X2dgKE6Hfeg/o.jpg"
      },
      {
        "img_id": "4dNAgQVMVSbJemV3QQttUQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4dNAgQVMVSbJemV3QQttUQ/o.jpg"
      },
      {
        "img_id": "lxH9zl9eARq0SPYG0IvbMw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lxH9zl9eARq0SPYG0IvbMw/o.jpg"
      }
    ],
    "user_id": "WOsrmI8LkJ6weo-cUd5hlQ"
  },
  "vTtOChkxr7-JYH6mNLQ-Xw": {
    "date": "3/25/2018",
    "text": "This was the last stop of our 3-part brunch and by the time we arrived, we were pretty much eating for sport. We ordered a few savory and a few sweet dim sum dishes and tried our best to eat everything.The Portuguese Egg Tart was satisfying as was the Salted Egg Yolk Custard Bun. Although the sweet items were good, the savory ones were just ok.I'm kind of surprised by the number of great reviews for this place. Compared to dim sum in Hong Kong or even in the US, this wasn't that impressive. Save your precious stomach space for something more special.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2HchhLgGj16aITZGVy0hqA"
  },
  "zicWAcWeNFAbwFSpGMBbWQ": {
    "date": "4/24/2018",
    "text": "My go-to-spot for dim sum in Singapore. You can find most of your typical dim sum dishes (siew Mai, har gao, rice rolls, BBQ pork buns, etc) plus more, such as soup dumplings. You have to also try the green onion pancake, as well as the chili wontons!A filling meal for two ran us about $30 SGD, which is a steal. Only reason why I gave Swee Choon 4 stars is because the auntie at the the counter was annoyed when I told her I didn't eat the appetizers they put on the table, which we knew they were going to charge us for. If you're not going to eat the appetizers, be sure to tell the waitress to take it away or else they'll charge you for it. Aside from this, I think swee choon is great for the money if you're looking for dim sum in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O8ffp1_MJ-JT60URuFHPtQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O8ffp1_MJ-JT60URuFHPtQ/o.jpg"
      },
      {
        "img_id": "KNY_d5EWeBdBzRT7rZk8KA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KNY_d5EWeBdBzRT7rZk8KA/o.jpg"
      }
    ],
    "user_id": "O1IHgZxE598LJruKtC6-dQ"
  },
  "4I9vEVBniddgAaqUdg10OA": {
    "date": "1/26/2018",
    "text": "24 hour dim sum place, plenty of seating, fast service. Good variety of dim sum dishes offered. Would recommend if you're in this area and want a quick bite",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pEbqC2KNLeLaueNCF8FS_A",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Siu mai and har chow",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pEbqC2KNLeLaueNCF8FS_A/o.jpg"
      }
    ],
    "user_id": "HN-2o_s91nULyyIBa7x2Vg"
  },
  "oRwm_oGM8N-CEFTeK0CEIA": {
    "date": "12/17/2017",
    "text": "Portuguese egg tart.  Not too sweet. Flaky layers of crust. One of the best. Bao with creamy inside.  Very nice while hot. Xiao Long Bao. Soup is nice. Juicy meat on the inside. Sticky rice with chicken. Carrot cake. Crispy edges. Late night eats.Just say yes.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jkpoqazWG-eLowpJYhQKoQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jkpoqazWG-eLowpJYhQKoQ/o.jpg"
      },
      {
        "img_id": "qRgaDCF4Uab5mETVL7ihDA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qRgaDCF4Uab5mETVL7ihDA/o.jpg"
      },
      {
        "img_id": "TbPeRT8g_Z2AlHOtzxeYAQ",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TbPeRT8g_Z2AlHOtzxeYAQ/o.jpg"
      }
    ],
    "user_id": "p5mdhMG7DZasN7qh8DlqMA"
  },
  "WbFabWmFcNBRZsRi6iCHew": {
    "date": "11/24/2017",
    "text": "Char siew baoSiew maiPlain chee cheong funSwee choon mee suah kuehSichuan chili oil wontonSliced duck in crispy spring onion pastryOnion pancakeCucumber and black fungus saladXiao long bao",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kiKyT3FN1H3d3jSTU5I3zg"
  },
  "MW5bxMHafvEJoTqLzdXKfw": {
    "date": "3/2/2017",
    "text": "The dimsum of Swee Choon can easily stand next to the more upscale versions in town and now they are open for lunch too plus they still serve the late night crowds!Their custard buns are hands down the best version I had throughout Singapore and one of the reasons to come back. Other things I like include:Xiao Long Bao, Egg tarts, Har Kau,...The no-nonsense efficient style of the restaurant makes me forgiving for the lack of contact between the servers and the customers and unlike at other Chinese restaurants in town, I've never been given even as much as an eye twitch that I don't speak Chinese.Love it!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_B-KVnTa8pOC3mk5xFap9w",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Yelp recommended",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_B-KVnTa8pOC3mk5xFap9w/o.jpg"
      },
      {
        "img_id": "bI9cuZeeGjYmIJ05GmWFfg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Now also open for lunch!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bI9cuZeeGjYmIJ05GmWFfg/o.jpg"
      }
    ],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "kDi3KQt1NkZvgqfz3K7BGA": {
    "date": "5/4/2017",
    "text": "Maybe it isnt the BEST dim sum in singapore but i only had once chance to eat and it was CRACK. It stays open late night and has the bomb dim sum full of locals eating. We ordered like 10 things for 25 bucks. The soup dumpings, xiao long bao, hot and sour soup were amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C5087LMDDBFI9F0qz5yzQA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C5087LMDDBFI9F0qz5yzQA/o.jpg"
      },
      {
        "img_id": "B561wpXqEg4jWBpYJYFH3Q",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B561wpXqEg4jWBpYJYFH3Q/o.jpg"
      },
      {
        "img_id": "unbeZR09x_2lUDLGGTkXMg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/unbeZR09x_2lUDLGGTkXMg/o.jpg"
      }
    ],
    "user_id": "DhQtPZuLwwbdVoxjUVmpnw"
  },
  "ogpbsF2vUkd-RjkgU2D0CA": {
    "date": "2/23/2016",
    "text": "I felt this place was like a 3.5 but I decided to push it to a 4 for a few reasons:1) Late night dim sum. There aren't a lot of choices.2) Good organised queuing system. We came around 8pm on Sunday and we actually got seats immediately despite the queue coz we were only 2 and ok to sit in the alley at the back.3) Pleasant service from the 2 or 3 different guys who served us.What I ate:1) fried garlic dou miao for 8 dollars. Worth it!2) char siew bao - love the filling, but the bao skin was a bit too chewy. Actually all their bao fillings were good! We had also the lotus bao, the custard bao (nice molten without being too liquidy ie my friend who likes custardy type and I who like molten were both quite happy)3) cheong fan - no filling but we had a craving having missed it recently at pek kio when it was closed for CNY and wow nice surprise. So soft and smooth! Looks simple but all comfort in the mouth. This was one of our favourite items.4) Xiao Long Bao - Came quickly and was surprisingly good. The skin was quite thin, lots of juices. A bit lighter and finer tasting rather than lipsmacking greasy but very tasty.5) Egg tart - yum. Smooth light texture for the filling, quite sweet though. Good sized.Tip: Do not order lemon tea unless you want the canned Seasons one. I was hoping for homemade...A few other comments:I haven't been here in many many years. There's lots of choices on the menu and also cooked dishes for variety. Streetside parking around but need to be patient. Old school tea served in a teapot with a cup that you can sterilize in the saucer of hot water. My expat friend who has lived in Singapore many years was not sure what to do with the hot water so I had to explain. Haha nice touch.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Ej8EZ9I-A-BUU6emGqTntw",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ej8EZ9I-A-BUU6emGqTntw/o.jpg"
      },
      {
        "img_id": "hsQa7UO9ea5vDZauVt6REg",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. $3.80 or nee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hsQa7UO9ea5vDZauVt6REg/o.jpg"
      },
      {
        "img_id": "RKfPVz5L_DAPHFsGKf70zA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore. Super yummy coconut pudding $4.80",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RKfPVz5L_DAPHFsGKf70zA/o.jpg"
      }
    ],
    "user_id": "a7y3gCq9Vwv89NRtUTtyJw"
  },
  "6EKGl3kwoze1opG0Z3VGZA": {
    "date": "4/27/2018",
    "text": "A friend brought us here. Go for it if you want some dimsum:) I think it is good for late night suppers",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4i8LK0xXm66DEFxUok2Bg"
  },
  "K6Aj4nVzQI0NJRBHU1om2A": {
    "date": "3/22/2018",
    "text": "Pretty much the go-to place for late night dim sum.Never fail to get the fried mee sua kueh and the custard buns when I'm here.Quick service, decent prices, air-con seating (mostly). Gets really crowded on weekend nights though!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQ6MAHSW4jTAzGRUvio1yA"
  },
  "31iSsxDy-gnk8PBNiZsAMg": {
    "date": "11/12/2017",
    "text": "There are a really no words to describe the eating here! Best best dim sum ever.  Jesus it's good.  Hole in the wall place, lined up, wait, you will not regret waiting for this unbelievable eating experience. It's fast pace, loud and very organized.  The turn over is huge, but not rushed.  I went twice when I was In Singapore - don't let this pass you by!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGAE6-9_mDkVinziGLFoBQ"
  },
  "vZi5jC69B2iNqFYhIOK5LA": {
    "date": "12/18/2017",
    "text": "Reasonably priced dim sum. Able to accommodate alot of people. Can get noisy. It's OK when you're seated indoors. But outdoors at the back can be really gross due to the drains and lack of shelter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wI-FRyUMIRU4IzybNIHfCQ"
  },
  "PfEISibgWaFx06QlOqL7Jw": {
    "date": "6/17/2016",
    "text": "Good menu with lots of options. Has enough for you to find something you like that keeps you coming back (like yours truly), or to keep you coming back to try new things.The service plays it fast and loose and everything from seating to ordering, serving to payment moves quite quickly. No worries if you can't speak a lick of anything other than English, as writing on order forms, pointing and gestures usually end with the desired result.The dim sum is quite good, and most of the items are enjoyable. It's an evening and all night place that is closed on Tuesdays (learned that the hard way).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tCjd1prcjHes8mEXhOT6NA",
        "caption": "Photo of Swee Choon Tim Sum - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tCjd1prcjHes8mEXhOT6NA/o.jpg"
      }
    ],
    "user_id": "0hyjr9dCQhudwTDQk1LT6g"
  },
  "-0_iNkPrJEjGq2SHH9pCXQ": {
    "date": "12/3/2015",
    "text": "My go-to place for dim sum at 2am!Order the: fried mee sua cake (carrot cake made out of mee sua), the peitan porridge, xiao long bao, siew mai, har gow, even the sauteed veggies. I think u cant go wrong with most of its dim sum items EXCEPT for the chee cheong fun. That made me sadHavent tried the handmade noodles yet; thats next on my list. It can get very busy on the weekends, with long queues snaking outside, but there is a takeout window which moves pretty fast.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GQh4KSCygodKKum529q_LA"
  },
  "Z8yw26-Mg86LMqVaIZUgeA": {
    "date": "4/18/2014",
    "text": "I wouldn't call this a dimsum place per se, but a place that serves dimsum items and some Chinese food.Favorites:Custard bunChicken feetShanghai wonton soup**Prawn and banana fritter**The rest of the items are palatable/acceptable, and order whatever you want. I've had a few late nights here with a girlfriend, and we've never gone over $35 for two people. Have I mentioned the best part is that it opens till dawn?",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "b5RUVhLv5a-bPSx6J6seOQ": {
    "date": "8/8/2016",
    "text": "Known for its late-night dim sum. Quite a fan. Our group was seated immediately as we were willing to rough it outside with their alleyway seating instead of waiting for a table inside (which is air-conditioned). It wasn't too unbearable outside; a tad bit warm, but definitely worth saving 20-30 minutes of time waiting.Service was fine. They had a button on the table you can press and a waiter will come over pretty much instantly. Very efficient this way.The food was very good. One of the better dim sum places I've had. I think this would be the first time I've had dim sum in the evening. You won't be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HXkgU0zTESSX7udfwk80jA"
  },
  "KxiHULNuVjwZjzhyU9WC1w": {
    "date": "5/28/2017",
    "text": "The egg tart and char siew bau are great. It is nice to have these Tim sum for ending the day. You can see many people sitting there and make you feel it is still early in the evening. It is not expensive and you can feed your stomach easily. Try it especially when you stay near to this restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wr68eyADJbJkLgZfKoiJhg"
  }
}