{
  "G_rqOQJAoMN1ZcUGpYv6fg": {
    "date": "12/21/2015",
    "text": "I spend at least $13 here (can't resist avocado), but i have to tell you this place is worth every dollar. Why?1) Their portion is huge! I'm a big eater but the regular size is enough for me because they give a lot of meat / protein. For the $1 avocado upgrade they'll give you half an avocado.2) everything is tasty. The meat is only slightly marinated and always juicy, even the chicken breast. Quinoa is always cooked perfectly.3) love the dressing. My favorite is the ponzu ginger dressing4) .. And i love that they automatically serve without dressing, giving you full control of how healthy/unhealthy you want your meal to be.5) they got their operations down. Even if queue is massive at lunch, you likely won't have to wait long. Getting a seat is another story though..In conclusion, definitely one of my favorites for lunch in CBD.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "WjFI4zVmeDkA7c3tcOy3-g"
  },
  "yan9vWYXG_aovx0zUuKoEg": {
    "date": "8/18/2017",
    "text": "H E A V E N  the best value around town. be ready for a long line - you know it's worth it!! surf + turf is my favourite.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6N4HrqeP1vY_FbZ-1VRf2g",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. surf + turf",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6N4HrqeP1vY_FbZ-1VRf2g/o.jpg"
      }
    ],
    "user_id": "mf5wrQTAG3G4KGcqiMsdNQ"
  },
  "2q95dmwdA8RGQ1x_d5431A": {
    "date": "1/10/2017",
    "text": "The daily cut is an underground saladbar in near Raffles Place. Before ordering, you have to fill out a form in which you select the size of the salad, the type of proteïnes, carbs or greens, toppings and vinegrettes. Depending on the size, you can one or more of the above. I took a small salad to go, with chicken breast, romain lettuce, brocolli, zuggini, parmezan cheese and honey mustard dressing. Perfect light meal after a hot day.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kPKqxTMWxdKU607kv53QVw",
        "caption": "Photo of The Daily Cut - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kPKqxTMWxdKU607kv53QVw/o.jpg"
      }
    ],
    "user_id": "O5c8SgONRdgDdej4A9W1KQ"
  },
  "Xya29wS3S4eH3f5hLgID8g": {
    "date": "10/1/2016",
    "text": "Love this venture for its healthy and TASTY food! Always a lot of gym and office people eating out here. It's a hit! Great branding effort in building such a healthy line of food around the vicinity. I'll always come here for my post workout meal. I can actually have this the whole day. It's fast! I placed an order, paid and got my 'food parcel' in less than 2 minutes. Really efficient. I like how my salmon, beef and chicken taste so good with the smokey grilled flavour. And it's not at all oily. $14 for a salmon pack. For some, it may probably be on a slightly higher side as an everyday lunch pack, but if it's healthy and tasty, I wouldn't mind paying more for it. The beef steak quality in terms of taste had dropped a little compared to when it first started out. Nevertheless, still great!The Takeout package (see pictures) is chic and fuss free. It's almost like a new way of dining quick and chic. I've been a loyal patron for good 1 year. Weekend crowd is good, almost all seats taken on a Saturday afternoon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mp3RZ25iUG_GLY7f_SGE1g",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. The takeout package parcel. Salmon pack. Don't forget to take their sauce.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mp3RZ25iUG_GLY7f_SGE1g/o.jpg"
      },
      {
        "img_id": "dkoISukzPNOstadnWRfACQ",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. Salmon pack ($14) drizzled with mustard and BBQ sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dkoISukzPNOstadnWRfACQ/o.jpg"
      }
    ],
    "user_id": "j21GdRmmPI2vzVVxaYpKbg"
  },
  "dluTXsRFv2sWU7S_iBu08g": {
    "date": "2/2/2015",
    "text": "I am slowly exploring and liking the variety of food here in the CBD area since my new office will be within walking distance from Raffles Place MRT station.  I got to know this place from Yelpers' check in (both Steffi and Ricky S) and reading from their positive reviews, I just have to try it out myself. I decided to pay The Daily Cut a visit on Saturday late afternoon (5pm) post gym and was clueless and confused as I couldn't locate the place at first. I believe I was at the right place based on the listing address on Yelp, but everything was closed. That's weird considering the shop is located inside a shopping center. I gave up and settled for something else that afternoon. Then on Sunday, after a short workout at the gym, I decided to walk down to the basement again to look for the shop and tadaa! I finally found it. First thing first, they have no signboard so you have to open your eyes wide as you come down from the escalator. It's the first shop on your right hand side. The address listed is correct, so no sweat! I really liked the food here. Ordering is easy - you just have to head to the small pop-out table, get your order chit and tick whatever you fancy. There are 3 size options to choose from, regular / large or beast each cost $12, $15 and $18 respectively.  Each size will give you 1, 2 or 3 proteins, 1 complex carbs, 3 toppings and 1 dressing. Of course, if you chose a more premium option, you have to add-in additional $1 or $2. My combinations of sirloin steak on a bed of romaine lettuce with sides of sous vide egg, couscous and sweet corn topped with vinaigrette was very, very good. The price could be a little steep but I wouldn't mind paying something extra for good and fresh food. I heard the queue during lunch break on weekdays can be crazy and everything tend to sold out by 3pm! I am definitely coming back for more but as at now, i'm good just to come down here for an occasional indulgence on weekends when it's quieter and not having 20 people staring at me while waiting for my seat.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ruT-hbGMgYfTWroHU1sImw",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. simple and beautiful signboard. i approve!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ruT-hbGMgYfTWroHU1sImw/o.jpg"
      },
      {
        "img_id": "4KSK2Qo3flTzPbgMqVClyg",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. 1 protein + 1 complex carbs + 3 supplements = $13",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4KSK2Qo3flTzPbgMqVClyg/o.jpg"
      },
      {
        "img_id": "crQlESYL0fXDzcf8CM-VYw",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. Post gym fuel.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/crQlESYL0fXDzcf8CM-VYw/o.jpg"
      }
    ],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "xgKybC90v7S179j5y8QMow": {
    "date": "12/14/2014",
    "text": "Friend introduced me here for lunch one Saturday. I was surprised at how many patrons were here even during what's normally a ghost town during weekends at Raffles Place.A lot of the patrons looked like they had just come from one of the many gyms upstairs (Virgin Fitness, Fitness First, Pure Yoga, True...) and I'm not surprised they all frequent the Daily Cut as the ingredients seem fresh, healthy, and dare I hope even organic? Probably not that last bit but one can hope!Prices seem a bit on the high end but I love how you can customize your order from regular, large, or beast mode with any combination of carbs, proteins and other add ons to make perfect your favorite concoction.The Ginger Ponzu dressing is awesome!Don't even think about coming here during a workday lunch hour as the line is insane.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "41Ix4AUJABBOilfTbFe2-w",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. Beast mode: steak, chicken, tofu with brown rice, sous vide egg, kidney beans, sweet corn, avocado and ginger ponzu dressing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/41Ix4AUJABBOilfTbFe2-w/o.jpg"
      }
    ],
    "user_id": "hRMpQlJQDObCpNSJ1qd_fA"
  },
  "gEIv_br5gI4PE13mfRkYVg": {
    "date": "3/3/2017",
    "text": "I've been going here for a couple years now, and this place is one of the best places to get healthy food in the CBD.Options are plentiful, but the quality for some of the stuff has dropped over the years (the ribeye, for example, used to taste a lot better when they first opened). They get points for innovating though. They've been constantly experimenting and adding new stuff to the menu. I'll still come here whenever I want healthy food (the queue can be a bit much on some days though).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDLD3uSYOUMI3jM38zFtoA"
  },
  "-unEr28O8PU5jO7IQUizyA": {
    "date": "11/15/2015",
    "text": "Love the food here! Not the cheapest or fastest place for food in CBD, but definitely worth it for a good salad!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3g_vgaCNlvR5uKmUkSz8Rw"
  },
  "2Yd8BRp3XsfdpC3rHMd6TA": {
    "date": "4/17/2015",
    "text": "Let me declare that this is by far the most value-for-money healthy option in Raffles Place. If you take the ratio of meat, vegetables and complex carbs you're getting for the price, it is very hard to beat. I mean you could tell the Chinese Western auntie/uncle on the 3rd floor of golden shoe to grill your chicken with less oil, buy stir-fried broccoli from the cai peng stall and microwave a sweet potato in your office microwave but let's face it...that's ALOT of work.I like the grilled chicken thighs, though the dude and people who don't like to deal with skin opt for the chicken breast. The steaks are tenderized in a machine and are grilled medium done, but I think most people aren't complaining. They are generous with the walnuts, sweet potato, broccoli and boy do I love cracking fancy schmancy \"sous vide\" egg over all the aforementioned food. The word \"sous vide\" just cracks me up (yes pun intended) because it sounds overly fancy for what really is an unnecessarily long procedure. I supposed cooking an egg below the boiling point of water for a looong time ensures more consistency than the elusive chef that can poach eggs with the magical runny centres you see in ramen bowls. Maybe all the chi chi brunch cafes in Singapore should get sous vide machines so that they can legitimately call their money makers eggs benedict for realz.Right, back to Daily Cut. What don't I like about it? The super long butt queues and the fact that plain food gets bland quickly. I have tried queuing or getting friends in the area to queue at various times between 11.30am to 2pm and have only found two time slots where the order queue was short and even then, the collection was still ridiculous. Nope I'm not disclosing what those time periods are but let's just say, it takes eating at DC very frequently and some routine experimenting to figure it out. I hope either of two outcomes will materialize in the next year: the DC owner studies his assembly line and figures out how to expedite the process (clue: color code and number the order chit into sections and do the same for the food bins, so that your employees just have to glance (as opposed to re-read the chits 2-3x) at it and STRICTLY assign each employee to a segment so that they don't move around and mess up the line) or competitors in the area wise up to this very profitable, high volume business model (overpriced Korean shop and the Romanian SMOR brothers I'm looking at chu). DC's food is plain, doesn't require a perenakan grandma stirring buah keluak for 10 hours and literally sells itself because no one else is giving the huge middle class (read: its ok to charge up to $15 for 2 proteins), health conscious (read: the coconut water ruse works here) crowd in the area what they want. The value proposition doesn't get any more obvious when you realize Daily Cut is unrecognizable except for a picture of a salmon on the wall and the long queues filled predominantly with English speakers.So yes, Daily Cut is awesome. But it can become even more awesome (and profitable) if they speed up the food prep.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "2zbO5Cpuu0svXn3br0T84Q"
  },
  "hTQF7dId1haBdy5iK184LQ": {
    "date": "7/26/2015",
    "text": "Open more locations!I just love this place. It's simple, no frills, and delicious. I was worried that the normal size wasn't going to be enough for me, but it was. The ingredients are fresh and tasty, and I want to come back for more. Too bad I don't live or work nearby.If I really wanted to complain about anything, I'd complain about the lack of seating and as a Californian, the avocados could be a bit better.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t4o8mWvFo5Q7vwT94h1zaw"
  },
  "5dqrO32yEiWa6tOHMvPuVQ": {
    "date": "2/14/2015",
    "text": "I've been on a healthy diet/exercise-streak recently.. Or at least I've been TRYING to. There was a feature on Paleo options  in the local newspaper a couple of weeks back, and while I'm not exactly a fan of the Caveman diet (too many things to give up- the rainbow cake did not exist in the time of the Flintstones), a low-carb, high-protein option is what I've had in mind.The Daily Cut is my current to-go. It may not be my favorite, but it IS the most convenient (my gym is in the same building), and provides a good-enough-selection to satisfy.To start, grab an ordering chit from the right side of the shop and choose your items.You can choose between small/medium/large options (variations in the amount of proteins you can get). A basic meal starts at $12 but can get more expensive quickly. So your most basic meal comes with a choice of 1 protein, 1 complex carb, 3 random sides. For proteins, so far I've only tried the steak (add $1). It's decent, but a bit too well-done for me. An alright piece of steak but nothing more than that. My usual sides would be either the brown rice or wholemeal pasta ($2). Both come in generously large portions, in fact it's a bit of a struggle for me to finish my carbs. I would recommend the egg as one of your sides- it's cooked sous vide and has a really interesting texture, though recently it's been a bit cold and tasteless. My favorite side is the avocado ($2, I think), you get a half avocado which is usually perfectly ripe and delicious though I've had one miss when the avocado was a bit too unripe. The mushrooms ($1) are also good, they're cooked, not straight out of the can, and go really well with the rice.There's a selection of sauces (honey mustard, mint, ginger ponzu, Thai, barbecue) at the side but I don't like any of them.So why 3 stars? Well, it can get pretty expensive- the price for add-ons is ridiculous (especially when compared to Munch Saladsmith just 10m away) and I have no idea if this is tastebud fatigue but it seems not as yummy as before. Nonetheless, a great option that I'll be frequenting.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "GfKyxRn-sX0nRoh8smIdcQ": {
    "date": "1/14/2015",
    "text": "I REALLY like this place. It has been a struggle trying to find a good salad in Singapore ever since I moved back fromCalifornia but I love the variety of greens they offer. It's not just the variety, it's also the execution and the quality. The sirloin steak was extremely tasty, with a great smokey flavor, juicy and peppery. The eggs are sous vide instead of the normal boring hardboiled, and served warm! The corn was fresh whole kernel corn, which was super sweet. The avocado, well, they just scoop it out fresh, so it's as fresh as it gets. I love that they have grilled sweet potatoes as a carb, and quinoa and brown rice as well. Hell, they even have edamame! Gonna try the grilled chicken thigh or turkey breast next time. Yum!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "Idduw5u6qDYZn-V1d-62KA": {
    "date": "12/17/2014",
    "text": "I'm a fan and head there from Orchard area once a week, simply because I love the healthy choices of ingredients that you can order, and that it is a reasonable $15 after all the add-ons.But I dislike how they try to charge you $1 for mushrooms, or Steak, and other stuff that adds up, and then when I went there for lunch at 3pm on a Thursday, they were out of some things and gave me almost $18 worth of salad and toppings for $10!And I went there at 12:40 noon for a salad and they ran out of Lettuce!!!!As of now, I can't eat any dairy, carbs or grains, so, what choice did that leave me?Not a preferable one!I'll still go there, but not if another similair salad joint opens up close by.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KxvJJTsFqDKnuXYXO4tyog"
  },
  "irmvKsJuEHQDpoGsqs-6FA": {
    "date": "6/30/2015",
    "text": "Love this healthy option, conveniently located on my way home from work. This place is a true gem, healthy options, nice portions and all at a fair price. Making healthy eating suck less... True story!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nQRJuIksJ4LGs-T8Z9-aqA"
  },
  "dFGIJzfh7uO2g84RtiOUkw": {
    "date": "9/17/2014",
    "text": "I really wanted to love this place. High protein, low carb, great for post workout, right?  I think the first 1-2 times I went when it first opened, it was great, but it has fallen majorly short of expectations ever since.  First, value wise it isn't worth it. Yes, it starts at $12 but if you choose salmon, it's an extra $2, if you choose steak it's an extra $1, if you get turkey it's extra as well, if you choose mushrooms it's extra too..you get the point.  Second, the meat is dry.  Dry as heck.  Even when I tell them before I order, that last time it was dry, can they please make sure they cook it to order so that it's not dry...it's still dry. This goes for the steak, and the salmon. Third, the salmon is sooo burnt.  I don't want to go to a self-labeled \"health food restaurant\" to ingest charred carcinogenic chemicals. So then the fact that I have to scrape away 25% of my burnt salmon further reduces the value of this meal.  I don't remember the meats being so burnt when it first opened, maybe they need to clean their grills!",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rSsipFrWN6Z10P5lKywxMw",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. Whole wheat pasta with quinoa, steak, avocado and corn",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rSsipFrWN6Z10P5lKywxMw/o.jpg"
      },
      {
        "img_id": "MMoXDvtB4YIVtCVhb9oEZw",
        "caption": "Photo of The Daily Cut - Singapore, Singapore. Salmon with brown rice, quinoa, avocado, grilled button mushrooms",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MMoXDvtB4YIVtCVhb9oEZw/o.jpg"
      }
    ],
    "user_id": "velzbr5_h-6xhr-o4mn4sQ"
  }
}