{
  "MEM4J2pPn8DUVpcd77rVlA": {
    "date": "1/6/2013",
    "text": "You can do much better than this place if you explore Singapore.  The stalls are boring from my perspective, after seeing the rest of Singapore.  It is on the expensive side as well.  If you enjoy bland, safe, and food the locals leave to the tourists, then this is your zone.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxoQQysPJ9R1k_EenVJ9hQ"
  },
  "fIHsNxwRyayH32q4L0prsA": {
    "date": "11/1/2012",
    "text": "Food Republic is a big food court along Orchard Road. It's more expensive than the hawker centers in Singapore. The food is pretty good though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpeWwIKQGMxhmCV4kvAqBg"
  },
  "oM-GwVKxsyHa7vwaQLi0qA": {
    "date": "10/17/2012",
    "text": "I only ever come here for the shiok maki at the Japanese stall. For the uninitiated, that's an unagi and avocado roll wrapped in seared salmon and topped with roe and creamy mayo sauce. Normally I hate mayo but this one doesn't taste gross. Expensive and your arteries will likely protest but they can stand to shut up once in a while.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D6-pwyZgXy8wxFy-NbCWCw"
  },
  "3rPtDgAVmKkGiSUrN4zmhw": {
    "date": "1/8/2013",
    "text": "let's say you want to be inside, (full AC), experience the fancy mall-like food court rather than outdoor older hawker centre, don't mind successful franchises, then a food republic food court will feel safe and easy.  sure more expensive, but singaporeans take food seriously -- where else will you find food courts upstairs and downstairs in the same mall?  and even separate kopitiams.  therefore with more discriminating eaters, even the chains are better.  I say try both here and the hawker centres.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kS1MQHYwIfD0462PE61IBw"
  },
  "WyD7MoW4yQteGBPeOn2rjg": {
    "date": "11/15/2018",
    "text": "Found this place when I had an extreme craving for Xiao Long Bao (XLB) and went to Din Tai Fung.  Prior to arriving I found myself immersed by plenty of aroma that made me question if I were in Foodie Heaven.  How jealous I am that a food court like this does not exist in California.If I could copy and paste this paradigm to where I live, I would become a millionaire because there will be an interminable demand for food like this from where I come from.Also, in the center of this chaos of amazing food, there's a woman quietly selling these amazing tutu coconut or peanut steamed cakes.  I bought 5 for 3.50Sing$.OMG they were sooooo good!I'm coming back here tomorrow and the next day before I go home and cry because I won't be able to walk to this place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pMltyeuU4SjT6Y8YVy7HBA"
  },
  "CYXGwP9awLbTzZm9hY_-cw": {
    "date": "3/16/2018",
    "text": "Food Republic at Wisma Atria has renovated and it is even better now.I will say skip the other ethnic food and stick to local food. The safer way to tell which stall is good will be by how long the line is.I only tried the food twice since the renovation. But based on what I had, I liked the Yu Kee Yong Tau Foo very much. I have always like this brand and only had it at Bishan outlet and the old food court at Orchard Emerald. So I am very happy it is available here.The items are standard, different from the other yong tau foo stalls, with 5 pieces of tofu and fish ball/fish cake and the noodles are topped with minced meat. I like the set which includes a side of kang kong drizzled with fermented bean curd. So yummy. The soup is also very sweet and tasty.The mee pok stall is also different with fish maw in it. It is not the best bak chor mee but it is decent. Good choice for Orchard Road. The or luak (oyster omelette) was also nice, especially the chili. Skip the Korean ginseng chicken soup which was very bland.Currently there is a 10% discount if you show your passion card.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cx4N846mDM96QyVptv91HQ",
        "caption": "Photo of Food Republic - Singapore, Singapore. Oyster omelette",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cx4N846mDM96QyVptv91HQ/o.jpg"
      },
      {
        "img_id": "zG-8fo5xEnrFeYYb4xQk3A",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zG-8fo5xEnrFeYYb4xQk3A/o.jpg"
      },
      {
        "img_id": "SjxWpzVxv7osi8lQVavwIA",
        "caption": "Photo of Food Republic - Singapore, Singapore. Teochew dumpling soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SjxWpzVxv7osi8lQVavwIA/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "2Ikb5vtNzqvNlF-7iDf0Vw": {
    "date": "5/6/2018",
    "text": "With a recent revamp, Food Republic did a good job at changing the mix at the Wisma Atria location. The company also runs Food Opera at ION Orchard, and the food court at Isetan. They complement one another well, and local workers can navigate among the three without feeling bored. Don't know why the sushi and teppanyaki counters are there, since Japan Food Town is literally next door and so much better (also pricier).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VOJBqSxveGL5Gy7kgbH8aw",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VOJBqSxveGL5Gy7kgbH8aw/o.jpg"
      },
      {
        "img_id": "caKSwoR0CuJKmJr-0i5nnA",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/caKSwoR0CuJKmJr-0i5nnA/o.jpg"
      },
      {
        "img_id": "M4IDswSv6ma6BVoBrwQgyA",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M4IDswSv6ma6BVoBrwQgyA/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "87pFWx58viwIo5ygeeqt1w": {
    "date": "5/20/2018",
    "text": "Lots of good options. But overwhelming, but just follow the crowd and you'll end up with something tasty. The hainanese chicken shop here is really good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyvycwZSdJd-WAJt9fKd0g"
  },
  "WPYi40h2yg-oxN74oNMuwg": {
    "date": "11/18/2015",
    "text": "Ordered Japanese food at Goen. Black udon & W-Katsu Curry Rice. Ok taste. But when you are hungry, that's another story.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MaX72iUwGY34dk5kJCXkYg",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MaX72iUwGY34dk5kJCXkYg/o.jpg"
      },
      {
        "img_id": "-aj2Tg8V4zwgdmXR2G8bUg",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-aj2Tg8V4zwgdmXR2G8bUg/o.jpg"
      }
    ],
    "user_id": "MNQRoT1t4Yh5nqBZMmw7Lg"
  },
  "Hg5M9cXPwt_tXz_7JFNtJw": {
    "date": "12/18/2015",
    "text": "A good place to visit when you can't really decided what you want to eat, just because this food court give you a variety from la-mian, fish soup to BBQ Chicken Wings Love the chicken/pork cutlet noodles here. You should always go for double cutlet upsize because only additional $0.50 more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Q2GYf4LGZiJ-r3kvKvGWg"
  },
  "F_WiEul60kZ8qdvsDCyQJg": {
    "date": "5/12/2015",
    "text": "Say you want cheap but you're a little too intimidated for a full immersion experience at the hawker centers? Start at Food Republic. It's a food court with stalls representing food from all over Asia. We tried several stalls and the Hainanese chicken rice, the Indian stand, and the avocado ice were all really, really good. The options are seemingly endless and everything is clean, with lots of corners for finding a seat. The decor is of course not legit, but it's still super cute.  Only caveat - there are no napkins.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CzzbI6rcGYVkb5_IbltgnQ"
  },
  "lgDXn-XcJTsdkeqc2PqauQ": {
    "date": "3/23/2014",
    "text": "For those who want a slightly upmarket hawker centre experience and with air conditioning - Food Republic at the Wisma Atria shopping centre on Orchard Road. I have been to this food court numerous times in the past few years and have had good experiences on all occasions. Expect to pay higher prices than hawker centres but it is a sophisticated atmosphere.Of note, the stall selling fish bee hoon soup has a very good soup base, better than many other such vendors across the city. The special prawn noodle served in a bamboo leaf from the wok stall is also very good. The charcoal chicken wing stall is also very popular as they grill the chicken wings basically to order.The Yong Tau Food stall is good value with a minimum of 6 pieces. Get it with some noodles or rice and you have a substantial meal for 2 people.There are ladies pushing carts around with various drinks so you can just get your food and sit down and not worry about going to the drink stall.There are plenty of tables/seats and there is also a few 'hidden' areas if the main areas look like they are full - just head towards the far corners and look for the signs for 'more seating'.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FO1i86LA-TMiO4qVaKp6MA",
        "caption": "Photo of Food Republic - Singapore, Singapore. Special prawn fried noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FO1i86LA-TMiO4qVaKp6MA/o.jpg"
      },
      {
        "img_id": "XyZffJlSl9pRfqTQAoOUVA",
        "caption": "Photo of Food Republic - Singapore, Singapore. Seriously we need food court like this in #sydney #singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XyZffJlSl9pRfqTQAoOUVA/o.jpg"
      }
    ],
    "user_id": "eHtvxIiga_BgddCqLgyV0g"
  },
  "tBjIiUgEYY_u0WGzpEaOHQ": {
    "date": "2/5/2014",
    "text": "One common thread that Singapore has are the numerous food courts.  You can't walk more than 50 yards before you see a sign blaring \"food----\".  This being our last night in Singapore we wanted a sit down place and order off a menu.  We walked around but it was one food court after another.  We finally bit the bullet and settled on this one.  This food court is more appealing as it's located on the fourth level as opposed to some other ones tucked away in the basement.  After circling around I settled on stall #06   Pork rib noodle soup $6.50 SGD and prawns $3.00 SGD added on.  Tasty broth.No more food courts for me!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LOi1qbpl2hTP0cwSDDuyBQ"
  },
  "-L6i4V_mHx9yB7Ufz9bBRQ": {
    "date": "3/24/2013",
    "text": "The most incredible food court I've been to in the world! It seems strange to even call Food Republic a food court because it's so much nicer and fancier. The tables are mostly large wooden tables with big benches. It's so tough to choose where to order from because so many of the options are amazing. There's thai, chinese, and lots and lots of noodles! You can easily purchase a great, large meal (even from multiple booths) and a drink for less than $10.I stayed across the street from Food Republic for about a week and came here for lunch almost every day. My favorite station made fresh noodles on the spot and put them into soups with amazing broths. The bowls were big and delicious. In addition to all the amazing food options, people move cards around the tables with great drink options such as fresh coconut juice. If I have the opportunity to go back to Singapore, I'll rush back to this \"food court\"!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 8
    },
    "photos": [],
    "user_id": "dfYNTBw--CYlZbFz581kYQ"
  },
  "ZUHarPzxwjBPOZm2U0lyew": {
    "date": "5/21/2013",
    "text": "Best food court eveR!!If you're a tourist like me, you'll pass this court on your way towards the Sentosa Express. The place is always bustling and filled with all types of food from many different countries i.e. japanese, indian, taiwanese, vietnamese, indonesian, korean, etc, etc. For example my varied lunch that day consisted of dim sum, indonesian bbq chicken and rice and nasi lemak. Wtf?? The food options can make you quite dizzy if you don't know exactly what you want. Anyways everything I had was really good but I constantly remember how amazing that Indo BBQ chicken was *drool* Also, the place is kept exceptionally clean for how busy it gets. I might just be an easily amused tourist but if I ever visit Singapore again, I'm definitely coming back here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-xQ2Cmi9LvdpGldH3CJKA"
  },
  "laZfZQZ3LiyVs__fXUSXQA": {
    "date": "8/27/2012",
    "text": "If you find yourself shopping in Wisma Atria and you felt the need to grab something to eat, then head off to the Food Republic at the 4th level. You will be welcomed by a variety of cuisines and sometimes an overwhelming crowd. I try to come here for lunch around 11am to beat the usual lunch crowd. Queue's are shorter, and more seats to choose from. My favorite is the fish stall where they serve a variety of ways of cooking fish-deep fried and soup. I tried the deep fried dory twice and it was just ok but when I had the soup dish, it's the constant thing that I order every time I'm here. Also, when it comes to beverages, I don't need to come up to the drinks kiosk, I can just wait for auntie to pass by with her cart of refreshing drinks. One time when I was trying to veer away from the usual lime juice that I order, auntie was really helpful in suggesting other drinks and I opted for the lychee-just to try something new.When you come here, and it happens to be crowded, remember to look for more seats through those corridors and not just settle on the seats you see. Chances are, you might end up a window seat with a great view of Orchard road.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0BDSWvbx_qniTVlKKHZEdw",
        "caption": "Photo of Food Republic - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0BDSWvbx_qniTVlKKHZEdw/o.jpg"
      }
    ],
    "user_id": "AWPy2uveUH8ZLgNF9toO7g"
  },
  "-PlXufoYZJkMjbwhSV2TNg": {
    "date": "7/22/2012",
    "text": "The newly renovated food court at Wisma Atria Level 4 is finally open to public about a month ago! The folks from the Breadtalk Group really know how to make a difference with their food courts - which gives them such an edge above the rest. Each food court has a theme - though most of it relates to our Singaporean heritage, there are some subtle differences. For the most famous Food Republic (and probably with the most expensive rent) it is all back to basics of our Singaporean food roots with the revamp this time round and they have decorated it with all types of vintage items from our past which gives it a really nostalgic flavour and makes it distinctly Singaporean, even if some of the stalls in there hail from different countries and serve other cuisines. It is after all our heritage to have a mishmash of everything. There is a total of 23 stalls, 3 mini restaurants and 1 kiosk. How's that for spoilt for choice? I need to eat at this food court whenever I am in town next time and not bother thinking about restaurants.I would recommend that you make a beeline for their Odeon Beef Noodles - where my favorite is the dry noodles that comes with soup that packs a punch. Otherwise there is always the safe choice of Thye Hong Hokkien noodles which made this branch famous in the first place when it first opened. People are still queuing to this date, which is good. Their Indonesian Padang stall also has rather hefty meals that is sure to fill up a hungry person or 10.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oVrOVFQT-qSawEl2mi1gVw",
        "caption": "Photo of Food Republic - Singapore, Singapore. Filled with nostalgic display items",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oVrOVFQT-qSawEl2mi1gVw/o.jpg"
      }
    ],
    "user_id": "9nWcII-Fqn5Hagfib-H76w"
  },
  "9y5RiLRO7YWy2FxRz6igvQ": {
    "date": "9/9/2012",
    "text": "This place is pretty, the food is okay, but the extra dollars we're forking out for the slightly fancier packaging just affects the foundations of 'hawker food'. I would steer clear of the nasi padang and 'economic' rice if I were you - you could pay up to $6.50 for a $3.50 meal you could usually get at your hawker centre!The only stall (if they are allowed to be called that) that I patronise often is the Rojak Vendor, which serves up a great Rojak! The ingredients are fresh, a little cold, but it enhances the experience (Cold Rojak... now that's an idea!). Besides that, I'd recommend a train ride to Tanjong Pagar or Tiong Bahru for a more wholesome experience.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  },
  "3qepC18aytsG47LgGlV-DQ": {
    "date": "7/24/2013",
    "text": "It's got everything for everyone. It's priced right especially for being right next to the ion high end shopping malls. I ate at salt and pepper and had a hot dish with salmon and chicken and egg for 10 bills.  It was great. Old ladies walk around and sell u drinks off the carts from water to fruit drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1OfkI2t7vwTDTrUlFmpQqw"
  },
  "gsoKq0IujbwApT0cTUSvcA": {
    "date": "11/6/2014",
    "text": "Definitely one of the best food courts on Orchard. Would definitely recommend the Vietnamese (awesome Pho and Bun Thit) and Indian stalls. What makes this food court good is the variety of stalls, nice atmosphere, lots of available tables and the option to go to the sushi, teppaniyaki or Din Tai Fung restaurants which are on the same floor for something a bit fancier !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "S8MG-wLehos4jnMfV1Rn7Q"
  },
  "PnFqaI97AY7k2fI6TlYykw": {
    "date": "11/28/2012",
    "text": "A very nice food court located on the fourth floor of the Wisma Atria mall on Orchard.  Easily accessible from many of the nearby hotels via the underpasses.  We ate here most of the time for lunch in our recent 4-day trip to Singapore.  Although the food is slightly more expensive and perhaps less authethic that the various hawker centers throughout the city, I think Food Republic has several convenient features for tourists like us: (1) its extremely clean with lots of staff picking up plates, (2) air conditioning, (3) plenty of seating, and (4) it even has a sink in the center of the court for hand washing.  Like other food centers, there's a good variety of cuisine too: Taiwan, Indian, Indonesian, Korea, Thai, Peranakan, Japanese, etc.  If a sit-down restaurant is more to your liking, they also have Din Tai Fung (specialize in dumplings), a sushi restaurant, Teppanyaki Grill, and a Toast Box (excellent breakfast chain with amazing Kaya toast, coffee, and a decent Laksa too).Our favorite stalls at Food Republic are:1. The Taiwanese one - Forgot the name, but their claim to fame is beef noodle soups using thick noodles cut by hand.  Supposedly the method of cutting imparts superior texture to give a nice, chewy noodle.  We ordered both the beef dumplings and steamed pork dumplings from this place and they were both fresh and tasty.2. There was one stall that made Laksa (traditional noodle in soup) and Laksa Goreng (noodles only). I liked how they offered you the choice of noodle to use.  Laksa had the usual thin fish slices, shrimp, and some sort of shellfish (cockles perhaps?).  Flavors were bold and intense at the same time.3. Soup Guru(?) - My wife liked this one and went here a few times for traditional Chinese soups.  I liked how they described each soup in English and the traditional health benefits of each.4. They had an Indian restaurant (specializing in Biryani) next to an Indonesian restaurant (with their own special chicken set).  I tried the Chicken Biryani this time and its quite good. They gave a whole small bird with skin and all and a good side of rice and some pickled veggies, all plated on a banana leaf. The \"Biryani sauce\" was given as a side.  Overall it was good - a little different than Biryani I've had here in the USA, but still good.5. Sergeant Chicken - they offered both steam and roasted Hainanese Chicken Rice here for just $4 SGD. I opted for the steamed version and was glad I did.  I never knew that such as a simple dish could have so much flavor.  The rice itself was seasoned with broth and you can always add more with the side of soup they gave you.  The chicken can be eaten with the minced ginger or with the spicy chili oil.6. The fruit juice place is pretty decent too.  They charge slightly more if you decline ice in the drinks.  Coconut juice is actually a whole baby coconut with a good amount of juice and coconut meat to chew on.  The mango and guava(?) are also good with the right amout of tart to help sooth a spicy meal.  I think one of the ladies working here also preloads a bunch of the drinks onto a cart and sells them by bringing the drinks throughout the court - which is really efficient.Our least favorite stall is probably the Fish Porridge one on the corner.  My wife expected a nice smooth congee but instead got this clear soup with cooked rice and fish meat mixed in.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VHjR5F6mdnLrQcCb0nqCYg"
  },
  "EUazLah6Ob-_YGyRTHcypQ": {
    "date": "9/22/2013",
    "text": "Clean (but what isn't in this island nation), central to many places, lots of broths, food under 10 bucks,  and it's a food court? Best damned food court I've seen. Puts many places around the Bay Area to shame. If you're on the run, this is a good place to put something quick in your tummy.  I'll B baaaack.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "FSDj4JOrZxd5Z-ax15Klgg"
  },
  "vSuROdHiPLgafp3oeBBYvA": {
    "date": "7/18/2015",
    "text": "Very good variety of Singapore food reminiscent of hawkers, but in air conditioned mall.  All tasty and quite reasonably proced.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUk3DyU2dYT6mRWGfCr0pg"
  },
  "eV7wBa30xtXxJ1XwDLwr-w": {
    "date": "1/26/2014",
    "text": "Great selection and great value for the price. I wouldn't call this a relaxing dining experience but if you're looking for a place to satisfy your hunger at a good price then this is a good choice.It's noisy, chaotic and sometimes very crowded but the food is very good.Make sure to bring your own napkins - no one provides or sells any.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kh_LcL8dA6SsKMqRRZ2bBw"
  }
}