{
  "NJiW1foW-vH89N_JoD8-mQ": {
    "date": "9/23/2016",
    "text": "Can never go wrong with the bbq baked buns and the glutenous rice in lotus leaves .  They are the only 2 items on the menu I stop in to do a take away .",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_TJNeMTEsrnecy0tDkFBQ"
  },
  "9o5D1G9466pJQN2FDk6iQQ": {
    "date": "12/31/2016",
    "text": "Same great food without the wait.  I was pleasantly surprised. The BBQ pork buns are the bomb! I chowed down 3 of them in a single breath!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8_V5a09L7ak3GAFzGrZ3A"
  },
  "G9pUun5_tHB-QM1pOKxAcw": {
    "date": "6/2/2018",
    "text": "Ever since Tim Ho Wan has opened in NYC, I have always wanted to go - but knew that there were always long lines. So ironically enough, I end up in Singapore and realize that many of the globally-recognized dim sum spots that are delicious (Tim Ho Wan, too many Din Tai Fungs to count) appear to be here - and this one being in the mall right next to the hotel we are staying! It doesn't get any better than rolling out for breakfast right when Tim Ho Wan opens at 10:30 AM, and there is no line or wait to speak of! We got seated quickly, our food came out quickly, and while the service wasn't personable, you aren't coming here because you expect to be treated like a king.I finally got to see what all the hype was about, especially the pork buns....holy cow is all I can say. I've had some good pork buns, and there's a really good cheap spot in NYC Chinatown that I love, but the buns here are by far the best I've had. The roll is a little sweet but not that thick at all, and the pork inside is deliciously savory. If I had more time in Singapore (and more stomach space), I would probably grab an order of these to go every day. The rest of the dim sum was pretty good as well; I particularly liked the pork ribs served in black bean sauce, as the sauce was a much lighter version (I was expecting the ribs to be drenched in a heavy marinade) and made each bite less heavy, but just as flavorful. The bean curd skin was juicy and moist, and the shumai was fresher and less dry than most other versions I have encountered elsewhere, although the flavor was not necessarily any more distinctive.In all, I get the hype when it comes to the buns. The rest of the food is quite good as well. It's basically a more premium, better-prepared version of dim sum, but if you can get in, I understand why folks really love the food here and are willing to wait for it. The takeout line here is a plus for sure, in the event that you are on the go.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CJmtS1Uk1KSsY2MWol_E7g"
  },
  "8QO1r4meK2DR5bKsFK9K-A": {
    "date": "6/28/2018",
    "text": "One Michelin Star for an inexpensive dim sum restaurant? Alright.  This one was located just off the City Hall MRT station in Singapore and seemed to have the best rating and review on yelp.I ordered a bunch of dishes with my niece and her friends and here it goes.  The bbq pork bun was baked not steamed but it was very good.  The bread layer was pretty thin and there was a substantial amount of bbq pork filling.  There was an air gap but it all just seemed to be in the right proportions.  The har gau or shrimp dumpling was also very good.  They had a small wonton noodle dish that was also good and they had these green skinned wonton like it was made from spinach.  In fact most of it compared very well with some of the best dim sum I have ever had.  Maybe not a Michelin star but close.  Prices compared with those in California so no complaints.I will be back again to try some of the other dishes. Go try it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Qc8tXqOOGsZsOqesWfmqQ",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. The order process and limited items",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Qc8tXqOOGsZsOqesWfmqQ/o.jpg"
      },
      {
        "img_id": "HtUGTuLXOsvcZ2w-gMYkUQ",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. Really small restaurant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HtUGTuLXOsvcZ2w-gMYkUQ/o.jpg"
      },
      {
        "img_id": "Vn2P86RuCEOWM8beJUFl7A",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. Har gau in the back",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vn2P86RuCEOWM8beJUFl7A/o.jpg"
      }
    ],
    "user_id": "NaKIUQrZGA9gL7jvq1p0_w"
  },
  "0m4PB7KqVlfA-XhrYHC3CA": {
    "date": "1/14/2018",
    "text": "In 2011 summer, I lined up like everyone else did in front of the original Tim Ho Wan in Hong Kong, it got a Michelin Star that year, dubbed as the cheapest Michelin, in fact.I took the opportunity to try it one last time in 2012 but ultimately it became an impossible task as the fan base was growing. So it expanded. I heard the New York outpost is lackluster. But I don't get to come to Singapore often enough and it's right inside the hotel, so it felt appropriate to try. It was a hot and humid 82 degree weather and I didn't want to go outdoors.Turns out the place was half empty. I got a nice seat and ordered what was popular. the BBQ pork buns, the chicken feet, the ribs, etc. Try to stay carb free by eating the fillings only. The verdict is that it's good, but not as good as circa 2011 in Hong Kong after its receipt of the Michelin. Still, I like my nostalgia and familiarity.  A good find.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 3,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "v8w48C9nClqJC9TqDffG1w",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v8w48C9nClqJC9TqDffG1w/o.jpg"
      },
      {
        "img_id": "53BL8Ws2oX_uyYBcsH9umg",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/53BL8Ws2oX_uyYBcsH9umg/o.jpg"
      },
      {
        "img_id": "61KoJsPc785cwarU1ANt9w",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/61KoJsPc785cwarU1ANt9w/o.jpg"
      }
    ],
    "user_id": "FysDiqCS1fxxwC9PLHNqNg"
  },
  "xoZQZyMp9E6BeweaTskBVg": {
    "date": "4/7/2018",
    "text": "Suprised to see this michelin star dim sum at underground mrt walkway in singapore - realized they have many locations. Their turnip cake was a serious disappointment- it was pure white radish , not hot and no toppings inside. The famous bbq bun was good - but a little too sweet & salty - good amount of filling.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "1JfJxbSH1Xb-dkr0ENuUxA",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1JfJxbSH1Xb-dkr0ENuUxA/o.jpg"
      }
    ],
    "user_id": "Fsl7fnXttgugpoyuCJ0zkg"
  },
  "LHPjXC-mv3fbsUBHRis0Iw": {
    "date": "6/7/2018",
    "text": "This is one of the better location of Tim Ho Wan, comparing to the ones in the States and Vietnam. The prices do not differ much at each place, remaining quite reasonable and even low for such quality of food and service. 3 years ago I got driven here by a taxi driver after asking for a good place for dim sum in Singapore and was told it won a Michelin star. I was not disappointed at all. The dishes were of good taste and high quality. Besides the basic dishes like har gow of shu mai, their specialities are excellent. My must order dish for every visit is the one (I don't remember the name) topped with wasabi sauce and roe. Sometimes they have seasonals, and during winter time they made a  delicious mini har gow dish made to be eaten with Sichuan peppercorns sauce. For such a famous and busy place, food got served surprisingly quickly and still piping hot. I definitely recommend everyone to check it out if you're a big fan of dim sum.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QiGubGvEFvl3WTSoDN-FTA",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. Fried har gow topped with wasabi sauce and roe",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QiGubGvEFvl3WTSoDN-FTA/o.jpg"
      }
    ],
    "user_id": "PD9wpq_3bmx846funNCNBg"
  },
  "aR-fvfoO592x_Wkiqb23AQ": {
    "date": "10/27/2017",
    "text": "Impressive line up of savory dim sum.Place is really good for a dim sum experience.Its one of the good dim sum places Ive ever been.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1VDvJbLMrL24lwo2W8EhAQ"
  },
  "N-07XI7w0vPkXuzaqv13wg": {
    "date": "7/21/2017",
    "text": "This is just a review for their pick up counter. But yes. It's awesome. So. Good. Ordered the following: BBQ pork buns (3 buns, $5.60 SGD)Pan fried carrot(radish) cake (3 pieces, $5.30)Beancurd Skin w/Shrimp (3 rolls, $6.40)Hong Kong style egg tart (Buy 3 get one free, $4.80)I was walking through Raffles place, and just sat down on a bench and started eating, because they do recommend that you eat the BBQ buns within an hour.  Boy am I glad I started eating early. What is so outstanding about this dim sum is that the main ingredients really shine through in terms of flavor. As amazing as the crust is for the BBQ buns, the pork is actually the star. The radish flavor of the cakes were so noticeable (in a good way) that it make you feel like their radishes were fresh! The beancurd skin was crispy, and had a balanced amount of filling- not too little nor too much. Just right. That's when you know you've got good dim sum. Everything tastes just right. No heavy feeling after eating it (I basically ate all of that in an afternoon and felt fine).",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "DgQQh4VqBG-9zQhc776a2g"
  },
  "SLM61fVtGGvqummmy96kyA": {
    "date": "5/22/2016",
    "text": "Food: 4.0/5.0Service: 2.0/5.0Value: 3.0/5.0Decor: 2.5/5.0Overall: 3.5/5.0The dim sum here was very good but not mind blowing.  The baked BBQ pork buns in particular were very popular (I thought they were good but not as much as some of the others at my table did).  Try coming later in the day to avoid long lines.  Look forward to trying the original(s) in Hong Kong that actually garnered the perhaps politicized M*(s).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NQGMcWK9tSUzvS5w-SPTog",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NQGMcWK9tSUzvS5w-SPTog/o.jpg"
      },
      {
        "img_id": "P74HJ4auPzwxYA3sfz2skQ",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P74HJ4auPzwxYA3sfz2skQ/o.jpg"
      },
      {
        "img_id": "U3dGOgsAXRa9F664XuKdmw",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U3dGOgsAXRa9F664XuKdmw/o.jpg"
      }
    ],
    "user_id": "9LtRKwgaSpMY6wXWy4fcWQ"
  },
  "dEKmPYrvCEIy3v-_cpxVQA": {
    "date": "1/23/2018",
    "text": "Great Dim Sum - fast efficient service. The pork buns were probably the best I've had. Has a fast food feel to it but very attentive wait staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ivn6Nes2Vk6nG6GFQcEm5Q"
  },
  "3vS9Nodkf2qzAfZwmGmIiw": {
    "date": "6/23/2017",
    "text": "The dim sum was pretty tasty and perfectly cooked except for the Ya chow fried rice which was bland.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMh9r-pOrNV0FT0uV_h81w"
  },
  "xUCJMXpQgwc2nGRd4u43qA": {
    "date": "2/18/2018",
    "text": "Below my expectation, the publicity and popularity created high expectation and affects my review, I would say the food is okay.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t2iRYrLSEk-jsPK_OWOsGg"
  },
  "hw-h64z2lOGR3chgjOzfLQ": {
    "date": "1/27/2018",
    "text": "Only giving this place a 3 Star and not 4 because it's not traditional dim sum I'm use to. They hand you a sheet and you order from it. The dim sum was okay. Not the best I've had nor the worst. It was nice for a quick snack in between meals.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6EDngKY4hASDs0GZumY5WA"
  },
  "loLl5SNBhK9UWD-qntSQag": {
    "date": "5/5/2016",
    "text": "Cha Siew Bao must try.The Cha Siew Bao is so good that my gf get a nose bleed when she eats it. So get those tissues ready.The pork liver vermicelli roll is pretty good, but personally I think something is missing in there. The next best favourite would be the chicken feet! Tender and fat, well marinated and tasty down to the bones.We had the chew siew noodles and the glutinous rice, both fills the tummy with its sizeable portion.The tonic medlar jelly dessert with wolfberries is a delight. $40 for two pax. Reasonable.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cD5PcRFs0aOFydJIo1qpyQ",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cD5PcRFs0aOFydJIo1qpyQ/o.jpg"
      },
      {
        "img_id": "bwvv3BjpT8gtspGwgCtcDg",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bwvv3BjpT8gtspGwgCtcDg/o.jpg"
      },
      {
        "img_id": "6fa-7O2FMDP-RQkEpFAuLQ",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6fa-7O2FMDP-RQkEpFAuLQ/o.jpg"
      }
    ],
    "user_id": "BSzE4Vu-yzyTMSJpwZtIBw"
  },
  "DJkAs_xfgQxfOgBLAHHPEA": {
    "date": "3/12/2018",
    "text": "I mean, it's perfect. Great steamed pork buns.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "56eh2_ZImiSYeZ6qexhnmA"
  },
  "NqmuPtn2OHkvm75y9XjLow": {
    "date": "12/2/2015",
    "text": "Well I loveeeeeee eating at Tim Ho Wan only if there's no queue!This is the 6th outlet in Singapore and I chanced upon it while on my way to another restaurant (which I gave up!). No queue during weekend dinner hour (YAY)!Surprised to see new additions on the menu at this outlet that is pretty much adjusted to fit local taste buds. Laksa wanton and chilli crab taro dumpling.We ordered 2/4 of their 四大天王 (Big 4 Heavenly Kings) Baked BBQ pork bun and pork liver vermicelli roll, pork congee and century egg & salted egg, beancurd skin with shrimp and chilli crab taro dumpling. We enjoyed every dish we ordered, except for the beancurd skin with shrimp. We really enjoy pork liver cooked just right, something that is really hard to find in Singapore, consistency of those baked bbq pork bun which they maintained for all their franchise stalls, well balanced pork congee that is not too salty, and that really tasty chilli crab taro dumpling that is fried perfectly with a punch of fire after the chilli crab gets down to my stomach. I felt that there was no need for any sauces throughout the meal.The beancurd skin with shrimp (the fried dish, not to be confused with the steamed version) was a little disappointing for me though, as it's too oily (not at least served on an oil filter paper), very little shrimp and the texture is rather mushy, and the portion is small. I would have opt for the option of beancurd skin with pork and shrimp instead (the steamed version). Totally not worth $6 for those 3 tiny pieces.This outlet has password protected wifi, but when I asked the staff, he mentioned that they are not make known the password to the wifi. So dang, no wifi here.Paid about $32 for this meal to satisfy 2 tummy! It's still worth it for the great quality of the food and services.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "O9EyhbCVpKiMsb9Q9KeD2A",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. Baked BBQ pork buns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O9EyhbCVpKiMsb9Q9KeD2A/o.jpg"
      },
      {
        "img_id": "zpSoBvjAkVPw9jYOBhwyLg",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. Inside the chilli crab taro dumpling",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zpSoBvjAkVPw9jYOBhwyLg/o.jpg"
      },
      {
        "img_id": "dXiZDM56bJHmsf9My1H6_Q",
        "caption": "Photo of Tim Ho Wan - Singapore, Singapore. Pork liver vermicelli roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dXiZDM56bJHmsf9My1H6_Q/o.jpg"
      }
    ],
    "user_id": "O2itSY4F2jnPRXaxdVGOkQ"
  },
  "Zu9OijNzXMt1yN6hem52lQ": {
    "date": "7/28/2017",
    "text": "Tim Ho wan has great food. The shuo mai is so flavorful and delicious! The pi guat is my favorite! It's so flavorful and i like the sauce that comes with it to! The service is good but the restaurant is very busy. If you go to Tim Ho Wan be prepared to wait in line. But overall i would highly recommend Tim Ho Wan to anybody that likes dim sum",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MM_qWDFp007K4PWORoKbRA"
  },
  "U-nJ8olLmIaMcgqPkxkXFA": {
    "date": "3/29/2016",
    "text": "This was my first visit to Tim Ho Wan, and I can say holy moley this place is as good as people say!The people next to me were kind enough to see my total confusion on what to order, and pointed me to a few signatures... and they were spot on. The BBQ pork buns, the vermicelli with liver, and the gloutinous rice - all fantastic. And how cheap is this place!? I left paying only $20 including a drink, and paid with my Amex!One has just opened up here in Melbourne. I'm going tomorrow!Just pure awesome. Check them out.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGlMoo7wlj22_VuJzmrFJA"
  },
  "qJVYRZ3eb-5fkc_QG3Te6w": {
    "date": "1/28/2016",
    "text": "Finally got to dine in at Tim Ho Wan. Ordered the Baked Bun with BBQ Pork, Pan Fried Carrot Cake, Pork Dumpling with Shrimp, Prawn Dumpling and Osmanthus Cake. Loving the Baked Bun with BBQ Pork and the Osmanthus Cake. The food are all delicious but I feel that this two are the best. The Baked Bun with BBQ Pork is a must try. One of the famous item here. Interested in Osmanthus Cake because of those drama that I watched in younger days. This jelly is really sweet and nice. Their service are good too. The water will be refill whenever you wanted. Will be back to try for more!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yn1y6UBwP3GKEFfglxTKnA"
  },
  "XA8rcKp754iNgNMauicP9g": {
    "date": "12/11/2015",
    "text": "Known for it's world renowned \"baked buns with bbq pork\" and the \"steamed egg cake\" ,this dim sun restaurant boast a menu with an exciting array of dishes like the \"pork & shrimp siew Mai\", \"prawn dumplings \", glutinous rice with lotus leaf\" etc. The menu now also includes new dishes suited to our local taste buds like the \"chilli crab taro dumplings \" and the \"laksa wonton \". Overall, all the dishes served here are well prepared by experience dim sum chefs and is of very high quality! Tried their \"baked buns with BBQ pork\" and all I can say was it was excellent! The bun was soft and flavorful and the pork was very tasty!Baked buns with BBQ pork - 9/10",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r0QB_cBSApIM7JCEUV5EVw"
  },
  "OnLI6-H6mxcsf8WwhiwmiA": {
    "date": "11/1/2016",
    "text": "Some of the best dim.sum I've ever had! I'm still dreaming about the bbq pork buns...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPDJydFC767MtPSaIVRhsA"
  }
}