{
  "HO3RcZYqCO4f5Cb43qYcOg": {
    "date": "8/29/2018",
    "text": "Upscale modern Chinese restaurant (by same owner as PS Cafe). Food is generally good but expensive. Personal favorite is the dim sum basket which is a modern twist on the classic dim sum items (hakao, shumai, etc.). The dim sum are all creative and delicious. Other main-stay items are good as well although not particularly stand-out to be worth the price tag. Very nice ambience though. Good for chilling / meet-ups",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "Pi6dIbBzhZ2bJAbB1r8j5w": {
    "date": "1/12/2016",
    "text": "This was hands down my favorite meal I ate during my trip to Singapore! There are a lot of good restaurants in Dempsey, but this one is definitely top dog.They serve up delicious \"Asian Fusion\" (Westernized Chinese) food here and absolutely phenomenal drinks. All the dishes were packed full of flavor and the best part was that they all had unique, distinct tastes. Fortunately I came here with a party of 7 and had the opportunity to try several different dishes; I can say with certainty that I enjoyed every single one. In my opinion the only negative is that this spot is quite upscale, so I would definitely only come her every now and then for special occasions, rather than dine here regularly.Favorite dishes:- Szechuan pepper chilli chicken: I expected this dish to be super spicy, but instead was quite surprised to find out it was more of a sweet 'n' spicy and tangy flavor. The chicken was nicely cooked and the sauce was just perfect. Really enjoyed this one. We also order the Tofu version of this dish for the vegetarian at the table and it was just as delicious. - Wok breath rice noodles with snapper: The noodles picked up this amazing smoky flavor from the Wok and the oyster broth was rich and delicious. The snapper was flaky and soaked in all the flavors from the broth. - Five spice lamb ribs: WOW! I have never eaten ribs that were so tender and perfectly cooked. They tasked smoky, sweet and spicy and were fall off the bone good. They do have a slightly numbing feeling though, so if you're not a fan of that sensation then stay away from this one. - Crispy duck steamed buns, White skin siew mai, Scallop crab & scallion dumplings: All three were excellent. Perfectly cooked and full of great flavor. Each were severed with a unique sauce which paired perfectly together. The drinks were also extremely good. I tried the Imperial Caipirinha, the traditional Brazilian drink. But this one had an Asian twist and was served with muddled lychee. The Old Fashioned was excellent, just the right amount of sugar and smokiness from the bourbon. The perfect drinks and flavorful dishes led to an amazing dining experience.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "T-s9sg0nF4hNdoykVdYxEg",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Szechuan pepper chilli chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T-s9sg0nF4hNdoykVdYxEg/o.jpg"
      },
      {
        "img_id": "azt_OFVWBp5s-jtjfUWQEg",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Wonton noodle soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/azt_OFVWBp5s-jtjfUWQEg/o.jpg"
      },
      {
        "img_id": "S-5sET_0UueVEdKXB9woOA",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Wok breath rice noodles with snapper",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S-5sET_0UueVEdKXB9woOA/o.jpg"
      }
    ],
    "user_id": "T8Gvjcw-Z_MKELdynTGJAQ"
  },
  "cM6YYMLYcSn613MOKZ-boQ": {
    "date": "12/14/2016",
    "text": "When I first joined the workforce (trust me, not that long ago!), takeout options were typically limited to pizza and Chinese food. So after a long workday, I sometimes find myself craving a takeout and I often end up ordering from Chopsuey Cafe. So this review is for the delivery service, not the actual restaurant - obviously the food comes from the actual restaurant but I can't comment on service or atmosphere.I am addicted to the mudcrab fried rice, I simply love it, to me it tastes exactly like how fried rice should taste like in my book. And it's wild rice, so I can pretend it's semi-healthy! The sweet and sour pork is also pretty tasty and so are most other mains I have tried. The only dish I found a tad disappointing is the prawn toasts, which is unfortunately one of my staples for a Chinese takeout.The fact that it comes in \"authentic\" Chinese takeout containers* is a huge plus for me. Not only are they giving me that familiar feel, I also find it is easier to eat out of when sitting in your sofa haha.I have ordered many times from them and the quality of the food is consistent. Add in the fact that they typically throw in chocolate chip cookies as a freebie and it's easy to understand why they are one of my favorite takeout places even in times when there is a wide variety of options for food delivery.*for those who have no clue what I am talking about, these containers are apparently called Oyster Pail. Google and you'll see what I mean.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "ZT7Yv0OHua00EzQQRkvlaA": {
    "date": "10/20/2017",
    "text": "Overpriced over spicy Americanised Chinese food with an upscale decor.  Food is def unremarkable.  Ok wine selection by the bottle but not impressed with the by the glass.  Probably won't return.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWsr1leWAwB-YxSWE65N3Q"
  },
  "c6RI1xE8qcSy374-xRL8zA": {
    "date": "5/16/2018",
    "text": "Really great choice for a family dinner or couple dinner. Maybe not the best choice for children. Their menu is amazing, the crispy beef is great and their ginger chicken is also to die for. Slightly expensive but worth it for a nice dinner outing. 100% would recommend at Dempsey Hill.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5VTy_OiJqbuWvHZYDM3pw"
  },
  "XT37Fg1QqXF5LV3U2LqgTQ": {
    "date": "2/14/2016",
    "text": "Food was outstanding, very unique and different.  The eggs benedict on potato rositi, mud crab fried rice and the pumpkin, coconut and shrimp soup were excellent.  The servers were very good, as well.However, the policy on table reservations is pretty strange.  When we got there with a reservation we were seated outside, but found it a bit warm so asked to move inside.  We were told to wait and they would get us a table, which they did.  However, there were several 2 tops with nice views that were empty, but we were told they were reserved.  Funny thing though, no one sat at one of them the whole time we were there.  Not sure what a reservation means, thought it meant reserved to me.  They were a bit too inflexible and not very understanding about it, typical of Singapore I'm afraid to say.It's a bit hard to get to and from without a car though.  Taxis are sporadic and where you get them is not too clear, you just have to wait till someone is dropped off it seems. Would I go back?  Maybe.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9wjC0MrCfMbnXYwYvXCDw"
  },
  "4fiHt_SXwkAmFQ4jz0EEIQ": {
    "date": "5/10/2017",
    "text": "Went over this weekend on a lazy Sunday evening.Let me begin with Five stars for service. The staff was top notch! The food was excellent! Shoutout to our waiter Angie who recommended the right dishes and portions sizes! We ordered steamed dim sum, crispy duck pow pockets, chilli soft shell crabs, charred chicken rice noodles, beer, juice. Total damages were 140$ as expected. The charred chicken noodles were a clear winner and other dishes were good as well My ONLY complaint was the bun with the chilly crab! Chewy and disappointing. That lost them one star. Was in a good mood so didn't bother pointing it out to the staff. I am happy to revisit and change my review if the chef promises me better buns for the chilly crab",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GxvTcyoxfR1rmd_KMWF9aw"
  },
  "rQKwhP9Mzrkrn1CF2FaeOg": {
    "date": "2/26/2017",
    "text": "Pro: 1. the food was very good2. The waiters and waitresses were very professional3. Beautiful setting & gardenCon:1. Price was too high to small quantity of the food2. The manager ver snappy3. Furthermore, as soon as finished the dinner the manager came and told us that she had reserved this particular table for another. It was 9:45 pm and no other customers were waiting what so ever.Very unprofessional.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MsrASzE_SMhl39dA67A5w"
  },
  "FwN7hp4ARE-FilIgsZK07g": {
    "date": "8/9/2015",
    "text": "Chic upscale cafe that serves Western-style Chinese food. It's not quite fusion - it's basically  Western/Americanised Chinese food, not that there's anything wrong with that but one should go with the right expectations.The honey ginger chicken which has a very sweet sauce/glaze, and the signature Chop Suey vegetables, which includes brussels sprouts and broccoli are both delicious. Had desserts on a previous visit and remembered those to be excellent too.Food's pricey, though. So get your wallet prepared for that too...Staff are great, very attentive and service is quick and up to standard.The only miss was a Sweet Pork Belly Bites starter which had a flavourful sweet glaze but the little strips of pork belly were too thin and had been cooked to petrification. Stone. Hard. When it's pork belly, that's enough to make you cry.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qK33YxMmj3nE_7nzxXNbog"
  },
  "HBfB8O_5tY0ndTQ3zmDOCA": {
    "date": "4/18/2013",
    "text": "By the same people as PS Cafe, Chopsuey offers family-style Chinese food, just a little fancier. I'd say it's a little pricey for Chinese food that you can otherwise get elsewhere for half the price. However, I think it's more the concept you're paying for and sometimes, that's okay. Perfect place to go to with a bunch of girlfriends - think, Tai Tai lunch - (as opposed to having to go to a fancy white-tablecloth-tea-pouring Chinese restaurant) this place has the right amount of trendiness to it, with the same good Chinese food. Now, not quite the place to take your grandma nor the right place if you're a tourist looking for real authentic Chinese food. Like I said, everything here is family style. So it would probably be wise to go with a few people you're comfortable sharing food with. While we were here, we got the Deep Fried Whole Red Emperor Fish, Steamed Paper ShaoShing Chicken, 2 Veggie dishes and the Chili Chocolate Cake. Everything was really good. The Red Emperor Fish was filleted and deep fried to perfection (I normally don't like deep fried fish because of how dry it can get but this was not at all). The Paper ShaoShing Chicken was good too, healthy, if that's what you're into. The veggies weren't too salty or oily. And the Chili Chocolate Cake was heavenly, rich and oh-so-chocolatey. A nice addition to Dempsey Hill!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "C0uOO5QcdX3MmbJHA6nWFQ",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Red Emperor Fish, Steamed Paper ShaoShing Chicken & Veggies!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C0uOO5QcdX3MmbJHA6nWFQ/o.jpg"
      },
      {
        "img_id": "PmOtvtYBZKbEU6Zlcbsr-g",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Chopsuey",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PmOtvtYBZKbEU6Zlcbsr-g/o.jpg"
      }
    ],
    "user_id": "FQZZsU3J88IGF8n5e3XYZg"
  },
  "mhxsY9NSWpB-xApyPYwl1g": {
    "date": "8/11/2015",
    "text": "Excellent food though the price really makes it difficult to justify. The food is quite yummy for what  it is, which is a sort of Asian fusion by way of those Western Chinese takeaways that every student becomes intimately acquainted with and takes full advantage of but never actually can taste again once they leave campus. This place is reminiscent of that but sexes it up with a strong sense of fun and style. The food is decadent, delicious and made with a well judged amount of spice, tang and yum. Whilst purists may scream bloody murder but Chop Suey is not trying to be \"authentic\" it's trying to class up those dishes we've come to know and love living overseas and who can really argue with such a pretty and well judged attempt at doing so.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FFuvWqU2jyr7_Y7sdTsvg"
  },
  "YIbnmx5A3JxakyceHy4J_A": {
    "date": "3/30/2016",
    "text": "As oxymoronic as it sounds, Chopsuey Cafe is as authentically bastardised as it gets. So judge it on its own, as a commingling of American culture and Chinese cuisine, and temper your expectations of Chinese food as you know it.Service was faultless: upbeat, efficient, and sincere. And knowledgeable about the menu enough to make excellent recommendations.We had:1) Crispy Duck Pow Pockets ($17): pillowy-soft steamed white buns jammed with sliced duck confit, pulled roasted duck, julienned vegetables, and drizzled with a tangy-sweet bean sauce: a must-try.2) Szechuan Pepper Chilli Tofu ($18): a vegetarian variant of kungpow chicken, comprised beancurd squares wok-fried with blackened dried chillis, garlic flower, pickled radish & ginger, mushrooms, long beans, and cashews in a peppery szechuan sauce. Skip this, it was middling and forgettable.3) Crispy Crackly Organic Egg with King Prawns ($18): a fuyong omelette of sorts, was laced with holy basil and chilli for a subtle heat, and drizzled with honeyed soy for extra oomph. Lovely, albeit a little oily.4) Honey Ginger Chicken ($24): ginger-marinated chicken wok-crisped and then tossed with honey, ginger root, sesame seeds, and curry leaves; reminiscent of sweet & sour pork. I can see why a Caucasian palate would like this.5) Chopsuey Chopsuey ($16): a medley of seasonal organic baby vegetables sauteed with holy basil. The smoky char was evident, as was the delectable crunch.6) Wok Breath Rice Noodles with Snapper ($26): fish hor fan dotted with silver sprouts and spinach, and drenched in a rich oyster sauce gravy. It's not the memorable hor fan I've ever had, but I liked the smoky char coming through every bite, and appreciated that the sprouts were relieved of their heads and tails properly.7) Vodka Cheng Tng Cocktail ($19): didn't like it. The sticky sweetness of the cheng tng only exacerbated the bitter edge of the vodka, instead of balancing it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tieQ1FQ3BdXO7PjShPE28g"
  },
  "mbmvZuOKY3Ipbl_KRR7ALA": {
    "date": "1/19/2015",
    "text": "This place and its food is really addicted. Since the first time i come here, till today their food is constantly good. Fusion asian chinese food, nice presentation, lovely ambience and decor, warm service. Thats why i always come back here as i miss their food frm time to time. I love most their crispy duck in a bun and goodie green juice! Yummy! Recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "08kEwIDXq2u5Pet_KqiXjw",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Crispy duck in a pouch, sweet sour lemon chicken, mix fegg... Delish!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/08kEwIDXq2u5Pet_KqiXjw/o.jpg"
      },
      {
        "img_id": "MUWgSbDcnRj3WOghSTdDjg",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MUWgSbDcnRj3WOghSTdDjg/o.jpg"
      },
      {
        "img_id": "SkxFeZMbjePNBzJX7R2Btw",
        "caption": "Photo of Chopsuey Cafe - Singapore, Singapore. Love their french style bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SkxFeZMbjePNBzJX7R2Btw/o.jpg"
      }
    ],
    "user_id": "62jyeuaoPpypSF9C2yncgQ"
  },
  "TJhujgaVKkK4D836eQYofg": {
    "date": "2/5/2016",
    "text": "I wanted to bring my son to sample the food at chop suey cafe. I had a good experience previously. The establishment i tried this time was at Dempsey. The location is very quaint. Very nice actually. The food is fusion chinese. And that's what makes it interesting. The flavors and textures are Chinese but not exactly. The chef mixed herbs and spices to make it different from traditional Chinese fare. Flavors are strong. Nothing subtle about it. The strong flavors and sauces require you to accompany the dishes with rice. The food was good and fresh, however prices was a little on the high side. Service too was good and attentive. Overall I would recommend paying a visit particularly if you what a change of typical Chinese food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91UQ_DLi_qsDXQfg6kBePw"
  },
  "nd5E0eOeoIBGh7nCugk2tA": {
    "date": "9/11/2015",
    "text": "A bit on the expensive side, but definitely worth trying out. Love the ambiance at this location. A great brunch spot. I tried the smoked braised duck and omelette which was delicious. Be sure to save room for dessert. We tried the lychee tart and the chili chocolate cake topped with vanilla bean ice cream. I would order the chocolate cake again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "buhaawsNr-41s2rdT3dJ5Q"
  },
  "s-6EwJ7Ou-K9shXq7Fo3mQ": {
    "date": "9/13/2015",
    "text": "Went for brunch on a Sunday with a group of friends. Took more than 10minutes for them to come and take my drink order. Food was decent. Enjoyed some of the dumplings but not all. Had lamb shank with tamarind for main and it was good. It's a good place to visit if you want to enjoy an okay meal in nice restaurant with good ambiance.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "na5LJSFTo1pZohQe6xgIGQ"
  },
  "dEQxZdrIvaRrUqE5sOgF2A": {
    "date": "1/6/2017",
    "text": "Brilliant combining Chinese and western cuisine.  Warm place with friendly staff.  Don't miss the pork buns.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSI8_aMfg4q3isKK9eYPQg"
  },
  "guIVqVtMKjuS4ba_KLKI_w": {
    "date": "11/8/2014",
    "text": "Owned by the famed PS cafe, ChoPSuey caters toward the upscale foodie who loves westernized-Chinese food. Tucked away in a quieter part of Dempsey Hill, ChoPSuey provides an ambience filled with decor circa 1920s Shanghai.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "6KnuE2ft-M2vWig6EpXndQ"
  }
}