{
  "MK68mKgok_mWsiEdPlD_WA": {
    "date": "5/13/2013",
    "text": "For my birthday, my friends decided to get me this amazing chestnut cream cake with crunchies and fruit on it.  It was possibly one of the most delicious cakes I have ever had.  The sponge was light in texture and deliciously moist. The chestnut mousse was amazingly balanced in creaminess and sweetness. The crunches (cereal?) adds an added layer of texture in the cake. Overall... yes, I'm in love, and I don't even like cakes that much! Excellent option for a cake!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WPw0LDmsT5HLc5itX8YLVA"
  },
  "h_MAY5oeR73XB1vDU4y6Wg": {
    "date": "9/16/2012",
    "text": "It's been awhile since my last visit to Flor Patisserie but that doesn't mean I can't write a review about it based on my previous few trips and unique experiences. Let's start with the food, or in this case, pastries. Cakes! Tarts! Cookies! This place is a haven for all with a sweet tooth. Not only will you be able to satisfy your dessert craving here (minus ice-cream though, you'll have to go to a Cold Stone or a 7-11 for that), you'll be getting your money's worth for the quality of each heavenly delight you put into your mouth. Why? Simple, if you've been to Japan, you'll know that their pastries are to die for and lo and behold! Flor Patisserie is a Japanese-styled patisserie serving authentic Japanese inspired French pastry and that's a mathematical combination that every living, breathing person would know the answer to. Personal favourites for me would be the Earl Grey Choco ($6.95), Marron Pie ($4.50), Madeleine ($2.15/pc, any flavour) & of course, Flor's signature Ice Cheese Tarts ($3.40/pc, 9 flavours to choose from -  for all cheese lovers, its frozen cheese on a tart, heaven! )According to the description on the website, the Earl Grey Choco is a \"Delicate earl grey cream piped onto swiss roll of dark chocolate meringue and sweet banana\" - it's pretty much that except this written description doesn't exactly give you the idea of how soft and airy the texture is, despite having a meringue casing around it. The Earl Grey cream is not too rich which makes it easier to go with the candied bananas. I actually raved about this one slice so much that my friends got me a whole roll for my birthday one of the years, much to my delight - we should all embrace getting a year older with some good cake! The Marron Pie (it's muffin sized)  was an interesting surprise for me personally. I'm not much of a chestnut fan so when I first discovered that there was a chestnut in the heart of this, I pretty much passed on the idea. But my friend, who introduced the place to me, kept raving about it and described how she would savour this (nibbling on it for hours apparently), I thought I'd give it a go and if i didn't like it, my late-mother was a fan of chestnuts so she could have it. Unfortunately for her, it never made it home. \"\"Description: Buttery fragrant almond cream baked in crunchy puff pastry cup with sweetened japanese chestnut center.\" Damn right, it's as tasty as that! But don't let the word 'buttery' fool ya, it's not overwhelming, unlike some other baked goods I've tried. Instead, the butter is more like a coat over the crunchiness of the puff pastry and the almond cream which combined together, does a good number on your taste buds, that just leaves you yearning for more. Not fantastic for the waistline because this thing is HUGE but if you have a little fat girl inside you somewhere, you should be nice and treat her to a something every now and then & I highly recommend this to be it. Madeleine. This brings me to my unique experience as well but first,  these are not at all dry and the chocolate ones are moist, almost similar to a brownie or a chocolate lava cake minus the lava. Back to the story, at one point,  they were selling the Madeleines in the shape of bears, individually wrapped which was adorable and so, I decided to buy some back. That same evening, I discovered mold on one of the bear's ear and decided to let them know about it. I wasn't expecting anything but I just thought I'd let them know of my find. I called the very next day and to my surprise, I got a tonne of sincerely apologetic replies back, it almost made me feel bad for making the call. They offered to give me something for free on my next visit but I wasn't gonna be going back anytime within that week so I just left it. On my next visit however, the Madeleines were back to being the shell shaped ones and so I briefly mentioned the bears and that I found mold on one of them once. THAT immediately sparked an wave of acknowledgment around the room and after discussing amongst themselves, the lady serving me apologized and gave me another Madeleine free to make up for it, shortly after, the chef himself came out from the kitchen to apologize and explained that it was an error on their part for not sealing the packaging properly, resulting in the air to enter the pack and thus, mold. I thought that that was VERY professional of them to acknowledge this and to even have the chef himself come out personally. Needless to say, as with all Japanese service staff, everyone (including the chef), saw me out of the cafe before resuming their respective duties. Like I said, it has been awhile since I've been back there & i do believe the prices have increased a little. However, after writing about it and reliving all these amazing  memories about the pastries and the place, I'm pretty sure i'll be back there soon, this time with a good book, to chill, enjoy some cake, have a good cuppa tea......and then hit the gym after.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a4Ow2NZWS6A-LExj6RCtuw"
  },
  "xPS7Adn0M6YURnIOPJbZwg": {
    "date": "7/21/2018",
    "text": "Perfect spot to stop for a quick afternoon sweet treat. Nice clean Japanese inspired cafe.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jjmSe4HM9Ca-QA7laDL8jg"
  },
  "CAID8BzQrKFX570uStdr5w": {
    "date": "12/30/2016",
    "text": "Amazingly balanced earl grey lavender cake, if you like these flavours. The chai cake was very strongly flavoured, but it would be interesting to get if you like chai. The maple cheese tart was not bad. This place has totally overpriced drinks though. You might want to get a hot pot of tea to share.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Mils6AfdsCgUah7jmTd1Q"
  },
  "swhRf5uFrqjUjUWv1IGJSA": {
    "date": "5/26/2016",
    "text": "I understand that many come for their Japanese-French style cakes. But I came here to check it out but primarily to try their Ice Cheese Tart! Wasn't feeling a craving for cake, maybe another time. Given it was my first time here I gave their original a try. It was good. A nice almond crust and good balance of not too too sweet cheese filling. It was perfect to eat there because they cut it into fours for you and it doesn't get warm too quickly, etc. Yum, they had so many other flavors. I'll definitely be back to try their Earl agree :) Their other cake slices looked a little pricey and small. Their tea was cute in clear glass pots heated by a candle so it wouldn't get cold. Cool, but not worth $10 for a homemade blend in my opinion. Same with the iced coffee, $8 seems a bit steep for a normal size tall glass. Anyways, the atmosphere was nice, loved how bright and simple the decor was. Overall I feel the patisserie is kind of pricey but it is a specialized niche so I guess it can get by. As I said I'll be back for their ice cheese tarts :) plus I found the Duxton Hill area is a nice area to walk around too. Tip: come to hang out and share a pot of tea with some nice treats Tip2: no wifi availTip3: variety of treats to purchase from full cakes to packaged goodies too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ORa7rEkr6BXLcjghmw6i2w",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ORa7rEkr6BXLcjghmw6i2w/o.jpg"
      },
      {
        "img_id": "kL2NH5edtwKORF95QlV-aQ",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kL2NH5edtwKORF95QlV-aQ/o.jpg"
      },
      {
        "img_id": "iNoFIe1T1UGtyTBYOtrgdA",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. Original Ice Cheese Tart (cut to eat in)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iNoFIe1T1UGtyTBYOtrgdA/o.jpg"
      }
    ],
    "user_id": "11R2R4nyRpF6nqlXH-JeGQ"
  },
  "fFIjqU-IAwSHocZW995g4A": {
    "date": "12/19/2015",
    "text": "Excellent customer service.Recommendations on what's new really helps. I was hovering for probably a good few minutes at the seemingly endless choices.Cake was dense,quoting the boyfriend,a value for money.The mango topping was the best mango i had in a cake in my life! it wasnt glazed to death with syrup.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4dvsOpzp8LvViBA0ra1O_w",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4dvsOpzp8LvViBA0ra1O_w/o.jpg"
      }
    ],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "G3dVVxyQpIsM4BVECp5mKw": {
    "date": "10/21/2014",
    "text": "I will add my praises to the other Yelpers who have reviewed here and thank them for helping me find this gem.I played it safe and ordered the tiramisu which somehow they managed to lift above expectations, the cream was heavenly and each mouthful melted into my mouth.Claire tried the strawberry napoleon, which I scored a mouthful of which was also lovely; I only have a two days left but I hope to return and try more.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VE0sxPZymx3M_eJFFFkYZg",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VE0sxPZymx3M_eJFFFkYZg/o.jpg"
      },
      {
        "img_id": "P--JSEGMSHbcg1i1Z3QMKA",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P--JSEGMSHbcg1i1Z3QMKA/o.jpg"
      },
      {
        "img_id": "ag4pqzLGxq3hi6PhVd838A",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. Strawberry Napoleon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ag4pqzLGxq3hi6PhVd838A/o.jpg"
      }
    ],
    "user_id": "2BKqNWXvukhZdq6_8Gbfxg"
  },
  "ogkrv3uxW5hfZ6KYvXV8Hg": {
    "date": "8/24/2012",
    "text": "I was surprised to see how small the space is. Some tables and chairs to accommodate 6 and another 3 stools along a small bar counter. Outside the shop, there're dining space for another 8 perhaps? I reckon it's more of a bakery for cakes to go. But anyway we decided to camp there for a while to enjoy the cakes.  The green tea cake is very light and this is very typical of Japanese cakes. I love the Japanese cheesecake with that cow logo on it. I can finish at least half a cake in a sitting (i swear it). It doesn't feel sinful at all. Every mouthful simply disappears into a fragrant mix that glides down your throat. It feels like a dream because you're not sure if you really did eat it at all. The matcha is strong but not overpowering and the green tea sponge cake was also very airy and moist. I like the green tea jelly which sits on top of the cake. It adds an additional dimension to the creamy texture, kinda chewy but not much? Flor uses the Kyoto-uji matcha for the pristine flavor and aroma and it's a damn good choice.The Waguri millefeuille was also very nice. Same quality to the sponge cake. I would reckon that their toufu chiffon cake would have the same texture. Z had it before and said that it's pretty good but pricey for a chiffon cake ($13.80 for 1 if i didn't remember wrongly). There's a nice mix of custard and cream with the puff pastry.Typically, a mille-feuille would have 3 layers of pastry and 2 layers of creme but this only has 2 layers of pastry. I'm not too picky about stuff like that. I personally thought this has a nice pastry to cream/cake ratio. Any more and i would feel like i'm trying to sandpaper the insides of the throat.Pastry was well done, has a nice bite to it and wasn't at all moist or flat from the creme. The chestnut paste goes down really easy. I've tried several chestnut based desserts such as the Mont Blanc from Antoinette but they are kinda dense and dry as compared to Flor's. Z and i had a discussion about the chestnuts that were used to made these desserts and if they differ from those we typically see at the night markets. Think it's the same?Anyhoo, the cakes didn't even take up much space in our tummies and we ordered their iced cheese tarts. They have quite a couple of flavors e.g. orange chocolate, caramel, green tea with yuzu and a couple of others. It has an almond cookie base and is filled with a lightly salted cream cheese filling (Flor's signature) and goes for $3.20 a pop. I would liken the experience to what eating dry ice would be. It simply sublimes in the mouth and vaporizes. Imagine cheese that does that? It absolutely defies logic but it's really interesting. I was confused and surprised for a bit on my first mouth. We had the caramel one and it wasn't too sweet (which is great). Go try it for yourself.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cbAFNH784xTgTxI40bdCwA",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. The interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cbAFNH784xTgTxI40bdCwA/o.jpg"
      },
      {
        "img_id": "HvFQc2SmOweQi5FC0AKeRQ",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. The Vert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HvFQc2SmOweQi5FC0AKeRQ/o.jpg"
      },
      {
        "img_id": "beSKcRh04w4kfV-XMzqnpQ",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. Chestnut mille feuille",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/beSKcRh04w4kfV-XMzqnpQ/o.jpg"
      }
    ],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "eENpZGmmRc_QTKfOsLpQkA": {
    "date": "8/8/2013",
    "text": "Flor Patisserie is a little bit of a trek for those who don't know the area well. Its closest MRT stations are Chinatown and Tanjong Pagar, but my friends and I unknowingly took a long walk from Outram Park Station with the help of a smartphone.The patisserie is small - there's a capacity of six diners within the shop, with another three or so additional sets of tables and stools outside along the walkway. A few shelves affixed on the wall holds little bags of special cake-slices and cookies which are up for sale, such as walnut cookies, chocolate madeleines, butter cakes, coffee biscuits, sesame cookies, etc. Most of these have a covered bowl of sampling pieces by their side, which is great for curious tasters like myself.The three-tiered display cabinet by the cashier was empty other than the top shelf, which was quite a shame, as options were limited, and it showed. My friend and I went for the mont blanc for $6.95. After unwrapping the surrounding foil, there lay a light yellow sponge cylinder topped with chestnut cream, pierced by chocolate curls and a flaky pastry shard. Unfortunately, the latter was soggy and papery, and I felt that the dessert should have done without it.The taste of the entire cake was extremely subtle, a la Japanese baking style of Chef Yamashita. The first bite didn't speak much, but the light chestnut flavour came through with more bites, and a single sweet chestnut is later revealed under the carefully-piped cream. Both the texture of the sponge and cream was light and airy, very easy to eat. It was my first time trying a [i]mont blanc[/i], and I quite enjoyed it, but I must say that it was overpriced for its size.I had a bit of my friend's Wakakusayama, [pause to catch breath] which is a green tea Swiss roll filled with red bean cream, topped with fruits and sweet chestnuts. ($7.30)The flavour of green tea was strong in this cake. Rather heavy, almost bitter, not for those who usually stick to sweet treats. The red bean cream had a lot of authentic red bean taste, which is special to taste. My friends and I decided to share an 'Ice Cheese Tart' out of curiosity. Each tart costs $3.40, and has varieties of strawberry, green tea, maple, mango, chocolate & orange, yuzu and caramel, which we ended up choosing.The 'Ice Cheese Tart' turned out to be pretty much a frozen mini-cheesecake stuck fast to a paper mould, with an almond biscuit base. It was pretty annoying trying to bite or cut through the rock-solid cheesecake, but we didn't have patience to wait for it to thaw either.The taste of the cheese tart was striking, and absolutely great. There's a distinct saltiness in the cream cheese which really improves the flavour of it. I didn't notice any obvious caramel flavour, but I'm guessing it was infused into the cream cheese somehow. I wouldn't mind going back to try the other flavours, especially maple, but I do wish they would sell these un-frozen!Just when the three of us thought that we'd had enough cake for the day, a tray of Strawberry Soufflé ($6.60) magically appeared on the only-occupied shelf in the display cabinet when it wasn't there before, threatening to become dessert for our dessert!Gotta have it, we thought. It was okay height-wise, but was a narrow slice. Piled with blueberries and strawberries encased in clear jelly, the cake is made up of a thick middle layer of light, aerated cheesecake topped with chantilly cream and strawberry chunks, all sandwiched between light sponge cake, plus fine biscuit crumbs stuck to the side.It was a very impressive cake, and I loved the hint of lemon in the cheesecake, which gave it a quiet, pleasant tang. Despite it being cheesecake, it was not too rich at all, because of the soufflé technique used to create an airy texture. My friends commented on sour strawberries, but the ones I ate seemed fine. This is a cake I'd come back for, it's delicious.Due to the long walk under the hot, late-afternoon sun, we each got iced tea to cool ourselves down and quench our thirst. My friends went for green tea, a peach tea, and for myself, a mango tea. ($4.50, except for the green tea which was slightly cheaper)The teas were very pure - teabag, water, ice cubes, and no added sugar. I could barely taste mango in mine, but it was refreshing, nevertheless. The staff at Flor gladly lets you top up the water in your cup, so you can maximise the use of the teabag.We each ended up spending about $15 per person, with all the drinks and shared cakes. Not somewhere one would frequent as a student, but a nice, quiet place to go for an occasional dessert-escapade, especially if you're into Japanese desserts.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "6O1UGPCW2F9P8rsYQatm8Q",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. Strawberry Souffle at Flor Patisserie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6O1UGPCW2F9P8rsYQatm8Q/o.jpg"
      },
      {
        "img_id": "je_IEJpn1qn9liAXPMbkWA",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. Strawberry Souffle at Flor Patisserie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/je_IEJpn1qn9liAXPMbkWA/o.jpg"
      },
      {
        "img_id": "VjKJp-xSSyXvgZ4NhsxD9g",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. Caramel Ice Cheese Tart at Flor Patisserie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VjKJp-xSSyXvgZ4NhsxD9g/o.jpg"
      }
    ],
    "user_id": "AfOb6rfp6oDchcs-UjZdcw"
  },
  "_izQkwIJd4DYoaRCa5mpfg": {
    "date": "5/31/2014",
    "text": "Hmm. I'm a little torn rating this place.My friends and relatives love it, but it just doesn't hit the spot for me. The cakes are indeed good by objective standards - light and fluffy but not floury, well-balanced flavours, not too sweet, not too creamy. But I prefer richer and heavier cakes that make you sick when you eat too much of them.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0x6MWNiFLQ2cV3aIVjO5g"
  },
  "BuYzqo5nSQiv5GMK4ZfAyw": {
    "date": "2/9/2015",
    "text": "decent-alright japanese-styled-french cakes at this tiny cafe in duxton hill. flor patisserie is pretty well-known for its light, japanese cream-type cakes, but I hadn't gotten to it previously on my dessert circuit precisely because of those characteristics: I like my cakes hefty and substantial, and these fluffy, creamy things do little for me.but for its class, the desserts are good - certainly worth a visit if you're into this sort of thing. there's no way to get around this - this place is pretty much fantastic for women (and persons inclined toward the delicate and feminine). it's a small white-walled space with a large window that lets in plenty of light at brunchtime, and the counter is laid full with colorful, dainty little cakes with all sorts of fancy frosting and glazes.we had five cakes from the selection on offer that day - mango (the unanimously-declared winner of the day), strawberry, yam, chocolate and blueberry - and whilst there was a mix of textures from millefeuille and the sponges, all the cakes felt the same.everything's certainly gorgeous - but all a little too light and substantial. of course, this opinion speaks more of my preferences than the skill of the kitchen; if you're into this sort of thing, it does well enough (and you might also want to try its famous ex-chef's new venture: his eponymously-named chef yamashita).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A4GRrGtyCocf1ZJfbSZXMQ",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore. yelpers doing what we do best - mass eating and mass photography",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A4GRrGtyCocf1ZJfbSZXMQ/o.jpg"
      }
    ],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "rC1LfryqSaTerzi8JN7V0A": {
    "date": "5/30/2015",
    "text": "It's very subtle the tastes. To be honest by the look, nothing looks too impressive. I just think it's a food bloggers dream in taking pics but I think nothing special.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fZG0pfZ3XJGqjo9zhD_H1g",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fZG0pfZ3XJGqjo9zhD_H1g/o.jpg"
      }
    ],
    "user_id": "0gBy-cIXe0DQKhFjifu68Q"
  },
  "Hod0MWj-8XgGMVZZ7l8Ocg": {
    "date": "3/19/2017",
    "text": "I've recently became a fan of cheese tarts and popped by this place after hearing about it from a friend. Their \"Ice Cheese Tarts\" is OK for me, not overly sweet but lack the \"oomph\" I would normally expect. The almond crust was good and made up for the lack of cheese-:)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  },
  "AruyF_sTM5mV8-Ve_4wOHQ": {
    "date": "11/12/2014",
    "text": "Love the strawberry souffle and the berry berries cake. the cake is light, the cream was good too and it didn't leave any after taste :)Ice cheese tart was good, but the cakes are far better.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PS0uGpc0Cwx40hMk6zolag"
  },
  "6G59GHanOtAnZ4nMHgyCpg": {
    "date": "8/5/2012",
    "text": "With the kitchen and ovens helmed by Chef Yamashita and his disciple, Heidi, Flor's Pâtisserie is a pretty picture of a little cake store sitting upon Duxton Hill. It is completely unassuming and humble in its simplicity but selling hand-made and heart-made delicate desserts that can sweeten up anyone's day.While many of us here in Singapore are used to French style desserts in which tastes are heavier and richer, Heidi shares that Flor's Pattiserie is all about Kansai-styled pastries: light, fluffy and working with loads of fruits. It is ridiculous if I said everything in the display was good? Probably not at Flor's. Particularly note worthy Earl Grey Chocolat and the Waguri Millefeuille. It is hard to find cake with good chestnut cream in SG. This is where you can get it.Also, pack home some iced cheese tarts in a variety of flavours home to share. Your family will love you for it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8vFfu8VMe9EAhDcphjDuQ"
  },
  "aFXrI-vWeFS0Gln2BAx1Jg": {
    "date": "8/30/2012",
    "text": "A tiny, quaint bakery and cafe on Duxton hill, the cakes here are as pretty as they are delicious. I love the attention to detail and the decorating is exquisite, making it almost seem like a sin to stab these beautifully presented cakes with a fork. Looking through the showcase at this selection, it was extremely difficult to make a decision, but we eventually settled on the millefeuille and strawberry soufflé. The latter was delightfully moist, whilst the millefeuille was surprisingly light even with the layers of pastry. We were extremely happy with both our choices, and I certainly look forward to returning to try more of their creations.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y4lRGaYYDWU9h-wCxcFMlg",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y4lRGaYYDWU9h-wCxcFMlg/o.jpg"
      }
    ],
    "user_id": "OID9ZOyljsyx7HVAP_29aQ"
  },
  "GedClZxnx2SeLjcoAP-BpA": {
    "date": "8/23/2012",
    "text": "If you have a sweet tooth and a dying love for cakes, then Flor Patisserie will be your desired place to go to!The kitchen helm by renowned Chef Yamashita, you know you'll never go wrong with your choice at Flor Patisserie. My friends introduced it to me and I finally got to try the cakes a few weeks back, during a birthday celebration.I tried the Wakakusayama (green tea base) and the Mont Blanc. Honestly, I didn't really like the green tea one as the taste of matcha was too overwhelming for me. This is just a personal opinion as I'm never a big fan of green tea. The only tea I enjoy is Winter Melon Tea.Anyway, the Mont Blanc was fabulous! The cake is soft and so yummy! I loved it. I also ate most of the birthday boy's cake. Too hard to resist if you ask me.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BnHxZcnZb0G_17HkyjERQA",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BnHxZcnZb0G_17HkyjERQA/o.jpg"
      }
    ],
    "user_id": "bJ3vl-BshIHJdrZ9DEqRMQ"
  },
  "qSsYLW2hlZ3Nyt1PL4FnlA": {
    "date": "9/20/2014",
    "text": "Awesome cakes with the right amount of sweetness and fluff! The only thing is the place is a bit small so it is only good for small group of people :) I love their chestnut cake!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "W3-H1SkmMltDzDLqnM81QQ",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W3-H1SkmMltDzDLqnM81QQ/o.jpg"
      },
      {
        "img_id": "_L_Qk306aJXWXzSWNDUJgQ",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_L_Qk306aJXWXzSWNDUJgQ/o.jpg"
      }
    ],
    "user_id": "CgvT48Iewm-pd20IZNNORw"
  },
  "WdkcrdqiUz9ZLwCtbhCjWg": {
    "date": "8/12/2012",
    "text": "This little cake shop  is located in the increasingly popular Duxton Hill.  The japanese styled cakes served here are very similar to that of Glace Pastisserie but with a difference touch. After all, Chef Yamashita did a stint at Glace before opening up Flor. I find that the cakes served here are more fruity themed.  The cakes are pretty and delicious yet not overly done up with cream and fondant.  Unlike Glace where it has only has a storefront, Flor has some limited dine-in space for customers.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QAkESKMA0QgfW0Zfu43T_g",
        "caption": "Photo of Flor Patisserie - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QAkESKMA0QgfW0Zfu43T_g/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "UJjmsKnFLXVo0_X35LLKRw": {
    "date": "8/5/2015",
    "text": "I would like to tell you how the food tasted, but I was turned away at 8:23 pm tonight when the staff told me \"only take-away. We close at 8:30.\" Upon pointing out the sign that says 9PM, she said \"The store closes at 9, but the cafe closes at 8:30.\" Such attitude. I was disgusted at the lack of grace from a supposed Japanese restaurant. Won't be going back to be treated poorly again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZEB-iJxQ4Qxg-QUsyVKGdA"
  },
  "ch21mLqq_DT5FRaWf-STuQ": {
    "date": "8/26/2012",
    "text": "Flor has got to be my favorite cake shop. Opened by Chef Yamashita, who is Japanese, it is a French-Japanese cake shop that has the most delicate and exquisite cakes. It is as if they are the exact opposite of the cakes you get at neighborhood shops of coarse and simple flour and eggs.The shop is located on the sleepy stretch of Duxton Hill and has a blue signboard. It is also diagonally opposite Littered With Books, an indie bookstore. Note that the place closes at 7pm and runs out of cakes quite early so be sure to go early too!Try the strawberry cream cake and Mille feuille. I find their chocolate cakes slightly too rich/sweet. I prefer their lighter creations instead.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nWcII-Fqn5Hagfib-H76w"
  },
  "sMm9HOXmBgsBmCKnOmLwyA": {
    "date": "7/16/2012",
    "text": "Led by Chef Yamashita who learnt his baking tricks from Japan, you can be sure to find some authentically Japanese pastries in this little cafe along the swanky Tanjong Pagar area. Japanese pastries differ from their Western counterparts because of the careful attention to detail, and lack of reliance on artificial elements such as baking powder and preservatives. Each piece of pastry in Flor, especially the cakes, is a carefully assembled masterpiece that sometimes look too good to eat. But don't worry, they taste as good as they look. I usually order any cake that is a combination of sponge, fruits and cream, as I'm a fan of the Japanese style of baking such cream cakes - the texture and flavour of the light sponge, tart fruits and non-cloying cream is delicious. (I've made it a point to never order such cakes from non-Japanese bakeries as I've had many bad experiences)The staff are friendly and approachable, which makes this place a delight to visit every time!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fUWq6sOIEe1uTUhNKS9sQ"
  }
}