{
  "4GcUSmP5qFHwmJNKErgF7A": {
    "date": "7/20/2018",
    "text": "Awesome music from the band ENT after 930! Drinks were less pricey than most bars I have been to in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AtqG_JE3Z-5Yq-0WcreUTg"
  },
  "YVGRRGL3lNgLq1pIbBuBtg": {
    "date": "9/30/2017",
    "text": "Stick around for a beer or two and grab a seat overlooking the river. It's right next to the river boat tours so you can watch people, and watch boats coming in and out.I did stick around a bit longer and went for their big sampler and fried rice. It's basically everything on their menu all on one plate. All good stuff and they give a lot of food.It's still hot even under their covered outdoor seating, but at least some of their fans still work.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "opPpHVIp8SKHMJg3_y5Lew"
  },
  "W7DBFlyDTeUGBZTVfy8Uhw": {
    "date": "7/10/2017",
    "text": "Probably the worst cocktail that I have ever experienced. I ordered a lemon basil martini that only tasted sugar syrup and not any gin at all. Even when complaining the waitress didn't say a word and gave no response whatsoever. My friends had mojitos that also were a disaster. Do not waste your money here!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZPAi4LyEZDLCyC9gTAMSaQ",
        "caption": "Photo of Little Saigon - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZPAi4LyEZDLCyC9gTAMSaQ/o.jpg"
      }
    ],
    "user_id": "OvmoedSNOMaONa7Xc5GZlA"
  },
  "H1_O6XpjfJNXeBPLmCpl6w": {
    "date": "7/12/2017",
    "text": "Really really bad cocktails!!!And one of the worst service I had in Singapore.We ordered 4 cocktails and all of us were extremely disappointed and when we dared to complain we were just given the bill...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aD1FtV0hmjgaRFaO7xvxBQ"
  },
  "SF4TRA5tGxpFW4TGNQdw2Q": {
    "date": "7/17/2017",
    "text": "We were pretty hungry. Food was ok, nothing to rave about or go back to, but not disappointing either. 50% cocktails til 9pm is pretty good, but again, drinks were nothing to rave about.Minimal vegetarian options.I feel like this is the standard within the highly targeted tourist area, so if you're hungry just pick a place a go.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lpyslgy1uaFJc92H919nTw"
  },
  "ndwNOwjBAGObOUX4bQ1XWg": {
    "date": "3/24/2016",
    "text": "Late nights and you're hungry? Sure. Tip: do not get the curry fries (no hint of curry)They do not serve water. They sell Evian bottled water for $8 SGD. We got the platter filled w/ fried delicacy that were mediocre at best however, the fried chicken wings and egg rolls were good. + chicken wings had a crispy exterior and juicy insides+ egg rolls were fried perfectly A rather extensive menu and prices weren't too bad considering this is a major tourist area. Service was great, the food came out pretty fast, and I sincerely wish they reconsider the water offerings. They looked at me weird for wanting iced water.",
    "rating": 3.0,
    "rated": {
      "useful": 12,
      "funny": 10,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "aBV8D-w2VS6f1mbbmR-pKw",
        "caption": "Photo of Little Saigon - Singapore, Singapore. Fried Platter for me and Jerry.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aBV8D-w2VS6f1mbbmR-pKw/o.jpg"
      },
      {
        "img_id": "SG6smhJndgWUWBZ1PKPyHA",
        "caption": "Photo of Little Saigon - Singapore, Singapore. Curry Fries.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SG6smhJndgWUWBZ1PKPyHA/o.jpg"
      },
      {
        "img_id": "8ajmGMFM1-xVW2sA07XT8w",
        "caption": "Photo of Little Saigon - Singapore, Singapore. Outdoor dining at 10:13PM.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8ajmGMFM1-xVW2sA07XT8w/o.jpg"
      }
    ],
    "user_id": "0QeJC2inz6P-OVzROU_LNw"
  },
  "1BreqLUBcrtLOMJAOvXh2g": {
    "date": "9/13/2017",
    "text": "Nice little place in Clarke Quay. The server was attentive and the cover band playing got everyone into the act. Ordered a few appetizers and those were fine. Drinks were a bit expensive but would've been fine if we would've made happy hour.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yENM-SzDTjKD53h8ZdQVOw"
  },
  "S73ucmVCgEOj-1Oj9vOfBw": {
    "date": "9/30/2017",
    "text": "The food was too bad but the service is very slow and not importing at all. What could be an amazing place is missed by poor service. Worth a visit for a cheap chic cheerful bite to eat.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqpvMOZ9hEnMaH8vu2IM5w"
  },
  "jGY0xa8DzGASfR2vDKOvIg": {
    "date": "5/18/2017",
    "text": "Food is okay. Not great. Pho a bit greasy.  Squid over cooked and rubbery. Spring rolls and green papaya salad were good.  They charge 2 SGD for a thimble of tap water...  and want another 2 for a refill. Ridiculous. Given the number of options in the area keep looking.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znAftjsS4JM1cteLmBimhw"
  },
  "x5Fg7Yr1h_aJfZ3FReuoQg": {
    "date": "10/15/2015",
    "text": "Vietnamese restaurant with good views close to the river. The food is good, but the service should improve. The duck breast was very good, and we also enjoyed the lemongrass tenderloin. We also tried the chicken noodles and they were simply ok. Don't order drinks!!! We ordered one, and there were only like three drops of liquid in the glass and very expensive.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IXdRkEYVl4es_RU8LxbU5g",
        "caption": "Photo of Little Saigon - Singapore, Singapore. Duck breasts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IXdRkEYVl4es_RU8LxbU5g/o.jpg"
      },
      {
        "img_id": "5iTvx9cngJv2275qToGhkA",
        "caption": "Photo of Little Saigon - Singapore, Singapore. Chicken noodles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5iTvx9cngJv2275qToGhkA/o.jpg"
      }
    ],
    "user_id": "w7CV8roOWja3Z69AZO2QMQ"
  },
  "uVBRyfUVM2EewwaDOEuy5A": {
    "date": "12/27/2016",
    "text": "A tourist trap with unmaintained tap lines, stale tasting beer, and oil so rancid you can taste it.  Don't waste your time.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1XObRwx7naarm4DD-mD0A"
  },
  "yjFwX5yxduJJcF1SpxY0AA": {
    "date": "4/22/2014",
    "text": "Little Saigon is perched right along the river bank, lined up with a number of other restaurants that seemingly merge together into a single centipede of establishments which are distinguishable only by their storefronts on the other side of the walkway.  It is easy to miss, but that would be a shame because the food and service are both excellent.  I didn't eat much here, but what I did have was very flavorful and really hit the spot, though it was a bit pricey.  A different server came by every 5-10 minutes to make sure everything was fine, which meant I could flag down virtually anyone working and get assistance when I needed to order.The view is wonderful.  Watching the boats pass by on the river at Clark Quay while dining on Vietnamese delicacies is one of the more pleasant ways one can spend an evening.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bQCTHiz5LpZuDFS5DYl2bw"
  },
  "ZkQbOri9H3Gbp0-tF7Fcpg": {
    "date": "4/9/2015",
    "text": "I don't get it. This place is a tourist trap. The view was the only nice thing. Half price happy hour with everything half price not. Many things weren't included. And my half priced drink came in a half filled glass. Appetizers were boring at best. The light fresh spring rolls were the best but the sugar prawn was made of cheap puréed something that may or may not have been prawns and the chili crab dip was just a bowl of liquid with little actual crab. The disappointment if the night was the much vaunted lemongrass beef tenderloin which was just a bunch of dry tasteless beef. No lemongrass we could discern and completely void of any redeeming value. Save your money and have a great meal at any of the hundreds of places in the streets behind Boat Quay.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTQaqMlwbYivhRdSZqKAWA"
  },
  "SqL0bsS2Vmmk4ZZCek80nw": {
    "date": "6/23/2013",
    "text": "This place is in Clarke Quay - that automatically puts it on the more pricey side. I went with my wife and small daughter to a friend's going away party. There is an indoor area which is open to the walking path, basically opened wide doors, and a nice verdana on the water-side. The decor is fetching with dark, blue tones with a sprinkling of Vietnamese-ness.As for the food, I recommend STAY AWAY from all soups and noodles. How you churn out mediocre pho and bun bo hue is beyond me. All else is 4/5 stars - fried rice, spring rolls, and other appetizers. Although good food, as I said it's on the pricey side.BOTTOM LINE - go for the ambiance of Clarke Quay, the food is OK but do not expect top-shelf Vietnamese fare. I've eaten better on the streets of Saigon.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nsssmkTRXrMguzekHs_gnA"
  }
}