{
  "ML8FTpYRgoGlKXGF6Vp42Q": {
    "date": "10/27/2013",
    "text": "This was one of the worst dinners I've ever had in Singapore. And it wasn't because of the conversation.Ordered our food and we waited two hours. I kept picturing that the kitchen must have one guy with one pan cooking and maybe he's one-armed because that's the only excuse for how slow the food was to come out.Also the $74 ribeye (the most expensive thing on the menu) looked horrible but tasted 'ok'. It was hilarious, everyone was asking me \"what is that?\". They were shocked when I told them it was the ribeye. Doesn't the management/chef/owner know that people eat with their eyes first? Guess Money can't buy them common sense. Anyways, save your money and go to Mortons if you want beef. If you want anything else try your local food court because the service will be prompter and the food will look like what you expect. BTW management, the dinner was on the 24th of October 2013. We paid more than $500 between the 4 of us. Want to comp my meal next time? Because even if you did I wouldn't waste 2 hours waiting for it. C-ya.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kaGNWFvSm2jlR_lzsya5PQ"
  },
  "7On-hlDfGStNxCRQ8XqBkA": {
    "date": "9/3/2012",
    "text": "I never tried the food at Prive so I am in no position to comment but visually the food at Prive's fine dining restaurant looks a lot more appetizing as opposed to the food served up at Prive's cafe/bistro. The Prive Bar has a great setting with outdoor couches facing the yachting docks. For a moment it actually feels like you're not in Singapore. Back to reality, I had a  mixed berries mojito which was honestly terrible. The ice was not crushed nor blended properly leaving behind mini ice cubes. The mojito was quite sweet as well which made me wonder if fresh or canned berries were used. Lastly, it came in a really huge tall glass which just further emphasized quantity and not quality. I would definitely return but only for the location and comfortable seating!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "ARs4cPCSP3u6r8CruryxvQ": {
    "date": "8/18/2012",
    "text": "I've been here for brunch, dinner and desserts and have never been disappointed once!Watch out for the crowd on weekends though this place is buzzing even though its not the most accessible.I enjoyed my eggs royale and coffee for brunch but what's unexpected was how good their mushroom soup was! Creamy, flavourful mushroom delight in every scoop.For dinner, I had the no frills burger, it was filling and scrumptious. Dessert didn't disappoint either with the refreshing lemon meringue pie. Even though it overlooks the marina with a nice view of the yachts and the waters, it's not exactly the most romantic place for a meal because it can get quite noisy. Unless you can luckily find yourself in a nice corner spot, at night the outdoor seating does get quite dark! Final verdict: Great food with one of the best views",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "6CHbqU_RHZ6cJPOBaHNmkA": {
    "date": "10/5/2013",
    "text": "Service is terrible where serving staff ignores your presence at entrance. So as per hawker centre style, you can help yourself to a table. Once, I had to help myself to the menu. We usually have dessert, small bites and beer. We enjoy the breeze, ambience and people watching.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XptTBDkLVwyBt_or-IT8NA"
  },
  "vSvvEcvrzrfpAs5_ycEeXA": {
    "date": "9/21/2012",
    "text": "Eh. Overpriced and inconvenient place to have brunch. Not recommending this place at all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpnPcoRGXy5N4mbkqMAjvA"
  },
  "9iI6--_TA9-O2lAW-HfxtA": {
    "date": "8/3/2018",
    "text": "Kids friendly with a small outdoors playground. The quality and price of food meet the expectations of a rather upscale, not too fancy cafe-- clean, neat, nothing too special, common but still prepared with care. I visit once or twice a month for brunch for the nice morning view of the marina or for dinner for the serene atmosphere of the Singapore evening.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tnYrqii0x4BZWomHuyyz6Q"
  },
  "0OcAQ1U1ipTn-wrBqW-I2w": {
    "date": "12/22/2015",
    "text": "This month Nom's is organising its first Cafe Week which is happening over 2 weekends on 10-13 Dec and 17-20 Dec 2015. There is 14 cafes participating in this event, offering Brunch/ Lunch at $25/ person, Tea at $15/ person, and Dinner at $35/ person. The cafe is located at Keppel Bay, which is about 10 minutes walk from Harbourfront MRT station. The place looks like a different world from the nearby noisy and packed Vivocity. Here there is a spread of yachts anchoring around by the bay with expensive looking Condominiums in the background. Sounds like a place for the rich and famous. The cafe is located at Keppel Bay, which is about 10 minutes walk from Harbourfront MRT station. The place looks like a different world from the nearby noisy and packed Vivocity. Here there is a spread of yachts anchoring around by the bay with expensive looking Condominiums in the background. Sounds like a place for the rich and famous. Boston Clam Chowder ($14++)Served in squid ink bread with bacon, Idaho potatoes, celery, parsley and clam stockThe chowder is very rich and thick. Best have it with the crispy squid ink bread which balances the salty bacon's taste in the chowder.Charred Broccoli Salad ($17++)A healthy mix of Virginia ham, baby gem lettuce, avocado, spiced almonds, Spanish onions, blistered grapes and shaved parmesan, drizzled with honey-garlic dressingIt is quite a light and refreshing, although I would prefer the vegetables to be chopped into smaller pieces with more dressing added.Next for the main courses which also come with 2 choices.Linguine Aglio Olio ($18++ for spaghetti version)Linguine Aglio Olio tossed with Chilean scallops, sundried tomatoes, bird's eye chilli, wilted spinach and smoked baconThe pasta is quite tasty with the sweetness of the tomatoes balancing the spicy taste of the chilli and salty bacon.Duck Leg Cassoulet ($28++)Duck Leg Cassoulet served with carrots, pearl onions, mushrooms, Brussels sprouts, garlic confit and baconThe serving is quite huge. The duck meat is quite tender and flavourful, although I feel that the sauce is a bit on the salty side. The sourness taste of pearl onions quite stimulate one's appetite.Lastly for dessert, there is also 2 choices for us to choose from, although we are both quite full by this time.Sticky Date Pudding ($12++)Sticky Date Pudding served with housemade butterscotch and vanilla bean ice cream with sprinkled walnutsIt is my all-time favourite dessert which I will always order when I dine here. I am so happy when I notice it on the menu. The story behind this dessert is that the co-owner of Prive used to operate a restaurant called Brown Sugar which served great Sticky Date Pudding. Since then it is a well known fact that it is the must order dessert here. The sticky date pudding is served pipping hot. It tastes sweet, soft and moist, although I could not taste the bites of dates this time round. A great well done dessert.Chocolate PossetServed with summer berry coulis, pistachio biscottiIt is chocolate mousse, served in a jar. It tastes quite rich and creamy. However it is wasted on me who is a non chocolate lover. It tastes a bit jelat after a few mouthfuls.Overall the food is not bad. Comparing with the ala carte prices, having the $35 nett for the set dinner sounds like such a great deal. The place is packed during the weekend. Getting the staff to refill the water takes quite an effort, although they do check with us on the food from time to time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iB5IUB4CKHB8buViKtqQ4Q",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Charred Broccoli Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iB5IUB4CKHB8buViKtqQ4Q/o.jpg"
      },
      {
        "img_id": "_7iTX_bY7Zxtu4fBwICBYw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Boston Clam Chowder",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_7iTX_bY7Zxtu4fBwICBYw/o.jpg"
      },
      {
        "img_id": "bvmWQ4XINcks-Iik9GdcJA",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Duck Leg Cassoulet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bvmWQ4XINcks-Iik9GdcJA/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "h6SbEaictVvv4BSZx3Fflg": {
    "date": "1/5/2014",
    "text": "Location is nice, great place for the view. Decent food, but service wasn't great. * Omelette with egg whites wasn't anything spectacular. Toast wasn't very unique* Side of chicken sausage - would not recommend* Eggs Benedict - very heavy/buttery sauce, but was decent.Overall, good for the scenery, but wouldn't bank on the food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w0yrQQmUrtqOSAx2Pl0gnQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. View from restaurant",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w0yrQQmUrtqOSAx2Pl0gnQ/o.jpg"
      },
      {
        "img_id": "fUqavL8wZZhMu6JMKWwZtA",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Eggs Benedict",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fUqavL8wZZhMu6JMKWwZtA/o.jpg"
      },
      {
        "img_id": "flZdemII2ec14MibQyvYUQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Egg white omelette with toast and a tomato",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/flZdemII2ec14MibQyvYUQ/o.jpg"
      }
    ],
    "user_id": "qurv1eJZswxUZaZqN53Meg"
  },
  "_t2rmRwhsG_MtaP2i38E6w": {
    "date": "9/1/2014",
    "text": "Have always dined at Privé Cafe and this was my first time at Privé Grill.Service was top-notch and the wait staff were very attentive to our needs. My sole intention of dining here was to try out their steaks.Verdict:- US Creekstone Farms Angus Ribeye Cap (280g) at $88 - this was the most expensive steak on the menu. The waiter recommended this as I wanted something tender and juicy and boy was he right! My only teeny weeny gripe was that I asked for Medium Well and certain parts look Medium to me. Plus, there were 1-2 chunks of fat within the beef which may have contributed to it's 'tenderness' but I can do without the fat.- Appetizer of Crabmeat and Prawn Cake at $17 - our appetizer came as a set of 2 prawn cakes. Order this only if you are famished as the size of each prawn cake is rather large and you might be too full to feast on your main course. The prawn cakes were delightfully crispy and the meat stuffing sat well and didn't crumple as you cut into the prawn cake. Dish was served with rockets which acted as an excellent foil to the savory appetizer.- Roasted Barramundi Fillet at $32 - my partner ordered this and I had a bite of the fish which was amazingly fresh!- Lemon Meringue Tart - we asked if we could order this from the cafe and the staff politely agreed to our request while bringing us a menu to choose from. I remember having this tart a while back and felt that the tar/lemon portion was bigger then what was presented to me. Hmm, nonetheless still my favourite dessert at Privé Cafe.There was a nice end to the night where all the female diners were presented with a small brown paper bag with a wrapped brown package inside!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "1VKB3jqwIItg7NYri7K01A",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Truffle fries. Supper time.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1VKB3jqwIItg7NYri7K01A/o.jpg"
      },
      {
        "img_id": "vuS9dZaqGeKJ4CwQ3YFDqg",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Lemon meringue pie from prive cafe next door. My fav",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vuS9dZaqGeKJ4CwQ3YFDqg/o.jpg"
      },
      {
        "img_id": "PI0qL01V68PMJGezEvWRNA",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Fish ... Something",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PI0qL01V68PMJGezEvWRNA/o.jpg"
      }
    ],
    "user_id": "ZNyfGsIwsedPlpjmoaq3Eg"
  },
  "fbq8wEhC31NQ-iUfWxVvUw": {
    "date": "11/2/2012",
    "text": "I don't really make my way to fancy restaurants unless it's for some kind of occasion. Trudged all the way to Keppel Bay for a friend's birthday dinner and I believe I'll like to make my way there for many future special events to come!First their service is excellent. The service staff are well-versed with their menu offerings and they are patient to help you make your choice if you are unsure. For the 4 of us, we ordered the 1kg Australian grass fed Angus Beef to share and it's a decision that we all totally DID NOT regret. Added on to the order with some servings of sides and another main dish - grilled seabass - absolutely love them.If you are celebrating your birthday there, just let the service staff know and they'll be happy to serve up a complimentary slice of cake accompanied with well wishes and a birthday song from the crew. We further satisfied our sweet tooth with a sticky date and pear pudding that's just simply...marvelous. The sweetness of the pear complemented the sticky date pudding well and it was overall, very pleasant!So who's up with a special occasion soon? Bring me to Prive Grill please! ;)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oNB3FbuGWF1-SW834wPZNw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Yummylicious sticky date and pear pudding",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oNB3FbuGWF1-SW834wPZNw/o.jpg"
      },
      {
        "img_id": "ZFEE1Tyx_9pwOT7-FLImsg",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. 1kg Australian grass fed Angus Beef - medium",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZFEE1Tyx_9pwOT7-FLImsg/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "16WLgRgV8JxwlB-RGLUATQ": {
    "date": "4/1/2016",
    "text": "Burger good. Seabass dry. Soup and salad good. Ambiance very good. Ditto on the service. Price Very reasonable. Me likey.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gBy-cIXe0DQKhFjifu68Q"
  },
  "7vMMa6XwwNvyGCihw4hJnw": {
    "date": "10/30/2013",
    "text": "Ok this is not your usual menu. We went to a special wine dinner with an off the menu selection. So the expectation was high in terms of food quality since we were pairing with some great wines from Australia. We began with the starter. The dish was nicely balanced. Though a hint too much lime and could have done with a little more salt. The Sauvignon blanc went perfectly with it. This was followed with the salmon belly, which was very good. It also paired well with the estate Chardonnay. The wine was exceptional and complex going well with the rich fish. For the next dish an air dried beef with truffle foam was presented. Another good dish, though I felt that the truffle overwhelmed the dish a little. Mains was an exceptionally good hanger steak. Perfectly seared and served plain with mustard. It was juicy and wonderfully tender and flavorful. Best dish of the night. Went well with the cab sav. Dessert was nice but not exceptional. The wine on the other hand was very good and was the star of the dish. Generally the food was very good, up to expectations. But the price with wine pairing of about $100 per person made it exceptional good value so I rate this a 5 star, though if I removed the wine and rated the food alone it would be a 4 star. Be aware that we ate at the aircon grill room with a special menu so I can't vouch for the standard menu. Nonetheless I'm impressed to want to come back again to try the normal menu.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "k7QZx17LhfoyixaIm_TSIw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Dessert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k7QZx17LhfoyixaIm_TSIw/o.jpg"
      },
      {
        "img_id": "fihoJlwwSWOCmwBJmp1GyQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Hanger steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fihoJlwwSWOCmwBJmp1GyQ/o.jpg"
      },
      {
        "img_id": "7Zr91lTny08r38uri2k6Gw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Air dried beef with truffle foam",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7Zr91lTny08r38uri2k6Gw/o.jpg"
      }
    ],
    "user_id": "91UQ_DLi_qsDXQfg6kBePw"
  },
  "S9X1tFbE1ckpfGVFO0cwHw": {
    "date": "2/19/2013",
    "text": "Very honestly: 2.5 actual stars for the food, extra 0.5 stars for the ingredients and another star for the location. Prive cafe is situated right in front of a Marina, the perfect spot to feel like you are in Santorini, or Tuscany, or somewhere in the Mediterranean, with a view of the gorgeous (i like to imagine it as blue) sea, and private yachts. Need a vacation and have no cash, try Prive cafe!  It is also kids friendly with a nice little playground where kids can frolic while the adults caught up over eggs and coffee. All the good things aside, food wise, I was disappointed. I had their Prive burger, and fiance had the Ultimate breakkie. The first thing I noticed was all the fresh ingredients, the salad looked fresh, the beef patty looked thick and juicy, I was excited to start. However sad to say, the taste just wasn't there. The beef patty while thick was tasteless. The buns were soaked in butter causing them to lose their fluffiness. And the ultimate breakkie also nothing spectacular. While they didn't scrimp on the ingredients, the cooking would be better done to make full use of the good ingredients they have! Meh, I would still go back because of the location just to give them another chance.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cXD8sK2ylmyT5Du6o2vFfQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. View from our table.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cXD8sK2ylmyT5Du6o2vFfQ/o.jpg"
      },
      {
        "img_id": "qsbB1AE3S_ays3G2QDMD_Q",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Ultimate breakkie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qsbB1AE3S_ays3G2QDMD_Q/o.jpg"
      },
      {
        "img_id": "CQmLplvi-VYvraQsv47F9w",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. The Prive Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CQmLplvi-VYvraQsv47F9w/o.jpg"
      }
    ],
    "user_id": "60S1f9efCHbSp4AxJJnsrA"
  },
  "qHu5T1YXpG1NTUHqzBjcyw": {
    "date": "11/3/2012",
    "text": "This is a review of a dinner with a friend on a Friday evening at Privé Grill.First, as it is on Keppel Island, it is a little off the beaten path.The room is modern yet classic.  This is the type of room that defines what I expect from a fine dining experience.  My only issue with the ambiance is that, even on a Friday evening, the restaurant was almost completely empty.  This means the evening was missing the energy brought by other diners enjoying their meals.The staff is excellent.  They are friendly and professional.  But, more than that, they demonstrated an eye for detail and took extra steps along the  way to insure we enjoyed our meal.The food ranged from below average to excellent.  It is this level of inconsistency that left this just short of a five star dining experience.The meal was extremely well paced.  The staff had a knack of being there when needed.  The server was very helpful with our questions concerning the menu.  The food came in a perfect and never rushed order.After we had selected the bottle of wine, they brought an amuse bouche of sashimi.  When I communicated to the server that my dining companion can not eat raw seafood, the server quickly whisked hers away.  Soon after, a replacement of grilled watermelon was brought out.  tinyurl.com/dxc3e5utinyurl.com/cvexxd7A nice basket of breads was provided next.tinyurl.com/c2yyzbwWe usually order starters to share.  However, on this evening, we went our own ways.  We shared small bites but, for the most part,  we stuck to our own appetizers.I chose:JAMÓN IBÉRICO BELLOTA  (Saffron Pear Chutney, Tomato Bruschetta) This was very good.  The Iberian ham itself was excellent.  The sweet tomatoes provided a nice contrast to the ham's saltiness.   The bread was simply there as an organic spoon.tinyurl.com/bn8b3c9She chose:PRIVÉ GRILL'S CAESAR SALAD (Poached Egg, Bacon, Shaved Aged Parmesan, Garlic Croutons, Anchovies)First, my friend ordered this without the sliced anchovies.  From my taste and watching my dining companion easily complete it, this seemed like a very successful rendition of a classic.  The only negative was the large shavings of Parmesan were a little difficult to navigate.  They may have been a little form over function.  The salad would have been easier to eat with an even distribution of smaller shavings .tinyurl.com/cju9qolMy Main:NEW ZEALAND \"HARMONY\" ORGANIC (Sourced only from free-range farms, Harmony's cattle are all 100%grass-fed in open pastures. - RIB-EYE 340g) - Hmmm, with all of that fancy talk, I expected a melt in my mouth spectacular steak.   It simply was not to be.  It was cooked to a perfect medium rare.  However, through lack of seasoning or some other misstep, it was rather bland.  While not tough, it was also not as tender as I expect from a high quality rib-eye.tinyurl.com/c4bfl95TWICE BAKED POTATOES (Bacon, Sour Cream, Chives)This was barely edible.  It was more akin to overcooked baked potato than twice baked potato.  I love potatoes.  I really do.  For me to walk away from a potato, there has to be something seriously wrong with it.Her Main:JOSPER-ROASTED WHOLE SEA BASS (Confit of Garlic Bulbs, Lemon Caper Sauce) Every show has a star, and for this meal, the sea bass was certainly the diva.  It was tender.  It was buttery.  The garlic and the lemon were provided in a way that they were complimentary without dominating the flavor of the delicate fish.  This is how a fish should be served.  Unfortunately, it was hers and I only was given remnant bites here and there.One last little touch, when asked about dessert, we looked at the menu.  We both decided we simply could not eat anything else.  After we told our server, she soon returned with a small bag containing a slice of carrot cake for us to share later.  The receipt:tinyurl.com/d2tvq9vOverall, this was a very good dining experience.  The service was excellent.  All the ambiance required was the buzz brought by additional diners.  The food certainly had some very high points but there were also some low ones.  In the end, we both enjoyed our time at Privé Grill.(Special note: We  topped it off with a lovely and very peaceful walk along the water.  This is definitely a secondary perk from dining here.)",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bRwGQCAKyjPuTvapLhj1Jg",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Receipt - Prive Grill - Keppel Island - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bRwGQCAKyjPuTvapLhj1Jg/o.jpg"
      },
      {
        "img_id": "P-w_goZ1Uk7jFRpRfiHu3Q",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Grilled Sea Bass - Prive Grill - Keppel Island - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P-w_goZ1Uk7jFRpRfiHu3Q/o.jpg"
      },
      {
        "img_id": "IwAZqI_O03DIso-QnpowCQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Ribeye sliced - Prive Grill - Keppel Island - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IwAZqI_O03DIso-QnpowCQ/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "g8YDDBheB4OFiY49GKedAA": {
    "date": "11/9/2015",
    "text": "We had the quiche qnd duck leg confit salad from the brunch menu. Great location and tasty snacks/food. But service was very slow and bad. Salad portions are the size of side dishes. Granted we went on a public holiday, the place is either understaffed or staff needs to step up their pace. Overall, the food is overpriced and bad experience despite the wonderful location.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9mgV2ADoUGuzH1HJYXn8g"
  },
  "HMET3tRw00OB8mPBUn9V-g": {
    "date": "9/27/2015",
    "text": "Ambiance is nice, overlooks the Kepple Marina/Kepple bay area. The coffee was good.   I had a steak sandwich which I would not get again but that being said the duck salad, seabass and spicy pizza my lunch - mates had were good. I would go back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CgiW9YTVnfNk-PR93QHmjQ"
  },
  "fWSnDRy4DkMKS2Gi0Ja4dA": {
    "date": "4/2/2013",
    "text": "This place has come up in brunch location wish-lists the girlfriend sometimes talks about, so off we went one late morning (okay, more like early afternoon. okay 1.30pm).Even arriving at that time (when we thought most people would be done with lunch, let alone brunch), and it being a weekday, it was still a packed house. Interesting mix of office-y crowd, expat mothers, and... young couples? Seems like As we surveyed the seating situation, the hostesses came up to ask if we wanted to dine from the cafe or grill menus, and I wondered if it would make a difference to where we were seated, but we were showed to the first table inside the door all the same. Menus came out pretty quick, but perhaps someone could come take our order? The staff were incredibly busy bussing tables and moving things about, and considering we sat next to two dudes who looked like managers doing paperwork, maybe they weren't so keen to walk our way?We both ended up getting poached egg dishes, and when they arrived, they looked a little... conservative. I had the eggs benny, and while they were generous with the hollandaise sauce, everything was kinda room-temperature-ish, while I was thinking that the eggs might be warmer? I'd also asked for an additional side of hash brown(s), which appeared in a singular triangle that may have been more at home at a fast-food joint.The mushroom soup was pretty good though, chunky and flavourful, so it wasn't all bad.Perhaps I had my hopes up - after all, this is at a yacht club filled with luxury boats, and I'd heard such great things. Maybe next time I'll pick a quieter time, and hope the kitchen and staff aren't quite so busy?",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "gzIGXwkMULLOAjMlReJhuw": {
    "date": "8/21/2012",
    "text": "We came to Prive Cafe for a spot of tea and found it a lovely place for a lazy weekend afternoon. Cakes go for 50% between 3pm-6pm on weekdays so if you happen to be at a loose end on a late week day afternoon, there's a good variety of cakes and such for a good chinwag with a girl friend or two.We liked the fruit tart with a generous topping of pears, mangos, raspberries and blueberries, as well as the carrot cake and the apricot almond cake. The chicken pie was also pretty good and the coffees decent.Service was pleasant and efficient.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WuvmtsyahXiA06sjYXWOYQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WuvmtsyahXiA06sjYXWOYQ/o.jpg"
      }
    ],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "xHlIgFGKln4H9sxC0XFspA": {
    "date": "8/7/2012",
    "text": "One of my favourite places for brunch is the Prive Cafe overlooking a beautiful Marina filled with bobbing yachts in the breeze. This is one of those places that makes you feel like you're on a holiday and far far away from Monday blues. The only downside would be the really long walk it would take to the cafe/restaurant if you're not driving. Best items on the menu would be their all-day breakfast dishes! My staple items would be the Eggs Royale, with English muffins topped with smoked salmon and poached eggs, its everything I'd ask for in a big hearty breakfast. Try out a hot cup of their Hazelnut Latte, one of the best I've tasted! Its creamy and thick in all the right flavours, but not sickly sweet and balanced with just the right amount of coffee aroma. For dessert if you still have space in there somewhere (I'm a girl - we have a separate stomach for such things) the Sticky Date Pudding is awesome! It comes drowned in a sea of butterscotch sauce, a scoop of vanilla ice cream and lots of chunky half walnuts - yummy!Its a great place to take a stroll along the bridge or marina after your meal too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9C2JFDT2P9vnpXWU-L1nkw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9C2JFDT2P9vnpXWU-L1nkw/o.jpg"
      },
      {
        "img_id": "FDf2yLaXf65a5rUPw6m5UQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FDf2yLaXf65a5rUPw6m5UQ/o.jpg"
      },
      {
        "img_id": "IwTak1yH87M7P-_oy1s2fg",
        "caption": "Photo of Prive Cafe - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IwTak1yH87M7P-_oy1s2fg/o.jpg"
      }
    ],
    "user_id": "05tSDymzhXyvaxO1G24d0g"
  },
  "cJTY9xzGy-gm_3fDRpfbFA": {
    "date": "3/20/2014",
    "text": "Really enjoyed the restaurant week offerings at Privé! I'm not much of a shellfish person but Privé put the scallop in a very different gastronomical light for me. The ingredients used towards the scallop ceviche were fresh and complemented the scallops very well. The lamb saddle was nothing short of delicious and highly recommended. Their dessert could use a little work though. Had the mango tarte tartin with coconut ice cream which was more of a strudel a la mode really. Nonetheless both \"tart\" and ice cream were too sweet and rather artificial in taste. Overall, excellent food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZB9BOYtkB6aVB0onI37FYw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Mango Tarte Tartin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZB9BOYtkB6aVB0onI37FYw/o.jpg"
      },
      {
        "img_id": "-YgZ2TKNkvXPYcK_KGVZAg",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Grilled Salt Bush Lamb Saddle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-YgZ2TKNkvXPYcK_KGVZAg/o.jpg"
      },
      {
        "img_id": "TX3qld2Dn4u0kqhSKMdhWw",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. Maine Scallops Ceviche",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TX3qld2Dn4u0kqhSKMdhWw/o.jpg"
      }
    ],
    "user_id": "NGFQtEXqIwiLMgXZH_vehg"
  },
  "VGTY4OXwvurinoL_RjFPfQ": {
    "date": "7/19/2012",
    "text": "The thrill of dining here really comes from being next to a marina with yachts on a lazy morning than from the food. It paints an idyllic picture for brunch, complete with the famous eggs benedict. Also, the fact that Prive serves all-day breakfast doesn't hurt, especially for those recovering from a hangover or who just cannot bring themselves to wake before noon on week.The service staff is a little forgetful. But you'd probably do well to forgive and forget too, looking out over these calm waters.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "B43Fhpy3w9M4C-8hdx-3uQ": {
    "date": "3/23/2013",
    "text": "Great location, great ambience, lackluster food. I've been here for dessert several times and brunch as well. The prices are astronomical for the quality of food they serve. If my friends didn't live right across the bridge @ The Caribbean, i would really skip it altogether",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCmvpQfFpdxhbWVM59eUCg"
  },
  "aNi8xAwtGoXJ8waici6ZRA": {
    "date": "9/9/2014",
    "text": "Great marina location on the water with a laid back vibe and beautiful view of the harbor.  Food and drink and service well attempted.  Nice location for group dinner or just a quiet location for a drink.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KqR71xx01uMNccPnkvKSyw"
  },
  "UGwIGgUyytv4v-e3rg68TA": {
    "date": "8/15/2012",
    "text": "I came here for a work thing, which is good cos I wouldn't be able to afford dinner here on my own. We took up the private room, which was a big favor from Prive - perks of friendship eh? Lots of wine and orders off the Josper Grill - the grill is as good as it gets! Started off with the amuse bouche of crab meat cake, pan seared duck foie gras as appetizer and honey glazed beef short rib for the main. The short rib was.. wow. Just, wow. Sweet, smoky, tender, and it went down well with the caramelized onions on the side. Dessert was a lovely nut tart, such a beauty to look upon. Prive is a lovely setting for a romantic date, but only if you have really deep pockets.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wFZv_hFYqu5rstOUC7NDjA",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. nut tart",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wFZv_hFYqu5rstOUC7NDjA/o.jpg"
      },
      {
        "img_id": "mDChDOZuGTcXw3NFU8n8Sg",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. honey glazed beef short ribs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mDChDOZuGTcXw3NFU8n8Sg/o.jpg"
      },
      {
        "img_id": "R4Fc3A3J2eXwZC_Q1itXDQ",
        "caption": "Photo of Prive Cafe - Singapore, Singapore. pan seared duck foie gras",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R4Fc3A3J2eXwZC_Q1itXDQ/o.jpg"
      }
    ],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  },
  "FMKD4VxjQ2wMMH6TK-ql6g": {
    "date": "8/19/2012",
    "text": "Other than the pain of getting here (you need to drive or take a taxi), the views of the marina and the exaggerated pleasure of dining on a private island make coming to Prive totally worth it. The views of the bridge are somewhat similar to looking at the Rama VIII bridge in Bangkok. The alfresco seats are especially nice in the evening but only with a breeze and no rain prior.Most people dine at Prive Cafe, which serves breakfast favorites like eggs benedict and a dinner menu featuring lamb shank and a number of pastas. You must have the sticky date pudding and you can forgo the Kahlua and Cream milkshake.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37veRneM-BBpXzSNw-jCGw"
  }
}