{
  "WVzM2npc3ifMAIfMd2STgQ": {
    "date": "12/25/2012",
    "text": "Some have said that one should arrive early to get a seat especially on Fri/Sat or be prepared to queue. Ironically, we promptly arrive at 6pm but it was only ready for service after 15minutes. The place was about 80% full and the service was insincere for some. There were both hits and misses with the food but one gripe is that the size really can be afforded to be more generous even though they are tapas. Otherwise, it might be better to charge tapas price for tapas rather than main course prices for tapas.Foodwise, it was acceptable to me to experiment with the new creations but not for The Folks who commented that they had no idea what they were eating that night. Perhaps Spanish tapas might not be the cup of tea for everyone but I shall still continue to search for one that will be comfortable not only to the tastebuds but also to our stomachs and pocket.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "SAovSZiiAAZTNZsMlNwdIw": {
    "date": "7/12/2012",
    "text": "I love tapas bars so when I heard Jason Atherton had opened one in Singapore, I quickly rounded up a couple of friends to check it out. We waited for about 45 minutes to get seats ... and that was at 930pm. Esquina doesn't take reservations, and I realise upon getting a seat that I might as well have eaten standing because they were really awkward and uncomfortable.Food : Wow, the heritage tomatoes with sherry dressing were something else. Fresh, juicy and sweet ... one of the best tomatoes we have had in a while, including the momotaro ones we usually have in Japanese restaurants. Good ham croquetas and we really loved the gambas as well as the scallop ceviche. The slow cooked egg was quite good and the ox cheek was quite soft and tender. The Iberico pork and foie gras burger was the winner of the night for my two friends however, they couldn't stop raving about it. We also really liked the sangria ice cream cone ... I think it was a daily special though.Ambience : Like the trend that seems to be going around for tapas bars, it also has an industrial chic vibe. But unlike Foodbar Dada, the seats are uncomfortable and almost make us feel they are discouraging diners from getting too comfortable.Service : Quite decent. Even more so when there isn't a service charge levied.Change the chairs goddammit.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "dqGq_YQYKiBWiQv5d1gTiA": {
    "date": "1/7/2013",
    "text": "Chinatown in Singapore is not exactly where you'd expect to find a top notch Spanish restaurant.  But that's exactly where you'll find Esquina Tapas Bar.  'Esquina' translates to 'corner' and true to its name, the tapas bar is located on a street corner, in Chinatown. This place has serious cooking credentials.  Culinary Director Jason Atherton, notably Gordon Ramsey's protege, Michelin star winner and the first British Chef to complete a stage at the famed el Bulli restaurant in Spain, has teamed up with Irish Executive Chef, Andrew Walsh to create a stunning modern tapas restaurant. Esquina is reminiscent of tapas bars you would find in Spain.  A long, thin hallway with a bar, high stools and an open kitchen provides a chilled, relaxed atmosphere.  It's all about the food here, and you get the feeling you're in for a treat the moment you step through the door.The menu is innovative and exciting and there are also blackboard specials.  This is not your average chorizo and meatball menu, this is a whole other level of tapas entirely. Mr M, who requested to be referred to as 'The Stuntman' in this post (ok, I'll indulge him) and I dine on a Tuesday evening, and it's packed with a cool vibe.  The staff are friendly and we take our stools at the bar with the perfect view of the kitchen.  Executive Chef Andrew Walsh is on-board this evening and he helps us with our menu selections. The Stuntman and I choose our menu as follows:* Iberico Bellota* Tuna Tartare, wasabi celeriac remoulade, vietnamese dressing, crispy shallot (blackboard special)* Marinated beetroot salad, honeycomb burrata, pinenut crumble* Grilled Rib-eye, spice aubegine puree, lentil pearl barley dhal* Baked bone marrow with snails, parsley and horseradish pesto* Berry sorbet (compliments of the chef)* Watermelon salad, gazpacho, basil sorbet The food is exceptional and beautifully presented, with the standouts for me being the beetroot salad and the bone marrow (no easy feat given I wouldn't usually order bone marrow, or snails, for that matter)! This is an underground foodie den and well worth adding to your dining itinerary when you're next travelling through Singapore.  Imagine your street cred when you whip out this gem.  I have to say, Singapore has some amazing dining experiences - it's a foodie's paradise, take note!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVI_VZAOX_Mc63pGJPPenw"
  },
  "DC4lzEckWMw81qZLygX6eg": {
    "date": "8/11/2012",
    "text": "Im a massive massive tapas fan, and have spent many a good night in Esquina since it has opened. It has a very cool, industrial chic feeling to the small and narrow dining room. Sitting by the long bar looking across at the chefs prepare everything adds to the experience of this place. Unlike some of the other tapas places around Singapore, the food here is both contemporary and exciting.Had the tuna tartare was both fresh in produce used and flavor, tuna, avocado and sesame, simple , easy and worked really well. Full English breakfast was both a clever play on words and on the palate.  Desserts!! Strawberry gazpacho with basil sorbert was a fantastic way to finish. I've had too many bad basil sorbet experiences in my time, they are either far too sweet or don't resemble basil at all, though this one nailed it and married perfectly with the soup.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZqj0zcaOXV63mVVVLAhhQ"
  },
  "0d6vVCeBw6jN9YpVa06yZA": {
    "date": "7/9/2014",
    "text": "Maybe it was because I had high hopes for this place. After looking through the reviews and pictures, I was really excited about the food because they looked beautiful in the posted pictures. Unfortunately, Esquina didn't deliver for me. The plating was beautiful, the service was good, and the decor of the place was chic and pretty. The most important thing though, the taste and flavor of the food, did not do it for me. We ordered all the popular dishes I've read about in the reviews. The pork cracking was just....fried pork skin. The pairing of the herring roe and salt cod mousse did not really push the taste of the pork to greater heights. Instead, it was just in general a flat dish. I have the same criticism for most of their dishes. The ingredients are good, but they just do not come together to deliver a dish of finesse or overlapping flavors. The jambon croquetas were good for what they were, fried cheese balls with ham, but even that was a tad too salty. The whipped burrata with beets was visually an astounding dish to look at, but again the essence of each element did not shine through. The burrata lacked the distinct milky taste, the pinenut crumble did not even taste strongly of pinenuts. So apart from the welcoming acidity the pickled beets brought, the dish was again flat, with no complexity. The uni bisque actually did have a good taste, and chock full of crabmeat that could have been sweeter, but the crab flavor overwhelmed the delicate uni flavor, and as a result, after the initial taste, the uni taste was barely detectable. Arguably the best dish of the night though. The pulled pork and foie gras burgers had good flavors going on, albeit a little too salty. I do appreciate that they blended the foie gras in the pulled pork patty. The sauerkraut was a little redundant though. In general, I thought that the items were overpriced for the taste level and the amount of food served.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "5pE5dk8g-jI-chxn1pC2TA": {
    "date": "2/13/2013",
    "text": "Great food but tiny portions. Went for lunch so didn't need to queue at all. Had the steak tartare which was great and the beetroot salad was refreshing. The beef cheek with ox tongue was delish as well. Tip: don't go there hungry unless you have cash to splash!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hiUDfQ5UdPfi5UqnOmDdfQ"
  },
  "0G_RHXRYEc5gbr_GhkWDnA": {
    "date": "4/13/2014",
    "text": "Definitely a great meal, but for tapas, pricey to the point that it's not worth spending what you will. Rather spend a bit less at a tapas spot like Binomios or Sabios, or spend the money on a full meal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GygQ-lvebqVhU1hnwTSi0A"
  },
  "oEo8jtDtRxndK1m52vDESQ": {
    "date": "6/30/2013",
    "text": "Absolutely horrendous and unacceptable levels of service. I would have loved to comment on the food but the sad thing is that the food that we ordered did not arrive at all.  We had expected our food to arrive, as we were given fresh plates and cutlery while waiting. After waiting at our table outside the restaurant for approximately 30 minutes, we decided to check on our orders with the waitress/hostess who took them. When we asked the said waitress about our orders, she simply turned to the kitchen, without acknowledging our query, and asked the crew if our food was on the way. Crew informs her that it was not. The waitress turns back to us and curtly informs us that our food \"is not coming\". No apology was given nor an explanation proffered. Her dismissive attitude was completely shocking. It was as if we had spoilt her evening and put her in a bad mood, and not the other way around. I should point out that we did not even complain about the wait, but merely queried her on whether our food was coming. I don't care how good your food is if you treat your customers like crap. I get that orders sometimes get lost in the process, particularly at a busy joint like this. But no customer should be treated dismissively after a fruitless and unnecessary wait for the food. It's sad that my experience was marred by one person's truly appalling service.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Imxj8nYyM2Vw56l2y1noQ"
  },
  "Jh-tLnPWTLij2u20bOLEyw": {
    "date": "8/17/2012",
    "text": "Yes, Jason Atherton does make me gravitate towards Esquina even without asking around if it was any good. While I fully know he's not gonna be cooking my tapas, I had the prior faith that Esquina will justify my good faith, and I won't say I'm disappointed. It's small, it's popular and overcrowded, but if you actually do get a seat by going strategically at 6pm, the rewards are sweet. Watching the finesse of two chefs working/performing in front of you, agile, swift and serious, I can hardly discount any dish as so-so. The effort is worth half the battle. But have you tasted the gorgeous  heritage tomatoes or the slow cooked eggs? I'm not saying that you will NEVER taste any better, for what I have to pay for them, I'd say dish them out every dinner! It's definitely worth my money, the consistent doneness of the egg with the patatas brava spin off is awesome. If the leg of ham doesn't instill any faith in how serious they are, I don't know what will.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKY29o3cqaQYcFdR_bZdg"
  },
  "sN_axWJAlE_uTuKk7dDp-A": {
    "date": "1/30/2018",
    "text": "Great food and experience. Came here for an anniversary dinner, and it's one of our favorite date spots. FOOD (they can flat out cook):* menu changes 2 or 3 times a year* must try: steak, uni toast, grilled romaine, paella SERVICE:* just the right amount of attentive* if you sit at the counter, then cooks interact with you as well* gave us an anniversary cakePRICE: * $$$$ (350 for 2 pax)* we did order quite a few dishes, and a bottle of wineOVERALL: * don't go too hungry...portions are small and dishes expensive* definitely sit at the counter* great experience...would go again",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUAiW8Lcdla5Ii53kV6RFw"
  },
  "vUnpqXijpBqxUI2FlSF2Ow": {
    "date": "6/10/2017",
    "text": "Great food/menu, entertaining atmosphere, attentive staff.Went for dinner on a Friday night and was very impressed. Sat at the bar, on the other side of which is the kitchen with the chef and his staff flying around carefully preparing each dish. Several times I saw the chef inspect food made by his staff, determine it wasn't quite right and have them do it again. Although I'm sure it was still good, I appreciated the dedication to only serving perfect food. The staff was also very good - very attentive, reminded you of the specifics of the dish when serving, and generally accommodating. Specifics below, but recommend ordering the Cauliflower and Pigeon and sit at the bar. The paella looked incredible - watched them make at least a dozen.Food:Chorizo Iberico Croquettes: really really good, could eat them until I was sickShishito Peppers - came in some chimichuri / sriracha sauce which was terrific - was a daily specialRoasted Cauliflower - really really good. Combination of the char from roasting the cauliflower with the couscous and the creamy sauce is a home run.Grilled Octopus - good, but in comparison to the other dishes, lacked flavorRibeye - great flavor, perfectly cookedPigeon - must order - cooked to perfect,very flavorful, could eat several orders of this",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOHPM1YtbBTBBa4--xuo6A"
  },
  "bv6UgeIg0MKntQei5U23QQ": {
    "date": "11/8/2017",
    "text": "I've eaten at wonderful restaurants all over the world, and this spot is one of my favorites. Although they can accommodate larger groups, you get the best experience with a small group seated at the bar. Everyone is friendly and accommodating, and the vibe is more neighborhood bar than fine dining. Oysters, prawns, cauliflower, paella and desserts are all amazing and beautifully presented.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jcOZRExHU9ukcoXWy61Itw",
        "caption": "Photo of Esquina - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jcOZRExHU9ukcoXWy61Itw/o.jpg"
      },
      {
        "img_id": "KzNpeIman8A7DI8urinNEg",
        "caption": "Photo of Esquina - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KzNpeIman8A7DI8urinNEg/o.jpg"
      },
      {
        "img_id": "zhtgvXC7LHY_AY9ulcZuEg",
        "caption": "Photo of Esquina - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zhtgvXC7LHY_AY9ulcZuEg/o.jpg"
      }
    ],
    "user_id": "Te8gqzPi3OK5WaNoQHy78g"
  },
  "c0iqGqRbJPW1Zyi_5Y6IFA": {
    "date": "1/1/2016",
    "text": "I have been to Esquina several times and I was initially a huge fan but I must say that it has really become worse. The Singapore outpost of Jason Athertons restaurant empire is not at all up to the level that one should be able to expect. The dishes are some sort of mid-sized dishes categorized by Sea,  Land and Soil. Much of the food is of very good quality, especially the Spanish Breakfast and the mini pork burgers standout. The food is however not the main problem, it is more the service that is faltering. We were just seated when we were told it is last orders. Why even accept reservations if you are closing the kitchen right away? The service was also in general slow,  20 minutes wait for a beer when the place is virtually empty isn't ok. Staff were also mostly interested in talking on the phone or with each other. We also had them without asking opening bottles of water and charging 9.5++ SGD per bottle. Selection of beer is boring and over-priced but the wine selection is good and can recommend the Torello cava. The prices per glass are however cheaper than buying a bottle (they claim 5 glasses per bottle and the price for a bottle is 6.9 times the glass price -  waitress just stared at me and left when I pointed out it was cheaper to buy per glass. Probably not her fault but the management need to have better pricing strategy). This all sounds like the place is bad but the redeeming feature is the food so hope the management can produce some decent service as the prices should mean that one can expect both food and service to be good.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "l-g6bJDqM_MylZb8CssjhA": {
    "date": "12/16/2017",
    "text": "Initially thought we were going to sit on the 2nd floor but happy we were seated along the kitchen bar.  The Head Chef from Barcelona was extremely pleasant to chat with and definitely made our experience memorable. Highly recommend grabbing a bite here and sparking up conversation with the kitchen staff- you won't regret it! Tapas were top notch and every dish was delicious! If we are ever in Singapore again we will be stopping by again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xgR1LOA38x8dJaBszujyXQ"
  },
  "tdAogEi_AO0AgaHA_U_WgA": {
    "date": "3/12/2016",
    "text": "Fun place for a night out, plus the dishes are creative, novel and exciting.We had:- Mini Spanish breakfast: soft scrambled egg, mushroom and chorizo ketchup, baked potato foam ($10) - delicately served in a wooden box and on a bed of hay. The potato foam and the egg went deliciously well together, and was light on the palate, with the chorizo ketchup giving a nice homely aftertaste.- Esquina's Spanish omelette: confit onion, potato, crispy bread, olive oil caviar ($6) - this was alright, tasted more like lightly fried potato than anything.- Roasted cauliflower, cauliflower couscous, Serrano ham, manchego cheese ($16) - this was decent and flavorful; a tad too much oil though- Crispy baby squid, chili coriander, squid ink aioli ($14) - we ordered this at the spur of the moment, and it turned out to be one of our favorite dishes of the night. The squid was crispy and flavorful, and we loved the squid ink aioli. Perfect for munching over great conversation. Definitely get this to share.- Pigeon, forest berries escabeche, burnt Rosemary polenta, crisp shallots ($22) - this took forever to come, though the pigeon was juicy and tender. The berries were a nice touch. - Grilled Spanish octopus, Jerusalem artichoke, burnt onion, oyster leaf ($28) - the best dish of the night, in my books. The octopus was meaty and tender, loved the charred bits, and it went brilliantly with the artichoke puree. Highly recommend this.- Salted cod \"Alkorta\", iberico & tomato chickpeas, black garlic from \"Las Pedroneras\" ($28) - another brilliantly executed dish. The chickpeas and tender cod went fantastically with the sweetness of the black garlic, not to mention the visually stunning presentation. We were too full for dessert, but they did give us complimentary bites of chocolate ganache on bread.I liked that the chef made the effort to serve the dishes (we were seated at the bar) and introduce the dishes to us. However, the service was slightly off. The servers had a knack of interrupting us mid-conversation/mid-bite. Got slightly annoying after awhile. Overall enjoyable and worth a visit!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "r0MaG_NkfDvEOwI7PXdYTw",
        "caption": "Photo of Esquina - Singapore, Singapore. Mini Spanish breakfast: soft scrambled egg, mushroom and chorizo ketchup, baked potato foam",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r0MaG_NkfDvEOwI7PXdYTw/o.jpg"
      },
      {
        "img_id": "XpVxhI12GzKXnjXeZCf1Ag",
        "caption": "Photo of Esquina - Singapore, Singapore. Esquina's Spanish omelette: confit onion, potato, crispy bread, olive oil caviar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XpVxhI12GzKXnjXeZCf1Ag/o.jpg"
      },
      {
        "img_id": "xkUDMkSRGEk_psYfEq3Q7A",
        "caption": "Photo of Esquina - Singapore, Singapore. Roasted cauliflower, cauliflower couscous, Serrano ham, manchego cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xkUDMkSRGEk_psYfEq3Q7A/o.jpg"
      }
    ],
    "user_id": "seb6_XUoH4q-mtJ6pCCXlg"
  },
  "B9LW6ST9yMZM0ucWEJxSbg": {
    "date": "3/22/2016",
    "text": "Popped in for lunch, very interesting setting and usage of narrow and long space by setting up bar seats and the chefs prepare the food right in front of you.  Chef Matthew is Spanish and is meticulous at crafting the dishes.  The layering of flavors, textures of ingredients is extremely creative and ingredients themselves are unique and fresh.  Chef Matthew is very creative, the basel and red pepper sorbets are awesome, so as the onion jam, fermented garlic paste, emulsified fish in the nigiri and the many other fantastic creations. The beauty is in using old school techniques and classic Spanish ingredients but presenting them in a new forms.  Impressive stuff.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 9,
      "cool": 10
    },
    "photos": [],
    "user_id": "EleQKGrUDo_-zvpfOVHYMQ"
  },
  "NkxLQ53pJYebVJv9s2znEg": {
    "date": "7/9/2017",
    "text": "I really dig the shophouse feel. We dined on the second floor which felt like a private dining room. Our food was above average, but the service quality was below. It's a decent place for tapas and an OK wine list. I waiting for 20 min to get my beer after I ordered though. If Binomio is booked out down the road, this should be your next choice for tapas in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "fqM4ilutHt3kY8Oj5BhF6A": {
    "date": "8/20/2014",
    "text": "We made a reservation for two at 7pm inside, and were seated at the far end of the table where one seat wasn't really a seat but never mind.We asked the waitress how many plates should two people have and she answered three. Well three is a wrong number as we ended up ordering more and waiting and waiting because we didn't order at a go. How inefficient.We had the seaweed dashi poached oyster, which was okay, tasted like a boiled oyster with some dashi, nothing really special. I am not pleased to announce we were not impressed with the pork crackling as it tasted like pork flavored fried fish maw with some black roe on top. None of the lardy goodness we were expecting. We mostly got plates from the Sea section, the scallop sashimi with duck ham, lemon, and burnt cucumber was okay. Scallop sashimi has a delicate flavor and I felt the accompaniments overwhelmed it. Good accompaniments should accentuate the flavor instead. I did like that they left the scallops whole instead of slicing them thin or into pieces.Next up was the seared scallops with duck green curry and coconut rice. I don't eat peanuts so we got them on the side so that's good. The scallops were really good and seared properly but again the green curry didn't complement the scallops!We were hungry so we got the snapper, which was done quite well and came with pine nuts and couscous, with some orange. This went quite well as a dish and I rather enjoyed it. Last up for savories was the beef short ribs with cauliflower, tongue, and brown butter. This was a disappointment because we waited the longest for this and it tasted very ordinary. Well it just wasn't a party in my mouth. Meh. We ended the meal with desserts and had the chocolate mousse with popcorn milk and the manchego cheese pudding. We thought the popcorn milk sounded good on paper but it overwhelmed the mousse and textures wise, mousse and milk don't quite go well together.The cheese pudding was a welcome surprise as it was salty and sweet with the apricot jam that came with it. I liked it.Would I come here again? Probably not. This place is pricey, has soso service, and flavor combinations don't pair very well. I would go out on a limb and say this - the chef in charge of the menu is ballsy but doesn't have an amazing flavor palette. By tasting the food I think their cooking skills are up there, with excellent technique, but the menu is just a disappointment. There is innovative cuisine, and there is food mixed up on a platter. Every bite is a surprise, but not necessarily a good surprise.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "Fmr5xwHeBkZghRGLjrtNfw": {
    "date": "6/22/2014",
    "text": "Believe it or not, my husband and I were able to immediately get a table at Esquina at 8 PM on a Friday WITHOUT reservations.* I have a sneaking suspicion that this only happened because Potato Head Folk recently opened and the crowd moved there for the next few weeks. Maybe walk-ins at Esquina will be possible until the hype dies down?Since I wasn't able to check out the interior, this review will strictly be about the food. As the dishes are tapas portioned, our server recommended that we order about 7 dishes between the 2 of us. Luckily, I wasn't too hungry that evening, so we were able to get away with just 5 (which definitely put our wallet at ease in the end.)I ordered 2 snacks. The warm thyme and onion bread was more like a typical butter croissant to me. I couldn't taste any of the thyme and onion. I did like the smoked bone marrow butter it came with, though- it was served in the bone, which was cool, and it had a distinct taste (in a good way.) My second snack was the pork crackling, which I loved. The dish is comprised of 2 big pieces of pork crackling, decorated with salt cod and smoked herring roe. It was creative and I'd order it again.For my main, I chose the \"soil\" category (basically, veggie based dishes.) I really enjoyed my beet salad. The burrata they used was what won me over. Hell, it also won Miguel over, and he doesn't even like beets! The raspberry and pinenut crumble was a nice touch and went well with the rest of the flavours. However, the truffle honey was a bit of a miss for me; Migs said he could smell it but I felt that it was lost amongst everything else that was going on.Despite the creative dishes, some of the flavours just don't come through. Considering the prices, I expect more. But I get the trendiness of it all, and it's definitely a place to be seen. I wouldn't come here if I were super hungry, but for drinks with friends or a light dinner, I'd be cool with it.--*Well, we did end up with a tiny table outside, which isn't ideal, but a table is a table! And yes, for the longest time, they didn't accept reservations, but now they do! Make your life a ton easier by booking an inside table through Chope. ;)",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1-X18HlqWO9QxODea2hJWA",
        "caption": "Photo of Esquina - Singapore, Singapore. Salt-baked beet root, whipped burrata, truffle honey, raspberry, & pinenut crumble",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1-X18HlqWO9QxODea2hJWA/o.jpg"
      },
      {
        "img_id": "KO2D-REQUJPSd1OKog-8Gg",
        "caption": "Photo of Esquina - Singapore, Singapore. Georges Bank seared scallops, duck green curry, coconut rice, peanut crumbs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KO2D-REQUJPSd1OKog-8Gg/o.jpg"
      },
      {
        "img_id": "wQnfW2bWF6uHbS4CXWnN-w",
        "caption": "Photo of Esquina - Singapore, Singapore. Pork crackling, salt cod, smoked herring roe",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wQnfW2bWF6uHbS4CXWnN-w/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "KOn3ald0_rdN5NnYyIpA2g": {
    "date": "3/3/2013",
    "text": "This is a review of a dinner at Esquina.  This was a dinner with my manager.  He selected the restaurant.  It is one of his favourites.tinyurl.com/aap4gfnThis was one of my favourite meals in Singapore.  This was primarily due to the quality of the food and the general energy of the other patrons enjoying their meals.The ambiance is a bit cramped.  But there is such a great energy from watching the food being prepared, taken out, and then quickly devoured by appreciative diners.  Most of the seating is along the bar.  There is some minimal outdoor seating.  I am not sure why they went with tractor seats for the bar stools.  They are not as painful as I thought they would be.  But they seem to be a needless form over function design decision.  There is a certain eclectic appeal to the decor.tinyurl.com/bcupdhrtinyurl.com/bjkjlolThe service was quite good.  Our server was very informative.  She checked often to see if things were moving along.  The food came out in a very orderly fashion.The food ranged from good to exceptional.  For me, the modern culinary movement is greatly about reinterpreting foods and cuisines with the best ingredients possible.  I think Esquina is doing that with tapas.  They are taking the form of small shareable plates and casting aside the traditional versions.  They are focusing on delivering excellent flavours created from quality ingredients to the plate without regard to whether it is a customary dish.Sea Urchin Bisque - This may be the best sea urchin dish I've ever eaten.  i tend to eat sea urchin alone.  But seeing it used as a component brought it to a completely different level.tinyurl.com/b465fjbBeetroot Salad - This was a very unique salad.  it blended flavours and textures very well.tinyurl.com/aqh8zf9Sea Bass - This was a very well prepared piece of fish.  It was perfectly cooked and simply allowed the taste of the fresh fish shine through.tinyurl.com/axa2nm4Chicken Wings in a foam - The chicken was so tender and flavourful.  The foam added just a touch of sweetness. It really came together well.tinyurl.com/bxpp6gkPork Cheeks - This was, to me, the weakest dish.  I know.  It is pork.  How can I say that about pork.  I just thought it was a touch dry.  The flavour was great.  The texture just didn't seem quite right.(no photo)Curry with lobster - This was a beautiful dish.  The curry was nice. At some level though, I thought the curry overpowered the sweetness of the lobster.  I think the dish could just as easily been made with a nice prawn.  Lobster is a delicate sweet taste.  it is easily lost.tinyurl.com/bea95ouThis meal was compliments of my manager.  However, I do want to note that I think this is a dining experience worthy of the associated price. Overall - This stands within the five best meals i've enjoyed in Singapore.  The food is the star of the show.  But certainly the energetic ambiance provides a strong supporting role.  The service was also very good.  Esquina is the type of dining experience I look forward to sharing with others.(lol - i do not usually mention other reviews.  however, according to one of the other reviews, i must be pretentious if i like esquina.  i just want to say if that is the cost for enjoying this wonderful dining experience, so be it.  i will be as pretentious as it takes.)",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "hSTTvdRm9ynX2qKxWVYMUw",
        "caption": "Photo of Esquina - Singapore, Singapore. Sea Urchin Bisque - Esqina Tapas Bar - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hSTTvdRm9ynX2qKxWVYMUw/o.jpg"
      },
      {
        "img_id": "dzgc58W5HdfqZIa88vseRA",
        "caption": "Photo of Esquina - Singapore, Singapore. Sea Bass - Esqina Tapas Bar - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dzgc58W5HdfqZIa88vseRA/o.jpg"
      },
      {
        "img_id": "IxboNxs9wbZZVQyEFMnGNw",
        "caption": "Photo of Esquina - Singapore, Singapore. Lobster Curry - Esqina Tapas Bar - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IxboNxs9wbZZVQyEFMnGNw/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "Uq8N4liPOSNi5U0GOx0gXg": {
    "date": "1/27/2015",
    "text": "The four of us came here on a Saturday night. We tried to make reservation but they only do it for people dining at their \"supper club\" which serves pre-fixed menu only (around $95 I think). Knowing this is a popular spot we arrived pretty early at 6:30pm, and there was one, yes only one, outdoor table left for us.The food was decent. We loved the babe squid appetizer with squid ink aioli. For entrée our favorites were smoked mackerel and beef wellington. Also worth mentioning was the Tiramisu - a deconstructed/gastronomic version.However, the service was sub par. All the waitresses were nice but they just weren't around very much. It took us forever to get drinks, get our plates changed etc. Definitely feel like they were understaffed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VmGZJs1EgiRqWXGbhMB1GA"
  },
  "TWg5PDnXpWbBv8ZIJDKDlQ": {
    "date": "12/6/2012",
    "text": "For pictures and more reviews, visit my blog.Esquina is a haute tapas boutique where patrons perch precariously on weirdly shaped metal stools that will seriously damage some nuts. Not a place for large groups because you can hardly converse farther than your immediate left/right. Ham Croquetas ($10) is my must order. 4.5cm tall balls filled with creamy bechamel and chunks of what is possibly iberico ham (i expect no less) left us wanting for more. The ham was a little salty but i love it.The Smoked Haddock, spring onion and Manchego omelette ($18) was the fluffiest eggs i've tried in a while. I would liken it to a souffle but firmer. The taste was light; simply flavored with the natural sweetness of the smoked haddock. I was pleasantly surprised by this one.Do order the Sauteed gambas, chili garlic, potato dumplings and bisque sauce ($24) even though it doesn't look spectacular. The prawns were fresh and bouncy and i love the rich bisque sauce so much i could inhale it. Gnocchi were meh.And oh.. the Beef Tartare.. simply divine... Extremely flavorful and smooth tartare, especially after you scoop the confit egg yolk onto it....Read more at ms-skinnyfat",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "A94Wp74HDh0EmkMB76aOlg": {
    "date": "8/15/2013",
    "text": "The good:  Although close quarters, I like the design/space.  Open kitchen concept always calls for some dining entertainment.  Very unique vibe; felt like the crowd were regulars and everyone seemed happy to be there.  The bad:  Let's not beat a dead horse here, but there are some obvious areas for improvement.  The service could be better, the cost could be lower, the portions could be bigger, the food could be tastier and the seats could be more comfortable.  Aside from that though, it's great! The ugly:  I really don't understand how people RAVE about this place.  My only conclusion is that they are rich blokes with a high tolerance for butt pain (get your mind out of the gutter), astronomical bills and possess highly damaged taste buds.  With a few other good tapas options out there unless you are personal friends with the chef/owner and/or a cowboy, there isn't a good reason to go.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gyBH_pVycVOnjikFVXuBQ"
  },
  "NdecNx7UznyYGcrGj-xw4Q": {
    "date": "9/4/2012",
    "text": "It feels like they took quite a risk with the place - long and narrow, the indoor space can only afford to have an open kitchen and a single, overcrowded bar counter. But it somehow works, and it's constantly busy with customers returning for food which more than makes up for the slight discomforts. They have a few additional tables outdoors, but the ambience is definitely different from the flurry of activity taking place inside. We arrived after 7 on a Monday, and the indoor seats were already taken up. Nevertheless, the food was awesome, and we loved the clean, fresh flavours of the scallop cerviche. The Iberico Pork and Foie Gras Burger is delicious as well, but the foie gras flavours and textures weren't really present. The desserts - oh, the desserts - embody exciting flavours, and it was really difficult to make that final decision. A great place for tapas, that's for sure. Each dish in the meat and seafood categories will set you back at least SGD 20, but they're worth every penny.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ev9bxROFJ0Z2UsOBSdmPw",
        "caption": "Photo of Esquina - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0ev9bxROFJ0Z2UsOBSdmPw/o.jpg"
      },
      {
        "img_id": "rqUDxybgaJdrFDQdeUrKaQ",
        "caption": "Photo of Esquina - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rqUDxybgaJdrFDQdeUrKaQ/o.jpg"
      },
      {
        "img_id": "K5IGVghGwMuCSDFZEqgycg",
        "caption": "Photo of Esquina - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K5IGVghGwMuCSDFZEqgycg/o.jpg"
      }
    ],
    "user_id": "OID9ZOyljsyx7HVAP_29aQ"
  },
  "fGYDRMLg3uUfuUWjcoFyfQ": {
    "date": "6/5/2014",
    "text": "Intimate and friendly dining experience. Great food menu. The wine list was very disappointing. Prices are outrageous . Only 3 reds to choose from and 1 of them was out of stock. Let's think of improving the choice for the diner please.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "phKqoOIIUu49ReN2jB5cWw",
        "caption": "Photo of Esquina - Singapore, Singapore. Seated at the bar/kitchen table   having a great chat with the staff.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/phKqoOIIUu49ReN2jB5cWw/o.jpg"
      }
    ],
    "user_id": "C0yPUMyznnqDAuqiTdYOLQ"
  },
  "TepLCem3mGQ-cUfvXTJK_g": {
    "date": "7/4/2013",
    "text": "The wait can be excruciating given how tiny the place is. But I love the space, love the energy, love the service, love the food!!Our server told us that it was an exceptionally crowded for a Thu. We started by sitting outdoors getting our drinks while waiting for a table. The wait was 1.5 hours by the time we got a seat inside. While outdoors, we started with some crispy baby squids with our sangrias. The sangria is yummy! And the crispy squid lightly battered and served with squid ink aioli. Do not expect our local version of crispy squid, Esquina does it with the squid still soft and juicy inside, while only the exterior is crispy. Dishes:- sea urchin and crab bisque. Like what Mark D. said, absolutely wonderful. The sweetness of the urchin is perfect and it is served with clunky crab meat. It is also served beautifully plated on a stone bowl.- ham croquetas. Filled with chunky iberico jamon, wonderfully salty and balanced with the potato filling. - marinated beet salad. It is too difficult to get good beets in Singapore. I never liked beet until I moved to NYC, and eating beets there totally changed my mind about this muddy veggie. The version here is still not like the beets we get in NYC, but the execution of the dish is faultless. It is served with burrata cheese and honeycomb. The honeycomb gave an amazing finish to the entire dish that it gave me pure joy....- beef tatare with frozen foie gras and confit egg yolk. This is served in small portions served with toast. We were not sure on what to expect when we read frozen foie gras. But when it was served, I knew it was exactly like the shaven foie gras pâté dish that I had in David Chang's momofuku ko restaurant where he served it up like a bowl of savory ice-cream. Totally yummy, and I only wish they are more generous with the shavings here. Complex flavors, beautifully executed.- seafood paella. Do not expect the traditional Spanish paella. This doesn't come with the soccarat (crispy bottom bits). It is closer to a rendition of risotto without the cheese, so it is much lighter and you can really taste the seafood bisque that they use to cook the rice. The seafood is served on the side and you get snapper, shrimp and crispy squid. I didn't feel that I need the seafood at all, quite happy with just the paella.Overall, really enjoyed the dinner. The tiny space reminds me so much of the little restaurants that peppered the village in Manhattan. It was a blessing in disguise that Burnt Ends was full till 9.30pm, which is why we ended up here. I was not impressed with Jason atherton's other restaurants in Sg, this one now totally changed my mind. Now....if only the wait is shorter!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Zxu4OVpzvNDlkrSfVXPMLQ",
        "caption": "Photo of Esquina - Singapore, Singapore. Snapper, gamba, squid that accompanied the paella",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zxu4OVpzvNDlkrSfVXPMLQ/o.jpg"
      },
      {
        "img_id": "iZSWx94ZpuUwjoKqjeLVug",
        "caption": "Photo of Esquina - Singapore, Singapore. Seafood paella",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iZSWx94ZpuUwjoKqjeLVug/o.jpg"
      },
      {
        "img_id": "k4JuXohgKoqFH95tXHbtFQ",
        "caption": "Photo of Esquina - Singapore, Singapore. Beef tartare, spicy ketchup, confit egg yolk, frozen foie gras & toast!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k4JuXohgKoqFH95tXHbtFQ/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "lJ9WwNTBLerV-7QlknbgSQ": {
    "date": "11/27/2013",
    "text": "I've been here 4 times and tried 30+ dishes (via foodmento app). Small innovative eats is one of my favorites foods. I would come here again sooner, but I think back to the damage the last 4 times...Dishes I LOVED: - salt & pepper squid- roasted pedron pepper- iberico pork & foie burger- sevllle orange & rosemary ice cream- roast duck, truffle honey...(special)- marinated beetroot saladDishes I FAILED:- beef tartatre- pan fried snapper- roast lamb rump- manchego custard",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cBl9MzmA1sEc8ssFyZpIpA"
  },
  "X-E5IJ0FhbEZOtipf6FD8w": {
    "date": "12/27/2013",
    "text": "Sooooo good! Fabulous service. Delicious food. I'm definitely coming back. Loved the sea urchin. Loved the scallop ceviche. Roast duck breast was yum. We've been telling all our friends about it. The set lunches are reasonable too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oHYibVoIahoUsAHzEzs9mA",
        "caption": "Photo of Esquina - Singapore, Singapore. Set Lunches are reasonable",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oHYibVoIahoUsAHzEzs9mA/o.jpg"
      },
      {
        "img_id": "_2C2PrmhR41oj8_V0v_C8A",
        "caption": "Photo of Esquina - Singapore, Singapore. The bread was scrumptious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_2C2PrmhR41oj8_V0v_C8A/o.jpg"
      },
      {
        "img_id": "RstCXtIHywrSoZzLLKeXVA",
        "caption": "Photo of Esquina - Singapore, Singapore. Mmmm...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RstCXtIHywrSoZzLLKeXVA/o.jpg"
      }
    ],
    "user_id": "GFW4odivS5Fh7P85R8pPUg"
  },
  "KcQY96SuUcZ7H26kN9eljg": {
    "date": "3/4/2016",
    "text": "Went there for dinner, away from kids. I have to say, ingredients used are all fresh. Excellent cooking overall, attentive and friendly service. Highly recommended for night out or casual after work gathering.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mhAocrTEzYlMAke_BFd1NQ"
  }
}