{
  "M7nF4kHnSNumfdhPiTT-cQ": {
    "date": "10/27/2013",
    "text": "If you love your sake, this is the place in Singapore!  This is a traditional Japanese sake bar and you should expect to be surrounded by bibulous company, no less.Sato-san, the boss is also a supplier of sake to many other establishments in Singapore.  The range of sake over here is astonishing, more than even the liquor shop at Daimaru.  You can have the cheapest to the most expensive bottle here.  I know cos' I had to foot the bill for last Friday's drink - almost $500 (incl taxes) for a large bottle of  Dassai 23 Junmai Daiginjyo and 2 portions of oden (what I would call Japanese Yong Tau Foo) for pre-dinner drinks for 3.  You can also order some selected yakitori which is served from the adjacent Tori Tama restaurant.  But, go with the oden, at least that's what I assuage myself with cos' it's healthy and guilt-free.The deco is spartan by most standards in Singapore, one L shaped counter with 4 counter chairs (used to be 2) and the rest would have to stand.  Not too bad cos' if you can't stand anymore, it means it's time to call it a night!  Actually, there's a little small round table right at the back, with 3 crates which have been strapped with cushions to act as chairs.  There's also the outdoor seating which can take 10 or so.  They also serve a good range of Japanese whiskey and beers, if that's your poison.  There's also a great selection of umeshu, if that is your preference too.  We come for the sake ..... don't worry if you can't finish your bottle, they will keep it for you for your next visit.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "lRj2R73PzDM9Ac-RHrUJbA",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore. Dassai 23 Junmai Daiginjyo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lRj2R73PzDM9Ac-RHrUJbA/o.jpg"
      },
      {
        "img_id": "fdLHlwhipFsiwtUebpDSkQ",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore. Oden aka Japanese Yong Tau Foo!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fdLHlwhipFsiwtUebpDSkQ/o.jpg"
      }
    ],
    "user_id": "pbEqsg2vay8g-c8M_ooOzQ"
  },
  "0ilz8rEPZq7qwuV_aZwf3A": {
    "date": "10/2/2017",
    "text": "Dropped here for a quick bite after work. Orihara is a small bar at Robertson Quay with a very extensive collection of sake, and a sizeable selection of umeshu and shochu. There're few sake tasting sets going for $30+ for three pours, but most of the sakes are only available by the bottle. I asked for a traditional umeshu and was recommended the Kakutama umeshu ($14+ per pour). Delicious! I also had the oden ($12+) which was simple and satisfying.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KQAd_2cOpini_2tEaxE0rg",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore. Umeshu menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KQAd_2cOpini_2tEaxE0rg/o.jpg"
      },
      {
        "img_id": "65ko8KxthQ4ptGwjstWqKg",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore. Umeshu menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/65ko8KxthQ4ptGwjstWqKg/o.jpg"
      },
      {
        "img_id": "PuKBPbbsNLsHMA8xQhlYYA",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore. Umeshu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PuKBPbbsNLsHMA8xQhlYYA/o.jpg"
      }
    ],
    "user_id": "Ie_FLgLgbPS06ae4lu5OIg"
  },
  "jLE1at6QcXfUYyVY0eXyrg": {
    "date": "9/28/2015",
    "text": "I've been here twice, and I have been lucky enough to have been seated, both instances. Given they only have 4 seats in the whole place, I guess you should come early if you don't want to stand the whole night. Probably not a good idea to bring a first date here - this place is more suitable to come with a friend you can bitch to, especially if you are standing the entire time. Come here with a friend who can drink, leave your car keys at home, and leave happy and inebriated.Opened by a sake supplier, expect a very extensive range of sake offered here. Me and my friend are not experts when it comes to choosing sake, so we described the taste profile and our price range to the staff and they will pick something suitable for you. There are also beers on tap available (I forgot which ones); good for a refreshing pre-drink.Food! We got oden and a few other accompaniments, and you may choose a selection of robatayaki to nom on while you drink. Peanuts are free! I especially liked the oden and the grilled eihire!My only grouse is that the public toilet is in a very, VERY inaccessible location!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "MbjFCzxY_1XUpu3EliLiTA",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MbjFCzxY_1XUpu3EliLiTA/o.jpg"
      },
      {
        "img_id": "jgsvQh8GVW4Xp9-WuyPCbA",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jgsvQh8GVW4Xp9-WuyPCbA/o.jpg"
      },
      {
        "img_id": "AN2w8rDJAo0HTTEDKlyGbg",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore. Cups, choose your own.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AN2w8rDJAo0HTTEDKlyGbg/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "g3RXuQTRfWZp_IUxOwNPBQ": {
    "date": "9/9/2012",
    "text": "A friend brought me here for drinks after dinner one evening, and I was immediately drawn to the place. Large Japanese baskets are stacked outside the entrance, adding an authentic vibe. There's a standing bar indoors, and seats outside as well.There's a very impressive list of sake, as well as shochu, umeshu, beers and whiskey from all Japan. The service here is excellent. They are very attentive and knowledgeable, so don't be afraid to ask for recommendations if you're not sure what you want to order.I really enjoyed the suntory premium malts. They're smooth and crisp. There are also great little appetizers to choose from if you're feeling peckish.Price wise, it's definitely not a cheap place, but you'd be coming here for the high quality and the great service.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YR6x0b7JYhSLajW3Xj2CDQ",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YR6x0b7JYhSLajW3Xj2CDQ/o.jpg"
      },
      {
        "img_id": "LsnbakuMrzICcfijX3qF-w",
        "caption": "Photo of Orihara Shouten - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LsnbakuMrzICcfijX3qF-w/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "7P0-5oFWn6AzuqD7yBLR-A": {
    "date": "11/5/2012",
    "text": "The good:  Love the sake selection and the staff is friendly, patient and helpful (when ordering the sake).  The water and snacks stay full, only the bottles of sake go down.  I also like the fact you get to pick your own custom cup to drink out of.  Nice touch.    The bad:  Small space, which works for and against this place.  Intimate, yes, but if it's crowded you can't get a seat and most likely you will have to sit outside (takes away from the experience).  The ugly:  Closes early and can be costly (bottles run about 50 and up).  For people on the go it's somewhat difficult to carve out time to really hangout and soak it all in.  It also gets a fair share of your typical banker dbags boasting about their latest bonus and asking for beer to make sake bombs.  The rest of the crowd is Japanese/sake lovers.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gyBH_pVycVOnjikFVXuBQ"
  },
  "qOv_M-5xBqp8v4A31GTtYA": {
    "date": "7/12/2012",
    "text": "I was curious about this place at first because they've managed to make their bar look like a hole-in-wall Japanese liquor shop when all their neighbours are striving for the opposite. Turns out it's run by the people who distribute sake to lots of Japanese restaurants here in Singapore. Of course this means there's LOTS of sake.Unlike many so-called sake bars in Singapore where they have poor pickings and indifferent waitstaff, the guys here have everything -- maybe the biggest selection of retail sake in Singapore? -- and they know their shit.They also have a small range of Japanese beers: Suntory Premium, Sun Sun, Yona Yona, and Tama no Megumi Tokyo Beer. The fact that you can order yakitori from next door, as well as order the delicious hot oden from the bar all night (oden is now my drunk food of choice!), only makes me like it even more.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ml61UOrHtdUCwW0JcTM_Vg"
  },
  "wuTvzy2FPUahFaVfSe5Dvw": {
    "date": "9/6/2012",
    "text": "Drunken sake nights are the best at Orihara because of the damn oden! I never stop picking at the morsels whenever I am here because the soup base is really tasty and actually pairs really well with the crisp taste of sake.Okay, that's a digression because Orihara should actually be more reputed for their extensive sake choices. It's actually quite confusing if you ask me but the staff will be more than happy to offer you a little advice. Sweet? Dry? Fruity? They will readily whip out a bottle based on your preferences. Thumbs up to the attentive staff who are always friendly despite the insane crowd they have to tend to.It does get a little (more than) crowded on Fridays so be prepared to wait for even a standing space to call your own.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FU5mC0OWVYL2vqP-9ZBT9g"
  },
  "-0igbUJ6ZqVuIsMiRjQCTQ": {
    "date": "9/6/2012",
    "text": "Orihara is a small Japanese bar frequented by yuppies, and is always crowded on a Friday night. I'm always here because my friends are here. There is one problem with this place - very little seating. There are newspaper clippings and print-outs that tell you how too much sitting is bad for your health - good attempt to save money on chairs? Haha.The whole Robertson Quay area is slightly inaccessible if you don't drive - a cab is your best option I suppose, though parking lots are often ample. Other than that, authentic sake, excellent oden and Japanese bar snacks means it's a place I'll probably be back (and because my friends love this place).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGBwT9dOgjgZJGNjOc8ojQ"
  }
}