{
  "AqxGDRY0SUUTzAO-3MMTGw": {
    "date": "10/16/2018",
    "text": "The only reason I'm not giving this place five stars is because I've only been once. Seriously solid 4.5 experience. This is the perfect place for a late night supper after hitting the bars in clarke quay. The ramen has a distinctive lobster flavor, and is thick and delicious. You can customize your toppings; I highly suggest adding an egg. They cook the egg perfectly, as well as the noodles. Wavy and delicious!I'm getting hungry writing this review - a sign that it's time to head back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1whUyFwAnMgv4H9xcl5Iw",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1whUyFwAnMgv4H9xcl5Iw/o.jpg"
      }
    ],
    "user_id": "8NyAypqBJG2JiSXBu7Vlug"
  },
  "m_Yj1NfzvTEtu6mpwtv75g": {
    "date": "7/23/2017",
    "text": "You get free (unlimited) bean sprouts and hard boiled eggs at this place! I love adding the bean sprouts to my ramen, especially since ramen dishes tend to not feature veggies. I got the spicy miso lobster ramen special, which had a lot of goodies like lobster balls, spicy mince meat paste, and dumplings. It was pricey (over $20) but it was worth the splurge since I've never tried lobster ramen! The broth was really thick and aromatic, but got tiring after a while. If you are looking for a lighter broth option, go with the regular lobster ramen. One thing I noticed was that they use different noodles for the different broths. That was my first time seeing a ramen shop do that, and I found that incredibly thoughtful. The wait time is really annoying (I think we spent 45 mins standing outside) but at least they give you water while you wait. It's open late too so I imagine it being a great place for drunchies!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MhhKdFh_k8L3uFG9Dw9BKQ",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Lobster ramen with chashu, dumpling and lobster ball! Delicious!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MhhKdFh_k8L3uFG9Dw9BKQ/o.jpg"
      }
    ],
    "user_id": "Lf1vReyrKC0fI63AWiP23g"
  },
  "UKANaYi5-7aN0cQmVLUjCw": {
    "date": "11/12/2017",
    "text": "I went there for dinner around 7pm on Friday where there was still no queue. I ordered a rich broth ramen which is their signature with all topping, cost $21.90 and a bottle of wasabi ginger ale... I think that's only gimmick which I didn't taste any wasabi (luckyly it wasn't...)The broth is very rich with lobster sweetness but it appear to be slightly too salty to me. And I personally prefer thicker noodle but they only offer one type of noodle which is the thin type. It is 3.5 stars.. Not really motivated to go back there if I don't have to...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6fkzh1iqYMLdEUsQBradJg",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6fkzh1iqYMLdEUsQBradJg/o.jpg"
      },
      {
        "img_id": "DjXZIkv7VDHdQFvh5XOtZg",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Signature lobster broth ramen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DjXZIkv7VDHdQFvh5XOtZg/o.jpg"
      },
      {
        "img_id": "J--1ScBJfW7FYFFJ1q9tow",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Wasabi ginger ale",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J--1ScBJfW7FYFFJ1q9tow/o.jpg"
      }
    ],
    "user_id": "aFXnLTwv-dWdbFC-2b-kdg"
  },
  "xSBbUHEWf6HXt7sWlysXSA": {
    "date": "4/13/2018",
    "text": "Soooo ono!!! Best ramen we've had in a long time!!! Open 'til 4am, score!!! Got here after the rooftop bar around 3:30a",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JpMCmzUeVtQgmLteawzsrA",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Chicken ramen w/ flavored egg",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JpMCmzUeVtQgmLteawzsrA/o.jpg"
      },
      {
        "img_id": "YCuHl9Y38WlAkGyVy66bDQ",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Miso lobster ramen w/ shrimp wonton",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YCuHl9Y38WlAkGyVy66bDQ/o.jpg"
      }
    ],
    "user_id": "imzNnhCjG4qXvkM71cMGHQ"
  },
  "naoQPvmqmeHsJRA0xLIR8A": {
    "date": "10/6/2016",
    "text": "There was a slight queue on Friday nite but it moved quickly. Being a member, I received free green tea soda. After ordering, helped myself to the hard boiled egg and marinated bean sprout. I was surprised to find water coming out from the hard boiled egg which I was trying to crack. Turned out there was a big black dot on the egg. I did not dare to eat and cracked another egg which did not have the same problem. I did tell the staff about it while clearing the table but received no response. Kaku High Ball (Suntory whisky with soda) ($12)Refreshing but no ball shaped ice cube :(Alcohol taste lacking.Spicy Miso Lobster broth Ramen Special ($21.90)The spicy paste had minced meat in it, not too spicy in taste. Felt that the spicy taste reduced the salty taste of the soup. The char siew could be more tender. The lobster balls were still my favourite. The wanton skin was still too thick and could not hold the filling. Need to improve on the wanton. Overall service not bad. There was bag basket for bags. Free wifi at the restaurant.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jnevKOYTBEeHkLzy64Jyxg",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jnevKOYTBEeHkLzy64Jyxg/o.jpg"
      },
      {
        "img_id": "zQW6DNPY5rb7gZp622k-tg",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zQW6DNPY5rb7gZp622k-tg/o.jpg"
      },
      {
        "img_id": "YU9pQD73DoykhVcY8FT17Q",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YU9pQD73DoykhVcY8FT17Q/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "aJWT-Hwx6qoVRU4drp4Npg": {
    "date": "5/23/2016",
    "text": "Ra Ra(men)... Ooh La la.It's official, Keisuke Ramen has officially taken over Singapore and has now become one of if not the number one chain of Ramen restaurants in Singapore! While I haven't been overly impressed with Tendon, their Tempura bowl restaurant, I really haven't had much to complain about their ramen restaurants. Though I haven't tried, Tonkotsu King and Orchid Hotel looks an ever popular \"to-go-restaurant\", their restaurant at Suntec has been good too and the Crab broth is a delight and now, Lobster King at Clarke Quay is making waves! We finally managed to bring ourselves down to Lobster King to give it a shot and we were not disappointed. Located at the heart of Clarke Quay (and right next to the soon to be re-located Zouk), Lobster King's rich lobster broth ramen has to be the ultimate hangover food. In terms of variety? Not much, with only the option of thick broth, light broth, Miso or spicy Miso. However, don't let the lack of options turn you away because what they do well is a delicious bowl of ramen. With the option of either without flavoured egg (Ajisuke Tomago), with egg or extra ingredients, we went without the egg, solely because the restaurant gives you free hard boiled eggs. YES! FREE! Oh, that and free bean sprouts as well. So we went with the trademark... Lobster Broth Ramen with Rich Creamy Broth The broth is definitely rich and definitely very tasty! Served with a good amount of Leak, a piece of torched pork, a piece of chicken and a dumpling,  this dish definitely hit the mark. The first thing we noticed was the noodles. Unlike other ramen joints, the noodle seemed different. Judging from the texture and look, we figured that it was probably a buck wheat or whole wheat mix, which works perfectly well with this broth as it allowed the broth to coat the noodle without soaking it fully, which may have made it over powering. The leak helped add balance to the dish, giving it a bit of pungent-ness to help cut the richness. The pork, which tender and juicy, got a bit lost in the dish for me, thanks to the broth but the chicken was surprisingly good. It was tender, juicy and the texture felt like it had been sous vide. The dumpling was a nice surprise.He skin tasted a little Gyoza-ish but thicker and it helped soak in the stock. The prawn they stuffed in it was nice and sweet too, bringing out the \"lobster-ness\" of the dish. On a side note, do note that the broth might be overpowering and salty so if an overly rich broth isn't for you, I would suggest the much lighter looking clear broth instead. Oh yes.... And please note that although the name is Lobster King, don't be disappointed when you find out that the lobster is in the broth and you don't get a fat piece of Lobster Tail in the ramen, but than again, at $14.90, I suppose that's expected. Overall, we do like it a lot. May be a little too rich to have it often but when we do crave the rich broth and can get away from the standard pork broth, we will be back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-KnzPMb98-81BJsnXqAB5w",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-KnzPMb98-81BJsnXqAB5w/o.jpg"
      },
      {
        "img_id": "fOPGY6WNJf8ptKzfwJ4XyQ",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fOPGY6WNJf8ptKzfwJ4XyQ/o.jpg"
      },
      {
        "img_id": "-4wbpb-BhusTjDgSAmqHPw",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-4wbpb-BhusTjDgSAmqHPw/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "k977gI1Ho-9XFg11ljqTBA": {
    "date": "8/30/2016",
    "text": "My first time here to try out the lobster broth.I ordered the rich broth with all sides added in for $20.90.The broth was okay, but did not really feel there's enough lobster flavour in it....taste more like crab broth.My friend ordered the same as mine & could not finish the noodle as the broth made her stomach feel very filling drinking it.The Gyoza tasted more like Chinese dumplings, not like the ones in Japan.As for the green tea cola, it's was great, which goes well with the food due to the salty flavour.Overall 3 stars.For me I still prefer the Tonkotsu King....",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q7YHpfkSlVH-4IXP6OvYag",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. It's quite pricey.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q7YHpfkSlVH-4IXP6OvYag/o.jpg"
      },
      {
        "img_id": "G5s4hs5BpuFbP6P33fvMMw",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Green Tea Cola $4.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G5s4hs5BpuFbP6P33fvMMw/o.jpg"
      },
      {
        "img_id": "660Hlp-6GCzCyFkEoVvodA",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Rich broth Lobster ramen all in sides $20.90.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/660Hlp-6GCzCyFkEoVvodA/o.jpg"
      }
    ],
    "user_id": "VINXbNxMcdiO8TCySnaF8g"
  },
  "Y_UdGrR-aNjH-IFaciU-kA": {
    "date": "4/14/2016",
    "text": "With all the hype surrounding this lobster ramen, I had to try it. Popped by on a Wednesday night at about 11pm, and there was no queue. I got the lobster rich broth ramen with all the toppings, and my companion got the clear broth one. The rich broth tastes like a lobster bisque, and the clear one is very light and flavorful. There are no lobster pieces within the ramen, so don't get your hopes up. The soup is quite nice, but it get tiresome and brought down by lackluster toppings and the ramen itself. I was quite disappointed with my noodles, because I ordered the ramen to be cooked \"hard\", yet the ramen was soggy and mushy. I would have rather it not have any noodles. The toppings were nothing to shout about; greasy prawn balls, wantons with too little filling, a lone stalk of veggie, some chashu (possibly sous vide as it was very tender). They have free flow hard boiled eggs and bean sprouts, but nothing very much. Would I return? Probably not. I didn't finish my food.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JzQzX39BJhfGy4FJqqwxEQ",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Rich broth",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JzQzX39BJhfGy4FJqqwxEQ/o.jpg"
      },
      {
        "img_id": "cuAzBtMF2JoGBzlCWsY9cw",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Clear broth",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cuAzBtMF2JoGBzlCWsY9cw/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "9vXw1AeFwnSxScUJGAwM7g": {
    "date": "5/9/2016",
    "text": "Imagine serving this to Chinese or French or Japanese grandmothers 50 years ago! HahaI reckon this dish to be a fusion of French-Japanese-Chinese influences. Ramen is first and foremost, a Japanese take on traditional Chinese \"la-mian\". And lobster bisque is a traditional French dish. Anyway, the coming together of these influences works quite well. Toppings of chicken, dumpling and char siu were generous. But in my opinion, the broth gets too cloyingly rich and salty after a few mouthfuls. It needed a few dashes of vinegar to enliven the heavy richness. Also, it could do without the heavy hit of MSG. After all, lobster shells should lend enough umami to the broth. I was thirsty halfway through the bowl, and so were my table mates. Keisuke ramen are such MSG-bombs. ;(It was an interesting bowl of noodles but would I have it again? Maybe, and only if there wasn't such a long queue outside.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r1lOpu5l_DfaedT6PED92Q",
        "caption": "Photo of Ramen Keisuke Lobster King - Singapore, Singapore. Lobster ramen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r1lOpu5l_DfaedT6PED92Q/o.jpg"
      }
    ],
    "user_id": "fe5tHzjsjCmLVLNfKd_tWg"
  },
  "K-06zVbEmB8lu7cOVqp5FA": {
    "date": "1/11/2018",
    "text": "We had the miso lobster ramen special and the spicy miso lobster ramen special after midnight so there was no queue. The broth was very thick with almost overwhelming taste of lobster. It was perfect for dunking the free flow of cooked bean sprouts. The free flow of boiled eggs made a nice appetizer. We liked being able to customize the strength of the broth (saltiness), the amount of oil and the firmness of the noodles. The location is superb and in the thick of the nightlife in Singapore. The decor is also very nice. We think we still prefer the tonkatsu broth over the lobster broth, but if you love lobster, this is the place for you!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kh_vlcg_MLYzGO64xSiOxQ"
  },
  "7apWU1Bjzby-a-aid6wryw": {
    "date": "9/9/2016",
    "text": "I think the ramen here is pretty average, good to try it at least once though. The thick broth felt too much after awhile and it wasn't particular tasty. The texture of the ramen tasted pretty standard, nothing special. Though the place offers free flow boiled eggs and bean sprouts, it felt kind of unnecessary. Perhaps, I would opt for the light broth the next time I visit the place.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xU3sDPonLx1_w4t6wOOpdg"
  }
}