{
  "ehlHNzzXsRG_TzeCd-mM2g": {
    "date": "5/22/2015",
    "text": "I love their Wonton Noodles!!! Super QQ and flavorful! I genuinely believe it is one of the best in Singapore. A perfect treat and comfort food for me. When I dig into their noodles, coupled with perfectly roasted char siew, it just warms my heart. I can't explain it. I just love it. And just a note, it doesn't open on Sunday. Expect a line when you get there. But trust me, it's worth it. We ordered takeaway back to my place to enjoy it with champagne. Hahahahaha.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "DbmIRbKRQpG393mQCLZ3fQ",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. We decided to buy back to my place! Hahaha! Paired it with champagne! Cos...why not?!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DbmIRbKRQpG393mQCLZ3fQ/o.jpg"
      }
    ],
    "user_id": "m369Z6yvE3E5vBww9DSJsw"
  },
  "x_qbaFn85Inf-uZ-ABaQGA": {
    "date": "7/4/2016",
    "text": "Foong Kee ohhhh Foong Kee!! Where have you been all my life! I've been searching high and low for that authentic coffeeshop roast meat taste that left me last year because my \"go to\" stall at Katong (Calton Restaurant) closed down.This is the one! This is THE (dare i say!?) ONE better alternative to Carlton.The charsiew medium level fatty with the smokey \"chaotah\" taste. The siew yoke..... OOOOHHHH the siew yoke! Crispy crackling. Springy noodles.I'll be honest and say just by looks alone, i didn't think it would be this good. I mixed the noodles, the chilli, the sauces and the meats altogether. Took a bite. YESSSSS. It is THE ONE.I ordered the wanton mee and added in the siew yoke. $4.50. Portion is slightly small for a guy like me. Or is because it was so good that I almost wanted to buy another plate!? It could be a little bit of both.Had i known earlier that a place like this existed 10mins walk away from my office i'd be coming back every week. And now that I know now..... I'll be coming back again this week. Or maybe tomorrow?!!!!!P.S - I'm on a wanton mee run these few weeks. Watch out for more of my wanton mee reviews! lolll",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-o2JJF0kXyH-NcKiUP9zoQ",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-o2JJF0kXyH-NcKiUP9zoQ/o.jpg"
      },
      {
        "img_id": "qJe-fqiS_jdQ4dkoRndFAw",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Wanton Mee with siew yoke",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qJe-fqiS_jdQ4dkoRndFAw/o.jpg"
      }
    ],
    "user_id": "jq7Pb7s68wi2NDTFEXvwbw"
  },
  "CC20r88s72DHkKi9cLSJ4g": {
    "date": "2/26/2014",
    "text": "Charsiew, Roast Pork, and Soya Sauced Chicken. The holy trinity in which these aunties and uncles have perfected long before I was born. Get it with plain rice, or (wanton) noodles. I popped by one afternoon and ordered Char Siew rice but settled for Siu Yok Fan when the cheery uncle said Char Siew was sold out. 5 mins later this elderly man comes strutting down and orders Char Siew and he gets it. Felt like I was at the door of Le Bain in NYC all over again. But you know, these guys, they do what they do, and they do it well. Not a huge fan of the vinegary chilli sauce, might help to ask for some sambal instead.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "kj-T0TlqK-QNnlWfczZLnw",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Siu yok fan.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kj-T0TlqK-QNnlWfczZLnw/o.jpg"
      }
    ],
    "user_id": "Ncq1J7jnPTZDPRdZnHOt9w"
  },
  "HUJOhBIrI7khPHYfu7JSlw": {
    "date": "11/13/2013",
    "text": "The Foong Kee Coffee Shop consists of just one stall that does char siew, siu yok soy, sauce chicken, roast duck, and a pretty good plate of wanton noodles. Oh, and rice too if you prefer that.The star is undoubtedly the char siew, closely followed by the siu yok. The char siew is a delicious combination of fat, lean meat and charred exterior that really hits the spot. You will probably end up with a couple of slices of char siew that are all fat and you can ignore them because really, a little fat goes a long way. If you're really squeamish about the amount of fat on your meat, you can request for leaner portions.Place your order at the stall with whomever's holding a notepad (usually a lady) and choose between the warm and humid coffee shop interior or the hot and warm-airy outside. Either way, you're going to have to wait if the tables are filled because the food takes a while to get to your table. Going in the evening makes for a more comfortable dining experience but don't dawdle because they close at 8pm.Get your green chilli and chilli sauce yourself from the side of the stall. The chilli sauce is provides a nice acidic and spicy kick and goes perfect with the meats. Drinks and ice are also self-service from the fridges and are at a standard price of $1 per can.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0sMgtSYAV-5D4pvTZGfNJw",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Char siew and roast pork belly.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0sMgtSYAV-5D4pvTZGfNJw/o.jpg"
      }
    ],
    "user_id": "GtvARYwS5AU64_Yo97K1rA"
  },
  "uEoEau6GBemkbwd5cXOK-w": {
    "date": "11/4/2012",
    "text": "This is char siew and soy sauce chicken heaven.No not for them, but for us.Go up to the uncle (or auntie?) and tell him you want both these tasty delights, order yourself some plain noodles, and get ready to dirty your shirt while slurping it all up.You'll get hot and sweaty, since it's all open-air, but once the meat gets past your lips and into your mouth, the worries of the world fade away.You'll need a cold drink after that, so help yourself to the drinks in the fridge, and the ice in the bucket next to it. Just tell the uncle to add it all up later.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pQNs8SJKe-pP0LEd8U31tA",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pQNs8SJKe-pP0LEd8U31tA/o.jpg"
      }
    ],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "58NXCJMTVeS43j5nCM9mFw": {
    "date": "4/30/2013",
    "text": "Considering I have been here 4 times in about a week, eating it on consecutive days and even twice in a day...need I say more?! The char siu is undoubtedly the star. Those health freaks please stay away! This isn't for you! Beautifully caramelized, so so fatty and lots of burnt chao dar bits. I'm drooling just thinking about it! The roast duck is good too and the roast pork isn't bad. The noodles nicely cooked, springy with the chilli. But it is still the char siu that beckons me and keeps me returning! Now I need to find a cure to break me from this addiction, before I need to buy a whole new wardrobe!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n7nx4hJjVReUcGoa-Og3gw",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Springy noodles to go with the fatty pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n7nx4hJjVReUcGoa-Og3gw/o.jpg"
      },
      {
        "img_id": "PVtnm2ZxNVEyBzjoZRnpqQ",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Dumpling soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PVtnm2ZxNVEyBzjoZRnpqQ/o.jpg"
      },
      {
        "img_id": "ZsnH3c-v-rjABWtxUfOpCw",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Fatty, 'chao far', porky goodness! Char siu with roast pork!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZsnH3c-v-rjABWtxUfOpCw/o.jpg"
      }
    ],
    "user_id": "hiUDfQ5UdPfi5UqnOmDdfQ"
  },
  "gYHh-qiuq0DgyA3CxKOdow": {
    "date": "8/2/2012",
    "text": "I thought I should mention straight out that Foong Kee Coffee Shop isn't exactly a coffee shop. It essentially is a roasted meat shop that conveniently sells drinks too. Well, a roasted meat shop that just happens to sell my favourite wanton mee in singapore. It definitely helps that the roasted char siew is done the way it should be, the way that many char siew shops around the country just can't seem to get right. I've never been a fan of char siew that is painted in artificial red; for me that is the surest warning sign that I'm not in for a good one. The colour of this roast pork is a sweet, deep, caramel brown, quietly revealing the time, effort and skill that resulted in this creation. Oh, and they are not stingy in their portion of this beautiful meat -at all-.And then the noodles are absolutely perfect. The noodles are silky yet softly solid, and as you slurp them be careful of not splashing the wonderfully savoury and sweet sauce all around you, and I have clumsily managed to do on so many occasions, probably because of how slippery and smooth the texture of the noodles are. The wantons are good too - a little mixture of texture in it, with the smooth soft skin on the outside and some crunchy bits within the minced meat within. The soup's pretty good too. I think you get the point - it's all really good, but I'm not making it sound as good as it is probably because of how GREAT the noodles and the char siew are.If that doesn't draw you in, maybe the little price of $4 for the whole shebang will tempt you",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2NODo33j1yizl3VD8L9FQA",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore. Sorry for the poor photo...I couldn't wait to start, and then I couldn't wait to carry on eating.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2NODo33j1yizl3VD8L9FQA/o.jpg"
      },
      {
        "img_id": "KzjkaE8ibQ0yuTcmcPomaA",
        "caption": "Photo of Foong Kee Coffee Shop - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KzjkaE8ibQ0yuTcmcPomaA/o.jpg"
      }
    ],
    "user_id": "4Uf6g20S-2ZcxJSuvVIjJg"
  },
  "NfRaHRgnq0okUDM8ZCpJUg": {
    "date": "11/2/2013",
    "text": "Ooooh what I wouldn't give for some char siew now. We hungrily slurped up this delicious pork and noodle combo without so much as a breath, let alone word to our lovely host that led us to this gem. He told us that some people come here and just order a box of pork...I like their style! It's places like this that make me wish this was my neighbourhood. Sweet home style cooking that will leave you fat and happy.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "J4sv-OKmwoCE1YmMLdhKog"
  },
  "xKj6dCrbiDd8_kr1rsalSA": {
    "date": "12/7/2013",
    "text": "Wandered over on a rainy Friday after collecting prewedding shoot photos from our bridal studio nearby! :) Noodles were great, al-dente and with a yummy sauce, would've liked more chilli! Haha.Ordered a plate of char siew/siew yoke/roast duck. And a small bowl of wontons (4 of them inside). That, with 2 plates of noodles, came up to $19! No idea how they counted.. I guess ordering normal noodle bowls each would've been cheaper. Ah well.Anyway, roast duck was pretty gd, tender. Char siew was, as others have described, very caramelized (read: sweet) and fatty! My my... It reminded me of satay a little, actually. perhaps because of the caramelization. I don't like fat, but I could see how people would like this.Siew yoke was crispy, I'm also not a fan because of the fat, and some parts of it were pretty salty. But fairly tender meat, where there was it.Wontons had the crunch of water chestnut bits in it, pretty gd soup.Guess I wasn't crazily wowed by it, but it was pretty good. Would like to try their soy sauce chicken next time!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "esT4meBA3Yz8FsYUvGyz1w": {
    "date": "7/9/2014",
    "text": "My go to place for great sweet succulent charsiew and roast pork. Great food. I brought many friends to this place and it quickly became their favorite place for roast meats in Singapore",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWujtkQB9ezTHGipESk_6w"
  }
}