{
  "U8q8ec3Y-19NNrHKlN0BtA": {
    "date": "10/23/2017",
    "text": "Suitable for business lunches and corporate events. Reserved a place for business lunch and the service was excellent. Very easy access as you can walk in directly from the drop off point at the Office tower location.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sz4-R_XHp6jNuGdFVNAldQ"
  },
  "B2V-oDgzMV2k_7e-THzCRw": {
    "date": "6/19/2015",
    "text": "Fantastic fresh fish!  Visiting from my current abode in a land of dubious food preparation, fresh seafood was definitely high on my list when visiting Singapore.Simple high-quality sushi and sashimi.  That's what I wanted, and that's what I got.  Sake, Hamachi, Hotate, Madai, Unagi--all very tasty.  I did play with the rolls a little bit, trying a Dragon Roll in one visit (enormous) and a Foie Gras roll in another (interesting) though the basic fish is the star.The atmosphere is brightly lit, vibrant, and open.  They open early for lunch and fill up by about noon--it seems a popular place.  They did have the sushi conveyer belt and while I sat at one for a few moments, I felt the stuff going by wasn't the best of their offerings, so I just ordered off the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "2jHXlagPsLtmRi4Nsr49LA"
  },
  "BBPksXe9V0hKRFZzk3AVKA": {
    "date": "11/14/2014",
    "text": "On the pricey side but the atmosphere is pleasant and the food is high quality. The service could have been better. We were a table of four and one person's lunch set arrived 20 minutes before the others. Agree that Kuriya is one of the better sushi restaurants in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1CHT_Z5UG_sVUcCkYIuZcw"
  },
  "AJFpNR9ugtih0DjdPQpqtA": {
    "date": "12/4/2012",
    "text": "Very very fresh sashimi and delicious bento as well! I would say this is my daily to go jap restaurant, if not for its sky high prices! However, it is still worth going for special occasion to indulge in some splurging and pampering on your belly.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZoYVSk3hhn1NRYM2RbERGg"
  },
  "FNcraDxTu59tdoOXMA7tDA": {
    "date": "9/1/2012",
    "text": "I love Kuriya Dining! It's my default dining destination if I happen to be at Great World CIty and have some time to spare. A meal at Kuriya is to be enjoyed at leisure, to rush through it would do neither you nor the chef justice. We got the edamame (really fresh and plump), selection of sushi (very fresh) and some yakitori items (grilled prawn, scallop and wagyu beef), king crab (sweet but a bit difficult to extract) with plum sauce, uni egg rice in claypot (seasonal item), dobinmushi (really tasty) and chawanmushi (really smooth) Everything was absolutely delicious, though I prefer the king crab at Hide Yamamoto.Service was really good and our server even offered to scrap the burnt parts of the uni egg rice for us if we liked. They also called to remind us of our reservation and the last order time, and were very lovely about it when we apologised for running late. Will definitely return!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I0HUm0jKix2Uq5zKruM3_w",
        "caption": "Photo of Kuriya Dining - Singapore, Singapore. King crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I0HUm0jKix2Uq5zKruM3_w/o.jpg"
      },
      {
        "img_id": "vi5QcOYU9OHavI4hEXZOog",
        "caption": "Photo of Kuriya Dining - Singapore, Singapore. Uni egg rice in claypot",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vi5QcOYU9OHavI4hEXZOog/o.jpg"
      }
    ],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "oxtbpXJGa7HvMXG3Ztpasg": {
    "date": "6/17/2015",
    "text": "This is possibly one of the most consistent Japanese restaurants I have eaten at over the years and all the raw fish is always fresh and delicious. The service here is also impeccable and much better than many other Japanese places I've been to. Only thing is that it's not cheap, but it's worth the premium.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ARP8j580hyns592Z_91FJA"
  },
  "Dv6RfXLYe1atjgz3Xf4GGw": {
    "date": "6/2/2013",
    "text": "Definitely one of the better Japanese restaurants I have had in Singapore, but it comes with a big pricetag. The sashimi is very fresh and their beef based items were really tasty. I particularly enjoyed the wagyu uni donburri and the wagyu curry udon.  I would go back for these most definitely.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "isCl3jHSFaWvBDlPW101lQ",
        "caption": "Photo of Kuriya Dining - Singapore, Singapore. Wagyu curry udon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/isCl3jHSFaWvBDlPW101lQ/o.jpg"
      },
      {
        "img_id": "t4NYIZTnEmiEHSlPCxwu9Q",
        "caption": "Photo of Kuriya Dining - Singapore, Singapore. Wagyu beef with uni donburri",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t4NYIZTnEmiEHSlPCxwu9Q/o.jpg"
      },
      {
        "img_id": "3gHGh2v2vZiADBePIGYlRQ",
        "caption": "Photo of Kuriya Dining - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3gHGh2v2vZiADBePIGYlRQ/o.jpg"
      }
    ],
    "user_id": "xzK_JMVlLECDtAHZtViYsQ"
  },
  "fqOIlB7IGrlUF51s2Q2g6Q": {
    "date": "8/9/2012",
    "text": "Easily one of the best Japanese restaurants in Singapore. Although a little on the pricey side, Kuriya knows how to serve up authentic and seasonal Japanese cuisine. Sashimi here is cut to perfection both in length and width ensuring adequate taste and portion. Wasabi here is grated fresh from the root and if you're lucky enough you just might get the end of the root to grate on your own when you request for more wasabi. A long time favorite on the menu and a personal favorite of mine would be the Miso Wagyu Beef which is served over a mini wooden Japanese stove. The beef grills atop a special kind of leaf which further enhances the flavor and visual experience. If you are lucky enough, do try the Matcha or green tea creme brulee  which is out of this world tasty! It is a rare treat indeed, sometimes only with seasonal menus but it doesn't hurt to check with your server!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KXgcihxqdbd9zeAirRnU3g",
        "caption": "Photo of Kuriya Dining - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KXgcihxqdbd9zeAirRnU3g/o.jpg"
      }
    ],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "soiOZSuOpUKQHiLS2eYnrA": {
    "date": "5/11/2013",
    "text": "For the price, I would say that it's not one of the very best Japanese places around, but the experience here was very good and the food itself was quite satisfying. The feature here I think is the beef, which we had in a variety of settings, from donburi to grilled to shabu shabu style. The quality of the Wagyu was just amazing, which was extremely tender and had the right beef flavor. The raw fish items were fresh and pretty good quality, but I've had better and paid a lot less. The service was top notch however, and the server was extremely friendly and had a nice conversation with us.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FBn1SPQ_t2yzytf6KGnafg"
  },
  "6Fuzfd5twa9yqwU2U6_eTg": {
    "date": "11/20/2013",
    "text": "Authentic food, good service, unreasonably priced!  And the price is my only reason for the three starts.  $200 per person for a tasting lunch menu, with just green tea.  That cuts into celebrity Japanese chef (like Nobu or Morimoto) price range!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "-PSUJ4YWvtDcor8FPCXL4w": {
    "date": "12/3/2014",
    "text": "My favourite fine dining restaurant for Japanese food. Everything is top notch here from the food, ambiance right down to service. I particularly like the sashimis here as it is super fresh. Pricey but worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  }
}