{
  "z5copOJpTuq9wSZIWlhlng": {
    "date": "4/12/2013",
    "text": "Good food, thats where it ends... If you're okay with that then go for it... Not the place to go if your in a bad mood...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrLeNCX0oeuHHHk7NF9qaw"
  },
  "DKFfGVkFECtvtz6btibA9w": {
    "date": "1/4/2014",
    "text": "Here's the quickie: mediocre-slightly good food, coffee shop ambiance, service with a scowl, but very friendly patrons. The location on Scott's Road is much nicer however the food there made me sick last time. Btw, the hot chocolate at s$7 is real authentic dark chocolate cocoa (semi-sweetened), albeit slightly expensive.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Kq0rEgkla7UX0Q3dqQBJA"
  },
  "3a-1Zqm__PNKZ74ybbJvFQ": {
    "date": "8/23/2012",
    "text": "I love having breakfast as an option anytime of the day so Wild Honey wins me over just based on that alone.I think since they opened another outlet at Scotts Square not too far away, the crowd here has lessened, came here on a friday evening just before dinner and didn't have to queue.For such pricey food, I'd expect to at least have a waiter take my order while I'm seated instead of going to the counter myself to order.You get ushered to your seat and then you have to order at the counter where there's a picture menu on a ipad you can scroll through to make your decision. Was feeling like ordering healthy with my partner so we chose salmon dishes - he had the scandinavian (grilled salmon on potato rosti) and I had the norwegian (poached eggs with salmon and asparagus). The norwegian was a very hearty dinner, 2 servings on the poached egg and salmon on top of generous thick brioche and a nice detail of salmon roe on top.The scandinavian was slightly bland, but there's salt rock and pepper on your table for you to season it yourself to your liking, it just needed that little bit of pepper.Final verdict: I'd only come here when I crave for exotic breakfasts during dinner, other than that, not really worth the high price.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "0p1PFFNgpvGpXpN9mpmtQw": {
    "date": "11/14/2014",
    "text": "I'm surprised for the low reviews.  I guess I'm used to pay higher prices for these type of brunch spots in Chicago.  Ignoring everything else, the FOOD was GOOD.  I really enjoyed the french toast with the mango in the center (Sweet Morning?).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "i1Jww8gjQE1QQXP1vFTl6g"
  },
  "Y_GVOYKXiUHkyQWAhnoHnQ": {
    "date": "8/27/2012",
    "text": "This store has a very homely atmosphere as the cafe comprises a mix of armchairs, normal chairs and benches. Its other outlet is newly opened at Scotts Square!The Norwegian is highly recommended with its generous portions and solid ingredients. The fresh sweet smoked salmon is paired with ikura, grilled asparagus and two poached eggs, and drenched with well-made hollandaise sauce and served on two thick whole-wheat challah brioche.The Tunisian ($18) which is distinctively Middle Eastern is a must-try here. It consists of Shashouka, and its basic ingredients consist of a thick spicy tomato stew cooked in a skillet. A few eggs are then poached in the tomato stew and it's served piping hot with some salad and fresh bread.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Id3xsUToKry84juXlk14Fg",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Tunisian",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Id3xsUToKry84juXlk14Fg/o.jpg"
      },
      {
        "img_id": "Ava3DeHy_dXtNmw5wLyO4A",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Scandinavian",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ava3DeHy_dXtNmw5wLyO4A/o.jpg"
      }
    ],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "hfMruOPD_HL7o3esTBuJ5A": {
    "date": "8/15/2012",
    "text": "When i first arrived there, i was taking some time to decide on what to eat. I ordered English Breakfast. Portion looks small at first but it was really filling. Moreover, fod is abit overpriced.I would have to say the service at wild honey was really bad. Even when i asked for an extra plate, the waitress gave me an attitude.I mean like after hearing so many review on wild honey, no doubt the food is nice. But with the service provided there, i seriously doubt i will be back again for their food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-MEHQ1pxCw9kysfQZh1SVg",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-MEHQ1pxCw9kysfQZh1SVg/o.jpg"
      }
    ],
    "user_id": "H5giEryaio2xzYX6qKraPQ"
  },
  "Lgc3A3gw4_jElv0OQ36i-g": {
    "date": "4/28/2013",
    "text": "Great breakfast / brunch food! So many amazing options it's a real struggle to decide. The English Breakfast was the popular choice at my brunch on Sunday, and everyone was satisfied (and stuffed) after eating it. The toast was thick and fluffy, scrambled eggs perfectly done (not too runny, not at all dry).I chose the Californian which had a healthy-but-still-yummy feel. The tofu gave the scramble a nice creamy texture (if you like tofu, that is!). Also tried the Sweet Morning which was delicious and not too sweet. French toast slices were nice and thick.The table got some donuts to share which had raspberry filling. Good fluffy donuts, not overwhelmed by the filling. We were all just too full from our mains to finish them...Only downside was the timing of the service... meals arrived spread out over the course of 20 (or more?) minutes. One friend received her french toast at least 10 minutes before anyone else got their food, and my dish arrived 10 minutes after everyone else had already been served. Made for a very disjointed meal. But, have to say the food was good enough to make me want to come back. Maybe I'll just try a different location next time, and hope we fair better!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "uUJX6xpFVJWJI6l_Mpry_A"
  },
  "geNtQ8AbW_E3IQtn7oQH_Q": {
    "date": "3/1/2015",
    "text": "I came here for Sunday brunch with some friends and honestly, I was super excited! I wanted to see what all the hype was about. I ordered the special (some potatoes with pastrami and poached eggs with hollandaise sauce)... My husband ordered the steak sandwich and both were pretty disappointing. They meals were lack luster and everyone in the group felt like the food was just okay... Like it missed the mark. Also the waiter told us that from the moment we are seated we have 90 minutes to order, eat, and leave. Wtheck is that about? I've never heard of that before. Oh yea, the vinyasa juice was good so I guess that counts for something!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "aOFNQZMBBmrSYAySb0HWpQ": {
    "date": "7/10/2013",
    "text": "I love breakfast food.  Just not for breakfast because I don't really eat breakfast, I eat brunch on occasion, just not breakfast.  So, in my quest for a place to have good breakfast food, I discovered Wild Honey.  My process for making the decision to go to a new restaurant is actually quite intense and I do a fair amount of research which involves looking at reviews, yelp and others, blogs, and the restaurant website.  As I took a look at the website for the restaurant (which is very well designed, bravo - you can tell a lot about a place by the attention to detail on the website) I realized there are actually two locations and they both do not offer the same menu, there are some differences, which I didn't particularly like because it added another decision I had to make.  Ugh, decisions.  I am fairly decisive when it comes to work, but when it comes to my personal life that is a completely different story.So, we go to the Mandarin Gallery location.  It is packed, and the wait time at 3 pm on a Saturday for two people is about 30 mins, but they give us the option to sit at the bar area and we take it because we can be seated immediately.  We go in, sit down, gulp down some water, and then go back to the front counter to place our orders.  The week we went they were offering the crab cakes Benedict special, which is called something else I can't quite remember now, so, my husband, true to form orders that and I finally decide on the English breakfast.  Both turn out to be pretty good choices.  As someone that was raised in Maryland, which is known for Chesapeake Bay, blue crabs and all cuisine which involve them, I am quite the discerning crab cake connoisseur and actually can't say the crab cakes were what made the meal, but it was good.  The English Breakfast was very good and I highly recommend that to anyone that finds themselves in a situation where they just simply can not decide.  In addition to our two entrees, I ordered a caramel latte.  It was a little too sweet for my taste, but that didn't stop me from drinking it.  Just be prepared for the level of sweetness if you order it.    I am not sure if we will go back again, there are so many restaurants to visit in Singapore, but we did enjoy our dining experience and suggest to anyone looking for a good place to have breakfast/brunch food make a stop at Wild Honey (Mandarin Gallery).  Can not say anything about the other location.Also, note, if you plan to take away your food because you have leftovers, they do not allow you to take your eggs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9JnXRueSbyAqHIaqp53vkQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore. English Breakfast, caramel latte in the background.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9JnXRueSbyAqHIaqp53vkQ/o.jpg"
      },
      {
        "img_id": "L_WLDLa21wLNC0x84ThzaA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Wild Honey's take on Crab cakes Benedict, can not remember the name they gave it.  It was their weekly special.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L_WLDLa21wLNC0x84ThzaA/o.jpg"
      }
    ],
    "user_id": "VC77eKyi6jAx0Vxmps__bQ"
  },
  "DP8T1-VHH-PoS-6G_DQUng": {
    "date": "2/9/2013",
    "text": "So I've been on a search for a good plate of Eggs Benedict in Singapore. I like my perfectly poached egg with the whites soft and pillowy, the yolk nice and runny. You'd be surprised the number of times I've ordered poached eggs in Singapore with high hopes, only to discover my egg whites rubbery and the yolks are mushy. The hollandaise sauce has to be creamy but not stick to your stomach cream. Its gotta have a little runny-ness to it. I ordered the Eggs Benedict with smoked salmon at Wild Honey and requested a perfectly poached egg of soft pillowy whites and runny yolk. I was pleasantly surprised to find that they did it right. I enjoyed the dish and had a pleasant experience here while I typed away working on my computer (had a deadline). The iced tea I ordered was also delicious. Not too big a fan of the prices but whatevs, its Orchard road area, service was decent, and ambience was eclectic homey.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hjpK0uWOWJEYNiI4Bvaw8A"
  },
  "fWO34lCkhzCalwrQE1lxhA": {
    "date": "5/5/2014",
    "text": "Comparing Wild Honey to Clinton Street Baking Company back home, I'll say this: The waits at CB are longer and the food is better.However, I happen to be one of those people who have no trouble rising a bit early (these days, in fact, it's mandatory) and I always manage to snag a table with a 15-20 minute wait. I'll let you in on a secret; if you get there by 10:30 the wait times tend to be shorter than they state. If you end up here later, wait times are long but you don't have to line up or wait in the sun.. just take a stroll through the mall until you get a call from the guys at the restaurant.I will say that the Wild Honey at Scotts Road is bigger and has more character than this one, but traffic has a way of adjusting itself. My wait times have been consistent between the 2 locations, and the food tastes nearly identical.I like that the menu items are organized by the country/region they are inspired from, and then Wild Honey does a fun little take on it. The food is closer to a tradional breakfast than a whimsy one, but they manage to keep it exciting. One of my favourite things to get here is the Tunisian (made veggie) - spicy shakshouka served with bread and salad. The eggs are nicely done, with runny yolks, the taste is spot on, even though the accompanying bread and salad are a bit of a disappointment. If your tastebuds are craving a good old kick in the nuts, try the spicy mex burrito. The portobello road, which is a modified eggs florentine, has decent flavours as well but is a bit more monotonous. Among the sweeter offerings, you could try the Belgian - which is a tropical country's take on the waffle. The texture of the waffle itself is a bit chewy but the flavours work so nicely together. At Scotts Road they have the Caribbean waffle with passionfruit, which is lovely as well. They have an adequate menu of coffee and milkshakes etc, but with their portion sizes I'd advise you to share the heavier beverages. The only thing that I found completely ridiculous is that they charge 10$ for Orange Juice!! And I even found a pip in mine the first and last time I ordered it.Service has usually been presented with a smile, and they are child friendly. Go enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lW35rwNviCgvTXJO8gvs-A"
  },
  "8yNzvlJvgvpPjsO1tPvgJg": {
    "date": "2/9/2013",
    "text": "We had the Tunisian and the Parisienne. The Tunisian was a spicy tomato stew served in a small skillet with merguez sausage and a couple of eggs on top with toast on that side. It was good but small. I was still hungry afterwards. The Parisian was kind of like a croque monseiur in that there was a soggy sandwich with cheese and ham in the middle, then it was topped with two eggs and I think Hollandaise sauce. It felt like a variation on eggs benedict. I went there with a Korean girl from the countryside and she felt right at home because its ambiance is similar to cutesy kitsch coffee shops with lounge chairs. I really wanted a fresh squeezed orange juice but I didn't want to pay $9 for it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "Ifrxwu1QDoUE41mdp1tmhw": {
    "date": "8/19/2015",
    "text": "WILL NOT RETURN.  Completely under whelmed. Went in today to have breakfast before work.  There was no wait to be seated at 11:30am. once seated we had to flag down a server to place our order. When we asked for ice water we were instructed that there was a water station behind us.  There was only one glass at the station so we had to request another glass.  I ordered an orange juice as well.  When i requested that I have a glass of ice for my juice i was told it would be an additional $1! For ice!!  I was shocked.  I have never been told I have to pay to have my drink iced.  Then when our food came out, one of the poached eggs was over cooked and the yoke was not at all runny as one would like.  The flavors were just ok...nothing so special about the food that I could over look the poor service.The table net to us had requested a glass of hot water and they were told it would also be an additional $1!! Charging for glasses or water and ice....beyond ridiculous....especially considering our meal for two was over $80....and we had to flag down a server to get the bill as will. I think one of the owners or a manager was on the floor as well....he seemed to have no people skills. I will not be going back here and if asked by others I would not recommend this spot.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jqc_sUHZdp34fGYM_ZpmtA"
  },
  "ivnV9wp7XS4SdrVVVH2SUA": {
    "date": "8/7/2012",
    "text": "I really want to like this place, but I can't. It's like one of those -- oh, it's so great, or it should be, but it's not -- type of places.It has got EVERYTHING right which is why it's so frustrating. An awesome space that makes you feel warm and happy immediately. A good vibe. An innovative concept. Something that nobody else had. At least when it started.The food is okay. That's the problem: it's not amazing. It should be. I wish it was.I also don't want to queue so much for something that isn't amazing, especially on weekends. Sigh.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ml61UOrHtdUCwW0JcTM_Vg"
  },
  "pkduIr5isPa0C3wCbYXUdA": {
    "date": "7/16/2012",
    "text": "The original outlet in Mandarin Gallery, this branch of Wild Honey gets insanely crowded over the weekend and evenings and you can't make reservations here, pfft! If you do manage to get a seat in this small outlet, then you can enjoy a nice meal in a homey cottage-like setting.Wild Honey serves up breakfasts from all around the world, and I usually end up getting the English or Parisienne because I like me some eggs, but my friends rave about the Tunisian. You have to order at the counter which is equipped with spiffy ipad menus so you can see pix of what you're ordering. The pastries and desserts on the side also always look absolutely delectable!It's not the cheapest, but it does serve up pretty good food and service is friendly, but I'd pick a very off-peak hour to come here because I'm not queuing up for hours just to get in...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "uRUrY-EghTVSCF0j3NcfRg": {
    "date": "8/16/2012",
    "text": "Located at mandarin gallery, this restaurant is well known for its all day breakfast menu. It is one of the upmarket all day breakfast and you would have guess the food is on the pricey side. During high tea hours , the queue can get extremely long and I was there once where the waitress informed me the waiting time is 1 hour. The interior design has a woody touch, giving a homely feeling. The food comes in different type of cuisine menu. For example the European style, Mediterranean style and many others which you have to see from the ordering counter.Personally I would recommend the European , it is served with bacon, poached eggs and sandwiches. Try to avoid the flower tea as it tastes like syrup water. In all, this place does serve quality food and great ambience , but if you are on a tight budget you might want to visit food for thought or the hatched for a all day breakfast fix.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4B4gZFiZscBR9yFFUsc6Q"
  },
  "a0FyHR9dH7p4cddi-zye4w": {
    "date": "8/12/2012",
    "text": "Wild Honey is an all day breakfast joint. It has a nice and cozy feel, the staff are super friendly and the food is decent but honestly, they place is WAY TOO overrated. There is almost always a wait for a table and you would think that would mean it was a fantastic place to eat. Dont get me wrong, the food is good. but SO NOT worth the money that you pay. $22 for two pieces of french toast? or $25 for 2 eggs and bread? or a $20 sandwich? You feel like you are being ripped off. Portions can be pretty stingy as well. Wish i could give them more stars, but honestly way too much money for dishes that are so simple.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0c09Dm0wKDjurr1eMXBLUQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0c09Dm0wKDjurr1eMXBLUQ/o.jpg"
      },
      {
        "img_id": "f8f4mGA4CNaG6qJ_xNirKA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. waffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f8f4mGA4CNaG6qJ_xNirKA/o.jpg"
      },
      {
        "img_id": "ghlSXcWsZmE8VcouIsBSlQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore. sweet morning",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ghlSXcWsZmE8VcouIsBSlQ/o.jpg"
      }
    ],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "lQcpbXfGzuFW2q2nsd3P7w": {
    "date": "8/8/2012",
    "text": "Planning for Wild Honey was like planning for an overseas trip. I went to a lot of food blogs to ogle at the pictures. It was glorious - the amount of eggs and sausages and all towering on the plates, of course my expectations went waaaay up.Upon reaching the place, we saw this long list of country names scrawled on blackboards - why do ALL new and upcoming restaurants love using blackboards as their menus these days ah? But anyways, there was an iPad at the counter, allowing you to swipe and check out what each breakfast set looks like. Not very helpful not very fast, especially since we were a group of 8 people. Luckily I already knew what I wanted. The English breakfast set.It was okay - very fulfilling, with emphasis on FILLING, small wonder that some of my friends found it too oily and heavy. The music that was playing then was kind of headache-y, it sounded like the repetitive null and heavy beats that Inception has towards the end of the movie when all the dreams fall apart.They don't take reservations by the way.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wWXchH7yRlFCxfC4dkQnA"
  },
  "pq_9mj_pie000k3W8voMAg": {
    "date": "7/18/2012",
    "text": "I keep thinking that it's a nice place to have a quiet breakfast date with myself and then am surprised when I show up. It's a breakfast place, but not quiet by any stretch of the imagination--it's not so much the crowd at the time I go (but by 10am 70% of the tables are occupied, with a mix of tourists, business people, and ladies who erm brunch) but the music. So it's not so much a place for a quiet reflective start to the day, more a place to fuel up--and what a place! Round the world in eighty-eggs, with an assortment of creative drinks, both alcoholic and non. Try not to think of how you can make most of the egg dishes yourself at home, and you'll be just fine.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJyVBqo9enL7XnzMnAkv_A"
  },
  "gicPWRtSafaTeR0kUbF90g": {
    "date": "10/30/2013",
    "text": "Like others had commented, the egg Benedict was delicious as well as the coconut waffle. Unfortunately the portion is small. Maybe I am used to the American portion even though I'm currently in Singapore. Price wise it is also a little high as it is located in a more expensive mall. Will probably drop by again next time :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Qr-WoW6Vye4aH3I-YZ2ZyQ"
  },
  "FExxjDGmMZ1z7RK7KfoRKQ": {
    "date": "7/14/2013",
    "text": "This was one of my favorite brunch places in Singapore before I gave up on them after too many service snafus and general service arrogance.Over the course of over a half-dozen visits, my major complaints:1) Wish they would allow for sides of eggs, so that it is possible to order pancakes with eggs. 2) They take your name and estimate the time, but will seat out-of-order to maximize table use. So, my 2-person party kept getting pushed as multiple 4-person parties would put their names down and were seated before us. Forty-five minute wait become almost 2 hours on one occasion.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5lEhYKYMEuTAH6CZGUcpaQ"
  },
  "6A-sKMpTfeGCtYrU2foerg": {
    "date": "3/5/2013",
    "text": "I really enjoy the food here. Ive had a hard time finding good brunch places and I find their food to be inventive and good. Its not the MOST original but its served up well and is very tasty. I loved the tunisian and the mexican. They serve up good coffee but its not really the reason to come. I do admit the lines can get long and they dont take reservations. The service isnt stellar but you have to go up and order your food anyways. The staff is nice but one thing I noticed is that you cant just sit and enjoy coffee and conversation after youre done. They pretty much come by and ask you to leave if you take to long. Not exactly the most welcome feeling.  But really you come here for the food in a nice comfy setting.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4KB9lTP3Tf3xfW2lMEYzdg"
  },
  "-h-spRPMGe8PIvJSO4ZQtA": {
    "date": "4/28/2014",
    "text": "A favorite go-to spot for me and my favorite person! We are fans of the Parisienne, which is their yummy (and generously portioned) take on the Croque Madame, paired with their delicious iced chocolate to share. Nothing makes for a better, more decadent way to indulge for Sunday brunch!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxs330TbfNSw9dVmJbFMjQ"
  },
  "I1rkblm9z07equhTqLQBUA": {
    "date": "11/24/2013",
    "text": "Egh, please don't waste your time here. Their eggs benedict were under seasoned and overpriced. A large orange juice was $9, fresh squeezed but I think they added sugar. Their cappuccino was delicious.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8-_nt9Uq3AK7R6PFE3zwA"
  },
  "K4JA46PfhuQhCkN9gAaGag": {
    "date": "7/11/2016",
    "text": "Food is great, but coffee is 3/5 for me.We ordered the dish \"I love NY\", which has smoked salmon with scrambled eggs, bagel etc. Pretty good.Coffee comes from Common Man, but is suprisingly quite acidic compared to the rest of the cafes who also use Common Mans roasters.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "38I-1kv9jrQ1gXHgXTkhEQ"
  },
  "N0ec5FcdiIcG5TH45QOchg": {
    "date": "12/19/2015",
    "text": "Fantastic breakfast. The NORWEGIAN eggs benedict with asparagus and avocado was amazing. The MEXICAN vegetarian breakfast burrito was also amazing. They should think about a version with meat. The atmosphere was great. The service was drinks was a bit slow but not too slow to make me reduce a star for it. They also have a good selection of teas.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PulY9j3a88j0T5pF0kX9_g",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PulY9j3a88j0T5pF0kX9_g/o.jpg"
      },
      {
        "img_id": "hRdXVUvZwHgZsKudi3zHNw",
        "caption": "Photo of Wild Honey - Singapore, Singapore. BELGIUM",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hRdXVUvZwHgZsKudi3zHNw/o.jpg"
      },
      {
        "img_id": "tz_uJQyH-hTP1lpqcDZOFA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. MEXICAN (vegetarian breakfast burrito)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tz_uJQyH-hTP1lpqcDZOFA/o.jpg"
      }
    ],
    "user_id": "sc1re2qCgvGK1POwDkiDcA"
  },
  "trXFXAXRMA_OkRvEMj7kEg": {
    "date": "6/21/2014",
    "text": "Love it ....This place offers a wide variety of Breakfast style ..... Late wakers like me still get to taste awesome brunch at any time of the day.My Girlfriends treat me Brunch for my Birthday and i heard lots rave about this place. 3 of us order 4 dishes to share as its our 1st time visit. Sounds greedy ya.I couldn't really recall the name of the dish we ordered but when the food is served we are amazed by the portion as its really big.... 3 ladies + 1 young kid finish all the food and its really yummy. The table were alittle to small for us to place our food.Please do note that its alittle cramp so pls do not go with big groups like 4 to 8 pax.Been there twice till date, can't wait for my 3rd visit .....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uB2sqxE6LcSjkN_KzqNmpA",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uB2sqxE6LcSjkN_KzqNmpA/o.jpg"
      },
      {
        "img_id": "TlA0mZFO7VW-vRhiq25BNg",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TlA0mZFO7VW-vRhiq25BNg/o.jpg"
      },
      {
        "img_id": "0Rr0C18CgRaCyzcwNFbeeQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0Rr0C18CgRaCyzcwNFbeeQ/o.jpg"
      }
    ],
    "user_id": "UwWtpjalT2xlJyglRRITug"
  },
  "61RrLnb4gudZ9UkAtEtcNQ": {
    "date": "5/22/2015",
    "text": "Excellent food me excellent service...  When first arriving it gave off a cool hip environment with its modern style and its unique colors. I highly recommend this place to everyone that comes and visits. My wife found this place now it looks like I have to trust her taste in food more often..",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zw1U_4NXjsMM5U8b6osntw",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zw1U_4NXjsMM5U8b6osntw/o.jpg"
      }
    ],
    "user_id": "dZUwIwekpf6DerYDiVk3XQ"
  },
  "qq1dmT7BmDzsvFSTkTHK7g": {
    "date": "3/15/2016",
    "text": "I love the idea behind Wild Honey, a fusion of breakfast and brunch items from around the world. We ordered three items, everything was pretty good, but the waffle was amazing! We couldn't get enough. A Belgium waffle, topped with crispy coconut and syrup made from passion fruit. I highly recommend it! Also the service was really good and quick to meet our needs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKrAGpEdCAxEJwdMOF-6AQ"
  },
  "4R2Tc0x4-cUJsVb7EWuCvQ": {
    "date": "10/21/2016",
    "text": "such a pity! I have been to this place several times with friends who enjoy the food here, which indeed is pretty tasty. However they have drag me here!. The Service and the utterly unpleasant people that seat you is offputting. Bad, bar service: slow and unattentious. I feel like helping the owner or manager of this place to see all the fallouts on service, for IF and only IF fixed this place could be one of the nicest in SG for breakfast and mimosas.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4JlsVf8gTzk7E3yNcCj-0Q"
  },
  "Fy_f_NzwM3GBH0__EGAmVw": {
    "date": "10/16/2014",
    "text": "OBSCENELY overpriced, fancy food, breakfast onlyI ordered the \"Tunisian\" - which oddly includes a pork sausage, something I'm pretty sure you'd never find in Tunisia.  It was SGD20 (all prices here are 17% higher for service and tax).  Coffee for SGD6 and OJ for SGD9.After waiting 15 minutes, they brought out a \"Parisian\" - not at all what I ordered.  I was famished and did not want to wait 15 minutes more to get it right, so I got a refund and left.  The Parisian looked nice, not a generous amount... but really, breakfast for SGD35 + 17%?I suppose it is culture shock.  Yesterday I had a fantastic bowl of laksa with chicken and cockles for SGD4.5 and no extra charges added.  The problem is finding the local food is hard if you're not local, and Singapore seems determined to bulldoze the local places and replace them with ridiculously expensive luxury places.  I would have had to take a taxi both ways to eat local, and being hungry, I was looking for a faster solution.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gt7c0hw42RoMvM8jbk9wIg"
  },
  "uc2iwWc1jrWvjThy5nnUXw": {
    "date": "11/28/2015",
    "text": "This is an outstanding place.  3rd time yesterday. The food and the service never disappoints. Have tried quite a few things on the menu- Flinder's Lane,  Norwegian,  Parisienne, the French Toast,  coffee. Always have the Languedoc wine with breakfast and love it. Family came to Singapore and took them there. They loved it. The Norwegian -  poached eggs with salmon was just out of the world.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y24jb9BKFgxU5L2OZKI6_w"
  },
  "TIoq9DHjHnansaBVd6SBvA": {
    "date": "7/13/2016",
    "text": "Ordered the English and I have to say... That breakfast was packed. I particularly enjoyed the Kurobata sausage, Canadian bacon, eggs, mushrooms and toasted potatoes! The plate also contains two brioche, baked beans and half a tomato which I could do without. The 4-star rating is basically for that awesome sausage. Must-try!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUB60ublKhL0N3sMMYh6aQ"
  },
  "v-Z1uwXmFgDsRDdFGAMhWw": {
    "date": "12/14/2012",
    "text": "Wild Honey does a great breakfast, no matter what time of the day you visit. This is just fabulous for not-so-early birds like me, who can't get enough of their Caribbean waffles, eggs benedict, or Norwegian smoked salmon bundles. I think they cater to the true Foodie, who has a soft spot for rustic comfort food, yet craves that extra little je ne sais quois. The only downside I have ever experienced with this chain is their sub-par customer service, long lines (but you can make reservations at Scotts!), and inordinate prices. Perhaps if the waitstaff were more attentive, I wouldn't feel as bad hashing out so much dough for breakfast...but they're not, so don't expect to be waited on courteously or promptly. If you're just there for the nosh, then you're all set!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cP4hNTBDlUTuWJlJGCtlhQ"
  },
  "U3qsTmYchCrBFA6BWh7Sqg": {
    "date": "9/10/2014",
    "text": "Met up friends for brunch at Wild Honey but we couldn't book a table so we had to wait in the queue. But the good thing is they would text us when the table was ready so we could walk nearby to do more sightseeing of Orchard Road.There are a range of Western breakfast from around the world - English, European, Tunisian, Italian, Mexican..etc. As well as sweet and savoury dishes to suit whatever taste buds you have that day.I had the egg benedit which was okay but not as good to what I can get in London. I thought the other dishes such as the Tunisian was more interesting. But I found it spicy and not my preference to kick start the day with fire!I had the grapefruit juice with my breakfast. It was refreshing and a nice alternative to having the usual orange or apple juice.Overall I think it is a nice concept to have breakfast from around the globe.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gQJp6mwCMRCBLXDsF_cGAQ"
  },
  "_t7vLZ8h2jTNLGyVOlWTdQ": {
    "date": "9/2/2012",
    "text": "Breakfast is the most important meal of the day. Sadly, it's a meal most of us go without. The solution? All day breakfast! Their meals range from the traditional eggs and bacon to salads to steak sandwiches, and don't forget the coffees. The quality of food is pretty decent. All that you would expect from a cozy restaurant located in a higher-end mall.  Oh and if you prefer your toast thick, then you've come to the right place. However, if you can cook a half decent egg on toast, then you might want to give Wild Honey a miss. $20 for eggs on toast isn't my cup of tea. Just a heads up. Expect to wait at least 15 minutes for a seat if you come on weekends.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R7R82a4FjPc6xeQzvAGkvg",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R7R82a4FjPc6xeQzvAGkvg/o.jpg"
      },
      {
        "img_id": "EtJMjugbjJ19jgxjQdVQpQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EtJMjugbjJ19jgxjQdVQpQ/o.jpg"
      },
      {
        "img_id": "qmxlq7cCtpdD0g0cdnQdQA",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qmxlq7cCtpdD0g0cdnQdQA/o.jpg"
      }
    ],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "IG8z0b6W18n6xrbDffhPQA": {
    "date": "1/24/2015",
    "text": "5 of us + 3 year old boy went for brunch on the last Sunday of 2014. Had reservations so were seated promptly. 2 of us shared the following:-EnglishBfast- Scrambled eggs, back bacon, Cumberland pork sausage, sautéed mushrooms, baked beans, breakfast potatoes, grilled tomato & brioche. Everything was delicious esp. the eggs which I usually find quite \"heavy\" after a while but found these to be \"light\" although still very tasty. Breakfast Hangover-Scrambled eggs, back bacon, roasted pearl tomatoes, Swiss cheese & spicy tomato chutney on grilled ciabatta with breakfast potatoes - tasty!Also shared a starter which had fried \"sticks\" of goat cheese - very tasty.My flat white was just perfect as well. We all also had a couple of glasses of sauvignon blanc each which went very well with our meal.Extra star is for the good service and de rigueur bustling brunch vibe.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "__Ksf1CCgaKdS3Gi5f6PcQ"
  },
  "IxHgtyKZ0K84G3AJ_lfOZQ": {
    "date": "7/21/2014",
    "text": "I had brunch here once and I loved the concept of this place where they try to replicate breakfast meals of different countries such as American breakfast, English breakfast etc. It is breakfast dishes inspired me from the west. But it works because it has a good variety of choices. I had the Spanish hash and I loved it! Although I found it a little pricey I still enjoyed my experience there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NYQxsxVXF4WGqqZUsO0tsw"
  },
  "FJ3oC0WxdBPo6jVtE4gN4w": {
    "date": "1/31/2016",
    "text": "I had Norwegian (poached eggs+asparagus+smoked salmon+avocado) & cappuccino. food was amazing. Very tasty. The environment is also quite pleasant. Service is just so so - like everywhere in SGP...air conditioning is a bit too low for me...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lU5kLXzRpdpujdktwcdBJw",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lU5kLXzRpdpujdktwcdBJw/o.jpg"
      },
      {
        "img_id": "6hZ-vpSvf2ZhTlNxRN16QQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6hZ-vpSvf2ZhTlNxRN16QQ/o.jpg"
      },
      {
        "img_id": "aTXubEwK5lVGgvU98Fv7Kw",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aTXubEwK5lVGgvU98Fv7Kw/o.jpg"
      }
    ],
    "user_id": "My3E_WITYS7Zj2HUjdKmBQ"
  },
  "CF1GemAajcXPGx_bDpZhgA": {
    "date": "3/28/2015",
    "text": "This place is pretty fantastic! Being American, I sometimes just miss traditional breakfast food from home. I ordered the Belgian waffles with coconut cream and grilled mango- perfection! I also loved the ambiance of this place, very cozy feel. The only downside is that I wanted to order a side of scrambled eggs and of course because it isn't \"on the menu\" they could not accommodate me, even though I could see other dishes contained scrambled eggs in them. Pretty typical of Singapore, pretty hard to get things customized or get people to think outside of the box. But, overall, very positive experience! Be ready to pay though, for two of us the bill totaled 71 SGD.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "nQRJuIksJ4LGs-T8Z9-aqA"
  },
  "H2G6sFV7OimGY-pi6YtV-w": {
    "date": "7/9/2014",
    "text": "So, I made a pact with myself when I arrived in Singapore that I would not have any western food while there. My friend convinced me that if I didn't have breakfast here I would regret it. I tell you what....he was right. I had the Parisianne breakfast. Three thick cut pieces of ham and cheese stuffed toast with a hollendaise over it. That wasn't even the best part. My friend had the Hangover Sandwich. I tell you what I never seen a croissant loaded so well.  My buddy had ordered a side of bacon. When it came out it wasn't the two or three pieces that that the US usually has but a literally boat dish full of fresh cut bacon. The only down side of the experience was it took forever to get our coffees. The decor is great. I loved how comfortable the chairs were. The furniture was more chic hipster than traditional which made the whole place jive well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LOK4oCby0Ou46W65YMO6-w"
  },
  "8C2uGoz9mUnZodP65zx7OQ": {
    "date": "8/9/2015",
    "text": "Great service and environment. Ordered English breakfast and the thick toast/bread were yummy. Kinda pricey but only because street food in Singapore are so cheap!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "K7gBvA1uGyIdURslVVhjyA"
  },
  "eaf6YCxW2xbHmCqGxpoF9Q": {
    "date": "1/24/2016",
    "text": "The food is decent, but they Nickel and Dime you for every thing. Ice water is $1. Coffee is $5 and there are no refills. Also the menu is really inflexible. Aside from the 8 sides listed, you cannot add anything else. As a girl who loves breakfast options, and was in search of something reminiscent of an American brunch experience, I'd pass. If you want to be overcharged for ok food, go for it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZgycvwRKLxZ8GRIb0LWqg"
  },
  "GcQ6d4c3r6UE_fD_hWkwQw": {
    "date": "6/8/2015",
    "text": "Pretty bad food.  Overpriced.  Inflexible staff.  Phony white guy at the front desk.  Not sure what the purpose of him was.  Cafe latte was stone cold.  Had to send it back to get them to make it again, this time hot, even though I had asked the waiter to make the coffee extra hot when he took my order.Wanted to get the 'hangover' sandwich to be made NOT as a sandwich i.e. all the ingredients to be put on the plate separately.  The waiter exclaimed 'cannot!'.  He never even tried to ask the chef if that was possible.  All he could say was 'cannot! cannot!'.  Who does that to a customer? A useless waiter at Wild Honey!My friend had to send her meal back because the eggs were cold!  No one ever came to ask us how our food was after we were served.  But they still charge a service charge for no service at all.The only good thing was the waiter had the forethought to separate our bills before we went to pay separately.  Typical.  Only happy when you are opening up your wallet.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5dgLE1SfIWOE-Q0b5uTTg"
  },
  "tsgR0NRfSAujyjQ1Kw_t_g": {
    "date": "10/31/2018",
    "text": "Good food good service good ambience.  The salad we had was a wee bit too sweet for our liking otherwise all good.  Heading back again next Tuesday.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "T5DctX9OmvplrQbeqmkwMw": {
    "date": "7/21/2018",
    "text": "Good brunch place in Orchard. British-style brunch options - our favorite is the classic English breakfast - a simple dish but well-executed. We also like the pancake overall despite being slightly too sweet. Coffee was so-so. Ambience is nice / lively and a good family/friend brunch option",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kxc0DtcO2l6fZDaddLNtrA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Pancake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kxc0DtcO2l6fZDaddLNtrA/o.jpg"
      },
      {
        "img_id": "vx6k9z9Rmc7I4FRxYYLXCw",
        "caption": "Photo of Wild Honey - Singapore, Singapore. English Breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vx6k9z9Rmc7I4FRxYYLXCw/o.jpg"
      }
    ],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "XLanpa8J8bQ-L0R4ZHHffQ": {
    "date": "7/20/2017",
    "text": "This place gives off this cool/hipster vibe, you just wanna sit here, get a cup of coffee and do work on your laptop. They make all the food look really nice, definitely good for a picture. I'm giving this place 4 stars because it was pretty pricey, and the food was just okay. I got the greek which was supposed to be a moussaka, but it was just eggs with tomato sauce, some minced meat and feta cheese. I mean, it was good, but not what I expected from reading the menu and also not the best I ever had. I would say this place is good for if you just wanna have chill time, be able to sit down for a while, get a few coffees and maybe if you wanna get some workdone too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7LF7qq3yC72cmupcwozEQA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. The Greek",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7LF7qq3yC72cmupcwozEQA/o.jpg"
      }
    ],
    "user_id": "TbvEQJYvFXtirUh-SoGWYg"
  },
  "cCcLGx-SR4Tu62Q8DbMOIg": {
    "date": "4/1/2018",
    "text": "Wild honey was so good! It's the perfect place to get weekend brunch.  I ordered the waffles and vegan bacon.  (I cheated on my vegan diet when I ate the waffles.) if I go back I probably won't get the bacon.  It was made out of dehydrated eggplant.  It was more chewy than crispy.  But those waffles??? That's a must have for sure!  It's topped with the freshest sweetest mango that I've ever tasted.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K3CNITzIB-QhweTWXAFWGA",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K3CNITzIB-QhweTWXAFWGA/o.jpg"
      },
      {
        "img_id": "r9_xXv4Pr-cuLtboqcS1aw",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r9_xXv4Pr-cuLtboqcS1aw/o.jpg"
      },
      {
        "img_id": "FT9wUV_e2A8TMpSUaxLEVg",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FT9wUV_e2A8TMpSUaxLEVg/o.jpg"
      }
    ],
    "user_id": "JGI4mG7tp7LEiZpsJmQmNQ"
  },
  "7BJ12sOcO5whn5eWUwkL0w": {
    "date": "4/30/2016",
    "text": "I went to this restaurant during Christmas time 2015 with my friend at 9am in the morning haha. I remember my friend told me it was the only available time they had that were not booked. I actually think the food was really good. Don't really understand why the reviews here are kinda low. My friend had the NORWEGIAN (eggs Benedict with smoked salmon, avocado and grilled asparagus), and I had the I LOVE NEW YORK(scrambled eggs with smoked sturgeon and sesame bagel). You must be wondering why I remember so clearly LOL. Its because I had the Instagram picture. I also ordered a latte/ mocha I think(don't remember exactly what I ordered), and it was pretty tasty too. I love the decorations in this cute restaurant too! Many locals came here for food I believe. Mostly young adults and teenagers.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_YCCCrT3akAXH8Q4U2ooWA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. I love New York(front) and Norwegian(back)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_YCCCrT3akAXH8Q4U2ooWA/o.jpg"
      },
      {
        "img_id": "J8l8g1JjYK9m7AyWIz9HEQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Latte art",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J8l8g1JjYK9m7AyWIz9HEQ/o.jpg"
      }
    ],
    "user_id": "qLMOGxrRPIIV12PUv2X1IA"
  },
  "i4bmf6bb4TdQ3fpoQqZXpg": {
    "date": "3/11/2017",
    "text": "Of the many restaurants in the Mandarin Gallery building (Mandarin Orchard hotel) in Singapore, Wild Honey stood out - with its buzzing atmosphere and delectable brunch menu - this is a good spot to enjoy brunch. Not many restaurants in Singapore served champagne and this one had Taittinger on its list which was positive. I had the European breakfast - essentially poached eggs, prosciutto ham & grilled mushrooms on toasted brioche topped with hollandaise sauce. A glass of champagne + breakfast + cappuccino came up to SG$55 so it wasn't cheap but go ahead and treat yourself!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KvLBsLxLnu7VEh_FuFgi-Q",
        "caption": "Photo of Wild Honey - Singapore, Singapore. View from the bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KvLBsLxLnu7VEh_FuFgi-Q/o.jpg"
      },
      {
        "img_id": "49f72Cm6BMCV8lT0tkATCQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore. European style eggs poached eggs, prosciutto & mushrooms on toasted brioche topped with hollandaise sauce.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/49f72Cm6BMCV8lT0tkATCQ/o.jpg"
      }
    ],
    "user_id": "ky_D495gGOHkt1LmqaKreA"
  },
  "zUM3VIQ2IOWN3lIcmaw71A": {
    "date": "4/16/2017",
    "text": "Go early in the morning if u wanna skip the lines. Breakfast is over priced and the food quality has decreased over the years. I like their eggs benedict but so far the menu has stayed the same over the span of 7 years.... not impressed. Still a cozy place to catch up with friends over breakfast",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ZGHL4t9OIRpDcBGJBFZ2w",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Prosciutto and poached eggs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ZGHL4t9OIRpDcBGJBFZ2w/o.jpg"
      }
    ],
    "user_id": "86kWlG8XZiVG7NhfpdI1LQ"
  },
  "R8Jr_OBInQPQ3NdSA_ERHQ": {
    "date": "4/27/2017",
    "text": "Awesome place . Food is great, a little bit pricey but hey it is Singapore. I order a salad, a side , a wonderful melon juice and a coffee late . Nothing more to say . Service is also very effective and the place is tastefully decorated. Will be back very soon !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "txbY27BDliRt_425vOQM9A",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/txbY27BDliRt_425vOQM9A/o.jpg"
      },
      {
        "img_id": "k8TXE94czBrJbsxAo3Yjeg",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k8TXE94czBrJbsxAo3Yjeg/o.jpg"
      },
      {
        "img_id": "ckDQAD5HKgrB7l6bKpLsHg",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ckDQAD5HKgrB7l6bKpLsHg/o.jpg"
      }
    ],
    "user_id": "5EHVvvhK7EToDLkisGILOQ"
  },
  "q9NVWd-2bzaVa9POA1xf2Q": {
    "date": "2/14/2018",
    "text": "The vibe is great! The brunch menu is pretty nice, a little bit pricey but nice. I ordered the \"European\" dish and the egg benedicts came perfectly cooked with smoked salmon. Services are fast, from sitting to ordering. Pretty convenient too because the Mandarin Gallery is less crowded than other malls.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-zureovqyuo9fTHbHMOdw"
  },
  "0sYciYKfZxD1qKi7KPTRpQ": {
    "date": "7/1/2018",
    "text": "The food here is very good! The atmosphere is really nice. It's on the second floor of the Mandarin shopping center (if you are American, it's the 3rd floor. They count the first floor as ground). I'm a vegan and they had several vegan options. I got the Californian and added a side of avocado. I also got the tumeric latte. Both were delicious. My husband got the hangover sandwich and fries. He really enjoyed his food as well. The decor is really nice! Pleasant atmosphere, and very clean. The only reason i wouldn't give this 5 Stars is because the service wasn't great. I will give the benefit of the doubt that our waiter was new, but he wasn't very knowledgeable about the menu and he also wasn't attentive. We had to ask other waitstaff to assist us a few times. Overall we would return!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W742arZJEqsV6kIZNGxRPg"
  },
  "0Ljx5wfYCE0u0enzxPJ-JQ": {
    "date": "3/26/2016",
    "text": "The Italian ($24 after GST and service charge) - 3 starsThe portion is fairly small - I was surprised when it arrived with just one slice of ciabatta. It filled my stomach, but I wasn't too hungry to begin with. There was barely any buffalo mozzarella on it, but ample mushrooms and artichoke. The Italian salad that came with it fit into a tiny ramekin - one you'd use for holding ketchup or a sauce.Like I've probably mentioned in my review for the outlet at Scotts Square, I like it for the ambience. I love the quirky furniture and plush armchairs. But it's a much better brunch place at least for me. It's a bit too dark for my liking at night and almost all the items on the menu contain poached or scrambled eggs, salads, or sandwiches, which I seldom crave for dinner. Having said that, the prices are more suited for dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "jdPu6sc5DvsQMW6LPS3Gxw": {
    "date": "5/16/2018",
    "text": "My favourite go-to place. Never leave this place dissatisfied. MUST GET THE ICED LATTE! I feel the need to take a photo/video every time as the coffee comes in little ice cubes then you pour the milk ontop. It will leave you speechless. Their menu is huge with so many options so no matter what you are in the mood for you are most likely going to find it. Their English breakfast is a nice twist to a traditional one, really nice sausage choice. The Canadian waffles are to die for. Must go!! 10/10.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5VTy_OiJqbuWvHZYDM3pw"
  },
  "Ne5_GQMF131m6MJPthvT-Q": {
    "date": "4/27/2016",
    "text": "Wild Honey is located in Scotts Square upstairs in a shopping center. It was a little tricky to find... but good things come to those who wait. :) Calling all breakfast lovers!!!! Wild Honey has a treat for you, and it's called Sweet Morning. Here is a description of the dish, \"twice cooked signature brioche French toast stuffed with grilled mango, vanilla-bean mascarpone, and hibiscus-berry compote\" ... Need I say more? This dish blew me away. It tasted even better than it sounds. Very happy I visited Wild Honey.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eyVLJ6X__WKZciUfbtgTZg",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Sweet Morning",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eyVLJ6X__WKZciUfbtgTZg/o.jpg"
      }
    ],
    "user_id": "G1BKH9U6aVmbNWlHVUfR4A"
  },
  "kPm7DjYB5sM8oVQEQ67rnQ": {
    "date": "4/24/2014",
    "text": "I've had brunch and breakfast-for-dinner here a few times, and I love the wide range of breakfast plates they have.I've had the English, Canadian, and Norwegian, and I absolutely love the English brekkie. I am very impressed by their very own baked beans that don't come out of a can, unlike most places.I wouldn't recommend the Norwegian, just because the eggs are iffy and get cold very quickly. It's sort of overpriced for just two strips of smoked salmon enveloping two eggs on very thick-cut toast. When it gets cold, the toast feels like cardboard with the weird, cold yolk/sauce on it. Canadian - not everyone loves the sweet-and-salty combination, but I do! Pancakes and bacon - yes yes yes!My pet peeve on the weekend is the excruciating waiting time for brunch, so go on a weekday for dinner, and book a place online on the webpage. Eat well, and expect to pay!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "YKb2DnPjthOOastlRPmkpw": {
    "date": "12/15/2015",
    "text": "Great range of all day breakfast available! I personally tried the Tunisan all day breakfast with a Vanilla milkshake on the side.The portion was huge considering i came straight for a lunch without breakfast I still felt sufficiently full. ;) Milkshake was great as well, it was made just nice and  not overly thick. Will definitely be coming back sometime in the not so distant future for the English all day breakfast! ;)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZqH2S5PSP-3vntQ_NOX0Zw",
        "caption": "Photo of Wild Honey - Singapore, Singapore. This was under the sweet bites.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZqH2S5PSP-3vntQ_NOX0Zw/o.jpg"
      },
      {
        "img_id": "AhWxm3ush4tPsOLomjuaZQ",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AhWxm3ush4tPsOLomjuaZQ/o.jpg"
      },
      {
        "img_id": "3d8so53T1Rg-rscVq-O61w",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Tunisan all day breakfast! ;)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3d8so53T1Rg-rscVq-O61w/o.jpg"
      }
    ],
    "user_id": "PAKDbvR7fpvHBEsH_GTQig"
  },
  "QKlPEj1-uEx75y3zcaXjwA": {
    "date": "2/17/2017",
    "text": "I can't say I'm impressed with the prices coz it really isn't cheap.  But the deserts and drinks are quite good and clever.  I just cannot wrap my head around matching the prices and menu items.   But if nothing else, the ambience is sublime!  nice get away from the heat and sit down for a cold beverage before getting onto orchard again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CUFlQ_Zcm5wZTCKaavUKcA"
  },
  "wAdS69PngYutIfD2zoI1DA": {
    "date": "11/26/2016",
    "text": "Was not impressed with this establishment. Over priced, and the food is trying to be too trendy but really it failed to please. Don't waste your money eating here. Service was a little slow, and they are unable to make small changes. I wanted eggs Benedict with bacon instead of salmon or prosciutto and wouldn't make the change. It was difficult to find as well. Limited menu.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wr9WAga_EVhFdbjXQ7oCUw",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wr9WAga_EVhFdbjXQ7oCUw/o.jpg"
      },
      {
        "img_id": "KuUhJfUwurfzvVr5nqPIPg",
        "caption": "Photo of Wild Honey - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KuUhJfUwurfzvVr5nqPIPg/o.jpg"
      }
    ],
    "user_id": "1RYuLLUSrH5XL7v10QEYsw"
  },
  "UBGLjyjbV1IHLGIkB6SjnQ": {
    "date": "1/8/2016",
    "text": "Wild Honey in Mandarin Gallery is one of these places that seems to be extremely popular with a lot of people and when I finally visit I can just not really get what all the fuss is about. The focus is on all-day breakfast and that is something I am a fan of - we were however here early in the morning as we were meeting friends who have kids waking up early. That also fits well with us believing they do not take reservations, apparently they do that now (they previously only done it at their other location but now also here)The style of the place is very much that I would expect to see in an American franchise of restaurants but at least we had comfortable seats. When I started browsing the menu I did find a  lot of things that sounded interesting. The concept of having different types of breakfast menus from around the world is a good one. I tried the English with scrambled eggs, bacon, sausages, mushrooms, breakfast potatoes, grilled tomato and brioche.It was also coming with beans but I asked if it could removed and that they could add something extra of the other things - response was that it was not possible to add anything but they would try to remove it but could not promise. Still decided to go for it and that was a mistake. Bacon was soggy, scrambled eggs felt pre-made and the mushrooms and tomatoes did not feel fresh. Sausages and brioce were however ok. Others around the table were more happy but cannot for sure say if it was a result of lower standards or better food but I will admit that the Canadian looked good.For the coffee I ordered a French press and it took forever and then it appeared on the table. My first question was how long it should still brew (when to press it down and pour into the cup) - waitress was just looking at my as if was crazy and said it does not matter and this had been standing around for a while. I tried explaining to her that coffee may taste differently depending on how long it actually is brewed but just got the response that she does not drink coffee. I tasted it and it was just so over-extracted and bitter so it was undrinkable. Had to send it back and instead asked for a cappuccino - that was actually pretty good.We also sampled some of the pastries and those were better but nothing special. In general I was not very impressed by food nor service and then taking into account it is hugely busy and prices are a bit higher than other brunch places I cannot really see any good reason to visit again unless I am dragged here with friend.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "8eLKc2GRBqWgSvZ34fD2DA": {
    "date": "12/6/2013",
    "text": "Well loved by everyone, need me say more? The food is good though I'm always pretty disappointed with their eggs benedict cos the egg yolk dont flow! :( But overall taste is good and servings are HUGE. I can never finish a set on my own.Compared to their other outlet at Scotts Square, this original outlet is a lot smaller and tables are really close. The last evening my friends and i were there, we could hear 2 guys talk about molecular science topics so passionately beside us. While we werent really entertained (sorry, molecular science isnt really our cup of tea) but we were very happy that they actually found each other having such great interest in a topic that few would really like to talk about over dinner. Isnt that sweet! :)They also have a new queue system now so you could key in the no. of pax into this tablet at the entrance of the restaurant, leave your name and contact no and you will receive a e-queue no via your HP. Instead of having to wait at the door, you can roam ard the mall till you receive the phone call when your table is available.Till the day i finish all the breakfasts on the menu, every dining experience will be an adventure!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nHPXbH8yuIFICcAiJVJ4lw",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Parisienne",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nHPXbH8yuIFICcAiJVJ4lw/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "1-QADOxXSTdKrU90BrhRlw": {
    "date": "8/23/2014",
    "text": "Food is so so only.The long black I had is very bitter and acidic. Same for the cappuccino.The poached eggs on the Portobello are over-cooked. The yolk is more or less solid and not gooey.Music is too loud, not able to hold a decent conversation at all.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tBRJFD2UGKbbbWQSWVbxng",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Cappuccino",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tBRJFD2UGKbbbWQSWVbxng/o.jpg"
      },
      {
        "img_id": "JfbyNedcD2IYUNMMZf1oog",
        "caption": "Photo of Wild Honey - Singapore, Singapore. Portobello",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JfbyNedcD2IYUNMMZf1oog/o.jpg"
      },
      {
        "img_id": "Exy7FHPAK6nYR6EbXaTrHA",
        "caption": "Photo of Wild Honey - Singapore, Singapore. English",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Exy7FHPAK6nYR6EbXaTrHA/o.jpg"
      }
    ],
    "user_id": "wH-yhddRO8Uc2e4kjwf1RA"
  }
}