{
  "Xnx39hipXh3RpkhD3DWMyw": {
    "date": "10/20/2012",
    "text": "This little restaurant is easy enough to find on Joo Chiat. Unfortunately the area and neighborhood are not my cup of tea for many reasons, none of which are relevant to this review.THe food is here is possibly one of the worst if not the worst Vietnamese eatery I have ever experienced, in Vietnam, in USA, and in Europe. The Pho broth had curry flavoring and so much MSG my tongue started to tingle aggressively and my stomach reacted negatively. The rest of the Pho was just wrong and awful; once you mess up the broth, which is the most crucial part of good Pho, the rest is easy to let go.The Bun Bo Hue (Hue-Style spicy noodle soup) was also a fail. It was bland, and the broth tasted of having been made from a pre-mixed powder, and then diluted many times over.The Bun Thit Nuong (Grilled Pork over dry noodles mixed with vegetables)- while the fish sauce was correct, the grilled pork were overcooked and chewy.The Papaya Salad: the only dish I accepted as good and edible. The payaya was fresh and the flavor was good.The service: dismissive and curt, but not much was expected given the type of place.The ambiance- a negative 10.I would not recommend paying 20$ RT cab fare to come here and eat this quality of food. I would forgive the ambiance and other aesthetic factors if the food were great. However, such is not the case. I agree with the other reviewer here; I would rather spend the airfare to fly to HCMC and enjoy proper good Vietnamese cuisine in the right venues.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXShIMAb70gxMJv3cKh7hw"
  },
  "Rbmu_VZPMv9aM1iusNQlSg": {
    "date": "9/2/2012",
    "text": "Long Phung some of the best and most authentic Vietnamese food in Singapore that I've tried. It's pretty hard to find good Vietnamese here and I was very happy to find a place that could satisfy my insatiable pho craving. The pho and spring rolls are Long Phung come pretty close to Vietnam standards. The menu covers many different regions of Vietnam, though I haven't tried many of them. Usually, the Pho Tai + Cha Gio combo works very well. Prices are very reasonable ($6 for pho!) and service is really quick. Only problem would be the crowds if you come at peak hours. Joo Chiat gets pretty congested and it can be very difficult to find parking so I would recommend coming during off peak hours if you can.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9zo-15IyloXhPeO78Myjg"
  },
  "p8N72s6_p4TiHabemDZW7Q": {
    "date": "8/29/2012",
    "text": "I have to be honest in that I am not a huge fan of Vietnamese food. I like my food to be very savoury and flavorful, and Vietnamese food usually does not fit the bill. Vietnamese food has a far more subtle flavor and its food tends to be more \"bland\" than other cuisines. However, one of my favorite Vietnamese food is the humble pho. There is just something about it that draws me to this otherwise simple dish consisting of thin rice noodles and semi-raw beef.Anyway, I found a seat fairly easily since I was here during the off peak hours, and proceeded to make my order. I ordered the pho (of course), and after about 10 or 15 minutes, the pho came. Suffice to say that I was not disappointed. The soup base was very flavorful yet was still quite light. Absolutely addictive. The beef was very tender and went very well with the rice noodles, which also had a very nice texture. The cost is quite normal for a restaurant ($10+), and for the quality of the pho alone, I would highly recommend this place. Perhaps I should try some of the other dishes next time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8wCDgVSdMwOmudeJMuHXww",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8wCDgVSdMwOmudeJMuHXww/o.jpg"
      }
    ],
    "user_id": "Wnjh_5SaxBDNZ0YUux8m1w"
  },
  "9OODIvqNR2q_rq1D2AxMKg": {
    "date": "12/13/2014",
    "text": "Defniitely the best Vietnamese food found here. Their beef pho is excellent, soup is tasty and beef is tender. Do try the spring rolls and fried quail too. Only problem is that this place is perpetually crowded and noisy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  },
  "nRZIayKXIcaL0aQ8H8oICw": {
    "date": "8/23/2012",
    "text": "Long Phung Vietnamese Restaurant is located in bustling Joo Chiat. It serves an awesome pho - which more than satisfies your Vietnamese cravings in Singapore. Parking is hard to get - especially during dinner time. My advice would be to take grab a few friends and cab there. Also good at this restaurant are their fried spring rolls. Crispy, and satisfying to bite into - the spring rolls are juicy and meaty. Price wise, this restaurant is rather affordable, though of course it can not be compared to the road side stalls that you get in Saigon or Hanoi. But hey, we're not there are we?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "yDcJsT-IhVMH6sO19V_nbg"
  },
  "a5aMda5u_PyjfNF6fuSfZw": {
    "date": "4/5/2013",
    "text": "After moving here from SF I was amazed by how difficult it has been to find good pho here in Singapore.  Long Phung's pho tai is probably the best I've had in Singapore - it's a nice hearty broth that doesn't taste like laden with MSG, with a decent portion of beef.  You'll have to decide for yourself whether it's worth the trek out for this, but I have to say it hit the spot.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9ymgI3qzaHlHO-vimNaOQg"
  },
  "eh0pA3QCEOkKNK7Sj_OtYg": {
    "date": "11/12/2016",
    "text": "the best vietnamese food i've had in singapore - but take that with a grain of salt. it's by no means the best. if you've been anywhere with good vietnamese food or you're of vietnamese origin, it'll satisfy the craving with minimal disappointment. also, i refrained from trying the usual staples, i was more interested in how their traditional family style entres faired. the good:beef stew (bo kho)fried spring rollsca kho to the ok:bo tai chanhcoconut clamspapaya saladthe bad:nothing!there's usually a long queue so be aware of that before going.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jkW6_7SIQXvJSOci2Rvy4A"
  },
  "ck42rKK_M5QSMMZIF34eqw": {
    "date": "12/29/2017",
    "text": "Never knew that there was a little Vietnam in SG??!?!? Well don't think it's official, the hotel porter put me onto Joo Chiat rd... anyways... hearing proper viet on the sidewalks and viet music coming out of some shops was kinda strange in SG. Walked passed this busy viet Restaurant and ordered myself a Pho Thai, Bun ch giò and viet coffee... size was small flavour wise I'd say the bun was on the mark however the pho was watered down and missing flavour. I don't think I'm biased but so far the benchmark is still back home. Anyways was good to wonder through another part of SG.. although a bit seedy when the sun goes down. I wasn't game to test out how good my travel insurance was so no bars with skin tight hot pants waitresses for this solo intrepid.",
    "rating": 3.0,
    "rated": {
      "useful": 9,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "-AH3YIIatfD5BuSyfTACKA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-AH3YIIatfD5BuSyfTACKA/o.jpg"
      },
      {
        "img_id": "dSmIrwDwTz3Sl5-W-arR-Q",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dSmIrwDwTz3Sl5-W-arR-Q/o.jpg"
      },
      {
        "img_id": "YsOKicINLIKDj9lSqmVKJg",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YsOKicINLIKDj9lSqmVKJg/o.jpg"
      }
    ],
    "user_id": "7Uw_HoXXi6pi1pTsVK4yfQ"
  },
  "Yjh2IJ_nd3n5mLinEE18SA": {
    "date": "5/28/2016",
    "text": "They (Viet cuisine) are all over Singapore. But I remember this particular one from some time back. It was and still my favorite. Get the Pho and spring rolls. Best in the world. Go early so that you don't need to wait that long. There are a few other placed selling Viet food on the same street but Long Phung wins them all.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZGKLX_Cu-hqr5bdMEOI65g",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZGKLX_Cu-hqr5bdMEOI65g/o.jpg"
      },
      {
        "img_id": "Zl_8qI8Kp3KiF0cEVtMVEg",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zl_8qI8Kp3KiF0cEVtMVEg/o.jpg"
      },
      {
        "img_id": "4FOSfEq-JeOZadZKjoWL5w",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4FOSfEq-JeOZadZKjoWL5w/o.jpg"
      }
    ],
    "user_id": "MNQRoT1t4Yh5nqBZMmw7Lg"
  },
  "PjO7IdFSRsR9x-GVQiiPZg": {
    "date": "12/18/2015",
    "text": "After reading all the reviews on Yelp, I had to try out this place as part of my quest to find the best Pho & Bun Bo Hue in Singapore so I decided to take the trip to see if this could be THE ONE. I say trip because this is quite out of my way and it is not easy to reach by MRT.I arrived 10 mins before opening time and there were already people waiting outside which I took as a good sign, especially as there are a few other Vietnamese joints in the same street and this was the only one which had people waiting.I had the Papaya smoothie and the Pho Dac Biet (special beef noodle soup). The smoothie was served almost instantly and was a pleasant surprise: it was not to sweet or heavy, it was refreshing and fruity. The Pho also hit the right spots: the broth was clear and flavorful, the beef perfectly done and there was a nice balance of herbs and beansprouts. As others commented, the addition of the raw egg makes it extra special.  But if I have to be super critical (and I am as I trying to find the prefect bowl of Pho): the noodles were a tad too mushy for me, I prefer them chewy and I felt really thirsty afterwards so I am guessing it is high on msg. So is the search for the best Pho over? No but, maybe I am nitpicking here and the fact that I wish that this place was better accessible for me says enough. This is by far the best Pho I had in Singapore and I am definitely going back to see if the Bun Bo Hue meets the same standard.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cyPuCythLJ6OXf53J1jMSg",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. The menu outside the restaurant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cyPuCythLJ6OXf53J1jMSg/o.jpg"
      },
      {
        "img_id": "wXcogVq77mvdGcji2MF_aQ",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Pho biet",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wXcogVq77mvdGcji2MF_aQ/o.jpg"
      },
      {
        "img_id": "ZT7TTj0uu6G4e6eEcUSgZA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Condiments, the yellow bottle is lemon juice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZT7TTj0uu6G4e6eEcUSgZA/o.jpg"
      }
    ],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "uG7_KUgWhcPt77vt7KSPXw": {
    "date": "7/29/2016",
    "text": "What I tried: - Special Noodle Soup Pho Dac Biet. The noodles were overcooked for my liking. Broth was good. I appreciate the basil and herbs inside the soup. There was an egg which surprised me. - Vietnamese fried spring rolls. Crispy. Not too oily. There was bottom of the provided lettuce and basil under that looked like it's been too aged (spoiled)...black :( so I could properly wrap them with the lettuce like I usually would. Overall, it was okay. I went after the usual lunch rush so there wasn't a long queue which was nice. I don't think I'd go all the way here just for the pho or spring rolls. And if I were back in the area I'd try some of the other places first. Tip: cash only Tip: other people had rice dishes. There were also people who came in for take-away so that's good too.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NilWbkK0BP3q0kfj-bEubQ",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NilWbkK0BP3q0kfj-bEubQ/o.jpg"
      },
      {
        "img_id": "L1TtdLBEyo68g50pzPDywQ",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L1TtdLBEyo68g50pzPDywQ/o.jpg"
      },
      {
        "img_id": "B-5WjK6CCnEqnqti8w2VDA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B-5WjK6CCnEqnqti8w2VDA/o.jpg"
      }
    ],
    "user_id": "11R2R4nyRpF6nqlXH-JeGQ"
  },
  "orweag0w_e8AtDOiIbqUjQ": {
    "date": "11/18/2015",
    "text": "Finally got around to trying this place after many recommendations and drooling over people's Instagram pictures. Not the most convenient location but that's because I don't take buses so it's quite the trek from the mrt. There was a Q when we arrived but the turnaround is extremely quick so we only waited a few minutes to get a table. That being said, they do try and cram in as many tables as possible so be ready to get cozy with your neighbors.The fried spring rolls were just like the ones I remember from Vietnam! Not the typical solid egg roll wrappers but a really light, crispy, mesh outter layer. Hard to describe but just try them. You can order them in 4 or 6 pieces. For my main I ordered the pho nam. The broth was very flavorful and I love it when you get all the fresh basil and lime in there. The amount of beef in the bowl was also quite generous so plenty to share.Left full and happy but there's at least a handful of other items on the menu that I want to try so I'll definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "6j_3PukRlHa9NJfSVgEbiw",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Pho nam",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6j_3PukRlHa9NJfSVgEbiw/o.jpg"
      }
    ],
    "user_id": "xrSN2MkJwqmpYl7dAAGSDw"
  },
  "8RUbLAtDakpQf76iGz2hyg": {
    "date": "2/1/2016",
    "text": "Great value for the food. And extremely delicious too! Just be aware that you'll have to wait during peak lunch and dinner hours. Very simple service and they speak Mandarin for better understanding. Call their business number: 64406959 to order take-outs in advance.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3xNRWpcitCox2w8qFqZwoA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Shop front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3xNRWpcitCox2w8qFqZwoA/o.jpg"
      }
    ],
    "user_id": "MmJ-gKRi3hRzBlVqEUEkOg"
  },
  "mDMxPEkHf5MIltiEdMnfYg": {
    "date": "12/25/2014",
    "text": "Told my friend about the experience I had with other Yelp buddies here after the 3rd Elite event for 2014 and after some online searches on what's good, we decided to come here.The first time I tried here was the beef special pho. Like Miguel had commented earlier, the broth is flavorful but the egg made the first taste of the broth transformed. Was much better than some places that offers pho but was not really wowed as I did have experienced many of different pho places while I was in L.A. My friend ordered this on the second round during tea time (2.30+pm) and I tried the soup base. Was much better than the first time consuming it and the meat varieties as well as its portion seemed more. Was it because of the busy-ness in the store or..? Second time I came I ordered Bbq pork and fried spring rolls with dry vermicelli noodles. I love the fried spring rolls. Was given one piece of it that cut into 4 slices. Gave my friend one to try and she also agreed on how crunchy and flavorful the meat inside the fried spring roll. Should have ordered this more for appetizer.I also ordered the strawberry smoothie. Been craving more fruity and milky drinks. It was really good blend of milk and strawberry. Price wise it was on the affordable range.We were served pretty fast and for the payment, it was less than what we expected it to be with no additional gst/tips. Will drop by here again when I am around this area :)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8yHh4V0FJtnVB3jWq03KGA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Bbq pork and spring rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8yHh4V0FJtnVB3jWq03KGA/o.jpg"
      },
      {
        "img_id": "xyakC0h3WPOJpwNE7h5XZQ",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Strawberry smoothie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xyakC0h3WPOJpwNE7h5XZQ/o.jpg"
      }
    ],
    "user_id": "Qr-WoW6Vye4aH3I-YZ2ZyQ"
  },
  "fYc5mhuyJ-JV7HBWqkkG0w": {
    "date": "11/23/2015",
    "text": "Long Phung has all the makings of a great gritty restaurant - the kind you'd go with a few friends for a no-nonsense authentic meal and chug some Asian beer. Kind of like Supper Inn or one of the ubiquitous Vietnamese  joints along Victoria St in Melbourne. Or Diandin Leluk at Golden Mile. I'm a fan of their grilled quail (truly the perfect finger-licking beer food), Bun Thit Nuong (vermicelli with grilled pork), and Bun Mang Vit (duck and bamboo shoot noodle soup). The pho here is good too - but always triggers a violent MSG aversion in me (for pho I'd go to Nam Nam). Rice paper rolls are worth a mention too (mmm with that umami hoisin-peanutty sauce). To be honest the food here isn't over-the-moon fantastic - but it's definitely the place to hit when a craving for Vietnamese food comes calling. Frankly I'd rather get in line here than eat at the bleah alternatives that seem to be popping up in all malls. Oh and needless to say you can't leave without having an iced coffee!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-DPyJgX9hXNk_RJc3kcCHg"
  },
  "ydPrto41O4U9Q-JEpkgIGg": {
    "date": "12/20/2014",
    "text": "Many consider Long Phung among the best Vietnamese restaurants in Singapore. Personally, I wouldn't go that far. However, the Pho is simply incredible. The inclusion of Raw egg as one of the Pho ingredients is a great touch. The broth is flavourful, a perfect balance between onion and the great Vietnamese greens that Pho is so known for. The beef slices were no different, delivering the moistness that Pho lovers crave for.The seafood fried rice was ok... My wife, on the other hand, ordered the Spring roll over rice noodle. I took one bite and thought it was good, but not as good as my go to Vietnamese restaurant in Orchard Towers.Overall, a fantastic Vietnamese Restaurant on Joo Chiat that delivers the goods with its Awesome Pho! The ambience is a little run down, but hey, that's how you know the food is good! :D",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sYGMBvCfaRptP8tY5ctDww",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Seafood Fried Rice!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sYGMBvCfaRptP8tY5ctDww/o.jpg"
      },
      {
        "img_id": "w-xm0pWC1KYYnHsuXUSosA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Special Beef Pho!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w-xm0pWC1KYYnHsuXUSosA/o.jpg"
      }
    ],
    "user_id": "anrZv1OM1a2sC_EfZ8mt-Q"
  },
  "yKHcqOlMC78ejb5xbFGirg": {
    "date": "9/13/2013",
    "text": "If you are ready to brave the \"colorful\" late night crowd in Joo Chiat, you should come here.The wait can be long but they are also opened till late, so you should tier your visit if you do not want to wait too long.My favorite dish there is actually the quail. The quail is small but i love the marinate. Savory and tasty, and since it is a small bird with minimal meat, you can order it as a side and not feel stuffed. The pho while not the best I've had, is tasty enough. Though I do think there is a fair bit of MSG in the broth as i was so thirsty after my meal. They are also one of the rare Vietnamese places in Singapore that serves dry rice noodles with grilled meats. Drizzle the fish sauce over it and it is easily one of the yummiest noodle dish you can have on a hot day.Price is very reasonable, ok, they are cheap. If you are planning to come with young kids and family, I would suggest to avoid the late night crowd streaming from the nearby KTV lounges and bars.Otherwise, we will be back! Can't wait to get my fingers around some quails!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "asDXGvNGRFygHKu3xGbufA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Quail!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/asDXGvNGRFygHKu3xGbufA/o.jpg"
      },
      {
        "img_id": "GscWAo0S-_jofe3xoRYrKA",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Rare beef slices pho",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GscWAo0S-_jofe3xoRYrKA/o.jpg"
      },
      {
        "img_id": "34CilQOP3dfrm1cTHp_JSw",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Grilled pork with rice vermicelli and a spring roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/34CilQOP3dfrm1cTHp_JSw/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "_S9D3d9mN4ekOhzvEVumeQ": {
    "date": "7/11/2015",
    "text": "As an American who was told that Singapore doesn't have very good Vietnamese food, the pho here put the best pho in Houston to shame! And Houston has a huge Vietnamese community! The pawn spring rolls were delicious as was the well done brisket pho. The bottled Tiger beer is enormous and decently priced. My fiance and I went at 11 am on a Sunday and there was no line. Our food arrived very quickly. If there wasn't so much amazing food to try here, we'd definitely return!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VwZVkC_RfbEyPFdlItmDvQ",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore. Well done brisket pho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VwZVkC_RfbEyPFdlItmDvQ/o.jpg"
      }
    ],
    "user_id": "XiWs_mmMgyylcFwO4hSDfg"
  },
  "Xg28aP3-CBC6ljyU5lrkVw": {
    "date": "2/4/2016",
    "text": "Been here a couple of times and their standards are dropping.Ordered the calamari dish for 13SGD and what was plated is best described as an onion dish. The photograph in the menu had no onions.Complained, but the staff says there is nothing they can do since \"the boss isn't around\".I live nearby and I can honestly say the Vietnamese places on either side of this tourist trap offers just as good food, more authentically. Their only issue is that are not as busy and not used to tourists.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLx-i8ZjK_2P9XKn_HysDg"
  },
  "xIN7u4nQ1lKescZvVNmjbg": {
    "date": "5/24/2014",
    "text": "Long line but worth the wait. One of the best Vietnamese restaurant in Singapore. Pho, spring rolls, prawn rolls, pork cutlet with rice all delicious ! For the more adventurous you can try the fried quails or cockles !Suggest go for lunch or early dinner for those that have children.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vFWC-VP33d2VnC0UW67Raw",
        "caption": "Photo of Long Phung Vietnamese Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vFWC-VP33d2VnC0UW67Raw/o.jpg"
      }
    ],
    "user_id": "PEbqvW6J8xcRyhrAE-yhKw"
  },
  "K6Sn2YWxwy5NdyXtyXst_w": {
    "date": "2/20/2016",
    "text": "Brusque service aside, Long Phung serves up the best pho in Singapore, and short of flying to Hanoi every other week to get my pho-fix, the little spot will have to do as the best alternative for Vietnamese cuisine in Singapore.We loved:1) Cha Gio ($7) with 3 parts minced vegetables, 1 part minced pork, exactly the way it's done in Vietnam: Juicy and flavourful, this had a beautifully crisp rice paper skin.2) Ga Vien Chien ($10): succulent morsels of Vietnamese-styled popcorn chicken3) Bun Bo Hue ($7.50): a Hue-specialty of beef brisket hunks, pork leg sausage slices, in a heady deceptively fiery broth that balances the spicy with the salty and sweet, enlivened by a hint of lemongrass4) Pho Ga ($7): pure wholesome goodness, with generous lashings of shredded chicken, and a deliciously delicate chicken stock. So good even if marred by spring onions.5) Bun Thit Nuong ($7.50): dry-styled noodles topped with the most lusciously grilled pork ever, redolent of lemongrass, and served with a fish sauce-based dip.6) Com Trang Bo Kho ($7): sumptuous French-influenced beef stew, with fork-tender brisket swimming in a mildly spicy gravy",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tieQ1FQ3BdXO7PjShPE28g"
  },
  "Vgx0wO8foBCk6ZFMOcZ3oA": {
    "date": "5/27/2013",
    "text": "Honestly, you don't go to Joo Chiat to expect a classy ambience. It's a red-light district, for crying out loud.My best friend in college was Viet-American and we spent many, many meals at Viet restaurants. I have consequently learned to order in pitch-perfect Vietnamese. This place has excellent food at VERY decent prices. The clientele leaves much to be desired and I only say this from a hygiene standpoint - may want to consider using disposables? Atmosphere-wise, it is lively and entertaining. Easily the best pho in Singapore I have had yet, and at half the price than what I pay for pho at Viet Inn at Circular Rd.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "qc8-DYXrOqvnW8vK3YfZow"
  },
  "RP2M5V4rKGWfKASnfcc5UQ": {
    "date": "11/5/2012",
    "text": "The good:  The Pho!  Best in Singapore when you take into consideration bang for your buck.  There might be one or two better, but you're selling a kidney for a traditionally simple and inexpensive dish.  So if you hate selling kidneys, this is your place.     The bad:  Not near public transportation and the atmosphere is Orchard Towerish.  That's not totally bad, as it's fantastic people watching. Other items on the menu are just ok, so stick with the Pho.  The ugly:  Nothing gets my goat more than people claiming something is or isn't authentic.  Oh you visited Vietnam so you're an expert on Pho?  You don't say, get out of town!  I visited Vietnam too and let me tell you something; there is some good food and some bad food, just like everywhere else in the world.  Just because it's a Vietnamese dish served in Vietnam doesn't mean it's delicious.  I'll take tasty over authentic any day of the week.  Personally speaking, this place has a great balance of both and if you don't believe me just ask the Vietnamese girls who frequent there.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gyBH_pVycVOnjikFVXuBQ"
  },
  "YfRaoAyZm9syPkTY7LtDiw": {
    "date": "8/10/2012",
    "text": "Oh dear, I have given this place so so many chances. Having traveled extensively through Vietnam on at least 10 occasions, and having been spoilt by the quality of Viet food in Melbourne, it is only natural that I constantly crave my favorite cuisine here in Singapore. Unfortunately Singapore has very poor offerings when it comes to finding quality Vietnamese food. A couple of years ago I read and heard a few good things about this place so decided to give it a go.  The selection of food here is a mishmash of dishes from different regions. Bun bo Hue, is rather diluted and unbalanced, as too their pho. A good bowl of Vietnamese soup you should be able to taste a soul in these sort of dishes, the love and effort that goes in the many hours of careful simmering and skimming these soups, you don't feel any of that coming through in the finished product. Have attempted giving other items a go on numerous visits, though I've given up!, spend $90 on flights plus $20 for a night in Ho Chi Minh and you have your cravings satisfied while spending less than you would on a night out on the town in Singapore... that's what I've done anyway.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QZqj0zcaOXV63mVVVLAhhQ"
  },
  "bnJCpCg3XJE5L9PYzy9tLg": {
    "date": "7/28/2012",
    "text": "After coming back from Vietnam in January, I was so in love in the food that i immediately decided to look at a vietnamese food fix in Singapore. Most people pointed me to this place, and in this case, most people are right. Im not a huge fan of Pho, But this place does it pretty well. But the noodle dish which i really love is Bun Bu Hue, which is a beef, pork noodle broth from the Hue Vietnam. I would say this place does it really really well. Its not as good as what I had there, but close enough. The other dish which i was very impressed with was the fried chicken feet. Ive never had something like that in Vietnam, but it was delicious nonetheless. Decent springrolls and coffee as well.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CmDQrAExEkqwqni0e_WEIw"
  },
  "drAKrPHch7jeewGLUcPE8g": {
    "date": "3/13/2013",
    "text": "I think people are being a bit hard on this place. Been here a few times now and always order pho. And as far as the pho goes this is one of the best ones in Singapore I've had. I did make the mistake of coming by the place on a Saturday night once. The line was 30-40 deep. Since it's a small place I didn't wait. This makes me think though that they're struggling to keep up with demand and may be watering down the soup (inexcusable, I agree) when it's busy.I try to go in the afternoon when I can on a weekday. Less crowded. I like the cha giò here too. The cockles with garlic are also really popular (haven't tried). And they make a yummy mango smoothie shake thing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "answ6V84iLiZSHxTlv87Hg"
  }
}