{
  "KHjLs8Z4K3lLPNtFgPMdyQ": {
    "date": "7/23/2018",
    "text": "Really great service in a good location! The lack of a 5 Star review was due to the seating situation (which probably can't be changed much now) being very uncomfortable; wooden benches too small for the American butt. The wings had a great flavor and everything was reasonably priced. I felt like I was back in Dublin.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nl2S4os0yWEgk3Zz_61eYw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nl2S4os0yWEgk3Zz_61eYw/o.jpg"
      }
    ],
    "user_id": "mvZ-0LSANPyj-Sgxlk1rzA"
  },
  "G7I1d8lldeefbCzAJ2--WQ": {
    "date": "11/23/2017",
    "text": "Popped in here with a friend for thanksgiving!Service is in a bar slash Resturant. The noise level can get high at times.The service is normal and friendly.The drink menu is quite large for those finicky drinkers.Tried the tenderloin steak cubes as an appetizer.The steak was tender and juicy. But the kicker for awesome plate was the blue cheese sauce for the cubes.I ordered a misc salad plate with roast beef, cheese and greens, with a serving of fresh soft bread. Again a great mix good ingredients, and fresh veggies.For the main course I ordered the Connemara chicken. This came with fresh mash potatoes and cucumber and green beans.The drinks are a bit pricey is the only downside.Overall the meal was comfortable and very satisfying!! I look to coming here again for the tenderloin cubes.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Zu8ztejKQnugvDN2rADSZg",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zu8ztejKQnugvDN2rADSZg/o.jpg"
      },
      {
        "img_id": "6NT5dsd56f6IV_Y_7Ef97g",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6NT5dsd56f6IV_Y_7Ef97g/o.jpg"
      },
      {
        "img_id": "y8TcLCK9vnuONbncbqh8xw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y8TcLCK9vnuONbncbqh8xw/o.jpg"
      }
    ],
    "user_id": "Dy21CGlNTRyL8GfVAwOy-w"
  },
  "yDq2zXlFYU13CsfmYk6r7g": {
    "date": "9/19/2017",
    "text": "Hidden GEM off Orchard Avenue near the Hilton Singapore.  They have EXCELLENT Live Music.  We were there for a classic rock band, and they were FANTASTIC!  Clapton to CCR, they were GREAT!  The atmosphere is FUN, but it is LOUD inside.  The drawback outside is the cigar smoke, and the service is slower because they do not staff the outside to meet the crowd.We did not try the food, although the food selection seemed to be typical English/Irish fare.  The beer selection is SOLID.  I enjoyed a Guiness, and it was GOOD.  I have had better Guiness at other Irish Pubs around the world where they take GREAT care and pride to make sure the beer is stored and served properly making the \"Guiness Experience\" delicious and cold.  NOT AT ALL impressed with the Black and Tan pour that my friend had... NO separation AT ALL.  They obviously do not know how to pour the PROPER Black and Tan.Overall, I rate it as FUN (because of the EXCELLENT live music) and GOOD.  This is a SWING BY if NEARBY.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nexOyik2Fn-P4-uaQ1At4A",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore. Taken from inside the Mall.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nexOyik2Fn-P4-uaQ1At4A/o.jpg"
      }
    ],
    "user_id": "kQcC5sfMe9TlmmPcvuiImg"
  },
  "4qCSdEHFN-zkVctQNDsiVg": {
    "date": "10/20/2017",
    "text": "Hit Muddy Murphy's on a Friday night for dinner and a pint. Saw a special, Kilkenny pint + mini-fish and chips for $25...SOLD. The mini-order was more than I could finish and tasted great. I would repeat for the fish and chips anyday. Another positive...staff talked me into another pint about 10 minutes before happy hour ended which was a nice gesture as they told me I'd save $2 off the pint. Nice atmosphere, great Irish pub in Singapore!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gu_V4G0x3JFBiUOAkMUUUw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gu_V4G0x3JFBiUOAkMUUUw/o.jpg"
      }
    ],
    "user_id": "zftgDC6ecAdXeCD-wSztRA"
  },
  "w-ANHt42pfj8KDVp8Zkd0A": {
    "date": "9/24/2018",
    "text": "One of the best bars in Singapore. You can get an excellent Guinness or Kilkenny pour, with all the best live sporting events. Orchard Towers mythical 4 floors is right across the street, too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a3WUf5t3fJxtUUreYuL1OA"
  },
  "OlmGia5eRvIPYEMNla3sTg": {
    "date": "9/6/2016",
    "text": "Casual bar / dining atmosphere. They have Happy Hours (note the plural) from 11am -7.30pm daily, with a good range of draft beers / cider on tap and house wines on offer. Just be careful when starting a tab as they may overcalculate your drinks once Happy Hours ends. Had a group buy us 2 rounds of drinks after HHs ended, and were charged for drinks we didn't buy.. Easier to pay at each round than argue with the waitresses at then end of the night!Food and drinks are a reasonable priced for Singapore - though HHs on draught drinks are only about $2SGD cheaper than during non-HHs..Staff are nice and friendly and super helpful. If you want free wifi, just ask for the wifi password",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IvMANTzciSaBTY6miZ7FFg",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore. Muddy Murphy's",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IvMANTzciSaBTY6miZ7FFg/o.jpg"
      },
      {
        "img_id": "cHcIaWJmHXAfLN1LAwcwkw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore. Half of the drinks menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cHcIaWJmHXAfLN1LAwcwkw/o.jpg"
      },
      {
        "img_id": "DeY2rCWZdlHFP2ox6Ahplw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore. The 'beer garden'",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DeY2rCWZdlHFP2ox6Ahplw/o.jpg"
      }
    ],
    "user_id": "HaUW4eEQF4NzughbBHs6hA"
  },
  "KQzxh6JsyOUSx6uPR8_adg": {
    "date": "6/10/2018",
    "text": "Typical Irish pub. Great fish and chips. Cold beer with televisions all over. Perfect for a cold one on a humid Singapore afternoon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "No1TF-5GT5GraYjDCR6qkg"
  },
  "k-pvtdwcB6oOQHfNne2AmQ": {
    "date": "3/18/2018",
    "text": "Pretty cool atmosphere with live music. It does get very loud inside the pub!  Had a few Guinness pints and they all seemed off, not sure what the flavor really was but it was off and had a very different taste to it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrrEMxvYUfjegvrcRLb-iw"
  },
  "m4Z2KwkDYN9Yx2aFRVf53A": {
    "date": "9/17/2016",
    "text": "Really a nice place to chill and hang. Beer is good. Atmosphere nice and relax. Bar food ain't bad either. No frills ;)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fkmBELhe7FOs41yS2nFpIA",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fkmBELhe7FOs41yS2nFpIA/o.jpg"
      }
    ],
    "user_id": "CUFlQ_Zcm5wZTCKaavUKcA"
  },
  "3DvAU6aCefRDBasbWQmm-w": {
    "date": "3/18/2016",
    "text": "How does this place get 4 stars?Anyway, it's an Irish pub. And a can of coke is $7 - sorry, I should say \"seven focking dollars!!!!\"That's right. $7 for a can of coke. Did I mention that a can of coke was $7?Food is acceptable (barely), and they have a decent lunchtime meal of $9 nett or $12 nett with a drink. Service is friendly and they try their best. But SERIOUSLY?? $7 for a can of coke???",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "KSDUYQJxzfRHFjxHi8Iwqg": {
    "date": "4/14/2015",
    "text": "This Irish pub is in the back of the building if you enter from Penang Rd.  Very friendly and attentive people work here!  The lady serving beer gladly had conversation with me drinking guinness alone at the bar counter.  Perfect air conditioning.  My stomach didn't have space to try their food, but they looked good!!  Their free wifi worked perfect too.  Will definitely return when I visit Singapore again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "3lcqf74s4fKFlNVjVK0-Mw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3lcqf74s4fKFlNVjVK0-Mw/o.jpg"
      },
      {
        "img_id": "XaW9QIfBIaoBJVhqDs6yTw",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XaW9QIfBIaoBJVhqDs6yTw/o.jpg"
      },
      {
        "img_id": "hf87lJvvGz7icoP1nlIfvA",
        "caption": "Photo of Muddy Murphy's - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hf87lJvvGz7icoP1nlIfvA/o.jpg"
      }
    ],
    "user_id": "xi0a_UCE0R5WvelRiSLapg"
  },
  "dW0eXinNKTGvQdJpfR_-fA": {
    "date": "11/30/2013",
    "text": "Went back to the new Muddy's after it was relocated from the back of the Orchard hotel to triple 1 Somerset. Same great staff. Same great service. Same great drink choice. Same great food. Given that it is no longer in a basement it is much brighter than before. Staff were working very hard to get some of the bugs ironed out caused by the quick move but they have the same good humored attention to service and detail that they always had. Blows the doors of the poor level of service at the Penny Black.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "i2G5mQrL1g_wgSuL8DGExQ"
  },
  "xYDHgrf6m7X3M-3s-D_69g": {
    "date": "10/22/2012",
    "text": "This place has not changed in a decade - and why should it? Consistently a great place to hang out for a late Sunday lunch, a welcoming bar staff and comfortable chairs and tables to relax. Firstly, the beers are not at extortionate prices - Guinness and Kilkenny @ $12/ pint, Archipelago Red Ale @ $11.50. These prices include GST - something I wished bars and restaurants were forced to include in their menu prices.My friend ordered the 2 course Sunday roast ($20) which included roast beef, mashed potatoes, some other vegetables, Yorkshire pudding and gravy. I had a slice of the beef, and it was fantastic. I ordered the fish and chips ($16) and as others have said here - it is fantastic, the fish is fresh and the chips taste like they are homemade.Overall, if you want to while away a lazy Sunday afternoon, stop here for a bit and recharge your batteries. The prices are very reasonable, the food is excellent and it is just a nice place to hang out.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyiSA0yxVGN8zSRaYHoyMA"
  },
  "1ijPvaJl044A-I3OTpOORQ": {
    "date": "1/27/2015",
    "text": "Great place to chill after work and or for a Sunday mid day beer.. But theres really nothing spectacular about the food nor drinks.. So if I wasn't staying close by.. It would not be a place I'd suggest to go.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FMJwK8eGYVg2l7px8fJZTw"
  },
  "XRidQojGYRZX82LOwiXZpA": {
    "date": "12/20/2012",
    "text": "Guess this is as typical as you can get for a pub.Non-pretentious, never really busy till you can't get a seat (except maybe at st Patrick's)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "nCZDItj6yWnv83r0xUM0Tw": {
    "date": "6/29/2014",
    "text": "In Singapore for a conference and have been eating rich, expensive meals, so I decided I wanted a beer and burger. Muddy Murphy's was within reasonable walking distance of my hotel, and it had pretty good reviews, so I decided to try it. I ordered a Guinness and a beef burger. Service was a little slow, but competent. The beer was cold and about what expected. The burger was ok - had a bit of gristle - the French fries were good and an adequate amount. Overall it was a good experience and I'd go back. (PS. It was a Sunday PM so they had a \"live\" group playing rock & roll - a plus?)",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zL8oLzXMVg0ywbjlgK_3cQ"
  }
}