{
  "kwW3hrVwtKogEhvzONkJdw": {
    "date": "9/25/2018",
    "text": "We found this restaurant on the Lonely Planet guidebook.  Interesting restaurant with red plastic tables, chairs, bowls, chopsticks and soup spoons.We ordered the the Fish Head Soup.  We had the Grouper.  The fish was excellent and the broth was fantastic.The Bitter Melon with Salted was a great food find. Tasty, crispy and delicious.We also have the Hokkien mee (noodles).  Not sure how Hokkien meeting should taste like - I'll reserve judgement when I have more experience ( Ie. eat more)The server suggested that we try their Porkchop and Spring Rolls.  We declined since we were trying to limit our intake of deep fried food.  I'm guessing that the 2 items we declined to order could be delicious given how delicious the Salt Egg Bitter Mellon tasted.I highly recommend Nan Hwa Chong for a novel (for non SE Asians or non Chinese) visiting Singapore.Service was fast, friendly and efficient.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "9kmkQVKOmlSEjvLngq-LJg": {
    "date": "8/23/2018",
    "text": "Our list of Fish Steamboat places are limited till we explored another place here in North Bridge Road. Nan Hwa Chong Fish Head Steamboat Corner adopt the use of charcoal instead of the ususal gas can operated steamboat pot. It is said that the use of charcoal to fire up the broth gave a smoky flavour and an even heat distribution to the broth itself.Location is rather prominent as it is located at the traffic junction. However, one thing that one might be worrying if driving would be the parking spaces.Not long after we settled down, we notice the constant stream of patrons walking into the shop. Everyone who walks in were promptly attended by the server. Most who came in had already made reservation via phone call before hand and they were directed to the air conditioned corner of Nan Hwa Chong.Seeing this station as the toughest job of all standing in front of the flames ensuring that the charcoal are evenly burn and stuffing them into the every steamboat that comes out from the kitchen.Supposed to be their recommended egg dish, however we got it served with the middle part burnt. Nevertheless the texture still remains fluffy and taste ordinary with a handful of oysters.The plate of stirred fried broccoli is my kind of home cook dishes. The light taste of broccoli greens is cooked with carrots, ginger and button mushrooms with minced garlic.We had chosen the grouper fishboat. The grouper fish comes from the sea-bass family.It is low in fat and cholesterol with firm texture and mild flavour. A healthy choice that does not compromise in taste. Three other types of fish offered will be Pomfret, Song Fish Head and Snapper Fish.Grouper Fish Medium Pot - $35Ingredients include fish, vegetables, seaweed, fried taro, flat fish, white cabbage and grouper fish. Soup is rich and sweet.While the cloudy soup may be made up by the yam, unlike other places they were done by adding milk to it. If you are wondering about the familiar taste in the stock, its the generous portions of flat fish added to the soup that gave a different taste to it.Not only that the fried yam added had also elevated the soup taste.Simply love dabbing the fish meat into this sweet sour and spicy chilli.If you love traditional fish steamboat with charcoal, Nan Hwa Chong Fish-Head is a very good choice. Not only that, they do have a variety of Cze Char Dishes in the menu for selection too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zs6NdOdGT0xhOAx_xycthw",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zs6NdOdGT0xhOAx_xycthw/o.jpg"
      },
      {
        "img_id": "3h2AbMLZAQtMVwyT8sQP_A",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3h2AbMLZAQtMVwyT8sQP_A/o.jpg"
      },
      {
        "img_id": "fcHoNmzUBzS4HnH1bt32UQ",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fcHoNmzUBzS4HnH1bt32UQ/o.jpg"
      }
    ],
    "user_id": "w91OgyE6GjOuZ_MtBk21uw"
  },
  "50o4ZZGeihwDc0mufJ9rpA": {
    "date": "7/28/2018",
    "text": "Good business here... call in advance for call confirmed table in AC dining hall. 1st time here.... overall they do serve a reasonable food here. Fish soup is good, but I hope more taro in the pot.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zpOQ69hXIn9i9Iu0pHTpJA",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zpOQ69hXIn9i9Iu0pHTpJA/o.jpg"
      },
      {
        "img_id": "CkFKuWpEzIkbfAuk4X7Hxw",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CkFKuWpEzIkbfAuk4X7Hxw/o.jpg"
      },
      {
        "img_id": "oT1WK2l0EmaearJDQDxe_w",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oT1WK2l0EmaearJDQDxe_w/o.jpg"
      }
    ],
    "user_id": "2T0fllpf1mYNg56YWkCtgg"
  },
  "xf_NHEloNxD6NaXNcZ_uJw": {
    "date": "6/8/2017",
    "text": "Good stuff, quite hard to find charcoal steamboats these days. Generous portion of fish, tasty with quite a lot of flesh. Soup base was really good as well, and I really liked the ingredients, especially the yam.We also tried the homemade beancurd, with chilli sauce, amazing. Really the only negative is that the drinks aren't made in-house. Service was prompt and prices decent, about $30 per pax. Will be back if I'm in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "9bOYce33_dHq9pZgTdVoAQ": {
    "date": "5/28/2018",
    "text": "Old fashioned charcoal hot pot fish soup. Easy to digest and always a favorite. The stir fry vegetables and shrimp omelette are good side dishes.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfkCssuzXAOEMeAM4kOLVA"
  },
  "8Zfb5vQEsdZh4QEjIpd9Hw": {
    "date": "8/25/2014",
    "text": "Amazing!!!It is at the corner of our hotel's street. It is packed when we got back during some late nights and also occupied the street around 6ish.Every table enjoys the steamboat (usually we tend to call it hot pot). The must-have pot is a steamed soup of fish, veggie, pickled Chinese cabbage, salted fish and seaweed. All the freshest.Singaporean cuisine is renowned for its satay, laksa, Hainanese chicken, chilli crab which all featured greasy. But hands down for this simple, pure, soul, comfort fish soup!! More than just a break from the spicy food, but truly get to taste the MSG free delicacy. The snacks are also local, stand out from the Hawcker Centres. Large portions and very reasonable price. The locals knows the best.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "WM9CCuRBIyDFmDnCVC3puw",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WM9CCuRBIyDFmDnCVC3puw/o.jpg"
      },
      {
        "img_id": "t-EJkAdhUdIoEsy-8xgTig",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t-EJkAdhUdIoEsy-8xgTig/o.jpg"
      },
      {
        "img_id": "nH-ew5ATOF46rwLyZ9HM2g",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nH-ew5ATOF46rwLyZ9HM2g/o.jpg"
      }
    ],
    "user_id": "Z0hVdBxyuWuMiPcBDj2tEg"
  },
  "XJZGO_uGOAV9ZUw5dpx0Hg": {
    "date": "10/30/2014",
    "text": "This is one of the best \"old school\" charcoal style steamboats that you HAVE to try if you enjoy fish based charcoal steamboat.They sell many other oh-so-yummy sze-char dishes too even if you don't feel like steamboat.They get VERY crowded around dinner time especially on weekends from 6pm - 10pm. They did however take over the unit beside them and have a small air-conditioned area.Parking seems to be quite the problem here though like others have mentioned so do take note about that or just park further away and be prepared to walk a bit. Oh and they do close quite late! Most of the staff seem to speak Chinese with very little english so communication may be a slight problem if you don't speak the language. Maybe to avoid grumpy staff scolding you when they're busy, come for supper when it's less crowded? Haha.. it does get pretty hectic during dinner time! However, if you're a foodie, its definitely one of the \"must try\" steamboat places to visit to take your taste palette down memory lane. :)Things I normally order and enjoy - Grouper Fish Steamboat and Salted Egg Pork Ribs!4.0 Stars",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "S0w2Rd5x0nJxGGVyPZ8NiA",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore. Salted egg pork Ribs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S0w2Rd5x0nJxGGVyPZ8NiA/o.jpg"
      },
      {
        "img_id": "vMt7giKrlN21px-82Uvn0w",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore. Yummy grouper steamboat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vMt7giKrlN21px-82Uvn0w/o.jpg"
      }
    ],
    "user_id": "jq7Pb7s68wi2NDTFEXvwbw"
  },
  "47InGvAyO7GjHaoPzuv-aA": {
    "date": "4/15/2016",
    "text": "Pros:  the ingredients were fresh and the soup base was tasty.  Cons:  service was slow and sourly, and orders were forgotten; some of the side dishes had small portion sizes and although the fish head was large, the best parts (ie, cheeks, fin area) were missing.  For the price, it felt a bit like paying for lamb and getting mutton instead.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpaRz2s7-k5ir4v7p0NFzQ"
  },
  "5DVG0kea51olW0_kxNcD9g": {
    "date": "3/25/2013",
    "text": "It's been here since 1927 and this is the 3rd generation running the place. Traditional teochew steamboat - choice of fish, fried yam pieces, ti-bo (fried fish), cabbage, etc. Yumm...an awesome bowl of fishy goodness served in a charcoal steamboat.They also have good tze-char dishes - fried pork were great, the braised intestines yummy, sambal crayfish and a variety of others.There is AC upstairs if you find it too hot. The thing that kills me here is the parking. I wish wish wish that they provide valet parking.3.5 stars for the food, 0.5 stars for tradition! The boss himself still brings up the steamboat to the table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ekl40mBhyfxmLKn2Ck3qzg",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore. Sambal crayfish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ekl40mBhyfxmLKn2Ck3qzg/o.jpg"
      },
      {
        "img_id": "fQL4fZAPgW0oOvE1RgLWZg",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore. Braised intestines",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fQL4fZAPgW0oOvE1RgLWZg/o.jpg"
      },
      {
        "img_id": "YJPaZAdc3IMNHxr3vwNAmQ",
        "caption": "Photo of Nan Hwa Chong Fish-Head Steamboat Corner - Singapore, Singapore. The famed fish head steamboat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YJPaZAdc3IMNHxr3vwNAmQ/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "-rnyIH1TkeR4yjGcugi2hQ": {
    "date": "4/11/2013",
    "text": "Dropped by for a weekend dinner last week and it didn't disappoint. When your steamboat uses charcoal, you hardly go wrong. There's something about a charcoal steamboat that you can get with an electric one or even a gas steamboat. It's probably all that traditional smoky goodness that adds a load of flavor and depth to the soup. Their other dishes are pretty happening as well. Definitely worth a go. If you're heading there, best not to drive though. Parking isn't the best around the area.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  }
}