{
  "bpEFU5XE5sTPCIHnAqyBtQ": {
    "date": "11/27/2015",
    "text": "Patronise the far east plaza's outlet. get ready to queue but ingredients are fresh and packs a punch. It's rare to find quality and yummy food at a reasonable price at town but THIS IS IT LAH.they have a new outlet, more upscale in ngee Ann city",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "Qi1N0FmKjS4r71kApMtnNw": {
    "date": "6/8/2014",
    "text": "Ok, I get it now. I understand why the queues here are out of control.I've heard so much about this fabled, no frills sushi place in the most random location inside Far East Plaza. My husband and I are not the types to want to queue for food; we'd rather go to a place that's less crowded and costs more than to wait for cheap but satisfying bites*.Luckily, we had some time to kill on a Saturday so we decided to give it a shot. I ordered the aburi salmon roll and \"normal\" chirashi, while Miguel got the premium chirashi**. On the menu, it mentions that the chirashis will be a 15-minute wait.We get the aburi salmon roll first, and mm MM MMM it was delicious, melt in your mouth amazeballs! However, when the chirashis were delivered, they immediately stole the show. I felt like I was attending the funeral of all the fish from the SEA Aquarium. Look at how many (dead, beautifully cut up, fresh) fishes are in there! I must admit that we came in \"medium hungry\", so we actually had trouble finishing our food. (No worries, we eventually did, as we knew it would be horrible to waste amazing fish like that.) But I'm pretty sure if I came in hangry, I'd be fully satisfied after a chirashi + aburi salmon roll.I still wouldn't wait more than 30 minutes in the queue for this place, but I will no longer judge those who are willing to do so!*Also, one of us is the impatient type. I won't say who.**For dem basic bitches, they also have a basic chirashi. Apparently, the fish will be cubed instead of sliced.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TJvUFHvr7lwyeQyjalsbZg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Quick, take a photo before it's filled with hungry people!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TJvUFHvr7lwyeQyjalsbZg/o.jpg"
      },
      {
        "img_id": "jnD5jWqKC0R9gU5ZAKxgYA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Dear Normal Chirashi: all of me loves all of you. Love your curves & all your edges, all your perfect imperfections",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jnD5jWqKC0R9gU5ZAKxgYA/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "IT5oEuEBsa2OhHORoQ7M9g": {
    "date": "8/19/2015",
    "text": "I have been in search of a delicious, yet decently priced sushi spot since our move to Singapore. Thanks to Yelp, I think I have found it. I just pulled up my yelp app, typed \"sushi\" in the search bar and this spot popped up. As a bonus, it's only a couple of blocks away from our home. My husband and I decided to meet for lunch so we decided to try The Sushi Bar. We walked in a little after 12:00 and were seated immediately. The service was very prompt and attentive. We both ordered the miso soup. It is the best miso soup I have had since moving to Singapore. We decided to split some rolls. We ordered the spicy tuna maki, soft shell crab and due to the yelp tips, the salmon alburi roll. The spicy tuna maki is a very simple roll, but absolutely delicious. It was probably my favorite roll out of the three. The soft shell crab roll was wonderful as well. It was also presented beautifully. The salmon alburi was probably my least favorite of the three. I did not love the texture, but it was still tasty. We left the Sushi Bar feeling full and satisfied. The best part? We only paid $44 SGD for 2 soft drinks, 2 miso soups and 3 rolls. We will certainly be back! Thanks for the suggestion fellow yelpers!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0Ws8x_R8XoZtHd1F0ir9ZQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Miso soup...best I have had in Singapore!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0Ws8x_R8XoZtHd1F0ir9ZQ/o.jpg"
      },
      {
        "img_id": "noJXVaxlk2lRISgAGFrzBQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Spicy tuna maki and soft shell crab roll...they were both phenomenal!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/noJXVaxlk2lRISgAGFrzBQ/o.jpg"
      },
      {
        "img_id": "6DSi1GwAssny8UX43RF_Wg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Alburi salmon roll...this was not my favorite. I do not love the texture.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6DSi1GwAssny8UX43RF_Wg/o.jpg"
      }
    ],
    "user_id": "sS3AW6h3WgKGaa_ZhICRzQ"
  },
  "vz_yq4P_y2dYy_DlINCVsQ": {
    "date": "1/22/2016",
    "text": "When the normal Chirashi bowl was served to me, I suffered a moment of amusement... I could totally relate to how the fish felt (packed, slightly glistening and a fishy aroma surrounding me).No one comes here for the ambience that's for sure. The Chirashi does offer a nice selection of fish - a much nicer selection than some other places in fact. But for some reason, my go to Chirashi place still remains Mohamed Sultan Rd.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4NAHIyNwR6mM5fpVzvhVw"
  },
  "08p43zbAO7_a46fZKH9-rA": {
    "date": "10/31/2014",
    "text": "Randomly found this hidden sushi bar while walking around Far East. Fish is really fresh, love the salmon roll and seafood rice.The store is now located on 4th floor instead of 3rd floor.Will return (s!) soon for sure!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6vaZRXYK_apeMKwuH1NgVQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Scallop",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6vaZRXYK_apeMKwuH1NgVQ/o.jpg"
      },
      {
        "img_id": "p1mYib1mVeyFsr5coQvEEw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Sushi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p1mYib1mVeyFsr5coQvEEw/o.jpg"
      },
      {
        "img_id": "hKPdqwB9cQO2ztqt75BNlg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Seafood rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hKPdqwB9cQO2ztqt75BNlg/o.jpg"
      }
    ],
    "user_id": "KXy4m5JDEegBLk5x9aiViQ"
  },
  "cHie23n02RQnokdw04fBpQ": {
    "date": "10/16/2013",
    "text": "Been back 2 weeks and i have read much about this place. Attempted twice to eat there but failed. Today finally had the chance to try the most talked about Salmon aburi. It was delicous but it didnt wow me. I much prefer the yellowtail sashimi i ordered. Next time i would like to try the chirashi ^___^ service was fast and i'm glad i went there before 7pm. I sat pretty close to the other tables and i mostly heard praises from the others.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KTWWJJJu_xuKaxv7ynV5ag",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KTWWJJJu_xuKaxv7ynV5ag/o.jpg"
      },
      {
        "img_id": "02m8KtjCa8SxsTMrhwWJLw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Salmon aburi - cute touch with the wasabi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/02m8KtjCa8SxsTMrhwWJLw/o.jpg"
      },
      {
        "img_id": "1ENq5MuAOsUdFR03TEaysw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Hamachi yellow fish tail",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1ENq5MuAOsUdFR03TEaysw/o.jpg"
      }
    ],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "J12S2BhFtyMJZGEyJWCtWg": {
    "date": "11/16/2016",
    "text": "Delicious sushi with a great price range; fresh fish, quick service, and a good price range. Nice atmosphere inside",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0tTgCvLbNPrkrWsYzhNHQ"
  },
  "lAbh5--jGBacdoXlpRXB9Q": {
    "date": "5/10/2015",
    "text": "The Sushi Bar is tucked into a little corner of Orchard Road at Far East Plaza and if you don't already know about it, you might just walk past it wondering why is the queue so long. I came here for dinner, ordering the famous salmon aburi sushi, wagyu skewers, salmon kabuto miso pot and the scallop carpaccio. The ambience is definitely mediocre but the taste of the food is able to make up for it. The prices are pretty reasonable unless you move up the scale and go for premium stuff, that can set you back about $75-$100 per person. Otherwise you can get away with about $50 per person. They don't stinge on the portions and the food is worth the wait after you have ordered. The crowd here tends to be young, 20s to 30s and somehow you don't really see a matured crowd.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "332lojNVxon04b6V-Hk_Eg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Wagyu Skewers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/332lojNVxon04b6V-Hk_Eg/o.jpg"
      }
    ],
    "user_id": "zkJ7aPyIzH61ei_nftYStA"
  },
  "dkmjnV9ESV_0anSCkgXYOQ": {
    "date": "11/21/2013",
    "text": "This is seriously one of my favourite places now! I love aburi and reasonable pricing, so yay!!! Haha. They only take cash though. Maybe NETS too, can't remember. Anyway, big tip - you can now do SMS/whatsapp reservations! Awesome. There is always a long line when I go, and then I'm very thankful for having made a reservation. Lesson learnt from the first time we tried to walk in.. This gem is hidden in an obscure part of Far East Plaza - I can never remember how to get there and end up wandering around the 3rd floor. But just follow your nose :p Or else, come up the escalators which are nearer to Goodwood Park (as opposed to the escalators nearer to Grand Hyatt) and I think it should be on that side..Aburi salmon roll ($14.50)! Aburi scallop roll ($16.90)! Scallop mentaiyaki ($13.90!) All the flame grilled goodness you could ask for :) And mayo. Although thankfully there isn't an overabundance of it, I think Koh Grill and Sushi goes heavier on the mayo.Chirashi ($24.90) is usually a gd deal too! Comes with a fair amount of fish and seafood. 3 Kind sashimi ($14.90) pretty gd deal too, fish slices are fairly large.Oh, top up your own tea/water service. I mean, no extra tax and GST, you gotta serve yourself man :)",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "_XtC5EIyVEfZIgmczoAnUg": {
    "date": "7/18/2015",
    "text": "Queued for about 10 mins when I arrived there at 2pm.Aburi salmon roll - creamy and melt in your mouth with a dollop of mentaiki sauce on top. YummyCalifornia maki roll - good but nothing specialScallop mentaiki - this was the best dish for me. Scallops were thinly sliced. Mentaiko sauce contrasted nicely with its richness. Salmon ikura rice bowl - my boyfriend had this and thought this very average. Probably wouldn't order again.Tofu cheesecake - not as good as sun with moon's but decent. A little too soft and runny.Total along with 1 beer was $81 for 2 pax",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W09kTxHoFUimZxTsMLIF9g"
  },
  "pE_XOVSd57ITjQJvcJMzQw": {
    "date": "7/18/2014",
    "text": "Worth the long queue! The crispiness of the soft shell crab really pumps up the flavors of the salmon aburi and moreover they fire-grilled the salmon making extra flavors on top but still raw and fresh on the bottom.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GM5J2Ny6EUXj6Wtjga462Q",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Salmon aburi, soft shell crab salmon aburi, cawanmushi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GM5J2Ny6EUXj6Wtjga462Q/o.jpg"
      }
    ],
    "user_id": "enrJOsfrXdnN3RwNkAOgRA"
  },
  "b7j56TMmbyD1C8LIIlDJLA": {
    "date": "9/2/2014",
    "text": "Fresh sashimi and rolls at very reasonable prices. The aburi salmon rolls lived up to the hype. Attentive service and new modern space on the 4th floor will make me return again. Ignore having to walk through the mall to get to this tiny gem :) Would like to return to try the spaghetti with roe and seared scallop carpaccio.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wcg633L8ajHPuLeb0AiCqg"
  },
  "MNNiXD2ZQrm3P3TMTtQLFw": {
    "date": "8/1/2014",
    "text": "The aburi rolls here are spectacular. The balance of ingredients and flavors and temperature is always just right. Even as takeout, their aburi rolls still taste awesome. If only they didn't close so early and the wait wasn't so crazy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIl2vuddRLlfjf9ya_aUSQ"
  },
  "AQK1m7Jj57fz2PeQw8ebgQ": {
    "date": "5/20/2013",
    "text": "Yes, the salmon aburi roll lives up to the hype! It's delicious. I've not tried the soft shell crab version though, but I imagine that would be really good as well. I love the sirloin steak - always tender and tasty. The sashimi is fresh, and I like the thick cuts. Prices are definitely reasonable for the quality of food. Just be prepared to queue if you do not have a reservation. This is definitely not fine dining, so be prepared to squeeze. I'm impressed by the young chef behind the Sushi Bar and his team of young and enthusiastic staff. Can't be too harsh on them given that it's really a small restaurant and it's always packed. So I can understand when things like water/tea doesn't get filled up. With good Japanese food at prices that won't burn a hole in your wallet, I'm not complaining.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Imxj8nYyM2Vw56l2y1noQ"
  },
  "TLmxEXXBJHFok0Qlwqgy-g": {
    "date": "12/30/2012",
    "text": "Cosy,awesome food and friendly chef! what more can you ask from a sushi bar?? highly recommend the tuna yuke,soft shell crab aburi sushi roll and sirloin!! price are affordable and portion fits just nice for me!! make sure to make bookings during weekend as they get really busy",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPy7u2IhfI9JIxHmIGElXw"
  },
  "gkSX4gClA__2kVWnlT16EQ": {
    "date": "5/19/2017",
    "text": "The service at Sushi Bar was great with an extremely polite and conscientious staff. Decor of the location was very intimate but also great for larger groups.Came here on my birthday and ordered tuna sashimi (comes with three large pieces of raw fish), crab stick roll, and the salmon aburi. All of the sushi tasted fresh and was of high quality for a fair price. They even put a little candle on the sushi, so I kinda had to give it 5 stars.Would definitely recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rOWtngDbUyoSfnV-tb6uhQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Bday sushi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rOWtngDbUyoSfnV-tb6uhQ/o.jpg"
      },
      {
        "img_id": "Hwps5S0Ve3dJGDP7zPsLVQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Hwps5S0Ve3dJGDP7zPsLVQ/o.jpg"
      }
    ],
    "user_id": "B6kHo5Bfik1kAK7SFtYtCg"
  },
  "dBbqiIaj9o_9UsSPYpVmpw": {
    "date": "4/6/2017",
    "text": "OMG Yelp let me down big time.  I don't know how this place can be rated 4 1/2 stars.  I'm pretty sure you can get much better sushi at Costco and better cuts of fish at any Isetan Japanese market.  I was pretty excited to dine here since it was located at the Far East Plaza right next to the hotel so it was pretty effortless to get here after work.The Sushi Bar is located on the 4th floor of this less-than-glam shopping plaza where merchants stand outside their shops preying on walker bys.  It kinda reminds me of an indoor flea market with roll up doors where they sell lots of shimmering cheap stretch pants and battery operated clapping toys.  I was convinced that the Sushi Bar was just a gem located inside this 1980's time-warped mall.I sat down and ordered some green tea, the 5 Kind sashimi, and the Hamachi Kama which they warn you takes 30 min to prepare.  My first disappointment was the tea bag.  I expect it from a Mr.Sushi or a sushi food truck but this place was a 4 1/2 star establishment man!  My dish of 15 pcs of sashimi quickly showed up.  The first bite of the swordfish was like biting into a cold tough piece of Goodyear tire.  There was no way my incisors could completely penetrate that nearly inch thick piece of white radial.  I quickly moved to the other fish and none were impressive at all either.  The octopus was not appealing either with the big suckers staring at me.  The grilled hamachi cheek was the only thing that somewhat saved this place from being a 1 star. It was good but still not great.  Another thing I noticed was the lack of hygene in the handling of the soy sauce dishes.  The guy stuck his thumb right on the top surface of where people pour their soy sauce.  Some people may not care or pay attention to details like this but this germaphobe won't be returning here.  They set \"The Sushi Bar\" way too low to be enjoyed by this foodie.",
    "rating": 2.0,
    "rated": {
      "useful": 15,
      "funny": 6,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "ANRlYyqqdkGqinDhwh9kGA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. 5 Kind sashimi. Very disappointing as they are very poor cuts.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ANRlYyqqdkGqinDhwh9kGA/o.jpg"
      },
      {
        "img_id": "AmDF83YeS92M0L4dapzqCA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Hot tea is from a teabag? Boo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AmDF83YeS92M0L4dapzqCA/o.jpg"
      },
      {
        "img_id": "FMOu6EhNJCrSIZ2LYIxjVw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FMOu6EhNJCrSIZ2LYIxjVw/o.jpg"
      }
    ],
    "user_id": "C1suecKrUtbxbPnma2KMMQ"
  },
  "2TkrpucNsJy7hWamqKEg_Q": {
    "date": "7/1/2017",
    "text": "Heard that this was the best sushi joint in Singapore, so we had to try. The restaurant was extremely hard to find, no one knew where it was and we were misdirected 3 times before we finally found it on the 4th floor. Once we got in we were quickly seated, and the servers promptly gave us tea and took our orders. They were very friendly and helpful, giving us suggestions on what to order and portion control. We ordered a small sashimi sampler, 3 rolls from the chefs recommendation menu, and wagyu aburi sushi (best idea ever!!) The sashimi was super thick and delicious, but I have to say my fav was the wagyu melt on your tongue aburi sushi and the scallop roll. Made the trip well worth. If you have a couple if hours to kill and an urge to go on an adventure, give this place a try! Itll for sure satisfy your starving stomach after the treacherous journey to get here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "FL-BL_zrsJaHYKl43pEDKA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FL-BL_zrsJaHYKl43pEDKA/o.jpg"
      },
      {
        "img_id": "s0Zxwx5iNzq5nN7QcESVVQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s0Zxwx5iNzq5nN7QcESVVQ/o.jpg"
      },
      {
        "img_id": "XFukU5tsFUPZf6xjt1VBJA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XFukU5tsFUPZf6xjt1VBJA/o.jpg"
      }
    ],
    "user_id": "jBA4kbPRYCFYGYjhuRQjGA"
  },
  "HdNANr_WNI8KLS5btEeKVQ": {
    "date": "12/17/2017",
    "text": "Ebi fry salmon Aburizal ($17.90++) - 3 starsNot very flavourful. Just decent. The sushi at Aburi Sushi Heishirou at Westgate was better and cheaper although it's kind of out of the way.The place is also rather crowded so it's not great for a nice quiet dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "oGnb0CiODI6P2_obOagfRw": {
    "date": "5/15/2016",
    "text": "Yes I also get the raving reviews now.We decided to pop in on a Saturday night after the gym (protein :)) and were lucky to find only a few people queuing.So we got a table in no time and ordered scallop carpaccio, agedashi tofu, sashimi and a seasonal chirashi don. The fish was amazing, the tofu bowl - the broth especially - was very tasty and the scallop carpaccio divine.I found my favourite beer (Suntory premium) and the service was very friendly and fast. The interior is modern, but more on the functional side. Anyhow, you do not come here for the furnishings, you come here for sushi. I wouldn't take a first date or celebrate my anniversary here, but I'll certainly be back for their delectable sushi and good service, at a price tag that doesn't involve cringing when you see the bill.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wdL-8G348f_kROM-NXonTQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. love this beer..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wdL-8G348f_kROM-NXonTQ/o.jpg"
      },
      {
        "img_id": "K-DpBfD-3TOcg_2yQXjDxA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K-DpBfD-3TOcg_2yQXjDxA/o.jpg"
      },
      {
        "img_id": "IWcgTSfZVZkwA0iohan-rQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IWcgTSfZVZkwA0iohan-rQ/o.jpg"
      }
    ],
    "user_id": "mI2Q4dVJ92weGouEabb9Bw"
  },
  "I-VLRZVD2mpZW_mnaho3bQ": {
    "date": "9/23/2015",
    "text": "I was taken here for dinner on a Monday night, and we got here before 7pm so there wasn't a queue. There is a promotion where you get 3 rolls for the price of 2, and my companion, by some oversight, ordered the prawn, soft shell crab, and salmon rolls, which all happened to be aburi-ed. I loved the rolls, but three aburi-ed rolls which sort of taste the same after a while, for 2 people, are a bit much, and hence we struggled to finish the rolls, which resulted in a fair bit of waste. We also got the normal chirashi, a portion of salmon sashimi, a pitan tofu. The chirashi was topped with thickly sliced fish of various varieties, and the rice was sufficiently vinegared. Yum!My favorite was the pitan tofu. Tofu is actually a misnomer as they use egg custard as the tofu, and then top it with century eggs, flying fish roe, spring onions, and shredded surimi. I really liked this.Prices here are very reasonable for what they are. I guess this is the Singapore version of hole-in-the-wall sushi, tucked in a corner of Orchard Road. They should probably have a sake shot promo, just to value-add.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MoTJJLpth9zstKQmXVwTig",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MoTJJLpth9zstKQmXVwTig/o.jpg"
      },
      {
        "img_id": "-ANJuupZwMzCvPgYYAsaqw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-ANJuupZwMzCvPgYYAsaqw/o.jpg"
      },
      {
        "img_id": "PA_La9nRlDUlqzOMdl1igw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PA_La9nRlDUlqzOMdl1igw/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "OuoV0b-Q4BS23ngxzntvkQ": {
    "date": "9/18/2016",
    "text": "Nice place for quality sushi. Business is good so it is advisable to make a reservation. One of the speciality is the soft shell crab with salmon roll. The salmon is torched so this dish is suitable for diners who are not into raw food. The ingredients go well together. The unagi avocado roll was a rip off in my opinion. I understand that unagi is not cheap but not a lot of it was given and 5 pieces of sushi at $17.90 before tax were not worth it. The other sushi rolls had more portions and value for money. Only cash or nets is accepted.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DH_YI_9Z7HeBPY0uM9Gvug",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Unagi and avocado roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DH_YI_9Z7HeBPY0uM9Gvug/o.jpg"
      }
    ],
    "user_id": "pDk2mjq7RTpIc6AWIvrbfw"
  },
  "GWd-kp7rSwjIHd1qBqRUBw": {
    "date": "7/28/2015",
    "text": "Fresh fish. Generous portions. Fast, professional service. A reasonable price. What more can you ask for?My husband and I went here based on a yelp suggestion that popped up on my screen. And it was a block away from my hotel, so how could I say no?It was a little bit challenging to find it because it is all the way in the back of the mall and the mall directory needs to be updated with its listing. But after we found it and waited in line, it was so worth it!I had the normal churasi don plate which was a nice selection of fish, including salmon, smoked salmon, tuna, scallop, egg, salmon roe and another one I can't remember! All are top quality and generously sized pieces. Husband had the smoked salmon roll, some salmon sushi, and two hand rolls. The hand rolls were like deconstructed cut rolls with a twist.If you want to go exotic and get premium sashimi, you can do this here too. Check out the premium and seasonal  donburi selections- very impressive for such a low key place :-)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8pewDasd0KjSHI90hFo8xw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Salmon sushi pieces (after eating the first piece!)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8pewDasd0KjSHI90hFo8xw/o.jpg"
      },
      {
        "img_id": "0ZlZG1-zSVdw_4twbUvCcA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. CA and soft crab hand rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0ZlZG1-zSVdw_4twbUvCcA/o.jpg"
      }
    ],
    "user_id": "1ziEzn7BoXTfOQ4YBkdz1Q"
  },
  "GBg-Fgf7Y6p3tEYcncBUrw": {
    "date": "10/4/2016",
    "text": "Ars you looking for value for money sushi in a restaurant that takes restaurants? Looking for a decently priced pint of beer to cool off? The sushi bar is your place, for all three of the above reasons. Love that you can SMS them to make a reservation. Queues can get long so definitely make a reservation if you know you'll be headed there!The chirashi bowl is my go to item on the menu. With a nice cold Asahi or Sapporo of course.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aO-QgB6EBzcSP5S-0Fn1sQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. The (basic) chirashi bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aO-QgB6EBzcSP5S-0Fn1sQ/o.jpg"
      }
    ],
    "user_id": "0nSzAzzqVUY1W-D-IVvu_A"
  },
  "q8CeKcu1HZlZSwDEn2syWg": {
    "date": "11/5/2017",
    "text": "This place was way more expensive than any of the dishes deserved. We spent $80 CAD between 3 people and we were not full.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqmNpTXRwo35CmDEybQdzg"
  },
  "RMX7tybWmFydHKPSMvRAkw": {
    "date": "2/2/2018",
    "text": "OMG!!!!!  This has to be the best find for sushi in all of Singapore.  You would not think much by the mall in which it is located.  But after a plate of the special nigiri, two amazing salmon and scallop rolls and a bottle of wonderful sake, you would think you had gone to heaven.  Not to be missed if you are in Singapore and need a serious sushi fix.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1rtJ3_c5vl1bJRXivVeSg"
  },
  "6YysgqlTkFaxZuZLbajBag": {
    "date": "7/2/2015",
    "text": "I didn't know about this place until a Yelper recommended it. The word \"Sushi\" was an immediately 'Yes' when she suggested having our dinner there, no regrets at all. Hidden on the 4th floor of Far East Plaza, a mall that needs some upgrading to compete with its rivals. My first impression of the place is this must be a low cost type Japanese restaurant as its interior and menu matches to my impression but the cost of the food is at a different level! I ordered the Normal Chirashi Set (A bowl of rice with a mixture of assorted meat) that cost $24 to try out since I was told how good the food is. When my meal was served, my eyes \"popped\" out when I saw the portion of the meat, it's probably the most generous portion I come across in Singapore so far. My first bite of it has made me craved for more. While engaging a conversation with my friend, I can't help but to enjoy every bite of it; multi-tasking at the same time. (Eating 70% and listening 30%) It was that enjoyable. I had the Chawamushi (Steamed egg) and that's pretty decent, so for the $30+ I paid for the meal, it's certainly worth the enjoyment. Like they say, sometimes it's good to spend more for good food, this is one example.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iVv4lqcxyn8XUM7segx1xg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iVv4lqcxyn8XUM7segx1xg/o.jpg"
      },
      {
        "img_id": "6r_t6ALypZ0MwndttQbB0Q",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Chirashi Don - normal set",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6r_t6ALypZ0MwndttQbB0Q/o.jpg"
      },
      {
        "img_id": "l8CndyO-lpHN4nL5yC1Cjw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Chawamushi - steamed egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l8CndyO-lpHN4nL5yC1Cjw/o.jpg"
      }
    ],
    "user_id": "Vtdm-QpN5yYxT-O00cuqFg"
  },
  "tUUcaFYVrWzbzFAMPjg2fQ": {
    "date": "7/14/2017",
    "text": "Just go.  Takes a bit of finding, but well worth it.  Best sushi I've had in a long time.  Sashimi was great, especially the tuna.  Sushi was outstanding, we got some basic rolls and loved them all.  This is not a fancy place, but a great place for great food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3l-Rmqcw_Cm1mTxlqEmLEQ"
  },
  "D4ozSecSZYgSCNHs3r794w": {
    "date": "6/11/2013",
    "text": "I am never a big fan of aburi as I have yet to taste one which made me sit up and go \"wow!\" until now. The aburi salmon sushi is fabulous. You can taste the smokiness of the seared salmon and it is not too overpowering. The sushi has a good balance of fish and rice. The presentation is good. The premium chirashi is equally satisfying. Lots of fresh seafood and too little rice though the amount is just right to fill you up. The premium chirashi has seasonal items (uni, prawn and maybe others which are not included in the regular chirashi) and so is the price. Mine was $38.90 which I felt was reasonable given the 3 pieces of uni and sheer quantity of fish. I loved the aburi salmon and salmon belly in it. It is crowded during lunch time, so you will need to wait to get a table. They lost our reservation though, so we took the counter seats until a table was free. For a small place, there are 6 people in the tiny kitchen slicing and dicing and cleaning. It is a decent, no frills sushi bar focusing on fresh and good food. I will go back again.Oh, you can also request for fresh wasabi which is $4 extra. It is definitely better than the usual wasabi which is made from powder/paste.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7lC2aruEOh1ho482V3_dXQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. aburi salmon sushi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7lC2aruEOh1ho482V3_dXQ/o.jpg"
      },
      {
        "img_id": "RBnNnvLzCRqGMjLT7mnCTg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. fresh wasabi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RBnNnvLzCRqGMjLT7mnCTg/o.jpg"
      },
      {
        "img_id": "ouQeQd-klNC2mMsTDwVGYw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Premium chirashi. 2/3 seafood. 1/3 rice.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ouQeQd-klNC2mMsTDwVGYw/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "GtSjfz-8PbAGQFdpDLMliA": {
    "date": "10/24/2017",
    "text": "Great food, quick service. Not the cheapest eatery in Singapore, but the sushi was fresh and high quality (per my husband), and the cooked salmon was not overcooked (always a concern) and flavorful!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hW1nhGykGbVYnZT1s3qusA"
  },
  "kZukDpIYo21yi0GUh-SYNQ": {
    "date": "10/12/2014",
    "text": "Oh The Sushi Bar, you had me at hello... The sushi here is among the most mouthwatering and freshest you will find on the Red Dot! Furthermore, it won't break the bank either with the normal Chirashi coming in at c.SGD25. I'm a rice and sashimi kind of guy hence my lifetime obsession with Chirashi (sashimi on a bed of rice). The Chirashi comes with an eclectic assortment of fish including: salmon, aburi salmon (my personal fav), tuna, yellowtail, swordfish, scallop, fish roe and tomago. The fish portions are thick, so you won't feel short changed after finishing the dish. My only complaint, if any, was the small layer of rice underneath the sashimi. I'm a huge sushi rice eater, so this could be a personal complaint. Fortunately, this was easily remedied by ordering an extra order of rice.I'm a huge fan of the Sushi Bar, almost to the point of obsession. The lines are long, but It's worth the wait, trust me!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "rfqZ1nM-cLX-UM5XfG9Geg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Normal Chirashi. Yum!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rfqZ1nM-cLX-UM5XfG9Geg/o.jpg"
      }
    ],
    "user_id": "anrZv1OM1a2sC_EfZ8mt-Q"
  },
  "TZFCZPlj1IoP9iAxYAaZAg": {
    "date": "5/22/2015",
    "text": "I'd like to give 4.5 stars. We had Daikon salad, fish miso soup, udon, seasonal chirashi and premium chirashi. We loved all of the dishes except Daikon salad. Chirashi was really good! For this quality I think it's reasonable. I just wish they would take credit card.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dnuEyv6BMDTSyL7vtfcFuQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Receipt",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dnuEyv6BMDTSyL7vtfcFuQ/o.jpg"
      },
      {
        "img_id": "nhuDpNM-Wln4qiOqmP1TPA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Entrance",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nhuDpNM-Wln4qiOqmP1TPA/o.jpg"
      },
      {
        "img_id": "8sAWrTPhi-YE9PMkedy9ZQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. $8.90 Daikon salad --not so good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8sAWrTPhi-YE9PMkedy9ZQ/o.jpg"
      }
    ],
    "user_id": "QbQkfQKqyZwA0Kpm1YozBg"
  },
  "fZCWi1x5IfMQRnbivGhmfA": {
    "date": "8/23/2014",
    "text": "5 stars for above-average food at a price that's hard to beat!The normal chiraishi comes with salmon, aburi salmon, tuna, swordfish, yellowtail and scallops. They're really generous with the ingredients- you get 3 thick slices of each. Quality-wise, I thought that it was on par with more expensive places like Sushi Tei or Itacho sushi.Everyone orders the aburi salmon rolls- and with good reason. These were fantastic! The salmon was perfectly-seared and came in thick slices, and the mentaiko mayo on the top of the rolls complemented the rest of the ingredients well. For both dishes, the fish:rice ratio was 2:1, which was impressive considering that it's usually the reverse in similarly-priced places.Wasabi was better than the usual but lacked the clears-your-nose-immediately spiciness of the freshest kinds. I should know, because I put a teaspoon of it into my mouth and didn't die.*I was here at 6pm on a weekday and it was EMPTY! None of the crazy queue that everyone's been talking about.*I don't usually do things like these, it was part of a bet.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JXLeU3ogSAiA25Il2kSvfw",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Tofu cheesecake, a pretty good rendition",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JXLeU3ogSAiA25Il2kSvfw/o.jpg"
      },
      {
        "img_id": "GG3TGBFf0_g-L41CAXTOpg",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Pretty fresh oysters for $6 each",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GG3TGBFf0_g-L41CAXTOpg/o.jpg"
      }
    ],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "I7dnfxohaabNAfL9UG0mWw": {
    "date": "11/8/2014",
    "text": "Hole in the wall shop that is a hidden gem in FEP!Came here to celebrate my friend's birthday and the food far exceeded my expectations. There is a long line outside and all parties must be present to be seated, but it is quite worth the wait. They just opened a new outlet on level 3 of the same building but offers only 80% of the menu. We opted to wait for a table, and it only took 10min on a Sat night at 645pm. The salmon and salmon belly sashimi are generously sliced and rather fresh. The famed salmon aburi roll did not disappoint, while the sirloin steak was tender, juicy, fragrant and perfectly grilled. It reminds me of the steak at New Ubin seafood which I absolutely love!We also had the \"upgraded\" miso soup - some salmon fish/head soup which was very sweet :)Enjoyed my dinner very much and definitely looking forward to coming back again!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "I3bc6Y-W2O38iz_asqC-gA": {
    "date": "6/15/2016",
    "text": "Take away for this place is nice and fresh seafood.  A little pricey for what i have ordered fortunately overall taste was rather good.  Ambience is what you would expect at sakei sushi.  Watch the Q so come early with all parties intact.  Think you are better off ordering the individual bowls as that would limit the pocket hole from getting too big.  Again....fresh and thickly cut sashimi that saved the day.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DGpTxk8beDssoZegi20UEA",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. The real damage :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DGpTxk8beDssoZegi20UEA/o.jpg"
      },
      {
        "img_id": "9Q7Gvjp_9b_jerX2uKKkzQ",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Another another angle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9Q7Gvjp_9b_jerX2uKKkzQ/o.jpg"
      },
      {
        "img_id": "R0LVEK64NNEOM2BJ38Bf1g",
        "caption": "Photo of The Sushi Bar - Singapore, Singapore. Another angle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R0LVEK64NNEOM2BJ38Bf1g/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  }
}