{
  "eV-9SsFIpLnhUJQulEshNg": {
    "date": "10/1/2016",
    "text": "The \"Diner\" set menu comes with five dishes:1. Rice2. Choice of one of three kinds of herbal duck (Angelica herb is fairly mild in flavor)3. Kai lan with salt fish and lime4. Sliced fish in broth5. Fish maw soup.The star was...the Kai Lan.  Stir fried with a miserly amount of salt fish, the lime juice elevated the dish into whoa!  Super interesting in flavor.  Yum!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NFebJfmrsXz85PoOlnOR-A",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Sliced fish in broth.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NFebJfmrsXz85PoOlnOR-A/o.jpg"
      },
      {
        "img_id": "4j4fosdMZZsQnqMVjVJ7tg",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Fish maw soup.  Very hearty.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4j4fosdMZZsQnqMVjVJ7tg/o.jpg"
      },
      {
        "img_id": "pZz9vUYsrb5mBjvjWJ_TsQ",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Kai lan with salt fish and likes.  Rock star!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pZz9vUYsrb5mBjvjWJ_TsQ/o.jpg"
      }
    ],
    "user_id": "G6tWC8li_ro7dxQtKdvSBw"
  },
  "JsJlgQZXRNJCo1FmCtmPKw": {
    "date": "8/9/2016",
    "text": "Good food, fair prices. I really love the herbal sauce for the roast duck, though my mum thinks it's too salty! The roast duck is really really good too--even without the sauce. Everything is fresh!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dyF12kyRiwCyfl2aIG3T7g",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. roast duck!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dyF12kyRiwCyfl2aIG3T7g/o.jpg"
      },
      {
        "img_id": "cYHEV1Pb-8SaXCJpHH6SNg",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cYHEV1Pb-8SaXCJpHH6SNg/o.jpg"
      },
      {
        "img_id": "J2sXDM76MCjX_sob95GR8g",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J2sXDM76MCjX_sob95GR8g/o.jpg"
      }
    ],
    "user_id": "6wGjjZkbAhcPnorLeh6INg"
  },
  "E26WVaAP8uQjXD6dl7liQg": {
    "date": "10/15/2015",
    "text": "The regular place we go for when we have celebrations. Service is good as usual. We had the duck, yam ring, mixed vegs, fatty pork & pork floss prawns. Skin of duck is very crispy, but sauce was not generous. We had to ask for extra sauce however was told that additional $1 is required. Wasnt reflected on our bill though. Give the fatty pork (东波肉) a miss. Mixed vegs for balancing our meaty meal and its a good mixture of nuts & vegs. Pork floss prawn is rather dry but prawns are fresh. Very family friendly place, baby chair & utensils provided. Air con is rather strong, good to bring an outerwear if your child is not used to lower temp. Bill comes up to $190. Portion is good for 5 full tummies.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PpAtrjlqt6JZbTqKbWJ3kw",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PpAtrjlqt6JZbTqKbWJ3kw/o.jpg"
      },
      {
        "img_id": "Jd42PPWN4w6K4qHrZH_Uzg",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jd42PPWN4w6K4qHrZH_Uzg/o.jpg"
      },
      {
        "img_id": "mnh8C1CgpofNQ-r6c7cY9A",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mnh8C1CgpofNQ-r6c7cY9A/o.jpg"
      }
    ],
    "user_id": "nF5ySHfiUS0v30njNniOjg"
  },
  "UpTBxpISsV3OwyQj1LsUHQ": {
    "date": "8/26/2012",
    "text": "While the decor is really tacky, the food they serve here is top notch. I've been coming back solely for the herbal roast duck. Laced with herbs with a really crispy skin, the meat is tender, fragrant and really sweat. Pity the sauce that comes with it is limited, and they charge you if you want extra. I usually get the duck, together with the spinach with three eggs to make a meal out of it, and I always leave satisfied. Prices are affordable and half a duck will be just right for two people.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wo3FHsrUBwHAaUnY1l47fw",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wo3FHsrUBwHAaUnY1l47fw/o.jpg"
      },
      {
        "img_id": "f3IeU7ZBmt4FnyfbFRGDtw",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f3IeU7ZBmt4FnyfbFRGDtw/o.jpg"
      }
    ],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "WSjKnCnYv4QBa3f0iTdjNg": {
    "date": "10/19/2012",
    "text": "Good food, good service, and good ambiance.That pretty much sums up this Dian Xiao Er.I had lunch here with a colleague.We were quickly seated.  it wasn't long at all before beverages and food were heading towards our table.The staff was friendly.  They were also very prompt and available when needed.The room is pretty straightforward.  But, it is a step up from some of the purely functional spaces you find with some Chinese restaurants.Ten Wonder Duck - This was pretty good.  I did not think it was amazing though.  I thought  the flavor of the duck was a little masked.  The duck was just slightly on the tough side.tinyurl.com/8hvmnwgMongolian Spare Rib - I really enjoyed these sticky messy ribs.tinyurl.com/9yc8bqzSambal KangKing - If you've read any of my reviews, you might have picked up that I am not a huge fan of all things greens.  But, as greens go, these were very tasty.  These are greens that I would actually order.tinyurl.com/9dfxnz7So, as I started the review with; good food, good service, and good ambiance.  I know some people do but, with all the great food in Singapore, I do not consider this a destination restaurant.  But, if I was in the area and hungry, I would not hesitate to eat there again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JPCSPf2rkz4Hl1_5x15xRQ",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Ten Wonder Duck - Dian Xiao Er - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JPCSPf2rkz4Hl1_5x15xRQ/o.jpg"
      },
      {
        "img_id": "dcH3uhbDqCaT6myYFcC7Eg",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Sambal KangKing - Dian Xiao Er - Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dcH3uhbDqCaT6myYFcC7Eg/o.jpg"
      },
      {
        "img_id": "Qo-uMKYz6UOV0bQNNeO1qw",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore. Mongolian Spare Rib - Dian Xiao Er - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Qo-uMKYz6UOV0bQNNeO1qw/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "9ObZbj-WR9KttrHkZxgcBg": {
    "date": "8/25/2012",
    "text": "A Chinese restaurant that was named after the antique way of calling a waiter to your table was definitely interesting in my book. The dining experience here was quite satisfactory as well. The over décor of the restaurant very closely followed an old period drama style teahouse that we often see in dramas, with the waiters themselves dressed in character. The menu items were of course very traditional, but their specialty was the roasted duck and also their soups. I loved their high quality broths that were boiled for several hours at a go for sure - all of them were thick and not greasy at the same time regardless if it was a meat or vegetable based soup. The duck dish was amazing, and nothing like those roast duck rice that we often order at the local kopitiam. This was thick juicy slabs of duck, with a layer of soft fat covered with a crispy top skin roasted to perfection - best duck ever! Price point is a little higher than I would expect, but if you avoid dishes that are common or can be found for cheaper at a coffee shop, then you should be fine.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "98TwxpTgQh90Y9vglBaQFw",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/98TwxpTgQh90Y9vglBaQFw/o.jpg"
      }
    ],
    "user_id": "05tSDymzhXyvaxO1G24d0g"
  },
  "ZsODU9KVGaWEFD3E7p3QIA": {
    "date": "8/15/2012",
    "text": "Dian Xiao Er is definitely famous for their roasted duck in 3 different herb sauces namely, Angelica Herb, Wild Ginseng or Ten Wonder Herb. The one i love most is their Ten Wonder Herb. Simply awesome. Even when writing the review now, i'm craving for this. Definitely must-try dish in Dian Xiao Er.Together with the roasted duck, i would order Seafood Fried Rice with XO Sauce. The fried rice is filled with seafood like prawn and sotong. Very generous of them. Fried Rice is pretty spicy because of the XO Sauce. But i simply love it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MW1J0QN_Z_7ZdCcEPRcvPA",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MW1J0QN_Z_7ZdCcEPRcvPA/o.jpg"
      }
    ],
    "user_id": "H5giEryaio2xzYX6qKraPQ"
  },
  "IDaTEeWBXbCiCwRosIX9EA": {
    "date": "8/7/2012",
    "text": "Its been a while since I've been to Dian Xiao Er but if memory serves me right, or tastebuds for that matter, the herbal roasted duck is quite something. I probably have ordered more things from their menu but the one that sticks in my mind in definitely the roast duck.Each bite was really enjoyable and the meat was tender and flavourful. I should really head back there soon and get a refresher of more dishes!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JaBQgMJ07tc-9Pt_XdH3qQ",
        "caption": "Photo of Dian Xiao Er - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JaBQgMJ07tc-9Pt_XdH3qQ/o.jpg"
      }
    ],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "XG4-oPgoX85Uror3Et_uJg": {
    "date": "9/28/2012",
    "text": "Their herbal roast duck - the house specialty - is what you definitely must try when you are here.  They offer three types of herbs - Angelica, Wild Ginseng or Ten Wonder Herb - of which I prefer the Angelica and Ten Wonder.But if you are here for the first time, get their set menu which probably helps you sample the best stuff on their menu so that the next time you come back here to know what to order.My favourites aside from the roast duck are the Mongolian spare ribs and their soups which are always refreshing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WShM_YFbtG4OcE0vrFVyw"
  }
}