{
  "bYaQvIiik9t2kk7piIUNAQ": {
    "date": "3/28/2016",
    "text": "My friend's brother and wife lives out in Singapore and they exclaimed this was definitely one place we had to go to for our double date (plus the toddler...). After eating a lifetime's worth of hawker market foods, I found myself really craving a different type of pasta. Started off with a cheese and meat appetizer and it had a great little selection of stuff. We all went at it and it started the meal off right. We got a variety of dishes and everyone seemed to really enjoy it. It took me a really long time to narrow down what I wanted. I ended up getting a pasta dish w/ alfredo style sauce and pancetta or bacon. It was rich and creamy! Also tried the tuna encrusted w/ sesame seeds and liked it a lot as well. Service was good. Food was good, Decor was beautiful. Prices were very fair. Pretty solid!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gjCdbWBuk2POC-9dunIWoA"
  },
  "7H9YqycSpl0DMwXPdvplUQ": {
    "date": "6/2/2016",
    "text": "This place has really gone down hill. Food used to be good. Now it's tired and off. For the prices they charge service was terrible. When i mention to asst manager. His comeback was \"didn't they bring the food to the table \" staff is clueless as to what service is , not through their fault, management hasn't trained them properly. And given the response of asst manager I can see why. I will not be returning there again. Judging by how the place has gone downhill I wouldn't be surprised if they were out of business soon . So hurry down if you want substandard food and service. They may not be around much longer. The location is the only positive thing I can say. It's a real shame I always looked forward to eating there.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfDwnBtcWi0Bm40lQUHCMg"
  },
  "bCrEK5xDl6gtKW6nSMHYYQ": {
    "date": "12/11/2015",
    "text": "Lively bar with excellent wine choices. Staff are friendly and accommodating. Had the Cuvée Raphael with a cheese platter. Delicious. Great prices and ambience. This will become a regular place for me!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yRBKX8hnuIZCpxCAl-v0sg"
  },
  "fWWieboTeOjysHZB1Nqpmw": {
    "date": "2/28/2016",
    "text": "I've eaten here maybe 10 times, I am very familiar with the service, the place, the menu ect. This review is probably one of those that people will read as \"well it's an outlier, you always get those when you own a restaurant\". Well my response would be that a restaurant is only tested through their handing of issues, and their interaction with their customers, not when someone rates 5 starts for ordering a glass of wine, which requires no thought, I don't feel this is representational of the restaurants ability to serve, and thus earn their 5 star rating. Let me explain what happened and you can judge for yourself.Typical night out to dinner and drinks, a few bottles of cheap wine and some apps and mains. My wife orders spaghetti, and it was too spicy for her taste. Easy enough, right? We asked the waiter if we could order something else, we told him that the dish was too spicy, he said ok and we ordered something else. Like any normal restaurant, with any normal level of service, you would expect the spaghetti removed from the bill, replaced with the new item, right? Wrong.I thought they forgot, so I reminded them. This is where their true colors came out. \"Sir, as stated on the menu, we only allow a switch if there is exactly one bite, but your wife had more then one bit.\" Well I guess I can't say that I am surprised as in Singapore if there is a rule, there is no exception. After explaining that the spaghetti probably cost them under $1, and that any normal restaurant would remove the $12 item from a $300 bill, they insisted that a $300 bill is their normal check value and my wife \"ordered incorrectly\" as it states spicy on the menu. So after refusing to remove the item, spending 5 minutes explaining their one bite policy, and accusing my wife of ordering incorrectly, I admittedly lost it.  I could not comprehend what was going on, it turned into a scene and ruined our night. I'll add that finally they removed the item, as I think they knew by that time I was not going to back down.You, as a restaurant, are not selling me $12 spaghetti, you are selling me the experience of a nice night out, you are selling me your customer experience and in turn I am spending my night, filling your seat. Well here is the ultimate lesson for you, if, by me writing this review, it is preventing at least 1 person from spending $12 at your restaurant, then your one bite policy, and your disrespect for the customer has lost you money, and I have succeeded.",
    "rating": 1.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XS68TYBx1SZayBQrNAul5A"
  },
  "_FaqnnbloTIgA_dw1mA1xw": {
    "date": "1/12/2016",
    "text": "I met a dear Friend who recently moved to Singapore for a glass of wine at Wine Connection. If I have said it once, I have said it 1,000 times, \"Alcohol is expensive in Singapore!\" We all know this and unfortunately I feel like I am becoming slightly numb to it (that is actually scary by the way!). Wine Connection is a breath of fresh air. They have an extensive list of house pours, none of which break the bank. My favourite type of wine is a nice, robust Red Zinfandel. I have found that Red Zins are difficult to find in Asia. Typically if you do find one it is only by the bottle and ridiculously expensive. Wind Connection offers a glass of 7 Deadly Zins at $11 SGD a glass! For that reason alone they are FIVE stars in my book! In addition to a great menu the service was excellent. The atmosphere is also great! Needless to say, I will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "sS3AW6h3WgKGaa_ZhICRzQ"
  },
  "yDTXgZ70eZHUSjbEzi5z_Q": {
    "date": "8/16/2015",
    "text": "Best value for money for a drinks and a food place in Singapore. Ambience is great as well. And the crowd is trendy.Love the tapas options at $5 each and the house wine options too. Huge restaurant but still difficult to get a place on a weekend. Shows the popularity.I think we need more options like these in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "q0cTMrlR3tr5aRzg1nS6XQ": {
    "date": "4/29/2015",
    "text": "Went there on Friday evening was packed. Though packed the service staffs were still helpful and service was good. Wines were very reasonable. Good cheese selections.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XcEDBrhk4QbwPp1NWFbk8w"
  },
  "nyogLFUulPmiU0-rXaXGDg": {
    "date": "2/15/2011",
    "text": "Right - first thing's first, Singapore is RIDICULANT expensive. I emailed my ex-pat brother about bring cash out there, innocently wondering whether £100 would be sufficient for four days visiting. \"It's Singapore, not a students' union, KB,\" was the reply. And my God, he was right. It's actually a union for ridiculously well-paid bankers and brokers with money to burn and alcohol to drink. The Wine Connection is therefore a glittering prize in a city where you're lucky if £7 gets you a vodka and coke. It's also bizarrely like an outpost of Borough Market in Asia - yes, it might seem a bit redundant to eat Italian and French food on holiday, but a really good place is a really good place is a really good place. They do the most delicious platters of cold cuts, cheeses and dips: the Thai beef is exceptional, pink and thin as a whisper, it's sweet and succulent. The liver and mushroom pate is even better, and usually accompanied by sounds like \"Ahh!\" \"Aaaah!\" \"Wow.\" and \"Jeeezus.\" The wine is also fairly well-priced, and you can get a nice Prosecco for £15 (this is as cheap as you'll get in Singers, sorry). Our favourite though is a rose called Cep D'Or, which is utterly scrumptious. If you book an outdoor table, you might be lucky enough to get one of the ones based around barrels - these have corks laid into the tops, with a glass plate on top. Last night was Valentine's Day and they'd also sprinkled rose petals inside. Too cute! Wine, cheese etc are not cheap in Singapore given the import duties, but WC is also a wholesaler, which means their wares are significantly more inexpensive than anywhere else. It's reasonably priced and a lovely place to pass an evening. I went straight to Wine Connection from my 12 hour flight out here and was instantly lifted by beautiful surroundings and great food and drink. I've since been here twice with my family, discovering en route that my mother is hilarious when legless on rose. Glorious. Enjoy!",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "lE-fd_KANeBO-DxKkJAZ1Q",
        "caption": "Photo of Wine Connection Tapas Bar & Bistro - Singapore, Singapore. The super-delicious Chocolate Decadence pudding. Mmm!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lE-fd_KANeBO-DxKkJAZ1Q/o.jpg"
      },
      {
        "img_id": "ywGwKsukm91vwwUyrL46vA",
        "caption": "Photo of Wine Connection Tapas Bar & Bistro - Singapore, Singapore. Petals strewn between the corks in the barrel tables and the glass tops for Valentine's Day",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ywGwKsukm91vwwUyrL46vA/o.jpg"
      },
      {
        "img_id": "IAX--9KlbAcp61MW6aIUtQ",
        "caption": "Photo of Wine Connection Tapas Bar & Bistro - Singapore, Singapore. An assembly of the fantastic platters (Cep D'Or too)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IAX--9KlbAcp61MW6aIUtQ/o.jpg"
      }
    ],
    "user_id": null
  }
}