{
  "SZNMO1WDHAsOIaEYuD9YvA": {
    "date": "2/20/2015",
    "text": "I came here for a slice of rainbow cake and a cup of coffee. The rainbow cake looked awesome and it also tasted good, but after it's too much of sweet at the end. The coffee was ok, but what really upsets me is that they don't serve water with my coffee. I ordered espresso and when I asked for water, they said they don't have it. Overall, my experience was good, but I see no reason to go to this place again. The food is quite expensive here compare to other restaurants in Singapore.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4xDcgEt2cG5uBhZARasYQ"
  },
  "r-BkUWKDz1DL8WHawtET7A": {
    "date": "9/18/2012",
    "text": "Some New Yorkers hot-favorite, no doubt. It rocks the island the day it made its debut here, choosing to open at 8pm in the evening and attracting its fans to queue as early as 7pm for the opening special goodies bags. I wasn't one of 'em but was hoping to pay an opening visit if only they have started their business in the morning.Didn't had a chance to drop by Orchard Central until lately. I normally wouldn't walked to the far end of Orchard Road unless there's a good reason to. And today, I had a valid one - Brunch at Dean & DeLuca.Traveled up via the snake-long elevator has been such a breeze, of course, provided the weather is in your favor. Yes, it has been kind today - cooling with slightest dark clouds shadowing me. 2 snake-ladders up and this sleek-looking Dean & DeLuca stood in front of me as I entered the mall on 4th floor.From afar, I am attracted by the elegant marble-tiled bread counter & ham & cheese station. The store offers quite a good varieties of breads but I still didn't understand the reason that these were from Maison Kayser, Bread Project, Baker & Cook's oven and some others. It makes more sense to me if I get to savor the home-made ones than having to buy a loaf at Dean & Deluca , that was baked by others. Skipping the bread counter, I walked into the groceries section. Famed for its luxurious groceries, I wouldn't say the range has been extensive but are definitely some high quality breed by far. Some of the seasonings on the rack can be seen available at three-sixty supermarket at Ion Orchard, even before we get one at our own backyard. These items don't come cheap and a teeny D&D carrier bag (8cm x 8cm) will cost you S$15.00! But if you are looking some some great gourmet seasonings, wine, olive oil, truffle salts, even some gold/silver flakes for your cake decor, this place is it! Mind you, the gold flakes cost about S$125, probably make a luxurious topping on that Christmas frosting or so.The dining area looks bright but the table-to-table space appears cramped. The wait staffs are mostly green horns (looks wondering) to me, many a times, you will need to wave for service. The cafe comes with a self-service concept. You would need to order/pay your food at the front counter and collect your beverages at the drinks counter. The staff will serve your food when it's ready which takes about 10-15mins during peak hours. While I was there, I overheard diners complaining on wrong orders and the long wait for the food, so please check your orders with the wait staffs or when it fails to arrive.The All-day-breakfast selection written on the blackboard was limited. I had The Belgian Stack - was dainty and makes me feel so princessy sweet. The deep waffle pockets were filled with organic maple syrup and a dollop of vanilla ice-cream. The batter cake was baked to light crisp on the outer with a rich buttery center. Served with berries and chocolate sauce - the most conventional way. I could only comment that it was overpriced given its portion. For S$21+, I could get a more hearty breakfast to fill my day.The other breakfast I have tried - American Country Breakfast for S$22+. This was a lackluster! The most classic dish but the worst I have ever tasted. Nothing lived up to D&D's except for the pork sausage which has a blasting sausage skin and flavorful pork fillings. They failed in their scrambled eggs which was cooked dry and too coagulated. Sautéed mushroom a tad ordinary while the bacon strips were too soft and layers of fats seen 'raw' instead of charred crisp. However, the harsh brown was house-made I presumed. Unlike the mass produced 'McDonald's' version; this big mashed potato ball with bits of ham embedded, was tasteless. I only figured it out at the end of the meal, that this was the harsh brown D&D refers to, in their dish description. Was it me who's slow to find the association? Anyway, I regretted having American Country breakfast, but I wish I could have more choices when the hot-favorite Brioche French Toasts was sold out for the day.It was not a very enjoyable brunch that I have expected on D&D. I could get a more delectable breakfast at Wild Honey with the bill. A S$55 for 2 - the amount I could get a scrumptious meal. Now that I have tried D&D - be it for service or on food; I gladly discovered that I won't be back at the cafe but probably the gourmet hall delights me more.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "U-HVozC2Bohc1EaTu1UJfA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. some great and valuable hunt!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U-HVozC2Bohc1EaTu1UJfA/o.jpg"
      },
      {
        "img_id": "Cna1HsxJHLZx2wwB2o_OQg",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. The Belgian Stack S$21.00",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cna1HsxJHLZx2wwB2o_OQg/o.jpg"
      },
      {
        "img_id": "ifvMbZnfZRIKVx9vtF5oBA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. American Country Breakfast for S$22+",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ifvMbZnfZRIKVx9vtF5oBA/o.jpg"
      }
    ],
    "user_id": "IIVTHna4vd7EOJJTKaS5uw"
  },
  "_EKr3KGYX-7BkY0bLO4_dA": {
    "date": "8/26/2012",
    "text": "Terrible. Over-hyped. Ridiculous and a waste of time, really. This place should wake up their idea and realize this is not New York so they should stop the New York attitude.We pay a good 70 bucks on 2 x coffee and breakfast and all we got was bad nasty new york snob attitude from the staff. shame on you! Food was nothing special. Pastries are from mason kayser and other good bakeries in Singapore. I really don't see the point of this place...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "HhbzVfvA_FADByXAs10vCA": {
    "date": "8/27/2012",
    "text": "The service is unapologetically terrible. Despite the place being half filled, the servers managed to:1. interpret our table 22 as 21, despite the table sign present.2. bungle our orders and send another table's orders to us. Thrice.Food's not that great. Sure, the portions are big. I had the portobello cheese burger and green juice. What's the point of having a nice juicy burger and piling fries in the same bowl? The fries are going to slide to the bottom, soak in burger juice and get soggy, no? My friend had the chicken breast and a side of salad, and she complained that the chicken breast was too tough and dry, and the salad overpowering with vinegar dressing. I think my favorite part of D&D was the roasted onion ketchup.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  },
  "fsz6nDIHfQA5tvi21bSTww": {
    "date": "7/20/2012",
    "text": "It's been almost a month since this NY deli set up shop in Orchard Central but they're still plagued by sub-par service standards. My friends and I dropped by on a Thursday afternoon after a movie and were able to get a table easily. I guess the hype has finally settled down a couple notches. We placed our orders which were served shortly except for one - the portobello cheese burger. 30 minutes had gone by before my friend went to the counter to check on her order. It wasn't till another 10 minutes later that her burger finally arrived. We asked about the long waiting time despite the lack of a crowd and all the staff could tell us was that \"sometimes the counter has a lot of burger orders\". Needless to say we were disappointed by the level of service. I had the Brioche French Toast with Salted Caramel Bananas and Berries which was delightful but a tad too sweet. The Portobello Cheese Burger arrived medium well with overdone fries on the side but the mushrooms delicious. The grocery shelves definitely caught our attention but sadly it's all ingredients we can only dream of using in the kitchen.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QErLqUm2M7pnFaHaGpKndw"
  },
  "w0fIv5uhxu-JtaLhvKoL2w": {
    "date": "9/20/2012",
    "text": "Another brand name chain that arrives in Singapore and fizzles out quickly.Went on a weekday evening for a light dinner with my wife. Ordered the Green Juice. Was told they only have 2 out of the 5 ingredients for it, namely green apple and pear. Changed order to Orange & Carrot juice. Was told they didn't have carrot. Was asked if we would like just green apple mixed with pear juice.Ordered the burger with egg and bacon, and was told they didn't have any bacon. So we ordered 2 Portobello burgers. While the burger tasted alright, the fries were not hot, and both patties actually had certain parts almost rare. Very poor standard.It's obvious somebody is not doing their job. Won't be coming back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vU4MeuoOv2OBPry7g_B4GA"
  },
  "fOhkdZofFC7sbWWpgrECFA": {
    "date": "1/27/2014",
    "text": "Finally made it back to Dean & Deluca after several months and had been wanting to eat brunch/lunch here. I loved Dean & Deluca in Soho for their groceries, amazing bakery, tea, and coffees. Also their prepared food section is yum too. This Dean & Deluca in Singapore is the sterile and paired down version of the store in Soho. Of course its going to be overpriced b/c its all imported. But their iced Americano coffee is decent and the lox on my toasted bagel was delicious! Wasn't too big a fan of the scrambled eggs in the bagel with my lox though. It was mushy. Will probably try something else next time. I do like their pasta sauces though and used to get them all the time in New York so it reminds me of my past life.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hjpK0uWOWJEYNiI4Bvaw8A"
  },
  "BLW2Wd6pj3O51yjCWILDiQ": {
    "date": "9/9/2018",
    "text": "A friend and I stopped in for a slice of rainbow cake on her recommendation. The slice was beautiful and quickly served. The cake itself was moist and some of the layers had different flavors than the others but each layer is not a different flavor. The icing was more of a whipped cream base which isn't my favorite icing but good nonetheless.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8FWcqlwUKw_lfQ2bQlHW_w",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Rainbow cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8FWcqlwUKw_lfQ2bQlHW_w/o.jpg"
      }
    ],
    "user_id": "RHD1GxgRTsJRTluoNRkQ6w"
  },
  "tnckFUsnFSKj7-tOVy9jJA": {
    "date": "6/15/2018",
    "text": "Dean and DeLuca was a nice quiet place to kick up one's feet and take a load off.  I have walked into the NYC store and this is definitely not the same.  I ordered a chocolate croissant and a lychee New York soda.  The croissant was ok but the soda was a little too sweet.  Service is great but nothing to write home about.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ci3U4PSYzOc2HTLu-Y01vg",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Front counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ci3U4PSYzOc2HTLu-Y01vg/o.jpg"
      },
      {
        "img_id": "YeWQiaZogjv7xgE6HHOzEA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Lychee New York spda",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YeWQiaZogjv7xgE6HHOzEA/o.jpg"
      }
    ],
    "user_id": "NaKIUQrZGA9gL7jvq1p0_w"
  },
  "5AdDHiVR20CXK6Z7fyP3_g": {
    "date": "6/5/2017",
    "text": "Dean and Delucca is a little taste of home while I was in Singapore or traveling in general (where they have outlets, like St. Helena, Japan and Thailand). That being said, this outlet is pretty good.They have a good selection of yummy hot food entrees and side orders. And their dessert selection is always good especially when I'm not quite sure what I'm craving. I like their lemon tart. Their rainbow cake feels like a Singapore classic too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "11R2R4nyRpF6nqlXH-JeGQ"
  },
  "LPrBc69NStNW_Xc3NqJC_A": {
    "date": "12/12/2016",
    "text": "Dean & Deluca. A more upscale cafe. A brand name. The good. Location is easy as they are now located on the ground floor. Plenty of seats and everything looks and feels high quality. The bad. The espresso? Mmm so so. The beans taste ok but it's taste as if it's made from a bialetti not an espresso machine. You can compare to Joe and dough just across to taste a proper extraction. (Best franchise espresso IMO)Also, no wifi?Anywho, I'm still glad this popped up as every cafe will be maxed out on the weekends in this area. I suppose this place can be good for a homesick New Yorker. What I really want is Joe and dough espresso with Henri Charpentier dessert in this venue setting...Update: decided to try the dessert on another visit. The strawberry rhubarb. I think potential to be good. Potential meaning when she asked to heat it up , she microwaved it rather than the proper reheating machine which maybe the \"crumble\" dessert is a a mush dessert.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kOePtEPlHALe2Ao8sjyvaQ",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Strawberry rhurbarb crumble or mush",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kOePtEPlHALe2Ao8sjyvaQ/o.jpg"
      }
    ],
    "user_id": "0gBy-cIXe0DQKhFjifu68Q"
  },
  "4jebttJAfCHcX-YySj4lzQ": {
    "date": "7/7/2015",
    "text": "Dropped by Dean & Deluca for a quick lunch with my boyfriend. I've had their rainbow cake before last year which I quite liked, so I was looking forward to trying out their more savory food. I had the orzo salad and the mozzarella salmon quiche, whilst my boyfriend had the bacon and egg burger. We both had the mango lassi The quiche was OK - I felt that it was lacking the punch to make it a delicious quiche. I also felt it was rather dry and too crumbly. I quite liked the orzo salad but again, I felt like there would be other places that served even more delicious dishes. My boyfriend, however, seemed to love his bacon and egg burger and even claimed it was only slightly below par with his mom's cafe burgers, which is a pretty big compliment. The mango lassi was way too sweet to my liking, but I've always been a person who prefers subtly sweet treats. Service was not bad, the staff were cheerful and friendly. Dean and Deluca is a pricey pricey place for a restaurant that serves mediocre food. Perhaps their other dishes might be better though.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-JwDrXX1Pa98QdmvKYoLSA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Orzo salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-JwDrXX1Pa98QdmvKYoLSA/o.jpg"
      },
      {
        "img_id": "Hv6NFrX17I9JBWbQCPQhRg",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Mozzarella salmon quiche",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hv6NFrX17I9JBWbQCPQhRg/o.jpg"
      },
      {
        "img_id": "H_NLLlUUl9-5UoxaFmJt-A",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Bacon and egg burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H_NLLlUUl9-5UoxaFmJt-A/o.jpg"
      }
    ],
    "user_id": "sc1z7ewplWzJAMfxl1LlBg"
  },
  "P5cH3Eg1opjh-eku7F0GSw": {
    "date": "11/4/2017",
    "text": "Paid more than SGD 20 for two coffees and one iced tea and they don't give tap water. Plus they only have 1.5L bottles that you cannot take away.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3eJBLhN7A1CREXGqcJ0spg"
  },
  "DdS0M9O6ev4xCSK5lDXxFg": {
    "date": "2/18/2013",
    "text": "I was told the pancakes (flap jacks on the menu) were to die for and that I must head over to Dean & DeLuca to try. I finally made my way there for brunch over the Chinese New Year break. It was early at 11+ am and there were not many diners then. There was a stack of buttermilk pancakes (4) topped with heavy cream and berries. It came with a small serving of maple syrup (not sure if it was real 100% maple as I could not smell the maple at all). Presentation was pretty and the portion was huge, maybe to justify the price (think it was $18). The pancake was thick and fluffy with the taste of buttermilk which was nice and a bit salty on its own. Add a dollop of the sweet cream and it was perfect on its own. I did not need to add the syrup, except when the cream ran out. After polishing off half the stack, I was quite sick of it, so it would be best to share this dish. I would say the pancakes were nice, but not enough to want to make me go back again anytime soon. I think the highlight was the heavy sweet cream.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZHC6F0nkj_JWGUB9236k0Q",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. huge stack of flapjack and whipped cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZHC6F0nkj_JWGUB9236k0Q/o.jpg"
      },
      {
        "img_id": "o1_Yj_tV3Yic94A-f4dxvA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Flapjacks, caramel macchiato and quiche in background",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o1_Yj_tV3Yic94A-f4dxvA/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "O46g71HDlJEORQ12PZ54sg": {
    "date": "11/11/2015",
    "text": "Decent food but there is still room for service to improve. Staff is unfriendly and seems to be reluctant when we add additional requests on the food and drink.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oxwUlugTIuVnSmcLM0A8iw",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Bagel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oxwUlugTIuVnSmcLM0A8iw/o.jpg"
      },
      {
        "img_id": "y8-u7Xed4MiD1lU_YpTgAw",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Rainbow cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y8-u7Xed4MiD1lU_YpTgAw/o.jpg"
      }
    ],
    "user_id": "KXy4m5JDEegBLk5x9aiViQ"
  },
  "FftFNpwmz1yzUBQSp1z6_w": {
    "date": "12/4/2015",
    "text": "Massively overpriced, edible-ish canteen food in a drab location. No ice water or free water of any kind is served, so you have to buy drinks - and they are in the $8 range. The roast beef is quite good. The chicken \"burrito\" was just boiled chicken in a wrap with a pile of fries, admittedly enough calories for two but without much in the way of taste. The pastries are a bit dry, they'd be OK for a mall in the heartlands. Considering the amount of choice around Orchard, I don't understand why there are so many customers. I'm guessing Palate membership? Because that's the one reason to go - 50% off most things, bringing the price slightly below what is normal for what is served. For example, their burger goes from $24 to $12, about 10% more than the delicious EwF downstairs; and at $9, the roast beef becomes the cheapest steak in the area.The location is unfortunate. I'm sure they thought it was premium, and the side next to the escalators is alright if completely empty, but the side past the lift is straight out of the Harkonnen stronghold in Dune (the 1984 movie) - surrounded on all sides by either a massive drop, or industrial walls several floors high, with bad lighting and a bit too much AC, sitting on rickety metal chairs and Starbucks-style tables. It might look better once the works are finished; part of the issue is that one side of the sitting area where food is served is a construction wall.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvj9YfBp_XPM-3z1Es_P8w"
  },
  "PUX6rrS3ZmpCNpfSH-pZGA": {
    "date": "8/20/2012",
    "text": "So after hearing so much about Dean & DeLuca, I finally went down to try it... and was sorely disappointed. Perhaps there was too much hype around it, but even if I tempered my expectations a little, the overall experience there left me with a bad taste in my mouth.I ordered a coffee and a lox, which is smoked salmon on bagel. And since Dean & DeLuca is from NY, I kind of expected the bagel to be at least decent. It was not. The bagel was too hard and dry, and chewing through it took far too much effort. It did not fare well in taste either. What was worse, the smoked salmon didn't taste fresh. And it came in a large portion on top of my bagel. Normally, I would never ever complain about getting a large portion of smoked salmon... but it kind of felt like the salmon was going to be off, so they just wanted to be rid of it. The coffee there comes in a large disposable paper cup. It was so weak I could barely taste the coffee. My friend's tart tasted like cardboard and we couldn't even be bothered finishing it. Considering the prices they charge here, and how everything is meant to be gourmet, it's shocking.To add insult to injury, the service here really sucked. The staff were very unhelpful, and even when I asked for things, I either got ignored, or they just sullenly pointed in a general direction. Lastly, I really hated sitting under those awful bright fluorescent bulbs with the slight flicker. It gave me a headache after a while. We left the cheap tables and uncomfortable chairs behind in the dead space that is Dean & DeLuca.Hated it here. Truly.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_A9VxOh9qNIeCwVI3HZLrw",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_A9VxOh9qNIeCwVI3HZLrw/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "clT1yUOJILEThO21Fmpdwg": {
    "date": "8/7/2012",
    "text": "Came here for desserts one evening just before their last orders at 9.30pm (the restaurant closes at 10) so there was no problem getting a table. A friend and I shared a cherry tart and a tart with a chocolate and coffee filling. While the tart fillings were delicious, both the tarts had a rather soggy crust, as if they had been stored at the counter for days. I've heard negative reviews of their breads too. Most of the pastries and bread sold at Dean and Deluca come from Baker & Cook, a gourmet bakery at Hillcrest Road. The problem with outsourcing your food is the compromise on freshness, which is very obvious the moment you bite into their pastries. I've heard that their mains and brunch menu is pretty good, so I'll be back to give that a try!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JKWvOWLRN8-77W0HcN2rDQ",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JKWvOWLRN8-77W0HcN2rDQ/o.jpg"
      }
    ],
    "user_id": "-fUWq6sOIEe1uTUhNKS9sQ"
  },
  "--6hRTPvQtMRt4iAhXmDqA": {
    "date": "9/1/2014",
    "text": "Ordered the 2 eggs w ciabatta toast and added bacon. You get a choice between scrambled or sunny and I chose scrambled. Eggs were amazing but the toast was extremely disappointing. Soggy from the eggs being stacked. Bacon wasn't as cooked as I would've liked. I ordered the house brew which was good. Not too acidic. Staff however were nice and friendly.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xstC-Ob4v8E2QmmImKYqpA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xstC-Ob4v8E2QmmImKYqpA/o.jpg"
      }
    ],
    "user_id": "WwtoDN5mIBGo0-mYnzq_pw"
  },
  "LUuf9xUkTrpsOg17zcAMxA": {
    "date": "8/13/2012",
    "text": "If there's only 1 thing you gotta eat at Dean & Deluca, try their French Toast which is made from 2 1-inch buttery brioche bread which is coated with caramel and caramelized, topped with vanilla ice cream, bananas and some berries. Love that powered sugar coating. This is fantastic dessert food or make it breakfast if you have a sweet tooth. Don't worry, it's not as sweet as it looks. The ice cream kinda neutralizes things a little.The Eggs Ben however was disappointing. Even though jamon iberico was used, the flavors didn't gel together. Hollandaise sauce was watery and bland. Eggs were overcooked at first and they redid it. The sun dried tomato bread just didn't go with the whole get up at all. It was bland and felt a little stale. Definitely not the best I've tried.The iced mocha is great though. Love the caffeine and chocolate packed drink. I can't stop ordering it.If you are not hungry, just order some tart from Baker and Cook or perhaps a Quiche from Mayson Keyser. Both were decent if not good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "vBLBisyXGR7G5H88Q4Y-hQ": {
    "date": "12/17/2014",
    "text": "I went because I remember D&D from my time in New York where I occasionally bought something. Main reason: I was thinking of a great sandwich and I was out of balsamic vinegar. I went to sit down, but nobody came. Although there are several mm.. not waiters (although for once, the term would have been appropriate) - staff hanging around, they didn't seem to be interested. So I went up to the counter where I learnt that yes, this is where I had to order. I looked up at the options, didn't see sandwiches, and chose 'king mushroom & bacon quiche'. What I go in the end was a slice of some sort of sweet crumble dough filled sparsely with a vaguely quiche-like substance. Pretty awful. The expresso came without sugar or spoon: you also have to go and get that yourself.Altogether a poor experience. In the end I didn't even want to buy anything there.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BLCH29-jOurbrj1fsaQ3Hw"
  },
  "TGwjanS6OKlQZZtHRLcK2g": {
    "date": "4/12/2013",
    "text": "incredibly disappointing and wholly vapid food - even after tempered expectations - at the dean & deluca cafe in orchard central. I've been to their pretty shop - with highly magnified prices - before, read the dismal reviews everywhere on the blogosphere - and I still went because I was drawn to an image I saw online of their pancakes. it was a regrettable experience, and one that's made me feel quite a bit foolish.the pancakes seemed commercially pre-made and were rather stodgy, and the smoked salmon sandwich with scrambled eggs terribly salty. we left wholly disappointed - and it was a pretty expensive meal, especially for what we got - and so the emptiness of the cafe even at dinnertime (yes, I like breakfast for dinner) is rather justified. pretty place, pretty food, terrible taste - perhaps you might be better off going for their cheese counter or charcuterie and doing a takeaway with all their gourmet products. just steer clear of the food.",
    "rating": 1.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "aoW6Znpr-nF-AKAukvBilQ": {
    "date": "7/13/2012",
    "text": "There was so much hype about this New York deli coming to Singapore, so I wasn't sure I wanted to head there in the opening weeks where there were bound to be hordes of people checking out the new hip hangout.Still the crowd was not too bad on the Thursday night that I visited. I tried the Iberico Eggs (my poached eggs were a tad too cooked, boo, but the rest of it was pretty good) and the Portobello Cheese Burger (yummy and tender meat, huge portion). Not sure if it was where my table was but that aircon was COLD.After that filling meal, it's nice to be able to browse through the grocery section and look at all the lovely, lovely stuff I will never be able to afford. I foresee many window shopping trips here in the future, or perhaps splurging on a D&D mug so I can remind myself to aspire towards being able to afford a lifestyle like this!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xUHoUvw3CX3-ZtNgK-_bqw",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xUHoUvw3CX3-ZtNgK-_bqw/o.jpg"
      },
      {
        "img_id": "Tpco-qGxhl5Q7XbIWvprvg",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Tpco-qGxhl5Q7XbIWvprvg/o.jpg"
      },
      {
        "img_id": "9bJVVeYUKzrofmIemK9NLQ",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9bJVVeYUKzrofmIemK9NLQ/o.jpg"
      }
    ],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "4ouQnTf4rEtJ5pXk-OesQg": {
    "date": "9/2/2012",
    "text": "I don't really like the bistro here as everything is overpriced. No doubt the food is decent, but I cannot accept the fact that there's a lot of stuff we have to self service even after paying so much. The saving grace of Dean & Deluca for me is the gourmet market that carries a good variety of foodstuffs and produce that you don't see in supermarkets here. The goods here also make great gifts, thanks to the nice packaging they come in as well!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bEY1G8XxZP2lNRigZqghew",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bEY1G8XxZP2lNRigZqghew/o.jpg"
      },
      {
        "img_id": "8PgZUsC3r7s32HeR0kI7rA",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8PgZUsC3r7s32HeR0kI7rA/o.jpg"
      }
    ],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "oU0rN8TZdIaj_PqNN8nBCQ": {
    "date": "8/3/2012",
    "text": "I was at Dean and Deluca with a bunch of friends on a Friday evening. It was a challenge getting a seat/table but I suppose that's the way it is anywhere along Orchard on a Friday night. It was a delightful experience browsing through the shelves of grocery items and kitchenware in the shop but the prices of stuff there are slightly overpriced. They had a cheese and meat counter that carried imported European cheeses and the likes. I was there mainly for a chill hang-out session with friends so we didn't get any of their main meals. I had their blueberry cheesecake and sour cherry tart, as well as a green tea latte to go along. The blueberry cheesecake was enjoyable, not stunning but definitely above average. I liked their sour cherry tart quite a bit, tangy and fruity, it was very satisfying!My main complain is that the service was pretty slow. I was in the queue waiting to place my order for a good 20minutes. Overall, Dean and Deluca is a chic new hangout that serves decent desserts. Nothing mindblowing but it is a pretty aesthetically appealing place, offering a little bit of posh grocery shopping too.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WIsltNTvoWs8_2dYjdM5Vw",
        "caption": "Photo of Dean & DeLuca - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WIsltNTvoWs8_2dYjdM5Vw/o.jpg"
      }
    ],
    "user_id": "I0Ml519BP2Ya3-Ec5GgVgA"
  },
  "j-yZItD3Km1PS-Wrkji9_g": {
    "date": "12/10/2012",
    "text": "I lived in New York for a good 8 years and never frequented Dean and Deluca. However, I don't know if it's because I secretly miss New York, or because I am easily distracted by shiny things, but this D&D location had some sort of hold over me and just pulled me in.I was tempted to try their bistro for lunch, but then the prices were a turn off. If I recall correctly, it was about $28 for a cheeseburger, yet almost the same price for a caprese sandwich. How could a mozzarella cheese, basil and tomato sandwich cost as much as something with meat? Does the mozzarella come from a unicorn? I'm a bit confused how their pricing works.The store is very nice, and has lots of tempting things to buy. I ended up getting a $25 bottle of vodka sauce. It tastes okay, but nothing special.What I didn't like was that I had to wait in the same line as the people ordering food to pay for my vodka sauce. They had other cash registers throughout the store, why couldn't someone ring me up there? Overall, nice place to browse, and maybe have a cookie or some coffee, but that's about it.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "aWJd3_DzEXeSv7OlZi1QfQ": {
    "date": "10/15/2016",
    "text": "Note to Dean & Deluca: You can't advertise a \"classic Reuben\" and deliver a sandwich with chipotle sauce. I feel cheated.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UVsZ4EqRh4bb5fCgMJJEWg"
  }
}