{
  "EI5UAs6Nl8D0fEd4vGL1IA": {
    "date": "10/17/2018",
    "text": "Italian restaurant in Holland Village. Good solid Italian food. Both pizza and pasta are good though not excellent. Price-wise, a bit on the high side for the quality of the food. Usually gets packed during weekday lunches when they offer good value set lunch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "3QEzvYKxanQk8jzCsF8H3g": {
    "date": "8/10/2018",
    "text": "The food is decent (pizzas are excellent; lobster ravioli so-so; wet risotto very wet and quite unusual but not great; forget about mediocre antipasti). However, it is satisfying, almost like meals cooked by a loving grandma who is not a fabulous chef. The place has two qualities: it is very good value (especially when special 1-for-1 offers are on), and service is exceptionally warm and friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DoLCG_Em6OVRaqPhWJkOdQ",
        "caption": "Photo of La Nonna - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DoLCG_Em6OVRaqPhWJkOdQ/o.jpg"
      },
      {
        "img_id": "e8A_DSft8RwWuBqyKAqYWQ",
        "caption": "Photo of La Nonna - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e8A_DSft8RwWuBqyKAqYWQ/o.jpg"
      },
      {
        "img_id": "D6CcpLEUSHhH4yGrddvv7A",
        "caption": "Photo of La Nonna - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D6CcpLEUSHhH4yGrddvv7A/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "Ax56uqyrphkfmBbkkQe0eQ": {
    "date": "3/30/2016",
    "text": "I've come here so often since I found out about the 1 for 1 weekday lunch special. It applies to pizzas, pastas and main courses, and is such a great deal for delicious food!! Reservations are usually required for large groups though, and if you're in a group larger than 5 you may end up seated at the upper floor where service is much slower. The food, though, is so solid. It's become my go-to Italian place in Singapore & I always try to find weekdays I could visit it during the holidays. Most recently, I had the pappardelle (Homemade Pappardelle Pasta with Oxtail ragout and Rosemary) and La Nonna signature pizza. I've also tried the main course once (ribeye I believe). Service is usually quick and glasses are always topped up quickly. My friends and I rarely have anything to complain about La Nonna. I've never come for dinner though, so can't speak to the dinner or set menus. It's such a great location that you can always head across the road after to The Daily Scoop for Ice Cream or Sunday Folks for waffles!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-NFB19PBe72hRxeZeafVdg",
        "caption": "Photo of La Nonna - Singapore, Singapore. + pappardelle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-NFB19PBe72hRxeZeafVdg/o.jpg"
      },
      {
        "img_id": "OOSFNzCj3HLeQ7Y9XM-Mlg",
        "caption": "Photo of La Nonna - Singapore, Singapore. delicious pizza with truffles and egg!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OOSFNzCj3HLeQ7Y9XM-Mlg/o.jpg"
      }
    ],
    "user_id": "YwxjrOYe1X5bJxWtmiENQQ"
  },
  "r_kcCl2-N4709wVcgtgdpQ": {
    "date": "7/7/2015",
    "text": "Food is decent, worse than on a previous visit a year or so ago, but I'd go back mainly for the ambience and fantastic 1-for-1 pasta/pizza/main offer during weekday lunches.The starter bread rolls/crackers looked pale and under-baked so I didn't even bother trying them. We shared the lobster ravioli (3.5 stars), which my friend really enjoyed, and the crabmeat linguine (3 stars). I'd had the former on a previous visit a year ago or so and it seemed like the standards have dropped. For the latter, we asked for an aglio e olio sauce instead of the tomato cream sauce it typically comes with so this review isn't of the crabmeat linguine on the menu. I'd had the dish here a year ago and thoroughly loved it but this time it was rather lackluster. Ample crabmeat, but somehow the dish wasn't very flavorful. I'll have to hunt down another place for crabmeat pasta now...I was a little annoyed that the waiter misunderstood us when we asked for the crabmeat linguine to be prepared with an olive oil sauce, brought a plain aglio e olio pasta, then said he'd have to charge us for it since they'd prepared it for us. Nice try buddy. I pointed out (nicely) that it was an error on his part and he agreed to correct the order, though he emphasized that he was making an exception. One of the other waiters who helped us out made a couple of jokes and we appreciated his friendliness! Service really depends I suppose. Other than that I adore the ambience, and we paid $15 each so I can't complain! Wasn't too crowded on a Tuesday afternoon but it's easy to make reservations. I made reservations two hours before.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "gzzuIVA8aOjE3OL_ZNbthw": {
    "date": "5/26/2014",
    "text": "Came for lunch with friends and ordered:Calamari - still the same, crispy but can do with more seasoning.Portobello - this is a starter I shared with friends. Plump mushroom grilled to perfection. Delicious!!!Squid Ink Pasta - not to be consumed on first dates!!! But since Im only out with friends, eat away!!!! Pretty tasty and ingredients were also fresh. Just wish there were more really...An enjoyable meal nevertheless as they do make very decent pastas.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "ttXdLBBOQe0YM_pSP377OA": {
    "date": "12/4/2014",
    "text": "How could the quality go down so drastically in such a short period of time?? The prosciutto e rucola pizza we loved so much was sad. The prosciutto was way too chewy and the arugula was wilted. The only improvement was the quick service and the fact that they opened up the 2nd floor seating. I hope this was just a miss and La Nonna is not compromising quality due to the large flux of customers during lunch hour.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xd8dPasNWNiy28rtqksD-g"
  },
  "nlQBDj8iJaA4yaxBbf6pjw": {
    "date": "8/25/2012",
    "text": "Although La Nonna has been around for a while in Holland Village, I have not checked out the restaurant until earlier this year.  Homestyle causal Italian dining is brought to us by the guys who own Senso. A friend organized a lunch meet up there and since, I have been dining there for lunch when I am in that neighborhood. Well, why lunch? Coz they have an attractive promotion 1-for-1 for entrees between 12pm - 2.30pm. Alternatively, you can try their 3 course set meal with coffee/tea at $22 ++.  The lunch portions were rather generous too! I usually end up sharing with my friends as I can't finish a portion myself. The dishes that I tried and love here are Mozzarella e Parma, Carpaccio and their lasagna. Definitely great for lunch meet up.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "_-knWJYeW1ihecKe5CElkQ": {
    "date": "8/29/2012",
    "text": "La Nonna is an Italian restaurant in Holland Village. This place is actually pretty good and I had a pleasant experience dining here. They have an indoor and outdoor sitting area (outside is nicer). I ordered the gnocchi last time I came and it was pretty tasty and cooked well. It can be hard to find good gnocchi here in Singapore but this place was good. No problems with the service. A nice place to get Italian food in Holland Village.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5cPigiT7e5MjRYQx3DR6nQ",
        "caption": "Photo of La Nonna - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5cPigiT7e5MjRYQx3DR6nQ/o.jpg"
      }
    ],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "k6R8cMlvj07hmJ-cAb8o_Q": {
    "date": "5/25/2013",
    "text": "decent-enough desserts at this well-known trattoria along lorong mambong. this place is known more for their well-reasonable set lunches - but that's paltry. sweets! we came here for desserts-only after lunch at al hamra; and it did us well enough, even if it was nothing too special.they have a menu of typical italian desserts - we settled on the lemon meringue tart and a pannacotta, the latter of which really is indicative of the skill of the restaurant. the tart had a great crust - buttery lemon curd (though slightly gelatinous) and sufficiently-fluffy meringue on top, and it tasted the way it ought (average food truly don't make for descriptive adjectives).that pannacotta, though - I'm still on the lookout for a great rendition. this one is a little on the stiffer side, but still creamy enough not to offend. it didn't have those beautiful black seeds though - so I'm guessing extract in this one.it's difficult to be more descriptive - but if you're skipping it all to the last line - this place is alright if you're in the area, though I wouldn't travel for it.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  }
}