{
  "MEwXYf6FutNkMc8LAUYL0w": {
    "date": "5/12/2015",
    "text": "Nice sandwich place, very casual and with a good offer of food and quite good quality for the price paid. It's not exactly cheap, but it's in a prime position so I found the food/price mix correct in the end. We had a burgher and a BLT sandwich, all very nice and well presented. If you are in for a quick bite it's a nice place to go.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6G3tlx3-W5IH1lmaPXBSoQ"
  },
  "SS-p4QurokwcKN0Kbo7UNw": {
    "date": "8/14/2012",
    "text": "Really like the way the cafe is set out - open, with high ceilings, huge glass windows surrounding the place allowing lots of natural light to come in - its a great place to stop for a coffee in such a convenient location just 2 mins walk from somerset MRT. Of course we all know that they coffee here is done really well - a little strong for me personally, but that's really a matter of preference.Of special mention however should be their Arancini - fried mushroom risotto balls that ooze flavour and cheese.  I have yet to try a better arancini elsewhere and it has me constantly going back for more!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i0EtSwyP5SyesBjNvOnIQw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i0EtSwyP5SyesBjNvOnIQw/o.jpg"
      }
    ],
    "user_id": "tZ437GvGPzH9Hx11p32fdQ"
  },
  "w7EXIvg041aSEKSm5FvQsQ": {
    "date": "8/14/2013",
    "text": "Service was bad. Coffee was okay. The waitress are not very friendly. The only thing that makes it worth is the food. Fish and chips and the bangers and mash was good.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hDoAQOJqTHxqmi-_2vQQUA",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hDoAQOJqTHxqmi-_2vQQUA/o.jpg"
      }
    ],
    "user_id": "n-MY_VgYQOHTjRLSsb11lQ"
  },
  "0LAlQl5KD6nkxJkNcFrx9Q": {
    "date": "7/19/2012",
    "text": "Coffee here started out very good, but became only okay after a while. Food quality is quite inconsistent; the same pasta that I enjoyed can taste too peppery and bland on the next visit.Brunch is okay, nothing to shout about. Given that everything's average and you come here on a chance that you may get lucky with food/coffee that day, there's however something about this place that makes it great to hang about with friends (maybe not the nights with live music when you have to compete with the booming amps). If you sit outside, you can also watch all the beautiful people go by.I'd still give Oriole 4 stars, because I like it there when I'm with a group of friends, it's a nice feeling, and I really want to like this place and think it has the potential to be better.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "FEk-lRC9Wmbu0w42rukoZg": {
    "date": "9/14/2012",
    "text": "Great coffee! i love the latte and the affogato. the vanilla ice cream they use in the affogato is deelish.  some days they have buy 1 get 1 free deals if you're using american express.this is also one of the places that have captain morgan spiced rum :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PS0uGpc0Cwx40hMk6zolag"
  },
  "z5oW2epRGrVk4q0qgzWo9A": {
    "date": "10/28/2012",
    "text": "The good: Attentive staff, tasty latte, good location for people watching. Will return to try their brunch because it looked good. The bad:  Food was average at best.  My Cuban tasted like it came from a P3 baking class.   The ugly: Has a little bit of everything, which makes its difficult to tell what the place really is. Cafe? Bar? Restaurant? Fusion?  I've been a few times and I still have no idea.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gyBH_pVycVOnjikFVXuBQ"
  },
  "kmIilnyp54hV829RK5UHUw": {
    "date": "7/11/2010",
    "text": "Oriole is owned by Keith Loh, Singapore's current champion barista. Head Barista and Assistant Manager is John Ting, who came in 2nd at the Singapore National Barista Championship. That's right, Oriole has the two best baristas in Singapore, and it shows! If I were still living in Singapore, I think it's safe to say that this would be my favourite coffee hang-out. In fact, I've been here three times in two weeks. Coffee prices here are just a little more expensive than the chains before factoring in service charge, but it's well worth the extra money. The staff pick their coffee with care, as Ï witnessed when I swung by yesterday, with a helpful chap talking me through the beans they used when I wandered over to the giant coffee roaster (named Ella, so I've read). He also mentioned that they were expecting some really nice coffees in a couple of days time so I should return. I will definitely do that, even though I don't own an espresso machine (yet) and only have a Bialetti. The best drinks to have here are the piccolo latte (comes with two shots), the chilii chocolate mocha and the citrus sin! The last two are drinks created by Keith for the World Barista Championship, and both were really nice indeed. For the chili chocolate mocha, I couldn't taste too much of the coffee, but it wasn't overwhelmingly chocolate-y either. It was a tad smokey (which I liked) and the flavour of the chili got stronger as I drank more of the beverage, but not enough to kill this chili weakling. As for the citrus sin, it was absolutely fantastic. It comes with a slice of orange so that you can squeeze the juice of it if the drink isn't citrus-y enough for you. I didn't taste very much of the citrus, but it was very smooth, and by far one of the most delicious coffees I've ever had. Two thumbs up! The latte art has been of a generally high standard, and I was only disappointed once, when my friend's piccolo latte came with three somewhat splotchy white patches. Possibly, they could have been three separate flowers, but, to me, they looked... messy. But enough about the coffee. What about the rest? The food was so-so, to be honest. I have had a set lunch consisting of crab and corn soup and a spaghetti bolognese, and a prawn aglio olio. All the dishes were decent, nothing much to complain about, or shout about. The cafe is very cosy. It's fairly dark in here, and tables are generally well-spaced so you never feel as if you're being crowded even when the place is full. I like the lighting fixtures for some reason. Very modern without being too showy. The ceiling with the exposed piping toughens the place up a little so it doesn't look pretentious. So, if you haven't already been able to tell, I love this place. I will do my best to return before I go back to London, even though I have several other coffee places on my list to check out. And given its late opening hours, I don't think it'll be too hard for me to do so!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2vwprCitv_yKE7oMXzNEaw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2vwprCitv_yKE7oMXzNEaw/o.jpg"
      }
    ],
    "user_id": "Vt_lIJ3gqZ_Vm4p2fAqMGA"
  },
  "xnIwVXb4FeLemIGRn5wbTw": {
    "date": "8/7/2012",
    "text": "As others have said it used to be good, and not it's alright. Not great. Not even good most days. It's a pity because there was so much hype. Someone somewhere won a barista competition. It hasn't trickled down to the rank and file.The food is also average. So is the coffee. It's still a good meeting spot if you're in this area, though, but these days I would rather go to Brotzeit right across where I know I can get beer and okay stuff overall, than pay similar prices at Oriole, whose USP should be the coffee, but it isn't anymore.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ml61UOrHtdUCwW0JcTM_Vg"
  },
  "6uPBisCr-U4KDZ9mR662Eg": {
    "date": "8/5/2012",
    "text": "Located conveniently in the heart of town, Oriole Cafe is a staple of the crowds of Orchard Road looking to perk themselves up with a caffine rush or to pick up some good nosh. I had a meal there during the festive season during which they dished out pretty unique bites like Ali Baa Baa ($16) is a unique offering where a tasty grilled Turkish lamb patty is paired with haloumi cheese, baba ghanoush, tomatoes and flat bread. For the ones with a well-travelled taste palette, the spices of the Middle East offers pleasurable flavours in one hearty burger. The Cod Fish Hash ($21) of smoked Norwegian cod fish, potato and poached egg.I was especially looking forward to some coffee since Oriole Cafe is known for its blends. The espresso I had was a little too watered down, figured later on that coffee days at Oriole is only good with the right person behind the machine.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8vFfu8VMe9EAhDcphjDuQ"
  },
  "RzG5buLLQG2XdyxjJmg4eg": {
    "date": "9/9/2012",
    "text": "When two champions from the Singapore National Barista Championships come together to helm the Oriole Cafe and Bar, you can be assured of the quality of this food and beverage outlet. Owner Keith Loh recruited John Ting and they have created an institution for coffee lovers to indulge in great coffee previously found only in the cafes of Europe or Australia.It also doesn't hurt that the menu includes kick-ass mains such as the oriole burger and grilled NZ lamb rack, as well as flavourful pastas. I would end the meal with a light dessert, either the eton mess or the apple strudel, along with a flat white or the americano.A meal at Oriole is money well-spent on great food and drinks, whether for lunch, brunch or dinner. Or even just a cuppa as you rest your tired legs from shopping.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37veRneM-BBpXzSNw-jCGw"
  },
  "pn9DNUJ9fl2dflsG4eZQxA": {
    "date": "7/24/2012",
    "text": "What I liked most about Oriole has to be the atmosphere. We went there at night for a drink and the place was quiet with comfy seats and friendly waiters, the perfect place to just hang out and talk to friends. We missed the happy hour from 5 pm to 8 pm but after 8 pm, there are different promotions for different days. Since we were there on a Monday, it was $8 each for a choice between three different bottles of fruit beers, Lindemans Raspberry, Lindemans Peach or Wittekerke Rose. The Lindemans beers were sweet but tasted better than the Wittekerke in my opinion. We also had a carafe of Berries Daiquiri for $38 which was actually really good. What I didn't like so much were their desserts. We ordered an Eton Mess and a Banoffee in a Tumbler. Both were exceedingly sweet and not very enjoyable after the first few bites, so we didn't finish the eton mess. There was also quite a lack of fruits in both although the traditional eton mess is supposed to have loads of berries in it. For a post-dinner drink, we were quite glad to have gone to Oriole where we managed to enjoy a few hours of catching up before they closed at 11.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5av7ZYxifKl1jPttRSvt7Q"
  },
  "5LSdNHdQrTjUV6rWGI0j5w": {
    "date": "8/9/2012",
    "text": "The founder of Oriole, Keith Loh, really knows his coffee inside out. He won a National Barista Championship before, and has had great reviews about his blend of coffee. Housed conveniently near 313 Somerset, I always see his joint bustling with activity. Oriole's ambience might not be on par with that of the slumber-like comfort of Dr Café or have the element of mystery at Papa Palheta, but its polished elegance definitely will win over many fans. Especially those stylish worker-types who might want to come here to unwind during lunch hours. Keith Loh named his roaster Ella, after the highly-acclaimed chef Nigella Lawson. Without a doubt, the coffee is amazing. Try the chilli chocolate mocha, to spice up your day. For mains, I had the Bangers and Mash ($17) because i was feeling simple. One can't usually go wrong with the easy to prepare dish, but let us say I was not let down. Other interesting things on the menu include the Risotto Garlic Prawns and Oriole Knickerbocker Glory (for desserts)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "zK3IRcCnIHjQdo9xS5HHfg": {
    "date": "11/4/2012",
    "text": "My wife was craving western food, so I attempted to find a halfway decent place near Orchard Road.  I do mean attempted, as the 3G connection on my phone slowed to a halt, so we finally resorted to looking at menus and guessing how close to the mark the food would be.I had a cubano sandwich, while my wife had the house burger with sweet potato fries substituted for the standard fries.  The cubano was a pretty good approximation of the real thing and my fries were really, really good.  My wife's burger had all the trappings of being a great burger--high quality meat, toppings, bun, etc.--but the taste didn't quite come together; the whole was less than the sum of the parts.  I think, in hindsight, it might have been the condiments/dressing causing trouble.  No matter, though, it was still a pretty good burger.  The sweet potato fries looked right, had the right texture, and smelled right, but their flavor was a bit lackluster.  Perhaps we caught them on a bad night or perhaps they just need a tad more seasoning.  We finished our meal off with a banofee--good, but not terribly challenging to make.  Oriole has a nice outdoor seating area that's both covered (in case it's raining) and has fans (in case it's an exceptionally warm day/evening).  It's also close enough to the rest of the stuff at 313@Somerset that it has a trendy but comfortable city vibe.  Overall, if I were back in the US, I probably wouldn't go back for anything other than the atmosphere, but on the other side of the globe, it's a reasonable facsimile of an upscale American style restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Tpb9XWIyID7KRBCh1iScQ"
  },
  "h_xy_TpF29OrxH2ECbSPsA": {
    "date": "8/16/2012",
    "text": "The first time I stepped into Oriole was way back when 313 Somerset was still under construction and hasn't opened yet, you have to walk through the Pan Pacific Serviced Suites to get to it and I thought I found the best hidden gem ever...it used to be really quiet, peaceful with superb coffee to boot! That is until Somerset 313 opened and everybody knew the secret of this treasure.I love the interior of this place. If you step in in the evening, it's got this romantic chic restaurant vibe that's not too formal but not overly pretentious either. The piccolo latte is a favourite, perfectly smooth you don't even need to add sugar. If you're adventurous you can try out the chili chocolate mocha with cinnamon, that drink packs a punch!Oriole is also a nice place for brunch, it's always buzzing with a good crowd, guess people are not just here for the coffee! There's also happy hours and some tempting lunch sets.The only downside is that it doesn't serve coffee after a certain time, 7 or 8pm. I came here once in the evening to get some coffee but was told they don't sell it at that time! Bummer!Final verdict: Very charming place that flirts with its coffee but brings it home with the food and ambience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "091TX2LEHxwzB4zWZyK-fg": {
    "date": "10/24/2012",
    "text": "Best Western coffee in Singapore. Flat white 10 out of 10. Delicious ice vanilla late.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j79xrWLgnfhxilCLRsAfDg"
  },
  "DQus4ipO-PVdodJ6niQbRw": {
    "date": "11/7/2011",
    "text": "Really nice layout & ambience, inside AND outside. Food is decent but coffee is even better ;) definitely worth visiting, especially with such a great location, it's very accessible but still provides that momentary get away from the hustle & bustle of town.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "v65xMLA4qHdGNyKBsXRipQ": {
    "date": "8/31/2016",
    "text": "The cafe is located within walking distance from the MRT station. There is both indoor aircon and outdoor open air dine in area. There is free wifi in the cafe, as free wifi from the mall. The indoor are was a tab dark in lighting. Grilled Truffle Cheese Sandwich ($14)Grilled buttery brioche bread stuffed with truffle cheese, emmental cheese and oak-smoked cheddar, served with tomato cheddar soup.The truffle oil smell was a tab light. The cheesy crispy sandwich was delicious when dipped with the tangy tomato soup. I wished that the soup could be served smoky hot. It was just warm.Smoked Salmon Rosti ($16)Crispy potato rosti topped wti h smoked salmon, capers, creme frachie and fresh onions.The rosti was not quite what I was expected. I suspected it was machined shredded as the potato was long and thin, making it dry without the mushy potato texture. It made one felt like having potato noodles. The creme frachie was light which balanced the salty smoked salmon, although I preferred the strong flavoured sour cream to go with it.There is a free regular coffee promotion with every order of weekend brunch items. Since I ordered 2 brunch items, I had as Cappuccino ($5.50) and Latte ($5.50) as the free drinks. Could not taste the different between the both drinks as both are quite milky.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_5i_8p6bWMVCJr1u0dA17Q",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Grilled Truffle Cheese Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_5i_8p6bWMVCJr1u0dA17Q/o.jpg"
      },
      {
        "img_id": "yPTUynum3NEoWQ4c09oDKg",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Smoked Salmon Rosti",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yPTUynum3NEoWQ4c09oDKg/o.jpg"
      },
      {
        "img_id": "zYNdAJq3MvAp0HoSKYV5RA",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zYNdAJq3MvAp0HoSKYV5RA/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "zVuqwteR4tEZodEqwIdPDg": {
    "date": "10/5/2016",
    "text": "I'd give it more stars if the service wasn't so terrible. The coffee is great and the food was decent (though on the pricey side - 2 eggs on an english muffin was $13). Theres enough for vegetarians plus a lot of interesting-sounding coffee-infused dishes, like coffee braised beef. It took over 10 minutes for someone to come take our order once seated. She then placed the order incorrectly - perhaps this would be solved by writing it down? We had to go inside and hunt someone down to tell them what was missing and what was incorrect and to ask for salt & pepper.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v0XY9wXMNFbzHFOFO-JWrw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Iced and hot lattes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v0XY9wXMNFbzHFOFO-JWrw/o.jpg"
      }
    ],
    "user_id": "3UfaNU33lD86wnyAIwyhzA"
  },
  "mA7ER4mYLLyvSIjW0j0zhw": {
    "date": "2/16/2016",
    "text": "Oriole Coffee + Bar has been around in the Somerset area for a bit now but it was never a choice cafe for me until recently. With its refreshed food and beverage menu at its Pan Pacific outlet, there are now more choices for my picking!All day breakfast FTW! I really liked the Humble Baked Egg Skillet ($16), which is a hearty mix of tender and flavorful roasted lamb stew with sweet potatoes, sous vide eggs and Emmental cheese to add on that creamy and stringy texture. They really ought to serve bread with this massive pan. I highly recommend that you have this to share because it's really quite a huge portion. While i don't see myself having this at 8am in the morning, this is certainly perfect for brunch, or dinner.The other new all day breakfast dish is the Jumbo Breakfast Burrito ($16). On paper, it sounds perfect with the Spanish chorizo, scrambled eggs, chipotle puree and smoked cheddar. However in reality, the filling tasted more like an Asian fried omelette. With a burrito, you gotta go big or go home and this was kinda lacking in the flavor department. The guacamole looked a little too liquified (and packaged) for my liking.I enjoyed the Fish Tacos ($20), which had generous pieces of battered snapper paired with avocado and mango salsa, chipotle aioli, and red cabbage slaw. That chipotle sauce had a tinge of curry to it strangely but it really pulled the dish together. Would love for a crispier batter but this will do. For the non-carb version, go for the Fish n Chips, which uses the same battered fish.I never understood well done meats so i absolutely do not get the Country Fried Steak ($22), which looked like a crispy chicken fillet when it was served. Well well... 100-day dry aged beef or not, this was dry, grainy and powdery, which is not what dry aged is btw. Poor cow died in vain..The same situation repeated with the Espresso Rubbed Rack of Lamb ($32). I was desperately searching for the pink bits but I failed. Another Australian grass-fed lamb that died in vain. I wouldn't mind having this bittersweet dish if the meat were medium rare and there's more of the buttery and savory carrot puree. Oriole Coffee Cake ($14) was my super love. This is a coffee-textured chiffon cake infused with Oriole's signature house blend coffee. It looked super dry but looks can be so deceiving! This chiffon was super light, fluffy and slightly moist too. Don't go expecting a flowing espresso crème anglaise core though, it's really NOT a lava cake. That said, that espresso sauce was so damn rich and velvety good. LOVE. And HELLO espresso jelly.Another hit on the list is the Death Cream ($9). This be the death of all hard core yoga sessions but the deliciousness is worth all that calories. Super concoction of vanilla beans, espresso and cream, which came out of a popular 1980s secret coffee recipe. Think of it as a melted coffee ice cream with lots of vanilla bean specks. So DAYUMS good.Another new drink is the Haute Chocolate ($8), made from single-origin Valrhona Chocolate (66% Cocoa). It has a tinge of sourness which is characteristic of raw cacao. I thought the cold version was quite watered down at the start, but as it warms up, you get more of the flavor. I reckon the hot version should be more intense. You could have this with milk as well.So another feature at the flagship outlet at the Somerset outfit is the Tasting Bar, where you can learn more about the coffee.  New options featuring Single Origin Coffee, Kamiro Lot #103 and Buesaco Microlot #1, will also be available. If your date enjoys coffee, this is the place to head to. For all the other times that you need a quick perk me up or grab and go, Oriole's takeaway counter will set you up with some pastries or cakes for $5 a pop. I'd definitely grab one of those Pistachio Cake, or Red Velvet cupcake with coconut cream cheese frosting! Along with the Death Cream of course!So Oriole Coffee + Bar is back and better. Something needs to be done about their service still (it has always been a problem), but i may ignore that for a bit, as long as i have my Death Cream.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "JjUn_VmNsmm0CONfzbdvsQ": {
    "date": "2/27/2016",
    "text": "Haven't been here for years.They have renovated.Indoor air conditioned cafe with plenty of outdoor seats.Many types of coffee. Will try Taisho another time.Has a good selection (7) of all day breakfast.4 salads From 11 a.m. onwards they serve their main courses (4 sandwiches & 9 classics) and small plates (3), pies (2) and desserts (6) of pudding, cakes and waffles.There are also cocktails, wines and sweet wines.We had: Cappuccino - hot but would prefer hotter.Oriole Truffle Burger - brioche bun, suvee-cooked beef patty, sautéed mushrooms, caramelised onions, mixed greens, melted cheese, truffle aioli, served with Oriole-spiced fries - $18.Fully Loaded breakfast \"Breakfast of Champions\" - a choice of 2 juicy pork or cheesy chicken sausages, 2 eggs done any style, maple glazed bacon, air-dried tomatoes, mushroom, baked beans and toast - $20. The chicken sausage was a total disappointment. Not tasty at all. Overall, good food and nice ambience. We still like this place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "POkmFTsTUVZZ0wnInPxvlQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Fully Loaded all day breakfast. Chicken sausage was tasteless.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/POkmFTsTUVZZ0wnInPxvlQ/o.jpg"
      },
      {
        "img_id": "s4tl36TrL3zzWSo6AwtjXw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s4tl36TrL3zzWSo6AwtjXw/o.jpg"
      }
    ],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "3T8A2bsC_Dvy268inOwFCw": {
    "date": "1/1/2016",
    "text": "One of the veterans on the Singapore speciality coffee scene that at this big location on Orchard Road do so much more than just coffee. This is more of proper all-day restaurant as the open at 8am and stay open until 11 or midnight depending on the day.There is a large outdoor seating area as well as lots of space indoors. The place looks pretty decent, has free wifi and while I like sitting inside to watch the baristas at work I generally end up seating outside as there is more space there.The menu is fairly long and has all-day breakfast dishes as well as salads, burgers and some other filling food. In general the quality is not bad but also no any wow experiences. Unfortunately the same goes for the coffee, it is clearly better than most places and the coffee flights are a nice touch but they never reach the heights of the really good speciality coffee places. Service is also very much hit and miss but my local friends have told me my expectations of service will not be met in Singapore. Still if you are on Orchard road this is a good place to go.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bbjXXzNZhU5bQbvTdHd1hA",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bbjXXzNZhU5bQbvTdHd1hA/o.jpg"
      },
      {
        "img_id": "wh7NwI4hgQTa1aEmwwUigQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wh7NwI4hgQTa1aEmwwUigQ/o.jpg"
      },
      {
        "img_id": "-PWepwqkNOK3gIiQYQX9xA",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Espresso machine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-PWepwqkNOK3gIiQYQX9xA/o.jpg"
      }
    ],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "e4aof3t45tIC1Idh1l_5SA": {
    "date": "2/7/2017",
    "text": "The lunch starts at 12pm, so I had to stick to brunch menu. I chose egg Benedict with lamb (something like that ). It was delicious. The lamb stew covered with half cooked egg... the egg yoke blended so perfectly with the lamb ... I had a cup of single origin coffee, and they only served Kenya's. it was okay overall",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8jNWgROq0OfYtR5gYWnENw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8jNWgROq0OfYtR5gYWnENw/o.jpg"
      },
      {
        "img_id": "N3MrtTqdJsUL0hcEET4xOQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N3MrtTqdJsUL0hcEET4xOQ/o.jpg"
      }
    ],
    "user_id": "aFXnLTwv-dWdbFC-2b-kdg"
  },
  "A7S3utdhC14Lalm9vdGAKA": {
    "date": "2/23/2016",
    "text": "This place is in the back court yard of 313 Somerset, attached to the Pan Pacific Suites building. I have been walking past this place for some time now, and finally decided to give it a try.Its a cafe+restaurant+bar with outdoor and indoor seating. I love the rustic decor. It seems good for group gatherings, business meetings, etc. The service was mediocre, it was hard getting the waiters attention. At one point I just got up myself and got salt off the shelf. This place is more on the expensive side, but then again it is comparable to every other restaurant in the area. What isn't expensive in Singapore? Anyways, lets get to the food.For appetizer, we ordered the Spinach Truffle Salad with a poached egg. This was pretty good. The only downside is that they shave in the truffle on top, so you really don't taste it unless you get a piece of the truffle in your bite. Entrees, we got the:Truffle Burger - The burger itself was pretty good and it definitely hit the spot. Although, it could be because I haven't had a burger in a long while. The down side again was that they only shaved two slices of truffle on top of the cheese, which you really couldn't taste it at all. I would've added truffle oil to the cheese to give it that truffle taste. (As you can see I'm a huge truffle fan) For $18, I wouldn't say this burger is worth the price. Beef Cheek Tagliatelle - We ordered this because we saw that this dish was pretty popular on yelp. The beef cheeks were delicious but we wasn't a fan of the sauce, it was lacking in salt. It also could've used some Parmesan.  Finally for dessert, we ordered the sticky date puddling. I have to say it was pretty damn good! You have a date cake, drizzled (ok more than drizzled) with caramel on one side and ice cream on the other. Together it was just amazing. Highly recommended! (edit: I thought I took a picture of this, but I guess the second it landed on our table we devoured it :))Food was alright, but we would definitely come back for the dessert and some drinks!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p_X5Q02LjBFBQFyKvJ8bQQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Truffle Burger w/ seasoned fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p_X5Q02LjBFBQFyKvJ8bQQ/o.jpg"
      },
      {
        "img_id": "HlYLuJ1zHZ2FNK7-9keE5Q",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Beef Cheek Tagliatelle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HlYLuJ1zHZ2FNK7-9keE5Q/o.jpg"
      }
    ],
    "user_id": "x2c99o2Tp6m26T0Y5ZgAcw"
  },
  "S-oxoMrjIDGTNHvNdWSopw": {
    "date": "3/3/2016",
    "text": "What I love about hanging out a Oriole? Hmm, let's see.- Great food (love the beef tagliatelle, fish & chips, mad milk, flat white with mad milk, hotcakes, wraps, warm spinach and the list goes on)- Free Wi-Fi! Who doesn't love a spot of good wi-fi that never drops off?- Friendly staff who recognizes you and goes the extra mile to make you feel comfortable. Ask them a question about a particular ingredient on the menu, and they will shower you with a detailed explanation about it. Gotta love the attention to details and the obvious passion. One time, I felt really cold at the big seating area and asked if I could switch seats to the other side of the cafe. The cafe manager told me that the other side was full and he apologized for the chilly temperature. He asked if he could bring me more hot water. A while later, he brought over a huge cushion. I was puzzled until he explained that perhaps 'the cushion will be able to keep me warm'. How sweet is that!- Good coffee. You know how different people love different types of coffee? The default coffee that I usually order is a Flat White. I like a strong-bodied cup that is not too bitter/acidic. Oriole's sits just right with me. The cafe is located in the most central of all locations and is my go-to place to chill, relax, meet up with friends for a cup of good coffee/dessert. Or just a place to have some me time and read a good book.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "KBmFdIBL3L1cMAc0SOzHVQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Flat white with mad milk. Soba with tobiko, salad and Orioles special dressing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KBmFdIBL3L1cMAc0SOzHVQ/o.jpg"
      },
      {
        "img_id": "gA4ihfYB77VSXPgahEFbOA",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gA4ihfYB77VSXPgahEFbOA/o.jpg"
      },
      {
        "img_id": "CP9xTn6ZLrWglAEvCkXrdQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Hotcakes, flat white and gold moscato tea. What more can one ask for?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CP9xTn6ZLrWglAEvCkXrdQ/o.jpg"
      }
    ],
    "user_id": "ZNyfGsIwsedPlpjmoaq3Eg"
  },
  "s1_NHIq45Z11WvjLazWUzg": {
    "date": "10/3/2016",
    "text": "I'll be back!! For sure!! Good coffee!!Love their Caesar wrap!! Too hungry, hence no picture. Lol",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l17zwEZjhUrs8NelubtSxA",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Menu :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l17zwEZjhUrs8NelubtSxA/o.jpg"
      }
    ],
    "user_id": "LrzKBLOgxyRp2xjv0kgwmw"
  },
  "fRnqJCPKee2_l3GeKxVbkA": {
    "date": "8/24/2015",
    "text": "One of my favorite places to go with my friends!They started off as a restaurant, but recently revamped to a cafe-bar style set up. Their manager, dexter, is also super friendly, though I cannot say the same for some of their other wait staff. They make the best sangria I've had in Singapore (so far), and the best part, it's 1-1! I prefer the red because it's closer to the ones you find in Spain. They also have 1-1 for draft beers, house pours, and others. They also sell this nut milk, which is a little pricy, but really good. Food wise, I'd recommend the prawn risotto. The broth they cook with is very rich, unlike some other places. Do come early so you get seats indoors. It can get quite warm outside.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "QwJ0sijg_BDUadleUhwoiQ": {
    "date": "1/29/2015",
    "text": "This outlet was recently renovated and I'm loving the new look. Although I never visited here before all the changes, I still enjoyed the ambiance and my meal was great.They surprised me with their portion sizes. Unlike my last review, where the burger cost $20++ and didn't include fries, the Cuban sandwich I ordered was huge AND came with fries and a small salad... for a little under $20. Pretty good deal for Singapore! My eyes were definitely bigger than my stomach, and I could only finish half of the sandwich. I'm happy they didn't scrimp on the ingredients.Upon the recommendation of Yelpers, I ordered the Taisho cold brew and it was a perfect ending to my meal. I just wish it was easier to get water, as the glasses that they give you are pretty small and it's hard to get the attention of a server. I ended up just going back and forth to the water pitcher/dispenser thing throughout my stay. But still, great place to chill on the patio, people watch, and enjoy a cuppa!",
    "rating": 4.0,
    "rated": {
      "useful": 10,
      "funny": 4,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "sVkg8qYHAepmsv00Fv8W4A",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. The Cubano comes with fries. I like them already.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sVkg8qYHAepmsv00Fv8W4A/o.jpg"
      },
      {
        "img_id": "FrKKarV464yiCSncGMD1xg",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Outdoor patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FrKKarV464yiCSncGMD1xg/o.jpg"
      },
      {
        "img_id": "ccigHhsC7EI68Mx7Rb1Ibg",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ccigHhsC7EI68Mx7Rb1Ibg/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "fV7q4TNHTyE5_6n0iEgN8w": {
    "date": "4/21/2016",
    "text": "I love this place and I think this is the best coffee in Orchard area so far (the other good ones tend to be shying away from Orchard). I found the menu is quite flexible for different time of the day, and the quality of food is great. The serving is the right Asian size but maybe small for the Westerners but the desserts, esp the cakes are for sharing. So Orioles has been successful in combining quality of food, ambiance, and service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qWKKET553eWKKliTmfc7-w",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Coordinated color",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qWKKET553eWKKliTmfc7-w/o.jpg"
      },
      {
        "img_id": "7OHl0mKcoNHc--8LO_BiZQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. The warm spinach & truffle salad, nice mix of ingredient. Personally I would add crunchy nuts to give more texture",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7OHl0mKcoNHc--8LO_BiZQ/o.jpg"
      }
    ],
    "user_id": "A3vvP7tuNU5Tj2qII6fJIw"
  },
  "NVmzSjBnkm5tlSASL44Ggg": {
    "date": "8/5/2015",
    "text": "Oriole sits on perhaps the highest or second highest (after Orchard MRT B1) traffic pedestrian area in Singapore. Accordingly, it's adapted by offering some of the highest prices for coffee in Singapore, and remodelling the interior to make it less friendly to overstayers and encourage throughput. The coffee is excellent. Oriole was one of the earlier players in the hipster coffee craze and at least on that end, they deliver. This is a light to medium roast with aromatic Latin American or African single origins. But the bill will hurt. It is only the excellence of the coffee that gets them 4 stars, and the excuse that the location favours Starbucks over hipster craft coffee artisans.It used to be a bunch of tables serving food as well as coffee, but the new interior consists of wide open spaces and large wooden steps on which people slouch uncomfortably. I can't help but wonder if this is on purpose. Old Oriole was hard to get a seat in. New Oriole isn't bad, just... dehumanized?",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvj9YfBp_XPM-3z1Es_P8w"
  },
  "5FgPcbGBPNfq_Ib-Akm6Ew": {
    "date": "8/27/2015",
    "text": "Used to be my favorite hangout. Now even more so after the renovation! They turned it into a cafe-bar style and still not losing its charm! Had one of the best sticky toffee pudding here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vmLgDbPgHX6WB2G1DWiKBw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vmLgDbPgHX6WB2G1DWiKBw/o.jpg"
      }
    ],
    "user_id": "U2xR7X6NtrOLjwQmOwTJ-g"
  },
  "99vAYigETJl5BWb_unaT7Q": {
    "date": "9/21/2014",
    "text": "I had high expectation coming here since I've read great recommendations for this place but I'm underwhelmed. My prawn risotto was just alright.. Maybe I just ordered the wrong thing. I was with a friend and I think she would have given it a higher rating since her food was good - she had the sausage and mashed potatoes. Service was rather slow at the beginning and we had to wait quite some time to be seated even though the restaurant was almost empty.I might go back to try the coffee since that's what everyone raved about but not the food. It's also quite pricey for not that much.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xd8dPasNWNiy28rtqksD-g"
  },
  "utIIWw1J9OCo_bIdpKWrpQ": {
    "date": "3/16/2013",
    "text": "With a series of wins in the Singapore barista championship, an annual latte art throwdown and a coffee roastery and retail business, Oriole is an established part of the Singapore coffee scene. It's also one cafe that I go back to on a regular basis. Starting with a flagship cafe, bar and restaurant in 313 Somerset, Oriole has expended to include a new roastery in Chinatown (Jiak Chuan road) and a cafe in Republic Plaza.Espresso - golden brown crema, consistent with coffee beans which have been roasted recently - exactly what I would expect from an established coffee roastery. The initial impression was of citrusy and berry-like flavours, which were neither too tart nor astringent. This was complemented by a slightly viscous, syrupy mouthfeel, and the correct volume for an espresso shot. Each of the elements of a good shot were there, combining to create a shot that was so much more than a combination of ground beans and steam. There are also some interesting combinations of caffeine and milk happening above Somerset station. The espresso shot mentioned above was paired with silky smooth microbubbles, resulting in a balanced drink, but a cappuccino which retained it's potency. The aftertaste lingered, with sweetness evident in the foam - this occurs when milk is steamed at the correct temperature, increasing the solubility of the lactose. Unlike a lot of cafes, I could also taste the citrus notes in the milk, a nice touch that I don't always see. Piccolo lattes are also a speciality in Oriole. The piccolo that I tried was beautiful - built upon a foundation of a double ristretto, with potency tempered by smooth foam. Ristretto on the menu is always a good sign - think of it as an even more intense espresso, consisting of the first 10 seconds of extraction, unlike a regular espresso shot which extracts for 18 - 30 seconds. For coffee lovers, the presence of ristretto on the menu is a subtle indication that the level of coffee knowledge on the part of the staff is higher than average - it suggests an understanding of the effect of different extraction times for a shot.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4TfPdYALtYMwk52V4G955Q",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Citrus Sin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4TfPdYALtYMwk52V4G955Q/o.jpg"
      },
      {
        "img_id": "s9ybOD8rgIkyJkeTNEJdhQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Cappuccino",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s9ybOD8rgIkyJkeTNEJdhQ/o.jpg"
      },
      {
        "img_id": "5LFatItE_skBOSuBWQllOw",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore. Citrus Sin @ Oriole",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5LFatItE_skBOSuBWQllOw/o.jpg"
      }
    ],
    "user_id": "2aJZEdicQUqqOQG5-pwe-Q"
  },
  "tyZn3kus4I7xuTQEdHKNPg": {
    "date": "4/8/2013",
    "text": "I read the review on LadyIronChef's blog and was sorely disappointed to find out that prices for this joint had gone by by nearly 50%!!! In LIC's review, the Beef Cheek and fish & chips were priced at $15 and now they are $22 & $19 respectively (excluding service charge & GST - an additionally 17%). I am not sure the reason for the price hike given that the portions & ambiance looks the same. With 313 opening up beside it, all the more foot traffic and more restaurants to compete with... so why the need for the steep increase? The only fathomable reason I could think of is that their rent went up. Regardless, I think it's daylight robbery to inflate one's prices by 50% within such a short period of time. 1. Beef Cheek Tagliatelle $22 -  (red wine & citrus braised beef cheek, mushroom, shallot oil). The beef cheeks were soft and tender. Pasta & the sauce was ok. Nothing fantastic. I would give this dish a 3/5. 2. Jamaican jerk chicken $22 - (grilled jerk-rub baby chicken, corn salsa, crispy onion rings) - This dish was very dry. My friend had to request for chili sauce to go along with this dish. They chose to use chicken breast which can be awfully tasteless and dry when not prepared well. Most of the Jamaican jerk seasoning was only on the surface of the chicken's skin (sprinkled like salt & pepper) and leaving the meat rather tasteless after you dig into it. 3. Apple strudel (traditional bavarian, phyllo-wrapped apple-raisin strudel, warm vanilla sauce , top up $4 for a scoop of vanilla-bean ice cream)  - Good. The apple strudel came baked like a pie in a pan. It was pippin' hot went well with the scoop of ice-cream at the side. 4. Philly steak & cheese  (beef striploin, onions, peppers, swiss cheese, baguette) - Average. Looks like a sandwich (with buns).      5. Citrus sin  (double ristretto, spiced orange juice, steamed milk) - Good. Interesting zesty taste to the coffee. It's one of their award-winning coffees. Service - ok Ambiance - rather dim & romanic. Pretty good for date nights but can get annoying if you like to take pictures of your food like I do (to post on Yelp). Overall, I think I would return for the coffee only. Food is overpriced for the an average quality.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tsPJ6jD3MFGeEbcav_mUFg",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tsPJ6jD3MFGeEbcav_mUFg/o.jpg"
      },
      {
        "img_id": "LW53cPeOMmFSYOv8hRy3Ig",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LW53cPeOMmFSYOv8hRy3Ig/o.jpg"
      },
      {
        "img_id": "Rcj7gnJ1r6SBxaPG3YgWkQ",
        "caption": "Photo of Oriole Coffee + Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Rcj7gnJ1r6SBxaPG3YgWkQ/o.jpg"
      }
    ],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "plRzSA1kk8jkz7qOS3iClQ": {
    "date": "5/4/2014",
    "text": "I consider Oriole to be the grandfather of Singapore's specialty coffee craze. And by grandfather, I mean the one that sits in an armchair with trousers up to his armpits demanding that one of his grandchildren fetches his slippers.Let me explain. To counter all these recycled wood and faux-industrial whipper snappers, Oriole still looks like it's stuck in the early 2000s. Even its menu is an unashamed mish-mash of random pastas and sandwiches. No trendy avocado mashes or pork cheek brioche burger benedicts here! Just good old Philly cheese steak and... potato wedges. Remember potato wedges? They can probably still be found on the menu of your local Harry's-style after-work watering hole. And at Oriole.So that accounts for grandpa's unfashionable attire. Oriole has been there long enough (and has real-estate on Orchard prime-enough - comfortable armchair) to not care. And the coffee is still pretty good, it certainly cuts it better than some of these upstarts. None of the baristas have waxed mustaches or clubmaster glasses, nor do they wear the latest chambray shirts, but they are working with locally roasted coffee, not inferior Genovese.So these  grandkids of Oriole should not only fetch the slippers but kneel down and kiss the ring. Maybe Palheta roasts better and maybe Common Man is more popular with the couples brunch crowd. But Oriole blazed this trail long before and was grinding & steaming while they were still nappy-clad dreams in their owners' minds. Respect it.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 13,
      "cool": 9
    },
    "photos": [],
    "user_id": "41MtZiv6L0dB4S9NdnO6_g"
  },
  "HSny1Ap4rzgJf6pK15Il8w": {
    "date": "3/29/2016",
    "text": "This place is lovely. So pleasant to sit in, extremely attentive and happy servers, and delicious food and coffee. Highly recommended! The fish and chips is delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sF0HEhcWb13p_txmssFotw"
  },
  "F4gJEziPJxX2xoyoDZROXg": {
    "date": "9/30/2013",
    "text": "Having heard about this place from quite a number of friends (and partly because I'm a girl who's determined to find the best coffee place in Singapore), I decided to give this place a try.The layout of the place is quite well designed, with a very nice European feel, but does feel a little dark - especially at night. It also gets really noisy on weekends - to the point that I had difficulty listening to my girlfriends speak. Food wise, I had the Fish and Chips which, to be honest, wasn't fantastic. The portion was quite generous, but the fish felt too oily, while the fries (which were more like wedges) were excellently done. Other dishes that were ordered were the Jerk chicken ,which was quite flavourless, and the Bangers and Mash, which was the exact opposite. The prices were pretty steep, however, with just the food dishes averaging to about $20-$30 per person. Now to the coffee, which I came for. I ordered the picolo latte, while my girlfriends ordered a flat white and Citrus Sin (their competition coffee). I took a bit of each, and while their flat white was far from exceptional, their picolo latte was very, very well done. The citrus sin was also very unique (though it wasn't to a friend's liking)Overall, a place worth hanging out if you're looking for a girls' night out with coffee lovers. If you're just here for the food, you might want to try elsewhere though as their mains are quite overpriced.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "1WKZZ0FGM1Tz-UvPD03Ttg"
  }
}