{
  "19N5x9b3qG31ZnI-s0txgg": {
    "date": "7/23/2017",
    "text": "Make a reservation if you can; although the restraint is rather large, it was ill and people were waiting outside for a table. The service is excellent here, but try to bring someone who speaks mandarin with you. The cuisine is your typical southern Chinese food, but there are special dishes like mei fan and frogs legs. It was my first time trying gross legs... they were good though. The texture was almost like fish, but it tasted and looked like chicken... sorta. Idk, you just have to try it! The duck was maybe my favorite dish. Mei fan was interesting.... but I'm not really a fan of Chinese sausages, especially liver sausage. For dessert, we had the fried ice cream and Malay cake. Both were good. The dishes come out one by one, so expect to spend a few hours eating here. They also have a large wine list and don't have a corkage fee. All the tables in our area had wine and they are very accommodating with the glasses. Jade palace is centrally located, relatively cheap parking and great service.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "992z_oW0tIsy27DmxHLqNA",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore. Fried ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/992z_oW0tIsy27DmxHLqNA/o.jpg"
      },
      {
        "img_id": "HRytegfJBKohgnC1Jz2KKA",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore. Mei fan.... like fried rice kinda lol",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HRytegfJBKohgnC1Jz2KKA/o.jpg"
      },
      {
        "img_id": "_junA0oWDH6TtNLLGfawPw",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore. Frogs legs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_junA0oWDH6TtNLLGfawPw/o.jpg"
      }
    ],
    "user_id": "Dfu-NuG1YWB96jjBLIlsrA"
  },
  "IwUV-Z8rLtO4mvJTGl6liA": {
    "date": "6/25/2017",
    "text": "Reliably excellent. Run by two brothers from Hong Kong, serving pretty authentic Cantonese food. Importantly, they haven't over-expanded (only one outlet) so quality is pretty consistent. I've been here quite a few times, recommend the dim sum for lunch and for dinner, the beef brisket and bamboo clams are excellent.Doesn't charge corkage and has proper glassware - hence a regular spot for people who bring their own wine. Good wine selection in-house too as reasonable prices.Likely to come back here many times!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "c2KAOL5GeRZGjO4R8Ux6-Q": {
    "date": "4/21/2017",
    "text": "Jade Palace is an interesting dining experience - it boasts a very Asian menu paired with a large selection of European wine. The atmosphere is nothing special - the decor and furniture is dated. However, the food is really what we are here for so let's talk about that :The food was a little hit and miss. The hits were the fried frogs legs ($55) and the durian mochi ($6). The frog legs were crispy on the outside and tender on the inside. For a fried dish it was not oily at all and was pleasantly fragrant. The durian mochi had the perfect mochi texture - soft and chewy with a generous serving of fresh durian on the inside. I  would come back on the merits of these two dishes alone. Other honorable mentions included the siew yok and the salted egg squid.Everything else was subpar. If you're having dinner here feel free to skip 1. Soup of the day (bland and boring)2. Century egg (average)3. Fish maw soup (taste was below average and servings of fish maw were fishy and cut into tiny pieces)4. Steamed garoupa (not bad but definitely can get better elsewhere especially for the price)All in all I had a pretty mixed experience given that some dishes were just amazing while some were below average. I would definitely caution everyone to pick from the menu carefully!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "40yLxxoCJo-Sci83gvGGvQ"
  },
  "I_lzq1OTlCfCAD_UtmZUQg": {
    "date": "1/2/2018",
    "text": "Great place for dim sum lunch. And surprisingly good and attentive service..... Hard to get in the weekends, make a reservation ahead of time or bounce! :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "xwN2Bjyp33fhCcWrK1tJHQ": {
    "date": "10/18/2015",
    "text": "Had a range of dishes for dinner for 20 people in a private dining room. All the dishes were great, fried tofu, fried pork squares, fried bamboo shoots, succulent scallop and broccoli, delicate chicken and celery, chili Alaskan crab, proven fried rice, sizzling chicken and shallots in oyster sauce, etc.  This is one of my favorite Chinese/seafood restaurant, the set up may not look trendy or ultramodern, but the food is really good and the service is great!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5sOP-K52pNO2IxOv4uXi1g",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5sOP-K52pNO2IxOv4uXi1g/o.jpg"
      }
    ],
    "user_id": "EleQKGrUDo_-zvpfOVHYMQ"
  },
  "KntFnl6egDBVkqo81PY5mw": {
    "date": "10/20/2016",
    "text": "Was here for lunch before and thought it was pretty good.   So finally booked for my mothet-in-law's bday.   Even got a whole peking duck for the occasion.   Unfortunately the duck was just not up to par.  The skin was a little too dark and does not have the crunch.   The wrap that came with the duck was just too doughy and un-refinely done.   What was puzzling is it came with cucumber??!! seriously? Anyway the duck so huge we also had the duck meat fried with scallions.   Also ordered Naibai and gosh it was over cooked and limpy.   Got a $25 a pop sharks fin and for some reason it was orangy in color.   Taste was ok and generous with the fin but unfortunately does not come close to the value u pay.   Beef sauteed with garlic was ok just nothing special.  Mango pudding came without evaporated milk and we have to remind them before they bring it out.   What was most annoying was they are on a 2 shift dinning so they were eager to get u out of the door fast!!  The take away is if you want sub-par food with no cockage this be the place to come.  But if you want quality food and impeccable service wahlok is far better.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x7Yx4qpWVvO0tZEz1jN7qQ",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore. cucumber that came with duck",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x7Yx4qpWVvO0tZEz1jN7qQ/o.jpg"
      },
      {
        "img_id": "bbUM317_v5bcOKcAxDv8tA",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore. duck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bbUM317_v5bcOKcAxDv8tA/o.jpg"
      },
      {
        "img_id": "xmgzGej_QLLDCu3iWPxPLA",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore. duck",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xmgzGej_QLLDCu3iWPxPLA/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "lLeuedxaNNG_NlIwbHAL4A": {
    "date": "4/6/2013",
    "text": "It's my dad's new favorite place for Chinese cuisine. In fact, he loves it so much he wants to throw his birthday party here (in a few weeks time). It was packed to the brim the last time I went there. Maybe there's something in this place that I am missing out on? I am indifferent to the food here. Some hits (the usually suspects) and some misses. Nothing out of the ordinary for me. Matches up to most Chinese restaurants I've dined at previously. 1. Sharkfin with crab meat - $25 - Meh. Had better. 2. Peking duck - $38 - LOVE IT!!! I might be biased. Crispy duck skin rolled in a soft-taco like wrap. Add some savory-sweet sauce and throw in spring onions. Simple but amazingly delicious invention. 3. Squid with salted egg yolk - Ok. Ironically, the salted egg was too salty. The squid is a tad bit too oily for my liking. Not very much like the western calamari I had hoped for. 4. Yellow fish (fried) x3 - $30 - I didn't really like it. I felt that the its fishy taste was not musk well and it was presented as a whole fish. No deco. Just a fish staring back at you. Don't get me wrong, I like beef/fish as much as the person but just because I do doesn't mean that I want to see that cow's/fish's face staring back at me... on my plate.  5. Luffa with Fungus - Good. 6. Scallop with fried rice - $39 - Ok. Overpriced though? Not much scallops. Rice for 30+++???7. Daily Soup - Good. A chinese herb based soup but it was savory not bitter  (kinda reminds me of the cantonese soups that my grandmother makes). 8. Mango & Sago - LOVE IT!!! This was so freaking good. A pity the portions were so tiny. It came served in a rock glass. Only 1/4 was filled with the mango goodness. The mango slides were sweet & fresh. 9. Chinese herbal pudding - Good. A tad bit on the bitter side but you have the option of dousing it in honey. 10. Lime Ice cream - Meh. Boring. It's basically a scoop of sobert or ice-cream (I can't remember) soaked in a green color liquid with a few topping of nata de coco. 11. Lamb chop with garlic - $27 - Interesting cooking style. They chose to fry the lamb chops and it was done quite well too. Well marinated but as with most lamb dish it has a distinct lamb smell which I don't really like. Worth a try for those who like lamb. Service - Good Ambiance - Typical chinese restaurant. Very practical :) Nothing fancy. They do have some fish tanks out at the fron though where customers can see where their fresh catch is derived from. Nothing pretty. Just fish tanks.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WxSkgQZGN_JZkMCXb7Tf1A",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WxSkgQZGN_JZkMCXb7Tf1A/o.jpg"
      },
      {
        "img_id": "kZ2494LjU1is4FzWTAzDAQ",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kZ2494LjU1is4FzWTAzDAQ/o.jpg"
      },
      {
        "img_id": "h8dOvi4FKYzHegpVAdGqUA",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h8dOvi4FKYzHegpVAdGqUA/o.jpg"
      }
    ],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "FcbDK3zfrXNSgT0hNMyPYw": {
    "date": "9/29/2012",
    "text": "been here many times for lunch and dinner.always so crowded that it's best to make a reservation.very friendly and efficient service staff.good dim sum.the usual suspects are all of good standards.for starters:excellent cold crab.cooked well and kept at right temperature.vinegar garlic sauce for dipping.kurobuta char siew is fatty and tender.grilled pork collar, nice marbling.pork floss sprinkled on crispy strips of egg plant is yums.crispy squid tentacles, not many places does this well.for mains:kai lan fried with liver and chinese sausages is a must if you cant get their lap mei fan.crunchy stalks of kai lan made ever so tasty with delicious sausage slices.i always ask for a mix of two sausages, as i like the rich liver ones but the normal chinese ones adds sweetness and texture.if the lap mei fan is available order it for a full whack of the different preserved wax meats!for dessert:durian mocchi, real creamy durian meat contained in bite size soft melt in your mouth mocchi.mango pudding with real bits of mango and no artificial taste.p.s. if you need the bathroom, they do have their own located within the restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "o4dv9RZP9O_UbOlNrxOWPw",
        "caption": "Photo of Jade Palace Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o4dv9RZP9O_UbOlNrxOWPw/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "9gRwB1tOgRHFFPBFm00rig": {
    "date": "11/21/2015",
    "text": "Great quality ingredients and taste! The lap mei fan and wagyu kwetiao here is really good and service is good as well",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "o5iqCc41VDX8bBHUtoOk_w"
  },
  "9DOQGaujlLWctbC5fmRhLg": {
    "date": "12/15/2014",
    "text": "From the outside, Jade Palace Seafood Restaurant does not look like much. However, it has a strong following of regulars given its consistently delicious food. The claypot rice, in particular, is one of the best around town IMO. They also have one of the most impressive selection of wines among the Chinese restaurants in town. BYO is also allowed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  }
}