{
  "3gBY05hryaaobuE_0UYMdA": {
    "date": "12/19/2017",
    "text": "Have you been seeing cute little animal dumplings pop up on your feed? East Ocean Teochew Restaurant is serving them up a storm ! This is 100% my favourite place for dimsum EVER, anywhere! All ingredients are so fresh and everything is spot on!Crystal Squids  flaunt their perfect crystal skin, contain mixed vegetables and every piece of veggie is delightfully crunchy. Little stingrays are stuffed with a deluxe mixture of truffle, prawn and crab meat . I also highly rate the texture and flavour of ha kau's filling, fresh prawns with a bit of a bite , perfectly seasoned with a hint of sesame oil. Even siew mai have a superb balance of pork and prawn, they're moist, well-binded and so satisfying with every mouthful . The highlight of the meal for me is the chicken feet. I love mine spicy, more savoury than sweet, not super soft and these are the perfect feet !!!!! If you have an obsessive personality, you might even develop a foot fetish.East Ocean has proven themselves as not just another gimmick, they clearly know their food and how to 點 people's 心 with it. They've definitely touched ours!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s4RgtPLOQU7ZggOOoWC7rg",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Dimsum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s4RgtPLOQU7ZggOOoWC7rg/o.jpg"
      }
    ],
    "user_id": "316Ul7J-SJML1RiaUHlixA"
  },
  "aTyHNrJEKgAWk8G7dgT6HQ": {
    "date": "10/10/2015",
    "text": "Established since 1992, East Ocean Teochew Restaurant is well known in Singapore and the region for serving the best in Teochew cuisine and dim sum. In 2012, they moved to Takashimaya shopping centre and as pioneers in the art of Chinese cuisine, they constantly innovate by introducing new products such as cute looking dim sum, aimed at children.You can consider East Ocean if you want something more than just your traditional dim sum. As I had some friends visiting  from out of town, I decided to give them a try.On thursday at 12pm, the dining area was maybe 30% full. They were groups of business people and you could tell they were important discussions over the dim sum, as they barely touched their food!So here's the cute dim sum menu I was talking about. Nothing that really stood out to me. I was hoping for cute looking siew mai, har gau or even char siew pau maybe?1. Pan Fried Carrot Cake $5++So first up was the pan fried carrot cake, one my my favourites. The texture was great, charred on the exterior to give it a crisp bite and yet soft and warm in the certain. You could clearly see the shreds of carrot inside with small pork cubes. It was flavourful and actually met my expectation.2. Steamed Spare Ribs $4.80++The spare ribs didn't have much bones with them, so it was very easy to eat. The meat was very well seasoned and flavourful. My foreign really enjoyed this. Hidden underneath the layer of meat, are yam cubes. The yam was steamed till it was all mushy but yet soaked up the essences of the spare ribs!3. Lion Fish $6++So we got these cute fish shaped, fried prawn balls. My friends and I all agreed, it was just for looks. We would pick har gau any day over these. 4. Little Big Foot $6++When this was served, my American friends went, \"Wow\". I think the chefs did great by innovatively placing almond flakes on the back of \"Big Foot\". They were so cute, it took awhile before everyone on the table was done snapping photos.Inside the thick, and chewy pastry was sweet barbecued pork. I was expecting more of a char siew soh, so this was a surprise. The almond flakes were well with the pork I must say.5. Ha Kau $6++, Chicken Feet $4.80++, Siew Mai $5++I decided to also get a range of traditional dim sum, to help bench mark East Ocean vs the familiar restaurants I've been to. Surprisingly, the taste was just \"meh\". Nothing to rave about.6. Steamed Custard Bun $5++ *highly recommended*Definitely the highlight of my meal! Check out the liquid gold, flowing out of this very hot, steamed bun. The sweetness of the liu sha was perfect and the texture of the bun was soft and fluffy. 7. Steamed Shrimp Rice Roll $5.80++The shrimp was sizeable and crunchy. The sauce had a right mix of sweet and saltiness. The shimmering rice roll was very soft and delightfully tasty.8. Crispy Roasted Pork Belly $15++ *highly recommended*My friends who never tried this before were crazy over this dish. It was only when I told them it was $15++ that they realized, they had to savour this dish slowly. Good stuff doesn't always come cheap, but pricey stuff doesn't always mean good. But this is by far the best dish we had at East Ocean. The skin was so crispy, and the meat was juicy and tender. Strangely though, it was served with wasabi mayo.Service throughout the meal was great, as the staff was constantly refilling, our pot of tea and asking if we needed any help ordering. They were also attentive to our every action and cleared our plates thrice throughout our meal. We ended up spending close to $90 for the 3 of us, and we did have our fill, but I felt that the quality of the dim sum could be better. It's sad to say that I know of several other chain dim sum restaurants that surpasses the standard here at East Ocean for several of their dishes.My suggestion, skip the kiddy menu. Yes it looks cute, but it's not worth the price or the calories.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cgS7GUBGtzek0faWHCLePw",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. For 3 pax about $30 per pax",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cgS7GUBGtzek0faWHCLePw/o.jpg"
      },
      {
        "img_id": "39DKknGYaZwx_WFfLq8e5A",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/39DKknGYaZwx_WFfLq8e5A/o.jpg"
      },
      {
        "img_id": "ayoJ4nCsSEOdfMYkVFjCMA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ayoJ4nCsSEOdfMYkVFjCMA/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "q5oO9JL3pNgxQEut70RVXQ": {
    "date": "4/2/2016",
    "text": "We made a reservation few hours in advance on a Saturday afternoon. Phew, hate the queues in town with an active toddler. Greeted by a line of strollers, i'm secretly happy that many other little humans will be in the house too. My noisy todd cries probably won't be heard....too obvious. The posters of the cute little dim sums shaped in dolphins, stingrays, ducks caught our todd's attention. Cleverly pointed out dolphins, but no, we are not ordering these for her. I prefer the traditional dim sums in their usual form. We were famished by the time we sat down, food appeared 5 minutes later. Wow. Star star star for this, since we were really hungry.Food we ordered: century egg chicken porridge, siew mai, hak gao, custard bun, char siew bun, char siew su, mini egg tarts, fried prawn dumplings, prawn rice roll, pan fried carrot cake & a pot of pu er. The steamed food are served hot, while the rest are room temperature, including the porridge. ;(  The prawns are fresh in the dishes they appeared. I find the custard too sweet but my partner likes them. Bill comes up to approximately $70 & we took 2 boxes of food back. Impulsive order by 2 hungry people. Will return if we are in town & crave for dim sum!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UhX5oi-P7nXZ3j8_CEmJXQ",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UhX5oi-P7nXZ3j8_CEmJXQ/o.jpg"
      },
      {
        "img_id": "xfOjyJMmFon-UTLbVkcT6Q",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xfOjyJMmFon-UTLbVkcT6Q/o.jpg"
      },
      {
        "img_id": "Ddx5gEKUHP_U8_YLsLSOEA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ddx5gEKUHP_U8_YLsLSOEA/o.jpg"
      }
    ],
    "user_id": "nF5ySHfiUS0v30njNniOjg"
  },
  "xjQIeUzfiFw2YylQKcFQLw": {
    "date": "12/11/2015",
    "text": "I only came here cause I saw that they had animal shaped dim sum on Pinterest.Do you want to be a monster and rip off a cute animals head? If Yes, this is the restaurant for you. I'm pretty sure the animal dim sum menu is for children but hey we're all kids at heart right? With names such a \"Naughty Puppy and Chicky Chick\" you can't help but laugh. My friend and I ended up trying the:+ Naughty Puppy: A bun with a cheesy sausage inside. Not bad but the head was all bun so a little plain. + Chicky Chick: Another sweet bun like dim sum. + Beary Bear: This was the CUTEST one out of the bunch. Deep fried outside with some meat inside. Not bad tasting as well but make sure you eat it while it's hot. We took too many photos mine got cold and it was eh by then. + Golden Turtle: A sweeter chaw siew sou. Not bad I would recommend :) + Each of the dim sum comes with 3 portions. Overall if you're looking for cute food to instagram or take photos of I would definitely recommend coming here!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "kqEY1oGy4C7Epbb3NDSW9A",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Deconstructed",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kqEY1oGy4C7Epbb3NDSW9A/o.jpg"
      },
      {
        "img_id": "H6XuKyJE1xOFJNb6LjcPxw",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Naughty Puppy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H6XuKyJE1xOFJNb6LjcPxw/o.jpg"
      },
      {
        "img_id": "UbfDHJehAWVtB3IIJNOhaw",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Golden Turtle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UbfDHJehAWVtB3IIJNOhaw/o.jpg"
      }
    ],
    "user_id": "rEsijGi21VI6xbF8A5ZkKw"
  },
  "qMC64aobiS7-DVKzxDNrQA": {
    "date": "9/12/2016",
    "text": "Food is good, authentic HK dim sum and the ambience makes you feel like you are in Hong Kong. The porridge and double soup are flavorful. The egg tarts are nice and flaky, served while it was still warm! Order 2 of the cute dim sum - the crab and elephant. Elephant was the winner! Not only looking pleasant, it was yummy! But prior to having a meal there, you need to go through this whole chaotic reservations and Q system (no system at all). Though we made reservations, we had to wait for an hour and the reception was chaotic with angry diners whom, like us waited very long for a table. And some just jumped q and got themselves tables. The restaurant probably has to work on that or get someone who is less forgetful to be the hostess.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "imcKPnNEuLovMIibXKapoA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Must order the egg tarts!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/imcKPnNEuLovMIibXKapoA/o.jpg"
      },
      {
        "img_id": "sTQ-2hgaFqYumMe4jW3lvw",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. This is one yummy elephant!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sTQ-2hgaFqYumMe4jW3lvw/o.jpg"
      },
      {
        "img_id": "nvtxgX818n40qVA3cjs1KQ",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Cute crab!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nvtxgX818n40qVA3cjs1KQ/o.jpg"
      }
    ],
    "user_id": "O_aSJVtai1ag1HSxGtzCww"
  },
  "X6-uuXzW7FFvFIFBWT4tzA": {
    "date": "2/7/2017",
    "text": "Boycott this restaurant until they stop selling sharks fin.Good food, very nice tea but having sharks fin on their lunar new year menu is very disappointing. These animals don't deserve to die horrible deaths, and in great numbers, because of your restaurant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyiSA0yxVGN8zSRaYHoyMA"
  },
  "LXm10qPOGu0l8m2Q5sHcnQ": {
    "date": "12/27/2015",
    "text": "East Ocean (Dong Hoi in Cantonese) is a go to place for me each time I am craving for some siew mai or ha gao. Really love their food.For me the Salted Egg Custard Bun, Ha Gao, Siew Mai, Chinese chive dumpling  and crispy BBQ bun is a few item on the menu you must order if you take a trip down here to enjoy the food. On weekend is always pack with people who bring their parents and family here to enjoy some dim sam, so make sure you call a day or so to make your reservation. Do expect to wait for a while even you make a reservation. Also take note the noise level here are high, so get ready to speak up a bit. Today I got seated right beside the tank where the restaurant keep their live seafood, I end up feel like 1 am one of the exhibit in the aquarium as lots kids will come with their parents to look at those fish or lobster. Is kinda awkward ppl stand beside you while you are eating even I know they are not looking, but again if you look at those cute kids face, it melt your heart.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zwPWHv4oJN1US8FfaOpmbQ",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Deep fried chive dumpling.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zwPWHv4oJN1US8FfaOpmbQ/o.jpg"
      },
      {
        "img_id": "HUHTBymsFxGdsS5l0jdT0Q",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Salted egg custard bun.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HUHTBymsFxGdsS5l0jdT0Q/o.jpg"
      },
      {
        "img_id": "xejerjBe9rYC3n-HdYI9ZA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Always pack on weekend.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xejerjBe9rYC3n-HdYI9ZA/o.jpg"
      }
    ],
    "user_id": "1Q2GYf4LGZiJ-r3kvKvGWg"
  },
  "tFZp31EWZbzlEXiKuel8Zw": {
    "date": "4/4/2015",
    "text": "This is a classic example of not doing everything under the sun but doing then well!Their dim sum menu is not extensive compared to some other restaurants. However, for the items we picked (which were many), they were very very good. This place has become for me the top 5 dim sum places to eat at a restaurant level. The bill comes up to be just under $30 which is not cheap but it's a really good place for a treat. I will be back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "HMmgqFauLFGrrXBAhCjl7A": {
    "date": "2/13/2016",
    "text": "came here during the cny period to have a dinner with a group.We ordered-red grouper done teochew style-tofu with assorted mushrooms-sweet and sour pork-A platter of roasted duck, charsiew and some meat-3 egg dish with vegetables- ee mian noodles-prawn balls with mayothe damage came to $56 per person for a group of 8. but it wasn't filling. there were hits and misses in some of the dishes, I think for this price tag per person, we would get a better value in other restaurants and be filled up.however, I do need to give credit to the lovely wok hei in certain dishes and the seasoning was impeccable. Chinese food is one of my favourite cousins and this place has done justice for some dishes.however, red grouper was done below average that day.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "YNOYIAyH3CgnxziCApe4uA": {
    "date": "6/22/2016",
    "text": "Reliable place for comfort food. Roast pork had crunchy skin, the way I like it. Egg custard is good. Roast duck is good, although skin is not as crispy as in specialty peking duck places.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4BtYccavFA_GCKiFsASFEA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Peking duck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4BtYccavFA_GCKiFsASFEA/o.jpg"
      },
      {
        "img_id": "HVqnKxd364CdSC6S8D75pw",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HVqnKxd364CdSC6S8D75pw/o.jpg"
      }
    ],
    "user_id": "OTx8lNo-62V2rmAKkvAb1A"
  },
  "PAhUZiHdhvBik9EeGDEZlg": {
    "date": "9/20/2015",
    "text": "We stopped in at this restaurant based on the good reviews.  They had stopped serving dim sum but we decided to try the a la carts menu.  The service staff was inattentive and abrupt.  We had the hand in the face several times during ordering as our waitress talked into her headset.  There are far more professional ways to ask a customer to hold. The dish after dish was unavailable. Our waitress each time recommended something far more pricier or completely different from what we were asking for.  The food was good. Not mind blowing or something I'd wait in long lines for.  Solid Cantonese dishes that would not be all that different from quality restaurants in HK. We had to chase down servers to refill hot water for the tea as well as our bill. Lastly, what is it with the charges for napkin, hot sauce, and pickles, etc...is this a food court or a restaurant?Two of us, ordering nothing special (clay pot, one two item BBQ, two appetizers, and a bamboo clam) walked out with an $86 bill. Wouldn't have an issue if the service was actually decent. Oh and there was no wait on a Saturday evening.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tss2kadThZnLEW_3KlN3AQ"
  },
  "kSQKmGaNu-ZMkpE0LLb6yg": {
    "date": "10/25/2015",
    "text": "It's kind of difficult to review individual dishes when you're busy stuffing your faces. Had the usual har gao, siew mai, har cheong fun, glutinous rice, salted egg custard buns, pan fried carrot cake, steamed carrot cake, egg tarts and century egg and pork porridge. Nothing stood out - a solid 3 stars. The scallop and broccoli dish was good (4 stars) and the claypot tofu (3 stars) and duck ee mian (3 stars) were average as well. The longevity buns we had for my granddad's birthday were cute but too sweet.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "JZXyJ6Mu4g-obcpzkU5EZg": {
    "date": "8/16/2013",
    "text": "Mostly hits at this dim sum joint. Love the mini egg tarts and all those prawn based dumplings and dim sums. I'm not a fan of their char siew based dishes as they were more savory than sweet and also on the bland side. Honestly the idea of onion with my bbq pork is just weird. Was a little disappointed with the salted egg yolk buns because they were way too sweet for my liking. Overall great dimsum joint still but i guess Imperial Treasures teochew on the whole wins this.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "16oyAZLIx9gmztz7vR3zWg",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. FAAAATT har gows.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/16oyAZLIx9gmztz7vR3zWg/o.jpg"
      },
      {
        "img_id": "I004dMxGbOYW0KffCSg3cA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Liu sha bao!!! It's too sweet for my liking actually.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I004dMxGbOYW0KffCSg3cA/o.jpg"
      },
      {
        "img_id": "SwoXH53U6rPcKCI46S02yA",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Bo Lo char Siew bunSssss",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SwoXH53U6rPcKCI46S02yA/o.jpg"
      }
    ],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "zdiZRMTDUv6BQnzBH6LI8w": {
    "date": "12/1/2014",
    "text": "Definitely make reservations if trying to have dim sum here on a weekend as the place is very popular.  Really liked the Teochew touches (a special tea at the beginning and end of the meal, supposedly an aid in digestion).  (I'm sure there are more obvious differences in cuisine when not having dim sum).   Dim sum was really good quality as well, and choices were plentiful.  They have a separate dim sum menu with dumplings shaped into little animals....of which we ordered everything:  trios of little penguins, puppies, sparrows, etc.  Both tasty and adorably cute!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jkr3YVCEoRNKkxinUZpW6A"
  },
  "6cDthY74nYsVX3E1HGwt_w": {
    "date": "12/27/2016",
    "text": "I have never been to a place with worse service. We were seated in a room and presented the menu however when we ordered they told us there was $500 charge for using the room. This was AFTER we ordered. Instead of letting us move to a table outside they rudely suggested ordering more. The manager spoke to us without smiling in a patronizing tone. Terrible. We had to walk out. I never usually write scalding reviews but this place was an exception.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-A5pGOxO02AvhfOtxkExZw"
  },
  "tnn1deM1i3zwVbBrquAUvg": {
    "date": "7/9/2014",
    "text": "There is a reason this places is consistently busy. Long lines and wait times even with reservations....because it is worth it. East Ocean is above and beyond worth the wait. Do not be scared by the long lines. In my opinion for how busy East Ocean was they turned around the dishes and tables pretty fast. They key is you can select your dishes as you waitLet's see what did we have:- Century Egg Porridge- Fried Oyster- Fried Snow Crab- Lobster Bee Hoon- Char Shew Bao- Salted Egg Yolk Bun- White Fried Carrot Cake - Glutenous RiceIt was all amazingness. All for about SGD$140 total for 4 people to eat. Great value here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LOK4oCby0Ou46W65YMO6-w"
  },
  "YeLw5bXFoIwiPhfjqPM2Nw": {
    "date": "9/13/2012",
    "text": "Traditional good dimsum. Come if you like good old traditional dimsum, but no not expect anything fancy. Though dimsum is served daily, they have more items on weekends than weekdays. eg. steamed radish cake in a bowl is only available on weekends.The funny reservation system they have here. You can always make a reservation, but you will still need to wait when you are there. If it is a public holiday weekend, the crowd is quite crazy. So come on a normal weekend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9h8dzj-k5AUTvJCTPXVmRg",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. peking duck, roast pork, salt-pepper jumbo squid",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9h8dzj-k5AUTvJCTPXVmRg/o.jpg"
      },
      {
        "img_id": "S4v8-uVb4HOzirlzrWp9Pw",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. Lao Sar Pao",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S4v8-uVb4HOzirlzrWp9Pw/o.jpg"
      },
      {
        "img_id": "6jyV_ilLhlyeXC_XMqFV1A",
        "caption": "Photo of East Ocean Teochew - Singapore, Singapore. chee cheong fun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6jyV_ilLhlyeXC_XMqFV1A/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "t9eJFqHoCWOKWMw9MEUflA": {
    "date": "10/14/2012",
    "text": "Good dimsum and insanely crowded on a weekend - even with reservations you still have to wait for awhile, and their front entrance is clogged with people.Still when you do finally make it in, service is pretty prompt, and you can order off the various carts that get wheeled around, or off the menu. Bonus points if you can do it in Cantonese of course, but the service staff can do English decently and are quite friendly. Also, do drink the 'Gong Fu Cha' in the tiny little teacups at the start and end of the meal - it's quite strong but supposed to be good as an appetiser and for digestion.What's good: Deep fried fish skin, Custard buns (liu sha bao), the mixed plate had great BBQ pork (shao rou), duck and char siew. The congee was also very good - silky texture and tasty without being too much - you could walk over to the live station and order the more common congees, but the special flavoured ones had to be ordered.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "NtUQwNkAg9fGIrfK9-D34w": {
    "date": "9/14/2012",
    "text": "This is my favorite Teochew restaurant in Singapore. The variety of dishes are endless and the staff are ever helpful and efficient. The pricing is fair. Try the chinjew chicken, steamed pomfret, and the fried fish skin as appetizer. Can't stop eating the fish skin!!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iWujtkQB9ezTHGipESk_6w"
  },
  "aYgndjMdU5GrJRbZ0nJ-tg": {
    "date": "9/7/2012",
    "text": "Reputable dim sum and everyday diningHaving moved from its Shaw Centre location to Ngee Ann City since February 2012, the restaurant looks and feels much more modern and attractive. Price wise it hasn't changed much, which means the crowds are bigger than ever. The glittering crystal chandeliers and a wall of live seafood tanks really add to the setting. There for Monday dinner last week, we had a wonderfully mild but deeply flavoured claypot double boiled lotus root and fish soup, that was inky black in colour. As you can guess, the restaurant doesn't just serve Teochew faves such as steamed pomfret and cold crab, but also Hong Kong dishes. A modern creation of crispy fried chicken layered on crunchy deep fried mantou bun and a layer of pressed cold foie fras didn't quite hit the mark, so it's back to the classics for me. The yam dessert here isn't as fragrant as some I've had - though it does have a clearly fresh, healthy quality to it.Be sure to call ahead for weekends as the dim sum is extremely popular. I particularly love the fluffy steamed char siew buns.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUodv8WGv4xo7EabaN3dqQ"
  }
}