{
  "gw04XQt-UdmvUWwyKNQ71A": {
    "date": "10/9/2017",
    "text": "Hainanese chicken rice is just chicken and rice but somehow it comes together in an amazing way. Yet Con does it right, in my opinion, especially since the key to a good chicken rice is actually the rice. The rice is the most flavorful thing and it's just delicious. Contrary to other reviewers, both times I've been to Yet Con I've found the chicken to be very moist and well complemented by the cucumbers. I also love love love the soup, since it's full of cilantro (aka coriander leaf). I love how homey and kampong-y the shop feels, having been around since the 1940s. Yet Con will always be my favorite chicken rice. I want to try the steamboat next time I come too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Nv9tIvuOuwyUiwdTRTzAw",
        "caption": "Photo of Yet Con - Singapore, Singapore. Chicken rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6Nv9tIvuOuwyUiwdTRTzAw/o.jpg"
      },
      {
        "img_id": "bUd7uptSt8Vmq3y3eD8sCw",
        "caption": "Photo of Yet Con - Singapore, Singapore. Interior of the shop",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bUd7uptSt8Vmq3y3eD8sCw/o.jpg"
      }
    ],
    "user_id": "X-dEv3zNKXms9udkuiVcbw"
  },
  "542lpqJWUHvbn250MkGtZg": {
    "date": "4/10/2016",
    "text": "Hainan chicken rice is the must have dish while in Singapore.  And this place makes a solid Hainan chicken rice.  But it was just ok.  Nothing too fancy, or blow-your-mind amazing.  The chicken is slightly dry.  The flavor mostly came from the ginger and hot sauce; the chicken itself was not as flavorful as I hoped.  The price is fair for the food...and like every other Yelpers had been saying \"don't expect any service.\"  So if you want a quick, cheap, solid dish of Hainan chicken rice, this is definitely a good place to go.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "BbOG7IvJCCFk3Gc39Hjdxw"
  },
  "7RqT-o8hMmpB_BQsXsIthQ": {
    "date": "8/25/2013",
    "text": "Traditional Hainanese Chicken and rice is what this place is famous for. Our friends and family who live here brought us here and the food did not disappoint!The Hainanese chicken was juicy and plated like it came out of your own kitchen, if you know what I mean, they don't get a \"10\" for plating aesthetics, but the taste sure makes up for it.The roasted and crispy pork, the sweet and sour grilled chicken was also delicious. The wet stir fry beef haw fun was also very good. Try the lime green cold drink, sweet and refreshing.The servers here are a little on the rude side, but hey, I'm just a tourist and here for the food, not the service. Come for the food, it sure makes up for impersonal service.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uxsjwWRAACc8o3YGK8VOjw",
        "caption": "Photo of Yet Con - Singapore, Singapore. Delicious assortments and of course the famous Hainanese chicken!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uxsjwWRAACc8o3YGK8VOjw/o.jpg"
      }
    ],
    "user_id": "aadVybdTbeVpSboTPCTjJQ"
  },
  "y3_6ktx_OmEzuH_14Ly-Ng": {
    "date": "9/29/2012",
    "text": "Hainanese Chicken Rice is one of the most eaten food when one travels to Singapore. Since it is quite affordable, I decided to eat as much as possible with every chance I get.My first stop is Yet Con Hainanese Chicken Rice. Yet Con has been around since 1940s and have been serving the same style of Chicken Rice since then. According to purist, Yet Con is the traditional and original Hainanese Style. I was a little antsy when I saw the deco of Yet Con. I believe that it must have been in business for over 70 years and it is as old school as one can get. But at least, it is Air Conditioned, a luxury as compare to hawker centres. Trust me, you would appreciate that when it is 40 C + with humidity!So what so unique about Yet Con's Chicken? According to CNN's website, Instead of hanging the chickens up after cooking, they are put on enamel plates to prevent the juice from dripping, so that the flavors are retained. The chicken here is really lean with no trace of fat, the leanness of the chicken does make the meat a tad dry. However, I would say it is quite flavoured... flavour of the chicken?I do really enjoy the rice, which has great flavour and quite savoy!Sadly, I enjoyed the rice and the condiments more than the chicken itself..... Yet Con is worth visiting just for their old school vibe!",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fQ9eK1b29Fp7GydbXCvQsA",
        "caption": "Photo of Yet Con - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fQ9eK1b29Fp7GydbXCvQsA/o.jpg"
      },
      {
        "img_id": "3ijkdYoVeoQoTr6KLeMwTA",
        "caption": "Photo of Yet Con - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ijkdYoVeoQoTr6KLeMwTA/o.jpg"
      },
      {
        "img_id": "HANlBOmwjZgPWb37-K4cCg",
        "caption": "Photo of Yet Con - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HANlBOmwjZgPWb37-K4cCg/o.jpg"
      }
    ],
    "user_id": "CxDOIDnH8gp9KXzpBHJYXw"
  },
  "bqQ3D7aDvmDjOghDaBpy_Q": {
    "date": "7/16/2015",
    "text": "Air-conditioning and basic chicken rice fare is what you'll get here.  The chicken rice is subtly flavored, the chicken fresh with no OTT flavoring so you get down to basics - tender and flavorful chicken. Place is inexpensive and as you read in the other reviews,  a throwback in time.  Just don't expect service and don't talk to the chef!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3BcYEVsvMwDix8aBsPBVng",
        "caption": "Photo of Yet Con - Singapore, Singapore. The gruff but lovable proprietor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3BcYEVsvMwDix8aBsPBVng/o.jpg"
      },
      {
        "img_id": "3uIztbeVN41_MIgbpBf4mw",
        "caption": "Photo of Yet Con - Singapore, Singapore. Don't try to speak to the chef!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3uIztbeVN41_MIgbpBf4mw/o.jpg"
      },
      {
        "img_id": "qYUF4XBXiWDW8Z6lriUb4Q",
        "caption": "Photo of Yet Con - Singapore, Singapore. No prizes for presentation,  all about the flavor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qYUF4XBXiWDW8Z6lriUb4Q/o.jpg"
      }
    ],
    "user_id": "LcGHtqY9eKVSyHbeXQaTfw"
  },
  "tATUMGWQEX1SOZaU6wpBCw": {
    "date": "4/25/2015",
    "text": "Yet Con is one of those places where it feels and LOOKS as if it was a place your parents went on dates at. Hahaha! And I mean this in the best possible way. Much of Yet Con's look is very dated because it appears like it was never renovated since its opening and this establishment has been around for a while. Boasting yummy chicken rice (not the best in SG but darned tasty regardless), yummy beef crispy noodles (生面), fried rice with wok heat, and other comfort food, this is a place that the old faithfuls will go. And prices are still affordable.You gotta love the place. I give this a four stars for simply having that nostalgic favor. And for staying to their guns by serving simple yummy fare at unbeatable prices. Honestly, that's all we can ask for, right? My only hope that tourists will check it out. Manage your expectations. It is not The Raffles Hotel but once you step in there, you will be transported to Singapore circa the 60s. And please....don't disappear, Yet Con!!!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "m369Z6yvE3E5vBww9DSJsw"
  },
  "Lc2rwrvgYe39jpDKC1BRKQ": {
    "date": "12/11/2013",
    "text": "I've eaten a lot of chicken rice my day, but never alongside steamboat, which was a foreign idea to me. Apparently Purvis Street is the place to go for this, with Yet Con being one of two well known chicken rice/steamboat joints.  This place is so old school that I almost felt like I was in Malaysia (which I love)!  Chicken rice?  Check.  Good.  Steamboat with all the usuals?  Check.  Good too.  On top of this, we also tried the offal and hainanese style pork cutlet in gravy.  Admittedly, a massive lunch for three, but we somehow managed to put it all away.  All of the above recommended. Yet Con makes a good alternative to the usual chicken rice stalls a la Tian Tian.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jkr3YVCEoRNKkxinUZpW6A"
  },
  "JvZnxLg5P1lreUzZIAdC6g": {
    "date": "11/3/2014",
    "text": "It's the place to go if you are looking for traditional chinese chicken with more variety. Choices range from Chinese hot pot, wok dishes to chicken rice. To me it's so-so. The chicken is not very tender and quite plain in taste. The pork chop is quite yummy tho.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pOzkT5ZDhlTKoDMkMBuAdQ",
        "caption": "Photo of Yet Con - Singapore, Singapore. A very old fashioned Chinese restaurant!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pOzkT5ZDhlTKoDMkMBuAdQ/o.jpg"
      },
      {
        "img_id": "8YkG8aEo_-XGCj1psqnG3w",
        "caption": "Photo of Yet Con - Singapore, Singapore. Fish soup with tomato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8YkG8aEo_-XGCj1psqnG3w/o.jpg"
      },
      {
        "img_id": "EnZNquLRbhoizXhEgJgRQw",
        "caption": "Photo of Yet Con - Singapore, Singapore. Pork chop",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EnZNquLRbhoizXhEgJgRQw/o.jpg"
      }
    ],
    "user_id": "QGP0TcL_0maoS7NvbXVi2w"
  },
  "jTY8EHMXoicmEJJA13VEaw": {
    "date": "1/11/2013",
    "text": "I discovered Yet Con from a Singaporean food blog as a traditional and historical place to have Hainanese Chicken rice. You won't be disappointed! After arriving in Singapore, we took a cab from the hotel to Yet Con. Surprisingly the cab driver doesn't know about Yet Con, but she knows Purvis St and could take us there. The restaurant just gives you a good nostalgia of how a restaurant is like in the old days. The place has A/C, so you don't have to worry about eating here in the hot summer weather. We (a party of four) enjoyed a half chicken, roasted pork with salted vegetables and Chinese pickles (kiam chai) soup. We enjoyed mixing the sauce (ginger, chili, and soy sauce). You may not get the right combination the first time, but we finally got to what we like after a while. The service was fine since my dad can speak Mandarin. The old man at the cashier uses his abacus to calculate the bill. I read on the blog that he is the last of his generation at this restaurant which has been in business for over 70 years!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "j0MW1QwrxHHTKoc8QKjgfw",
        "caption": "Photo of Yet Con - Singapore, Singapore. Half chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j0MW1QwrxHHTKoc8QKjgfw/o.jpg"
      },
      {
        "img_id": "vmElMXUv-cW0qPqmYwPAsA",
        "caption": "Photo of Yet Con - Singapore, Singapore. Crispy pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vmElMXUv-cW0qPqmYwPAsA/o.jpg"
      }
    ],
    "user_id": "6WOJhznm0-PHVwZ0YBgH6w"
  },
  "Q9BJXcY___8aetelbZvlag": {
    "date": "7/12/2012",
    "text": "Stepping into Yet Con makes you feel like you've stepped back 20 years in Singapore's history with its retro furnishings - spot the orange payphone and the abacus at the cashiers! Thankfully, it's got modern air-conditioning so you can dine in comfort, though there are the occasional annoying flies that get stuck in there with you.People throng the place for its chicken rice, and the old uncle stands in his usual spot at the front entrance chopping up chicken and other meat. Several of my older friends love the chicken rice for its authentic and slightly muted flavour which somehow reminds them of their younger days - the steamed chicken is served without the usual sauce condiments you get in most chicken rice these days, and the rice is not so oily, but I personally wished it was a bit more flavourful.There are a bunch of other dishes which are popular as well - many other diners were ordering the fish maw, and the pork ribs were pretty yummy. The roast pork had a sweet burnt sauce which wasn't to my liking but the texture was not bad.Overall not a bad dining experience - go early if you're keen because it's a small place that gets crowded during lunch and on the weekends!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JXx-7LSELg4gMGDuiR6J3g",
        "caption": "Photo of Yet Con - Singapore, Singapore. Old school payphone and abacus give this real vintage flavour",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JXx-7LSELg4gMGDuiR6J3g/o.jpg"
      },
      {
        "img_id": "c-sPEHgOU2q0rqwOpcngUw",
        "caption": "Photo of Yet Con - Singapore, Singapore. The traditional chicken chopping station",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c-sPEHgOU2q0rqwOpcngUw/o.jpg"
      },
      {
        "img_id": "f358lWURIemF8mItTnvT0g",
        "caption": "Photo of Yet Con - Singapore, Singapore. Food - Chicken, Kai Lan, Fish Maw, Roast Pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f358lWURIemF8mItTnvT0g/o.jpg"
      }
    ],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "QewWiTsaMYw6KYP-MbwAlA": {
    "date": "9/2/2012",
    "text": "One of the most attractive things about Yet Con is that they offer quality chicken rice in the very heart of the city and provide you with an air-conditioned environment to have it in. Once you can make it past the queue you'll feel like you're stepping back in time. What I love about this place is that old tea house feel to the place, from the furniture to the decoration and even the abacus that the man at the counter still uses - none of those funny machine things!This place serves up the most genuine Hainanese dishes that you might find in Singapore, with tastes rather different from how you'd imagine them to be. You'll definitely be getting their chicken rice of course, but the rice itself isn't the regular chicken rice you've grown accustomed to, but is a less oily, more salty, with a less 'prima' taste to it. You might have to try it for yourself - I don't find that I can quite describe this properly...it really just so different from the norm. The chicken itself is more meaty than the average kampung chicken, and also a bit juicier. I initially found it a little uncomfortable because some bits appeared a little undercooked such that you could still see the red in it, but that's apparently how it's meant to be so I trust that they only get the best and cleanest chicken.We also got their roast pork, which I wasn't expecting to be any good in a 'chicken rice shop' but it turned out to be quite unique as well. Very very thinly sliced roast pork, drenched in a sweet sauce, with preserved vegetables hiding under it. There was a bit of that acidic taste, probably from the vegetables, but it was quite a wonderful change from the standard crispy and salty roast pork you usually get. Well, this was really quite crispy as well, but the taste was just different.We ended with a bowl of fish maw soup: very simple presentation, very simple soup, but very generous portions and very wholesome taste. Complete with squid, prawns, fish meat and lots of fish maw and vegetables, it packed a good taste in each mouth. Definitely worth getting.What surprised us most was that for the three of us with three dishes, the whole bill came up to nothing more than $24 (I even had a lime juice!), which I thought was stunningly cheap. Phwoar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8ZYmjVNA9PY-Cxrpjg4fZw",
        "caption": "Photo of Yet Con - Singapore, Singapore. yum yum fish maw soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8ZYmjVNA9PY-Cxrpjg4fZw/o.jpg"
      }
    ],
    "user_id": "4Uf6g20S-2ZcxJSuvVIjJg"
  },
  "hqNDg_-Kje0H1qltT5rkcg": {
    "date": "7/10/2012",
    "text": "There are plenty of chicken rice places in the Seah St/Purvis Street area (Hainanese enclave, a long time ago), so why this one? I love Yet Con for the dark, thick, rich soy sauce, and for, when you are lucky enough to get it, their roast pork. It's much darker than the usual golden brown, but the crackling is light (can I say airy?), and the car adds a certain something. The sweet soy they drizzle on that is delicious too.When I am not eating alone, we like to order from their zi char menu to supplement the meats--there are some zi char favorites such as hot plate tofu, but the thing to go for is the stir fried fish maw. So good that I could drink the gravy! Steamboat is also available, though I haven't tried it and so cannot comment.I suspect Yet Con has not changed its looks (interior and exterior) or its staff since it opened. There is air conditioning, never fear, but the tiled floors, marble-topped tables (having long since lost their shine) reflect the age of the staff. I am especially fond of the white-haired uncle at the cashier. Do note that Yet Con is one of the more popular establishments in the area, so be prepared to come early, or to wait for a table. This is true both at lunch and dinner. Service is efficient bordering on brusque, but you're here to eat, no?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eJTvrjKOWfbh1QpZtebLXg",
        "caption": "Photo of Yet Con - Singapore, Singapore. The thickest, richest soy sauce ever. And no, I don't think it's actually Kikkoman.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eJTvrjKOWfbh1QpZtebLXg/o.jpg"
      },
      {
        "img_id": "5DtjgBovY8nhxqAx90iCRw",
        "caption": "Photo of Yet Con - Singapore, Singapore. What you get for $10.20--chicken, roast pork, bowl of random soup. And that yellow oil on top of that ginger? Is chicken fat. OM",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5DtjgBovY8nhxqAx90iCRw/o.jpg"
      }
    ],
    "user_id": "YJyVBqo9enL7XnzMnAkv_A"
  },
  "bljbRwZqX2RHVHlQ3q5UxQ": {
    "date": "8/26/2012",
    "text": "Amongst many of the chicken rice shops along purvis street, I prefer Yet Con.  This place has been there like forever. The deco can reflect its age. It seems like you are stepping back into the 80s. I remember growing up eating their chicken rice and roasted pork. Well, what is so special about Yet Con? Everyone talks about their chicken rice but for me three of my favorite dishes there are the roasted pork with salted vegetable, hainese pork chop  and steamboat. I love their steamboat soup broth is awesome.  It is not laden with MSG rather it has the flavors from the chicken broth. This place can get rather packed during lunch and dinner time. The service is fast and efficient. On the whole, the people working there seems to be food nazis.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fKBOn27lnMlUqxC_lvKHrA",
        "caption": "Photo of Yet Con - Singapore, Singapore. Steamboat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fKBOn27lnMlUqxC_lvKHrA/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "Wqzta_miJRNb2o5s_rdvSw": {
    "date": "3/15/2015",
    "text": "A local friend took me to dinner here last night.  She said it was very traditional and standard fare.  We had the chicken and rice.  It was good, though bland.  I was expecting more spice.  I doctored it up with the garlic, chili, soy sauce quite a bit, and still found it lacking.  The photos in the other reviews are accurate, though they do not show the cleanliness level.  It was a bit dirty.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsfKS24TMmjaF93vSL9xmA"
  },
  "tsH0GeUw5JgrORyhgJhNNQ": {
    "date": "1/22/2013",
    "text": "You can actually taste the chicken! Flavorful and not greasy.This place is old school Hainanese chicken place since 1940. The chicken is delicate and flavorful. They have a jar of minced Ginger on the table that brings another flavor dimension with the chicken.Go for the Hainanese BBQ pork.  Crispy pork chunks with preserved mustard greens balance the chicken's delicate flavor.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G6tWC8li_ro7dxQtKdvSBw"
  },
  "RmlfsyvDm7Sn1GoAT5KMBg": {
    "date": "9/2/2012",
    "text": "While others might rave about the authentic Hainanese Chicken Rice at this old shophouse restaurant, I beg to differ. The chicken rice flavor here was way too plain and average for my liking. While the chicken rice does not suit my palate, I have found treasures out of other dishes here. The Hainanese Pork Chops are one of the treasures. This tomato-based sauce pork chops were tasty and flavorful. The pork fillet was well marinated and fried till crispy on the outside, and tender on the inside. Paired with the sweet and sour tomato sauce and onions, the dish was marvelous. This place is one you can feel nostalgic in, as you have a feel of what olden-day Singapore would look like. The setting is traditional and vintage, which seems to be what attracts the crowd.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "L9WWBsYBdrk-Wmjul6AYqA": {
    "date": "7/12/2012",
    "text": "We have been coming to Yet Con for the last 20 years, and not much has changed about this place, thankfully. The Hainanese proprietor is a constant, as are the staff, the marble tables and the general interior. Food : We like the chicken rice and the chicken itself is decent, but what we REALLY love are the Hainanese pork chops. Sliced to the perfect thickness and deepfried to a delicious crumbiness with a generous helping of sweet and sour gravy, it is a comfort food that transcends generations. The prawn fritters are also fluffy and delicious, but be sure to eat them while hot and crisp. The tofu with seafood and vegetables is pretty good too, with the distinct taste of wok hei in every bite. The steamboat is pretty good on rainy days too.Ambience : Old school. Love it.Service : Fast. Efficient. Good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  }
}