{
  "NqEQIBoRt8lU6WjMBSydNw": {
    "date": "5/27/2016",
    "text": "Tasty Tokyo Chicken Stew. Delicious broth with an abundance of celery, chicken and mushroom pieces. I liked that water was free flow, you just have to help yourself. Service was quick and seamless. Nice background music. I came at 5.30pm on a Friday before the dinner crowd came so that was nice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eF-ep4Lbzj0a7Dq6kbxXJw",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Tokyo Chicken Soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eF-ep4Lbzj0a7Dq6kbxXJw/o.jpg"
      }
    ],
    "user_id": "wsKYliTugyRCU7FptnGBuA"
  },
  "CBFgnaa2fhPraL2CDyZZ8w": {
    "date": "6/24/2018",
    "text": "I was looking for the Tim Ho Wan restaurant and realized I made a wrong turn but was too hungry to backtrack so I decided to try this place.  I put my stuff on the table and walked to the counter to make my order.  I ordered the fried chicken steak with a green salad and spaghetti with marinara sauce and added the mushroom stroganoff soup and an iced lemon tea.My food came out about 4 mins later and I realized the chicken was probably under the heat lamps.  My suspicions were trueAs the chicken breast was warm and tough to eat.  The soup was not tasteful at all and just lacked any flavor.  It was a total disappointment except for the iced tea which was perfectly sweetened.  For about S$15 the meal was not too good.  I will not be back here anytime soon nor recommend it to others.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fvTNZRh8eHKQk3lkpjEofg",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Looks good but isn't",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fvTNZRh8eHKQk3lkpjEofg/o.jpg"
      },
      {
        "img_id": "tcflVriR4cizdyQrE8zjlA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. The bland soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tcflVriR4cizdyQrE8zjlA/o.jpg"
      },
      {
        "img_id": "Mjy_g62_6jBLOez7lECi9A",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. The restaurants",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Mjy_g62_6jBLOez7lECi9A/o.jpg"
      }
    ],
    "user_id": "NaKIUQrZGA9gL7jvq1p0_w"
  },
  "7ntWt82d2Rdgplco5YLrJQ": {
    "date": "1/4/2018",
    "text": "I have had soup here on several occasions and the soups have always been delicious. today I ordered a teriyaki chicken sandwich along with a bowl of mushroom soup. The soup was good but the chicken sandwich was terrible. It was overcooked all dark meat hard to chew and did not even resemble the taste of teriyakiDelivery service was slow",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJEvesiK_AZ3F-uFYCiY0A"
  },
  "llSGt0vNjn1E-_jC7sJ4sg": {
    "date": "7/22/2015",
    "text": "It used to be 3 separate eateries (Soup Spoon, Soup Broth Asia and The Handburger), next to each other but they merged it to become The Soup Spoon Union a few years ago. Soup Spoon is pretty much an institution now and can be found in many parts of Singapore. I do like the soup and usually get the pre-packed soup for the weekend. You can also order the fresh soup to go, just remember to ask for butter with your bun. Another favorite thing to order is the iced lemon tea which is freshly made. None of those pre-mix powder drink which has a certain taste to it. I have not tried anything from Soup Broth Asia since the merger. Before that, the Asian soup I tried was ok, nothing too special about it.I had good memories of the burgers from The Handburger before it was unionized. The burgers were juicy and decent sized. The highlight was the milkshake which was thick and rich. During my recent visit, I order The Works burger which basically had everything - bacon, fried egg, onion rings, slice of cheese and beef patty. It was good but it was also cold. I was not sure if it was because I was talking away and the food got cold or if the air conditioning was so strong that the food turned cool fast or the food came very lukewarm and so turned cold by the time I ate it. However it happened, cold food was just not very enjoyable. The prices seemed to have dropped too. My burger set was just $14.90, a steal as it came with a choice of drink and side. I chose the cake of the day, a misnomer as you get to select from 4 options. The lemon drizzle cake was good but a bit dry for me. My friend liked it that way though. This is a good place for those who like plenty of options or a group of people who has different dining preferences. The current low prices also help. There are tables which can be joined together accommodate big groups. And yay! They finally accept credit card - PayWave FTW!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "8uZmQ5-MEScSdrzBJG82Uw",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Lemon drizzle cake and homemade iced lemon tea",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8uZmQ5-MEScSdrzBJG82Uw/o.jpg"
      },
      {
        "img_id": "tlpnBsaF21z4f05gdHhCgg",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. The Works burger set $14.90. With drink and side.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tlpnBsaF21z4f05gdHhCgg/o.jpg"
      },
      {
        "img_id": "lByrBhf1RaPumVSsyHLFfA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Original burger and fries in background. The Works burger and lemon drizzle cake in foreground.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lByrBhf1RaPumVSsyHLFfA/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "EUPfOsaSqD5G9LicQVFp6A": {
    "date": "9/2/2017",
    "text": "Great food! Loads of space but they do not accept NETS. Only cash and credit card. Still awesome!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZVz5Ked8fx1hYVUMtO8BQ"
  },
  "RanEaxXGZuOU8Kba1KvGKA": {
    "date": "1/24/2016",
    "text": "Salad with falafel and quinoa - 2.5 starsDidn't like the aioli at all. They forgot to put the dressing on the side and after trying to eat it with the dressing I had to send it back. The falafel was dry on its own, and the quinoa didn't taste right either - it should be a little nutty. I guess the vegetables weren't fresh or flavorful so I got tired of eating the salad halfway through. Reasonable for its price and I suppose it's a healthier option than most others, but this salad gives eating healthily a bad name. Perhaps the other options are better... I'll give this place 3 stars overall because the service and ambience aren't bad.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "-d1Y73ZfD73BTWbTXonpLw": {
    "date": "12/14/2015",
    "text": "Convenient place to grab healthy food options. Today I tried the half and half soup combo. Topped up $1.80 because I included the souper inspiration. It was my first time trying the beef bourguignon and it was disappointing. No strong beefy taste, a little too starchy and sweet and no beef except a little half cube of beef. Granted it is difficult to get an even distribution of beef from the large vat of soup but still, the staff should be even more so trained to make sure they can get a good mix of ingredients. Oh well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3Dd4H8KadMeiRNXGCosMYA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Salad menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3Dd4H8KadMeiRNXGCosMYA/o.jpg"
      },
      {
        "img_id": "4XAkva7wJrG9HiY8V57VUw",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Half and half set",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4XAkva7wJrG9HiY8V57VUw/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "E5nx4_VuG_dW0Z3MNS2jRA": {
    "date": "4/20/2015",
    "text": "Totally a brilliant idea to have a UNION, combining Soup Broth Asia, The Hand Burger and The Soup Spoon. For the indecisive ones who wants a bit of everything, you can order the union sampler which comes with two petite mains from any of the three stalls + a petite Caesar salad. Embarrassed myself, that I've always walked pass the union but popping in for the first time and found myself some treasures. I ordered the dark miso charcoal ramen, and my boy had a kimchi beef ramen, both from soup broth asia ($11.80 each!). Surprising tasty came my squid ink ramen! I was so delighted and overwhelmed by the taste of my bowl of ramen. Couldn't finish the whole bowl and gave away half of my huge drumstick in my bowl, and leftover 1/3 portion of noodles.I'll be back again to try other items on the menu! Soooooo yums!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Cku4e0lVWDLfvSNrVWwmMA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Huge serving size from the team at Soup Broth Asia!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cku4e0lVWDLfvSNrVWwmMA/o.jpg"
      }
    ],
    "user_id": "O2itSY4F2jnPRXaxdVGOkQ"
  },
  "wjr7IN55Olil8IcWG0WBug": {
    "date": "8/24/2014",
    "text": "Not a bad option in Raffles City basement. Lunch on a weekday wasn't bad; there were people but a decent amount of seating to choose from.As the name suggests, this is union of a few different concepts: noodles, burgers, and soup. You order at the cashier first and they'll give you a tracking device. I say this because it looks like a buzzer. However, instead of it vibrating to alert you to retrieve your order, somehow a server whom you've never seen in your life will just find where you're sitting and deliver your food. Creepy efficiency!For my maiden voyage here, I chose the Handburger stall. I ordered the THB original, which is basically your typical cheeseburger. If you make it a meal, you can choose from a variety of sides, but I stuck with fries. I liked how there was (what I assume to be) an onion relish on my cheese; the sweetness balanced out the savoury perfectly. I also noticed that the lettuce and tomato were underneath the beef patty, which helped in preventing the bottom bun from getting soggy. The fries were served with a sauce that didn't taste like ketchup; instead it had the consistency of a sweet and sour sauce. It was good, though.Not sure why, but it costs $3 more to get a stuffed portobello burger than a meat burger, so vegetarians, you might have to pay a little more. :( But other than that, the service was amazingly quick and I enjoyed my food. Yay! I'm a fan.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "scfuCmqU3_0OWcfhOel6tA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. THB (The Hand Burger) Original meal, $15.70",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/scfuCmqU3_0OWcfhOel6tA/o.jpg"
      },
      {
        "img_id": "Cns7S9kqbby-jTVaYjHMJA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Interior, decent lunch crowd. At least you don't need to fight for a seat!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Cns7S9kqbby-jTVaYjHMJA/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "V0ko90BD_AIqq0Su51yGzQ": {
    "date": "5/13/2014",
    "text": "I was surprised to learn that the Handburger that used to be at 313 Somerset is in a 'union' of sorts with Soup Spoon and decided to give the three outlet union a try.I opted for the Beef Kimchi Ramen which was sadly, disappointing. The beef slices though adequate, were tough and chewy. The noodles were satisfactory and the broth resembled too much of the Asian version of Minestrone Soup. My partner opted for the Chicken Burger meal with Mushroom Soup and a Drink. Nothing to shout about but the soup was definitely the winner of the set only because it was the same soup they sold at Soup Spoon.This union is definitely not made in Heaven.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gY2F2aAoRG-e01kLFgSgRg",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Flour less chocolate cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gY2F2aAoRG-e01kLFgSgRg/o.jpg"
      },
      {
        "img_id": "UZTGNgiTkX-SAAQb2qoaQg",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UZTGNgiTkX-SAAQb2qoaQg/o.jpg"
      },
      {
        "img_id": "xPXG6EQ_ZOHxBdBKV3gWkQ",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xPXG6EQ_ZOHxBdBKV3gWkQ/o.jpg"
      }
    ],
    "user_id": "ZNyfGsIwsedPlpjmoaq3Eg"
  },
  "XYzBYRIknGZyzNIwmyobMQ": {
    "date": "8/19/2012",
    "text": "Here I am again, reviewing ANOTHER Soup Spoon outlet. This really cements my reputation as their biggest fan. (Yes I have kept all of their Souperholic cards.. from when they stamped it till the digital one where they store your points into..) At the Raffles City Outlet, they sell the same thing as the other Soup Spoon outlets. Just what makes me keep going back even though there is nothing different from the other outlets? Firstly, if I'm looking for something relatively healthy and filling, this place is it. So for those who are feeling guilty about munching fried food all the time and cringe at the thought of splurging $8-$22 for a bowl of vegetables, stick to the tastier option of Soup Spoon. Secondly, it's their Soup Specials.. every month or so, Soup Spoon brings in 3 special soups that are not on their main menu. They had french onion soup, miso seafood soup, broccoli and cheese soup etc... something uniquely different from the usual every month, so if I keep running back, it's because I know the soup I like from the unique menu, will be gone after a certain time period. Of course, if the regular souperholics whine enough, the popular special soup will be placed on the regular menus.. like the Simon and Garfunkle Ragout Stew.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "APo3KSYwVK9Q8PokaCESJQ",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore. Soup special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/APo3KSYwVK9Q8PokaCESJQ/o.jpg"
      }
    ],
    "user_id": "_6zTmwRscQUpbyo8etB0nQ"
  },
  "Abgxn-LjcXtCZv4RQe74RA": {
    "date": "10/4/2014",
    "text": "3.5 stars.  As a tourist from the US, I was enjoying all the Asian food but my son just wanted something familiar. So we ate here. The Tuscan seafood soup didn't seem very Tuscan but it was tasty and full of large pieces if seafood. 5 stars for that. However, the fish wrap was blah. It was grilled perfectly on the outside. But it should not have been grilled. Inside, the fish batter was mushy and taste greasy. The lettuce was wilted from the grilling and it all mushed together with a herb spread.  2 stars for the fish wrap. 4 stars for the service. Even though it's a really casual place, the staff was friendly and very helpful since I had my hands full with a little one. They even gave him a Cars plastic plate and plastic fork and spoon. Very family friendly place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4EwgfMfUPyJE6Y595oOtiw"
  },
  "SjnyjeEAa_fdK8fxNbvF2A": {
    "date": "7/27/2012",
    "text": "I think this is probably the only outlet that sells naan with the soups so I tend to head there more often that other outlets. My usual orders include the tangy tomato, cream of mushroom and clam chowder - depending on how I feel. Too much of the mushroom and clam chowder can make you feel abit 'gelat' after eating all that cream but the tangy tomato is not as thick, so that becomes my choice about 60% of the time.Their sandwiches are alright. Maybe just abit too much bread and too little filling, so for me, i just add an extra naan (or two if i'm sharing).Good stuff!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F3xBMuansc-EbWe1RH4w_Q",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F3xBMuansc-EbWe1RH4w_Q/o.jpg"
      }
    ],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "EBNbbupBEzlFC2bX5kAF_g": {
    "date": "9/27/2013",
    "text": "Update: a CHANGED concept now!Unionisation zooms in when the F&B business expand and that's what I have recently seen at the basement of Raffles City Shopping Centre. Never gets hungry, the floor below the ground is always flooded with lunch crowds & tourists when the clock stroke noon. Just as I get bored by the same shrews of eateries waving at me each day, I whiffed some beautiful floral scent that intrigued me last week.I was lured by the scent, and then by the colorful blossom stood in front of me and then I realized the wordings on the card pinned on the leaves that reads, \"Congratulation on the opening of The Soup Spoon UNION...\" The logo was quite a success in translating the new message \"UNION\", I'd thought it was a new member to the basement. Upon studying it, it is effectively a unification of the 3 food brands under the same F&B group. UNION now housed the well-known soup joint: The Soup Spoon (TSS), Asia Broth Noodle Bar(ABN) & The Handburger (THB) in a larger unit compound. The 3 eateries are not new to the mall, each exists at the basement for quite a while with the Asia Broth Noodle Bar being the last to join.The new layout has a clean canteen look with sturdy wooden tables and movable metal chairs and a sofa bench. A few apron-clad personnel will bring you the food when it's ready except for the soup when it's readily available. The staff are polite and prompt in table clearing - the service is generally good.Menu is available on each table. Just find your own seats and get to the respective counters for your orders. There's no cross-ordering; you can't order for a THB dessert at TSS when u wanted a soup to go along. Queue separately. TSS has their own payment counter at the stall, but to pay for THB or ABN purchases, you need to queue at another standalone cash register adjacent to it. The whole concept hasn't been fully unionized if it appears that manner.Comes to food, I opted for a value super meal from TSS that sounds a better deal. I got a soup and my half salad and drink by topping up a $4.90. An additional bread roll for $0.70 since I had a large Beef Goulash to share.The Beef Goulash is a thick tomato broth with slightly stiff beef chunks, shitake mushrooms, potato morsels, red/green capsicum wedges, dissolving celery bits. Lightly seasoned, the soup has a lively soul heightened by the onion and garlic to it when I mop up its last drop with my bun. Very satisfying.The Asian Tofu Salad was my option to complete my set. The Thai-style vinaigrette serve alongside so citrusy with a subtle heat. The aroma stemming from the sesame seeds did well to the salad. I love the nice fragrant deep fried beancurd, cut into cubes with a few wedges of that plump & juicy petit-size orange. Its tangy-sweet flavor freshen up the fried companion in the bowl. With added sunflower seeds, there was a faint nuttiness in the composite. What I didn't enjoy was the raw pea sprout taste, quite awful to me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IIVTHna4vd7EOJJTKaS5uw"
  },
  "kLJxvji4FoShKK9gbb_Kjg": {
    "date": "8/22/2012",
    "text": "I was brought here by my friend. She is a madness fan of Soup Spoon. I always reject her whenever she asked me to go for Soup Spoon. Till one day, I surrender. Soup Spoon is a restaurant that serves different kind of unique soups. They always come up with 3 different kind of new soups every month. My first impression of Soup Spoon is that it wouldn't be filling enough for me. So I went ahead and try their Simon and Garfunkel Chicken and Mushroom Ragout. It contains chicken, a lot of different kind of mushrooms, potato and carrot. Their potato and carrot are really soft. Dipped together with their complimentary soft bun into the soup, really yummy! To my surprise, I was really really full after finishing half the bowl. They are really generous with the ingredients. Nonetheless, it is definitely a must to order their homemade Ice Lemon Tea. They are pretty well known for their Ice Lemon Tea. Not too sweet, giving me a refreshing feeling. Now, I became a madness fan of Soup Spoon.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q-3Z70RAS9_tD4nvb4RTLA",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q-3Z70RAS9_tD4nvb4RTLA/o.jpg"
      }
    ],
    "user_id": "H5giEryaio2xzYX6qKraPQ"
  },
  "_qu6PsrGkGtyTpS5RStacQ": {
    "date": "7/24/2012",
    "text": "I've come here a few times to have their soup (I haven't tried their salads, wraps or sandwiches), as whenever I feel like having a hearty soup, I tend to think of this place. It's in a good location, it's pretty central and their options for soup is pretty cool.What I Love: Their soup options are really something else. You have the minestrone, cream based options, beef stew and a whole lotta meaty options. You can make it a set, by getting a drink and bread, or keep it simple, with just the soup. Oh yes, there's a pumpkin soup!! Which I tried and loved! You can't go wrong with any of the options.What I Don't Love: Their prices can be a little bit steep. A bowl of soup would set you back $6-7, though the portions are pretty okay. It's also pretty hard to get a seat during weekday lunch/dinner time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J1u7JzVLZ2xxgFi0pRhfPQ",
        "caption": "Photo of The Soup Spoon UNION - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J1u7JzVLZ2xxgFi0pRhfPQ/o.jpg"
      }
    ],
    "user_id": "0jmAZwCwQN9ByyWsLx7khA"
  },
  "1-hVC1iUTq7WIxnkaP2Bgw": {
    "date": "7/24/2012",
    "text": "I usually come here for a meal with my girlfriends when we don't feel like having too heavy. Their soup which comes with a little breadroll or nan is satisfying and comforting after a long day at work. My favourites to order are the Simon and Garfunkel Chicken and Mushroom Ragout and Tomato Soup. The chicken soup with a fancy name comes with generous portions of chicken chunks and some bits of mushroom, and is definitely enough to fill the tummy. The tomato soup is pretty simple, but I like it because there is a slight spicy kick. Their breadrolls are nothing to rave about, but try their nans if you're looking for something more filling. Each piece of this indian bread is huge and fluffy and goes perfectly with the soup. A cheaper option for soup if you're in the Raffles City area is Cedele Bistro on the same level - but Soup Spoon definitely serves up a larger portion and selection of soups.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fUWq6sOIEe1uTUhNKS9sQ"
  },
  "du9dvsMg_xRgaMYGVDxpkg": {
    "date": "9/6/2012",
    "text": "I absolutely love this place. If I worked in the area, I fear that I'd be here practically everyday for lunch. My absolute favourite combination to get is the meatless minestrone soup - delicious and filled with yummy chunks of vegetables - and half a portion of the Asian tofu salad. The latter is truly inspired, what with the bits of mandarin oranges and unique vinaigrette, but I usually steer clear from the full portion because that's simply way too much tofu for one sitting. It gets really busy, which just bears testament to how good the food is. A definite must try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OID9ZOyljsyx7HVAP_29aQ"
  },
  "4unZkasLr0JAGvsFc5_V9A": {
    "date": "8/28/2012",
    "text": "I love how they put the calorie counts on the dashboard for each soup. They have specialties occasionally, such as when they serve the blue cheese variety. On a normal basis, i would have their pumpkin soup which is of a thick consistency and extremely silky texture. Further, their clam chowder soup is to die for with a generous portions of clams and ingredients - extremely fresh too. Last but not least, their Velvety Mushroom Stroganoff is one of my staples - with chunks of mushroom and a thick, nice quality to it. It beats your typical weak cream of mushroom soup hands down. All soups are served with a bun, and have a price range of $6 to $10.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "U7YS-HrvEa2M82daKlEG9g": {
    "date": "8/10/2012",
    "text": "A great place to visit on a cold rainy day! If you ever made soup, you will know the intense trouble that goes into making one so why not save the trouble and head down to The Soup Spoon. I am a fan of clear soups so naturally I went for the Asian chicken soup with lotus (that might be their only clear soup if I am not mistaken). The  portion healthy with generous chunks of chicken but then again that might depend on the person that scoops your soup. The Soup Spoon also sells vacuum packed soups which are great for dinner parties or even personal consumption.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  }
}