{
  "b2BU9w0kHIjYz-uA6ldo5A": {
    "date": "8/14/2018",
    "text": "What an amazing experience! Food was perfect and service was also. Pork belly was fabulous and the Peking duct was delicious. Will certainly go back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2LHn929ro6cZ5DCS_r5dJg",
        "caption": "Photo of Crystal Jade Golden Palace - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2LHn929ro6cZ5DCS_r5dJg/o.jpg"
      }
    ],
    "user_id": "nNjbJrKwxTDPd5yPQVnKMw"
  },
  "bzC6fxUkwVprfJNlokS19Q": {
    "date": "5/16/2018",
    "text": "QQ Dumplings: 3.5 starsLooks like an adorable little elephant (小飞象).  Chewy rice flour 咸水角 dough.Prawn with Mango: 1 starI really didn't like this dish.  It tasted like that cheap kind of mayonnaise/cream cheese-based dish at Americanised Chinese restaurants and was too heavy and sweet.Noodle Roll with Salted Egg Yolk: 5 starsThis was amazing.  It's a cheong fun exterior wrapped around the crispy fried lattice like those that come on taro puffs, and filled with salted egg yolk.  Dip it in the savoury cheong fun sauce and it blows your mind.Black Bao: 4 starsXiaolongbao (soup dumpling) filling in an exotic-looking steamed bun.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "WtZyXabdl1bP1XJ7vQRG-A"
  },
  "gb0JzeLx9KzwySRdzztVWA": {
    "date": "5/1/2017",
    "text": "Great service, great food. the dim sum dishes we had were really good. to highlight some of them...the salted egg fish skin was really flavorful and crispy. so was the deep friend \"white rice\" fish. The char siew bao were soft and fluffy with great yummy filling on the inside. My favorite is the deep friend minced meat turnover. you don't get that in every dim sum restaurant here in Singapore so I am always very happy to find it on the menu and this particular one was very well made with a crispy exterior and a chewy glutinous interior. Not greasy at all.To avoid disappointment, I highly recommend making a reservation before heading down.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "1C-ZaVQI7JpczFPGyyvuFg": {
    "date": "12/28/2017",
    "text": "Crystal Jade- an appropriate name for a restaurant located within a mall that exudes elegance and sophistication. In this establishment you are to experience traditional dim sum perfected and refined to fit a high-class dining experience. I think at least, I've barely eaten anything.As I write this we're about 40 minutes into service and have received only 2 of 8 dishes that we had ordered. They did let us know upon entering that we would only have 1 hour since we didn't have a reservation, which is fine, dim sum barely takes any time at all! Come to find that again, each dish is taking rather long and tables around us are being fed multiple dishes before we've received our 3rd. We've gotten LOADS of tea though, they are very good at pouring and restocking our tea. Which is all we've been doing because there's nothing else to consume on this table.The dishes we did have are fine. They're fine. Worth the 40 minute wait? I'm going to have to reserve judgment since I've yet to taste our remaining 6 items.Our waitress let us know that there were complications in the kitchen, but I find that extremely hard to believe when most other tables have been served many plates of food and we are the only table that has been neglected. The only redeeming factor about this experience is that I ate beforehand. Despite that, this wait is inexcusable and I would exercise caution when dining with Crystal Jade.Update: We've finally received all of our food in exactly 1 hour. I can't imagine that they'd give us grief about staying here longer because we need to eat. My final judgment- it's fine. I can't imagine myself wanting this again or wanting to recommend it to friends. So as there is nothing exceptional being served here, I would only dine here if it is strictly convenient or you are dying of hunger. But even in the latter case you may be forced to wait some time so it may be a lost cause.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QjglNlw1O1L8CiB5Vbft7Q"
  },
  "ot_nbgXg_Ebsn7TlHtIIbw": {
    "date": "4/28/2018",
    "text": "Very nice ambience and excellent food. Meals were served fast, service was good as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlW0quOL0sitFML85ckahw"
  },
  "IJwWYRIhF7UOLsnmT6Lubg": {
    "date": "12/17/2015",
    "text": "Dim Sum LunchBest was the service from Ms Goh Chai Hong who helped me with a bag all the way to the entrance as I was in crutches. So kind of her.Ms Goh also offered my Friend and I shawls if we felt cold.White bait - lovely; light and crispy and not oily - very good.Teochew crystal skin dumplings with chives - good but I don't like the taste of chives, can be a little green.Meatballs - not bad although I am not into meatballsPomfret fillet porridge - goodDried Chilli shrimps on rice rolls - very niceXO sauce carrot cake with egg and bean sprouts - good",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "P5ujqxqrIMxetlpvLawhtg",
        "caption": "Photo of Crystal Jade Golden Palace - Singapore, Singapore. Pomfret fillet porridge - good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P5ujqxqrIMxetlpvLawhtg/o.jpg"
      },
      {
        "img_id": "4jgWUHEbFsuUCDsGFjtP0w",
        "caption": "Photo of Crystal Jade Golden Palace - Singapore, Singapore. XO sauce carrot cake with egg and bean sprouts - good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4jgWUHEbFsuUCDsGFjtP0w/o.jpg"
      },
      {
        "img_id": "I7eDfWpKn4VwI2Q2HjKe8Q",
        "caption": "Photo of Crystal Jade Golden Palace - Singapore, Singapore. Chilli dried shrimps (hei bee) on rice rolls - nice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I7eDfWpKn4VwI2Q2HjKe8Q/o.jpg"
      }
    ],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "-T03xjaAuMPA5ggz6O9G5w": {
    "date": "10/23/2016",
    "text": "Amazing Chinese food! No matter it's the toasted pork, Peking duck or crab egg xiaolongbao, the restaurant did every dish to a perfection. Love the xiaolongbao, the crab yellow was so creamy, and generous in size. It explodes your senses. The hairy crab is a seasonal speciality and only available till mid November. Do not miss out your quota for the year. :) I tried the fried noodle pizza for the first time. The idea is to cut the pizza-like flat thin noodle into small pieces. First spread a thin layer of sugar, and use a spoon to drip a few drops of vinegar. Viola, crispy, slight sweet and sour. I never ate deep fried food, but was tempted to finish almost one slice..Steamed sea bass was also a delicacy. One spoon of fish soup into rice, and eat it with the fish, rich and yet refreshing.The staff was well trained, friendly and very attentive, made all the right recommendations. The restaurant also sells its own branded chili sauce and xo sauce.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "PPt9-7v3IcseChyw_RpTQQ"
  },
  "aHT49SqiqoENWWcV1L284Q": {
    "date": "3/3/2016",
    "text": "This was our second time at Crystal Jade. This time we sat at the bar because we didnt make a reservation but the staff here as usual were super friendly and nice they always make me feel welcome. The bar area was actually quite comfortable. I ordered a few things such as the duck egg fish skin, soup dumplings, custard buns, pork belly and foie gras. However, minutes after there was some kind of alarm and apparently one area of the kitchen had water sprinkler going off and it was the area that made the pork belly and foie gras so were not able to get our dishes. The fish skin was delicious it was light and not too heavy with the egg yolk. The soup dumplings unfortunately all explored and we lost the broth in the dumpling. The custard buns were great!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "A_OETe5Xr26FTNRPkRQ4zw"
  },
  "5e_IBIOeR11m79bETwetuw": {
    "date": "12/12/2012",
    "text": "It's probably best if I didn't tell you how often I was at this restaurant for Sunday dim sum brunch. Yeah, it's pretty ridiculous. I manage to con different friends to get my dim sum fix at this place week in and week out. Because their dim sum is just.that.damn.good.What's not to love about little pillows of shrimpy/porky goodness???There's nothing happier to life than baskets of dumplings flowing towards your table to be consumed. Each of this little morsels are crying out EAT ME. So I do. Shrimp dumplings, xiao long bao, teochew crystal dumplings, cute little jumbo shaped dumplings, XO fried carrot cake, shrimp rice rolls, beancurd rolls, etc. etc. You just can't go wrong. Ask for the  (doubanjiang) for dipping and you're good to go. Because everything tastes better with a little chili kick. -1 star for service because they never seem to get it quite right.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vV8KSV6hTV7LIpGrey0EWA",
        "caption": "Photo of Crystal Jade Golden Palace - Singapore, Singapore. little elephant dumplings. cute and delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vV8KSV6hTV7LIpGrey0EWA/o.jpg"
      }
    ],
    "user_id": "PSiioYMqJ1r0On_RijpQaA"
  },
  "ZVfLu0vHdywXAjEoOagdhg": {
    "date": "9/30/2016",
    "text": "Really like this place for dim sum lunch.  Great venue, better food, ok service (...even though after the one Michelin star it got way too busy)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "aL4Wadb8wGWI5bNDXk_MDw": {
    "date": "1/29/2015",
    "text": "It has been a few years since I revisited this place, and I was glad I did. The dimsum still maintained their usual standard, and I just generally find their decor very tasteful, and it is a great place to catch up with friends. I can't think of a single dish that stood out as being outstanding, but the general caliber of the dim sum is pretty damn good. I like the good service here as well, and that it's not too loud compared to other dim sum joints.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "kjp64y8ubRwvknWSp0o7jg": {
    "date": "5/4/2015",
    "text": "Unnecessarily cold: Four stars for food but the temperature of the restaurant make it virtually unsuitable for children and most adults (we brought a three-month old and a toddler). I asked two staff members to see if they could raise the temp but one said it wasn't possible and the other said \"oh we just got the air con serviced so it's much colder now...I can't adjust it\". I'll assume he's speaking factually and CJ should assume I am too when I say we won't be back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sy82oY_OrvFAA3HxL8dyEg"
  },
  "Ez6SmCrDsMO8hwMkK6GI2g": {
    "date": "2/26/2015",
    "text": "I remember coming here with my cousin, the food was really and the service was good as well. I would recommend coming here if you visit Singapore!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HRXvsMRY7SY_6Pn9e6w6cA"
  },
  "VbwJXtIVw2fUR0q5VWypZw": {
    "date": "8/28/2012",
    "text": "Mixed-menu - this restaurant serves Cantonese and Teochew food. I would recommend the Teochew goose, cold crab, bamboo clams and their daily soup. The pig's stomach soup is also excellent - I highly recommend that - the soup is peppery, and the texture of the stomach is done to a precise consistency - not too soft or tough and very palatable.Great ambience and great food makes this a perfect place for family dinners. The service at this Paragon restaurant is also excellent, I couldn't recommend it enough. The waiters are attentive and professional.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGBwT9dOgjgZJGNjOc8ojQ"
  },
  "WP9XD8KE1Fo7pb8sMRcryQ": {
    "date": "4/30/2014",
    "text": "very good chinese food.. ridiculously expensive.. the bbq duck is excellent.. our friends enjoyed their winter melon soup.. cereal prawns are excellent.. service was also quite attentive.. the reason it doesn't score higher is the price.. maybe i'm used to prices in southern california or vancouver where you can also get world class chinese food",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW-iz5OKzzp2WOHh-CC9uQ"
  },
  "WSz41J73Ik_q_2baw-Ba4Q": {
    "date": "9/14/2012",
    "text": "Another one of my favorite Teochew restaurant, the other being East Ocean. Great service good food but n the pricier side",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iWujtkQB9ezTHGipESk_6w"
  },
  "2nzV5GdLExnJBtLvOrWbNQ": {
    "date": "2/18/2013",
    "text": "For a foreigner this was a great experience. Good authentic Chinese food. Didnt know what I was eating but all goiod.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGCMFz6iB6yOiN4LXd06pA"
  }
}