{
  "inh8eywFNeSWK6O2NbZBdQ": {
    "date": "1/16/2018",
    "text": "I've been to Marutama Ramen in Vancouver, BC, and was VERY pleasantly surprised to find one here in Singapore!!!  The ramen offered here is different than most other Japanese ramen spots - it's not salt, soyu, miso, or pork based broth.  It's a chicken based broth, a cloudy chicken based broth.  That alone might off-putting to some people, but they should really give it a try!  We ordered the regular and spicy ramen.  As I've done in Vancouver, I tasted the broth first, then added the table side accompaniments.  Those garnishes include garlic chips, togarashi, and sesame seeds.  The ramen is just as I remembered, glad to know Marutama Ramen is consistent across oceans.  The noodles were cooked perfectly, the chicken broth had the right amount of salty flavor, the cha-shu pork also added more depth to the broth.  We added an egg to our ramen order, it was a perfectly cooked soft boiled egg, and once broken added more creaminess to the broth!  Seriously, the perfect bowl on a rainy day in Singapore!!!",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 8
    },
    "photos": [],
    "user_id": "V_JBfN8Y6d6DkNsJVXVUtQ"
  },
  "B_BZZTYtX76aNuPacbQddw": {
    "date": "3/24/2018",
    "text": "Great ramen. Small space and expect a queue especially during lunch times. This restaurant has been here for years. Go for the Marutama Special, around $19 (before GST).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mwulgSG5NX-4RE2m_xbL0Q",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore. This is the Marutama Special. Wonderful and tasty!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mwulgSG5NX-4RE2m_xbL0Q/o.jpg"
      }
    ],
    "user_id": "GfqHyQMePBDTI_HY1nx04Q"
  },
  "saavyuIKhdXZEuoxwxolEg": {
    "date": "7/4/2017",
    "text": "Different from your typical ramen shop as they use chicken broth. Very generous with the noodles and ingredients, much more filling than other places. Seaweed used is also a little special (kinda kelpy). Overall, a nice light change from the usually overly salted ramen variations.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "L6LrhY1Raz--dIPouLyFcg": {
    "date": "12/8/2017",
    "text": "Tried the Zenbu Ramen. Well balanced Ramen I would say. The amount of seaweed/spring onions with semi fatty pork is perfect for one which craving for fatty meat but in the meanwhile got it covered with vege. Chicken broth is good. Recommend the spicy version for this ramen.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "03sEigH7Iwica0OER-McHg",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/03sEigH7Iwica0OER-McHg/o.jpg"
      }
    ],
    "user_id": "jwQmJ_2bh8qNWB39ZIBYww"
  },
  "xuEO9zmptS5Tqw_8dCTUXw": {
    "date": "5/21/2016",
    "text": "I had dinner at Marutama tonight after several years. I ordered the regular ramen with pork. The noodles were soft, which was to my liking, but may be considered overdone for those who like theirs al dente. The broth was also a tad too salty for my liking, though I did finish most of it. There was a generous serving of spring onions, which I thought was disproportionate to the broth and noddles. Garlic, sesame and chilli powder were provided.  This are 3-4 types of ramen available, with spicy or non-spicy chicken broth options. Aside from these, they also offer some gyozas and 1-2 rice options. There is a queue during peak hours.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0zK0tDxX6eDxfXRz4RcDIQ",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0zK0tDxX6eDxfXRz4RcDIQ/o.jpg"
      }
    ],
    "user_id": "yGEwxh5dwzD2wmpzbskwAg"
  },
  "O3gBEgv7a98o0WKrfBJ7RQ": {
    "date": "7/9/2015",
    "text": "Located in town along the popular Killiney Road, you will find this Japanese ramen diner tucked in a corner.They serve quite a nice ramen with the right springiness accompanied by a hot soulful broth.We ordered a bowl each of:Karashi Ramen (spicy) $12Chicken soup based ramen was full flavored yet portioned just nice. This must be a popular order.Zenbu Ramen (all toppings) $18This was a Full Bowl of everything including a lot of ramen. If you are hungry, this boy is it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "haWs-UgEYSLBL3lOUYEMfw",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore. Karashi Ramen. Spicy chicken soup based.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/haWs-UgEYSLBL3lOUYEMfw/o.jpg"
      },
      {
        "img_id": "_W_Ife3hE9jZLwQfTbZOJg",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore. Zenbu Ramen. Super large portions",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_W_Ife3hE9jZLwQfTbZOJg/o.jpg"
      }
    ],
    "user_id": "cCC5FT8WlLrXH4rWKhvkgA"
  },
  "rRe8XMSr288P5hJfe_DqoQ": {
    "date": "10/31/2015",
    "text": "Had the special ramen with all toppings. Amazing pork that just melts in your mouth. Egg has a slight sour taste to it.. Wife refused to eat it though.. Good quality for the money. Recommended if you need a quick ramen fix",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2N2hh1V7AVrv-vvQW6UsrQ",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2N2hh1V7AVrv-vvQW6UsrQ/o.jpg"
      }
    ],
    "user_id": "6hpDhGccbJ0jCWiBUi3mOQ"
  },
  "I0CQOlzyxcUywU9g7Fu4cg": {
    "date": "10/31/2015",
    "text": "Tried this today with a mild sore throat. The fact that they use chicken base soup helped soothe my throat. The pork dish that everyone said to try was very good. we also tried the guise and egg, both delicious. I would recommend if you're looking to try chicken based soup ramen. Yummy",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PK5NTAjdVY9mPdtwU0Ve3Q"
  },
  "XdsNPJuOhF-6Nrx_g1U9yA": {
    "date": "7/31/2013",
    "text": "The queues at Marutama stretches excessively on certain nights and after my experience, I just can't figure out why.Admittedly, Marutama is immensely generous with the toppings on the Ramen provided for the Liang Court Food Trail with 3 slices of Char Siu, 2 pieces of Pork Belly Kakuni, a Tamago (Boiled Flavoured Egg) and plenty of Negi (Spring Onions) and Seaweed. However, the star of the night, the ramen noodles and soup itself, was a disappointment and having tried favourites like Santouka and Nantsuttei, I feel that Marutama is just not up to par. The soup, being chicken-based, lacks the thick flavourful consistency that pork-based soups provide and doesn't pack a punch. The noodles were stringy and felt sadly like the noodles I get from instant ramen that can be purchased at Medi-ya Supermarket.Still, one thing I did enjoy, immensely, was the boiled Tamago, which is the best I have had at a local ramen place. With solid egg whites browned from soaking overnight in flavoured vinegar and a molten yolk inside, Marutama definitely puts alot of effort into a dish many cannot master and this was the star of the evening. Other toppings like Char Siu and Negi were average while the Kakuni reminded me too much of Chinese braised pork belly.For the full review and more pictures, visit voraciousappetite.wordpr…",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "It_Gb6BIMpY_MWoZISu02w",
        "caption": "Photo of Marutama Ramen - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/It_Gb6BIMpY_MWoZISu02w/o.jpg"
      }
    ],
    "user_id": "cL7IHL2BDgW22oQK69G1QA"
  }
}