{
  "GS0eyHAu235R6uZ11DXNFg": {
    "date": "9/27/2018",
    "text": "Keng Eng Kee Seafood was recommended by a local.  We were fortunate to have gotten a table at the air conditioned section.Food was great including The black Pepper Crab and the Egg Yolk flavored Crab.A Spinach dish with Duck Egg Yolk was delicious.My eye opener for this meal is the Cereal Shrimp.  Crunchy, Toasty, Umami cereal covering a generous sized Shrimp.  After all the Shrimp was eaten, the Cereal was delicious eaten by itself.  At the suggestion of my friend, I ate some more of the Cereal with the sauce that was used to flavor the Egg Yolk flavored Crab.  A singular great taste treat.Great local place with fair prices.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QOESrqqsV0ylMX7k9n94kA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Egg yolk flavored Crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QOESrqqsV0ylMX7k9n94kA/o.jpg"
      },
      {
        "img_id": "DiiHHShdylvLuVjK5334EQ",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Cereal Shrimp - amazing flavor and texture.  I used the sauce from the egg yolk flavored crabs to further enhance the flavor of this dish.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DiiHHShdylvLuVjK5334EQ/o.jpg"
      },
      {
        "img_id": "W8anP0tcSWAvkaNWifXjMw",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Spinach - wonderfully flavored with duck egg yolk.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W8anP0tcSWAvkaNWifXjMw/o.jpg"
      }
    ],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "IB6GRvdJux3tB6Z4lQqrUw": {
    "date": "5/22/2018",
    "text": "This is where the locals go and it is amazing! There are long lines especially on weekends but it's worth it. I tried their chili crab, a few vegetable dishes, butter cereal prawn, fried rice, and noodles.everything was very good but BUTTER CEREAL PRAWN. TO DIE FOR.Please get it if you are going to keng eng kee.  YOU WILL NOT REGRET :p",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tnYrqii0x4BZWomHuyyz6Q"
  },
  "L6s0DcQlLzI4xkStk3G34Q": {
    "date": "11/13/2018",
    "text": "This was definitely one of the highlight of recent trip - everything was good. Chili crab, blacked pepper crab, noodle, beef...list goes on. It's outdoor table type place more of hawker and doesn't break your bank. Waiter was very friendly and took great care of us. There's also a taxi stand and parking lot, very convenient to get around.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1TziiZSLJKWzzD4tfscN2Q",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Chili crab    is superb!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1TziiZSLJKWzzD4tfscN2Q/o.jpg"
      }
    ],
    "user_id": "NXw0bCLF5ZtFMfhcj7CFSw"
  },
  "D2HJf0tqcrrB-aIQ4LiVKw": {
    "date": "4/11/2018",
    "text": "Dude! First off we went here for the famous Singapore Chili Crab but the Black Pepper Crab stole the show! It was fantastic! First off, It was HUGE and the flavor was amazing. We had some other dishes as well but I can't remember what they were because of how good the crab was. A friend of mine who is a chef working in Singapore took us around to the places he thought were the best and this place did not disappoint. The owner and his son even came out with a bottle of Remy (not on the menu) and took a couple of shots with us. After the shots they left the bottle for us to enjoy at our leisure. Talk about excellent customer service! I was a little under the weather but still enjoyed myself. I' love to go back healthy with an empty stomach!Not so humbly submitted,Michael C.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "0EmCJBn_Gud5iaHVJf2L_Q"
  },
  "Q53T5vhUjMthlKR_onw2ZQ": {
    "date": "9/26/2016",
    "text": "I've heard lots of good things about Keng Eng Kee (KEK) Seafood in Bukit Merah and decided to give it a try along with a family birthday celebration. It was easy to make a phone reservation just a day before, but do call earlier if you have firmed up plans, to ensure air-con availability.  1.  Salted Egg Crab $70/kg *highly recommended*Crabs seem to command better prices that rare minerals like gold or diamonds! It was just 2 years ago when 1kg of crabs cost $50, but nevertheless, these Indian crabs are fleshy. The salted egg sauce was so good, you know it's real salted egg and not the powered artificial salted egg, due to the graininess of the sauce. Not to mention, the taste. Sadly, KEK does no serve fried mantous, only the steamed mantous at $1 per piece. In the background of this photo, you can see 2 mantous, they're pretty big but I would still prefer to dip fried mantous into the sauce. The crab tasted reasonably fresh, but I felt that the chef had fried the crab for too long, resulting in the meat being stuck to parts of the shell.2. Ming Zhu Roll *highly recommended*This mingzhu roll is definitely a worthy cause to visit KEK. With salted egg right in the middle, this is so pretty and yet delicious. This dish came straight to our table within 2 minutes of ordering. I was confused if this order belonged to another table, but the staff insisted it was for us. The batter is light and crispy. The mushrooms were juicy and added alot of flavour.3. Fried Hor Fun $5/$8 *highly recommended*Probably their number 1 seller is their fried hor fun. Served with a raw egg. This dish is one of a kind, the wok hei can be subtly picked up by you sense of smell, but the taste of the wok hei is so vivid to your tastebud! The egg helps to make the hor fun wet, and when we ordered both a $5 and a $8 portion, we felt that they gave the same amount of ingredients, with 1 egg in each dish. Maybe they gave us more noodles, but we couldn't see the difference.There's prawns, lup cheong (chinese sausage), squids and some slices of fish mixed into the delicious and fragrant fried hor fun. I definitely want to come back to KEK seafood for this!4. Fried Prawn Paste ChickenA family favourite that we usually order at every zi char, tasted rather ordinary here at KEK. The pieces were quite small and wasn't quite what we expected since the other dishes had set our expectations much higher. Skip this and also skip the hot plate tofu, it was bland and a waste of $10.5. Coffee Pork Ribs *highly recommended*The coffee pork ribs were so addictive. The meat was boneless and tender. The coffee sauce wasn't too sweet or over powering. The meat had a tad sweetness and chewiness in every bite. The coffee sauce was the bomb!Overall : A great place for a family meal. It cost us $180 including drinks for 7 adults.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "TgwAO4aTeuYuM26dYZaxfw",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TgwAO4aTeuYuM26dYZaxfw/o.jpg"
      },
      {
        "img_id": "1nw6w4k6-Y2c3B0hfpiu-w",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1nw6w4k6-Y2c3B0hfpiu-w/o.jpg"
      },
      {
        "img_id": "zC6QB-92-USg0S1eMjGiWg",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zC6QB-92-USg0S1eMjGiWg/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "hafl4KnN9jGXSNto55_TeA": {
    "date": "9/12/2017",
    "text": "The only dish that really was a hit for us was their signature noodles.  The fried eggyolk fish skin was good too.  But the real reason for us be here was the eggyolk crabs.  Unfortunately they were way to eggy and by the 2nd shot at eating you already feel overwhelmed and choked up.  Also their signature fried tofu we just simply did not get what the fuss is about and did not even finish it.  All in all ok but i would not drive 28km RT for it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nTKjwL52M6z96IUZkBHtvg",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Below ok",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nTKjwL52M6z96IUZkBHtvg/o.jpg"
      },
      {
        "img_id": "OUFYGul8dFsrgVy6T0YQaw",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Ok",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OUFYGul8dFsrgVy6T0YQaw/o.jpg"
      },
      {
        "img_id": "0aNEOAJ1ZhJH9yZJCHwWHA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Very nice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0aNEOAJ1ZhJH9yZJCHwWHA/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "zo2QbNsAglInsaBsznOIcw": {
    "date": "2/2/2016",
    "text": "We went on a night before CNY and the Coffeeshop was jammed packed with tables all within and all around the Coffeeshop. Lucky I called to reserve 2 tables for my family, else I don't think you can walk in with seats for us 17 pax. We ordered many dishes and mostly, they were good! All flavours were a little on the salty side but all enjoyable!Dishes that are great: Moonlight Horfun -",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "73lh907kj_XiP8obk0POGA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Sotong Youtiao",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/73lh907kj_XiP8obk0POGA/o.jpg"
      },
      {
        "img_id": "fPb0_fzoRuq0JAsY7R1Mdw",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Hotplate Tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fPb0_fzoRuq0JAsY7R1Mdw/o.jpg"
      },
      {
        "img_id": "4axkGx_8hg--shv9F8wUIA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Yam Ring",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4axkGx_8hg--shv9F8wUIA/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "mTFyMDX9-Jh8LN1k888sNQ": {
    "date": "11/10/2015",
    "text": "I came to KEK once several years ago without realizing how big of a following this restaurant has. In a typical coffeeshop setting, it didn't look anymore impressive than any other tze char stall. However, one of my friends had told me KEK was one of his favourite \"go to\" tze char so I made a point to revisit. This time around, with my family to celebrate a birthday.  Alas, 3 days before the actual event, we couldn't book the aircon rooms. But luckily for us, it was a cool night and it was fine sitting outdoors.We ordered  quite a bit of their popular dishes - chili crab with mantou, salted egg yolk crab, 3-egg spinach, prawn paste chicken, mixed platter of fried appetizers, coffee ribs, moonlight horfun.  Most impressive was the moon light hor fun HANDS DOWN.  $8 for a medium portion gave us a large plate enough for 6 full bowls or 7 slightly less-full bowls.  The horfun was full of wok hei, full of lardy flavouring agents like lard cubes, lap cheong and seafood (fish slices, prawns and squid rings).  Was very very satisfying and luckily we didn't have extras for I would have walloped them all (bad for waistline!).The rest of the food was good but nothing extraordinary.  The biggest let down was the famed salted egg yolk crab. The sauce was paltry, but most importantly, the crab was overcooked and the meat stuck onto the crab :(  The chili crab fared better. While not particularly impressive, the sauce was eggy and morish enough to down a couple of pillow soft flower twist mantou  (these deserves a highlight - they were so soft!). Note there is no fried mantous here.  All these dishes for merely $207 with change!  We even had leftovers to pack up.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9Pd7xQvx4MmKUjolsvkZag",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Prawn paste chicken small",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9Pd7xQvx4MmKUjolsvkZag/o.jpg"
      },
      {
        "img_id": "UfZcmjN-GyCMFA-XamsvWA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Spinach with 3 types of egg. Medium",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UfZcmjN-GyCMFA-XamsvWA/o.jpg"
      },
      {
        "img_id": "eV8iKMMuoRd5K4bwat40jA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. Moonlight horfun medium",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eV8iKMMuoRd5K4bwat40jA/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "Jg2SuGpROkP0KV0wjEfNog": {
    "date": "8/17/2015",
    "text": "I was brought to KEK as part of a large group of international sales people who gathered for a training event.  A local rep told us she takes clients here, but I would not recommend that unless they are natives and comfortable with Asian outdoor dining.  I believe other reviewers called this scenario a \"tze char\" store.  As a visitor, I let our locals order, and we had an on-going supply of family-style plates of yummies.  These were all very tasty and a good variety.  As a NC native, sitting outdoors in the humidity and heat did not bother me, it was the same as being back at home, LOL.The troubling items for KEK was that the atmosphere seemed cheap, especially in comparison to where business travelers normally end up.  One of my local counterparts was very, very dissatisfied with the restaurant, but as a first-timer I took it all in stride and chalked that up to his own tastes.  The plates and cutlery were cheap cafeteria materials or \"fake china\" plastic ware, the tables were covered with red shrink-wrap, and we sat right up alongside stacks of eggs and other supplies for the kitchen.For me, this was acceptable as an experience in a new part of the world, but I would not take co-workers to such a place unless giving them the local flavor and kitsch was part of the allure, such as a saw-dust floor at a BBQ joint or paper-covered tables at a crab or oyster house.  If it was a local eatery for my family, that might also make it more acceptable.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "826I2FTLgVYGw3bPgx-Jjw"
  },
  "faPZe8XsZQ_EOPQ88jI0UA": {
    "date": "10/22/2012",
    "text": "affectionately known as KEK.the parking can be a nightmare but with the improved ERP parking system, it seems easier to get a lot.be careful not to park in the red lots though, they look tempting but are only reserved for season parking.reservations these days is essential especially on weekends.else be prepared to eat closer to 9pm where the crowd tide ebbs.of course i will always prefer the air con comfort of their shop house unit. the toilets in there are also way cleaner.alternatively, their outdoor seating is very spacious, as they take up the entire coffee shop at night and is cooling enough with awning and fans strategically located.the ambiance is that of a zi char place and service was fast in general.especially in relation to the number of people waiting to be fed.i was a guest, so left all the ordering to the in-the-know regulars here.first up was the yuen choy(spinach like) in superior broth and the winner was the generous amounts of crispy tasty ikan bilis embellished on it.next was the deep fried tofu topped with a minced pork saucy mixture with chye po(preserved veg) and chilli.the entire slab of of tofu has a nice golden brown hue, a smooth silky white finish together with a complexity in taste from the minced mixture.another winner.their signature ming zhu rolls was next.crispy bean curd skin stuffed with salted egg, ham, prawns and lots of mushrooms served with a sweet mayo dip.the ratio of mushrooms needs to be toned down in order not to drown out the rest of the ingredients.simple quick fried nai bai in garlic is always a hit with me.the white rice they served was sadly, overly wet and mushy.good thing i'm not a fan of this carbo evil.the seafood fried rice however was much better.i guess they used the drier overnight rice for this.individual tasty morsels of wok hei coated goodness.the marmite pork was ok but i prefer marmite chicken better.then suddenly it was as if our meal ended.all the dishes headed our way, always landed on the tables to the left and right of us.it was like an intermission at an exciting play, unwelcomed and ill timed.a regular was eventually send to check and magically regular service was back.the clay pot liver was a hit with me.not too many do it well.i hate them overcooked but they taste evil if uncooked.shallots, spring onions, thinly sliced ginger and black sauce complimented the liver slivers.lastly, two types of crabs completed our feast.both crabs were very well cooked.the flesh firm and sweet.the temperature control of the wok heat was perfect.both the black pepper and the salted egg yolk sauces were just the right consistency.neither too dry nor too wet.and evenly coated through and through.there's no other way to eat crabs except getting your hands dirty and the crabs here are definitely worth your effort.additionally, the claws were nicely cracked giving you quicker access to it's plump flesh.no finger bowls but the tap and soap method is available.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kz7dkwlKpm8SNjV0n9dZVA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. salted egg yolk crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kz7dkwlKpm8SNjV0n9dZVA/o.jpg"
      },
      {
        "img_id": "tAbuPwKQPKmNPJB0GxMqPA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. black pepper crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tAbuPwKQPKmNPJB0GxMqPA/o.jpg"
      },
      {
        "img_id": "aF2jdn4UmEY2wm_Svl8DQg",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. clay pot pig's liver",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aF2jdn4UmEY2wm_Svl8DQg/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "lOTqKpjG1RRy6btwMEZj5g": {
    "date": "8/17/2012",
    "text": "Keng Eng Kee (Kek) is a tze char store tucked in the Alexandra Village which have both aircon and non aircon dining area.  The aircon dining gets snaps up first so be sure to make reservation. The food is reasonably priced and the dishes are above average. There are some hit and miss on the dishes here but one of the must try would be the chef special \"Mingzhu Roll\". It is deep-fried bean curd bag stuffed with a rich assortment of ingredients like prawns, salted egg york, ham and parsley. This dish is the store speciality and you can't find it elsewhere.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mHdT1hHytkce5IjGO56wvw",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore. House specialty: Mingzhu roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mHdT1hHytkce5IjGO56wvw/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "iSJVplQ25V2uGbFCrSlweQ": {
    "date": "1/24/2016",
    "text": "..OMG I thot all salted egg crab taste like salted egg crab, but this one is amazing . Den ofcos you have to try t HorFun, believe me it's unbelievable..Service is wonderful too They speak English",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gujB-45GpIddijccIffNOA"
  },
  "n3wctPLaDJDX9I1agRDFzQ": {
    "date": "2/20/2016",
    "text": "Remember to make reservations a few days in advance! If you like pork liver, be sure to order the claypot spring onion liver... I think it's the single best dish on offer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsIVj_AszmnnsykBrKgdHw"
  },
  "RvulbvM8aQSIo49SRoYC5Q": {
    "date": "8/18/2013",
    "text": "Ming Zhu juan/roll. Try it once, so you can say you've had it. It's got Chinese ham. How's it different? I can't say...but it's certainly an experience trying to cram ham, salted egg, mushroom, and that special Chinese ham.Other than that, it does the classic things well, I suppose. A tasty Jiu Gao soup, spinach with very generous amount of crispy ikan bilis, and hae chor and har cheong gai were all well received, and disappeared into our bellies without much comment.Interestingly, our party of 6 also had something called Yue Liang He Fen, which translates moonlight hor fun? I hear it's called that because the raw eggs they crack over the hor fun give the noodles a delightfully smooth texture and glossy sheen... but that's what I hear.Its good food, and was relatively affordable, but I'm not sure why they are SO crowded! Maybe I need to go with a veteran to see what the famous dishes are.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "t-PUpHB33mRyH0yIEMLLFw": {
    "date": "10/25/2014",
    "text": "I went here with my Singaporean friends and they did all the ordering.  And I think all were flavorful and cooked well.The Ming Zou rolls I think is their best seller, quite delicious.  We had the chili crabs, pepper crabs and salted egg crabs and the best one was the salted egg crabs.  I also recommend the fried battered squid, the roast chicken and the leafy vegetables with eggs.  Both the marmite pork and chicken were good -- don't worry, if you are not a marmite fan, the marmite flavor was not very strong.  Everyone raved about the liver dish but I am not a liver fan so I cannot comment myself.The service was good and quick.  Am just not sure if the ordering will be easy if I was not with chinese speaking folks.  I hope their menus have photos!I have been here twice for dinner but both at very odd times -- at 5pm and another at 930pm -- so the parking was quite easy.  If you come early, I suggest booking a table inside the air conditioned room so its not too hot.  If you are doing a late dinner, then its ok to sit outside.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bHfBMb8ABQpmSR1wzzZAFw"
  },
  "_E_a43YXv8SUfcOmI6p3fQ": {
    "date": "10/18/2013",
    "text": "You may try some of the dishes shown in those captured pics... to check their quality up. Enjoyyy...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LdfVWS-38vOGj0IrS_ez-w",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LdfVWS-38vOGj0IrS_ez-w/o.jpg"
      },
      {
        "img_id": "FVISMnX3qofHXix0qyIoyA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FVISMnX3qofHXix0qyIoyA/o.jpg"
      },
      {
        "img_id": "SEPUxWyzFPbOZ_f9NFIAHA",
        "caption": "Photo of Keng Eng Kee Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SEPUxWyzFPbOZ_f9NFIAHA/o.jpg"
      }
    ],
    "user_id": "7LTQVz0UM7TeM_NpXY4cWg"
  },
  "hwiHBa9Sr9Vvw8Xw-bhORg": {
    "date": "12/28/2013",
    "text": "Fourth time here and it's as good as ever. We usually have the steamed fish Hong Kong style but tonight tried marmite chicken and nonya prawns (special). Excellent all of it. Highly recommended local eatery.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eMiJ2FIMIL2Zvr6AEY-f8A"
  }
}