{
  "pHN7fM_Tudg7mz5abDoaDw": {
    "date": "7/31/2011",
    "text": "Very good kitchen, dim sum, seafood, deserts. Little hidden in a hotel (take escalators to 2nd floor). Good value and quality. In the heart of Chinatown, usually drop in for dinner after strolling through the small streets there.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lgqQtTlvaOfYXNDELfR5zw"
  },
  "_uEZWZjkC-2mw8x6MPx_LQ": {
    "date": "9/4/2018",
    "text": "Hard to find, stuck away in shop houses. The decor is reflective of the location in Chinatown. Is in a quaint old building on the 2nd floor. Not sure if that's the loom the owner was going for, if not, it does need some TLC. Servers need some customer service skills or training. Don't make you feel very welcoming. The dim sum was good, but a bit overpriced in my opinion especially for a Small plate of fried rice. The Siew Mai compared to the states, is very small and only 3 pieces. Last but not least, if u do not want to lose your appetite, visit the restroom after eating, and definitely not before. I'm a strong believer all restaurants should hv their staff clean the restrooms frequently, if not every 30 min, at least hourly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SD5B_LR7cY1-vf8fDVvWw"
  },
  "3l-CvsuPQ4ARkFP1IHf_ew": {
    "date": "3/27/2017",
    "text": "The restaurant was located at the second floor of the shophouse. Although it was weekday, it was packed with lots of tourists. Menu was a single 2 sided tick list. I was showed to a table by the window. Although there was power under the table, it was not working. So don't plan to charge your hp while eating.Pumpkin Yam Golden Cake 金瓜竽丝糕 (S$4.20++/ 3pcs)The texture was not bad with its crispy top, but it was a tab jelat if having more than a piece and quite oily towards the end. Taste was one dimension.Squid Ink Dumpling 顺鼓墨鱼饺 (S$4.80++/ 3pcs)The folds wasn't perfect. One piece wasn't even folded in.Yum Cha Prawn Dumpling 饮茶虾饺皇 (S$5.20++/ 3pcs)There's holes in the dumplings. I was surprised to find this kind of standard in their signature dumplings.Home-made Almond Tea 杏仁茶 (S$4.20++)The texture wasn't rich and creamy. It looked kind of like the instant type - sweet and lumpy. Service was spotty. I was told to go to the cashier when I asked for the bill. I could spot customers with their bills served to them at their tables. Also spotted that the next table of Japanese customers had a piece of plastic in his glass of beer. The staff who cleared the glass blamed on the plastic covering the ice cubes, but did not apologize. One could see clearly that the group of customers was clearly upset. Although the customer was later told by another staff that the glass of beer would be waived from the bill, the damage had already been done.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iTvF_-CIkkhpyOt9om9d0A",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iTvF_-CIkkhpyOt9om9d0A/o.jpg"
      },
      {
        "img_id": "5JKrjchU4Qq_hfM7St0MsA",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5JKrjchU4Qq_hfM7St0MsA/o.jpg"
      },
      {
        "img_id": "QllkTMR9CQKI8wY-VcSN0A",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QllkTMR9CQKI8wY-VcSN0A/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "qnwuM-HlSqvX5rZ4wotbjw": {
    "date": "2/22/2018",
    "text": "Surprisingly a Hong King style dim sum place.  We came here cause Tak Po is closed.  This place is served with trolley. They come to you very frequent and staffs are friendly.  The restaurant is on the second floor , you will see the signage from far but kinda tricky to find the entrance. If you don't like peanuts, may ask them to remove it immediately served together with cutleries.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJ2XCLY3OBegp8qtlDNw9w"
  },
  "WYLQ_C67CPGso2yGDn-kzw": {
    "date": "4/15/2016",
    "text": "Located in the heart of Chinatown is Yum Cha, a well known chinese restaurant for thei dim sum and other heart-warming chinese delicacies. Yum Cha also sells seafood dishes like signature salted egg prawns and even chilli crabs. They've been at this location for the past 16 years, and they also provide delivery services.For the upcoming Mother's Day in May, Yum Cha has created a new concept that will be avaialble from 1st-14th May at Yum Cha Chinatown and Yum Cha Changi outlets. Their goal is to re-create the long-lost taste of traditional Chinese dishes that mother and grandmothers would remember with nostalgia of their hometowns.1. Braised Pork with Preserved Vegetable Bun $2/BunA nostalgic classic dish, this delicious bun, which was eaten for days while our ancestors were fleeing the war in China before settling down in different parts of Asia. The quality tender pork belly is braised in Yum Cha's secret recipe sauce for hours to create a sweet and succulent taste that is balanced by a soft and fluffy steamed bun.This is quite a different kind of bun as it is pillowy and has a slight fragance to it. The meat was indeed juicy, tasty and I can imagine getting about 3 of these in a go. Definitely don't miss this!2. Fish Maw with Shrimp PasteThis was an interesting dish that I had never tried before. The shrimp paste itself was a huge generous serving and it was extremely tasty going with the sauce on the dish. The fish maw was soft and jelly like, adding a light texture to the meaty shrimp paste.3. Pan Fried Salted Fish Bun $5 for 3 piecesYet another traditional chinese dish originating from the Guangdong provnice, this salted fish bun used to be a favourite of the Emperor Kang Xi  of the Qing Dynasty. The bottom bun is seared to a golden brown, with a flavourful filling made from salted fish paste and minced meat. To enhance its flavour, Yum Cha has added a secret seasoning for a more savoury experience. This was one of my favourites of the night. The bun was soft and pillow but yet had a slight crisp on the edges. The salted fish wasn't too salty and was perfect for my taste buds. 4. Pumpkin, Yam, and Golden Cake $4.80 for 3 pieces *highly recommended*A very pretty dish was served with this flower. The exterior of the golden cake was definitely beyong my expectations. It was extremely crispy, biscuit-like and biting into it, you will taste the moist yam and the sweet pumpkin in the center. A pretty ingenious sweet dish in my opinion. Definitely don't miss this. It's not that sweet, it was more of a savoury dish.5. Signature Salted Egg PrawnsI was waiting all night to try this. This was a huge serving of fresh and crunchy prawns. In the center, was a salad that had the salted egg sauce. This was a very different presentation than what we normally see, whereby the prawns are deshellled and cooked in salted egg sauce. 6. Black Pepper Lotus Beef (Large, $48)I loved the presentation of this dish, delicate and beautifully plated. The lotus were thinly sliced and were crisp like a potato chip. The vegetables added some colour to the black pepper beef. The Black pepper beef wasn't spicy at all, which is great for non-spicy eaters such as myself. The beef itself was extremely tender, soft and juicy.  The beef itself is imported from Brazil!7. Crab Meat Xiao Long BaoMy personal favourite dim sum is xiao long bao and Yum Cha's rendition of this delicacy is pimped up with crab meat. Picking it up with chopsticks usually requires some skill so as to not burst the delicate xiao long bao skin. But I could pick it up with ease and even hold it up for a period of photo taking. The skin itself isn't paper thin, but when biting into the xiao long bao, you can enjoy the soft texture of the skin and behind it, you find a very savoury soup and chunk of meat embedded in the xiao long bao. 8. 7 Flavour TofuThis was a very interesting tofu. Everyone at the table tasted different flavours. The tofu itself was soft, almost like a steamed egg. With a light crisp tofu skin with sweet, salty and even spicy flavours from the seasoning on top of the tofu.9. Fried Vermicelli SeafoodThe vermicelli had tons of wok-hei which made this a favourite at the table. Yum Cha was extremely generous with the ingredients that it only took us moments to devour this entire plate of goodness. The noodles were stir fried in prawns, scallops, vegetables and fish slices.10. Almond Tart $3.20/3 pieces *highly recommended*Yum Cha's classic almond tart has a soft and flaky texture. In the center, you will find a smooth almond custard that is not too sweet and just right for it's size. It can served chilled and its sweet taste will be a hit with children!I'm a pastry buff and I know it when I eat excellent pastry. The pastry shell has the perfect level of crisp to it and every bite was perfect. My only regret was that I did not get any of these Almond Tarts to-go to share with my family. The almond fillings absolutely melt in your",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "tp030ttM_nfiE__O_wCR7g",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tp030ttM_nfiE__O_wCR7g/o.jpg"
      },
      {
        "img_id": "ul2uyiQBjQ5B1VHYSaiOyw",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ul2uyiQBjQ5B1VHYSaiOyw/o.jpg"
      },
      {
        "img_id": "A67z8WpiCcI8kZnOuALpBA",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A67z8WpiCcI8kZnOuALpBA/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "TY7F7ErbfG38sEu8-Vt8ug": {
    "date": "8/31/2017",
    "text": "This is a surprisingly large hole-in-the-wall type dim sum restaurant with excellent food.  The restaurant's somewhat hidden on the second floor of a hostel, with entrances through the hostel's lobby and through a souvenir shop.  You can order from the good-sized menu, but the staff also wheels around numerous freshly made dishes for you to choose from.  Everything my group of folk tried from the wide variety of dishes was all very good.  (Admittedly, there were things that weren't to my taste, but what I didn't like, one or more of my friends thoroughly enjoyed.)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oBhQMjrT0zdSLdlybWRA_w"
  },
  "ox-d6CmcTPaq1Dgt5Q_LaA": {
    "date": "4/10/2016",
    "text": "Went here on a recommendation from a local.  Second floor of an older building in Singapore's Chinatown. Looked through the menu and noted two dishes (Black Squid Ink Dumpling, Pomelo Sago Dessert) that we did not recognize and have not had in our 50+ years of Dim Summing.  Really 45+ years since the wife and I did not start at birth.  LOL.  So we definitely ordered in addition to staples of Siu Mai, Har Guo, Pai Guet - Spare Ribs, and Mango Sago. All ranged from $4-5SD.The dishes were all tasty and had three items for each dumpling.  Tea filled constantly - approximately $2SD per person.  Small peanuts shared at $1SD per person - standard minimum charge.  In total, six dishes cost us $40SD.  A little pricey for Dim Sum....",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aq1mWb2K3b-Rpko5HG5TSw"
  },
  "TvwlbTwboD_MdTRQo2W1Pg": {
    "date": "12/30/2015",
    "text": "This restaurant is a popular spot for locals looking for dim sum. Regular lunch hours are a bit quiet, offering a menu selection of meals, and good choice for a relaxing lunch. Come 2:45pm, lots people start coming for the 3pm to 6pm all-you-can-eat Yum Cha. This is a great deal, with a great selection of dim sum being wheeled past your table in trolleys. There's also a dim sum menu for making special requests, but the trolleys are quite comprehensive and come by very regularly. But don't order more than you can eat - you may get charged for unfinished plates, although small leftovers seems fine.The food is great, atmosphere energetic and noisy (just like yum cha should be!). Come close to 3pm to be sure of getting a good spot!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZGbBSIq2vpBdflPY4knorg",
        "caption": "Photo of Yum Cha - Singapore, Singapore. All-you-can-eat Yum Cha",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZGbBSIq2vpBdflPY4knorg/o.jpg"
      },
      {
        "img_id": "rzutpl2RIf8bYVqoDn1L8g",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rzutpl2RIf8bYVqoDn1L8g/o.jpg"
      },
      {
        "img_id": "IfPD7UXDQu4_6TxPGazEmA",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IfPD7UXDQu4_6TxPGazEmA/o.jpg"
      }
    ],
    "user_id": "GEod9IQh2mWZv6D2Z-ryLQ"
  },
  "df07B2xFDHEVMWgbqnI6WA": {
    "date": "1/14/2016",
    "text": "(1) Salmon Yu Sheng [$38+ sml / $68+ big]- Just like any other \"Lou Hei\", Yum Cha's version was not much difference from the rest with common ingredients such fresh salmon fish slices, crunchy jellyfish, shredded carrot, radish, ginger, yam, pomelo etc. Highlight of this dish was Yum Cha homemade sour plum sauce used for tossing. Made with their secret recipe, this homemade sauce gave a sourish sweet aftertaste. Paired together with their fish sauce, both made the whole plate of Yu sheng very tasty and appetizing. If you're a very 年年有\"鱼\" person, you could add on more fish portions at only $12. HUAT ah!!Rating 5/5(2) Fried Crispy Chicken[$40+ whole]- Chicken was fried till golden brown color with slight crisp on the skin. I'm rather surprised that the meat texture was dry and tough even on the thigh part so I guessed the deep frying method dried out the meat. Marinades wasn't strong and flesh tastes rather bland, the only flavorful part was at the skin where the crispy garlic bits were scattered on top. You may want to dip the chicken in Yum cha's homemade sweet chillies sour plum sauce to bring more flavour to the meat. Rating 3/5(3) BBQ Suckling Pig[$220+ whole / $118+ half]- Crackling skin of this suckling pig made me gave up on my diet plans and went for more portions. Meat was flavourful with fats evenly distributed throughout the whole pig. It wasn't oily at all. Dip with a little of the smokey sweet sauce provided and it was heavenly! Although \"peng cai\" was more commonly seen on the tables during CNY than a \"suckling pig\" but for a change, I suggest you order this suckling pig instead. Skin so crispy its definitely worth all the calories. Rating 5/5(4) Braised Pig's Trotter with \"Fatt Choy\" [$38+ half leg]- Pork trotter was slow-braised till really soft and tender. Meat falls off from bone easily without me using any strength. Chinese spices was not strong and I suggest flavour can be heavier. Fatt choy (black moss) used did not help in the taste, only being a traditional auspicious ingredient as people always said \"fatt choy\" sounds like \"发财\" in mandarin. Dried oysters would be a better option to improve the overall taste of this dish.  My most love and also the best parts of this trotter were the jelly skin and tendons. They were so Q, packed with collagen and \"melt-in-the-mouth\"!Rating 4/5(5) Fried Rice with Chinese Sausages in Lotus leaf [$38+ whole]- I'm quite disappointed with the inconsistency of this dish. Other than texture being dry, parts of the rice were undercooked. The other main, important ingredient \"chinese sausages\" were not much visible too because they were cut into micro cubes instead of slices which I felt the size was unnecessary. I totally could not taste their existence thus lack the aroma of preserved meat. Dried shrimps used were also very tiny although chef was generous to throw in a lot. Rating 1/5. Skip this.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8_XQQmyem8P-LOz9MrDJ1A",
        "caption": "Photo of Yum Cha - Singapore, Singapore. CNY 2016 takeaway menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8_XQQmyem8P-LOz9MrDJ1A/o.jpg"
      },
      {
        "img_id": "Xa8f6E4ZAa03Lgno6k-gEA",
        "caption": "Photo of Yum Cha - Singapore, Singapore. Braised pig trotters with Fatt choy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xa8f6E4ZAa03Lgno6k-gEA/o.jpg"
      },
      {
        "img_id": "Qc0_woYomfl7tAJfXC5jGg",
        "caption": "Photo of Yum Cha - Singapore, Singapore. BBQ suckling pig",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qc0_woYomfl7tAJfXC5jGg/o.jpg"
      }
    ],
    "user_id": "cgMqDLZPOdUDqufAP8jyfg"
  },
  "K2Bb0vC_NKaw0td-gFWWqQ": {
    "date": "8/11/2015",
    "text": "Most Hongkongers are pretty sticky with the quality of dim sum here. So I took my cousins to this place at Chinatown as the quality versus price is a nice match. Cha Siu Pau (BBQ Pork bun) tastes good. The skin is soft to chew and the meat is just nice.  Siu Mai looks awesome too. Come to this place at 11am and there are plenty seats available. Once it goes to lunch time, the place will be crowded.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PeXwGgNrgs9gdMjExyQUgQ",
        "caption": "Photo of Yum Cha - Singapore, Singapore. Hong Kong dim sum with reasonable price.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PeXwGgNrgs9gdMjExyQUgQ/o.jpg"
      }
    ],
    "user_id": "sR1KPM19ZYaH8kJYFdmIaA"
  },
  "48ojmwJMQRwS6KPIahk94w": {
    "date": "7/5/2017",
    "text": "Not a fan of this establishment. Food tasted bland which couldn't compensate for its dirtiness and poor service. I can't believe there was a long queue for this place. I'll never come back here and nether should you. Go elsewhere for dim sum.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "IswMvPGAfJLei0U69lGGmw": {
    "date": "7/26/2015",
    "text": "One of my favourite place to have morning Dim Sum with my family, this place is one of the few places that still serves Dim Sum in the old traditional way in push carts. The food is good although a little inconsistent. You have a wide range of chances which is good for a place like this and the price is affordable. Atmosphere of the place is to me way too chaotic, people pushing carts around, try to find the waiter and just kids sometime moving about. This is definitely a place I will quickly have my meal and just leave. Service is average, people were helpful but they did not go beyond anything that they were doing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YgIQamlfZBHoeCjANSUdxQ"
  },
  "c-oYXzqGgJjBYt0TLkdA-g": {
    "date": "7/12/2014",
    "text": "Why did I fall into this tourist trap? The place is a zoo during lunch. Lots of families with kids, noisy, expensive. I had some bok choy, steamed coconut buns, turnip cake and egg custard tarts. That cost me $22 which is ridiculous even for US standards. The food is not even that good. Save your money and have  a $6.00 lunch downstairs at Smith Street.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tro6T-2U53eQ_1Vrg4_xVA",
        "caption": "Photo of Yum Cha - Singapore, Singapore. Finally some veggies. $6! What the hell?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tro6T-2U53eQ_1Vrg4_xVA/o.jpg"
      },
      {
        "img_id": "Hig8AsPfOcu-pIr7VAuKvA",
        "caption": "Photo of Yum Cha - Singapore, Singapore. Steamed \"carrot\" cake.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hig8AsPfOcu-pIr7VAuKvA/o.jpg"
      },
      {
        "img_id": "mYjMxyZQyw8ExDJuXe3OIQ",
        "caption": "Photo of Yum Cha - Singapore, Singapore. Atmosphere not great. Noisy chaos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mYjMxyZQyw8ExDJuXe3OIQ/o.jpg"
      }
    ],
    "user_id": "fZaWWxwwHGtH-8Vhx7qE_Q"
  },
  "EKQ9LZOo1ZF-uSdESY8L5w": {
    "date": "3/28/2015",
    "text": "If you are looking for Dim Sum after walking Smith St this is the spot.  Spacious and authentic decor explains why even the locals like it here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7DZPhkkdprF-OO6r1UxYmQ",
        "caption": "Photo of Yum Cha - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7DZPhkkdprF-OO6r1UxYmQ/o.jpg"
      },
      {
        "img_id": "6lpf171gBDkzOMa-WHulMA",
        "caption": "Photo of Yum Cha - Singapore, Singapore. View from corner table",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6lpf171gBDkzOMa-WHulMA/o.jpg"
      }
    ],
    "user_id": "qmUMRN8zwfkzuE9ZoKnWLQ"
  },
  "YBPC-6EOY92lmFbXOIrpfg": {
    "date": "1/7/2014",
    "text": "Went for lunch and ordered five dimsum dishes.Food was mediocre, BBQ pork pastry was too thick with little pork. Crispy silver fish was cold when served, and tasted bland. Staff were ok but service was slow.Probably not gonna be back as there's nothing special here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OAGVTpnPcAsfexUwp-dRUA",
        "caption": "Photo of Yum Cha - Singapore, Singapore. Fried silver fish that tasted bland",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OAGVTpnPcAsfexUwp-dRUA/o.jpg"
      }
    ],
    "user_id": "ZiQkNWZW6K2-kGvJjtMMbg"
  },
  "l4ZU9fE1QGP7ApPESzY9ng": {
    "date": "1/22/2015",
    "text": "Recommended to eat here for lunch by local business man.  Went just after lunch crowd had gone and it was more peaceful and relaxing.  Surroundings look like an updated traditional restaurant so you feel your in an authentic place and it's very spacious.  Staff could do with some customer care courses but on the whole ok!! We ordered 5 dishes of Dim sum and found them to be hot and fresh and were delivered to us as they were cooked which is usual in Asia, they don't usually serve all together or do courses. Would definaltely go here again and of you have visitors great way to see Chinatown and stop for a traditional lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-tWW9oBptytIOjfnszI-g"
  },
  "KySbc0xCGbU_l3KcYFoorg": {
    "date": "10/3/2012",
    "text": "My fav place for dim sum!  I am not sure how we found this place right n the heart of Chinatown, with almost no sign pointing to it.  But i am glad we did.the food is consistently good, the service goes through ups and downs depending on what time it is and where you sit in the restaurant...  the atmosphere is just right!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "5aplWl8xF-5k2QAAp6-IZA": {
    "date": "5/26/2016",
    "text": "In the heart of China town.  Delicious dim sum lunch.  Variety and filling.  All dishes were amazing!! Loved the shrimp and mango spring rolls!! One suggestion to the servers: When putting glasses on table to fill with a drink, PLEASE do not touch the inside of the glass!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p1E9Wa7ZTEbgoidsDixBVQ"
  },
  "qECyou1s0q2_h5uLXuA9ew": {
    "date": "1/9/2013",
    "text": "This place serve dimsum. I went to this place for a late brunch around 11.30am and were second in the line. I didnt bother going early because I know there be long queue for it. This place seems to be more of a tourisy place as there are many western patronizing this outlet. However, the food remain nice and the service up to standard.  This is one of the several places where dim sum is not ordered from the waiters but they are being pushed around in the carts and you order from the cart.One down point is that it is pretty expensive with each item, which usually come in 3 pieces, cost around $3-4. Therefore, I suggesting visiting this place in multiple of three to more cost effective.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "slFEwzkIpwxH4Kcn0DkuNw"
  },
  "aRQ9uzlGrF1Np6mE8mlqNg": {
    "date": "1/7/2015",
    "text": "You get a very comfortable dining experience with the no-frills dim sum spread against a very cozy ambiance, notably the marble tables and classic wooden seats i.e. typical Singaporean. I like their har gows and siew mais, which is consistently good. Their porridge is also worth mentioning, cooked to the right texture. As for dessert, make sure you try their banana pancake.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  },
  "fZwSTQyFol0OBOU57YDCmg": {
    "date": "12/17/2013",
    "text": "Great dim sum place, very good food. Go early to get a table, it will be packed during meal times. Was there visiting with family and friends and place was crowded during brunch time. Service was a little slow, perhaps due to the crowd and it was hard to get our dim sum replenished quickly enough. It is also nicely located in the heart of Chinatown which make post-brunch shopping convenient. Would return again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgkrEe2kLou6-RjSN3sMqg"
  }
}