{
  "kFeYV6pg1F1cS8dgW-3dwQ": {
    "date": "5/31/2018",
    "text": "I recently traveled to Singapore for the first time. From what I had heard leading up to my trip was that it was a very clean country with excellent food. Both rang true from my experience. I found the Naked Fin on yelp by looking up restaurants around me. I love to pair my food with a good glass of wine and the images provided on their yelp page won me over immediately. Most of the restaurants here don't offer a drink list and are small pop-up shops that are outdoors and the humidity has been a bit of a change from my SoCal weather. Haha so that's why The Naked Fin stood out to me. Further more there was a video. It was a quick little blurb about the owner and how The Naked Fin got started.  It gave all the more reassurance this would be the experience I was hoping for. Once I arrived it was what I expected and more. The food cooking in the back smelt great they staff was so greeting and really helped me pick what would be best for me as I didn't understand most of the menu and terminology. The big reason I wanted to go as well was this Baby Indian Squid App that I saw in the video and on their yelp page. I have enclosed a photo. OMG! It was even better than I imagined. It tasted like crispy sesame seed oil. They cooked them just right and I was so happy I got them. The prawn soup was great as well. It pair great with the white wine (I would compare to a Pino Grigio) they went excellent together and I was very happy with the service food and over all experience here. If you're in Singapore The Naked Fin is a MUST TRY!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nz8Tc1EQrcZnaaTgvDL_Qw",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Prawn Soup Dish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Nz8Tc1EQrcZnaaTgvDL_Qw/o.jpg"
      },
      {
        "img_id": "tBq_vkMd2z3zTjwUaib7sw",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Indian Baby Squid Appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tBq_vkMd2z3zTjwUaib7sw/o.jpg"
      }
    ],
    "user_id": "VH01cOTLLZygwKK9_KzdoA"
  },
  "xPg05SvZFnnAj3ah9Sv_6g": {
    "date": "10/31/2017",
    "text": "Naked Finn has a bar called Nekkid nearby.Keep seeing my hairdresser posting all the yummy food from here. Finally had it last Saturday night. Good food.Nice ambience.5 of us shared one Set (a) and one Set (b). Was enough food.Liked the kang kong, loved crispy squid, the bee hoon and the scallop carpaccio.Barramundi Fish was good.Prawn with the sauce was good but not great although the waiter seemed to think they were great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-rdZ9j5zwM0EPIskemkyXA",
        "caption": "Photo of The Naked Finn - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-rdZ9j5zwM0EPIskemkyXA/o.jpg"
      },
      {
        "img_id": "s8z0AD-FiGS8CdgSyi7C8g",
        "caption": "Photo of The Naked Finn - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s8z0AD-FiGS8CdgSyi7C8g/o.jpg"
      },
      {
        "img_id": "cVfKQA01ScHc_qZOssWLLQ",
        "caption": "Photo of The Naked Finn - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cVfKQA01ScHc_qZOssWLLQ/o.jpg"
      }
    ],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "7bnQkotWBWcr3Lvk5jzX3g": {
    "date": "4/8/2017",
    "text": "Outstanding lunch place away from town. We had the prawn noodles, lobster roll and baby squid. Everything was impressively sourced, particularly the squid and prawns. Service was excellent as well. Will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "b2948CR9S6tZtpXw5iYdDA": {
    "date": "11/5/2015",
    "text": "I really want to like this place more, but I couldn't.Yes, I do appreciate the effort taken to source the freshest ingredients, the lengths gone to prepare a tasty broth, etc.I also understand the high costs of operating, and the fact that quality seafood costs a lot in Singapore.The food is indeed delicious. But it lacks a wow factor needed to make up for the high price.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0x6MWNiFLQ2cV3aIVjO5g"
  },
  "gJWniKXb-n_--IxeFOeyVw": {
    "date": "6/22/2016",
    "text": "The Naked Finn is run by Ken Loon whom I met through a friend.  Since I was in Singapore he invited me to his restaurant and I spent an evening chatting with him and enjoying his food.As is always a good idea, I let the host choose the menu, so Ken got us an assortment including squid, fish, scallop, pork, risotto etc.  All of which was very good, though if I am going to pick favorites, the squid was really special.  Grilled to perfection and just the right consistency.  This is something I am going to miss when going back to Norway.Okay, I'm going to pick one more favorite:  the pork.  Incredibly tender and juicy shoulder of iberico pork (if I am not mistaken).   I ate most of it without any form of sauce or condiments.  It was just so good by itself.I also got a tour of the fish tanks and the kitchen.   The place has a very modern feel while at the same time feeling human-centric.  Ken has his books and his desk out in the restaurant.  Including his big stack of papers on bivalves :-).The fish we had (I don't remember the name of the species.  I don' think it is something I've had before), Ken had caught himself.  He has a very hands-on approach with the raw materials which reminds me a bit about Fäviken.I like down-to-earth restaurant experiences that is about good food and good conversation.  And this is as good as it gets.I had an excellent evening!(To my Norwegian friends:  the name of the restaurant has nothing to do with naked people from Finland.  I suggest you visit the restaurant and ask for yourself what the name means)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w3Md0jvpgG2ZiMRoAYRPCQ"
  },
  "WrPFg1fa30roK-SBFCrjLA": {
    "date": "7/7/2013",
    "text": "Love the space. If anyone remember Klee (now defunct cocktail bar that was too early for its time) at Portsdown Road, this place reminds me of it, except that it is way more than just a cocktail bar.We hiked down to Gillman Village, firstly to get a drink, plus to try out the prawn vermicelli that received a glowing review in the Straits Times. The prawn vermicelli is served as a supper menu item, from 10pm on weekdays and 10.30pm on weekends. The prawn broth is made by frying amaebi shrimps and Sakura ebi, then simmered in pork stock for 7 hours. When served, the server will reiterate that there is absolutely no sugar or seasoning added. Your bowl of yumminess is served with 4 choices of grilled shrimps (banana, giant tiger, gamba espanola, gamba carabinero) on the side. You are also given a condiment tray: sea salt, Japanese spice, chilli powder, plus get this......pork lard made from iberico jamon.All those of course comes with a price. We went with the gamba espanola, which has a large head that comes with the most amazing roe. Slurp it all up from the head and you are in gamba haven. The flesh of this shrimp is not firm like our usual shrimps, but the taste of the roe more than made up for it. One of this shrimp comes in at $15 on their ala carte menu...Other dishes we had:- diver-caught Atlantic scallops cerviche - while it was awesome, it is also much too expensive at $20 for two bite size portion. I understand that this will cost much more at a sushi restaurant, but still...- grilled baby Indian squids - so good. Done in all natural goodness without batter so you really taste the succulent juiciness and with a slight smokey crispness at the edge. I can eat this forever.- pan-fried fish. Can't remember which fish we had but it came with an awesomely crispy skin.Started off with some very fruity cocktails. All the cocktails are deliciously fruity yet strong. The kyoho grape one is full of the beautiful notes of this amazing fruit, pulp included so that you are sure this is the real deal. Strangely, the drinks are served kind of ice-blended, so you do get a brain freeze if you drink it immediately.Menu is strictly seafood. If you are allergic to seafood, or looking for meats, avoid this place. The pricing is on the high side but they pride themselves on quality seafood.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Zf01Gj8-GaNY6qbMHIocGA",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Deep fried soon hock",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zf01Gj8-GaNY6qbMHIocGA/o.jpg"
      },
      {
        "img_id": "GKoKORjUODJKSnIfTSJV0g",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Coconut dessert w gula melaka",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GKoKORjUODJKSnIfTSJV0g/o.jpg"
      },
      {
        "img_id": "Q3TFFFf9OkWf_dJ8i693NA",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Tiger prawns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q3TFFFf9OkWf_dJ8i693NA/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "n7DuNm3kuHVz29iy45Sxjg": {
    "date": "1/6/2013",
    "text": "They serve the BEST cocktails you can ever find in Singapore!I love the fact that they live up to their name of being \"naked\", for the fact that the ingredients used in the choice of seafood are simply salt, pepper and olive oil to bring out the freshness in their seafood!The cocktails, served at -12°C, taste FRESH!Made my first visit there from friend's recommendation and tried all of their 3 signature cocktails, Strawberry, Coconut and Kyoho grapes.The ingredients are freshly pacotized (according to their website), and it seriously brought me to heaven!Ordered a portion of baby squids for sharing (as it was rather late that night, that we headed there for some really chill night out) - SO FRESH!I have never imagined that COCONUT can make such an awesome ingredient for a cocktail. lovely surprise!p.s. waiter was SO NICE, and asked us \"is everything ok?\" after serving. top notch!I love that place, the environment (can get really quiet as they have limited tables), the drinks, the food!Gonna frequent this place whenever I have some cocktail cravings!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wZYTnSzZ3S8nmZNUM2HRtA",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. from left: white peach, rockmelon, lychee, strawberry X 2. Best of all worlds",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wZYTnSzZ3S8nmZNUM2HRtA/o.jpg"
      },
      {
        "img_id": "3xseB78QFqsbz-OflMfiQQ",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. escargots + garlic butter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3xseB78QFqsbz-OflMfiQQ/o.jpg"
      },
      {
        "img_id": "Q4yLHPtv6Rn5JQNvjGI7tA",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Rockmelon + Orange + Nigorizake + Hendrick's gin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q4yLHPtv6Rn5JQNvjGI7tA/o.jpg"
      }
    ],
    "user_id": "O2itSY4F2jnPRXaxdVGOkQ"
  },
  "LUJ13JL4NUbLM0wnBB28xA": {
    "date": "2/5/2015",
    "text": "What a hidden gem inside Gilman Barrack! After some gallery hopping a group of us came for dinner. We were very pleasantly surprised by the quality and taste of food. The restaurant only have less than 8 tables so I'd recommend making a ressy ahead of time.We started with some razor clam ceviche and baby squid, both very fresh and delicately seasoned. For entrée we had their iberico pork and grilled fish, both cooked to near perfection. Will definitely be back for more!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VmGZJs1EgiRqWXGbhMB1GA"
  },
  "ywQQZ2PGWeSQFeLYqMjzFg": {
    "date": "2/28/2015",
    "text": "5 stars cos it's so hard to fault this little gem. From the service experience while booking the place to the actual dinning experience, it's one of the best I've experienced in this part of the world. The space itself is great. Small and cosy but doesn't feel cramped at all. Unpretentious with IKEA kitchenware and yet tasteful at the same time. Music's at the perfect volume and playlist is legit. Food is just delightful. Fresh and thoughtfully put together. Me and the missus had the set dinner for 2 and every dish that came with it was really tasty. The cocktails are amazing as well. Simple yet punchy. Most of all, the people there are lovely. They all looked like they really love what they do, and was informative and engaged throughout the night. Go, if you want a charming, non-pretentious and overall great dining experience.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jYDe__JWjqsz4OaZE94Msw"
  },
  "IgFYalkvg5WAm6s1fjT81g": {
    "date": "2/8/2013",
    "text": "I rate the Naked Finn and I will be coming back. I'll state that upfront.I went yesterday night again..drinks with friends from work with bites...Dinner for them, half dinner for me. My rating is 4 stars overall because there are a few misses. Overall still a solid choice and the service was helpful and pleasant.Here's the rundown:Cocktails1) coconut - Yes! I finally got to try it. This was our top pick o the night. They blended the flesh in as well which gave the slushy sorbet a creamier texture. Very coconuty..but you know how some coconuts taste old. This tasted like the sweetest freshest thai coconut had been used. Friends all loved it after tasting mine.2) white peach bellini - friend had this. It was refreshing.3) melon with the hendrick's gin - this was more subtle. melon taste was there but it was definitely less sweet and had a bit of bitterness. I wasn't sure if it was from the rind of the melon but my friend thought it was the gin.4) orange guava cocktail - I had this before so I didn't try. My friend said nice but a bit too sweet. She said her first drink the bellini was better.5) mojito - we all thought this had hardly enough sugar or none in it. My friend asked for sugar syrup to add up. Because of the addition of the orion beer, this was quite a light tasting cocktail. I wouldn't order it again.6) kalamansi - I wanted something sour and this was indeed sour. In fact my friends all made faces when they tried and said it was too much. While I did enjoy it..towards the end I found it too much and I actually left some in the glass. Only if you REALLY like sour. On hindsight I wish I had ordered 2 coconuts hahaFood:1) baby squids - YUMS! Simply grilled, juicy..lots of flavour.2) clams in white wine - needed more white wine. My friends said it was very \"healthy\" and I should have more as I was under the weather.3) cold bee hoon - lightly seasoned, not greasy with a tang of lemon. really nice complement to the food..or just eat it on its own..or drizzle it with the above said clam broth to elevate the clam broth (haha rather than the other way round)4) northern prawns - predominant impression was salty. Gavin did explain they overcook these a bit so the shells can be eaten. I saw another lady eating the big prawns and those looked really juicy which was more the kind of prawns I was expecting.5) razor clams - $12 a piece but surprisingly meaty. fresh and yummy. although they drizzled with shallot oil, it didn't taste oily.Staff were rather busy but responsive. It's a tiny place so it's hard to do a big group unless you book early.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qzr1dRXnrTrkhHpEXLSK_A",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Creme brulee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qzr1dRXnrTrkhHpEXLSK_A/o.jpg"
      },
      {
        "img_id": "tCLgfLHY8T57A80aTNfofw",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Pear & Morcon iberico",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tCLgfLHY8T57A80aTNfofw/o.jpg"
      },
      {
        "img_id": "CoXaX5fjjhICaNMLJ-LG6Q",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Thai milk tea - off menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CoXaX5fjjhICaNMLJ-LG6Q/o.jpg"
      }
    ],
    "user_id": "a7y3gCq9Vwv89NRtUTtyJw"
  },
  "5jnOKQtIeGN34DALnKXNhw": {
    "date": "9/23/2015",
    "text": "Nice \"for a change\" sort of place to have lunch. You know the food's good when the lunch crowd is decent despite the out of the way location. We got the prawn mee, which was nice. Not quite as \"strong\" as the soup from the more traditional prawn mee places (e.g. the one at Pepys Road), but things came together well. Would have been nicer if the stock came out piping hot. Desserts are ok.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XsIVj_AszmnnsykBrKgdHw"
  },
  "_9ieFUw01eszeZcCnwsdnA": {
    "date": "12/28/2014",
    "text": "We went to this restaurant because of its reputation for simple good food. We decided to go for lunch. The restaurant is a shack located in isolation next to a running track.  Would have had a hard time locating it if not for my trusty GPS. The restaurant is small, so reservations are a must. You need to call them in the afternoon otherwise no one answers the phone. The lunch menu is simple and uncomplicated. We had the lobster roll with creme freche and a fish and chips. The roll was excellent with generous portions of lobster cooked well. Likewise the fish and chips though I think it was a tad overdone. The fish they use is the ling fish. Line caught and very good. Price wise is a little high, but with 3 portions of lobster what do you expect. The meal for 6 persons including 4 chendol deserts was $255",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GV5wRHvWXsf8AxbKxrYuKw",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Lobster roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GV5wRHvWXsf8AxbKxrYuKw/o.jpg"
      },
      {
        "img_id": "EgQKm0VKRgrrvD-Wg1Vrqg",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. Would have missed this place at night. Cool place and unexpected. More like a shack really. Quaint.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EgQKm0VKRgrrvD-Wg1Vrqg/o.jpg"
      }
    ],
    "user_id": "91UQ_DLi_qsDXQfg6kBePw"
  },
  "BtsB5nwF8DoAD8czR7oRJA": {
    "date": "1/13/2014",
    "text": "LIKE.The perfect ending to any Gillman Barracks visit (or rather hike) is a dinner at the Naked Finn. Service is great, dishes are great, the place is great. There isn't much I could complain about... Well, maybe the music was a tad 1980s ballad-ish, but I can forgive that considering how rarely I find a gem amidst Singapore's great, big culinary landscape.We ordered the chilled bee hoon which was fantastic. It's large so order it to share. The squid, the prawns, the fish - all the seafoods were grilled, seared and fried to perfection. The wine list wasn't over-whelming but instead offered good, simple, unpretentious choices. Add to the evening some pretty fantastic cocktails (our favourite du soir was the coconut one) and it's about as good a meal as one can find.Oh and the cherry on top: the prices were very reasonable.Have you sensed that I really like this place yet?",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "WsxRSUIxhD4xOKQxgVWHXQ"
  },
  "GmvFOu1h_3tVX50Czn1HCQ": {
    "date": "8/19/2014",
    "text": "expensive seafood at this uppity too-cool-for-school restaurant at the gilman barracks. this place - well. the food is good (let's get it out of the way), but it's simply cooked, it's simply expensive, and service is pretty inadequate for the price you're paying.I simply don't understand the hype - seafood is abundant in singapore, and a more-than-decent dish is more than easily found (even at your neighborhood czechar store) - it's the sort of seafood restaurant I'd imagine in a land-locked part of the US, where seafood is both posh and inaccessible.but I'll give it to them that the seafood is fresh and delicious in its simplicity, but I'd hazard a guess, too, that anyone with half-decent cooking skills can churn out similar dishes.the most economical option here would be to take their set menu (which is still pretty price-hefty) for a taster of their dishes. it starts with a simply dressed salad, and fried vermicelli noodles (simpler-ly known as fried beehoon in this part of the world) are brought to the table as accompaniment to the subsequent dishes.and it's good right, but a lot of it is due in part to the fresh produce they've got (which is admirable) as opposed to any particular skill (which is the point of visiting restaurants). not that not-overcooking seafood is not a skill (omg, triple negatives!) - but it's a pretty basic one.fat, plump clams in an easily-drinkable, more-ish soup that went well with the beehoon, and plainly seared scallops served in-shell with garlic. plump and sweet, those were delicious.these were followed by grilled mozambique - read: skinny - lobsters that had a good charred flavor, the same of which you could smell and taste in the seared fish and baby squid. that baby squid was pretty delicious - they were chewy but tender, with none of that crisp nothingness that happens with deep-frying.so the food was good - even if I might complain about price - but service is pretty hit-miss. the good thing was that we had chirpy waiters dishing up our food - but we had to be chased out after barely two hours of a long many-coursed dinner (such is the quirk of trendy, busy restaurants), and they refused to bring me a glass of water when I first walked in (IT'S SELF-SERVICE, PLEASE) even though there was no one else in the restaurant and the waiters were milling about.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qDwx8EU-JS5Yz2PGfOzAhw",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. the cool-looking interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qDwx8EU-JS5Yz2PGfOzAhw/o.jpg"
      },
      {
        "img_id": "hgXKXH5Ndh05vKP1accX_Q",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. fresh, slightly-chewy (in a good way) baby squid",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hgXKXH5Ndh05vKP1accX_Q/o.jpg"
      },
      {
        "img_id": "qNW1-3-0FE58KCR-ZAAABQ",
        "caption": "Photo of The Naked Finn - Singapore, Singapore. tender scallops with garlic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qNW1-3-0FE58KCR-ZAAABQ/o.jpg"
      }
    ],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "lZzm6AoYIfMfKBAx4UVhHA": {
    "date": "2/20/2016",
    "text": "Since dining almost 2 years ago, The Naked Finn has moved to new premises, barely 100 meters away from their old haunt, which is, incidentally, now its sister bar. Its greenhouse aesthetic is maintained, so you get an expansive view of the lush surrounds of Gillman Barracks. It's a terrific escape from the hustle and bustle of city living. Be sure to make reservations though, it was a busy full house on a Friday afternoon when we popped by for lunch.Very little is done to the seafood, which is fresh and sweet. If you thought that read bland food, you'd be mightily mistaken. The food here is hearty and soulful, and robust with flavour. It's just that when the ingredient's that fresh and sweet, very little needs to be done to it.We had:1) Grilled Indian Baby Squid ($8) - seasoned simply with a flick of sea salt and slick of olive oil: must try. Soft, sweet and succulent2) Beef Burger ($23): At first blush, it looked disappointingly minuscule. But (some, not all) good things come in small packages, and this turned out an indulgent, finger-licking-good powerhouse. The decadent grass-fed dry-aged Japanese wagyu patty, dripping with juices, came together with the Boston lettuce, American cheese, and special sauce brilliantly. Just be sure to get double (or triple) orders of this if you're hungry.3) Pan-fried Barramundi Fillet ($20): paper-crisp skin and moist flaky meat. This was seasoned with olive oil and finished with sea salt, accompanied by a mound of blanched kangkong tossed in kalamansi juice, dried shrimp, and shallot oil, and vermicelli oiled in sesame and fried garlic bits, both served refreshingly chilled4) Hae Mee Tng ($25): a medley of farmed giant tiger prawns, Salmon Creek Farms pork belly, in a blended soup of 9 prawn species and simmered pork bones. This was rich and sweet but not cloying, as The Naked Finn resists the addition of MSG or sugar. Get the vermicelli for a traditional option, or the Japanese somen for a twist on the classic. 5) Homemade Naked Chendol ($13) with coconut sorbet: deconstructed version of a local classic, but refreshingly lovely6) Homemade Gula Melaka Sorbet with Sea Salt ($10): a twist on the flavour du jour, salted caramel. An absolute must-try.7) Homemade Sour Plum Sorbet ($10) with osmanthus jelly: recommended if you prefer a tangy refreshing end to your meal",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tieQ1FQ3BdXO7PjShPE28g"
  },
  "0MsZ0mhsj35tYhpOfvvt3Q": {
    "date": "7/5/2014",
    "text": "Wasn't sure what to expect, but this place is great -- really fresh, simply prepared, high quality seafood. Reminded me of trendy places in Boston or San Francisco. Ambience was cool -- quiet, cool music, intimate, slightly hipster. Service was so, so good. We had:- Scallop ceviche style - this was awesome, my favorite of the night. Lemony and garlicky but also light. - Scallop seared - good but the garlic was a bit overpowering on this one- Pumpkin cream soup - really nice and filling, paired well with the garlic flavors of my mains. - Baby squids - overly generous portion, sort of fried but without much seasoning- Barramundi - really flavorful and fresh, with good portion size; could have had this as the main dish only- Noodles - good complement but not necessaryOh my gosh, and the cocktails are amazing. Worth a trip there for the cocktails alone.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lq_Mwj5zhxgCbs43vz9tyg"
  },
  "MlIJ-B-ZR2hmta1uda4QpQ": {
    "date": "2/27/2013",
    "text": "The 2 person seafood set at $120 sounds pricey but given the high standard of preparation its not unreasonable:Eat as much as you like beehoon, cooked to perfectionGrilled razor clams, giant sized:)Littleneck clams - some of the sweetest I've hadGrilled shrimp - sweeter than most prawns one getsPan-friedn barramundiGrilled lobster but really it what Aussies like to call a yabbie Blanched kang kong - great way of serving something so familiarA good choice of wine if a short wine list, but should be something for everyone. Red wine was chilled :( minus one star.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "EGYsPKoNGf8kqAO-Ma-8TQ"
  },
  "bIQ8n7Eg3GBGU12xzP40Xg": {
    "date": "3/31/2013",
    "text": "Look, the big tip for this place is to listen to what they are pimping that evening and order that. There are no two ways when it comes to seafood. You can't do anything if the produce is below par, and with their minimal cooking methods they can't risk it either. We (over)ordered an extra fish that the restaurant  was not recommending and it took the edge off an otherwise good meal.Other than that, YES, do visit, keep the ordering sane, have a cocktail or a nice craft beer and enjoy the evening and the peaceful surroundings. I'm coming back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ok0fpB6QHkSUpTQpO3UAfA"
  },
  "81XlvKDStcl6j_AlNLwzDg": {
    "date": "2/19/2013",
    "text": "It is a hide away from the hectic city. A delightful cocktail bar with simple honest dishes. I enjoy the flavorful concoctions along with their seasonal changes. The boys do a great job at introducing you with the menu. They are also brilliantly smart at pairings and precise with measurements, so if you have the time and right company, sit by the bar for a nice show. Their bee hoon is a must. I only say this because I have a weakness for spicy food and they spoil me with four different types of chilies. Life can't get better. Yes it is out of the way, but that is the pleasure of being there. Keep up the great work guys.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "sMdP8B7-ca2rnqXlTN0nmA"
  }
}