{
  "FVAwa50UIWq2UU2T6o7mtg": {
    "date": "12/23/2015",
    "text": "We had a craving for sushi and this place filled it. PROS: Sushi/Sashimi: tuna, salmon, eel, yellowtail.            Teriyaki steak            Butter clams            Karage Chicken            CONS: Iced lemon tea was in a can.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "veScwWsyg27ONjg1NuH-Cw",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. Butter clams",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/veScwWsyg27ONjg1NuH-Cw/o.jpg"
      }
    ],
    "user_id": "3Kn4WUjRW4mktpYa0El3IQ"
  },
  "EAEhbbNTUuT9lEm5upJ_9Q": {
    "date": "7/7/2016",
    "text": "A perennial favorite chain of mine for consistency and decent tasting Japanese food. I usually go for the grilled salmon head but since there's a seasonal special for a medai nitsuke, which loosely translates into red snapper braised in a sweet soy mirin sauce, described to be with gelatinous skin and bits, I was sold. Truth to be told, I was disappointed by the size of the head. Seemed much smaller than pictured. Taste wise, it was spot on. I enjoyed it despite the meat was a little tough and overcooked as the fish tasted fresh.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I4-9QpyEypUPmJICULDWsw",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. Seasonal promotion menu : medai nitsuke.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I4-9QpyEypUPmJICULDWsw/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "wCJ3R8pzaa9INkSxEaL8EQ": {
    "date": "1/19/2013",
    "text": "The food Nothing out of the ordinary or too fancy. A Good, fast & efficient japanese franchise at affordable prices. What we had... 1. Salmon Yoridori - Ok 2. Niku Ramen - Great! 3. Hotate Toji Soba - Ok 4. Sashimi Salad - Great! Get the sushi tei dressing to go with it. It came with an assortment of slides of raw fish salmon, tuna etc... 5. Ton Curry Udon with pork cutlet - Ok. The udon was nice but I thought the pork was a little too dry. 6. Chicken Katsu don - Great! Although, they chicken cutlet could be a little less fatty. Overall, great for gatherings with friends :) this one is a little fancier in terms of deco, compared to most of its other franchises. Pricing wise, seems the same. Might even be good for a date - fancy ambiance (dimly lit too) at an affordable price :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wUJWpGkmWTozO2StEpbskw",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wUJWpGkmWTozO2StEpbskw/o.jpg"
      },
      {
        "img_id": "oNjdwuyZNWM_GH4ldE4MmA",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oNjdwuyZNWM_GH4ldE4MmA/o.jpg"
      },
      {
        "img_id": "LgwLrtHKCbDZVAf2aH8_ew",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LgwLrtHKCbDZVAf2aH8_ew/o.jpg"
      }
    ],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "OuDQE1_X0YB0NsZnKjBmsA": {
    "date": "8/3/2012",
    "text": "Maybe this outlet just doesnt like me very much. The times I've been here, I'v been slightly disappointed with the service and food quality.Most recently, I ordered the sukiyaki but the contents of the pot were a little disappointing. It seemed like they simply chopped and dumped a load of vegetables inside and I struggled to find any noodles/golden mushrooms in the mix. I was there about 3 in the afternoon and they waitresses didnt seem best pleased that they had to serve customers at that time. Hmmm.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JoPF8LkIgniSnAqQ791BxQ",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JoPF8LkIgniSnAqQ791BxQ/o.jpg"
      }
    ],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "DexcVohWte2q66J-9Cd8AQ": {
    "date": "7/19/2012",
    "text": "I like Sushi Tei for their fresh sushi and salads. For this outlet, what's really cool is when you enter through their extended walkway, you could have a table where it's like a cubicle - it's all the way inside and you have to walk through the bar, the tables, the booths, to finally get to the section where it's just private cubicles. Eating there is personal, comfy and intimate.What I Love: Their service. They are swift and prompt. Their Wakame Salad is yummy. Cha Soba serving is huge. Tip: If you're having the Cha Soba, do no order anything else. Their Green Tea is freshly brewed. Agedashi Tofu is totally yumminess. All their meat options are really yummy, so try everything! I also love that they have the Unagi and Teriyaki sweet sauce on every table. Usually, I have to request for that. For dessert, try their Ice Ball.What I Don't Love: Nothing! :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CIVWbMuJhNUeIGcW53QhWA",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. My fave!! Dragon Roll - with prawns and mango! ;)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CIVWbMuJhNUeIGcW53QhWA/o.jpg"
      },
      {
        "img_id": "arIfB0Uv4HpiwOj4QAAWJg",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/arIfB0Uv4HpiwOj4QAAWJg/o.jpg"
      }
    ],
    "user_id": "0jmAZwCwQN9ByyWsLx7khA"
  },
  "qwfeu7ZOzt7yQs1BDxTa7w": {
    "date": "7/16/2012",
    "text": "Sushi Tei serves well.. sushi.. and other Japanese food. If you were to ask me to point out anything special about it, I would say the sushi is definitely a nicer and brighter shade than Sakae Sushi. To be fair though, I am quite partial to Sushi Tei's cha soba (green tea) and their gindara. This time though, I decided to try this curious (ok maybe to the Japanese it's like a typical meal) looking dish with raw tuna, a half boiled egg and lots of spring onions. Pardon me if you are Japanese and the way I handled this dish is completely wrong, but to me I took it as a sign that this dish is meant to be mixed Pepper Lunch style. I mixed it all up and sprinkled glorious Japanese chilli flakes all over and begun the meal. Like all mixed up dishes.. it was delicious. I loved how the tuna meat, spring onions and egg gelled the rice together. Though my way of eating this dish may be wrong, it still is a dish worth a try! If you don't want to risk looking like a total fool (since the method of eating this dish may be wrong), stick to the Cha Soba.. you can't go wrong with dunking green tea noodle in a cup of its ice-cold broth.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ioh1_kTSsTsJD9wnEDRsng",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. Consists of raw tuna, half boiled egg and lots of spring onions.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ioh1_kTSsTsJD9wnEDRsng/o.jpg"
      }
    ],
    "user_id": "_6zTmwRscQUpbyo8etB0nQ"
  },
  "jMAS4th0IduhoxGxYgWO9w": {
    "date": "9/28/2012",
    "text": "This Sushi Tei outlet has space for more 'private' dining as compared to the other outlets, making the ambience here a bit more romantic and classy. However, as the 'private' area is slightly segregated from the main space, waiters may not hop over as often.No difference between the quality of food here and the other outlets.Recommend the Salmon Sashimi with Sushi Tei dressing which is a good appetizer / starter or can even function as a full meal if you're not a big eater. If you like shellfish, go for the hotate miso mayo that's basically mussels baked in a cheesy-mayo sauce. Other things to try here are the dragon roll, curry cutlet rice, beef sukiyaki, cawanmushi, and special unagi roll that comes with thick slabs of grilled eel.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WShM_YFbtG4OcE0vrFVyw"
  },
  "R7rwmSirF4XaILqmrqk8pg": {
    "date": "8/29/2012",
    "text": "I was seriously impressed on my first visit to this Japanese restaurant by the overall décor and classy ambience. You are led to the seating area via a raised wooden platform with dimmed lighting and bamboo archways, making us feel like super VIPs! There is also more privacy offered to patrons with little booths that are sectioned off as well, which is always a good thing. The food itself is above average, with a wide range of delicious sushi platters with great combinations like lobster meat with avocado, or sashimi with mango slices. It may sound out of the ordinary, but tastes fresh and yummy. My favourite dish is their salads, mainly because I love their Wafu sauces that they drizzle atop the vegetables. It isn't too salty but still gives flavor to the otherwise bland raw veggies, but most importantly, isn't full of calories like Western sauces such as Thousand Island or Balsamic Vinegar. It is quite pricey though, so I can't really visit it as often as I would like.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05tSDymzhXyvaxO1G24d0g"
  }
}