{
  "tqRCDWgkftsZPKN24aB9ZA": {
    "date": "11/21/2015",
    "text": "It's so difficult to find the American diner experience in Asia, but Clinton Street Baking Company captures the taste which brings quite a bit of nostalgia living in the US.  For anyone missing diner food, this is a must try!  My only complaint is that they need more waiters as 2-3 people is grossly insufficient to manage a restaurant if that size.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "FIr_daDct4cWLUrnaqViRg"
  },
  "uVFTdGt7vnkdHbt9qGAYVw": {
    "date": "6/28/2017",
    "text": "We went here for breakfast and we're not really impressed. They got one of our orders wrong, completely forgot another and had zero apologies for it all. Food is really mediocre for the price. All the egg dishes were well prepared but everything else on the plate was unappetizing. The biscuits were dry, the ham was leathery, the bread was stale. Would not recommend at all.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2m3v-amnJAVRuEWYQOls6A"
  },
  "b0-StLodnpCjXxmPGUIBJw": {
    "date": "7/3/2016",
    "text": "Breakfast was mediocre. Nothing crazy or wow about. Overpriced as well. Would I recommend? Sure, if there's nothing else on the block to eat. Otherwise, it's not worth a visit.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spcWkD16-UyUCdeyePYQCA"
  },
  "rVc0XhTYAryDFLcoFxSsFg": {
    "date": "2/19/2016",
    "text": "Having been to their original location in LES multiple times, I was very impressed with the pancakes at their new establishment in Singapore. (Let's be honest here, most of the restaurants that have opened up branches in Singapore are disappointments compared to their original location overseas. E.g., Lady M, Din Tai Fung, Tim Ho Wan, Lawrys, etc.) We came for lunch on a weekday, around 11:40, so there was no wait. My pancakes were fluffy and moist, and my friend's country breakfast also looked delicious. My only complaint is with the service, which was rather slow. We had to flag down the server a couple times to order our food, even though the restaurant was only half full. Will def be back again soon!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zSVNx2kNkGlV46AkH3jOvw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Blueberry pancakes are legit.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zSVNx2kNkGlV46AkH3jOvw/o.jpg"
      }
    ],
    "user_id": "m-G5VEMTu3CD0sQm7u7twA"
  },
  "91mkrsO8jdWxh32ZUMYcug": {
    "date": "11/29/2016",
    "text": "I had heard about this place from a few people.  I tasked myself for bringing a pumpkin pie for a Thanksgiving get together, i wanted a back up.  I called the week before and they mentioned that the seasonal pies (pumpkin and pecan were $55)  Nope.  I ended up baking one, but still wanted another desert so I decided to pop by on Sunday because I wanted breakfast and needed a back up dessert.  I ordered the breakfast sandwich that came with spinach, bacon, egg and cheese on a biscuit.  Now, this place is supposedly by the same company as the one in NY, so my expectations were high.  I'm from the South, so you better bring your A game when it comes to biscuits.  I ordered and my food came out before my latte.  It looked awful and for $18, I was not happy.  The cheese looked like it was under a heat lamp for the last hour, the hashbrowns were burnt, and the one side of the biscuit had what looked like a tomato sauce on it.  WTF?  The bacon was so sad and undercooked I just couldn't touch it.  I ate a tiny piece of the biscuit, and drank my latte.  The waitress was nice enough to ask me what was wrong in which I told her it looked like my meal came from when Bush was President, and asked if I wanted a replacement.  The pancakes looked really good but by this time I needed to get outta there.  I did order a Strawberry Rubarb pie to take with, and they took off my breakfast off my bill.  They also game me a large take away biscuit for good measure which by itself was really tasty.  Everyone at Thanksgiving liked the pie, I didn't taste it.  I doubt I'd come back here there are just too many good options for brunch in Singapore to strike out again.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5mOW6BKTYPVa1OPyLStVFg"
  },
  "XjHH1Rva4o_obcsb6psBmA": {
    "date": "9/16/2017",
    "text": "That moment when you're in an entirely different country and you see they have your favorite NYC breakfast spot is in Singapore!!!! BUT  it's no where near as good and your charged double the price. Very disappointing. :(",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-y2zuBtWasj1l45NIJqqLg"
  },
  "zVP5SJVbUyFQfvJerxGfjA": {
    "date": "3/5/2016",
    "text": "Loved the thick, fluffy pancakes and maple butter! Do share the food if you're a small eater. Waitresses were so polite. Loved their service. We waited for a few minutes to be served as it was quite packed on a Sunday morning. Poached eggs were a tad disappointing as they didn't drain the water. So the eggs were sitting in a pool of water. If you're the type who doesn't like sweet-tasting mocha, then this is the place. But it was a tad watery to my liking. Overall, enjoyed the place. Wouldn't mind heading there again to try the other food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOudaj2kjt2woGhMlX1omQ"
  },
  "3dVbbStDGcqepAQwaiTOVw": {
    "date": "5/15/2016",
    "text": "A pretty basic place. Came here because I was craving Pancakes & they were pretty good. I enjoyed the blueberries  and the sauce with the pancakes which I felt were a good combination. I wished they gave more blueberries because towards the end it started to get pretty dry. The sauce also started to get too sweet once the blueberries finished. But the pancakes were fluffy and tasty. The chicken and waffles were a disappointment. I admit the waffles were done differently and could be subjectively just not up to my taste. But the chicken was poor. Tasteless, kinda soggy and dry. The sweet sauce didn't really go well with this and overall I'm really not a fan of this dish. Ordered the grits as well which was horrible. Could tell they didn't know how to cook cheese & grits and it is not like what it's meant to be like. Very dry and undercooked. Flavourless.. bah horrible. The sausage patty was just. Minced meat smashed & fried? Not what you'd expect. Disappointing because on the menu it said Sausage & Maple.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dcKky5OVgR71kmSe1FNasw"
  },
  "xxDSU5wLPBxsgGq3grtJDg": {
    "date": "1/21/2017",
    "text": "Being a fan of the pancakes and southern breakfast of the original Clinton St baking company in NYC, we excitedly arranged to meet at this place for brunch to reminisce our old NYC days. Recommendation- just stick to the fried chicken and pancakes. They were tasty and definitely of similar standards to the dishes we had in NYC.. however, what really disappointed us was their 'cheesy grits'. It looked and tasted like oatmeal porridge; and when we tried to tell them that was not definitely not grit, they checked and confirmed it was 'grit' made from 'barley' and they followed the original recipe. Com'on.. if it's not grit, don't insist it is and bullshit us like we are some ignorant customers. I would have accepted a yes sorry it's not easy to find grits and this is what we have used to replace it.. google grit and it is 'Grits is a food made from corn that is ground into a coarse meal and then boiled.' Suggestion to the chef - even polenta has a more similar taste and texture to real grits than whatever you are serving now. Next is the corn bread which has a ginseng taste to it. It happens that my friend liked ginseng and hence liked it.. otherwise I would not recommend you order that either. Spinach was cooked like Chinese style and a bit bland. All in all nice environment but not sure I'll be back for the food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MsJIp8TBrVyWNGxq07vNdQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. FYI- the real grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MsJIp8TBrVyWNGxq07vNdQ/o.jpg"
      }
    ],
    "user_id": "RTU3uJ6AEXzWw8LEuOjsLw"
  },
  "JlYnZTAfzCJbNG-rq-nw7g": {
    "date": "10/13/2015",
    "text": "Highly recommend for a great brunch. Best breakfast biscuit sandwich I've ever had. Pancakes are typical I felt.I lived in NYC for 5 years and remember my times at Clinton Street Baking Company out there very fondly. I loved everything there, even their pancakes had a very impactful memory that I became jaded to any other pancake. Coming here however, I feel that the pancakes are nowhere near the quality in NYC and even taste pretty typical to any other cafe which is the the only reason for the minus 1 star given how hyped they are.The biscuit breakfast sandwich is the best I've ever had in my life. I was totally wow'd by this here in Singapore and if my review was based on only this, I would have easily given this a resounding 5+ star.Orange juice is fresh as is their coffee. I would recommend that you call ahead and get a reservation. If you show up during the breakfast or lunch (or weekend brunch) hours, you will for sure need to wait the usual 2-3 hours that they mention.Highly recommend but don't come in just for the pancakes!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "H6QCgCPwKxlkVAH1b0HN7g": {
    "date": "10/15/2015",
    "text": "Get your carbs on!Brunch lovers and carb lovers - this is YOUR spot!  Yes, the wait can be a little crazy, but if you're patient, you will be rewarded with some fab, soul-hugging, muffin-top making food (just spend an extra 10 minutes on the elliptical!)  The trick is to go early (before 10 am) and the wait is manageable.  They are only open until 6 pm now but that may change soon.The foodWe couldn't help but indulge in a few pastries.  The bacon, spinach, cheddar muffin was savory, a little sweet, and indulgent.  Even my baby loved it (well for obvious reasons). The cheddar scone was crumbly and had a wonderful buttery top.  But the real star is the crab cake eggs benedict.  It was the best eggs benedict I've ever eaten!  Each component from the just cooked spinach to the creamy hollandaise sauce to the rich crab cake was just plain delicious.  I also had the chorizo with eggs and it was savory and satisfying.  We were very happy with the food so far and this is one of my new, favorite brunch spots!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "bWYTvHxF8MO4k_Anqf5nPQ"
  },
  "kCfMyy5wx4CvteUPxFCFig": {
    "date": "12/21/2015",
    "text": "I can't think of a better place to have pies, waffles or pancakes in Singapore. The diner style atmosphere is casual and relaxed. A great place to bring kids and family to during weekends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o54dW8BVbjfcNjB1QFkDww",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o54dW8BVbjfcNjB1QFkDww/o.jpg"
      },
      {
        "img_id": "zpv7j7-mhnwbbrHTqYRsWw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zpv7j7-mhnwbbrHTqYRsWw/o.jpg"
      }
    ],
    "user_id": "8O6tdyNF4g8haPXrrRDxWg"
  },
  "TzwmkBjGOAZMpDpPMxyroQ": {
    "date": "2/26/2016",
    "text": "I missed checking this place out in New York so I was really happy to find that it's now in Singapore! There wasn't an savory + sweet combo for pancakes so I ordered a wild blueberry pancake and added bacon. The pancakes were sooooo fluffy and when paired with the sour-ish berries and sweet syrup, it was great! The bacon was too hard for my liking. Be ready to spend a bit, the pancake with a side of bacon, coffee and juice came up to $42",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EfaEm-a_4TxPphrwaTONhA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EfaEm-a_4TxPphrwaTONhA/o.jpg"
      }
    ],
    "user_id": "bnRK36hhGnntK_xsnOu35Q"
  },
  "5Jks42TQQRyKuY4hXjZwuw": {
    "date": "12/14/2015",
    "text": "Definitely order the chicken and waffles. Staff recommended to order onion rings as sides. Do not order onion rings. Completely disappointing. We came on a Monday afternoon, not too busy just some tables of ladies of leisure... but be aware your last order is at 5pm.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5coU_wyarFOXgwN6XH3Pow",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5coU_wyarFOXgwN6XH3Pow/o.jpg"
      },
      {
        "img_id": "E8KCFX1oNW4FZhImkD-ltg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Chix n waffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E8KCFX1oNW4FZhImkD-ltg/o.jpg"
      }
    ],
    "user_id": "JlQAJ3QHXiFlOgZ4feUZSA"
  },
  "3ifLMKmzDv6AjBTS0aSLfg": {
    "date": "10/27/2016",
    "text": "If you want an excellent American style breakfast, this is THE spot. Cool, clean, brightly lit bakery serves a broad breakfast menu all day. Lunch menu served from 11:30am until 9pm. A good selection of bakery treats are available all day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "st8uGs0I_XLdTN7O71_Itw"
  },
  "SZmdAUwZV4RAfdenkEmFow": {
    "date": "6/28/2016",
    "text": "I had spinach egg for breakfast. It tasted absolutely bland, tasteless. The portion of the orange juice is way too little. Not worth the price .. It's not the breakfast to die as compared in states. Lastly, customer service was bad. Coffee is good tho.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lo3rJcphswgACLKijc-q_A"
  },
  "Amj9BMQK_7MzzAcosUxX7g": {
    "date": "10/2/2015",
    "text": "Amazing place. Worth the wait. Coffee is great & don't get us started with the pancakes. Renowned for its crisp, definitely worth a try.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3f7VRK4BbyYFgsRHiot6Ig",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Pancakes!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3f7VRK4BbyYFgsRHiot6Ig/o.jpg"
      }
    ],
    "user_id": "lRYpajiys7z1z3zJnNFIbg"
  },
  "jLaogb5Q4BoQ_synW_N8_w": {
    "date": "11/13/2015",
    "text": "The Good, The Bad, and The Bourbon Salted Caramel MilkshakeI preface this by saying I absolutely love Clinton Street Baking Co. in New York. The Singapore shop matches the New York venue in some respects (main courses and drinks) and fails in other areas (pies and service).I'll start with the good. For a shop known for its baked goods and pancakes, the drinks were fantastic.  The bourbon salted caramel milkshake was the best thing we had and the bloody mary, which is so rarely made well, was also delicious. The main courses we tried (pancakes and huevos rancheros) were every bit as good as the NY shop.Unfortunately, there were several areas where Clinton Street really struggled. First, the service was horrible. After we were seated, not one staff member came to our table without being asked. We had to ask for drinks, for menus, to order, to get a dessert menu, to get a check, and to have our check taken and processed. When there were quality issues with food (see below), we did not get an apology and the waiter seemed annoyed to have to deal with the issue.Second, when we arrived for brunch, two of the three pies of the day were unavailable. No explanation was give nor was any apology forthcoming. We tried the only special available (strawberry rhubarb pie) and the lime meringue pie. Both were disappointing. The crumble on the strawberry rhubarb pie was like a group of small, indestructible rocks. We could not break up the 10cm pieces with a fork -- and we tried! We were not provided a knife with dessert.  The lime meringue pie tasted good but there was so little lime custard except at the very edge of the pie that it tasted almost exclusively of meringue.When I pointed these out to our server he simply asked if we would like something different. I pointed out that there was very little else available as two of the pies of the day were not available and he stood in silence. He did not seem to have any idea how the pies should be made or the quality that is normally associated with Clinton Street.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UVsZ4EqRh4bb5fCgMJJEWg"
  },
  "xyzFfSSY-sBvZozi0QbJnQ": {
    "date": "3/22/2016",
    "text": "Great food, but while eating my breakfast they have decided it's a great time to fix the door hinge to the entrance which consists of some ass hat pounding and tapping on it during my entire meal.  Clueless and ruined my experience.  Would have been awesome other than that.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TH2g0QICVw1ypaaHlWxXVQ"
  },
  "9QgTNU9rSvckv1etmfYqMQ": {
    "date": "5/17/2016",
    "text": "Went for the chicken and waffles - they were amazing! The batter on the chicken was light and NOT greasy! We loved the flavoring of the chicken batter, and it was moist chicken breast! We tried the fried chicken. Four pieces of chicken which were moist and yummy. Great flavoring in the batter. The jalapeño cornbread was quite large and yummy. We got a blueberry shake. Unfortunately, it was not worth the price, but everything else was yummy! This was my second time, and this time the service was awful. (Luckily the food is so yummy!) I had taken friends, and they were very disappointed in the service. It was early in the evening (a bit after 5pm) and not very busy. So, I have no idea why the service (refills, order taken, food coming out at different times) was slow. Still would go back because the food was yummy!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcXqhdOtSbKVefxvO1II8Q"
  },
  "PxUd7fwawiGZygBNegjy1A": {
    "date": "3/31/2016",
    "text": "I had a delicious salmon latkes plate with caviar and aioli. It was really rich. I also ordered toast that was slightly disappointing but the latkes more than made up for it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JkJtB_aheQ2EZrkkrF3cKA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JkJtB_aheQ2EZrkkrF3cKA/o.jpg"
      }
    ],
    "user_id": "MqnJ_g2egOyO54m-pyeFyQ"
  },
  "UiKdhcmJMEKjho8kJh1MgQ": {
    "date": "6/16/2017",
    "text": "This is my 2nd visit, I love the pancake and also the chicken and waffle. The maple butterscotch syrup is a bomb! Supper yummy but can be too sweet for some people, so advice don't pour it a one go. Portion can be huge if you don't have a big appetite  Can be crowed during weekend and dinner time, so advice to make your reservation in advance if you planing dinner or weekend brunch here.Tips : You can make reservation via Chope app.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Q2GYf4LGZiJ-r3kvKvGWg"
  },
  "MB_ENfSDvJCduke4ZyewPw": {
    "date": "7/4/2017",
    "text": "We had the farmers plate and the butter milk biscuit sandwich. On both dishes the scrambled eggs were done perfectly. The buttermilk biscuit sandwich was tasty--the biscuit crunchy on the outside and buttery inside. Bacon was tasty. The farmers plate was a healthy amount of food. Pork patties were flavorful and had just a slight kick. Sourdough bread was a little skimpy. Coffee was good, especially if you are tired of the local. The restaurant is pleasant, sunny with great staff. Prices are on the high side-- we spent nearly $50 for breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7YG8kwyK-XBFfiVs3a11gQ"
  },
  "K9s8f59GvtmwNosoj_PsJw": {
    "date": "8/7/2016",
    "text": "Tried the much-lauded fried chicken today - the chicken and waffles and chicken plate. Didn't like the way the chicken was prepared for the waffles (boneless fillets with a thin batter) as it was rather dry. Chicken plate was VERY generous with literally half a chicken on the plate, along with a decent chunk of corn bread and small token coleslaw. The batter on the chicken plate was better, buttermilk, and had a good crunch. Unfortunately, it was either bad / old oil or the oil was too hot, but ultimately had a burnt and slightly acrid flavour. The flavour and seasoning wasn't great either so I found it rather plain overall. I'd go back for a shake or some of the desserts, and maybe give the pancakes another shot. All the other tables' food looked well prepared and equally generous, so value for money is decent (by Singapore standards for these sort of establishments). Service was clinical and efficient without being particularly friendly.  Venue itself was quite cramped with tables extremely close to each other. I went to the original store in NYC, and was not that impressed by it either. Thankfully the ludicrous hype has died down and we got a table with no issues on a Sunday at 1pm.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U1-KptZyBZe3kwm6jO7P0g",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U1-KptZyBZe3kwm6jO7P0g/o.jpg"
      },
      {
        "img_id": "8F3Xb4Z8bPhkxEltmgPfPg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8F3Xb4Z8bPhkxEltmgPfPg/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "NV7szahSOeEE-rkGoQLwUg": {
    "date": "4/8/2017",
    "text": "This morning we had breakfast here. Overall quality of foods was good but not exceptionally good but the serving was generous. Service quite good too. We asked the leftovers to be put in the box and they did it nicely. A bit pricey too.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pVBvVE9yrMCtsU8FhuvfxA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. A bit pricey for breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pVBvVE9yrMCtsU8FhuvfxA/o.jpg"
      },
      {
        "img_id": "bWSjJkw1EJyLOkMUj6mKog",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Banana French Toast. Quite good despite the big size of the toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bWSjJkw1EJyLOkMUj6mKog/o.jpg"
      },
      {
        "img_id": "K2IKssAl6cblkHMOJXk0tw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Salmon with rosti. The rosti was over cooked but the smoked salmon was delicious.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K2IKssAl6cblkHMOJXk0tw/o.jpg"
      }
    ],
    "user_id": "qPMX0LylFc65ZXkivCRPsQ"
  },
  "n8OS4zc6WB7E7QCCEUYP3A": {
    "date": "7/7/2016",
    "text": "Didn't have to queue on a weekday afternoon.Blueberry pancakes - 4 starsGood, fluffy, standard fare. Nothing spectacular IMO. I would've preferred plain maple syrup to the maple butter and would've liked more blueberries on top but there was a decent number of blueberries in the pancakes themselves.Spanish scramble - 4 starsAn omelette with chorizo and caramelized onions. Well done.The brunch dishes taste better than those over at Wild Honey though Wild Honey is more conveniently located. I'd pick this one if I were picking based on food alone.Update 17 Apr 2017Black Angus Cheeseburger ($23++=$27) - 3 stars3.5-0.5 stars for the price (I like my math apparently). Everything on the burger - the caramelized onions, the cheese was good, and the meat itself was juicy but BLAND. I got it medium and it was still kinda red and oozed... The fries were mediocre - salty and crispy but again the taste wasn't great. The slaw was alright. I appreciated the pickle! Overall okay...Wifi only for phones. They won't type it in for your tablet or laptop.4 stars for the ambience. Nice bright and roomy.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "ZbWEjwLiUVY-7muMaD4G5A": {
    "date": "5/7/2016",
    "text": "Back again on a Saturday night for dinner and this time, we had the Angus cheeseburger, chicken and waffle, Clinton St omelette and buttermilk biscuit sandwich...oh and of course the blueberry pancakes. Friends loved the food, particularly the blueberry pancakes and the buttermilk biscuit sandwich. I had the chicken and waffle; I would prefer if the chicken was more deep fried and crispy, though the waffle was tasty with the maple butter. The Angus cheeseburger looked delightful and we particularly enjoyed the very tasty fries. Portions were satisfying and we barely had space for desserts - could only make room for 3 pancakes amongst a party of 6. The bill was about $30 per person. I had made reservations by phone which was painless, though I wish they have an online option. It's interesting that's not available, considering the reservation confirmation was done via an automated system. We'll be back again to try more of their desserts.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LWGjx4Acq0-Z7J4eBCGK7A",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LWGjx4Acq0-Z7J4eBCGK7A/o.jpg"
      },
      {
        "img_id": "nA_pPFaTW02v2md3Y4ZZDw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nA_pPFaTW02v2md3Y4ZZDw/o.jpg"
      },
      {
        "img_id": "5NJUBc1vrhQNJ_jEi8oXdA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5NJUBc1vrhQNJ_jEi8oXdA/o.jpg"
      }
    ],
    "user_id": "yGEwxh5dwzD2wmpzbskwAg"
  },
  "a1YbUOBiZt2HL95XkZO0Jw": {
    "date": "6/3/2017",
    "text": "Chicken and waffle. Without the sauce, the waffle is too sweet for me. The chicken is boneless and has an nice crisp. Somehow, it doesn't sit well with me. It's alright. Not wow. Satiates a craving.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yRBHSCO3NfFLHkvFz3EmeQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Chicken and waffle.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yRBHSCO3NfFLHkvFz3EmeQ/o.jpg"
      }
    ],
    "user_id": "kf8w7gKG9dRPngQS9R7oAQ"
  },
  "QOjsinmm5XgOrM0ZXaDm0Q": {
    "date": "12/29/2017",
    "text": "You know it's good when there is queue outside!Indulgent, perfect for those on vacation and want to splurge for those who have a moment of 'I worked hard all year, I deserve this'",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KJa-_d7C1dtyyJi1rcc6pA"
  },
  "8sUd-48iRnYXnJfuGsTTaA": {
    "date": "1/31/2017",
    "text": "Similar to the NY original (which I find overpriced and overhyped) except this place didn't have any queue on Saturday at 2pm. I just walked right in. AMAZING!Serves your standard easy-to-make-at-home-but-why-bother-lets-just-pay-lots-of-money American brunch fare: chicken and waffles, their famous blueberry pancakes, milkshakes. You know, all that healthy stuff that keeps Americans so notoriously thin.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "HX0W4gn5GkKX4qdhJzZMog"
  },
  "wizcXecjvI-VIOrMu3kRHw": {
    "date": "7/5/2016",
    "text": "Has the typical American bistro surroundings so for those that miss home, this is where you should be going to. Food is consistent every visit, and on the weekdays at around 1.30pm we could instantly get seats for two. Drinks are really expensive and personally I think water would suffice as the dishes are rather savory. Portions are good old American portions, so for small eaters please do share with your pal. Had the Southern breakfast today. Bacon was drenched in honey, cheese grits are perfectly on point, fried zucchini and poached eggs complemented well on the whole. Average cafe food but decent within the 10mile radius. Kids friendly, selfie friendly as place is well lit with sufficient lighting.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xv5Nb1mDGDhYPQIFSOA6Lg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Great good old American portions! Southern breakfast for me!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xv5Nb1mDGDhYPQIFSOA6Lg/o.jpg"
      }
    ],
    "user_id": "cYNObRuxZ4aLzYZ0kEc01w"
  },
  "ZmGSICmZQWRrA7_OOV90Fw": {
    "date": "2/17/2017",
    "text": "Great breakfast; I had the huevos rancheros. Pleasantly surprised to find a Mexican classic in Singapore. Our table shared the special pancakes of the month with rum, coconut, and bananas which were absolutely divine.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXZugc7pCL4vOSwPFq4kHQ"
  },
  "RhVXYYsYZ4DtCnbrpwX_8Q": {
    "date": "2/11/2016",
    "text": "My first time here. Ever. Didn't know about the New York branch so there is no basis for comparison. I've heard lots of excited rumblings of course, and friends who used to live in New York were thrilled about its opening. Fair enough. From all accounts, I hear that this place largely works. The food is comparable and all. I'll have to take their word for it. I only came here for some cake and I got the upside down pineapple cake. I don't know why but seeing a badly sliced and sloppily presented cake annoyed me. It shows a lack of care in the attentive-level of staff.When I went to pay, I noticed that other cakes (of other flavors) were similarly badly sliced. Woah. I really did think Clinton St Bakery was better than this. Taste-wise, the cake was fine. Not great, not terrible. The staff was sufficiently polite. But I think the devil's in the details and they need to teach their staff how to slice cakes properly, lift the slices and place them on plates.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jnSBwh4H2g2XzcKMG-GVQw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Mangled upside down pineapple cake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jnSBwh4H2g2XzcKMG-GVQw/o.jpg"
      }
    ],
    "user_id": "m369Z6yvE3E5vBww9DSJsw"
  },
  "OGMUgyLsZRVCe63kW59nJQ": {
    "date": "3/15/2018",
    "text": "This place was soooooo delicious!!! We came here on our first day in Singapore for breakfast and ended up coming back on our last day because of how good it was. The waffles were amazing and the orange juice really was freshly squeezed. The place is very clean inside and the workers were patient, helpful, and friendly. 10/10 recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_wg6I1de2urfU4xVLnHbEQ"
  },
  "JU_lTGPMPbCdssn5mph7YA": {
    "date": "2/17/2017",
    "text": "Wow very impressive food !we try once and tomorrow will be our second time I thinking to go there once a month at least :-)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TJ3FG2u3a4LdLPmW_7Cgdw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TJ3FG2u3a4LdLPmW_7Cgdw/o.jpg"
      },
      {
        "img_id": "5Huj50poHd5RhIa-Wrs1SA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5Huj50poHd5RhIa-Wrs1SA/o.jpg"
      },
      {
        "img_id": "oisfZpwPinT3SriB-W7KPQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oisfZpwPinT3SriB-W7KPQ/o.jpg"
      }
    ],
    "user_id": "CuwRegmbxokVd6Wa587Wpg"
  },
  "W0sP426kWkQYOnu95NMm9Q": {
    "date": "10/26/2015",
    "text": "I had this a few years ago in New York. Unfortunately it was after a visit to Katz (and if you've seen the size of their pastrami sandwiches you'd know how stuffed I was at that time) so all I had was the bacon and it didn't leave much of an impression then.FAST FORWARD TO 5 YEARS LATER! And Clinton Street Baking Co is now in SUNNY (hazy) SINGAPORE!They don't take reservations, and we were here on a sunday morning, and the queue was 1.5 hours. By the time it was our turn to be seated it was 2 hours. Be warned that the queue is deceptively short because everyone just gives their handphone number and goes away while waiting. There are some red benches to sit on outside the shop but it could fit a maximum of 8 people. 2 yummy mummy-types tried to cut the queue (\"why don't we tell them that we have a baby?\"). To which I said. \"IS THE BABY GOING TO BE EATING THE FOOD HERE???\")My question was answered when I made the mistake of ordering the cheese grits. A mush in a plate, it tasted as good as it looked. Which was not at all. I'd rather some mashed potatoes. Even the powdered ones that you get from 7-11.Other sides were good but not impressive. We had the southern chicken (skin was yums), the scrambled eggs with salmon (not baaaaad), and some farmer's platter. Like, good but I wouldn't wait more than 30 minutes for them.BUT THE STANDOUT WERE THE PANCAKES. 3 flavors - blueberry, banana, chocolate - to choose from. You can add 1 more flavour for $2. Same pancakes, different toppings. These were nice and fluffy and thick yet light. I think the only other place in Singapore that comes close so far is Skyve. If you put the pancakes from those 2 places together and made me choose 1, I don't know which would win. But maybe Clinton Street because of that wonderful maple syrup/butter mix, which married the taste of maple syrup with the smoothness of melted butter.Come here! Unless you're a yummy mummy with a baby trying to cut the queue -_-\"",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K1RuatVBjjoBG4MznVzZ0Q",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Cheese Grits. Yum yum (not really)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K1RuatVBjjoBG4MznVzZ0Q/o.jpg"
      }
    ],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "tZVfsaTC4pmy3trcz_j-0Q": {
    "date": "11/21/2015",
    "text": "A great spot for a classic American breakfast. We had blueberry pancakes, French toast and the Farmer's breakfast. All were excellent and the portions are massive, you certainly won't go hungry! If you go on the weekend I would get there when it opens if you don't want to wait. There were 12 of us waiting by the time it opened. I'll definitely be back to sample some of their non-breakfast items at some point. The service was a bit slow. I think the young staff are a bit overwhelmed. Hopefully that will improve with time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QHOhWGUCoKN3YN1judCkpg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. French toast.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QHOhWGUCoKN3YN1judCkpg/o.jpg"
      },
      {
        "img_id": "Hvz5qgZpEqCUfcmf8pj9jg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Blueberry pancakes.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hvz5qgZpEqCUfcmf8pj9jg/o.jpg"
      }
    ],
    "user_id": "W6w9AZKCKBo9m8iPr2hQyg"
  },
  "hdpG37cOjf10jdaU3Qu6Xw": {
    "date": "7/16/2017",
    "text": "This outpost of Clinton St. doesn't hold up the reputation or quality of the original in NYC, where I'd queue for 45 minutes in a blizzard for that alpha dog eggs Benedict. Not here though. I will give it another try, but the taste is way off. Hopefully, they've ironed out the kinks.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "OWwq3hShsDQeGu1hoFf-Gw": {
    "date": "9/19/2015",
    "text": "Given that it's a fairly well known brand from NYC, lines and crowds are expected even in the soft launch phase. Approx 1 hour wait during weekend brunch. Order came pretty swiftly, had the classic Pancakes. Generous portions as per the ones in NYC. Chicken and waffles were decent but not mind blowing. Overall decent cool brunch spot, hopefully it survived beyond the hype.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MWuzfQSX7NMc6og48QpZWw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Interior - cake display at the entrance is always a smart move",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MWuzfQSX7NMc6og48QpZWw/o.jpg"
      },
      {
        "img_id": "dN2_3bwlsuFc0Eetxq-XNQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Pancakes, chicken & waffles and scrambled salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dN2_3bwlsuFc0Eetxq-XNQ/o.jpg"
      }
    ],
    "user_id": "cLIlR-ngTMqWHHSl38y7kw"
  },
  "Q5Fmiat25kvMwRC9BBJEXQ": {
    "date": "10/16/2015",
    "text": "What makes this brunch spot unique is their homemade maple syrup which tastes different than anything I've ever tasted (in singapore and in the U.S.). The maple syrup is light and sweet with a tang of caramel(?) and an excellent addition to the crispy pancakes or waffles. I will admit it's not the most balanced or nutritious meal however, and do feel a bit guilty and gluttonous after having had brunch there once. The wait can be long but i would still say it was worth it. Would go back once in a while",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0uC125Lx8HR_1R4TlghZHA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. The famously crispy pancakes with blueberries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0uC125Lx8HR_1R4TlghZHA/o.jpg"
      },
      {
        "img_id": "f3S--M40N_DCC9cOmG476A",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Chicken and waffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f3S--M40N_DCC9cOmG476A/o.jpg"
      }
    ],
    "user_id": "0nSzAzzqVUY1W-D-IVvu_A"
  },
  "IqrbKVqHKFeDMu_Cqo6tCg": {
    "date": "5/10/2017",
    "text": "Had the Rosti with smoked salmon. I find it too crispy for my liking but it wasn't that bad. The blueberry pancakes were not bad. Service was pretty okay. I thought the design of the place was quite cool. It had a American diner vibe with ample seating.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xU3sDPonLx1_w4t6wOOpdg"
  },
  "oDZt3XKYAcyxHJ8MudPr9A": {
    "date": "3/30/2018",
    "text": "I'm not a huge fan of pancakes and that's not because I don't enjoy them. I do. I really do. It's just that not everyone perfects them. My husband and I were in Singapore for a couple of days and we both like our meals to be delicious. So my husband found this place mostly because they have good pancakes (based on the reviews he read) and we decided to give it a try. We both ordered our pancakes with chocolate chunks. When the waiter brought the pancakes to our table, they looked like regular pancakes. However, the moment I drizzled the buttered maple syrup on top of the fluffy round edges of my pancake, I immediately knew that this one is going to be one of the best I ever had. And I was right. The buttered maple syrup was so darn good to the point that without it, the pancake would not taste this incredible. My husband loved it and so did I. Glad we gave it a try. Now I think you should.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qQhT6AF-qvhnF4jcuBgZjg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qQhT6AF-qvhnF4jcuBgZjg/o.jpg"
      }
    ],
    "user_id": "-EJ9vN_wEdqOuI1_J0pilg"
  },
  "BNRSFe65eOfw895LVWWlWg": {
    "date": "3/18/2018",
    "text": "The pancakes are insane!!!! Went here for breakfast and we ordered heuvos ranchis and the salmon omelette. Both were ok but nothing special. Next we ordered the chocolate chip pancakes. I believe they are one of the best pancakes I have ever tasted. They are hot, fluffy and the chocolate chip are melted inside them. Plus the pancakes are hot such that the chocolate chip sprinkled above them can easily melt. Other than the perfect pancakes the maple syrup that comes with it is also perfect. It's not your average maple syrup.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Y_MR1cT4JMip4vumjf2OBQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y_MR1cT4JMip4vumjf2OBQ/o.jpg"
      },
      {
        "img_id": "czaMHG9hcJ8CswXZPdiDgw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/czaMHG9hcJ8CswXZPdiDgw/o.jpg"
      },
      {
        "img_id": "taaCCeEnC8nEf8RpJ7pntQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/taaCCeEnC8nEf8RpJ7pntQ/o.jpg"
      }
    ],
    "user_id": "_sIHo_g6xrTHxQCdiPmhGA"
  },
  "VIPOwSA8WsM3mS8q7ugDgA": {
    "date": "4/11/2018",
    "text": "Best fluffy pancakes in Singapore.  Love the sausage patties.  Huevos Rancheros is my go-to Dish.  The only item I'd say doesn't tickle my fancy is the sugared bacon.  I like my bacon unsweetened; will try to order that next visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pE002Ik52LwdyK8S2mxgTg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Huevos Rancheros",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pE002Ik52LwdyK8S2mxgTg/o.jpg"
      }
    ],
    "user_id": "fc0E3w6TYCU-qguDeCEHsQ"
  },
  "yxX3VtzZXwLeWBW5Rqs9pQ": {
    "date": "1/26/2017",
    "text": "If you're looking for a typical American diner style breakfast, Clinton's is definitely the place for you. The portions were more than generous (though still not as massive as the portions in the States), the food quality was pretty good as well!I had the Farmer's platter (or breakfast, can't remember the exact title now), and I loved how well the eggs were done; slightly runny, just to my liking.  Everything was a little sweet (as if coated with maple syrup), but I think it blended well together. I would definitely get the pancakes the next time I visit this place; the Nutella one looked AWESOME!Just to throw some caution; they're pretty strict on reservations. Also, they only can confirm a reservation of up to 6 pax, any more they can't confirm/have to walk in.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xY-Qu1SYwreD2n29zUNT-g",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xY-Qu1SYwreD2n29zUNT-g/o.jpg"
      },
      {
        "img_id": "wceIqVGfRLp6wkVdYqU4EA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wceIqVGfRLp6wkVdYqU4EA/o.jpg"
      },
      {
        "img_id": "sT3wtWTdO8fwxO0932yhyA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sT3wtWTdO8fwxO0932yhyA/o.jpg"
      }
    ],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "UTLj0Oqt312tisW_Zvjhjw": {
    "date": "3/3/2018",
    "text": "I came here because the hotel breakfast at the Intercontinental was $S30 a pop, and I thought I could do better -- or at least the same for less. So I decided to go to Killiney Kopitiam but my Ang Moh instincts took over while passing the lower-rated Clinton Street Baking Co. They had muffins on display and I am partial to Western breakfasts. So I was sucked in. The first thing I saw from the menu was it was not going to be much less expensive. So maybe it'll be great? Same for more?I ordered what I thought was their signature omelette because it had their name on it. But it only comes with two add-in ingredients (besides the eggs, of course). And apparently nothing but those two plus the eggs because when the omelette arrived I was asked if I wanted salt, pepper, or catsup. The first sign of cooking mediocrity is the need to season it with any of those things after cooking, especially a $20 omelette. If I'd known I would have chosen bacon to go in there. Ugh. It was so bland. And dry. I regretted not asking for catsup. I regretted more not having salsa, which is the best cure for bland eggs.The hash browns, though, were remarkable. If it was a two-egg omelette instead of a three-egger I was pushing through I would have savored them more. My cappuccino was also well done. Final tally, $S33!At the hotel I could have bottomless juice, cappuccinos, an array of Japanese, Chinese, Indian, and Western breakfast items. Smoked salmon with capers. Fresh-made waffles. Croissants and danishes. Fresh fruit. I got less for more. I'm kind of amazed they didn't have oatmeal (or porridge) on the menu. My punishment for not going to the kopitiam.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGxZbLoaJjMjRJlH5YCT_g"
  },
  "yNpjqnmbvkJukbMdfsqzHA": {
    "date": "6/12/2018",
    "text": "Very disappointed in this place. Over priced for such mediocre food. Eggs were over cooked, sausage patties and the piece of ham were not very flavorful. I also personally didn't like the strong flavor of the cheese. Coffee wasn't that great either. All in all, not worth the price. Mediocre food for high end price.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ji7A0ct65azQWjlznAj49g"
  },
  "cE09sJnkYHQ8NLFCMMZ6QA": {
    "date": "7/2/2017",
    "text": "By far the best Western style breakfast/brunch I've ever had in Singapore. I highly recommend the blueberry pancakes and the hash brown.Came in a party of 2. Noting the portions of the people around, we ordered a blueberry pancake, a hash brown, and a two eggs, any style, which we chose scrambled. The blueberry pancakes - extremely fluffy, not at all dry, with a fragrance that reminds me of nice waffles, which on its own is already worth a 4/5. Comes with the blueberry sauce which unlike typical jam-type of sauce, is not too sweet, but somewhat tart, very refreshing. Also comes with a small cup of maple butter. Oh the brilliance. Saves you the trouble of spreading the butter, an extremely cumbersome process. The maple butter is not too sweet, with a flavour that is surprisingly not too heavy, somewhat reminiscent of caramel, and has a nice amber fragrance to it. These 3 items eaten together is heavenly. So overall a 5/5 for this dish, without a shadow of doubt. Portion to us is too large for 1 person. Maybe closer to 1.5 persons for typical Singaporean breakfast portioning. The scrambled eggs, well done, nice butter fragrance, nothing spectacular compared to the other 2 dishes. 4/5.The has brown, oh the hash brown. Drenched in buttery goodness, with a mix of smooth mashed potatoes, chunky potatoes and some portions that are fried crispy. Plain, simple goodness made to perfection. This to me overtakes the well done rosti at Marche as the best rendition of a potato dish. 5/5. All in all I am impressed. I'm not even sure why some people complain about the prices. It appears expensive, yes but that reflects the portion they are serving. Bring friends along to share and the prices are extremely reasonable. Coupled with the brilliant quality, this is a no-brainer. Never had a western style breakfast that truly impressed me in Singapore. This is the first.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lp0pdgAZesR0F-c6gPvUew",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Awesome Blueberry pancakes. Portion is huge, beware.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lp0pdgAZesR0F-c6gPvUew/o.jpg"
      },
      {
        "img_id": "WrRqU3cLExx5xGbfc2K5OQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Side: Hash brown. Heavenly.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WrRqU3cLExx5xGbfc2K5OQ/o.jpg"
      },
      {
        "img_id": "yvEzOfD-PD0m4l1BkoRcdg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Side: 2 eggs any style, scrambled",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yvEzOfD-PD0m4l1BkoRcdg/o.jpg"
      }
    ],
    "user_id": "UwDubntDLuQcvwB3mAzU6A"
  },
  "hM4H5UOvefn5cKbxit1nww": {
    "date": "3/7/2016",
    "text": "Located in the middle of Purvis Street, is this cafe called Clinton Street Baking Company. Its main outlet is in New York, United States. It is well known for its pancake and is known as \"New York's # 1 breakfast spot\" by Lonely Planet, as well as, \"Best Pancakes\" by New York Magazine (twice). The place was decorated in a traditional, clean cut look.The usual menu was presented in a booklet.Besides the usual menu, there is daily special items on the board,as well as, dinner special items.Boozy Salted Caramel ($15++ left)vanilla ice cream, bourbon, salted caramel sauceWithout alcohol ($10++ right)Pretty strong in the alcohol. The drink tasted very rich and creamy, but could not taste the salted caramel in it.Crab Cakes ($15++)Two crab cakes, served with classic remoulade, and house slaw.The crab cake was moist and creamy inside with chunks of crab meat in it.Chicken & Waffles ($21++)with honey-Tabasco sauce, a crispy Belgian vanilla buttermilk waffle, and signature warm maple butter.The chicken was served char burnt, which made one quite disappointed. Some parts of the batter was just too hard and bitter to be eaten. One had to remove the batter coating in order to eat. Although the staff saw that we had left much of the batter untouch when clearing the plates, no one asked us about the food. The waffle was not the usual crispy and fluffy type. Instead it was eggy and soft. More like kueh kueh type. Not bad with the maple butter sauce. But not really my type.Pancakes with Warm Maple Butter ($18++)Served with wild blueberries.The first which I notice when the dish was served, was that the pancakes were super thick in size. The pancake was fluffy and soft, with a kind of eggy taste. Some may felt that the blueberries was a bit too sour. Nice but could not take in more a piece of pancake. It was way too much for me.Overall felt that the food was overrated. Maybe I was expecting too much but it just did not blow me off. Although the place looked sparkling clean, I was surprised to see a certain small animal running through the dining area. No wonder the place had placed a notice that it would be closed early for maintenance on the coming Monday. I soon lost my appetite after that and trying to vomit everything out.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Zhi0m6YNlyYMEw7NIHuBHQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Pancakes with Warm Maple Butter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zhi0m6YNlyYMEw7NIHuBHQ/o.jpg"
      },
      {
        "img_id": "Z7Ld4K-2Zt6v3_jBI3Yk4g",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Chicken & Waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z7Ld4K-2Zt6v3_jBI3Yk4g/o.jpg"
      },
      {
        "img_id": "3H-tr3dKpDW_G8NRynf7Qw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Crab Cakes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3H-tr3dKpDW_G8NRynf7Qw/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "vymOp1NVkgMz2Ofd5YgA0g": {
    "date": "6/2/2018",
    "text": "Everything should be half the price.  For the same price you can get three times the quality at P.S. Cafe.  Dishes with eggs were underseasoned and in lack of flavor.  The 20 dollar omelet has an egg to stuffing ratio of 5:1.  Not coming back. Coffee was good.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnRDdxHc3poZZ-9dYrXQCA"
  },
  "HKOuU0GYAScQLb05YbIG9w": {
    "date": "1/5/2016",
    "text": "To summarize it all in a word, pancakes. EAT the pancakes.Clinton St Baking Co. of Manhattan's Lower East Side finally lands in Singapore with a huge splash, with glowing reviews in the island's English language broadsheet, and features on TV.Stepping inside, the dining room successfully recreates that typical American diner feel, similar to the original in NY (but definitely much newer).The entrees were decently good, but I'd recommend the pancakes above everything else. Fluffy on the inside, crispy on the outside, paired with a sinful maple-butter sauce that's just amazing as it is calorific. Blueberry, banana walnut or chocolate chunk, they're all good. The house brew is drip coffee, and refills are free!They had a couple of Southern offerings on the menu, but IMO they were Northern interpretations of Southern food. I liked that the buttermilk fried chicken had cornmeal in the batter, however the batter lost its crunchiness rather quickly and fell off the chicken before you had a chance to bite it. Conclusion, stick to the pancakes.They don't take reservations, and weekend brunch lines are an hour wait or more. To avoid the crowds, I recommend coming in on a weekday, or late in the afternoon on a weekend, or heading for the pastry & coffee takeout counter instead.It's been a while since I was back in Manhattan, and I personally have not been to the original on Clinton St (there, I heard the lines are an hour long too), but comparing this to other brunch type places in Singapore they pretty much come out tops. 3 if this is a place in the US, 4 cos it's in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8AMAV_cQpbhXWQaPBh4OTw",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. takeout counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8AMAV_cQpbhXWQaPBh4OTw/o.jpg"
      }
    ],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "wnTSKjIk0f_N7BA1DnWrHw": {
    "date": "5/7/2018",
    "text": "The service was great and the atmosphere was too. I ordered the blueberry pancakes and the veggie sandwich, the veggie sandwich was good, it was packed with avocados which is a plus but it's a little bit pricy, the pancakes's however, tasted incredible along with the warm maple butter and the blueberries on top of it. 10/10 would recommend y'all to come here just to get a taste of the pancakes!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5v4AZLbkSz6HeLOMdV77jA"
  },
  "RkZTsqlhcn2Y-LI3FNsw3w": {
    "date": "4/14/2018",
    "text": "Massive portions!! We've tried the blueberry pancakes and we had to take half away as it was so big. It was delicious too. The restaurant was super busy and it was almost 1400. Totally recommend for a late breakfast!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpaVBihE2f-KOyhI0KAIyQ"
  },
  "_ltg0EIJuj1M2-tepQDWvA": {
    "date": "4/30/2017",
    "text": "Heard of the fame pancake quite sometimes, finally managed to taste it yesterday!Indeed, it is worthy to try the 'Best pancake in the city', voted by New York Magazine twice. I have ordered the Blueberry Pancake, after a short wait, the lovely pancake was served. Generous portion of 3 slabs warm and pillowy pancake, served with tangy sweet blueberry coulis. The maple butter is the killer, I have completely surrendered after tasting it, it is just beyond words! Conclusion, cloud 9 sensation needs only few well made ingredients, come in as a perfect combination!The good vibe is still lingering till now! I will definitely come back again, soon!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zg3-knLpIcli005rVWBCag",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. The famed Clinton St Neil's Blueberry Pancake, I really love the Maple Butter!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zg3-knLpIcli005rVWBCag/o.jpg"
      }
    ],
    "user_id": "KPRclbGn7m3a-zXXIFbCBw"
  },
  "_CmK5brt5i2T2TGokTWNrg": {
    "date": "8/14/2017",
    "text": "Finally, a good American diner style breakfast place in Singapore! The food here is pretty good - I've tried the pancakes with warm maple butter + banana walnut, as well as chicken and waffles. Both were really good! The pancakes were extremely fluffy, and are in my opinion one of the best you can find in here.... and the warm maple butter they're served with was also heavenly!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lY14dlY6pk3xCLQ4kphafQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Super fluffy pancakes with banana and walnut",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lY14dlY6pk3xCLQ4kphafQ/o.jpg"
      },
      {
        "img_id": "q_wnXBrZRxUCwZ3FuAZW_A",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Chicken and waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q_wnXBrZRxUCwZ3FuAZW_A/o.jpg"
      }
    ],
    "user_id": "as58wHUswAr9TLmo21js0Q"
  },
  "NXOiX6sZ6NVCIXrXtkp4dQ": {
    "date": "6/24/2017",
    "text": "This was easily the worst experience we had anywhere on our entire trip.Left waiting for 20 minutes to place our order while the table next to us, seated after we arrived, placed and received their order. We were generally ignored by the staff--and at the end we paid 10% extra for their \"service.\"Do yourself a favor and go elsewhere.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpeirxUiIwmpIgMP-icU6w"
  },
  "GvFOBjvDjZjkoegacrgstw": {
    "date": "7/29/2017",
    "text": "I'm from NYC and have been dying to go to this place so I was extremely surprised when I saw it pop up on yelp while searching for breakfast. When we first arrived, we were told it would be a 15 minute wait but then was seated promptly. We ordered chicken and waffles,  banana walnut pancakes and the biscuit egg sandwich. Being from NY, I was definitely shocked by how good the food was here in Singapore. The eggs on the biscuit sandwich was cooked perfectly. The only thing I didn't like was the tomato sauce on the biscuit sandwich. I wish this sandwich was a little bigger though. The potatoes that came with the sandwich were also delicious. The pancakes were light and fluffy and just the right portion. The chicken and waffles was also another fantastic dish with the chicken being nice and crispy.  I will say the service was subpar. No one came over to ask how our meal was nor did they clear our plates or deliver the check at a reasonable time; we had to ask a different waiter for it. Overall, four stars and I can't wait to now try the NY location.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9iT_pJeMUtdKlVoBKKhFSQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Banana walnut pancakes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9iT_pJeMUtdKlVoBKKhFSQ/o.jpg"
      },
      {
        "img_id": "9IOUkSMN3Ir_9wE-n7hwcA",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Breakfast biscuit sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9IOUkSMN3Ir_9wE-n7hwcA/o.jpg"
      },
      {
        "img_id": "ApcwQWgIeoemr-UOSVFIhQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Chicken and waffles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ApcwQWgIeoemr-UOSVFIhQ/o.jpg"
      }
    ],
    "user_id": "imt_9Pief2kY74rH9CF9jA"
  },
  "x4NurWr1BjlcL30Xknbr6A": {
    "date": "4/21/2018",
    "text": "Delicious breakfast. Good menu options in a nice little neighbourhood. Staff all very friendly and attentive",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cAJnw-7Xgr4q0VnZOqh2FA"
  },
  "KSHQmzXCje4trd7QcRE3Sg": {
    "date": "10/22/2015",
    "text": "I recently had a pancake craving and with all the hype surrounding this place, I just had to check it out for myself.Popped in here on a weekday, late afternoon, and there was no queue. The place had about 7 people, so you may want to try your luck instead of the horrendous weekend queues. There are some benches outside if you should so feel inclined to wait with the crowds.The Bellini flavors are seasonal here, and on that day, it happened to be strawberry. Yum! Prosecco and fruit; can't go wrong! I got the banana walnut pancakes, and oh my, were they delicious. The pancakes came, topped with fresh banana, and crunchy walnuts, and some sugar sprinkled for extra crunch. Crisp exterior with a fluffy interior with more banana and walnuts within, coupled with their gorgeous maple syrup-butter sauce... One vessel of sauce is not enough for 3 large pancakes, so I got another. It cost me $2 but oh well, I didn't come to Clinton St Baking Co. to be a stingy person. A friend told me you can change the flavor of one of the pancakes for an extra $2, if I am not wrong. I also got the cheese grits, and ye, it tastes like a savory oatmeal with cheese. Very regular. Service was prompt, but I guess a true test of the waitstaff is peak hours, which I obviously did not get to see.Would return for the pancakes. Or maybe to try the chicken and waffles.P.S. Amex not accepted here.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VAJI1CvhQbzlBi477EYr5w",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VAJI1CvhQbzlBi477EYr5w/o.jpg"
      },
      {
        "img_id": "74mS6b5OpGnweYej1bTh4A",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Banana walnut pancakes.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/74mS6b5OpGnweYej1bTh4A/o.jpg"
      },
      {
        "img_id": "HXOKvoB4UwkVdUmHAHWtrQ",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Strawberry Bellini.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HXOKvoB4UwkVdUmHAHWtrQ/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "lfl7Ft4kEVs5MqYDvmb71Q": {
    "date": "7/15/2016",
    "text": "If you're after a substantial American style breakfast or brunch Clinton Street Baking Co is a decent option. The servings are massive, just like in The States, but the prices reflect the portion size. They have a lot of the classics here; pancakes, eggs on toast, a big breakfast etc. I thought they might have more baked goods on offer in the display cabinet given the business name, but there were just a few scones and muffins. I opted for the smoked salmon scrambled eggs and was not disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "RGmOzwHHEm6z-pqEKRw4Ag",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Scrambled eggs and smoked salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RGmOzwHHEm6z-pqEKRw4Ag/o.jpg"
      },
      {
        "img_id": "piSMk_YubdmSYObcH9gq6A",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/piSMk_YubdmSYObcH9gq6A/o.jpg"
      },
      {
        "img_id": "Eh96pRS7hocyqgHgwx5fKg",
        "caption": "Photo of Clinton Street Baking Company & Restaurant - Singapore, Singapore. Scrambled eggs with smoked salmon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Eh96pRS7hocyqgHgwx5fKg/o.jpg"
      }
    ],
    "user_id": "IKwsGotasR27FMY2eQ2gHg"
  },
  "hlPXPCQ5Jl0jp2gyGtE7hQ": {
    "date": "11/12/2016",
    "text": "Great breakfast food, busy, yet nice atmosphere and mediocre service. Went on a Saturday afternoon for a late lunch and they were still very busy. Sat at the counter and ate which gave me a front row seat to the controlled chaos of servers flying around picking up orders and ringing up customers. The service could have been better - no one spoke to me after I ordered to check on the food or pour more coffee and I had to ask for the check.  Had the chicken and waffles which was quite good, especially with their green jalapeño based hot sauce. Add the maple butter and you're good to go. I agree with another review that the waffle could have been a little more well done, especially to support the fried chicken but still worth getting. Will definitely be back for those pancakes.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOHPM1YtbBTBBa4--xuo6A"
  }
}