{
  "we-2kkVmkjXLtV8eGXBD1Q": {
    "date": "1/12/2016",
    "text": "After looking at the wine connection (next door) disappointing selection and pricing of sparkling wine by the glass we stumbled across this tapas/Spanish restaurant next door. My expectations were fairly low but as they had two Cavas at 7 SGD per glass I was convinced to give it a try.We also ordered some different tapas for the table to share. The patatas bravas were acceptable,, the croquettes pretty good while the cheese and cold cuts can rather be skipped and the same goes for the padron peppers. In general the food is nothing to get excited about but as a snack when having a drink they are perfectly fine.The cavas were not the best I had but for this price it was a bargain. Nice outdoor setting and friendly service will encourage me to come back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "OU65XVj-L2XieZizZfP9Ww": {
    "date": "5/31/2014",
    "text": "Came here after a very long day at work and I loved the food. Had the paella (can't remember the name and can't seem to find anything similar on their online menu, but it was the only one with no seafood in it) which was really good, well-cooked and satisfying (or maybe it's just because I was super hungry LOL). One of the best ones I've had in Singapore, on par (or perhaps even better) than the version in Serenity. Way cheaper too! Came in a large pan which was more than enough for 3. We also had the Catalunya pizza ($13)- really simple with only a topping of anchovies and vegetables but well-excecuted. The crust was thin yet flavourful, and very cripsy. And it was big for its price! Dessert was the Crema Catalana ($10) - essentially Creme Brulee. Nice but not sensational, but big enough for 3!. Still, it was a very good meal and worth it for the prices. 3 dishes filled the 3 of us up quite well- a feat considering that we'd been starving for 9 hours before that!Found it quite difficult to get the attention of waiters but they were helpful and polite when they finally came to our table.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "3O7EcKqeong-BerhzBpfbg": {
    "date": "11/6/2013",
    "text": "This review will probably be of little use to most of you, given the circumstances of my visit to Barraka. The time is 2.15am on a Saturday night and we have just been ejected from The Chamber nearby where we were watching a big football match. They decided to close at half-time, those bastards. We walk around for a while in the Robertson Walk area looking for an alternative and Barraka pops up. The screens are a bit on the small side but there's space, they're open and willing to serve us booze. Moreover, the manager invites us in without malice, despite us being supporters of the team currently beating his 1-0.But the best part? The bill. Four whiskies = $28. That is just simply amazing in Robertson Walk. I have no idea if they had a deal or a happy hour or something, I didn't ask, I just stared at my bill in stupefied amazement.Well I lie actually, the true best part was when my team (Arsenal) won 2-0. But that's some thing the poor, Liverpool-loving Barraka manager had little control over.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "41MtZiv6L0dB4S9NdnO6_g"
  },
  "llEZ2nsHAfpGdvv6TUkTFQ": {
    "date": "7/26/2014",
    "text": "Second time here and very pleased with the food, drinks, service and ambience. They have a good variety on the menu that I'm sure will please most tastes. We stick to a Paleo diet and the Polo (grilled chicken breast and vegetables) hits the spot. The prawns and mushroom tapas dish was awesome as well. The entire menu is very Paleo-friendly. The drinks are the cheapest we've found in town - and they're good. I really enjoyed the traditional sangria. The food is also very reasonably priced. Our service tonight has been awesome. This has easily become a large player in my roster of go-to restaurants.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HAQPCjua2bPmL4dvczw4og",
        "caption": "Photo of Barraka - Singapore, Singapore. Chicken salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HAQPCjua2bPmL4dvczw4og/o.jpg"
      },
      {
        "img_id": "TQBvUbX8sSMzknooaz1qug",
        "caption": "Photo of Barraka - Singapore, Singapore. Hubby got the pan fried salmon special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TQBvUbX8sSMzknooaz1qug/o.jpg"
      },
      {
        "img_id": "5sh1RJyOjnyrLHSq9_OGtg",
        "caption": "Photo of Barraka - Singapore, Singapore. Patatas bravas and sparkling sangria. A nice twist on a traditional sangria and great for a warm night!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5sh1RJyOjnyrLHSq9_OGtg/o.jpg"
      }
    ],
    "user_id": "IOtmx8Zebl3wOOqNEobFMw"
  },
  "tyZhSlk4GigUG9rPMGGXvA": {
    "date": "5/13/2014",
    "text": "I didn't try any of the food so I cannot comment on that. But Barraka is a nice casual hangout that serves a good selection of beer at fairly reasonable prices considering its central location. So how can you not like that? You do, however, have quite a lot of choices at robertson quay. So Barraka is not a bad choice but not exactly a standout choice with all the other restaurants and bars around.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUZ3fmICiFLVrUBl0lDx4g"
  },
  "5DyaN60KgCuKierI9pRrcg": {
    "date": "4/29/2015",
    "text": "Sucks! The staff manager of the place attitude!!! Yell at client and still say client yell at him. Please don't waste effort going.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XcEDBrhk4QbwPp1NWFbk8w"
  },
  "4H8OKgnPG2VOV71UESRY_w": {
    "date": "12/2/2013",
    "text": "Meh.  We ate tapas which tasted generic. Some of the more expensive ($20+) meat dishes were tasty but overcooked and dry. The drink was cheaper than average.  The bill took 30 mins to process (typical singapore only allowing one person to work the register) so we left feeling our time was wasted. The manager Sam was disinterested, some would say rude. Will probably stick to wine connection next door some time. For good tapas I would recommend the place on Emerald hill and for excellent tapas I would recommend Catalunya on the waterfront by fullerton bay hotel.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v6aGAahbKL_VIHKsJDr9XA"
  },
  "4Qz7DQ-U7Op65uynJ_IvWA": {
    "date": "2/7/2015",
    "text": "Terrible food. The seafood paella was flavorless, over cooked, and (worst of all) full of sand. The service was mostly bad: when we ordered, the waiter offered some useful information, but was otherwise entirely inattentive.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmEnUqUNx5Snj0BlkpZqGQ"
  }
}