{
  "DOHAx8n7KCOQGqAGifaGDg": {
    "date": "8/31/2018",
    "text": "Another example of an expats staffed restaurant surpassing Singapore in service.  Singapore desperately needs to follow this restaurant's example of fine dining.  (Really Singapore you don't have to tolerate being so poorly served within a restaurant - wake up). A small entrance bar- good bar service.  Two dining rooms with plentiful, capable wait staff.  It's good Italian (not inspiring) with an attentive wait staff.  The place has an excellent wine menu.  If you can afford it - dne here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRA9nP5cnGiW-qCOgeAyow"
  },
  "OWya9Shtg86gDFvto2aJAQ": {
    "date": "7/31/2017",
    "text": "You're always guaranteed to have a pleasant experience here. Excellent food and very good service in an elegant atmosphere. For starters, I recommend splitting the 'Dream' (S188++) with a partner: so decadent but how delicious - cold angel hair pasta with prawn, oyster, scallop, uni and caviar! Having the dish on your own would be too rich for most people. Classical dishes like osso bucco and veal milanesa are prepared to perfection here; the former melts in your mouth, the latter is juicy with very light 'batter'. Pricey, but still cheaper than the top Japanese restaurants!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DUcfU_-lU5eOTtAfgKmhlw",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DUcfU_-lU5eOTtAfgKmhlw/o.jpg"
      },
      {
        "img_id": "IF8xJ5-S8i8VNHf80i7XAw",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IF8xJ5-S8i8VNHf80i7XAw/o.jpg"
      },
      {
        "img_id": "f56-f3r7Z9Jcs5TBMq-xSA",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f56-f3r7Z9Jcs5TBMq-xSA/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "pf1tWG_Uxaqt_5hGm72Miw": {
    "date": "11/21/2014",
    "text": "We dropped in as most of the eateries in our neighbourhood had closed for business by 9:30 pm - Garibaldi seems to be one of very few places open late.The staff was very friendly and courteous, we were asked to have a drink in the bar area whilst a table was set for us.When our table was ready we were taken to the main dining area which has a very calming atmosphere, with white and light coloured wood being predominant - complete with curtains to draw out the outside noises and lights. Our waiter introduced us to the set-menu, five courses with coffee, all truffle-themed for 188 S$ per person. It sounded great but we did not want to eat all that much - and spend a little less on dinner.We decided to go with half a dozen oysters (Australia & NZ), shared a scallop/white truffles pasta starter and had pan roasted sea bass with vegetables as main.The food was delicious, the oysters fresh and very tasty, the pasta with scallops cooked to perfection and with the fresh truffle shavings just divine.The fish had a nice crispy skin and the meat was just perfect both in terms of texture and flavour.We had chosen a Sauvignon blanc/Semillon from Australia to go with the food, which was lovely and at 88 S$ one of the cheapest choices on the extensive and expensive wine list. We found that the wine in general was overpriced but since we hadn't splurged on food for some time we decided to treat us to it - this however being the reason for 4 stars instead of five, as it really blew us away.Service was very good and professional, and consistent throughout which has become somewhat of a rarity these days, unfortunately.This place is perfect if a celebration is in order - actually there were two local parties celebrating a birthday complete with cake and candles :-).We will certainly be back some day for their excellent Italian food (the executive chef is Italian) and perfect service.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CtZITh28YPFpncLY3Nxcpw",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CtZITh28YPFpncLY3Nxcpw/o.jpg"
      },
      {
        "img_id": "jKu2ezwe54hleF9rBpLf0A",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jKu2ezwe54hleF9rBpLf0A/o.jpg"
      }
    ],
    "user_id": "mI2Q4dVJ92weGouEabb9Bw"
  },
  "7KjIwYvUwJddmFrpsR7zbA": {
    "date": "9/25/2014",
    "text": "Great food and service, and not really expensive for Singapore prices if you stay away from the caviar :) I had the lobster linguine which was exquisite, really a full whole lobster. $68++ Also ordered the antipasti set, which gives you a sampling of 6 different appetizers. $38++ My partner had the carbonara penne, which was also very good. Authentic cheese and real high quality smoked bacon (not your ordinary kind) I think the lunch set menu is also really reasonable, I think something around $40 and looks like a good deal.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rK0CwolzdFI97IVzbSK_EA",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore. Antipasti set, oysters ordered separately",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rK0CwolzdFI97IVzbSK_EA/o.jpg"
      }
    ],
    "user_id": "WqMa1BLU2sgt16wnK1CblA"
  },
  "Kil3hrb3ez2CxRGgh7zSbA": {
    "date": "11/4/2015",
    "text": "I went there during the Restaurant Week on 1 Nov. This is the only restaurant that live up to my expectation during this Restaurant Week experience. They really prepared their best though we were paying half the price of their normal menu.Black Ink Fettuccine was on the menu that night. It was well executed :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ms9qgxOyQ8ul_WVJk4_Z3Q"
  },
  "x6tJvLsgwp2rKMCH-6nGEw": {
    "date": "6/8/2015",
    "text": "What a gem.  Pretty high end Italian place.  Pretty formal old school cooking.  The portions were pretty good sized.  The staff is responsive, the food fast, and very good.  I had the lamb...very good tasting.  However, it left my stomach upset.  It might have been how rich the food was, or how rare the meat was served.Wine list is great here is you have the money to spend.  Lots of good wines to try for any group.We had to ask for the bill.  Service was not attentive at times.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "29RmaBZVzOjtgALs-hz4Ug"
  },
  "aYsrUbGEUS-altwDRQZ6Gw": {
    "date": "1/30/2016",
    "text": "A fancy place with 5-star service and delicious Italian food? Yup, that's exactly what this place is! From the moment we entered, we were greeted with a jovial waiter and a complimentary plate of cheese and olives as we waited for our table to be ready. Just a few minutes later we were guided to our table and sent a complimentary appetizer and some of the best bread I've ever had. I had the fettuccini pomodoro and my husband had the veal and mushroom ravioli. We really enjoyed both and though we won't be coming here all the time (it's a bit expensive), this spot is perfect for a romantic night out.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "Z-2XJnw8nDkAtqy8-ItXjw": {
    "date": "11/4/2014",
    "text": "Restaurant week dinner -appetizer. Fois gras with fusion flacked that didn't work. Pineapple compote and pandan chiffon cake bits should not appear with fois.  +tagliatelle duck ragu. Not bad. Big portion. Expected a bit more al debate+roasted cod. V nice-dessert was an afterthought. Strange flavor combo. -decor reminds me of higher end ikea. Too modern Not sure if I'd return even if I know the chef",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nuIQFRnEMBpf0bAf_sW1cA",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nuIQFRnEMBpf0bAf_sW1cA/o.jpg"
      },
      {
        "img_id": "c0tE_D-aJAMMt8zNrQ3Wtw",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c0tE_D-aJAMMt8zNrQ3Wtw/o.jpg"
      },
      {
        "img_id": "MU27pRfz8633dzwfCAuy6g",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MU27pRfz8633dzwfCAuy6g/o.jpg"
      }
    ],
    "user_id": "UEOgOAFIlH2vpGKNlGsDcA"
  },
  "m1uygbTH9f_TliRZleW0TQ": {
    "date": "2/28/2014",
    "text": "Garibaldi is one of my favorites. It's pricy so I don't go as often as I would like. But the food has always been very good and the service friendly and professional. This evening we decided to go with the executive dinner. 5 courses with a beautiful prosecco as an aperitif. The food was excellent as usual with new flavor combinations that were fantastic. Highly recommended for special occasions or to impress a special person.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xNDeORsk1pzvXB3LDBBE8A",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore. Our anniversary cake gratis. Mmmm. Chocolate.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xNDeORsk1pzvXB3LDBBE8A/o.jpg"
      },
      {
        "img_id": "MxF1PpKRy432AGkdNrTYGw",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore. Fresh berries with pistachio ice cream in sabayon. Fantastic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MxF1PpKRy432AGkdNrTYGw/o.jpg"
      },
      {
        "img_id": "RcotqhsB6nzJQXUkQhTA4A",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore. Duck breast with cherry sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RcotqhsB6nzJQXUkQhTA4A/o.jpg"
      }
    ],
    "user_id": "91UQ_DLi_qsDXQfg6kBePw"
  },
  "W28zDvrdtTU6hQhmSG0L8g": {
    "date": "7/31/2012",
    "text": "Came here for my Birthday and had a great time! Have always known that they were famous for their food - but I've never really got the chance to come. Am glad I kept it for my Birthday!What I Loved: The decor is nice. Service is really good too. We sat at the bar area - at one of the tables - as we wanted to have drinks and finger food. The staff paid quite a lot of attention to us. I ordered an Apricot Brandy & 7-Up which was great. For our finger food, we got the Bruschetta al Pomodoro & Calamari. My fave was the dessert, Tortino Caldo al Cioccolato ($18), Molten Lava Chocolate Cake with Hazelnut Gelato & Raspberry Coulis.What I Don't Love: The prices are pretty rough though. Just finger food, 3-4 drinks & dessert came up to like $138? But it's a pretty high end place so that's expected.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_PUVNXVSw0mYVDETumzLdQ",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_PUVNXVSw0mYVDETumzLdQ/o.jpg"
      },
      {
        "img_id": "23Kw2p4M5VOCXMapgd7jyQ",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/23Kw2p4M5VOCXMapgd7jyQ/o.jpg"
      },
      {
        "img_id": "RQztxxVc0TZyFk2UOSn38g",
        "caption": "Photo of Garibaldi Italian Restaurant & Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RQztxxVc0TZyFk2UOSn38g/o.jpg"
      }
    ],
    "user_id": "0jmAZwCwQN9ByyWsLx7khA"
  },
  "I9bl7efTgyxZYrY07vLmHA": {
    "date": "3/10/2013",
    "text": "Pour quoi does Garibaldi even exist? Especially when competition is rife with Gunther's down the street? Well, I went one day as Gunther's was fully reserved and AMEX concierge suggested Garibaldi. The place was 3/4 full on a Friday night.Food  was lackluster. Perhaps because my taste buds are not evolved enough? I can't even remember what I ate! Service was polite, swift and sterile, albeit lacking a touch of attentiveness that is expected.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qc8-DYXrOqvnW8vK3YfZow"
  },
  "c002SJh6SwsRGLt9UovgXQ": {
    "date": "10/9/2012",
    "text": "This Italian restaurant is good, but oh-so-pricey.  We enjoyed the dishes we had, extremely authentic, but small portions. The also have a huge selection of wines by the half bottles which is much appreciated and their free bread is good.But when the bill came, it was around the same price as Mozza, and it just didn't blow us away, so I think I'll head to Marina Bay Sands next time.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uuz_IsaZ-4jIPn-ay1oAg"
  },
  "Go7M9Su3OOboMnwE9VJ6nw": {
    "date": "9/2/2012",
    "text": "Garibaldi is known as one of Singapore's finest Italian restaurant and it is believable with its elegant façade and fine dining setting. The menu entices people with its authentic Italian cuisine and ingredients that have been imported from Italy. I tried 2 dishes there, both of which I am very satisfied with - Osso Buco Con Risotto (braised veal shank with saffron risotto) and Linguine with Crabmeat and Vodka Sauce. The spaghetti was marvelous, proving the high standards of this Italian restaurant as the pasta was cooked to al dente and tossed in a flavorsome tomato-based sauce with a touch of alcohol. The Osso Buco Con Risotto stole the show, with the braised veal shank so tender and succulent. The creamy and rich risotto perfectly complemented the savory veal. The standards of this restaurant are heightened by its impeccable service. The staff was warm and friendly, and not to say attentive and accommodating when taking our orders.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "5Jnb4gNVVrxLOEr_QAftFg": {
    "date": "7/19/2013",
    "text": "Fine Italian dining. Sophisticated dishes in a modern European ambience. I had the linguine with sea urchin - absolutely divine in its blend of favors, creaminess from the uni. The crackling pork was also wonderful.  Portions are small, but that's normal for high end European dining. Impressive wine list.  But - it's expensive, as the other reviewers note. Expect to pay $250-300 per person including good wines.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4gEiwaJ5oBMOXI9V0y48AA"
  },
  "j9tyMjhDzkCWsndc_C4lvg": {
    "date": "1/17/2015",
    "text": "High-end modern Italian food which is yummy .  Excellent service and nice ambience.  On the pricey side. Good for groups and romantic dates.  Value for money lunch sets options available for weekday.   My duck ragout pasta was fabulous!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKzv6PG0p_lsEDFtwyJepA"
  }
}