{
  "WnD6PTOXsFmwePTWOTOyZQ": {
    "date": "7/15/2012",
    "text": "Located right in the lobby of Pan Pacific Orchard, 10 at Claymore is a hidden treasure for buffet fanatics. First things first, 10 at Claymore's buffet differs from other buffet because they have a special buffet menu on top of your typical buffet spread. Meaning, the buffet menu is seasonal. Maybe from the month of January to March, they will have an Australian Steak special buffet menu, or it could even be a seafood menu. It depends on what is available during that season really. And from that menu, you can order anything cooked fresh from the kitchen served to your table as many times as you like. That is the selling point of this place. Their normal buffet spread is not too shabby as well. I love their seabass, roast potatoes, bread pudding and roast meat. And personally, the quality of the buffet spread is actually quite good which makes the price (which is in the $50-60 range depending on what is on the seasonal buffet menu) quite worth it. I came back here to eat at least  4 times already and always walked away feeling full and satisfied with the service and quality of the buffet. It is a great place for a date or for a big group of people. Do give it a try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rB_rXzhgSE70cxJibr3wRw",
        "caption": "Photo of 10 at Claymore - Singapore, Singapore. 10@Claymore food",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rB_rXzhgSE70cxJibr3wRw/o.jpg"
      },
      {
        "img_id": "Wxo0IicExT53iPKiv_ItBw",
        "caption": "Photo of 10 at Claymore - Singapore, Singapore. 10 @ Claymore storefront",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wxo0IicExT53iPKiv_ItBw/o.jpg"
      }
    ],
    "user_id": "_6zTmwRscQUpbyo8etB0nQ"
  },
  "zFRlZ-I44_lUOJECjAt5zg": {
    "date": "1/30/2017",
    "text": "The highlight of this place is the oyster station where they serve oysters of different countries. It has the longest queue during the start of dinner service. The oysters are really fresh and juicy. My favorite would be definitely from US. One is enough to fill my entire mouth of creamy ocean freshness. Yums:pOther than oysters, their chilled prawns are pretty good too. Those bright red-orange crustaceans are very fresh and springy to bite.One station I would recommend to skip is the Penang laksa and prawn mee. Laksa gravy is not thick and tangy enough. Prawn stock is bland and tasted tad off? Not sure if it's due to my mixed palate. These two dishes are my least favorite. The variety is not as wide as the other buffets I have been to but definitely of better quality. Both cooked food (roasted pork belly, satay, soup etc) and seafood. In short, I'm pretty impressed by their food quality. There's an ongoing $98++ for two pax CNY promotion. Pretty good deal if you like oysters and other seafood.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "wKnOB31r3EdtfrGnNXl_0A",
        "caption": "Photo of 10 at Claymore - Singapore, Singapore. Cake and fondue station",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wKnOB31r3EdtfrGnNXl_0A/o.jpg"
      },
      {
        "img_id": "UdgYCTQo4Q8CL91k-nvjTw",
        "caption": "Photo of 10 at Claymore - Singapore, Singapore. Ice cream (2 flavours; choc chip & strawberry) station sharing table with cookies and bread pudding",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UdgYCTQo4Q8CL91k-nvjTw/o.jpg"
      }
    ],
    "user_id": "g9iOyt4t7KukCIaTNhhOKw"
  },
  "2egmAUjge1DX-753aCcPmw": {
    "date": "4/18/2017",
    "text": "We came back for dinner on a Saturday. Unlike lunch, dinner is sold out at 10 at Claymore. Because we made a last minute reservation online, they accommodated us with seats in the lounge area, which was actually nicer and quieter despite being further from the food.They are currently having their Oysters and Lobsters special, which runs for only $68++, which is cheaper than lunch at some other places (and you can use credit card or chope for a discount), and they refill the oyster and lobsters so there is no running out. Besides cold steamed lobsters, they also served a chili crab sauce version, which was delicious, and a grilled version with butter and garlic. The night we were there, they were serving oysters from USA, Canada, Ireland and New Zealand. The oysters are chucked to order. It was interesting to try the oysters from different places.Besides the oysters and lobsters, they were serving beef on the roast station, and there was a tray of braised lamb which was delicious. They also had BBQ sauce pork ribs, which was very popular (and flavorful!). I skipped the local delights. There was unlimited fried mantous with the chili lobster, which I filled up on. I also liked their cranberry bread. Yes, we shouldn't load up on carbs at a buffet, but some things are just tasty.I wanted to recognize the excellent service by their staff -- despite being seated out of the way, our plates were cleared regularly. The wait staff at the tea station knew where I was seated so they offered to deliver my drink instead of having me walk across the lobby with the drink. An all round good experience. I'll probably be back for lunch though, because it was quieter.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_g9zTyHT5Z-1_b-oWhrP3g"
  },
  "TnDaYODR2fvHNbrOEnAJ8Q": {
    "date": "2/6/2018",
    "text": "I was very impressed with the variety at lunch which allowed an out of Towner to try a variety of new things. The staff was so very helpful and allowed me to ask questions as I wanted to understand the origin and Ingredients in all this amazing new food. A great quiet spot with a plentiful Buffett and menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LE0h0jx4iJmJXD8HhZ8ZBg"
  },
  "QtvLirsHFkKF8AoOEQuYpQ": {
    "date": "3/24/2017",
    "text": "Excellent buffet.  Fresh tuna/salmon sashimi, crab, mussels, lamb, pad thai, etc.  The only thing it didn't have was beef/steak or oysters...but fantastic nonetheless.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONLog6Ew_66LDp3lWV2wuw"
  },
  "CrzXzT7ysoM9NjQkhbB8RA": {
    "date": "10/2/2014",
    "text": "Recently, my boyfriend and I went to 10 @ Claymore for the dinner buffet. Being a huge foodie and a poor student at the same time, he hardly gets to enjoy quality food in huge quantities - but that night was like a dream come true!Most people cite the seafood section as the main attraction, and I can see why. The lobsters and prawns were cold and sweet, oozing freshness. I don't eat oysters but the boyfriend loved them so much he went for seconds. And you know it's really good if you go for seconds of the same food item at a buffet. The sushi corner was acceptable, with the usual range of maki and sashimi.Another section you ABSOLUTELY CANNOT MISS is the premium beef counter; each person is only allowed 2 servings (additional orders are at about $58...Which is the price of the buffet itself) but it's sooo worth it! The meat literally melts in your mouth. But before trying the premium beef you should order the lamb and \"regular\" beef from the menu given. The menu has 4 dishes which are part of the buffet but you need to order from the waiter who will also serve it to you. Don't know if they change the menu but that night it was char kuay teow, hokkien mee, aussie style beef steak and new zealand lamb steak. ALL SO GOOD. Especially the CKT. Don't worry the portions are small so you can just order them all and ask for seconds if you want. Ok, dessert can be summarized in one word: CREPES. Freshly made, piping hot and generous fillings - nutella and durian, both good - I would have had 2 of each if I hadn't been so full. The chocolate fondue fountain would definitely be a hit with the kids (it brought out the child in me). They have really good ice cream too (take my bf's word for it because i was about to keel over from overeating), the lemongrass flavour is especially nice.To top it all off, they have a coffee and tea counter too. With a barista and a proper machine to make coffee for you. And expensive tea (you know the kind where the bags are hand sewn and pyramid-shaped like five stones). Oh and the service staff are really nice! One waiter ran after me when i forgot my dabao-ed birthday cupcake. All in all, a great experience. If you don't count the buffet aftermath at home.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "jnu4dcBZokzhy3ubJuL_hw"
  },
  "Fgf8O43I4cTw6MdDOfjLAQ": {
    "date": "4/18/2013",
    "text": "For full reviews and pictures, visit my blog!This time, i had the brunch buffet at 10 at Claymore, a modern bistro grill offering a sumptuous collection of contemporary European cuisine, accentuated with some Pacific Seafood touches. Fresh scallops, prawns, Alaskan King Crabs, lobsters and sashimi are available. And i loved the creamy and more substantial Canadian Fanny Bay oysters. Can't say no to the Iberico ham that was the centerpiece display (till i devoured it whole). The cheeses that i love are available as well, and i spotted smoked cheddar and blue cheese too. The Whole Roast Wagyu Bolar Blade has a fine marbling of between 9 to 10 and it was quite juicy despite its dry appearance.  There's quite a variety of Chinese dishes in fact and all are well executed. The Steamed Lotus Rice was fragrant though i wish for it to be more moist. Oh and that Kurobuta Pork should not be missed as well. Organic Plates of Pleasure are available in Apr and May. You would be happy to know that you get unlimited servings of these petite plates and every dish was stellar.  The Organic Pressed Home-Made Dou Fu was silky on the inside and the golden exterior was really aromatic. The green stuff is actually organic spinach which is compressed together with the toufu. Love the light tasting broth which is slightly sweeted by the Pacific Blue Crab.While the Norwegian Wild Salmon in Imperial Bonito-Miso Broth may not have a strong miso taste (i'm comparing it to Nobu's famed Miso Cod), i appreciated the light touch in flavoring, leaving the fish to speak for itself. The perfectly cooked meat gave way to a moist pink centre which was just of the right texture.Our favorite dish was the New Zealand Grass-Fed Beef Tenderloin no doubt. The fork tender medallion had such an amazing texture that i hardly needed to chew on it. Chef Chris explained that the meat is roasted under low temperature (similar to sous vide but in an oven) to break down all the veins typical of grass fed beef. They do it for the lamb rack too. The creamy and starchy Mashed Organic Potato with Truffle was irresistible and Nutty Marmalade Crème was a great complement to the meat.The sweet section was quite extensive as well with many cakes, puddings and more. We had the interesting Lemongrass ice cream from New Zealand that day. I quite enjoyed the bread pudding, as well as the petite mango pudding.Do not give the crepes a miss. We asked for the extra crispy one with Mao Shan Wang Durian topping and it was out of this world. The puree is the real deal and it's a convenient way of eating durian really. Damn i'm missing this already.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "zCirMHPr7McVfn3Ns5GXXQ": {
    "date": "2/24/2013",
    "text": "I have always like 10 at Claymore lunch buffet as being quite value for the dollar, especially when there is credit card \"1 dine free\" promotion, making it either a 25% or 33% discount. I like the clean contemporary design of the place, and being a bit away from the main Orchard road thoroughfare, it is often quiet too. The selection is not huge like other hotel buffets but they are of good quality. Quality over quantity. It has been a couple of years since I last dined there but I always remembered the roast beef as being very nicely done, despite them being placed in the chafing dish. I went last week and was disappointed to know the roast beef was no longer on the menu and the place has been slightly revamped (for the better). There was more Asian dishes this time round.The highlight was the special menu featuring 3 Penang/Malaysian dishes - char kway teow, assam laksa and prawn noodles. Of these, the char kway teow was to die for. The wok hei smell, tender noodles and rich flavor and slight spiciness just teased the senses tremendously. The 2 noodle soups could be better. The prawn noodle broth lacked the strong robustness of a really prawny rich base. The assam laksa soup also had no punch to it. It could do with a stronger assam or hei ko taste to it. There is a pasta station and a grill station now. The grill meat was bbq baby back pork rib and grilled pineapple. That was good. The meat was pretty soft and slid easily off the bone. There was no cold seafood or sashimi but I did not mind. I like the selection of the cold cuts and smoked salmon and rolls/breads with various oils and herb butter. The hot food was decent. I liked the beef stew and sour-tumeric fish (a bit indian style). The Chinese style fish was fresh with firm meat, likewise for the vegetables which were not overcooked and retained a bit of crunch to it. The only negative is the dessert. It is still not as good as other places. It was that way few years back and it is still the same. The bread and butter pudding was interesting as either they used all the danishes in it or just topped it with danishes and croissants. I do not mind going there again, if only for the Penang char kway teow.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "JdrQ5noR-a6rVrgeycXJ4A": {
    "date": "2/27/2013",
    "text": "I was there for my future (Fiance's) niece's birthday celebration. Let me say that I am impressed with the special free flow ala-carte items that you can order on top of the usual buffet spread. The lamb shank was succulent and medium rare steak was really medium rare. Love it! Otherwise, if you are a fan of seafood, you will be happy there too, with the fresh, juicy oysters and decent enough lobsters. There was also so many different types of desserts to go with the meal, my favorite was the crepe- you can put fresh (LOADS AND LOADS of) durian on it. Yums! Oh, the service was awesome too, they gave the birthday girl (and us) a huge cake on the restaurant. Good place to go for family gatherings!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "60S1f9efCHbSp4AxJJnsrA"
  },
  "iWPfuDuXKRU6dUGkrsBArA": {
    "date": "8/19/2012",
    "text": "If you love oysters, then 10 at Claymore is one place you should definitely visit. Besides the variety of oysters, the Boston lobster claws was one of the other item on the menu that had me going there! I love their Penang style prawn noodle that comes with a thick strong prawn stock and the fried kuay teow where you can actually taste the wok hei. But if I had to choose one dish, to be the main highlight, it would have to be their signature Plate of Treasures which showcases 6 of the restaurants best dishes depending on seasonal produce.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "0Uj9p3OOaxMN8AsRWKhVlA": {
    "date": "12/30/2014",
    "text": "We ate here in early December and I'm just getting around to writing this review. I am pretty picky and have eaten all around the world. We made a reservation and were seated right away. Everyone was friendly but one particular gentlemen was super nice and made the meal start off well. We tried everything on the plates of pleasure menu and nothing really stood out for me.  My husband liked the char su noodles and I thought the lamb was the best of the menu. Now to the real good stuff! The seafood was fresh and nicely presented. My favorite was the oysters with horseradish sauce and the fresh cut salmon at the sushi station, just melted in your mouth. My husband loved the tenderloin station and returned many times. Even though tenderloin is not the best cut, they somehow made it melt in your mouth also.  The buffet is small, one of the smallest I've seen but the quality of seafood and meat was excellent. The great service topped off the night giving this place 5 stars from us. I think the meal for 2 adults and our son came out to about $200 which included wine, nice. We've already made reservations for New Year's Day.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "D4LXF8rBJU__DAtiUVGDBg"
  }
}