{
  "rOV4ZJvPnY9v7o3R58uFnQ": {
    "date": "9/23/2016",
    "text": "I would come back here just for the burrata and the wine list, any day.  On the other hand, the amatriciana... not so much (a bit sweet).  Great Fiorentina too.The service is great, and if with a group (6-8 people), the dining table in the cellar is the way to go.  Dining outdoors on the second floor patio is also an option for something different...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "QtA6wOaaPLHn7-Gz7GoPdQ": {
    "date": "5/26/2014",
    "text": "Oso is a stalwart fine dining Italian restaurant in Singapore. I've eaten there a couple of times, on business lunches/dinners or cocktails at the private back room, and I can see why people choose this place. The waiters are unobtrusive, well trained and able to give intelligent recommendations on the spot i.e. ask you whether you prefer pastas, meats or fish and then suggest items based on your preferences. This goes for most of the waiters not just one or the other. The food is consistent and while not entirely creative or home style (which is what sometimes comes to mine with Italian from certain regions), it is executed very well.At my last visit, my host ordered a burrata and cold cuts platter that was huge. I love fresh cheese and a good parma ham so no complaints there. For mains, I had the lamb agnello and it was...just...perfect. I don't think I should even describe it because it wouldn't do the chef justice. At other visits, I've tried the cocktail bites and while they were interesting (I recall a little cone), not all of them were great. I do respect the creativity though because business cocktails tend to involve the crappiest food.Oso definitely goes on my list of safe business lunch places when people ask me for recommendations.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2zbO5Cpuu0svXn3br0T84Q"
  },
  "N0g6k4f6_j5TLS-1oz4fkA": {
    "date": "12/8/2014",
    "text": "Nice place, upstairs in a colonial building.  the ambiance was great.  I was warmly welcomed, and the staff were professional.  Quite popular on a Monday night!we had the Burana (fluffy mozarella) and the cold cuts to start.  very generous and of good quality.pretty good wine list, with a wide selection of Italian wines at varying price points.After we were had our appetizer, the restaurant was getting full and the service was less attentive to our party of two. so they missed the fact that I finished my entree half way through.  Osso Bucco was the choice with truffle risotto.  I asked for a substitute for the potatoes that come with this dish (potatoes with Osso Bucco?), but between the server and the kitchen, that didn't get communicated. I was served two plates.  They didn't get the substitution thing. So i waited 10 minutes to replate my meal.  not happy about that, as my companion had their food while I had none.The risotto was excellent.  the osso bucco was only average.  heavy gravy over it masked the flavor of the veal, which was a little dry. no fork for the marrow was offered.  No obvious presence of vegetables.Maybe for Singapore it was excellent, but not very convincing Italian.So - I give it 3 stars because it purports to be a fine dining establishment and the service was not up to fine dining standards (hello! I stopped eating halfway through my meal!) and the main course was disappointing.Not all bad, but don't expect authentic Italian.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9EDPrivyqcEitUSXgjT_eQ"
  },
  "n19YpW1-63I_ir8lbuL5eA": {
    "date": "7/21/2013",
    "text": "Location:Oso is located in the upper level of a charming colonial era building along a cute mixed-use street on the periphery of Chinatown.   The outdoor balcony area is perfect for enjoying a cigar after your meal.  There is a parking lot 1 minute down the street.  Service:Mixed.  The Italian workers sincerely appreciate exceptional service standards and demonstrate this throughout the night in a non-gushing and meaningful manner.  The quasi-local help was standard fare for Singapore; non-intuitive to say the least, and, albiet unintentionally, bordered on barbaric at times.    Food:Not bad.  The foie gras is acceptable.  Ravioli is excellent.  Goose Comfit is ridiculously dry to the point of being inedible.  Wine selection is impressive for Singapore, and wine by the glass selection is quite ok.  Cheese platter is mediocre.  Tiramisu is slightly above average.  Espresso is quite ok.  Full dinner with wines for two runs in the $300-$500 range.Overall:Great for Singapore...but a mixed bag by western standards.  There are other decent options in the immediate vicinity (Absinthe, etc.)Worth repeating if you choose your mains carefully.  The Italian staff are respectable folks and really understand the subtleties of their business - its certainly worthwhile to solicit their recommendations for your main course.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOvvgD3UhCNSWFzujuVa5g"
  },
  "FA02OLcGBZPM6QIIPH8Nlw": {
    "date": "7/12/2012",
    "text": "The saying goes, \"If one cannot go to Italy, then Italy will come to them\". This is exactly what chef and partner of OSO Ristorante, Diego Chiarini, has done for the lucky and occasionally capricious diners of Singapore. Food : We started off with the Hokkaido scallop carpaccio topped with caviar which was was sweet, juicy and sliced to cubes of equal precision. It was both a visual and gastronomic treat with it's gorgeous harmony of textures and flavours.For those of you watching your waistline, the pasta fresca of vegetarian homemade spinach pappardelle pasta with black truffle sauce was perfectly al dente and every strand was generously coated with black truffles. On the other end of the spectrum, meat lovers would dig the braised veal guancia cheek with Barolo wine and black truffle served with pumpkin which was mouthwateringly tender and extremely tasty. If it weren't for the fact that we had to leave some room for dessert, we certainly would have ordered another portion.Ambience : OSO Ristorante is located in a beautifully renovated shophouse with an open space featuring dark wooden floors and furniture with starched white table clothes and elegant glassware. The restaurant also boasts an excellent selection of Italian wines for every budget and palate to match the equally excellent cuisine.Service : Faultless.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "IqevoNqxmiBBx9gLI7qCxA": {
    "date": "7/15/2012",
    "text": "Great service, very classy decor upstairs, and a bar downstairs for before or after a meal. All these were just the cherry on top.Oso is fabulous, we had a warm tossed salad, mushroom soup, and prosciutto with rock melon to kick start what turned out at the end of the night to be a fantastic meal. The fruitti di mare and risotto were also perfect, al dente and only just slightly resistant to the bite. Desserts were faultless.The best part about Oso is its consistency. It is this good every time I come, which is why I have no qualms about recommending friends to Oso because I know they are guaranteed a good meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "euRUW-O-nOHLETFrXVyEcg": {
    "date": "3/20/2015",
    "text": "The ambience of OSO is excellent, colonial building with high ceiling.  We went for restaurant week and the menu was quite contemporary Italian.  For those that was classic, veal and chocolate crostata were outstanding. We would go back for the a la carte menu.  Great venue for corporate dining and group dining.  It can be a bit noisy for date night unless you sit outside on the balcony.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKzv6PG0p_lsEDFtwyJepA"
  },
  "AwM6HpMG8wr4OasjXrkx9w": {
    "date": "8/12/2012",
    "text": "I haven't had Italian food in a long time (and yes, the pasta that I make at home doesn't count).So I decided to visit this restaurant with my friend after reading the good reviews about this place.We were really delighted with our visit overall; the food was excellent and so is the service.We had the veal shanks, and I found that they were really tasty and tender. My friend had the sea bream, and she too remarked that the fish was really fresh. Being a big eater myself, I was delighted with the ample potions, and honestly, at the end of the meal, neither of us had room for dessert. This is definitely not a \"cheap\" restaurant so to speak, but the prices are still fairly reasonable. For instance, the pasta can be had for $25, but obviously the steaks are going to be quite a bit more expensive. But for the quality and quantity that we got here, I really have no complaints.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wnjh_5SaxBDNZ0YUux8m1w"
  },
  "TSwL1Z11ALTX8DygdN57OA": {
    "date": "11/29/2013",
    "text": "Seems that some people (Midge S) are posting review without having gone to the restaurant (Oso). He/she says that there are restaurants around like absinthe...which moved to boat quay more than 1 year ago !  And that the bill is from 300-500 sgd for 2, whereas I never paid more that 300 (with wine) even during the white truffle season...And putting 2 stars only in Singapore context is quite unfair and misleading. They are obviously worth 4 stars at least just for the service which is quite above average for Singapore standard !",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Aw6Px5kdO11jsJ5uQrD8tw"
  },
  "anFDMmGF-gmSGKFJXde50w": {
    "date": "7/29/2013",
    "text": "One of our favourite places in Singapore and now newly renovated.  Yes, it is expensive and definitely a place for special occasions.  However, the place is worth the money and we like to sit on the balcony.  On Friday and Saturday very crowded and it can take a few minutes until a waiter finds you on the balcony, however, we didn't really mind as we are not in a rush when enjoying great food and wine.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSphcDFYUZW4cDBW7XPjdA"
  },
  "DcJvpa8A1lz1EtdGBO_nRw": {
    "date": "8/5/2012",
    "text": "This quaint little Italian restaurant has wowed diners ever since it first opened its doors, thanks to the specialities such as mixed cold cuts, lamb rack and the wonderful deserts. The service and quality of food it serves is impeccable, though dining on the upper floors can be a little cramp, due to space constraints. The price factor is probably why most diners keep returning as it is very affordable and not overly pricey. Parking along Bukit Pasoh can be a little challenging as well, so remember to be patient. Overall, Oso Ristorante is a good place to begin your foray into the world of Italian food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  }
}