{
  "rwC3LVKtxuWfes6clBZ1zw": {
    "date": "9/30/2016",
    "text": "I really liked this place! Their flavors are a bit more subtle but their open 24/7 so I'm a happy diner. It was clean, the service was prompt and the noodles were delicious. Best of all, there was no wait when we went. The ladies in the front don't really speak English but they speak mandarin. There are pictures near the cashier so you can just point to the picture of the dish you want. We go the bak chor mee, fish ball soup, and a side of fish cake. I liked the noodle texture and the noodle flavoring. As I said before, the flavors were a little more mild but I liked that about their noodles. My boyfriend loved the fish cake there. The fish ball soup was also very tasty. Overall, I would definitely definitely come back. Open 24/7 was also a huge plus! The food is good and the staff is nice! Bonus tip, we walked to the national library of Singapore from here and it wasn't too far. They have a cool gallery in the library and it's totally worth checking out! There are also museums and on the weekend, a cat museum near by. It was by far, my favorite day of exploring in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c8Xa14nPvHHwEjTZwzGSoQ",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. We got the bak chor mee, large size I think. yummy and fresh!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c8Xa14nPvHHwEjTZwzGSoQ/o.jpg"
      },
      {
        "img_id": "hD4RgX1KTQfjo9ULtb-YkQ",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. Side of fish cake! Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hD4RgX1KTQfjo9ULtb-YkQ/o.jpg"
      }
    ],
    "user_id": "bHBlJiNESfIssh4qFUvVPA"
  },
  "sWHdYN7rtlQWZo0xctCinQ": {
    "date": "2/22/2018",
    "text": "Kids: too spicy! Tastes good but it burns. We liked the vegetable balls. Adults: the laksa is incredible - spicy, rich coconut broth with fresh ginger and a lot of seafood. Great value for about $3. Bring your own napkins. Don't look too closely at kitchen for cleanliness and food safety (hence the 3 stars).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h8k435E_lCzNBgBoqrm26w"
  },
  "9NIMTdYrS3P0L30ADntifA": {
    "date": "5/18/2016",
    "text": "A couple of years ago, if you asked what my last meal was, I would've said bak chor mee. Times have changed and so have my tastes (trying to go gluten-free), but I do like to indulge in the dish every now and then. Yesterday, was one such day and Da Lian was totally worth it! Noodles were QQ (al dente and springy), the chilli is really nice and the bowl had a lot of ingredients for $4.50. $5.50 gets you big-ass prawns and for higher prices you can get abalone, mother of pearl (NOT) or some combination of. If you're looking for the more vinegar-y type of bak chor mee or one with lots of pork lard, Da Lian isn't for you. Seating-wise, you can go al fresco (which I did and thoroughly enjoyed). There's also a pretty big space inside which has air-con. What really did it for me though, is that the second floor seems to be one of the offices of the Workers Party! Da Lian forever!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ANp9dL02V29lgp6cXHPDnQ",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. various options you can get, including big ass prawns, more noodles and abalone",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ANp9dL02V29lgp6cXHPDnQ/o.jpg"
      },
      {
        "img_id": "fWMm9Y2fUxmnXFsXSHBOEw",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. the $4.50 noodles.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fWMm9Y2fUxmnXFsXSHBOEw/o.jpg"
      },
      {
        "img_id": "vr5ZjdJleEwD266pw2I7CQ",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. da lian history",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vr5ZjdJleEwD266pw2I7CQ/o.jpg"
      }
    ],
    "user_id": "GQh4KSCygodKKum529q_LA"
  },
  "Iqwz1rZbqkbbMYEPohBJmQ": {
    "date": "11/20/2015",
    "text": "I was trying to hit up Sungei Road Laksa but they were closed that day, so I m just jiving for some noodles and getting hungry.  I was randomly walking by this place and saw it was pretty legit looking, and it had what I was craving for so I stopped and grabbed a seat.  Glad I did because my instinct were spot on, this place had some good stuff.I had the traditional dry noodles, with soup on the side, and a fishball soup as well.  The noodles were al dente, with good textures, and flavors.  The soups were well thought out, not as an afterthought; the meatballs, and fish cake had enough flavor and texture to hold its own.To the SUPER noodle-junkie this might not be \"the spot\" but this place is pretty good",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "E68ZPVpcuWhxvnjq8vTqAA"
  },
  "B10309OcyAuCESl7no3eGA": {
    "date": "5/28/2017",
    "text": "The fish ball noodle is good and the spice taste makes it more flavor and delicious. Must try at midnight because you can see those people who just enjoyed their night life and want to get some food for bringing back to the reality. That is another way to know people lives in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0jR2CsDrDYYaGz3eK8vZBg",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0jR2CsDrDYYaGz3eK8vZBg/o.jpg"
      }
    ],
    "user_id": "wr68eyADJbJkLgZfKoiJhg"
  },
  "gvbHV3SMEGUiWAlSFhSWoA": {
    "date": "5/5/2016",
    "text": "Yum teo chew dish pork with big noodle dry There's outside seating and indoors Tip indoor has ac! Also bring your own napkins!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSfpauSTMuRkxKdMLIg5Ag"
  },
  "l36qjjmqaeVVxMZ6mgY2zQ": {
    "date": "8/27/2016",
    "text": "Fantastic $3.50 steaming hot laksa and moderate portion which was perfect for lunch. Clean and quick service. Plenty of seating both inside and outdoors. Bring your own napkins. Order and pay at the counter and they give you a number. Choose a seat and they will bring over the food. We got here via taxi.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U1fEiz0ilz-3xHuD0zXaaw",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. Laksa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U1fEiz0ilz-3xHuD0zXaaw/o.jpg"
      }
    ],
    "user_id": "PHmkI5GhU_zwBSpYNx1WAA"
  },
  "I2gIObh03ylzLn0F70zXOA": {
    "date": "3/8/2015",
    "text": "Noodle here are tasty, just cooked enough. So far one of the best fish Noodle that I had in Singapore. For 4 S$ you have a more than decent plate of noodle..",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "r7KSQ4cS_HWOv20pPNYl6g",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. Fish Noodle Ball Medium size.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r7KSQ4cS_HWOv20pPNYl6g/o.jpg"
      }
    ],
    "user_id": "ZE3XCREjUICQUD779nHKFg"
  },
  "Mtfp2zLW5ubk9sZy1-ADPg": {
    "date": "2/25/2015",
    "text": "It is not the best bak-chor-mee out there, but it is decent. Service is quick and brisk, but despite asking for vinegar in my noodles, the standard serving still would not have enough of it. Maybe it is the teochew tongue in me that craves more (think Tai Hwa Bak-Chor-Mee at Crawford Lane). So I always end up asking for vinegar at the table and they will bring around a bottle for you to add yourself.Big plus - they are opened 24 hours, in case you have a sudden BCM craving in the middle of the night.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MzN1Taydyr23AHNVbeEaDA",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. $4 Mee pok",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MzN1Taydyr23AHNVbeEaDA/o.jpg"
      },
      {
        "img_id": "V92qLxzPV7JzeY8UREVNzQ",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. $4 bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V92qLxzPV7JzeY8UREVNzQ/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "1VxUVGHqGxdJuAMvX7mTFA": {
    "date": "10/8/2016",
    "text": "If you think that this mee pok is awesome then you need to try out more mee pok places. However, the place has a wide variety of food from bbq chicken wings to satay to laksa But None of those has something to shout about, the only good thing is they open 24/7 and that's about it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrh4_P2QcfN5VB9ObT6Hvw"
  },
  "EJ9KaoUV-THQW9hizzO_Dg": {
    "date": "7/9/2012",
    "text": "Wah lau.These noodles are pretty damn amazing. Bowls start at just $2, and that's a tasty bowl of noodles. Do yourself a favour, and have some chili in your noodles. Oh, the dark, chunky, spicy goodness... Without sounding too chi-chi, it really brings up the flavour to a different level. I've only ever eaten the dry noodles, and almost always in the morning. It's almost like a early morning treat, except it compels you to go back.p.s. you can take touristy photos of an opposition political party headquarters while you're there too!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "GeT3m7sW7F1UAADvELIk0Q",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. The menu - all you need to know",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GeT3m7sW7F1UAADvELIk0Q/o.jpg"
      },
      {
        "img_id": "DDOcHkxdHmK_zFAGMqUf-g",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. Noodle heaven",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DDOcHkxdHmK_zFAGMqUf-g/o.jpg"
      }
    ],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "1g6dCpL-DIKAU9g-rY8ipg": {
    "date": "11/17/2015",
    "text": "There are few things better than sitting at a sidewalk noodleshop in southeast Asia, especially under an awning while it's raining. 4 Types of noodles are all excellent. Try the abalone noodles.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yGgkt0WGJ3P1MDn0eZSTWA"
  },
  "thkBxIH7dDvOlzXqELbtmg": {
    "date": "9/9/2012",
    "text": "This stall dish out pretty delicious noodles and it can get as cheap as $2 if you are early (before 10.30am) but the catch is you have to dine in no takeaway.  Otherwise, the minimum is $3. Many years ago, I saw a customer order dry noodle with dark soya sauce and decided to try and now it has been my personal favorite at this stall. To make the noodles more mouthwatering and delicious, add a dash of their fried chilli into it.  At this eating house, other than the noodles, you can get fish porridge and nasi padang. I haven't tried the fish porridge but love the nasi padang here too.  I think the name of the nasi padang stall is call sofia.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Yd553iWJDLx_VtZMi6P4w",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Yd553iWJDLx_VtZMi6P4w/o.jpg"
      },
      {
        "img_id": "Necp887kAoH7WmtwhOdeJw",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Necp887kAoH7WmtwhOdeJw/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "szlAK8jw5K3jG9baM5vMjA": {
    "date": "8/14/2013",
    "text": "I am not a mee pok expert. I wish I was as this seems to be one of Singapore's quintessential everyman hawker dishes (unlike the sexier chicken rice & chilli crab) but I'll be honest when I say that I find it difficult to distinguish quality between a good mee pok and a great one.I live nearby and decided to try this place out late one night when I was feeling peckish. It had been much hyped online and, having lived in the area for a year, it seemed imperative that I try it.The noodles did not disappoint. Very springy, great chilli and solid pork mince. Is this one of the best mee pok in Singapore? Hard for me to say but at $2-5 a bowl you will not leave feeling dissatisfied.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "41MtZiv6L0dB4S9NdnO6_g"
  },
  "9FLoJyuA_CVRIQEFGl7mHA": {
    "date": "10/15/2014",
    "text": "I haven't found better mee pok in Singapore.The noodles here are springy and properly cooked al dente, the vinegar adds the right touch of contrasting acidity, and the sauce is provided with a judicious sprinkling of crisped lard.  True artisanal mee pok is a dying art in Singapore, this restaurant still carries the flame (or at least, a candle :-)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Ey9euQtugP1kXisGo3Y9A"
  },
  "LpE38MsnflindH7zehM7qQ": {
    "date": "9/9/2012",
    "text": "Chasing the cheapest bowl of mee pok has led me here! After watching a Channel 8 variety show on noodles, I headed down after an ungodly run to send my schooling sisters to school in the far west. You get a bowl for only $2, not too big for the early morning grump and just right for what you can manage at 730am. I've had it as dinner too, and the fishballs, minced pork is just right. Really enjoy the clear soup as well, really old school and nostalgic goodness here!Parking is not much of an issue, you could try parking on the streets and keep a look out, but you didn't hear this from me!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "raKY29o3cqaQYcFdR_bZdg"
  },
  "Ooui9SIdLH0os8ajDevbNg": {
    "date": "11/25/2014",
    "text": "Their chilli is uniquely fried and tasty without being too spicy. Used to come with$2 morning special, just nice for breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1YTwtD7jxIZyjfXTgER4g"
  },
  "vIIBsv79DfKFt6E2L3Smyw": {
    "date": "9/26/2012",
    "text": "like the springy noodles and fresh ingredients. the chilli is pretty spicy, and it's the fried-dry-chilli style.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DfRA3ptEwVamyhS6NwDgIA",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DfRA3ptEwVamyhS6NwDgIA/o.jpg"
      },
      {
        "img_id": "pOuri6gN1s-F1QtAhzRD5g",
        "caption": "Photo of Da Lian Traditional Noodles - Singapore, Singapore. noodles... with springs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pOuri6gN1s-F1QtAhzRD5g/o.jpg"
      }
    ],
    "user_id": "iqPpCHOIN36YtI3Plh7aIw"
  },
  "cOhz7IevKsG_WaSXXyHQCA": {
    "date": "10/4/2012",
    "text": "Not too much to say, other than that these are the best fishball noodles I've had so far in Singapore. I can't really describe what makes them better than other fishball noodles I've tried. It's not the fishballs themselves, since those probably all come from the same factory somewhere that I don't really want to know about.  The noodles just seem fresher, and the sauce is just right. I guess that's about it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ouBdbXdi8_jmXJbgQ5Jq4A"
  }
}