{
  "WItMbfh4KCmAxLTftiMxmg": {
    "date": "2/2/2016",
    "text": "surprised to see such negative reviews here.managed to try a number of items ranging from meringues, lemon tarts,pasta, some egg dish in a group.Yes, its pricey but the standard is there. the pasta was light and fluffy, with great great seasoning. Times like this, I really feel the urge to hug the chef and thank him or her for doing things so impeccably awesome.the lemon tart wasn't overly acidic and had a sweet sour curd that brought a high end to my meal",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "nveUp7lRMiA4_QlV_mJp4w": {
    "date": "9/2/2012",
    "text": "Hailing all the way from mainland France, Paul is a traditional bakery, which opened with much fanfare. But it's easy to see why it's usually packed with customers all day. It serves freshly baked produce like croissants, tarts, pies, breads and éclairs. For those who hate mornings but enjoy breakfast, Paul's Bakery has all day breakfasts too, among other savory bites. The usual teas and coffees are also available to accompany your meal.The price can be on the steep side, so do be prepared to fork out a hefty sum, if you plan on having a feast.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VSQ3hYP6C2rs9M9oi3o7Pg",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VSQ3hYP6C2rs9M9oi3o7Pg/o.jpg"
      }
    ],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "5QHu-q66o28Da3gqLx4zkQ": {
    "date": "8/1/2012",
    "text": "My friend hates it that I affectionately call it LAO PAUL. She thinks it's undeserving of one of the most famous bakeries in Paris. Sigh. How else to express my love?If you've been to Ngee Ann City in the past few months, or have frequented Kinokuniya, Paul is impossible to miss. The eye-catching artisan decor stands out from the modern lines of Takashimaya. According to their spokesperson, \"Everything from the breads to the decor is authentic to the standards set in other Paul bakeries worldwide.\"The food was reasonably tasty, most of their pastries (Millefeuille nature especially) were crusty and not overly sweet. I liked their mini macaroons, so *powerpuff* and noms. If you like pastries with a tinge of sourness, try the fruit tarts. Price is a little steep but within expectations. There are promotional sets such as ALL-DAY-BREAKFAST sets, baker's basket; mostly priced below $10 to make it worth your while. I've been there a few times, service has been good. Once, there was an enthusiastic waiter whom we inquired with on closing hours.Him: It's 10 officially but we stay on till the last customer leaves.Me: What if the customer doesn't leave?! Him: We have our methods.LOL.It's easy to emulate the tai-tai life sitting at Paul's, sipping on chamomile tea. Pretty nice respite in the middle of Orchard Road.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GmdLSjzPc73abhNts-g5dA",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GmdLSjzPc73abhNts-g5dA/o.jpg"
      },
      {
        "img_id": "gDQkSaA76IlXvTUdzu6J1A",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gDQkSaA76IlXvTUdzu6J1A/o.jpg"
      },
      {
        "img_id": "6AljW8-Wrg1VfB2f9vg6qQ",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6AljW8-Wrg1VfB2f9vg6qQ/o.jpg"
      }
    ],
    "user_id": "1wWXchH7yRlFCxfC4dkQnA"
  },
  "3nD5LVxLL-_hjpa7g_bAPg": {
    "date": "2/23/2014",
    "text": "I hope they'll work to improve the quality of service.  After seeing long queues on previous visits to the mall, we were happy to be seated immediately.  As other reviewers have noted, the service here is spotty.  My friend and I each ordered an entree.  His Salade Nicoise arrived immediately but there was an additional 12 min wait for my Tartine Boeuf to be delivered.  This type of delay is a common problem in lower quality Singapore restaurants and there's no excuse for it other than managers who do not train their staffs to western standards.  In western cultures, it's rude to begin eating until everyone has been served.  All western style restaurants in Singapore need to institute a system in which no entrees are delivered to a table until all entrees are ready in the kitchen.   Then all entrees are delivered at the same time.  This is not a difficult system to implement.This is the result of service by committee when one waiter is not assigned to a table.  The committee of servers are not insuring the overall guest experience - instead they are blindly taking orders and then delivering the food when it appears in the kitchen window.  No one takes ownership of the table.While waiting for my food, servers tried to give me 3 other entrees which belonged to nearby tables.  US restaurants use a numbering system that assigns each table and seat a number.   When the item leaves the kitchen the server knows to precisely deliver it to Table 12, Position 2.  This eliminates the need for the waiter to \"auction\" the plate at the table.  For me, this is the clear separating line between the amateurs and the professionally run restaurants.My Tartine Boeuf was delicious, but I can't make sense of the $7.50 lemon ice tea that was nothing special.  Usually when you pay so much for an iced tea, there is a simple syrup offered for sweetening.  My friend says his Salade Nicoise was bland with not enough dressing.  (I had 12 minutes to look at it and it looked bland) The Good:  My Tartine Boef was delicious.  The two take away bakery items (chocolate torte and elclair) were also good.The Bad:  1. Servers who don't know the correct pronunciations of the french dishes, 2. A system that does not guarantee that all entrees are delivered to a table at the same time.  Of course a salad takes less time to prepare.  Don't deliver it until the longer prep items are ready.  Managers - this is not rocket science!!3 Servers who \"auction\" the wrong entrees to you unsure of who the food belongs to.  Again, this is easily resolved with a numbering system - using both the table and seat number.  An international clientele in a restaurant that offers a supposedly \"upscale\" experience deserves better.4. Some tables are so close together that you feel like you're dining with strangers.5.Bland salad, $7.50 iced tea??!!  No syrup.Total for 2 entrees and 2 beverages: $60+The Verdict: The 10 min+ wait between entrees being delivered is the deal breaker. The prices are too high for such amateur service.  Will not be returning",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLyCfP11oClvrpGN-enPew"
  },
  "dOOhT3stUJDD_fqxyim0Dw": {
    "date": "8/5/2015",
    "text": "Nice food but terrible service verging on rude.  We were told at the counter we could sit down at the restaurant and they would bring us the counter food we wanted to eat.  Unfortunately for us we missed the sign asking us to wait to be seated and went in taking a seat close to the food counter.  No welcome from the waitress who instead took her time coming to serve us and then muttered under her breath that we should go back and queue up at the entry - despite there being many free tables and no-one waiting outside (inflexible protocol?).  She finally relented to serve us although didn't know what a ginger beer was (her unhelpful reply was that they don't serve alcohol - rather than to explain what they did have).  The baguette we ordered came out and as we started to eat they started trying to take the plate away saying they weren't allowed to serve it that way!  We finally understood that it was supposed to come with a side salad but by then we were so annoyed we said we'd eat it as is.  The baguette was good - similar to the ones we know from Paul's in Paris but the service was so disappointing we wouldn't be back.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SPEXq0LLeY_Tj2ySi1QT3w",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SPEXq0LLeY_Tj2ySi1QT3w/o.jpg"
      }
    ],
    "user_id": "g_uQlF4OzrkXnePWue2zYw"
  },
  "L8VdWW8eA-4qksmOWm-Z5g": {
    "date": "12/8/2012",
    "text": "The great baked goods doesn't overshadow the garbage service at this place.   \"Sorry sir that section is closed\" when I asked if it would open in five minutes I was given the laugh and shrug, sure enough it was open.  The baked goods are delicious but the other cooked food is ok, and the service is pretty garbage.  After months of being open, they can't seem to be flexible enough to seat a party over 2 people in under 10 minutes-even when there are tables open.  All the small details you expect with your order, fresh butter and jam, are left in the kitchen with any smiles from the waitstaff  Try going earlier and the service is just as bad, but not as crowded.  Lunchtime-I imagine if the owners knew how much business they turned off or turned away they would actually invest in training their waitstaff.  Everyone working there seems pretty miserable.  Next time, I'll pass - I heard the new french bakery in Wisma is nice.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ia8Z8ds7TI63RDLQ4WYrwQ"
  },
  "9QicyJA3GgtL_gr_OVnWlA": {
    "date": "9/18/2012",
    "text": "I used to go to Paul, when I lived in Dubai and occasionally craved a boulangerie (the other options were terrible). It was okay, there.Here, it's also okay. But not as good as it can be. I suppose when things get this commercialized, you lose the charm and personality that you once had. There's not that much to shout about.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ml61UOrHtdUCwW0JcTM_Vg"
  },
  "cIZQkeC5V6YdMTi5fFjnfw": {
    "date": "3/6/2013",
    "text": "How dare they not have a chausson au pommes? They are good though, especially the berry tartes.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "dvFxADOBExG8QRKKzr7NeQ": {
    "date": "11/25/2012",
    "text": "Have you been caught in the \"waiting\" glitch? And when I mentioned Paul Bakery, what is the first thing that comes to mind? Nope, not the fresh loaves loved by some, nor the bewitching patisseries they offer. It is the less celebrated service standards experienced by many. Not sure if I was in luck, I have had enjoyed good hospitality which I have reviewed earlier. While many were overjoyed at its opening, Paul was plagued by unhappy voices. They have been drawing big crowds since the day they opened, which I have never doubt. Despite the lapsed in service, I am still seeing people making beeline at its entrance after peak hours. The main dining hall was bustling with high tea enthusiasts - conversations echoing the room. J suggested we take one of the tables outside the restaurant for a quieter time, much to what I agreed. We managed to get one with the help of a waiter - polite (checked). Without spilt seconds, another waiter came with 2 sets of menu and giving us ample time to decide (checked).I hold the menu in my hand with great anticipation. Unmistakably, it was given a face-lift with a range of newer creation - still the French classics but now, some with a local twist. New faces includes specialty sandwiches: Pan Bagnat Club (S$16.90); open sandwiches: Salade Crevettes Mangue (S$19.90), Croque Truffade (S$19.90) - a simple toast topped with cheddar cheese, Béchamel sauce, truffles & mushrooms which most suits anyone with a less complicated desire. Then comes the Haute dishes: Hachis Parmentier (S$23.90) - a dish of minced beef/chicken mixed in buttery pureed potatoes and tossed with onions & herbs. This time, a young lady dropped by to see if we are ready to order which I requested she check on us after a minute which she did so accordingly (checked). During the wait for the meal, glasses of water are served and refilled automatically (checked).I am most curious to examine this new open sandwich to see if it is capable of spicing up my day. Having learned that the concoction took the team months to perfect, I am hoping that it passed the mark remarkably. Served with a handful of crisp seasonal side greens, this Tartine Poulet Curry (S$17.90) comes with a unique flavor rarely seen in a French bistro. Making a bold change to the regular Poulet Citron in the previous menu; this one has a nice but mild spicy marination. Though I find the coarsely chopped chicken meat a bit chewy and dry, the spices did distract my attention from the less attractive bird. The curry jelled quite well with the cheddar along with the crunchy diced zucchini and tomato, of which, the mass emits a strong and lingering flavor in each mouthful. Overall, the combination is a success for its balanced flavor, without a fierce domination. I was told that it has been well-received by many non-locals for its subtle curry taste. While it tasted good, I feel that the Campagne bread needs less toasting time, to avoid having a hard and edgy crust that bruised my gums. If you ever spotted me tearing - the underlying cause is not the curry, sure thing. But what warms me, is the hospitality that comes from the heart. This has never occurred nor I heard from others who have dined at Paul in the past, but today, I am having waitress coming up to me, asking if the food tastes good (checked).J was seen enjoying the Pan Bagnat Niçoise (S$16.90) - a specialty sandwich made with Pain de Mie bread using tuna mayonnaise topped with rings of red onion, tomatoes and piling up high with fresh salad leaves and slices of boiled eggs. The burger appeared in its clean defining look, not a messy setup like a drenched American version. Accordingly, it pleases J who is won over by its fresh texture and natural taste, less obscuring. We selfishly eat our own dish, each singing in approval. We have nothing to complain about, if anything, it has to be the dessert.Prominently pictured under the dessert section, I refused to flip the page, trying to nail down one Pandan treats. J gave a good laugh and left me with the decision rights. Should I point to my left or allow it to swift to the right, my eye ball swinging in pendulum. I had wanted a Pandan eclair but wish badly for the Pandan Millefeuille. J saved me from that ripping agony, chose the French puff pastry on my behalf. In less 5 minute, the Napoleon dessert arrived. My first impression - terrified. I felt intimidated by its unnatural green hue, the icing fondant has been awkwardly fabricated - simply a vanilla glaze. It left me wondering if the dish descriptions in the newspaper are reported correctly - the recipe has a Pandan-infused paste? Erm, we didn't taste any Pandan flavor throughout, but a stronger gula melaka (palm sugar) custard cream, much to our enjoyment. I liked the puff pastry for its light, crumbly texture though not ultra flaky and stacked up with a thick layer of creamy paste in the middle. The cream is smooth but slightly over-candied and a bit weighed down.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p154ltl-W2mpAQnFGCL7sQ",
        "caption": "Photo of Paul - Singapore, Singapore. Pan Bagnat Nicoise (S$16.90) - a specialty sandwich made with Pain de Mie bread using tuna mayonnaise topped with red onions.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p154ltl-W2mpAQnFGCL7sQ/o.jpg"
      },
      {
        "img_id": "GitVleyPiajMmP-3sPi5wQ",
        "caption": "Photo of Paul - Singapore, Singapore. Pandan Millefeuille",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GitVleyPiajMmP-3sPi5wQ/o.jpg"
      },
      {
        "img_id": "vpDYpY9wet2oEH0Bj9E4aw",
        "caption": "Photo of Paul - Singapore, Singapore. Tartine Poulet Curry - a new open-face sandwich. Mellow in taste, no tearing. Not too bad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vpDYpY9wet2oEH0Bj9E4aw/o.jpg"
      }
    ],
    "user_id": "IIVTHna4vd7EOJJTKaS5uw"
  },
  "OGPbxvezoK66yRDIyWwzsg": {
    "date": "9/16/2012",
    "text": "Tried two of their famous pastries (the millefueille and one of the chocolate cake) as recommended by the waitress and they are both too sweet. The coffee is also too weak for my liking.Wasn't worth the wait, wasn't worth the price, wasn't worth the hype.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "CoD10N-DlfisPcbORVB76Q": {
    "date": "3/24/2013",
    "text": "I'm not sure what the hype is all about1) Service was terrible. They were so disorganized getting ppl seated. Ppl were standing in line for 30-45 mins for no apparent reason- there were plenty of open tables at any one time. I almost sat myself2) Macarons were OK. In a country where ppl are avid travelers and have dined in Paris/ France/ Europe on authenitic macarons, i'm not sure why they're passing off these good but not great cookies as macarons3) Over-priced.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lCmvpQfFpdxhbWVM59eUCg"
  },
  "dNwtE6ExQfOPDYRnmMGkTw": {
    "date": "10/4/2014",
    "text": "This place is overrated.. Expensive bread, you can get the same or even better ones at stores in the basement.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXy4m5JDEegBLk5x9aiViQ"
  },
  "uCqgyoAKZfHDgO25Y56C4Q": {
    "date": "9/8/2012",
    "text": "Having tried the famous and amazing Paul patisserie in Paris, I was elated about the news of the opening of Paul Bakery at Ngee Ann City. Sipping a hot cup of coffee and biting into a warm butter croissant on a chilly winter day in Paris was the most memorable experience and I thought I could relive it here in Singapore at Paul Bakery. Although the seating was really cramped, the interior of Paul did remind me of Parisian patisseries. The chandeliers, French paintings and even the waitresses in white chef hats really simulate the setting of French restaurants. Food-wise, there were a few hits and misses. The highly recommended Chocolate Mellefeuille was a let down because the pastry was not crispy but limp instead. The chocolate flavor was good though, rich and not overly-sweet. The Praline Macaron was great, crusty on the outside and filled with creamy rich praline. The Caneles have a really good texture as well. The service was slow, probably because they were short of staff. It was difficult getting the attention of the waitstaff and the food took pretty long to arrive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "zyCb_GodLq3JkBbduI9ynw": {
    "date": "8/15/2012",
    "text": "This is a review on the takeaway counter of Paul. I havent actually had a sit down lunch/dinner/breakfast at Paul but i have frequented their take away counter on numerous occasions. First of all the staff is really friendly. There are very knowedgeable and accomdating and are always smiling. The best thing here are the crossaints. Especially when they are still warm and out of the oven. Incomparable to a place like Delifrance, they are flaky, chewy and super buttery. I like the mini crossaints and pastries that they have. They also have beautiful french pastries and sandwhiches. I had a crossaint from the Paul at the Paris airport, and i honestly thought the crossaints in the Singapore Paul were way better!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FhJMaVNVxRS9WyxbG5XoPg",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FhJMaVNVxRS9WyxbG5XoPg/o.jpg"
      }
    ],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "iwNngcVhsUeYUSuVxk6N1w": {
    "date": "9/19/2015",
    "text": "Just sat down for coffee and desserts, service is horrible. Had to wait for 30minutes for coffee and macaroon. No matter how good the food is, will never come back to this branch.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lspI11sG9XysrJYkODdW6A"
  },
  "rEPq6kOyjUu8AtbgtV_v0w": {
    "date": "10/11/2012",
    "text": "CHOCOLATE BEIGNET ..... hellza GOOOOOOOOOOOD.  It's like having donut filled with NUTELLA.  Can't go wrong.  Please have it back soon again!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LDxGB8GDYZ71AY1qHQt_Rg"
  },
  "z8KiUC4HVY_cjxUHbhBBdA": {
    "date": "9/15/2012",
    "text": "go there for the mini croissants (or big plain croissants), and palmierre. everything else is quite terrible.the listing here says they open at 8:30 am. is that right? i've been there at 10 am where they had no croissants yet.the service over the take-away counter was pretty good ...i went there and they forgot to give me an \"apple donut\" that i already paid for. i went back in the evening, and they gave it to me, no questions asked...even though i didn't have my receipt, and i was dealing with an entirely different staff. kudos to the staff for that.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PS0uGpc0Cwx40hMk6zolag"
  },
  "uYadcMhuEsKaBvxFQ0wkfg": {
    "date": "8/5/2012",
    "text": "The world renowned bakery from France has finally made in-roads into our local scene with a 3,000sq ft restaurant and bakery that is set to whet appetites. At this point of time though, with the number of visits I've made, the standard of the breads are not really consistent as compared to the ones at Maison Kayser. However, on their good days, the croissants and baguettes are simply a delight to have. One of the must try items at the restaurant are the breakfast sets which many people don't know about. While they seem simple, Paul does it supremely well and at a far more affordable price compared to other places.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "tjSXzBkMoi4g8KONt0LRiQ": {
    "date": "11/10/2012",
    "text": "Went for coffee and a late afternoon snack. I got the crepes and Sehr got the croque truffe. The food was really excellent. But the coffee, inattentive services, prices etc. were less so. But based on the food alone I'm looking forward to a second visit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqPwUUb4sovYaJvFI5I2wA"
  },
  "S244eZZNOypYf-O6nDI5Fw": {
    "date": "7/20/2018",
    "text": "The food and setting is ok , but quite frankly the service is disgraceful. The staff are rude. Would never go back",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KBvyE8DkAB4DnFkNPFNbw"
  },
  "oGxf-MHU3KAMWwS4nNHYFA": {
    "date": "8/20/2016",
    "text": "From Paul in France,1889Stopped for a while at a bistro table outside, roped off and inside shopping center.  I queued and ordered inside and then told them I'm eating at site.I wish I had had room to try more, but after my idli breakfast, it wasn't going to happen!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "kNblAbgsdPVgVSTdlMjQQA",
        "caption": "Photo of Paul - Singapore, Singapore. My treat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kNblAbgsdPVgVSTdlMjQQA/o.jpg"
      },
      {
        "img_id": "pE9OGRKwMyRFI37Zmmfdwg",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pE9OGRKwMyRFI37Zmmfdwg/o.jpg"
      },
      {
        "img_id": "CTHHoxrRY1aJw4-Jl3EkYA",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CTHHoxrRY1aJw4-Jl3EkYA/o.jpg"
      }
    ],
    "user_id": "g3HFkZgloxLQCvoJ5Zs5gg"
  },
  "YK8TVlf-2zCgQ-bdiif0Kw": {
    "date": "7/24/2016",
    "text": "I love Paul when I was traveling to London and Paris. There were many outlets in London and I loved buying pastries from there when I was visiting my brother who was working there. Paul in Paris was magnifique too! These were all before Singapore has its own Paul located at Ngee Ann City. The ambience at Paul Singapore is entirely different than those in Europe. I like the warm cozy feelings I had experienced at Paul in London or Paris which unfortunately did not happened here. It was not bad here, just different. Few weeks back I had breakfast at Paul with my friend whom I used to go to school with. I opted the Petit déjeuner chocolat set ($9.50) and I chose to have a Au pain du chocolat and a cup of chocolat viennois. Both were really good. Finally I got to have a decent hot chocolate beverage after having a bad one here at Starbucks in Singapore. Service was good too. I just wish more thoughts to be placed in the design of the menu. A bit cheap looking to me.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "owD_RVA6gOA9LpmjXUwhUw",
        "caption": "Photo of Paul - Singapore, Singapore. Chocolat viennois",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/owD_RVA6gOA9LpmjXUwhUw/o.jpg"
      },
      {
        "img_id": "CkozjZ8zOZUJZ-DnA-rTBg",
        "caption": "Photo of Paul - Singapore, Singapore. Au pain du chocolat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CkozjZ8zOZUJZ-DnA-rTBg/o.jpg"
      },
      {
        "img_id": "UcE_zR8P364L0nfK0PGjyw",
        "caption": "Photo of Paul - Singapore, Singapore. Paul",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UcE_zR8P364L0nfK0PGjyw/o.jpg"
      }
    ],
    "user_id": "0V_C2aOTDKuR8CO3P3RvJw"
  },
  "G3a7Kmlfw8XtOjoiYZb2_g": {
    "date": "11/3/2017",
    "text": "Service was appalling. They had FIVE staffs. I repeat, 5. I made eye contact with 2 Indian waiters that were nearby. I could tell that they KNEW I was looking at them, but 1 of them chose to serve another guest 2 tables away who were all Caucasians. That table didn't even ask for any service. The other younger Indian guy, who was talking to his friend earlier, pretended to be busy when his friend left. He continued to tidy a table for 5min with his BACK TURNED away from me. He then walked out of the shop for 2min for god knows what reason. How blatant! Fine by me if you'd prefer to serve a caucasion male over a young Chinese female. If you want to bring your culture and serve only older white Males, then Singapore is not a place for you.  That aside, kudos to the other two waitress, one of the Indian waitress was busy earlier, but approached me thereafter when she was done serving. Thank youUPDATES:the young Indian guy just keeps hanging around the cashier doing nothing on a Sunday .  To the boss, you're making a loss hiring him. And to the other Indian waiter with beard, your smug attitude won't get you anywhere in life.Only managed to take a pic of the smug waiter, not the younger one.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dn72jYVhlG2h9QtnKUaLJQ",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dn72jYVhlG2h9QtnKUaLJQ/o.jpg"
      }
    ],
    "user_id": "qxYlmpV9QLgAlLLzcOnL3Q"
  },
  "YjA7FkRtrruRjwPV5QUjng": {
    "date": "10/27/2015",
    "text": "Heard so much about this place for quite a while now and finally decided to try it this afternoon (was at Ngee Ann City & feeling very hungry in the late afternoon). Got a window seat which is good.Ordered a Crepe D'orange & a beetroot juice:- Service was alright. Quite attentive, asking whether I want warm or cold water, & whether I want ice cubes with my juice. - Beetroot juice was ok though pricey. Guess it comes with the territory as Paul Bakery is situated  strategically at one of the most prominent shopping malls in SG.- Crepe D'orange is no ordinary crepe as its the most sorry looking crepe I have eaten in my life .. Just 1 strawberry split into quarters. I was utterly shocked that they served it in this manner. The crepe itself was quite tasty, so in a way, it redeemed itself a bit.All in all, I'm disappointed with the eatery, and will think twice to go back there again. Maybe, just maybe, I may try their breads to see whether they are any good.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9Gfv3fM5EXWUm4qj3vyqEA",
        "caption": "Photo of Paul - Singapore, Singapore. Crepe D'orange with strawberries - 3/10 overall. I give it a 1/10 for the sorry looking strawberry. Crepe was ok, it gets 6/10.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9Gfv3fM5EXWUm4qj3vyqEA/o.jpg"
      }
    ],
    "user_id": "0DcUFh4oG2IlBGOj9KcjVQ"
  },
  "-6Ej-A748XzhSPXtm4E_Bg": {
    "date": "9/2/2017",
    "text": "Nice place and decor. Relaxed atmosphere. However, staff is not very attentive - no cutleries, courses including ice-cream was served at the same time as main course, food was served before drinks, ice-water served only upon request. Quality of food - 6/10. Croissant served cold - not warmed up. Staff rather inexperience but polite. Politeness: 7/10.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oO4lt0tHN81eQ7ZWKfI5Pw",
        "caption": "Photo of Paul - Singapore, Singapore. Crepe Champignons | Emmental cheese, sauteed mushrooms and shallots and Champignons Au Beurre Ey Persil",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oO4lt0tHN81eQ7ZWKfI5Pw/o.jpg"
      }
    ],
    "user_id": "Ccp18w8Ljnv7uSwW3HGORA"
  },
  "iVWvcmuLPugYlgtaltnlpQ": {
    "date": "10/1/2016",
    "text": "it was dessert vs. real food and the real food won because i was just too hungry. i opted for the Salmon Croque-monsieur. if you are a cheese lover you will love this one for sure. the cheese was fried to a crisp and the salmon compliments it so well. I believe I will order this same dish again when I do visit Paul again. The waffle dessert at the next table caught my eye. I must return to give that a try. I would say all their desserts are well priced and especially delicious looking.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zu89dJq1mZ5B70xREhJWTw",
        "caption": "Photo of Paul - Singapore, Singapore. Salmon croque",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zu89dJq1mZ5B70xREhJWTw/o.jpg"
      }
    ],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "LoKBoA8GQKOrh4AQTWyklQ": {
    "date": "11/23/2016",
    "text": "Not my best Paul experience service wise, I'm sad to report. The server was slow to get around to helping us out and then seemed impatient while taking our orders.On the other hand, we ordered really delicious breakfast and felt like $50 for 4 breakfasts, fresh orange/carrot/ginger juice, pastry and coffee was not bad at all. What a bargain. The food made up for the lack of service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mU8QXYu0MrEUbAIDnrqdAQ"
  },
  "ungl1Ufq3UDfEZxLcQ1TvA": {
    "date": "4/7/2017",
    "text": "I have been to this bakery bistro twice now and I have to say that I have not been impressed. They always say to give the good feedback first, so here goes - the ambiance is quite nice with its Parisian feel and decor. The service is passable but lacks any warmth. Now, my biggest complaint is the poor quality of coffee and pastry. After a hectic day of shopping, I just wanted to sit down and get a nice hit of caffeine. But I really can't get pass the weak coffee that tastes so diluted. Tried the blueberry and chocolate tarts - crust is too thick and hard and the filling is nothing to write home about. All in all, I don't think I will be making a third trip back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hisPCJXs3zOPJLOVeHvI0A",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hisPCJXs3zOPJLOVeHvI0A/o.jpg"
      }
    ],
    "user_id": "ZmZk86ubu7Kt7HZ5Gn_8xw"
  },
  "e_LsFQcVQPlgZporKr5vkA": {
    "date": "11/4/2017",
    "text": "We arrived with 2 kids, so needed a table of four.  We walked past an empty table that's just near the outside takeaway section and proceeded to queue up.Told the person we needed a table for four, and she smiled - good sign.  And we waited patiently, assuming that empty table must have been reserved.Time passed and Sok. The front staff cane back to ask how many seats we needed - the same one we told we needed a table for four, sigh.  My wife had had enough by now and just plainly asked if we can sit at the empty table.  The front staff looked a little confused, checked and then came told us it was available!  Wonder how long we would have waited if we weren't proactive.  Food was average.  Took an extremely long time to arrive.But worst was the service.  Staff were polite but doesn't work to make the dining experience a worthwhile one.I wouldn't recommend coming to dine in.  Perhaps take away, but save some heartache  and skip the dine in experience :-(",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5wGDnWW27WHPeHivWCtAA"
  },
  "0Gbt9swgSpQA5H7FJ3M3tw": {
    "date": "6/18/2015",
    "text": "The funny thing about this place it is actually better than ARtisan Boulangerie at 112.  Surprisingly the lemon is cheaper here and taste far better.  Service was efficient and yes!!! A hot cup of cuppacino....sorry still having trauma lapse from ABC over their Luke warm coffee.Another good point raised by the service staff.  Don't buy your croissant on your final bill as that will add the GST and service charge :).  Attentive staff i say....",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "s74rad11vMjUwQffHzcErQ",
        "caption": "Photo of Paul - Singapore, Singapore. Le Bill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s74rad11vMjUwQffHzcErQ/o.jpg"
      },
      {
        "img_id": "FgkGUd6EdWAzIup8ZdydOg",
        "caption": "Photo of Paul - Singapore, Singapore. Choc Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FgkGUd6EdWAzIup8ZdydOg/o.jpg"
      },
      {
        "img_id": "8miYj_A3BGUMrF1azXUDGw",
        "caption": "Photo of Paul - Singapore, Singapore. Lemon Tart - Nice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8miYj_A3BGUMrF1azXUDGw/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "c6ES7AWPYaM4-oUw__uEeg": {
    "date": "11/22/2014",
    "text": "The repertoire of 26 new dishes include hearty salads like the Salad de la Mer ($20.90++), a seafood salad that would make an ideal satisfying light lunch option with plump shrimps, mussels, octopus and creamy avocados. The zesty grapefruit and in house french dressing lends the greens a bright zesty flavour that resonates with me. Both main courses reflected the simplicity of French cooking and natural flavours of fresh, seasonal ingredients. The Longe de thon ($29.90++) was essentially a long steak of seared tuna whose core remained pinkish and tender, adorned with white sesame seeds. Magnificent in its own right, the fish fell out of sync with the sweet cranberry sauce and the side of tangy roasted seasonal vegetables, which were so appetizing that they could possibly steal the limelight of the plate. On the other hand, the Confit de Canard ($28.90++) may be an old-fashioned French classic but never fails to please the palates. Rubbed with herbs and cured in duck fat for one day before slow-roasted for 4 hours, the unctuous duck meat, albeit tad salty, streaked off the bones in strands.It might be quite a distinct version from most of the crispy-skinned versions here but the duck is fragrantly meaty and not greasy. The same side dish of roasted vegetables did complement the duck but perhaps pairing it with some chestnut velouté with mushrooms may inject some variety? New iced teas like the Rosemary lime or Lemongrass Ginger were great options to refresh the palates and get one ready for desserts. However what piqued my curiosity was the beguiling Macaron Drink ($9.50++) shown below. Available also in Raspberry, Vanilla and Chocolate, I opted for the Pistachio flavour. Predictably a sweet maestro of pistachio macarons speedily whizzed to gritty bits with milk, it turned out to be less sugary than the original macarons, tempered to a balanced creaminess with a characteristic texture. Leaning gingerly against one another, the golden Waffles ($13.90++), as sturdy as the Pyramids of Egypt, were understandably more similar to the light crunchy Brussels waffles than the dense, chewy Liege waffles. Yet too much of a good thing may warrant a concern to oral pleasure as these square parcels were rather rigid inside-out.   Above all, I am heartened that Paul stays true to its boulangerie roots and delivers the promised quality in their forte areas, the bread. Out of all the new dishes I've tried, the Tartine Boeuf ($19.90++) secured a special place in my heart. A touch of herb cream cheese, hints of tart balsamic vinegar and a smattering of soft caramelized onions on succulent sirloin steak is all it takes to bring the humble countryside bread a whole new level. Even the starter basket of crusty baguette (below) sprung to life with just a slight dollop of its creamy unsalted artisan French butter.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QzJIZF_6q2bHm1zKXfBRaA",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QzJIZF_6q2bHm1zKXfBRaA/o.jpg"
      },
      {
        "img_id": "otPf9ZpxeZXj-NYuGRn9kw",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/otPf9ZpxeZXj-NYuGRn9kw/o.jpg"
      },
      {
        "img_id": "VCVw-SIndgqJcc-283MIew",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VCVw-SIndgqJcc-283MIew/o.jpg"
      }
    ],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "DqCYFh5pHpl4rV-CLxh_UQ": {
    "date": "4/16/2016",
    "text": "This place was such a let down. It may look pretty on the outside but the food was wayy overpriced in my opinion and it honestly wasn't anything spectacular. I had the scrambled eggs with sausages and mushroom breakfast thingy for $9.80 and a cup of hot chocolate. Hot chocolate was bitter and disappointing. The eggs were alright. They didn't have any sandwiches when I was there (11am ish) and I was pretty disappointed by that. Furthermore, the staff were really unfriendly.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kYplHDg9iYqLOU2-NLsNow"
  },
  "4hgfPjr4sQMbaJ5AnboEdA": {
    "date": "2/6/2016",
    "text": "Pretty overrated. Service in particular very poor.  Staff very skilled at looking off in the distance - past customers trying to get service.  I ordered tartine boeuf.  They brought tartine poulet.  When I pointed this out the waiter insisted it was beef then ran away.  I had to pull out the photo menu to make the case to his colleague once I was able to get her attention that it was chicken.  Maybe short staffed on the eve before Chinese new year?  Maybe the staff here are disgruntled they are having to work?  My food finally came only after the rest of my family had finished theirs.  At that only after I asked for help from the manager.  Who produced my plate and then scuttled away.  Two stars only because the tartine was good.  Otherwise a solidly one star experience.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GRpxC3cP8-XRFjuYc_KvEQ",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GRpxC3cP8-XRFjuYc_KvEQ/o.jpg"
      }
    ],
    "user_id": "7pLOSzJCFtSTjvavmjgHLQ"
  },
  "EHKmYJuwe7gYIUyI78-pDw": {
    "date": "7/20/2015",
    "text": "Hmm, the food is good, the atmosphere is nice, even the \"outdoor\" seating, but the service and policies really bring it down, I'd give this 2.5 stars if I could.This a popular restaurant and the long queue waiting to get seated shows that, it also calls out for a better managed system, maybe a waiting list and SMS when there is an available table, something better. There is also a take away counter, like a traditional bakery with many tasty items calling out to be taken home. This take away counter presents another odd policy/system that should be better thought out. There are items at the take away counter that aren't on the menu, and you can't order them if you are dining in. This is such an odd decision, it is the same restaurant/kitchen the food is already prepared, sell the item for a dollar more and laugh all the way to the bank; yet they would not serve it. Speaking of serving items, our drinks arrived much after our food, and many follow up requests, even a freshly baked waffle came before Ice Lemon Tea. Even the second round of tea took so long to arrive, very disappointing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mf5MvpjFPizQoD0st55BGQ",
        "caption": "Photo of Paul - Singapore, Singapore. The lovely takeaway area, many tasty delights for a next day's breakfast.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mf5MvpjFPizQoD0st55BGQ/o.jpg"
      }
    ],
    "user_id": "_DDTeIubkh7QcgMQgcVn6A"
  },
  "Cnst4LLiAFF8fjuCftC31w": {
    "date": "3/6/2013",
    "text": "I honestly wished I have nicer things to say about Paul Bakery.For starters, I loved most part of the service I got at Paul's. Had a delightful lady and gentleman serving and they looked like the genuinely loved what they're doing which -always- make for a nice touch. I just wished I got their names! Paul is constantly loaded with people so be prepared for a bit of a wait, try not to let that dent your mood. Also try not to go with too much of an expectation.My friend got a breakfast set while I had the crepes. They were nothing to write home to and with the choices you get in SG now, I hardly think just doing the basic works. Also, I hardly feel that way, but the quality of the food made me feel that it was really overpriced.I was genuinely looking forward to trying the desserts since Paul is famed for their bakes. Am a little disappointed to report that both options I picked - lemon meringue tart and another pastry - were lacklustre. Moral of the story - listen to your foodie friends when they tell you not to bother with a place.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iyphQy2umle188Dy5HHO1w",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iyphQy2umle188Dy5HHO1w/o.jpg"
      },
      {
        "img_id": "GLOIECXiwdX1bbJL_IaGcQ",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GLOIECXiwdX1bbJL_IaGcQ/o.jpg"
      },
      {
        "img_id": "bGCWfhQ2m1KwWLdd4XLWfg",
        "caption": "Photo of Paul - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bGCWfhQ2m1KwWLdd4XLWfg/o.jpg"
      }
    ],
    "user_id": "W8vFfu8VMe9EAhDcphjDuQ"
  },
  "ay2Hczl4WQEt0BcC3ZSZyA": {
    "date": "9/13/2014",
    "text": "I love Paul ...at Tanglin Mall! This location here in Takashimaya has the worst staff. Ever!  There is a line, when inside half of the tables are empty. When you call to place you order, it looks like they are making you a favor.  And good luck if are with a stroller!  Two star instead if one, because the good is still great. Won't be back.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "cTZCY9ZNHIWbrxm7qz0IOw": {
    "date": "5/18/2016",
    "text": "The worst cafeshop which somehow has been extemely overated more than it deserves. From the service to the food quality, there is no reason why this cafe still exists.. Even in a prime location such as Nge Ann City/Takashimaya at Orchard??! It is such an embarrassement to French cuisine which highly values its cooking quality with long heritage.We ordered a simple baquette sandwich which came with a mushroom soup. The sandwich was plain and lack of freshness while the soup was salty, like it just came out from an instant soup packet, and the accompanied bun was like a 1-week old bread which was hard like a rock. Goodness, that was really injustice considering the price we had to pay for such a below quality. For the sake of culinary world, do something about the food! Improve and stop serving less-thought and low-quality of food to the hungry shoppers.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAbu5F-8_iZo6Yc8Lu1ZWA"
  },
  "bSAaN6xSz20SYNrHL6mjOg": {
    "date": "4/2/2015",
    "text": "Very Slow Service!!!Because I can go to many other places to find food similar to what I get here, I'm rating this fully on service.One thing I can't stand is my glass being empty. I had to ask while flagging a waitress down to get another drink after my glass had been empty for quite some time. To make it worse, I had to remind her much later that I hadn't gotten my drink yet.If you have nothing else on your agenda for the day, then I would say go here. The menu is great.  However, the service is slow and spotty.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dYuYB2sNZx9Vx1P3x5JbA"
  },
  "TX5HZWrllYMusgmkcMUImw": {
    "date": "10/29/2012",
    "text": "After shopping, dining, and striking out somewhere else for dessert, we decided on Paul.What was defintitely more difficult was deciding exactly what to have from their extensive menu of sweets.The staff was friendly and helpful.  The room is quaint with a touch of old world charm.Finally, after much deliberation, we settled on our choices. Strawberry Tart for hertinyurl.com/93aqdwgChocolate Sundae for metinyurl.com/8hty8a4Both desserts were fantastic and both were eagerly engulfed.I would not hesitate to have dessert here again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "InpPLGB9GUrzHaVk6NNHew",
        "caption": "Photo of Paul - Singapore, Singapore. French King Cake - Paul Bakery - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/InpPLGB9GUrzHaVk6NNHew/o.jpg"
      },
      {
        "img_id": "oKXLRupeLkoyg6-ugJ2UJA",
        "caption": "Photo of Paul - Singapore, Singapore. Strawberry Tart - Paul - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oKXLRupeLkoyg6-ugJ2UJA/o.jpg"
      },
      {
        "img_id": "dCboX6UaWro_3L6CXMUDDA",
        "caption": "Photo of Paul - Singapore, Singapore. Chocolate Sundae - Paul - Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dCboX6UaWro_3L6CXMUDDA/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  }
}