{
  "GBl18lQru5dLTSQrWSUrYw": {
    "date": "11/27/2015",
    "text": "Customer service non existant. The only response we got is, \"order what you like as what I recommend does not matter.\"No pleasure in dining.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bF6PqsugCWjBZ-RVIJzrmQ"
  },
  "Uhxg8C45SY2khqhEU7fPtg": {
    "date": "7/2/2013",
    "text": "Their full American breakfast is nice and it's a great place to hang and yak!!!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "6m1I4zj4n4_5MSpOo3rafw": {
    "date": "1/8/2013",
    "text": "3.5 starsA goal of mine is to start using the buses more often so I can get to know Singapore a little better. After hopping off the bus and walking allllll the way up Dempsey Hill, I decided to reward myself by indulging in lunch at Jones. (Okay, walking up Dempsey Hill wasn't that bad, but come on, I should get some recognition for not driving or taking a cab out here!) I ordered the leg ham and gruyere cheese sandwich, with zucchini, tomato chutney, and apples. Sounds different and amazing, right?! Well, I was slightly disappointed. I found the sandwich to be a bit small and overpriced. I felt the ham just tasted like ham, the gruyere just like regular cheese, the tomato chutney was sweet but that's it, and the zucchini and apple portion was lacking. Basically, nothing really stood out and the flavors didn't seem to combine well. It was served with a small salad on the side, but I wish it had dressing on it. I did like the bread, as it was toasted perfectly.After paying my check, I decided to look at some of their grocery items. I love how they had a lot of Italian goods like bottled tomato sauces and dried pastas - I've been striking out on finding good Italian restaurants here so I'm always looking for quality ingredients to make my own Italian meals. The cheese room looked amazing but I was a bit intimidated by it. I also loved all the exotic teas they offered.Overall, so-so experience at the cafe, but totally loving their merchandise. This seems like the place to be on the weekends, so I wouldn't be surprised if I ended up here again. Looking forward to my next visit!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "98lzTOTYnBLkWSP4ZFp_0Q": {
    "date": "12/28/2014",
    "text": "Great ambience, perfect for lunch / brunch. Orange&carrot juice was great. As was the sweet potato roastie. S$250 for 8.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PzvUxfVJFGH-r4wAGx7Jdg",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PzvUxfVJFGH-r4wAGx7Jdg/o.jpg"
      },
      {
        "img_id": "nO-1i9FRQm6yy0tQqFFMKw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nO-1i9FRQm6yy0tQqFFMKw/o.jpg"
      },
      {
        "img_id": "LfQHNS69p46u0AUhu_3zSQ",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LfQHNS69p46u0AUhu_3zSQ/o.jpg"
      }
    ],
    "user_id": "rwXU0_gG4VS2mmdwK-vPXw"
  },
  "u7dm6zdSTU9zahSYn7_Yyg": {
    "date": "7/2/2013",
    "text": "Jones the Grocer is very comparable to any of the nicer specialty markets in the US, i.e. Whole Foods, Dean and DeLuca, Jimbo's Naturally.  I came across Jones after doing a search for smoked paprika in Singapore, it's been challenging finding the things we can so easily find back home in the States.  I had never heard of it before and discovered they are actually an Australian chain, which I found interesting and also really thought their website was nicely designed.  There are several locations in Singapore, I went to the one located in Dempsey Hill.    They have a good selection of spices and in addition to finding the smoked paprika I purchased some really nice artichoke hearts, pasta imported from Italy, bruchetta paste, and Estrella Damm beer.  I did not try their cafe, but all the pastries and baked goods looked delicious and I bet their espresso is wonderful.  They also had an extensive collection of books/cookbooks, a nice cheese selection, as well as quite a bit of tea.If you are looking for a store to stock up on pantry items Jones the Grocer is definitely a great place to start.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VC77eKyi6jAx0Vxmps__bQ"
  },
  "fV_NODMfnksJCNmjkCSNbg": {
    "date": "11/21/2015",
    "text": "Good food, indifferent to borderline rude service, and free flies provided with indoor seating.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rvG8Lwhs28GftJA16f79Qw"
  },
  "4nNgsJ2moIOE8M6iA6rOmg": {
    "date": "8/6/2012",
    "text": "This was the original upmarket grocer before D&D came to town, and its chillax nature up on Dempsey Hill I think makes it that much more appealing. The FnB isn't the cheapest, but I love their choice of desserts, including the nougat and rocky road which for some reason is not available at the Mandarin Gallery outlet.There's an airconditioned cheese room and quite a good cheese platter available, plus lots of fancy pricey grocer food to gawk at while you're here. While evenings and brunch times find it quite packed, weekday afternoons are really not crowded at all and its nice to just take your things up here to have a cuppa and unwind.Also cool: FREE WIFI (which is what I'm using to write this review now) FTW.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "J_IyC_l-SRD2svsUI-Xgrw": {
    "date": "8/23/2012",
    "text": "Jones at Dempsey is a café and specialty food store from Australia. The food here is decent enough, not the most extensive menu though. Best to come here for brunch and breakfast. During lunch they have sandwhiches, salads and main courses. The sandwiches are alright, but honestly they are very stingy with their portions. Desserts here are nothing to write home about, they could definitely do much better. One plus is the free wifi, which makes it a nice place to chill in the Dempsey area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L2NTQ7ZzBCf0CDfxisi_Uw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L2NTQ7ZzBCf0CDfxisi_Uw/o.jpg"
      }
    ],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "dOTwAzHvgs7N1v0Utm-rQw": {
    "date": "8/18/2012",
    "text": "Jones the Grocer is of course more than just a gourmet grocery store. They offer a unique mix of cafe and european fusion cuisine with everything from steak to cheese platters. The food tends to be a bit on the pricey side but nothing is too extravagant or over priced. The cold cuts and seafood are extremely fresh best eaten when paired with something from their extensive cheese cellar.Their range of products is extremely diverse & unique although sometimes a bit over priced. A good place to come in for a glass of wine and cheese or a cup of coffee over a nice novel on a quiet weekday afternoon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AIb7LML67T_sdHEJTeC3NQ"
  },
  "E7dOhV1my0ch8npS0ouRUA": {
    "date": "8/10/2012",
    "text": "Expensive expensive expensive is all I can say and this is said with relation to the tiny portions. A side order of sausages comes cut up in a bowl, not even the slightest effort to garnish, rather disappointing for an add-on that cost a bomb. Jones the Grocer was and still is to many a novelty. One drink to try though would be the citrus infused iced Earl Grey. Bergamot is relaxing and the citrus infusion pairs well and adds an extra kick to the refreshing cooler. If I do remember correctly, Jones also serves a good club or BLT sandwich. Not the best place for brunch but definitely a nice place to spend relaxing weekends!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "TuJ77Z2rxBaTYfaAua_OxA": {
    "date": "5/14/2013",
    "text": "Great atmosphere for a nice cup cofffee, meal or a meeting surrounded by neatly organized food. They also offer one of the best cheese selection ive seen in singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZMCl8pacOFGcDu5u4nmSQ"
  },
  "8_fipO-N7PPWjrE00aiCaw": {
    "date": "5/5/2016",
    "text": "Venue 5/5 great ambiance and atmosphere with clean and well-maintained venue, always appreciated. The place is spacious indoor as well as outdoor. Service 5/5 attentive and helpful service throughout. Food 4.5/5we ordered pork ribs that comes with grilled corn and mashed potato, and it is as good as it can get. You can slice through the meat with just the weight of the knife and it melts in the mouth. The mashed potato is very fresh and goes well with the meat, no additional sauce needed. Can't really comment about the corn aside it being fresh since I don't like corn. The next food is prawn risotto which is first class, although I am not a fan of el-dente rice, therefore it is not as enjoyable as it could, but I appreciate the food prep and quality itself. The sauce is perfect, flavorful but not too much, the prawns are fresh and prepped excellently. I give an overall score of 4.5/5 because I haven't tried other options that will make me a regular yet, but will try since it is a nice place to hang out and chill while enjoying a good food and wine. A bit pricey but reasonable with the food quality offered.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O-jv8s1V6u2I7oC2z_CC0A",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O-jv8s1V6u2I7oC2z_CC0A/o.jpg"
      },
      {
        "img_id": "yOBOCPLf_0husQoErMq4DQ",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yOBOCPLf_0husQoErMq4DQ/o.jpg"
      },
      {
        "img_id": "fN_OUjCoKjLRIg1IonsBlw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fN_OUjCoKjLRIg1IonsBlw/o.jpg"
      }
    ],
    "user_id": "PT0lT9ZWtp2xffUY825pQQ"
  },
  "ulIyreaHFwWVjmgk8ZAjeA": {
    "date": "5/7/2016",
    "text": "Perfect if you're into the uppity type of thing. The prices are parallel to pretentious brunch in the US in a NYC restaurant. While well lit with large windows and filled with imported foods, Jones lacks the flavor and excitement to me that the rest of Singapore does. Have your $9 SGD tea with your $22 SGD brunch with the ex-pats if you will, but if you are visiting Sing and not a local, you're not missing anything by passing on to the next food adventure.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "4oaM3HuNakDHZ7eXSks9Nw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Smoked salmon benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4oaM3HuNakDHZ7eXSks9Nw/o.jpg"
      },
      {
        "img_id": "U-soJUwqJDP4xDDtNtY57g",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Avocado and pesto eggs. Flavor, what's that?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U-soJUwqJDP4xDDtNtY57g/o.jpg"
      }
    ],
    "user_id": "lUPSEbFRd3jDOM5agGnjWQ"
  },
  "EIKzDgpxk2K5VsrpXesXoA": {
    "date": "11/11/2017",
    "text": "Worst service ever. Waited an hour while watching the rest of the table eat. They missed 3 of our orders. We asked 3 times for an update and not once did the staff get back to us. How hard is it to make avo on toast and get it out in a reasonable time. Ended up cancelling my order as I was sick of waiting. At Dempsey a lot but will not come back here again.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvNFtVBYlI0HaqFZZIFIjg"
  },
  "yONySwxpgYWbxmRmztoe2A": {
    "date": "2/16/2016",
    "text": "jones the grocer is back in the game! They have streamlined and refined their concept to continue bringing us gourmet and quality food recognised, with a greater emphasis on promoting healthy eating and lifestyle. The airy Dempsey outlet is pretty much the same. Other than housing Singapore's first walk-in cheese room (with over 100 varieties), a large artisanal retail outfit, and bakery, jones has now added a brand new butcher's corner by Swiss Butchery as well. Have a meal here and then bring another meal (or 2) home!We started with the Cheese & Charcuterie board (3 items $35, 5 items $45, 7 items $55, additional items $8). This is served with truffle honey, jones olive oils, jones Egyptian dukkah and a selection of jones artisanal bread. I can't go on about how good the Stilton Blue was with the truffle honey. UMAMI. I would also add the smoked duck breast and some other cured meats to the mix.If you're not sure what to pair your cheeses with, don't fret. The on-site cheese experts would help you with that. There are also suggested accompaniments placed together with the different types of cheeses on the shelves so you can always pick them out yourself. A starter that is the equivalent of a main course is the Oriental Crispy Duck ($26) which is a pan fried duck confit served on a bed of mesclun salad tossed with shimeji mushroom, Russet potato, cherry tomatoes, and tossed in a plum dressing. Somehow the salad stole the thunder from the duck, which was simply a protein accompaniment that is rather characterless. jones Classic Wagyu Burger With Truffle Fries ($26) is the bomb. Resistance is futile. How can anyone say no to this juicy 120g 100% Australian wagyu beef patty with crispy bacon?! Of course, the various condiments layer on the flavors perfectly- melted gruyere cheese, truffle mayo, bois boudran sauce, pickles, hot English mustard, and caramelized onions. They even make their own fluffy brioche bun which held the stack perfectly. I also had to tell them to take away the fries, if not i would not be able to taste the rest of the food with my limited stomach space. The Asparagus Risotto ($24) was a creamy soft herb risotto with fresh asparagus, Taleggio and rana padano with black truffle oil. Expect this to be very very filling. I couldn't take more than 3 spoonfuls of this as it was rather cheesy, though bland. An enjoyable pasta was the Spicy Seafood Aglio Olio ($28), which was piquant and full of garlic. This dry pasta could do with a larger variety of seafood actually as it was mostly prawns (not that i mind but it did say that it's a seafood pasta). I wouldn't mind finishing a plate of this actually, but i thought the prawns were too powdery.Grilled BBQ Chicken ($26) was succulent and juicy, though pretty standard. The BBQ sauce had a nice hint of apple, which i thought was rather refreshing. That creamy and buttery garlic mash and minty coleslaw were kinda heavy for the dish. So i have found the best Warm Sticky Date Pudding ($15) in Singapore. Seriously this cake was buttery and moist and that salted caramel sauce was the bomb, especially with that rich vanilla bean ice cream. Any dessert after this just couldn't compare. Of course, if you're looking for something small, the freshly baked breads, pastries, and cakes would satisfy your tastebuds. All jones breads are organic and they only use premium ingredients here. So yes, welcome back, jones the grocer now!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "-QWKNv3Hg-4B7IRD0Fz0ow": {
    "date": "5/16/2018",
    "text": "Another one of my favourite breakfast/brunch go-to's. Friendly staff and a cute atmosphere. Food will come out so fast! They have interesting drinks on their menus such as a charcoal latte. Their English breakfast is probably one of the best attempts in Singapore. It is a nice place to go for a quiet morning breakfast. Never too busy",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5VTy_OiJqbuWvHZYDM3pw"
  },
  "8hqcxeX6-Kc5h1-GjxoJ1w": {
    "date": "9/20/2017",
    "text": "One of the worst service, didn't come to bring the menu until we asked a while after we sat, and never came back to take orders. So we just left..",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "grsOXS51OWyD5CbN6N9NZg"
  },
  "OWLf8DLaiU6tRVta1fxVTw": {
    "date": "2/8/2016",
    "text": "Decaf soy latte ($6.50) - 3.5 starsDecent! Pricy but I hardly see decaf soy lattes.Multi grain bread ($7) - 4.5 stars",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "X6EFYZ4RB6NnEtPJrXDYmA": {
    "date": "8/12/2017",
    "text": "Great service and delicious food. The outdoor seats are pretty chill, great for those who would like to dine outside. Service is attentive and friendly. Enjoyed having brunch there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xU3sDPonLx1_w4t6wOOpdg"
  },
  "UhkLBiLgpcm5w8tdaGXtpw": {
    "date": "4/3/2016",
    "text": "Ordered a sandwich, hot Cakes, French toast, and  an egg dish. For the price we paid, the food was really ok. Was not impressed by this place.It is set up in the Dempsey area which is quite quaint.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EbHyfhzLKc5n_1SRjBp4aQ",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EbHyfhzLKc5n_1SRjBp4aQ/o.jpg"
      }
    ],
    "user_id": "-qFWXjfKVR-ntDiH247V7g"
  },
  "2t_nD0IbK-qY6dmP82n5Eg": {
    "date": "7/17/2017",
    "text": "Come here if you like ice cream scoops of sauce in your sandwiches, a truckload of salt in your soup, and a half-day's salary spent for the above.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNqAWO5TVGVIePtOUlSeLw"
  },
  "NdEAllhTj0xS-4VeFqZQzA": {
    "date": "10/27/2015",
    "text": "I'm ok with this place.First time was 5 years ago. It was much more packed. Ok coffee. And had a sandwich or something but they must have changed the menu since. Nice place to chill at the time. More people around, it was busy but staff was attentive.Second time. We went on a lazy Saturday, wanted a place to drink tea. Ordered some cheese and went to the deli to buy ham because the waiter said it's cheaper to do that so we did. Food is good, but service is a little off. I had to get the menus myself. Kept having to ask the waiters to get our orders or get water, etc. I don't like flies/insects in general and there were a lot hovering by the bread maybe because of the cheese smell also. But anyway I would go just to buy some meets and cheese to take away. Won't go back to stay and eat.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "14Ejo0daAQks4AIyseKXSg",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Cheese and bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/14Ejo0daAQks4AIyseKXSg/o.jpg"
      },
      {
        "img_id": "vo0BJ-OWx0cryZ6HOGfhBA",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Ham and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vo0BJ-OWx0cryZ6HOGfhBA/o.jpg"
      }
    ],
    "user_id": "PK5NTAjdVY9mPdtwU0Ve3Q"
  },
  "1tVdkfPrtwnYsNtakf670g": {
    "date": "4/24/2015",
    "text": "Being totally honest here, I'm not the biggest fan of the food. It's ok. But the main reason to come here would be the ambience.This is a dream brunch place to take the family to just because its so pretty! The lighting, sun shine streaming in and the white making it really so wonderful. Running around here looking at the beautiful products while waiting for the food to arrive is a must. I literally love looking at packing and unique brands and thats what this place is all about.My mum and I couldn't find anything we wanted to eat for lunch here but we would definitely recommend it for a breakfast/brunch place with the family or friends!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LpxZx_aD84S8o4jIKoYJJw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LpxZx_aD84S8o4jIKoYJJw/o.jpg"
      }
    ],
    "user_id": "cfWkhUiMnwaMstTbvAYLUQ"
  },
  "5CtzJncBeDXNAFN0CIhO3g": {
    "date": "11/12/2016",
    "text": "Coffee & cake time after lunch. Food knick knacks and sweet things abound. The coffees and hot chocolates came by. Good for us. chocolate was not too hot & not too sweet. Price was ok. We liked the ambience of a larder, kitchen counter and bakery all in one. With the slight air or organised grocery shop chaos. Some how works for tropical Singapore. Neat, tidy, works but cluttered in an ordered sort of a way. Wah! can do lah!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MTrdcrQPaJmWoI_Pw_m18A",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. The food",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MTrdcrQPaJmWoI_Pw_m18A/o.jpg"
      }
    ],
    "user_id": "sa2jTUdR3kasSZea_W9RZA"
  },
  "bGnt-hDFRO8ZA0XMJXCUSw": {
    "date": "11/27/2014",
    "text": "What can I say? I have a grocery store fetish. It is where I reach a constant and even emotional state where everything feels like warm sand on your feet while looking at calm blue water. I don't even feel this chill when I actually have warm sand on my feet while looking at calm blue water. I simply love going to grocery stores and markets whether it is local dirty market, farmer's market, seafood auction, or night markets. As long as there are transactions involving goods and currency to change hands, it is fun to explore. I of course love it better doing so in far away exotic places compared to your neighborhood Walmart.While visiting Singapore, my friend took me here to Jones the Grocer for a little shopping for my thanksgiving cooking preparation. First time cooking turkey in Singapore and surprisingly between all the grocery stores and markets I visited in three days there, I got everything I needed.Jones was fun though small. It catered to foreign Caucasian clienteles and it is pretty well stocked with imported stuff including a great variety of boozes and other regular essential items you can't easily find while overseas at super augmented price. It was fun perusing the stuff that looked familiar to you back home though you're in the middle of Singapore where it was 90 some degree F in November.My friend Debby and I also stopped at the cafe to get some brunch after we both saw the magnificent cheese room. That was some serious cheese storage for South East Asia where their idea of cheese is milk processed into cube wrapped in blue Kraft box and called it \"Processed Cheddar.\" This cheese room is worth seeing and sampled.We ordered a salumi platter with Specks, Parma Ham, some type of salami, Stilton blue, some swiss cheese and a couple other things served with fresh breads and truffle honey. I have been searching for this truffle honey ever since. It was one of the best condiment I have ever had. I can't describe how good it was.If in Singapore, this does not scream local. However, it was one of my most favorite stops.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "aTlU_2IldAh-LDPl6wWnYQ",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Our salumi platter..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aTlU_2IldAh-LDPl6wWnYQ/o.jpg"
      }
    ],
    "user_id": "UrOofvcBl0gAbKPAEaj83A"
  },
  "v1_-SNDJ3Z5yO5mdl9swqQ": {
    "date": "9/20/2015",
    "text": "A refreshing place to peruse and explore.The pumpkin, feta, and arugula salad was super simple and fresh. I'd order it again in a heartbeat. Will probably be back when I'm in a more cheese-inquiring mood. (If you're a cheese person, just stepping in that cheese room is like instant therapy for the soul) ;)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BlEFnOjUxS_IRXYW0uZ3Hg"
  },
  "Uo7pzB6-ors2R6W7dsgAXw": {
    "date": "10/5/2013",
    "text": "critics be damned, and yes, there's a wait, and the service is lacking a little, but hey, it's Singapore! you must be new here.but with a huge walk-in cheese refrigerator where a cheese chef will help you taste and pick out your customized cheese platter, or for some additions to your charcuterie tray, you can't beat this place. go with friends, don't be in a rush, and stay as long as you want.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iOib12dqOaCGzyYb6hzxhA",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Oh exalted cheese room....",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iOib12dqOaCGzyYb6hzxhA/o.jpg"
      },
      {
        "img_id": "EV7-qnbsfS7E_VT1mJsJFg",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Do NOT just order off the cheese & charcuterie menu, GO TO THE EXALTED CHEESE ROOM! smell, Taste, CHOOSE! Then tell ur server",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EV7-qnbsfS7E_VT1mJsJFg/o.jpg"
      }
    ],
    "user_id": "UQFE3BT1rsIYrcDvu_XVow"
  },
  "hEEEXkNSKpZ95FNYy12W4w": {
    "date": "2/5/2014",
    "text": "Came here for afternoon tea with a friend, but mainly because we were both trying to work.Loved the fact that there was free (and decently fast) wifi, as well as power supply (though not at every table). Makes working out of a cafe so much more convenient :)My friend really loves the ginger ale, but I didn't enjoy it as much since I'm not a fan of ginger. I wanted ice tea, which they dont serve - only ice lemon tea (sweetened) :/ Went with Earl Grey Tea, cant go wrong with that!Had a good time working there. Will be back again to work!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "VbcaVXO5E_hLy1OkkS4GfA": {
    "date": "1/16/2013",
    "text": "I like the grocery more than the food served. The yummy real ginger ale, the different salts and oils, the wafer-thin crackers.And did I mention the totally awesome cheese room? Get in, freeze yourself, taste some cheese, buy some home, get fat, die happy.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jFe7TauULgP7VR-rqwHoDQ",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. Awesome fresh ginger ale",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jFe7TauULgP7VR-rqwHoDQ/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "MEF-y3rRY9VBF9xpjuV8Fg": {
    "date": "10/20/2012",
    "text": "free parking.free wifi.a good start.can be real crowded on weekends.ended up seated at the bar counter.the bar stools look like they have seen better days!we ordered an earl grey tea and a mixed carrot and orange juice.the juice came sans ice which i guess means you get more juice for your $6.50.but the ratio of carrot to orange was on the high side.we tried a plate of duck rillette with sliced baguette, pickled onions and gherkin.the baguette came cold and chewy.the duck rillette was tasty and with a good dollop of duck fat attached.the mini gherkins was sharp and tart to cut through the fattiness.the onions were really nice and sweet.their brunch menu is available till 5pm just for the late risers.service can be spotty.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "dBpa7fIo-hXJvqmqGIYwcQ",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. chocolate chip cookie.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dBpa7fIo-hXJvqmqGIYwcQ/o.jpg"
      },
      {
        "img_id": "z-R6SRgunyETx6QaMTS5gw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. banana walnut cake.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z-R6SRgunyETx6QaMTS5gw/o.jpg"
      },
      {
        "img_id": "HyqtIyjwYzzmFlOGU_e9Dw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore. latte.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HyqtIyjwYzzmFlOGU_e9Dw/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "4HwGEjLN7cZgtzfVj7XqeA": {
    "date": "7/29/2012",
    "text": "I love coming to the Dempsey outlet of Jones the Grocer on weekdays when I'm around town and have a couple of hours to spare. It's not very crowded in the afternoons so its the perfect place to do some reading, or have a good catch up with a girlfriend. The staff are very chilled, attentive and ready to take your order when you're ready, but know how to give you your space to just relax. Really one of those rare places with a great atmosphere where you can escape from the bustling city.The food is good, they have a big range of cakes, slices, cheeses, breads and desserts to choose from - so you'll really be spoilt for choice. Coffee is excellent too - and very consistent, I've never been disappointed here.  And to top it off, I really like how they include the gst and service tax into their menus - I think everywhere in Singapore should do that! It makes our lives a lot easier when you need to split the bill.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s1ecBMEfNlcbopo3j3RQYw",
        "caption": "Photo of Jones the Grocer - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s1ecBMEfNlcbopo3j3RQYw/o.jpg"
      }
    ],
    "user_id": "tZ437GvGPzH9Hx11p32fdQ"
  }
}