{
  "x8e6CBLq5fy_LaH9JdP6Fw": {
    "date": "5/21/2015",
    "text": "Good solid, authentic japanese food. Slightly expensive pricing aside (hey the food around this place have the same price range anyway) the food served here does have its #throwback toJapan moments. The sashimi and dragonroll we ordered were as good as you can get in singapore, although i must admit, i have had better at around the same price and even slightly lower.What surprised me was my main dish: beef hamburger patties served with vegetables and rice. Aside from the large serving of fresh vegetables (people who've been to japan and ate western food there, i think you might get what i mean), the hamburger patties were exquisitely tender and moist! It did not have the over powering meatiness and slight toughness you would expect from eating a meat patty or dryness. The patty was very light and moist, an indicator that a good amount of fat used and care taken to ensure the juices remained in the patty! Aside from that, well like most japanese restaurants, the smaller serving size serves as part of the charm of japanese dishes doesnt it!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5uSb6rErbohbcKrMmimb9g"
  },
  "fF5LHdA6XEpR2uSGNDWGcw": {
    "date": "7/5/2017",
    "text": "My friend who works in Millenia Walk has been raving about Rakuzen and said even her Japanese co workers approved of this restaurant. Sounds promising to me.One morning we girls met at Patisserie G again. I do wonder why she likes coming back to her work area even during days when she was on vacation. I must text and ask her after I finish this review. Hmmm.. Anyway, after munching on the Jasmine infused ham & cheese croissant at Patisserie G, (Yes, I was so hungry), she said let us go and get lunch at Rakuzen. I like ok.I did check out the Rakuzen's website weeks ago when she first told me about this place. The site says:\"... You may think the shop looks exclusive, but once you step in there, you'll find yourself welcome by warm smiles of our friendly staff. Rakuzen is very proud of our commitment to high-quality.\"I disagree with the above. I do not think it looks exclusive on the outside. Warm smiles? Friendly staff? Oh :(How about the food? Ok, I ordered the Unatama Don Set (Rice with eel with egg)-$18. Oh boy, I never have any unagi that \"fishy\". Portion (rice portion) was generous. The set also comes with chawanmushi (steamed egg), miso soup, a tiny plate of mashed potato (I think it was mashed potato?? It tasted cold) and a tiny plate of dessert (watermelon & jello). I really like the watermelon and jello out of everything I had. Perhaps I have ordered the wrong item. It was just very mediocre to me. And one thing I need to point out, maybe one of their staffs get a chance to read this, we could hear all their conversations where we sat which was behind the cash register. So please keep that in mind :(",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8OJRR-szjUx3yb12A6_OKw",
        "caption": "Photo of Rakuzen - Singapore, Singapore. I really like this light fixture",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8OJRR-szjUx3yb12A6_OKw/o.jpg"
      },
      {
        "img_id": "ZyG9QxQCsxBJ2Gfae0OoDg",
        "caption": "Photo of Rakuzen - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZyG9QxQCsxBJ2Gfae0OoDg/o.jpg"
      },
      {
        "img_id": "ZQdJzxgvJXFYIzpZQbf6dw",
        "caption": "Photo of Rakuzen - Singapore, Singapore. Set lunch menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZQdJzxgvJXFYIzpZQbf6dw/o.jpg"
      }
    ],
    "user_id": "0V_C2aOTDKuR8CO3P3RvJw"
  },
  "aOMdonaHGgW0Y2sgU_GqfA": {
    "date": "8/19/2014",
    "text": "decent japanese food at this place I've seen frequently touted as good-value and decent quality, both compliments I agree with. I did imagine, however, that the place was a rather more high-end establishment (perhaps on the same level as sushi kuu) - but it's more akin to a (slightly more) refined sushi tei.the comparison with that latter establishment is further promulgated when you realise just how similar (almost suspiciously so, as I whipped out the phone to check if they belonged to the same group - no evidence to this though) the menus are in terms of font and choice.there's a good selection of bento sets that make for good value, as well as a decent a la carte section for greater variety. the mains range from sushi to suitability (lots of springy noodles and tender beef in a suitably sweet broth), with sides of anything from sashimi to teriyaki chicken - and what we got was pretty tasty, and serviceable enough for a post-work dinner or hanging with friends.I've said this about many restaurants in this range - it's not fine dining, but it really has no need to be. there's a measure of applause to be had for an establishment that manages to serve you good, decent food without it costing an arm and a leg - and in the case of this place, the restaurant is done up rather nicely in a glassed, rather refined environment that belies the low-low prices (relatively, for the area) inside.good food, and a nice sit-down in the area (and especially good for being close to dessert (i.e. patisserie g)).",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n0J522mtIGoG6sZtNXdEGw",
        "caption": "Photo of Rakuzen - Singapore, Singapore. side of sashimi on the bento set",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n0J522mtIGoG6sZtNXdEGw/o.jpg"
      },
      {
        "img_id": "sb_lTQzRxJO2Wbso3z4_uw",
        "caption": "Photo of Rakuzen - Singapore, Singapore. chirashi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sb_lTQzRxJO2Wbso3z4_uw/o.jpg"
      }
    ],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "vto5bkhj1FoGYlp-Tus-DA": {
    "date": "6/14/2015",
    "text": "The food offered was a slight let down. The sashimi was not as fresh as compared to other Japanese restaurants with similar prices such as Akashi and Sumiya. Perhaps I came with too high hopes due to the good reviews written about this place online.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OXgvPI35w5ClSTRSRrAceA"
  },
  "bMoL1x-6brOM0RGIBsv0qA": {
    "date": "12/7/2015",
    "text": "Very simple Japanese cuisine available from this restaurant. It's your typical kind of Japanese restaurant which serves moderately tasty Japanese food! I wouldn't say that it is fantastic... it sure isn't outstanding either. But if you're looking for simple and authentic Jap food, this is the place to go! Portions are a little too delicate and dainty for my liking (but that's probably the nature of Jap cuisine). Their grilled fish is nice, sashimi is fresh too, recommended. Beware that it's harder to get a seat during lunch time as it's often packed with a couple of customers waiting for their table, might have to wait for 10 mins or so unless you're lucky!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eJf2ASS7fkVFz9S6CeKxPQ"
  },
  "9nimgy0bS3aQ_nx6Zz54gg": {
    "date": "6/18/2015",
    "text": "Good lunch sets; huge menu! The unagi was really good (though you can taste that it was frozen and not fresh) and the set came with enough variety to enjoy. Good came out quickly, service was standard and nice.  Would like to come back to try the dinner menu and perhaps the rolls next time.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7HTWYD8pEjHcYTvK9yoVwQ"
  },
  "65BzYBIrQ2DhS2zgIpsEmA": {
    "date": "8/9/2012",
    "text": "To many, when I mentioned to them Rakuzen, they fondly remembers this restaurant tucked away at a corner of millennia walk for its value for money set meals. To me, Rakuzen is a hidden gem waiting to be uncovered.  I love to go there and be surprised with their  sashimi specials. Unlike many of the local japanese joint, you can get a variety of interest seafood that you hardly see or hear about. My all time  favorite would be the seasonal Promfet Sashimi and Uni.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pI7YTsHaH16lLAKs9V8juQ",
        "caption": "Photo of Rakuzen - Singapore, Singapore. Beef Tataki",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pI7YTsHaH16lLAKs9V8juQ/o.jpg"
      },
      {
        "img_id": "JY6XuRs1cZOkF2bX8S8gQg",
        "caption": "Photo of Rakuzen - Singapore, Singapore. Assorted Sashimi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JY6XuRs1cZOkF2bX8S8gQg/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "k2KGrHIrJQJuMTi6JaUZHQ": {
    "date": "7/23/2012",
    "text": "This is my go to place for really good Jap food. Usually you can tell how good a japanese place is by the number of Japanese in the establishment. This place more then satisfies this criteria.  Much of the sashimi is seasonal, so always ask for what is available. They bring in interesting things which are quite unheard of in other places, such as pomfret, or sea bass. What i really enjoy is the lobster sashimi which is served in its own shell. After you are done the waiter will take the sell and the chef will use it to make  a really rich lobster infused miso soup. another thing that i always order is the Aburri Beef Roll- Rice, Avocado, crunchy bits( i think its salmon skin), rolled up like a maki, wrapped up in thinly sliced raw beef. Slice, Blowtorch and served. The blowtorch is a gimmick which acually works, It imparts a smokey flavor because some of the rice actually gets burnt.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmDQrAExEkqwqni0e_WEIw"
  },
  "fFBUOkFjYMA95yM6OHmZrA": {
    "date": "8/23/2012",
    "text": "The service here is frankly awesome. Dragon roll is humongous and then some, while the hand rolls are of a pretty good standard. Decor is all understated clean lines, and there are small blinds/curtain thingies that can be lowered to create a semblance of privacy. Staff are discrete, very prompt and helpful. There aren't many places that I'd readily shell out a pile of clams for, but this is one of those.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  }
}