{
  "KG7xs_rG8K5YecuusMtmYg": {
    "date": "4/28/2014",
    "text": "I am a convert to yakitori after dining here. I never really like yakitori as those I had tried before were pretty ho-hum. Grilled meat on skewers. Nothing special or mind blowing. I have walked past Nanbantei countless times but somehow have never dined there. It just never appealed to me as the menu looks limited and the specialty is yakitori which is not my favorite type of Japanese food. Then a friend dined there and said it was good, and the lunch menu has decent pricing. So it stayed at the back of my mind for the \"one day\" moment. Well, that day arrived when I walked past it again and decided to just try it. The place was packed and apparently you need a reservation. I was lucky and got a spot with the caveat that I would need to vacate in an hour as someone else has a reservation then. There were only 3-4 tables with the rest of the seats surrounding the chefs table where you could see them grilling the meat. Everyone was patiently waiting for the meat to be ready and food to be served. It seemed like everyone just ordered the yakitori bento which was a good deal. Yakitori bento consists of 5 sticks (asparagus wrapped with pork, pork with shiso leaf, tsukune, leeks and pork and quail eggs), miso soup, rice with 3 toppings, pickles and dessert (red bean and mochi). All that for under $20 makes it a value for money meal. The meat was so perfectly grilled that they were tender and juicy. They did not need to rely on the sweet sauce or heavy seasoning to mask any smell or taste. It was just the best yakitori ever for me.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wNAwbuWaSZs-W1MGCnpm7Q",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Red bean dessert",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wNAwbuWaSZs-W1MGCnpm7Q/o.jpg"
      },
      {
        "img_id": "pmaB37iChv8SIYdqLJ0FaA",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Yakitori close up",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pmaB37iChv8SIYdqLJ0FaA/o.jpg"
      },
      {
        "img_id": "OTfrQ5EzK9l6x6VgAvEO6w",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. All the skewers on the grill.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OTfrQ5EzK9l6x6VgAvEO6w/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "lswRHApxCFTm2ScVFIZUBg": {
    "date": "4/30/2016",
    "text": "This old gem of a restaurant is one of the best kept secrets in town. The affordable and satisfying set lunches are what's worth coming back for. No efforts were spared despite being a set lunch, moreover the portions were not skimpy. Taste was excellent as far as Japanese food goes. Expect nothing extraordinary but just good food done right. Reservations can be taken online which make it a breeze!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nmww0m3qwBHoUcPvWMaNMg",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. 5 sticks set",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nmww0m3qwBHoUcPvWMaNMg/o.jpg"
      },
      {
        "img_id": "IlQAt1pJld4A4L30BMvRPA",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Table setting",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IlQAt1pJld4A4L30BMvRPA/o.jpg"
      },
      {
        "img_id": "roY2rQCShQ0U4cgIpAuDeQ",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Yakitori set",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/roY2rQCShQ0U4cgIpAuDeQ/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "nKzjQhUx-7mL2L35eCcrrw": {
    "date": "8/5/2014",
    "text": "This is a solid 4 stars, deserving a visit if you are in the area, and crave this kind of food.This is quality, authentic, and good value, all rolled up into one.  The reviews by other yelpers (Carolyn, Ricky & Seth) are spot on, so there's not much for me to add.They do take reservations, though obviously not required, but most helpful as it's a small restaurant, and especially if you want a seat at the counter, which my wife & I enjoyed.Our favorites were the unagi and grilled zucchini w/ cheese and tomato on top. Our dinner for 2 with 2 beers was $101++, but could easily be enjoyed for less. I would return.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "XaSjZq6fGuoUoAmYl58QTg",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Zucchini w/ cheese and tomato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XaSjZq6fGuoUoAmYl58QTg/o.jpg"
      },
      {
        "img_id": "13ycMbeOzEX47MpCKmV2Rg",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Sasami Wasabi (chicken)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/13ycMbeOzEX47MpCKmV2Rg/o.jpg"
      },
      {
        "img_id": "gM2Z_t1OsXbu2Us9ThR2vA",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Aji Shioyaki (mackerel)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gM2Z_t1OsXbu2Us9ThR2vA/o.jpg"
      }
    ],
    "user_id": "nT-sNbcZDDo_9cWBPQSMQA"
  },
  "h1WcJoVqrTFAc0JZM5YfVg": {
    "date": "10/7/2016",
    "text": "Not our first time here.  We came to a conclusion on this place is that u need only for for the grill stuff.  The rest u can get any place else as they are not as good.  This time around we decide to hit mostly the chef's recommended menu and boy they were good.  Especially the wings as we had 5 orders of it :).  The trick here to is to order a little at a time say 3 to 4 grills at a time so your grills will remain nice and hot.  The downside is you have to wait which is probably a good thing as you will have time to digest and decide if you will order more.  All in all a great place and hey if they have Japanese customers here they are most likely doing something right.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CjoBtTKN5diJBiHQ16_cMw",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Wagyu - Nice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CjoBtTKN5diJBiHQ16_cMw/o.jpg"
      },
      {
        "img_id": "_FftDSQGvhwtYN-vxlSoiA",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Can't stop eating Chicken Wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_FftDSQGvhwtYN-vxlSoiA/o.jpg"
      },
      {
        "img_id": "n47sUXJ5GMrHahY4o5-uDA",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore. Scallop - a little over done as it started getting a little chewy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n47sUXJ5GMrHahY4o5-uDA/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "EkDpzoBDWJPHnojj2ErgWA": {
    "date": "2/2/2016",
    "text": "Nanbantei is a reasonably priced Japanese restaurant in Far East Plaza, which specializes in yakitori.  And while the yakitori is decent, it isn't anything special. But the course sets are a good value and includes a nice selection of yakitori and sashimi, and the larger sets include grilled fish and a nabe as well.  The yakitori + sashimi set is a good way to go for one or two people.  The sashimi is a bit limited but fresh; however, the slices were inconsistent in thickness.  Among the yakitori, I enjoyed the negima and asparagus bacon, and the shiitake was also very good.  There is a small selection of shochu and sake, which is also well-priced.  Overall, while I wouldn't say that Nanbantei is great, it is a good value.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "2eFWrWJprVz9VbIqZ1toGA": {
    "date": "5/19/2016",
    "text": "Nice cozy place for a casual dinner.  The meat skewers are good. The chicken wings are crisp and not oily. love the grilled sweet potato too. It's not on the menu, so you have to ask if it's  in Stock,  and takes 20 minutes to cook. When  I was there last week, the bill for 2 amounted to 67$. Grilled unagi at 18$ was the single most expensive item we ordered but the others (chicken wings, asparagus and bacon, mushrooms) cost 5-8$ per order of 2 sticks. The place is always packed,  so make reservations and expect close quarters.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OTx8lNo-62V2rmAKkvAb1A"
  },
  "XTjpfmo_7nzYSUesKooDqg": {
    "date": "5/17/2015",
    "text": "One of my favorite and affordable Yakitori places I've been in town! Overall, this restaurant can satisfy your crave for a meal on sticks. Food is slightly on the salty side, and slow service is expected during peak time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ux2Zj9FUEk6xsHZDS0xCpA",
        "caption": "Photo of Nanbantei Japanese - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ux2Zj9FUEk6xsHZDS0xCpA/o.jpg"
      }
    ],
    "user_id": "22QqKXv1BHCAuFU8mIfVgQ"
  },
  "CWG5TLp8FaDIqJstyhCC1g": {
    "date": "12/25/2012",
    "text": "Yum. It's a tiny venue but the food packs huge flavors. I've never been a big fan of japanese izakaya street bbq skewer type food (is that what it's even called)? But this place has converted me. Everything is flavorful and delicious and it's fun watching the cooks grilling everything right in the middle of the restaurant. Prices seem reasonable. This place is worth checking out.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hRMpQlJQDObCpNSJ1qd_fA"
  },
  "HcpuRWkhvHSdLtmaxdvrcQ": {
    "date": "6/2/2014",
    "text": "This Japanese cuisine at it's finest.  A travel back in time.  There are no bad choices.  Lots of locals and business men.  If you are in a hurry this is not your choice.  Each and every item is made to perfection.  We had 5 in our party and shared orders.  If you have a choice eat at the bar and watch the process.  Entire staff is Japanese and very helpful & friendly. Top floor of the mall and in the same location for 30 years.  Prices a bargin.  The Yakatori  is better than in Japan.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScCkd6Ikf3zsWsYFRIH06A"
  }
}