{
  "8EEpL-q-x6Sb-GwuQ_xMdA": {
    "date": "11/13/2015",
    "text": "Cute space. Pretty good coffee. Every item on the menu has too many elements. They take the no substitutions thing too far. I wanted ciabatta instead of foccacia under my smashed avo. Seriously. Is it really that hard? Why do you have so many different breads then?",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrJihVA5aJhbEc6LEQmUQQ"
  },
  "dVy9rOREvvUOdOF_kslFJQ": {
    "date": "7/17/2018",
    "text": "The last time I was in Singapore a friend of mine suggested that we meet up here for a cup of coffee. The problem was that when we met up, the place happened to be closed. So, upon my return it was my desire to make sure that I checked this place out. Apparently the owners had been to Melbourne and we so impressed with the café scene there that they decided to bring the experiment back to Singapore. Well, from my experience, it seems that this has succeeded, particularly when you consider the number of other coffee shops here. As for this one, well, it was pretty good, not fantastic, but still pretty good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QOCq9mZEAyZXSiN8z3D-JA",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QOCq9mZEAyZXSiN8z3D-JA/o.jpg"
      },
      {
        "img_id": "FCXBW7D-BM9HIPpUOMo9TA",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FCXBW7D-BM9HIPpUOMo9TA/o.jpg"
      },
      {
        "img_id": "RZoZMSePqWy6h_Dk-pOImQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RZoZMSePqWy6h_Dk-pOImQ/o.jpg"
      }
    ],
    "user_id": "DY6s438vFKfblXEWxG0S1g"
  },
  "u_rYClHzQL81rmHgfj4yCQ": {
    "date": "10/23/2017",
    "text": "This is a really beautiful cafe/bistro. I had an affogato. The espresso is seriously good and goes perfectly with the gelato. I noticed they had AeroPress coffee too, which makes me happy as a coffee aficionado. I'm a snob when it comes to fries (I'm Belgian, so I have to be a snob about frites) but the truffle fries here were decently good. The mayonnaise they came with was really good. A friend had the savory?? hotcakes which looked amazing. We did have to wait quite a long time for them, but we're a patient group. I wanted to try them too but I didn't because I was too full. Next time!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YTFr5NmAD-M7U3iZOOQ5cQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YTFr5NmAD-M7U3iZOOQ5cQ/o.jpg"
      },
      {
        "img_id": "IpyTUYy4j6549BZbJsHgHg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Truffle fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IpyTUYy4j6549BZbJsHgHg/o.jpg"
      },
      {
        "img_id": "3933dMcadz3oc8fiFFbqtA",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Truffle fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3933dMcadz3oc8fiFFbqtA/o.jpg"
      }
    ],
    "user_id": "X-dEv3zNKXms9udkuiVcbw"
  },
  "6kDkm-MG8tI1saSgKfdmzw": {
    "date": "10/29/2017",
    "text": "A 30 mins wait for the pancake. But quite worth the wait because the pancake is very fluffy and nice. The strawberries and blackberries are very sour. It is good. Friends ordered other pastas and light bites.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_LrXcLYIvl3bWH1-rSWofQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_LrXcLYIvl3bWH1-rSWofQ/o.jpg"
      },
      {
        "img_id": "XD-4zg9dGfG5JSp5z4p3og",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XD-4zg9dGfG5JSp5z4p3og/o.jpg"
      },
      {
        "img_id": "4Ac6tY14bwopHzreBKIIJg",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4Ac6tY14bwopHzreBKIIJg/o.jpg"
      }
    ],
    "user_id": "yn1y6UBwP3GKEFfglxTKnA"
  },
  "OB1y-dUSD15ckiWlMOp4AA": {
    "date": "11/24/2017",
    "text": "I almost missed this place because the sign was small. They served good waffles but not really outstanding. The coffee is just ok as well. The ambience is good and it's a good place for a catch up with friends.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WqAQnk9nE0ACe3GIVvgvJg",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WqAQnk9nE0ACe3GIVvgvJg/o.jpg"
      }
    ],
    "user_id": "6HtKrCNnh7teJAM2sBduWQ"
  },
  "pzAZUXO9syUcIqGlPkOzTw": {
    "date": "1/21/2016",
    "text": "Located along the busy stretch of prinsep street is curious palette! From the owners of stranger Union is curious palette! Opened in 2015, this interesting and rustic looking cafe can accommodate huge groups of diners in its two storey shop house cafe!Looking at the menu, they offer soft shell crab burger, chicken, western fares as well as interesting sounding buttermilk waffles and hot cakes that have taken over Instagram!! They also have a wide selection of cakes. All very vibrantly colored to emphasize the flavours!! The range from $8 and up!1. Matcha Azuki Cake $8.50++I'm a green tea lover and this cake was calling my name. Although, I did feel that this cake was too articially coloured. The green was too vibrant for my eyes. Nonetheless, I dug in and disappointingly, I couldn't really taste the green tea but the azuki (red beans) sweet and pretty much ended up causing the cake to taste like a red bean cake. I didn't even bother to finish up this cake. Skip this cake and get the earl grey lavender manjari cake instead, save your $10.2. Nachos Con Carne $12.90++ *Highly Recommended*With slow-cooked hand-pulled pork, sour cream, jalapeno and melted cheddar. I really liked the pulled pork here, it was well seasoned, tender and also extremely flavourful. The salsa here was abit too sour for my liking. This dish could've used a bit more cheddar, there really wasn't enough cheddar, more than 3/4 of the nachos didn't have cheese on it. Probably one of the most underated dish at Curious Palette, as I hardly saw anyone ordering it! Do try it! You will like it! Truffle fries are overated anyways! Have some meat with your carb!3. Cafe Mocha $5.50++ A nice cup of mocha to perk me up during my later afternoon at Curious Palette. A good balance of chocolate and coffee. This fared alot better than the iced mocha, which literally was too diluted before the ice even began to melt.4. Iced Mocha $6.90++A very typical iced mocha, nothing fancy. It had chocolate powder on top of it. It tasted kinda of diluted, not a very strong chocolate, milk or coffee taste. I was kind of disappointed in this drink, considering the price that you pay and the fact they they had easily 4 staff behind the coffee counter. 5. Earl Grey Lavender Manjari Cake $8++ *Highly Recommended*This was the first cake that caught my eye in the cake display. It had a slight blue-ish purple colouring on the top. There were several layers to the cake, which the staff described as \"chocolate layers\" And indeed they were. They were chocolate ganache layers that had a lavender aroma and taste! The fragrance of the lavender was subtle but yet enough for me to pick it up! The cake was on the slightly dryer side, wasn't as moist as I had hoped it to be. But everyone on the table agreed, it was one of the most interesting cake we had ever come across!6. Pina Colada Tea $7.50This was a very interesting tea, as it tasted very fruity and even without sugar, there was a hint of sweetness. The sweet aroma itself, made me wonder about what ingredients were used to make this tea! Served in a tea pot, it's a pretty tea set that comes with this order.7. Berry Ricotta Hotcake $12.90++ *Highly Recommended*With vanilla bean ice cream, fresh seasonal berries, pumpkin seeds and sunflower seed. These are breakfast pancakes summer-style, ridiculously light, and lemony somehow! They are crispy like a biscuit on the edges and super soft and fluffy on the inside. Almost like eating a freshly baked moist cupcake!If you imagine the flavour of cheesecake combined with a texture that's best, if wordily, described as a kind of souffled griddle cake, you're somewhere near getting the measure of these.In my view, this is their fabulous delicacy and, besides, there is some accompanying fruit allows you to delude yourself that these are healthy.8. Spam Fries $11.90++These spam fries served with Kaffir lime mayo, which tasted like plain mayo. No lime fragrant or taste was evident. The spam fries though were slightly softer and tender in texture in comparison to other spam fries I've tried. The edgers weren't crispy though, they were just hard.Overall : It's quite expensive considering you have to pay 7% GST and 10% service charge. It can get quiet full, so do call and make a reservation. The food isn't all that great. Although I didn't try any mains, I did see alot of people order the soft shell crab at $22++. I would only come here for the Earl Grey Lavender Manjari cake or the Hotcakes.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hjNYCvFiGQ1F0buoPZ1YSA",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Berry Ricotta Hotcake $14.90++",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hjNYCvFiGQ1F0buoPZ1YSA/o.jpg"
      },
      {
        "img_id": "6GfF9-KXwY38lTlgjqEL2Q",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6GfF9-KXwY38lTlgjqEL2Q/o.jpg"
      },
      {
        "img_id": "euLMeIHeNfEsw0fb7z1Ujg",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/euLMeIHeNfEsw0fb7z1Ujg/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "RaqTx4JZyPgPmA17qevseg": {
    "date": "9/16/2017",
    "text": "The espresso here is top notch, one of the best in town for sure. Waffle ice cream dish was good as well although I'm not a fan but it's a 10 min prep. Honestly i wish I ordered the hot cake variety as they peak my interest. It's a 40 min wait. Next time come with people with patience...Venue typical Instagram hipster joint. Nice vibe.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gBy-cIXe0DQKhFjifu68Q"
  },
  "bPVG6U-ngYkMD9Ao9FLhSw": {
    "date": "10/6/2015",
    "text": "Updated my review from 3 to 4 stars cos the food is awesome too!Chanced upon this place walking down Selegie Road looking for a place to chill a little after catching a performance at SOTA.First impression : if you don't know what hipster means, you get your answers in this cafe. From the discreet sign outside the restaurant that scribbles \"Curious Palette\" in such a unreadable cursive font, to the ondeh ondeh inspired cake and of course chai tea latte, it's hipster stamped all over it. (Context as to why I used chai tea latte as a hipster barometer. Having recently been to Melbourne that has a super fantastic flare of hipster cafes, for a non-coffee drinker like me, chai tea latte is like the next best substitute for the inability to enjoy the great coffee brew. If you have chai tea latte in your indie lookig cafe, you are hipster certified. At least, in my opinion. Heh)Don't let the exterior of the cafe fool you as its quite a large cafe that stretches deep into the back. Plenty of seats and a pretty nice ambience. My friend had truffle mushroom soup and it was pretty awesome. Fragrant and thick, it's a pretty dense soup. As it was really late, thats about all we had, including a nice huge slide of ondeh ondeh cake. I still prefer the real ondeh ondeh as the beauty of the kuey is really being able to enjoy the sweet and warm hula Melaka burst in your mouth as you bite into it. That's something a cake cannot replicate. Good effort, but just not the same experience.Will be very happy to try it out again and this time, for the mains and the beautiful pancakes!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "G5AGdajNEkDC13EtwVyOpQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Seafood Aglio Olio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G5AGdajNEkDC13EtwVyOpQ/o.jpg"
      },
      {
        "img_id": "n2kMzl-DQBhCPGfNSQsNsg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Waffle with strawberry compote",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n2kMzl-DQBhCPGfNSQsNsg/o.jpg"
      },
      {
        "img_id": "svd2S9_u-0aWJY5aEiJYEg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Portobello and wagyu beef burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/svd2S9_u-0aWJY5aEiJYEg/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "i-RWv1gfNxyMo1w4XtzVng": {
    "date": "6/16/2017",
    "text": "Have been here couple of times and the food and coffee served are quite good, though I felt it was a bit pricey. Staff are helpful and friendly and the management really do care about their employees. Cosy setting, nice place to chill but it is usually crowded during lunch and dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_KewcLzfPSVtpc6LkMpBUg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Pulled pork.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_KewcLzfPSVtpc6LkMpBUg/o.jpg"
      },
      {
        "img_id": "Mrm2TnLi9PuUCewTMOm-sQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Omelette with mushrooms.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Mrm2TnLi9PuUCewTMOm-sQ/o.jpg"
      },
      {
        "img_id": "6zmzSs9zj0PGDOEQ0PPd_A",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Waffle with ice cream.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6zmzSs9zj0PGDOEQ0PPd_A/o.jpg"
      }
    ],
    "user_id": "e9Sn1IZZZ_1Qa_vUdtskjA"
  },
  "rXmPcxKJD9Q1XsZripZfVw": {
    "date": "5/28/2017",
    "text": "This place serves art not food. We went here daily for breakfast. Food is on point. Coffee is good. Has a hip/urban vibe, music is pleasing and not annoying",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RX4HjGtXkO09PGOD2Uwn2Q",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RX4HjGtXkO09PGOD2Uwn2Q/o.jpg"
      },
      {
        "img_id": "1G9Le6Tm--CMCEnNE7rN3g",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1G9Le6Tm--CMCEnNE7rN3g/o.jpg"
      },
      {
        "img_id": "_JWjmr43Glvfgq6Jc4HNdA",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_JWjmr43Glvfgq6Jc4HNdA/o.jpg"
      }
    ],
    "user_id": "LRVxkm1-XAutCxlSALZDqQ"
  },
  "-XS-x5t3Ix4vYE0XSYI3Pg": {
    "date": "1/9/2016",
    "text": "From the folks behind Strangers Reunion, comes a brand new hipster cafe-eatery with all the usual hipster trimmings - arty lightbulbs, reclaimed wood tables, custom coloured Synesso machines, bespoke denim and leather work aprons and the ever-present scent of artificial truffle oil in the air, not to mention a few mandatory hirsute baristas behind the counter. The only deviation from the hipster template comes in the form of the thumping club techno that's loud enough to make you speak just a bit louder than you'd normally do in a café. The place is definitely well decorated, and the lighting and layout seems almost deliberately set up for patrons to take instagram-worthy photos of their very photogenic food. Popped by for a coffee, so can't say much about the food. Friends had several variations of milky coffee, and I had a Kalita'd Finca Santa Teresa. The drip coffee was well executed, and highlighted all the rich, chocolatey, berry notes of the coffee. Craft beer menu looks decent as well - Brewdog Dead Pony Club and Green Goblin on draught, and a slew of very drinkable craft bottles. Would pop by again if I'm in the area. Despite the hipster trappings, seems like a place I'd enjoy returning to. Now if only they'd turn the damn music down a notch or two...",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "u-fIMbhafDbq2Dptl6CzJQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Synesso? Check. Lightbulbs? Check. Unpainted bar counter? Check. Hipster cafe CONFIRMED.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u-fIMbhafDbq2Dptl6CzJQ/o.jpg"
      }
    ],
    "user_id": "IzwsiilxLRG_jg3wKIUxpg"
  },
  "e5udMlHkOCQGktQhvNx72A": {
    "date": "12/26/2015",
    "text": "I have no idea about this place until a fellow Yelper suggested to come here. Located at a row of shop houses, this restaurant is easily recognised without a signboard. We were there with our goggle map showing us that we were at the right spot, but looking around, we saw signboards of others except for this one and when we went closer for a look, we saw the signboard in small blackboard on a chair. I am not too sure whether I am impressed with this idea. Stepping inside, I saw many paintings of Asian arts on the walls and it was pretty crowded. We had to wait for a while before our table was ready. As hungry as a bear I ordered the $22 plus Chicken leg, why so expensive? I was curious to find out. My friend's meal came quite fast while mine seemed to take forever to come (15 minutes later in fact) and my jaws almost dropped when I saw the portion of it. It was ok on the whole especially with the rice - I thought it was not bad. However, I wasn't full at that point as the portion to be honest has a lot to be desired. The service on the other hand was average, neither bad or good, guess there weren't enough staff around, but at least we didn't wait long for the bill. Well, I would come back to give it another go to try other dishes.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uemoWTFjZau5B4gLKZhJ3A",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uemoWTFjZau5B4gLKZhJ3A/o.jpg"
      },
      {
        "img_id": "_cds13h1d0ZsdP28vbIvrw",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Chicken leg - $22!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_cds13h1d0ZsdP28vbIvrw/o.jpg"
      },
      {
        "img_id": "LeHlTwSs0C5CplkJ_bVjPQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LeHlTwSs0C5CplkJ_bVjPQ/o.jpg"
      }
    ],
    "user_id": "Vtdm-QpN5yYxT-O00cuqFg"
  },
  "3TUdc19Qk0_G509II-0Gqw": {
    "date": "12/6/2016",
    "text": "This place has its ~*aesthetic*~ on point. The cakes were A+ as well. I can't personally vouch for the coffee but my friends seemed to be quite satisfied. There were all these complicated coffee things on the wall that my friends got all excited about so I'm assuming this place is legit. The place was packed on a Saturday afternoon and I saw at least two millennials just chilling reading the newspaper. Who does that. So cool. Keep doing it. TL;DR A nice, beautiful place to chill with friends and/or your favorite publication.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "BlEFnOjUxS_IRXYW0uZ3Hg"
  },
  "fYsOUIqrFzIkevCBcg76FA": {
    "date": "9/7/2015",
    "text": "This cafe was catching on the hype, so decided to pop by before queues start forming. Interior is a cross between Strangers ReUnion and Pacamara cafe, white washed with nice earthy details, and perhaps Magic (caffeinated drink) made me guess they're related to Strangers'. Anyway, menu sufficiently extensive to include the typical Eggs dishes, and several savory ones. (Appreciate that!) Food was decent but not mind-blowing, if this place doesn't get too crowded, will patronize it more often.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "a2qUTq2k2KM4xjatK70Zsw",
        "caption": "Photo of Curious Palette - Singapore, Singapore. The visually pleasing and lip-smacking Berry Ricotta Hotcake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a2qUTq2k2KM4xjatK70Zsw/o.jpg"
      }
    ],
    "user_id": "cLIlR-ngTMqWHHSl38y7kw"
  },
  "YeBp1uqGL-2qQ61AXYLoeQ": {
    "date": "11/4/2015",
    "text": "Great ambiance, though definitely on the pricey side. Also good for impromptu brunch plans since we waltzed in at noon without a reservation and managed to get a seat immediately. Service, while not particularly prompt, is polite and attentive.Salmon was well-executed, moist, flavorful and complete with a crispy skin. The guacamole and haloumi were definitely a nice touch, though the bacon scone was a slightly bizarre addition to the dish. Didn't seem to really jive with the other elements on the plate. For the portion, it is on the pricey side though. Pulled pork sandwich was decent, with an adequately thick slice of bread to hold the mound of pulled pork. Egg was also perfectly poached.Truffle fries were awesome and special mention to the truffle aioli. They do, however, charge for topping up the aioli.The lavender manjari was great as a chocolate cake, and while photogenic, the lavender taste was imperceptible. Spent approximately $80 for 2 in total for brunch. Saw neighboring tables order the famous berries hotcake and would love to try it one day when we aren't overly stuffed :P",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Cgq8lp56OHV5Vs7_sVeamg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Salmon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cgq8lp56OHV5Vs7_sVeamg/o.jpg"
      },
      {
        "img_id": "JcOMd9mSfWztv-HQG1DmSg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Pulled pork sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JcOMd9mSfWztv-HQG1DmSg/o.jpg"
      },
      {
        "img_id": "0NStwPy_m3M1Zq6Py7rj6g",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0NStwPy_m3M1Zq6Py7rj6g/o.jpg"
      }
    ],
    "user_id": "seb6_XUoH4q-mtJ6pCCXlg"
  },
  "sPzEeIhsK2PSxX3aw15yeQ": {
    "date": "8/28/2015",
    "text": "New place in the neighbourhood, suspiciously similar to Strangers' Reunion - which leads me to assume they're related. Great decor and a much better vibe than the stupidly overrated Forty Hands. And with better coffee (on par with Strangers). The brunch menu has usual fare - eggs and salmon and such - but throws in a few more interesting items like pulled pork and coddled eggs. There's a dinner menu which sounds pretty good too, and we'll be back to try. Pancakes are crazy looking things that look more like cakes, and will also be a must-try on the next visit. Food was good - not going to waste words trying to describe every element. Solid and good. (Service generally good but unfortunately let down by the inevitable resident sour-faced angsty hipsterish polytechnic student waitress)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5UOIjjKjTaWL-bOm1tBZXg",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Special of the day. It was nice without being outstanding. At least it was comparatively healthy.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5UOIjjKjTaWL-bOm1tBZXg/o.jpg"
      },
      {
        "img_id": "zcy51kaGjvSDRYZdivQR2Q",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Brekky menu.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zcy51kaGjvSDRYZdivQR2Q/o.jpg"
      },
      {
        "img_id": "guYc2D--bN1xiHFwC3lvAw",
        "caption": "Photo of Curious Palette - Singapore, Singapore. I don't know why my plate was wet....",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/guYc2D--bN1xiHFwC3lvAw/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "YvGrw_2XwPWPJ5MYNHqW1w": {
    "date": "8/26/2017",
    "text": "Great coffees, nice brunch options and the ambience at the place was very cosy too. Keep it up.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTS3MDcJOUEDi70jiAOYfw"
  },
  "sDCEER7YMweNs5ztSJ6sGw": {
    "date": "11/21/2015",
    "text": "We popped in for a quick brunch- the place was packed. The decor is nice and the menu had good variety. Due to the layout, it seems like there was a constant echo where we were seated. We ordered the pulled pork sourdough and the baked eggs. The food was passable - won't say that it was amazing. The pulled pork was pretty good but the eggs were too runny and cold. Overall service was cold and not very welcoming. The price point is also pretty high.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmZk86ubu7Kt7HZ5Gn_8xw"
  },
  "sKxSxxgPET7G0cJrN5c8lQ": {
    "date": "8/29/2015",
    "text": "For brunch, perfect place. Trendy and modern with a slightly rustic effect.. the food was good. Ricotta took 30 mins but friends said it was totally worth it. Had the waffle myself and was good. I would rather have had the scrambled eggs with portobello mushrooms..they looked a lot nicer! Definitely worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NCXKd46zBLFFK5RRQrO8hQ",
        "caption": "Photo of Curious Palette - Singapore, Singapore. Waffles!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NCXKd46zBLFFK5RRQrO8hQ/o.jpg"
      },
      {
        "img_id": "_966_MOyCBQGAohyqlDSzw",
        "caption": "Photo of Curious Palette - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_966_MOyCBQGAohyqlDSzw/o.jpg"
      }
    ],
    "user_id": "gxuJBymMbg82cM_3M6J-vQ"
  },
  "3p70nTeOe3zSu3TFiUpj1w": {
    "date": "3/7/2016",
    "text": "My friends and I needed a place for dinner on Friday that was close to Cathay as we were watching a movie afterwards. We booked some seats at Curious Palette purely because it had pulled pork sandwiches on the menu and that is enough to get me excited. Eating proper meals at hipster cafes is always a risk because they are probably more adept at making coffees or reselling central kitchen cakes, than cooking proper food. That turned out to be the case but I'm not surprised. First, the good thing about Curious Palette is that the cafe is in a fairly long shop house that stretches to the back. There's quite a few tables and waiters/waitresses running around so you can get decent service. The decor is bright and I could see why people would want to hang out here. I arrived for dinner last and was seated at our table for three at a seat with the back facing the \"walkway\" where servers constantly were passing through. It wasn't a great idea because I felt like I was in everyone's way all the time. I ordered a \"wagyu\" burger, while my friends ordered the chicken confit and fried chicken (yes apparently they like fowl), as well as a bottle of NZ Sauvignon Blanc (the wine list is extremely limited and obviously curated to meet the $50-70 price point so you either get overpriced pedestrian village (in an attempt to satisfy the old world lovers) and a not so overpriced new world selection, since the latter tends to be cheaper anyway...so we went with the latter). My \"wagyu\" burger was tasty with a heavy dose of truffle derivatives/seasoning on it, but the meat/fat wasn't mind blowing so it made me wonder why bother using a low grade of wagyu just for marketing purposes. At the $20-30 range, this is likely to be Australian \"wagyu\" chuck though I would guess the cow is actually a mix breed, given the lack of fat and real flavor. To use a really poor analogy, its like being promised plate of char kuay teow without the fried lard - tastes fine and you can probably hide the lack of lard with some wok hei, but it's not the same. What annoyed me a little more was the doneness - I asked for my patty to be cooked medium because unlike steaks, ground meat can be quite mushy and grotesque when it is below 140F in the middle, which was the case with my burger. I sent back my burger a second time and was told by the kitchen that anything with a medium doneness will usually err on the bloody side and all I've to say is...get a good broiler or a sous vide machine? I am paying at least an arm for this burger. Anyway the accompanying sweet potato fries were fine, the fried chicken my friend ordered was crispy and juicy and the wine did its job (although our glasses were unbelievably frozen and the waiter clearly wasn't trained to pour wine). So yes, a meh passable experience. Maybe it's just me but does hipster = expensive and nothing except the coffee is supposed to taste great?",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zbO5Cpuu0svXn3br0T84Q"
  },
  "CbcIrgwQpbh7SabStEOHRw": {
    "date": "11/28/2015",
    "text": "I like the bright and open feel of this cafe. Food was pretty good, especially the pancake (very fluffy and moist). The baked eggs dish could be done better with the eggs cooked a little more - so maybe you can tell them this when you order. They did forgot our order and it took a long time for try baked eggs to show up, but they didn't rush us to leave at all after we finished our food and stayed a little longer to do some girlie catch up.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTU3uJ6AEXzWw8LEuOjsLw"
  }
}