{
  "c15dRjrmUqcgzkU8if-i3g": {
    "date": "6/4/2016",
    "text": "Real Food has improved for the better!When I lived in Novena many moons ago, I remember avoiding this place during lunch or when I was extremely hungry, because the food would take a long time to come out.I came by during lunch recently and it looks like their kitchen runs a lot more smoothly now- no more long waits!I also enjoyed the grilled veggie tomato pasta that I ordered. The portion was perfect for me and the veggies were grilled perfectly. It was totally worthy of the 'gram! ;)A great spot in Novena for your healthy fix!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s7vGnrXu8BtAcw2Yx-lV6g",
        "caption": "Photo of Real Food - Singapore, Singapore. Orange carrot juice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s7vGnrXu8BtAcw2Yx-lV6g/o.jpg"
      },
      {
        "img_id": "MmcA-4q9GnvMF6HCpJdiQQ",
        "caption": "Photo of Real Food - Singapore, Singapore. Grilled Veg Tomato Pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MmcA-4q9GnvMF6HCpJdiQQ/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "xhJyhSBD79WgciEKNYI8Rg": {
    "date": "5/31/2016",
    "text": "I have been loving this healthy vegan cafe on my week in Singapore for work. It's always good to balance your food indulgences in Singapore with a few healthy options thrown in there.I have tried their classic green salad and also the quinoa patty, both were great, the salad dressing was outstanding, I even asked for the recipe! Their food menu is insanely long; pizza, pasta, stuffed capsicum, salads and so much more. They have a list of juices and coffees, though I found the juices to be very expensive compared to other juice prices in Singapore.There's plenty of seating, even when there is a long line at the counter. I'll be back!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "eWEHvmTUq8iFyz14esyeXA",
        "caption": "Photo of Real Food - Singapore, Singapore. Seating area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eWEHvmTUq8iFyz14esyeXA/o.jpg"
      },
      {
        "img_id": "FwsX9hqjmEopLNXwcBSm8g",
        "caption": "Photo of Real Food - Singapore, Singapore. Seating",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FwsX9hqjmEopLNXwcBSm8g/o.jpg"
      },
      {
        "img_id": "cIWHmg-wkBERaa7TQo-G9g",
        "caption": "Photo of Real Food - Singapore, Singapore. Quinoa patty and salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cIWHmg-wkBERaa7TQo-G9g/o.jpg"
      }
    ],
    "user_id": "IKwsGotasR27FMY2eQ2gHg"
  },
  "TG4I5xVnvHIAW9h2VOUI1g": {
    "date": "1/20/2016",
    "text": "No. Just no.I ordered the vegetable balls spaghetti.The entire dish is hella dry and flavorless.Could use a whole lot more herbs and spices and use fresh tomatoes to retain moisture while adding flavor.I've never imagined how bad spaghetti and marinara sauce can taste, but now I know. My aunt ordered the mushroom pene pasta (with cheese) dry and tasteless too. So disappointed! So expensive too!!! ?!?! I'm better off with microwaved TV dinner food. =.=''Way overpriced, I mean there's a juice bar one step away, it sells fresh juice for $3.50 a 16oz cup, real foods sells juice for $8 and up, for a 8-12oz volume. ?!?!?! Epic fail. 0/5 if it's an option.Just look at the pictures others posted.(I Should've checked Yelp reviews before dropping in.)",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aIZzLpe9iAt2oLV_xAkkaQ",
        "caption": "Photo of Real Food - Singapore, Singapore. Looks decent, tastes awful.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aIZzLpe9iAt2oLV_xAkkaQ/o.jpg"
      }
    ],
    "user_id": "umXjzK8xzN3q5v4-O6iEIg"
  },
  "4Um8IehJrWxvQAzgjsCyOQ": {
    "date": "5/26/2014",
    "text": "Essentially a place selling vegetarian food in a trendy cafe setting. They have both western and asian favourites which were prepared in a kitchen just away from the main seating area. At the seating area itself, they have shelves and shelves of books for folks to read while enjoying their meals.I found their food quite nice as vegetarian food is not easy to achieve full flavour. I personally won't eat here again unless a treat is given!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "huo072bwLxKPnLuiF4tVvw",
        "caption": "Photo of Real Food - Singapore, Singapore. Fried Vermicilli",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/huo072bwLxKPnLuiF4tVvw/o.jpg"
      },
      {
        "img_id": "XQAOzSTplgqg8Ag6pwr7VA",
        "caption": "Photo of Real Food - Singapore, Singapore. Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XQAOzSTplgqg8Ag6pwr7VA/o.jpg"
      },
      {
        "img_id": "aV5Znq7v4oucOPhuQV1lmA",
        "caption": "Photo of Real Food - Singapore, Singapore. Mushroom Dumpling Soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aV5Znq7v4oucOPhuQV1lmA/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "6HoW5TpbclWu5hxLLFvpEg": {
    "date": "10/12/2014",
    "text": "i've been eating here even before i started yelping. i have tried 2 of their other branches (1 at central and 1 at killiney). this is my first time at this branch.  I always make it a point to try something new here and it doesn't disappoint. First, because of the fact that it's healthy. 2nd, they prepare the food just right after you order (so, you have to wait). 3rd, it suits my taste. My favorite so far is their pancake. That's when I realized that eating healthy can be so delicious. Me and friends always order this for sharing. So there, eat healthy y'all. :)",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 2,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "nU7nAuqCDIsYMcpbdg7nOA",
        "caption": "Photo of Real Food - Singapore, Singapore. spinach arrabiatta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nU7nAuqCDIsYMcpbdg7nOA/o.jpg"
      }
    ],
    "user_id": "qngnHjKy96xsoT0cZfCsWA"
  },
  "6eRtCTIhvBGb_jw6DfLJpg": {
    "date": "6/10/2016",
    "text": "First time try Real Food, I ordered the Spanish tomato panne. Honestly, the taste is just OK, costs me $10. I won't recommend this to my friend. There is definitely a reason that the restaurant is quite empty during peak hour.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "omSUD8pJOEV5wVA_O8-8uw",
        "caption": "Photo of Real Food - Singapore, Singapore. Spanish tomato panne",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/omSUD8pJOEV5wVA_O8-8uw/o.jpg"
      }
    ],
    "user_id": "pleuwe-nwHz3SEkWhfUAGg"
  },
  "NWNEiaHcUw6MZP1MoPWAYw": {
    "date": "12/28/2016",
    "text": "Pretty good food overall and fast service. Slightly pricey - $7.50 for a small cup of hot cacao, and pretty oily. While the food is decent, it lacks uniqueness; I'd much prefer places like Angel's Bistro, Genesis, or one of the vegetarian restaurants at Fortune Center.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XXA7fgjMl-qko6M_f6WRXQ"
  },
  "FDleCq6f2j8Vt4Zb9S3Wbw": {
    "date": "4/20/2014",
    "text": "Not a fancy place, but a fantastic workday lunch choice! I've eaten here more than a dozen times over the past months, and this place has never disappointment me. I really enjoy the purist, REAL taste of the food: there's very little use of sauces and spices, so you can enjoy that real taste of the pasta, the omelette, the tomato,... you name it! My favorite is their Spinach Arrabiata Whole Wheat Penne topped with feta cheese.The best thing is that whatever you eat here, you don't feel the post-lunch food coma! The only real drawback is the location: surrounded by a number of other take-away food places, and with no real enclosure, this place feels a little too noisy for a quiet lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AGufx810KcaxPYpvRFEC4w"
  },
  "bb3hQHjZ01sjYLtssgAhCg": {
    "date": "7/27/2014",
    "text": "This place reminded me a lot of Ruggles Green in Houston. You walk in and they offer a variety of different organic items including kale chips, tortilla chips, nuts, chocolate bars and more for sale at the counter. The menu looks very vegan-friendly, but Paleo folks will still have a limited selection. It's still do-able, though. What lured us in was the brown rice milk ice cream. Yup, it's a cheat - we know...but we so rarely get ice cream and have surprisingly struggled to find coconut ice cream in Singapore...that we caved. Must have been the \"Cave\"man Food we had next door just beforehand. :)We had a fairly substantial wait at the counter - the employee was busy juicing and didn't even bother to turn around to address or greet us until we politely coughed to get his attention. Then he merely told us and another woman that had also walked in to hang on. We finally ordered the dark chocolate to share and it was creamy and just the right consistency. It disappeared quickly! They were also offering strawberry, hazelnut chocolate and a few others. We might have to try out something new if our will power gets the best of us again! :)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z-9phPgBcVsvZ6j5xnkLtA",
        "caption": "Photo of Real Food - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z-9phPgBcVsvZ6j5xnkLtA/o.jpg"
      },
      {
        "img_id": "ArHsgwwuNZGDaqrKspKDhQ",
        "caption": "Photo of Real Food - Singapore, Singapore. Brown rice ice cream",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ArHsgwwuNZGDaqrKspKDhQ/o.jpg"
      }
    ],
    "user_id": "IOtmx8Zebl3wOOqNEobFMw"
  },
  "Tf9rcdSjM2uENMwqI__6BA": {
    "date": "5/5/2015",
    "text": "I'm staying at the Oasia hotel for a few days and have been enjoying the food here. Their steam dumplings is a must try because one can really taste the freshness. I've been eating here for 2 days straight and they already recognize me when I come in, must be my American personality or maybe I have something on my face. Lol. It's a very calm and friendly eatery, which is a plus.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vr2CHRwxIHZBIT16zFkd9g"
  },
  "Ygypo0spTtS_M3AR-bOcKw": {
    "date": "8/26/2013",
    "text": "I was hesitant to eat here because \"healthy\" foods IMO do not taste as good.  But after trying this place, I definitely recommend it.  It had American and Asian (which is rare) food that was healthy.  It's not a fancy place by any means and is a good place to stop by when you need to grab a bite to eat with a friend or friends.  I ordered the spaghetti which was decent (a lot of sauce) and miso soup ($7.50).  Strange combination, I know but that's me.  The only con about healthy food places is that it takes a little bit longer to cook but good food for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKXG8pIWcN27PHk8JSIcig"
  }
}