{
  "lwBK2mHuIJ18lWlbQn9Vug": {
    "date": "11/8/2018",
    "text": "The black pepper crabs here are superb. I think this is one of the pioneers in Singapore who created the crab series that spread across the world.Another must try is their clam soup. It's slightly spicy but smell and taste amazing! If you have the budget, their Portuguese lobsters is the bomb. The creamy sauce combined with the crispy lobster is heaven. I highly recommend this restaurant to anyone looking to have great seafood!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BWyIlKtksvImRLA-khDXgg",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BWyIlKtksvImRLA-khDXgg/o.jpg"
      },
      {
        "img_id": "4tj0RUE479kXgOtDwiAbEw",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4tj0RUE479kXgOtDwiAbEw/o.jpg"
      },
      {
        "img_id": "HKmIoF1uucmtSJxXu0-yzQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HKmIoF1uucmtSJxXu0-yzQ/o.jpg"
      }
    ],
    "user_id": "wAogVauOPcBmX0ZNM8jgyw"
  },
  "dqAbqbGB7GsBSN5_ly2sMw": {
    "date": "7/8/2018",
    "text": "I dream of the BlackPepper Crab from time to time.The meal was delicious, the service efficient and friendly.The prices were a bit steep, but a memorable meal nonetheless.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rsjoaxSX6dNyjy0iyVQ9oA"
  },
  "ahbeT_BD3IoElr0hC7ufjw": {
    "date": "2/28/2018",
    "text": "One of the best crab I've had in my life.I came in looking to try Singaporean's signature chili crab.  When we read on their menu that they are the creator of the best black pepper crab of Singapore, we knew we had to try that as well... and oh man I'm so glad we did.On our way to the restaurant, our Uber driver who is a Singaporean native recommended we ordered the buns as well so we ordered two per person.  Both dishes were amazing.  We started with the chili crab which comes in a flavorful sweet and tangy tomato based chili sauce.  There's plenty of sauce so the buns came in handy to soak it all up.  We moved on to the black pepper crab and wow, that sauce blew us away.  The sauce has a black pepper kick but just the right amount.  I'm the type to douse my ketchup with black pepper so I have an immense love for this flavor.  I was so so glad we ordered this dish.  2 crabs for a party of 2 was perfect.  We could have done with just 1 bun each as our focus was on the crab.Service was extremely attentive although it took some waving down to get our bill.  They offer you nuts when you are seated.  Please note these are not complimentary so if you do not want them, don't accept them.  Napkins are limited - instead, cleanse your hands with the hot warm water provided.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "J2te2StyxbTw8WbhmoPAHA",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Chili crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J2te2StyxbTw8WbhmoPAHA/o.jpg"
      },
      {
        "img_id": "Su45r0supakXp6b_yFeSsA",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Black pepper crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Su45r0supakXp6b_yFeSsA/o.jpg"
      }
    ],
    "user_id": "a4MT0vlZaFNAcs_ICuIZrA"
  },
  "bw-mLczxY2tSMPXlNI2eoA": {
    "date": "4/15/2018",
    "text": "Chili crabs are a must when in SG. We initially planned to visit Jumbo but ultimately went to King for the fact that they accept reservation. I had no chili crab baseline to compare to but King's was really tasty! Very saucy - my husband slurped it up like a soup, I drowned every grain and green in it. A good balance of buttery aroma and sweet chili. Fried buns are a must for soaking up every drop. I easily downed a whole dozen myself. Salted egg fried shrimp - apparently salted egg on every edible item is a huge trend in SG right now (ie fish skins, chips). Salted egg fried shrimp - another genius invention. Crispy head on shrimp dusted in  broken salted egg. Perfectly seasoned - I ate all parts shells included. Curry crab noodle soup - hugeeee pot! Very soothing - not overwhelmingly curryful which allowed the crab's natural sweetness to fill up each bowl! Soy steamed local fish - I can't recall the name of the fish (I was told it's not the most attractive). But the meat was so moist, flaky, and sweet! They also offer a deep fried version. Stir fried egg noodles - yummm, plenty of wok flavor and heat. Nothing like the Chinese version, the flavor was spot on. A great balance of sweet, salty, and spicy. They also offer a handful of non seafood dishes (mushroom beef tenderloin, general tso chicken). They were fine but I would stick to their seafood items tho. Overall - we enjoyed our meal tremulously! Don't forget to ask for gloves+bibs and get ready for a feast!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zcCk1lyQ8qy1b6FLbRyYiQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zcCk1lyQ8qy1b6FLbRyYiQ/o.jpg"
      },
      {
        "img_id": "TmeHkytQYqLuyEqg4lV9RQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TmeHkytQYqLuyEqg4lV9RQ/o.jpg"
      },
      {
        "img_id": "cRl8C2OuWlwpHgeeOLbzWg",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cRl8C2OuWlwpHgeeOLbzWg/o.jpg"
      }
    ],
    "user_id": "8zXgNCkusOHMwh5Tj_8yCQ"
  },
  "eDXd1EbBu7XncGV--iPLHw": {
    "date": "2/16/2018",
    "text": "One of the best places I had for Chilli Crab. The man tou (bun), is crispy when its hot and perfect combi for the chilli crab gravy. The bamboo mussel is delicious with the mouthful of garlic topped on it.Can't miss this pan fried carrot too. It's my favorite dim sum item and yummmmmmmy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XIBu8cdzv7-HX2nxd_0wBQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Pan fried carrot cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XIBu8cdzv7-HX2nxd_0wBQ/o.jpg"
      },
      {
        "img_id": "_M5MgxTELBVE5fCE7scffw",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Chilli crab and mantou",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_M5MgxTELBVE5fCE7scffw/o.jpg"
      },
      {
        "img_id": "vxEyr4RYR_STxMhyMeMhvg",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Chicken feet",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vxEyr4RYR_STxMhyMeMhvg/o.jpg"
      }
    ],
    "user_id": "72cr3sRaakTv2Znw_QQ8Cw"
  },
  "-DtP_5s_nqQeJ0Ile2fGtA": {
    "date": "12/29/2017",
    "text": "How this place doesn't have five stars boggles my mind. Service was great (not that you should care about service in any Asian country). It was raining outside after we finished and they suggested we sit for a little while until it stopped raining. On to the food! We came here for 2 things of course. Chilli crab and black pepper crab. It was just my wife and I, they let us get a 1.9kg crab and cook it both ways. I'm not going to tell you how each tasted because I don't want you to have any preconceived notions on how it should taste, but both were mind blowing. Like nothing I've ever had before. I was moreso looking forward to the chilli crab because that's what Singapore is more known for. But that black pepper crab...boy was it tasty. I feel like this place reminds me of Philadelphia. You go for the cheesesteak, but those in the know actually get the roast pork with broccoli rabe. I'd suggest to get both either way, they're both great. The fried bread dipped in the sauce was also super good. Come here and don't listen to anyone else's reviews that aren't five stars. They're just bitter people who nitpick on everything.It is a bit pricey, but Singapore is an expensive city so chill the fuck out. Our 1.9kg crab cost $156. Most places will be around $65-70 per kilo so it's right in that price range.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NeXXwr0jU3t2KcywWRGcwg"
  },
  "FkM01Cgo3Ise6xqD0tXHEg": {
    "date": "8/28/2018",
    "text": "The Chillie Crab is to be had here.  It's an open setting with plenty of options for 'set meals' or 'a la carte' - you can't go wrong.  The crab is served first, and sadly the other items arrive haphazardly after... Singapore has a horrible service industry.  I am told they do not pay their waitstaff and therefor will not find professionals until they do.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRA9nP5cnGiW-qCOgeAyow"
  },
  "vl1W3cQNJ9s7QF0bh8mEWA": {
    "date": "2/18/2018",
    "text": "This place is a complete nightmare! It's not meant for tourist as they will not have their eyes on you AT ALL! I guess this it's how they treat tourist people ! From asking for the menu to ordering your food! Waited 5 minutes for the menu to get to you, 15 minutes for your order to be taken, 1.5 hours until my order was put in (after I asked about my food). They freakin forgot to put my damn order in!!! Had to ask for my tea to be refilled as the girl walking around didn't bother checking on my table! They don't even deserve 1 star! I wish I could give them a negative! I don't understand how they get such good ratings! Probably getting their ratings from the friends & family! Just an advice to the people working at this restaurant.. never judge people by the way they dress nor have any body tattoos! I'm not there to BEG for food... I'm there to PAY FOR MY OWN food!!! We all should be treated equally! From the moment I walked in, I could already notice by the facial expression that you people didn't want to sit me at the table! All I could say is  out! You don't deserve my time or my money!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "e6QMaa9r3Jhvl8NWLq2jBQ"
  },
  "IMCFpfsw8NmVaoetfyPwww": {
    "date": "10/12/2017",
    "text": "Man, it's hard to find consensus on chili crab. You search for \"best of\" lists, and some of the recommendations have terrible reviews. You walk down the street and see some that look good - reviews say the exact opposite. Is there any place that everyone loves? Make it easy on a tourist, huh?But this seemed to be the closest to a safe bet that I could find, plus it was pretty convenient. So I made the trip and I was not disappointed. I went bog standard - chili crab with fried buns. I was asked, do I want them steamed or fried? Well, what would you recommend? \"Oh. You want the fried.\" OK then.The crab came out, steaming hot, too hot to hold, honestly. Along with it was provided a sealed wet towelette, a glass full of those over-sized plastic (not rubber/latex) gloves, a bunch of paper napkins, a pair of chopsticks (to do what with? I know I'm not great at chopsticks, but I'd love to see someone use them to eat a whole crab) and a shell cracker (but the crab is broken up, partially cracked already). I proceeded to coat myself in the sauce...because eating this is a mess.But oh is it worth it. When you extract a big hunk of crab meat, and you dredge it in the thick, spicy, tomato sauce...I was literally getting exciting, thinking \"oh yeah, here it comes\" to myself as I got each bite out of the shell and got ready to eat it. And the buns, holy cow. A golden thin and crispy outside, steamed white bread goodness on the inside. I exercised restraint and did not order 47 more of these - I wanted to return the plate to them pretty much spotless after wiping up every last bit of the sauce. I'd bathe in the stuff.It was pricey - easily the most expensive meal I had in Singapore, by almost a factor of 10 over most meals. Part of that is because I was mostly eating at crazy cheap hawker stalls and kopitams (and loving every second of it) and part of that is because chili crab tends to be expensive. But this was worth it. I'm glad I sorted through reviews, I'm glad I spent the money - just great.I'm going to hold back a star for what I think is some sad nickel and dime. For example, they charge you for the wet napkin. Seriously? OK, yeah, it's 30 cents. NBD. But...they don't tell you until later. Plus they charge you for \"peanuts\" - this was on my bill even though I didn't get any (but the waitress caught this herself and took it off). They charge per bun (This is can understand, although this is also where they could easily get me, I wanted to tell them not to let my plate get empty), but they don't tell you that. Apparently this peanut and napkin thing is common - I even saw signs near rows of restaurants warning of the practice - but...it just seems really petty when I'm paying 100SGD for a whole crab.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tPufvUuxXLJOMYQ7gzsMVA"
  },
  "-Km6hpmNVeHIppYmEMUhXA": {
    "date": "7/9/2017",
    "text": "For big group of business meal or family gathering, I think ok to dine here. If you are focusing on food quality itself, I think soso only.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2T0fllpf1mYNg56YWkCtgg"
  },
  "WhrMeodXc3bVx90jKmRjNQ": {
    "date": "1/30/2014",
    "text": "It was finally time tonight for me to try Black Pepper Crab.  I chose Long Beach Seafood because I wanted to explore a new District so I MTR'ed to Mountbatten to try it out over in Kallang.The entrance has an odd air of cacophony as multiple workers each with title badges parade about doing what they do best from the supervisor supervising to the cashier person pricing things.  Although they speak English, an awful lot got lost in translation which left me an uneasy patron unsure where I stood with regard to the pricing of what I was ordering.  As an illustration, I asked for a glass of beer (@$7.75) but wound up with a jug of beer ($23-ish) because the owner assumed I wanted a jug because I'm a stupid tourist or because I look like the type of person who wants a jug or he wanted to maximize how much money he could get out of me and simply willed me to have more than what I asked for.  I didn't appreciate that even if the intentions were good.Also, communicating our order was a bit of a guessing game.  The menu lay-out was confusing.  It had pricing but it seemed difficult deciding what to order.  The Crab menu was baffling too.  No pricing but evidently the \"large\" weighed between 800-900 Grams (whatever that means...too bad I didn't have a measurement converter ap on my phone) or the larger Sri Lankan crab weighing at around 1,000 grams.When we asked the server, it wasn't clearly explained to us and came off as if the price were $62 for either order which made no sense.  Because the communication wasn't clear, my appetite was waning.We ordered a few other items such as baby gai lan, a shrimp dish, and this fried tofu dish.All in all the dishes were ok.  I must admit that I was still excited about the Black Pepper Crab and when it arrived, I was in for a battle.  There was quality in the flavor and it became the only focus of my attention once it was plopped there in front of me.  Black pepper crab is buried in a pepper sauce giving the crab an almost medicinal flavor to it.  Initially, it's strange but then it becomes good.  It took me forever to eat that crab and I was a complete mess by the time I finished it.  That became a problem because all the other dishes, which I ignored, became cold by the time I was done.Throughout the eating process, I felt an uncomfortable \"chi\" there.  Staff were constantly darting by my table and seemingly marking me too often which was distracting.On the other hand, they were good about tending to my needs such as clearing away my plate that had carved out shells.  The service was also very prompt in general.  Food came pretty quickly, etc.But the overall vibe here made me uncomfortable for some reason.  It wasn't a fun place to eat at as the sound acoustics were noisy and the staff constantly rushing by made me dizzy.  I guess the table wasn't a good location giving the working dynamics of this restaurant.By the time it was over, we left paying over $200 and didn't really feel it was worth it.  If anything, I wouldn't pay that much to come here again even though the food was pretty good.I wouldn't recommend this place for a tourist, but, they do give their best and the place had certain good qualities to it like high traffic and clean overall facilities.Loved the tank filled with lively Alaskan King Crabs to the right of the entrance.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n5TZKsV2tmecLedt9XeIDQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Very Healthy looking King Crabs.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n5TZKsV2tmecLedt9XeIDQ/o.jpg"
      },
      {
        "img_id": "zr49VzA7kSbxI7fUogaeuw",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Black Pepper Crab.  Pretty good but very messy.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zr49VzA7kSbxI7fUogaeuw/o.jpg"
      },
      {
        "img_id": "wVvpOyqsDETG-FP8c-sVcw",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Sign to Restaurant.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wVvpOyqsDETG-FP8c-sVcw/o.jpg"
      }
    ],
    "user_id": "pMltyeuU4SjT6Y8YVy7HBA"
  },
  "g80dORmfkY-uN7HB4b_sGA": {
    "date": "10/4/2015",
    "text": "Pepper crab and chili crab are good! Price at the high side. Overall, if you like to eat crabs, you can try it there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sNwdCYKXp8yeRuQw6H6OMQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sNwdCYKXp8yeRuQw6H6OMQ/o.jpg"
      },
      {
        "img_id": "rADPUdDi_5Pm-mHhjRcVKA",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rADPUdDi_5Pm-mHhjRcVKA/o.jpg"
      },
      {
        "img_id": "NOYoLiR3lkb1hFz03jQLlQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NOYoLiR3lkb1hFz03jQLlQ/o.jpg"
      }
    ],
    "user_id": "ncYCYyfD6H_cVgv8KxOgww"
  },
  "HmrRoG9-rWRWH9GXUw1oog": {
    "date": "6/18/2013",
    "text": "I know so many people that like crab but hate the work that goes with it.  Well, at Long Beach King they will make you very, very happy as the staff is willing to take the meat out of the claws for you!  During our recent visit to Singapore, we had a fabulous dinner here.  Long Beach's Chili crab was the best according to my husband.  I'm sure that them shelling the crab for him helped to make that declaration!  They served the crab with these buns that you use to sop up the chili crab sauce.  The buns look like regular old buns, no big deal. But when you take a bite, WOW, they are amazing!  Apparently, they steam the bun first and then deep fry it!  It is like an unsweet donut.  yelp.com/biz_photos/long…My personal favorite dish during this dinner was the Dong Bo Spare ribs.  These little gems were tender and flavorful.  I loved it.  You can tell they were slow cooked as the sauce reduced down to a sweet and savory glaze.  It had me thinking of trying to recreate it when I got home.  yelp.com/biz_photos/long…Long Beach King had a dish that I've never seen before.  They stuffed tofu with minced prawns and then deep fried the whole thing.  Everyone loved it.  yelp.com/biz_photos/long…The service at this restaurant is impeccable.  We had our plates constantly changed and our teapot was never empty.  When we make it back out to Singapore, we'll definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "bC0rTOnvT8IryiYLZdiCYw",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Baby cabbage with mushrooms",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bC0rTOnvT8IryiYLZdiCYw/o.jpg"
      },
      {
        "img_id": "m-uQmFvgKI8BFfx1eXInLQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Dong Po Spareribs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m-uQmFvgKI8BFfx1eXInLQ/o.jpg"
      },
      {
        "img_id": "HM_iho3AR4JHCH14cR0VKQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Chili crab with buns to sop up the sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HM_iho3AR4JHCH14cR0VKQ/o.jpg"
      }
    ],
    "user_id": "0-8xgsuDBJOS5_L8YH4SZQ"
  },
  "UHE6SQmrKUVpvjzMpB-tvQ": {
    "date": "5/21/2017",
    "text": "Good crab but a bit pricey. Bamboo clam is alway my favorite. Fried rice is not worth trying . Fried mee goreng is ok. Fried tofa ok only. Best part still the black pepper crab. Chilling crab is ok but is not spicy and more for overseas European guests.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hlPAcqkdrWZQdlpL8Lcfyg"
  },
  "IShPaD-Im-vmzMj9GJbaNg": {
    "date": "3/24/2015",
    "text": "We had great pepper crab and great chili crab here... service was super friendly, but it was a bit slow. We had to order a couple of things twice as orders were just not turning up.Overall, it's a pleasant restaurant with reasonably good food... and worth a trip for the pepper crab and chili crab alone :-)   ...however, make sure you bring a credit card ;-) - it really isn't inexpensive...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RmMbDOMp_BFS_kllQbRNxg"
  },
  "RW4MOQJRjmJ8uXXPVSMsPw": {
    "date": "3/24/2013",
    "text": "We love coming to this long beach cos the chili crab here is phenomenal!! We have had so many other chili crabs around and this is always our fave go to place for seafood! Get the deep fried man tou and dip in the chili sauce! The black pepper crab is also to die for! The black pepper is fried very well and is extremely fragrant! Must try!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TAGjeGbTizp3KXNErPAIIg",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Chili crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TAGjeGbTizp3KXNErPAIIg/o.jpg"
      },
      {
        "img_id": "PBTuQFedC8CB21c5Cc9fnQ",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore. Black pepper crab",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PBTuQFedC8CB21c5Cc9fnQ/o.jpg"
      },
      {
        "img_id": "2W6ztwwkuWTQXh3LGsACGw",
        "caption": "Photo of Long Beach King Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2W6ztwwkuWTQXh3LGsACGw/o.jpg"
      }
    ],
    "user_id": "FBn1SPQ_t2yzytf6KGnafg"
  },
  "bXO9amNejixeqxy5oaYx2w": {
    "date": "9/3/2014",
    "text": "Tasty food... Everything was wonderful (black pepper crab, chili crab, spinach with oyster sauce, bee hoon noodles with clams, and steamed buns). The sauce of the chili crab was amazing and you will need the buns to dip into that sauce. Don't try chili crab at a Hawker Centre; go to this place that specializes in chili crab... Huge difference.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qqL-7kjfaacRHyoJx3yS_g"
  },
  "gJBLYaa4rixuuPtmgRIHpw": {
    "date": "6/2/2013",
    "text": "Amazing black pepper crab here! They claim to be the inventor of this dish and after tasting it, I believe it! Definitely worth the trip, even though the prices are on the higher end.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tRh15dEanslWTqgdr0kAA"
  }
}