{
  "5cA8ltomF1w7FtUGyytkug": {
    "date": "11/14/2018",
    "text": "Walked in to a shopping complex in Chinatown and this spot had a line outside that led to the next store so definitely had to try!The milk tea with grass jelly was REALLY good. The Yuan Yang drink was ok, but definitely preferred the milk tea. We also ordered the thick toast with ham, egg and cheese on top (order #2) and a bun (I can't recall the name of it but it was order #4) that came with 2 soft boiled eggs. Both were really good to dip in the mixed soft boiled eggs.Worth trying since they open early and food was a goos start.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aQ6MVBdlvPY7rts6NCXgAw"
  },
  "eOSGmD5qVOidkQm_GoOrOw": {
    "date": "10/29/2018",
    "text": "The Mee Rebus was so good here - the noodles soaked up the curry. The toast was okay but the hot food was the standout.  I'd come back for the hot food.  This is a popular place but the pastry cabinet had ants in them and most people just had a coffee and toast.  They have plenty of seating so I think that's why it's also popular.  Fast and efficient!  Good place to grab a quick bite.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "04kt_sqsoEMk2jyH3rI4mQ",
        "caption": "Photo of Toastbox - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/04kt_sqsoEMk2jyH3rI4mQ/o.jpg"
      }
    ],
    "user_id": "uZdFsE_aHbFBChgN6Xa8tw"
  },
  "iiYVJwHEI6dUzZkbrZBcmQ": {
    "date": "3/7/2018",
    "text": "Meh breakfast. It turns out there are a ton of other restaurants in this huge shopping complex. I loved the milk tea and the coffee here was also really delicious. I had the thick egg toast with cheese. It was basically thick toast with a fried egg and cheese on top. It wasn't bad. Other dishes were the ham and cheese toast. The were basic and mediocre at best, not something I would purposely eat. Overall an ok breakfast stop, seems pretty chain like.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6dPuvy4N9qxq942RDwhHzA",
        "caption": "Photo of Toastbox - Singapore, Singapore. Milk tea and coffee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6dPuvy4N9qxq942RDwhHzA/o.jpg"
      },
      {
        "img_id": "eQx9_4CkzRH7jxe3Qb5_kg",
        "caption": "Photo of Toastbox - Singapore, Singapore. Ham and cheese egg toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eQx9_4CkzRH7jxe3Qb5_kg/o.jpg"
      }
    ],
    "user_id": "1gov-oAqh5LMrOkYeP7tbA"
  },
  "b-Ct15xAZYmOhP3cd-8pRQ": {
    "date": "1/15/2013",
    "text": "Wandered into this place while looking for a late dinner in Chinatown our first night in Singapore.  Most of the surrounding shops in the mall were already closed, but this place was a bright beacon of light that beckoned us into its cute, pristine white cafe.The set laksa menu for SGD 6.10 pulled us in for our first taste of authentic Singaporean food.  But alas, they only had one portion left, so we had to settle for the SGD 5.00 Mee Siam set as the second option.Both noodle soups were creamy with a heavy taste.  The Mee Siam was quite sour with scary-looking greyish noodles that looked like squid tentacles to me.  :OBoth sets came with a refreshing barley tea.  I would say this is a nice place for a light meal or snack, and it's a chain around town, so really convenient to drop by for a visit.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XV33yaMwHf8fwW0iQuww2w",
        "caption": "Photo of Toastbox - Singapore, Singapore. Laksa and Mee Siam with barley tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XV33yaMwHf8fwW0iQuww2w/o.jpg"
      }
    ],
    "user_id": "9mh76vFncdq6_uDnFv0qfA"
  },
  "qglO3bFZCYdiQjse1QsJiw": {
    "date": "8/30/2013",
    "text": "Cutest little place which is great for breakfast or a snack located in a small mall. I ordered the Toast with Kaya, eggs, and Milo Dinosaur drink. So my Toast with Kaya was basically toast with butter...yummy toast & butter I might add. My eggs were hard boiled still in shell and very, very runny like raw which is they way they eat them, I tired to but just could not. My dinosaur drink was a cold overly chocolate kind of almost frozen milk drink with powdery kind of chocolate shavings on top and so amazingly good I had a few though out my stay in Singapore. My aunt had Toast with Floss which was meat very finely shredded and I tried it and it was good too. She liked it as well and ordered it again later again when we went there.I miss this place and can't wait to go back.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "wyBH5nxZHCslX6aMzOTA7w"
  },
  "7JP6i6JKk2n7N8RiqWnsuQ": {
    "date": "8/19/2013",
    "text": "Someone recommended that I should try Toast Box but was a little disappointed. Service was rather slow and some table does not have black sauce and pepper. When I asked the staff, they just ask me to grab from table which is occupied by customers.The toast is 0 stars and not even close to YaKun kaya. They have more choices for meal and food but I did not tried. The half boil egg was ok and coffee was 2 stars. I suggest that you skip this place and go for original Yakun. Also, the store at Bugis is outdoor and no AC.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "NIeLhx7kQ7KROhH2zs5qYw"
  },
  "KuDefmbTOJhF0fsPVAJNRA": {
    "date": "5/23/2013",
    "text": "Not a bad option if you are looking for an indoor place to escape the Singapore heat & have a quick meal. You can certainly get better kaya toast in one of the other hawker centers nearby though, so be aware.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9HxQ24U3rfvQCbGHsEQvQ"
  }
}