{
  "lbraerVof-B2ouI-0N0jrg": {
    "date": "7/27/2014",
    "text": "They have really good vegan food.  Not great, but really good.  They are right by a train stop (which makes it easy to get to) and they also take visa (which is big plus in Singapore).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ay2fd521w-dAJbrHKAx6Cw"
  },
  "IjFHbPGOSwFqDrRXI7jbvA": {
    "date": "12/25/2014",
    "text": "Food was alright. Don't get confused, you're not going to find westernized Thai food (Pad Thai, etc) here. As real vegetarians they tried to make it taste too much like meat. There has to be a better Thai restaurant in Singapore.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVhZgTIcFqj6fg6Q-HAEXA"
  },
  "YJdwKKp4wntzyV-diPhf8A": {
    "date": "7/9/2012",
    "text": "My go-to place for vegetarian Thai-Peranakan food.If you think that's an oxymoron, as I once used to, you really should try it here.Without dialling down on the spices and the cooking, Whole Earth manages to make the dishes we love so much without meat, and without the blanket replacement of every meat with a substitute mock meat. Mushrooms and beancurd are used cleverly. I don't even miss the meat, honestly! The nyonya curry with mushrooms, kong bah, assam pedas, rendang and olive rice are my faves. So is the vegetarian yam ring pot. They also have lots of herbal soups!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ml61UOrHtdUCwW0JcTM_Vg"
  },
  "r7St3_QfRkF2Gd71m08ImA": {
    "date": "8/20/2013",
    "text": "One of my favorite places in Singapore! Absolutely delicious dishes: Petai, Tofu w/ crispy oats, Monkey head mushroom and awesome Yuzu tea.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tp9EvdZZzFFwfH1m2SVJ9A"
  },
  "ft0i5FhS2pPQicMOhdQmuA": {
    "date": "6/14/2014",
    "text": "Place is spacious and comfortable for small or large groups. First time trying this place out and it has not disappoint yet. Am not really a vegetarian girl and not converting any time soon but once in a while to find a vegetarian restaurant that does not serve oily food is a plus. Price is a lil pricey but I guess anything 'healthy' nowadays are.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AvyICb3PB08We_rBRtfISw"
  },
  "qe_uiPwH8k5nEITyTijO8g": {
    "date": "4/1/2013",
    "text": "Who says vegetarian can't be tasty? World earth prove that wrong!! They serve Peranakan Thai style. Definitely will revisit again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qTIPVUtZv56MbSJ_jw16ZA"
  },
  "uvGbOP1_HAdakbiFGgSx1Q": {
    "date": "1/29/2013",
    "text": "The food was good - decent - but it was sort of pricey compared to other vegetarian restaurants I've been to in Singapore. While the flavor was good, portions were really small and again - over priced.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Sy0izMlyQ0_M-vLpmmfyw"
  },
  "OGG2HVvLdBonUUEmSTWdXg": {
    "date": "10/1/2018",
    "text": "The food here is vegetarian, and it's really tasty, if a little, pricey.Came here for a late lunch on a Sunday and wow, their food is really tasty. The style is Singaporean/regional Asian, and we had the really delish rendang, which is largely mushroom-based. Our only mistake was to get olive rice, which we couldn't really taste, over the rendang. Next time; plain rice!The yam ring was also competent, along with the broc. Would totally return! Cost about $90 for the two of us.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oblzYqE2owrqN0e9gqAYug",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Olive brown rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oblzYqE2owrqN0e9gqAYug/o.jpg"
      },
      {
        "img_id": "-adtZBkTtoJFqNJif5ncrw",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Penang rendang",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-adtZBkTtoJFqNJif5ncrw/o.jpg"
      },
      {
        "img_id": "M99Ogt-xbdk3lA_EDJQP2Q",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Yam ring",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M99Ogt-xbdk3lA_EDJQP2Q/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "BP9ReWo7vFnTPayvhI0z9A": {
    "date": "9/3/2018",
    "text": "Whole Earth is a fantastic concept. Peranakan-inspired vegetarian food, with fresh ingredients. The deep fried golden oats tofu was delicious - if a little dry. The brinjal was succulent and I loved the Nonya Penang Redang. The Olive Rice was fine, but nothing to write home about.This is somewhere I'd love to return and explore more of the menu - if you're looking for clean, healthy and delicious food, you're in the right place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V0u9P7vKM2TCNAaaFhnyKw",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V0u9P7vKM2TCNAaaFhnyKw/o.jpg"
      },
      {
        "img_id": "yyEfRVyPI8CTamga4MxehQ",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yyEfRVyPI8CTamga4MxehQ/o.jpg"
      },
      {
        "img_id": "Kkkx_bWd2mlSV-DslySgsA",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Kkkx_bWd2mlSV-DslySgsA/o.jpg"
      }
    ],
    "user_id": "4-S7_R9du3GsIT7AwAv9ww"
  },
  "-yYHEEKK-lcGU2CYPHmW8g": {
    "date": "7/20/2018",
    "text": "Amazing vegan peranakan food! Almost 100% vegan except one dish has honey and they specify which so if you're vegan this place is great. The flavors of our dishes were all great and not too heavy or greasy. All my non veg friends enjoyed the food a lot! I recommend all their famous dishes like the rendang (made with mushrooms not mock meat), cereal tofu (WOWWW like cereal prawns but with tofu) and the kangkong belachan (which is hard to find vegan)! The restaurant is really nice on the inside and conveniently located right outside the Tanjong pagar MRT. I would come back here again! Really yummy veg food",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "JZhVZ9IYUDtsh2QgTcupOA"
  },
  "T1H7VQhnCTguRpPgTIFa4g": {
    "date": "3/19/2018",
    "text": "Whole Earth was founded in 2003, is the first and only Peranakan-Thai Vegetarian in Singapore.They are the only plant based restaurant in Singapore to be awarded the inaugural Michelin Bib Gourmand 2016, thus it is hardly that Vegetarians out there will find them unfamiliar.Interior was modernly furnished, giving a clean and neat environment. On the other hand, service is good and did not disappoint.Lemongrass (Hot / Cold) - $6Since Chinese New Year is around the corner, we ordered their Yu Sheng and enjoyed the session.Prosperity Yu Sheng - $48 If you were thinking where are the \"Yu\" in the plate. Here's the mocked salmon and abalone.Like any other restaurants that offers Yu Sheng, the staff will open up the individual ingredients and before mixing into the plate, she will say out of the words of blessing and meanings that each ingredient represent. This is the first time I'm having Vegetarian Yu Sheng and it looks quite interesting with Dou Miao included.Brown Rice is just too mainstream for us and we had ordered the Signature Olive Brown Rice to complement the rest of the dishes ordered. Fragrant and delicious, without being too oily.Signature Olive Brown Rice  招牌香叶炒糙米饭 - $11 (Small)Tofu comes in triangular form, deep fried to perfection with crispiness on the outside and sily smooth interior. These tofu was tossed in fragrant oats, curry leaves and chilli padi. Also one of their classic bestseller.Crispy Golden Oats 招牌黄金香脆麦片豆腐 - $17A delicious mixture of vegetables that includes egg plant, long beans, lady's fingers and petai bean in Sambal Sauce. This is also one of the recommended dish by the restaurant.Penang Sambal King 娘惹招牌叁巴菜王 - $17Nutritionally prepared with wolfberry and angelica root \"dang gui\" herbs in perfect harmony of broccoli and monkey head mushroom. This species of mushroom contains health-enhancing properties such as antioxidant, anti-inflammatory effects and beneficial effects on brain -boosting functions.Enchanted Forest 招牌焖汁兰花猴头菇 - $23The dish has a sensational texture and highly addictive in its tangy sauce as well as refreshing pineapple chunks. If I didn't know I am having vegetarian food, I might be fooled by its appearance and taste that it is the actual meat. A must try!Thai Sweet & Sour Delight 泰式招牌酸甜特色- $18Overall, the price maybe on the high side but it is still worth a visit if you want to enjoy some great taste of plant-based food. Definitely I will recommend Whole Earth if someone is looking for quality vegetarian food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PvwCtRY4ZmkwyvmtYyzniQ",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PvwCtRY4ZmkwyvmtYyzniQ/o.jpg"
      },
      {
        "img_id": "sYFCNa6TBoaS1naow3xRPg",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sYFCNa6TBoaS1naow3xRPg/o.jpg"
      },
      {
        "img_id": "XWX7AJWd82ytEGcQiGj-mw",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XWX7AJWd82ytEGcQiGj-mw/o.jpg"
      }
    ],
    "user_id": "w91OgyE6GjOuZ_MtBk21uw"
  },
  "l00D539QHUgEGMz480fgOQ": {
    "date": "3/23/2017",
    "text": "I'd never had Peranakan food before (ok, I'd never even heard the word \"Peranakan\" before coming to Singapore) so I was super-intrigued by this place, which bills itself as a Peranakan-Thai vegetarian restaurant.Whole Earth has a pretty interesting menu with plenty of exotic dishes to choose from. I had fun paging through it all, but I knew what I wanted the minute I saw it: crispy oatmeal tofu. It's listed as their \"classic bestseller,\" so I couldn't wait. I also ordered a side of rice.The dish was yum. The blend of spices and fragrances were amazing. The tofu was nice, and I'm picky about my tofu.My only real complaint was that the whole dish was super-dry. It's like, take a bunch of dry crunchy oat flakes and some dry tofu, throw some spices on them, and put them on a plate. No sauces whatsoever. While the spices were exquisite, the total dryness of the food was a bit strange. Even just a hint of sauce would've made it much nicer.If you're vegan, make sure to verify that your dish contains no dairy or egg or honey. (They do use dairy in some of their desserts and things.)The atmosphere here was a little sterile and corporate, and the price was a definitely on the high side for lunch, but it's pretty centrally located (not far from the Tanjong Pagar station), the food is interesting, and it's definitely worth a visit if you're curious to try some Peranakan vegetarian food.Note that they are currently closed until April 2017 for a renovation, and their menu might change too.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Dlb768NfIzlQCZIR9f5T4A",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Crispy oatmeal tofu and a side of rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Dlb768NfIzlQCZIR9f5T4A/o.jpg"
      },
      {
        "img_id": "6j5QzNuq9hLJBndC-sDacA",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Whole Earth interior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6j5QzNuq9hLJBndC-sDacA/o.jpg"
      },
      {
        "img_id": "MWSkSV1T5FdgQmM0Rb52wg",
        "caption": "Photo of Whole Earth - Singapore, Singapore. The tofu page of their menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MWSkSV1T5FdgQmM0Rb52wg/o.jpg"
      }
    ],
    "user_id": "iFjKasqkx7shSFsYOgNG2g"
  },
  "GGmNgD8qMM_47UZU2-SKXQ": {
    "date": "7/26/2018",
    "text": "This has become a regular stop in my time in Singapore, and there are growing and very good vegetarian options.  The ambiance is casual with a moderne, bright design, good energy.  You cannot go wrong with any food choice and they are very creative with their versions of Singapore/Asian dishes -- beautifully rendered in fresh, bright vegetables, tofu, Tempe and remarkable mushrooms.  Portions are healthy, but plenty of room to share and experiment.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XYwdLO9nxdeAK3DSdbH2bg"
  },
  "Zrnw5aYu65A4MPjHL21WIw": {
    "date": "4/29/2018",
    "text": "The food is better than at some Peranakan protein restaurants. Penang rendang is scrumptious. Although I am a big fan of buah keluak, I find the version here too overwhelming, probably because it's too 'pure'. Friendly and helpful service staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3C3A0LL_4OKo0qFVz0wEWg",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3C3A0LL_4OKo0qFVz0wEWg/o.jpg"
      },
      {
        "img_id": "YRWnx6uNNv7MH_hT4CnV3g",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YRWnx6uNNv7MH_hT4CnV3g/o.jpg"
      },
      {
        "img_id": "4q9f3V7jvv_XEVY2GRe50A",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4q9f3V7jvv_XEVY2GRe50A/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "ENg0gvo6JOxjzZst5o5nMg": {
    "date": "3/11/2017",
    "text": "Vegetarian Peranakan-Thai food! Even if you're a carnivore, the flavors here won't disappoint.For three people, we ordered: Nonya Curry, Steamed Jade Wrap, Penang Rendang, Monkey Head Mushroom with Broccoli, and the Mango Tamarind Vegetarian Fish. They also offered some fried \"salmon\" skin (actually crispy seaweed bean curd skin) for S$2 to start off the meal. No complaints for any of the dishes...we devoured everything. For drinks, the we all got the hot yuzu tea since we were feeling a bit under the weather, and it was a nice complement to all the dishes.Everything was tasty, but since the portions were a bit small, we had to order quite a few dishes and the total bill came up to be on the pricey side (~S$40pp after GST and service charge). If you do have vegetarian constraints, would like to have more veggies in your diet, or would just like to try a different yet authentic preparation of classic dishes, then Whole Earth is a great choice.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyqnCAQsARyayfkl0dSNKg"
  },
  "2xVikAStgo19Q4eaqe2GXA": {
    "date": "7/16/2018",
    "text": "Great dishes that were fresh, tasty and well prepared. A little high on the price points. Olive rice, rendang and the enchanted forest were shareable small-medium portions.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Po-yegc75ttLxYEBJCJdYw"
  },
  "vDLj-hJ86fjKXkQ3EBP68Q": {
    "date": "1/27/2016",
    "text": "What a disaster. Took my family of 14 for a meal here and was looking forward to it however it is one of the most disappointing restaurant I have been in the last 2 years. I will start by saying that all and yes all the food was probably prepared by using prepacked paste.The starter Ngoh hiang tasted like it was just bought off a supermarket shelf fried and given to us 2/10 however the mushroom salad tasted good 7/10.Even the drinks were somewhat amateurish I had the cinnamon ginger and sipped only a tiny bit. The passion fruit drink was again too sweet. What a waste 4/10.The entrees were again so amateurish that we were flabbergasted how on Earth this restaurant is still running. The Rendang mutton was inedible in the sense that the soya/gluten was too chewy ( usually due to being too long on shelf). The rending tasted good but could have been much better 5/10. The Asam pedas was a total whacked job. It was but a thin soupy dish with egg plant dancing around the broth. It was so disgusting many of us had only one take. 1/10. We were left perplexed as to how they came to serve such lousy fare.We also had Sambal egg plant again it was at best mediocre and was not as appetizing as it looked. 3/10The next dish braised and fried mushroom was no better. Most took a piece and never had a second. 2/10We also had brown/red rice and everyone had a drink. For 14 we ordered 3 dishes of each.The total bill came to $680 including service charge.I must say the service was excellent 9/10 however the food left a very bad aftertaste. All did not want to order any desserts so we went off to lau pasak for Chen dollars etc etc.I do not have a habit of putting a restaurant down as many make a living out of it however in this case I took exception. The food was horrendously prepared cheaply and tasteless was not on par as what should be served in any restaurant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "49B6LWepgd-IkSbmA485GA",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/49B6LWepgd-IkSbmA485GA/o.jpg"
      }
    ],
    "user_id": "dIRTUvNn9HSG7SlCB1CdKw"
  },
  "OTuJUJ-e92s0ebd9WQTA9g": {
    "date": "3/3/2014",
    "text": "Another Singapore visit.Another Vegetarian restaurant.This is what happens when the friend you're visiting is also a vegetarian. ;) Oh, happy days! :DI've never been to a Vegetarian Thai restaurant, so was intrigued and curious how the dishes would be.Whole Earth is definitely on the pricier side. For what we got at Whole Earth, we could have gotten a lot more at 8 Treasures Vegetarian. Plus, Jinny and I definitely prefer the food at 8 Treasures Vegetarian more, but this was certainly a good experience to try out a different vegetarian restaurant. I love trying out different veg restaurants so that I can compare one to another and know what I prefer, etc. One thing I didn't like about this place was that they charge for water. Not bottled water, but just hot water. I thought that was extremely odd. I turned it down since I've never had to pay for hot water in my life at any restaurant I've ever been to, the fact that they charge for water just screams \"cheap\" to me.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y2GVhiGxOwzyMuoOtPZ5IA",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y2GVhiGxOwzyMuoOtPZ5IA/o.jpg"
      },
      {
        "img_id": "L4skuDD9nHu8jEZ6bqHujA",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L4skuDD9nHu8jEZ6bqHujA/o.jpg"
      },
      {
        "img_id": "HpMML4dKehrVO3io-N8aKQ",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HpMML4dKehrVO3io-N8aKQ/o.jpg"
      }
    ],
    "user_id": "gGAbeX0s-aueUStJmMZt_w"
  },
  "61KOAIZv6wrHO4QNwB2ZRg": {
    "date": "1/4/2016",
    "text": "Whole Earth is a great option in Singapore if you are vegetarian or want to try vegetarian Peranakan food! We ordered the following:Nyonya Curry: The flavor of the curry was a bit too strong for my taste but it is still delicious!Steamed Tofu with Mince Paste: This was awesome, the mince paste is super flavorful and you can tell the tofu is freshTom Yam Fried Rice: The rice was aromatic and packed with flavor so I wouldn't recommend eating it with the curry since the latter would overpower the taste. Best to eat with something on the lighter side (like the tofu or scallops).Calamansi Juice: The juice wasn't that fresh as it was still a tad bitter but overall was fine.Steamed Jade Wrap: This was delicious! The filling and wrap had balanced flavors. The sauce stood out the most in this dish though.Mushroom \"Scallops\": This was my favorite of the dishes we ordered. The mushrooms were juicy and well-cooked. The texture of these mushrooms is amazing. Service is quick and attentive. While you do have to pay for water (S$0.30/person), I didn't really have any other concerns. Next time I'm in Singapore, I will definitely pay a visit to Whole Earth (and get the scallops again)!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vN9rAl1ixlni4YbB8E-Rrw"
  },
  "IcB7TUGrS3mVZ2c_jejxdw": {
    "date": "12/29/2015",
    "text": "First time here. Very authentic taste -  Penang Rendang, Yam Treasure Ring, especially the Samba King. I wish they have a store in the US. Portion is a bit small and slightly over priced for vegetarian foods. Nice ambient setting.... good services.h*",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FQ05OkgEWrrB7S64DQktdg",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Yam Treasure Ring",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FQ05OkgEWrrB7S64DQktdg/o.jpg"
      },
      {
        "img_id": "kcRUcOWXT8wIQVlck2IfgQ",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Penang Rendang",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kcRUcOWXT8wIQVlck2IfgQ/o.jpg"
      },
      {
        "img_id": "V0gZYXMXZ0tfR0Qd3rTUwg",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Samba King",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V0gZYXMXZ0tfR0Qd3rTUwg/o.jpg"
      }
    ],
    "user_id": "sNIlFVDdsqpMTrjtG74_-Q"
  },
  "dlTCM1UhqMrY2tz8pY_e8A": {
    "date": "10/31/2013",
    "text": "You know, I really want to like this place 100%, but with other vegetarian and even organic restaurants in Singapore that sell at a much cheaper price point, it's hard to go all the way and give it 5 stars. But with that, this place offers super tasty vegetarian meals, with faux meat dishes made of mushrooms. I've tried both their lemongrass tea and their floral tea. Both are wonderful and already sweetened, but not too sweet. I've had their Tom yum soup, rand dang, olive rice and sweet & sour chicken. All wonderful! The portions are also just right, for me at least. I wouldn't say great for sharing since it may or may not be enough, depending on how many people are with you or how big your bellies are. Considering I can eat quite large portions all to myself, I usually order 2 dishes and I still end up with take away. Take that as you will!Expect to pay around $30 per person for 1 specialty drink, 1-2 main dishes and a rice dish. Worth it? Yea, if you're willing to spend more for an occasional treat of vegetarian food.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1p4oDW58kExBJNsOWujI8Q",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Tom Yum soup, beef randang, olive rice and lemongrass tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1p4oDW58kExBJNsOWujI8Q/o.jpg"
      }
    ],
    "user_id": "FKWeca2cwUkxJTgW_Tj1nA"
  },
  "8DuIBXHXQGXznyGpCrBi1g": {
    "date": "1/8/2013",
    "text": "I think this is currently my favorite vegetarian spot. Their dishes make you think if meat is over-rated, (Ok, I lied, I can't do without my sashimi) but this is as close as it gets.We had the set menu which has most of their signature dishes. The memorable one is definitely the rendang and the oatmeal tofu.The rendang is made with mushrooms. The gravy is so rich and fragrant that you really do not miss the meat. The mushrooms used also has a great meaty texture and this is a perfect vegetarian rendang.The oatmeal tofu is a rendition of oatmeal prawns vegetarian style. Oatmeal is sweet and nicely crisped, and not oily. Brilliant deep frying.Price point, it is not cheap but not restaurant expensive like LingZhi. It's closer to bistro/cafe pricing. For delicious veggies, this will be my choice.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LyhN90Gm3jgXkeCjWVZMIg",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Rendang",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LyhN90Gm3jgXkeCjWVZMIg/o.jpg"
      },
      {
        "img_id": "2En-cs0JohbEOhugKBsatw",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Yuzu fish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2En-cs0JohbEOhugKBsatw/o.jpg"
      },
      {
        "img_id": "Y2q2fRCTPLHlemfqmoCg6w",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Seaweed chips starter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y2q2fRCTPLHlemfqmoCg6w/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "WgYrX5Xbl8O0U3MT_vSogw": {
    "date": "3/5/2013",
    "text": "Yay! An affiliate of Naive (I'm a big fan!) which is more accessible (for a westie, anyway.) I'd been eating rather unhealthily (i.e. vege-lacking) and so wanted some vegetarian food.. Whole Earth to the rescue!They offered us pickled papaya/seaweed chips for appetizers, decided to try the latter. Pretty nice beancurd skin crisps wrapped around seaweed!Delicious braised monkeyhead mushrooms with broccoli, with some woflberries thrown in for good measure. $19 is a little steep, but I guess for the occasional treat, yum! As the bf pointed out, mushrooms were done very well! He also has had the oatmeal tofu at some other point and said it was really good, didn't miss meat at all :)Thai mango and tamarind mango fish ($18) was also yummy, liked the sauce a lot! The 'fish' was more like five round slices of patties. Texture and taste were like a water chestnut/lotus root mix, not sure where the tofu came in really. The skin forming the circumference of the patty recalled the seaweed chip appetizer. Somewhat carby, actually, so was quite content to eat it without rice.The bf ordered brown rice (as opposed to white, said it wouldn't feel right ordering white rice at such a healthy place haha).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IfFoE_s_RBKd5wnC81j7Dg",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Thai mango and tamarind fish ($18)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IfFoE_s_RBKd5wnC81j7Dg/o.jpg"
      },
      {
        "img_id": "y3L3QPhT8MIrEGsm0eFT0g",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Braised monkeyhead mushrooms with broccoli ($19)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y3L3QPhT8MIrEGsm0eFT0g/o.jpg"
      }
    ],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "qe9HiZvL4n4jFz8vZhKTGA": {
    "date": "7/15/2012",
    "text": "Delicious Thai-Peranakan vegatarian food.Came here for lunch at about 1pm and it seemed like the crowd has already dispersed a little. I think if you're planning to come here earlier, it might be a good idea to make a reservation first just in case.Individual prices are a little pricey for lunch so we stuck to Tom Yum soup and 5-spice nyoh hiang to share. Then we each had Olive Brown Rice and Kampong Fried Rice. I'm personally particularly about my carb intake so seeing brown rice on the menu really did it for me.We were still looking through the menu when a waitress came up to us to inform us  that a group of 6 had just arrived and we should try to place our orders now to avoid a long wait. That was pretty nice of them really. So we placed our orders and not long after, our food arrived.The Tom Yum soup was delicious, though not as spicy as I like it. It's a pretty big bowl so there was more than enough for me and my friend to share. Next the nyoh hiang. SO GOOD! The sweet sauce that come with this complimented this perfectly. The pieces are smaller than they appear in the picture on the menu though but again, there was more than enough for both of to share.My Olive Brown Rice was really good I must say. I love olives in general so I didn't think they could go wrong on this with me. I was a bit surprised that it didn't have cashews though, but maybe it's only because my previous experiences with Olive Fried Rice always had cashews. Haha. Overall, I really enjoyed this dish!  Unfortunately though, the same can't be said for the Kampong Fried Rice. My friend complained that it was pretty mediocre, and after trying it for myself, I have to admit that it was the blandest dish among the others that we'd already ordered.Would definitely return here but probably only with a group of friends to share dishes with.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PJbxBipc3Mmnvzq05PqSCA",
        "caption": "Photo of Whole Earth - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PJbxBipc3Mmnvzq05PqSCA/o.jpg"
      }
    ],
    "user_id": "6SyrIwCQWCYUfR4_V9OXGw"
  },
  "Nx8m-s3Vwh7vRFzvddV9MQ": {
    "date": "1/13/2015",
    "text": "Had the Penang Redang, the Sambal King and the Fried Hong Kong Noodles to share...Washed it down with the fresh lemongrass drink.Everything here was fabulous... especially the spicy Sambal King dish... really enjoyed it - great lunch spot...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "RmMbDOMp_BFS_kllQbRNxg"
  },
  "eQjsrTv6-YV8rcZRsWx9yA": {
    "date": "7/16/2012",
    "text": "Well known amongst Singaporean's vegetarian community, Whole Earth's remarkable food goes beyond the borders and appeals to many carnivorous friends as well. Nestled in a cosy but spacious corner in the heart of Tanjong Pagar, Whole Earth offers a range of Peranakan and Thai cuisine, from the highly recommended Penang Rendang ($18) to a mean Tom Yum soup ($9).Any true Peranakan place has a good serving of Buah Keluak, and Whole Earth is no different; its rendition of Nutty Buah Keluak ($18) will leave vegetarians satisfied with the unmistakeable taste of the dish, minus the meat. True to it's equally expensive but morally questionable roots, a bowl of Sharks Fin broth goes at $18; if you're looking for something soupy to go with your meal, however, the Homemade Assam Pedas ($18) is available at the same price but with far more flavour. Whole Earth's rice and noodles dishes are far less impressive, so it would be a wise choice to opt for more dishes to share while going easy on the mains. These steep prices do not deter the crowds, and it is best to make a reservation with Whole Earth if you intend to explore the scrumptious Peranakan-Thai cuisine, entirely vegetarian and almost addictive. You'll certainly be back for more, but, because of its prices, Whole Earth is more of a once-a-month treat than it is a regular place you can dine at.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Z8kr2zbtmlzF4EgcZt_h3A",
        "caption": "Photo of Whole Earth - Singapore, Singapore. Complete with awesome artwork.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z8kr2zbtmlzF4EgcZt_h3A/o.jpg"
      }
    ],
    "user_id": "v8H2waZrjUBU5-lbHo7ouw"
  },
  "2fTQ12Dmg2MQ0RVrOMe3LQ": {
    "date": "3/10/2013",
    "text": "When I go to a vegetarian restaurant, you know what I want to eat? Vegetables.  Go figure.  So it always bothers me when they make the vegetarian dishes all about meat substitutes.  As a person that still eats meat I have no desire for dressed up tofu products.  Sure, I enjoy tofu as much as the next person but I am way more into okra and potatoes.  Getting that off my chest helps.  This place does have style going for it.  I loved the atmosphere of the old building and the modern furnishings.  My table snacks were very promising. That papaya pickle was amazing.  I guess I just ordere the wrong thing after that.  The sour curry was too tofu heavy.  I felt less than stellar about the pumpkin sticky rice dessert especially since it seemed they didn't know the difference between sticky rice and sago.  I might go back and try the more thai dishes but probably not.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "L7zt8jZEE1Xj3ZT2fgO79w"
  }
}