{
  "_UtxItUYE--sI_5Rjgeczg": {
    "date": "7/1/2013",
    "text": "Being from the US and actually having an aversion to chain restaurants I should have known better than to attempt to visit this establishment.  While guests of the Mandarin Oriental, we had made dinner reservations at another restaurant in the hotel and wanted to grab a drink at the Morton's Bar prior to dinner.  Huge mistake.  The way their staff made me feel was probably the way Julia Roberts character in Pretty Woman felt when she tried to purchase clothing on Rodeo Drive, and I look/act nothing like a trashy hooker.  If you want to feel snubbed or treated with disrespect you should definitely go to the Morton's Bar, they are exceptional at that. Cheers.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VC77eKyi6jAx0Vxmps__bQ"
  },
  "1F8FtqWnCbkusKjou4qowA": {
    "date": "3/16/2013",
    "text": "I booked dinner at Morton's at the Mandarin Oriental as a special treat for my son and daughter in law, who I was visiting in Singapore. Unfortunately their service was slow and inattentive and the food was way below par for their exorbitant prices.  I ordered mine medium rare and it was well done and once they finally slapped our plates on the table they forgot about us. I reluctantly paid the bill but will never eat at a Morton's restaurant again. There are many way better and reasonably priced restaurants in Singapore!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZ4_kHF2MZiuMyDj5zOg-w"
  },
  "ZFUx8VmOJuVPqwAEgW2ang": {
    "date": "2/24/2014",
    "text": "Morton's in Singapore. In a word it's awful. Meat is frozen and long ago. You have to saw it to cut a slice. Tomatoes are almost white. Tea is in the tea bags:) And for that torture an astonishing price. Do not do a mistake, do not go to a steakhouse in Singapore. It's stupid.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ynE2OXXIUfdL8CH3-EfUA"
  },
  "T7mNg84O4WdTK2soC5hMTg": {
    "date": "10/1/2012",
    "text": "Feels like the real deal compared to the US.  The meat in my opinion falls a bit short, but that's more or less because of the laws around dry-aged, bone in meat not allowed for in Singapore.  Australian beef just does not compare.  Never tried the happy hour.  Only have heard good things.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6JElsXl7wKTCcEsGR6rcFg"
  },
  "LPxYICOksKyJ__2b8jzvIQ": {
    "date": "4/17/2018",
    "text": "Visited the place on Sunday for brunch. Compared to its next door crowded buffet restaurant, the place was surprisingly quiet with just 4 other tables of couple. We were showed to a roomy booth table, where the staff pulled out the table for us to be seated. Looked through the menu, we decided on the 3-course Sunday Lunch Set Menu (S$98++).After placing order, we were served its signature Onion Bread and butter. The huge bun was pipping hot and fluffy.For AppetizerBaked Five Onion Soup (ala carte price S$29++)It was served in a small cup with melted cheese toast on top. The soup was more salty side but great to dip the bread with.Chopped House Salad (ala carte price S$28++)It may not looked much, but the flavours were great. Just take of note of the strong flavoured goat cheese.For Entree8.5oz Filet Mignon with Asparagus and Mashed Potatoes (ala carte price S$101++/ 8oz)Went with the staff's recommendation of medium rare. Opt to serve with mustard and brown sauce, plus sour cream for the mash on the side. The meat was done just right without too raw or too tough. The mash was delicious with bits of potato in it.Center-Cut Prime Ribeye (Topup S$30++) (ala carte price S$118++/ 16oz)Went with the staff's recommendation of medium. The meat serving was double of the filet mignon.  Opt to serve with brown sauce, plus sour cream for the mash on the side. The meat was done just right without too raw or too tough. The texture was smoother compared to the filet mignon, but the serving was too huge for a female like me. The end part was a tab too chewy than preferred.For DessertMorton's Legendary Hot Chocolate Cake (Topup S$10++) (ala carte price S$36++)The molten chocolate cake was served hot, topped with raspberries and a scoop of vanilla ice cream by the side. Soft crumbling crust, encasing the hot molten chocolate inside. Sinfully rich pairing with the cold ice cream.Key Lime Pie (ala carte price S$26++)Served with a slice of lime and a pile of whipped cream.I was too full to have a mouth of it. The staff kindly packed it up for takeaway.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0qpDHu3WGUprUpJMNUxkxQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0qpDHu3WGUprUpJMNUxkxQ/o.jpg"
      },
      {
        "img_id": "RckNRopwcwljJFfZOTR_Uw",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RckNRopwcwljJFfZOTR_Uw/o.jpg"
      },
      {
        "img_id": "vSoKqSfxk2Qns-6yXG5YhA",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vSoKqSfxk2Qns-6yXG5YhA/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "BEXMETl5pbrsgCH1jYEwog": {
    "date": "5/18/2017",
    "text": "Morton's is one of my happy places, I was more than thrilled that my friends agreed to go there for my birthday.The whole night was just perfect, Morton's in Singapore can definitely keep up with the branches in the US. The steaks and seafood are just on point, they are perfectly cooked and of very good quality.The cocktails are also comparable to those in the US, unlike in most Singaporean bars & restaurants it is not a watered down jobbie, it is a full strength Martini. The wine we had was excellent (but $$$!).Another nice touch is that they had (like in the US) the menu personalized and offered a complimentary souffle plus a printed out picture for me to take home. In general, the service was very good throughout the night.Morton's complimented the great company of my friends perfectly, I felt so spoiled and happy. The only downside was the price: it is certainly not cheap and is still more expensive than their US counterparts but it is well worth it in my opinion. Will go back if another special occassion comes up.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AIx0bq2FEwd-e1l7Qd8ewg",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Amarone wine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AIx0bq2FEwd-e1l7Qd8ewg/o.jpg"
      },
      {
        "img_id": "GSre7nH9urLamZd9VT6kFA",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Bone-in ribeye",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GSre7nH9urLamZd9VT6kFA/o.jpg"
      },
      {
        "img_id": "dOjp2RiGJNUT6qVS1bQ8Nw",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Lobster tail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dOjp2RiGJNUT6qVS1bQ8Nw/o.jpg"
      }
    ],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "feuY0Kf-T6--vzb6aBMsZg": {
    "date": "2/14/2018",
    "text": "Disappointing. The sommelier was great and recommended a Ruffino Chianti that was medium bodied and paired well with the fillet. That said, the rest of the dinner was very disappointing. The steamed asparagus was flavorless, as was the Hollandaise sauce which accompanied it. When we asked what type of cheese was in the au gratin potatoes (we adore smoked Gouda), we were told \"American,\"  which is not a real cheese, but a processed cheese \"food.\"  We ordered the filet mignon done \"medium\" and it was beautifully tender, but sadly underdone. As it was Valentines Day, and our anniversary, we were told that we would be receiving a dessert \"on the house.\"  Instead of a traditional chocolate dessert, we were presented with a \"lemon soufflé.\" It was tasteless and was more like an egg-white breakfast omelette than a dessert soufflé. Overall a disappointing meal.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Mh8mysLOUxO2wPzEYDEnQ"
  },
  "y_Vsk8J3vA2AYlLwTVABrQ": {
    "date": "6/1/2015",
    "text": "Order- 1/2 doz oyster in their shells, 6 oz center cut filet mignon and I sampled the center cut ribeye (all steaks done medium rare). We had the lava cake as dessert.The colour on all steaks were nice and I personally felt the portion size of the ribeye was huge! Still, it was a good night out - good quality steak but I'm not certain it's the best steak I could get for the price it commands.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p-QuSDkiVdNb97Ub4a2cCw",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Oysters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p-QuSDkiVdNb97Ub4a2cCw/o.jpg"
      },
      {
        "img_id": "egs3-XckxyeiH9Ij5pC9tA",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. 12 oz Filet Mignon (split into two portions)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/egs3-XckxyeiH9Ij5pC9tA/o.jpg"
      },
      {
        "img_id": "mAMlljFFkeKYbcTXoof_Sg",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Birthday chocolate lava cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mAMlljFFkeKYbcTXoof_Sg/o.jpg"
      }
    ],
    "user_id": "e4NAHIyNwR6mM5fpVzvhVw"
  },
  "647vw6CpxYg1Xy_Zt9tPSA": {
    "date": "2/16/2015",
    "text": "My first visit at Morton's steakhouse was an extremely good experience!Planned a birthday celebration for a big boy, and started off dinner with pre dinner drinks by Morton's bar in the evening. Morton's bar happy hour every evening from 5pm - 7pm, with free flow steak sliders with any drinks purchased, and selected martinis at $15.95.I ordered a chocolate mortini and the big boy for himself a cosmopolitan. The chocolate mortini taste fabulous with a thick layer of chocolate which settles at the bottom of the martini glass. We also helped ourselves with a couple of steak sliders (2 mouthfuls worth) which are so succulent and good!We moved on to dinner at the restaurant.We love the setting and service of the restaurant, private yet intimate, and dark romantic and comfortable set up. We had sufficient introduction and great service from the staff who made us feel comfortable throughout our whole dining experience.We ordered a chilled Morton's Prime Ocean Platter, a 12oz centre cut filet mignon (add enhancement of a slab of black truffle butter), and button mushroom only (as recommended by the waitress) for sharing. The sweet gesture by the chef, separate the 12oz filet mignon to 2 equal portions for us. (Look at it on a cost saving perspective..)Received a complimentary small soufflé for the birthday boy, and a lovely birthday song by the staff. To sum up the night, the staff helped us take and developed a photo for souvenir.Concluded that Morton's is not only known for its steak, the ocean platter is also fresh and worth the mention! Steak is perfectly medium rare by the chef, and it should not go without a good glass of red wine.We had a great dining experience with good food, drinks and service at the restaurant and will definitely pop by again in future!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "RCp_OSsO8LPgYV3_m69byQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Souffle!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RCp_OSsO8LPgYV3_m69byQ/o.jpg"
      },
      {
        "img_id": "gS3OTEvoJhN2-UFCCoAMJg",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Centre cut filet mignon with poor lighting :(",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gS3OTEvoJhN2-UFCCoAMJg/o.jpg"
      },
      {
        "img_id": "b7jH-fVb-C0fRtSIx9edJQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Ocean platter - poor blur photo captured :(",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b7jH-fVb-C0fRtSIx9edJQ/o.jpg"
      }
    ],
    "user_id": "O2itSY4F2jnPRXaxdVGOkQ"
  },
  "69XryLxhmN9K6wnL6sF6yw": {
    "date": "11/13/2013",
    "text": "Visit umakemehungry website for more detailsNestled in the heart of Marina Bay area, Mandarin Oriental housed a legendary steakhouse, Morton's. It is located at 4th storey of the hotel, just opposite one of the popular buffet lines, Melt-The World Cafe.The exterior of Morton's was a classic looking American steakhouse with wood panels as its background and its reputable name shining brightly under the warm orange lightings.  Dining in Morton was really a good experience with its elegant interiors and service was impeccable with special needs well attended. Furthermore they were quite detailed with little actions well taken care of and make us felt close to heart.We were presented with a hand decorated birthday card with our photo instantly printed which was a pleasant surprise to the birthday guy, making the event a memorable one in Morton's !Overall, everything was good. My only gripe was that Photography was a challenge as the place was dimly lit. Nevertheless, this had create a very good atmosphere especially for special occassions. I would highly recommend this place if one is seeking for a good steak dinner, service and ambience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rjxd4z0xAkTK8mwTcCmb9g",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rjxd4z0xAkTK8mwTcCmb9g/o.jpg"
      },
      {
        "img_id": "ir8aX3SK5eI1fw4N1gpUVQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ir8aX3SK5eI1fw4N1gpUVQ/o.jpg"
      },
      {
        "img_id": "kxBeR8ZXxklGoGHaIU2cow",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kxBeR8ZXxklGoGHaIU2cow/o.jpg"
      }
    ],
    "user_id": "w91OgyE6GjOuZ_MtBk21uw"
  },
  "xiO976RhEOAWfCJYpwOESw": {
    "date": "7/18/2016",
    "text": "This place is very expensive. $98 for 6 ounce filet. My friend ordered a Filet Medium and it was served Rare. We asked the server to cook it some more and when the steak was brought back out it was still rare. I have never had this experience at a fine dining steakhouse. Appetizers and salad were great. We ordered the shrimp tacos, oysters, and mozzarella wrapped in prosciutto. Overall,  I would not recommend this restaurant they were playing loudly Justin Beiber  and pop's greatest hits. Not my kind of ambiance for a fine dining restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RCXXKzuKTNiegGPYTG6KiA"
  },
  "DAdD6979UjEMD-x-XUNivw": {
    "date": "2/20/2014",
    "text": "I am not ashamed to say that this is my first time at Morton's Steakhouse, despite their legendary status among my beef-oholic friends. Their price tag is also equally legendary.Excited yet apprehensive about the quality of the steak and the size of the hole it will burn in my pocket, I accepted my partner's invitation to have dinner with him at Morton's.A few things sorely lacking in most F&B establishments in Singapore is the quality of service provided. At Morton's, you can expect the best, personalised service ever (Well, comparable to Black Swan, I would say).Stepping foot into Mandarin Oriental (Morton's is at Level 4), I gave 2 thumbs up to the antiquated-like settings with deep maroon and brass finishing. Somehow in my mind's eye, I always have this vision that good steakhouses will have these kind of furnishings. Anyway, I digress.The two waitresses greeted me with a warm smile and without hesitation I mentioned that my friend is already inside. To which, they confirmed my friend's name and one of them walked me to my table. The self-independent woman in me wanted to decline for her to walk me to my table but she was walking too purposefully for me to stop her. I spotted my partner in one the booths and he gave me a mischievous smile. We reached the table and next thing I knew, the waitress pull out the table with effortless Herculean strength to let me in. Wow. I guess this is part of their service to diners who sit at the booths which I feel was adequate for one person to slide in, slowly.Having checked out their menu online, I was still undecided on what to order so we decided to seek the recommendations of our waiter. He gamely and cheerfully recommended me a Center-Cut Fillet Mignon 8oz as he felt that the 12oz onwards would be too huge for me - if only he knew of my appetite for beef, having ate 2 Jack's Place steak in one sitting! For my partner, he recommended the Chilean Seabass Fillet a La Nage. We ordered the cream spinach after our waiter commented that the sauteed spinach and mushrooms are meh.The crowd was picking up by that time and I was impressed when our food came in record time. Verdict:1. Center-Cut Fillet Mignon - I was singing praises with every gentle slice of beef that I savoured - \"Wow, very soft, melts in your mouth. This is good.\" - to the point my partner was highly amused. The 8oz would be more than sufficient to most ladies, but not to me. Almost to the point where I was tempted to order another one! Served simply on a white plate, the steak oozed flavourful spoonfuls of beef juice!2. Creamed Spinach -  The dish looks overwhelming at first sight but it goes well with my steak as I had no sides on my plate. The delicious butter-filled aroma that it exudes is simply appetizing. Though it is 'creamed', it is light and easy on the palette.3. Chilean Seabass Fillet a La Nage -  Fresh, that's one word to describe the fish. The portion is somewhat larger then what most steakhouses would serve but we are not complaining. The sauce may seem a bit too light for those who are used to creamy, buttery sauce but I feel that it acts as an excellent foil to bring out the freshness of the fish. 4. Key Lime Pie - This tops my list as the best ever, dethroning the Key Lime Pie at PS Cafe. Light and tangy with just the right amount of sweetness, this is a good choice for a desert. Best savoured with after-dinner tea (without milk).The manager stopped by our table to chat and check on our satisfaction and though I usually dislike chatting with the staff during my meal, I was infected by his good sense of humor and charm.Would I return again? Hell, yes! On special occasions though..Service: 5/5Humor of staff 6/5Food: 5/5Price: 3/5 (only because it would burn a huge hole in your pocket if you start craving for the Fillet Mignon 8oz every two weeks!)",
    "rating": 5.0,
    "rated": {
      "useful": 11,
      "funny": 6,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "i3n0TQ9fl6bQuaiZUrchcw",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i3n0TQ9fl6bQuaiZUrchcw/o.jpg"
      },
      {
        "img_id": "NewMasttReiCJIKj8lERjQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NewMasttReiCJIKj8lERjQ/o.jpg"
      },
      {
        "img_id": "C4cMuzLgjSf53U1YwmOUCA",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C4cMuzLgjSf53U1YwmOUCA/o.jpg"
      }
    ],
    "user_id": "ZNyfGsIwsedPlpjmoaq3Eg"
  },
  "A0QBu8vqrhQWL7J5D4rkWQ": {
    "date": "4/25/2015",
    "text": "Everyone is just so friendly at mandarin oriental. That's why I love staying at this hotel everywhere I go. Staff at mortons too are just as proper and sweet. Their cocktails at happy hour too just make that smile bigger on your face. Free steak sarnies too from 5-7pm. You know how a medium rare steak is so juicy? A slice of that is sandwiched by two soft buns and slathered in a horseradish cream. Oh so gooood!!! The chocotinis are the best in town too. Those steak sandwiches and one cocktail will fill you up too. Writing this review just makes me wish for Monday happy hour to come :p",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "3c22LgxU9DkpT8oF74754g"
  },
  "eE3HAHyKcssUxDAPpeRUpQ": {
    "date": "4/3/2015",
    "text": "My steak- medium rare was perfectly cooked, I was impressed because it was so good. We ordered tuna tacos to share as our appetizer and they were delicious too. I think my mouth just gave my stomach a high five.  Oh, and the service was excellente",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qqI5r9WG4VLq4MU9twYXfQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Dessert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qqI5r9WG4VLq4MU9twYXfQ/o.jpg"
      },
      {
        "img_id": "cA1aigxkahfgPrE_ZqP5TA",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Tuna tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cA1aigxkahfgPrE_ZqP5TA/o.jpg"
      },
      {
        "img_id": "6ZN0QNL9eccqvq3xdc2FbQ",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore. Steak steak steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6ZN0QNL9eccqvq3xdc2FbQ/o.jpg"
      }
    ],
    "user_id": "tAr3zFVXoM1K2PrbyCdcTA"
  },
  "2p6Nz6svS2ZPM6VGX0lXow": {
    "date": "12/1/2013",
    "text": "Morton's used to serve some of the best steaks in town at a mid-to-high end price point. The food is still good and service is very good by Singapore standards, but perhaps not as good as before since Lawry's took over. Had lunch recently during a conference, which may or may not explain our experience. Even with a very full house, we got hot cups of lobster bisque and good bread (though we had to ask for it). Our sirloin steaks came at the right doneness but everyone had quite different sized cuts, which is strange for a restaurant that I used to think was very consistent. I would also have liked a bit more charring on my steak but that tends to be done best on a filet mignon. We had cheesecakes for dessert and as always, there were no complaints there.I am willing to give Morton's the benefit of doubt as this restaurant has historically been a great experience at dinner. Will be back sometime to see if things have really changed.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2zbO5Cpuu0svXn3br0T84Q"
  },
  "omF8cb6rZ3YqlacCQFNdHw": {
    "date": "8/22/2012",
    "text": "Morton's is a steakhouse from USA that is really famous for the kind of service that they deliver to customers. Think the service from there have definitely been built up in the Singapore chain. When we walked into this particular restaurant, we were served immediately and brought to our seats in a jiffy. A waitress then came to our table and presented to us the different cuts of beef which was an eye opener.The menu was then passed to us and we decided to order the new York cut and ribeye steak which did not disappoint us at all. We tried the molten chocolate cake as well which was pretty normal, not really glorious or anything was hoping for the wow factor.One thing that we should not have tried is the Caesar salad, with only grated parmesan cheese and croutons on it and really over priced. I have had better Caesar salads with bacon bits and eggs topped on top of the vegetables. Overall a good experience if you know what to order from the start.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rIVHYUzzGRdSCcOztK-aCw",
        "caption": "Photo of Morton's The Steak House - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rIVHYUzzGRdSCcOztK-aCw/o.jpg"
      }
    ],
    "user_id": "k4B4gZFiZscBR9yFFUsc6Q"
  },
  "-UyuIfPIqIK8aG-8--GxGg": {
    "date": "12/19/2013",
    "text": "This is my go to place for steak in Singapore. There is a consistency to the food quality and service standards offered at Morton's. I guess every individual would have their own experiences but I personally have never had a bad meal at Morton's before. Their crab cakes and chocolate lava cakes are also my absolute favourites! Dining at Morton's has become an annual tradition for birthdays and anniversaries. I've tried other steakhouses such as Cut, Chris Ruth, Wooloomooloo etc. some were pretty good as well but so far none comes close to Morton's in my opinion. Its good value for money.Also try getting in the bar during happy hour for the martini and free flow mini steak sandwiches!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ww-VExe53555lkzZAauCGQ"
  },
  "GD5IEgZKBEUzf5SZCTTK1w": {
    "date": "12/18/2012",
    "text": "Morton's is a good choice for a leisure meal and happy hour drinks. It proved to be consistent in service, pricing & quality.In terms of the actual steakhouse function of it I have to say that Morton's is a good 'run of the mill' chain restaurant for the better and the evil. The better being the aforementioned pro arguments: I never had bad service here, I never had bad food here and I find the prices to be reasonable for a good steak. The negative part of any larger scale chain restaurant is that it is generic, not outside the box. Meaning Morton's won't give you the unique experience as Cut would do however it is within a totally different price bracket so not fair to judge it by that.A solid 4 star establishment!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S0AfO9cVeqkIkFxye61muQ"
  },
  "bEL_JV76pEhpjfZcspqPcw": {
    "date": "1/29/2013",
    "text": "I have been very fortunate to make a stop in Morton's at the Oriental whenever I am in Singapore (which has been about once a year for the past 10 years), and each time has been great. The Vibe is exactly how a Morton's should be and the people who work their are awesome.After eating here (this was my first time to a Morton's), I figured I would visit the locations in San Francisco and San Jose, but was completely let down. Maybe the Morton's in the USA should take a lesson from this location on how to offer good service. Anyways, You guys rock!!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pbFIcKknRHjLj1aKi6WAhg"
  },
  "9jafrdgDr8jDjdJ25Bo06g": {
    "date": "9/2/2012",
    "text": "We usually come here for the happy hour where martinis go for a song (relatively) and there's free flow of steak sandwiches to go around. However we decided to check it out properly this time. Love the onion bread. The steaks are great although the portions are ginormous! The crabcakes are to die for and so is the chocolate lava cake.Intimate and cosy. Good place for a celebratory dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "3w_iNJLHUxUogr9PJT62ww": {
    "date": "10/26/2012",
    "text": "Singapore sadly doesnt have great steakhouses, only good ones.If you're used to Lugar's in Brooklyn or Goodmans/Hawksmoore in London, you'll be  disappointed with Mortons.But given the few other options on this island, Morton's is worth going to. Its expensive, and somewhat dark inside. The steak is good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HlFmrT2pMGUaKR_D3AEpIQ"
  },
  "qzWmPEaNneH8sUBQRAqQNw": {
    "date": "3/7/2015",
    "text": "We asked for medium ... But after about 45 mins the steaks came and both were overdone. One was salty. Not sure why. There must be big issues. Waiting staff were apologetic and offered to refund the of the steaks (SGD99++ each). They tried hard to make it up. But we came to this overpriced restaurant for good steak, not apologies, and didn't get it. So FAIL. I have had better steaks in a lot of cheaper places. This was supposed to be a special night out and they messed it up. If you pretend to be a quality steakhouse learn how to cook a steak.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y1QVo4Zh1LkHIet9f5GlLw"
  },
  "AvEzOCUsETGi6B_fYK-zag": {
    "date": "7/17/2012",
    "text": "Steaks make me happy, and when I know I'm headed to Morton's, my heart leaps.Begin either at The Bar at Morton's perched midway up the winding stairway with $12 Martinis or head straight to the restaurant for appetisers. The complimentary onion bread is quite something, I can never have enough of it. But you must leave space for the crab cake. We usually order it to share (begrudgingly) but if budget is not an issue, do yourself a favour and have one on your own. I listen obligatorily to the server's repertoire as they roll the meat cart around, explaining and pointing to the various cuts in a well-rehearsed manner, and managing to stifle a giggle when they pick up the lobster with its claws flailing about. However, when it comes to the steak selection, I only have eyes for the marbled US aged black angus ribeye ($97, moderately huge, we ordered one to split).   Morton's always gets medium exactly right, so no ribeyes of mine ever go to waste, and the marbling means I get delicious melting fat to go along with well-seared, pink-in-the-middle king of all steaks. Add a side of asparagus if you must have your vegetables.Looking for an excuse to go back again! Reservations are a must.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "GHsRh2AFDi4GMpmVkMP0rA": {
    "date": "4/5/2014",
    "text": "It used to be good. The last visit in Nov 2012 saw many changes to the staff and food quality/presentation and size. Had food poisoning after eating oysters on half shells. The double porterhouse tastes different too. Won't be visiting it for a long time.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wH-yhddRO8Uc2e4kjwf1RA"
  }
}