{
  "V9Mk-IF4O7oPUysBunTrTA": {
    "date": "8/31/2017",
    "text": "This is a truly great dining establishment. It well deserves its 2 Michelin stars. I had the Tasting Menu for lunch together with a 1/2 bottle of burgundy. It started with a selection of breads and French butter, then an amuse-bouche. The next four servings were: (1) cold angel hair pasta with caviar & truffle, (2) langoustine, (3) pan seared duck foie gras, & (4) French river salmon, all followed with the main course of Roasted Duck with spring turnip. Then dessert, of course. The service and ambiance could not be better.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9OR0X4T6JjvzLTW6-XZq8g"
  },
  "9I7DHkO8Xs49rZU4dsef2A": {
    "date": "7/21/2018",
    "text": "Two Michelin star French cuisine in Orchard. Serves traditional French cuisine. We went there for lunch which was a relatively good price for fine dining (~130/pax). The courses include: amuse bouche, cold soup, salmon tartare, langoustine, duck and dessert. We find the food overall good but not spectacular, and frankly underwhelming given my high expectations of a Michelin star. The food just felt a bit too safe. Yes, the techniques and quality of ingredients were top-notch but the meal was just lacking in creativity to become particularly memorable. Favorite dishes were the langoustine (fresh / simple but really well-cooked) and the baba dessert (not too sweet, rich but balanced)Service was excellent, a true Michelin star level service. Large and good quality wine selection. Sommelier is quite helpful and gives good recommendation on the wine. They also gave us free macaroons to take as souvenir.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pnloU_4l775UES1NvMAaZw",
        "caption": "Photo of Les Amis - Singapore, Singapore. Mille Feuille",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pnloU_4l775UES1NvMAaZw/o.jpg"
      },
      {
        "img_id": "atyXemtM7p5wxspaHNgu3g",
        "caption": "Photo of Les Amis - Singapore, Singapore. Baba",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/atyXemtM7p5wxspaHNgu3g/o.jpg"
      },
      {
        "img_id": "6abO2Uw5nasBCo7s7MWsgA",
        "caption": "Photo of Les Amis - Singapore, Singapore. Duck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6abO2Uw5nasBCo7s7MWsgA/o.jpg"
      }
    ],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "Ib7_f-Pb1RYXI81xDsv40Q": {
    "date": "11/12/2018",
    "text": "Dining at Les Amis is always a pleasure, from the smooth service to the quality of the cooking. Now, this would not be a two-Michelin-star restaurant in France (where the whole experience would almost certainly be at least one notch better, especially the food and the décor), but let's not be nit-picking and be grateful for the opportunity to come here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "AnhPj5Cou7FRoE1sJfquHw": {
    "date": "11/28/2017",
    "text": "Every time I visit Singapore I have to hit at least one Michelin starred restaurants as there are quite a few in the city! This time we picked Les Amis and it didn't disappoint! We did the Tasting Menu which was perfectly executed with every dish revealed to us from a perfectly withdrawn dome - old school French style. We loved the drama as you don't see it much these days. The service was also top-notch as we felt completely doted on by our multitude of servers. The standouts on the menu were the challen duck (cooked perfectly!) and the langoustine with olive oil emulsion - divine! The menu didn't disappoint and if you want an old school fine dining experience while visiting Singapore, Les Amis fills that bill. :)",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "PRh5g5NyG8gstoTCtX5T3w",
        "caption": "Photo of Les Amis - Singapore, Singapore. Mmmm mignardise.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PRh5g5NyG8gstoTCtX5T3w/o.jpg"
      },
      {
        "img_id": "gLVekNcVwm23FMmQwFGqwQ",
        "caption": "Photo of Les Amis - Singapore, Singapore. The roasted challen duck - divine.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gLVekNcVwm23FMmQwFGqwQ/o.jpg"
      },
      {
        "img_id": "GfKESMLXg9SRwejNsvJMzA",
        "caption": "Photo of Les Amis - Singapore, Singapore. The sinful langoustine...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GfKESMLXg9SRwejNsvJMzA/o.jpg"
      }
    ],
    "user_id": "WvntDWMQnaEV8agu3gcTug"
  },
  "pbCMca1hsbxVpdmX3cQeow": {
    "date": "5/21/2017",
    "text": "Standard awesome French food. Lost a star for a nit-picky-i-can't-believe-im-such-a-snob kinda way. My gripe was that I called ahead for my fiances bday cake. And it was totally forgotten by the staff. I waited 45 minutes after the end of the meal, because I thought it was still coming until the table next to mine got a cake. Then I said something, but it was too late. We just got an extra dessert with a candle in it. Really disappointing.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "BahHO06lo3cLEuQdOxuXLQ": {
    "date": "3/29/2016",
    "text": "Les Amis, helmed by Chef de cuisine Sebastien Lepinoy, is ranked 12th in Asia's 50 Best Restaurants 2016. Opened since 1994, they are one of the longest standing fine-dining restaurants in Singapore. During my week-long trip to Singapore in January, I managed to secure a lunch reservation at their establishment.Les Amis offers several dining options with seasonally crafted menus which ranges from 65$+ to $295+. We opted for 'Le Menu Tasting' which showcases 6 dishes for $155 per person. It's comprised of one cold appetizer, two hot appetizers, two main courses and one dessert.Dining at Les Amis was a lovely experience. Their angel hair pasta signature dish was to die for. The whole team takes a lot of pride in their work and I commend them for it. If you're looking for a straightforward contemporary French fine dining experience with a high level of finesse, Les Amis is the place to be.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LHHfgcnoU7L-3mxlz-8PIw",
        "caption": "Photo of Les Amis - Singapore, Singapore. Hokkaido Scallop",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LHHfgcnoU7L-3mxlz-8PIw/o.jpg"
      },
      {
        "img_id": "Tprj55021_mID0ahoyXe6w",
        "caption": "Photo of Les Amis - Singapore, Singapore. Bread & Butter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Tprj55021_mID0ahoyXe6w/o.jpg"
      },
      {
        "img_id": "PRCEz2H1sXFJl1kfidazXg",
        "caption": "Photo of Les Amis - Singapore, Singapore. Inside the Lobster Rouelle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PRCEz2H1sXFJl1kfidazXg/o.jpg"
      }
    ],
    "user_id": "9lkdbd_YX03kIY39WFS1ng"
  },
  "BHV6QpoTAgn0Kbefh7YfoA": {
    "date": "5/18/2016",
    "text": "Located in Shaw Theater, Les Amis is one of the oldest French fine dining in Singapore so it was a must try in our book. We came here for Valentines 2016 and were pleasantly surprised with a simple and sophisticated decor, which we thought was similar to Jean George in New York. We opted for the Le Menu Classic course, reasonably priced at $185/person. The flavors of the dish, the service, and the atmosphere fell together perfectly (nothing to nitpick about this pl) and we left a happy couple by the end of the night. Will return! BLUE LOBSTER SALADBrittany Blue lobster from Audierne on a bed of crunchy iceberg lettuceROASTED WHITE ASPARAGUSSeasonal white asparagus from Alsace, roasted and balanced with young salad leavesFRENCH SEA BASSLine-caught sea bass from Saint-Gilles-Croix-de-vie, roasted and served \"Printanière\"SWEETBREAD \"RIS DE VEAU\"Sweetbread from L'Aubrac, cooked in \"cocotte\" with a bay leaf, escorted with young carrot HAZELNUT SOUFFLÉWarm soufflé of Italian hazelnuts from Piedmont, served with a dark cocoa sorbet",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "iPL8V_dOtrcMUH6tQZq-Dw"
  },
  "modehIhCBR9SaDeyjT_HhQ": {
    "date": "4/23/2016",
    "text": "Had the degustation menu, for lunch: Lots of techniques, but nothing impressive or memorable. Almost boring :-s Not what I was expecting!  And in fact it's all about the expectations. This place is easily a five star, if compared to all the Singapore restaurants out there. However, when compared to the top restaurants... It fails.  Andre keeps the crown for best restaurant in Singapore for me.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "uKDOY9J_723yWn01JdVGaw": {
    "date": "11/14/2013",
    "text": "Best meal I've had in Singapore. A classic, classy, upscale, quiet, clean, warm, friendly French restaurant. Be warned, they don't really have an \"A La Carte\" menu. They have 3 set menus from $150-$300 and several \"to share\" dishes. We each ordered the $150 \"Decouverte\" menu which included:Steamed Blue Crab and Hokkaido Sea Urchin on Lobster Custard with Fennel Foam - Rich and deliciousCrispy Cornouaille Langoustine, with a mini caesar salad - DeliciousSeasonal Corn Soup with chives - served piping hot with a few caramel corns on the side, rich but balancedHungarian Charcoal-Grilled Pork Rack With Carrots Confit and potato puree - The pork was super tender, the puree impeccable and the carrots delicious. My co-workers opted for Wild Scottish Salmon, one confit and one tartare.Dessert was Dark Chocolate Souffle with Tahiti Vanilla Ice Cream -ice cream was the most vanilla-ee I've ever had.I felt very satisfied with the meal, and felt it was actually good value despite the cost. A special note, they have FOUR kinds of butter and 3 kinds of bread: Baguette, sourdough and focaccia.  The mini baguettes were incredible. The butters are smoked (delicious), seaweed (salty), spicy and salted. I tried each and they were all good in their own way, perhaps the best butters I've ever had. Service was great, they explained each item since I didn't remember what any of the courses were. The wine list is as thick as a dictionary but they have affordable wines and wines by the glass. The restaurant is pretty small and intimate, and their wine cellar is a digital glass walk in safe-room. I will certainly return next time I come to Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "exygIMUwWiMg8HU4L_lNIw"
  },
  "RG8px4sU7LxXWpWMxULLFw": {
    "date": "5/4/2015",
    "text": "I had the good fortune to get invited by a friend to thisincredible restaurant and just returned.  Restaurants frankly don't get any better than this.  Formal wear is a must and frankly this would be the place to wear the nicest thing you own.  I even busted out a brand new suit for the occasion and was happy that I did so.  The menu was incredible and I will list the various things we tried out.  We didn't exactly stick to the set menu because one of the people I was with has a daughter who works at the restaurant and was frankly showing off all the signature items (and I am soooo happy that she did).  Good lord.  The presentation and explanation of all items was damn impressive and helped me out because several of these items are not on my normal menu :)  Here is a list of items we sampled:STEAMED WHITE ASPARAGUSwhite asparagus from provence, served with a traditional mousseline sauceSPECIAL SELECTION OF KRISTAL CAVIARcold angel hair in harmony with black truffle & caviar balanced with an exquisite aroma of kombu &chivesFOIE GRAS & EELpan seared foie gras and french river eel in combination with citrus fruit compote and dashiJAPANESE OMI BEEFgrilled japanese beef with asparagus and traditional \"poivrade\" sauceBABY LAMBbaby lamb rack from \"luberon\" with ratatouilleDark Chocolate P125 Souffle withTahiti Vanilla CreamALPHONSO MANGOin a sugar sphere with coconut sorbet",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "EVdbMUMz3Sj7_SCt-SeOJg"
  },
  "lDCP_1LPbkEbim3jfQvqrw": {
    "date": "7/21/2014",
    "text": "the food is decently - and might I say, perhaps technically - perfect, but there was nothing particularly surprisingly or wow-ing; service is efficient if a little intrusive, since they belong to that class where waiters are aloof and almost slightly standoff-ish (how they manouevre around my photo-shooting also tells me a little of their skill); and the restaurant is lovely, if a little too cold (feel rather than absolute temperature).the bread basket arrives with an array of carbs that brought variety rather than any particularly impressive taste - the sugared orange brioche was best. this was followed by a foie gras mousse-type with mackerel and my garlic-spicy gazpacho - small portions but well judged so. our amuse bouche was a deviled egg livened up by plump ikura - perhaps the most surprising dish (though still JUST a deviled egg).two scallops in their shells made up the best part of the meal - seared lovely and topped with soft chopped mushrooms and a lovely jus - and were definitely worth the extra.and our mains of a shrimp-topped pasta and seared beef continued the theme of good-but-not-special - it's all decently done, as the photos show very well, but we still waiting for the oomph (so ephemerally delivered by the scallop course).dessert was a play on mangos - a shortbread base topped with ripe cubes and puree, as well as a thick mango lassi topped with pistachios. pretty good - but there was such a savoriness about the tart that completely defied its status as dessert (and made me have an ice cream later for my sweet tooth).and to finish it all, we were brought a complimentary dish of madeleines and lemon curd - utterly delicious. buttery, crusty, and soft with fine crumbs, these are spectacular specimens of the french confectionary.this is a tempered review if nothing else - I would certainly return, though most likely only if I weren't paying - because I like my food (especially when expensive) to be spectacularly good, or at least interesting. but it well deserves its status as bastion of fine-dining traditions in our tiny country - and would serve your purposes best (if you find them aligned to those of busy businessmen).",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vz3hfDhFFDnT_xgZ0cTL6w",
        "caption": "Photo of Les Amis - Singapore, Singapore. seared scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vz3hfDhFFDnT_xgZ0cTL6w/o.jpg"
      }
    ],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "_nm_BzMEpOVIX9KFVSw4vg": {
    "date": "9/22/2015",
    "text": "One of the best restaurants in Singapore. The food was amazing from appetizer to main dish. Subtle influence of Japanese way of cooking, which makes the course very unique and nice. I really enjoyed the dinner and wine there, and I can recommend this restaurant for special occasion.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b7N46U0NY8yOaqhw6asZoQ",
        "caption": "Photo of Les Amis - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b7N46U0NY8yOaqhw6asZoQ/o.jpg"
      },
      {
        "img_id": "s1VbocupXw4bvQk-ING0CA",
        "caption": "Photo of Les Amis - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s1VbocupXw4bvQk-ING0CA/o.jpg"
      }
    ],
    "user_id": "v3VX7OGliz8c1aFBL-K7-g"
  },
  "FJb9hU9w5zS4-Jdz68PPbg": {
    "date": "5/13/2014",
    "text": "This is the quintessential posh and good French restaurant where you have a pay a pretty penny and get amazing food, service and ambience. It is definitely a great choice for a special dinner if you want to impress. There is nothing you can really fault their food (all cooked and flavored to perfection) and their service (attentive but not intrusive nor condescending) for. They only do set menus here so it is quite pricey for dinner but they have a more reasonably priced lunch menu (Saturdays included!), so it is possible to try some of their yummilicious food without breaking the bank. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUZ3fmICiFLVrUBl0lDx4g"
  },
  "z6RGwfYIfH4tg2r_YtM6Fg": {
    "date": "11/14/2012",
    "text": "A great place for lunch and for Singapore the wine prices are quite reasonable.I've never been disappointed with the food or the service and it's definitely a favorite spot I can always rely on for a great meal.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8uZZj6sUMpeubbQkL7r8Cw"
  },
  "UkgG_Njc2Oxabs0BgNw5qg": {
    "date": "3/23/2013",
    "text": "I had a really good meal here; service was impeccable and food was delish but it felt a little overrated and the ambience was not the best. Enjoyed myself but not sure i'd come back",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lCmvpQfFpdxhbWVM59eUCg"
  }
}