{
  "H3KwNKHrtcHN4-vmIMEWaQ": {
    "date": "9/10/2018",
    "text": "Kelly Jie (previously Mellben) with the famous Butter crab. This time we tried their award winning Poached crispy fried rice with seafood with superior broth. It is actually seafood fried rice topped with crispy rice crackers and poured with yummy broth. When you eat it, it is like rice with lots of broth but you can taste the crispy rice. I find it special and yummy.  We also tried the truffled pork loin, tasty but not special. The first time seeing restaurant menu with bible verses..Food : 4.5/5Service : 3/5Price : $$$Place : 3/5.HalalRest : Kelly Jie seafoodLocation : Toa PayohCity : Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wk6XWYHHH1NSvTr5-w0DqA"
  },
  "Cc3KyPTiaFblLYKnWJZ-wg": {
    "date": "5/10/2017",
    "text": "Over hyped. Over crowded, over priced. Spent 140$ for two crabs. Their signature crab and chilly crab. Chilly crab was sweet and ketchupy tasting. Crab quality was not bad but not worth the wait and money. Better off at jumbo ECP if you want the touristy thing.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GxvTcyoxfR1rmd_KMWF9aw"
  },
  "mYLEkfIyijUECLqDWYOoyA": {
    "date": "12/31/2016",
    "text": "Came to this location by mistake, but in the end it worked out well.  The wait was super short and we had a large table to ourselves.  Ordered razor clams, salt and pepper shrimp, bee hong crab and black pepper crab.  Amazing and well prepared.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6X1D7uMgjvk1xAVdfqO5bg"
  },
  "95cU4lZDLbdocLmcgwUXcA": {
    "date": "1/1/2014",
    "text": "Let's see... how do we summarize our dinner at Melben? Yum. Yum. Yum. Let's just jump straight to the crabs. First time having salted egg yolk crab for me and I think I just found a new favorite preparation for crab. The savory salted egg yolk elevates this fried crab dish and brings out the sweetness of the crab. I just wanted to gather the crab roe and salted egg yolk to make a \"crabonara\" sauce to throw with some pasta. The crab with tung hoon dish had a nice fragrance and this peppery preparation of crab was truly delicious too. As before the crab is incredibly sweet and nicely counterpointed by the black pepper. Lastly, the crab bee hoon soup was just sublime. I could drink that sweet and savory broth for days on end. Honestly can't remember too much about this crab because the broth was just that good. All in all, we had a nice variety of crab preparations and they were all yummy in their own unique ways. You would think other dishes would suffer when you are known for one thing, which in Melben's case is crab, but their other dishes are pretty decent too. From the garlic veggies to salt and pepper pork chops to the cuttlefish youtiao, the dishes were pretty pretty tasty although relegated to playing back up to the crabs. My aunt called ahead to reserve a table and our crabs and I think y'all should too. As everyone has mentioned, you need to come early otherwise you're out of luck. Or as I would like to think, feeling really crabby for the rest of the night.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "23cn_1dGwki-nWuWxrOWAQ",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore. Crab bee hoon soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/23cn_1dGwki-nWuWxrOWAQ/o.jpg"
      },
      {
        "img_id": "x0nlQ-umLtAYOf72ciIVzQ",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore. Salted egg yolk crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x0nlQ-umLtAYOf72ciIVzQ/o.jpg"
      },
      {
        "img_id": "0ZV51hu0JnV4Dd2og9GZkw",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore. Crab tung hoon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0ZV51hu0JnV4Dd2og9GZkw/o.jpg"
      }
    ],
    "user_id": "DvcAC_nlKaTDsHcA8Slagw"
  },
  "ertTxRGoWukFaXN2QX8DMQ": {
    "date": "4/27/2016",
    "text": "CRAB. apparently is a \"MUST EAT\" when in singapore. & That's exactly what I did... 2 days in a row... Mellben Seafood was the 2nd day. And it did not disappoint! The food did not. The service was definitely just frustrating and straight up terrible. But, I was very excited to try this place because the Foodporn show on clicknetwork (youtube channel) did a segment on their shimmering sand crab and salted egg chicken drumstick lollipop! There are two locations apparently. This one in tou payoh (sp?) and another one. This one is located across from a food hawker center. Currently, there is construction going on so the front of the restaurant might be hidden from the street view so you'll have to tell your taxi driver to drop you off at the side with the numbers \"211\" on. Basically, go inside the carpark and after you pass the gate, turn left..? and there should be a durian stand in the front. Now, don't be expecting some fancy high end restaurant with Air conditioning okay. This place is where LOCALS singaporeans go so the food better be bomb but that also means that the place is going to be pretty much kind of like a hole in the wall. & it kind of was. The restaurant was a bit tiny inside so they kind of expanded out to the courtyard where a few tables were set. Smaller tables are inside the store, cooled by basic fans. We had a table reserved out in the courtyard because our party was originally bigger than 6. It was so hot and ratchet outside seriously. and it was dark too. They had one or two street lights but they didn't help much. Since they're known for two tyypes of crab: the braised beehon style and the butter style, We got both ! Yay for two crabs for one meal! Def. get crab. It was soooo fresh and delicious. The hardest part about eating crab will always be taking the shells off. & that will always be a pain in the ass but that's what makes the crab meat even tastier. Be sure to dip the meat in the sauce so that you're not eating some tasteless crap. I wanted to also try shimmering sand crab but it would have been way too many food for just a party of 6 haha. We also ordered the salted egg chicken drumstick lollipop, which was da bomb!! Def get that! Some other dishes were the tofu with enoki mushrooms. steamed fish, green veggies, and pork spareribs. Pretty much over ordered! So, all the food were pretty yummy! My favorites were the crabs and the chicken lollipop. And also, the coconut juice here is fresh and yummy as well! Their dishes have different sizes you can order from small, medium, and large. Now, onto the disappointing part of the experience: the SERVICE! It was definitely a bust!! My grandma and I had arrived before the rest of the party. I was told to tell the host the reservation information. I don't know if speaking ACTUAL ENGLISH, not SINGAPOREAN English, is considered to be a bad thing or what... but when I spoke English to the girl, she treated me like crap! She just pointed to a table out in the courtyard and simply said, \"that's your table.\" Okay, like can you actually walk us over there. Wtf. Anyway, onto the rest of the evening. We sat there for the longest time and NO ONE came to check up on us. I repeat, NO ONE. Not even to ask if we wanted water. or Even if we were ready to order for that matter. Granted, the rest of the party hadn't arrived yet, but still. When everyone arrived and we were ready to order, none of the servers cared to check on us. My cousin had to basically flag down the waiter who was taking the orders of the adjacent table. All throughout dining, every time we needed something, we had to be prepared to wait forever until they noticed us. It was definitely frustrating. If they're that understaffed, you'd think the management would hire more people or at least train these people to be more efficient. Food was delicious. Service sucked. Decor sucked. Prepare to have drops of sweat roll down your face as you're going at it on that crab claw.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "m0TACncZSr1OxzYOxNqf9w",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m0TACncZSr1OxzYOxNqf9w/o.jpg"
      },
      {
        "img_id": "PY4MQRxzxXfBcgkHUwCTAQ",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PY4MQRxzxXfBcgkHUwCTAQ/o.jpg"
      },
      {
        "img_id": "KzU_D0ONplx-yT0JBG4P8w",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KzU_D0ONplx-yT0JBG4P8w/o.jpg"
      }
    ],
    "user_id": "Zi-Py1F06A5G94jcFBljUA"
  },
  "6IrgzlGbkquvG0QHpwiluQ": {
    "date": "3/1/2014",
    "text": "Honestly the food here is good. Of course it's not cheap but not crazy-Jumbo prices either. The items that we're oh-so-good were:1) Crab in Broth - we paid for extra Beehoon and soup and it's super worth it! The broth was thick with favour and the crab, tho not huge, was fresh. The flesh came apart nicely  and easily. Indication of freshness to me. Easily best dish of the night. 2) Guinness Pork Ribs - very well marinated ribs with excellent taste. Doesn't taste like Guinness at all. Very very tasty dish. 3) Broccoli with Beancurd Skin & Mushrooms - it's essentially a very simple dish but don't very very nice!4) Creamy Butter prawns - it's really prawn in thick salted eggs sauce. What's NOT to like?! Large fresh prawns in savory sauce! Makes you wanna scoop up all that sauce after you're done with the prawns. Other dishes are decent but the above of special mention worthy. Will be back again. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2SkM42z_QK-cchy8Q0yv1Q",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore. Creamy Butter Prawns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2SkM42z_QK-cchy8Q0yv1Q/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "21IKJY7N5l1SW88vD4ZvTg": {
    "date": "9/15/2017",
    "text": "They have a great selection of Chinese foods, but I came for salted egg crab which was quite good. I'm glad there's one like this nearby.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lbIwEEcS-63tuWQ9Zh6eQ"
  },
  "FOC5-vXJWbHYHR9OtN_WfA": {
    "date": "3/16/2013",
    "text": "The Toa Payoh branch of one of the better known crab establishments in Singapore. This branch opened when the original Mellben surged in popularity. Prices have risen over the years but it is still a decent place with a good variety of crab and seafood dishes.Mellben is mostly famous for crab bee hoon, a whole crab served in a fragrant, flavourful milky soup with thick rice noodles. Their chilli crab is also good, although not the star of the show.However, the menu has since expanded to encompass a multitude of crab dishes, the latest of which is \"Shimmering Sand Crab\" (jin sha crab). This is crab deep fried and smothered in a sauce made from salted egg. Absolutely finger lickin' good.The queue is as equally long as the outlet in Ang Mo Kio so arrive early with ample amounts of patience. The wait can stretch to 1 hour. (I found myself browsing the durians next door while waiting) Depending on the supplier and season, they also tend to run out of crab, so being early is also important. One good thing, they also accept VISA! :)Skip the other overpriced crab restaurants in the city. Toa Payoh is where it's at.Footnote to non-locals: BTW, this is not your frou-frou white tablecloth atas seafood restaurant. You sit outside with no AC, on plastic chairs and service is brusque. You're here for the food, no?",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "EGnVL_SLPYsq-E7bwKHQMQ": {
    "date": "5/6/2017",
    "text": "We ordered Mongolia flavored venison, they made a mistake and gave us Mongolia flavored pork, we didn't know until pay the check, they said because we have eaten the dish, we have to pay for it, they didn't even say sorry about it, of course we paid the check, bad attitude ever!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gbR3-blufE_JApmnrzmskw"
  },
  "6EcBw_cBtIH0O3h0DdDxOw": {
    "date": "4/9/2015",
    "text": "Came here with some friends quite a while back.  Even though it is pretty far from my home, I decided it deserved a try especially after all that I've heard about it.  It was full on a random week night so it must be good right?  Well...  It was and I absolutely enjoyed it.  I particularly loved the salted egg crabs (it was my first time eating it).  I would definitely go back again soon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5Nsnc6QlU-HKIoy7u-Bqrg",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore. Salted egg crabs was legit good!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Nsnc6QlU-HKIoy7u-Bqrg/o.jpg"
      }
    ],
    "user_id": "E3X-LrEXDGH78gsi61yb8w"
  },
  "sCzsg0RDr1BbdawpzfoYfg": {
    "date": "2/16/2015",
    "text": "Again dinner here cause my friend recommendation. It was  a nice kinda hawker food. The noodle crab very yummy, love its soup! The green vegie was nice. And pepper crab was so so. Recommended for group at leadt 4 ppl.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NvvivtkiayzsV5rNaDp7fA",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NvvivtkiayzsV5rNaDp7fA/o.jpg"
      }
    ],
    "user_id": "62jyeuaoPpypSF9C2yncgQ"
  },
  "-orfDs0yPVxtTfrmJKysyQ": {
    "date": "9/1/2012",
    "text": "With all the rave about this restaurant, I invited my family to celebrate my birthday at this restaurant. My experience was a disappointing one where the food was not as expected. We ordered the Bee Hoon Crab Soup and Chilli Crab accompanied with some other Cze Char dish. The dishes were nothing fantastic. As for crab, they were very big in size. The claw was as big as person closed palm.  Sauce of Chili Crab was too watery and crab meat was not fresh enough. The total cost of the meal come up to around $200 plus which was considered expensive. Overall, I will not go back to this restaurant again",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jegCygJ7zOJgiM8lqnwL0g",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jegCygJ7zOJgiM8lqnwL0g/o.jpg"
      }
    ],
    "user_id": "9evC7g5uOFAtp-UTbi1tWg"
  },
  "Anu7ApV9_XojmJNXkORMKg": {
    "date": "12/15/2012",
    "text": "Awesome! This was recommended to me by a Singaporean friend. I haven't had delicious crab like this in quite a while. The  curry clay pot crab was good but the butter crab was just divine! The prices are very much inexpensive considering the quality of the food. It's located in one of Singapores many food 'malls'. There isn't much by way of service but the food is just amazing! I would definitely recommend it and go back if I'm ever back in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WF2dTqsv4STUw1n_2qihxQ",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WF2dTqsv4STUw1n_2qihxQ/o.jpg"
      },
      {
        "img_id": "YeLWQoLA0vpB1oaGiOswMQ",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YeLWQoLA0vpB1oaGiOswMQ/o.jpg"
      },
      {
        "img_id": "uTmFpmJ_P1JNN2WaiMLIcA",
        "caption": "Photo of Kelly Jie Seafood - Singapore, Singapore. Clay pot curry crab",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uTmFpmJ_P1JNN2WaiMLIcA/o.jpg"
      }
    ],
    "user_id": "Rvn-Ymc8_9z4vbcm2ZwenQ"
  },
  "yv1KSN2sOfUbG7wIP6jQmQ": {
    "date": "10/7/2012",
    "text": "The black pepper crab here was amazing, one of the biggest crabs I've ever eaten. Claws were huge and the flavor was so good.  Other dishes here were very tasty, I just don't remember what they all were since someone else ordered for me and my associates.  This is one of the few 'sit down' restaurants among the food court / hawker stands in the Toa Payoh #8 center.  It was very crowded, which to me means (whether you're in Singapore, the U.S., or anywhere else) that there's good food there!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ak8fMTlzsktJY4c2rHS4w"
  },
  "uz0QqFfmN3CDgwKkzppOZA": {
    "date": "8/29/2012",
    "text": "Right smack in the middle of a coffee shop in Toa Payoh is a branch of the ever famous Melben Crab. I was quite excited to try it out since it's been long established as one of the best and most authentic crab restaurants in Singapore. My first impression was ultimately chaos since there was no visible system to queuing to have our orders taken, and even with their staff desperately trying to get some order into the system, I still encountered the unpleasant experience of having several families jump the queue ahead of us. Couple this with a growling tummy and you get a very grumpy patron wanting food fast. HOWEVER, the food took forever to be served, and I hated how they served the rice first, with 3 dishes being served one by one - as if we were attending a 8 course wedding dinner! The rice was cold by the time the first dish of bamboo clams was served, and we had to actually stop eating the rice while waiting for the veggies to be served. The crab, which finally came last, was served after our rice bowls were empty - big fail! But to their credit, the Butter Crab we ordered was delicious, with huge chunks of fresh meat coming off cleanly from the shells. Their fried mantous (buns) were amazing dipped into the butter sauce as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05tSDymzhXyvaxO1G24d0g"
  },
  "K6rjLvCnfi5tdwV_gsHwbg": {
    "date": "1/20/2013",
    "text": "We have eaten here several times over the last two years. It is usually the special place to take friends when they come to Singapore. You have to get here early. It opens at 5pm so be there by 5pm. Any later and get ready for a wait.During our latest visit last night, we ordered Mongolian prawns, steamed Grouper Hong Kong style and White Pepper Crab. Some Kai Lan and Asparagus and some seafood Fried Rice completed the order. Service was actually pretty quick, even though they advised us it would be a thirty minute wait for the food. The vegetables and seafood Fried Rice arrived first, the garlic in the Kai Lan and the Asparagus helping add some flavor, while the asparagus had just the right amount of crunch when you bit into it. The seafood fried rice was OK, but not spectacular. Does anyone know if seafood fried rice is spectacular anywhere?  I thought not. Anyway, next up we're the Mongolian Prawns. Only five on the plate which would have been fine, apart from the fact there were four of us. This meant a fight to the finish for the last prawn. All were big and juicy with the Mongolian sauce having good spicy flavor. Next up should have been the White Pepper crab, but actually turned out to be Black pepper Crab. No problem it was still great despite the mix up. The steamed grouper was last, serviced up Hong Kong style in a soy, ginger and garlic sauce. This was the star of the show, the fish was very tender, falling off the bones, with a really delicate flavor not overpowered by the soy, garlic and ginger sauce. Many napkins later, four of us sat back covered in crab shrapnel and surveyed the scene before us.  We had done justice to all of the food and swore we would be coming back soon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "i2G5mQrL1g_wgSuL8DGExQ"
  }
}