{
  "6mU7VL5ueEWUca17hItHsA": {
    "date": "8/15/2014",
    "text": "Chirashi don for only $17.90 with buffet of 4 side dishes. Where to find? Lots of raw fish. Salmon, tuna n some type of clam. The chirashi don was very fresh n worth the visit if u like raw fish in a bowl with rice. Lots of raw fish too. The side dishes were unremarkable. But u did not go there for thatFree flow of ice tea tooI heard that u have to go early, if not u will have to queue.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "TWE8pxLvB-exj4uyES6ymw",
        "caption": "Photo of Hanare - Singapore, Singapore. Open timing",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TWE8pxLvB-exj4uyES6ymw/o.jpg"
      },
      {
        "img_id": "BojT7ciWNRqKyArXvhBYsQ",
        "caption": "Photo of Hanare - Singapore, Singapore. Chirashi don with lots of raw fish. Tuna, salmon n clam. It is very fresh. And only $17.90 with buffet of 4 side dishes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BojT7ciWNRqKyArXvhBYsQ/o.jpg"
      }
    ],
    "user_id": "OharZjJQV4tfO6Q_30P8tw"
  },
  "L___GsHpMdyA4oekfbepfg": {
    "date": "12/22/2016",
    "text": "The restaurant is ran by the wife of Teppei-san, the man behind the well known Teppei Japanese restaurant in Orchid Hotel. The restaurant was located at the second level, on top of Super Star 3, a Korean BBQ restaurant. Here one just order at the counter and find your own seat. Only NETS and cash is accepted here. Similar to other outlets under Teppei, it also offers Barachirashi. But that is where the difference comes in. With each order of main course, one could help yourself to the various side dishes on the counter.As it was Wednesday when I visited the restaurant, the daily special was Barachirashi 7 colours ($24.80). The usual barachirashi topping, aburi salmon, crab claw, negitoro, scallop, salmon roe, tempura crumbles, on top of sushi rice , with fresh wasabi. The serving looked small in the big bowl, but it was quite filling. For side dishes, there's braised chicken with vegetables, Kabocha Korokke ( Japanese pumpkin croquette), Kakiage, miso soup, DIY salad, egg mayo, pasta , Hijiki (brown sea vegetable growing wild on rocky coastlines around Japan, Korea & China) No Nimono, kinpira (burdock root cooked in soy sauce), miso eggplant, marinated bamboo shoot and tea. As it was is ladies night, one could also enjoy a free drink after a bowl of main course. However I was too full and forgotten about the free drink.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "200q4WRqVe8OOhvShJuMJw",
        "caption": "Photo of Hanare - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/200q4WRqVe8OOhvShJuMJw/o.jpg"
      },
      {
        "img_id": "LwddBs-BebFqpPJfYx9HVA",
        "caption": "Photo of Hanare - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LwddBs-BebFqpPJfYx9HVA/o.jpg"
      },
      {
        "img_id": "pQ0VKDwfSrAMYyJLm9wMKg",
        "caption": "Photo of Hanare - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pQ0VKDwfSrAMYyJLm9wMKg/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "Sl59s_5Ksh_I9QIILcNZkQ": {
    "date": "12/3/2015",
    "text": "A year ago, i wouldve give them 4 stars but theyve revamped the menu so $18 gets you the chirashi bowl and 2 sides instead of 4 unlimited side dishes. what can i say... Im a cheapo!(Also, there were times when the fish was bad/sour or i got sick after, but its not stopped me from going back!)The chirashi bowl really is the star here. Thick servings of sashimi (salmon, tuna, ika, scallop, some type of clam) marinated in a delicious sauce, served over rice. They are very generous with the seafood. I honestly think theres more seafood than rice!I have never tried the buffet (honestly, it always looked kinda sad) but the new revamped menu offers unlimited sashimi prepared to order, so if youre a sashimi lover, this could be worth a tryThe atmosphere is cafeteria style. Not a place to sit and linger. Definitely not a date place. There is suntory beer on draft and a limited sake menu. Although once, when i ordered a large bottle of sake and they didnt have it, they brought it over from teppei (the more famous sister restaurant)!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P6U48hZgmlYyayclPlf_Tg",
        "caption": "Photo of Hanare - Singapore, Singapore. Almost 1:1 ration of rice to seafood",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P6U48hZgmlYyayclPlf_Tg/o.jpg"
      }
    ],
    "user_id": "GQh4KSCygodKKum529q_LA"
  },
  "erx_yyjkVUMFF1uvM_vtig": {
    "date": "1/15/2016",
    "text": "No idea why this place even offers a buffet style. There are so few items here, and the side dishes aren't great at all. I ordered the barachirashi. The fish here just had a lot of fat, which I did not like. It really wasn't that great at all. I guess if you're looking for a less expensive place with mediocre chirashi, then this is your spot. I also see on others reviews that you get two unlimited sides. But when I was there with a friend, we asked the waitress twice how many sides we get. And she replied only one unlimited side. What. She didn't not seem so enthusiastic about anything. She wasn't clear on the first time, that's why we had to ask her twice. Overall, I'd much rather pay a few bucks more for better quality and larger portion fish.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AZwTmh8dP7E4e6wac7Knng",
        "caption": "Photo of Hanare - Singapore, Singapore. Barachirashi.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AZwTmh8dP7E4e6wac7Knng/o.jpg"
      }
    ],
    "user_id": "6Lmv1k8mnufs78d0Gbk-ow"
  },
  "bq5TDuitYl48NkatP0hAqA": {
    "date": "11/8/2014",
    "text": "Bara chirashi $29.95 with unagi for $17 plus mini buffet.  A good place to go to if you can't get a reservation at teppei( sister location) about 20 meters away.  Dish is fresh atmosphere are great for young couple, family, even first date with budget!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5WbEaXe-srcIOZKnFFassg",
        "caption": "Photo of Hanare - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5WbEaXe-srcIOZKnFFassg/o.jpg"
      }
    ],
    "user_id": "LLkkL1dYo6VKRpilVHmz6Q"
  },
  "7p67Me1ia1QYsxa5icggUQ": {
    "date": "6/10/2014",
    "text": "I have the utmost respect for Teppei, which offers excellent value lunches, and very accessible (if you can get a reservation) omakase for dinner.Hanare though, is markedly different... and definitely not as good.Arrive at Hanare and you pick one of two options. The buffet package, or the chirashi bowl.The former gives you access to the entire buffet, as well as the 'main of the day'. The latter gives you a slightly smaller and simpler version of Teppei's famous chirashi bowl, and access to four side dishes on the buffet. Even though everyone in the restaurant had ordered the chirashi set, we rather foolishly opted for the buffet. Food wasn't heated properly, some items were soggy, and generally I'd say it's definitely NOT worth it. The curry was alright, the rice good. The cold soba of course was as cold soba is, though the noodles were a bit mushy.Sufficed to say, IF we ever go back, and that's a big if, we're going for the chirashi bowl. Also, the best part of eating at Hanare? Unlike a meal at Teppei, you're not going to smell of fried food the whole day.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "uHPiDjY0eCmZxHKoj09EiA": {
    "date": "11/9/2014",
    "text": "I have been here three times now, and I have to say, this is becoming a favorite for me. I always get the chirashi-don, for about 17 bucks. They have different add-on options (more fish +6, negitoro +6 etc) but the normal size is already a lot of fish for one person, and I eat A LOT. The fish cubes are huge and fresh, and I especially enjoy the crunchiness and coldness of the fresh surf clams and the ikura on the rice. The rice is usually perfectly cooked (2/3 times I went), and I love it that they serve freshly grated wasabi instead of the cheap horseradish imitation. The last time I went, I think they forgot about the surf clams and ikura for mine, so I was a little disappointed, but I will try again because I am stubborn like that. Definitely a great spot for a quick and yummy lunch!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 6
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "-Arwl5pXxodKQHvRTAWs3Q": {
    "date": "12/6/2014",
    "text": "LOVE HANARE. The Bara Chirashi Set is da bomb. Priced at only $17.90, it is THE most value for money Japanese dish in Singapore. I am so glad that my friend introduced this place to me. I now patronise this place monthly. I have to say that this is no place to bring a date to as there is no ambience and it gets very crowded and noisy during peak hours. But it is the perfect place to satisfy your fish craving for cheap. Best to come during non peak hours.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "oUZ3fmICiFLVrUBl0lDx4g"
  }
}