{
  "EuPuCdfRQDS2KpBFMFkq_A": {
    "date": "1/22/2016",
    "text": "Porridge so smooth and flavorful, you could even eat it on its own!So my usually would be the Century Egg and pork ball porridge.Let me make this clear. The Pork balls are not the ones you buy over the counter, its hand made! Soft and Succulent, Its my one recommendation. Do a add on of $1.00 for extra meatballs. Its more than worth it! let me know how it goes. This is one shop that appreciates you being there. Ingredients are prepared with a lot of love and your porridge is cooked pot by pot.Trust me on this. One spoonful of it, and you would understand what i mean.Find some time and try it soon! For me its a 5/5. Let me know how you feel!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dCSfgihxACerBBSGmcHOxA"
  },
  "4zjj7RGk3Zl_cfNQh52kdQ": {
    "date": "4/14/2017",
    "text": "The rainy season has me craving for hot comforting porridge ever so often. I normally cook my savory oats that's hits the spot but sometimes you gotta let other people shine :)This porridge place is highly recommended by a friend who stays in Bedok. I tried the fish porridge with century egg and also added an egg. The first impression wasn't too impressive / unique; the raw egg was visibly seen and waiting to be stirred and the porridge seemed too thick. Anyhow, a good stir to cook up the egg also revealed generous and thick slices of fish. I noted the fish isn't the typical Yu sheng fish, which is the snakehead, but a more solid and expensive batang (Spanish mackerel) fish. Impression getting better. Finally, the taste test. I must say the porridge is well seasoned without additional soy sauce. Initially I thought it was bland, but after the second third mouthful, I admitted it was just nice. It was very smooth with no visible grains left. You either like this fact or not. I also liked that the amount of century egg was just right, not too much that it overpowers. The bowl of porridge just about satisfied me as I'm not super hungry. I can imagine if I was, it wouldn't be sufficient. But bedok hawker center has a lot of other yummy food  as well so yeah, order them together with porridge. You will have a great meal!ETA: tried the fish porridge over at the tampines round market branch. It wasn't as good as bedok one. Porridge was rougher, saltier and just 5 prices of fish - $4. No additional egg or century egg this time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xwFPNvOnHRr9vocuwSiimA",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore. Fish porridge $4 from tampines st 11 round market branch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xwFPNvOnHRr9vocuwSiimA/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "6_n91UTfFuCiQvW622hvuw": {
    "date": "6/24/2016",
    "text": "Ah, the correct consistent texture of the porridge with the flavorful taste of the pork, make this place a winner and must go for all who loves good porridge.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HWy65OBh135Ibh8Oqv6HYQ",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HWy65OBh135Ibh8Oqv6HYQ/o.jpg"
      }
    ],
    "user_id": "PT0lT9ZWtp2xffUY825pQQ"
  },
  "Ol8KX_tlnRZhrwza9RPUYg": {
    "date": "10/12/2014",
    "text": "Nothing is more comforting than a bowl of thick, smooth porridge and this stall hits all the marks! The porridge is the kind where the grains have been disintegrated, so one can easily slurp it up. It was incredibly flavourful. The ingredients I picked were century egg and sliced pork. The meat was cooked perfectly; tender and came in thick slices. The stall was also generous in its serving of the dish, which included spring onions and pieces of fried dough sticks (zha you tiao). I opted for takeaway so the dough sticks were packaged separately. This seemingly unassuming dish left me wanting for more (yes, I see the irony). It was just that delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "il3_NDz7_45lPV_tUQwcRw",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore. A scoop of sliced pork with century egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/il3_NDz7_45lPV_tUQwcRw/o.jpg"
      },
      {
        "img_id": "Iq060etgdxiKx6tchQ6BuQ",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore. Closeup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Iq060etgdxiKx6tchQ6BuQ/o.jpg"
      },
      {
        "img_id": "CKVSprgOsyK_mfHCriP4uw",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore. Takeaway: Century egg & sliced pork porridge",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CKVSprgOsyK_mfHCriP4uw/o.jpg"
      }
    ],
    "user_id": "g78M4cqexs1siTxyLnT1ow"
  },
  "Z75OLfmvV1ahBRP4bs-X5Q": {
    "date": "11/4/2014",
    "text": "I've been eating this pork porridge for the last 2-freaking-years since staying in Bedok so of course I'm a fan. The stall is manned by 2 different owners in the morning and at night. If you're here for breakfast, you can always grab some fresh dough fritters (yu tiao) from another stall nearby and dunk it in your porridge. Satisfaction guaranteed. At night, business can get very busy but the efficiency of the lady cook with her 4 stove / pots gets things done so fast and effortlessly. Waiting time during peak hours are usually 20-25 mins, so be prepared.$3 for a bowl of porridge. Also, they charge an extra $0.20 for the plastic container if you decide to take-away.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "3UQmOtoRfFoNoEm1xqQU2g": {
    "date": "2/15/2015",
    "text": "What can I say about this porridge, it's absolutely delicious! I think it takes around 3 bowls to satisfy my stomach, that's how good it is! Among the places I been, this has to one of the best among the hawker centres. I went there a few times during dinner and supper time, and having this delicious bowl of porridge requires a long waiting time, but the good news is they serve it to your table so all you need to do is dig in to others first while waiting. Who says you need to spend lots for good food? For $3.50 including egg, your stomach will love you to bits especially for congee lovers! So what are you waiting for? Come down and try it yourself!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-kBrdJs0gz0z_rBDYIqWHw",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore. Century egg porridge - excellent!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-kBrdJs0gz0z_rBDYIqWHw/o.jpg"
      }
    ],
    "user_id": "Vtdm-QpN5yYxT-O00cuqFg"
  },
  "VbliG41vVckwu0TsPI65Gw": {
    "date": "11/18/2015",
    "text": "Restaurant standard at a hawker center price. Porridge is thick and tasty. Many other local delights at the same location. Great place for supper seekers.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mblLofAnHjN0vn0az64cXA",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore. Fish porridge is equally yummy as the pork porridge.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mblLofAnHjN0vn0az64cXA/o.jpg"
      }
    ],
    "user_id": "1KV1vE1VkGclAyFmnaPUWg"
  },
  "CJLtmxd-5X1W4QFFyZ9A4A": {
    "date": "5/24/2016",
    "text": "Love the pork porridge here. It's one of the best! There are two stalls. One opens in the morning and another at night. Would recommend the night stall as it's much nicer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRjk2PQoMQffOUdA8OzdBg"
  },
  "ZGk8Bzom3C0jTHySNk-Oig": {
    "date": "7/15/2012",
    "text": "The porridge here is one of the best I've had in Singapore! Initially located within the Block 85 food centre, the entire place is under renovation and is now at a make shift food centre built along the road, past the bus stop along the main stretch.The porridge has an even and smooth texture. It retains its thickness and and incredible flavours even when you take it away. The stock they use is made from the real thing, not MSG flavoured cubes. They are very generous with their ingredients, which includes fresh meat and seafood, but none of the frozen foodstuff.My favourite is the century egg minced meat porridge. You can request for additional ingredients at a cost. I usually ask for a raw egg to cracked into my bowl. As I stir it into the piping hot porridge, it gives the porridge an added dimension to its flavour and texture.Expect long queues and a lack of seats during the peak hour times. Otherwise, head over at night for a healthy supper snack instead!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YFzcVCU4ZnPX2Ot_N6hgOA",
        "caption": "Photo of Chai Chee Pork Porridge - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YFzcVCU4ZnPX2Ot_N6hgOA/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "tpDoxrEUWgLqS9NwGWW6Vg": {
    "date": "8/29/2012",
    "text": "For some reason, I don't have a practice of eating porridge at coffeshops, and much prefer to have porridge either cooked by my mom or at dim sum restaurants. However, I have heard good things about the porridge here and decided to try out the porridge.I ordered the pork porridge, which came with generous amounts of pork slices and minced pork. The pork was tender and delicious. The porridge itself is really phenomenal; the texture was very smooth and the congee had a thick consistency, and I dare say that the quality is on par with those of the good restaurants. With the added egg, the taste of the porridge is really enhanced. All in all, this place serves up one of the best porridge as far as I can remember.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wnjh_5SaxBDNZ0YUux8m1w"
  },
  "B84TtnXbL2m6Rn-CxWQMMw": {
    "date": "4/30/2014",
    "text": "My favourite porridge. What will make me drive all the way to bedok for porridge? This! Thick. Flavourful. Satisfying. Homely.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYk89bcKbeRfER-P7YaRig"
  }
}