{
  "AVKDQ4bmv7uCfKWSDwyhjw": {
    "date": "11/29/2015",
    "text": "We came here being quite disappointed with the Indian cuisine available around other popular eateries in the island. We had heard good things but were worried that it would also turn up in disappointment.We were very pleasantly surprised. This is exactly what we were after, and not only at a reasonable price but with fantastic service.The flavours were not bland at all, but rich and very aromatic. The level of spice was great, not too overwhelming but rather enough to complement the food.We will definitely be visiting again, and expect that we will be visiting regularly throughout our stay in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N9Q3nD6YNMYIVcLh3LyVIA"
  },
  "srhytrJcAiJgkmfQlBAe-Q": {
    "date": "5/9/2018",
    "text": "Rooftop restaurant of Mustafa Centre, and in the same character/style as the store: plebeian décor and ambience; open from 11 am to 1 am; all varieties of South Asian food - North Indian, South Indian, Pakistani, even Indo-Chinese (ie. Chinese dishes cooked with Indian spices, extremely difficult to find even in India and certainly outside); moderate prices; Halal-certified. You'll be spoiled by the different varieties of dosa and biryanis. Not terribly refreshing, but surprise, surprise - one of the most flavourful Indian food in Singapore! Even if you don't plan to shop at Mustafa, worth a trip!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yh1J-Y9HN88FEyfj9RSB6w",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yh1J-Y9HN88FEyfj9RSB6w/o.jpg"
      },
      {
        "img_id": "1Zui_3T6vHOpsORCkb6Gtw",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Zui_3T6vHOpsORCkb6Gtw/o.jpg"
      },
      {
        "img_id": "u-eGjiyWBMtLOJNkFd16Dw",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u-eGjiyWBMtLOJNkFd16Dw/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "K4RNb6PeHZ0RiUKjmek72Q": {
    "date": "6/26/2017",
    "text": "Oh my goodness how did I forget about this place. I am a regular at the Mustafa Center and this place should not be missed! It is in a really strategic location I have been here once and this is your typical grab and go Indian food. I highly recommend it if you are in a rush. It is the right place to satisfy an Indian food craving. The place is not too shabby. The kabobs are actually quite good it does taste better than how I had it in the USDrawback: the food is a bit on the medium price side. It doesn't fit well. The food gets cold easily so please get it while it's hot. This place can feel real empty. I was expecting a really lively place bur the reality shows me that it's not that good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Odc6CMAo8plVcl7uHuTjCg"
  },
  "_3ktfrwx2jdYOwJBnttASQ": {
    "date": "6/3/2018",
    "text": "We recently visited Singapore and went to this restaurant Kebabs n Curries, the ambience of the place was not that great but since we wanted to try desi food we gave it a shot, the service was ok quality and taste was also very average, the only thing which we liked was the rasmalai which was very tasty, the feel of the restaurant was not very clean and so was the cutlery, well near by there were many options for desi food, I would next time rather try some other restaurant then going to this place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N09wIyoKG5PSRof7POuSpw"
  },
  "P0h9Mu-rZvTKqO0xGrXOAQ": {
    "date": "5/13/2017",
    "text": "Summary:  Bad Quality & Over Priced.  $15+tax for 4 pieces of VERY COLD chicken tandoori (note:  you have to pay extra for naan).  I don't mind to pay premium for quality, but when quality is compromised in a typical location, there is no reason to pay for an overpriced meal.  I give 2 stars to this place just because service was decent.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJ36OvDqZGip9QAvlch1hg"
  },
  "F_W0mc9PuoxPhv55GMoHlQ": {
    "date": "3/23/2013",
    "text": "[Review is for ala carte only]What started off as a sweet and romantic (cough) date atop Little India ended up with a hurried exit from Mustafa in cold sweat rushing back to the hotel for the ultimate rendezvous with the porcelain altar.It started off great! First, we were really excited to be exploring Little India and especially Mustafa Centre going - with all the endless goods available within. Second, we were both craving some form of Indian-influenced-cuisine and got ourselves through the Mustafa maze to the entrance of Kebabs n Curries the moment they opened at 11 am for lunch.We wanted to try the buffet based on the previous Yelp review but was advised by one of the servers that it would take an estimated 30 minutes to 1 hour before it would be ready. Famished people don't wait...that's a fact...so ala carte it is!I wanted to be more excited about the food but it was a rather disappointing $50 meal.Paired with the runs and rather bland flavors...I'd say skip this place altogether and go for one of the mom-pop shops in the area instead. Oh yeah, if this is how bad ala carte gets...I can only wonder if their buffet standards have also dipped since the previous review.Yelp 100: 23/100",
    "rating": 2.0,
    "rated": {
      "useful": 14,
      "funny": 15,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "mmZVY4u6liM8XSDplsc9hQ",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mmZVY4u6liM8XSDplsc9hQ/o.jpg"
      },
      {
        "img_id": "j1s2aDinAWPkDziZWoB_kw",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j1s2aDinAWPkDziZWoB_kw/o.jpg"
      },
      {
        "img_id": "2DqJlTfNtjmXK0XrB3c11A",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2DqJlTfNtjmXK0XrB3c11A/o.jpg"
      }
    ],
    "user_id": "4DN9WS2gf7Y2SYh0LaqDqA"
  },
  "IkciVsADM2bONvcF-JkgNw": {
    "date": "6/18/2015",
    "text": "Good place for reasonably priced north Indian, south Indian, Pakistani and Indian Chinese food. Service is good and friendly. I have been seeing the same service staff for over 3 years now and I think that says good things about a place, I think :)The food is good and reasonably priced compared to other options in Little India where the same food is at least 20% more expensive. I like the curries - both indian and pakistani.  The Biryani platter is good value for money too.Try the tea at the end of the meal. I would even stick my neck out that its one of the best tea in little india.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "N-kvpmsYYAildGwAHHZuPw": {
    "date": "6/27/2016",
    "text": "Came here for refreshments and did not disappoint. I ordered the mock tail and it was good. A bit expensive though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9WiXivBgX6NU_i6gxnRCdQ"
  },
  "2bTggxovOjZt4m5xEv5_UQ": {
    "date": "8/15/2012",
    "text": "Looking for cheap indian buffet? It is not surprising that you can find it at the infamous place has it all... Mustafa. Kebabs n Curries is a restaurant that is located at the roof top of the new Mustafa's wing that resembles the esplanade dome. They dish out yummy indian lunch buffet at $14.90. I love their Masala Paneer . You can have all you can eat of curries, papadams and other indian snacks. Do note that you need to be patience as the refill of the dishes are kinda of slow.  If curry buffet is too much for you to handle, you might want to try their Dum biryani.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bmbS4nxAfWJEMupLl0yfMQ",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore. Paneer Masala",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bmbS4nxAfWJEMupLl0yfMQ/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "v3Vi-W4UcWJtObbVsG5XwA": {
    "date": "2/15/2015",
    "text": "Ate non vegetarian platter combo 24$S. It reaaly did have meat: chicken tikka, chicken tandoori, spicy sausage, yellow curry chicken. Ate with roti. Ice tea was warm tea with ice, milk, sugar. Air cond. Buffet available if hungary.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s6pN7vax6mkGi1-zvit1AQ",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore. Roof",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s6pN7vax6mkGi1-zvit1AQ/o.jpg"
      },
      {
        "img_id": "otd6MnJr8BuMmOMZgiD6vA",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore. Seating",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/otd6MnJr8BuMmOMZgiD6vA/o.jpg"
      }
    ],
    "user_id": "zCq-qjDqN_7ZpToQvWHH5g"
  },
  "CvhtooaO3P5RCsSqnwUvVg": {
    "date": "8/10/2012",
    "text": "This new establishment elevates one above the chaos of Little India. 400-seater big, this eatery is perfect for the family with affordable pricing and the patrons are all in casual local drab such as slippers and shorts. There is an indoor and outdoor area - where the open wooden deck overlooks the bustling Little India street. Food wise, the menu is dominated by North and South Indian staples. The mango lassi ($3) garnished with dried coconut sprinkles is one of the best in town. Other good things to try would be the garlic and butter naan, or tandoor spiced chicken on skewers. There is no alcohol served here, but with the delectable Lassi beverage, who needs alcohol.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z2_QwFt7pFOeJapkXzCACA",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z2_QwFt7pFOeJapkXzCACA/o.jpg"
      }
    ],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "pjCBM9R1BmV4eo9CJVNAPA": {
    "date": "7/8/2013",
    "text": "This place was ok, not great. I had the palek paneer and garlic naan, but the palek was too salty for my taste and the naan was also a bit too oily. My auntie had this spicy chicken and veggie dish which was just too oily. The taste was there, but damn that excess oil killed it. The price was also pretty reasonable. I did enjoy the environment though. Its on the rooftop and the fans provide a nice little breeze. But I think if it were any hotter outside it would be a little unpleasant to eat spicy curry and be in a hot restaurant with leather chairs. Not pretty!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FKWeca2cwUkxJTgW_Tj1nA"
  },
  "2wIQChY83D_N7nIBHWOuew": {
    "date": "4/6/2013",
    "text": "This place was suppose to be good. The butter chicken--good, the naan-good, the lamb kebabs we ordered--not so much.The thing that the restaurant is famous for made me sick. Like, Sorry friends I can't talk to you right now---I'll be in the bathroom for a few days sick.bummer. I wanted it to be good!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wyNQqEbMfOgXr5rIfVr9Rg"
  },
  "sidTWD4SJw0gEO-25Pc-zw": {
    "date": "8/5/2013",
    "text": "We came here hungry on the first day of our trip. We found it by following the many signs within the Mustafa center for food. Although we had been expecting a food court with many options we were not disappointed when we found one restaurant because of the great ambiance and food.FoodI love curry and eat it all the time in the states this is definitely one of my favorites that I've had. Chicken Makhani was excellent as was the tender lamb shank in a brown curry sauce.Naan: Perfect, thin and crispy sheets of dough with oil and garlic lathered on top. The compliment of choice for a curry feast.AmbianceIt's on the top or 7th floor of the Mustafa center commanding an expansive view of the area. Reminiscent of a Japanese feng shui garden the floors are marble with pools interspersing under a white tented dome.Highly recommend this to travelers that don't mind a little spice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "u-i-No-Fqzs1UeG5OLtF1Q"
  },
  "224F55fklzfhUHecwkDtXg": {
    "date": "8/23/2013",
    "text": "There are several seating arrangements: Open-roof, Covered-roof, Big Hall etc. The open-roof part of the restaurant is dark but nice ambience. The food is North-Indian, Pakistani and Indian Chinese. The dishes are economical and quantity is good. Service is usually quick and helpful.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vV9SG51lIpOkr1rnKg7dEQ",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore. Open Roof side fountains. Nice ambience.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vV9SG51lIpOkr1rnKg7dEQ/o.jpg"
      },
      {
        "img_id": "NwkCx2d3vhdtd_vSOKNZ9A",
        "caption": "Photo of Kebabs n Curries - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NwkCx2d3vhdtd_vSOKNZ9A/o.jpg"
      }
    ],
    "user_id": "Wfra9H6vsNUxx-yFLCgWbQ"
  },
  "QZm5sssTH8JAoJRibe2oPA": {
    "date": "6/27/2016",
    "text": "Stopped in to have coffee and drinks.. ordered coffee, sweet Lassi and mocktail.. not disappointed at all.. a little pricey but nice",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J3mRNNw5CpKX2bmTpbkaSQ"
  }
}