{
  "SJlzqL_TAvKfzb2GchBaZw": {
    "date": "4/17/2016",
    "text": "This is my first visit after hearing about it for several years. We had the fish soup (2 small sized bowls instead of 1 medium sized on the advice of a waitress because it's cheaper), fried tofu, prawn paste chicken and sambal kangkong for 3 persons which totalled about $21 per person. The fish soup was the milky looking kind and it was delicious! The fish unfortunately, though fresh without tasting fishy, wasn't outstanding considering the fish soup is the specialty dish. The rice was of terrible quality so you're better off ordering the vermicelli. The tofu and chicken were perfectly fried to a crisp while remaining moist.Food was decent but not fantastic enough to make a pressing case to return for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGEwxh5dwzD2wmpzbskwAg"
  },
  "bbUHYiRzq6Kz0j_pKYmDsw": {
    "date": "7/16/2017",
    "text": "I used to frequent Ka Soh back when I was a university student and often came back when I had my own family. Old favourites like the fish slice bee hoon soup, prawn paste chicken are still on the menu today. Old yellowing photographs line the walls showing all the celebrities who visited in the past. I came for lunch with my father and ordered the fish slice bee hoon soup, sam lo hor fun and the prawn paste chicken. The chicken is still crisp and flavourful but the famous fish soup was disappointing. Not only was the soup not the rich taste I remember but it had a heavy fishy taste which should not be the case if really fresh fish was used.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KnAxVhOzsOJJXteHE7PsAw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KnAxVhOzsOJJXteHE7PsAw/o.jpg"
      }
    ],
    "user_id": "elaLkfhrp_1O5kDA7ssuwA"
  },
  "lnQ1uHIiXPkmqgXH_U1zHg": {
    "date": "1/6/2016",
    "text": "This is probably a 3.5 stars place.Ka-Soh has been around for years and is well known for its fish bee hoon soup. Being an old establishment along Amoy Street, don't expect a spiffy decor or a modern looking restaurant. Here you get the traditional old school style of what eatery looks like in the 1980s or maybe even earlier. Besides fish bee hoon soup, they also serve other zi char dishes so it is a good place to dine as a group. I was alone that night after gym and wanted a quick meal. I ordered slice fish bee hoon soup and prawn paste fried chicken (har cheong kai). The soup was not as tasty as before and the small saucer of lard was eye popping. I forgot about the lard. The dish had a generous serving of thick fish slices which made the higher price (compared to coffee shop or hawker center) worth it. The best dish was still the har cheong kai which was crispy and juicy and delicious. I think I prefer the other outlet near Singapore General Hospital.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hUlwN9eh9n-eT1AGsHDWvQ",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Prawn paste chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hUlwN9eh9n-eT1AGsHDWvQ/o.jpg"
      },
      {
        "img_id": "AWsXLtw9A5UrdsafVG_a6g",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. You saw it. A bowl of deep fried pork lard",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AWsXLtw9A5UrdsafVG_a6g/o.jpg"
      },
      {
        "img_id": "XeH5OFZ2UqIhbWsBnYCOJw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Sliced fish bee hoon soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XeH5OFZ2UqIhbWsBnYCOJw/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "aDdX3GktCFBMwBYvfrLOxw": {
    "date": "3/22/2017",
    "text": "We got excited when we realized it was the same Ka-Soh that hailed from Malaysia, which my wife had been frequenting for years. Naturally we ordered the special sliced fish noodle soup, since it's what this place is famous for. After one spoonful of the soup however, I couldn't drink any more. It had such an overpowering fishy stench that it was like licking a salmon. And not a fresh one at that.  I had to lift out the vermicelli and eat that separately - and grudgingly, to avoid going home hungry. The fish itself tasted fine, but still had bones in the \"fillets\"!!Terrible food and not worth the name / reputation.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ce7wTlIJPo1NvSuDhH1Pw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Their \"specialty\"",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-ce7wTlIJPo1NvSuDhH1Pw/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "4QuqSFCfWFZA0FdSS-AcHw": {
    "date": "6/11/2017",
    "text": "Used to patronise this place a lot. Haven't been here for awhile. Nicely renovated. Food not as good as before. The sliced fish bee hoon was a bit bland but the kai lan and har chiong kai was good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LYZxaMr4hCNwLGbTE5_y7w",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Sliced fish bee hoon.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LYZxaMr4hCNwLGbTE5_y7w/o.jpg"
      },
      {
        "img_id": "dz3ZjYe3nxlZcQeK04hIWw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Dark sauce fried Kway Teow.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dz3ZjYe3nxlZcQeK04hIWw/o.jpg"
      }
    ],
    "user_id": "e9Sn1IZZZ_1Qa_vUdtskjA"
  },
  "R1_hWR2jOt8JfXmMSktxAg": {
    "date": "12/9/2012",
    "text": "A familiar restaurant. Looks the same every time you step in. A must have dish is their fish soup. Tasty like no other fish soup on earth. And my favorite dish also includes their pork ribs as I dip them into the dark sauce. I suggest ordering only one noodle dish (their seafood hor fun, shen mian or Hk noodles), their fried Tofu, one pork ribs, one fish soup and rice! That would make for a really good evening meal!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j6zl2GOmsShRiwVmRdLYHw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. The entrance.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j6zl2GOmsShRiwVmRdLYHw/o.jpg"
      }
    ],
    "user_id": "69BnQt-ykPsqriePrJKIqw"
  },
  "QK8gXBf4FiQuqO7MpGMRAA": {
    "date": "12/16/2014",
    "text": "It's quite rare to find this kind of old fashioned Chinese restaurant inside old residential building in Hong Kong, so it's quite interesting to me for places like this. The fish soup noodle is quite good, fresh and sweet.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ziM3zmWF4h5jb7M9-NXPfA",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Wok fried fish rice noodle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ziM3zmWF4h5jb7M9-NXPfA/o.jpg"
      },
      {
        "img_id": "lPVV-fT9D--E7tB2xcfBgA",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Deep fried oatmeal prawn",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lPVV-fT9D--E7tB2xcfBgA/o.jpg"
      },
      {
        "img_id": "xKmCoNjLIZRTZFzxDr5TpA",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Deep fried chicken wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xKmCoNjLIZRTZFzxDr5TpA/o.jpg"
      }
    ],
    "user_id": "QGP0TcL_0maoS7NvbXVi2w"
  },
  "jdTVBuiPXc_a5o1e07_FLw": {
    "date": "11/17/2012",
    "text": "Swee Kee (Ka-Soh) Fish-head Noodle House is an excellent restaurant in Singapore.  Some of my Singaporean friends brought us here and it was delicious.  We had fish and bok choi soup, chicken wings, and lots of other little yummy side dishes!  This is a great place to try fabulous local cuisine.  It's a small restaurant and not a fancy atmosphere, so it's good for a small group of close friends for a meal of good food and good company.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dcf9fs4IqfKRGDBQn0CSDw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. chicken wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dcf9fs4IqfKRGDBQn0CSDw/o.jpg"
      },
      {
        "img_id": "hy3_JVFlQTJrgHJjGJpsLw",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. fish soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hy3_JVFlQTJrgHJjGJpsLw/o.jpg"
      },
      {
        "img_id": "iDsmx3_Jr-QwTRmPdYok9g",
        "caption": "Photo of Swee Kee Ka-Soh Fish-head Noodle House - Singapore, Singapore. Swee Kee Ka-Soh Fish-head Noodle House front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iDsmx3_Jr-QwTRmPdYok9g/o.jpg"
      }
    ],
    "user_id": "cgXKKch7-Wv-nKM_gZBatQ"
  }
}