{
  "p3F3EXXB0Mi-fQKWRDId8Q": {
    "date": "7/25/2014",
    "text": "Beautifully decorated, Jim Thompson is one of the better Thai restaurants in Singapore, in my opinion. It is in Dempsey Hill, but you really feel like you are at a Thai resort - the decor is pretty impeccable. As for the food, it erred on the spicy side but was overall very good. I had a number of Thai favorites - pad Thai, etc - and all were pretty tasty. We sat outside in the patio area and were entertained by Thai dancing, as well, for some of the time. Only slight complaint is the music was a bit too loud (traditional Thai music), while we were sitting outside.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XLPu58UiyBYFEQTIUEGElg"
  },
  "fQcVxU-jsvureM3ibMM63g": {
    "date": "10/18/2014",
    "text": "Went there for dinner with 2 friends. Service was very good. Despite not having reservations on a Saturday night (8:30), we were seated immediately. The waitress was very pleasant and responsive.  The food was decent but given the high prices, I was expecting great not just good. Not to say they didn't have options. They had plenty of choices from curry to rice to noodles. I did notice that everything on the starters menu was deep fried, although it all tasted good. I do recommend this place if you want to make an impression, ie first date. The food might be good here but the ambiance is great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G4pldo-BydSCGg_-6f9C9g"
  },
  "CbCnpqgXmMUJeifa_hULtw": {
    "date": "12/31/2014",
    "text": "Great ambience, average food. Perhaps a tad disappointed by the food didn't live up to the hype. Also was surprised that they didn't change the beer which I didn't like and wanted to return.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cmBQnCn6F8Hxe4AJeKp42A",
        "caption": "Photo of Jim Thompson - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cmBQnCn6F8Hxe4AJeKp42A/o.jpg"
      },
      {
        "img_id": "P9XSXV3rTvo2KEnwHFUF6g",
        "caption": "Photo of Jim Thompson - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P9XSXV3rTvo2KEnwHFUF6g/o.jpg"
      },
      {
        "img_id": "5ksk7lHX-Ck85yRaD7NsxQ",
        "caption": "Photo of Jim Thompson - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5ksk7lHX-Ck85yRaD7NsxQ/o.jpg"
      }
    ],
    "user_id": "rwXU0_gG4VS2mmdwK-vPXw"
  },
  "-lDGj06oyB535g4Wbmk4KA": {
    "date": "7/19/2013",
    "text": "One of the fanciest Thai restaurants I've ever been to. Very posh interior, excellent service in an old British barracks type building. Food is very tasty and relatively authentic, although not particularly spicy. Good for date nights.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4gEiwaJ5oBMOXI9V0y48AA"
  },
  "sgmqoONpcb_HLnI74bhUag": {
    "date": "8/28/2018",
    "text": "There are reasons I love this restaurant.1) Thai dancers dance throughout the restaurant. It's transportive.2) The grounds are like a spa. Very special.3) The interior décor was stunning.4) The food is not pretentious and was quite delicious.5) I just appreciated very casual food that's overdressed. Allows me to dress up and be comfortable with my friends and my wallet.6) Reasonable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_WgBfmpoSS0dJSGkB04kA"
  },
  "otPyziHVi-iXtXQVSV2cnQ": {
    "date": "4/1/2018",
    "text": "All I can say is the good was amazing.  It was melt in your mouth, make you feel good all over amazing.   If it didn't cost an arm and a leg, I would've have eaten there ever single day! I ordered the vegan version of the green curry and vegan pineapple fried rice.  The flavors of the two dishes paired so well together.  If I ever return to Singapore coming back here is a must!  Although this was the best Thai food I ever had, I felt the prices were a bit too much for food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NdX4AbfnRvyBIPgoajdeTg",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Vegan spring rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NdX4AbfnRvyBIPgoajdeTg/o.jpg"
      },
      {
        "img_id": "7Xukxks9qS-P0afBRC8nvA",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Vegan pineapple fried rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7Xukxks9qS-P0afBRC8nvA/o.jpg"
      },
      {
        "img_id": "S44Db1iW33ALpyS8MZdBcg",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Vegan green curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S44Db1iW33ALpyS8MZdBcg/o.jpg"
      }
    ],
    "user_id": "JGI4mG7tp7LEiZpsJmQmNQ"
  },
  "CLgpcDVgVfC1X7r3b6Ejog": {
    "date": "2/5/2016",
    "text": "We went to Jim Thompson on our way to Changi as we were craving for Thai. The setting of this restaurant is just awesome - a quiet place full of trees with a tropical look and feel. The moment you walk towards the entrance of the restaurant, you are greeted by women in traditional Thai costumes. It's a great feeling of being in Thailand. The ambience of the restaurant is just fantastic. They have a vegetarian menu for folks like me - that's just fabulous.  We ordered coconut water to quench our thirst, what a way to get refreshed quickly!  It's served in the coconut and they even give you a spoon to scoop out the soft coconut flesh to eat once you are done drinking the water. We had the green curry, cashew tofu, fried rice and regular rice. Everything was delicious. We didn't have room for dessert. The service was out of the world.  Even though the restaurant was a tad bit expensive, it's totally worth it.  Great place to chill and unwind with great food. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5BTUtkCeXvjFG4WfMfEJTQ",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5BTUtkCeXvjFG4WfMfEJTQ/o.jpg"
      },
      {
        "img_id": "wNZ_UfgYlYt6sjbAplAX_w",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Corn fritters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wNZ_UfgYlYt6sjbAplAX_w/o.jpg"
      },
      {
        "img_id": "NxfrfNjYTqQvJH4Wmg4Lgg",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Raw coconut. Pretty amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NxfrfNjYTqQvJH4Wmg4Lgg/o.jpg"
      }
    ],
    "user_id": "BXP0Iujqgvd3zAcEgfoGKw"
  },
  "SEFwCQehpsyR2EcEb5KRMQ": {
    "date": "6/21/2015",
    "text": "I had a tough time choosing between 3 and 4 stars for the Jim Thompson Thai restaurant on Dempsey Hill. They'd officially get 3.5 for me. I called in advance to make a reservation for 6 the day before and my husband requested outside seating.We got there and the architecture of the building reminded me a lot of the Jim Thompson museum in Bangkok. We were seated outside and got to watch 3 women dressed in Thai garb dance the whole evening. It was a little warm out and the patio did not have fans, so if you overheat easily (especially when noshing on spicy Thai food), I recommend grabbing a table inside.The drinks were good, but a little pricey at approximately $24 each. The mojitos were wonderful and so was the Jim Thompson Cooler. My husband and I started out with the Chef's Special Appetizer ($32) and it came with chicken satay, tiger prawns, crab spring rolls, marinated grilled beef rolls, and minced chicken salad. Sauces were brought out for all and they were delicious. We were actually able to order brown rice here in order to try to stick to our Paleo lifestyle. The rice was very earthy, a bit crunchy and delicious with the green curry and beef. We also got the half rotisserie Thai chicken ($26), which was cooked perfectly. In addition to this, we got the morning glory vegetable ($14) for the table. The food was excellent, and the service was friendly. They did get a little swamped shortly after we got there and we did have to ask for our second round of drinks a few times. The ambiance was lovely, and the food was good. If you're looking for a nice restaurant for a special occasion, this is a great choice.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "p4T8Qpo95oAJPO1wQgfLzQ",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Morning glory ($16)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p4T8Qpo95oAJPO1wQgfLzQ/o.jpg"
      },
      {
        "img_id": "sT2-s3NwV5ZsZpRIYBzW8A",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Penang curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sT2-s3NwV5ZsZpRIYBzW8A/o.jpg"
      },
      {
        "img_id": "UA-8gK10FOxaZmVFc6fJBA",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Half chicken ($26)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UA-8gK10FOxaZmVFc6fJBA/o.jpg"
      }
    ],
    "user_id": "IOtmx8Zebl3wOOqNEobFMw"
  },
  "4kZY5xmtvuOMSA3ROJVbsA": {
    "date": "6/4/2016",
    "text": "I think this restaurant must be surviving on foreign travelers that are having it recommended by Hotel Concierges. While our appetizer was good, my stir fry was the worst Thai food I have ever have. There was absolutely zero flavor/spice. I was extremely disappointed. For the price and the recommendation from the hotel I had high expectations and was I disappointed. While the restaurant has a beautiful interior I don't go to a restaurant for the interior I go for the food. If you want Thai food go elsewhere, eat better and for less.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9vj9rOpsw6pJ_K42HEYlQ"
  },
  "yCtiwO4Syfd0SO_CsowIhw": {
    "date": "9/1/2014",
    "text": "This is probably the fanciest Thai restaurant I've ever been to in my life. What I like about Thai is that you don't need to spend much to experience great food, but hey, there's nothing wrong with splurging every now and then (or so I keep telling myself!)Jim Thompson sets the tone immediately when you arrive. As it's outside Dempsey Hill, it's a bit more secluded, which gives off this feeling of being personally invited to someone's beautiful black and white home. At the entrance, there are ladies dressed in traditional Thai clothing that greet you in Thai, complete with the slight bow and palms pressed together. Walking inside, the decor was quite opulent. Nice silk decorations (after all... this is Jim Thompson we're talking about), occasional live music, and a beautiful bar.I dined here with my husband and his auntie, and we chose 2 curries, Pad Thai, and a veggie side dish. We all thought everything was well done. I thoroughly enjoyed my beef Mussaman curry (as it wasn't spicy) and the red curry with grapes blew me away. I thought the grapes would be weird (what can I say, sometimes my tastes are like that of a 5 year old) but it added sweetness that complemented the savoury curry very well. And the Pad Thai? Absolutely wonderful, it's one of the best Pad Thai's we've had outside Thailand! The crowd on a weekday night was majority expats, and it seemed like a lot of business meetings were going down. It's definitely a place to file under \"Special Occasion\", \"Important Business Meeting\", or \"I'm Feeling Generous, Let Me Invite My Favourite CM Michelle To Jim Thompson Just Because\".",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "kFwnYAqzkgQ5qzjYAsfs9g",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Great ambiance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kFwnYAqzkgQ5qzjYAsfs9g/o.jpg"
      },
      {
        "img_id": "THuQzyTFygDPX88L0r26Hw",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Pad Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/THuQzyTFygDPX88L0r26Hw/o.jpg"
      },
      {
        "img_id": "MRylKZYzNNZspunT_VLEkA",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Mussaman curry with beef",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MRylKZYzNNZspunT_VLEkA/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "laO0R-VV_o-kFej-KtXpfQ": {
    "date": "12/14/2015",
    "text": "Been a frequent traveler to Bangkok and tried many local Thai dishes , this place is really \"OK\" for the choices of food and can be better . Superb ambience and good to bring your guest over . Overpriced Thai food but if you are seeking to impress , why not ...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5tisThO0CBbELENo3NckrQ",
        "caption": "Photo of Jim Thompson - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5tisThO0CBbELENo3NckrQ/o.jpg"
      }
    ],
    "user_id": "4wO4BXOQoto40MfRWqNPtQ"
  },
  "6yD-N5aW68c7u8V0zKu0-A": {
    "date": "5/1/2015",
    "text": "One of the best thai food ever. Fine dining. Almost every dish is nice. The price on average is about $50/ head but it is definately worth Try. Location is hard to find but better to take a taxi there",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_46a7KPh91jRypOHpPWy_A",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Wonderful",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_46a7KPh91jRypOHpPWy_A/o.jpg"
      }
    ],
    "user_id": "Z4jj0eCpeAodQ6RcxgyvzA"
  },
  "YgfcodmAeOclimWnhqcmgw": {
    "date": "7/17/2016",
    "text": "Nice ambience, a good place to bring tourists for a romanticized view of Thailand. Service is good but everything on the menu is so-so, watered down flavors for non-thai food aficionados.  Pricey too",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OTx8lNo-62V2rmAKkvAb1A"
  },
  "OxgY-sLPDN-FNlkBlKG0Ow": {
    "date": "4/11/2015",
    "text": "Good thai resto, authentic though pricey, 2 people eating with 3 dishes and 1 dessert cost me sgd144. The food is really good though, i love the tom kha and dessert as usual mango sticky rice is always the best one",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ey2RZXufJkdftnQeyQWLQQ",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Love this mango sticky rice!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ey2RZXufJkdftnQeyQWLQQ/o.jpg"
      },
      {
        "img_id": "I3ux2Ss7xzJFyoRqNjvv-g",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Love this mango sticky rice!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I3ux2Ss7xzJFyoRqNjvv-g/o.jpg"
      },
      {
        "img_id": "asbEiKjM3GEbgz0k4ags8g",
        "caption": "Photo of Jim Thompson - Singapore, Singapore. Minced beef - they said it was spicy hmm for me it was sweet actually big portion for 2 though, not really a recommended food",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/asbEiKjM3GEbgz0k4ags8g/o.jpg"
      }
    ],
    "user_id": "ykj_bzOhA4qt6p-8HAHoaA"
  },
  "-AnFIQfZK4aBYSr01hQ7IA": {
    "date": "9/12/2014",
    "text": "Love this place, the decor is beautiful,  food is delish. Service is excellent sometimes and at other times not so.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "JD6U3dXHJZO9CcPM-I3hiA": {
    "date": "8/18/2012",
    "text": "There is a fantastically crafted Thai touch to the Jim Thompson at Dempsey Hill. In terms of its interior design it truly embraces the art of Thai fabrics, materials and styles. The Thai cuisine is definitive, each dish is immaculately made, from presentation to tastes. It is delectable.The atmosphere is serene and the staff are well trained and very polite. They are prompt and always making sure everything is in its right order.I personally was very impressed by this place. From the general aesthetics, the service, to the food. You will find great variety on the menu, serving you more than 80 classic Thai dishes, including appetizers, spicy salads, soups, curries, main dishes, seafood, barbeque, noodles, desserts and more.The prices are high (you will spend around 30- 120 dollars), but the ambiance makes up for it.The building is beautifully historic, definitely a must try, at least once!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N9n8nMasHV0CuelKpn0HXg",
        "caption": "Photo of Jim Thompson - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N9n8nMasHV0CuelKpn0HXg/o.jpg"
      }
    ],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "AMnwMDk8dIuEJiSnhOf4Ug": {
    "date": "1/2/2016",
    "text": "awesome!  one of the best meals I have had in Singapore and the best service.  Went with two vegetarians and a guy that only eats veg and  seafood. no problem lots of choice to cater to all.   service super polite. super fast.  food and drinks fresh and tasty.  the people I went with have eaten literally all over the world and they loved it and are going back again.  I would not say cheap but good value for the quality.  if that wasn't enough some lovely Thai traditional dance also while you eat.  won't be my be my last time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMexPsUO1CRpLm9g4qbojg"
  },
  "KR7nReN3BtAck7ZbeSdGcQ": {
    "date": "11/9/2013",
    "text": "I had heard so much about Jim Thompson and was extremely excited to finally try it out. Imagine my disappointment. The food was bland, boring and unbelievably over priced. I would never recommend this restaurant and am appalled by the number of people that actually think this is good food.We ordered the 3 person starter with Spring Rolls, Chicken Wings, Pomelo Salad and Prawn Cakes. At $44 dollars this was the worst decision of the evening. There was no spice, no flavor and no salt at all. Everything was deep fried to a point where that's all you could taste. We had the Green Curry & Red Curry with beef, equally unimaginative, and a Pad Thai that was cold and tasteless.The three of us spent $284-- infuriatingly expensive for a miserable meal.",
    "rating": 1.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AIb7LML67T_sdHEJTeC3NQ"
  },
  "vH92QXnuXJlBQFrd7AM2fQ": {
    "date": "2/21/2016",
    "text": "Nice ambience, and lovely colonial building, but the food at Jim Thompson is lackluster, far from authentic, and depressingly watered down. Notwithstanding the abysmal fare, the restaurant was still a full-house on a mid-week evening. Packed with business-types.We had:1) Goong Hom Sabai ($20): mushy prawns swaddled in a rice paper and yellow egg noodles, and deep-fried to oblivion. The tasty plummy chilli dip did little to save the overdone appetizer.2) Khao Phad Nam Lieb ($20) - rice fried with black olives and minced chicken, sided by raw shallots, lime dice, cashews, and chillis: one of two dishes that actually passed muster, this had a good amount of flavour and char.3) Gaeng Panang Neau ($24) - panang curry with Australian beef tenderloin, coconut cream, and crushed peanuts: the other commendable dish, but it would have been better served piping hot, instead of tepid.4) Phad Grapow Gai ($22) - stir-fried minced chicken with straw mushrooms, garlic, birds eye chilli, and holy basil: should have been punchy but it was disappointingly vapid.5) Pla Ga Pong Daeng Thod Gra Tiem ($22) - deep-fried red snapper fillets blanketed in an gooey garlic sauce: let down by the less than sparkling fresh fish. The muddy taste of the fish overwhelmed the lovely sauce",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tieQ1FQ3BdXO7PjShPE28g"
  },
  "3lRrdyabid_J6T8tIb3PQg": {
    "date": "2/14/2016",
    "text": "Valentine's Day lunch. The ambience was very nice, so was service. But I must say the food was pretty average. It's a personal value proposition whether $80 per person all-in for buffet lunch is fair. I don't thin so...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "miIZ4ldgAw1maGDh6fe9Xw"
  },
  "s3JFkIMSUVCr3S22F9Qksw": {
    "date": "11/7/2013",
    "text": "I will admit I went in with very low expectations as I had just come back from a week in Thailand and was used to very spicy authentic Thai food. I thought this would be bland and expat-oriented. Let me tell you that I was actually quite pleasantly surprised. I quite liked it! Lots of choice (oddly including some western fare) but for example the papaya salad had the proper level of heat. I enjoyed the chicken curry and various starters and the sides of vegetables and the coconut rice for dessert. Check out my blog post, I was there with friends for their birthdays. 88$++ for brunch for 3h on the weekend, including freeflow prosecco, I think it was 58$ for the food with soft drinksmylifeinsin.com/2013/10/…",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2lrdQWjAlTpVYklsYsUa3w"
  },
  "_5Mk821hDOIMEB2WOv2DXQ": {
    "date": "6/8/2015",
    "text": "I don't like Thai food except Jim Thomson , the environment is fantastic and the desert is superb, and sometimes two lady will perform dance for you",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r1LS-Bu0uT1TvWBBu12FjA"
  },
  "UUzr9DJmvI4KXUIs4OiVBQ": {
    "date": "9/19/2014",
    "text": "If you ever need a place to take a client or a business partner to a beautiful looking restaurant that won't break the bank, Jim Thompson is your place! Nestled in the jungle of Dempsey Hill, this restaurant almost seems like an an oasis among the scores of beautiful trees that line the restaurant. I went for dinner with my wife and my aunt visiting from Hong Kong. We were greeted by thai dancers strutting their stuff to traditional thai music, not to mention, the all too familiar words of \"Sawadee ka.\" The decor within the restaurant is sublime. It's probably best to see the pictures to see what I mean. This restaurant oozes with \"expat\" appeal and is evident by the restaurant's patrons.  I, for one, like to go to Thai restaurants where there are a lot of Thais in order to personally certify the restaurant food's authenticity. Although Thai patrons were few and far between, the food, nonetheless, was very good and authentic.   Our order included Pad Thai, Beef Mussaman Curry and a veggie Thai Dish. The Pad Thai was the best I've had in Singapore. It's probably because Pad Thai is the THE expat dish of Thailand and this dish has to be a hit in order for this restaurant to bring its target demographic. As for the Mussaman Curry, I second my wife when she says it wasn't too spicy. My only compliant about the restaurant, believe it or not, is the ridiculously small portion white rice they give. :D Overall, the restaurant is just beautiful and the food is a sure fire winner. Personally, I would not pay these lofty prices for Thai Food, as there are so many great Thai options in Singapore and with Thailand a short place ride away, but the ambiance, experience and the backdrop of Dempsey Hill is all built into the price!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "anrZv1OM1a2sC_EfZ8mt-Q"
  },
  "noI-7_kie-7vAOHCZnfpGg": {
    "date": "2/23/2013",
    "text": "This is a beautiful restaurant, and the food is equally match the decor. The service is also top notch, including the price. This restaurant experience is worth the splurge now and then.Overall most of the dishes that I had eaten are deliciously cooked, beautifully presente, and authentically Thai.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUK8drx_RDOMjh4WxIBc6Q"
  }
}