{
  "rnYB0tAiF9UC6Et-5-1vnw": {
    "date": "1/5/2014",
    "text": "It was my first time going to this small cozy sort of cafe x restaurant . It was just a random walk in as the display outside was just too tempting . I ordered matcha soufflé while my friend ordered a pancake soufflé (or something?) The matcha was not too sweet and is just right . The service was efficient and fast . And the service crew is friendly too !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXvLneOKrAWl6j3g3gMoqg"
  },
  "DLRRvOnj2L9X05uh4quYow": {
    "date": "8/17/2013",
    "text": "overrated.the queue is so darn long and i dont think there is a great thing in their desserts at all.perhaps i shall try the original one in japan instead.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f12LRx-mEUG2kvBkWxg3rA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Overrated n so long queue....",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f12LRx-mEUG2kvBkWxg3rA/o.jpg"
      }
    ],
    "user_id": "lpaeyh_4nLgdFs7Duhd8Rw"
  },
  "jRHMJpeonS3_ZK_wte5XuQ": {
    "date": "12/17/2012",
    "text": "After reading so much about the hype over this Japanese kopitiam, we decided to head over during a weekday evening. However, this trip made me realise how inefficient communication in the kitchen can actually hold up the queue and upsets diners even though this usually happens in Gordon Ramsay's Kitchen Nightmares.Speaking of the food, the baked curry rice was delicious as the beef curry sauce was really thick and savoury. The soft egg yolk enhances the richness of the rice. It has been years ago since I had my Japanese curry rice.The pancake souffle is nothing spectacular and was a little tad dry and less fluffy than a mc pancake. Hence had to rely on the brown sugar syrup to finish this although they gave us the maple syrup which we did not choose. The puny little salted whipped cream was definitely not enough to go with the pancake. But to pay for extra cream? Definitely no way. Fortunately, the matcha souffle saved the day. Even though it did not rise to a considerable height, it was filled with sweet matcha custard and thus this warm pud was really comforting one to enjoy. The only dish that I would recommend one to try.In short, this place is definitely not worth queuing so better to avoid peak hours. I think it is very adventurous or bold for a newly opened restaurant to offer so many soufflé items as they require long waiting time. However, this must be provided that the orders run smoothly without missing out or leaving out any item, only to have realized that the kitchen had left out the order after customers' reminders.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "2I5s5HV7OH1K8TmjeGZ6-Q": {
    "date": "2/9/2013",
    "text": "Ok as I am still shock as the sticker price of hand dripped coffee, my husband wanted to try this place. As I was getting hungry to, why not see what is so special with pricey coffee. Well I totally put my foot in my mouth, this was amazing coffee, it was strong and had a seriously amazing after taste that I just can't describe, let's just say I didn't even really need to sugar or cream at all. Now what totally sold me on this place was their Hoshino Souffle blew my mind as I never had anything like it. It was tomato fried rice at the bottom with this creamy fluffy egg like whip cream topping. It put the Omu rice to the side and now not worst eating.  The teriyaki chicken sandwich was good too. The sevice was ok but at least here is a button to call them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIlQOXn094Q205B_vu7Sjw"
  },
  "zSk8snrSRsj8RN4bjnvf1g": {
    "date": "2/21/2013",
    "text": "Personally I didn't like their blended coffee.  It's more like a tasteless Starbucks roast. After I inquired, the cook did admit they don't use Mocha (which is unusual for a Japanese blend that I've tasted in most coffee shops in Japan having lived there for 10 years). Certainly doesn't warrant the S$5.80 per cup.  The milk (not cream...ok, fine) was not even warm.  Looked forward to their Pancake Soufflé but was turned off by the 30 min wait requirement (which means I will finish my coffee long before it shows up). Had the French Toast instead which was nice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mHpjkmep_6lGpEv-tPcqTQ"
  },
  "UeH0ErwAsCZM_DkJ2DqTXA": {
    "date": "8/1/2016",
    "text": "This review is long overdue. Wanted to rave about one of my favourite places in Orchard Road, but just didn't get to do it till now (excuses I know hahahahah). So, here's the story. Celebrated my birthday at this cafe in May this year with my gal friends. 4 of us ordered a few mains and a dessert to share. I gotta say we were all very happy with the food. I especially love the 2 main dishes: Fuwa Fuwa Hoshino Soufflé with Porcini Rissoto Tomato Cream and Omu Rice with Shrimp & Mozarella. Just writing about them and looking at their yelp pictures are making me hungry now. Their dessert item, Double Pancake Soufflé Style is also recommended. It is so big I am sure it can feed 8 instead of the 4 of us. Love the service here! Definitely one of the few places in SG where you can enjoy good and cheery service at a mid-priced eatery. Good service is just super hard to find in SG #sadfactoflife.I have been coming to this cafe chain over the years. My favourite outlet is still this Plaza Singapura one. After writing this review, I have the urge to visit it soon. Think I gotta make it real soon. #whydoeswritingreviewsmakeonehungry?",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 5,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "DRTYwfwVCVkEzhYVz8WUvg",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. We decided for another shot with the honey poured over the pancakes #mustgetthatperfectshot lol",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DRTYwfwVCVkEzhYVz8WUvg/o.jpg"
      },
      {
        "img_id": "R5QQ0cgK_OLQRtswKgFRbA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Double Pancake Souffle Style $12.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R5QQ0cgK_OLQRtswKgFRbA/o.jpg"
      },
      {
        "img_id": "RToWaxzEE6KXojG9vPfvYw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Hoshino Blended Coffee. Simply dig their cute mini milk mug - too cute!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RToWaxzEE6KXojG9vPfvYw/o.jpg"
      }
    ],
    "user_id": "0DcUFh4oG2IlBGOj9KcjVQ"
  },
  "GynNmQQ8hNnu7jEdynMx-Q": {
    "date": "5/22/2016",
    "text": "Stopped by for a quick coffee break at Hoshino Coffee as it was close by and we were too lazy to go around hunting elsewhere. There was no queue so we were able to grab a seat quick!Hoshino Coffee is an open air cafe in the middle of Plaza Singapura (or Plaza Sing, for short). We were seated and greeted quickly by our host & waitress. The booths were nice to sit in, was comfy and soft.There is a button at the side of the table, allowing you to call the waitress - which is similar to some Korean restaurants here in Toronto. I find this method extremely effective because I don't have to waste time flagging down a server.We ordered the Hoshino Coffee as it seemed to be the special food item which was \"roasted over open fire, gives a strong boiled flavour with pleasant sourness\". Coffee was alright to me, but it was really rich - kind of reminds me of the French Roast from Starbucks.I wanted the Matcha latte but decided not to get it after looking at the price. $9 for either hot or iced matcha latte is pure daylight robbery to me!! Unless it was going to be served in a big cup... which I highly doubt. Hoshino Coffee, served with a tiny bit of milkWe also got the pancake souffle style with strawberry, which was on their spring recommendations page. The presentation was super cute as strawberries have this special talent of adding an oomf to every dish! With syrup drizzled on the outer edges and strawberry jam drizzled on top, with ice cream on the side... it looked really appetizing.Unfortunately, I feel like it isn't that special for the price. The pancake souffle just tastes like a really thick version of a pancake... nothing special. I personally felt that the ice cream was a tad small. The strawberries tasted fresh and sweet.IAlso to mention that I rarely saw waiters/waitresses walking around after ordering... Barely any of them walked about and only seen when they're bringing out food or drinks. Had to call the waitress using the button just to get my water refilled... which was an odd feeling to me.All in all, it was just okay at Hoshino Coffee. I feel like it's a tad expensive for what they offer because I don't find anything unique about the place for that pricing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nMQWOCxD9YK4naP5nNJfCw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nMQWOCxD9YK4naP5nNJfCw/o.jpg"
      },
      {
        "img_id": "YgN17UQUKXWMJbnu3mm_4A",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Total",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YgN17UQUKXWMJbnu3mm_4A/o.jpg"
      },
      {
        "img_id": "2R-ygfwMbcuN7n4ZmMRzrQ",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2R-ygfwMbcuN7n4ZmMRzrQ/o.jpg"
      }
    ],
    "user_id": "mUQN8Pq3Dj0F602PswyTog"
  },
  "JDJx1Dne8sDBFsN6LnLWcQ": {
    "date": "6/11/2017",
    "text": "Very disappointing... the pancake was dry and the egg omelette is nothing special.. sakura and matcha latte was bland and too milky.. not much flavor..",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27MqM5ckgfoq6gHN654W1A"
  },
  "-FISW-p1U-JEL8VjYiE1DA": {
    "date": "4/12/2015",
    "text": "Located on the third floor extension of Plaza Singapura, is Hoshino Coffee, a popular Japanese chain of coffee shop. I wanted to try this so badly at Shibuya but time did not allow. So back here in Singapore, I decided to go all out and try it!! 7 soufflés ordered and here goes my personal soufflé buffet!! \"Gotta catch em all!\"Now that is supposedly Spring in Japan, even though my Japanese friends told me it snowed last week and it's currently 6 degrees celsius in Tokyo, the Spring menu for Hoshino coffee includes this super pretty pink  strawberry soufflé pancake!1. Hoshino's Spring Pancake Soufflé $14.50++So after the waitress took our 7 orders of soufflés, all the 4 pancakes arrived at all table all at once! The strawberry ice cream was very smooth, it wasn't too sweet but the syrup they provided us was very sweet indeed! Use it sparingly over the soufflé, as it can drown out your taste buds and we had 6 more soufflés to try and we didn't want to kill our taste buds. The soufflé itself is alot harder than the normally fluffly soufflé. As it is a pancake, I would consider it more like a fluffier and slightly tougher version of a chiffon cake.2. Pancake Soufflé with Chocolate Banana $13.50++Lots of chocolate sauce going on here. When you order a pancake soufflé, you have an option of whipped cream of softee. We went with softee for all our pancake soufflés and we liked the softee. Japanese soft serves, you can never go wrong with them! The pancake soufflé don't have any fillings inside, unlike the hot vanilla soufflés.3. Pancake Soufflé with Mango $13.50++We decided to go easy on the syrup for this one, having tried the first Spring soufflé with syrup and the second one with alot of chocolate sauce. The softee itself isn't very sweet, as such you can taste the subtle sweetness of the soufflé pancake!4. Pancake Soufflé with Matcha \"Ogura\" Bean Paste $13.50++The most modest of the pancake soufflés, and my personal favourite. The matcha soft cream here tastes very similar to the one I tried at Tsujiri, it has a stronger bitter after taste than the typical sweet and sugar-ladden matcha ice cream. The bean paste is also very sweet, as such, be careful not to get a sugar-overdose trying to eat that on it's own! 5. Vanilla Soufflé with Chocolate/Custard/Matcha sauce $10.80++ eachAll the vanilla soufflés arrived at our table just as we were done with the pancake soufflé!You gotta pour the sauces into the soufflé and the soufflé was steaming hot as we sliced it open, and even as we dug in, each spoonful, you could still see it steaming!! It is a very hot dessert, and be careful not to burn your tongue!Of the 3 sauces, my favourite was custard. It had the right amount of sweetness! The chocolate was abit too sweet for my liking and the green tea wasn't sweet at all!and here's the bill for our exploration of 7 soufflés at Hoshino coffee!!Service is pretty good here, there's a button for your to press and the waitress will come to you. The also provide you with a bag to put your things.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "KbynaCqb0rVSKyGtkzuO4A",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KbynaCqb0rVSKyGtkzuO4A/o.jpg"
      },
      {
        "img_id": "prUWuLYQAkhPI-dx87m0xQ",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Pancake souffles!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/prUWuLYQAkhPI-dx87m0xQ/o.jpg"
      },
      {
        "img_id": "IuhAqPiFATZ2VyifPAdc4w",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IuhAqPiFATZ2VyifPAdc4w/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "IeC_RC64cOwU6zhBpd7elw": {
    "date": "1/20/2015",
    "text": "Came here for the coffee on a weekday afternoon with my friend. The coffee was pretty decent, I really enjoyed my iced coffee float :DThe ambience is pretty nice for a late afternoon chill time since the place is not too crowded. The service is decent and they provide baskets to put your bag in.Would love to come back again for a proper meal!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "km41rZImc6-PIkAcrcbMHw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/km41rZImc6-PIkAcrcbMHw/o.jpg"
      },
      {
        "img_id": "fgNZTfjTREGwVqbHjH6z3Q",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fgNZTfjTREGwVqbHjH6z3Q/o.jpg"
      }
    ],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "cCWgKgV3RnbUp-TQAImbig": {
    "date": "6/9/2015",
    "text": "1 star each for the 5 things that make it for me. (Service, cleanliness, food, price and \"will I come back?\"). This place hits all five. FIVE STARS!Service was good, attentive and non-intrusive. I asked about the iced-coffee and the server was able to explain everything AND accommodate my special request. No fuss!The restaurant was clean and well-kept. The menu was small, but had pictures for most, so can't go wrong there. Gordon Ramsey will have a fit, I'm sure. \"NO PHOTOS IN YOUR MENU, ARE YOU STUPID OR SOMETHING?\" he'd yell. But me, I like to see a preview of what I'm ordering. By the way, since this is a Japanese coffee shop, there is a huge display of waxed facsimiles of most of the food available for you to ooh and ahh over.Souffles! Savoury and sweet souffles! Pancakes of incredible thickness, but fluffy and light like a... souffle! Each pancake is almost 2 inches thick! The french toast was also very good. I had a savoury souffle, and even though it was topped with a huge souffle, the dish was not heavy at all.Price was slightly high for some items, but reasonable for others. The coffee items have a refill option of $3 or so. Will I come back? Yes, please!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6x4GpQhUWQSrV_hZkg4sJA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Iced coffee. So crisp and refreshing! Hoshino Coffee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6x4GpQhUWQSrV_hZkg4sJA/o.jpg"
      },
      {
        "img_id": "4xEgxtO6UXBsJTTYSnZpfA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Savoury souffle. So fluffy! Hoshino Coffee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4xEgxtO6UXBsJTTYSnZpfA/o.jpg"
      },
      {
        "img_id": "Q6YRxelvJxOWeqMnMTFBcw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Hoshino Coffee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q6YRxelvJxOWeqMnMTFBcw/o.jpg"
      }
    ],
    "user_id": "Xs4wlPwWUCdQSqqFDG1b_A"
  },
  "NPRex1Dh8jZVWVQB8bcpOA": {
    "date": "4/11/2015",
    "text": "I passed by this cafe many times and it was only until yesterday I finally get my first taste with a fellow yelper. The wait (20 minutes) was killing me but it was certainly worth it. Because my friend told me she probably won't be able to finish her portion, so we decided to share and trust me the mouthfuls of pancake I had (Chocolate Banana) wasn't enough to satisfy my stomach. I was tempted to order another one but eventually I didn't since the sweet mango drink I had was enough for my tummy for that evening and that's how good it was. I didn't understand why the wait was so long but I glad I waited, it's one of the better places for pancakes. Soft and tasty is what I  remember from my few bites. Another thing is both of us seemed to be competing with one another to see who gets more bites of it. I ate it so quickly that I forget the primary rule of eating, that is to enjoy it slowly. I will order my own share the next time I come back. Good food means the staff will see more of me!! *evil grin* The mango smoothie was nice, not too sweet like some other places and it went well with the cake. Overall, this is in my list of recommendation especially coming from a big fan of the Land of the Rising Sun!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "k3J17-YGtPcqQK5VZk6NHA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Took order before I got my seat.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k3J17-YGtPcqQK5VZk6NHA/o.jpg"
      },
      {
        "img_id": "sC6_W4DT6ajEkI_VXNfR7Q",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Mango smoothie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sC6_W4DT6ajEkI_VXNfR7Q/o.jpg"
      },
      {
        "img_id": "hf1vOf9KXt6ezASPObimeQ",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Chocolate banana with pancake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hf1vOf9KXt6ezASPObimeQ/o.jpg"
      }
    ],
    "user_id": "Vtdm-QpN5yYxT-O00cuqFg"
  },
  "Avc7od171AIewk_M2qmEiQ": {
    "date": "2/19/2016",
    "text": "Curious about the line so did what typical Singaporean do - Q.  We got the choc ganache pancake souffle and we thought it was good.  The pancake is fluffy and soft which is very typical of japanese bakery. The ganache though was not that smooth but overall it turns out ok.  Sadly the coffees are not that great.  Not sure about the food so won't comment.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CSH-RWZoQ2FneUCgODXI2w",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Sama",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CSH-RWZoQ2FneUCgODXI2w/o.jpg"
      },
      {
        "img_id": "Sg2zYEfWbCevWCcOW1Y4lw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Choc pancake souffle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Sg2zYEfWbCevWCcOW1Y4lw/o.jpg"
      },
      {
        "img_id": "llcn7zGqquHdX7YF2QpOqg",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Americano",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/llcn7zGqquHdX7YF2QpOqg/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "ye69Z3VJzE6UQm-yhsIh0g": {
    "date": "6/8/2014",
    "text": "The initial wait was reasonable. Around 15 mins. Waiting for the food was abit slower. Service was kinda average. They had service bell on the table but they were kinda useless. It is much faster raising your hands and getting service. The service staff serving our table had limited knowledge of English so asking her questions like 'do you sell the coffee beans' needed another staff to help. Food wise it was a hit and miss. I had the demi-glacé omu rice. The sauce was decent but the proportion of the rice to the sauce was inbalanced. I think they should give more sauce or reduce the size of the dish. The dessert was a letdown. I had the creme brûlée. The dessert was not made on the spot since the crust sugar was cold on taste. Price wise I find it a tad expensive.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NjHJNdJPdmc0WHV4VF7fA"
  },
  "0n9VA7ti7-bx_eR7xbHDvA": {
    "date": "6/14/2013",
    "text": "This place is odd. It is like they are trying to create a quaint Japanese-style Western ambiance like Maison but in the middle of an open floor of a mall, so it seems out of place.$6 for the coffee is steep. The matcha green tea latte with ice cream was good, but there wasn't much ice cream because it was resting on big cubes of ice which went almost to the top of the cup. I would ask for it with no ice if I go back. These drinks were decent but in my opinion it would not have been worth waiting in the nearly omnipresent queue for them.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "l89RVSwUaqmYDhybiRS_qQ": {
    "date": "8/8/2015",
    "text": "It's at least a 15 minute wait for a seat. And go with a person if you really want to try it. If you're alone, they prolly make you wait till there's a single table available even if there's a booth empty. Apparently the barista got me a booth and got himself a scolding from the waitress (aunties; can't expect must from them)The service I must say is freaking lousy. The bell works perfectly fine, but they just don't come. Too busy I guess? But so many of them were talking amongst themselves without paying attention. Or should there be a better system to serve the customers?I hope the food would at least wow me so I may not give a negative feedback about this place.People watching is fun here though. Because it's crowded, the patrons do not suspect you staring at them. I do love the secrecy of this. And they kind of just release who they are from inside. If you're sitting at a booth, you can even watch people in other restaurants from other levels having food and what not.Food wise. Well done. I loved it a lot. The cream sauce in the carbonara dish wasn't that thick that would stick to your tongue and even if it does after a few mouths, drinking a small sip of water would clear it up mostly.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kZJQlU5MmyZAj_biIDRmdw"
  },
  "oA52g_5zqtWQ4pXNUY4rwQ": {
    "date": "9/3/2016",
    "text": "Desert quite yucky. The pasta is ok and the coffee is normal, but sell at Starbucks pricing.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-uox3pFinlL3-Q_mLChqMQ"
  },
  "zQ-lrWXs9lPUt7N0v6RH9Q": {
    "date": "3/25/2013",
    "text": "Great! Loved my matcha latte. Most places do it too milky and too sweet, I like mine with more matcha taste and this place is perfect.The soufflé were great. While not the fluffiest and lightest that I gave tasted, it is still really yummy. I tried both the matcha and pancake soufflé.As we were leaving, the dinner crowd started and we saw many orders of the blank squid ink pasta. Guess I know what to order on my next visit!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gToEWZ3TPG7NkxWJ20C0Vg",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Matcha souffle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gToEWZ3TPG7NkxWJ20C0Vg/o.jpg"
      },
      {
        "img_id": "-4FQImpfN36oiR5c-gZ2tQ",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Matcha latte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-4FQImpfN36oiR5c-gZ2tQ/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "UpfadT6_pGSraMnC2eJP2w": {
    "date": "2/23/2013",
    "text": "The Food1. Fuwa-Fuwa Hoshino Souffle ($15.80)  - My favorite! I tried this based on Angeline C's recommendation and she was right on spot. This was definitely a unique dish. It has an amazing, light scrambled-eggs-buttery flavor. My only complain would be there was too little meat in it (barely half a dozen small sausage cubes). 2. Omelette rice with beef sauce - Average. 3. Matcha souffle with softie ice-cream - I love the souffle but it was a bit wet towards the end when I got to the bottom of the bowl. Also, I would have preferred a stronger match flavor. The softie ice-cream was all melted and running when they served it which was a let down. 4. Pancake souffle - It tasted more like a sponge cake than a souffle but it was still worth a try. Interesting concept for a pancake. 5. Hoshino Pot Baked Curry Rice - served with eggs (a little more undercooked than the typical sunny-side up style), sausage and some brocoli. Good. I like the way the egg was wet & runny :) They were more generous with the sausage helpings in this dish too. I think I saw a full sausage. Overall, an interesting japanese fusion restaurant. I like the creative concepts of mixing up dishes like the pancake-souffle and the  Fuwa-Fuwa Hoshino Souffle (which was like a savory souffle crossed with baked rice). I don't think I've tried this anywhere else so definitely worth a check out :) The queue gets pretty crazy at dinner time. Best to come  before the dinner crowd (6.30pm should be safe).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B9T56SV7ZqhnYcpNv1D8Sw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. A bit too melted.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B9T56SV7ZqhnYcpNv1D8Sw/o.jpg"
      },
      {
        "img_id": "5AiQPeBz-797MfhDOIxi9A",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5AiQPeBz-797MfhDOIxi9A/o.jpg"
      },
      {
        "img_id": "n1RSbZoPPgKU6I88O9pj7Q",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n1RSbZoPPgKU6I88O9pj7Q/o.jpg"
      }
    ],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "6jsiBFCWtjbs__ZFKUarjg": {
    "date": "5/2/2015",
    "text": "The coffee is really good. No doubt.However, after waiting for 15mins to get in (when there were several empty tables), I was told they don't have thick pancake, so I ordered soufflé instead. Guess how long I waited? More than 50 minutes! For the freaking soufflé!! Unbelievable!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Em9483xsiN-b39bLRIFcrw"
  },
  "KkeGc2CZgWwXldgvPqA8kw": {
    "date": "3/30/2015",
    "text": "The curry rice is definitely better than the fuwa-fuwa. Soufflé is nice. I can't really tell if the coffee is good. I'm an espresso drinker. It's a nice place. Like it. 10% service fee but hey, why I have to get up to pay for the bill ? Haha stupid",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UixdGi6JP97JWKQh0SViCg",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UixdGi6JP97JWKQh0SViCg/o.jpg"
      },
      {
        "img_id": "jbxFonsgUwFkjGG5ocvwsg",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Fuwa is huge",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jbxFonsgUwFkjGG5ocvwsg/o.jpg"
      }
    ],
    "user_id": "0gBy-cIXe0DQKhFjifu68Q"
  },
  "qICeL8mdiP9ziJ6YrnyJLg": {
    "date": "12/6/2014",
    "text": "-casual, open air cafe in atrium setting, get a booth seating-hand dripped coffee is headlined, so one has to try. Happy to say it is a lovely, concentrated cup of coffee with a rich, full bodied roast. I'm a fan of the taste of coffee, I just don't want to consume a whole soup bowl's worth. -lots of small, subtle touches that make the dining experience very enjoyable and, dare I say, Japanese. Ex. Baskets provided for your handbag, individual minijugs of cream and sugar syrup-rare instance that I don't see often enough in Singapore; all the dishes arrived together, so we all eat at the same time. Why can't more places do this?-shrimp, avocado and egg sandwich. Onions hidden inside which gives the sandwich a nice, subtle kick. The shrimp were nice and juicy. Great snack to have with coffee-enjoyed the experience so much so, we extended the coffee into lunch and ordered pasta (spaghetti w/ eggplant, bacon, shimeji & sausage; carbonara w/ yolk & bacon) and rice (Demi glace 'Omu' rice w/ mozzarella)-well prepared Japanese style pasta, that is scrumptious. -the western styled omelette rice was ok. You have to appreciate ketchup. Not that it was overwhelming, but it was very much there in every bite. The light, fluffy egg and half glaze couldn't balance out the tomato sweetness. -overall a delightful experience, can't wait to come back and try other dishes",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kgDFcbMxi_LLtt1Wz7we9Q",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. carbonara w/ yolk & bacon, yolk breaks into and creates a delectable sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kgDFcbMxi_LLtt1Wz7we9Q/o.jpg"
      },
      {
        "img_id": "EkXprPbszdz7axHbVRchKg",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Demi glace 'Omu' rice opened up. Nobody told me sweet tomato sauce, aka ketchup, was hidden in there.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EkXprPbszdz7axHbVRchKg/o.jpg"
      },
      {
        "img_id": "u5AJMRFYc80F6NGGWQHdDA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Demi glace 'Omu' rice w/ mozzarella",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u5AJMRFYc80F6NGGWQHdDA/o.jpg"
      }
    ],
    "user_id": "c7zuaxYNWJ8vKizU3f6JfQ"
  },
  "nzHPkglBUg7ETnGbmGkCYw": {
    "date": "4/11/2016",
    "text": "Hoshino Coffee's casual vibe, trendy fare and wallet-friendly price points have made it a hit among the teenybopper set and the broke-by-the-end-of-the-month types.I suggest getting the eggy souffle baked rice and although the menu alleges this as \"rissoto\", it is really a term used loosely, and more regular Japanese rice than Italian risotto:1) Omu Souffle ($16.80): tomato rice casserole dotted with broccoli and shrimp.2) Fuwa-Fuwa Hoshino Souffle ($15.80): with mushrooms and ham bits 3) Matcha Souffle ($10.80): semi-collapsed by the time it got to our table. This was disappointing, and I much rather spent a few dollars more and get the fabulous ones at Laurent Bernard.4) Ice Matcha Latte with Softee ($9.30): rich and robust. Much better than the souffle as a sweet finisher",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tieQ1FQ3BdXO7PjShPE28g"
  },
  "B7pLs-FcvA2LxDsJ7JUqcQ": {
    "date": "12/6/2012",
    "text": "You know it's Japanese - the waiters all dressed up spiffily in that old-school 'western' vest suit ensemble, woody earthy paneling... I didn't have coffee but ordered the chocolate lava cake which was quite diving, warm and oozy and went well with the soft vanilla ice cream. Tried some of the green tea souffle as well which I enjoyed surprisingly - not a big fan of green tea but this one was not overly-teaish in taste and the souffle was of a good texture.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "j6ErnWunKxU6q4R6gU9F_A": {
    "date": "11/19/2012",
    "text": "Seriously good! U wouldn't believe that the queue speaks for itself. I'd thought, well, it could be that people are simply curious about what this 2 week's old is capable of. And when the line starts to form, more people just keep queuing without a single complain. It was a late lunch thingy after a movie show, I make my way to this little cafe joint speedily. This is like crazy, the snaking line - almost a L-shaped by now is still around. I have seen the same this morning at 11.10m (the outlet only open at 11.30am!) when I drop by to ask if I could make a reservation for 3pm but was turned down politely, which now I clearly understand why. I know this is what I have to eat despite still nursing my throat discomfort & joined the queue - determined to know if they are as good as they claimed.The interior is not entirely small but having a 3 separate dining space. The main hall sits most of the diners with wooden table and leather padded seats. It emits a brighter and casual feel, probably the area is not constraint by a stiff ceiling but an architectural glass rooftop in the mall that illuminates the stretch with a natural glow of sunlight. There are 4 booth seats which is most ideal for a gals-get-together session, I figured. The menu was straight forward, without fanciful hard to understand dishes. Zoom right into my orders and wave for the staff, the lady clad in chef suit came to me (gosh, even one works in the kitchen has to take time to manage the hall during peak hours?).. aw.. but she was very well-mannered and patient when confronted with inquiries. In fact, no one was seen idling - all the wait person served with pride, promptly and in an unhurried manner. A remarkable service team.I admit I felt a little uneasy when I picked that unfamiliar dish - Fuwa Fuwa. But the truth tells me that feeling has been unwarranted.The most raved about  \"fluffy savory soufflé\" seriously did not put to shame. Not only that it enticed me with its huge golden puffy bonnet but I was completely sold by its astonishing delicate flavors  This is one dish I wish I had on my last - cottony & airy, formidable without a trace of deflating. It is no wonder that people called it the \"cloud\", but I think it's me that's on Cloud 9 at every bite. Instead of baking it like an Italian classic with white sauce, this one has a tomato version in it. It was filled with incredible moments - spooning the whites like a mass destruction into that light feathery foam, trespassing to get to the bed of the baking dish. The gems hidden under these soft foams have never been so right. Tomato sauce infused - each grain was plump, tangy-sweet, not soggy. Its flavor was enhanced by strips of middle eye bacon and mushroom bits. Together with that eggy, Parmesan cheese soufflé, a divine marriage left unchallenged by the sweet version. Impossible not to eat, I think I can have 1 on every other day. A couple of spaghetti dishes if you like, other than \"Omu\" rice (omelette rice) or sandwiches. I had the Lobster Bisque Soup Spaghetti. A french dish but cooked the Japanese way for a lighter taste. Instead of highly seasoned, this one prepared with tomato and finely chopped mushrooms comes with a milder liquidized cream but rich crustaceans flavor. I find the soup a little offensive (even while its still steaming hot) while my dining partner finds it delicious, so I guess it's a mixed conclusion. It was not entirely bad - at least the spaghetti is cooked the correct way, I guess I just didn't have the mood for such a sophisticated seafood thing today.String along with others, I ordered a pancake soufflé, this time a more familiar sweet version! Not the plain ones but a more elaborate classic with a tropical touch. I have been advised to remind the kitchen to start preparing the soufflé when I was half way into my main course. It was like taking a number queue to a soufflé! I was asked to wait for another 15mins by the apologetic service staff. Not an issue at all, I said to myself because the end result was a light and airy inflated sponge that was unforgettable. The only negative I had was the fruits. Upon checking, I learnt that frozen mango fruits are used while the kiwi are fresh produces. I'd prefer ripened fruits atop my dessert, not raw and crunchy. Worst, the mango has a weird over-frozen texture makes them taste rubbery. However, the homemade whipped cream was smooth. And pls do not leave the place without a cup of Hoshino blend.Whaff that strong Hoshino caffeine scent right in front of me - that was one of the distinct characteristic while waiting in line. Carefully selected coffee beans were roasted over direct flame and then hand drip to a good-bodied brew. The blend has got a rather pale flavor  less rich as compared to Oriole's. Milder acidity but has a lingering smell. I guess the Japanese adores this light perfumery beverage. I am good for that 10g but if anyone wanted an extra brew, there is a 50% off for a refill.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uhOpxSvGJprwUWq778mCpw",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Menu u may be keen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uhOpxSvGJprwUWq778mCpw/o.jpg"
      },
      {
        "img_id": "R7XHj3d_Ox2SKMMFO17euA",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Hand drip Hoshino coffee, good-bodied but a bit pale.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R7XHj3d_Ox2SKMMFO17euA/o.jpg"
      },
      {
        "img_id": "i_laU66ZqgCgycbS9WMr9Q",
        "caption": "Photo of Hoshino Coffee - Singapore, Singapore. Lobster bisque soup spaghetti-mixed review, you go try it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i_laU66ZqgCgycbS9WMr9Q/o.jpg"
      }
    ],
    "user_id": "IIVTHna4vd7EOJJTKaS5uw"
  }
}