{
  "Hht930syzNmsl5-J1Y-wUg": {
    "date": "5/20/2016",
    "text": "A 4.5 review (cannot seem to add the extra 1/2!). Excellent service- friendly and prompt. Real cold drip coffee! Ciabatta Chicken was really yum and the Smashed Avo, Ricotta on Sourdough I am told was fabulous. Great vibe for Friday lunch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DrCK912MX4w72N0sf4RaZg"
  },
  "Jbo0nw3ARsBwHdgogKGcvw": {
    "date": "10/16/2014",
    "text": "Terrible customer service. Came in thinking we wanted to try the food, took 10 minutes before anyone greeted us or said anything to us AFTER we got their attention ourselves. We were put on a waiting list and waited in the restaurants for 30min before we finally gave up. The staff are rude and unattentive. There were empty tables in the back, and staff would leave them empty for 15min before they sat anyone down. Skip the wait and the disappointment.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Xc8eiZQGPlnIF90gY8DnQ"
  },
  "aXWOdAhkxLbdBlEmDNi_fA": {
    "date": "2/9/2016",
    "text": "We went here for breakfast. This place is definitely over rated. Their menu is really lacking. They had some really amazing smoked salmon, but their avocados did not seem fresh what so ever. Their scrambled eggs were also very mediocre. They also didn't have hotdogs, what kind of place doesn't have hotdogs",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EA2gsyft2-gfjW--_eFgCQ"
  },
  "09XbdBKQWCBYtJNLNequBA": {
    "date": "6/28/2015",
    "text": "Real Aussie brunch joint.  Very fresh produce and crowded on the weekend.  Not exactly kids friendly as the place is crammed.  Food and coffee were divine and their peanut butter banana smoothie is to die for!  Services are good and price is reasonable but go early before the crowds get there.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKzv6PG0p_lsEDFtwyJepA"
  },
  "1zSrNfxc7H-YMDPD--SWkg": {
    "date": "9/7/2014",
    "text": "Got recoomended from a friend. Food and coffee are both good. The menu is quite unique",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXy4m5JDEegBLk5x9aiViQ"
  },
  "3N_L0GDkBez_UNOnQBL1zA": {
    "date": "12/25/2017",
    "text": "Booked the place for Christmas eve dinner and the restaurant was having Sunday Roast Dinner. There was 3 different dining slots for dinner. I selected the earliest which was 5.30pm and the 2 of us were given the kitchen counter seats where we had a great view of happening in the busy place. Sitting next to us was the head chef's mother who shared with us who was visiting Singapore. Watching the kitchen, I realized the roasted turkey was faster than one usually expected.We started the meal with Pork Terrine (S$15++)Served with homemade pickles and clementine jamThe light crispy toaste, spread with the chunky terrine, and topped with some pickles such as onion, and beetroot, quite peaked up the appetite. Beetroot & Gin Cured Salmon (S$15++)Served with cucumber potato salad and herb mayonnaiseThe salmon tasted just like sashimi that one would not felt that it was cured version.The meal was followed by huge serving of main courses. Roast Beef  (S$25++)Served with sides of red cabbage, buttered green beans, duck fat fried potato, and bread sauceWhile the meat looked rather raw, it sliced easily and tasted delicious. The sides were good too, except for the bread sauce which one felt it was too starchy.Roast Turkey ( S$25++)Served with sides of red cabbage, buttered green beans, mashed potatoes , and gravyOne would thought that the meat would be rather tough and dry, but the version here was kind of juicy and went quite well with the light but flavourful gravy. Topped up with the well braised slightly sweet cabbage, it tasted even better.Accompanied with Christmas stuffing (S$3++)Pork mince, pine nuts and thyme.I was not a fan of christmas stuffing as I always felt it was rather strong in herbs taste. The version was more like meat loaf with a bit of nutty texture.Ended the meal with a couple of Christmas cookies topped with cream cheese topping, complimentary from the chef.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "j35ABRlVejMCy8DXK0AkdA",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j35ABRlVejMCy8DXK0AkdA/o.jpg"
      },
      {
        "img_id": "dY4YHM7eHS02Z5QpSXTMZg",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dY4YHM7eHS02Z5QpSXTMZg/o.jpg"
      },
      {
        "img_id": "1hptqli2at173rnXurzZng",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1hptqli2at173rnXurzZng/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "gm1nXS9a2FfA8-ZIhL3PVQ": {
    "date": "5/28/2017",
    "text": "I called up around 12.20pm on a Sunday and they said it was a 15-20 min wait. When I got there about 30 min later the queue system said it would be a 15-30 min wait. It ended up being a 45 min wait! Honestly, I don't think it's worth a 45 min wait.The Lokal Beef Burger ($25++ = $29.25) - 3.5 starsPretty good but there was quite a bit of fat in the patty and the burger wasn't special - cheddar, tomato sauce, vegetables. I got salad instead of the fries so can't comment on the fries. Good portion.Soy Chai Latte ($6 + $1 iced + $1 soy = $8++) - 3.5 starsExpensive!Roast Pumpkin Salad ($18 + $8 for smoked salmon) - 4 starsMy friend enjoyed this!Red Berry Smoothie ($10) - 2.5 starsWe decided we could make it at home.Even after the Entertainer app, it ended up being $55 for 2 mains and 2 drinks. Guess it's the GST and service charge.Service - 5 starsShout out to Satia! Other staff were great too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "kRJRpszfPcoDyuCtjGvaKg": {
    "date": "4/24/2017",
    "text": "We waited for close to 45 mins for a 2 seats on a Saturday around 1+, so it might be a good idea to reserve seats before coming on a crowded weekend! The were benches outside for waiting and an organised queue system which eased the wait. We had the banana bread ($15) which had been widely raved about by many bloggers and cafe goers. The bread was soft and moist and paired well with the yogurt and nuts, but was nothing extraordinary and was a bit steep for its price tag of $15. A plus point would be that it was not too sweet and hence rather easy on the palate. For dessert, the sticky date pudding was a pleasant end to the meal. In fact, I'd say skip the banana bread and have this instead. The sticky date pudding pairs well with the vanilla bean ice cream and the degree of sweetness depends on the amount of syrup you choose to dip your pudding in. Warm and sweet, it'd definitely satisfy those with a sweet tooth!The coffee was particularly disappointing. With beans from sarnies, it failed to provide the kick the usual Joe from sarnies does and lacked depth. It was also rather acidic with a distinct difference between the milk and espresso, failing to come together as a whole.Overall, a nice place to try if you're in the area, but personally not worth the wait given it's higher price tag and the availability of better options in the vicinity.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "e4NqO_mi83L9d16Z_EeGGg",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e4NqO_mi83L9d16Z_EeGGg/o.jpg"
      }
    ],
    "user_id": "co76qOLbbjeG2A9LZymtjQ"
  },
  "8XT5sP3IFWpLYBrrkmrEqA": {
    "date": "10/20/2017",
    "text": "Overpriced food in Outram area. Visited this place with a group of friends for lunch, was badly disappointed as the food was overly hyped and not really worth the expensive prices. Probably more suited for drinks only. Don't think i will visit again",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Bt1S3dNV0o6xxYLvWwuhg"
  },
  "WhLo8_Vr6H_3QddrtoLAoA": {
    "date": "12/7/2015",
    "text": "Slightly overpriced but oh so damn good! I'm a fan. I've been to Lokal a couple of times the past 6 months, both for brunch. They keep it simple and sweet with the menu, with only a few mains and daily specials written on the board above the open kitchen. If you're a glutton like me, who always wanted to try a little bit of everything, then \"pimp your breakfast\" might be your jam. You can order small plates to add on to your main course, eg sauteed mushroom ($5), smoked salmon ($6) and so forth. I had the toasted banana bread yesterday and it was so damn delicious. The price might be slightly expensive, selling at $14 piece, but it was all worth it. The banana bread is topped with toasted macadamia nuts, drizzle lightly with honey and sit in a pool of vanilla yogurt. My friend had the \"toastie\" and it was good too. Light, not too cloying with the right amount of filling. The toastie also comes with a side of fresh pickled salad (i think?).  And what's brunch without coffee you ask? Lokal serves pretty good coffee from both my visits and had been consistent with the quality. If you're planning to visit on a weekend, come early as the crowd can get overwhelming towards 1130-ish to 12pm. No reservation unfortunately so just walk in!",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 6,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "eHINtO3PmNa0B1MUXsbMNQ",
        "caption": "Photo of The Lokal - Singapore, Singapore. The spread!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eHINtO3PmNa0B1MUXsbMNQ/o.jpg"
      }
    ],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "KNxj_XGo7XK21en13DC1EQ": {
    "date": "5/5/2016",
    "text": "You may be mistaken by the German word \"Lokal\" thinking that it serves more on German Cuisine but in fact the Lokal is an Australia Style Cafe than offers more than just German flavours. Taking the business name, it kind of already suggest that its more on the Local, more like internationally influenced style. They are located at a corner of the intersection of Bukit Pasoh and Neil Road where you can find Goethe Institue nearby. It's quite easy to get here as they are within minutes walk from Outram MRT Station.It's causal and welcoming atmosphere had kind of remind me of a cafe in Edinburgh Bus Interchange. Interior was rustic with a hipster interior that keep up with the cafe trends in Singapore.We requested the coffee based dessert to be served first. This looks really cool with a scoop of vanilla ice cream topped with shot of espresso.Affogato - $6.50While waiting for the food, I had a glass of chai latte. Chai fragrance was average and all was down in my stomach even before the food was served.Chai - $6.50Starters was good with 3 ways Cauliflower served on a traditional Chinese metal plate. Cauliflower comes in 3 different forms and beautifully presented. With puree as its base, stacked by leafy greens and cabbages with tumeric infused cauliflowers, fried cauliflowers, as well as Ricotta & almond makes it special. Recommended.Cauliflower 3 ways - $13Another starter we had was great and perhaps suitable for those who want a lighter meal instead. Roasted beet roots was juicy and mix with quinoa, green beans, blue cheese & honey walnuts. I'm not really a fan of blue cheese, fortunately, the taste of the blue cheese was not that strong as I would have thought.Roasted Beetroot Salad - $13Torn between the Braised beef cheek and Cape Grim Sirloin Tagliata, I end up with the latter as per recommended by the server for its popularity. Served on a wooden board with scrumptious beef cubes cover by watercress with Asiago cheese and cheery tomatoes pairing.Cape Grim Sirloin Tagliata - $28The beef were cut into cubes form cooked to the default perfection by the cafe. Simply love its charred exterior and the juicy tender mild bloody meat.Ending the session of the night with sticky date pudding as dessert on a good note. The warm pudding was velvety coupled with a generous scoop of vanilla ice cream and yummy caramel sauce. The best part of the dessert was that with the sticky date and sauce, the entire dessert was not too cloying and one won't feel the excess richness and sweetness in them.Sticky Date Pudding - $10As a whole, service was friendly with a good atmosphere around. Even though they have limited items on the menu, fred not as they have daily specials, so do check out what's on their black board.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zxwFVYcHclrWWEJevTrQjQ",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zxwFVYcHclrWWEJevTrQjQ/o.jpg"
      },
      {
        "img_id": "kpK5yqlg7VN8w3xkh8cr5Q",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kpK5yqlg7VN8w3xkh8cr5Q/o.jpg"
      },
      {
        "img_id": "1gS9IvNZUpNJ6VkhkU5ZvQ",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1gS9IvNZUpNJ6VkhkU5ZvQ/o.jpg"
      }
    ],
    "user_id": "w91OgyE6GjOuZ_MtBk21uw"
  },
  "aUKa9bOj5KxGfJ-vatHtBQ": {
    "date": "11/12/2015",
    "text": "1) Lobster roll $22 - generous chunks of lobster. Soft fresh bun nicely toasted. Bit rich for breakfast for me so I won't order it unless I'm sharing.2) Pumpernickel bread and sourdough - The former is softer and served thinner. The sourdough tastes heartier and bit more rustic. Bread if you order on its own comes with 2 slices at $1.75. But order it for $6 and you get 3 slices of bread and unlimited and free choice of house-made butter, jams, peanut butter or vegemite. Bread slices size here is smaller than average cafe.I like vegemite and it's an Aussie thing which suits this cafe which is opened by Darren Farr from Sydney. the peanut butter is unusual in that it's very dark in colour and thick and tastes like sesame seed paste.3) Scrambled eggs here are creamy and buttery and fluffy. A big portion. $64) I've had the ricotta (also housemade) a few times just with toast. $65) Smoked salmon. Again this is done inhouse and hot smoked and a highlight.6) Coffee is from Common Man Roasters - 22 Martin Rd blend is the house blend but I always ask for the single origin as I do not like the 22 Martin one whether made at Common Man Roasters or here. No extra charge. $5Other things I like - There is free wifi. The place is quiet in the mornings on weekdays with ample parking right outside. I've been several times and seen Chef Farr there many times so it's nice to have a place where the original chef owner is actually on the floor and in the kitchen regularly. In fact, this morning he sent over some of their (housemade of course) kaya and we all really liked it! More subtly flavoured with a light caramel taste.What's missing for the last star. The place looks nice but the atmosphere of it isn't quite that relaxed Aussie feel. The coffee if from the single origin tastes not bad but isn't as good as Common Man Roaster's rendition. I think it could be a little fresher. It's kinda slow to come. Service can be up and down but I decided to review because recently I find that service has improved. They have some new staff that seem quite enthusiastic which is nice. They seem to take a bit long to get the bill ready even though it's not that crowded on weekday mornings and some of us need to get to our real jobs!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "YG2UM5zTKulPhLHt_axVQw",
        "caption": "Photo of The Lokal - Singapore, Singapore. $22 slipper lobster roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YG2UM5zTKulPhLHt_axVQw/o.jpg"
      },
      {
        "img_id": "2XtC3rq3R3cdUjIXzzZExg",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2XtC3rq3R3cdUjIXzzZExg/o.jpg"
      },
      {
        "img_id": "56M84DTg_fm57qht9lkk7g",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/56M84DTg_fm57qht9lkk7g/o.jpg"
      }
    ],
    "user_id": "a7y3gCq9Vwv89NRtUTtyJw"
  },
  "RVyCfKI16Tr8NZA0GyaPrQ": {
    "date": "10/13/2016",
    "text": "Thoroughly disappointing. The evening kicked off with the service staff's recommendation of a light, easy-to-drink red wine that was overly chilled and truly awful. Tasted like the watered down juice you sometimes get when they run out of Welch's grape juice on Communion Sunday. Thankfully, they made good with a couple of glasses of another mediocre wine which were drinkable but also over-refrigerated and  unimpressive. Perhaps the bottled ciders might do better. The food was also painfully mediocre. Marco Pierre White once said that generosity is the greatest garnish. I don't think we had any Marco fans in the house and I feel like they don't like salt either. Under-seasoned, uninspired. Needless to say, I'm not going back.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zBEe8e7rYEhXaOteU9ZjnA",
        "caption": "Photo of The Lokal - Singapore, Singapore. Here are a thousand words. Go figure.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zBEe8e7rYEhXaOteU9ZjnA/o.jpg"
      }
    ],
    "user_id": "FkkGs1gjqVlWc9iZ6LmG3w"
  },
  "LJusqFa_NpOm6pzLBTfX9g": {
    "date": "6/8/2017",
    "text": "Nice location within around 6 mins walk from Outram Park MRT. The food and coffee here is okay. I like the atmosphere of the coffee shop with colorful decorations. It's a nice place to meet friends, it's quiet, the closing time is quite early though (I went there on Monday..).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FXKcM3CRlpMvo6e4gyB1Kw",
        "caption": "Photo of The Lokal - Singapore, Singapore. Lovely wallpaper",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FXKcM3CRlpMvo6e4gyB1Kw/o.jpg"
      },
      {
        "img_id": "BZDEq0YvbsWLXsZOIfq0LQ",
        "caption": "Photo of The Lokal - Singapore, Singapore. pumpkin salad, latte, and +5$ for potatoes as side dish~",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BZDEq0YvbsWLXsZOIfq0LQ/o.jpg"
      }
    ],
    "user_id": "Jr5TrXI72mV9SDdw5UMSfQ"
  },
  "sYRDDp3Wl_Xv6HHrxC3blA": {
    "date": "5/19/2017",
    "text": "Chanced upon this cafe along Neil Road. Managed to get a table quite fast even though there was queue. The pork burger, muesli and eggs were surprisingly good but the place was too pricey for us. One visit was enough.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2jVBAxzuCciZdcamiwb5Aw",
        "caption": "Photo of The Lokal - Singapore, Singapore. Eggs with ham and cheese.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2jVBAxzuCciZdcamiwb5Aw/o.jpg"
      },
      {
        "img_id": "9g5BlK_4RBroJ1D2gUQ_Hw",
        "caption": "Photo of The Lokal - Singapore, Singapore. Pork burger.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9g5BlK_4RBroJ1D2gUQ_Hw/o.jpg"
      },
      {
        "img_id": "s4sLtzZLcyL0eCsk7GlAig",
        "caption": "Photo of The Lokal - Singapore, Singapore. Muesli with fruits.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s4sLtzZLcyL0eCsk7GlAig/o.jpg"
      }
    ],
    "user_id": "e9Sn1IZZZ_1Qa_vUdtskjA"
  },
  "H1AVsyHmRLJXWLHjujvtQw": {
    "date": "3/5/2015",
    "text": "It was a Wednesday evening, standing along Neil Road, my friends and I were trying to locate the cafe. Though the entrance was huge, somehow we couldn't see it. The three of us stood outside Gothe Institut scratching our heads, where's The Lokal?A quick phone call and one of the service staff came out to \"pick us\". Somehow the diagonal entrance escaped our eyes. Walking into the cafe, it was fairly empty. At around 7pm, there were only 2 tables filled. The full fledged bar welcomes us as we entered then the open kitchen at the back. As we had made reservations, we were seated where the nice cushion seats were. Tucked in a cosy corner, it was the perfect place for 3 girls to hangout and share our hearts out.The menu came and we were told that the mains & appetizers are changed regularly. Since we decided on a side of truffle chips, we gave the appetizers a miss and ordered our mains. Recommendations from the service staff were the pork belly with Apple sauce and lamb shank in crispy wrap with cous cous. We ordered 2 pork belly and a lamb. To conclude our meal, we had the Sticky date pudding.The Truffle chips were served first, pipping hot with a huge serving of shredded cheese on top. The fragrance of the truffle oil was immense, totally tickled our nostrils.The pork belly was tender and literally melts in your mouth. The sweetness of the apple sauce nicely complemented the pork belly, lifting the palette from pleasure to joy. The portion was a little too much for me but a regular dude would have consumed it completely in glee. I didn't get to taste the lamb but I to say that it's not for the faint-hearted. The lamb is pungent (not in a bad way) so non-lamb lovers, beware. Now comes the sticky date pudding, the divine one that we all three swore we will be back when we need a pick-me-up. Rich and thick dark caramel sauce, coupled with a large scoop of vanilla ice cream and a really warm pudding, our tongue was dancing between the sensation of hot and cold and the sweetness from the sauce was balanced nicely with the ice cream. The pudding was moist and lovely.Dinner ended on a high note as we leave and were sent off with \"thank you\"s from the staff. So coming back for the sticky date pudding!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gj5OSlaWPIn2AbDN_hWWYw",
        "caption": "Photo of The Lokal - Singapore, Singapore. Sticky date pudding",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gj5OSlaWPIn2AbDN_hWWYw/o.jpg"
      },
      {
        "img_id": "zXa62UomQZEoEpDMJfQOIA",
        "caption": "Photo of The Lokal - Singapore, Singapore. Lamb in crispy wrap with couscous",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zXa62UomQZEoEpDMJfQOIA/o.jpg"
      },
      {
        "img_id": "EwI3ui-xA8EoA83tLHdocg",
        "caption": "Photo of The Lokal - Singapore, Singapore. Pork belly with Apple sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EwI3ui-xA8EoA83tLHdocg/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "pDz3vv7aNFAf0QzKTqDsUA": {
    "date": "8/24/2014",
    "text": "It will be 3.5 stars.Maybe the kitchen was having an \"off\" day as several of us (Yelp Brunchers) were there for breakfast from 9.30 am on the same day and most were underwhelmed by the food. The menu while limited looked good and it made me want to order many things. I do like that you could pimp your breakfast (choose what you want) and you are not face with the same generic choices in so many cafes now. Just unfortunate those who had the sandwiches, burgers or breakfast selection did not enjoyed it. The sweet stuff like banana bread or brownie was rated good. I did try some of what the others ordered and they were ok, just not mindblown. The main discontent was the bacon which was very hard and chewy and tasty. Maybe we were used to the salty bacon from the supermarket or other places, and thus might not appreciate it when it was cured in-house? As I finally decided on the blueberry macadamia muffin and a flat white, I actually did enjoy my breakfast. The muffin was big in Asia's standards, with a nice muffin top. I am used to Mmmarvellous Mmmuffins' type of muffins so most muffins won't get me excited. Service was good. I requested for my muffin to be heated up as it was cold and they actually gave me a new muffin. I had already sliced the muffin in half and took a bite before realizing it was cold. So kudos for that. The home made butter was nicely whipped and perfect on the muffin. It was not overly sweet though certain bites were sweeter than others, but overall I liked it. The flat white was so-so. Then again I am not a coffee connoisseur. The coffee was not creamy like other flat whites I had in other cafes. This version was lighter and the slight bitter taste was prominent. I may visit the place again as it does have a nice vibe and may be a good place to chill when it is less busy. Hopefully the savory food will be better another day too.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "B8TH9FopyN1E7uqcix1J-g",
        "caption": "Photo of The Lokal - Singapore, Singapore. The muffin top",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B8TH9FopyN1E7uqcix1J-g/o.jpg"
      },
      {
        "img_id": "yVTnZv4p-JdTjSTIsZ0vrA",
        "caption": "Photo of The Lokal - Singapore, Singapore. Flat white & blueberry macadamia muffin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yVTnZv4p-JdTjSTIsZ0vrA/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "64k1MNuxmLIGiezQ9bU_8Q": {
    "date": "7/4/2014",
    "text": "Finally back from all that traveling and am now getting back in touch with the food scene in Singers! Caught a little break at work and checked out the new kid on the block, The Lokal in the Duxton area. This new cafe on Neil Road is the offspring of Sarnies, another crazy packed cafe that I've yet to try (ZOMG call myself a food blogger).Well The Lokal checked off all the boxes on the hipster cafe checklist and they even went as far as to throw in a $40k Slayer machine. Oh that sexy beast took me on an intense ride with his latte ($5.50) and I must say it was all very smooth. And a little nutty too. The beans are from Sarnies and they have their barista consultant, affectionately known as the K Man, who is overseeing the coffee making for now. Many would go for the signature Veal Schnitzel Burger ($28) served with a tangy grilled pineapple and red slaw but we skipped that because chunky chips weren't available that day! Instead, i opted for the Roast Beef on Rye ($17). The sandwich was a combination of perfectly caramelized onion and thinly sliced sautéed beef. The flavors were a little sweet and could be sharpened with a stronger mustard than the current grain mustard crème fraiche. It was a good roast beef sandwich nonetheless.The Roast Chicken Panini ($15) was good too. The filling included huge juicy slices of fresh tomato (not the cheapo Malaysian sort), copious amount of avocado mash, crispy pancetta and salty roast chicken meat. The bread was our favorite among the lot of sandwiches we had, partly because it's a little more pillowy and chewy. A healthier option is the Smashed Avocado with Ricotta Sourdough ($18). The ricotta is made in house, along with their yogurt as well. It was simply topped with some pomelo and almonds, drizzled with olive oil. I liked the separate components of the dish but it came together rather plainly. A touch of honey could make this a better dish in my opinion but that's just my preference. I was looking forward to the Banana bread with Hokey Pokey ice cream ($12) but was sorely disappointed when I bit into the soggy bread cloyingly soaked by the citrusy syrup. We wondered where the ice cream went to as well (i swear i didn't take forever to grab a shot). Instead we had a sour cream sorta mixture on our dish. I couldn't bear more than a full bite of this one but K had no issue finishing it for us.Overall, The Lokal is a decent place for a hearty sandwich and it's probably going to be really packed on the weekends. A little bird told me that the Sarnies people are gonna be opening another cafe soon so do watch out for them!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AhnYP_O9tAWBclx-6NAlfw",
        "caption": "Photo of The Lokal - Singapore, Singapore. Sandwiches at The Lokal",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AhnYP_O9tAWBclx-6NAlfw/o.jpg"
      }
    ],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "IDQLb3_9y8WUWsmseMT1yw": {
    "date": "11/4/2016",
    "text": "Let it be known that the lobster roll is a SLIPPER lobster roll. Big difference and to be fair, it does say so in the menu description but still, the dish is called a lobster roll. Hrrm. It was greatly disappointing. Overall it's too big and there's too little slipper lobster. It's about 80% purple slaw and 20% slipper lobster. Just imagine getting slipper lobster 1 in every 5 bites. The slipper lobster was kind of tasteless and the roll was too huge and just a glorified hotdog bun. The handcut fries were excellent, though one wouldn't come back just for the fries, would one.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_sexV0-9c1TEV1r8er3pnw",
        "caption": "Photo of The Lokal - Singapore, Singapore. (Slipper) lobster roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_sexV0-9c1TEV1r8er3pnw/o.jpg"
      }
    ],
    "user_id": "qK33YxMmj3nE_7nzxXNbog"
  },
  "LLZRAr7zF5VpTSb2dhv0YA": {
    "date": "4/26/2015",
    "text": "Back again at my fav cafe. But to be honest, calling Lokal a cafe really doesn't do the justice as its food standard is one of the highest in SG. Unlike the weekday mornings, the place was PACKED. They had a waiting list of people to be seated around 11:30am. But I was able to grab a seat at the chef's counter and gawk at all the delicious foods that were coming freshly out of the kitchen and enjoy my food. I started off with English breakfast tea-- not bad, but nothing exceptional. But I wish there was an option to have the tea set out of the pot as the tea got way too bitter towards the end of my meal. Then I had the roasted pumpkin salad  (5/5 )which just AMAZED me. One of the best salad I've had. It's flavorful without being drenched in dressing and just the right heartiness with well-cooked, yet still firm pupkin, healthy mix of quinoa and nuts, and fresh beans. It is definitely a must try.Then finished the meal with the chef's first attempt at anzac cookies (4/5; Australian traditional cookies--made with coconut and oats) and my gosh. I'm generally not a huge fan of oat cookies, but this sweetness was just right. And for that I had to order a cup of long black (I've come to not call it Americano anymore while in Singapore) to go along. I was told the beans were roasted by Sarnies and the blend was created in-house, and was called fuzzy wuzzy (4.5/5). But boy did they do a good job. The aroma and the finishing note of the coffee well-complemented the cookie. Really aiming to come for dinner in the upcoming weeks.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OkOzqJnyQs1yvQh7uz4ttg",
        "caption": "Photo of The Lokal - Singapore, Singapore. Cauliflowers 3 ways",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OkOzqJnyQs1yvQh7uz4ttg/o.jpg"
      },
      {
        "img_id": "7S-bh6Q8hZ0HfT51U5SHhg",
        "caption": "Photo of The Lokal - Singapore, Singapore. Fried squid-- so flagrant and good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7S-bh6Q8hZ0HfT51U5SHhg/o.jpg"
      },
      {
        "img_id": "i__ALbr2byBg_M1SY4KOMQ",
        "caption": "Photo of The Lokal - Singapore, Singapore. Reuben sandwich special",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i__ALbr2byBg_M1SY4KOMQ/o.jpg"
      }
    ],
    "user_id": "D7JUkHPLskVqZqseDZo65w"
  },
  "EoaMHD76dgw1rQqynASrLw": {
    "date": "7/29/2015",
    "text": "Great coffee + Great ambience = Great place to chill. Located at the corner of the Goethe Institute, this quiet corner offers simple but great coffees. Its extensive bar suggests it has a probably a bit more to offer thru its drinks offerings (have not tried it except for its strawberry basil soda).Food offering was the normal standard fare of cafe food, altho it did try to be innovative with respect to its \"localised\" presentation and taste. I wasn't impressed with its pasta of the day - an interesting interpretation of penne with cream and some sort of local soy-sauce base. Ermmmm ......",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y_9b87SRhuzeEE6bxheuaQ",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y_9b87SRhuzeEE6bxheuaQ/o.jpg"
      }
    ],
    "user_id": "nx3abOQedjq_8ToYqT-iQQ"
  },
  "-M3b_FIDc3uT4mMAoGQbZA": {
    "date": "8/22/2014",
    "text": "Just attended my 3rd UYE ...... Nice cozy place and ambience ...... a few of us attended this event ..... The menu is not extensive and it's seems limited food to order ..... Had a great time chatting with fellow yelppers. The plus point thing about the food here is that you can do your own breakfast style with the breakfast sides.Seriously if you ask me ..... I didn't feel great after I finish my breakfast. I build my own breakfast and i ordered sauteed mushroom, smoked salmon, poched egg and sourdough bread and wild berries smoothie to quench my thirst. The presentation of the food is not fantastic as it was separated into two plates upon serving.The mushroom, poached egg and smoked salmon is nice but the sourdough bread is toasted hard to consumed. The bacon is cook hard too and it taste plain.The smoothie doesn't taste fruity or neither it taste berry ...... It's simply not the best that I ever had ...... Overall this would be my last trip",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "P4Ck8lL-OrqTpDeULdcF4g",
        "caption": "Photo of The Lokal - Singapore, Singapore. My over toasted  sourdough bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P4Ck8lL-OrqTpDeULdcF4g/o.jpg"
      },
      {
        "img_id": "1DYQahWHpdIy5Vl5REjCOA",
        "caption": "Photo of The Lokal - Singapore, Singapore. My breakfast side",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1DYQahWHpdIy5Vl5REjCOA/o.jpg"
      },
      {
        "img_id": "KuayRD83GiqLDWhg-bDC5A",
        "caption": "Photo of The Lokal - Singapore, Singapore. Wild berry smoothie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KuayRD83GiqLDWhg-bDC5A/o.jpg"
      }
    ],
    "user_id": "UwWtpjalT2xlJyglRRITug"
  },
  "_5nLRJeypMuNvhzP48eg5g": {
    "date": "8/23/2014",
    "text": "So many of these hipster cafe places springing up in Singapore these days; I can't keep track. Pardon me if I sound really jaded but... it's all starting to look the same? The slightly-deconstructed interiors, the limited brunch menu, the old-school plates and cups... same old, same old. With more than a hundred of such cafes dotting our little island (all springing like wildflowers in the past 3 years or so), it's starting to get a bit dated, and standing out is becoming somewhat challenging for all these cafes. Unfortunately, The Lokal fits into the typical mold of all the new wave of hipster cafes. I'd like to be more excited, but after visiting this place for today's Yelp brunch... I just didn't find anything that would make it stand out. Not to say that it's bad, it's OKAY, a DECENT but not fantastic place to have a meal.I ordered the roast chicken panini with a smoked salmon side. The smoked salmon was alright, though a bit cold (one of my dining companions thought that it was okay though). The sandwich came stuffed with the chicken, strips of crispy bacon, tomatoes and avocadoes. The vegetables tasted alright (tomatoes were better than other places... say, Subway), the chicken was sufficiently moist, the bacon was crispy but had no taste. We went in a group of 14 and sampled a good proportion of the (smallish) menu - the overall verdict was that it was ok, but nothing to shout about.I had a mocha. It was ok, not bad, but again- not amazing.The best part was probably the sticky date pudding, which was yummy and quickly gobbled up by one of the kids!Prices are reasonable and portions are decently-sized. My meal came up to slightly below $20 for a sandwich and a coffee, and I felt satiated at the end (although I wasn't satisfied). Verdict? It's alright if you happen to be in the area, but not worth traveling for.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "_GEBb_hqsbEwlDGUr6PmMw": {
    "date": "3/6/2016",
    "text": "Singapore has no shortage of brunch places. Some have the typical eggs benny and french toast on their menu while others serve fancy coffee prepared using science lab equipment. The Lokal gives us a nice balance adding subtle touches to the usual favourites along with daily specials (i.e. Sunday Roast) that keeps regulars coming back while brewing a good cup of no-flash coffee. Only draw back is that because it's so popular, you occasionally have to share tiny tables. Although slightly on the pricier end, would definitely recommend this place for those brunch die-hards.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vIjSA6rHk0UoXKJycGyXtQ"
  },
  "yUkboaAifTdofe4EAj7B4w": {
    "date": "8/13/2014",
    "text": "Very cozy cafe at Chinatown/Tanjong pagar neighborhood. The flat white I ordered is above average. Toasted banana bread is great. The lemon yogurt pouring on top gives it a refreshing kick. Roast chicken sandwich with avocado and pancetta is very generous in portion. It would be better if the ciabatta can be toasted to be more crispy. But in general it is a good sandwich.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fjUkj-NoE786C14Th-jWhA",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fjUkj-NoE786C14Th-jWhA/o.jpg"
      },
      {
        "img_id": "Mf-mV3TLAe1B3L3yYp1zCw",
        "caption": "Photo of The Lokal - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mf-mV3TLAe1B3L3yYp1zCw/o.jpg"
      }
    ],
    "user_id": "lYbEn8E-GdAFWfl-JZd_Vg"
  }
}