{
  "UD7R5CVW_Qc-Zp0Voay4Vw": {
    "date": "9/28/2012",
    "text": "This was the first Sushi Tei I tried that made me a fan. Their dining ambience is nice and casual which makes it a fun place to chill and hang out with friends. Queues are long on Friday and Saturday nights so be prepared to wait at least for half an hour if your group is more than two people.Salmon Sashimi with Sushi Tei dressing is a good appetizer / starter or can even function as a full meal if you're not a big eater. If you like shellfish, go for the hotate miso mayo that's basically mussels baked in a cheesy-mayo sauce. Other things to try here are the dragon roll, curry cutlet rice, beef sukiyaki, cawanmushi, and special unagi roll that comes with thick slabs of grilled eel",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WShM_YFbtG4OcE0vrFVyw"
  },
  "r0SHsrenhFkfRdMkSKwuVQ": {
    "date": "1/2/2018",
    "text": "Well the sushi rolls were small but it is very tasty when mixed the soy sauce. I am a person that doesn't eat to much but this restaurant really made me eat a lot. The Spicy Miso Ramen is completely vegetarian so its good for vegetarians. I don't recommend the soup for people that don't like spicy food. They have an iPad so you can order whenever you want. They also have soft drinks in case you aren't great with traditional food. The edamame has less salt but is still very tasty though. It was so good I got 2 orders. We ate a lot. I came there for lunch and will probably come back for dinner. They also have Inari. It's very sweet. They also have a ginger container which I forgot to use :(. But overall, it has a lot of choices for vegetarians. I must say, it was the best restaurant I have been to in Asia.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L47Yw0d5Cy-Ld4HKlx-X_Q",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. Delivery policy during holidays",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L47Yw0d5Cy-Ld4HKlx-X_Q/o.jpg"
      },
      {
        "img_id": "Fx5eWt9RJJHPx4S5Ra8_xg",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. The scrumptious Inari",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fx5eWt9RJJHPx4S5Ra8_xg/o.jpg"
      },
      {
        "img_id": "JDPi6YMa3W4LVPow7ZXjUg",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. Fig3 of digital receipt",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JDPi6YMa3W4LVPow7ZXjUg/o.jpg"
      }
    ],
    "user_id": "fR-M9hF8UVKSrcjnfuVYrg"
  },
  "0uZBp1T1Akwbor_u3aW2dw": {
    "date": "6/28/2016",
    "text": "When in Singapore do what the Singaporeans do. Queue up for restaurants... For the wait here the food is very mediocre. I would come back if there was no line, but if there is a line... the food is not worth the wait.Food - everything tastes decent. Nothing mind blowing (4/5)Service - ok (4/5)Price - $$ (3/5)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nWOolO1P4uqO7r5dEr-Rpg",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. Sukiyaki",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nWOolO1P4uqO7r5dEr-Rpg/o.jpg"
      }
    ],
    "user_id": "eYYChVg4TiY1fkQ6yqAGrg"
  },
  "KtzlQ3gevM4xhoQoZ9d4Cw": {
    "date": "9/30/2016",
    "text": "It's probably the worst sushi place I have been to in Singapore.The place \"looks\" crowded from outside because they just purposely make you wait even if there are seats available to \"look\" busy to attract people.The food itself? Don't get me started - it tasted so bad that we decided to go eat somewhere else - even that costs us $40+.Expensive for the garbage quality food, so I would only I've one star - I would say they are the only one who scored only one star on every category in my opinion.Overall Verdict: 1Taste: 1Amount: 1Price: 1Atmosphere: 1",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "flSaZwD9S3J-fKdaOzQ12Q"
  },
  "cxFDJ0Gj1oSOJ3uMPPkAHA": {
    "date": "11/22/2014",
    "text": "Well had a dinner, I'd say the food was good, but I've tried better, I believe the food is what made me rate 2 stars, Otherwise it would have been no stars, ask me why?- Well first of all I called 2 hours in advance to make a reservation, NO RESERVATION, so I thought maybe I'd have a quick seating. Hmm... you are right I thought. It is really pain in the rear, waiting to be seated in the line for 40-45 minutes, no good. During that time only once a lady came out and asked how many? That's it on waiting.- an other thing about service. Maybe I am spoiled with American service (by the way for those who knows what do I mean, don't expect much, so that you will not be disappointed) but there is no service quality comes close to the American, sorry I have to say that.Overall it wasn't OK, So next time I'm in Singapore I will go find somewhere else.- Food was very late also, - Service not good, - Everywhere I went in Singapore there where service charge included, here too.- You don't work with one server, there where 3-4 different servers assisting, not really efficient way of earning tips.Good thing?- Food was OKAY, maybe I'd give 3,5 stars.- They don't have mocci ice-cream, but instead I've tried something alike (don't remember the name, cause it was hard to understand the waiter)- Edamame was good ( warm rating 4,5 stars)I hope this will help.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXBfcRa8Kj_NMSKLNoH5WQ"
  },
  "4NVOLRpJ1DRqzB-YmglAYg": {
    "date": "8/18/2012",
    "text": "Comparing to other conveyor-belt sushi outlets, sushi tei has always been my preferred choice. Aside from the usual items that they offer in their regular menu, they also have a seasonal menu that is available and often there are some special seasonal catch that one can look forward to.They have many outlets island wide but by far this is one of my favorite and also one with a rather long queue.  Well, why vivo? Although the selection at the vivo outlet is similar to the rest outlets, the high traffic would means high turnover for the food which will resulting in fresher ingredients here. Also,  I like prefer the scenic view here that overlooks RWS.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kVwcy2hA2GXwqhiOc5D-FA",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kVwcy2hA2GXwqhiOc5D-FA/o.jpg"
      }
    ],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "EwAQVFWDW2PRtMe1bIAYiw": {
    "date": "8/7/2012",
    "text": "Before one of the current sushi competitors came into the picture, Sushi Tei probably did not have to make much effort to be one of the more outstanding sushi restaurants in Singapore. They had creative sushi rolls and fresh sashimi palette that people keep going back for. However, since the sushi chain from Hong Kong became popular in Singapore, Sushi Tei had since updated its menu. Moreover, they introduce seasonal items that the other chain does not offer. The ingredients have not lost their standard, and have been as fresh as it can be. Another strength of Sushi Tei is its ability to serve customers great tasting sushi and other Japanese cuisines, such as the beef sukiyaki, oyako don and grilled squid.Despite strong competition from other sushi joints, Sushi Tei still ranks high on my list. It is definitely a casual Japanese restaurant to go for good quality and reasonably priced Japanese cuisines.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tFRTPY1pdnsIWAB_NJhPtA",
        "caption": "Photo of Sushi Tei - Singapore, Singapore. The wait to get in",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tFRTPY1pdnsIWAB_NJhPtA/o.jpg"
      }
    ],
    "user_id": "L5qnan1MZhuF8LetcU-Ziw"
  },
  "EE7lmDmpp-zxnL7NHklCUA": {
    "date": "8/13/2012",
    "text": "Unlike its other outlet, this restaurant is located in one of the best spot in vivocity. The restaurant offers great sea view  as well as sentosa island. It is a great dining place that offers great ambience for couples and families. Besides the location, there is a great variety of food to choose. If you are a salmon fan, do try their chirashi don or salmon don. The salmon is fresh and thick.Some of the side dish to try is the king prawn roll. The roll is served with king prawn wrapped with mango. In addition, they have a mini sushi market for take aways and the selection is great too. In conclusion, price is definitely the usually restaurant price that you would expect but given the ambience and quality of food. I would give it a thumbs up.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bHoYFscArjcmHLIhrdgRNQ",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bHoYFscArjcmHLIhrdgRNQ/o.jpg"
      },
      {
        "img_id": "KrT9iKuYidUMF7biTbE6lQ",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KrT9iKuYidUMF7biTbE6lQ/o.jpg"
      },
      {
        "img_id": "b5sM4b3drgTzb_utIcBQcg",
        "caption": "Photo of Sushi Tei - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b5sM4b3drgTzb_utIcBQcg/o.jpg"
      }
    ],
    "user_id": "k4B4gZFiZscBR9yFFUsc6Q"
  },
  "XMcoAZmzPrm0Hnry6yF6Ug": {
    "date": "4/9/2013",
    "text": "Food is ok. But service is slow.. especially for tea refills. Sea urchin portion seems to have shrunk. Otherwise a pretty affordable place for slightly above average Japanese food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hpDhGccbJ0jCWiBUi3mOQ"
  }
}