{
  "2AtI7rDZfECWWnacisfr_A": {
    "date": "7/5/2014",
    "text": "Been once and won't go again!  Ordered a number of differing curry's and only enjoyed one, the chicken tikka!  The worst was the mutton curry. The sauce was from a jar and not a good jar.Only gets one star for it's fish head curry sauce, but it ain't worth the trip that's for sure.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gTCCH9Q5Mf7n9_EO7wL7cw"
  },
  "nNYOAFFGaFoUxCgNdMLKDw": {
    "date": "9/24/2013",
    "text": "Dempsey, an area obviously developed without any consideration for the needs of those without cars, has an uppity vibe that I'm not fond of. Which is why the interior of Samy's - well ventilated and unpretentious - came as a surprise. A quick scan of the menu revealed that prices were reasonable, so that gave us free rein to do that overordering thing. The two of us opted for briyani over white rice (duh), one fish head curry turned into three protein-based dishes, and of course we had to get a coconut each to quell the spicy.Briyani Rice, $3.60 - The chickpea-laden basmati rice, tinted yellow and orange with saffron, was fluffy and smelt of star anise and lemongrass. It was good, especially with the creamy dal and lightly spiced fried potatoes, but just shy of brilliant. Still, I was glad I had it on hand to combat the eye-watering spiciness of the fish head curry.Fish Head Curry, $20.00 for a small portion - A concoction of chilli powder, tamarind, mustard seeds and other spices, the spiciness of this powdery curry was of the eye-watering, airway-clogging variety. Tomatoes were used for thickening the consistency of the gravy and gave it a slight tang. The curry also contained hints of the sweetness of angkoli (the colloquial term in this region for red snapper) used.As the dish was served steaming hot and the curry had numbed my tongue, I wasn't sure how the fish actually tasted at first. Having been cooked together with the curry, the fish head here was less tender than what one would find in a typical Chinese fish head curry, where the fish head is steamed first before ladling the curry on top. It was only when the curry had cooled down to near-room temperature that we detected a slightly fishy odour when eating the flesh, which indicated that the angkoli used here wasn't all that fresh.Mysore Mutton (dry), $10 for small portion - Although it shouldn't be a good thing, we were quite relieved when the serving of Mysore mutton turned out to be tiny. Our opinions on this dish were divided. My friend complained that the mutton was dry and tough. I have to agree that the meat could be more tender, but I really enjoyed the aromatic dry curry paste that the mutton had been cloaked in. Consisting of mutton stock fried with (what else but) a whole load of spices and herbs, including powdered turmeric, coriander, fenugreek seeds, cardamom and chilli, the marinade was intense and permeated the mutton thoroughly, and the meat bore no trace of its signature gamey smell. Now I'm curious to try the wet version of this dish - perhaps that would solve the dryness problem?Masala Chicken, $5.00 a piece - What we could agree on was that the masala chicken here was outstanding. Marinated with - you guessed it - too many spices to list, the chicken here was moist and flavourful. There were notes of paprika, garlic, ginger, tomato, cumin, and curry leaves. Flavourful might be putting it lightly; this was a flavour-bomb and an absolute marvel. We threw caution (along with our distended bellies) to the wind and scraped all the meat off the bones.Judging from the numerous tourists we saw in the restaurant, Samy's Curry is the place to go if you're looking to give your foreign friends a 101 on Indian cuisine. Service is quick without being brusque, and the food's above average. You can pop by one of the neighbouring establishments for after-meal drinks as well.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gZdpDc208Ehm9k5MymZKKw"
  },
  "2Qc3O8eLDgUoOkyqldUN6g": {
    "date": "9/30/2015",
    "text": "Old school style Indian curry fish head. Decent parking space, and not air-conditioned, but the wind flows through so you never feel hot (except from the spicy food). You get the food served on banana leaves, so it's a novel place to bring your more adventurous guests.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsIVj_AszmnnsykBrKgdHw"
  },
  "S_eKUX2qN8lc8FNjR9APVw": {
    "date": "9/12/2015",
    "text": "I thought the food was incredible, the best curry I've had outside of India! The banana leaf really adds to the flavour",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hf6Dei9vh5by4YsBj_oAEQ"
  },
  "Hqmkd4t-5ztgeCzTlu_62w": {
    "date": "4/20/2015",
    "text": "Honestly, the food could have been better-but the ambiance was everything. Authentic cuisine served family style on banana leaves. Delicious Marsala-fish or chicken. Great naan-amazing young coconut. I loved all of the little sides that came with the meal. Overall an excellent ex-pat Indian experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mi5f0ZAFW2dJ41ZFFYvDSg"
  },
  "S58udppgOGc84RZj2qlyCA": {
    "date": "1/6/2013",
    "text": "Guys... prepare to be ripped off. I can't even believe it myself, I had heard so much about this place but it was an insane trick. The three of us show up SO excited to try fish head curry. I should say this was our first banana leaf meal so we didn't totally know how it worked. One of the servers came over to help us order at the front. We said we have never done this before, needed help figuring it out, but that was mainly just wanted fish head curry and \"didn't want to spend $100 or something\". That was an exact quote. Remember that. So he says something like ohhh well there are three of you so you should get this and this, and maybe two of these, they are very small.... and he keeps going on and on and we are like no no no we don't need all of that! Etc etc. Well we sit down and he proceeds to bring enough food for 100 people. The normal dishes of rice, daal, and veggies came automatcally with the banana leaf, but then two orders of chicken curry followed, with multiple orders of chicken masala, tandoori prawns, chicken korma and finally the ENORMOUS CAULDRON OF FISH HEAD CURRY. Don't get me wrong, every item tasted incredibly good. Like, one of the best indian meals I've ever had. But we specifically said no we didn't want all of that food, we wanted the curry and maybe one other thing whatever was enough for 3 people (ps the fish head curry is easily enough for 10 people alone, so they could have just said that the curry would be enough plus though free sides that come automatically). So we felt bad getting angry at him, and though well maybe it's not that expensive anyway (no prices were displayed anywhere). We get our bill and it's over $100 and we freak out. Normally I wouldn't care but since we were on a trip and had a set budget, it was a big deal. We tried to explain to the people who worked there that this was a mistake but they didn't understand what we were saying. Our server suddenly didn't speak english anymore when we tried to reason with him. I only blame the server. I'm sure the business is lovely and the owners are wonderful, we know the food is incredible. So it's all Raman's fault. That's his name in case you see him and want to avoid him at all costs. Sorry guy, this was such a bitchy review but it was such a sad experience.PS For the record, if you go with a few people, stick with one order of fish head curry for SD $27. It is a good value, and it's worth a trip. But seriously just make sure this is all you order. You will still get the banana leaf with rice, daal, and vegetables.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrWJ4YZWvFj_NDOvTRaAqA"
  },
  "5ua_J95XvEd1BsTgIxJEGg": {
    "date": "6/9/2014",
    "text": "This is one of my favorite Indian restaurants anywhere.  I like pretty much everything I've tried here, but I think the butter chicken is my favorite.  It's not always on the menu though... they only make it certain days of the week (i forget which). I've been trying to find it's equal since I've left Singapore, but I've been unsuccessful.  Every time I went there I left feeling extremely full, and extremely happy.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZmZD6Y56H7YM7zv18T4Awg"
  },
  "1JVKsNkWlbmrV4ivvYLSkw": {
    "date": "9/17/2012",
    "text": "Went here with some colleagues from work.  The food was rather delicious, chicken, goat and the fish head. I decided not to eat the eyeball...yes was dared twice during the meal and had it staring at me from a spoon hovering off my plate.I am fairly confident that this dining experience consisting of eating off banana leaves and not a plate in sight (are they washed, they look re-used...am i going to die?) with optional utensils and not a napkin around has made my immune system 10 times stronger than when I arrived in Singapore.  How did I not come here the past two times I visited the city...was a rather delicious curry, although one that does not rival the Wimbledon tandoori in london. Let's see if I get food poisoning this morning...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZrVgKxdD-FH4cHleS0WYQ"
  },
  "pdG_gH0mVSYy3h4pQTQEwA": {
    "date": "7/31/2013",
    "text": "tourist trap alert!We heard so many things about this place after watching Anthony Boudaine's layover    . The food was mediocre at best. Dishes were luke warm. Ordered 5 dishes and our bill came out to 70 SGD!  There's no menu so be careful what you order.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sSqyKpCpgDdenu95i6aX0w"
  },
  "bGzG2DoB9zZjgitmRQhm0Q": {
    "date": "8/26/2012",
    "text": "Although sadly the banana leaf concept in Singapore is not top notch, Samy's curry is one of the better places to have a traditional banana leaf meal. Once you step in, they automatically place a banana leaf in front of you as your plate and you have a choice between biryani or white rice. It's especially nice in this day and age to be eating from a banana leaf, which so many Indian restaurants do not do anymore. It really adds that certain authenticity and light fragrance to your meal. You can then choose your curries and dishes from a display at the corner. The butter chicken was average, but the standouts were the chicken tikka and masala chicken. Really wanted to try their specialty, the crab, but with just one other dining companion, it was not worth getting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D6n61Jl4wVoUomZDI5seKA",
        "caption": "Photo of Samy's Curry - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D6n61Jl4wVoUomZDI5seKA/o.jpg"
      }
    ],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "rANSlJBG5ome-oFjjiMstw": {
    "date": "8/25/2013",
    "text": "Went there for a Sunday lunch with my family today afternoon. The food was great as mentioned by many earlier its reasonable as well. We sat outside enjoying the food and nature. We ordered the chicken tandoori, fish tikka and the chicken masala. Everything was great especially the fish tikka was awesome. As stated the chicken masala is their signature dish and was prepared well.The only thing is that the Mango lassi tasted a bit artificial and different but rest was great. Service is a bit slow but was ok since it was a Sunday afternoon lunch....Definitely worth a visit and will repeat",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h4gEnqowBfiEBew4Vk0VuA"
  },
  "HI-b2rn86BTcLFkYBZurYg": {
    "date": "8/19/2012",
    "text": "Samy's the place I bring my foreign friends to when they first arrive in Singapore. The food is lovely, and the restaurant serves a wide variety. I love that the rice is served over a banana leaf, and is a waiter comes over to your table to pile on as much rice as you want. Samy's is set a midst the greenery of Dempsey, which makes for a lovely dining atmosphere. One complaint that I have is that service might be slightly haphazard at times - though the waiters more than make up for it with their charming smiles.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDcJsT-IhVMH6sO19V_nbg"
  },
  "EeuLZF0d_wua4PDzAara8A": {
    "date": "8/11/2012",
    "text": "One of the first few restaurants located in Dempsey even before popularity kicked in. An open colonial house with big ceiling fans would best describe the ambiance. Samy's offers various curries with the fish head curry being a winner with most. Rice is served over a banana leaf and that makes the meal a whole lot tastier. Don't ask me why, I don't know either but the food just seems to taste better that way. Rice along with a side of vegetable and potato curry is refillable so eat however much you like. It does gets a little warm with all the spicy food but perspiring is all part of the dining experience! Get an ice cold home-made lime juice to go with your meal!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "YgVRgKEMl8lnY44oba_NhA": {
    "date": "8/5/2012",
    "text": "Probably one of the best Indian restaurants in Singapore, dining at Samy's is a relatively unpretentious affair. Surrounded by greenery and with ample parking spaces, Samy's is easily accessible by car and service is prompt. Though it can get a little hot dining in the day, there's always the option of the air-conditioned room at the back. The best time to visit would be in the evenings for dinner, when  the air is less humid. Price wise, it's fairly decent, although certain items like the big prawns cost a lot, as many of my friends have unwittingly found out.  Most of the times, you can get stuffed with just $10 spent. The food is as authentic as it can get, so for those who cannot take spicy food, you might want to give this a miss.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "qk9krqJgjwKeF7cOGYWR1g": {
    "date": "1/8/2013",
    "text": "4.5 a couple dishes were a little dry, but this place was very tasty.  nice and spicy with bold flavors.  fish head curry was delicious.  be prepared to be thirsty for something cool.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kS1MQHYwIfD0462PE61IBw"
  },
  "L4j231EBz4HElAXjXf6pcQ": {
    "date": "10/13/2018",
    "text": "Indian restaurant famous for curry fish head. The fish head here is indeed very good - lots of fish meat, bones easy to tear apart from the fish. The curry is a bit oily but nonetheless tastes good - a right mix of sour, spicy, and sweet (though could slightly be a bit sweeter). The pineapple goes well with the curry - wish they add more.The fish cake is appetizer is great but the portions are a bit smallSlightly expensive but still reasonable given the large portion and quality of fish. Would recommend if you want to try this local Singaporean dish",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "4X4_Pu_41A1khzeTOSI3vg": {
    "date": "4/5/2018",
    "text": "Southern Indian style food for the win! Extremely spicy, humongous portions. Fish and chicken and shrimp galore. We had a local order for us and I liked the whole eat with your hands expectation. A banana leaf cut to size as a placemat and all the food served directly from the leaf was a second for me. It was a foodies wet dream! I can't speak highly enough about this place. Apparently it used to be so spicy they had to tone it down because it was running customers away! I loved the spice level and the range of flavors. Parking is a bit tricky but once you find a spot all of your worries seem to melt away. Its a really open space with tons of locals and tourist alike. I got the sense that this place was legendary. I'd love to go back and try more dishes.Not so humbly submitted,Michael C.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0EmCJBn_Gud5iaHVJf2L_Q"
  },
  "lYi-n-cFQtyIabfvkNseQA": {
    "date": "3/22/2018",
    "text": "Maybe there is a little nostalgia when I visit Samy's since it was where I used to go when I lived in Singapore... It is an institution. I love walking up the stairs and seeing the lush growth of trees that surround the buildin. My mom is not a fan of spicy food, but the guy who brought us to the food display area was able to help us pick some dishes that would accommodate her milder palate. We ordered the tandoori cauliflower dish, the black squid/sotong, chicken masala, fried fish ball (perkedel?) and of course a paneer dish. We opted to not order the fish head curry as it is quite spicy and big to share.Shortly after ordering, somebody comes by with banana leaf (plates), and starts doling out rice, and side dishes. You must order the calamansi lime juice to soothe your mouth. Eating with cutlery is optional.  Everything is delicious. Although not as cheap as you would hope, the food and experience doesn't exist in the US, so I make sure to always visit when I'm visiting.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "r4_ymFnN2wQQ0VM53SrIVQ"
  },
  "Jy0MQ_tbddCn9OHmC3MwGg": {
    "date": "11/26/2015",
    "text": "Great masala chicken! My all time favourite. They also have very good chicken liver but it is very very spicy.The only other thing I eat at Samy's  is the fish head curry which is also good.But for today it is masala chicken with briyani rice because they ran out of roti prata.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "W-EeVu-kr9peninX4ajTGw",
        "caption": "Photo of Samy's Curry - Singapore, Singapore. Masala chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W-EeVu-kr9peninX4ajTGw/o.jpg"
      }
    ],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "1wZnr7dXdWC0y6wsf1iAqA": {
    "date": "10/2/2017",
    "text": "Butter chicken is delicious, service is prompt, authentic Indian restaurant experience without bring in Little India. Your food comes to you on a banana leaf (not plate) and everything is cooked \"cafeteria style\" so you can't adjust your order (ie I prefer a bit spicier) but all was delicious none the less. I also really love the location (Dempsey Hill). A few breweries, Wine Connection, and Ben & Jerrys are nearby to stop at afterwards.It can get a little hot and stuffy and it's really noisy at peak hours but I think it adds to the experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdxqYXj1kJZs8VPja_9-7A"
  },
  "rarWXeG-T7PuHb4MuTXb8A": {
    "date": "7/19/2015",
    "text": "Its been years since I last came here.  Years.  The last time I had it, (pre-Yelp days), I recalled it being just spicy and salty, and I honestly didn't quite enjoy the experience.  This time tho'...Oh boy, where should I start?  The banana leaf of course.  The rice comes out, and they serve you the daal, and with your first whiff, then taste, even before the main dishes come out, you know you're in a for a good day.The lamb was to die for, the chicken 65 brought back memories of my days in Hyderabad, the black sotong, wow, what was in that sauce man?! Believe me when I tell you, the fish head curry was probably the most 'disappointing' dish of the day, and even that gets a 7.5/10.  Washed down with a mango lassi (just right, not overpoweringly sweet) and a lime juice after.  I'm satiated.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3KYixk4HwDBFFBwws__tkw"
  },
  "BSnKiyRr6pFgBH6YeJNReA": {
    "date": "7/30/2017",
    "text": "Overpriced! The restaurant charged $3 for each serving of white rice, think this is even more expensive than a 5 star hotel!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jjLV5KMMx_cnF8ma3a-pAA"
  },
  "2rvAYCJ-LivrkKKMd4d3VA": {
    "date": "10/10/2015",
    "text": "Excellent Indian food! Some of the best I have had here in Singapore. Serving it on a banana leaf is a nice touch as well. Highly recommend the briyani rice with with either chicken or fish curry. Butter chicken and chicken tikka were nice as well, and the butter naan was good enough for us to order a second round. If you find yourself on Dempsey Hill looking for lunch, Samy's should be in the discussion.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4vhT_ASAQRtq0k8qYoNAg"
  },
  "aSBSNMVRdhoPX0wmV8yZsg": {
    "date": "5/16/2015",
    "text": "A Singapore landmark since 1960, this place still has it. A charming location on Dempsey Hill, and a classic menu with all the South Indian hits. The fish head curry is a must try, you haven't tasted curry in Singapore if you skip this one.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PONo7Cm32W9JeMBh8D6nXg",
        "caption": "Photo of Samy's Curry - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PONo7Cm32W9JeMBh8D6nXg/o.jpg"
      },
      {
        "img_id": "vWhpQQYak4PSiWqN8AlanQ",
        "caption": "Photo of Samy's Curry - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vWhpQQYak4PSiWqN8AlanQ/o.jpg"
      },
      {
        "img_id": "blXgr3Hl6irrmF88Wn4BDg",
        "caption": "Photo of Samy's Curry - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/blXgr3Hl6irrmF88Wn4BDg/o.jpg"
      }
    ],
    "user_id": "E3v2IZpOgvn2hAWaEzyLqQ"
  },
  "CYoeUOJKkVBwEG76evQb7Q": {
    "date": "11/4/2016",
    "text": "We were promised a stomping hot curry in a tropical island setting. AJ & I were picked up from T3 Changi in Mercedes GL250 4wd. Our friend H drove us to Dempsey in german stealth metal coach. The contrast on stepping into the control chaos of Samy's curry was monsoonal. Heaps of crowded tables laden with banana leaf plates heaped with rice & curry. We had chicken masala with white rice. Fish patties and lovely fish curry sauce. Washed down with Samy's lime juice. AJ from India had extra. A taste different from India's. The papadums were wafers of South Asia in concentrate. We saw lawyers in black & white enjoying the fish head. Maybe another time as we were discussing astrological economics with H. So couldn't let our senses be clouded by spice and chilly.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sa2jTUdR3kasSZea_W9RZA"
  },
  "Lj0YjT4aDO8jmeKYgIhTDw": {
    "date": "12/26/2014",
    "text": "We came here on the recommendation of a Singapore resident who said it would be one of the best curry's we've ever had...  he wasn't wrong :-)Samy's was just fabulous...  if you are looking for a fine dining, five star, high end dining experience, this is not it ;-) but if you just want authentic Indian food and some of the best you've ever had, then you are in the right place...The food is served on banana leaves and is very simple, but delicious... we tried about 6 different dishes (a bit overkill but we wanted to try so many things on the menu!)...We absolutely loved Samy's and will be back here in a heartbeat...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "RmMbDOMp_BFS_kllQbRNxg"
  },
  "Rb8rVHk974p9BPFIPU1Vkw": {
    "date": "6/18/2016",
    "text": "Although the place was a bit hard to find, the food and service was very good! Part if the place has air con and part of it doesn't. The night I went was busy so unfortunately we had to dine without the leisure of air conditioning. As for the food- naan was great, difficult to mess that up. They also brought us little chips and came around with a giant serving bowl of rice and curry. The curry that I ordered was around S$10, but they gave me a bowl smaller than my hand. I would come back again, but I wouldn't say this is my first choice when I'm feeling like Indian food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vb7OdlNzVkmk5A3_gqa1qA"
  },
  "SmUzUIiojxoLBHdZOTjhVw": {
    "date": "12/7/2012",
    "text": "Nice casual place for authentic Indian food. This place reminds me of Muthu's Curry 20 years ago before it became what it is today. Nice to know that there are still some Indian restaurants in Singapore serving the food on banana leaves.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jntKFnqrFvtjDvzUvEL82Q",
        "caption": "Photo of Samy's Curry - Singapore, Singapore. Samy's Curry dinner on a banana leaf",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jntKFnqrFvtjDvzUvEL82Q/o.jpg"
      }
    ],
    "user_id": "jTZf5BolBcfli0cNch4V7Q"
  },
  "sXYkeBl3vTxaNrDqGQ4FtA": {
    "date": "12/11/2013",
    "text": "Samy's is a great place to go when you're looking for some Indian Banana Leaf action around the area. Although it isn't the fanciest spot to bring a hot date, the proprietors have don't a lot in making sure the place is clean while having efficient service. They're a fish head curry restaurant, but whatever you do, don't order the fish head curry. I'm a simple man with simple needs, so I only order the Masala Chicken, a potato & fish puff (begedil), and the occasional vegetable curry. Pair that with briyani rice and the million free sides they give you, and you're set for the night. If you're looking to cool down, they have huge pints of lime juice or fresh coconuts available.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ncq1J7jnPTZDPRdZnHOt9w"
  },
  "o93Aaptc3Cja2Q8xd5XMYg": {
    "date": "9/2/2012",
    "text": "I've learnt not to order the prawns here. They really make your bill higher than it should be. Other than that, it's really like a high-end coffee shop to be honest. Perhaps due to the fact they were one of the first tenants in Dempsey, there is no pressure for them to renovate.The food is really good, the curries all have a strong kick and you know it is freshly made. I find dining on the banana leaves quite appetizing as it just adds to the visual attractiveness of the meal",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z1r6tgskaw3J56WWAkE1pg",
        "caption": "Photo of Samy's Curry - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z1r6tgskaw3J56WWAkE1pg/o.jpg"
      },
      {
        "img_id": "8engrbw9uipLJDWf5YnUvg",
        "caption": "Photo of Samy's Curry - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8engrbw9uipLJDWf5YnUvg/o.jpg"
      }
    ],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "YfdOBBDUiR75_u6l1TlpdA": {
    "date": "2/18/2016",
    "text": "Quick and nice outdoor seating. Basically, everything tastes like rubber and like it has been sitting around for hours.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uIxdD8Httrck29Qc-UAUQA"
  },
  "slWCUfbvumlakC3be9V0tw": {
    "date": "9/19/2013",
    "text": "This time I followed the advice of the Lovely Planet guidebook.I was looking at visiting Dempsey Hill but was not tempted by most of the place. The Guidebook however was citing Samy's as an old simple indian restaurant, with cheap but good food.And that's indeed what I found :-)The place is a little bit less visible than most restaurants in the area, but has a small terrace and a huge indoor place, with lots of long tables and a few round tables.You enter, and a waiter takes you through the menu (most is already prepared and ready to be put on a plate for you) A huge choice available, also including crabs and others.Service is very quick and efficient. A big leaf is put in front of you, and you are being served what you ordered on this leaf, and waiters come and offer you different vegetables, curry sauces for the rice, nan bread, etc... My tip: add the pumpkin :-)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "dpKkBNCSrXgwgqqXd5JqOw"
  },
  "Ell6iL_X_vO1WqQ1aCJPPg": {
    "date": "6/1/2013",
    "text": "I wanted this to be a 4-star review. I really did. But a 4-star review, possibly even 5, would be based on my dining experience last year and unfortunately my experience last week just didn't compare. Despite the restaurant being only half full, we were seated by the toilets... and despite asking to move inside, we were dissuaded from doing so (apparently booked out? Hmmm I'm unconvinced).Okay then. The good... the tandoori chicken, the potato-fish cake, and the beef vindaloo.  The roe and baked fish so-so. The fish-head was better than Muthus, I'll grant it that. Once again, my bug bear. Luke warm dishes. How is it so hard to get steaming hot food?! I thought service was as luke warm as the food. I dunno, just wasn't wowed this time. Maybe my expectations were too high, but unfortunately the food just didn't live up to the memory. I would go back, just wouldn't go out of my way.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MTQAGVEdfXjvFRPwsqvnlQ"
  },
  "PadzE1RXXsq5FrP---NsnA": {
    "date": "8/15/2014",
    "text": "Not exactly what I was expecting,  The restaurant seating is sort of communal, the food was good but overall was underwhelmed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "otv2Gal34HCzgQh_ohlxTQ": {
    "date": "1/3/2014",
    "text": "top notch indian!the fish head curry is huge, i would recommend ordering the small, which is still more than enough to feed 6+ people. the fish head is tender, and the curry is very flavorful.their other dishes are also excellent. they have this potato & fish puff thing that is fried heaven. their mutton is also flavorful and very tender. tandoori prawns were well prepared, although i've had better in London. the only thing I regret ordering is the masala chicken, which was a bit dry and not as flavorful as I like.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2B6LFJ6sJGq03ooznvu8A"
  }
}