{
  "6gWtOCd8Zg0I9S5qSixcuw": {
    "date": "4/30/2017",
    "text": "We were looking for more Thai Milk Tea after our trip to Thailand and we heard about Tuk Tuk Cha. Their Thai Milk tea is pretty authentic! It was a little too much on the sweet side for me, but you can customize how much sweetness/ice you want when you order.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RFM6Xyf52qI47eXvnu_2eg",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RFM6Xyf52qI47eXvnu_2eg/o.jpg"
      },
      {
        "img_id": "Oaz3pvXZQX12c8IlAf7j5g",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Oaz3pvXZQX12c8IlAf7j5g/o.jpg"
      },
      {
        "img_id": "6jMwmWGQWVVAQKqGZ306uQ",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Thai milk tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6jMwmWGQWVVAQKqGZ306uQ/o.jpg"
      }
    ],
    "user_id": "OKbv3KDqjEmYQeADqevsnA"
  },
  "Iw0toEDwEU7mHiGBzbumdQ": {
    "date": "1/27/2016",
    "text": "I like the shibuya toast. Warm and buttery with coconut ice cream dripping on it, it was pretty awesome. As a snack or dessert, it was more than enough to feed 3 of us. We also had the iced lemongrass drink which was not very sweet and was refreshing. The place was smallish with a huge table and chairs around it so you would have to share the space with others. The service was also quite non-existent. The whole time we were there, I felt like the staff could not wait to get rid of us (or any customers). They did not inform us when our order was ready, and when we realized it and went to collect the food, the vibe given was how could we not know the food was waiting. We had trouble finding this and actually walked up and down the stretch 3-4 times while consulting the directory map. Turned out it is a kiosk like stand in the middle of the walkway. This is next to Boost Juice and faces away from Kay Lee roast meat.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "eKKoEQQmdL8xJ172rdJ3KQ",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Iced lemongrass drink",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eKKoEQQmdL8xJ172rdJ3KQ/o.jpg"
      },
      {
        "img_id": "9rektdXPF5Xh3cXHPrbH5g",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Aloha coconut shibuya",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9rektdXPF5Xh3cXHPrbH5g/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "tP2frDWl9eIs_u85M_dbDw": {
    "date": "2/22/2016",
    "text": "Tuk Tuk Cha is a small cafe offering thai style desserts and drinks. Currently it has 4 outlets in Singapore. One of the outlets is located in Suntec City Mall. The cafe was small with a small dine in area of about 10 paxs. One would not miss the tuk tuk vehicle which front the dine in area when passing by the shop.Aloha Coconut Shibuya Roast ($10.80)It was served with coconut ice-cream, shredded fresh coconut, and honey, on top of the crispy toast. Although the toast looked quite thick, it sliced easily as it was quite crispy. The toast itself was quite yummy being buttery and honey sweet. The ice cream was quite milky and rich. Overall quite a delicious combination.Thai Milk Tea ($2.80/regular), Homemade Lemongrass ($2.80/regular)Not sure if the toast was too sweet. We felt that the drinks were just nice and not too sweet.Overall the food was great. Service was great too. Although we were the last customers left, the staffs did not chase us out.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Fr0E-6wIIP05x4xL_gjCWA",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Thai Milk Tea, Homemade Lemongrass",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fr0E-6wIIP05x4xL_gjCWA/o.jpg"
      },
      {
        "img_id": "Q8Sd0Gdkg6RUbT3WVWshCg",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Aloha Coconut Shibuya Roast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q8Sd0Gdkg6RUbT3WVWshCg/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "-JU9Mzgi4EFurDLSkiANiA": {
    "date": "11/30/2015",
    "text": "From the owners of the Bedok Point $1 boat noodles come Tuk Tuk Cha!Tuk Tuk is the famous motorcycle taxi used in Thailand. The staff here are all mostly thai and you can tell, once you make your order!They sell thai milk tea, green tea thai milk tea, yuan yang and other hot and cold drinks ranging from $1.70-$3.20.A regular thai milk tea costs $2.80 and a large costs $3.20. I had a regular thai milk tea $2.80 with mango pearls 50cents which I really enjoyed. The mango juice bursting in your mouth wasn't the best idea with the thai milk tea but it was still refreshing.I witnessed the staff boiling and pouring the thai milk tea, so you're assured you're getting real thai milk tea! The entire dining area sits maybe 10 people, at bar top level. The whole area is surrounded by hundreds of carnation milk cans!We also had toast with thai milk tea kaya $3.80. Yes there's like 9 cubes of bread for like $3.80. It might sound overpriced by I really loved the crispy exterior of the bread, together with the fluffy inside that seemed to have butter melted on the inside.I wouldn't eat this daily for sure, as I would rather get my kaya toast, but it is a nice treat. They have also recently expanded to have an outlet in raffles city, next to gong cha and also a heartland outlet in Sun Plaza, Sembawang.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TpB4umGvssP_XA_cRlANNQ",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TpB4umGvssP_XA_cRlANNQ/o.jpg"
      },
      {
        "img_id": "E9-JU_YyQVTfCGmAToZZdA",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E9-JU_YyQVTfCGmAToZZdA/o.jpg"
      },
      {
        "img_id": "Dtt78ZDY6_3nKo3WFPSo7Q",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Milo toast $3.80",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Dtt78ZDY6_3nKo3WFPSo7Q/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "W16aapcHzs4QqjCBTM3ZGg": {
    "date": "1/6/2016",
    "text": "Super mediocre. I came here because I saw a mouth watering photo of the shibuya toast on a blog site. What a lie! I'm all for \"Instagram worthy\" food pictures but the presentation of the toast sucked. It was served in a plastic container. It did not look nice to eat. It was not only because of the presentation, but also how it tasted. The toast literally tastes just like toast. Topped with coconut ice cream. And some pieces of coconut meat. Nothing extraordinary about it at all. The portion was quite small too. Disappointing. However, the drink I ordered was delicious. Green Thai milk tea. It tasted like green tea and Thai milk tea blended together (duh). It was really nice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nt6PM7c1I-06abuHqUhKmA",
        "caption": "Photo of Tuk Tuk Cha - Singapore, Singapore. Aloha coconut shibuya toast.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nt6PM7c1I-06abuHqUhKmA/o.jpg"
      }
    ],
    "user_id": "6Lmv1k8mnufs78d0Gbk-ow"
  },
  "XiF7ei5OGexyN4gv0F25Lg": {
    "date": "1/23/2016",
    "text": "Stumbled across Tuk Tuk Cha while roaming around Suntec City, and found the homemade taro kaya toast to be fantastic. You get 9 cubes of toast with a serving of taro kaya sauce for $3.80 which I thought was reasonable. Paying $10.80 for an entire toast topped with ice cream seemed a bit much in my opinion. The toast was perfectly crisp and conveniently bite sized. The Taro kaya sauce was delicious, not too sweet yet enough to give your toast the kick it needed. I also tried the Thai green milk tea which is priced at $2.80. Previous yelpers had noted how they witnessed the workers brewing the tea right in front of them, but my experience was a bit different. Perhaps they have tried to operationalize the practice to be more efficient, but all I saw was the workers pouring pre-made Thai milk tea into my cup and sealing it. I think it took away from my perception of authenticity, but regardless, the drink was good. I would perhaps come back here if I happen to be hungry in suntec, but likely would not come back craving it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0nSzAzzqVUY1W-D-IVvu_A"
  }
}