{
  "CAXVVgflgy1--1Kr9zWOew": {
    "date": "2/16/2017",
    "text": "So I was dropping off my laundry in this kind of dumpy looking building, and was intrigued by all the restaurants - especially Japanese - inside it. Wandered around a bit through the various floors and did a Google search, ended up here. Was one of the most memorable meals of a six week trip through SE Asia. It's not cheap, but the quality is quite good and there are just a ton of different types of dishes to try. Bacon wrapped scallops, wagyu beef, various pork belly preparations, beef and chicken meatballs, sausage, really there was not a single miss. We were lucky to walk in and get a table on a Thursday night, but they told us we needed to be out by a certain time. The place was packed. I would definitely recommend getting reservations.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RJS2O7_oEPO9S1A1bYasBA"
  },
  "L4s46-cr0uYaNu73VBIrGg": {
    "date": "1/17/2017",
    "text": "At critical mass, expect no privacy  - this place was jammin'!  Personal space is not in the cards.  On the other hand, the food, was acceptable.  However, I couldn't wrap my head around the crowd and the absence of intimacy.  Service was hurried and I felt rushed.  The frenzied energy was too much for me.  While the yakitori was good, what's with the sashimi?  Why not stick to grilled meat.  Keep it simple.  The menu seems stretched and it affects the staff.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "q84kKzfAAKOYFfCLrmlajw"
  },
  "_n2g5veYtBJUa67ESeAv7Q": {
    "date": "5/10/2017",
    "text": "This place be delicious. Order many meats on sticks. Wash it down with premium sake (or whiskey). Pay kind of a lot for it. But leave full and happy. They have 2-seatings for dinner (6:00pm & 8:00pm). GO EAT AT THIS PLACE. FOOD (must try): * Fatty pork w/ apple sauce* Foie gras* Ox tongue* Chicken meatball (w/ egg yolk) * Lamb yaki* Garlic riceSERVICE: * 2 thumbs up * ConsistentPRICE: * $$$ (around $55-65 per pax w/o booze)OVERALL: * Great for groups of 4-6 * Dinner over lunch* protip: they have a selection of Suntory whiskeys for around $200-250 / bottle",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUAiW8Lcdla5Ii53kV6RFw"
  },
  "ym7df5UQDjeIUm3LI8PVTw": {
    "date": "7/9/2015",
    "text": "Absolutely sublime. Who knew meat-on-a-stick could be elevated to such a level!Every single skewer arrived at the table grilled to perfection. I've been to many a robatayaki, kushiyaki, and sumiyaki-type place and it compares favorably to a very good place in Japan. it was pretty much hard to choose a favorite menu item. The foie gras was delicately crispy on the outside and buttery on the inside. The grilled whole scallop was amazingly fresh and a symphony of flavors. Other items are the beef tongue, pork belly, chicken wings and the creamy, custard-like Japanese sweet potato. Order the sweet potato right at the beginning of your meal, as it takes a good 30-40 minutes to prepare.Ask for the off-menu seasonal items as well, and depending on what arrived that day, you might be treated to an amazing combination of dishes. A reservation is absolutely necessary as this place is completely packed. Don't let the price put you off - you get what you pay for.I usually skip Cuppage Plaza as the contents of this building are mostly pretty shady. I was reminded again as the ladies of the night congregated outside one of the numerous bars as I left the restaurant.The faint smell of barbecue still lingered on the shirt, a reminder of my visit to possibly the best place in Singapore for Japanese-style charcoal grilled items...",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "kcrJ5kpcgZkOdlnnjOeeFQ": {
    "date": "5/25/2014",
    "text": "Over a year since I first bookmarked this, we finally went there tonight. These guys know how to grill and season meat extremely well. This is better than at least half of the Izakaya places I have been to in Tokyo, and they speak English here which is helpful. The fish fillet wrapped in bacon was beautiful. Like pretty much all of the rest of the meal, it was juicy and flavorful.In my opinion, the shortcomings were how about half of the things we wanted to order were sold out, and then they forgot the rice we wanted (and when it came after we asked for it a second time, it was not brown rice as we had ordered but we didn't want to incur another wait by sending it back).It was about $120 and we were both full. We will return.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "OE7ursiFIScpTGP2sRmd9g": {
    "date": "8/28/2017",
    "text": "Every bite was beautifully prepared. The wagyu skewers were a particular favorite, and I adored the pancake balls as well. The space can get a little cramped and noisy, and I'd definitely recommend making a reservation. The building is a little sketchy, but that only added to the charm, in my opinion.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEuN03y0jBQY4epKq1xwAQ"
  },
  "B4XIiRAPX69c_ZYLsZobyw": {
    "date": "9/24/2015",
    "text": "We had an excellent dinner here. The staff was very friendly and helpful in describing the specials and regular menu items.Reservations are highly recommended. And don't get turned off by the location. The building seems a bit downscale, but this place is worth going to.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIGlirQ2B5zErr9CdQZC0A"
  },
  "2v4g2B-R2PEGKg44qwFHew": {
    "date": "10/26/2013",
    "text": "Whenever I want my sashimi and yakitori fix, Kazu comes to  mind.  Its a hole-in-the-wall sort of place but the food never fails to impress.  Like all great food places in Singapore, booking in advance is a must.Service is efficient and the place is a little crowded as they tend to cramp in as many seats as possible.  This place is famous for its yakitori.  I also like to order their sashimi specials as well as seasonal food items.Overall, it is a rather pricey restaurant for its ambience but the food makes up for it - enough that you don't suffer an indigestion after paying the bill!  One more thing ..... whenever I can't get a booking here and I have a bad craving for yakitori and sashimi that simply needs to be satiated, there's another place at Clark Quay to go to!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "M1zL0-eyMslv5AP1aXLlxg",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Yakitori",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M1zL0-eyMslv5AP1aXLlxg/o.jpg"
      },
      {
        "img_id": "7PVwNfdnVX4_acGwH4iAXQ",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Shell fish sashimi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7PVwNfdnVX4_acGwH4iAXQ/o.jpg"
      },
      {
        "img_id": "XVVzJHXzS8FqnFdLBCDzzQ",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Sashimi at Kazu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XVVzJHXzS8FqnFdLBCDzzQ/o.jpg"
      }
    ],
    "user_id": "pbEqsg2vay8g-c8M_ooOzQ"
  },
  "m_VDsKmcWalA1hOuDjXFQw": {
    "date": "12/9/2012",
    "text": "This is a review of a group dinner with colleagues at Kazu Sumiyaki in Cuppage Plaza.I had not been to Cuppage Plaza before.  I was the first to arrive.  So, I was left standing outside of the restaurant  awaiting my colleagues who had made the dinner plans.  I am relatively sure the young ladies from the KTVs thought I was there for something else.This is a small room.  It is also quite busy.  It has a bustling feel to the ambiance.  The room does also maintain a Japanese aesthetic. Everyone seems to be thorougjly delighted by the food.The service was professional and efficient.  It was polite but not overly friendly.  Kazu seems to be  centered around getting your order and then, in a fast but relatively well paced manner, delivering your food to the table.The food was consistently very good.  It was well prepared.  There were dishes (ie Shishamo - aka pregnant fish) that I did not enjoy.  I do not think there is a way to prepare it that I would enjoy it.  I do not like the grainy texture.  The presentation was basic and very straight-forward.One person did pretty much all of our ordering.  After that, it was just a crazy culinary ride with dishes appearing in a constant stream.I am not going to comment on each dish.  I will divide them into groups and provide a link to a photo.  As you can see, by far, most things are in the \"Things I liked a lot\" section.Things I liked a lot.Pork Bellytinyurl.com/bpvol3aBacon Wrapped Oystertinyurl.com/a8uhd87Bacon Wrapped Scalloptinyurl.com/aq8ccn2Pork Wrapped Asparagustinyurl.com/b5364hfTiramisutinyurl.com/aabv2m7Dessert (Not sure what it was called but there was cocoa involved)tinyurl.com/by2myuqDessert Crepe tinyurl.com/bmbnhdsThings I liked:Beef with cheese tinyurl.com/b9z6x98I am not exactly sure what this was.  It arrived in the middle of the food maelstrom.  I tried it, thought it was ok and quickly turned my attention back to foods wrapped in bacon.tinyurl.com/b3v942yThings I didn't like:Shishamo (pregnant fish) tinyurl.com/ahzm6aaRice Soup tinyurl.com/cfsrkk3Overall - I really enjoyed the energetic vibe of the restaurant.  It is not very large.  it is full of people ordering loads of food and enjoying it.  The staff is working briskly to insure food and drink continues to flow to the table. The menu is vast but the quality of the food does not appear to be deterred by this.  Kazu Sumiyaki provided some very delicious food   I just think this is a great dining experience.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "B1K9o3om973a2jZN4d042A",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Rice Soup - Kazu Sumiyaki - Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B1K9o3om973a2jZN4d042A/o.jpg"
      },
      {
        "img_id": "u6Jen5cnEGjhXI5juS4hpQ",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Pregnant Fish - Kazu Sumiyaki - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u6Jen5cnEGjhXI5juS4hpQ/o.jpg"
      },
      {
        "img_id": "30Zctz_-IU35SuLvjJ0gOQ",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Deesert - Kazu Sumiyaki - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/30Zctz_-IU35SuLvjJ0gOQ/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "IyWFGpKgKquAwqpOhFbjDQ": {
    "date": "10/1/2012",
    "text": "I'd never been to Cuppage Plaza until coming to Kazu last summer.  hmmm....talk about an old Singapore throwback.  It's an older building with KTV bars on every floor and young women hanging over the railings on the lookout for clients.So I was pleasantly surprised upon arriving at Kazu to discover a more traditional restaurant, absolutely packed with people.  Sumiyaki apparently means \"charcoal griled\" and most items on the menu seem to involve meat on a stick.  Between the five of us we tried a ton of items.  The standouts:  foie gras, scallops, pork belly, wagyu beef, bacon wrapped anything  Really, it was all so very delicious, especially with a Sapporo to wash everything down.  The restaurant isn't that spacious at all, so reservations might be essential for dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jkr3YVCEoRNKkxinUZpW6A"
  },
  "LQWN0WTRioHSD1AN332Viw": {
    "date": "3/4/2015",
    "text": "One of the best sumiyaki house in Singapore. The fact that it has survived through so many years in fickle Singapore means something. There're two seatings at dinner time 6 or 8pm. Be prepared to eavesdrop or be heard because most of the tables are very close to one another. So leave your secrets outside and enjoy the food ! I love the grilled kama and sweet potato though they aren't cheap. Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "uta_0ZCmK6Chxg_8aUtpqg": {
    "date": "7/25/2013",
    "text": "Originally the wait was an hour, but a single seat surreptitiously opened. I sat at the bar in front of the tiny grill. It's surprising that one meter of flame can feed 50 in a timely manner. I ordered the cold green tea buckwheat noodles, chicken meatballs, sweet leek and sweet onion skewers. The food was fast, the flavors uncomplicated but well balanced. The quality of the raw food is enhanced by the careful attention of the chef. Kazu Sumiyaki isn't fancy, but the service is efficient, immediate and knowledgable. I really enjoyed my meal and highly recommend Kazu Sumiyaki.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bkUQUZZnnojpGHP3tGtpPg",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Front of Kazu Sumiyaki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bkUQUZZnnojpGHP3tGtpPg/o.jpg"
      }
    ],
    "user_id": "ll9zYdUHd3fw8R3zfWezfg"
  },
  "SU1OaN50VJhcUYUEt0IsUg": {
    "date": "4/14/2014",
    "text": "Best beef tongue I've had in my life. It was perfectly seasoned and super tender. Chicken hearts & pork belly were also standouts for me. I'm not much of a drinker but I do love me some plum wine. I was ecstatic when I found out they make their own! It was so refreshing and the perfect accompaniment to a delicious meal. I'll be back Kazu...oh, I'll be back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HuBI9ybMTlPaNYsVc3Hv3Q",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Epic grill station.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HuBI9ybMTlPaNYsVc3Hv3Q/o.jpg"
      },
      {
        "img_id": "Ii7iLgvGM5Wbcq24fhy-lw",
        "caption": "Photo of Kazu Sumiyaki - Singapore, Singapore. Homemade plum wine with club soda.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ii7iLgvGM5Wbcq24fhy-lw/o.jpg"
      }
    ],
    "user_id": "ic0EsDxPWyvZEwoac93Ubg"
  },
  "SYgflRF-VkzFbzQtQ47lVA": {
    "date": "3/17/2013",
    "text": "The restaurant is in an almost soulless building but in contrast, it is almost always full house and require reservation to be made. The place was not big and we were immediately seated at a corner and the next moment, a bowl of cabbage and special sauce was allocate to usI already conclude that this is one of the best Yakitori restaurant in Singapore when I tried the first skew. Its meatball was juicy and nicely marinated unlike the normal dried ones you find at other place.It wasn't easy to get our stomach filled since the food was really nice and one serving wasn't enough. We had garlic fried rice, pork meatball, pork maki of avocado, enoki mushroom, the seasonal squid, pork apple, foie gras which were all very good till my friend commented that they are so heavenly especially the foie gras. We had more than one serving for most of the stuff.Don't worry about the sticks laying around the table like satay stick as the restuarant provide a container at every table for those finished sticks.Ask for seasonal stuff but expect a steeper price. So, please remember to ask for the price before ordering.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "9evC7g5uOFAtp-UTbi1tWg"
  },
  "dEsbzse4nc3dOW5zhPpTNw": {
    "date": "10/14/2012",
    "text": "Kazu is a pretty small dinky place, and located on the 4th floor of Cuppage Plaza so if I didn't already know it was there, I probably wouldn't have stumbled upon the place. It gets crowded though, so do make reservations if you can!The food overall is pretty good. My friends had been there before so I let them do the ordering, which were mostly grilled skewers of stuff. I particularly like the Tontoro Ringo (pork with apple bits), the bacon wrapped enoki mushrooms, prawn with scallops and leek.One problem though: we ordered the Foie Gras and reminded them several times, but for some reason that dish just never arrived, quite oddly. And for the ladies to note, Cuppage Plaza in the evening is a little bit dodgy with lots of KTV pubs in the building.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "kWTDVig_u8CDxKaCt7OBqA": {
    "date": "9/2/2012",
    "text": "Kazu is one of my favourite places for sumiyaki, i.e. charcoal grilled\" (sumi meaning charcoal and yaki meaning grilled). It's a bit cramped and almost always filled to capacity, because the food is amazing!I love the foie gras it is beautifully seared yet soft and creamy inside. I also love the wagyu beef, the tsukune and chicken soft bone as well as the hotate with cheese and the pork belly avocado. Not such a big fan of the tontoro with apple though.Kazu is a bit pricey but definitely worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "0gJ7OgPBeiuEY0Tvdmazwg": {
    "date": "5/23/2014",
    "text": "My yelp friends know that I don't usually give 5 stars unless it's excellent, and excellent this place was. I have never been a giant fan of yakitori, but this restaurant really opened my eyes to how great yakitori can really be. Almost every item I had was outstanding, and yes I'm going to recount every item I had. The most memorable dish was an odd one, it's cold cabbage with miso dip. The cabbage was just served at the right temperature, on the cold side, and with the yummy miso sauce, the coldness and crunchiness of the cabbage really came through. We had two orders of it because it was so addictive. Foie gras skewers were great as expected, but hey it's not as challenging to make something like foie gras taste good. The garlic pork meatballs were super yummy, it was just juicy and flavorful but smoky on the outside.  The japanese tomato was sweet and yummy, and definitely try the fresh sashimi of the day. I had the best amberjack sashimi I have every had in Singapore, period. The grilled kitsune with minced pea and meat was super delicious, perfectly roasted on the outside and super umami, a must try! Bacon with enoki or avocado are really good as well. I actually wasn't as impressed with the pork belly and wagyu beef as much as I thought I would. The ONLY thing I wasn't impressed with was the bbq onigiri, which was kinda dry and salty. Ooo, and I love that their sake came in glass teapots. Not a cheap place, but definitely worth the price.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "slOwrR96Yj-pCZdPyKui7w": {
    "date": "9/20/2012",
    "text": "Kazu is always crowded so book ahead! The foie gras, which comes as two small pieces on a stick, was a gem. Cheap, too! As was the unagi kabayaki, perhaps the most tender I've had in recent memory.The kitsune - crispy beancurd skin with meat filling - was surprisingly good. It came with yellow horseradish sauce on the side, which was like a milder cousin of wasabi and went with the kitsune really well. The brown dipping sauce for the yakitori in general also complemented perfectly.Also, you are cheating yourself if you come here and don't get the yaki imo (sweet potato). Takes nearly an hour to cook but it comes piping hot and soft with a small slice of butter that just melts into the potato. We thought there were a few items that weren't worth it, though, such as the homemade fish cake at $8 and the grilled sanma (saury) at $32. The fishcake was decent but not particularly impressive. The sanma came a little too charred. Our server explained that it was because of the charcoal grill, but most of the fish skin was blackened -- not a pretty sight.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "D6-pwyZgXy8wxFy-NbCWCw"
  }
}