{
  "enwnh0z_cntLbz_MmHh3Vw": {
    "date": "1/15/2014",
    "text": "There have been mixed reviews on the restaurant and one thing I heard was that the food doesn't justify the price. However, with the downward revision of the already affordable lunch sets, I don't think anyone would be deterred from checking FC out. Each set comes with salad, chawanmushi, miso soup and dessert with your choice of mains. Pick from the 12 mains which are priced from $25 to $48. Don't worry if you're not a beef fan, there are sashimi, pork and chicken on the menu too.The chawanmushi was topped with a light tasting crab sauce and it has prawn, mushroom and scallop in it.We ordered the Kinoko ($14), assorted Japanese mushrooms braised with sake, lime and butter. Honestly, it tasted like normal stir fry with a tinge of lime. A disappointment really. And it was a rather small portion.We also tried the Nasu Dengaku ($10), barbecued eggplant glazed with honey miso. This is a tiny baby Japanese eggplant and it certainly isn't worth the price tag. There was a plum undertone in the salty miso which didn't sit well with the girls.We had the 2 hot favorites at Fat Cow, which is the Fat Foa-Gura Don ($42) and The Fat Cow Donburi ($38). It was a tussle between the 2 choices but here's the flavor profiles so that you can decide for yourself! The Fat Foa-Gura Don has the rich and buttery glazed foie gras chunks and grilled wagyu beef cubes. The sauce was a little on the sweet side but the overall flavor is strong and heavy. I liked the toppings on this one but i found the rice to be a little on the dry side and it acted like a sponge, soaking up all the oil from the goose liver..The Fat Cow Donburi is a simpler dish in comparison but it has its own merits. Charcoal grilled Wagyu Beef with a light garlic flavor, with onsen egg and shiro negi. The first thing we noticed about the dish was its truffle aroma.Break the egg and mix everything together and enjoy the moist and flavorful rice. Absolutely delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "fbpgF_yn6GTZSloX28OYvg": {
    "date": "10/13/2012",
    "text": "This is another amazingly beautiful room.  The 3D wooden matrix celling is nothing short of beautiful.Link to external source for interior photo:tinyurl.com/8fujph3Along with the beautiful room, the conservative Japanese influenced service was excellent.  The servers were consistently insuring the meal was moving forward.  They were each very professional and polite.My friend does not drink sake.  She selected a cocktail called the Unusual.  Unfortunately, I can't remember what she thought of this cocktail.With a little input from the server, I decided on a sake for myself.  After selecting my glass from the tray offered, I tried the sake  (DASSAI JUNMAI DAIGINJO) and was quite pleased.  I tend to lean more towards sake with a profile featuring slight touches of fruit.The food ranged from good to very good.  Honestly, I was expecting very good to excellent.   Some dishes flirted with this but I do not think they quite reached it.Sushi Mori - Featuring very high quality fish and strong preparation, this was a very enjoyable dish.tinyurl.com/9oq7ey4Truffle Fries - These were also very good.  I could certainly taste the truffle.  Plus, the fries had a very nice crispiness.tinyurl.com/8zyaa8uZuchini Blossom Tempura - This was one of the highlights of the meal.  The tempura blossoms were stuffed with Hokkaido scallops.  It was a delicate and subtle dish.  The presentation was very impressive.tinyurl.com/8mjcsyrWagyu Ox Tendon & Foie Gras - I did not try this dish.  I have made a personal choice not to eat foie gras.  My friend said it was good but not great.  She grew a little tired of the tendon.tinyurl.com/9rqmwxySnake River Farms US Wagyu Steak - This was good.  it was cooked perfectly.  However, I thought the cut was a little on the small side.  Plus, it was a bit bland.  It is possible that it was not properly rested before slicing.tinyurl.com/9zzsq7bShabu Shabu with Grade 3 Japanese Beef from the Kagoshima Prefecture - This was good.  The overall presentation was very nice.  I do think though that due to its nature, the depth of flavors of the meat in shabu shabu is limited.  Hence, the special sides for increasing the flavor.  My favorite part of the shabu shabu was actually the mushrooms.  They were divine.  tinyurl.com/99zxd4xOverall, this is a beautiful restaurant with truly excellent service.  I just thought the food fell ever so slightly short.  From a presentation standpoint, I thought it held up to any restaurant I've visited in the last year.  However, from a flavor standpoint, I thought it fell a tad short of some others.  When visiting restaurants of this caliber and expense, the expectations are very high.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TVHp3RMNZHiVVB88Qfb8Kw",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Snake River Farms A3 Steak - Fat Cow - #Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TVHp3RMNZHiVVB88Qfb8Kw/o.jpg"
      },
      {
        "img_id": "k3oD6tZo8cTzwb2jtqfUnA",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Shabu Shabu - Cooking - Fat Cow - #Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k3oD6tZo8cTzwb2jtqfUnA/o.jpg"
      },
      {
        "img_id": "BVcBGGAJ69YSsa-3MHZkHg",
        "caption": "Photo of Fat Cow - Singapore, Singapore. The Meat - Shabu Shabu - Fat Cow - #Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BVcBGGAJ69YSsa-3MHZkHg/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "AdiTEJ5iTpmttgTM2y0rdA": {
    "date": "5/9/2015",
    "text": "Fat cow is for meat lovers. They have sea food and Sushi like any Japanese restaurant, But you don't go there for that. Besides there are other places, arguably better. No you come for the beef. Forget the fancy Japanese meat dishes and just go for the slab of steak. They have Japanese, Australian and US. Skip the rest and head for the Japanese to really sample authentic wagu cooked to perfection. Order medium rare at most. Anything more cooked is sacrilege. Side dishes are meager but very good. The stuffed zucchini flowers are excellent, as are the various salads. Order the smaller portion of meat. Your wallet and stomach will thank you. The high fat content will fill you if you take the time to savor each piece. This is not the time to wolfing down your meal. Chew more times than you normally do before swallowing to get the full experience.  A side dish of fat rice is the perfect accompaniment.  Be prepared to pay through your nose though, but for that special occasion, go for it.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "SRqHkY8pmycidi_SwoiwAQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. At the counter. They have normal dining room, but cooler to eat at the counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SRqHkY8pmycidi_SwoiwAQ/o.jpg"
      }
    ],
    "user_id": "91UQ_DLi_qsDXQfg6kBePw"
  },
  "ibukl_21jDRYG55zWY9sgQ": {
    "date": "8/10/2012",
    "text": "Gourmet lunch on a budgetDining at Fat Cow can quickly burn a huge hole in your pocket, so if you're not looking to spend upwards of $250 on a meal, there're also the +/- $60 lunch sets. Us group of ladies decided on a Friday treat and managed to snag an inside table for 6. Most of us ordered the donburi despite the carbo threat - honestly, don't waste a single grain of the perfectly plump, chewy, sticky short-grain rice; it's that good. While 1 friend took the Hokkaido don (with seasonal seafood), 3 others ordered the Wagyu donburi with onsen egg while 2 of us went for the foie gras & wagyu donburi. The wagyu was everything you hope it would be - fat glistening cubes of meat that almost melted in the mouth with no resistance. I didn't expect the cubes of wagyu to be of such high quality - at least A3 if not higher.  The crisp pan-seared cubes of foie gras also had a nice smoky char that added to the fragrance of the bowl. I love my fatty (eg flavourful) meats, so this portion was perfect. Some thought it was a little too much but finished up anyway. The lunch set also includes miso soup, salad, a chawanmushi and dessert, all of an amazing quality that gives you a taste of the full fledged experience.Lunch sets available from Mon-Fri only, 12-3pm.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gBLbg4e2RzF7rW9vSTG18w",
        "caption": "Photo of Fat Cow - Singapore, Singapore. The action is at the counter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gBLbg4e2RzF7rW9vSTG18w/o.jpg"
      }
    ],
    "user_id": "HUodv8WGv4xo7EabaN3dqQ"
  },
  "eVcyrXT3xeB2eDRgzRRifQ": {
    "date": "5/23/2014",
    "text": "this was a great lunch! the decor is beautiful with a 3d wooden cube structure on the ceiling that elicited notes of traditional japan while still being contemporary.on to the grub:i ordered the wagyu beef cubes with foie gras donburi. the beef was slightly overcooked versus my order of medium rare, but the foie gras was cooked perfectly. the rice was a bit plain, some gravy would have been groovy. i tried my friend's wagyu with egg donburi and that was much better. the hamachi carpaccio with truffles was heavenly, although the taste was a bit heavy.the mushrooms were no bueno - flavors were too strong and too salty. we barely ate any of it.I also had one of the grilled prawns. it was quite nice, fresh and cooked perfectly.service:service was poor. my grilled prawn came after my dessert ice cream. really? also, i asked for a water refill and waited 15 minutes for them to top off my cup. there aren't even that many customers here, how can they be so slow?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2B6LFJ6sJGq03ooznvu8A"
  },
  "g1sjDUL_AY0x1yAbR9r4RQ": {
    "date": "9/27/2013",
    "text": "If you are a vegetarian you have not a lot of options here. 4 veggie side dishes that are insanely expensive. I mean 3 slices of sweet potato for 12S$? Really?The vegetable tempura was not that good. I had better in cheaper places like Shin Kushiya. But the service was very good and very nice. Overall much to expensive for what you get.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SknWhKrnExoFnPUP_3uzLg"
  },
  "3VqmRQ0NAkdYPzBGafHVkw": {
    "date": "12/3/2014",
    "text": "After all the rave reviews on Yelp, I was really excited to try this place out for the awesome lunch. I like to visit atas restaurants for lunch first, and if the taste agrees, I will proceed to having dinner. I was super excited about this foie gras and wagyu beef rice bowl, and boy, did it disappoint. The first time it was served, it wasn't what I expected. I had asked for rare, and dark chunks of over-cooked beef and foie gras (meagre serving) was just not what I had hoped for. I sent it back and the second time, it was still slightly overcooked but I did not want to send it back the second time. The thing that really gets me was the lack of marinate/ flavor in the beef cubes. It tasted like it was just salty, with no umami whatsoever. Service was good, servers were very professional. For a meal that was $48++, I will not be coming back. The food just did not deliver.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "ux_JxIqy_HEgWuLsGBeZGQ": {
    "date": "7/11/2012",
    "text": "Holy Fat Cow, what a mindblowing experience!That is all.Oh alright if you insist.Food : The zucchini blossom tempura stuffed with Hokkaido was delicious! Light and crisp yet extremely more-ish. Love. We also had the wagyu ox tendon pan seared foie gras and daikon ... the flavor was really brought out by the fact that it was slow cooked although I'm personally not a fan of ox tendon, and was nicely balanced by the daikon. We opted for shabu-shabu and charcoal grill, and was recommended the Japanese Grade A5 and the US Wagyu respectively. Both turned out absolutely mindblowingly out of this world delicious. We could have eaten the whole cow!Ambience : The people behind Fat Cow have taken over the premises that housed the former Le Figue and turned it into something chic and gorgeous.Service : Excellent although the attentiveness of the chefs became a bit unnerving after a while.Not for the fainthearted.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "_TI9cMHmgQX-L_DvIT5P7A": {
    "date": "7/31/2014",
    "text": "Their beef and foie gras bowl is worth every penny... Although every time I finish, I'm tempted to order another bowl.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fIl2vuddRLlfjf9ya_aUSQ"
  },
  "LmLLtcOYV9nY7lRSN0mZWQ": {
    "date": "10/22/2012",
    "text": "Way overpriced for what you get, service is terrible and the place will be closed in less than a year.The menu is designed to deceive you. The waiter explains that the beef is priced per 100grams, but you have to pay for a minimum of 200 grams, and the chef weighs the piece that they have, so you have no idea what it is going to cost. We got a cut each of the Australian Wagyu and the US Wagyu for $360. Between four people that is a ridiculously small amount of beef for the price.Starters were the dumplings and the sashimi special for $120 and it is itty bitty portions. Now the food was delicious, but there is no way you can justify that price for some raw fish that would fit on the average side plate.The beef was decent, but it does not take that much experience to cook it medium. We popped a bottle of wine for $170 and that rounded out the whole overcharged experience.A couple of tips for the management:1. Charge less or serve more. Your menu is misleading, and I hate being ripped off.2. If your restaurant is empty, why were some menu items unavailable?3. Train your servers better. Every time I took a sip from my glass, the waiter refilled it. In addition, they hovered around our table watching us before ordering, and watching us eat. Majorly annoying when you are trying to enjoy yourself with friends.4. Change the name and the location, they are both stupid.5. Better yet, just close up. You are not offering an awesome enough experience for $160 per head",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyiSA0yxVGN8zSRaYHoyMA"
  },
  "bBI3iGZ_5buf3Fox2cXmUw": {
    "date": "6/12/2014",
    "text": "I love steaks. I am always on the look out for a nice slab of marbled meat. So far, Fat Cow's steak is the best I've ever tried. Being a big fan of steaks, I ordered the A5* wagyu steak, seared to medium rare.*A5 is the highest grade being awarded to wagyu beef. It is determined based on its marbling score, meat colour and brightness, firmness and texture of meat, and color/quality of fats.The steak was 300g and cost $298++. That comes up to more than $1/g and every mouthful that I took was probably worth $10 but it was so worth it! The divine taste of beef, fats that melted away without giving a greasy feeling, coupled with the grainy yet tender texture of the meat created the perfect steak ever. Every bite that I took, I went straight into heaven, lingered there for awhile, before coming back down for another bite. It was really that good. Of course, this was also the most expensive steak I've ever eaten so I was glad it measured up to expectations. The steak was served with a shoyu dip with grated ginger and sesame. Initially, I was skeptical about dipping such a marblellous piece of steak into shoyu but wow, the shoyu brought out the sweetness of the beef!!! We also asked for some freshly grated wasabi to pair with the beef because we liked that combination.We also ordered a few other dishes to share before the steak arrived. Traditional 'onsen-egg' served warm with a hunk of crispy fried beef bone marrow in a citrus dashiThe bone marrow was crispy and light with a tinge of sweetness while the citrus dashi added a refreshing taste. Break apart the yolk and you have a creamy balance of sweet and saltiness. A perfect appetiser!The zucchini stuffed with snow crab was amazing! The tempura was light and crispy yet not oily and there was a large amount of crab meat inside. The crab meat was fresh and sweet. We also had the choice of dipping it into mustard which excited our tastebuds. Overall, this was a unique dish and we loved it.Barbecued eggplant glazed with honey misoI am not a fan of eggplants but this was pretty good. After scraping off some of the miso (as it was too salty for my liking), the eggplant was actually palatable! It was so soft it almost melted in the mouth and I loved the slight chargrilled taste. The honey miso made it a really appetising dish indeed.Grilled gamba carabinerosI was really excited to see gamba carabineros on the menu. Gamba carabineros are a type of Spanish red prawn and ever since I ate them in Barcelona, I could not stop thinking about them. Like the ones I had in Barcelona, these were simply grilled with sea salt. The prawn was sweet and fresh but not as fresh as the ones in Barcelona as the meat was not as firm. Still one of the better prawns in Singapore though! For gamba carabineros, you MUST eat the brain juice! According to the chef in Barcelona, that is the best part of the prawn and the reason why gamba carabineros are so highly prized. Do not worry though, for the juice is really sweet.Handmade mochi with peanut and green tea powderThe mochi was extremely soft and chewy, sweet but not cloying. I preferred dipping it into the green tea powder for a slight bitterness.Milk pudding with red beansThis dessert was disappointing. While the pudding was smooth, it lacked taste and the red beans were too dry to help. This left an unpleasant taste and texture in our mouth.SummaryCost: ~$580 for 2 people, with 4 alcoholic drinksFood: Excellent steak! You have to order the A5!!!Service: Polite but slightly slowAmbience: Romantic, counter seating recommendedDress code: Smart casualWill I recommend it? Definitely!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdrtQOfdHihtseKEgr896w"
  },
  "tHrDmhgP4cDyZznSV5VO7Q": {
    "date": "10/26/2018",
    "text": "A little pricey on the food. I went there for omakase. The food was just excellent. From the appetizers to the main course. everything was just perfect",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSIHzvUKXiCtPBxywY7Xsg"
  },
  "lNlOkatO_7MbB7zDL0yomg": {
    "date": "6/19/2018",
    "text": "Great set lunch deal. Walked out belly full. Wagyu steak was good. Though a couple of slices were a tad sinewy. But the rice below was so good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RjgiLmWbZqADsZQP94X9gg",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RjgiLmWbZqADsZQP94X9gg/o.jpg"
      },
      {
        "img_id": "ETeb7nW3SLx25TpC8MAOxQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ETeb7nW3SLx25TpC8MAOxQ/o.jpg"
      },
      {
        "img_id": "Sy9qjtpZP8AVfFPqy__nsQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sy9qjtpZP8AVfFPqy__nsQ/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "wUuSYc7Y87qpLWIx5fbhWA": {
    "date": "10/14/2018",
    "text": "You should only come here if you love, and are ready to pay through the nose for Japanese wagyu beef, especially Kobe. Because the non-beef items (tofu skin apetizer at $35++, or sushi/sashimi, etc) are several levels below what you can get at top sushi restaurants (eg. Shinjiis, Hashida, Ashino, Ki-sho, Kimura, Waku-ghin, etc).    More importantly, the level of service is poor fir such a premium outlet. We did not experience rude or lying service as described by certain reviewers. The staff (all non-Japanese) are quite polite, but here you have to ask for everything (eg. refills), whereas the Japanese staff at the aforementioned restaurants not only anticipate your needs, they even replace your tea or iced water with fresh cups/glasses. There is little merit in sitting at the counter, because the chefs here don't smile or talk to clients at all! Even the excellent beef is not given proper treatment: it is cold after a few minutes, because it's not served on a (non-cooking) hot plate; it should be served with sea salt on the side to help enhance the taste of the beef. The premium donburi is very good, although the caviar is not first-quality, it may even be just fish roe! The huge electric meat cutting machine in the middle of the main dining room is truly characteristic of the whole place: functional but lacks class! It's also quite conceited and nouveau-riche of them to insist on a dress code, when you can wear shorts to Shinjii or Hashida!!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Yes4jUUOeqHc1gPhW92YQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-Yes4jUUOeqHc1gPhW92YQ/o.jpg"
      },
      {
        "img_id": "QXxl2wWEP0-gapWMxyMOAQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QXxl2wWEP0-gapWMxyMOAQ/o.jpg"
      },
      {
        "img_id": "V692ErP3EfhN5mjKUBdkwg",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V692ErP3EfhN5mjKUBdkwg/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "-giF56PVyhvYW9Cr21gU2A": {
    "date": "4/4/2018",
    "text": "Great lunch spot. Just order one of the two waygu dons and that is more than enough food to satisfy a wagyu don craving.Love sitting at the bar and watching the chef book your food on the grill.Unfortunately I got suckered by the waiter into ordering a few sides because he said the waygu don is a small portion (it was more than enough). So ended up wasting untouched mushrooms and shishito peppers.Prices are as crazy as they've been since I started coming here some 2 years ago. Don't order sushi here even though they call is high quality. My orders of king salmon and large scallop were both just awful.Location is very awkward, attached to a general hospital. You have patients coming out in wheelchairs attached to an ivy drop and here we come out of an Mercedes Uber to eat at a steakhouse.  Definitely worth checking out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "RP7UeImUuZi_31S95xmyuQ": {
    "date": "7/4/2017",
    "text": "Really good food, despite the odd location at a medical centre. Had the wagyu donburi set - beef was really nicely seared but juicy on the inside, onsen egg was perfectly cooked, the black truffle was a nice touch. Service was friendly and efficient. Make a reservation, as it's pretty full for lunch. Only taking a star off for the location and the prices.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "sj1-b3Bx9zErTkdN0mkGDA": {
    "date": "3/19/2016",
    "text": "The fois nigiri is simply my favorite bite of food at Uchi, and perhaps in the world, so when I saw fois donburi on the menu at the Fat Cow I knew where I was going to eat. I was only in Singapore for 2 days, and they are closed on Sunday, so Monday lunch was my only opportunity. Thankfully they had the fois donburi as a lunch set item. My hotel is right around the corner, so for me this was a convenient location, but it's about 10-15 mins away from the CBD. Singapore isn't very big and I was actually coming from the CBD doing touristy things, so I can assure you it's worth the $7 cab ride (even less in USD). This restaurant is oddly located in a medical center, so don't worry about the heart arrack options, you're in good hands with Singapore's healthcare system.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "B7M3j9el_kkmgzufvoPj5Q",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Fois and wagyu over rice. I'm going to die happy here.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B7M3j9el_kkmgzufvoPj5Q/o.jpg"
      },
      {
        "img_id": "6w_OFXQMivtDxmivShPNdQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. There were two pieces of madai (sea bream) but I ates it (one of it).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6w_OFXQMivtDxmivShPNdQ/o.jpg"
      },
      {
        "img_id": "8NkfOiMk1knD85QEvd07Mg",
        "caption": "Photo of Fat Cow - Singapore, Singapore. My appetizers in the lunch set: salad, miso, chawanmushi (which I've never tried before but wanted to!). Delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8NkfOiMk1knD85QEvd07Mg/o.jpg"
      }
    ],
    "user_id": "rBJG010ohqwLY6PN6EO1Zg"
  },
  "rsTPcnn9mgBWhPY-nmCA5Q": {
    "date": "3/18/2018",
    "text": "The standard of the food here dropped tremendously from the last time I've been here. I usually enjoy my steak w. a tinge of salt and that will be perfect. But the steak here is not as good as I remembered. The taste was blend and dissatisfying; I had to drown it in the ginger sauce to give it a taste.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jd4LuJ2nCNBMayehLhhL4w"
  },
  "o3z99VTHjofUc61J0y_mWg": {
    "date": "1/6/2016",
    "text": "Fat cow is definitely a place to try. The place may be a bit difficult locate (ok at least it was for me because I was not acquainted with Camden Medical center before that), but it was worth the long walk (we walked from Ion - took about 15min). The place was pretty packed when we went at 1300hrs for lunch, and because we didn't make reservations, we were asked to come back at 1400hrs (SO, DO CALL IN BEFORE DROPPING BY!). We both had the set lunch (ranges from about $35-$50), which is quite reasonable for such a pricy place. It comes with soup, chowaimushi, salad, and the entrée. Let's just say that I experience heaven when I first ate the wagyu don. The meat was nice and tender, and I love the sauce on the rice so much I ate everything - that's a big deal because I'm not a great fan of rice!I was also pleased to see that they had an extensive selection of Umeshu. On the rocks is the best way to go! :)",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "kOsPwl1WNf6viCM6iFaImw",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kOsPwl1WNf6viCM6iFaImw/o.jpg"
      },
      {
        "img_id": "VpWw01ymfOChCIF09jKfHw",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VpWw01ymfOChCIF09jKfHw/o.jpg"
      }
    ],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "IcGYb-5A6HpniGgiKqfLvw": {
    "date": "1/24/2018",
    "text": "Very good in food, service, environment. Not difficult to make reservation. The only thing makes me rate it only 4 stars is not professional in details. The A5 beef is served in low temperature, which impacts the overall taste. Not very impressive, but good enough!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZcIHfYcpV4pEQ624Xa-SA"
  },
  "s--0Ws-h_RcMcw-cEDtpWA": {
    "date": "12/28/2017",
    "text": "Last time this is my favorit place to have lunch, donburi  rice is nice. The beef so tender n juicy, foigrass so nice ,but I feel nowadays the quality of taste abit different.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C4prVH__uKmZ55yTlBoenA"
  },
  "oKJJ76ySq0RxwPc5nbwrSA": {
    "date": "5/24/2016",
    "text": "Extremely nice restaurant. The steak was devine!!!!! The prices are steep but worth it if you are a true meat lover. Nice decor & ambiance.Agree its a bit difficult to locate if you are not familiar with the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yCh8JCjMn0DMRBi-RcVXMQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yCh8JCjMn0DMRBi-RcVXMQ/o.jpg"
      }
    ],
    "user_id": "MbyhVYGv2YHV5b92kzuIFg"
  },
  "QwDIqdO87g-imgqUSzUaxA": {
    "date": "4/8/2015",
    "text": "Before I walked into Fat Cow, I was expecting a very small portion with huge prices. This was far from the truth. They actually had many cheaper options on the menu and they are JUST as good as the more expensive options.\"Then what sets them apart?\", you say?Well... you get EXACTLY what you pay for -  you can order a whole steak... with a side of that delicious japanese rice with egg or you can spend 35 -40ish with cubed wagyu with rice and an egg in a claypot. BOTH were good!Down here.. you can still decide if you wanna splash out the cash or still have a very decent meal at a decent price.I've heard tht this was a place for beef so of course I went for the 40 day aged wagyu with a side of rice, onsen egg and ordered m'self some foie gras! It was my birthday weekend anyways! :)My friends ordered the claypot beef rice thingie and another had the wagyu steak and a side of beef tartar. Both very yummy indeed!Being a major beef lover, I'm the kind that either hardly eats any beef if it isn't good but if I DO have a beef craving, i'm going to make sure its a good cut and mostly costs over $40 anyways.You can be sure I'll be putting this little gem in my pocket of \"places-to-go-for-good-beef\"!BTW... I heard the lunch specials here are very affordable and worth it! Those who have that extra free time or don't have to work like the rest of us, well don't say I didn't mention it! You can thank me later! :)4.8 STARS",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9dyNjKRUbQpIMcWzUWlQQw",
        "caption": "Photo of Fat Cow - Singapore, Singapore. A4 Japanese Ohmi Ribeye! The star of the show!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9dyNjKRUbQpIMcWzUWlQQw/o.jpg"
      },
      {
        "img_id": "B9o593Wgfaf0IXu_nZ3pVg",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Salad given from the lunch set",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B9o593Wgfaf0IXu_nZ3pVg/o.jpg"
      },
      {
        "img_id": "QeYpEyfLNn9eMQR6JkjHbQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Chawanmushi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QeYpEyfLNn9eMQR6JkjHbQ/o.jpg"
      }
    ],
    "user_id": "jq7Pb7s68wi2NDTFEXvwbw"
  },
  "ReLtn0FZPCSTSxKhzKCDVw": {
    "date": "6/19/2015",
    "text": "Foie and wagyu is pretty expensive and its hard to get in NorCal. California banned foie gras for a couple of years and then allow foie lovers to consume this rich protein early 2015. Thanks being said, when I see a restaurant serving two of my top 5 favorite proteins, I'm on a mission to clog my arteries. Ordered the fat foie and wagyu donburi bowl and the truffle sea bream sashimi.The truffle sea bream sashimi was good but not fantastic. They put too much truffle oil and ponzu that overpowers the fish. As for the donburi bowl. I'm happy that they gave a 1:1 foie/wagyu portion but was sad that the wagyu lack the natural beef flavor bc it was season with some garlic soy. The beef was cooked nicely and it passed as a filet.Overall, service was on point but food was mediocre.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RxggJKPRU82mfbbOVKfjoQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Look at the huge foie gras",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RxggJKPRU82mfbbOVKfjoQ/o.jpg"
      }
    ],
    "user_id": "0N9tZWro6ASDxrFy3ioOWQ"
  },
  "Y4jtLal6x9N9YHy_HAfeqg": {
    "date": "12/20/2015",
    "text": "Great place for Japanese-style steaks, shabu-shabu and sukiyaki. The appetizers and desserts are also awesome. If you have the Entertainer application you can get main courses one-for-one which is a great deal.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nd0ax0ue6_RkcO8AcWWwoQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nd0ax0ue6_RkcO8AcWWwoQ/o.jpg"
      }
    ],
    "user_id": "8O6tdyNF4g8haPXrrRDxWg"
  },
  "rG943mb0dTMUupxxRFDdXQ": {
    "date": "11/1/2014",
    "text": "There are great restaurants and there are MEMORABLE restaurants. Fat Cow is one of those memorable restaurants that you will talk about for a very a long time. I brought my wife here for our 2nd year wedding anniversary based on the glowing reviews on yelp.The Food was good, that's an understatement. The Ambience was sexy and dark, that's an understatement. The rice, yes I segregate rice from food because in my world rice reigns supreme, was sublime, that's an understatement.When you come to Fat Cow, there are two dishes you MUST order: the Wagyu steak (pick any grade, they are all out of this world) and the Fat Rice. The Wagyu at Fat Cow unlike any steak I've ever tried. It has the tenderness of a tenderloin yet the juicy taste of Ribeye. However, the pride and joy of Fat Cow is the PHAT Rice. ;-)  Perfectly cooked high grade Japanese rice layered with the oil drippings of the very Wagyu just prepared for you a few minutes prior.  Holy smokes!!!To tell you the truth, I started my dinner with the Fat Cow Donburi - Wagyu Beef with Onsen egg and shiro negi. However, as soon as I saw my wife's Wagyu place across from with the fat rice arriving soon thereafter, I immediately had buyers remorse. I ate my Donburi as I fast can, which was good, but no where near the quality of the Wagyu dish sitting across from me. As soon as I was done, I ordered exactly what my wife ordered and I had no regrets!This dinner was truly special in more ways than one. However, for me to judge Fat Cow purely on its merits, I would consider it among the very best dining experiences I have ever had.  Did I mention we also had Australian Pinot Noir to accompany our fabulous dinner. :-)",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZZ3-YKk1jHS9FzJ8eVaJjA",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Wagyu Steak with PHAT Rice! :D",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZZ3-YKk1jHS9FzJ8eVaJjA/o.jpg"
      },
      {
        "img_id": "b2qnKEp5WKZMNXX3fc_TPg",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Fat Cow Donburi - Wagyu beef with Onsen egg & Shiro Negi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b2qnKEp5WKZMNXX3fc_TPg/o.jpg"
      }
    ],
    "user_id": "anrZv1OM1a2sC_EfZ8mt-Q"
  },
  "UQ0wXVq338DcFXFGEBdX3g": {
    "date": "9/28/2014",
    "text": "Fat Cow, oh Fat Cow, can you please be less delish so that I would not turn into a fat cow myself?The lunch deal is an amazing deal for the budget-conscious. Perfectly Charcoal-grilled wagyu with a perfect onsen egg - mix it all in over Japanese rice and your meal is complete. The set also comes with chawanmushi (not the best I've had, but you are not here for this), a salad, miso soup, and ends with a daily dessert. The day that I was there, it was an amazing honeycomb ice-cream that still has pieces of honeycomb in it. Perfect for the recent hot weather. All these for under s$40.This is only a review for lunch and I can't wait to go for dinner, or another lunch, or another whatever at Fat Cow.Reservation is a must!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "g4DUOqxKLOE2FisxaoIhzg",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Foie gras with wagyu beef don",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g4DUOqxKLOE2FisxaoIhzg/o.jpg"
      },
      {
        "img_id": "7Wd5JuRkZrDV9uA7weqMgw",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Gorgeous bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Wd5JuRkZrDV9uA7weqMgw/o.jpg"
      },
      {
        "img_id": "NyOjxmlXni4iW0N_9EtbBg",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Fat cow donburi - wagyu with onsen egg",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NyOjxmlXni4iW0N_9EtbBg/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "vop9DRNSFo2no1avAXDpJw": {
    "date": "8/19/2014",
    "text": "Wow. Was I impressed. Not only does this restaurant offer A5 wgayu from Japan and beef bowls, they also serve delicious sashimi and sushi.We ordered the set lunch which is a great deal and a lot cheaper than the regular menu.The menu also offers different cuts of cow (hence the name) as well as Australian and Japanese wgayu, American beef, shabu shabu.. etc... The set lunch comes with appetizers- salad, miso soup, and egg custard pudding. All yummy. The egg had shrimp and mushroom in it, and it tastes just like the ones in Japan.Sushi Moriawase, 46Chef's choice of 10 premium sushiI did not expect this to be amazing.. but boy was I wrong. There was toro, salmon, scallops, hamachi, red snapper (last three not sure) and salmon roe. The toro melted in your mouth.. and all the fishes were super tender and fresh. The salmon also melted in your mouth which was unexpected because its salmon... ugh I loved this plate.The Fat Cow Donburi, 38Charcoal grilled wgayu beef with onset egg & shiro negi- wow. for some reason they failed to mention there was truffle on it. like why would you omit that from the menu? Nice surprise, and damn was the meat cooked perfectly and extremely tender and flavorful. Fat Foa-Gura Don, 45Glazed foie gras and grilled wgayu beef over rice. omg. everything about this bowl was perfect. added a poached egg on the side, but it wasn't necessary. The sauce on the meats were already enough and so so good.. and the rice with the sauce was great as well. This bowl was .... perfect. I was already full from the sushi but I couldn't stop eating because it was that good.. Also had red radishes (I think) on the side to go along with it.You would think a restaurant not focusing on any type of food and having all these different types of Japanese food would decrease its quality and taste, but not this one. Everything was top notch and extremely yummy. When I'm back in Singapore, you will most definitely find me here.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "RCMmzQfsOF_FqK7hB3XglQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Appetizers- miso, salad, and egg custard",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RCMmzQfsOF_FqK7hB3XglQ/o.jpg"
      },
      {
        "img_id": "ws75-986K1xLYrfXckXnFA",
        "caption": "Photo of Fat Cow - Singapore, Singapore. The fat cow donburi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ws75-986K1xLYrfXckXnFA/o.jpg"
      },
      {
        "img_id": "MG1MxE1IAN6BXOTHqfzVTQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Fat Foa-gura don",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MG1MxE1IAN6BXOTHqfzVTQ/o.jpg"
      }
    ],
    "user_id": "RkfQX8dSJNzkAAItX326Og"
  },
  "OBVcD9LjOFMvXYmfjCcrxA": {
    "date": "4/22/2015",
    "text": "I'm not on here to talk about how awesome all the cows served in the restaurant (because hands down, everyone knows it's spectacular) but on the side dishes and a drink instead. At first, I ordered the Phat Rice aka Fat Rice, that costs $8 because of all the reviews I read, but oh man, I was hugely disappointed. It's just like regular gohan with a few drops of soy sauce that the restaurant claims to be some legit oil (in fact, it's just like a plain gohan to be honest).I was hugely amazed by the glistening and gorgeous-looking Zosui rice though! I knew it, from the moment I saw it on the menu book that it would be such an incredibly astonishing meal. For those of you who wonder what the heck is Zosui, well, according to an encyclopedia, Zōsui is a Japanese rice soup made from pre-cooked rice and water. BUT! Instead of water, the Zosui in Fat cow is made of AUTHENTIC BEEF AND MUSHROOM BROTH! Can you imagine??! No? Okay, go try it yourself then. :DFor the drinks, my partner and I ordered a light alcohol drink with peach and lychee flavor, on the rock. The alcohol content was just nice for an early dinner, tastes slightly sweeter than Umeshu but I love it. The only disappointing thing was the amount served, just way too little. :(Service and interior wise, it was wonderful!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B9-rqaysVKZdJWWpSypfdA",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B9-rqaysVKZdJWWpSypfdA/o.jpg"
      },
      {
        "img_id": "Qe_jlTxmu9KknBf4tQb2DQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qe_jlTxmu9KknBf4tQb2DQ/o.jpg"
      },
      {
        "img_id": "qO99CPpX50ZyPmCjCmymdQ",
        "caption": "Photo of Fat Cow - Singapore, Singapore. A3",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qO99CPpX50ZyPmCjCmymdQ/o.jpg"
      }
    ],
    "user_id": "xhBeTgxlGon8gd_gTop-Lw"
  },
  "WprFeH_A0V4H3Hgee0cJlA": {
    "date": "12/4/2016",
    "text": "Went on a Saturday while I was in town and enjoyed an amazing set menu meal. I had the Wagyu Beef with a soft egg/ Wagyu Nigiri/ Shishito Peppers/ and a few other appetizers. Absolutely great service and atmosphere. The food was delicious and priced reasonably considering the quality. I went for lunch on a Saturday and I recommend getting a reservation. I'll be back next time I'm in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kmiTq6mSHWCRjdIBnyOP3A"
  },
  "pv-4IjGHUqdq2nofzKKgEA": {
    "date": "12/18/2015",
    "text": "Its hard to find a better experience than this. Food and service were awesome. If you're looking for a japanese inspired steak house, THIS IS IT! Bar none. You gotta try it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yH4h8yYL1TNnwHJ0OH_y8w",
        "caption": "Photo of Fat Cow - Singapore, Singapore. Wagyu donburi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yH4h8yYL1TNnwHJ0OH_y8w/o.jpg"
      }
    ],
    "user_id": "OD9-f-Ov_0v3UgKoGUZxXg"
  }
}