{
  "Nd-akJG2SxyRowi97s81Qw": {
    "date": "12/18/2016",
    "text": "Searching for good Vietnamese food in Singapore has always been somewhat of an ordeal. For whatever reason, though popular, it's just not the same here. Until now. Either I've lowered my expectations, or this is possibly the closest I've experienced to Vietnamese street food on this little island. Sure it's not 100% the same, but the banh xeo and banh choen comes really close. Of course the first big difference you notice will be the price difference from street food in Hanoi. About 40x difference by my estimate. But hey, who's counting? For once we have close to decent Vietnamese in Singapore. That's all that matters.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dQ3Grw7L_nFcyAhw8RVOjQ",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Ok, take heed if you try the yellow one on the left.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dQ3Grw7L_nFcyAhw8RVOjQ/o.jpg"
      },
      {
        "img_id": "DiZ-YHvZJxgDfZq889r2oQ",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Bia!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DiZ-YHvZJxgDfZq889r2oQ/o.jpg"
      }
    ],
    "user_id": "3KYixk4HwDBFFBwws__tkw"
  },
  "anHA_Hqn8FV7UAnhgYF8RA": {
    "date": "12/29/2015",
    "text": "The restaurant was pretty empty for a weekend lunch time. Although it was past 11am, the staff was still outside promoting breakfast set. We decided to dine here as the restaurant allowed us to use the Entertainer mobile application 1 for 1 main course on quite a number of choices from hotpot to noodle soup dishes to rice dishes to stir fried noodle dishes.Banh cuon nhan thit ($3.50++/ 2 rolls)Minced pork & mushrooms steamed rice crepe rollsThe dish was served with a sweet tangy sauce. The skin of the rice roll was quite thin and smooth. The dish was quite yummy.Com suon nuong ($12.90++)Grilled pork chop rice with salted egg puddingThe pork chop was quite tender and flavourful, although it had a rather dry look. The egg pudding was actually minced meat with salted egg in it.Pho xao ga ($12.90++)Stir fried pho noodles with chickenThe noodles was quite smooth although it looked quite thick. The sauce was rich and flavourful. Tra xa ($4.50++)Vietnamese Hot Lemongrass TeaQuite a refreshing drink to have during such a hot weather.Overall the food was not bad. Service was not bad too. Cutlery were cleared smoothly. Total bill was $29.90.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wnLb2RqmG48_da9c2cwuTQ",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Tra xa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wnLb2RqmG48_da9c2cwuTQ/o.jpg"
      },
      {
        "img_id": "8ltMyEktwri-ci-RjUHcKA",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Pho xao ga",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8ltMyEktwri-ci-RjUHcKA/o.jpg"
      },
      {
        "img_id": "DOLXLLSNTRd8yadNMpkOVw",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Banh cuon nhan thit",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DOLXLLSNTRd8yadNMpkOVw/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "eP4ZvxwS9HKixElQ56E77Q": {
    "date": "10/8/2015",
    "text": "Was my first time having a set lunch. Priced competitively, you can simply add $1 that gets you a starter and a drink (only jasmine tea). I ordered the fried fish noodle soup, which came with 2 pieces each of fried fish, fried fish cake, fish balls, tomato wedges and 1 Yong tau Foo chili. The broth was sweet and sour and light. The bit of dill and mint added a lot of flavor, lifting the dish to another level. I enjoyed the dish :)Starter was the mango salad with caramelized dried shrimp. Was average as far as a mango salad goes.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JgiK3m-7TqFLlSCByAG1Xg",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Mango salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JgiK3m-7TqFLlSCByAG1Xg/o.jpg"
      },
      {
        "img_id": "MPRldYriXbAeKU1bvjVHGQ",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Fried fish noodle soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MPRldYriXbAeKU1bvjVHGQ/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "yGtpv5asavZGo2rnfqPSEg": {
    "date": "2/20/2016",
    "text": "This is a nice place for Vietnamese food inside the star vista mall. It's ambience is quiet and peaceful. Lots of vegetarian options! I ordered the m12 - vegetable and tofu noodles.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M7qNcHG5g7Ct1rwH22iIvg",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M7qNcHG5g7Ct1rwH22iIvg/o.jpg"
      },
      {
        "img_id": "IFNwJ2E2TUnA5W2KME-sRA",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IFNwJ2E2TUnA5W2KME-sRA/o.jpg"
      },
      {
        "img_id": "ddoIqHlJEUdD9PllepI2Og",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ddoIqHlJEUdD9PllepI2Og/o.jpg"
      }
    ],
    "user_id": "RgJ_nkjVYUKzCr47qJgSSw"
  },
  "QJIc7KoCNxSfk3Z0pE-OGA": {
    "date": "10/30/2016",
    "text": "Brilliant concept and very flavorful as well. The banh mi is overpriced, but the wraps were decently priced. Definitely hit the spot when I was craving authentic Vietnamese flavors. My favorite Vietnamese dish is wrapping my own rolls using rice paper, and I'm glad Wrap & Roll offers just that in affordable, individualized portions.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyqnCAQsARyayfkl0dSNKg"
  },
  "6AjuKmidHpBAH5VWV7vRBA": {
    "date": "4/16/2016",
    "text": "Hehe I love this place. I had the tofu and mushroom banh mi ($6.90) which is basically a baguette sandwich thingy and I really enjoyed it. I added on a cup of \"authentic Vietnamese coffee) for an additional ($2.70) and it came in a really cute coffee dripper - not sure if that's what it's called. We also had the vegetarian hot pot. It was a huge portion loaded with lots of tofu, mushroom and veggies. The soup was sweet and I'm not entirely sure if I was a fan of the sweet soup. AhahaOverall, I really enjoyed my lunch here. The atmosphere was very relaxed and the staff were extremely friendly. Definitely will return. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zQ5cT42S4mD5eJia95pI1Q",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Vegetarian tofu and mushroom banh mi ($6.90)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zQ5cT42S4mD5eJia95pI1Q/o.jpg"
      },
      {
        "img_id": "tTH1STJdrwqcbbfVuCHO9g",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Authentic Vietnamese coffee in the coffee dripper - is that what's it's called?? Ahaha",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tTH1STJdrwqcbbfVuCHO9g/o.jpg"
      },
      {
        "img_id": "hGlykjsLAFRrmXtko3UqQw",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Vegetarian hot pot - soup looks spicy but it wasn't",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hGlykjsLAFRrmXtko3UqQw/o.jpg"
      }
    ],
    "user_id": "kYplHDg9iYqLOU2-NLsNow"
  },
  "HyUHy8XteDJMtZ3B5KgFrA": {
    "date": "6/21/2014",
    "text": "When there for lunch during office hours.We had the lunch promotions and its value for money. The promo include 1 starter 1 meal and 1 drink and its worth the money spend.The rice noodle is good and the grilled pork chop rice is nice. Although its a promotion but they aren't stingy with the portion served. The service crew explained and introduce us the recommended dish and we placed our order.The dining experience was good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Odh2vKn9Yw0x81tss1EQog",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Stir Fried 'Pho' Noodles with Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Odh2vKn9Yw0x81tss1EQog/o.jpg"
      },
      {
        "img_id": "YiE4-_AydvIUR5Qugple1A",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Vietnamese Vegetarian Samosa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YiE4-_AydvIUR5Qugple1A/o.jpg"
      },
      {
        "img_id": "6se-n8j2nQpA4TuASb8v4g",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Grilled Pork Chop Rice with Salted Egg Pudding",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6se-n8j2nQpA4TuASb8v4g/o.jpg"
      }
    ],
    "user_id": "UwWtpjalT2xlJyglRRITug"
  },
  "Wn8MV4k89MZJ8a6KE-Q2CQ": {
    "date": "1/9/2014",
    "text": "Wrap & Roll is a restaurant chain from Ho Chi Minh started in 2006. The lens thru which I present this review is filtered and somewhat biased as I love Vietnamese food. Rice paper rolls, fresh herbs and vegetables and fish sauce. Yum!Love the rice vermicelli bowls here. Grilled pork and deep fried spring rolls is the noodle bowl I gravitate to. The combination of mint leaves, fresh cucumbers and bean sprouts and the crunch of the spring roll, mixed with a morsel of chargrilled pork is simply divine. The sweet and salty fish sauce only serve to further enhance the dish!Other dishes I've had before are their roll-it-yourself dishes which showcase the diversity of cuisine from the different regions in Vietnam. Order the cà phê sa đá (Vietnamese ice coffee with milk). This is the traditional drip coffee that totally slows down time for you as you wait for the mixture to come together. Can't rush it unless you want coffee grinds in your beverage. Intense coffee flavors, sweetened with condensed milk, iced!! Recommended to get your Vietnamese cuisine fix.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EbimapNKsFwRpJh9EBx75A",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Tadaa!! ca phe sa a",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EbimapNKsFwRpJh9EBx75A/o.jpg"
      },
      {
        "img_id": "5-cPxFAt66HLjmQoMvz7cg",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Time slows as you watch the coffee drip..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5-cPxFAt66HLjmQoMvz7cg/o.jpg"
      },
      {
        "img_id": "Jc7NAJ00sFbhQIMtv7YZvQ",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Rice vermicelli with grilled pork & deep fried spring roll. Spot the fish sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jc7NAJ00sFbhQIMtv7YZvQ/o.jpg"
      }
    ],
    "user_id": "c7zuaxYNWJ8vKizU3f6JfQ"
  },
  "VJ4VpFPs3rXN5rxQhAO7MA": {
    "date": "5/1/2014",
    "text": "Pretty good stuff. We went to the ION Orchard outlet. I would say their name is deceptive found their menu to be fairly comprehensive and different from the other Vietnamese joints like NamNam, which was good allowed us to explore some new dishes.Two of us had two starters and two mains all of what we had was good. Tad pricey for  a hole in the wall joint but perhaps bcoz it was ION orchard!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckwnqV51jh5cmcyAYVTU2A"
  },
  "QLpH5-jPx2hTUeIfUv84jQ": {
    "date": "5/9/2017",
    "text": "The sign outside the restaurant got my attention: Epicurean Star Award, Singapore 2015, Winner.  I went in, and order the Fried Fish Noodle Soup.  There was a note of \"Lower Calories\".  When it came, I knew why.  It was the stingiest bowl of noodles I've ever been served, at SGD13.95 or SGD$16.36 (10% service and 7% Tax)!  Half a cup of rice vermicelli, two pieces each of fried fish, fish balls, fish cake and one red chili stuffed with fish paste.  All small, dried up and hard.  The soup broth was gray looking and the tablespoon of beansprouts, three leaf sprig of basil, two thin wedges of tomato, and two pieces of green onion didn't spruce up the look.  The taste although not awful was unimpressive with the high price tag.  The service was pleasant and the cashier took my feedback with a smile.  I hope that they get the 10% service charge.  Maybe not, because there was also a tip jar.  I was told that people liked the rolls.  My view is that if you can't get any dish right, it should be off the menu.  This one definitely should be dumped. Although its \"buyer beware\" in any purchase, my experience of Vietnamese pho has been that its sumptuous, colorful and delicious.  This experience was a  sad, grey, stingy and expensive one.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GfgUbo10R7cWvXq4QPoemA"
  },
  "euMxN697N2ebqxTFPyaJTQ": {
    "date": "9/15/2013",
    "text": "I'm a vegetarian so I tend to gravitate to places that offer at least some vegetarian dishes. I definitely found some in this place. I had the vegetarian samosas and the vegetarian spring rolls. However, next time I will try to see if they can just omit the animal products from some of their dishes to try the others out. However, this place is a bit expensive. Especially after coming back from Vietnam and seeing the price difference 0_0",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "axm0WMHfJsYY5VpYunxe9w",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Vietnamese samosa and fresh coconut water.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/axm0WMHfJsYY5VpYunxe9w/o.jpg"
      }
    ],
    "user_id": "FKWeca2cwUkxJTgW_Tj1nA"
  },
  "dmvhwPqiz4D9YXxiQJES_A": {
    "date": "2/24/2013",
    "text": "conquering all e eateries at star vista, one day at a time. :) today ive conquered wrap and roll! i left this place with disappointment but giving it a 3 stars for e staff's service and appetizers which is not too bad. e wait staff was helpful and gave a brief intro on how to eat when e dishes came.1. green mango salad w caralmelized dried shrimp (goi xoai tom kho)  - this one has a burst of flavours! sour, tangy, sweet, spicy. love it. it also came w some crackers placed at e side on e same plate. **advice: take e crackers out and put it on a side plate else it will become soggy and wet from e salad dressing.2. vietnamese fish noodle soup (bun ca) -  this seems more like yong tau hoo soup to me. it came w a few slices of fried fish which is so dry, fish cakes (super hard) and a chilli pepper stuffed w fish paste. it just didnt work for me.3. fresh spring rolls w prawns & pork (goi cuon) - e dip is e saving grace. made e spring rolls so yummy. dip was so good i started dipping everything in it since e rest of e dishes were meh.4. e royal beef noodle soup (bun bo hue) - thin slices of beef shank which is tender and a huge pig's trotter in e soup. e trotter is all bones and e meat was tough and dry. i didnt even finish e bowl and wait staff had to ask me if e food was okay. thats how unsatisfying e meal was. if i do come back here again, it will prob be for their appetizers.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Puelp7v21AQKxGtpAsG-4g",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. beef shank and pig trotter noodle soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Puelp7v21AQKxGtpAsG-4g/o.jpg"
      },
      {
        "img_id": "hPxyH0WzhR3q7Qd_LTu-Xw",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. fish soup vermicelli",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hPxyH0WzhR3q7Qd_LTu-Xw/o.jpg"
      },
      {
        "img_id": "Q2TvijzJ36bXV4Essw9RDA",
        "caption": "Photo of Wrap & Roll - Singapore, Singapore. Green mango salad with caramelised shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q2TvijzJ36bXV4Essw9RDA/o.jpg"
      }
    ],
    "user_id": "QzS8sFqwFrOmxSZ-bThDmA"
  },
  "LbUKuqkGhgFk6qgvMqfUaQ": {
    "date": "3/14/2016",
    "text": "Terrible. The food was sub-par at best, and service was atrocious. They tried to bring the appetizer to us 40 minutes after we ordered. We asked for water 3 times before they brought anything. Each plate came out at different times. So many better options out there in SG for Vietnamese food.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OmPIqymOgCmwveuOzQLN-g"
  },
  "hs6yz3c2ASFslPqBKLo-DQ": {
    "date": "10/28/2012",
    "text": "We went here for lunch.  Their menu is mostly focused on rolls and a couple of noodle dishes, so their menu is very appetizer heavy. We had this huge egg-pan-fried roll that was very filling ($15), and our own noodle dishes. (The standard rice noodle with meat and fish sauce.)  So we ended up paying $25 each, which is a little pricey for Vietnamese food. I'm not sure why Vietnamese food is so expensive in Singapore, when it's rice noodles which is like $3 in a hawker stall. Hence the minus 1 star.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uuz_IsaZ-4jIPn-ay1oAg"
  }
}