{
  "EAFy4bpGByV1ziJx8x-xGg": {
    "date": "9/3/2018",
    "text": "Sometimes a restaurant provides an experience in addition to good food. The venue is beautiful - classic Peranakan furniture and aesthetics, with high quality service. Our waiter proudly described visits by Blumenthal and Bourdain. True Blue is culturally special, and a wonderful follow on from a tour of the Peranakan Museum next door.The food, though, is not mind blowing. The banana leaf salad was refreshing, and the Ayam Buah was rich and delicious. The Tamarind Prawns were not stunning, and the desserts were decent.Would I return? Absolutely. True Blue is a wonderful experience, and worth cherishing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "85j9ywN6uAAZwV2nSu-ZHA",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/85j9ywN6uAAZwV2nSu-ZHA/o.jpg"
      },
      {
        "img_id": "JukOrGLkQLDPZ9SrPNom4Q",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JukOrGLkQLDPZ9SrPNom4Q/o.jpg"
      },
      {
        "img_id": "bi54_pnR0cRdj8isgMFDJw",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bi54_pnR0cRdj8isgMFDJw/o.jpg"
      }
    ],
    "user_id": "4-S7_R9du3GsIT7AwAv9ww"
  },
  "Or9dU2PPlAtDObMdL3f1IQ": {
    "date": "11/13/2018",
    "text": "I don't understand why Yelp seems to underrate this excellent restaurant. I had a terrific dinner with great service and am eager to go back. To be fair, I was there early in the evening -- perhaps it's different when the place more crowded. But the chicken with black nut and chili prawn were great as was the service.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zfe50_oLw8bUQ-EQcTYVWA"
  },
  "5niZR7mI3txZRwYy9x15ug": {
    "date": "6/11/2018",
    "text": "Will not come back again. Over-priced for low standard peranakan food. Nice setting with some peranakan decorations. The Peranakan Museum next door is a must visit. Go somewhere else for real good peranakan food.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbmV7dfi3KtiMvRVmrL1-w"
  },
  "veJCrwAocmez-im6bnTZbA": {
    "date": "2/1/2018",
    "text": "Tried egg wrap, delicious, had a crunch and fish sauce flavor. Very interesting and tasty. Wish I tried more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S3uVvz9rMC56QEYwxjUFFQ"
  },
  "YhAD1qhkubAqLY8gBF73sg": {
    "date": "10/21/2016",
    "text": "A beautiful restaurant transformed from a 100-year old mansion. The blue wall and old-time decor conjured up the fondest of fin de siècle.The food tasted quite strange and salty. It may be the reason that taste is acquired and my palate was not yet cultivated. The much recommended stewed chicken with black nuts looked dark and felt like Chinese medicine. The cured black nuts were not nutty and yet salty and bitter.Spicy banana blossom salad: refreshing and crispy. They used the flower of bananas to make the salad, and therefore blossom in the title.Crab and chicken meat soup: the meatball was not chewy and the meat was hard and starchy. Pass.Rendang beef: lack of the rendang flavor and the meat was a bit too lean.The only highlight the night was a cabbage stew with mushroom and black fungus. And of course, the fresh durian- I got a dollop of it as a side. One of my friends had to step out while I was eating the stinky fruit, because he could not stand the smell. Haha.. people are so different ;)",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GRYCZNVb2NnvKsGTdHOYHA",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GRYCZNVb2NnvKsGTdHOYHA/o.jpg"
      },
      {
        "img_id": "2OlMhb4VZzS_8iQJ3yCifQ",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2OlMhb4VZzS_8iQJ3yCifQ/o.jpg"
      },
      {
        "img_id": "Byuo8mpkVxO-q9rpHXj5dQ",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Byuo8mpkVxO-q9rpHXj5dQ/o.jpg"
      }
    ],
    "user_id": "PPt9-7v3IcseChyw_RpTQQ"
  },
  "mksgKScPEG1euDYtC0mGlA": {
    "date": "9/23/2017",
    "text": "During our trip to Singapore last week, our friend who lives there recommended this restaurant if we wanted to try local (Peranakan) cuisine. My wife, her sister and husband and I went there for lunch. We loved the food and great service. We did not know much about Peranakan cuisine. So, we asked the restaurant staff to recommend what we should eat. Everything was fantastic!! The salad, soup, chicken with nuts (incredible), prawns, etc.If you are in Singapore, we highly recommend this restaurant. The exterior and interior are like a museum. Beautiful!! Don't rush it. Enjoy the food and atmosphere. Then go to the Peranakan Museum afterwards or before if you have time. You will get a better sense of the food's origin.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Y2SOuTnEP4c4pLFGUOBTA"
  },
  "zSxHi4Ew_5ndEUrEzb-74A": {
    "date": "6/10/2015",
    "text": "Unique Peranakan food!  True Blue is in a great old (100 year old) building.  It has an old Singapore feel.  Very friendly staff, great food, and a bit spicey.  Make sure to ask the staff when ordering.  They do a great job sterring you to the best dishes.  Worth coming back!Tip: ask the staff about the history and decorations and furnature.  They all are part of what old Singapore is about.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1k4D2D_cN3rkLFEMR4JoCQ",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1k4D2D_cN3rkLFEMR4JoCQ/o.jpg"
      },
      {
        "img_id": "upVEml8YnZ3owm_cFjfN9Q",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/upVEml8YnZ3owm_cFjfN9Q/o.jpg"
      }
    ],
    "user_id": "29RmaBZVzOjtgALs-hz4Ug"
  },
  "g1He7noZISNLNvd9OqjaDw": {
    "date": "3/9/2015",
    "text": "The best food i have ever had in Singapore. They charge you for everything but whatever. The service is diligent. Charming place with great atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mZj1Ae6dmrqjv6Ct1q4A8w",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore. The Lamp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mZj1Ae6dmrqjv6Ct1q4A8w/o.jpg"
      }
    ],
    "user_id": "KuGQIxKfGiHLNRuWLuPpXA"
  },
  "79mD6W5u-q0ETk9Wzymfbg": {
    "date": "9/8/2015",
    "text": "This is a very unique restaurant with multi blended ethnic foods coming together. the menu is not overwhelming so you can take your time enjoy several things. Poisonous nuts when cooked properly they're not poisonous.Great food scene in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 5
    },
    "photos": [],
    "user_id": "MG4rRcQ1xUaAJ9iE5tnBCA"
  },
  "i2Brg2qpEpKrjxfrUQfQ_A": {
    "date": "9/30/2012",
    "text": "First, I can not write this review without considering another review that I need to compose.  That is for Blue Ginger, another Peranakan restaurant I recently visited.I've eaten at True Blue twice.  While the same exact food was ordered each time, the experience was considerably different.I will start with the consistencies.  This is with the food and ambiance.  Each time, the exact same dishes were ordered.  Each time, the food was simply amazing.The spicy banana flower salad.  I find this dish to be very refreshing and the presentation is quite lovely.  There is a mixture of  sweet, savoury, and spicy that comes together just right.tinyurl.com/9efxpoeThe first time I ever tried Chicken with Buah Keluak (black nut) was at True Blue.  I fell in love with the dish.  The richness of the Buah Keluak is simply amazing.  I've been told it is an acquired taste.  If so, my acquisition skills must be very good.  Because, from my first bite, I just wanted more.  The chicken is cooked perfectly.  It is simply a little pot of goodness.  If I had a complaint it would be that there could be more of it.tinyurl.com/8ehbqj6tinyurl.com/9ms74heThen there is the Tiger Prawns with curry leaves.  What can I say?  They are huge.  They are sweet and delicate.  They are as close to being lobster tail as you can get without being from a lobster.tinyurl.com/9scmpraI think the food at True Blue is very good.The other consistency is the room itself.  It is a beautiful room.  It has charm.  It feels as if you are in someone's home.  The very high ceilings give the room a feeling of space.  You feel like you have stepped back in time.Now, I must note the key inconsistency.The first time, I went with a regular who was introducing me to the restaurant.  The meal was well-paced and relaxed.  Dishes came and dishes went.  The staff was very attentive.  Overalll, it was a very pleasurable meal.The second time, I took a friend to introduce her to the restaurant.   We arrived and we were quickly seated.  Soon after we ordered.  In just a few moments, the food began to arrive.  When I say food, I mean all of it.  It was all brought out at the same time.  There was no pacing.  It was not really a dining experience as much as it was simply eating.  We were finished in 30 minutes.True Blue is not an inexpensive restaurant.  I do not mind paying well for great dining experiences.  But, dining isn't only about the food.  If it was, I would eat every meal at a hawker centre.  When I am paying for an expensive meal, I expect it to feel like a experience.   It is a shame. It was great food served in a great ambiance.  But, it felt like a fast food experience.If my second trip had matched my first one, I would be giving True Blue five stars.  My next trip will determine if they should retain their current four stars.The food is amazing.  The flavors are great.  The presentation is very good.  The room is beautiful.  There just needs to be more attention given to the overall experience.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "grW9U8xvnQKM39orI9T6-g",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore. Chicken with Buah Keluak (black nut) - True Blue - Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/grW9U8xvnQKM39orI9T6-g/o.jpg"
      },
      {
        "img_id": "FfOwrhbdOyFXMHNOiRZWpQ",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore. Prawns with currry leaves - True Blue - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FfOwrhbdOyFXMHNOiRZWpQ/o.jpg"
      },
      {
        "img_id": "--xl-iwlchO4mYkCDlZ5nQ",
        "caption": "Photo of True Blue Cuisine - Singapore, Singapore. Private Dinijng Room - True Blue - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/--xl-iwlchO4mYkCDlZ5nQ/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "51-Qfeunk5OKbIOieaom9w": {
    "date": "9/7/2014",
    "text": "Nice flavor Nonya Food, beautiful decor, very little portion but OVERLY charged! $3 Singapore dollars per person for the rice , I didn't even touch the rice , they charged us $12 because we have 4 people! $4 per person for tea, &28 for a small fried fish! A very small dish pomelo about 100g cover with one table spoon peanuts is $18!Prawn cracker $1 per person ,black nuts chicken $24 , we asked them to add 2 nuts they charged us $4 per two nuts, anyway total $228.34 without wine!You can have this kind of food at other  Pararakan Food for May be 1/2 price or even less .  If you want to try their god be ready for the high payment!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iVZKy70AjMh0iyegs7aEKA"
  },
  "zvz2r3NM-hgz9_BHVn6_7Q": {
    "date": "1/8/2013",
    "text": "This is my all-time favorite Peranakan restaurant in Singapore.  From the moment you spot the storefront it's like a journey back in time.  The beautiful white orchids greet you as you pass through the small door into the entrance way.  There you start to immerse yourself in the gorgeous surrounding of a heritage Peranakan shophouse.  Last night we dined with a couple of friends of my cousin who are in town for business.  Luckily they are adventurous eaters.  They did have trouble finding it but seemed to enjoy the plush surrounds.  We sat in the corner with a full view of the restaurant and the china collection cabinet.  We ordered our favorites: the banana blossom & cucumber salad, sweet potato leaves, okra in candlenut sauce, black nut chicken, fried chicken in Indonesian spices, and beef rending.  The dishes came out of the kitchen at a steady pace.  Rice and tea were refilled plentifully.  I drank so much of the red date & longan tea that I had a mild sugar high mid meal. I cannot speak highly enough of the banana salad.  I have never been able to identify the banana blossom in the dish but the sauce is so good I don't really care what is in it.  I usually polish off the dish myself while people focus their attention elsewhere.  Like hollowing out their black nuts and chicken.  This is another stunning dish here.  The chicken is infused with more of the black nit flavor than other versions of this dish I have tasted.  The beef rending is simply superb.  I don't care for fried chicken but our guests fought over the last piece so it must have been delicious. plates clean the dessert came: pineapple tarts and some mango puree and pomelo for me. I hadn't gotten enough of pomelo from the juice which was amazing.  The pineapple tarts are homemade and you can tell.  Our guests commented that it didn't taste like pineapple at all. Either way, they ate them with delight.  We sat for a long time after the meal in deep conversation about the country.  The atmosphere in this restaurant makes you want to talk about important things.  After holding the table for over two hours we departed.  But it won't be long before I'm back for that salad.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L7zt8jZEE1Xj3ZT2fgO79w"
  },
  "O_b0DONXyUKdM0Rf-FdLGw": {
    "date": "9/8/2012",
    "text": "5-star setting, pity about the foodTrue Blue is possibly the prettiest Nonya matriach in town. Gorgeous artwork such as the beaded slippers are displayed in one of the rooms, while another houses a breathtaking array of lace blouses. The ground floor seating area is the main hall, while a few private rooms upstairs and one on the ground floor are popular for wedding ceremonies and private events.Pity then that the food and service appear indifferent and lacking in soul. Ayam buah keluak was the best dish, while everything else really failed to exhibit depth of flavour. The beef rendang was tough and barely warm when it hit the table, the chap chye watery. Prawns petai style were not fresh and lacked in sambal. Oh and if you want extra sambal, you will have to pay for it. Not surprising then with the small sizes of the dishes that the bill quickly adds up. Desserts were overhyped; the \"best pineapple tart in Singapore\" was mediocre with its dried out jam centre not yielding any moistness.This is a really beautiful restaurant to bring overseas guests, but only the connoisseur will know that there are smaller, more boutique Peranakan restaurants serving far better quality dishes.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUodv8WGv4xo7EabaN3dqQ"
  },
  "Q1OZ0Q24MDVj0uqzcAoSXA": {
    "date": "3/3/2015",
    "text": "Condescending service with really bad service. Staff was rushing us to leave even though it was just 9.30pm and started turning off the lights. Extremely surprising experience given the price point and posh positioning of the restaurant. Food was fantastic though, although I value service above the quality of food. Verdict: Go for it only if you want to enjoy the food and be prepared for nasty service.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bjr6VS2eGb3oAEkdB-a3Tw"
  },
  "3ipjLaJvKTMEyMaAIGrw3g": {
    "date": "7/4/2014",
    "text": "Excellent traditional peranakan cuisine in a beautiful traditional Chinese house setting.  The food is authentic and has all the right variety of selection (the service staffs were helpful and knowledgable about the dishes).  It takes you back to the golden time of an era with photos from the past!  Recommended esp for taking friends to have a peranakan experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKzv6PG0p_lsEDFtwyJepA"
  }
}