{
  "TDAXjZEQRJ9nxszb0I412w": {
    "date": "9/8/2012",
    "text": "This is a pretty good place to get a quick taco. While it's not gourmet or anything, the tacos are pretty satisfying and actually quite authentic. They use corn tortillas and not flour tortillas like many Mexican places in Singapore. They don't load the taco with mozarella cheese so it really isn't the jelat tex mex fare you get most often.I also kind of like the bar concept they have going on. You can watch your sever preparing your taco and it's fuss free and quick. Senor Taco is kind of a strange mix of tacky - Orchard Towers and LCD TVs blasting pop music - and pretty damn satisyfing tacos. Perhaps they could improve on variety but I really won't complain because they offer pretty authentic Mexican tacos in Singapore, where finding Mexican that isn't tex mex is like looking for a needle in a haystack.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9zo-15IyloXhPeO78Myjg"
  },
  "nKowYsYSEDAnluvxirpr3w": {
    "date": "2/16/2013",
    "text": "This is easily my favourite Mexican place in Singapore.  Usually, that would not mean much but the tacos are legit and better than many places in the States and Mexico!  The margaritas and beers are of course CQ priced, but I have to come back here when I am in Singapore.  I am stunned that the guys working here remembered me from my shenanigans when I lived in Singapore.  I love their YouTube video monitor.  They even let me help pick the songs - yes I am the moron who always asks for Dizzee Rascal's Bonkers.  I do not know if they keep playing it to shut me up or to encourage my ridiculosity.  Either way, I love this place.  keep the fiesta going!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gf9n3_0n4AXhPULDRy-eBA"
  },
  "u1xJ-624C1rXVwptkbu3Kw": {
    "date": "4/9/2013",
    "text": "Since moving to Singapore, finding a quality taco has been a real challenge. We finally found this place and are glad we did. The tortillas are delicious and the sauces are fresh with options from medium to super spicy. Our server was friendly and provided great service. The only main drawbacks are the area- being located in Clarke Quay you have to deal with higher than usual prices and the occasional table of obnoxious people. Speaking of tables, ours was really sticky but we were so happy to have found tacos that were close to the level we were used to back home we looked past it. We will continue our search for good quality Mexican food at reasonable prices but will be happy to return there again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VmStr1LtLkl67olwm1JHOQ"
  },
  "nB6D_sT3fux_10pPgrT3ag": {
    "date": "5/17/2013",
    "text": "Solid tacos. You might find something similar 3 for a $1 on the street en el D.F., but you are in Singapore and that is 10,330 miles away (roughly). The fact that these are 4 for $20 SGD is painful, but hey, its also pretty remarkable & amazing when you think about it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9HxQ24U3rfvQCbGHsEQvQ"
  },
  "NGbwkHoEnNfA4vNfULpbkw": {
    "date": "1/4/2014",
    "text": "Awesome only place we had in Asia with actual real tacos! I don't understand bad reviews",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R8lTgvCrnUhI56gXEtb7qQ"
  },
  "SIFQejczzMmMUrkacej7OQ": {
    "date": "5/21/2014",
    "text": "This the best place to eat authentic Mexican food in Singapore.  It's like eating in Mexico.  Specially, tourist must visit this restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Y71EM9s1QpUqBhs9yRYiA"
  },
  "NLdeLYkoE5X5nq75aBR_PQ": {
    "date": "7/15/2010",
    "text": "Señor Taco is an alfresco taqueria located in Clarke Quay. Seating is bar-like, with people perched on high-standing stools along similarly elevated tables. Upon our arrival, one of the chefs came out to take our order, and he told us about the place, including the fact that this is the first taqueria in Asia. I tend to take all such claims with a healthy pinch of salt, but I'll accept that all other Mexican outlets I have come across do tend to sell more than just tacos! Tacos were quite cheap at between $2.50 and $3.50 a taco, with fillings including grilled pork and beef. Quesadillas were also available, and cost between $4.50 and $5, depending on the fillings. I had a grilled pork taco and a beef taco, and that turned out to be too little for me. The tacos could be devoured in three bites! The pork was delicious and the beef was a little on the dry side. So I ended up ordering a vegetarian quesadilla to supplement my order, and the tortilla was nice and soft, and the cheese not too overwhelming. I also had a strawberry magarita ($20) here. You have two options: a double shot or a double double shot of tequila. Yes, that means four shots. I opted for the single double, and that in itself was pretty strong. Thanks, you've successfully added this place! Señor Taco isn't the best place I've ever had Mexican food, but it is very reasonably priced, considering I had a decent meal and drink for about $30. It's not a great place to sit if you're dying from the Singapore heat, but, if you're used to it, it's definitely a more affordable alternative compared to the neighbouring outlets.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vt_lIJ3gqZ_Vm4p2fAqMGA"
  },
  "5z2W6Np0uEf2QV0r78sH9w": {
    "date": "8/28/2012",
    "text": "The food here is affordable, we tried the Tacos al pastor which is pretty delicious. A pretty decent place to find comfort Mexican food, but not spectacular. The seating is outdoors, and has a cheery atmosphere. You have to make your orders at the cashier which is about 2 steps away from the wooden tables and chairs. They have a selection of beers available, and their tequila shots are good. When we were there, there was a promotion for $20 for a jug of long island tea if you use a certain credit card.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "YArD2DdQ7qC-H5LQppaI2Q": {
    "date": "3/19/2013",
    "text": "I'm making it my goal to try every mexican restaurant in singapore. Ive loved mexican food as long as I can remember and really miss the taco trucks in LA.  I was pleasantly surprised after trying this place for the first time and finding some real (as close as youll get in singapore) mexican street tacos. The carnitas and el pastor are great. Their habaneros and cream salsa is also great and reminds me of a great mexican place back in LA. This one  is basically a taco stand with a much more limited menu.  If you want a bigger menu try the chimes or star vista branch.  Its a great spot for some solid food at a reasonable price.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KB9lTP3Tf3xfW2lMEYzdg"
  },
  "q-oWXTej8OUyqyYAZhVOOA": {
    "date": "8/17/2018",
    "text": "Decided to try Senor Taco today. We've tried the Senor Taco on Orchard a couple of years ago and it was pretty good. We ordered our drinks then everyone disappeared. 15 to 20 minutes later a waitress came in and we were told the waitress never ordered our drinks. So we placed our order again. The Chamocelada (michelada with chamoy) was excellent, the chip and guacamole was very good. Unfortunately the tacos were not very good, the chicken taco was way too sweet, the carnitas taco very tender but bland. We're still waiting for our ceviche..",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC32zNsU2XCqqBnCggMN0A"
  },
  "HXf10wsiU2ln-dTvAyoFwA": {
    "date": "12/28/2017",
    "text": "Vacation trip with friends. Came to Clarke Quay late (after 10:00pm). Most food places we tried to go to stopped serving food by now. This place was still serving food though. Def one of the cheaper places around. Food was okay, def wish I had it after drinking.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PJC3I8RP8DgndxNseNTc6Q"
  },
  "eNjqw_HC9uoJoOdV7xX0lA": {
    "date": "6/20/2018",
    "text": "Avoid Avoid Avoid If it were possible to give a place zero stars i would have. We got 4 tacos, a sizzling beef fajita, a corona and a coke zero for a whopping $76ish~ The price cannot be helped especially in the clarke quay area but the food was bland and service was truly unacceptable. Tacos were tasteless and only rescued by their provided range of sauces. Their signature al pastor taco was sparsely filled and the pineapple topping was mildly fizzy- the taste you get when pineapples are on the verge of spoilage. My biggest problem however, was with the fajitas we were served. We were seated next to two men who similarly ordered the sizzling fajitas but the vegetarian version. We then noticed that the waitress had mistakenly served them our plate of fajitas as it had beef on and also that one of the men had distractedly started eating off that plate. Another waiter having noticed the serving error removed the beef plate from the table next to us and proceeded towards the far end of the restaurant to inform the same waitress of her error. The next thing we saw was the very same plate of sizzling beef fajita that was removed from the table next to us then being served to us despite it having already had a bite taken out of it!!!!! When swerved i asked the waitress directly if it was indeed the same plate and she reassured us that it wasn't, but unless the kitchen managed to work some magic in the span of less than a minute or the plate in her hands had telekinetically switched i'm pretty sure we were served the same plate of fajitas wrongly served to, and eaten by, the men next to us which is grossly unhygienic and unacceptable. ‍ This sort of service coupled with bad quality food and overinflated prices makes for a place that doesn't deserve even a star.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "luLLz-VfrvQrH2qvKcSTdQ"
  },
  "yLCRI5eZJMu-9mwIP7Jcvg": {
    "date": "12/30/2017",
    "text": "visited this place for dinner during my trip to Singapore.  First of all the food is highly priced and the portion size is too small. The service was slow and the waiters were not able to explain the menu properly. I ordered the beef tacos which only had two corn tortillas, sliced beef and onions. There was no other seasoning in the taco.  Even after having dinner i still felt hungry.  Wont recommend this place to anyone who is craving mexican food in Clarke Quay, Singapore.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKR_Vt2FxKKX1eJSg0VDjg"
  },
  "9ygb7IDCGgWM12bgeefAIg": {
    "date": "1/24/2016",
    "text": "Better of the two mexican joints I've had in Singapore thus far. The Al Pastor tacos are super tasty, but alas super tiny, and pricey. They are smaller than street tacos in Mexico. Live music at 9:30pm every night though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V7qaBtLyc6OuclSHd-g8bQ",
        "caption": "Photo of Senor Taco - Singapore, Singapore. Al pastor tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V7qaBtLyc6OuclSHd-g8bQ/o.jpg"
      }
    ],
    "user_id": "SlOendilVJwP8GhRoxJX_w"
  },
  "70VTolDB9mod7qT6hVoWZA": {
    "date": "1/13/2017",
    "text": "I ate here on New Year's Eve and I was disappointed with the size of my quesadilla.  My quesadilla was smaller than a taco.  The people need to realize that quesadillas must be big and cover the plate!!!  I paid 8 dollars for something smaller than a taco that I ate in only a few bites.  I feel that the food was way overpriced and they need to consider the very small portions they offer, especially for quesadillas.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n3AmOGewrmiwIvP2qjdHLw",
        "caption": "Photo of Senor Taco - Singapore, Singapore. This was the quesadilla that I ordered that was smaller than a taco.  I was very disappointed.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n3AmOGewrmiwIvP2qjdHLw/o.jpg"
      }
    ],
    "user_id": "4aRVoZBoNr2WOo66wv58OA"
  },
  "R4vfMeYJfSTvBMq7jifVBw": {
    "date": "4/28/2017",
    "text": "I checked this place out when I was overseas playing basketball and it was very good.. They have TVs and it's a waterfront setting a little bit on the pricey side but worth it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDOhAUbPHmx-eTGB6cjixw"
  },
  "AlWvWOo4dOdVc5QuRZ1B4A": {
    "date": "4/21/2014",
    "text": "Finding good tacos in Singapore is akin to searching for laksa in Jacksonville. Hard to find, like trying to locate Bigfoot.Señor Taco dishes up fairly average and authentic (albeit dry)  tacos. They are similar to the average taco you can get on a street corner in CA for a couple of bucks. I tried the tacos al pastor, baja fish tacos, carnitas and caramelo de filete. The corn tortillas are authentic but are a little on the dry side. Same for the marinated pork/chicken. The meat was overcooked and rather dry. However, the sauces are definitely authentic.Perusing the menu, there were also a couple of authentic-looking central Mexican dishes that looked good to try, but I didn't get the opportunity on this visit. I saw enchiladas, sopas, quesadillas. The menu is available on the website.One problem is the atmosphere, where they played mostly outdated 90s and 00s house and pop music at ear-splittingly loud levels even on an empty mid-week night...Quality and taste-wise, the tacos are okay, bordering on meh. But at around S$8/pop, I'll have to find a way to limit my taco cravings and eat something else instead...",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "PaDAKHdjnExCoOvEtGc8AA": {
    "date": "7/10/2015",
    "text": "Take away for this place is - alright.  The corn tortilla is good but not the real deal.  Service was ok accept the waitress was getting impatient to wait and kept pushing for the main.  Actually the real reason I came was to quench the craving for soft taco.  Got to say the most spicy sauce of the 3 provider was a kick :).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iLLxxIr3-X-viDl5j44jNw",
        "caption": "Photo of Senor Taco - Singapore, Singapore. Le Damage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iLLxxIr3-X-viDl5j44jNw/o.jpg"
      },
      {
        "img_id": "JSXfApbAwLyf5H1EWMLLwQ",
        "caption": "Photo of Senor Taco - Singapore, Singapore. Another Anglr",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JSXfApbAwLyf5H1EWMLLwQ/o.jpg"
      },
      {
        "img_id": "0HsFexTS9MyvKv8xlxzSIQ",
        "caption": "Photo of Senor Taco - Singapore, Singapore. Chose the right.  Yes it is very hot but the best",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0HsFexTS9MyvKv8xlxzSIQ/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "tNHcuVV9JbedWWtieZZyww": {
    "date": "6/21/2016",
    "text": "To be clear my review doesn't necessarily reflect the quality of the food - their tacos and quesadillas are quite all right (my favorite is the steak). Unfortunately the prices are a bit high for what it is, both the food and the drinks. Sure their location in Clark Quay is convenient and the live stage along with occasional salsa inside the restaurant make this place fun but my fore mentioned favorite steak taco is $10 for a single taco and overall from my experience you need to spend $40-60 dollars, excluding drinks to get full here. The drinks are also pricy and the jug of margaritas will be $50 or so. Sure the food is good but the value is barely average.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDwwazbzYP7iUjV6DYgyKA"
  },
  "6-j9kf-1ZvywlXFGpIqllw": {
    "date": "11/19/2014",
    "text": "Perfect for people watching, food is average.It's all about the location here. Casual and hip Mexican restaurant at the heart of Clarke Quay. You can also catch the belly dancing show at the Turkish shisha bar next to it during dinner. I found the quality of food and service to be average. Coming from LA I do admit that I set a high bar for Mexican food. We ordered the chips with guacamole (probably the best dish of the meal), tacos (which were not bad but should come in smaller sizes in stead of one single huge tortilla), enchiladas, salad (which I do NOT recommend). Drinks were A-OK :)One thing I have to say about the service: They cleared our plates even when we said no... Which was a huge turn off. It is not like there were people queueing so I just didn't understand the rush.All in all it's probably worth a visit, just one though unless food quality goes up.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xd8dPasNWNiy28rtqksD-g"
  },
  "LAAbPcZ62R2Au_wxtpJYZA": {
    "date": "4/28/2013",
    "text": "If I had to pick one type of food that's been difficult to find here in Singapore, it would be Mexican. In a country where great food from all walks of life is fairly easy to find, my one criticism would be trying to locate a decent Mexican joint with traditional tacos. I had a hunch that Singapore would probably not have many options for Mexican, seeing as the countries are miles apart. I knew after moving from the states that I would have to curb my Mexican cravings, which I've learned to manage since Singapore offers other great varieties of food. At one point though, I hit a wall and needed a taco fix. After searching high and low, I did manage to find a place that I can somewhat rely on now when I need a taco fix. Senor taco in Clark Quay offers decent tacos. Granted, I have had way better in my life, but again, I'm in Singapore and I knew I had to curb my expectations a bit. The beef and pork tacos are nice, and the different hot sauces they offered were quite decent. The service was nothing to brag about, but I wasn't expecting top notch service at a place like this. The only drawback was the loud music they felt they needed to blast. I enjoy my fair share of hip-hop, but I don't think you need to blast it as loud as possible on a Tuesday evening. Also, if you have kids, it might be best not to bring them here as they don't play the \"clean\" versions of these songs. If you don't care that your young ones are exposed to explicit lyrics, then it won't be a problem. The tacos at the Orchard location were actually tastier and the service was great there. They also didn't blast the music to the point where your ears felt like bleeding. The only drawback there is it's right behind Orchard Towers, and well, I don't really need to explain what you'll see there while dining at the location.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PeO6VZp0eu_TyAVNsGdTPg",
        "caption": "Photo of Senor Taco - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PeO6VZp0eu_TyAVNsGdTPg/o.jpg"
      }
    ],
    "user_id": "sg7ckPotdcAeIKf0n3GApg"
  },
  "tmYCZ_njvUqEr7zLdDRqHw": {
    "date": "9/13/2014",
    "text": "Fun place, right in the centre of the crowd. The best part is that they serve REAL tacos made with love. Great stuff",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "aYuE0BCJxeNDkwsxSdPY0g",
        "caption": "Photo of Senor Taco - Singapore, Singapore. Great night at senor taco! Try their Baja tacos for some fresh stuff!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aYuE0BCJxeNDkwsxSdPY0g/o.jpg"
      }
    ],
    "user_id": "aW_2oAi__hqF0US1FXOWsA"
  },
  "pxfpYRJbrAMGrL1JHDN9QA": {
    "date": "4/14/2015",
    "text": "It's interesting to see the range of reviews for Senor Taco and after pending a few hours there and trying 5 different types of tacos, I can see both the good and the bad.  First the good - they have a nice selection of different tacos including a chicharron and chile which was totally awesome.  But the winner was the fish taco - very tasty and meaty, but a little pricey at $11 per taco.  The pork belly was interesting but I would prefer smaller pieces than one slab.  The beef and chicken were smaller but there were at least 2 per order.  Drinks are weak.  The margarita on the rocks was like water.  Stick to a beer,  But come before 7:30 and most drinks are $9.90 which is nice.  The decor is cheesy.  And there is a stage for live music, which thankfully they didnt have on Sunday as the space is quite small and I can only imagine how noisy it would be.  But overall, the food exceeded expectations, the drinks did not.  But given the limited choices in Singapore for Mexican, it's definitely worth stopping by.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "qXu-A5oBwBKSq7-qMj0DgQ": {
    "date": "6/22/2015",
    "text": "If you tried taco and burritos before in US or Mexico then you understand the difference between quality and style. Peoples are friendly and food is so so. You can try with corona beer to remember taste of Texas .",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uU2Qbj1-JVNui_yY_T-aiw"
  },
  "d36iRckyjDl92kIGwkTTgA": {
    "date": "9/15/2015",
    "text": "I'll admit I'm a bit of a taco snob, and this place just doesn't do it for me. It's conveniently located in the middle of Clarke Quay, which is great if you just want a bite to eat while people watching, but if you're seriously in the mood for some good tacos, do yourself a favour and walk 5-10 minutes over to Super Loco over on Robertson Quay.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HRogYuuae1e-Z6EMVQsReg"
  },
  "Zwvl-ljoJOlkKXSvVppfHA": {
    "date": "1/26/2013",
    "text": "Just don't. No matter how drunk, how strong the craving is for mexican, or how cheap the prices look, Do Not Give In.Possibly the worst taco in all of Asia (and there are a lot of crappy mexican joints gunning for that title). Head over to the Senor Taco in Chijmes for a better experience, or pony up some cash for a Lucha Loco speciality. Whatever you do, don't fulfill your dreams of carne asada or carnitas deliciousness at this pit stop for college drunks.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "l7MIIt0YoMVWAKa_QTCYkg"
  },
  "lTnu5re_GfdnZ2_wlr-AyQ": {
    "date": "10/9/2012",
    "text": "Clarke Quay can be very expensive. Sometimes you want something cheap. And if you're drunk, you want something greasy. Senor Taco is open late to satisfy your craving for greasy Mexican. Tacos are authentic -- corn tortillas with meat, extra for cheese. Topped with cilantro and onions. What I like most is they bottles of sauce (chipotle sauce, guacomole sauce, super spicy, etc). Considering that guacamole is very expensive in Singapore, I just drown my tacos in the green guacamole sauce. It's not real guacamole, but it's got the taste.Tacos are $2.50-$3 SGD each, and you can order 1 for a snack or as many as you want.  A cheap way to satisfy the Mexican craving in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uuz_IsaZ-4jIPn-ay1oAg"
  },
  "gBlqV-gAqLLtD-Bfpa-4aw": {
    "date": "9/2/2015",
    "text": "I would only go on Taco Tuesday.  For regular price days - it is VERY overpriced for tacos.  The service was ok.  I ordered a White Tequila (upper quality) and was served Jose Cuervo.  Thank goodness the bar keep took it back.  The tacos were good - for paying %50 off.  Drinks are Singapore standard price, but no happy hours on taco Tuesdays it seems.  Would go again only for %50 tacos - never regular price and not for drinks.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ypyPSJp72A4CNSHe4sXq7w"
  }
}