{
  "oE9j2jiTPQk866FwcD-0lw": {
    "date": "7/25/2018",
    "text": "Favorite coffee shop around here. Cold brew is a must. Great selection of Japanese desserts and main courses as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RhH_Isb5BvKy7CkqfpZlHA",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. ",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RhH_Isb5BvKy7CkqfpZlHA/o.jpg"
      }
    ],
    "user_id": "2jfzN9ZI9p1iPqirHLpa4g"
  },
  "E97hrKpTqtgYF_X0VhX2Jg": {
    "date": "6/26/2018",
    "text": "Just another coffee shop.I've heard stories about Watanabe from my cousin, so I figured, I might as well try it while I'm in Singapore. I may have hyped myself too much, but I found nothing special about this place. The ambiance is rather unpleasant - a bunch of snobs talking about money. But let's talk about the coffee.I'm a huge fan of pour overs, but I found nothing special about theirs. It's literally just normal Brazilian pour over priced atrociously high. I believe I paid $9SG or more for the coffee, which I can seriously make at home. I've Geisha, Blue Mountain, Kopi Luwak and those definitely worth the price. I just can't justify and defend Watanabe.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mbph6TiuJrbCjm2KvbwPcw",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mbph6TiuJrbCjm2KvbwPcw/o.jpg"
      }
    ],
    "user_id": "0j7MhgLbt4zCb-yxSN15iQ"
  },
  "x7uiqNyM5DzFl9fxDOukeg": {
    "date": "7/6/2018",
    "text": "Excellent potato salad croissant. Great ambiance for a romantic date. Yes, it's expensive but it's on swanky Orchard Rd (aka Singapore's answer to Beverly Hills' Rodeo Dr), so what do you expect, mate? I enjoyed the matcha froyo, too. Minus one star for the hojicha latte--very small cup size/portion. Good mocha, but a bit overly sweet, and again on the small side. (July 2018)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UBLConhz_ERuEakKIIh8uQ",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UBLConhz_ERuEakKIIh8uQ/o.jpg"
      },
      {
        "img_id": "L9hE7qaLMoLhB-7U9FsOlQ",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L9hE7qaLMoLhB-7U9FsOlQ/o.jpg"
      }
    ],
    "user_id": "WwTYfD8TysD1isAEhSEOoA"
  },
  "TQrZBNWLvTxmUptSa-tYNQ": {
    "date": "1/27/2018",
    "text": "We had the umi rice, salmon baked rice and wagyu rice.  Dishes came out fine tasted ok and looked ok.  Nothing special but perhaps priced a little high?  Just based on the cost of latte at 7.8 and that is before gst and service charge.  Think be better off to get at starbucks.  Jan 28th '17Pinoy waitress not that great but Kuian i think was her namr was excellent. Back again just because i love the fluffy pancakes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JTuiFj1XGNdAS6ksD-ljxw",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. Coffee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JTuiFj1XGNdAS6ksD-ljxw/o.jpg"
      },
      {
        "img_id": "vj_VGLbBOZFfEUQcrX5Qug",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. Onsen Egg - Not Bad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vj_VGLbBOZFfEUQcrX5Qug/o.jpg"
      },
      {
        "img_id": "DHciIk-GfRygafdfAnY0jQ",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. banana cinammon toast - not bad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DHciIk-GfRygafdfAnY0jQ/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "Ja6djhPGpDbSpTfk-Zgj5Q": {
    "date": "10/16/2016",
    "text": "I walked in without doing much research and proceed to order a Latte. And when i ask how much, the waitress said $8.35 and I thought i heard her wrongly. How much again?It's $8.30, Sir. Not wanting to create too much fuss, I paid anyway and waited 10 mins for my coffee. The restaurant was not even full that time. I am unsure about the food quality, but judging from the price of the coffee alone, I suppose I need to bring some diamonds if i want to eat here. Not coming back.  p/s: coffee was just mediocre or even below average.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "6oNw6-qaQiSVE5teetBq2Q",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6oNw6-qaQiSVE5teetBq2Q/o.jpg"
      },
      {
        "img_id": "2C8V3Cwi6n-gwJ6S6X7b_g",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. cosy interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2C8V3Cwi6n-gwJ6S6X7b_g/o.jpg"
      },
      {
        "img_id": "TXXr3XcyCjxfBIb-CWPobw",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TXXr3XcyCjxfBIb-CWPobw/o.jpg"
      }
    ],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "6UXr2FSuuTZZLgGFVlsKtA": {
    "date": "8/20/2018",
    "text": "The Dutch Style Cold Brew and the Cold Brew Float (includes ice cream) were delicious and really hit the spot during a hot, humid day.  We also had a piece of the Matcha Roll Cake and Red Bean Pancake which were fresh, light, and very flavorful.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "dmq0nRDZBHzj0l9CBVnDsQ"
  },
  "ceerLVuXde1qmRZaOTVOrA": {
    "date": "9/1/2017",
    "text": "3.5 stars at first, but I decided to minus 0.5 star when I looked at the waitresses' face. Lol.. call me mean .... but walking into a cafe/ restaurant on Saturday afternoon, I expected a warm welcome especially when you are not charging $2 for a cup of coffee but in the range of $6 to $9 ... I am not saying that they are rude or what, but they showing blank face, not even smiling. To me, they don't enjoy what they are doing at all. Alright, back to the food. I ordered a premium French toast set, come with a drink (you can choose from the list), it costs $17.90. Not a bad deal at all. The French toast came with blueberry sauce (they have 3 choices mango, blubbery and ... sorry I can't remember), topped with a vanilla ice-cream. It is good, but nothing fantastically impressive. I paired the pancake with hot soy latte. Pretty good. The place is not crowded, good place for friends gathering. And they do serve wines too. I will consider come here again, for the coffee. Cheers!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aH5lXcf6oncHx95el3jStg",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aH5lXcf6oncHx95el3jStg/o.jpg"
      },
      {
        "img_id": "P1JVq8n32HWPeXgh1-05nA",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. Soy latte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P1JVq8n32HWPeXgh1-05nA/o.jpg"
      },
      {
        "img_id": "zraQyhlTV7GfSMWmUIMnkQ",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zraQyhlTV7GfSMWmUIMnkQ/o.jpg"
      }
    ],
    "user_id": "aFXnLTwv-dWdbFC-2b-kdg"
  },
  "eHvXlzqsQeH1s-eig0aMjQ": {
    "date": "8/24/2015",
    "text": "Located right next to the entrance of Isetan Scotts is Watanabe Coffee. Only a few weeks old and it's getting pretty popular to both the Japanese and locals.As with typical Japanese cafes, there's wooden benches that line the entrance, the idea is to sit there while waiting for your table. When I arrived at 130pm, I only managed to get a table at 230pm for 5 adults. A one hour wait, as they do not take reservations during lunch hours. Also take note, they only have two large tables to accomodate more than 4 pax.Looking through the menu, their drink prices caught my eyes. $8.10++ for an iced matcha latte! Their dutch style cold brew at $6.80 was the highlight of this cafe, with the word \"Coffee\" in the shop name, you would think they are proud to serve it. 1. Dutch Style Cold Brew (L) $6.80++It was incredibly bitter, even after adding condiments, but you could definitely feel the effect of this strong coffee! Apparently, they only make 10 cups of these every 8 hours. Interesting!2. Matcha Roll Cake $11.80++I love Japanaese roll cakes! This is no exception, the cake was moist and the cream was delightful. The green tea powder used to decorate the plate was a nice addition, and it was authentic and quite bitter. A good tea time snack!3. Ramune Float $2 add on (with the roll cake afternoon set)By it's own, it is priced at $9, a rather expensive ramune, which you can get at Daiso for just $2 in a bottle. It tasted like every ramune but their ice cream was pretty dense and didn't melt in the drink. Instead, I had to use the metal spoon to scoop up the ice cream.4.  French Fries with Truffle Salt $10.80++No lie, the whole cafe smelt of truffle! These fries were addictive. Not something I would normally order, but it was well worth the calories! The fries were crispy and not oily, the salt was evenly distributed and the smell is just so good!5. Matcha Ogura Honey Toast $16.80++Probably their best seller, as almost every table order one. It is a pretty instagrammable honey toast. It is huge, and I would recommend sharing it amongst 4 people! It comes with green tea ice cream, vanilla ice cream, red bean, whipped cream and 3 mochis.We tried cutting into it gracefully, but made a mess. The whipped cream melted too quickly. The bread on the outside was toasted well, and on the inside, white and fluffy bread that was quite airy, with a slight crisp on the edge. I think there's a few hits and misses here at Watanabe, first of all their service could be improved. The lady at the entrance was so busy, she was pretty rude to a number of people waiting in line. I did sit on the bench for an hour and observed her attitude, I ended up handling the menu to several people waiting in line with me, as they were all asking for menus, but she kept ignoring them. Yes, the cafe is full. Yes the shop is very busy, but don't act as if you're too busy to help others in line.Secondly, the food is quite pricey and not very impressive. However, they do carry alot of the typical Japanese favourites. I lost count of the number of Japanese families with young children that surrounded my table. Last of all, they need to either figure out a way to get people to leave when they're done eating or add more tables. I witnessed several parties using their laptops or reading magazines once they were done eating and no effort was made to hand them their bills. In the mean time, the queue outside the shop continues to grow with potential hungry customers.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_2NKN0PcVEIZiQz3p549cQ",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. Entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_2NKN0PcVEIZiQz3p549cQ/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "ybtefZu1IfxlPu1yQXQzsQ": {
    "date": "9/23/2015",
    "text": "Came here on a weekday about 4pm and got in without a queue with a friend and ordered a matcha latte and cod roe pasta, with matcha pudding and some bubblegum-blue drink for my friend.My friend wasn't too impressed, but I felt my latte was okay, and I loved my pasta. The pasta here has a very chewy consistency, and every strand was coated with creamy mentaiko sauce and topped with a mound of nori. Very tasty.Service here is a wee bit slow, but the environment was pleasant enough to have a chat in. I am not sure about prices, but I do remember the pasta's portion was on the small side, and slightly pricey for what it was.I would come back for the pasta.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L0y07I74WIgBs15DroC11w",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L0y07I74WIgBs15DroC11w/o.jpg"
      },
      {
        "img_id": "zUge11D_VZ6Ii3Nd7lGJ3A",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zUge11D_VZ6Ii3Nd7lGJ3A/o.jpg"
      },
      {
        "img_id": "OY2znUezLAsYA3V6jOadzg",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OY2znUezLAsYA3V6jOadzg/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "q4EKDQMQ3bGyzZvNNP5bag": {
    "date": "8/11/2015",
    "text": "A nice, cozy cafe where people can socialize and work. If you are in need of several cups of good coffee, this place is for you! The syphon coffee came in a round flask that served ~3 cups. It was smooth and not too bitter.The soy chai latte was mediocre--it could have used more spice than sugar water.The matcha pudding was good but overly too sweet because of the added syrup on top. The coffee paired well with the pudding.I would recommend the ice matcha latte though! The matcha was not overpowered by the milk and it was just the right amount of sweetness.If it weren't for the slow service (it took ~20mins for the drinks), this place would have received a 4/5.Note: Free wifi upon request",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hSGyFNVrNLzuFt7qJSh3Fg",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. From left to right: Cold Matcha Latte,Soy Chai Latte, Syphon Coffee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hSGyFNVrNLzuFt7qJSh3Fg/o.jpg"
      }
    ],
    "user_id": "v-GbMECGvcOscLlBEdn6Zw"
  },
  "liVK1_R3vgn8nSnk0jnR7g": {
    "date": "7/18/2016",
    "text": "Classy decor and quality food at decent prices in terms of Orchard Road's centre. During peak hours, there is a sign saying maximum 1.5h of dining if there are other customers waiting and each person must order at least one item. Sounds stringent but understandable. I got the set of matcha Swiss roll cake and matcha shake (add $2 compared to other beverages). My friend had matcha latte and toast with banana/caramel. Service was rather slow but the taste was good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1J4PCVq4pM95RkrWC3q98A",
        "caption": "Photo of Watanabe Coffee - Singapore, Singapore. Matcha shake and matcha Swiss roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1J4PCVq4pM95RkrWC3q98A/o.jpg"
      }
    ],
    "user_id": "pDk2mjq7RTpIc6AWIvrbfw"
  },
  "X3xEw4-61bpzzdTy57TrSA": {
    "date": "3/5/2017",
    "text": "After a quick trip to the Thai Embassy around the corner we were in the mood for a coffee. The window signage promoting Japanese Coffee roasters drew us in being total coffee snobs. I had a macchiato and my husband had a double macchiato. They were strong, a nice crema blended in with well textured milk. There is complimentary wireless. You can also buy beans to take home too. The food offereings looked good too.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2u-UF-J9C2Ckdb9-5FBNHw"
  },
  "NlYe8qXN1Il64riotYU67Q": {
    "date": "3/26/2016",
    "text": "Overpriced and nothing like the original genre. But a good place for meetings, if you can handle the slow service, because both it and the food quality for the price point mean the cafe is half empty even on weekends, despite its extraordinarily busy location.We came for the breakfast sets. The idea comes from Japan, where you can find low priced cafes where salarymen swallow a quick pizza toast and filter coffee before heading to their offices. Efficiency and cost are the deciding factors, understandably that means the coffee quality takes a backstep.Unfortunately, Watanabe caught my attention by advertising being a roaster. This is a departure from the style. I thus had high expectations of my \"Dutch-style\" drip coffee... and they were most certainly not met. Either the coffee is stale, or it is roasted to such a high level as to be practically burnt. Since the beans I saw come off the roaster were a nice medium roast, I assume the former. I noticed the menu said $5 for a drip coffee, and $8 (if I recall well) for a \"special house roast\" or similar wording, which implies that the regular coffee does not come from their home roasted beans. Well, I can't complain. At the price point of the set, and considering the origin of the genre, it's not supposed to be a light roast filled with floral tones and a long finish. Still, disappointing.The service was slow not because of the incompetence of the staff - on the contrary, they did a marvellous job - but because the cafe is SEVERELY understaffed! There were only two people on duty, and this is not a \"8 seats at the counter only\" sized place. They looked pretty exhausted but dutifully processed all the orders as well as they could. My coffee arrived well after I had finished my toast and egg, and we waited 4 minutes to be seated despite a half empty cafe. It's OK if you expect it. The food - except toast - is extortionately priced. In fact, for 2 dollars more than the paltry looking \"wagyu\" roast slice (the thickness of a chashu slice at Sapporo Ramen) you can head for Bistro du Vin and have a 3 course lunch which is still awesome after all these years in the finest French bistro tradition, including foie gras stuffed ravioli with roast hazelnuts where the foie gras actually seems to have increased in size in the last 4 years... I disgress. The sofas and the armchairs are comfortable and the tables nicely spaced apart, so this is actually a great location for business meetings compared to alternatives in the area. This redeeming feature will probably see me back, as the average hipster cafe is usually packed to the brim and communal tables don't make for the best business setting.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvj9YfBp_XPM-3z1Es_P8w"
  },
  "ZvhVutngco2wfdwLSSUvQQ": {
    "date": "2/19/2016",
    "text": "Watanabe Coffee is conveniently located in Shaw House, and they have a full menu of coffee, food, and drinks.  We stopped by for coffee and ice cream, and the place is comfortable for chatting and taking a shopping break, which is nice because service moves at a glacial place.  But first, I'm happy to say that both the inhouse roasted coffee and cold Dutch coffee were very good.  The Dutch coffee in particular was very robust and strong and even when iced, it doesn't lose its intensity.  However, it took about 25 minutes for the coffee to come out and then another 10 minutes for the ice cream.  I cannot understand how it could take 35 minutes to get a scoop of ice cream unless someone forgot.  But they did not explain it in that way so not sure what was going on. They had 3 servers so I'm guessing that the operational constraint is with the coffee and kitchen, but they can also do much better with setting expectations.",
    "rating": 2.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "XZErATnj0tB9a3f2ZcEbDQ": {
    "date": "12/4/2016",
    "text": "We had the coffee blend and hokkaido pound cake slice. Liked the coffee - strong but smooth flavour and presented in a very interesting contraption. The cake was delicious but a large dollop of cream in the centre was frozen stiff and difficult to cut into. So we ended up eating the cake, but leaving the frozen cream centre as is. The menu looked interesting and we will consider returning to sample other stuff on offer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJzu5EUE13Cxf2ghRhJG7g"
  }
}