{
  "5iO11Q4IeBZzKz7sj7yj-Q": {
    "date": "3/20/2015",
    "text": "How aptly named! It was singing in both sound and sense. We had a lovely meal. Try it for lunch since evening dining can be seriously overwhelming.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kmD_9C654p0Fgn0UTWwoew",
        "caption": "Photo of Food Opera - Singapore, Singapore. Cooking",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kmD_9C654p0Fgn0UTWwoew/o.jpg"
      },
      {
        "img_id": "bjrmEZqvG7NXNdo00LiRAw",
        "caption": "Photo of Food Opera - Singapore, Singapore. Display",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bjrmEZqvG7NXNdo00LiRAw/o.jpg"
      }
    ],
    "user_id": "UK2DsID5q3MCqYX23S6xXw"
  },
  "yiJxZKLxyay4vZ7PSVqprg": {
    "date": "9/29/2012",
    "text": "I am reviewing Food Opera as a tourist.I really think Food Opera is great if one has limited time like myself and want to experience as much of Singapore food as possible.It is so easy to get to and all tourists will end up at ION. The selections here is good as almost all the most popular hawkers are here. Set up is clean and great to come here during summer because of the air conditioning!I know it might be a little more pricey and might not be the real hawker centre experience. But for me the food here beats anything I have at home!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CxDOIDnH8gp9KXzpBHJYXw"
  },
  "FSNl9yNCJbXqg3sf465juQ": {
    "date": "10/26/2012",
    "text": "It'ex expensive for the same type of food you can get in hawker centres and other types of food stalls. Most of the places I have gone to sells the same dishes for about $4 while here all the food is is $7+. The crappiest part is that the food isn't even great. It's merely passable.Unfortunately, this place is convenient, clean and nice, and has a large variety of food to select from. I got the balastier bak kut teh at first and was extremely unimpressed with it (altho one must note that i've not tried the real stuff on balastier road so i'm not comparing to that one). The meat was chewy and the flavour did not go through to the meat. I've had a different version of this that was way better. I ended up still hungry and went to another stall to get some dimsum, but it was also not impressive. The dimsum is old and overcooked from having sat in the steamer for too long. The flavour was on the side of bland.Nevertheless, overall, the place is okay. Convenience, choice and cleanliness brings it up a notch from a two star.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "MCMp7yUkX0a7JXn3atzEGQ": {
    "date": "2/14/2015",
    "text": "Clean, Endless Options, Overwhelming:Super convenient to the Singapore Marriott via underground tunnel.  We chose Gyoza-Ya (B4-56 ION).  Goyza were perfectly cooked, crispy yet soft; paired with a variety of accompaniments.  Friendly and helpful staff with tablets for ordering; quick service.  Favorite was the garlic fried rice that was flavorful yet simple with egg and scallions.  Huge cup of hot green tea made the meal complete.  Low-key meal and exciting environment make this a place I'd go again.  Upon return I may not feel as over-whelmed as the first.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ltqzjnqbFWfhW6GkMfGRNA"
  },
  "JOkfgP70QJJQXAqVk9V7ug": {
    "date": "8/3/2014",
    "text": "Nice food court! Finding a seat is a pain in the arse if you come during peak meal time, but the selection is fantastic and we had an amazing plate of char siu, roast pig, roast duck, roast chicken and BBQ sausage. It was huge and satisfying with a bowl of rice. Go there hungry and you won't be disappointed.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bp-TQEtc6Vs6ldnLgjqglg"
  },
  "GJILzJpI5EDZ6OfDsg_Jqw": {
    "date": "8/27/2012",
    "text": "If you're looking for an accessible food court exiting Orchard station, then ION is within reach. Head for the escalator near Rubi and you'll be at the Opera in a blink. This posh-ly designed food court is full of options to suit your current craving.When I came here for the first time, I was amazed and in love with the chandelier and seating. Then with my succeeding visits, It feels cluttered. Especially with the crowd. I love their food selection here but with the layout of the place, it's really difficult to find vacant seating unless you look really close. When in a food court-a crowded one at that-it's a must for any alone person to be able to see a vacant seat so they can quickly chope it.With their food selections, it is definitely an \"A\". But with the layout, referring to convenience, it's on shaky ground.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SCFBUlvUq1K-_1yEF-AcvQ",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SCFBUlvUq1K-_1yEF-AcvQ/o.jpg"
      }
    ],
    "user_id": "AWPy2uveUH8ZLgNF9toO7g"
  },
  "78vzOj928tUPgsQKb-9kjA": {
    "date": "4/20/2013",
    "text": "This is a food court in a mall.  Compared to the food courts in the US this is considered restaurant food.   I got kind of overwhelmed with the selection of food.  I decided on hainan chicken and a milk tea place.   My friends got pho and skewers. All where really good, and the place was kept pretty clean.  My only complaint was the air conditioning unit.  It was dripping water above us, so we had to move. I wish i had more time to try everything in the food court.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzmC0SDuCp4Tps-k9fc0sQ"
  },
  "TZPJdj-PPGLQqT8wq25rNw": {
    "date": "12/31/2014",
    "text": "Right under the ION Orchard shopping center. A very clean food center with many choices. One of the best in town if you are not cultured enough to go to the street vendor type food centers. I am a fan!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Adzb5v6YpltZ7HmeOzQARg"
  },
  "Y6JkNQOz0o1Sx81F63o_bg": {
    "date": "9/9/2012",
    "text": "Food Republic chain of food courts, in my opinion, is quite a rip-off.I do agree that the bread talk group is trying their very best to make food court dining classier, but i don't agree in paying a minimum of 7 dollars for food court dining. I don't find that placing a metal giraffe art piece in the food court helps in the layout of the place, especially during the crowded lunch hourI must say that their food selection beats the other food court operators - popular hawkers are sourced.One thing I absolutely hate in this food court is that their drinks are limited to only Pepsi and Yeo's. Absolutely no Coca Cola or Pokka selections, and the drinks are overpriced.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "w33gbVJvR5SaDReKg1PJ6g": {
    "date": "9/9/2012",
    "text": "This place is pretty, the food is okay, but the extra dollars we're forking out for the slightly fancier packaging just affects the foundations of 'hawker food'. The only stall (if they are allowed to be called that) that I patronise often is the Soy Milk Vendor, which serves up a good quality tau huey zuey (soy milk), and the sugar often comes separate. Besides that, I'd recommend a train ride to Tanjong Pagar or Tiong Bahru for a more wholesome experience.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  },
  "Ptco3WXF6iASHGBtV18DNQ": {
    "date": "5/10/2013",
    "text": "A lot of food selection. Sometimes a challenge finding a seat. Good food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uDCXh4P5c9vZcoUZU3jcLA"
  },
  "I1TJNpmKF6fnxV2g_7GaCA": {
    "date": "8/12/2012",
    "text": "Food Opera is a food court strategically located at the basement of ION Orchard, housing many local favorites, such as fried carrot cake, laksa, prawn noodles, ice kachang, dim sum, etc. The theme of the food court has an interesting twist, as it attempts to combine art and local food. It is a pretty nice place to dine in, if not for the cleaners who are full of angst. They make the environment a little less comfortable to dine in. Also, the food is a little too overpriced. They don't even taste as good as they look! Try not to settle for your meal here, unless left with no other choice!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5qnan1MZhuF8LetcU-Ziw"
  },
  "q0-_TYmAEPSLwD8yPly3FA": {
    "date": "9/23/2018",
    "text": "Food opera is pretty darn amazing.  Located in the basement level of ION Orchard, there is plenty of seating even on the weekends when the malls are super crowded.  It's so clean.  Employees constantly walking around to clean off tables and carts also being pushed around if you want to buy additional beverages if you're already sitting at your table.  Food Opera is your mall food court but on steroids.  Filled with a plethora of food choices from sweet to savory.  Juice bar, coffee, dessert, laska, hainese chicken rice, noodles...you name it they've got it.  I think there has to be something here to satisfy ones taste buds for sure.  Food opera I love you you're wonderful.  If you're shopping on Orchard definitely stop by Food Opera for a meal!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uYAtzq3I1ENMfhheFJ6hMg",
        "caption": "Photo of Food Opera - Singapore, Singapore. Laksa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uYAtzq3I1ENMfhheFJ6hMg/o.jpg"
      },
      {
        "img_id": "zpjPGspLSnpf07acUyyOLA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zpjPGspLSnpf07acUyyOLA/o.jpg"
      }
    ],
    "user_id": "wNf7mNngGDqRKu57N0JmxQ"
  },
  "rVli-r71psJgkzjguD8_FA": {
    "date": "5/23/2018",
    "text": "Food Opera is RIDICULOUS. Ridiculously GOOD. Head-spinning GOOD. Food Opera puts American mall food courts to SHAME. Food Opera has a bewildering number of food stalls to gawk at and drool over. Not only do they have all these wonderful food stalls, they have the little ladies pushing DIM SUM carts. I swear, I thought I died and went to Yelp heaven. Like all Yelpers, I eat to Yelp and Yelp to eat. Singapore HAS to be Yelper heaven, because delicious food is EVERYWHERE. And then Food Opera...where do I even start?Oh, I started at Lam's Signature and ordered the Abalone Noodles. It came topped with egg, pork, fishball and a skewer of abalone & scallop. You get to choose your noodles - I had no idea what to get and had the cashier choose for me. Whatever it was, it was hella tasty.Next stop was a juice bar...called Juice Bar. They make fresh juices. I ordered what the person before me ordered: the lime which nicely complemented my meal.My hubby had Hainanese chicken from Sergeant Hainanese Chicken Rice. I think he enjoyed it. I never got a chance to snap a pic of his dish.I love you, Food Opera.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yK4NAIE3G0uFVtAuf2r5RA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yK4NAIE3G0uFVtAuf2r5RA/o.jpg"
      },
      {
        "img_id": "MO_KKsElT3suq4duLSJscw",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MO_KKsElT3suq4duLSJscw/o.jpg"
      },
      {
        "img_id": "r-Q5aJkhk7lqmYZV3OAZgA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r-Q5aJkhk7lqmYZV3OAZgA/o.jpg"
      }
    ],
    "user_id": "8OZ4e9DWBxRRPtD-U1amOQ"
  },
  "dBJIEWhp27FrulLKTzPPhA": {
    "date": "5/20/2018",
    "text": "If you're looking for relief away from the sweltering heat that is Singapore everyday and delicious food, look no further than Food Opera. This is a food court located in the B4 level of ION Orchard Mall. The comfort from the air conditioning here comes at a cost - the food is more expensive. But, it's worth it because we do have some winners that are worth trying. The first food item was their laksa. Next to the Chinatown Complex Hawker Center, the laksa served here is my second favorite in Singapore. It's less creamy than its hawker center counterpart, but the flavor was still just as intense. Notes of coconut, shrimp, lemongrass came through wonderfully. I ate this laksa twice during my trip. One because I really wanted AC, and two I love, love, love laksa. My cholesterol levels were definitely not good coming back home from this trip. Lol. The second food item was their BBQ grilled chicken. Whoowee, this was so delicious! You can actually see them grilling the chicken wings over an open charcoal flame, and that flavor just gets absorbed into this chicken. The wings were smoky and had a wonderful char. The skin was crispy and it was still juicy in the middle. But, the wings were quite small, and one order was expensive (like $1 per wing). The third food item was their Teochew fish balls in soup. The fish was fresh, pounded into a paste, and boiled into fish balls. The quality was definitely there. Great texture and flavor. Plus they had very hot chilis in soy sauce as a condiment. Spicy as hell. We tried other food and drink items here, but they weren't good enough to be mentioned. Maybe an honorable mention would be their ayam penyet. Definitely not as tasty compared to the one at Tekka Center, but the chili sauce coating the chicken was definitely tasty. I just wished the chicken didn't taste like thick fried batter on the outside and unseasoned chicken on the inside. I still think this was one of the better food courts to come to that served good food in the comforts of a mall. Give this food court a go. At least you won't be sweating like a dog here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UKx5172LaKjYvjWFgHwJmA",
        "caption": "Photo of Food Opera - Singapore, Singapore. Stall for delicious fish balls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UKx5172LaKjYvjWFgHwJmA/o.jpg"
      },
      {
        "img_id": "hvfmZQOANRsJWneRCQPRsg",
        "caption": "Photo of Food Opera - Singapore, Singapore. Awesome fish balls in soup with fiery chili's in soy sauce as a condiment. Spicy as hell!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hvfmZQOANRsJWneRCQPRsg/o.jpg"
      },
      {
        "img_id": "QpDfKtMfMelVcZmpT3ChrQ",
        "caption": "Photo of Food Opera - Singapore, Singapore. BBQ grilled chicken. This a must when you come to this food court.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QpDfKtMfMelVcZmpT3ChrQ/o.jpg"
      }
    ],
    "user_id": "GYwyxg6vZNH6S8hV2TIeRQ"
  },
  "lalf1SLwV40dDkengim-yw": {
    "date": "3/25/2018",
    "text": "I first heard about this mall food court from watching the Fung Bros' YouTube video. Food Opera is located in the basement of the ION Orchard mall. The nearest MRT station to get here is MRT Orchard station which runs on the \"North South\" (RED) Line. There's plentiful of food options at Food Opera. We browsed around the food stalls before making a choice.Stalls that we tried:-Stall #5 \"Li Xin Teochew Fish Ball Noodle\": I got the fish balls with egg noodles (5.50 SGD). They offer a few variety of noodle choices and I picked egg noodles. It was pretty good and filling.-Stall #6 \"Ice Shop\": My dad and I shared the grass jelly dessert and there were a few toppings (3.30 SGD). There were red beans, tofu pudding, and mochi balls. Delicious and refreshing treat.-My dad got the chicken and rice set which included a small plate of stir-fry Chinese broccoli and soup. I don't know what stall it was from and I think his meal costs (5-7 SGD).We came during lunch time and it wasn't crowded when we arrived. The food court was getting busy when we left since office workers and tourist would dine here during lunch. So, I recommend coming here by 12:30pm.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "e8UQd0kKJVznR8lRgiiOhQ",
        "caption": "Photo of Food Opera - Singapore, Singapore. Stall #6: Grass Jelly with toppings [3.30 SGD]",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e8UQd0kKJVznR8lRgiiOhQ/o.jpg"
      },
      {
        "img_id": "2T9EhIUn2_wikOOkM4_pHQ",
        "caption": "Photo of Food Opera - Singapore, Singapore. Chicken and rice set (5-7 SGD)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2T9EhIUn2_wikOOkM4_pHQ/o.jpg"
      },
      {
        "img_id": "izW5HcA0YtYKqsc0rFTTBQ",
        "caption": "Photo of Food Opera - Singapore, Singapore. Stall #5: Fish Ball with noodles (Dry version) [5.50 SGD]",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/izW5HcA0YtYKqsc0rFTTBQ/o.jpg"
      }
    ],
    "user_id": "RXIeMdM988krQQDj6cXwJQ"
  },
  "eyyUhAA6NlQyIRQ7a7cktA": {
    "date": "10/5/2018",
    "text": "This is, for now, the best food court on Orchard Road. Some of the stalls have been famous for several generations (eg. Lam's abalone noodles, HwaHeng beef noodles, ThyeHong carrot cake), best in class (eg. Ah Chew Yong Tau Foo) or just very good (Indonesian chicken BBQ, HK roast meat). There's diversity too, you even find Korean or Bak Kut Teh. But, strangely enough, no Indian, Japanese or Vietnamese (there was a good Viêt when the mall first opened, but it disappeared). But those who crave ph or bánh mì tht can walk to Nam Nam in the basement of Wheelock Place next door. Quite clean, with lots of roaming cleaners, and a sink for guests to use.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4PIG3XSDEejHg-fUR4P5fw",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4PIG3XSDEejHg-fUR4P5fw/o.jpg"
      },
      {
        "img_id": "5VQN_k4vMNGIjyB6UWVf2A",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5VQN_k4vMNGIjyB6UWVf2A/o.jpg"
      },
      {
        "img_id": "fyVmkhkpE_33gFStrLqRRA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fyVmkhkpE_33gFStrLqRRA/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "_fDYRo6oaRCpFabWPslyZw": {
    "date": "9/19/2017",
    "text": "Amazing. So many choices. Decided to go for something cold after walking all over the place so I stopped at the Ice Shop. Ice topped with durian fruit and adzuki beans...yum! ($3.80SD$) I was told the chicken rice and prawn noodles are also amazing here so I may need to come back. Probably a bit fancier than most food stall are but this is at Ion so probably tone expected.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LrnG4n7BvTTwx9sv4QYm-w",
        "caption": "Photo of Food Opera - Singapore, Singapore. Ice with durian fruit and adzuki beans",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LrnG4n7BvTTwx9sv4QYm-w/o.jpg"
      }
    ],
    "user_id": "F9ryadSyr6hy3jDodPYhyw"
  },
  "jXA-EjcqMH1OJWE1W7B0Rg": {
    "date": "12/30/2017",
    "text": "Many selection of great food. Place is clean and big but a bit tight by the seating area. Got the Mee Pork to satisfy my craving, portion is on the smaller side.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ilL3D66eoIt5HKw0sjJBJA",
        "caption": "Photo of Food Opera - Singapore, Singapore. Mee pork",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ilL3D66eoIt5HKw0sjJBJA/o.jpg"
      }
    ],
    "user_id": "QUj7n1N8ToGUu0SN9odPXg"
  },
  "kvx6Vtx5uxCJeX1yvUoHCg": {
    "date": "2/25/2017",
    "text": "Avoid this place if possible...except for perhaps a fruit juice or Kopi or Teh. I stumbled upon Food Opera after 10:00 pm on a Saturday - \"shop until you drop\" was an understatement for me this day. I had bags in both hands from Pull and Bear, and Lovissa, to Mango and ZARA; I was famished. Thankfully, there were still a few vendors serving patrons. I ordered the seafood Char Kway Teow from Thye Hong - Singapore Fried Prawn Noodle. This was an inexpensive meal at SGD $6.80 (about US $5.00). Unfortunately, in this case I got what I paid for. The Char Kway Teow just wasn't good. On a positive note, this is a very nice and clean food court with ample seating. I wish food courts in the US looked like this. It's a great way to take a break from all of shopping you're sure to do at ION.I knew the food wouldn't be as good as hawker food such as Lau Pau Sat or Maxwell St., but this stop was purely out of convenience. Next time, I'll just continue my stroll down Orchard or Patterson an take my chances on street food vendors. There was a pizza vendor that looked really good; the deep dish made me salivate. Worse case scenario - the McDonald's is always open!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "JrIH8o3GpGsEOwU3toliqA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JrIH8o3GpGsEOwU3toliqA/o.jpg"
      },
      {
        "img_id": "tV8Oskb6axOvdrwlIxDFAw",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tV8Oskb6axOvdrwlIxDFAw/o.jpg"
      },
      {
        "img_id": "8J00fZZutr7aCmcKFBn37w",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8J00fZZutr7aCmcKFBn37w/o.jpg"
      }
    ],
    "user_id": "cSvwgRq74ElhrE6AQEm3DQ"
  },
  "9Iy_Mgtt6wU-TguqRCF34w": {
    "date": "5/16/2018",
    "text": "By far the best food court in Singapore! There isn't a single place that you can go wrong. Whether in the mood for spicy noodles or a fresh squeezed lime juice, there is an option for everyone. Baby friendly and very friendly staff. Highly recommend and will definitely be back next time we are in Singapore!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f-RX59pkQ82lzQzLjsFBBA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f-RX59pkQ82lzQzLjsFBBA/o.jpg"
      }
    ],
    "user_id": "VVuCogk8OxUCpTZFjxE0yg"
  },
  "lxcrMlu-PGGMY5cTiiMnmg": {
    "date": "12/21/2016",
    "text": "I've stayed at the hotel across the street several times and made the ION Food Opera my main place for quick bites since it's so conveniently located near the Orchard MRT.I love the variety of dishes that are available-- everything from hainanese chicken and rice to laksa to hoikken prawn noodles to fresh fruit... you name it. It's definitely more upscale and cleaner than most hawker centres and each place takes credit cards and debit cards so it makes it easier for everyone if you don't carry much Singaporean currency on you.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ziEzn7BoXTfOQ4YBkdz1Q"
  },
  "P_n-XmGFQ_hOzYoCyv7LFQ": {
    "date": "3/7/2015",
    "text": "In our first night in Singapore, we stopped by this food court in the B4 level of the ION Orchard shopping center. Not wanting to go out very far for food once we checked into the Marriott (literally right across the street via the underpass and MRT station), we got our first meals here. Compared to the food courts in the US, this place was incredible in terms of variety and quality, so much so that you'll need 15 minutes just to walk around the area to see what you want to eat. We went with some Singapore standbys:Chicken and rice: chicken was very moist, and love the chicken flavor of the rice itselfChar kway tow: nice stir-fried taste in the noodlesHokkien mee: ok, but I wish it wasn't so watery or soupyAll in all we spent about 30 SGD (22 USD) on our first meal. While you can probably get better, cheaper food elsewhere, it is also nice to have a convenient and air-conditioned place to eat. Remember to bring your own paper towels and wet knaps.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fqbN5Z7KBrXWM91cAhzBEQ",
        "caption": "Photo of Food Opera - Singapore, Singapore. Hokkien mee (5 SG)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fqbN5Z7KBrXWM91cAhzBEQ/o.jpg"
      },
      {
        "img_id": "jgiHzXbF4kknDI5N35ut6g",
        "caption": "Photo of Food Opera - Singapore, Singapore. Char kway teow (5 SG)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jgiHzXbF4kknDI5N35ut6g/o.jpg"
      },
      {
        "img_id": "RYys-ucYeuVk0tr3_wnHWw",
        "caption": "Photo of Food Opera - Singapore, Singapore. Chicken and rice (10 SG)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RYys-ucYeuVk0tr3_wnHWw/o.jpg"
      }
    ],
    "user_id": "hYlCMQ278BvKv9IP9v_m4w"
  },
  "B0zElTIJ_gMbfT4gwtacSg": {
    "date": "1/17/2014",
    "text": "In the busy shop infested ION the food option is the Food Opera (FO), a concoction of \"pricy cheap\" eats, but, compared to home much better quality.  I began my food journey in Singapore here.  FO had my head spinning like an exorcist baby in a candy store!  All the choices and visuals (love the giraffe and horsey animal statues scattered about).  I found myself in a choice panic.  Should I have congee? Or Laksa? Fish ball noodle soup?  But wait!  Do I want something chill like Ice Kaching?  Or roast pork?  What's hungry man like me to do?!!!I wish I had this problem at home in the US!After thinking hard. The floating soy sauce with red pepper floating next to the cash register at 3rd Generation Laksa won my attention.  I immediately realized my painful 15 hour flight to Singapore was worth the suffering.While I cannot say it's the best Laksa in Singapore or the best prices ($S7 for a large bowl) this type of flavor and quality is nowhere to be found where I live in California.  I love the energy and vibe of FO.  It's fun to watch other people walking aimlessly and unsure of what to eat or the workers or those seated and what they chose to eat.I also tried the Rojak (spelling?) salad which composed of cool vegetables, fried doughnut (bread used in congee/jook), pineapple mixed with crushed dry nuts.  I thought it was too sweet but it was refreshing.As an encore, I had in iced Kaching w/Ice Cream for $S3.80 (maybe $3US?).  It was very refreshing with the shaved iced mixed with red beans and some kind of red jelly thingy. This dessert is located at a stand in the FO called \"The ice Shop.\"Word of warning, although there is good quality here, there may be better options elsewhere at other hawker centers.  This is just the beginning of my food journey here so I will use the FO as a barometer for other places.  Needless to say, I ate so much here that I was able to walk and shop for about 7 hours.  I've also had the Fishball noodle soup which is pretty decent too.  It's at the  Teochew Fishball Noodle Stall.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tCBKViiB6RHg5Mqih75_mg",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tCBKViiB6RHg5Mqih75_mg/o.jpg"
      },
      {
        "img_id": "kRQxbayO4p6oxfMyzQNC3Q",
        "caption": "Photo of Food Opera - Singapore, Singapore. The Ice Shop at the Food Opera.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kRQxbayO4p6oxfMyzQNC3Q/o.jpg"
      },
      {
        "img_id": "vnywxOjpBBaf6ssXgEFz5w",
        "caption": "Photo of Food Opera - Singapore, Singapore. Heading into the \"Food Vortex\" from the shopping at ION.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vnywxOjpBBaf6ssXgEFz5w/o.jpg"
      }
    ],
    "user_id": "pMltyeuU4SjT6Y8YVy7HBA"
  },
  "vAaoTOgcfKkIb95uYBOsGQ": {
    "date": "9/6/2016",
    "text": "A bustling food court in one of Singapore's best shopping malls on Orchard Road!Variety eat your heart out, while you're at it you can also tick off quality!This food court simply has it all. Prices may be a little more (but still ridiculously cheap) compared to hawker markets but you are in a pretty, clean & well service food court. Not to mention that the quality is exceptional!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UveKwDk_CmjbapLRsfnvKw"
  },
  "6W-HoYtz3NcOjTS-1z2xow": {
    "date": "7/5/2017",
    "text": "Very busy food court in the afternoon.  Not sure what to order so I went for the longest line with workers!   I'm sure there are more authentic dish out there but it's a great place to get out of the heat!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC5yuO5-9y3-AlNz72U6YA"
  },
  "erSVfYVPaXJIcqxqF0vaVA": {
    "date": "8/8/2015",
    "text": "FOOD: VERY GOOD The prawn noodles were really good! The soup was thick & packed with flavor. The prawns were really big and juicy. The meat was also tender but slightly salty! It was a really big bowl as well so very filling & hearty.PRICE: OKAY It was $5.50 for my bowl of noodles & for the amount i got its rather worth it to me because it was filled nearly to the brim! WAITING TIME: SLIGHTLY LONGThe cashier was talking away so dragged the waiting time but it was worth it for the food was really good for a food court. ATMOSPHERE: CROWDED It was peak hour during lunch so the place was pretty cramped and it took awhile to find seats.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KImnygoB1oSZL3Mf4DwUug",
        "caption": "Photo of Food Opera - Singapore, Singapore. Prawn Noodles Up Close",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KImnygoB1oSZL3Mf4DwUug/o.jpg"
      },
      {
        "img_id": "z7n-tJjczZOcu17hHsYPEg",
        "caption": "Photo of Food Opera - Singapore, Singapore. Prawn Noodles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z7n-tJjczZOcu17hHsYPEg/o.jpg"
      }
    ],
    "user_id": "OhEqJk77YMztximOycSRkw"
  },
  "lL9Zda8ZJOE4NhDJhF3UxQ": {
    "date": "4/17/2015",
    "text": "Love it from the first taste and it did not disappoint.  The beef noodles is again my favourite.  Tried the hokkien prawn noodle and it taste traditional.  Prawn flavour lingers over the noodle gravy and the noodles readily absorb the richness within it.  Prawn is not shelled at all, arghhh! Would hv been better if the flavour is richer.  More prawns? The pork noodles was a let down.  No texture in the noodles and I did not enjoy eating it. Well. .... too much food this time round.  Well try again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0t8GlY8ReCT0kqZAvOdQxA",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0t8GlY8ReCT0kqZAvOdQxA/o.jpg"
      },
      {
        "img_id": "G4q3UkMUyA_ccgTMfHmrmQ",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G4q3UkMUyA_ccgTMfHmrmQ/o.jpg"
      },
      {
        "img_id": "Ay3vs0tWoO50k48sSicZjg",
        "caption": "Photo of Food Opera - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ay3vs0tWoO50k48sSicZjg/o.jpg"
      }
    ],
    "user_id": "k0oHn1KVp2X8dg826z7oXg"
  },
  "-Ayl5U87IbOaKINFrCrAAQ": {
    "date": "3/11/2015",
    "text": "There are quite a few complaints here about steep prices. Of course they're higher than the food centers, the rent in this mall must be exorbitant! Who's going to offer cheap hawkers food in a modern megamall? Nobody. So if you want to pay a lesser price for the same thing, go travel to your closest eating centre and get it there. But for those who like the convenience in a very clean, spacious, and air-conned space, This place is hard to beat. The variety is simply amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "s8gK7sdVzJcYKcPv2dkZXw"
  },
  "izM1SlQYe6Luh0B1UGJECw": {
    "date": "11/5/2013",
    "text": "I am really not a fan of Food Opera and have actually vow never to dine here unless absolutely necessary. I am torn between giving it a 1-star (which I really want) or 2-star (just because not all stalls are bad). The goodIt is really hard to think of something good here, though I guess it is pretty spacious (but gets filled up real quick) and looks clean with some art pieces scattered around. The not-so-goodGenerally very high prices for local street food. You can definitely get much better local food at lower prices in the usual food centers or coffee shops. But in the Orchard Road shopping belt, the choices are limited, unless you trek to Lucky Plaza, Cuppage Plaza, Far East Plaza or Orchard Towers and even Ming Arcade (really cheap and good nasi padang) for much more affordable local street food fares. Even though the stalls are supposedly the best, I am sure many will beg to differ. Somehow when the food is no longer cooked by the original owners, the standard is not the same. So you are paying close to $10 for something you can get for $3.50-$5 in the Orchard area or $2.50-$4 in the neighborhood area. The absolute worstOver-charging by not following the prices listed on the board. The worst offender is the stall selling nasi padang (Malay food). It has happened to me twice!When I asked about it, the staff just said \"oh the price listed is wrong, they just increased it\". This happened a few years ago. Recently I ordered from Luk Yu Teahouse (dim sum and Chinese dishes) stall. The prices listed are not also accurate as GST is not included. Now you know in Singapore, most prices include GST, or if it doesn't, it is always stated exclusive of GST. So I got a rude shock when the bill was not what I thought it would be. And this was for take-away. Although the amount is small, I just do not think it is right. After all, it is about the principle. So I guess I will go back to not dining there again, unless I really have no other options.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "7uBaFki1Vu7lfBoGNXD8Ew": {
    "date": "5/1/2015",
    "text": "Great selections of different kind of cuisines,can get crowded and busy during the lunch hour crowd. come early and you will surely find a seat. The trays seemed to be unsanitized. The older amahs in charge of collecting the dirty plates and trays seemed to be unfazed by this. They use the same piece of cloth to wipe down the tables and the trays.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZiO2Wr41kZ4Vz64aheBFPQ"
  },
  "sqBjRALHPtKuIQJsSq67KQ": {
    "date": "7/17/2014",
    "text": "Very clean and upscale feeling food court with some popular Western options like Dunkin Donuts or Auntie Anns. But that's not why you came to Singapore, I hope. Nice local food options like fish ball soup, chicken rice, fried carrot cake etc. Add to that mix Hong Kong dim sum, pizza and burgers, so there is something for everyone. Some of the vendors provide free samples, like the cream puffs place in the center. Thr biggest challenge you'll have is to pick what you want.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZaWWxwwHGtH-8Vhx7qE_Q"
  }
}