{
  "FPIBb3g3L5o0POt55L-jqQ": {
    "date": "8/27/2013",
    "text": "Matcha green tea really does taste premium, tastes great after a meal. Second time getting dessert here after trying it yesterday, i wish we had something like this in the states.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKXG8pIWcN27PHk8JSIcig"
  },
  "GMgSPbMqwS3R6c-1PsGyfg": {
    "date": "7/21/2013",
    "text": "I'm totally addicted to Nana's. My faves are the matcha latte, hojicha latte, matcha soft serve, and matcha anmitsu.  The matcha dishes have always have an intense rich matcha flavor which I love, and their desserts aren't too sweet. Minus one star bc service can be spotty, depends on who you get. There are a couple of super nice waiters but some kinda have an attitude.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "velzbr5_h-6xhr-o4mn4sQ"
  },
  "Us1msNwnqOCtudgfc1okYA": {
    "date": "7/12/2016",
    "text": "Arrived at about 6+pm on a weekday and was surprised to see it fairly empty. The friendly servers showed me to a table.I ordered a July's special of black sesame iced latte with mochi, a scoop of azuki (mashed Japanese red bean) and whipped cream, while waiting for my friends to arrive. The latte had the lovely and subtle flavour of black sesame (it's good for hair!), the mochi was chewy and the azuki was just right. The whipped cream seemed out of place though. I would order the drink again.Subsequently I ordered a Hamburg rice set. The vegetables were enough to satisfy my fiber intake for dinner - 2 cubes of eggplant (nicely cooked to the way I like it), a thick strip each of red and yellow capsicum, grated radish and lettuce, with a tangy dressing!The Hamburg was cooked medium well (only very slightly pink, but cooked enough for me as I don't like raw food). It was flavorful too. The millet rice did its job to provide carbs for the day.I requested for warm water and was provided with one. Pity it wasn't refilled when I finished it.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hKFrUyF8BaN8h0I6XmK4Dw",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Hamburg with miso sauce (I requested for it to be on the side), Miller rice, veggies and miso soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hKFrUyF8BaN8h0I6XmK4Dw/o.jpg"
      },
      {
        "img_id": "ykf-uBCROhkSrLwwRAqovg",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. July's Special: Black sesame iced latte with mochi, azuki and whipped cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ykf-uBCROhkSrLwwRAqovg/o.jpg"
      }
    ],
    "user_id": "s0VEbbkeLN-Zfy5OdYKrTw"
  },
  "TFfrUkItqBolGXGgS0ZacA": {
    "date": "6/18/2017",
    "text": "The food here isn't excellent. (If you must, try the sukiyaki udon which my friend gets every time she's here.)But the dessert is excellent. In particular, the green tea ice cream, and the more unique hoji ice cream.No one knows about the hoji (oven roasted tea) ice cream. But it's the real gem, because where else do you find hoji ice cream in the first place, and good hoji ice cream in the second place??You can't just order the hoji ice cream as is, though. So what I normally do is get a cold matcha (green tea) latte and add a spoon of hoji ice cream on top for S$2 more. The two flavours are both good, and complement each other (when you are tired of one, get a taste of the other). If you're feeling indulgent, get the matcha float and add a scoop of hoji ice cream.I have tried the hoji ice cream in a cold hoji latte, but that is way too much hoji for one person. I have also tried it on top of the azuki (red bean) latte, but the tastes are both way too \"heaty\" in a bad way.Oh nana's green tea, would you consider making your hoji ice cream a differentiator from all the other green tea places, and allow me to get the hoji ice cream on its own, or in a cone by itself take-away? I promise I would bring so many more people here if you did that, because it would be so much more affordable and I would be able to convince so many more people to take a shot.If you're going to follow the crowd though, just get the matcha shiratama parfait like everyone else, and share it with a friend. It may be incredibly difficult to get the side profile of the parfait all in one scoop, and it may have cornflakes that become half-mushy if you don't eat them fast enough, and it may be mediocre in its a-bit-of-everything approach, but hey; have it your way.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jN8nZGH1djUVsFQYIUNOWg",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Hojiiii",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jN8nZGH1djUVsFQYIUNOWg/o.jpg"
      }
    ],
    "user_id": "3Mils6AfdsCgUah7jmTd1Q"
  },
  "ncrN5kD0UgshWPCl9MTvkA": {
    "date": "7/26/2016",
    "text": "I was not feeling that well when we went shopping at Plaza Singapura. All I wanted was something to calm my stomach. We stumbled upon Nana's and it was just what the doctor ordered. I don't even remember which hot matcha green tea I selected, but it was very good and I drank the whole pot. I also don't remember exactly what type of udon I ordered! Maybe Sukiyaki Udon? It was nothing special, but it had pork, mushrooms and tofu. See my photo; maybe you can tell me LOL. It wasn't anything special, but this is a tea and snack place, not a ramen house. The restaurant is clean, modern and opens to the mall. The food appears from I-don't-know-where, and oddly you pay your bill at the cashier across the corridor.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "7aZEgTBzbqKkoldFuGOWVw",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Sukiyaki Udon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7aZEgTBzbqKkoldFuGOWVw/o.jpg"
      }
    ],
    "user_id": "141jd-Tt6--RIr9OcJOu5g"
  },
  "6lr6c19ILpCsL1_BZrRj3Q": {
    "date": "10/16/2016",
    "text": "For lunch - 2 stars for the chicken cutlet curry. Set lunch for $16.35 incl GST includes a meal, soup and a drink.The good1. I thought the curry was tastier than Coco Ichibanya's.The bad1. The curry came coagulated - there was a thick film on top. Not appetizing.2. The rice was mushy! Disappointing.3. The chicken had too much fat.4. Not enough pickles to go with the meal5. Expensive once you include the service charge.Go for dessert rather than lunch.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "_42Pp7xqWV_OToI70guP7Q": {
    "date": "2/13/2017",
    "text": "The set lunch is 16.5. I had beef udon and green tea. Love it. Very healthy and clean.  I like the way egg is undercooked a bit leaving egg yolk tasty. The hot tea was good too. Love it. I probably will try it again in Singapore if I have chance. Definitely recommend it for the cleanness, taste, and typical Japanese flavor.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1XvZrS9JkffHYD1rmlGUw",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y1XvZrS9JkffHYD1rmlGUw/o.jpg"
      }
    ],
    "user_id": "uQDTy9T2cEhA0TMn2K8nQw"
  },
  "Tbo8o_0E7w_fN3F-kUt66w": {
    "date": "7/19/2015",
    "text": "This place is matcha lover's heaven! They have a wide array of matcha and hojicha drink and dessert selection that satisfy those with a sweet tooth and anyone who just wants good tea. I love how their drinks can be opted to be either cold or hot, and you can also choose to have thin matcha, in which case, the sugar syrup will come on the side so you can add it according to your taste! My personal favorite is the thin matcha float, which is a cold matcha drink with a scoop of green tea ice-cream! The drink itself isn't sweet because it has no sugar added, but I like it because when the green tea ice-cream melts, it makes it the perfect sweetness! Their drinks and desserts are instagram-worthy so if you're into instagram, get your phones ready ;)I would give this place a 5 star but because the place seemed understaff and you can't make substitutions for the drinks (i.e. trading the mochi in for the jelly) unless you top-up, I gave it a 4 star. Note: Free wifi but you have to ask the staff for the password!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "v-GbMECGvcOscLlBEdn6Zw"
  },
  "x5E_7iAKaKCty8_gDQz1bA": {
    "date": "12/15/2013",
    "text": "I first heard of Nana's Green Tea when I was travelling in Shanghai, and decided to give the Plaza Singapura branch a try. For green tea, I must say that is is pretty pricey. $8 for a cup of green tea with ice cream? Hmm... not so sure.To be fair though, I gotta say that the tea was definitely very good and I love the soft serve ice cream.I ordered the Hoji tea (roasted green tea) while my friend had the normal green tea. The hoji tea was slightly less sweet, although I think I would have preferred the normal one (sweeter!)I'm not sure I'd pay $8 for just the green tea, but I guess it was worth it since we spent a couple of hours in the afternoon there just sitting and chatting, so perhaps its more for the venue than just for the drink!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Fvo59gwsoH9mYUHhMuDJnA",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fvo59gwsoH9mYUHhMuDJnA/o.jpg"
      },
      {
        "img_id": "_dDspGDBsxT4QIb50qesDQ",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_dDspGDBsxT4QIb50qesDQ/o.jpg"
      }
    ],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "pgmqi8GwbOUvvqLfPDTA4Q": {
    "date": "1/6/2016",
    "text": "Nama chocolate is so delicious. Green tea on the outside and green tea chocolate on the inside. Green tea ice cream. Corn flakes. Matcha powder. Vanilla ice cream. Green tea jelly pieces on the bottom. This dessert was really unique to me and I would definitely come back for more. I'm actually craving it right now! I can't say for the other things on the menu since I've only tried the matcha nama chocolate parfait. The downside is that it's pretty pricey at $10.60 USD.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1wt-Yz35Y7V2Tf2r_3muFQ",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Matcha Nama chocolate parfait.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1wt-Yz35Y7V2Tf2r_3muFQ/o.jpg"
      }
    ],
    "user_id": "6Lmv1k8mnufs78d0Gbk-ow"
  },
  "-Ye-i9_YLCQp9ymX7T_9xg": {
    "date": "10/4/2016",
    "text": "This is more of a dessert place. You can come in for dinner too but don't expect much except for a few selections of udon and dons. I had the salmon don and my partner had one of the udons. They actually mix the ginger with the salmon (which was sliced really thinly) so it wasn't very convenient separating the two. They were all pink in colour. They added sesame to the rice and you are given some sauce to pour over the rice and some wasabi on the side. Overall I thought it was mediocre.The best thing about this place is the matcha float though. The green tea ice cream in it is really gao. Lol. I also tried the hot matcha in a bowl (ala wabi sabi style). Its just a small amount but is really thick and quite bitter. Desserts go at about 7 or 8 bucks.Would have given this place a higher rating but the food selection is too limited and could have been better!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vua8-Q3D8KmrxZ7yNL3PeA"
  },
  "WfbsjBAMQWo7xpg7oVkTPg": {
    "date": "9/1/2013",
    "text": "As the bubble tea appeal dies down a little and I look for different after-meal options to satisfy my sweet tooth, Nana's Green Tea comes into my life at the perfect timing. I might be in love with the Matcha drinks here. I love that they don't taste artificial/instant. I love the richness, creaminess of the drink without it being an overkill. I loved that it wasn't too sweet and had just the right consistency to it and I love love loved that it's like dessert in a cup (with green tea ice cream, red bean and mochi balls in your matcha if you like)Probably one of the best matcha green tea dessert drinks I've had. Of course, this review is based solely on their desserts and not their hot food. But really, it's more of a after-dinner dessert place anyways in my opinion.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "fage5ilSznub2V_3ndfPow",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. (left to right) Matcha with Soft Serve, Matcha with Green Tea ice cream & Mochi Rice Balls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fage5ilSznub2V_3ndfPow/o.jpg"
      }
    ],
    "user_id": "FQZZsU3J88IGF8n5e3XYZg"
  },
  "I0re1nT7auwL0-chmMr7DQ": {
    "date": "5/6/2013",
    "text": "Nana and your green tea, where have you been all my life?I've poo-poo-ed this place for a bit now. I mean... the name... but when the Girlfriend and a pal suggested giving this place a go after dinner, I thought it was a perfect excuse. Eh not my idea right, so I had no choice but to try it. I think I was secretly excited. Okay, not so secretly now.Anyhow, for our post-dinner treat, we picked both matcha parfaits. Eh real matcha okay!? I overheard someone gushing about how it comes straight from Kyoto, so I was quite impressed. And then they appear. And I was pretty excited to dig in. Picture this: dark green matcha at the bottom, with kanten jelly, followed by a layer of vanilla/milk soft serve, and then cornflakes (brilliant!) and then matcha ice cream. Then depending if you ordered the cake or mochi, you'd have that as well, and a scoop of adzuki. Typing that just made me want to go back and eat it. Go see the pictures. Every layer is genius, and it all tasted amazing. I'm writing like an idiot now, because I'm just thinking of going back and having another all by myself.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "nWAyE7q1tDoOuAZRLXwKxg",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Parfaitssss",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nWAyE7q1tDoOuAZRLXwKxg/o.jpg"
      }
    ],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "z8ocTNDQNn9rQ5fDCr4Zvg": {
    "date": "1/13/2014",
    "text": "We came here because it was full house at the other Japanese restaurants in Plaza Singapura. The menu looked promising. I had the salmon and tuna chirashi don. It was quite awful as the fish tasted like smoked salmon and tuna instead of being deliciously raw. The cooked stuff was much better, likewise for the sushi. I like the beef sushi. It seemed like almost every table ordered the parfait so we had some to try. We had both green tea and hojicha versions. They were ok but I think I prefer the version served at Sun with Moon Japanese Dining at Wheelock. The corn flakes here were bigger and harder which made it harder to melt in the mouth after crunching on them. I guess I am also not a big fan of jelly so it did not do anything for me. I just left them alone. I do like the red bean paste. So maybe I should order the simpler dessert of just green tea ice cream with red bean paste. There are some not too bad food items so I guess it all depends on what you order.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "jN4esJunVhAJ1ENSZgdr6A": {
    "date": "6/5/2013",
    "text": "I have passed this place countless of times thinking it's a cafe serving desserts and green tea so I never really bothered popping by for dinner until last night when my friends cajoled me into eating there. I arrived a little late and had a late lunch of brioche with caramel, bananas & nuts (btw worst brioche ever! by Jimmy Monkey's but that's a story for another review). By the time I got there, my friends were feasting on some lovely Beef Don, Salmon & Tuna Don and a bowl of Something Udon. It looks like the friend who had the Udon had already polished up her proteins so couldn't guess what she ordered. They looked satisfied so I decided to go ahead and try something too.I ordered the Chicken Teriyaki Don. It came with a poached egg. Its runny yolk went fantastically with the savory Teriyaki sauce and sticky japanese rice. Yummy! Although the Teriyaki Chicken meat itself was only mediocre. Next we moved on to desserts. We order 2 matcha ice-creams. Almost every dessert/drink on the menu was matcha flavored. 1) The first was served with matcha ice cream, red bean paste, white mochi, on a bed of kanten jelly. The kanten jelly was light and refreshing. Not artificially sweet but true to its green tea flavor. Some would say it's blend and tasteless in comparison to ice-cream and paste but I sort of liked it. It was a refreshing break from its sweeter counterparts. 2) The second desert we ordered was almost identical to the first in that it had all the ingredients of the former except with 3 additions -  cornflakes, vanilla ice-cream and whipped cream. It was a beautiful parfait! I only wished they had laden it all with more green tea ice-cream instead of the vanilla. The vanilla ice-cream was disappointingly sweet! It sort of reminded me of the softies you can get at Mac's for 50 cents. Lastly, the drinks. The iced matcha drink was so-so. I liked that it wasn't ridiculously sweet and artificially flavored. I know some bubble tea shop (like Gong Cha) use cheap, knock-off green tea essence that taste more like a jasmine flower dipped in sugar than actual green tea. However, Nana's green tea wasn't as mind-blowing as it's name would imply. It wasn't bad either. It was just ok. For a place that inserts \"green tea\" into its name you would come to except that their green tea will knock your socks off but it didn't. It was rather ordinary. Overall, this place is worth a shot :) If you're in PS and looking for japanese rice/noodles and a good bowl of matcha ice-cream why not pop by? It's taste pretty healthy too so your belly will love you for it.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Z_M4wxiUkeUazK1EuWKTfA",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z_M4wxiUkeUazK1EuWKTfA/o.jpg"
      }
    ],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "C23HICJ92SM97x7PGUApYQ": {
    "date": "7/9/2014",
    "text": "we tried this because it was recommended by a friend. It didn't disappoint. 3 of us ordered 3 different dish, mine was fresh seaweed with udon, which i think was good and delish and healthy too. my other friend ordered the chicken karaage and she said it was good too. the other one ordered some sort of salad (i thought the serving was small) which, she also said was not bad.  we contemplated if we're going to order dessert coz it was a bit pricey. When we finally gave in, we ordered the kanten jelly with soft vanilla ice cream, motchi and red bean, it was definitely worth it.  For the ambiance, it was ok, interior and design was something new to us. Will come back here and definitely recommend it to other friends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZAjYa7rVZ8EKogE1y1dPEg",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. fresh seaweed with udon ... healthy! :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZAjYa7rVZ8EKogE1y1dPEg/o.jpg"
      },
      {
        "img_id": "7E6kV7tjXPfQkRskVa69xg",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. a bit pricey but worth it :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7E6kV7tjXPfQkRskVa69xg/o.jpg"
      }
    ],
    "user_id": "qngnHjKy96xsoT0cZfCsWA"
  },
  "Db6uanbh9mI-3R5olJTsaw": {
    "date": "11/24/2013",
    "text": "I'm a fan of their green tea desserts. Ok, I'm a fan of any thing green tea but their price is a bit steep for the dessert.Matcha Latte (S$7) was creamy, smooth and full of the rich goodness of Green Tea.Will indulge once in a while but would go for cheaper alternatives elsewhere.Couldn't say much of the service as it was subpar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5y67q7-X6Dwj0fTIghCWcQ",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5y67q7-X6Dwj0fTIghCWcQ/o.jpg"
      }
    ],
    "user_id": "ZNyfGsIwsedPlpjmoaq3Eg"
  },
  "mySSb4Z8jWcOx2I7GNwUxw": {
    "date": "7/21/2013",
    "text": "For those whose tastebuds are attuned to the over-sweetened Starbucks latte or mass-produced green tea milk, the Matcha Latte ($7) would not be your cuppa of drink. But I liked this brew as it did not go crazy with sugar. It was slightly bitter and milky, with a dark green suspension of foam sitting above the liquid.From the chilled drinks selection, the Matcha Slushy Shiratama ($9-above pic) is a matcha slushy topped with matcha ice cream and mochi. It might be good to allow the ice crystals to thaw before enjoying the \"slurry\" texture or your taste buds may be too numbed to taste anything. Alternatively, go straight for the Matcha Shiratama Float ($9) which is similar but more of a milkshake than a frozen drink.Like any other cafe, Nana green tea also serves savoury food such as sushi rolls, rice bowls and udons. The Salmon Cream Sauce Udon ($14.80) came with firm chewy udon swimming in a pool of soupy cream. I always wished there were more sauce for carbonara-style pasta but not this time as the amount was more than sufficient. Had one-third left after pasta was done. The best dish of the day was none other than their specialty matcha desserts--Parfaits. Like many others, I am often guilty of comparing Japanese food in Singapore to those in Japan. But the huge parfaits here were pure decadence, and admittedly better than Kyo Hayashi.Starting from a brownie-like green tea cake that looked like this cake from Japan, the red bean paste and delicate whipped cream, I conquered happily into matcha and vanilla ice cream, colliding occasionally with crunchy cornflakes. Stranded in sweetness, there was no end so to speak, until I reached the bottom of kanten jelly with matcha syrup. Every ingredient was fresh, especially the chewy kanten jelly that was unlike factory-made lego blocks.I personally prefer  the Houjicha Parfait $13.80 as the roasted nutty flavors intensified with every spoonful. Similar to the previous parfait but drenched in houjicha syrup and topped with houjicha chocolate gateaux, this dark brown dessert might be less eye-catching but equally stellar. Overall,  Nana's Green Tea excels in what it specializes; and that is green tea drinks and desserts. Their Uji Premium Matcha has an adult taste suitable for those who wish to sip an authentic pot of bitter brew. And for those who can't resist having sweets to end their meal, the giant Parfaits here cannot be missed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tLdp-HXKXuL0n8903ifvHw",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. uji matcha brew",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tLdp-HXKXuL0n8903ifvHw/o.jpg"
      },
      {
        "img_id": "mVFMv_7AQuofUwCXjzyN0A",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. salmon udon....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mVFMv_7AQuofUwCXjzyN0A/o.jpg"
      },
      {
        "img_id": "uQyCQfjhbE1RHUEMU3vUBQ",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. drinks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uQyCQfjhbE1RHUEMU3vUBQ/o.jpg"
      }
    ],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "d3p-MjMcDw_nbIL_lCJ40w": {
    "date": "2/26/2013",
    "text": "We ordered a matcha dessert, matcha anmitsu (well, actually I would've been more in favour of the parfaits but those looked too gigantic! perhaps tsujuru is a better choice for that).Here is what is in a matcha anmitsu ($8.80) - matcha ice cream, red bean paste (chunky! yay), white mochi, on a bed of kanten jelly (apparently Japanese traditional healthy jelly - kind of like konnyaku but without the same bite to it and not much taste). There were also some random soy beans (I think, they were somewhat salty). Little pitcher of brown sugar syrup (REALLY sweet) came with it. The matcha ice cream was pretty good! But it wasn't melting (or we were eating it too fast), so were left with a lot of kanten jelly (which really tasted healthy.. hence the pitcher of syrup came in handy) and those random soy beans. Red bean paste was also pretty good, not too sweet. I guess the balance of ingredients wasn't quite there for me. I bet their parfait is pretty good though!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Ov0EtUTTSjPBHqth8dFv9w",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Matcha Anmitsu ($8.80)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ov0EtUTTSjPBHqth8dFv9w/o.jpg"
      }
    ],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "e3QfzcDxhK3ESW-p4A4xmA": {
    "date": "1/24/2013",
    "text": "For full reviews and more pictures visit my blog.The No. 1 Japanese Cafe Nana's Green Tea has set up shop in Plaza Singapura to serve you all the delicious versions of the green drink. This is the first Nana's Green Tea Café outlet outside of Japan. Lucky us! The zen decor is a modern twist on the traditional tea ceremony space. Even though the space is very open, the use of the suspended wooden frames as table setting cleverly creates a private environment for the diners.All green tea leaves served in the Café are imported from Kyoto only, which is the most famous production center of Matcha. I love the intense fragrance of the green tea latte and how the aroma lingers on the tongue after a long sip. Best still, top it up with Matcha ice cream for a happy buzz. For the fat conscious, there's the thin version (no milk and sugar). Or go for the Hoji-Cha variation, a roasted green tea that has a smoky, slightly caramelised flavor. A whole range of hot japanese tea is also available.Other than the teas and desserts, Nana also provides a substantial food menu, the largest among all the Nana outlets. Salmon Carpaccio ($8.80) is one of my favs here. Just look at those thick buttery slabs drizzled with a light sesame and citrus dressing. It's really more sashimi than carpaccio. From the hot section, I enjoyed the Locomoko Don ($15.80). This is a juicy and tender Japanese Hamburg over Japanese rice. Absolutely hearty and well flavored. The tomato bbq sauce is a little on the sharp side but overall it is very appetizing. Lunch set is now available and there's a giveaway on my blog. Read more there!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "-hhDE_22D_9IHwy57kTIVw": {
    "date": "3/17/2013",
    "text": "I guess everyone knows what a cafe is in our modern era. By definition, it means a place for light snacks, along with coffee and tea. But because our mind has been propelled to move faster than we could handle in this new century, sometimes we grey out the terms and inject some vibrancy which we thought it'd better exhibit a work of pure genius. The same can turn disastrous when the culinary artistry try to transform the old-school to something fashionable, in hope to woo the palate of many. I still prefer the former class of food- that comes with authenticity - unadulterated by our inquisitiveness. It may be boring to some, but not when the new-age food starts to dribble its identity away with less remarkable in taste, to make matter worst.I should have read the word \"CAFE\" with a deeper understanding before stepping into Nana's instead of allowing my grouchy stomach to takeover my intelligence. Nana's Green Tea is indeed a place for light snacks, or rather, a moment of dessert indulgence to be more specific. This homegrown Japanese cafe that aims to spread the tea culture to the natives has since expanded regionally -  Shanghai, Hong Kong and Singapore. The cafe layout is similar to the ones in Japan done up with a clean and brightly-lit atmosphere, sharing the compound with Skinny Pizza. I was less impressed with the service in the cafe, often having to wave for service yet missed their attention many a times. The staffs - mostly young individuals are polite nevertheless. Somewhat inexperience, there was a spill over incident by a staff at one table, the unfortunate lady ended up with a soiled dress. Service level requires great attention here.I am glad that I needn't wave for a menu as it was given to me when they walked me to the table. Flicking the menu, those Matcha, Hoji, Chocolate, Berries parfaits are plain irresistible even on 2-D and you risk a heart contraction if you try peep at your neighbour's.While I watched the ladies digging into the tall towering sweets, I am struggling with my bowl of Chicken Nanban Don. The savoury course coincides with the candied nature of the main cast in the eatery. The Japanese is better known for their preference for lighter fare and sweet tasting over spicy variations, and so I have to reason out along the same line. The rice - stickier and mushy - unlike the texture of any sushi rice was seen cushioning the battered chicken fillet - sliced - losing its crisp. Instead of savoury, the fried item taste sweet under the dollop of tartar sauce but mimic the \"Thousand island\" cousin. I see it as a calorie-laden dish, less healthy sort though the fresh lettuce shavings did exchange for some good, along with a spoonful of sweet corn kernels at the side. When something doesn't warrant any special culinary skills to put together but requires a hefty $13.80, I start to question their valuation alongside the pricing method.I am a big fan of Matcha Latte and always get my fixes at the invincible green \"twin-tailed siren\" counter, in soy and 25% sweetened. Not missing on any, I get one at Nana's since it is famed for using good quality green tea. I opt for my regular hot brew but not the soy concoction. It arrived unsweetened, with a sugar stick to add, which was perfect for me - a control freak when comes to food. I like it sterile and so I refused to add flavour to it. To certain extend, the potion gave a sharp but soothing Matcha flavour as I inhaled its scent in the extract. The dark greenish hue mirrors the one at Starbucks but the latter has a creamier texture and is less pricey. The miserable ounces I had today was way overpriced at S$7. It comes with a taller glass when you ordered a cold, not giving the extra ml but to hold the ice cubes that made up the larger content now.The hot savory selection was somewhat narrow with a few options on Don, Udon and a few sushi rolls but the sweets made up 2/3 of the menu. So, this place is truly for the sweet-toothed but only those who are fans of the great antioxidant - Matcha. Yes, this is the hallmark of the eatery and be mindful before you make your visit.I left the cafe without a parfait since I had a bowl of \"sweetened\" don, without the slightest regret. Not sure if I will return any sooner, if I do, the reason has to be a much smaller price tag following my appraisal.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NtSO9NS6zC7dyqkRcmiDNQ",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Chicken Nanban Don - Deep fried chicken fillet in tartar sauce, lettuce and corn kernels... it tastes sweeter than savory :((",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NtSO9NS6zC7dyqkRcmiDNQ/o.jpg"
      },
      {
        "img_id": "KIyXryLulijG2xWcU0P1Tg",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Chicken Nanban Don - $13.80, nothing terrific, save your bucks.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KIyXryLulijG2xWcU0P1Tg/o.jpg"
      },
      {
        "img_id": "z1HgYa5cotJvxrYSJKVVoA",
        "caption": "Photo of Nana's Green Tea - Singapore, Singapore. Hot Matcha Latte - $7.00! U can get a cheaper yet better version from the GREEN \"mermaid siren\" counter (hint)... LOL.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z1HgYa5cotJvxrYSJKVVoA/o.jpg"
      }
    ],
    "user_id": "IIVTHna4vd7EOJJTKaS5uw"
  },
  "q_X2i4w3ZopU_-MDJdMFOQ": {
    "date": "5/4/2013",
    "text": "The dining room was full (with no line, we were told it would be 15 minutes wait, which must be some kind of policy). We got the thin maccha drink which has no milk or sugar in it except we got the one with soft serve ice cream on top. We asked for no ice after we had paid and they complied. I liked the drink. My date thought it wasn't sweet enough though. I would recommend drinking it without mixing it so you taste the sugar from the soft serve. Either way I don't think i would pay $8 for it again to take away.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  }
}