{
  "97dPjq_ZRsvVzMG_CrL5nA": {
    "date": "1/12/2016",
    "text": "I've been pass \"Togather Cafe\" numerous times and have yet to try it until today. It was around 645pm when my family and I stepped through the sliding doors. The aroma of coffee greeted us as we were shown to our little booth. Thankfully, there wasn't a queue!We ordered 3 main dishes - Vegetarian Pasta with tomato based sauce ($8.90), Italian Herb Crusted Fish n Chips ($9.90) and a Seafood Aglio Olio ($9.90). I had the Vegetarian Pasta.The pasta was cooked to perfection - it wasn't too mushy neither was it too crunchy; just the way I like it. The sauce was amazing as well. It didn't leave a garlic after taste in your mouth like some sauces do. The pasta had vegetables like broccoli, carrots and cauliflowers. And the portion was just enough for 1.However, I didn't quite like the service I received. Maybe the guy was just having a bad day or maybe it was me, but I didn't find them too friendly - there wasn't a \"service with a smile\" feeling. :IOverall,Togather Cafe is value for money and it has a great atmosphere for getting a cup of coffee with a group of friends or just chilling with a book.ps apparently, it does get pretty packed so it's recommended that you make a reservation by calling them at +65 6445 1011Hope this helps! :)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kYplHDg9iYqLOU2-NLsNow"
  },
  "BTNIHEL451wd0PDIQzIZUw": {
    "date": "3/26/2018",
    "text": "So my friend and I decided to go to this place for dinner. We chose this place due to it's rave reviews. Before patronizing, I decided to check it's opening hours (please refer to image) and phone number to make a reservation. Unfortunately, my call was not answered despite dialing them thrice. Thinking that the restaurant's pretty busy at that point in time, we decided to just walk-in. Upon our arrival, we noticed that the restaurant was closed due to renovations. It was so disappointing! They could've updated the status of their cafe online or at least passed the information via an answering machine. We wasted our time and money traveling all the way to Bedok for nothing!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g0Y7ORsHyJeOvpKRSE9VSA",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g0Y7ORsHyJeOvpKRSE9VSA/o.jpg"
      }
    ],
    "user_id": "onKAjw6w7NeMN9SD3uR8-A"
  },
  "ByfB82tv2mWojMkMEfEDww": {
    "date": "9/25/2017",
    "text": "Love love love this family owned joint! If you love a noisy yet relaxing  place where everyone jst chatter all at once, then come on down. Not to mention the grub is not too bad too. Just be ready to fight for your place with the students after school.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "veeXPa2i1BX1xz3cH4w0ew",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/veeXPa2i1BX1xz3cH4w0ew/o.jpg"
      },
      {
        "img_id": "6y8wweSIkBCSX2udFi8hAw",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6y8wweSIkBCSX2udFi8hAw/o.jpg"
      },
      {
        "img_id": "HftOfC_PZ2uD14Ej21id5g",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HftOfC_PZ2uD14Ej21id5g/o.jpg"
      }
    ],
    "user_id": "zBXtbh4oggk0Kp8Gy6fDhQ"
  },
  "_3-zsvl6U8lgeE6qWbl6Iw": {
    "date": "7/8/2017",
    "text": "I really like this place, price reasonable, food is good. Staffs are concern about our needs. Highly recommended.However, I didn't put 5 star because week-end always crowded, need to queue up....",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COGDml8wCml7JNP5nyM-kw"
  },
  "s_Jd5CjEYjHrkJhCd0OBRw": {
    "date": "5/26/2014",
    "text": "Was in the area and decided to pop in for a after-dinner thingie...What struck me first was how beautifully put together (no pun intended) the cafe was designed and decorated. It is evident that the owners put a lot of themselves into this cafe! The theme of the cafe is simple and every small detail is aligned with the whole feel of the cafe. I can't explain well, you need to come and experience it for yourself. I was so moved by the cafe that I was inspired to (one day...far far later) own a cafe of my own and to have my own feel translated into the cafe.Now to tell you a little more about the food. The desserts are actually quite good. Not sure if they make them on-site but it's good nevertheless. The drinks are no bad as well. All in all, a great place to just come and hang and talk and chill!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sH__ScR8E2MnNuczAmZ2pQ",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Pot of Tea - Earl Grey Lavender",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sH__ScR8E2MnNuczAmZ2pQ/o.jpg"
      },
      {
        "img_id": "GqWYs9-MpYaqOXiQjsbP0g",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Choc Truffle Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GqWYs9-MpYaqOXiQjsbP0g/o.jpg"
      },
      {
        "img_id": "htRl_3Bp-asa9dQAHYg7tA",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Butterscotch Flavoured Latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/htRl_3Bp-asa9dQAHYg7tA/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "djBZQw7R_tcR_xhzgE1SAw": {
    "date": "3/18/2014",
    "text": "Set in a neighborhood in Bedok North, just at the back of the famous block 85 Fengshan food centre is this unique cafe in the neighborhood. It is absolutely friendly for students as they are entitled with discounts on weekdays! It is cosy and though the place is small, you don't feel crowded and also retain your privacy with friends. The name and decor tells it all that it's goal is to help people gather with good food and a condusive place.  The baristas and servers are also friendly, making this place utterly comfortable and relaxing to be.The drinks here are priced very friendly and if you can't find a Starbucks nearby, it is more than better as an alternative. The cakes are delicious. Tried their chocolate truffles cake and enjoyed it loads. Gonna try their dinner menu soon and update on this review.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UYr86_F1etb5KArmjpzr9g",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UYr86_F1etb5KArmjpzr9g/o.jpg"
      },
      {
        "img_id": "lDWit3ViMXYi0E4ar4zcRQ",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lDWit3ViMXYi0E4ar4zcRQ/o.jpg"
      },
      {
        "img_id": "c0344elkOKidOhvT1XSc5Q",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c0344elkOKidOhvT1XSc5Q/o.jpg"
      }
    ],
    "user_id": "69BnQt-ykPsqriePrJKIqw"
  },
  "QJo0MOIRGN5XPALYZBS8LQ": {
    "date": "8/23/2014",
    "text": "a lovely place to end the night in a part of the country that i hardly ever go to.this little gem in Bedok North is nicely tucked in a rather quiet part of the neighborhood. i love the cosy and warm decor (apparently it recently got remodeled and expanded as well) and the ample space throughout the cafe gave me plenty choices to choose where i want to be seated; there were booths for 4 as well as single tables for 2 or huge tables for groups inside and out. the prices are really reasonable and one of the lowest throughout all my cafe hop experiences and I'm glad to see the quality as good as those cafe charging higher prices. definitely a place worth checking out and returning to.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "t0x-tXmGfOzuErr1ReyNMg",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Cafe bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t0x-tXmGfOzuErr1ReyNMg/o.jpg"
      },
      {
        "img_id": "gVxlc985OKbJq2JIgRs2Tg",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Interior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gVxlc985OKbJq2JIgRs2Tg/o.jpg"
      },
      {
        "img_id": "4W2_uQ5C3kMPzhh3E7PGVA",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Kiddy corner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4W2_uQ5C3kMPzhh3E7PGVA/o.jpg"
      }
    ],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "QSVhGcPugjJnVjricwHPeg": {
    "date": "5/27/2016",
    "text": "Affordable price for a cafe around the Neighbourhood. Love the atmosphere here, very lively and renovated well. The food portion is good and it's often crowded.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRjk2PQoMQffOUdA8OzdBg"
  },
  "7yKy_PLlYSQDg4RXHI3ocw": {
    "date": "6/27/2015",
    "text": "Service and food quality is great for it's price tag. A cafe right in the heartland housed under a hdb block is hardly where you'd expect to find a hangout haunt but is positively surprising. Don't expect a quiet place to chill though -was there on a Friday evening and the place is PACKED. Bumping shoulders and loud conversations.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qr-6vimmN0dlgf-iqFaRyw"
  },
  "ljSsLa7Pjabl3yd7FxaOXg": {
    "date": "7/10/2015",
    "text": "My brother's fave place. Snugged in the Bedok neighbourhood (the area which I always think birds won't lay eggs), I think it's a good place to have a quick but nice dinner. My brother said that this place is full even on weekdays. Ran by a mother-daughter team, I feel this place is way above average than other cafe. Tried both grilled chicken chop and grilled ribeye steak. While the grilled chicken chop is nice but the steak I feel was just ok. Tbh I feel Aaron's does a bit better. But hey, I'm not complaining. Would definitely come back again, coz they priced the meal well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q0r9rO8y_9GDHPVuhp2AgA",
        "caption": "Photo of TO-GATHER CAFE - Singapore, Singapore. Grilled chickie chops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q0r9rO8y_9GDHPVuhp2AgA/o.jpg"
      }
    ],
    "user_id": "W8KaGjR7Ge8SmXAQRMRnDA"
  }
}