{
  "i6F4c6A3l2ulSwyH397z8Q": {
    "date": "7/12/2018",
    "text": "Love the seafood here and the food concept. Oysters are fresh and so are the staff, the service is impeccable.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_UXV_a_BZkk3UE8sgnO_xw",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_UXV_a_BZkk3UE8sgnO_xw/o.jpg"
      },
      {
        "img_id": "TELOvUVx1EjdPfu8yIK3_A",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TELOvUVx1EjdPfu8yIK3_A/o.jpg"
      },
      {
        "img_id": "nk8DHXx2T4uP22d6zcdh2A",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nk8DHXx2T4uP22d6zcdh2A/o.jpg"
      }
    ],
    "user_id": "biWgkMbU56JKU2aApOt4qA"
  },
  "oBlTZFS6Ti08F58CL3KrkA": {
    "date": "3/27/2018",
    "text": "Stumbled upon this place by accident (my mother wanted to celebrate my husband's birthday at a now-defunct, Roosevelt - moved), and it definitely exceeded my expectations. They had free flow mimosas, and judging by the happy (and loud) Japanese group next to us, they were good. They're kind of like a tapas place, so some of their portions may seem a bit small, but it's so you can order a greater variety of food to try!The food was real super! I had the sea urchin with cauliflower purée brioche (SUPER TASTY! strongly recommend) and the lobster roll (the bun was well done, and the fries were crispy). My family also tried the Mac&Cheese balls (creamy!), mushroom and burrata (cant go wrong with burrata!!), fish & chips (really generous for the small portion), carbonara, buttermilk fried chicken (I dare say this was the best fried chicken I've eaten ever), and the wagyu steak. They also make a mean panna cotta and churro!Recommend: BUTTERMILK FRIED CHICKEN",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_M8EMouwLm3kANzOyHWLVg",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_M8EMouwLm3kANzOyHWLVg/o.jpg"
      }
    ],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "1FhD26rr1PG8OdR7opMJbA": {
    "date": "11/2/2018",
    "text": "Stopped by on a whim.  Oysters were excellent.  Nice atmosphere, good bar.  Recommend it for a solid teaser before a night out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bpOKj54V3l8Xy9Sq5MSjJQ"
  },
  "euLNoCvHyBBUbW57u7oF1A": {
    "date": "5/27/2017",
    "text": "My husband did some research and planned the night of drinking and dinner at basically a one stop shop. Drinks at Gibsons to start, then dinner at HB and night caps at flagship. All conveniently located in the same building.The star was definitely humpback. We ordered oysters, the ones from New Zealand were our favorite. We split several of the tapas style dishes and will forever crave the scallops, cabbage and churros. The ceviche was refreshing and had high expectations of the pork but probably try something new next time. The scallops with bacon and brown butter was unreal. The herb cheese with the roasted cabbage, perfection. And I don't think I've ever ordered cabbage on a menu before. I will definitely try to replicate the whipped salted Caramel style butter and cocoa churro. Such a memorable meal!! Also, had lobster bloody and it was the perfect amount of seafood and spice.Cute ambiance and vibe.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TVIYOsRzbA1d-QLpE4hCpw",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TVIYOsRzbA1d-QLpE4hCpw/o.jpg"
      }
    ],
    "user_id": "cbPN0KNwpDMfIvCTieIj5A"
  },
  "qxyG-T6MwMmKzK2IIqRQzw": {
    "date": "8/1/2016",
    "text": "This place is one of my favorite places to have brunch in Singapore: great food, good service and fun atmosphere!I came here two Sundays in a row and although the staff was not completely the same team, the service was always super friendly and prompt.I love their reasonably priced oysters and their selection of brunch cocktails - the DIY Bloody Mary is a hit, even without the ranch dressing.Their dishes are well executed and show a freshness which is often difficult to find, especially on brunch menus. Heck, they even made me fan of their kale dish!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_Lj6uYR3n4CbZ7jAHXNIUA",
        "caption": "Photo of Humpback - Singapore, Singapore. Mix & Match Bloody Mary menu: I see there is one key ingredient missing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_Lj6uYR3n4CbZ7jAHXNIUA/o.jpg"
      }
    ],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "qlPn6UZZwvKpLjBpB4_Ihg": {
    "date": "10/21/2015",
    "text": "Opened by the owners of Jigger and Pony, this is a relatively new place along Bukit Pasoh Road. There is a choice of outdoor seating but it is prohibitively hot in Singapore sometimes. I made an online booking via a third party website for 5 people on a Monday for 8pm a week in advance, and was surprised that there weren't any tables for 7pm ish. Steffi C and I arrived early, at 730pm and surprise, our table wasn't ready, and we sat outside. We ordered a few oysters but they only came 20 minutes after, when our table was nearly ready. We tried to hurry this Eurasian-looking server for our table but he was sort of... curt. Never mind.The fuss about Mondays at Humpback is because oysters are half price here, all-night. They do have half-priced oysters everyday, but only from 5-7pm, which most working people cannot come on time. You might want to avoid Mondays if you want half-priced oysters and have 5-7pm on another day free.They have a comprehensive cocktail menu, but I prefer my cocktails orders to be taken by a bartender and customized to my preference. We opted for a Riesling on our very nice server's recommendation.Because we were a party of 5, we got a few small plates to share, apart from the oysters. We had the burrata (yum!), gruyere and feta tapioca balls (yum!), brussel sprouts (I felt it was undercooked but my friends liked it crunchy), pork (too pink for my liking), wagyu (not bad), calamari (yum), tuna (we didn't realize it was raw, 3.5/5). The oysters were fresh, sweet, and nobody had the runs after. Not all varieties of oysters were available, as they source whatever is available direct from Washington state, US. I do love my PNW seafood. My peeve about the oysters were that for more than 20 oysters, they had a tiny pot of vinaigrette. Passing the little jar around was quite annoying.The unexpected star of the meal was the chocolate mousse. I will be sure to order my own portion next time I come here. Bill came up to about 75 per person, but we had wine and oysters and many many plates to share. I imagine it would be more expensive on a non-Monday. Book your seats!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_1PkRCuaK45SoFFwTw9lLA",
        "caption": "Photo of Humpback - Singapore, Singapore. Wagyu.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_1PkRCuaK45SoFFwTw9lLA/o.jpg"
      },
      {
        "img_id": "qmDcJB7oA6Eau7lx67sXUg",
        "caption": "Photo of Humpback - Singapore, Singapore. Calamari",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qmDcJB7oA6Eau7lx67sXUg/o.jpg"
      },
      {
        "img_id": "2iN9znZMir2HT9a5lSesww",
        "caption": "Photo of Humpback - Singapore, Singapore. Pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2iN9znZMir2HT9a5lSesww/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "3ebsJupjL5HfXR5qtjfzYA": {
    "date": "2/4/2018",
    "text": "Great nice oysters from US but missed those big fat juicy ones from Seattle. It's not a bad place to chill with friends",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlczQk07U1I8NBtt5cGYDA"
  },
  "YX_QVL4fimNKpdwIT9gTPQ": {
    "date": "11/23/2016",
    "text": "I am quite impressed with the Knowledable of the servers here.  The lady that helped us was very nice and informed us of her knowledge of the food recommending the seafood sausage.  The food here is very good indeed, however they do not have the world perspective since they do not know about horseradish sauce or cocktail sauce.  It's great in a pinch, especially for a oyster bar in Singapore this is as good as it gets.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cDqiNAKEz9hRxI1k7xNx9Q",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cDqiNAKEz9hRxI1k7xNx9Q/o.jpg"
      },
      {
        "img_id": "JNEJJqmZFIRmbQ9I3z13Tw",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JNEJJqmZFIRmbQ9I3z13Tw/o.jpg"
      },
      {
        "img_id": "BVCY6Q6BaLgCaADwhKJ_8w",
        "caption": "Photo of Humpback - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BVCY6Q6BaLgCaADwhKJ_8w/o.jpg"
      }
    ],
    "user_id": "9Vmqj86WQ6WTU8SdSkfBCA"
  },
  "ZQaq9cr4nFMp1pX8tsnYqw": {
    "date": "3/1/2017",
    "text": "Humpback is one of my favorite places now for oysters and booze and their happy hour is a great deal.  As I am from Seattle, I was drawn to the place as they advertised themselves as a Seattle-inspired restaurant.  So does it feel like Seattle?  Sort of.  I really appreciated the fresh oysters from the Pacific Northwest, and having some West coast brews available.  The small plates are also quite good, and we enjoyed both the hamachi ceviche and calamari.  But the menu is a little all over the place - lobster roll, ceviche, cheese balls, etc. The cocktails are decent, especially at HH prices, but not mind blowing.  And I wish that they had some American wine options as well.  I loved the bright airy space, and it's a great place to start the evening.  Definitely worth checking out!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "UxJqX64xPt5rp8V3d9Shjw": {
    "date": "11/1/2015",
    "text": "I confess, it's rare I've fallen this hard and this fast for a new restaurant.Even more so when service can be spotty (though they earnestly try), and the cocktails, while good, aren't really up my alley. And while the oysters on offer certainly are fresh and yummy and great value during happy hour (5pm-7pm) or all-night on Mondays... the real food. The proper food. The cooked food. Oh how brilliant it is.It's all small sharing plates, and the menu says order quite a few dishes for just two, but frankly we find that's a little generous. For groups of 4-5, between 8-12 dishes is more than plenty. What's good? Almost everything. Twice I've been and twice I've ordered all the garden dishes. The Brussel Sprouts are to die for. When you pick up everything on the plate you get salty-sweet-charred-heat all in a mouthful. The cabbage too. The burrata has been on fleek each time I've ordered it, and the Snow Crab and Manila Clams have me wiping the dish clean with the awesome bread each. And. Every. Time. I'd give the fish dishes a miss, I tried the tuna, the rainbow trout, and the ceviche and all weren't as impressive as the other offerings. For proteins I like the chicken more than the beef or pork. It's a well-crafted dish... though companions liked the beef very much. The pork was kinda meh. And definitely have desserts. There're only two but both are good solid sweets than really hit the spot. I prefer the panna cotta because it's not as sweet or rich as the chocolate mousse, but if you like a good mousse, this is as good as you'll find anywhere. ANYWHERE. IN THE WORLD. So... y'know. It's called Humpback. That's why you'll have A WHALE OF A TIME. #justsaying",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Ldm99bYMJ55vACBqn8duLg",
        "caption": "Photo of Humpback - Singapore, Singapore. Outdoor for brunch. Bit warm though!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ldm99bYMJ55vACBqn8duLg/o.jpg"
      }
    ],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "cRDhFWN3e0KlmGNpuTYh9A": {
    "date": "7/16/2016",
    "text": "We were warmly greeted and shown to our table which was at the bar. From here we could watch the oysters being shucked. With happy hour running from 5-8 we choose to get a dozen oysters from $2-$4 per oyster. The 3 varieties were all from the US and were very tasty. We moved onto the next course which was scallops in burnt butter (delicious) and smoked salmon dip. The dip was full of flavor and went well with the pepper crackers. To finish off we had the lobster roll which came with fries coated with cayenne pepper for a lovely spice and the yellow fun tuna with avocado and cucumber. Another great dish. The staff were all very friendly and kept our water glasses topped up and the cocktails coming. A great place for a meal.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iQYcNKjKiohfH26oYxfK6w"
  },
  "A8JR7wB6JvGWEsm7WP7vQw": {
    "date": "10/28/2015",
    "text": "I love oysters, though they have been more of an indulgence in Singapore because they are so overpriced here! Until the day that I found out about this place through Natalie H. \"Oysterssssssssss\" was all she said, and I was in. The $2-$3 oysters (5-7pm on weekdays+saturday, all day on mondays) drew me to this place, but what really made me like it were the sides that we got. They're the guys behind Sugarhall in Telok Ayer too, which also has excellent sides, and I wasn't disappointed here.I really cannot find another bad to say about the sides we got. Well ok the pork was a bit pink, not sure if that was on purpose but I did recall someone at work (I'm in healthcare) telling me that you should NEVER eat raw pork and hence my fork stayed far away from THAT dish. Otherwise, the burrata, feta tapioca balls, wagyu, calamari, brussel sprouts and tuna were all excellent. I think I might come back just for the sides next time. The sides were bigger than I expected, enough for each person in a group of 5 to get a taster portion and just a bit more.Service was... well they were really crowded and busy on a monday and MAYBE there was just one poor guy shucking oysters because that's the only reason I think of to explain why the oysters took so long to come?I'll still come back though. Maybe not on a monday night.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "QwtC8LnJ1sLlNtseQS11ag": {
    "date": "2/10/2016",
    "text": "Finally a legit oyster bar in Singapore! We went during happy hour (5-7pm) and all oysters on the menu were for $3 a shuck. Variety of 3 oysters were available and served with lemon, horse radish and vinaigrette. Great service; knowledgable and super friendly staff. Our server told us about the oyster farm in DC where they order their oysters from. We were told that Hama Hama oysters are a staple on the menu, happy to hear as they're definitely a winner. Side dishes were delightful, we ordered the bread with beets mole and the burrata. Beers on tap were great and the wine selection was vast. We'll definitely be back for more! FYI they've just started a Sunday brunch menu and will have oyster happy hour during brunch service as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-h5sl0ACQ3VCySke2F4PKw",
        "caption": "Photo of Humpback - Singapore, Singapore. Oyster spread; Hama Hama, Eld Inlet and Blue Pool",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-h5sl0ACQ3VCySke2F4PKw/o.jpg"
      }
    ],
    "user_id": "SMesVaPTVNRJz-Ztj6jYHA"
  },
  "WU-2XDN7I3io7CF_RTiOEg": {
    "date": "2/18/2016",
    "text": "Buzzy ambience, great seafood, and awesome service. Lovely brunch spot.  We had:1) Fried Egg ($14) with a sunshiny octopus-laced orzo, and spiked with tete de moine: The sous vide egg , breadcrumb-coated and fried to a beautiful crisp, stayed perfectly soft-boiled on the inside. Excellent execution. A signature here, and for gd reason  2) Strictly as a matter of preference, I preferred the Scrambled Egg ($10): the eggs were very well done, fluffy and moist, and complemented with asparagus, prosciutto, and toasted sourdough  3) I'm not the biggest fan of lobster, or mayo, so I was surprised by how much I liked Humpback's tobiko-flecked Lobster Roll ($39), rich and buttery and creamy and meaty  4) Buttermilk Fried Chicken ($10) with sriracha: typical American South soulfood. Delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tieQ1FQ3BdXO7PjShPE28g"
  }
}