{
  "Yfavzf_EgAyHISLaOhUzKw": {
    "date": "10/18/2015",
    "text": "Just enjoying another wonderful time here... always so relaxing... We had a perfect coffee break (very good!) and I craved what I think it's the best dish for this hot Sunday: THAÏ BEEF SALAD!!soooooooooooo yummyDon and his team are so helpful and it's just always such a pleasure being around here!!Highly recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2M1e-8uHpNVcerx_yPPI_g"
  },
  "_Ytmkl-_XxuvcFHhdh0iZA": {
    "date": "1/28/2016",
    "text": "Another cookie-cutter hipster cafe in Holland Village. I only stopped by for a quick drink and a chance to sit down and catch up on emails.The passionfruit soda was quite surprising; I noticed it was taking a while to get my order through (and I was one of 5 people in the place mid-day) but once served it had a mix of fresh herbs. Nice touch.What's lovely about their space is that you can sit out on the patio, inside, or on their second level, which has a cosy nook with a couch in it. You can also grab a hipster publication to enjoy during your stay.Perhaps the food warrants an extra star, but seeing as I couldn't even remember the name of this place (and I visited 2 days ago) I'd leave it at a-ok for now.",
    "rating": 3.0,
    "rated": {
      "useful": 9,
      "funny": 5,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "vVyjlcV1QTORJWT9RWBTEQ",
        "caption": "Photo of Breko Cafe - Singapore, Singapore. Cozy nook on the 2nd level",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vVyjlcV1QTORJWT9RWBTEQ/o.jpg"
      },
      {
        "img_id": "viAcktUfQNBVDqPungos8A",
        "caption": "Photo of Breko Cafe - Singapore, Singapore. Magazines on the 2nd level (and Chinese New Year 2016 hours)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/viAcktUfQNBVDqPungos8A/o.jpg"
      },
      {
        "img_id": "DXOTkNh3z8mf5WMMi7lK-w",
        "caption": "Photo of Breko Cafe - Singapore, Singapore. Passionfruit soda: a lot more intense then I thought it'd be, haha",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DXOTkNh3z8mf5WMMi7lK-w/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "pz038VIjS6yuvXmUk7Uxdg": {
    "date": "6/21/2016",
    "text": "Had lunch with a friend here the other day. The all-day brunch menu has good variety.  I had baked chicken, which was a huge thigh and drumstick, with corn, mashed potatoes and mushrooms. Serving size is generous, for 15 bucks. I was happy with our pot of tea, made from leaves and thick enough for multiple refills.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OTx8lNo-62V2rmAKkvAb1A"
  },
  "-BpN2fuW2XlzwjwHcuY7VQ": {
    "date": "10/25/2015",
    "text": "The pancake stack was good but astonishingly tiny. 4 small, thin pancakes (about 8cm diameter each) for $7.50++ ($8.83 nett). A few years ago it was $5.90++ ($6.94 nett) ... with free-flow coffee included!It's tastier than McDonald's hotcakes, but Mc's is only $4.60 nett, bigger (3 larger hotcakes), and usually found in more convenient locations. All things considered, I'd recommend McDonald's over this place's pancakes. (Eh but if you are ang moh you should know that Singapore McDonald's is not as crappy as in the US.)This Breko take bus or MRT to Holland V aredi still must walk so far in.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RgHz5ipSdr2YvUN7JbXLSg"
  },
  "ofL_agRM4PNv54uJNu9R7Q": {
    "date": "10/2/2015",
    "text": "I was sceptical of this place set at the back of Holland Village. I was pleasantly surprised with how fresh the food was here. I had the club sandwich which was very fresh. It was quite weird though because I got my fried egg on top of my closed sandwich. My partner had the baked salmon with lemon sauce. We felt the sauce should have been on the side. Overall decent food for a great price!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mE_9VmYIoUrf78R2decIQ"
  },
  "2CWVWJStWx2rm2iiahCwjQ": {
    "date": "8/23/2012",
    "text": "Breko has been open for business at Holland Village for as long as I can remember. I remember flocking here during the weekends while I was still in junior college to while saturday mornings away - that's a full 8 years ago! Food wise, Breko is decent. Do not come expecting michelin star worthy cuisine and you will not be disappointed. It serves the usual bistro fare - burgers, cordon bleu, sausages, sweet cakes. Nothing to write home to your mother about really. The good thing about Breko is its informal atmosphere. At night, it becomes really lively, with customers occupying the alfresco tables, chatting and people watching. Oh, yes. People watching. Breko is fantastic for that. It is located beside and opposite the bar area of Holland Village, and it's fun to just sit there and judge the assorted crowd that flocks to these bars.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDcJsT-IhVMH6sO19V_nbg"
  },
  "2jEGiJQmMoJmP7Rjoh-ncg": {
    "date": "1/13/2013",
    "text": "$12 for a decent selection of 2 bottled beers... what's not to love? I had Stella Artois while my friend had Coronas. It was a pretty cool evening so we seated right outside on the pavement next to what is now a walking street, so it's pretty great for people watching.Had the Chicken Cordon Bleu, surprisingly big portion with 2 sides (I chose mashed potato and pasta salad)  and fairly decent tasting as well. My friend adores the tictactoe fries (waffle fries really) which are pretty crispy.Decent spot it you're looking for an affordable night out!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "J67eFN0-W0ykPpFPC7r7Qg": {
    "date": "7/29/2015",
    "text": "My husband and I just tried this place out for breakfast. Overall the breakfast was pretty good. The place was clean and the staff was  as helpful as they could be. My husband had the waffles with salad and bacon. All very good, the waffle was delish! It was crisp on the outside and soft in the middle. The salad,mixed greens with a classic Italian dressing, was also very good. My only complaint would have been the fact they served it atop the waffle, brilliant presentation, but I don't want my waffle to taste like Italian dressing in any way shape or form. All that aside my husband had no complaints. I ordered the brekkie in a pan, very flavorful! The eggs we're runnier than I would like, but after asking them to recook the whites it was a delightful dish. The pricing for breakfast is probably the most reasonable I have seen in Singapore, the entire meal was s$40! Will definitely go again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1g3cpzcw_eITgTcPi6XmCQ",
        "caption": "Photo of Breko Cafe - Singapore, Singapore. Cappuccino and peppermint tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1g3cpzcw_eITgTcPi6XmCQ/o.jpg"
      },
      {
        "img_id": "D6kVWn38EioK0beM6lcInA",
        "caption": "Photo of Breko Cafe - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D6kVWn38EioK0beM6lcInA/o.jpg"
      },
      {
        "img_id": "GKazwtC380Zi2Mn0il5LwA",
        "caption": "Photo of Breko Cafe - Singapore, Singapore. Waffle with salad and bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GKazwtC380Zi2Mn0il5LwA/o.jpg"
      }
    ],
    "user_id": "cIdh1PWm1hJubfrNBU6T7Q"
  },
  "N-yzTZCHlyRTKvO4u4GOWw": {
    "date": "4/25/2013",
    "text": "I discovered Breko café a couple weeks after moving to Singers. While wandering around the Holland Village area, my stomach decided it was time to eat and fill it with a beer or two as well. While walking down a cute road with many food and drink options, I decided to stop into Breko because of their 1 for 1 beer special for $12. Two beers for $12 in Singapore is a steal, seeing as drinking in this town can be quite expensive. Their food menu was pretty impressive as well. I decided to grab their fish fillet and waffle fries while my wife decided on a pasta dish. Both came out well presented and tasted good. We ordered a couple rounds of Corona's as well which went great with our food. Overall, the food was good and the beer special was awesome. We definitely plan on hanging out here again when in the neighborhood.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r12LeUHKdGxQlQ_q_cd7QA",
        "caption": "Photo of Breko Cafe - Singapore, Singapore. 1 for 1 for $12. Great deal.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r12LeUHKdGxQlQ_q_cd7QA/o.jpg"
      }
    ],
    "user_id": "sg7ckPotdcAeIKf0n3GApg"
  },
  "mKmXlQ3I0CbHLr0kiqRA_w": {
    "date": "8/9/2012",
    "text": "This place is good for afternoon beers and people watching. It's two bottles for about $20 and I normally have the Asahi with an order of a half slab ribs(the ribs aren't super, but decent). Breko does a good job with their wedges so if you can, get the wedges instead of the fries. If you're a bit of a sweet tooth like I am, give the mocha float a go too! Friday and saturday nights are often very busy for this place and I'd normally stay away.Who wants to wait in line for a seat? The one cubicle loo system also makes this place less attractive when it's crowded. One thing is to be said that if you could, do avoid driving to Holland village, parking is always a bit of a challenge and since the new MRT circle line is up and running. It would be more fun taking the train if you can. I've spent up to half an hour in the Holland village car park just waiting for a space and that usually spoils the whole outing experience for me.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dj72iGHf6TNoh1KorpY4aw"
  },
  "N9MD4_MAAgyCAfP-2G2BfA": {
    "date": "8/29/2012",
    "text": "Breko is a casual café in the Holland Village row of restaurants. They have an all day breakfast, sandwiches, salads, main courses and desserts. It's a nice casual place to get a meal and is reasonably priced. They have outdoor and indoor seating. I usually get sandwiches when I come here. The vegetarian sandwich is actually pretty good and is filled with avocado and fresh greens. I haven't tried their all day breakfast but they have things like pancakes and eggs. Looks good on the menu so definitely something Ill come back and try.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uS-AB15norJg7BBXC_MGPA",
        "caption": "Photo of Breko Cafe - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uS-AB15norJg7BBXC_MGPA/o.jpg"
      }
    ],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "R7Db70sNYMvHBIlFWikxSA": {
    "date": "3/27/2014",
    "text": "Before Holland Village lost it's charm to commercialization, Breko was the the to go place for great food at great prices with the likes of the ribeye steak pasta. It's long opening hours and cheap beer also made it the perfect place to catch football matches without too much buzz. Had a hot chocolate there recently, although not superb, it is still a great place to kick back among the many eateries that line the stretch. After all, there must be a reason they have been around for so long.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "GFAHNNBMqHQfrIWhhddyCA": {
    "date": "2/25/2013",
    "text": "food was ok... not that fantastic. Ambience was quite ok as well. food proces were really reasonable and the quality of food wasen't too shabby.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A-lAfDshBVUUPzftplUn0A"
  },
  "vekR54YQH8m6mP84YTP1Lg": {
    "date": "10/27/2013",
    "text": "Good value for this location. Beats all other western restaurants trying to do the same thing on this street.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kaGNWFvSm2jlR_lzsya5PQ"
  }
}