{
  "HgWUEdIar6XLEcQneXdyOw": {
    "date": "6/24/2017",
    "text": "Outstanding, this is my favourite nasi lemak in Singapore. Uses basmati rice, which absorbs the coconut milk a little better than ordinary jasmine rice. The rice is somehow flavourful without being too heavy with sauce. Sambal was good as well, both sweet and spicy. The other ingredients were about par for the course, but I reckon if you get the rice and sambal right, you can't really go wrong.Queue took about 30 minutes around noon on a weekday.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "iMpvQKysF7cUSD9Lk9ahew": {
    "date": "3/17/2016",
    "text": "Last year, I had one the best dishes I've had in my life. This was a much hyped trip to the Adam Hawker Center to try the famous Selera Rasa Nasi Lemak. I have watched many videos including YouTube food blogger, Mark Weins, in my preparation for my trip to Singapore and for this dish. Be warned of the immediate long lines as this is by far the busiest stand in the hawker center. I remember waiting for a half-hour and seeing my friends enjoy their dishes from the other vendors. The wait is long, but luckily, you will be able to relate and potentially make some friends while waiting. Once you reach the register, you will have the option to order one of seven dishes depending on how much variety / portion / adventure you prefer. It begins with the simple \"Flash Meal\" of rice, eggs, cucumbers, and anchovies to the right spectrum of the \"Royal Rumble\" which has all of that + the side dishes and is about 3x the size. I wanted to get the full experience and understand exactly what makes this place unique, different, and regularly visited by the president of Brunei (one of the famous regular customers) of this establishment. Hence, I ordered the \"Royal Rumble.\" - Royal Rumble (+5/5) - This dish was incredible. I had to spend about 5 minutes in the beginning to analyze and take the pictures that it deserved. The Nasi Lamak is packed with coconut steamed rice, anchovies, fried egg, chicken, pandan wrapped leaf thingy, and flaming hot chili paste. It is a one, two, punch. - One of the greatest dishes I've had and a beautiful representation of Singapore and its neighboring cuisines. Make sure to use your left hand to eat this dish as utensils will do no justice. Overall, this is hands down a beautiful dish and one that would make me fly to Singapore for!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TVcpMp45_4LYvuqsr1yF7g",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore. Excited to finally order after waiting for a mere 30 minutes.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TVcpMp45_4LYvuqsr1yF7g/o.jpg"
      },
      {
        "img_id": "EKVOFCPQFfs_gtuC_PFQBw",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore. \"Royal Rumble\" Nasi Lemak (5/5)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EKVOFCPQFfs_gtuC_PFQBw/o.jpg"
      }
    ],
    "user_id": "iBhjhnk2klRkru6qGPnu0w"
  },
  "tUtw_C8PszhnmdhhOoTbkg": {
    "date": "2/13/2017",
    "text": "Royal rumble ($5.90) - 3.5 starsIt was a 15-20 min wait on a Monday around noon. The good: probably that the fried egg wasn't over cooked (the yolk was all yellow and didn't have a blue-ish grey exterior), the fish was less dry than the one at No 1 Nasi Lemak next door, the rice was light, and there were no peanuts (not a big fan). Otah was alright. But overall I'm not terribly impressed. I guess I'm not picky about my nasi lemak and I'm content with nasi lemak and nasi padang dishes at most places.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "-omKx_S5odSdlaIlhilfjw": {
    "date": "5/29/2017",
    "text": "Review for Nov2016 - Queue wasn't too long, maybe 15-20 minutes during the lunch hour and can't recall if I got the Full House or Royal Flush, but was definitely very delicious and would come back again. Everything was fried just right and very flavorful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbwtabHH47kmn79f-H_KvA"
  },
  "PTm9yKESQSvu3sqRb4B6ng": {
    "date": "11/27/2016",
    "text": "I actually timed the queue, it came to 39 minutes. He will sign first \"come here and what do you want\" then \"eat here or take away\" (I was confused, hence putting it out there for future visitors). The rice was a bit soft for my taste, too salty, and with not enough coconut (but you can really smell the pandan as a result). The ikan billis was not sickening for a change. The chicken wing is a chicken wing, I mean there's not many ways to improve on a chicken wing, it's a decent wing as far as wings go. No peanuts. The sauce was the best item, sweet and with incredible scent. I could not indulge fully in the sauce due to avoiding spicy foods at the moment, which may be why I was less than enthusiastic about the whole thing, which I did not consider to be worth 39 minutes of queue (prices have bumped up too, $3.90 for the chicken set). I prefer the nasi lemaks I've had around Joo Chiat. My wife, who ate most of her sauce, thought it WAS worth it, so I'll average our ratings and give it 4*. Personally, I'll try \"No. 1\" next time, its queue is considerably shorter and you get peanuts with your nasi lemak.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T1sFDFYf_d25XK84Pc8C3A",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore. Chicken Set (C) $3.90",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T1sFDFYf_d25XK84Pc8C3A/o.jpg"
      }
    ],
    "user_id": "jvj9YfBp_XPM-3z1Es_P8w"
  },
  "HNS2HFbAWWe6doTJ1g7cdQ": {
    "date": "4/14/2013",
    "text": "I'm going to write this review without excessive philosophizing, ranting or use of the \"I\" word.  There will be no lengthy back story.  I wouldn't be saying anything new anyway, since Selera Rasa has been on TV, blogged about and reviewed ad nauseum.  Little wonder why, since this is arguably Singapore's best nasi lemak.Imagine a simple 3 ingredient high.  The rich fragrance of basmati rice simmered and steamed in coconut milk and pandan leaves, the abrupt spicy heat of a sweet chili pepper coulis, and the savory comfort of a curry-fried chicken wing.  There are other condiments, a fried egg, cucumber slices and ikan bills, the ubiquitous accompaniment to any self-respecting nasi lemak, but your brain is past caring about these other players on the plate and your eyes struggle to focus on what it is exactly that you've put in your mouth that still has you reeling.  It's the triumvirate of chili, rice and curried chicken wing....trust me.I'd like to think I know a thing or two about nasi lemak, having had it just about every Saturday for tea since I was knee high to a cicak.  So I think I speak with some personal authority on the matter of whether Selera Rasa is a worthy nasi lemak hall-of-famer.  I think it is.  I also think that Selera Rasa is a victim of it's own fame. All the media coverage creates unrealistic expectations in diners who flock here only to be disappointed when angels don't appear and next week's 4D numbers fail to materialize in the basmati.  Don't expect too much, come with an open mind and set your senses free to explore and you will come away satisfied, if not pleasant surprised.It really is just honest to goodness solid quotidian fare.  Look beyond the bull-@$!# that's been piled on these guys by the media and see it for the single specialty master hawker stall that it is and you'll see what all the fuss is about.  It's just a local stall that serves good honest nasi lemak.  No gimmicks.  No fancy service.  Just think of all the superlatives that pepper reviews of the latest French restaurant, Italian joint or Spanish tapas place; why don't those same superlatives apply here?  Based on flavor alone, I see no reasonable explanation why not...unless it's the bull-@#$% these places are throwing in your eyes.Get real, get local, hug your local hawker today and tell him or her you love her.  Creepy? Yes, but necessary, oooh so necessary!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "HGGmiibBKe1AkLfFsaEB6w",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore. Basmati Rice!  Eureka!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HGGmiibBKe1AkLfFsaEB6w/o.jpg"
      },
      {
        "img_id": "Z8pBAmG0g-Vt6MYIlwoMuw",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z8pBAmG0g-Vt6MYIlwoMuw/o.jpg"
      },
      {
        "img_id": "isvzfsgsXDpvGdGpsh9Rrw",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/isvzfsgsXDpvGdGpsh9Rrw/o.jpg"
      }
    ],
    "user_id": "2arW6KJ-BAoAfNrYC7zaPA"
  },
  "y90Hel1fQhH1yAbstz5CDw": {
    "date": "5/6/2017",
    "text": "We did timing the queue, it takes almost an hour.Probably we came at the wrong timing, Sunday brunch time.I would like to say, you can taste coconut milk on the rice, which probably quite seldom in Singapore.Nice Sambal which not too spicy, with crispy chicken wing, fish, anchovies/ikan bilis and otah.Now left with the queue, whether it worth or not is up to you, to me one hour queue probably not.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0KkIry3sNRC6-HgFbp67Q"
  },
  "qCSIPcaRhsBrAm4afOHFRQ": {
    "date": "9/13/2015",
    "text": "My first time at this stall.Using basmati rice is not a bad idea, but it is too soft and sticky.Nasi Lemak's rice should be slightly more solid and separated.Sambal Chilli is excellent.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QEgoY9E-yXd84grJEUtBUg",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore. This is my first taste of this stall. Nasi Lemak's rice should be slightly more solid and seperated.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QEgoY9E-yXd84grJEUtBUg/o.jpg"
      }
    ],
    "user_id": "YOjkj49BJXU5I0dj0zEb_Q"
  },
  "ydutmRdyQi_Uu258i2eq5Q": {
    "date": "6/25/2014",
    "text": "Adam Road Food Centre. This is another local only food place, but has been touted as the best in Singapore and I can understand why. I ordered the Full House.  Includes rice (basmati rice), thick slice of cucumber, sambal sauce, fried chicken wing, otak otak (fish paste in banana leaf), ikan bilis (small dried fish) and a fried egg. Awesome!The key here is that they use Basmati rice. Makes a huge difference.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6JN65HnnRr8N_boKGzx-xQ",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6JN65HnnRr8N_boKGzx-xQ/o.jpg"
      },
      {
        "img_id": "WUs5pZGuUvKm-1P4bcavrA",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WUs5pZGuUvKm-1P4bcavrA/o.jpg"
      },
      {
        "img_id": "6xDTCb_6NVgimKQ6Zsi7Hw",
        "caption": "Photo of Selera Rasa Nasi Lemak - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6xDTCb_6NVgimKQ6Zsi7Hw/o.jpg"
      }
    ],
    "user_id": "TMvp5YDUtrwHF4qS1eHseg"
  },
  "SSks6r_Xd1kNhi8tDhT6Eg": {
    "date": "4/30/2013",
    "text": "My parents and I used to come here every Saturday morning to have breakfast before the lines start snaking. I wouldn't go as far as saying that Selera has the best nasi lemak in Singapore, but it's pretty damn close. The Good: Basmati Rice. Begadil. Sweet & Spicy Sambal.The Bad: Long lines. Food is occasionally cold.The Ugly:People before you in line ordering 874893278932 packs of Nasi LemakCome here for a life changing experience, but be prepared to line up for a while before you get there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ncq1J7jnPTZDPRdZnHOt9w"
  },
  "cO1uukqkbT9q4rh0oeicFA": {
    "date": "4/9/2013",
    "text": "We sought this place out because it was on the Food Network, and supposedly the sultan of Brunei visits this stall when he's in Singapore.  I think their main claim to fame is that they make their nasi lemak with basmati rice, which makes it a little bit lighter.  I'm not sure that it's really that much better than any other nasi lemak I've had in Singapore, but it definitely is good.  The rice is packed with aromatic coconut flavor, and the fried chicken wing that comes with the set was crispy and juicy.  I'm also a big fan of their sambal; it's spicier than most, a little sweet, and not too salty.It's debatable whether this is truly food fit for royalty, but it's more than good enough for me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ouBdbXdi8_jmXJbgQ5Jq4A"
  },
  "oIb0ERkU2_tlnKgCWz3LIQ": {
    "date": "8/2/2012",
    "text": "To find this stall, follow the queue. Okay, maybe not quite. There are two famous nasi lemak stalls in Adam Road Food Centre, side by side. One of them is the first shop of the food centre, this one is the second. Ironically, I find that the better one is in second place. Fair enough as well, as Selera Rasa seems to be open longer hours than the other one does. Most of the time when you're there you ought to be prepared to queue up for a good twenty minutes, because many people come in line not just to order one plate, or two boxes, but a party-load of it. That just shows how good it is. The rice is always at such a good texture, though I find that its taste can be quite a hit and miss sometimes, and lacks that bit of coconut flavour to it. But Selera Rasa more than makes up for whatever's lacking with such good sambal chilli, so the rice becomes a little matter.The gold is in the chicken. The colour is so wonderfully golden, you only have to look at it to tell that it will be such a crispy treat. Inside the chicken is still so juicy and so tender, though a little oily, and it makes you wish you had more than one on your plate - which is why I always ask for two. The ikan bilis is very well fried, and as a personal bonus, don't come automatically with the nuts, as they usually tend to do, thus saving me all that time and effort in removing it.Word on the street is that the nasi lemak from this stall is one of President Tony Tan's favourite food...so 'nuff said I hope!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Uf6g20S-2ZcxJSuvVIjJg"
  },
  "geT_pZID5kHQjT3N-Q9x4Q": {
    "date": "7/21/2015",
    "text": "I'm not so sure whats so special about this place (except that I confess the basmati rice makes it more fluffy) but I'm a sucker all the same",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsIVj_AszmnnsykBrKgdHw"
  },
  "COz3JOJ8EwCQy1RGqBohew": {
    "date": "7/4/2013",
    "text": "Suprisingly, using basmati rice for nasi lemak work quite well - it's not too separated as I expect like briyani and the coconut taste can still stand out. The sides is just ok for me you can choose between otah, bergedil, fried wing, fried fish, or egg with combo named just like in poker. Somehow I think the portion is too small for the price it charges.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K175l53A-ciYnt0xS_V4CQ"
  }
}