{
  "45e12ffuEnVEoQ3kkyvx8A": {
    "date": "11/9/2018",
    "text": "One of the best crab place in Singapore. They do not have a wide menu but focus to do the best dishes they serve.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OFQ13zBb18fiDcKxfh0AyQ"
  },
  "al88MZlkS6GtoNmyjhP_Wg": {
    "date": "3/14/2018",
    "text": "A very disappointing experience. Firstly, it took me not so long to find out the restaurant is operated by two separate crews when I was shown two different menus and asked to order twice. And they are not coordinated -- each said the food on the other's menu is not available right now!Then I was told that I had to call in advance to reserve a grilled crab, after asking a few times why I couldn't have one crab while there were a lot on the grill.Okay fair enough, so I turned to the Indian crew for a pepper crab. In result I was served a chilli crab with the reason \"pepper crab is a bit spicy \".... excuse me!?",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2CIlY0wrnSbXZZnb7rVyw"
  },
  "onkejq7vIByhvtjnes-aew": {
    "date": "12/8/2017",
    "text": "Awesome out of the way local crab. Bbq instead of slathered on chili or pepper sauce. Able to enjoy the real flavor of the crab. Cash only so come prepared. The shrimp fried rice with it was the perfect meal pairing. Enough for one. Housed within a Lebanese/Indian restaurant house, or shared rather. So many options. Will revisit again if in the area and in the mood. Very lovely owners/managers, especially nice to this particular American despite Trump and how many are so upset with us.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2IOKnUf-Xi8BVfLyZqDoyw"
  },
  "QHtgIyV33KQCRtdZ6EDb-Q": {
    "date": "4/19/2016",
    "text": "BBQ Crabs!  Why haven't anyone else thought of that?  A brilliant twist on the Teow Chew Cold Crab indeed.  Succulent, sweet crabs stuffed with melted roe cooked to order and grilled to perfection.  Minimal seasoning which brings out the natural flavor of the crabs and the burnt unagi sauce was indeed a nice touch.  Definitely a welcomed change from the chili and peppered versions.  The place is your standard kopitiam - no A/C - but I'd rather endure the heat for tasty local food than chow down on mediocre food from air-conditioned chains...  Remember to call ahead and reserve your crabs if you are planning to go on the weekends!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "7aof41zAzRXsBZVVC3uFZg",
        "caption": "Photo of Happy Crab - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7aof41zAzRXsBZVVC3uFZg/o.jpg"
      },
      {
        "img_id": "AZz15ef2vTsPxk2CtXt_sg",
        "caption": "Photo of Happy Crab - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AZz15ef2vTsPxk2CtXt_sg/o.jpg"
      },
      {
        "img_id": "GpkmZFFqRBDzuczDq2hq_A",
        "caption": "Photo of Happy Crab - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GpkmZFFqRBDzuczDq2hq_A/o.jpg"
      }
    ],
    "user_id": "2tOny3tty9BlhrGRLWPHqA"
  },
  "S6dqhNTYZLo46m97RtVPFA": {
    "date": "11/20/2014",
    "text": "Opened by a group of retired air stewards, this place was discovered thanks to my dad. Tucked away in an old coffee shop along Pahang, Happy Crab is.... How should I put it... Happy Food! If you're tired of the regular chilli, black pepper, white pepper, salted egg yolk crabs and want to taste a crab for its pure, natural flavour, than Happy Crab should automatically be your #1 choice. I'm giving this place a 5* rating, solely  based on its crabs. Seasoned with just salt and pepper, these crabs are first cooked lightly, then thrown on a charcoal grill to give it that charred BBQ flavour. Mixed in with the natural sweetness, it makes for a killer combination! Ranging from around $35-$40 a crab, these delightful crustaceans will take away whatever craving you have for a good crab because well... They are that good!!Your first bite will bring Michael Buble's \"It's a beautiful day\" floating into your head, and you'd be clapping along to Pharrell William's \"Happy\" halfway through your dinner. The only sad thing about eating here is when you realize that... You're out of crabs! Apart from the crab, the Fried fish is pretty good too and it's sambal is delightful, but... Everything aside, this place definitely THE place to be fore grilled crabs. 2 pincers up for some awesome crabs!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nzsLswprXJ3rcGz7vsAWqA",
        "caption": "Photo of Happy Crab - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nzsLswprXJ3rcGz7vsAWqA/o.jpg"
      },
      {
        "img_id": "88PJ1xQ2-1A-PebGUf_DpA",
        "caption": "Photo of Happy Crab - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/88PJ1xQ2-1A-PebGUf_DpA/o.jpg"
      },
      {
        "img_id": "Zc6_F8OWIWP6PuvEVLY7iw",
        "caption": "Photo of Happy Crab - Singapore, Singapore. Oooozing with goodness.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zc6_F8OWIWP6PuvEVLY7iw/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "lKnO5WpXfZWY3HI6lQcM5A": {
    "date": "4/11/2015",
    "text": "If you want a simple but yummy seafood meal. This is the place. Make sure you call to make reservations. Open Mon to Sat. Closed on Sunday & Public Holidays. From 6.30 to 9.30 .. No frills, no air con but  worth it.Best of all they play a great repertoire of oldies songs.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UqT834gyjtBa9IqvE-kOqw",
        "caption": "Photo of Happy Crab - Singapore, Singapore. Simple fried rice with wok hei",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UqT834gyjtBa9IqvE-kOqw/o.jpg"
      },
      {
        "img_id": "tIn7IzUxDHVcI8N9jp3Hjw",
        "caption": "Photo of Happy Crab - Singapore, Singapore. Grilled sotong ... so tender",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tIn7IzUxDHVcI8N9jp3Hjw/o.jpg"
      },
      {
        "img_id": "t_4FAZwhKoKVbU-pzlzXcg",
        "caption": "Photo of Happy Crab - Singapore, Singapore. Ikan Pase .. deep fried and super crispy !!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t_4FAZwhKoKVbU-pzlzXcg/o.jpg"
      }
    ],
    "user_id": "So7Gx7p95KsJekcwiqXMyA"
  },
  "cJe3NAaLODJ8Xa8GSSePYA": {
    "date": "3/9/2015",
    "text": "Believe it or not, my favorite preparation of crab is simply steamed with melted salted butter.  Happy Crab shares that philosophy with simply grilled crabs, enhanced only by a bit of salt and pepper.  The preparation brings out the incredible natural sweet flavor of the crabs and the meat remains firm.The setting is classic Singaporean coffee shop with golden oldies on the sound system and cheerful, gourmand uncles running the show.Apart from the crabs, the grilled squid is a winner and if you need some greenery, the kai lan is pretty tasty as well.Drinks are run by a separate shop, but we noticed that some other (smart) customers brought their own chilled white wine.  Not sure if there is any corkage fee, but I'm sure it can't be very much!PARTING THOUGHT: do be sure to reserve your crabs in advance or prepare for disappointment...1 / person will do nicely!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yxXgVwGk4OMyKD4VtPPqhw",
        "caption": "Photo of Happy Crab - Singapore, Singapore. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yxXgVwGk4OMyKD4VtPPqhw/o.jpg"
      }
    ],
    "user_id": "Ss6Fz9oK7HCOvYllxpdwEw"
  },
  "K3M3TEa8AWV1RDiO4Xy62Q": {
    "date": "7/21/2017",
    "text": "This has got to be one of the best crab in singapore! I love the simplicity of the dish and I would always come back - one crab is definite not enough for me.. also the Hor Fun is very very good !!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jB-jKOr-G8O1ge8Ct5jWAA"
  },
  "sGpZjBae6nNRmTg1uHTIpw": {
    "date": "5/13/2014",
    "text": "Honestly, these guys should play Pharrell's \"Happy\"at this place cause that how diners feel after a bite of that Grilled Crab!The sweetness of Sri Lankan crabs with the charred taste of the grill (ie burnt at the edges) topped with salt and pepper is just a Killer Combination. Singapore is known for crabs: chilli, pepper crab, you name it.  I haven't ventured enough to try all the crab possibilities out on the red dot, but this indeed is one of the best grilled crab places around.  To complement the crab, I would suggest the grilled squid and of course my favorite, rice. Not just any rice, Sambal Rice. It's a little spicy so be forewarned.The ambience is nothing to shout about. Kind of looks like your typical Singaporean hole in the wall, but then again that's how you know the food is good. If you are a visiting tourist and have no idea what to order, just let Eddie order for you. He is the coolest shop owner you will ever meet. Believe me, he loves to chat making the experience all the more worthwhile. Happy crabbing!",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 2,
      "cool": 6
    },
    "photos": [],
    "user_id": "anrZv1OM1a2sC_EfZ8mt-Q"
  },
  "6-zkPIjiZtJSBDvdQ3-j6w": {
    "date": "2/9/2013",
    "text": "For friends who follow my reviews, you'd know that I rarely review or recommend local eateries.It's not that I have anything against local food, it's just I so rarely find local food that impresses me enough to make me go \"wow, I need to go review this place on Yelp\".Note that this Happy Crab at Pahang Street isn't part of the \"Happy Crab\" chain that's present in other parts of the island. This place is one of a kind.First off. Grilled crabs. They're grilled till good and charred with salt and pepper. There's a real respect for the natural sweetness of fresh crab, and the combination of flavours won over someone who isn't even that big a fan of crabs. I ate an entire crab by myself. That should tell you something.We also had the best grilled squid I've ever had in Singapore. Grilled with lemon juice, and a little salt and pepper, the squid was tender and delicious. I could have polished off the whole plate by myself, but alas, I had to share.We also had deep-fried \"sand knife\" fish. I believe locally they're also called \"ikan pasir\". Now, as ridiculous as this sounds, I'm not that big a fan of seafood. But these fish. Deep fried. They were meaty, crisp, not oily or fishy in the least. I ate mine, and a third of my friend's. We also had sambal fried rice (excellent wok hei flavour, but not enough sambal), sambal kangkong (wasn't that big a fan of the sambal), and a traditional Teochew dish of cooked leeks with tau kua. The highlight of the meal was what came next. A whole parrot fish, stuffed with fresh chili, wrapped in a banana leaf, and steamed. I think I ate half the entire fish all on my own. I'm a big fan of the clean, fresh heat of chili padi, and the spiciness, combined with the firm, meaty fish was excellent. It wasn't in the least bit fishy, and I found the heat just right to provide that little tingle on the palate, while not overwhelming the flavour of the fish. All in all, I had an excellent meal, and I cannot wait to go back. I'm even bringing my mum, because she's the seafood lover in the family.",
    "rating": 4.0,
    "rated": {
      "useful": 12,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "eCA1i3NtPPjCT4i3XOhBNw": {
    "date": "4/14/2014",
    "text": "It is hard to describe how good this place is. Seriously! We were standing in the taxi queue at the Marina Bay Casino and we thought about crabs. It was pouring down rain. Happy Crabs came up with 1 review. Ok, why not, let's try it. I am a 54 year old crab expert, and these crabs were insanely good!!!! The squid was also off the chart! And the rice was incredible! Perfect 10's on all items. Only complaint is the beer had to be purchased from a different operator in the same place. That was annoying, but the food more than made up for it. Also, we were visiting Singapore and I am on my way to the airport back home now. This was a totally random stop in and it was one for the records. I will never forget it and I highly recommend it to anyone who likes crabs! I cannot wait to return. MC and Eddie are great operators! Mark@funair.com",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "7D3OFOApdU8e5LKkFliE6g"
  }
}