{
  "jpvfy98AMzm3Z0XpXi2Jpg": {
    "date": "11/14/2014",
    "text": "Cute décor and decent food.I'm surprised there hasn't been more reviews for this place. The name definitely came up often on other sites and blogs. My friend and I came here for brunch on a Sunday. The location is quite convenient and easy to find in the Cathay. The food was presented nicely but tasted just okay. So are the lattes. I would give 3.5 stars overall if possible but round up for the nice and chic design.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Xd8dPasNWNiy28rtqksD-g"
  },
  "EYSIAe2-8TFmZgmhA6_2sw": {
    "date": "7/14/2015",
    "text": "Assemble it is.  Place is cosy I suppose really good for people to hang out to eat, talk and perhaps even do some work.  Had lunch there and got to say it was good.  Got the pulled chicken sandwich.  Came hot, nicely grilled toasted with crispy fries and side of salad.  Wife and boy had the spicy beef and the spicy sausage pastas and they were done just rite. Exact words from my better half.... Better value than Cedele!!???  Oh oh....watch out Cedele.  All in all service at least from the recept to the table was attentive and taking of order was super easy.   Best of all water is free this is getting to be a rare commodity.  We'll be back for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3awR7pUi7FHdp_0ibLQGvg",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Le Pleasure",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3awR7pUi7FHdp_0ibLQGvg/o.jpg"
      },
      {
        "img_id": "abZVqSiC2A7DbUfx2_OcTA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Pulled BBQ Chicken Sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/abZVqSiC2A7DbUfx2_OcTA/o.jpg"
      },
      {
        "img_id": "dwiOv02vLRlS6hExI-EOuQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Spicy Sausage Pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dwiOv02vLRlS6hExI-EOuQ/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "mLsfo0ql0QyBpxWUPF4TuA": {
    "date": "6/22/2015",
    "text": "Great little place for a quick bite in the Cathay. I opted for a burger and it was very, very good. The fries were excellent as well. As it was Sunday evening, it was pretty quiet and we had no problem getting a seat of enjoying a great conversation. I will definitely go back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KF37noDbi_1vl14AY5HjgA"
  },
  "JCeXs7qsHwLqzPBGzv9FZg": {
    "date": "2/1/2015",
    "text": "Errm .. Iced latte with a scoop of vanilla ice creme - kinda pointless if I'd wanted a low fat iced cappuccino (but they don't have that) right? Decent coffee if not spectacular - too much milk to taste the coffee. Not related to Assembly at Evans Road.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4XqifV-R6-ASLFAJSywCw"
  },
  "rQln6dhi1vkbRndmQIOUiA": {
    "date": "5/12/2015",
    "text": "I arrived at assembly ground on a weekday evening and it was relatively empty with a few groups of people enjoying cups of coffee. While I know their coffee is recommended, I've never been a huge fan of coffee. So, I hesitated ordering a cup expecting my coffee addict of a boyfriend to order one that I can try a tiny bit of. However, he surprised me by ordering a pint...a latte it was for me, and a good thing I did too. The coffee was a good blend in my opinion, less acidic and with a great robust flavour. The milk tasted somewhat creamy which made me slightly suspicious but all in all, it was a good drink. My friend also seemed to thoroughly enjoy her ice chocolate, for those who don't particularly like coffee. I had the coney dog, while my boyfriend had the blackened tuna burger and my friend ordered the beef ragout with rosti. I wouldn't say it was spectacular, just a regular frankfurter it seems with a slightly sweeter than expected beef chilli but it fulfilled my chilli dog craving and as such, I'd give it 3 stars. The remaining star comes from the fact that my companions seemed to quite enjoy their food and the decent portions, and we were served by an exceptionally friendly waiter, who was key to our whole experience being delightful overall. To that waiter, you might think you're just doing your job but thank you for doing it so well!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5av7ZYxifKl1jPttRSvt7Q"
  },
  "KBUTcb-CndnxBo6JlsZhyQ": {
    "date": "7/11/2015",
    "text": "I didn't try their coffee, so no comment on that. This is a review on their The Assembly Wagyu Burger ($24.50). I don't really like beef, but I ordered their wagyu burger nonetheless cos I heard some good reviews about it. I am so glad that I did take a chance cos their wagyu burger was really good. All the burgers menu was served with sesame brioche bun + spiced fries. The sesame brioche bun was very very good. It was toasted with just enough butter, and it was still warm though it had been sitting for more than 10 mins after being served. Since it comes with fries, so for girls, you might have some difficulty to finish this dish. I came there HUNGRY (it was past 12 pm and I haven't eaten anything since morning) and yet I couldn't finish the dish. But I guess being served too much food is better than being served too little food, right? ;pAbout the wagyu beef patty it was very thick - however texture wise it was perfect. I could easily cut & chew it with no problem at all. No complains. Taste wise it was very good as well. It was juicy and just right salty. Though I really like this dish overall very much, I can testify that the fries (though also tasted good) but was loaded with lots of MSG (I got very very thirsty afterwards) drinking like 6 cups of water total. So if you were on diet, it's probably a good idea to just skip the fries and go straight to the burger. My hubby got Ragout of Beef with Rosti (S$23). Based on the menu description, it was slow-roasted angus, rosti, trio of mushrooms, onion jam, creamed spinach, & 62C egg. When it came to our table, the smell was very nice and tempting. However when it comes to the taste, the beef was very lacking. In conclusion, if you're feeling to eat smth beef-y, I vote for the wagyu beef burger all the way!Last but not least the place has ample seating space. They also offer free wifi for customers, however when I tried it (Assembly 1) it doesn't work... :/ [came here on July 11]",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tjf5KXXumzjMeupeL7d9Ew",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Ragout of Beef and Rosti S$23",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tjf5KXXumzjMeupeL7d9Ew/o.jpg"
      },
      {
        "img_id": "mFRThJVDaLwQmwAqK4Tmlw",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Food menu at the assembly ground at the cathay",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mFRThJVDaLwQmwAqK4Tmlw/o.jpg"
      },
      {
        "img_id": "ocVs1CUuISgsNeF6xz44dQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. The Assembly Wagyu Burger (S$24.50)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ocVs1CUuISgsNeF6xz44dQ/o.jpg"
      }
    ],
    "user_id": "kszt8vOPh4xos8OtOqmr5Q"
  },
  "7_RSRX_7oZ3XfqplwISHbQ": {
    "date": "7/10/2018",
    "text": "The Assembly Ground used to be one of my haunts when I worked in the city area. The coffee was good, meals were a bit pricey and the portions were a little on the small side.  Revisiting this place after about a year, I was disappointed by how far the quality had fallen. I had their set meal - chicken skewers with aglio olio pasta which came with the soup of the day and a choice of drink. The soup of the day was pumpkin- way too sweet although the texture was nice. The main was... a joke. The pasta was barely enough for my 15 year old nephew and parts of the chicken were undercooked. On a more positive note, some of my friends who ordered the ala carte said their food was good. Avoid their set meals at all costs.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TmzkkbAL6NQjldq83D4p3w"
  },
  "HV6b6zO6gSqg5OAwwzj9uw": {
    "date": "1/30/2018",
    "text": "This is their Rosti Benedict ($17). Looks good and taste wise is not bad. Friends ordered their Assembly Brunch ($20), Rendang Mac and Cheese ($18) and Rotisserie Chicken ($18). The Rendang Mac and Cheese smells really nice ! The assembly brunch have really a large portion. The Rotisserie Chicken taste good. The chicken is very tender. Once in a while, spending this much.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pMy2WgJcQqtPBFcYnPC3PA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Rotisserie Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pMy2WgJcQqtPBFcYnPC3PA/o.jpg"
      },
      {
        "img_id": "r9Py98WVr_6davQmML4k1Q",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Rosti Benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r9Py98WVr_6davQmML4k1Q/o.jpg"
      },
      {
        "img_id": "wC4tgpkdGXvUtToZ1VnQ-Q",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. The Assembly Brunch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wC4tgpkdGXvUtToZ1VnQ-Q/o.jpg"
      }
    ],
    "user_id": "yn1y6UBwP3GKEFfglxTKnA"
  },
  "sqhuMcpt9dgYiah0hSfFZA": {
    "date": "12/27/2016",
    "text": "Chili crab mac & cheese ($18) - 3.75 starsAmerican duck pizza ($22) - 3.75 starsSkinny green tea latte ($6.50)No soy milk here.Note that the prices don't include the 7% GST.Ambience - 2 starsI don't usually comment on this. In this case it's a negative. Way too dark to read inside and the music was loud and annoying. It gave me a headache.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IWWKnxtm5pY3kaTQQuygdQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Chili crab mac & cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IWWKnxtm5pY3kaTQQuygdQ/o.jpg"
      },
      {
        "img_id": "XdsvKq-9PIZfsf-hqK9WAg",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. American duck pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XdsvKq-9PIZfsf-hqK9WAg/o.jpg"
      }
    ],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "HZuseTWYua5UNPi_nfGaHw": {
    "date": "5/30/2018",
    "text": "Overall, I'd say this isn't someplace I'd purposely seek out again. I dined here with 2 friends in the late afternoon before catching a movie upstairs. We were seated at the long table in the back, which had 3-4 trays of what appeared to be the remnants of the staff lunch on the other half of it. Also, it seemed to be their unofficial break area, which just didn't give us the relaxing vibe we were looking for. As for the food, some dishes were better than others. The calamari could have come from a convenience pack, and the hae bi hiam pasta was dry and had one measly shrimp. The chicken burger was good though, and the truffle carbonara tasty though pricey for what was essentially a meatless dish with cheap mushrooms (shimeji & shitake). There was also unfortunately a hair in my iced latte.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9YPHWmOHS0J4JeaNWLgeA"
  },
  "LvyVzc1VoW69ibGcKzK_Ag": {
    "date": "9/14/2016",
    "text": "Nice setting and central location that is not overrun with crowds. There seems to be live music at certain timings. The colorful metal chairs are actually more comfortable than they look. I had matcha latte which was fragrant. The latte art is not bad. Food wise the portion and ingredients were decent but not spectacular. It is not a place that I will specially go to for the food but it is a good option if you are in town and want to relax somewhere without burning a huge hole in the wallet.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9fSN12Tx1pDKHo16HNk7qQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Lattes galore!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9fSN12Tx1pDKHo16HNk7qQ/o.jpg"
      }
    ],
    "user_id": "pDk2mjq7RTpIc6AWIvrbfw"
  },
  "_UBC6Vq4JLH6xHHuftSJTw": {
    "date": "1/1/2016",
    "text": "This cafe is located on the ground floor of the Cathay. It does have a very hipster feel and look to it but is more frequented by random shoppers in the area. Service was nice, friendly and fast (but I struggled to understand the Singlish that the staff were speaking) They serve up some standard pastas and pizzas but also a very good wagyu burger that I can strongly recommend. That is the standout dish as most other things are pretty average. They serve coffee from Nylon so the beans are clearly of good quality and they are pretty decent and making the coffee here but by no means the best place in town. If you are however in the area this is a good place to go for your caffeine fix.They have free wifi and it can be nice to sit and slack in the sofas by the entrance for a while before heading out for more shopping. All in all a nice place if you are in the area but not worth to actively travel to.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SaqAc2AePmNYFYf6fmeb3w",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Aeropress Ethiopian from Nylon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SaqAc2AePmNYFYf6fmeb3w/o.jpg"
      },
      {
        "img_id": "YcP4fk9aSlsc53ajas1rgw",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YcP4fk9aSlsc53ajas1rgw/o.jpg"
      },
      {
        "img_id": "QxYzPqE_n7wrwlBfILiNyA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QxYzPqE_n7wrwlBfILiNyA/o.jpg"
      }
    ],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "y4fqrL5T8dEkamLXXm6iHA": {
    "date": "4/13/2015",
    "text": "Located right on the ground floor of Cathay is this hipster looking cafe. One must wonder how much do they make, to afford rent in such a prime location! But nonetheless, the staff greeted me politely as I walked in and showed me to a table.The bicycles on the walls were very strategically placed above each table with rather dim lighting. The whole cafe has a very rustic feel to it.As I was waiting for the movie to start, I decided to just grab a cuppa and this matcha latte hits the spot! Perfect mix of green tea and sweetness. The aroma itself woke me up! I am definitely getting another cup of matcha latte here! All in all, a great place to chill out without burning a hole in your pocket.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PMOkBl-ek3fnJjhg1GA0tw",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PMOkBl-ek3fnJjhg1GA0tw/o.jpg"
      },
      {
        "img_id": "E5JEGfmu6Q0H0C9PcPKSkQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Pine garden cakes!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E5JEGfmu6Q0H0C9PcPKSkQ/o.jpg"
      },
      {
        "img_id": "Aabt8S0RtL2R0LPQ1XTC-A",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. They sell pine garden cakes but also with jacked up prices",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Aabt8S0RtL2R0LPQ1XTC-A/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "CYzpaXkduDOe6vfQfGyJ7A": {
    "date": "6/21/2015",
    "text": "A popular bistro within The Cathay, The Assembly Ground serves up really good pizza and pasta. To top it up, they serve pretty good lattes and they all come with a scoop of vanilla ice cream!I personally really like the Matcha Latte. With a scoop of ice cream, it's really a filling dessert! The pizzas are thin crusted and i really enjoy the duck and arugula pizza. Good for about 3 pax to share together with a serving of a side to add variety to the meal. The idea of truffle fries is always very appealing. Lightly salted with truffle salt, that's pretty much they have to offer here at The Assembly Ground. Not the best that I have tasted, really just enough to give you a good whiff of the truffle on regular fries.More food to try, I hope to be back soon.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "abaBzsjev6z1VNw8yniNKA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Duck Pizza :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/abaBzsjev6z1VNw8yniNKA/o.jpg"
      },
      {
        "img_id": "t-hb7S_AUhreba6wDroMNA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Spicy Bacon and Sausage Pasta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t-hb7S_AUhreba6wDroMNA/o.jpg"
      },
      {
        "img_id": "NFaSMM2N7BtVCEhVNd8l5Q",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Truffle Fries!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NFaSMM2N7BtVCEhVNd8l5Q/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "qRBVf_SeKCspBoEcMA2hmw": {
    "date": "6/4/2016",
    "text": "Used the Entertainer app to get a free main here - do note that burgers and sandwiches are t included in this deal. We ordered beef cheek pappardelle and a roast chicken, along with some iced osmanthus teas. After discount the total was $30 which wasn't a bad deal. Food is tasty and decent quality, though rather small portioned. The beef cheek was tender, though I would've preferred it in more of a \"ragu\" style rather than in chunks. I'm not sure why shiitake mushrooms were used - it didn't go quite so well. The pasta was apparently house made and quite nice. Chicken leg was well seasoned and tasty but potatoes were under-seasoned. Overall not bad but without the Entertainer discount, I don't think it would've been worth he price.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YQJilYNFMZ2Iqdrte5NzrQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Beef cheek pappardelle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YQJilYNFMZ2Iqdrte5NzrQ/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "5WJaXsQq3gnpWlPfQacNjg": {
    "date": "12/30/2015",
    "text": "This cafe is spacious and has a nice decor and has self service free flow of ice water.What I like is that I can have buy-1-get-1-free for the mains with the Entertainer app here, which means it's only $20 plus for 2 pax. The food quality is okay but the serving of the rosti could be more. The fries are thin and crispy and the type that can get quite addictive.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "H4utR_fodV-UqyeNFyjwzg",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Wagyu burger with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H4utR_fodV-UqyeNFyjwzg/o.jpg"
      },
      {
        "img_id": "xBflxwoTvS-JVAiQvk2UdA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Beef with rosti",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xBflxwoTvS-JVAiQvk2UdA/o.jpg"
      }
    ],
    "user_id": "sbj1tqI1I3AhDaMWKAaFMQ"
  },
  "38uTXqAteVWYqKLnCzAXZQ": {
    "date": "1/25/2015",
    "text": "The coffee is 4-star but the food is miserable so 3 star it is. The place is crowded on weekends and you can leave your name and contact number if you wish to wait for one. They will call you once a table frees up. On weekdays it gets crowded during lunch time but it is not horribly noisy that you cannot hear yourself think. The place decor is typical of so many others with a bit of industrial look and with wooden furnishings. Still a nice place for a cup of coffee, but not necessary a comfortable place to chill with a book. The food menu looks appetizing, unfortunately the sandwich I had was pathetic (see pics). There was so little meat that you could count the small pieces dotting the bread. No wonder I thought I was just eating two slices of bread. Maybe it was a one- off time but I did not go back to try again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1FgyLFXGGrF6phdAOYn8wA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Very little stuff in sandwich. No wonder I feel like I'm just eating bread.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1FgyLFXGGrF6phdAOYn8wA/o.jpg"
      },
      {
        "img_id": "a7kpMPBMQa1zAl2OXLCVOA",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Loaf cakes. I spy Thai milk tea and earl grey cakes.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a7kpMPBMQa1zAl2OXLCVOA/o.jpg"
      },
      {
        "img_id": "JrDyGKQ4xWVLvnHQ7Sfs2Q",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Roast beef sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JrDyGKQ4xWVLvnHQ7Sfs2Q/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "mH6krSVlNsuMs_DEFme2Vw": {
    "date": "1/8/2017",
    "text": "I've been in here a few times, always on my way to see a movie at The Cathay. Why? For me, it's all about the beer. They usually have 2 taps of Archipelago's small batch beer, which is a perfect pre- (or post-) movie drink. The desserts are good, too. I love their sticky date pudding. And I've been told that their coffee is quite nice...It's been popular every time I've been there, so it gets a bit noisy for my taste. But I'm an old guy, so consider the source. ;-)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lzRy6x6CtCzTO266iUf5kQ"
  },
  "uhURCGzJ2AjpxZcP-4-7dQ": {
    "date": "6/13/2016",
    "text": "Edit: deleted a star because a $8 cup of iced latte seriously should not be that tiny! I guess I'm paying for this little dainty sprig of flowers in an empty lemonade jar on my table. I'd rather head to Starbucks right across next time I think. Came here to chill for a few hours before a movie, and loved the experience! Can't speak to the food which some other reviews comment negatively on, but I'll be back next time for coffee & to chat with friends. The ambiance and design is the hipster/woody style and I loved it - tables are placed a comfortable distance away, and the staff don't make you feel uncomfortable for just whiling away a few hours here. They have free wifi & iced water & many tables. It's the type of cafe I've seen at more inaccessible places like Tiong Bahru and Tanjong Pagar, so I'm very glad this is so close to a major MRT station! We ordered 1 for 1 iced cooler promotion ($5 for both), honey cabana & osmanthus. Both were served in mason jars & looked very thin and watery but quite tasty and light! Very refreshing. Also shared brownies, a popular item on the menu according to the friendly staff, which were delicious ($6.50). I was craving a coffee so I also ordered an iced latte ($8), which came with a scoop of vanilla ice cream inside. I was a little disappointed about the size of this - it's a small glass maybe 8oz? (Def smaller than the Tall at Starbucks). But the coffee was strong and good. The baked goods at the counter (not in the refrigerater) are freshly homemade: selections included Thai milk tea cake, brownies, citrus loaf, and they looked very good!!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bxIVz69aF6MztjCORtsutQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. iced latte (comes with ice cream unless you tell them otherwise)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bxIVz69aF6MztjCORtsutQ/o.jpg"
      },
      {
        "img_id": "l6jwxZkCQoRfI4kqOcLx0w",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. brownie with ice cream ($6.50)- warm and delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l6jwxZkCQoRfI4kqOcLx0w/o.jpg"
      }
    ],
    "user_id": "YwxjrOYe1X5bJxWtmiENQQ"
  },
  "hc25tiDqKsB1A4zfvxYF6Q": {
    "date": "3/21/2016",
    "text": "Definitely a nice spot for refueling or hang out at the Cathy and much better than the restaurants downstairs, Assembly Ground is right next to Assembly Store, which happens to be a neat men's store.  I stopped by for lunch after some shopping and was pleasantly surprised by a very nice lunch set.  For $15, I was able to enjoy a nice cauliflower veloute, a sandwich or pasta, french fries, a small salad, and a iced tea!  Although it's available only on weekdays and there are no substitutions for coffee, it's a great deal, when even a single a la carte sandwich in Toa Payoh can easily cost $14.  I went with the tuna salad sandwich, and while it wasn't revolutionary I definitely enjoyed the lunch set as a whole and went back for some espresso, which was just perfect.  I bet the place gets packed on weekends and in the evenings, but it's also a nice spot for a quiet weekday lunch or coffee as well!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "z6uAZHzzcGlYWChwvoYUjQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Tasty and a good value for weekday lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z6uAZHzzcGlYWChwvoYUjQ/o.jpg"
      }
    ],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "gN2BtfXCiRaQH-aYbwhGTw": {
    "date": "6/22/2016",
    "text": "* Last Order at 9pm, do note that cash register will be closed so meaning not even cakes can be ordered.Ordered Smoked Duck Pasta ($17-18)It's done very simply with a medley of vegetables and the duck of course. I didnt quite enjoy the dish(could do with more garlic and seasoning) but my partner enjoyed my leftovers.My group shared Truffle Fries which was more satisfying than the above. The cafe offers a variety of cakes and tarts though the menu doesnt state so.The takeback of this visit would be if you order a burger, it comes with a free pint! Do check with the server on the validity of the promo.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "vWrDhvGCvZLu0XxSCz46mg": {
    "date": "6/15/2015",
    "text": "Chic cafe in a half dead mall.They had a 1 for 1 lunch promo for Mondays, choice of pasta or pizza. We ordered a Beef Chilli Fettuccine and a Spicy Sausage and Bacon. The Spicy Sausage pasta was delicious and did not taste spicy at all. The beef Chilli on the hand was just okay. Its a partial service eatery, you have to place your order at the cashier and they will serve your dishes. You can help yourself to some water at the far end of the cafe.Lovely ambience to chill with friends. The promotion makes it affordable to dine there, without the promotion not quite sure if it's worth it.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqZzCpD70nRd-UilsywRQA"
  },
  "8yJj_5o-8B1pmoz1oh5dgg": {
    "date": "3/25/2015",
    "text": "The ambience is all good; really nice place to hang out with friends.Staff was really patient while my friend and I worked our way through the menu + decide on which cake to get. Price is pretty reasonable. Didn't get to try the coffee that everyone seems to rave about as we were not up for caffeine, but the facilities/coffee machine looks amazing + barista seems professional even with our drinks (camomile honey lemon tea + green tea latte that comes with a scoop of vanilla ice cream).Can't stop popping the pop corn chicken and the assembly brunch's cheesy potato layer is simply addictive. Definitely recommend for people who just wanna chill in a café on a lazy afternoon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sHdYvw5EILk_B6V3DCoGPg",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Greentea Latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sHdYvw5EILk_B6V3DCoGPg/o.jpg"
      },
      {
        "img_id": "NI4Iv4ZsI3yBFYbRZcZsaw",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Popcorn Chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NI4Iv4ZsI3yBFYbRZcZsaw/o.jpg"
      },
      {
        "img_id": "j_zd3JXuCBDoth4ocohLxQ",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. The Assembly Brunch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j_zd3JXuCBDoth4ocohLxQ/o.jpg"
      }
    ],
    "user_id": "hWJViitKnTyCQFkLTBULqw"
  },
  "i3Z4D48PUwCIs1zkyGoM7Q": {
    "date": "9/26/2015",
    "text": "Brought my daughter here today for lunch. We had the portobello burger n spicy sausage pasta. Both are below average.  The pasta particular tasted like instant noodle throw in few slices of beacon n sausage.  The service also was lousy. This is my first time here n probably last time too.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PEbqvW6J8xcRyhrAE-yhKw"
  },
  "pnOIxzrLyLjrpfT3SPh4dw": {
    "date": "6/6/2015",
    "text": "Nice chocolate drink. Noisy place. Expensive mains. Serving so-so lar. Martini Lychee did not give any martini kick at all.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i0bCfCVybBhYcLIIkr4eDg",
        "caption": "Photo of The Assembly Ground - Singapore, Singapore. Beautiful latte art.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i0bCfCVybBhYcLIIkr4eDg/o.jpg"
      }
    ],
    "user_id": "MS54OoXe9O5O05JYQm2rBA"
  }
}