{
  "8mSb_KLPLhNWL1C5H-HqYg": {
    "date": "11/11/2017",
    "text": "I didn't know steamboat means hot pot in Singapore. This location is nice and clean (unlike the ghetto China town in NYC...) lots of veggies, quality meat (Kurobuta is awesome), and noodle. Waitress will help you set up your meal, and you prepare your rest of meal...we have to pay and prepare own meal?! LoL. Food is definitely amazing. Location is right on top of Icon center and overlooking the traffic intersection, the view is awesome. Reservation is a must, and there's a time limit so be sure to pace yourself.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vCZ7UT1IY4AahbHIiA_YSQ",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Awesome meal!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vCZ7UT1IY4AahbHIiA_YSQ/o.jpg"
      },
      {
        "img_id": "fy-rC0ItPjfOxU7GLCiCmw",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Too many to choose from",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fy-rC0ItPjfOxU7GLCiCmw/o.jpg"
      }
    ],
    "user_id": "NXw0bCLF5ZtFMfhcj7CFSw"
  },
  "RmOz8dI_lnWlsV0nLlAkoQ": {
    "date": "4/22/2017",
    "text": "Best steamboat in Singapore, but be prepared to shell out good $$ for the meal!Prices here are definitely on the high side, but the food quality is really good and the experience is excellent! Service is pretty decent, and food is served promptly after ordering.The fried beancurd roll is life changing, and the soup base is excellent.Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "9Dt3bPfonHHboudzI6ANqA": {
    "date": "5/11/2017",
    "text": "The restaurant was under the Imperial Treasure chain, and offered hotpot. It was considered one of the most atas outlet in Singapore to offer hotpot. There was also branch in Great World City. This outlet looked quite grand from the entrance. Reservation of 8 people was made a week ago. The staff called up about an hour before the reservation to confirm. The staff showed us to a private room with a great view of Orchard Road. The table was big with 2 induction stoves and could seat 10 pax comfortably. Most hotpot restaurant had sauce counter, but here the staff brought the tray of sauces which consisted of satay sauce, peanut sauce, sesame sauce, sesame seeds, chilli sauce, garlic chilli sauce, sliced green chilli, sliced red chilli, chopped coriander, deep fried chopped garlic, chopped garlic, chopped spring onion) to the table. Each person was charged $2.50++ for the sauces.For soup base, selected Imperial Drunken Chicken Soup 乾隆醉雞窩 ($28++) which tasted slightly bitter in the beginning but was quite flavourful. It came with a bowl of marinated chicken to add into the soup. The chicken was quite tender.Accompanied with the following :King Tiger Prawn 鳳尾蝦 ($18++/ 4pc) - served peeled, big and juicySliced Eel 白鱔片 ($14++) - quite boneySquid 鮮魷魚 ($10++)USA Sliced \"Kurobuta\" Pork Belly 美國黑豚豬腩肉片 ($14++)Sliced Lamb Shoulder 鮮羊肩片 ($15++)Four Treasure Ball Platter 鮮四寶丸 ($14++/ 8pc) - Fresh Prawn Ball, Fresh Cuttle Fish Ball, Fresh Canton Dace Fish Ball, Fresh Pork BallFresh Prawn Noodle 唧唧鮮虾麵 ($14++) - The staff pipped out the paste from a bag, very tenderFresh Dace Fish Noodle 唧唧鯪魚麵 ($11++) - The staff pipped out the paste from a bag, very tenderAssorted Vegetable 雜菜籃 ($6.80++)Bamboo Pith 野山竹笙 ($20++) - spongy and softAssorted Mushrooms 雜菇籃 ($8.80++)Deep Fried Fish Skin 酥炸魚皮 ($6.80++)Deep Fried Beancurd Skin 炸三秒 ($6.80++) - Everyone's favourite item, had it without soaking in the hotpot, so that it would be light and crispy. Else soaked for a few seconds in hotpot which soaked up the soup easily.Chilled Beancurd 凍豆腐 ($4++) - It was like a more airy and softer version of the dried bean curd, which was able to soak up the soup.Washed down the meal with Cooling Herbal Tea 清熱凉茶 ($12++/jar) and Sweeten Plum 秘制酸梅湯 ($12++/jar)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WJtjJjzlD1IQO9hAqP6l_Q",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WJtjJjzlD1IQO9hAqP6l_Q/o.jpg"
      },
      {
        "img_id": "KM3eaaqRPcLTAOpO-_6wtg",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KM3eaaqRPcLTAOpO-_6wtg/o.jpg"
      },
      {
        "img_id": "mE6zDEbcdrZh0UkdMwSRhQ",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mE6zDEbcdrZh0UkdMwSRhQ/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "pDFdqkyrjLfdKdHvLqmfkA": {
    "date": "1/29/2018",
    "text": "We are big fans of the ImpTreas group, and like ALL their different brands, no month goes by without us visiting one of their outlets. I must say I am not a big amateur of steamboats especially in the hot Singapore weather, so this was our first visit since the restaurant opened.  You can recognise the Imperial Treasure signature: understated and elegant décor, courteous and professional service. The food? It is high-end alright - lots of soup choices, high-quality ingredients, nice sauces - but it's over-the-top for a steamboat restaurant, which at the end of the day is still a family or close-friend affair. It's too pricey, a bit stiff, and after the meal you can still feel the MSG. At least, Haidilao is more fun. So, we'll stick to ImpTreas Teochew, Peking Duck and Shanghai, or the simple Noodles & Congee.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "_lcmfmXPqMrGGGxi3kqM7A": {
    "date": "5/29/2016",
    "text": "Ah, Imperial Treasure Steamboat.One of my favourite-est steamboat places in Singapore, the quality is excellent, the soups mouth-watering, the prices (can be) eye-watering. While reservations are generally recommended, you're sometimes able to sneak in without one, but I wouldn't gamble on it if you're already set on having dining here.There's no one item that blows me away, but rather just the sense of indulgence, the delicious food, and the soups that time and time again prove to be so much better than most other places.The price makes it hard to give five stars, but if you're the sort that's price insensitive when it comes to food (cough cough join the club) then this place will easily win your heart. And stomach. And hard earned cash.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "4PZi2mx6lOH_3eDMlwAUag": {
    "date": "6/12/2014",
    "text": "I would give this a full 5stars based on food taste and experience alone, but will deduct 1 star just becoz it's pricey.The ingredients are really really REALLY fresh and I can't fault them for putting the prices they do, you do get what you pay for.The prawn balls, sotong balls, and all dumplings are handmade and you will definitely know the difference between other steamboat places the immediate instant you take a bite out of it!The soup bases are already very thick even before you pop any stuff into the steamboat. No msg or artificial flavouring taste can be found inside the soup. The porkbone soup is milky and flavourful, the mala is not oily like what u might find elsewhere! You can be sure I'll be back again soon! But this time, I won't order the set, just go alacarte and go straight for all the handmade meat/seafood balls and dumplings and some of those slices of pork and beef! That's where the money's at!I also loved the dip mix which the waitress helped us concocted! Damn you imperial treasure for setting steamboat standards so high, I might never enjoy steamboat anywhere else again! :(",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZJdH90S4vEafCFwHJwOhQQ",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Mala and Porkbone soup bases",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZJdH90S4vEafCFwHJwOhQQ/o.jpg"
      },
      {
        "img_id": "rQXOfjZBOCuxCrb-dXXTLg",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Fresh prawns on skewers!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rQXOfjZBOCuxCrb-dXXTLg/o.jpg"
      },
      {
        "img_id": "BJenhh2B0LdQXmVz0JSIUw",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Assorted balls and dumplings are amazing! Take note on this one!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BJenhh2B0LdQXmVz0JSIUw/o.jpg"
      }
    ],
    "user_id": "jq7Pb7s68wi2NDTFEXvwbw"
  },
  "JCN7qZsLvmMZxo4jEZJuWA": {
    "date": "2/19/2016",
    "text": "Not been here since Jul 2014 thought the last round was at the somerset branch.  Protocol still the same best to reserve ahead or else no steaming boat for you.  We ordered the usual the USA beef, drunken chicken, the hand made balls (which is a combo of seafood and meat) and lots of veggies.  Got the chicken healthy soup which is so comforting to sip down.  Really not a cheap place and to dine but really better this than do the all you can eat and get poor quality food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AkSnkwfENrbI93XoKKuz7Q",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Le Damage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AkSnkwfENrbI93XoKKuz7Q/o.jpg"
      },
      {
        "img_id": "DopCB_rkEf7nHSAd58i4zg",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Tang O",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DopCB_rkEf7nHSAd58i4zg/o.jpg"
      },
      {
        "img_id": "1lA1W_unw8JZCsLDnVE_-w",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore. Cabbage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1lA1W_unw8JZCsLDnVE_-w/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "UoSXJrp0tMXRhPbSjF0cVQ": {
    "date": "10/18/2013",
    "text": "Located in the 4th floor of Ion, the restaurant is famous for its steamboatWe arrived at 8pm and the restaurant looks fully booked . better to make a reservation.They have  some set menus but we ordered a la carte :- Prawn Balls & Pork Balls, Dumpling- raw Fish- crab- lamb shoulder- chicken  meat- vegetables- soup : good selection Food :  4/5Seafood Freshness is fantasticMeat is meltingService : 5/5Perfect service. Value : 4Quality = pricy",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7MXf7-p3MDhevdQ6taq_nw",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7MXf7-p3MDhevdQ6taq_nw/o.jpg"
      },
      {
        "img_id": "2hAv4M5o-Dvz9tN-HCnD7w",
        "caption": "Photo of Imperial Treasure Steamboat Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2hAv4M5o-Dvz9tN-HCnD7w/o.jpg"
      }
    ],
    "user_id": "OsOOolYt7nnCBNQ5Q0wGIA"
  },
  "h1IjVbv17Fk8iCQCnL46WQ": {
    "date": "10/10/2013",
    "text": "There are many competitors for this kind of steamboat in Singapore in recent months but this still remain my favorite. Some of my favorite items:1. Beef short ribs2. Pork belly3. Cuttlefish noodles (even has bits of ikura in it)4. Prawn or cuttlefish paste5. Fried fish skin (for a 3 second dip so that it is still crispy)6. Any seafood7. Chives dumplings The above are just some of the items that are less common and yummy here. Some other steamboat places don't do it as tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "Ff8OvydMK0TRigPg9PSUag": {
    "date": "8/31/2013",
    "text": "A great option when you have a steamboat craving! The ingredients here are fresh and they have really yummy soup bases too. Another huge plus for me is that it that they are rarely crowded so if you are in a big-ish group and don't want to queue for dinner in ION then just head here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oUZ3fmICiFLVrUBl0lDx4g"
  },
  "RzTQJ3DE2AlLn0eBut8Ywg": {
    "date": "8/4/2016",
    "text": "They have different kinds of soup stocks for us to choose. And likewise for the food. The soup stock is delicious & ingredients are fresh. The only setback is the pricing - way too expensive. Would love to dine in this restaurant every week or thrice a month if the prices are reasonable. Then, it is worth dining at this restaurant.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "90tv-lK4wM_q1OahO-XcwQ"
  }
}