{
  "7sEImgwJQDFFqVZvryZnjQ": {
    "date": "11/16/2016",
    "text": "Food: The hummus was smooth and creamy and definitely the best I've had in Singapore so far. Salad and vine leaves were also delicious and tasted very fresh. Only downside was the falafel was over-fried.Service: Waitress was prompt to come take my order after I sat down on one of the bar seats outside. Wait for food also wasn't too bad. Even though I was the only one sitting outside, I didn't feel neglected at all. Unlike most places in Singapore, note that the menu prices already include GST and service charge is discretionary. (I overheard a customer complain that the meal was expensive and the waitress had to explain why.)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L5ic3pdjQIldyJ6OmSfJcQ",
        "caption": "Photo of Urban Bites Mediterranean Cuisine - Singapore, Singapore. Sampler with hummus, baba ghanoush, tabouleh, one falafel, and stuffed vine leaves",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L5ic3pdjQIldyJ6OmSfJcQ/o.jpg"
      }
    ],
    "user_id": "m-G5VEMTu3CD0sQm7u7twA"
  },
  "lUXddnz6jV18pVkzAc-meg": {
    "date": "7/23/2015",
    "text": "Quality hummus that is good portion for two- three people. The Moutabal Baba Ghanouj (cold mezza hummus) was good but it was hard to taste the grilled eggplant and tasted like the classic hummus with a hint of lemon. They also had Interesting mediterranean dessert selections displayed that you can order to dine or take away. Note: self-service for water so no service charge was credited!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TFacXbXZIind8qHVUMskrw",
        "caption": "Photo of Urban Bites Mediterranean Cuisine - Singapore, Singapore. Left- Hummus Shawarma with chicken Right-Moutabal Baba Ghanouj",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TFacXbXZIind8qHVUMskrw/o.jpg"
      }
    ],
    "user_id": "v-GbMECGvcOscLlBEdn6Zw"
  },
  "1xEigLAyLXM4rC6-o-IqiQ": {
    "date": "4/27/2017",
    "text": "Pretty bad to be honest. The shwarma wrap was small (only slightly bigger than a normal iPhone), skimpy on the ingredients and lacking in flavour. The fries were cold. The savoury drink was so salty my wife couldn't take more than a sip (we've had this drink in many places before). Worse yet, it was expensive. Don't bother.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "udTl5DKjHzkYob-DW1e17g",
        "caption": "Photo of Urban Bites Mediterranean Cuisine - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/udTl5DKjHzkYob-DW1e17g/o.jpg"
      }
    ],
    "user_id": "HLd_bvine7sRJt2K7RHTPQ"
  },
  "Iqr1PBgyEd9Si_oNDSGtSA": {
    "date": "3/25/2017",
    "text": "Great Mediterranean food downtown.  Been looking for a place like this since I got here and thank goodness it's near work.  Not cheap though but found the tabouleh excellent.  I could eat that stuff all day.  Hummus was excellent as well.  Spicy lamb skewers were good and filling though probably big portion for lunch.  Recommend the wraps if it's a lunch meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ADYrDX_GK_pVMOoAXXHP4w"
  },
  "dAU6AunMgdxB7lMxAiStNA": {
    "date": "9/25/2015",
    "text": "Its a nice middle eastern place but the prices are expensive. For example, the set meal that was 12.90 is now 19.90. Other prices have followed the same ratio.Food however is good. had the kibbeh, arayes and lamb kebab. All are tastefully done. But its the price that is going to make me think twice before I go there again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "cFtvzn-WDgZjAx0r3pY5Sg": {
    "date": "3/21/2016",
    "text": "Pretty good after the renovation. We had the falafel wrap and the chicken kebab, it came to $18 per person. I guess that's pricey for Middle Eastern food, but it's also the CBD. Can get pretty packed at lunch. Portions aren't too generous, either.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "rwMmkVO99LAlNeoigyrirg": {
    "date": "6/19/2015",
    "text": "Uhhhhhh what happened to this place? They revamped their interior, went further north on the prices, and smaller in portion sizes! What's that all about? What was working for them before was the good food at a great price... Bahhh, so disappointed.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "6FJ95RcNl4jng1tsnBp1pg": {
    "date": "4/1/2014",
    "text": "When we want good cheap Middle Eastern food, we come here.  The prices you see listed include GST, and there is no service charge, so 2 pax can come out full here for $60. Whereas other Middle Eastern places cost 20% more. Also, water is served for free.Everything tastes really good. We like the hummos, it is very smooth. Hummos with garlic is excellent. The sampler mezza platter is a good way to try a lot of things.  They also have pita pizzas, wraps, and more fancy entrees. We usually stick to the appetizers because they have such variety.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uuz_IsaZ-4jIPn-ay1oAg"
  },
  "mmWfkNbOiYFQQ9dc7xqUaQ": {
    "date": "8/16/2014",
    "text": "this place is a great place for the money.  the mezze platter is huge with some great selections.  the hummus was our favorite.  i tried the swarma and was very happy about it.  we also did the chicken which was cooked perfectly.  everything was fresh and the service was good.  i will for sure be back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "evkK9_5qNsFuPRA5xakzdw",
        "caption": "Photo of Urban Bites Mediterranean Cuisine - Singapore, Singapore. Mezze platter with veg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/evkK9_5qNsFuPRA5xakzdw/o.jpg"
      },
      {
        "img_id": "cv230EYAQUeyjJ9zbjGcaQ",
        "caption": "Photo of Urban Bites Mediterranean Cuisine - Singapore, Singapore. The counter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cv230EYAQUeyjJ9zbjGcaQ/o.jpg"
      }
    ],
    "user_id": "RQc1sODOsSL98gRaRUnuYA"
  },
  "Keb4s2ni_wX83mx0ot-Isw": {
    "date": "1/9/2014",
    "text": "Just had lunch here. Nice, clean place. The hummus and shawarma were both very good. I will definitely be back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b4j0Cw_XM9EbXKY_yBXUSQ"
  },
  "3Cjv4y8MX0XXP-Nnah-MXQ": {
    "date": "12/15/2013",
    "text": "Had a light lunch at Urban Bites today. Fairly standard sterile lunch bar décor, service wasn't great and wasn't bad, food was pretty decent. Appreciate that the breads are baked in a stone oven and the baba ghanoush had the right amount of smokiness. I had a chicken wrap which wasn't over-impressive in either size or contents but still filled the gap. The grilled chicken was perfectly cooked although, not a whole lot off it. There were some tomatoes, pickles and a garlic sauce that lingered on my breath for hours afterwards! Unfortunately there were no banana and chocolate crepes that day so we left without dessert, however the cabinet was well stocked with Mediterranean treats including baklava, Turkish delight, nougat etc. The menu seems perfect for sharing with an a multitude of cold and hot mezze items, pizza, salad, and more substantial meals. Would go back if I'm ever craving Mediterranean.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MTQAGVEdfXjvFRPwsqvnlQ"
  }
}