{
  "6Fxj_RSN3JuNi2-M1TDvRA": {
    "date": "4/29/2014",
    "text": "this place is damn good and damn expensive.. thankfully a friend's family picked up the tab.. if you like the heat... you can eat outside and enjoy the light show highlights include cereal prawn.. fried baby octopus.. and of course the chilli crab.. i'd skip their desserts thoughthe place is quite small.. and it also gets very loud",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW-iz5OKzzp2WOHh-CC9uQ"
  },
  "5ZwYkvUqV8v0uQAaCT42Lg": {
    "date": "5/1/2017",
    "text": "extremely disappointed. seated outside, which was a good sign, then everything downhill. ordered drinks (wildly overpriced), appetizer (was highlight of the meal, should have left while ahead), then main courses: chili crab (the \"small\" was 1.6kg s$125. now think about that - s$125!!) + 2 other mains + fried rice. the waiter brought 1 main, and we waited for the other 2 + the rice, which was not served with the 1st. then the 2nd main arrived after the 1st was cold, still no chili crab!!?? lost appetite, cancelled the chili crab which sent everyone berserk. insult to injury, they brought the fried rice last. needless to say, not a good food time. the hostess apologized, big deal, the meal was ruined. thankfully, the company was great and we ignored the terrible service. we will never return for several reasons: restaurant is a tourist trap (don't understand why anyone would go, but then again never underestimate stupidity - this was recommended to us and was our 1st visit to Singapore), food average, stupidly expensive. i do not mind paying up for excellent food, but this was not excellent. the good news: day before, we had the chili crab at Jumbo, which was 1/2 the price & can only say, since i did not have at Palm Beach, therefore can't compare, but Jumbo's chili crab was excellent!  so i didn't feel i lost out on finally having Singapore's signature dish. be forewarned, even \"IF\" all dishes had arrived together, i would still never return - just not worth being taken for a sucker when there are so many great places to eat in Singapore!! help this helps those who are thinking of going because of the name and location. oddly, i have not been able to find their menu online? their website does NOT have the menu, which strikes me odd. another reason not to go!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulsm3bzExNBE1BoSqAHK-A"
  },
  "35u-Npa0cggcVYynsrdQng": {
    "date": "4/10/2015",
    "text": "The reputation exceeds the actual experience at this famous restaurant. The service was very slow, often waiting 10m or more to get water refilled even though we were paying a fortune for bottled water. Food also took forever to arrive and not well paced (does anyone really want the vegetables before the main course arrives?) The food itself was okay, though personally I prefer more meaty flavorful San Francisco crabs or even the small Maryland crabs which at least are easy to hammer open. They do not provide the tools you need and are stingy with napkins and wipes. Overall the experience was well below what you would expect at a higher end place and of course there is no view from inside the restaurant (where there is minimal though insufficient A/C). If you want better crab (minus the view) I'd hit one of the outdoor food centre/hawker stalls. And beware the spicy chili oil will do a number on sensitive stomachs. I'll be generous with 2*",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2hZ2026wemwnT4a60b2Xw"
  },
  "9Lipxh1Q86SSHhHUvOCe6A": {
    "date": "7/22/2018",
    "text": "Good location at Merlion Park , Have Dinner with Family at weekend and nice service when get into here.Server kindly offer Apron for you to protect any stain when eating Crab.Order the Chili Crab as friends recommend mostly about this restaurant. Satay by assorted meat is tender , juicy with 2 different sauce . Grilled Garlic Scallop with Asparagus was tasty. The only complaint was from Grilled Water spinach, it is over Salty . Too much grease.Seafood fried rice is ok with lots variety inside.For sure will be back next time when trip to Merlion Park in the near future.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g_g3ZQbrpFCjUe_4BoaZPA",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g_g3ZQbrpFCjUe_4BoaZPA/o.jpg"
      },
      {
        "img_id": "ZiBMOGl7iL_dVr0a7w74rA",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZiBMOGl7iL_dVr0a7w74rA/o.jpg"
      },
      {
        "img_id": "IYH5aq1pu-0O10_FXniZig",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IYH5aq1pu-0O10_FXniZig/o.jpg"
      }
    ],
    "user_id": "U4RMyvxmdMXgRO3U8xBWzg"
  },
  "ex4M0pL8Vik6eUFjqlPEyw": {
    "date": "7/17/2018",
    "text": "Great place for Chili Crab! It is a very casual restaurant but reservations are suggested. The crabs here are HUGE! My crab weighed 1.6kg / 3.5 lbs. Biggest crab I have ever eaten in one sitting. We could have shared the crab but didn't realize just how big they were so we each ordered crab. Thankfully that was all we ordered (with bread). Pricey but worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MaorMYF4AVF9N0zaEcKOCA",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. HUGE crab! Chili crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MaorMYF4AVF9N0zaEcKOCA/o.jpg"
      },
      {
        "img_id": "WcU8BNw4DoLtocl5qOVSMQ",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. The tea is to wash your hands while eating as chili crab is quite messy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WcU8BNw4DoLtocl5qOVSMQ/o.jpg"
      }
    ],
    "user_id": "g5K4TpQCYOCeqjdKr2Xxng"
  },
  "syL-fgh-n9ilZ1JVmSTb8g": {
    "date": "2/14/2018",
    "text": "Really disappointed with the service at this restaurant. Reserved a table for Valentine's Day dinner. The restaurant seemed to overbook itself and was unable to handle being at full capacity. Our servers, although very nice and friendly, were so busy they forgot about us completely.Food wise: Mango cocktail was nice, Asparagus scallop was good, Half crispy duck was great. Fried squid was not good at all. Three stars because the food wasn't overall bad. The experience: We were initially sat down at a dirty table. After it was cleaned, we sat there looking around for someone to help us, when were finally served water. The waiter who seemed like the outdoor seating Manager - again very nice but took our order and rushed away quickly. We got our food and didn't like the fried squid at all (very chewy and too sweet). However, no one attended to us at all and so we never had the chance to tell anyone it wasn't satisfactory. We then waited and waited and finally flagged down someone to get water re fills. Our table was never cleared and no one came by to ask us how we were doing at all. By the end of the dinner, we were so fed up that we just flagged down someone for the check and left. I was disappointed that we paid a lot of money for what we thought was a Michelin star level restaurant. I would not recommend this restaurant. However one plus was the gorgeous river and Marina Bay Sands view! And again staff was very nice but there needs to be some retraining on service and add more staff to handle the busy nights!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yWuOy_jUlI2Edj1LKQPqLw",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. Crispy duck, scallop and asparagus, fried fish. I would recommend all three.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yWuOy_jUlI2Edj1LKQPqLw/o.jpg"
      },
      {
        "img_id": "M_m81rji2Bc2W6Nbo-eJ0g",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. View from the outdoor seating. We waited so long for any type of service that it was nice to have something to look at.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M_m81rji2Bc2W6Nbo-eJ0g/o.jpg"
      }
    ],
    "user_id": "uznWLX8OPqwlawabtLQtYQ"
  },
  "8WcDW39YzG2T2uhfXvMrrg": {
    "date": "4/24/2018",
    "text": "Man, there were so many Koreans eating here that I thought I walked into a Korean restaurant! I guess we know where to congregate when we find good food!We didn't make a reservation and were lucky to get an outdoor seat on a weekday night. We ordered....chili crabs and golden almond prawns. Surprise! Both had excellent flavors.Yeah...it's a tourist trap but at least the food was good that I didn't mind paying a little more. Service was attentive and accommodating.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3qPEWkgD32MxP9bIp2zow"
  },
  "qdXxieMmX2Y1mQECm86ZEQ": {
    "date": "3/16/2018",
    "text": "Everyone comes here for the view and crab dishes.. there's a reason why. The chili crab was decadent and perfectly seasoned. We also had razor clams and the calamari. Would not recommend the calamari as it was a bit too sweet for dinner. The razor clams were steamed to perfection and the sauce was a well balanced sweet and savory. I would like to come back to try the pepper crab! It looked less messy to eat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "er7l-YCU44Nsw90wuA4XGA",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/er7l-YCU44Nsw90wuA4XGA/o.jpg"
      },
      {
        "img_id": "azvUYZWilmhKcXB6xAFhEg",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/azvUYZWilmhKcXB6xAFhEg/o.jpg"
      },
      {
        "img_id": "cRX-4fgrKw1j0D3KSThg0Q",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cRX-4fgrKw1j0D3KSThg0Q/o.jpg"
      }
    ],
    "user_id": "gUc77TAoMkvfpalzA2KvEA"
  },
  "opBDVFhYadnUpfUIr1aAFg": {
    "date": "1/30/2018",
    "text": "Reserved last minute, so was not able to get any outdoor seating. The outdoor seat view from what I can tell is spectacular. Ordered pepper crab and chili crab. Love them both. Fried baby octopus is yum. Taro roots desert is lightly sweet and smooth. Love the texture.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aVkkbDfcu__Tr_E59fAYrQ",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. Drunken prawn in. strong herb tasting soup. Not so crazy about this one.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aVkkbDfcu__Tr_E59fAYrQ/o.jpg"
      },
      {
        "img_id": "gJEunWwnIeHCq2Ho3LzrIg",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. Chili crab.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gJEunWwnIeHCq2Ho3LzrIg/o.jpg"
      },
      {
        "img_id": "WeUXcQFynGYP1V2RVFKYsg",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. Black pepper crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WeUXcQFynGYP1V2RVFKYsg/o.jpg"
      }
    ],
    "user_id": "zDXSy_0BHrmF7h1ybqOOvw"
  },
  "NrbUvZ0y6ie8L3qMMe5OAw": {
    "date": "6/3/2018",
    "text": "One of the long established names associated with Singapore's chilli crab. They've since expanded to more branches from its first at Kallang. This is where I bring overseas visitors, with its large tanks of swimming fish, crabs and lobsters.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "elaLkfhrp_1O5kDA7ssuwA"
  },
  "j71z-HYxSkDkUpeDMFcetw": {
    "date": "9/2/2017",
    "text": "Love the food and atmosphere. Make a reservation for outside around 8pm or 9pm so you can see the lasershow. Crabs are good. I really loved the almond cereal prawns.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NF9Dvs5msG3LOGbWUsWYpQ",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NF9Dvs5msG3LOGbWUsWYpQ/o.jpg"
      },
      {
        "img_id": "wtjYeqr1GKTeak0eaMzGyw",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wtjYeqr1GKTeak0eaMzGyw/o.jpg"
      }
    ],
    "user_id": "DBfgLA5aKG7lOr2uiH4BSA"
  },
  "_EnSnkKHuu4QKBk0qW1JbA": {
    "date": "2/26/2018",
    "text": "Food was excellent. I recommend the spicy crab. Also, sit outside as the view is great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXAyhpYgR2Tn8Ab9RiXKRg"
  },
  "6xeEWBsvhzJlDqOv-VNS5w": {
    "date": "3/22/2015",
    "text": "I don't typically like crab, it's often too fishy and a lot of work for not much reward in my view. But Palm Beach Seafood's chili crab really rocked! It is a huge serving, covered in delicious chili sauce and served with yummy little bread rolls that you dip in the sauce. Order some rice too.We started our meal with a tower of fresh fruit. Our waitress was a little confused, but it was a great start to a yummy lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ytWFR6cNNhKYVlFdQjkOww"
  },
  "j9icH04t2DQROSAXe6X47A": {
    "date": "5/21/2016",
    "text": "This was was first time trying the famous chili crab in Singapore.  The crab and fried rice, countered by the fresh seasoned greens was excellent.  For those of you with OCD for cleanliness, you'll need to get over that quickly with the chili crab -- it's worth it! Great location and view looking at The Sands.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KHAHwxzyZ213A1qy009sVg",
        "caption": "Photo of Palm Beach Seafood - Singapore, Singapore. Chili crab, bib mandatory!!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KHAHwxzyZ213A1qy009sVg/o.jpg"
      }
    ],
    "user_id": "-ZMdQqa5yxTEAQu9z8DFPg"
  },
  "tRKIAExwazD93BTEXn3G_g": {
    "date": "12/24/2013",
    "text": "After years of eating at Jumbo - I finally said, \"man I need a change\".So I opted to give this place a shot after some folks were hyperventilating on the internet about how amazing their chili crab was.Alrighty then ..Well, news flash - I personally didn't think the chili crab here was better than Jumbo.  I thought the flavor was a bit too sweet and the crab was just okay.  The price was also pretty expensive, which is to be expected.  The only problem here was the shell of the crab was very thick/heavy compared to what I get at Jumbo ... since these crabs are priced by weight, I felt like I paid a lot more just for a crab with thicker shells but the same amount of meat as in Jumbo.As for the other dishes, the kankung belachan was fine, and the fried mantous were fine and fit the chili crab sauce just fine.  The so-called \"addictive\" fried squid appetizer was okay but also not as awesome as it was billed by some overzealous internet fans.The experience was fine, and this is a convenient location if you're staying by MBS or any of the hotels in the area.  But personally I think you're still better off going to Clark Quay (or the East Coast) to grab dinner at Jumbo.  The one exception to that is if you're really itching for signature Singaporean seafood right by the Merlion or near the MBS area.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "rm92EiaA7h5lLbAK5dJKcw"
  },
  "DTu4t1jjHJU2Plt4UYjDfQ": {
    "date": "5/26/2015",
    "text": "Definitely a nice upscale option for Chili/Black Pepper Crab, Palm Beach Seafood has a long checkered history, but feels right at home in its swanky digs by the Fullerton Hotel.  The outdoor seating in particular is stunning with the Bay and MBS in the background, especially during sunset,  The Chili Crab is also quite tasty as it is massive and I like the fact that they are generous with the rolls. The appetizer platter, while decent, didn't wow.  The fired rice was tasty but a bit too salty.  And Service outdoors can be slow.   So while Palm Beach Seafood isn't perfect, I still prefer the location and atmosphere to the zoo at Jumbo and in Clarke Quay.  Definitely a good option, for visitors and locals alike!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "yw0kuYpKQOtrJ4CTlySNqg": {
    "date": "11/13/2014",
    "text": "Yes.  It's a great location, yes, it's good food.It's sort of pricey, so it'd better be that way. If you opt for that kind of food and restaurant, I think nevertheless the atmosphere at Clarke Quay is more appealing, though it lacks the admittedly beautiful sight of the marina bay sands light show.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CRwL75CNQA7lkHPCnePDaA"
  },
  "_ECu47CS5eYJwB6UzWfWMg": {
    "date": "6/26/2014",
    "text": "Jumbo is still my go-to restaurant for friends and family who are first-time visitors looking to try chili crab.  But for those who've already experienced Jumbo and want something a little different, we head to Palm Beach.I would say Palm Beach is the more upscale version of Jumbo. The location is pretty sweet; it's near the Fullerton Bay Hotel and has a great view of Marina Bay Sands. If you go for dinner, I would definitely recommend sitting outside as MBS at night is such a beautiful backdrop. In terms of dress code, I'd say it's casual, but if you want to err on the side of caution, then a black smart casual outfit would do. (I mean, you'll be eating messy crab, after all!)Get your \"That's what she said\" line ready because let me tell you: the Sri Lankan crabs they serve are HUGE. We're talkin' 2 kg behemoths, with claws the size of a child's face. You'll definitely pay for it; the market rate was $80/kg the last time we went.Both the chili crab and pepper crab are delicious; I guess if I had to choose a favourite, I'd go with the pepper. But by all means, definitely try the chili so you can compare and write an educated Yelp review! For sides, I've had the kai lan and seafood fried rice; both good but not anything to Yelp about. I'd definitely save room for dessert though, as their fresh fruit platter is refreshing and the perfect palate cleanser. If you're dining with guests who don't live in Asia, it's even better; it's a great way to introduce delicious Asian fruits like jackfruit, durian, and mangosteen, produce that can be difficult to find outside Asia.After you're done, walk off some of that crab by strolling along Marina Bay and snapping some shots in front of the famous Merlion!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "F871m5SmvqefRxfjxcr2dA": {
    "date": "1/11/2014",
    "text": "A good and reliable restaurant! 4 stars. Here's why:Food -- quite good variety. Our party comprised of a meat eater, a low carbs and no seafood eater, and a pescetarian. They catered really well for all of us - and amazingly as a share arrangement. I personally loved the fragrant tofu and the dried fish chips. Wine -- good variety. They also checked the temperature of the wine (always a good sign especially in Singapore). Service -- really quite good. I was very happy with the service. Helpful and polite but not in your face. Decor -- we sat inside which was pleasant. Outside was great, with amazing views of the river. Acoustics -- very good. A friendly buzz but we could easily hear and talk.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xwNHXBK9fCCrRHWJzm4M5g"
  },
  "JJdOfb0UUHz1Kit3m5XTWw": {
    "date": "11/12/2013",
    "text": "The Chili crab here was much tastier than jumbo. We had a seat inside near the live seafood tanks, and the crabs in there were some of the largest live crabs I've ever seen. We had chili crab, golden crab, prawns, fish wrapped in banana leaves...I can't even remember it was a seafood extravaganza. Unlike most places they actually gave us cloth napkins which was nice, in addition to the traditional finger bowls and wet naps. Recommended for seafood.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "exygIMUwWiMg8HU4L_lNIw"
  },
  "ZCWe_jNjBWqQ6Xar6LnwAQ": {
    "date": "6/3/2013",
    "text": "Great view of the bay, a classic Singapore sling and chili crabs. What more could you ask for?We came here with colleagues and had the whole gamut of foods including the whole friend grouper, chili crab and salt fish fried rice. At 20:00, the Marina Bay Sands puts in a great light show on the bay so come late and sit in the patio. The place was packed and the food was outstanding. On the downside, service was a little slow.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jSg-v7jl9PpOYz74BNP6ng"
  },
  "1RmO-5W2GnyesGS6Gk4zMg": {
    "date": "7/22/2016",
    "text": "Pepper crabs were very good and better than the chili crabs. Atmosphere was bright and loud and not great for a large party.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1dCGsH1cAppC8LpFo26Pw"
  },
  "SW--XWZZbhPEgKphoO2_Ig": {
    "date": "9/28/2012",
    "text": "First off - just wanna comment on the restaurant's ODD name - haha - b/c its a straight up Chinese restaurant. Anyway - the food was alright and I am biased b/c I am vegetarian and although I appreciate the special veggie prix fix meal that they had available for 35$S - the food was super bleh. Now as for the seafood my friends devoured - they got the chili crab and the black pepper crab and a few other dishes and totally devoured everything. I am giving this place 4 stars not b/c of my experience but from watching how much the rest of my party enjoyed the place. Additionally - the location is just great - great view of the Singapore bay and a view of MBS",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_Sy0izMlyQ0_M-vLpmmfyw"
  }
}