{
  "zRV33sQCLgeyTeALV3R-3Q": {
    "date": "6/16/2018",
    "text": "Met my brother and his family for a little dinner and decided to try out this place.  The main items on the menu were the duck, various pork dishes and some dim sum... wait a minute... we were told they were changing that part of the menu.We ordered a mix platter of duck, crispy pork belly (siew bak), and char siu. For our carbohydrates we ordered porridge and noodles.  The mix platter arrived pretty quick and it seemed small for a big dish.  We also ordered some steamed veggies to round up the meal.Surprisingly the amount of food was enough to satisfy 4 people without going overboard.  My favorite meat was the pork belly.  The crispy skin was still crispy and not hard to chew.  The amount of fat was also quite reasonable.  The duck which was supposed to be the star attraction was good not great.Service was pretty good even though it was in a food mall portion of the Centrepoint mall.  Apologies for lack of pics as I was distracted by the conversation.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NaKIUQrZGA9gL7jvq1p0_w"
  },
  "4Ql3MVTBR50D-_WohnclYQ": {
    "date": "8/9/2017",
    "text": "This place was conveniently located right across from the hotel I stayed at, so I took advantage of it as a pre-flight lunch spot. The large screen photos right outside the restaurant looked mighty delicious so that's what lured me in.There was only one other table besides my party of three on a weekend lunch hour. We were seated immediately and our server brought us water. We decided to get a half duck and a roast pork and roast pig over rice dish alongside charcoal roasted duck buns. I am a big fan of barley tea and as my last meal on this trip to Singapore, I didn't regret ordering it. Our friendly server made conversation with us and mentioned that the duck the restaurant serves is unique because it's sourced from England and boasts in its fatty and rich meat. I was expecting much more from this duck but it let me down. The skin was not crispy but very oily and meat rather stringy. The price for the half duck was not cheap either compared to what I'm used to getting. The roast pork and pig over rice was nothing particularly notable, but the flavors were not bad. The skin on the roast pig was also not as crispy as I'd prefer. What stood out the most were actually the Royal London Duck Black Pepper Buns that were packed with peppery duck meat bites. These charcoal buns had an interesting texture outside and a soft and saucy inside. Our server had asked us our thoughts on their food and we were honest about it as being \"okay\". This is an okay or decent restaurant for roasted meats but I cannot say they are exceptional. It was a casual and comfortable place to have a meal close by to our hotel.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "89QtSWjJKyOtrP-tolrZyw",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Royal London Duck Black Pepper Buns (charcoal)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/89QtSWjJKyOtrP-tolrZyw/o.jpg"
      },
      {
        "img_id": "BasVwOddatgVWakJGHOd6w",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Royal London Duck Black Pepper Buns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BasVwOddatgVWakJGHOd6w/o.jpg"
      },
      {
        "img_id": "j7ZTJ6VwKiHbBTA_lqOINw",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Roast pig",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j7ZTJ6VwKiHbBTA_lqOINw/o.jpg"
      }
    ],
    "user_id": "mRQpQ9xxSi7VWC2zpCvs7w"
  },
  "C0VPDmMoZ8HNlEt97ZUWUw": {
    "date": "4/18/2017",
    "text": "The roast duck and chicken were juicy, flavorful, and delicious. The dumplings were good.  The soup was good but unfortunately too salty :(",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aGq5zGeHaupzGJXsNKV20Q",
        "caption": "Photo of Royal London Duck - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aGq5zGeHaupzGJXsNKV20Q/o.jpg"
      }
    ],
    "user_id": "xJJIDjD0YdVgKn_-pegPZg"
  },
  "OOIjgi7-AlEWUvcNewvmeQ": {
    "date": "10/6/2016",
    "text": "Stumbled on this new eatery by accident when I popped by Centrepoint via the underpass from Somerset 313.Ordered the half duck ($25) to share with the bf as well as the duck xiaolongbao, watercress pork rib and a bowl of rice. The duck was tender and flavourful, just enough fat for a decadent mouthful but not so much that you feel jelak. The skin was crispy good! I like that the plum sauce they serve has a distinct ginger kick and the chilli, while probably produced in a central kitchen, is the proper fried dried/fresh chilli sambal type you get with duck rice. The duck xiaolongbao was meh. Couldn't taste the duck, it was more like a regular pork xiaolongbao. Soup was decent, brewed long enough to be sweet from ingredients. Oh they also have a fridge full of craft beers from Brewerkz. Service was super. The waitress noticed I'd put my bag behind me on the seat and came over to move the neighbouring table and chairs over so I could put my bag on another chair and sit more comfortably. She also popped by to promptly refill tea cups. #ftw The place is owned by Fei Siong group which runs the minced meat noodle chain Eat and lots of other eateries, so they've got the fast casual restaurant concept down pat.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZOWZI6TeKsrTUUVzLDVsqQ",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Watercress pork rib soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZOWZI6TeKsrTUUVzLDVsqQ/o.jpg"
      },
      {
        "img_id": "X1ONXu-nS4iLnDFfFZ4mtA",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Duck xiaolongbao",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X1ONXu-nS4iLnDFfFZ4mtA/o.jpg"
      },
      {
        "img_id": "41yj2fuhHbbdKzFP6FWD9g",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Half roast duck",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/41yj2fuhHbbdKzFP6FWD9g/o.jpg"
      }
    ],
    "user_id": "wuRI6NhRB6cUWERRmcvOMQ"
  },
  "wewuZuLf38E10pKvLTghoA": {
    "date": "10/16/2016",
    "text": "Royally Disappointed. With a host of London Duck speciality restaurants opening its doors on our foodie island, it's no surprise to see another chain specializing in the \"Wagyu of Ducks\" jumping in. Opened by the Fei Siong group of companies, who for the longest time specialized in Fishball Noodles, Royal London Duck is located in the prestigious, upmarket, Mandarin Gallery. Looking at the menu and pricing, they are almost an exact replica of London Fat Duck, the first of London duck speciality restaurants in Singapore. Matching almost price to price and item to item, we decided to give it a try to see just how well they stand up to their rivals. London Duck Rice ($8.80)The duck here is a lot leaner than the London Fat Duck version. It was roasted well, and very tasty. We were initially disappointed with the lack of sauce but once tasting it, we knew why they gave significantly less as it would have overpowered the dish. The duck was tender, juicy but the skin wasn't quite as well roasted as that of London Fat Duck or Four Season. The dish was fragrant and tasty and the lesser fat may be more acceptable to the health conscious. That said, a lot of the fat went into the sauce, which gave a nice, rich, smooth coat on the rice, bringing the dish together very nicely. Unfortunately, that was the highlight of our meal. Royal London Duck Black Pepper Buns ($5.80)The buns were semi-decent. Not as sweet as other places selling it and not as light but the huge disappointment was the stuffing. While the sweet bun is usually used to compliment the slight spicy pepper filling, the ones here were over the top peppery. The duck was completely lost in the pepper and, despite being moist and juicy, you really couldn't taste anything else but black pepper. What's worse was that it left that bitter pepper after taste in my mouth after each bite and I felt myself cleansing my palette with Chinese tea after every bite, just so I could taste the other dishes. Royal London Duck Xiao Long Bao ($5.20) Offering something different here, it was a very forgettable Xiao Long Bao. The skin was slightly thick, making the tips a little hard to eat as it got a little doughy. The filling was, well, politely put, forgettable. Had I not ordered it, I would have thought it was just a regular Xiao long Bao. The pork to duck ratio was way off, making the dumplings taste like any normal pork Xiao long Bao. The flavors of the duck was completely lost and the soup in the dumplings were nothing but average. It severely lacked the richness you'd expect after trying the duck sauce. Instead, it was a very light, clear broth that, even in a regular Xiao long Bao, would have left you disappointed. No depth, no punch and well.... All quack with no substance.Despite the less than average food, nothing could have prepared us for the worst possible service we had ever received. Firstly, the senior waiter, expressionless, no smile, looked like he really didn't want to be there. Secondly, tea was served after ordering. Waitress was friendlier but the tea came barely luke warm. However, when she came to refill my tea, it was piping hot. Why serve patrons tea that has set for a while when there's a fresh pot?Than came the highlight. When our duck rice came, they brought 2 plates when I had ordered one. I politely told the waitress that I had only one and she apologized and said she'll check. However, from the corner of my eye, that same, I could feel that same \"friendly\" senior waiter who took our order, staring at me from across the restaurant. He finally came across, with suspicion in his eyes, completely full of doubt and asked \"sir, you order one or two duck rice?\".You should never confront your patrons in a defensive / interrogative manner and why would I send back one if I had ordered two?After the confrontation, he went back to his counter, started banging on things and started shouting across the restaurant to his staff that I had ordered 2 and he didn't get the order wrong.  I had half the mind to tell him I could hear him and he should say it to me directly and not pretend I'm not there. After that incident with us, another table had gotten an order wrong and as the waitress was taking the dish back, he started berating her in Mandarin, saying things like \"I don't know what to do with you people anymore. This is not the first time, I have nothing to say, you all are beyond useless or beyond help\" which is an absolutely disgusting behavior. You may be a senior staff but it is unprofessional to berate your colleagues 3 ft away from your patrons.If you feel the need to do it, take them to the side or to the back, not embarrass them just because you're on a power hungry trip or in a bad mood. That whole experience really spoilt our lunch for us and despite the duck being pretty good, everything else, along with the service left a sour taste in our mouths. Royal London Duck? More like Royal Pain in the Butt.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mzFIrUDMgzY2rvVFePYgqQ",
        "caption": "Photo of Royal London Duck - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mzFIrUDMgzY2rvVFePYgqQ/o.jpg"
      },
      {
        "img_id": "9EBjM83gEvXyq5DgYznUdw",
        "caption": "Photo of Royal London Duck - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9EBjM83gEvXyq5DgYznUdw/o.jpg"
      },
      {
        "img_id": "X7ajQNUnwnuWKjWYW6qGgw",
        "caption": "Photo of Royal London Duck - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X7ajQNUnwnuWKjWYW6qGgw/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "0yQwXUlvrR1jbV0yASFLQQ": {
    "date": "10/6/2016",
    "text": "Discovered this place existed after reading a review on Yelp.  It's located in the newly renovated basement area of Centrepoint, and I assume is a cousin of London Fat Duck over in Scott's Square.I dipped my toe in gently by ordering a roast duck / roast pork on rice, my friend had a wonton noodle soup, and we shared the charcoal charsiew buns.Roast pork was good, but the signature roast duck (breast meat) was pretty disappointing.  Whilst the duck itself was good (lean, moist, but generous fatty skin), and nicely cooked, the flavour just wasn't there.  It was almost like it hadn't been marinated or seasoned.London Fat Duck manages to get the flavour better, whilst also achieving a crispness to the fatty skin.  Royal missed on both.The buns over at LFD were also better - pastry had a better 'bite' and crunch to them.Overall, service was attentive (though it was quiet when we went), and it was $32 for 2 of us, but I would stick to LFD in Scott's - especially now that the hype queues have died down.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ZbrQuNMPCksNMnN6BY73Q",
        "caption": "Photo of Royal London Duck - Singapore, Singapore. Duck was very good quality, but just totally lacked flavour. Was it even seasoned / marinated?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0ZbrQuNMPCksNMnN6BY73Q/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "z7t2rEfPWM2uf9_AzmBU0g": {
    "date": "1/22/2017",
    "text": "Tried the new branch at West Mall. We ordered a CNY set meal and almost every dish taste bad. The fish was not fresh and had a bad smell, the other dishes were either too bland or too salty. The only saving grace was the yang zhou fried rice.Very disappointing and regretted spending every cent here. Wouldn't come back and wouldn't encourage anyone to try.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yrdli8cG1On7UhCJrofKaQ"
  },
  "4sMnObKpG0J27sL1lJ5q4g": {
    "date": "4/20/2017",
    "text": "I went to the shop near Millenia Walk at Suntec. The staff is soooo awesome from suggesting dishes, to making sure everything was great and even making sure I had my briefcase since I almost forgot.  The food is great but the total experience is even better ;)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qwb77k6ckUxZBmjR1CACOg"
  }
}