{
  "3paOy15NDsleWeRDUdhPgA": {
    "date": "9/8/2018",
    "text": "We were visiting Singapore and while searching for a good Indian restaurant we found this place. It was a fantastic experience and food When is the last time we heard , pay the price what you feel like after having a lunch. If some restaurant can claim such things then they have to be super confident of their  quality. This family owned business serve food as a service and not as business and their passion just reflected in the quality of food . Must visit place if you are searching for good food in Singapore",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cCZNWfR0lDjpX2xZDbEY7Q",
        "caption": "Photo of Annalakshmi - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cCZNWfR0lDjpX2xZDbEY7Q/o.jpg"
      }
    ],
    "user_id": "qgqqese0s7ImXvE0qKVBWw"
  },
  "jG5WOtTVuNeEUONGEiWE8g": {
    "date": "3/23/2018",
    "text": "Good vegetarian food, good ambiance. Good find. Buffet style and nicely spiced/flavourful. Feels authentic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "arvhEHJAvIVIqTVOyFt2TQ",
        "caption": "Photo of Annalakshmi - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/arvhEHJAvIVIqTVOyFt2TQ/o.jpg"
      }
    ],
    "user_id": "8VAqRRuJy2oaZAVL9QZ49Q"
  },
  "hAvPo8vhggPv-EsBjSH8GA": {
    "date": "10/15/2017",
    "text": "Excellent food, as others have said feels like home cooking. Plenty of choice, have been many times and the family always enjoy. One of our favourite places in Singapore. Never know what to pay and probably go over the odds, but quite happy with that.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nd-bnFQODYrvOjerkjelBw"
  },
  "mBc7exZKnEEP6qSfuaUKhw": {
    "date": "7/24/2016",
    "text": "Pros: The buffet is very good with a nice variety and lots of flavor. I always enjoy it and walk away satisfied. Cons: I don't think any of the employees are happy people. They can be very weird about giving you a seat. They should wash the tablecloths; it's rather unsavory to see them flick away the food crumbs from a table then seat the next guests. Makes me wonder where else they're taking shortcuts on cleanliness. I also dislike listening to the servers snorting their snotty phlegm as they walk around the dining room.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncQakDQwswLutRIYumgl_g"
  },
  "cJGrr2Cu__acTRls8RuY2g": {
    "date": "3/19/2016",
    "text": "We had a craving for South Indian food and this was right across the road from the hotel and hence got into this one. However the management was fairly rude - as soon as we entered an elderly lady asked us if we had reservation and since we didn't have one she gave a discourse on how we should have a reservation on weekends and that too when 50% of the restaurant was empty!! We still wanted to try the food and hence sat down..the food was just about decent. The moong dal and the potato curry was good but the rest of the food was just average. The management definitely needs some lesson on hospitality! The only good thing is that they let the customer decide the price depending on how satisfied you are.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1JB7Y8LLRXdz6_kGhl-wHA",
        "caption": "Photo of Annalakshmi - Singapore, Singapore. Lunch buffet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1JB7Y8LLRXdz6_kGhl-wHA/o.jpg"
      }
    ],
    "user_id": "R6TPmf9CSSn3ghW2jKr2mg"
  },
  "AJpOzshsL_HGrlLfizKTPQ": {
    "date": "6/25/2016",
    "text": "Lovely homemade Indian food! Feels like eating at home. :) The buffet has a lot of choice, rasam, dals, rice, sabjis, pappadams and bhajis. You can ask for buttermilk or lassi, depending on what they offer for the day. I love the concept of the restaurant as well, you pay as much as you like! I haven't seen any other restaurant doing that! Appreciate the trust!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "urue4P9eYbKOTjXAhu4GVA"
  },
  "3Pg21BSF6s49rPb8uJfCTw": {
    "date": "6/15/2016",
    "text": "While I love the concept, the selection was very limited and the food was pretty bland. The naan was also nothing to text or post about. It also leaves a bit to be desired in the area of cleanliness. One saving grace, the mango lassi was amazing.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GDPLE0vuEohEI3UA1r4lg"
  },
  "kDyxbyHg_4seOH4rO-roVA": {
    "date": "9/4/2013",
    "text": "Extremely busy place at lunch. Food is great, place is clean, buffet style, and pay what you think is fair. What more could you ask for?My opinion is that $7 for lunch is fair. This was confirmed by the indians i work with. So, i think $7 for lunch and $10 for dinner is appropo.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "KuGQIxKfGiHLNRuWLuPpXA"
  },
  "ZJHZOs86grQwhVqSpHgiOw": {
    "date": "1/23/2016",
    "text": "Good food and lovely artistic and tasteful ambiance .... Food was perfectly balanced in flavours!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IisSnrArftd8mXHaXQl9EQ"
  },
  "9JZYJso_NF-YdGTEDGykxQ": {
    "date": "9/9/2012",
    "text": "Operated by the Temple of Fine Arts, Annalakshmi is an international chain of non-profit vegetarian restaurant run by volunteers. It lives by the concept of \"Eat as you want, Give as you Feel\", so there are no prices on the menu. Instead, patrons leave a donation of how much they think the food is worth and all the proceeds go to charity.Adorned with Indian decorations and lined with a haze of sweet smelling incense, it is obvious that the restaurant has a deep-rooted culture waiting to be revealed. Indeed, this culture is apparent from the authenticity of the dishes. The food at Annalakshmi is lovingly prepared by the volunteers and served on a buffet table. The wide array of selection incorporates flavours from North and South India, with dishes ranging from poori to oothapam and masala to dhal, amongst other gravies and sauces. With food so authentic, you can almost taste the tradition! The dishes are rotated periodically and vary within branches so that regular patrons are offered more food options.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  },
  "-O3CzTkQussApwYxBypFSw": {
    "date": "4/19/2015",
    "text": "Wonderfull food and extremely friendly staff. After a long day of sigh-seeing and stuggling in hot sun, this is something we wanted. Its 7-8mins walk from clarke quay.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CK_AjuOmPxB2LJoZ3_-cdw"
  },
  "j5Pn7YOqqCDsQBDMDjMn9A": {
    "date": "8/12/2015",
    "text": "Three stars for the concept. Food is very average as its made by volunteers who have a different day job. Good for when you are in a charitable mood.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "W9mzNbbaQu1JsZr3ujFc0Q": {
    "date": "1/10/2015",
    "text": "Nice philosophy (not for profit restaurant that contributes to arts and charities)... we stopped in for lunch and it was pretty average... nothing exciting...  one of the dishes was spicy and tasty but the rest were pretty uninteresting...   also, the buffet food was only vaguely warm...",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RmMbDOMp_BFS_kllQbRNxg"
  },
  "yFcK_ON7W8tcEe655SbKew": {
    "date": "9/8/2012",
    "text": "\"Eat what you want, give what you feel\"Yes, Annalakshmi is THAT restaurant, the one that doesn't charge but leaves it to you to offer what you wish to. It's fully staffed by volunteers, and is the culinary arts expression of the Temple of Fine Arts (TFA), an artistic and cultural organisation dedicated to serving the society through arts, music and dance. They've been around in Singapore since 1986, and I remember visiting them at the beautifully decked out Excelsior Hotel outlet, which then moved to Chinatown Point, and now Central Square. The buffet is my favourite part of dining here, with its free flow of lassi and masala chai, and the line-up usually has a great variety of dhal, masala vegetables and a curry or two. Bear in mind that it's pure vegetarian, and that it's not polite to waste the food that's been carefully and lovingly prepared by the volunteers. Always a great experience.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUodv8WGv4xo7EabaN3dqQ"
  },
  "q50G3LeVH4e2Q4QVkNGbPA": {
    "date": "3/26/2014",
    "text": "Food was spot on and would probably pay twice to three times what I paid in the states. So good - thank you and looking forward to going back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uD2Tf9-kLF2c2ZSOhLkxJA"
  },
  "DXlWTD4CUJE_SLlWwI88UQ": {
    "date": "8/18/2012",
    "text": "I used to frequent the Annalakshmi at Chinatown Point until they moved that outlet to Central Square in Clarke Quay (not to be confused with Central Mall). Was afraid that it would be a different experience at the new outlet but my fears were unfounded! The decor remains as beautifully intricate and this outlet is definitely much brighter than the previous and also much bigger too. One of the best thing about this place is that its a pay-as-you-wish indian vegetarian restaurant - its run by volunteers and the money you pay at the end of your meal goes towards an organization that cultivates Indian arts and cultural development - it sounds like the perfect arrangement. You may wonder how they keep the business running by letting customers pay however much they like but you'd be surprised how much people can feel generous after a good meal!It has a good selection of vegetarian Indian food from rice to poori to naan to oothapam and a few types of vadai. The drinks also have a good selection, the mango lassi is one my faves and I like to end my meals with a nice hot cup of spiced masala tea. If you come on friday and weekends, it's a buffet for lunch and dinner - not a bad selection but limited to only whats on the buffet table. Come for dinner on mon to thursdays to have the best selection of food from the menu.Final verdict: One of the best feel-good restaurants- good food, good ambience and all for a good cause!",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "sPkkLzD-XWFYBBQcNhwEAA": {
    "date": "8/23/2012",
    "text": "I have been going to Annalakshmi for years. It is one of the best places to find Indian vegetarian food in Singapore. This place is very interesting as it is run totally by volunteers and patrons pay what they like. They either have a full buffet or ala carte and everything is fresh and very good. You can order a selection of drinks like lassi or chai masala tea. It can get pretty crowded here sometimes so it is a good idea to make a reservation. The staff are all volunteers and sometimes they can be a bit grumpy.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  }
}