{
  "DATiNqADr5KfIZzk4l_mlA": {
    "date": "10/3/2014",
    "text": "This place is legendary for its long (think 2-3 hours) queues. To make it seem better, there's a reasonably-sized area for waiting outside the restaurant, and you can snack on popcorn/longans/crackers while waiting. There's also 2 manicurists at the entrance where you can get your nails done for free, but the wait is even longer than that for the restaurant....but we (a group of 5) went at 5pm on a saturday without a reservation and managed to get our table in 45min! The food was really good. We had a half-and-half: szechuan mala (numbingly-hot) and the chicken broth. Both were flavorful and enjoyable. The mala was really really spicy, my tongue went numb as I ate whatever we'd plonked into the hot pot (we all had the good sense to avoid drinking the soup). The chicken broth was tasty and we drank bowls of this down!Ordering is via an iPad app (comes in both english and mandarin), and is pretty straightforward. An average plate of beef (probably enough to serve at least 3) is about $15. Even the cheapest ones were of good quality and well-marinated. We had the beef, chicken and pork- all were very good.The handmade noodles were hailed as a \"must-try\". Basically, you have this \"noodle master\" (a guy) coming up to you and swinging the dough around skillfully as he makes his noodles in front of your table. It was very interesting to watch! But I'm not a big fan of noodles in hot pot so it's more of a once-off for noveltys' sake for me.Service was excellent too. The servers were polite, attentive and we were given ziploc bags to protect our phones, microfibre cloth to wipe our glasses with, hair ties to tie our hair (so that they wouldn't interfere with us eating) and bibs to protect our clothes with.The 5 of us were stuffed at the end, and it was to our pleasant surprise that the bill was only $38 (after tax) per person. Would definitely come here again when I have the time to!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "xXfHXGwURk0nkXu4Xv6jvQ": {
    "date": "2/28/2015",
    "text": "I love this place for it's Sichuan-style hotpot!I won't cover the waiting times and what you can do while waiting because every other reviewer has mentioned them.Special mention is to get the gongfu noodles! Ask the waitress for them, and the chef will come out and perform an acrobatic show using the noodles for you. Then you get to put it in your hotpot for consumption. It's kinda like a gimmick for entertainment purposes, but hey at least the noodles are good.The service here is legendarily good, even in their stores in China (yes don't gasp, it's true!). In no other Chinese restaurant here in Singapore do I find such great customer service from the staff who are friendly, accommodating, and gives good recommendations for your food. Our waitress was nice enough to let us know that we've ordered too much, and told us that if it wasn't enough we can always order more later.Overall, I'd go back again. Tips are to go late in the evening (around 10pm or later) so that it's easier to get a seat. You have been warned!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ONhZg_q_SHcOrT9s_WHqzg"
  },
  "Q3oE3gXj0HuztUNAb1tiVg": {
    "date": "11/9/2014",
    "text": "I'd expect much better. Maybe the hot pot is more common in Hong Kong, the quality is much better than this. SGD 45 per head we have ordered 3 dishes of beef, 2 portions of veggie, 1 seafood \"platter\", 2 pieces of noodle, 1 tofu and 1 tofu noodle. The soup base is MSG intensive. The food is standard but with this price the portion should be bigger and the presentation should be better...E.g. the seafood \"platter\" comes in a plastic plate and the 3 pieces of mussel, 2 shrimps and I forgot what else all lump together....Service....the waitresses are keen but I'm not used to all the rush in putting the whole plate of raw beef into the hot pot, while there are other cooked food in the pot......not a good hot pot manner to mix raw and cooked food together....the veggie and noodle all got overcooked when the beef is ready....mmmm.....The dessert is also lame....disappointed....",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ikFMOtsEZtEfihCw43A45Q",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Dance dance ..",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ikFMOtsEZtEfihCw43A45Q/o.jpg"
      },
      {
        "img_id": "-fyD_TbKTx1EVHJf58NVRQ",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Noodle dance! Lol",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-fyD_TbKTx1EVHJf58NVRQ/o.jpg"
      },
      {
        "img_id": "HqWCREpI87oeCqYN0h7SHg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Preparing for the noodle dance ..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HqWCREpI87oeCqYN0h7SHg/o.jpg"
      }
    ],
    "user_id": "QGP0TcL_0maoS7NvbXVi2w"
  },
  "qRUNAuvRI_DvZ5QehphtxA": {
    "date": "3/28/2014",
    "text": "Absolutely delicious but not sure if it's worth the wait...but seeing that I'm a tourist I'm glad I got the chance to try it.  As a local, I'm sure a Friday night without reservations wouldn't be the best time to check it out.  I waited over 3 hours but the perks for this include:1. Free snacks - popcorn, banana chips, watermelon slices, oranges2. Manicure bar - ladies, get in line to get your nails done for free!3. Games - Chinese chess available4. iPhone - they will apply a screen protector on your phone for you if you'd like5. Incentives - If you solve a Rubik's cube or fold 30 origami cranes, you get to choose a free plate up to the amount of $6 (woohoo!)Not sure if there are others but these were the ones that I was exposed to!The hand stretched noodles done in front of you at the table is pretty amusing. Our guy kept breaking it so took 4 times before he was able to drop them into the broth but all good.  Just meant a longer show for us =)  I'd say the highlight is definitely the broth...get the chicken one.  I could drink that all night long!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "xrSN2MkJwqmpYl7dAAGSDw"
  },
  "2upOpmDX5rbgn_NMeek2lg": {
    "date": "7/8/2013",
    "text": "This place will wow anyone away with exceptional good service however the long waits for your table if you do not have a reservation can really turn off. When I first read about this restaurant on a friend's facebook post, I couldn't believe what I read. Amongst other wonderful service they provide, like board games and snacks while you wait, free manicures for ladies, playroom for kids, apron for dining, ziplock bags for your devices, it was said that they provide a baby cot for the baby to sleep and play next to your table while you dine. Seriously? This is unheard of that a restaurant in singapore that will provide a cot for  my baby to sleep in while I dine. Awesome! I gotta check that out for myself. A few days later, I went with some friends to check out the place. And true enough, if you make your reservation and indicate that you are bring along a baby, a baby cot is prepared next to your table. They even have toys in the cot to entertain the baby. Aside from the service, the food is great too! Love their soup base, the ingredients that they use and the varied selection of the sauces. The broth is flavorful and delicious and the ingredients for the hot pot are fresh. Don't forget to order at least an order of their la mien, you also get a short performance with a wait staff doing a \"noodle dance\" that often diners would enjoy. Everything is perfect ... except the price. haha... it can be pretty pricey as they do not have buffet. Since then, I am sold in going to HaiDiLao for hotpot. Its an awesome dining experience and we always go home stuffed and happy. Remember to make your reservation, else the wait can be 2-3 hours during peak hours.  From what I remembered, for weekdays, the last reservation is at 6.30pm and for weekends, the last reservation is at 6pm.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "w2_cG-OaLZq3OB4R4k_qZg"
  },
  "KqmPPHBToFYnwSkdlIsQmA": {
    "date": "8/30/2014",
    "text": "Not a big fan of hot pot or steam boat but i am very impressed with this one.    Superb soup stock and very fresh ingredients and meat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kSZXfCS3O0NXgWSwljDmzw",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kSZXfCS3O0NXgWSwljDmzw/o.jpg"
      }
    ],
    "user_id": "l_IXLemetaT9edO20vo0TA"
  },
  "NydB9hxfbXQfbHP6b1D9CA": {
    "date": "3/29/2014",
    "text": "Really, really good food, and if you order a specific kind of noodle, they'll send a guy to stretch it right before your eyes. The sauce \"buffet\" was also great. You can pick your own sauces and mix them if you want. It was a friend's birthday, and they also gave her a gift in addition to bringing out the cake.Service was amazing, really: You get cloth aprons, any purses/bags you have are also covered with a cloth, and if you wear glasses, they give you a small cleaning cloth for it. You also get a ziploc bag for your phone. My friend made a reservation a few weeks in advance, but if you don't have a reservation and are willing to wait, they have a host of things for you to do while waiting, from manicures to board games.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tBRb4_mItkItpb4hchJcjg"
  },
  "T5ygYdQ1ForENfZexvZV6Q": {
    "date": "8/16/2013",
    "text": "An outstanding place, even if you're not YET a customer. My friend was smart enough to have reserved a dinner two weeks in advance, or we would have had to wait hours to get a table. But even if you have to wait you can enjoy some delightful perks, including snacks and tea, board games, and even a MANICURE (for the ladies only, unfortunately)!!The food is also excellent. Tasty, fun, and presented very well. The Szechuan broth was certainly \"ma la\" (numb) but not spicy enough to prevent you from enjoying it. Just be cautious of the pool of oil when you remove your food from the pot. Next, I HIGHLY RECOMMEND ordering a set of noodles. A slab of dough will be tossed into strands of deliciousness right in front of your eyes. It's truly a sight to behold. I'd pay money just to see that happen again.One of the best parts of the experience is the DIY sauce station. With around a dozen base ingredients to choose from, you will surely be satisfied. The sauce station also houses the restaurant's amazing soybean pudding (dou hua). I alone had 5 servings of it. Just delicious and very well textured.Though I never received a ziplock bag for my camera and electronics, I did receive a cute apron and enjoyed wonderful service from the waiters. Even the notion of ordering your food on an iPad (with full descriptions of most items) was mind blowing. What was crazy was the sight of a crib with a baby sleeping in it. THAT was a first and quite incredible. Other restaurants need to learn from HDL.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Httk6gs4_1Hn_bxvfjux6w"
  },
  "mBHGUNqVANGQ9JPwEZfxQQ": {
    "date": "2/14/2014",
    "text": "The quality of both the food and service at Hai Di Lao hot pot exceed every other hot pot restaurant I have ever been to.  With that being said, it was also by far the most expensive hot pot experience I have ever had.  I went out to lunch with a friend and the most memorable part of the meal was probably the hand stretched noodles.  They were pulled in front of our table and tasted great.  I would definitely recommend this place, but be prepared to spend a pretty penny.  I spent about 1/2 as much at J-Pot in Vivo City for about the same amount of food albeit slightly lower quality food and service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8NyAypqBJG2JiSXBu7Vlug"
  },
  "6_3lupatMx8iJ2A0fMHDWQ": {
    "date": "2/21/2015",
    "text": "The girlfriend and I visited here on a Lunar New Year weekend, half expecting not to get a spot. We were pleasantly surprised when we were promptly ushered to a spot. We were most impressed by its attention to details: plastic covers to shield our electronics, aprons and a small quilt for clothes and handbags. The waitresses were very attentive and patient, attending to us at every turn. Food-wise, the basic chicken broth was tasty. The Ma La pot was a little too much for our palate. All in all, Hai Di Lao was a very pleasant, if slightly pricy, experience. It would be great if the iPads used to place orders could have an English version of the menu - to help tourists and those of us who are Mandarin-challenged!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o3W3AoFHe3Lg0aDjnJQhhA"
  },
  "1-fQFn-NHhAXvAL8A78auA": {
    "date": "4/3/2015",
    "text": "This was a great restaurant.  A little expensive but the food and service were exceptional.  The spice was a little extreme for us but they were happy to adjust it.  Would definitely try it again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kl0HRGBCE9aRt5P5KI3qaQ"
  },
  "uDtOWQ6h6MRLEB7_yG5_6Q": {
    "date": "3/8/2015",
    "text": "Nothing worthwhile to make you queue as its soup is as salty as seawater esp after i added in more plain water!I have to apologise that its freshness in food and impeccable service cannot save this expensive restaurant for getting such a rating from me, having too much salt is equivalent of consuming a beautifully decorated cake w poisonIts bill didnt come cheap (for two adults & a kid who are totally small eaters) - close to S$90!!!!!!!!!!!!!!My friend confirmed that she had a meal at the clark quay branch too, nothing fascinating tooPatronized  at 313...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_x5sqWYKrsfaDlrGlalAQ"
  },
  "f_bKSWaAQLps7J12k1e_Kg": {
    "date": "6/2/2014",
    "text": "Yummy tasty, pricey. Attentive service. Pricey but it's worth it because of it's service and quality! Really one of a kind! Must try! Avoid peak periods otherwise the queue is madness!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rWM9b0X9eKkAGdkBjpGGJQ"
  },
  "jk6RH1Wwraj7ap_saQBWPw": {
    "date": "11/22/2014",
    "text": "Best hotpot in town with good variety of soup and fresh food. Price is on the high side though.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  },
  "LXYVsKCxqwwxYhHcZtl_2w": {
    "date": "12/30/2014",
    "text": "Long long long long long wait and guess what?? It was not worth the wait. Just the same type of hot pot you can get anywhere in Singapore or just go at a time when there are not too many people. This was our one and only time waiting for a table in Singapore and we have learned our lesson. Make a reservation, which I don't think this place takes or just go somewhere else. Why do people torture themselves just for plain hot pot?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4LXF8rBJU__DAtiUVGDBg"
  },
  "uHF2BxUDg_97nx_zN6fwdg": {
    "date": "6/15/2018",
    "text": "This place was very good! It's unfortunate that it is not all you can eat, because this is a big selling point to me since many other hot pot places I go to are all you can eat. They had a variety of meats and veggies, but if you like to have a variety of dishes to try, like me, I think you will find this place a bit pricey. They had your typical meats, mushrooms, and green vegetables to offer but what stood out to me was the hand pulled noodles that you can order and someone will come out to make them for you right before your eyes! It's very entertaining and worth the cost in my opinion!This was honestly a normal hot pot place like any other one I've been too, but what stood out to me the most and the reason I am giving this 5 stars is because of the service. The service was go good and made my experience complete and positive! Our waitress was so friendly and would constantly check up on us to see if we needed anything. Our drinks would get refilled without question throughout the night at no additional cost. We each received an apron to not dirty our clothes and I received a hair tie to hold my hair back from the soup. We got plastic bags to put our phones in so they don't get dirty. Quick service, we got the food so fast! Make reservations to be seated quicker, but if you choose to wait they give you snacks and manicures. They even have a day care area so the kids can play!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jL0HD8WeoyyhlX8bLG8TLg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Hand pulled noodle dance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jL0HD8WeoyyhlX8bLG8TLg/o.jpg"
      },
      {
        "img_id": "t51pCgrCz4oXZ3lL7gLGjg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Hand pulled noodles dance",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t51pCgrCz4oXZ3lL7gLGjg/o.jpg"
      },
      {
        "img_id": "82rYoaB-miU_SMcVdxN1Mw",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Pork, beef, lamb",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/82rYoaB-miU_SMcVdxN1Mw/o.jpg"
      }
    ],
    "user_id": "3ECwX_mDFMZT-oWxrPAXDw"
  },
  "NSllqsOvAgRJKUSdGOdqeQ": {
    "date": "3/11/2017",
    "text": "This place is amazing. You get free snacks, ice cream and even your nails done while you are waiting for a table. The food here is a bit pricey but totally worth it. It tastes really good and the service is excellent. It is extremely family friendly and your kids even end up getting toys. Bathrooms are very clean and nice. The waitresses are very courteous and helpful. The tables have phone charges in them! They even have people perform every now and then to entertain the guests. Pro-tip: opt in for the liquid buffet and the sauce/dessert buffet. They are absolutely worth it. Adds about $8 p/p to your bill.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T0E9ptjlNkUqq4GKQwfe-Q",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Seasoning strain",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T0E9ptjlNkUqq4GKQwfe-Q/o.jpg"
      },
      {
        "img_id": "8jbesNfHFtx0KbF8edH0eA",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. More hot pot food",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8jbesNfHFtx0KbF8edH0eA/o.jpg"
      },
      {
        "img_id": "Gv6w4HmUUv46bvQI40H14g",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Pig brain",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gv6w4HmUUv46bvQI40H14g/o.jpg"
      }
    ],
    "user_id": "osrUXLTZbhmq8gUXEdHtCA"
  },
  "22mBhgXe6i8ZLoGO-9WadA": {
    "date": "12/19/2016",
    "text": "I've long accepted that good service in Singapore is an afterthought at best but Hai Di Lao Hot Pot has restored my faith that some businesses truly do put the customer first. It is pricier than the average hotpot but the service is truly just on point. They are supper attentive and the commitment to the smallest of details is truly remarkable. Anything from little plastic covers for your phone to remembering which tea you were drinking, my favorite example of the night was when they offered to tame the spice of our mala broth after they happened to walk by and heard an off the cuff comment from me about my numb lips. Great little side dishes while you wait plus a plethora of options to make your own dipping sauce. If in doubt, feel free to ask the staff to make the house sauce for you - it's really quite yummy. Definitely order the handmade mashed shrimp and the house/dancing noodles are quite entertaining. Yes a guy comes around to make fresh noodles as he dances and twirls the dough over your heads. Didn't really order the premium meats and didn't notice the difference. Everything was fresh. Also really like the wintermelon tea that was just the right amount of sweet. We had the latest reservation possible at 6pm and were seated promptly. The lines started to build after but there are drinks/snacks, games, and even manicures to pass the time. Pricy but I was blown away by the charming and attentive service.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvcAC_nlKaTDsHcA8Slagw"
  },
  "ZslwtEMLJ7NtsvVhdXhebQ": {
    "date": "1/12/2018",
    "text": "It was OK. Nothing really remarkable about the food. The sauce bar was nice, and the kids enjoyed the fruit from the buffet.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7JvQDeBNXp6B7vVTAnaNDw"
  },
  "veqEkSKgF76zI52CVNoZmw": {
    "date": "11/12/2017",
    "text": "After reading so many raving reviews, I was excited to give this place a try. My boyfriend and I went during non-peak hours (approximately 2130) so the wait was not terrible. We waited for approximately 20 minutes and spent our time trying to solve rubix cube and eating the snacks provided to us. The menu and ordering process were simple and straightforward. Once I tasted the food I was let down. The sauces were bland (we got chicken and tomato) and the prawns were slightly bitter. The reason why I give the review three stars is due to the service. The wait staff were attentive and the food was brought out quickly. All that said... I was disappointed by the underwhelming meal and the price was steep for such.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wzlHcKH3o9aJy8IoQc_Og"
  },
  "3_OoqmoQAVGOyd-oIhtXbw": {
    "date": "10/9/2016",
    "text": "The wait is LONG (1.5 hours) and we called ahead and she said they were not busy however the broths are excellent and the food is excellent. While waiting there is a ton of people and uncomfortable stools to sit on. They have snacks like popcorn, tomatoes and various other goodies. I signed up for a manicure but we were eating when they were ready for me so I skipped it. For the food. The pork and corn balls were excellent as were the dumplings. Everything else was very good but what I expect at hot pot. The sauce bar is nice and is $4/person. For two we spent 148$S, since we wanted to try many broths it was S$24 for those.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ur6V3nC5zj0GgthtMFt6_A",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ur6V3nC5zj0GgthtMFt6_A/o.jpg"
      },
      {
        "img_id": "PcoAlcNVSpN8TexJVILSig",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Broths",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PcoAlcNVSpN8TexJVILSig/o.jpg"
      },
      {
        "img_id": "4HnczklcLlQMRkbnLaBDxg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Sauce bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4HnczklcLlQMRkbnLaBDxg/o.jpg"
      }
    ],
    "user_id": "c5gYrrxy5qJTEXqwHl8uiw"
  },
  "M7y3l3cTrcgSCmZeUVrF8Q": {
    "date": "1/6/2016",
    "text": "Still quite on the fence about how I feel about Haidilao. The food was good - the Mala chili soup was spicy without it being too tongue numbing, and I would definitely recommend trying their handmade lamian. Their services are ; They definitely go all out to entertain their customers. While waiting for a table, they provide all sorts of entertainment; ladies you can even have a few gel manicure (their manicurists are skilled but not to the point of doing intrinsic designs). They also give you access to their \"snack\" bar - free flow of drinks and assorted fruit. Before you begin eating, people with long hair will be offered a hair tie.  When you order the handmade lamian, a guy will perform a sort of dance to pull the noodles. The thing that irked me most was the queue. Even with reservations, we waited for over an hour on a weekday night. When we saw a free table, we asked if we could sit there (we were a group of 5), the hostess said the table was meant for groups of 8-10. 5 minutes later, she gave the table to a group of 5...Anyway, on average, you can expect to wait for an hour to 3 hours during peak period. I guess that's why they go all out to entertain their guests? Still too ridiculously long for me to come back. Maybe next time I'll come back during lunch hour.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "Inb1kOFAjbGHjL35tjR3GQ": {
    "date": "7/28/2017",
    "text": "Hai Di Lao hotpot if my favorite hotpot restaurant ever because of the free snacks, the ambiance the servers and everything about Hai Di Lao is fantastic. The meat is great, the bathrooms are great, the noodles are fun to watch and all of the food is good there. My only problem with this place is that they don't take reservations and you have to wait around 1-4 hours to get a table which is CRAZY but it's totally worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MM_qWDFp007K4PWORoKbRA"
  },
  "3urhX-c6P3_RuYWIm04gNA": {
    "date": "2/7/2013",
    "text": "\"In the beginning, God created the heavens and the earth. He then created man, and then restaurants.Man began to whine about PATHETIC SERVICE at restaurants - ESPECIALLY CHINESE restaurants.So God gave man...Hai Di Lao...and caused man to STFU.\"Well, I'm sure anyone who complains at Hai Di Lao Hot Pot needs to see a Psychiatrist. My mind is completely blown by the extent of service perfection here...a CHINESE restaurant of all places...so PERFECT that even Western spots and their pompous Maître d' are easily put to shame by these...down-to-earth-so-friendly-I'd-think-they'd-spoon-feed-me-if-I'd-ask servers.SERVICE:Their attention to detail is...NUTS (fine, fine...it is UNCOMMON, RARE, DIFFERENT). Let me elaborate on SOME of them:- Everyone gets a CLOTH apron (not the crappy plastic ones you get at spots like boiling crab) to keep your clothes clean if you happen to be a messy eater OR are experimenting with chopsticks OR have a leaking mouth. She will even put it on FOR you if you agree to wear it. (Or you can be like my cousin and I who insisted to have it on our lap instead).- If you wear glasses, you are gifted a microfiber cloth to clean your glasses with...before and AFTER your meal or as OCD-often-as-you-wish.- If you have any items out on the table...such as phones, pocket cameras...they will provide Ziploc sandwich-size bags for you to put them in...to keep out the steam and oil.- Unless I'm chugging my tea, my glass usually gets to half-empty when a REFILL is provided.- Staff continuously checks in at perfect time intervals to ensure that all is well. Even offering tips on when each ingredient should go in for maximum flavor.- Soup base kept getting refilled without asking. (Hey, don't look at me...it doesn't matter what liquid it is...I am a freaking camel. Ask my cousins...I treated the hot pot like an oasis...)- Staff would sift out the oil/froth buildup from the soup on various intervals to keep the soup \"clean\" and \"healthier\".FOOD:My cousin had the half and half soup base: one side black chicken broth (is IMMACULATE before and after cooking), the other side, a tomato base (if you're a Cioppino-fan OR tomato-paste-lover like me...you will LOVE this base for a hotpot). I'm so thankful she didn't order burn-your-tongue-taste-nothing-ma-la-spicy base.Self-served seasoning bar - you create your own LOVE ELIXIR to go with whatever is cooking.I won't spend too much time talking about the food because at $55-60 average per person as well as a focus on service and perfection, the food did NOT fall short. I really enjoyed the quality of the meats and even dipped them for 2 seconds to eat them on the mid-raw side.I must admit that I can't get over the broth. I am in love with it and I have never found myself saying that before...where I enjoyed the soup base PRE-cooking and POST-cooking. It was GREAT - totally epically AWESOME.Oh yeah, we didn't order the pulled-noodle but saw from the other table that it involves a man doing the \"noodle dance\" that gets the dough to the right length and consistency before they cut it. Quite entertaining to see how it never touches him or the floor as he does his advanced rope-twirling-dance.ATMOSPHERE & OTHER PERKS:You know it's packed but it DOESN'T feel like it is. The table is spacious and distanced properly to give a somewhat suburban feel that doesn't make you feel like a sardine.You're taken care of from the moment you're in the establishment, especially if you didn't make a reservation. There is a waiting area for children to hang out in...watch TV and play various things.Above all things, they also give FREE MANICURES...w-t-h... /mind-blownYelp 100: 12/100",
    "rating": 5.0,
    "rated": {
      "useful": 28,
      "funny": 24,
      "cool": 16
    },
    "photos": [
      {
        "img_id": "VwzkL_UV_LZk5ana5LQg2Q",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. MORE beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VwzkL_UV_LZk5ana5LQg2Q/o.jpg"
      },
      {
        "img_id": "J8MTzXYYiSlpWa5xDt26Zg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Beef Meatballs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J8MTzXYYiSlpWa5xDt26Zg/o.jpg"
      },
      {
        "img_id": "xtcU_901k2NOHer8YIE1OA",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Dumplings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xtcU_901k2NOHer8YIE1OA/o.jpg"
      }
    ],
    "user_id": "4DN9WS2gf7Y2SYh0LaqDqA"
  },
  "Bu6MD4WxTKoTzbuvUNL3nw": {
    "date": "11/11/2014",
    "text": "Service is definitely a 5 star experience here. Food wise, I think it is so much better at Imperial Treasure. Due to time wasted waiting at the lobby, having their plum tea and pop corn, I believe it is worth deduction of 2 stars unless you don't mind waiting 2 hours for a steamboat.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoYVSk3hhn1NRYM2RbERGg"
  },
  "zAjR-tJOlw1xz_cbTrXqIw": {
    "date": "1/9/2016",
    "text": "Waited for 2 hours till my hunger pangs disappeared. The service here undoubtedly is impeccable, however I do think it's over hyped and priced.They recently introduced a takeaway option to 'host' it in the comfort of home but I find the prices laughable.A pretty negative review, they have an interesting soup base, tomato smth soup but the cuts of meat are not exactly worth the price of paying.Would rather visited the line of steamboat restaurants at Bugis.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LYOHCWaQ0zmcEowTAIQA5A"
  },
  "TvOz1Wd196DT9MaBNAAOvA": {
    "date": "11/27/2015",
    "text": "I tried out this place for the first time today and can't believe it took me this long to do so. If not for the long wait, I'll come here more often. (We actually didn't have to wait long because we had a reservation and got there pretty early, but if you're with good company, the wait might not be so bad given the free snacks, drinks, and manicure you can get while waiting.) This is my new go-to spot for hot pot, especially with a group.The service was amazing and the staff was very attentive to our table and kept the drinks flowing and broth refilled. I thought the food was of good quality and they also provide free fruits and desserts. I left the place stuffed which rarely happens to me here in Singapore. Oh, make sure you get to see the noodle dance!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "buhaawsNr-41s2rdT3dJ5Q"
  },
  "z9f9A3ey9UhCB3Xinkcs_A": {
    "date": "6/21/2014",
    "text": "Oh Gosh .... this is my most favourite hangout for steamboat.Well well, when i heard people rave about this hotpot located at the heart of Clark Quay area. I was like ... hmmm issit really that good?? I went down to this venue for my birthday celebration and i was WOW by the number of people queuing and waiting to be seated. This place is always crowded with people and while waiting for your seat you will be served drinks, fruits or nuts with no cost at all.Ladies ..... PLS NOTE you can try to have your manicure done while waiting and its totally free of charge. sounds good ya.This place serve a wide variety range of food and its really really very fresh. Th service crew is very attentive and they provide you aprons to wear to avoid any spills .....  A ziplock bag for your handphone and lastly if your handphone is low batt they provide charger too. You get to place your order via the ipad and the serving is fast tooI love the sauce selection and dipping my food in the sauce i mix simply make it taste wonderful. Its a good place for friends gathering and the price is slightly on the high side but its worth the money and experience.This place is simply deserve 5 stars but do note the waiting queue could be quite long.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iDAXpIIBaSNaygWhFxBv7A",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iDAXpIIBaSNaygWhFxBv7A/o.jpg"
      },
      {
        "img_id": "-hkOU7R2l0A-ktn1CMJQsg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-hkOU7R2l0A-ktn1CMJQsg/o.jpg"
      },
      {
        "img_id": "GUvwuCaIYOt6uTnP7gH4TQ",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GUvwuCaIYOt6uTnP7gH4TQ/o.jpg"
      }
    ],
    "user_id": "UwWtpjalT2xlJyglRRITug"
  },
  "kozKautouTtT2EqG6vH43g": {
    "date": "8/13/2014",
    "text": "The version of hotpot (or steamboat as it is called in Singapore) is different from our local hotpot.This is their second outlet after their crazily successful first outlet at Clarke Quay. That is not to say that the wait is any shorter here. Even if you call ahead to make reservation, it is most likely that you'd still have to wait. The plus point is that the service is great (especially given that they are all from China where service is questionable), they also have lots of other entertainment while you wait. In this outlet, you get pedi/mani, the kids get a ball room to jump in, and you also get free flow of popcorns, drinks, snacks and fruits.On to the main course - the hotpot. I still prefer the steamboat at imperial treasure over this. The offering is pretty much similar and the price point is actually lower than at Imperial Treasure. But imperial treasure is a Hong Kong style steamboat while HDL is a china style steamboat. The tastes do come across as such too. It is not about one is better than the other, it is more which one you prefer.HDL - cheaper but the taste is not as refined as imperial treasure. Great service staff though.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "87AO5gq2fIGdSu_-2vz_jg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Cuttlefish paste",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/87AO5gq2fIGdSu_-2vz_jg/o.jpg"
      },
      {
        "img_id": "jeg-6ZKtaIJUIQ9di5m9HA",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Beancurd skin",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jeg-6ZKtaIJUIQ9di5m9HA/o.jpg"
      },
      {
        "img_id": "dc-Sz6CIZYfT0SG7-vumKA",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Black pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dc-Sz6CIZYfT0SG7-vumKA/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "l1WbexdDXDR2q7iv6GNH9Q": {
    "date": "7/10/2017",
    "text": "Excellent, friendly service. We had a reservation and were seated promptly so we missed the nail salon and other attractions to amuse patrons waiting for a table. The food was great - wide choice of soup bases and large choice of meats, sea food and veggies. Order the la mien and enjoy the noodle dance. Very entertaining evening with great food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iswp6yIXA1JdsyAzkxOruw"
  },
  "xS7fYFssD8uHbag8lHEHNQ": {
    "date": "12/24/2013",
    "text": "I've heard so much about Hai Di Lao so I definitely had to give this a try.I tried making a reservation for dinner but it was fully booked. Thankfully, I happen to be part of the vacation-ing class of Singaporeans who have nothing better to do on a Monday at lunchtime than to indulge in some authentic ma la hot pot. There was barely any crowd at lunch and we managed to get a table without any wait. The pork belly slices were very good. They were so good that they managed to con us to order a second serving, in which the quality of the meat noticeably dropped :(The sliced pork was ok, but I'd recommend going for the pork belly instead.The US beef slices were yummy too. My only qualm with the meat slices were that they were cut slightly too thick. I'd have preferred it better if they were just a tad thinner.The $4/ pax cost for sauces seemed a little overpriced at first, but we soon realised that it included the appetizer peanuts and post meal fruits/ desserts, making the price seem justifiable. We didnt know that the drinks were free flow at $3/pax. We stuck to ordering water/ tea, but being kiasu Singaporeans, would probably have expanded our selection if we knew it wasnt going to cost more.The handmade prawn paste was interesting, as the paste curled up to look like shrimps after they were cooked. For $3 per serving, you can watch a live demonstration of the chef pulling the la mian noodle. And here I say that you're paying $3 to watch a show, since I definitely wouldnt pay that money for the very average noodles.The Mushroom medley was delightful for mushroom lovers. The ma la pot is pretty thumb numbing-ly spicy. You've been warned!The bill came up to be about $50/pax which was kinda expected (given all the $$$ ratings), but still a tad pricey considering that we didnt order much food.Still, I'd say that it is one of the better hot pot joints around!PS. Sharing a friend's recipe for the sauce station: Hoisin sauce, korean chilli, garlic, dash of sesame oil. Pretty good combination I must say!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "ILRKd8JRB7k7WS09ecjpDA": {
    "date": "3/14/2014",
    "text": "I would safely say that this is the BEST hot pot restraint to come out of China.This venue is the first franchise of this mega china hotpot restaurant in Singapore.On a weekday during dinner time, expect to wait 2hours to get a seat as they do not take reservations during dinner time.The mala (spicy Sichuan pepper) soup is excellent and they do not compromise on the amount of ingredients to prepare the peppery soup base. Their chicken soup base is made from black chickens, and the rich strong taste of the chicken stock can me tasted even without adding in any ingredients.The meats are extremely fresh and we'll cut. All I can say is, this is a must try for anyone in the Clarke quay area.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "f2i8GnLRX3eT39FE_ZADoA",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Great service including a plastic bag for your cellphone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f2i8GnLRX3eT39FE_ZADoA/o.jpg"
      },
      {
        "img_id": "-7uRY19-5E82OcAKw1PrMw",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Nice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-7uRY19-5E82OcAKw1PrMw/o.jpg"
      },
      {
        "img_id": "hGeCBsIn2nnzNXTyjQZaLg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Short ribs (beef)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hGeCBsIn2nnzNXTyjQZaLg/o.jpg"
      }
    ],
    "user_id": "mMjxhRn4h0LD1_jI3RT4cQ"
  },
  "JfjJKcW5bHAEd8rBhI5Gaw": {
    "date": "5/14/2015",
    "text": "Awesome introduction to how hot pot or \"steam boat\" is done in Asia. My previous experience have been in restaurants in the U.S. and it really can't compare. From the delicious \"make your own\" condiment / sauce stations to the super good meet and broth itself, the experience is nothing short of sensory overload. Warning though, the spicy broth is really spicy. I was lucky enough to have gone with local Singaporeans so ordering was taken cared of by them. Service was great, food fantastic complete with a dude who randomly comes up and starts dancing while twirling noodles....dude was like a rhythmic gymnast.Other than that, expect long waits unless you made a reservation...ladies don't worry, this location has an in house nail salon...(that's not a typo) to help you pass the time!We had a party of 8 and we ordered a good amount of food and beer, all in the bill was roughly S$340....well worth it!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dyv8Fu8-h8aej0B-tU2Uyg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Nail salon in the waiting area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dyv8Fu8-h8aej0B-tU2Uyg/o.jpg"
      },
      {
        "img_id": "RNVfvhblokTy8nxd2xIynw",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore. Waiting area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RNVfvhblokTy8nxd2xIynw/o.jpg"
      },
      {
        "img_id": "iX_syVEFbt4rIXA4LfqQgg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iX_syVEFbt4rIXA4LfqQgg/o.jpg"
      }
    ],
    "user_id": "N4wjCavQSPNwgAGs6kGZjg"
  },
  "-XZ_lkgnzqIXwf4iziIfbQ": {
    "date": "8/11/2015",
    "text": "Tomato soup is out of expectation, thought it would be weird but surprisingly it taste pretty good. Chicken soup tastes bland at first but after a few cooking, the soup gets better :)Service is superb too, apron and a ziplock bag for the phone is provided too  :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hpaRz2s7-k5ir4v7p0NFzQ"
  },
  "1TQGVEjQ80yTVdR1ce40UQ": {
    "date": "4/25/2015",
    "text": "Very good steamboat restaurant in heart of Clark Quay.  Great selection and it was very spicy which we liked. Staff did not speak english(at least the ones who served us) but it worked out as we had a Chinese speaking person with us... Order the noodles and watch the noodle dance..fascinating! Very long wait but we made reservation and then went across the way for a drink and waited and they then called us when ready so not too bad. But they had kids play area and even a place for manicure while you wait.. great service and food was very good. Will go again,",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D0mr2zDXVOKrotnb3XYOKA",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D0mr2zDXVOKrotnb3XYOKA/o.jpg"
      },
      {
        "img_id": "l6Ca4wfzW0FvSkeiE1Ajyg",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l6Ca4wfzW0FvSkeiE1Ajyg/o.jpg"
      },
      {
        "img_id": "xfMHq708yIjWQ9lumUnVoQ",
        "caption": "Photo of Hai Di Lao Hot Pot - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xfMHq708yIjWQ9lumUnVoQ/o.jpg"
      }
    ],
    "user_id": "hegJMCcRzC-uLtK2oJ77cA"
  }
}