{
  "Ng9e7qxbYe16PT2NV-mdFQ": {
    "date": "8/3/2016",
    "text": "A lot of business meetings happen here during lunch time. We got here at 11:30 to beat the crowd. This place fills up by 12:00p. Great for people watching and having conversation as there is adequate space between the tables and the surrounding area isn't too loud. We ordered the brussel sprouts and the Bufalo Margherita pizza to share between two people and it was enough food for us. The brussel sprouts were surprisingly good! A little sweet, sour, and salty all at once. A little twist on the typical bacon-brussel sprout combo you usually get at high end steak restaurants. The brussel sprouts here don't taste as bitter or have as much of brussel sprout taste as what you would get in California. The plate was a bit oily, but expected. I really liked the pizza crust. I'm a huge fan of bread and get pretty picky with crust. The crust was nice and crispy on the outside, yet soft on the inside. A little thin in the center, but I still really enjoyed the pizza. The tomato sauce wasn't sweet, which I liked. The cheese was nicely melted. I mostly enjoyed eating the crust and I usually avoid crust on pizza. Total bill was almost $45, which isn't too bad for the quality and location. Would definitely come back to try out some of the other pizzas!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UUKSRRJj65ZZfAHOWlooeQ",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore. Bufalo Margherita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UUKSRRJj65ZZfAHOWlooeQ/o.jpg"
      },
      {
        "img_id": "sGJnozbpkPUUmX-0ypae7w",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore. Brussel sprouts!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sGJnozbpkPUUmX-0ypae7w/o.jpg"
      }
    ],
    "user_id": "rRablbcafGXK7zwW1qSYsg"
  },
  "D3PXWqPv-lLQ5mBiT27wyQ": {
    "date": "12/17/2015",
    "text": "Decent pizza, but no 'wow' factor for me. Having lived in Asia for a few years, I know that pizza is not one of its strengths which is what might give this place a above average rating.I ordered the spicy pepperoni. I couldn't taste any spice (asked for extra chili flakes) just extra saltiness. The pizza arrived looking promising, but the crust was pretty chewy and after a few slices both of us noted how much work is was to chew it down.We also started with a chicken casaer salad. Lettuce, a few croutons, shaved cheese and dressing. The chicken was something pulled out of the refrigerator and dropped on top. Disappointing. Best part about the salad were the croutons.We were lucky it was an usually cool evening for Singapore since there was no indoor seating. The outdoor seats provide for great people watching, but on any normal evening it would be too warm to sit there, especially while eating pizza.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zNuGlm9gYMGB4B7OIrFddQ",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore. Spicy pepperoni pizza - just ok, too salty and chewy crust)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zNuGlm9gYMGB4B7OIrFddQ/o.jpg"
      }
    ],
    "user_id": "qJGVQ8uvm7KEdIsHpYAjmQ"
  },
  "98MeuQt10-atngVhXYE8mw": {
    "date": "12/31/2014",
    "text": "Dragged the whole family to have pizza, in honour of my hubby's BDay. The StarterCaesar Salad - really good sauce over fresh Vege and nicely grilled chickenThe PizzasPistachio Pesto - interesting pesto taste, not bad tasting but not likely to order again tho  Spotted Pig - nice flavour and kids loved itSeafood - seafood is fresh and taste okPepperoni - I was slightly disappointed as the taste is not bad but I expected more from gourmet pizzas mahThe PastaMeatball - this was for my pasta fan in the form of my girl. I tried the sauce and it's tasty. My girl obviously loves it too as there was none for me. The ServiceWonderful service. It could be because we were there quite early and one of the staff even folded a tissue rose for my girl! Winner!!The Ambience - on the night we went, it was very balmy and the kids had a kick sitting on the high chairs!!Not exactly a place I'll return as the price for the food is not really worth it. It's more of a chic place to hang out with decent pizzas.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c3j-MQQlUiZyWTznzeC9UQ",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore. Spotted Pig Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c3j-MQQlUiZyWTznzeC9UQ/o.jpg"
      },
      {
        "img_id": "s4rk5QK-qS3GqP7fVwXH3Q",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore. Pistachio Pesto Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s4rk5QK-qS3GqP7fVwXH3Q/o.jpg"
      },
      {
        "img_id": "NlOeors_ZW0FL2VKO86YqQ",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore. Kids Meal - Pepperoni Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NlOeors_ZW0FL2VKO86YqQ/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "xH0rIO2RdomFq9rWArsW7Q": {
    "date": "9/3/2013",
    "text": "I'm not saying that this is the best pizza in the world. Pizza is just one of the many international food options that Singapore doesn't exactly excel at (unfortunately). But it is quite likely the best pizza on this little island. The ingredients taste reasonably fresh, the crust is just right in terms of crispiness and chewiness, and the toppings are fairly interesting but effective combinations. I like the al fresco seating (some may hate this as it's the only option but I'm totally down with the heat over here) and the buckets of Peroni certainly come in handy as does the Kirin on tap.Also, I've been here several times (it's downstairs from my office) and can only describe the service as hit & miss. But the largely Filipino staff serve more hits than misses in my experience, they are normally very nice and, if anything, a tad over-eager. Not sure where all the service-related complaints from my fellow diners are coming from but, by Singapore standards, this really isn't so bad.Best pizzas are the spotted pig, the pistachio and the spicy pepperoni, in my humble opinion. And if you have a health-conscious fellow diner, the cauliflower romesco is surprisingly decent. And this comes form someone who loathes cauliflower.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "41MtZiv6L0dB4S9NdnO6_g"
  },
  "NspDpY3zA7YdceN3wxg7Xw": {
    "date": "6/30/2015",
    "text": "Being a New Yorker, pizza is a major food group for me and this place did not disappoint. We had the margherita and spotted pig, both were delicious. The crust was that perfect chewiness and toppings were also, pretty good.  I'm still daydreaming about that NY slice but I'm really happy to have this option in Singapore and I will definitely be back. PS..outdoor seating only and happy hour everyday.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XPFP9OVQFKqFg2E0YYK_FQ"
  },
  "Ji9fsZ2JONrBE_2x_AZylA": {
    "date": "4/24/2015",
    "text": "Really, really good pizza - the best I have had in Singapore and this New York pizza snob was impressed. We ordered take away (they had a 3 for $50 special) and got the Spotted Pig, the Spicy Pepperoni and a Four Cheese. Also got an order of the Oven-roasted Brussels Sprouts. What a meal! The dough was like home and the sauce, cheese and  toppings were really tasty. Absolutely worth a visit. I would even eat the crust if I found it in the cushions of the couch the next morning :).  Anxious to try it in the restaurant. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KF37noDbi_1vl14AY5HjgA"
  },
  "vksn-XSN2RjMJ4QGAM_Ghw": {
    "date": "8/26/2012",
    "text": "There's been a lot of things said about the service here, and I have to agree that it is pretty astounding that they're still in business. However, the delicious pizzas they keep churning out makes it okay (for me at least), to turn a blind eye to the sub-par and not-too warm service. After all, I'm here for the food. And if you don't like to dine here, there's always the takeaway option (within the CBD area unfortunately). Dining here can be a sweaty affair as there are no indoor seats, so come at night if you want to avoid the heat. I find it okay as there are lotsa places you can smoke in secret. As the Pizzas are made to order only, waiting times can be a little long when they're packed, so expect some downtime after ordering. The variety on offer is really great and you can taste the freshness of the ingredients. The crust is just right and not too skinny or flaky. Price wise, it's really affordable for the quality of the pizza you get. So yes, I'd come back for more or just order takeaway.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kRC0Q6eG5RXr5ba7wpwolQ",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kRC0Q6eG5RXr5ba7wpwolQ/o.jpg"
      },
      {
        "img_id": "nVaYwWA42tqsTsyjAHnUwQ",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nVaYwWA42tqsTsyjAHnUwQ/o.jpg"
      },
      {
        "img_id": "7hoC1JZtoN3x0iIS_1bTyA",
        "caption": "Photo of Extra Virgin Pizza - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7hoC1JZtoN3x0iIS_1bTyA/o.jpg"
      }
    ],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "EbGc9SKdzbnQvn8NY_uTLQ": {
    "date": "11/14/2012",
    "text": "I'm so glad that this place is somewhat hidden from popular restaurant spots, because it's definitely a favorite of mine.FoodComing from New York I've been searching for my pizza fix in Singapore and I've found it! Extra Virgin pizzas are just what I look for: thin crust, tasty sauce, and quality toppings. I love it!  I'm also addicted to their caesar salad, fresh orange juice, and piccolo latte (a must-try).ServiceI've only been here a few times and the wait staff remembered me and my order!  The food also is extremely fast.  I've been in and out here in 40 minutes flat.  Considering most pizza places take at least 30 to get a pie out, I was impressed.DecorIt's all outdoor, which I can see may be a bit of a problem for some people.  I say just go at night and avoid the drinking/smoking afterwork crowd.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "8uZZj6sUMpeubbQkL7r8Cw"
  },
  "DVwHysDZmLfcQWtCr5M7XA": {
    "date": "9/28/2013",
    "text": "Ya know, this place could be a 5-star if it tried... the pizza is pretty good, not NY good, but pretty damn good for Singapore with a thin (but not too thin) wood fired base, a variety of toppings and not ridiculous pricing... however the service stinks! Went on Friday lunchtime, joined the queues (rookie error going at 12.30 on a Friday) and was seated after about 15 minutes (so not too bad). However getting menus was something we had to ask for, and after placing our order, it took over 15 minutes for 2 glasses of house white wine to arrive - and this after asking 4 different staff members (including the manager) if we could be served! I don't understand how hard it is to pour 2 glasses of wine? Especially by this stage the place was not jam packed full either... Staff looked stressed and unprepared (once again, not sure why, it wasn't overly busy at this stage) and once our glasses were empty, there was no offer to get us another? I really don't understand this, such a simple easy upsell opportunity and one that many mid-tier restaurants seem to miss... I noted that 4 other diners also had some sort of follow up or complaint they had to do with staff members so I don't believe I'm a solo case. The pizza itself was good (we had the meat one) and we also had a caprese salad which was decent, with both the mozarella and the tomatoes packing some flavour. Frustratingly, I would eat there again as the finished product is good, but however I know now to order my drink before I'm even seated!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MTQAGVEdfXjvFRPwsqvnlQ"
  },
  "f2ytHd-9oVu9BHPx-Ipn0A": {
    "date": "3/28/2014",
    "text": "Popped in for the happy hour (2 for 1 Kirin pints) and stayed for TWO pizzas because they were so yummy. Service was great and atmosphere was fun. Will definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_H58ckUcI9s627T73iU_NA"
  },
  "FvbLLWDHW7l8KH90BJQYIQ": {
    "date": "2/3/2013",
    "text": "For a full review, please visit: urbanjourney.com/food-an…When judging a pizza you have to start with the basics: Pizza Margherita ($16).  This pizza passed our test with flying colors, so, since then we have also tried our luck with several other versions that we would highly recommend, including the Mushroom Bianco ($22), Spicy Pepperoni ($24), and Meatball ($24).  If you're in the mood for something other than pizza, the veal and ricotta meatballs are also great.Picture this: the cheese is hot enough where it's not running off the slice but has the perfect texture, so when you bite it, it follows and does not create a mess.  The tomato sauce is not only that perfect blend of salty and sweet, but there's enough to make for proportionate tasting between the 3 key ingredients.  Plus, the dough cooks beautifully and at the right temperature in their woodstone ovens, making the perfect base and backbone of the pie. In our mind, a city can't be \"cosmopolitan\" or \"cool\" if it can't get a pizza right.  But with the addition of Extra Virgin, that's one more stamp of approval for Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hQMvYUsi_eVZ43JtcaMNxA"
  }
}