{
  "PMNxUhXigdxkiX4-8xt0uw": {
    "date": "1/4/2016",
    "text": "It's a shame not more people are coming here. The food is, of course, fantastic but as a cocktail enthusiast it's the great drinks menu that I'm more drawn too. I make it a point to visit this great establishment at least once every time I visit Singapore. P.S. Whether you love gin or not, definitely give their Juniper Sling a go; I can certainly see it having a broad appeal. I liked it so much I actually even bought the perfume it is based on (which turned out great too)!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-r5llnp8crmXfDrR4LgHYQ"
  },
  "e-4U9yjO-_mS7s6LKr0-HA": {
    "date": "7/25/2018",
    "text": "Tipping Club has made the Worlds 50 Best restaurants list in Asia for the past few years. After reading a few reviews, I decided to come for lunch on a business trip to Singapore.  My rating is based on the following: 1) Food: 5 stars (taste, creativity and presentation are all on point)2) Atmosphere: 5 stars (chic setting, really enjoyed sitting at the counter)3) Service: 4.5 stars (each dish explained and question answered)4) Value: 5 stars (lunch set is well worth the money)I really enjoyed my experience here and was happy with the food, service and dining experience. Really good value for the price. I sat at the counter and was able to watch the chef prepare and explain each dish. The highlight of the meal was the ocean trout with beat root. It was simply delicious and had such a rich and beautiful color. One of those dishes that looks too good to eat.  Wagyu short rib was also nice and cooked so the meat was fall off the bone tender. Really happy I came and would love to go back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "d624V-ophR1B9Wcg-rdDuw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d624V-ophR1B9Wcg-rdDuw/o.jpg"
      },
      {
        "img_id": "GX8EiAUvH_UIZk6bi3DIIA",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GX8EiAUvH_UIZk6bi3DIIA/o.jpg"
      },
      {
        "img_id": "FXm8JrPfo5NvOXooJK-Bsw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FXm8JrPfo5NvOXooJK-Bsw/o.jpg"
      }
    ],
    "user_id": "i-PdP5aXeLGG-Bmg1Wd0KQ"
  },
  "5ntuSUAlwuKmyZssXaP6iA": {
    "date": "11/19/2018",
    "text": "The small snacks for Bar were disaster.How do they mean \"Asian Fusion\"?? All the food is too fusion and mixed with too much tastes, they were terrible. The chef should try the flavor.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e20-5DSmG2xUC3TEN6dVhg"
  },
  "iyHkWx5PqMwuue-qO0qLOA": {
    "date": "4/6/2018",
    "text": "I stopped in for a quick bite and drinks with friends and had an experience I had never had before. I was given a bag of gummy bears that corresponded to a color coordinated drink menu. Each bear tasted like its corresponding drink and you chose the drink based off of the gummy. It was a unique experience and a first for me. If you are into experiences, especially in foreign countries this is a must do. It's just fun! I met the head chef as well as the sous chef and talked a little before heading out. It's a great spot to pregame and there is great people watching. If you are ever in Singapore I'd recommend going to this spot!Not so humbly submitted,Michael C.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wE14gj0Y9UoUE00vdrm3kQ",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. The gummies are the flavor of the drink you order so you eat them to decide!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wE14gj0Y9UoUE00vdrm3kQ/o.jpg"
      }
    ],
    "user_id": "0EmCJBn_Gud5iaHVJf2L_Q"
  },
  "5d0DAR6oB1Ppuz4_gsqC7w": {
    "date": "10/16/2018",
    "text": "This is a world-class restaurant. Sat at the bar with a good view of the kitchen. Felt like front row seats and even had a chance to chat with Chef Ryan Clift. The experience of dining here is like dining at one of Heston Blumenthal's restaurants. Don't be fooled by the aesthetics, the taste is equally exceptional. Would love to come here again. It was a fabulous birthday treat! Dined in 2014.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WppiEekhD4x8-jKPqftoew",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WppiEekhD4x8-jKPqftoew/o.jpg"
      },
      {
        "img_id": "Jre9w_tqqdsbhuFBDm68Vw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jre9w_tqqdsbhuFBDm68Vw/o.jpg"
      },
      {
        "img_id": "gyAEQEw9Uzugh6TSnK6GzA",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gyAEQEw9Uzugh6TSnK6GzA/o.jpg"
      }
    ],
    "user_id": "wg5Ol5nXT1E5Z1CQH6oA9g"
  },
  "5ufPVgF2jd3E7CyDeKNvRQ": {
    "date": "7/15/2017",
    "text": "Grab some seats at the bar and watch the kitchen theatre from which your dinner will emerge.  The five course degustation was spectacular.  A lot can go wrong with an ambitious menu comprising of multiple courses, however the selection of complementary flavours and perfectly prepared mains was almost faultless.  The sweet chilli and crab and the scallop dish were standouts for me, wonderfully absent of a fishy taste.  The interesting pre-courses, for example crispy chorizo, were well paired and delicious too. If cocktails are your passion, you won't be disappointed.  A scented cocktail menu, unique perhaps if not a little gimmicky, will guide you through the wonderful selection.  FYI Matt Bax opened the Tippling Club and subsequently opened the highly regarded Bar Americano cocktail bar Melbourne.  Neither offerings will disappoint.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bjZFAqiYjhndOw0lQjPx2A",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bjZFAqiYjhndOw0lQjPx2A/o.jpg"
      }
    ],
    "user_id": "-0D44Oa5eolEFmaIM4MbWA"
  },
  "zkJTPmmnfajdaOAlKYWTCg": {
    "date": "3/5/2018",
    "text": "This was the best bar experience I have ever had. By now, you are probably familiar with the gummy bear gimmick... where you receive a small bag of gummy bears (free), and each bear in the bag corresponds to a cocktail on the menu. You sample the bears, which surprisingly taste EXACTLY like the cocktail, and therefore get to sample each drink before you buy. I call it a gimmick, because that is what it is, but I could not adore this concept anymore than I do. It's adorable, it's useful, the bears are SPOT ON in flavor, and it's a snack.. Nothing could appeal more to me. I ordered the \"Indulgence\" and loved it. The drink included a chocolate covered marshmallow. I wish I could have sampled more drinks, but we attempting to hit all 6 of the Singapore bars that are on CNN's Best Bars in the World list and there are only so many $20 drinks that one can consume in a day :) Highly recommend stop and easy walking distance over to Operation Dagger and Native (See list below). We also hit up the bar as soon as they opened at noon, so we had the bar and bartender to ourselves.World's 50 Best Bars:7. Manhattan, Singapore15. Atlas, Singapore24. Operation Dagger, Singapore25. 28 Hongkong Street, Singapore31. Tippling Club, Singapore47. Native, Singapore",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m8_xtE57jGBgoy7MWhOLnA",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Each gummy tastes like the respective cocktail. Taste the gummies and sample the cocktail before ordering.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m8_xtE57jGBgoy7MWhOLnA/o.jpg"
      }
    ],
    "user_id": "nx2-yabqR68iAPjfWqN2uA"
  },
  "VymZdjRdlafklHYBJ2bapw": {
    "date": "7/29/2017",
    "text": "My husband and I had an amazing meal here. The cocktails are whimsical just like their menu. I loved every bite of the food but I have to give it to the pastry chef, wow!! I cannot wait to come back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6NHwe9Y7fAo9P8IwDK65BQ",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6NHwe9Y7fAo9P8IwDK65BQ/o.jpg"
      },
      {
        "img_id": "S91_SHdfbYmkAy5oMWjTfQ",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S91_SHdfbYmkAy5oMWjTfQ/o.jpg"
      },
      {
        "img_id": "lNQlR9PtC3p8Klvqw6JMGQ",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lNQlR9PtC3p8Klvqw6JMGQ/o.jpg"
      }
    ],
    "user_id": "OAUNg2UddZZowNFk3NbgIA"
  },
  "QRmGdCQSzFDVK01OTJs0xA": {
    "date": "7/6/2016",
    "text": "The Tippling Club is well known for its drinks made by its in house bartenders. Besides drinks, it is also a restaurant and offers 2 course and 3 course lunch set during weekdays. The place is decorated in modern and stylish way with open kitchen.I was showed to a counter who offered a great view of the chefs making desserts. While it was noisy with the noise from the kitchen, it was funny watching the staffs at work. And I got most of the dishes served straight from the chefs, who also explained about the dishes themselves. Between the 2 course and 3 course lunch, I decided to go with the 3 course which cost $60++. I started the meal with an aperitif cocktail.Tanaka Collins ($20++)yuzu vodka, citrus, gomme, sodaThe drink was like a lemonade soda. I felt that the vodka part was barely there.The lunch began with a a trio of amuse-bouches.The first amuse-bouche was curry leave tempura with a coconut curry mousse, served in a rock. The tempura was light and crispy, while the curry flavour was barely there. It was really unexpected.The next amuse-bouche was charred grilled red pepper in squid ink tempura, served on a stone plate with tweezers.The tempura was light and crispy. It was served with a soy wasabi dip which tasted stronger in miso than wasabi.The last amuse-bouche served was basil sauce with tomato flavoured olive oil. It looked like a lava lamp. The basil and tomato were distinct. Although it looked like oil, the taste was not that oily.Starter : Artichoke Soupquail egg, air baguette, avruga caviarThe soup smelt great from far. It was rich and creamy. But the surprise of the dish was the air baguette which turned to be a crispy pillow puff. It was encased with a smoky savoury mousse which filled with seafood flavours.Main : Braised Pigs Earchicken & truffle mousse, morels, pomme mousseline, perigourdine jusThe pig ear was crunchy and soft, with a savoury stuffing, sitting on top of a savoury mash potato mousse. The morels (a type of mushrooms) were well braised and juicy. The spinach which served with it was disappointing as it was too salty and overcooked with parts tasting quite bitter.Dessert : Snickers Bar Souffle peanut butter mini magnumThe souffle was light and airy, with a bit of nutty texture at the bottom. The magnum had bits of peanut butter in it.Lastly there was petiti four to end the meal with. There was crunchy almonds slices topped with almond mousse and compressed blueberries, matcha chocolate with yuzu drop, and hazelnut praline chocolate. I was very full but these were so yummy.Overall the food was unique in its own way, offering an unique experience in taste and presentation. Service was great, with water refilled often. Do not leave without paying a visit to its restroom. There was Penhaligon's (very expensive brand) hand lotion and liquid hand wash available.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "myLRup5jQqohNATk8ZDJrg",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/myLRup5jQqohNATk8ZDJrg/o.jpg"
      },
      {
        "img_id": "4lUBBg1fvJiEI7n273OIAw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4lUBBg1fvJiEI7n273OIAw/o.jpg"
      },
      {
        "img_id": "EaYFMUZ9z7auL1tiTBLD_Q",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EaYFMUZ9z7auL1tiTBLD_Q/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "4MlTV86gDmJ7hF0qQLtvPg": {
    "date": "10/15/2016",
    "text": "If you like molecular gastronomy, or are down for an unusual dining experience, you won't be disappointed!Based on other Yelp reviews, we requested to sit at the counter to watch the action of the kitchen.  We also chatted with the chef a bit too, who was friendly and passionate, just as you'd expect.We did the smaller menu which was still more food than I could eat.  5 official courses, but with all the extras its much more. As a vegetarian, I was very happy - I didn't feel like I was missing out.  And my boy loved every dish on the non-veg menu, so everybody wins!Make sure to have at least one cocktail.  They really are exceptional, and the drinks menu alone is a delight! (I won't say more - so much of the experience is about being surprised)Service was very good, though my one complaint is that they opened a second bottle of water for us without asking if we wanted it, and our glasses were still half-full. At SG$8, they should confirm if its something we want to purchase.  Expect dinner to take several hours, and use it as an excuse to get a little dressed up!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "95zvCAvSkcLB7mdxPHLr5Q",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Beets with whipped burrata",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/95zvCAvSkcLB7mdxPHLr5Q/o.jpg"
      },
      {
        "img_id": "FnecNpgZb35WxXPT9vwDSg",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. \"Air baguette\" filled with cheese foam and topped with hazelnut caviar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FnecNpgZb35WxXPT9vwDSg/o.jpg"
      },
      {
        "img_id": "luef9BOknEaZz_rHrWmMtw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Potato & leek soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/luef9BOknEaZz_rHrWmMtw/o.jpg"
      }
    ],
    "user_id": "3UfaNU33lD86wnyAIwyhzA"
  },
  "Pi2qxDrIVAkGtLT9uSWL4w": {
    "date": "1/12/2016",
    "text": "What an incredible experience!  We started out with a smoke infused cocktail, yes smoke infused, and then had a 10 course dinner and wine pairing that was most certainly the best meal of my life!I'd suggest the classic menu if you're not ready for a gastronomic time and space commitment but if you have the time and appetite the gourmand menu is the way to go.Expert mixologists, great ambiance and 6 star service.  This is a must experience when in Singapore!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Hhu3fVQyA6JCTanWj3cfsA",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hhu3fVQyA6JCTanWj3cfsA/o.jpg"
      },
      {
        "img_id": "BBsvuUfyqzanm-buXiGJ1w",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BBsvuUfyqzanm-buXiGJ1w/o.jpg"
      },
      {
        "img_id": "qgkE16e0p0ugGe-eDIkrIw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qgkE16e0p0ugGe-eDIkrIw/o.jpg"
      }
    ],
    "user_id": "A5TpQoVp9sWLrAByD5C4Mg"
  },
  "vKJ_DNbwl7BtqAgynHo8rg": {
    "date": "7/18/2017",
    "text": "Perhaps it's a matter of consistency as I've only been to TPC once but how this place didn't land a star for the 2nd year is beyond me. The complexity of flavours with their dishes (not to mention art like presentation), attentive and knowledgable staff, and just overall ambience makes this restaurant a must visit for anyone willing to shell out a few extra for the special occasion.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vIjSA6rHk0UoXKJycGyXtQ"
  },
  "8EIKL_Qa1uHuqXMarB55FQ": {
    "date": "10/7/2015",
    "text": "Easily one of the most creative and surprisingly delicious restaurants (and cocktails) in Singapore. My girlfriend and I made last minute weekday night reservations to try out the #36 spot in the top 50 restaurants in Asia. We never made any attempt prior to check it out here since the menus that they post on the restaurant's website seem like they serve dishes that we really wouldn't like - things like ox tongue, foie gras, pigeon, pork collar, eel as a starter, etc etc. A mix of so many different foods that I don't imagine are that creative in my mind. Boy was I hugely mistaken.The Tippling Club has two menus for dinner - their 6 course \"classic\" menu which runs around 2 hours and their 10 course \"gourmand\" menu which they say takes around 3.5-4 hours (you'll find that time goes very fast here). As with any restaurant that offers this, SIT AT THE COUNTER AND WATCH ART IN ACTION. Seeing how delicately each meal is prepared will give your date an experience she will remember not to mention your food is guaranteed to taste a LOT better since you witnessed its preparation.Very quickly - for those that are going for cocktails only:TRY OUT THE EAST INDIA 1885 - one of the best cocktails I've ever tried anywhere!!!!! TRY OUT THE SMOKEY OLD FASHIONED AS A NIGHTCAP!!!!! TRY THE JUNGLE OLD FASHIONED IN BETWEEN!!!!My girlfriend really enjoyed her JUNIPER SLING.SARTORIAL was pretty good.PINK PEPPERCORN NEGRONI was good if you are in the mood for a negroni with a slight twist.FIG SIDECAR was okPURPLE DRANK tastes like cough syrup and even comes in a medicine bottle. I think some other yelpers said they like it so maybe to each their own.GOT MILK? wasn't good at all. This is part of the pairing with the classic menu.Back to dinner -What we found out after we opted for the shorter classic menu was that the menu only gives a preview of what you will get. However, what you actually get is far from anything you would imagine in terms of appearance, flavors and the whole creative package. They also give you the option to do a wine paring which we didn't do but instead picked out a bunch of their cocktails which was the better decision.So what was part of the classic menu? Unfortunately I wasn't able to understand much at all of what the chefs were describing, but I'll do my best.1) Snacks - started with a tom yum mayo paste with a very nice lightly fried and crisp veggie (what looked like arugula). Then to a clear puffed beef tendon with some light salty powder. Then to a red shishito (or similar) pepper charred until black with a brown wasabi sauce. It looks like poop but tastes amazing. I was a little bit taken back by this, not sure how I feel about the chef serving what looked like poop to us. Even though it tasted great, in a small sense it feels like the chef is poking fun at the guest. Then had a shooter that was incredible but don't know what it was.2) Eel first course which wasn't prepared like what we were expecting (unagi style) but done extremely nicely and beautifully with garnishes that looked like an artwork but each of them carrying a punch of flavor. Beautifully done with a mustard ice cream on the side which compliments the flavors so well.3) Scallops with parsley root and purple garlic soup - WOW!! Another beautiful dish that I finished so quickly that I didn't remember eating it. 4) Rockling and Smoked Ox Tongue - I expected this to be much different than it actually was but wow this was incredible. I don't actually like ox tongue but they did it in such a way here that it was excellent with hay baked beetroot and horseradish.5) Pigeon - This was the one plate that was the same as any other pigeon you would find at any other restaurant. Even still has some gamey-ness to it. Presentation-wise even wasn't too creative compared to every other dish.6) Textured Milk - This one was fun. Very good dessert. I highly recommend not going with the \"Got Milk?\" cocktail pairing for this. It doesn't at all taste like the description reads (tipping club milk tea, sakura flower and dark rum). My gf and I both didn't like it at all.7) Petit fours - Great selection of coconut chocolates, tofu cream and something else. Service is perfect. Only complaint I have is that I feel they should take drinks off the final bill if you barely touch it. My gf barely sipped her PURPLE DRANK and they only just took the glass and left. One of the staff members spilled one of our other cocktails which we barely touched (and it was sitting for a while) and they didn't take it off the check.Otherwise, we loved it here. This is what culinary creativity is in its finest. Highly recommend!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "z8QVXbDBV11IFjHrS2eqDg",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Scallops dish of the \"classic\" tasting menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z8QVXbDBV11IFjHrS2eqDg/o.jpg"
      },
      {
        "img_id": "kBLyFfKIH_IkJ7NomPD2bg",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Looks bad but tastes exceptional",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kBLyFfKIH_IkJ7NomPD2bg/o.jpg"
      },
      {
        "img_id": "sDOyRrr9KiAmrVwYMAw0vw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Eel dish, part of the \"classic\" tasting menu.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sDOyRrr9KiAmrVwYMAw0vw/o.jpg"
      }
    ],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "ZMnSEMTuAzSCG1qaT5UJZA": {
    "date": "9/22/2015",
    "text": "I had the broccoli cannelloni. Not sure what was going on there. It was bland and dispersed when you cut into it. There were blobs of some kind of brown and light brown sauce. The combination was actually a bit nauseating. It was among the worst dishes I have ever eaten. I had five textures of milk for dessert which was too novelty-driven and tasted of nothing but sugar.On the way back to the office, I stopped by Maxwell hawker center and got a fried banana.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1mRtqvRSvYtH4a29zDxEQQ",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Broccoli cannelloni -- disappointing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1mRtqvRSvYtH4a29zDxEQQ/o.jpg"
      }
    ],
    "user_id": "cfWgO7F1X7i5-ESSXhpxMg"
  },
  "YP74CPrdQKu_aU57ndKkow": {
    "date": "11/9/2014",
    "text": "While I didn't have a chance to try any of the food here, I was able to try 5 cocktails in one sitting so I guess that could qualify as a tasting menu :).  #1. Smoky Old Bastard - the idea of serving a cocktail with smoke or scented air is brilliant.  The execution here isn't as brilliant as the Aviary in Chicago, but it is still a fun drink, even though the liquor at the bottom is scotch with some butters. #2. Transatlanticism - main components are amaro and whiskey.  I loved how the spiciness of the amrao comes out.  Solid drink.#3. Purple Drank - brilliant packaging, serving a cocktail in a cough syrup bottle, down to the box.  Problem is, it also tastes very much like cough syrup, so while this was a little tough to drink in its entirety, those who like jaegermeister will love this.#4. Genever Martinez (off menu) - after 3 house cocktails, I wanted to see how they did with some classics.  I tried a martinez, substituting genever for gin.  Perfectly executed.#5. Old fashioned with Willet rye - perfect nightcap.  So overall, I really enjoyed the drinks here, and the staff is great too.  The lounge room is a little awkward, though, and it's not great for large groups (I would probably get rid of the door).  But it's definitely worth checking out for drinks, and the menu looked very promising too (5 or 10 course tasting menu). They have some of the most creative drinks, but also nail the classics!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "3pgPzv9jGtUdlpKmQiYKsA": {
    "date": "8/31/2014",
    "text": "A visit from my husband's auntie prompted us to finally check out Tippling Club's semi-new digs on Tanjong Pagar. She was quite interested in seeing Singapore's trendiest F&B spots, so we figured we'd take her here for after-dinner drinks and dessert.For a weekday, the restaurant was buzzing, but the bar was pretty quiet. I didn't mind this at all, since it meant better service and ambiance for conversation. I liked that the cocktail menu still had a few drinks that were there since the last time I visited (which was over a year ago at their Dempsey location. Time flies when you're busy stuffing your face with hawker food.) Of course, there were some new and seasonal cocktails as well, which is always refreshing to see! Since I was on a whiskey roll, I decided on the Smokey Old Bastard. True to its name, it came to me in a tall glass filled with smoke. I have no idea how they created it, but nevertheless I enjoyed my smokey (literally and... taste...fully??) beverage. I recommend drinking this a bit quickly though, as the ice melts fast. The tears that end up in there due to losing $25 on a watered down strong one doesn't help, either. The chocolate and orange dessert was just alright. I wish I took a picture of the spoons that they gave us to use, because it looked more like a soup ladle with more width than length. Basically, it made it really difficult to eat the dessert, and was the most impractical utensil I've seen in a while.Definitely a great spot for drinks, though it'll cost ya. Wouldn't mind revisiting for a nightcap or a special occasion.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "AgwcrtFEsiafYfdgACxbkw",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Low Profile Fashion Choices",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AgwcrtFEsiafYfdgACxbkw/o.jpg"
      },
      {
        "img_id": "hIoWmuuAdM-1LHfx5eQoPg",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Chocolate and Orange",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hIoWmuuAdM-1LHfx5eQoPg/o.jpg"
      },
      {
        "img_id": "XhD8IzRlNuFE5VZqcB4J9Q",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Smokey Old Bastard",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XhD8IzRlNuFE5VZqcB4J9Q/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "hc8s0Hc4iwOiMwMW2xbW0w": {
    "date": "12/17/2015",
    "text": "Well-made artisan cocktails in a cool, semi-hipster setting w/air conditioning.  The Tippling Club has delicious drinks that border on being over-priced, but the vibe is just hip & upscale enough that they pull off the high prices. All-in-all a solid spot to have a few drinks w/a date or small group.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "yxo6tOM_wZ-LmXrVGSlXdQ"
  },
  "3OryP9JyNoOrX0zZ87NHlA": {
    "date": "6/9/2014",
    "text": "Tipping Club is amazing! No, I'm not talking about the food. Gastronomic food? What hogwash! Gastronomic drinks? Now we're talking!I think the Tippling Club has the best drinks in Singapore! Or maybe in the World! My favorite is the Smokey Old Bastard. I take all my boys here whenever we need to celebrate a birthday. Orange infused whiskey in a flask, filled with cigar smoke? Baby, this is better than you birthday suit! Of course, the other drinks are fabulous as well. Purple Drank, anyone? Vanilla & raisin spirit, curacao, candy gomme, raspberry, citrus. Notice, no grape juice. But it's still purple and my kind of drraaankkk! The only downfall I see is that this place closes promptly at midnight. So if you arrive at 11:30, they may turn you away. So if you're an oldie, who still likes to draaaankkk, come here towards the last leg of your night (perhaps at 11:00?) and when Tippling Club closes, a perfect excuse to go home. Another tip? Come here to start the night!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3g_vgaCNlvR5uKmUkSz8Rw"
  },
  "V4u35H_kHYdy6ZAx8w26Rg": {
    "date": "10/20/2014",
    "text": "Unexpected lunch here turned out to be an amazing experience! It was only by chance we happened by and I noticed the logo on the doors as this restaurant has no signage to speak of; however once inside it was the start of a gastronomic journey.We scored the last table in the restaurant and after selecting what I expected to be a simply two course lunch was treated to a couple of appetizers and a pallet cleanser.Every dish was well thought out, balancing flavorsome, textures, and spices; the wait staff were very well trained and always happy to help; having the meals explained by the kitchen staff too always highlights what is important to them.This is a place I will definitely make the effort to come back too.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "NKJC3Ma6gRofkg21ErZ61A",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Carpaccio",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NKJC3Ma6gRofkg21ErZ61A/o.jpg"
      },
      {
        "img_id": "GMJj8u99MKKjNjwf4uneRQ",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Chicken curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GMJj8u99MKKjNjwf4uneRQ/o.jpg"
      },
      {
        "img_id": "XLI-GJ2nKMA6GEomdwkyog",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Gazpacho soup with basil pallet cleanser",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XLI-GJ2nKMA6GEomdwkyog/o.jpg"
      }
    ],
    "user_id": "2BKqNWXvukhZdq6_8Gbfxg"
  },
  "jEi6MauN92mxxDzGA1DsiQ": {
    "date": "6/24/2014",
    "text": "Meeting a friend I hadn't seen in ages, she recommended this little joint and I got here slightly after 9pm on a Saturday and the place was buzzing with activity. Immediately spotted a great mix of expats and locals, and the place had a very cosy feel to it despite a very obvious attempt at maximizing every inch of space they had.We were seated at the bar, my friend was friends with their mixologist and I had a fabulous night for obvious reasons. I started off with the Purple Drank, housed in a cough syrup bottle in a box, and you literally sip out of that cough mixture bottle. I was pleasantly surprised that the raspberry flavoured cocktail with curacao was refreshingly good, a tad bit pricy at $23, but at places like these, one can only expect prices as such. I had a few other customized drinks as well, courtesy of their expert mixologists, and I was left wanting more. All their cocktails are uniquely presented, surprising you at every step of the way. The Tippling club would be perfect for a fun first date, or to celebrate a birthday with friends.  I've good things about the culinary wares available, but did not get the opportunity to give it a shot. Definitely going to head back there to try them out. Would certainly reccomend this outfit to everyone who is adventurous with their spirits and is looking for a perfect place to start out a night of drinking and fun!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y8FmomeWTapIskUPq-ZULA",
        "caption": "Photo of The Tippling Club - Singapore, Singapore. Purple Drank, housed in a bottle very much akin to yucky cough syrup, but this cocktail is out of this world!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y8FmomeWTapIskUPq-ZULA/o.jpg"
      }
    ],
    "user_id": "rRas1bGzAjZmEspPM7BdZA"
  },
  "6Gg1SICkQoxtl4rEc3tWZg": {
    "date": "5/1/2014",
    "text": "I can't believe I actually get FTR. It's been a while.4.5 stars.I have mixed feelings about the new location at Tippling Club. On the one hand, Dempsey hill feels like a world away, far from the madding crowd, a charming township full of restaurants and art galleries. On the other, Dempsey Hill is a little bit of a trek from where we are, or anywhere really, it looks like. The restaurant itself was also much more formal, yet evoking memories of your last tropical vacation. They have since reinvented themselves to be on Tanjong Pagar, in a bustling neighbourhood, and the music is louder, the place is smaller, and it feels a lot more mainstream.Much has been said about the tastebud tickling culinary gimmicks that Ryan Clift's establishment spews out on a regular basis. Whether you go for the elaborate tasting menu or a mere cocktail, I think it is easy to say that you will be surprised. We've had the tasting menus as well as the bar food at Tippling Club. It's the kind of quirky stuff that Heston Blumenthal inspires in people. I daresay that if Mr Fat Duck ever ate here.. he might quite like it. The charred peppers taste unusually fresh for something that looks black like coal. While the sauce has been changed, the dish is still enjoyable. We've sipped consommes from test tubes here, eaten mustard ice cream, chomped on seaweed crisps, had carrots 3 ways,  imbibed foams and broths and air and what not. All good, all good. The cocktail menu deserves a special mention, as I have landed up here on more occasions for a drink that I have for food. The old favourites include Old Man and the Sea (light rum) , and smokey old bastard (islay). The clutching hand with whisky, fernet branca and lemon is great as well. Among the new additions, the low profile fashion choices is my favourite - with whisky, salt caramel, earl grey and chocolate, this could have been all over the place. Instead they created a beautiful concoction that takes the best of all world. While the new club has done away with the map that guided you to the drink that best suits your taste, the bartenders will do a great job of suggesting one to you. So don't be afraid to ask!A stellar restaurant and bar, now in an accesible neighbourhood. Just go.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lW35rwNviCgvTXJO8gvs-A"
  }
}