{
  "__B5B77NoN3Pr0uY-KX5bA": {
    "date": "11/11/2016",
    "text": "On the Table does many things right: Good coffee, unique food offerings, abundant space, and reasonable prices - all in an unassuming neighborhood in the west part of town.Food: I tried the Crispy Chicken Wings and the Truffle Mac & Cheese, which were both considered snack size items on the menu. The Crispy chicken certainly lives up to its name with its  crispy yet subtlety sweet exterior. The chicken was tender and well-balanced, easy to eat with a fork and knife, which I rarely find possible at many establishments. The mac and cheese was an excellent combination of varying textures starting with a crispy top filled with an oozing and melting cheese inside. I find that mac and cheese is difficult to master for an Asian palette but On the Table really got it right;  the cheese was noticeable but not overwhelming and combined well with the macaroni, bacon, and crispy toppings.Seating here is also abundant, offering a variety of choices from tables to more casual couches and comfortable pillows. Prices are reasonable - I ended up paying $25 for an iced long black, the crispy wings, and the truffle mac and cheese. Would definitely come back here again.PS. NUS students can get 10% off by showing their student card. It's a bummer that they no longer offer the discount for staff.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "s1bhk8ZF-TJKDHnKaW-Ulg",
        "caption": "Photo of On The Table - Singapore, Singapore. Look at the layers on that mac and cheese. Crispy wings in the background.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s1bhk8ZF-TJKDHnKaW-Ulg/o.jpg"
      }
    ],
    "user_id": "0nSzAzzqVUY1W-D-IVvu_A"
  },
  "GizyHwgJ8TmpMJFS2UzuAA": {
    "date": "3/16/2018",
    "text": "Very ordinary brunch. Firstly awful packet hollandaise sauce and my poached egg which was ordered with a firm yolk came out disgustingly runny! Won't be eating here again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BB-LX_k0WOyZ87jN568AWg",
        "caption": "Photo of On The Table - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BB-LX_k0WOyZ87jN568AWg/o.jpg"
      }
    ],
    "user_id": "SysGRVs9-ZX3Z62ZRiouEQ"
  },
  "dzlmjqmb9IB2pJVSWyYnvg": {
    "date": "12/4/2016",
    "text": "A short walk from pasir panjang mrt station, this place is away from the usually busy malls. The layout and ambience are comfortable. You have to order at the counter which is reasonable since there is no service charge. I had mac and cheese which was under the snack category but actually pretty filling. My friends had fish tacos and quinoa which tasted as good as they looked. We ordered triple scoops of ice cream and the waitress allowed us to separate into three bowls instead of paying for the price of individual scoops. I had the earl grey flavour which was a bit sweet for my liking. I would certainly patronize this place again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kGLUlsEgqZc52wRecAn_3A",
        "caption": "Photo of On The Table - Singapore, Singapore. Mac and cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kGLUlsEgqZc52wRecAn_3A/o.jpg"
      }
    ],
    "user_id": "pDk2mjq7RTpIc6AWIvrbfw"
  },
  "yEZOttaKATbIvCbHIGWo1g": {
    "date": "4/21/2015",
    "text": "Located just across the road from the Pasir Panjang MRT is this cosy cafe. Once you see Fat Boys, you know you're on the right block! On The Table is the sister cafe of Lola's from Kovan, as such they sell similar menu items like the very instagrammable Honey Crispy Wings, but did you know they also sell superb waffles along with their brunch menu?It is quite a big cafe, there's lots of nice decorations, the wall have a rustic print on them, there are round tables for groups of fours and also bench seats for groups of 6.The menu is simple, easy to read, and immediately I wanted to try a bunch of them! The waitress hurried over and took our orders. Our drinks slowly arrived on the table one by one. I had the iced matcha latte, it was abit diluted for my taste, maybe it was because it was iced. My friend had the hot matcha latte and it tasted good.1. Eggs Benedict $13The eggs were perfectly poached and tasted great on the brioche toast. The salad seemed fresh and was seasoned well.2. Prawn Aglio Olio $18Prawn Aglio OlioI really liked the aglio olio. It had a al dente texture with a strong aroma of prawns and they were very generous with the prawns. I lost count on the number of prawns I had munched on. The pasta is a decent serving and I would want to try more of their pasta offerings in the future! I highly recommend this to all prawn aglio olio lovers!3. Fries with Truffle Mayo $8Truffle fries, every cafe has them! Truffle Mayo? Say that again? Yes it's the perfect kind of mayo you want with anything fried!! We chomped down on this side dish and we vowed to always order it everytime we step into this cafe!! The truffle taste isn't subtle, it is actually quite strong but does no overpower the mayo. The fries were fried just alright, not dripping in oil and they were not soggy either.4. Truffle mac and cheese with bacon $9I am a mac and cheese lover and yes this was a sure win for me!! Not to mention BACON!  I love bacon too! The top layer was just right, slightly charred to give it a crispy texture and with the crumbs everywhere, it was a crunch in every bite. There was sufficient cheese spread around the entire dish, no one macaroni was not drowned in cheese!5. Crispy Honey Wings $10From the popular Lola's cafe comes these infamous wings, we figured to just order two servings and we were right. They were crispy and delicious, I loved the honey drizzled over the wings too! Some of my friends commented, why pay $10 for 8 winglets when you can get prawn paste chicken wings from any tze char stall, at a lower price? Simple, these wings aren't dripping in oil, and they actually stay crispy for a while. They are also pretty plump and I totally love them! I have tried wings at different cafes and here is one of my favourites!6. Waffles with 3 scoops of ice cream $12People flock to Lola's or On the Table for their brunch menu.. and to be honest.. Their waffles are much more worthy cause to travel across our island country for! These are the best waffles ever! Super crispy with every bite, even when the ice cream has drenched through the waffle, the waffle still stays crispy! We tried baileys brownie, which I felt was abit too sweet, earl grey which frankly was very good and milk tea, which was very good as well! After visiting On the Table for ice cream and waffles, and then visiting Upper thomson for supper, I realized alot of ice cream parlour up at upper thomson, can't even hold a candle to the ice cream at On The Table!Wings, eggs benedict, fries with truffle mayoAll in all, On The Table could very well be one of the best cafes I have been to! I will be back for double waffles!!!~",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "RZXcXp2fY9YlXPCin28LLA",
        "caption": "Photo of On The Table - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RZXcXp2fY9YlXPCin28LLA/o.jpg"
      },
      {
        "img_id": "Nzm-WSg9tescOdFjJ-NAwQ",
        "caption": "Photo of On The Table - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Nzm-WSg9tescOdFjJ-NAwQ/o.jpg"
      },
      {
        "img_id": "uUBXR7R-UEOQN8ko1gnlpQ",
        "caption": "Photo of On The Table - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uUBXR7R-UEOQN8ko1gnlpQ/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "S6GQZ0wR8QiHYrKPIPrQ_g": {
    "date": "6/10/2016",
    "text": "Service - Chope doesn't take in online reservation anymore, so I tried calling in and lucky they still took my reservation on a Friday night. Phew! Service at the restaurant was superb, the waitresses were prompt to your request and food were serve pretty fast too! Awesome!Food - price were reasonable with the quality of food. We've spend about $60 for 2pax with 3dishes and 2beverages. Oh and you can help yourself with free water over the counter.Environment - rustic comfy feeling. It's good for private event too, i felt. Toilets were spanky clean!Parking - parking lots were not alot but we were lucky enough to find one upon reaching and parking is free after 5pm! Awesome awesome for dinner diners. Ha! :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5fmvbvQgLd00xPkLlKib8A",
        "caption": "Photo of On The Table - Singapore, Singapore. Forgot what's the name but chicken leg can be better, the bread with broth was a good combination. Not bad a meal? :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5fmvbvQgLd00xPkLlKib8A/o.jpg"
      },
      {
        "img_id": "myc6xsw96kko1x-cjGDnOw",
        "caption": "Photo of On The Table - Singapore, Singapore. Seafood pasta, friend said it was meh.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/myc6xsw96kko1x-cjGDnOw/o.jpg"
      },
      {
        "img_id": "DQnq9ZYybGUyITRCysyNFA",
        "caption": "Photo of On The Table - Singapore, Singapore. This was soooooo good. Almost every table had one on it. Honey crispy chicken wings.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DQnq9ZYybGUyITRCysyNFA/o.jpg"
      }
    ],
    "user_id": "0pfIhAJ_u-GahkfqzIfxoQ"
  },
  "JxgrDwuoh7tBamLv09D7JA": {
    "date": "2/27/2016",
    "text": "Second time at On The Table for brunch with the wife and 2yr old. Their food and coffee doesn't disappoint although our second trip ended prematurely on a perplexing note. We were halfway through finishing our coffees (prob would have been done in 10minutes) and was approached by one of the staff who asked us if they could shift us to a smaller table. What was perplexing was that the new table ALSO sat 4 pax. We felt it was too much of a bother to shift our seats (and child) and quickly drained our cups and left.Good food, maybe improvements could be made to the table turnaround process.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X-5Bm8vt8mQdKUGaLy4pmQ",
        "caption": "Photo of On The Table - Singapore, Singapore. The Ultimate Croissant",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X-5Bm8vt8mQdKUGaLy4pmQ/o.jpg"
      }
    ],
    "user_id": "wzKQvCq80ZEyrbLtxAi6RA"
  },
  "aybtd6niLc83h5rQM3sNbA": {
    "date": "10/13/2016",
    "text": "If you are in the area, definitely stop by for their homemade ice cream. Both the Brownie & Baileys and the Thai Tea were excellent!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3UfaNU33lD86wnyAIwyhzA"
  },
  "N17OVxCaY4YJn9TeQyuz3w": {
    "date": "8/14/2014",
    "text": "First time here ..... trying to slowly conquer the 136 cafe listing of Singapore. This cafe gives me a cozy feel and I feel so homely. This little cafe covers 2 unit of the shop house and it's located along the Pasir Panjang Road. There is a carpark near the vicinity so no worry about finding a car lot to park your car. I'm sure you can find a lot here. The menu is not every extensive but .......I love the the interior layout of the cafe and there is plenty walking space here and definately it's not squeezy and overcrowded ...... love the simple decor here.Just a little tip, you got to order the food over the counter and make payment on the spot.We order 5 main course and share among us - 1) The Big One $16.00 it's a breakfast set with bacon, sausage,  scramble egg, salad & bread. The bacon taste alittle sweeter as it's coasted with alittle honey. The overall set is marvelous. 2) Prawn Alio Olio $18 the pasta is cook just alrite and I love the spices which scatter all over. It taste alittle saltier as compared to what I had before. The portion seems to be alittle small. But overall it would taste nice if they go easy with the salt.3) Duck Confit with Mash $18 the overall presentation of the food serve looks good but the duck confit is alittle too small. Love the sauces and it taste alittle orange tangy. Love the mash potato and it taste so well with the sauce as well as the duck confit. The duck confit is well cook and it taste tender .....4) Fries with Truffle Mayo $8.00 oh my .... It's delicious 5) Crispy Honey Wings $9.00 the wings are so tender and I love the crispyness and little honey spatter all over. Ohh it's really very tasty ..... Thumps upOverall the dinning experiences is good ..... definately would love to visit here again",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "VRoKyP8SrxJHg5vGMWzR3g",
        "caption": "Photo of On The Table - Singapore, Singapore. The Big One $16.00",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VRoKyP8SrxJHg5vGMWzR3g/o.jpg"
      },
      {
        "img_id": "y_Lbe_6JXphAdtILIKejbw",
        "caption": "Photo of On The Table - Singapore, Singapore. Order number tag ... waiting for our food",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y_Lbe_6JXphAdtILIKejbw/o.jpg"
      },
      {
        "img_id": "HY2kNrE6CvXyYmVaMh8s0Q",
        "caption": "Photo of On The Table - Singapore, Singapore. A little corner of the cafe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HY2kNrE6CvXyYmVaMh8s0Q/o.jpg"
      }
    ],
    "user_id": "UwWtpjalT2xlJyglRRITug"
  },
  "buo_xJ6aku21zAEILrZJQA": {
    "date": "10/12/2016",
    "text": "I think this is my favourite brunch place given its proximity to NUS and the 10% discount, which makes everything extremely affordable. My favourite brunch item from their menu is the Ultimate Croissant, which is served with generous servings of scrambled eggs, bacon and salad. The truffle fries is also worth a try, especially with the truffle dip that pairs really well with the crisp fries. Another item on the dinner menu that is worth a mention is the Gnocchi with mushroom and broccoli. Though small in portion, the chewiness of the Gnocchi and the creamy sauce really makes it just right especially if you're looking to have a light dinner. Also, the ice cream here is amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "xU3sDPonLx1_w4t6wOOpdg"
  },
  "YDFUQk--QmgIGw-K8MIn1A": {
    "date": "9/30/2015",
    "text": "On the Table reminds me of a hip basement cafeteria. The decor is dark, garage industrial and the tables are spread around a center island where you place your order, get water, pick up condiments/extra silverware, and can drool over desserts like \"lychee rose water cake\". Along the back wall is the \"Great Beer Experiment\" - a huge rack of fun eclectic beers sitting under strings of lights that give the place an indoor-outdoor feel.We were seated at one of the larger \"booth\" tables along the right that had these awesome low, grey, long, spacious couch-benches. The menu is Western with a local twist - both the chili crab linguine and table salad (soft chicken, avocado, tomato, almonds tossed in balsamic) were solid.  But the highlight was their ***waffle with ice cream***. Their ice cream in general is ON POINT - think earl grey, thai iced tea, thai iced GREEN tea, rum and coconut, baileys brownie - but over a perfectly toasted waffle? I can't even.On the Table seems to be there for every part of your day. Whether you're there for brunch, \"café food\" lunch, coffee/ice cream/waffles for afternoon tea, or dinner/a beer, it promises a space for good food and a great time.The place is very spaced out, not like they're aggressively trying to fit as many tables as possible, and that's refreshing for Singapore. The only strange part was the music - but if you like bopping along to all the hits from 2013, it's all good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BlEFnOjUxS_IRXYW0uZ3Hg"
  },
  "ZmIBQ5i6Grkc-TXBy0bPGA": {
    "date": "10/23/2016",
    "text": "Love the food and chillout ambience here, if you like lola's cafe, this is even better",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CQyZyiMaw0lIOvb-3hDCg"
  },
  "HBga5avH2ntD29vROjs2Bw": {
    "date": "11/22/2014",
    "text": "After being there for a few times already I realized that I really enjoy going to this place for a good coffee or breakfast. I like the friendly staff and the drinks and food. Sometimes it would be nice to have a bigger choice of juices but the organic drinks they have are for sure tasty. Flat white is amazing and so are the ultimate croissant and eggs benedict. The Interior is nicely done but I lack a bit of sunlight.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "TM2ZZiiIEZzKl6WE_Pd7Yg"
  },
  "EYT9XsV9xj0oXnH_hyUaXA": {
    "date": "5/17/2016",
    "text": "Visited for the first time the other night. Wow! We were amazed! We loved the salad - chicken was moist, dressing was yummy, great portion! The Mac and cheese, although yummy could use more bacon. The fish tacos were big and flavorful (even reheated the next day). The pasta with sausage was good. The fries with truffle dip was yummy (although they said parmesan in the description, and did not really taste it). The waffle was spectacular! Crispy goodness with delicious ice cream! Yummy! We had never been and were pleasantly pleased with the portion size in relation to the price! We also had a ton of special requests (food not touching), and they were willing to accommodate! We were VERY impressed with the staff! The level of service was great! We are telling all our friends, showing pictures, and recommending On The Table to everyone! This is a great find!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcXqhdOtSbKVefxvO1II8Q"
  },
  "3ZfRMAogLoaKuOl4nkp9rA": {
    "date": "5/14/2015",
    "text": "One of my top go-to brunch places in Singapore. Nested in an extremely unassuming location right on Pasir Panjang, the café is a cozy environment overrun by smells of baked desserts and brunch classics. The eggs benedict are amazing, and their fries with a truffle scented aioli are a must-have. The coffee is quite nice too, I'm a fan of their latte and the fact that it's served in a short glass. While the bathrooms are somewhat rundown and reminiscent of an old gas station (rest assured, though, they're always clean and pleasantly scented), the main café area is very nice.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zrT9ajIiHc_wUi-pC77aaQ"
  }
}