{
  "seV7Wzedj8mLsaw2WZilew": {
    "date": "10/16/2016",
    "text": "Japanese Pride and Precision..... In a local dish. It's official... As much as I loved our Michelin starred Teochew Mince Pork noodle, I have officially found my current favorite Bak Chor Mee (Minced Pork Noodles). I won't go into the backstory of how the stall was first open by her father etc as googling Ah Hoe Mee Pok will prompt multiple sites sharing their family's story.  Instead, I'll dive straight into the dishes we tried. Special Mee Pok - Soup or Dry ($4 / $5)Let's start with the \"basic\" or one of the starter Mee Poks. Ordered the non-chilli version as the wife is not much a Chilli eater. I really hate to say this but.... Based on the non-chilli version, the Mee Pok here is a lot better than our Michelin Star version. The noodles used for both the Mee Pok and Mee Kia were of very good quality, retaining its springiness and chewiness. It absorbed the flavors of their sauce very well and didn't have that floury starchy taste that is commonly found in other Mee Pok dishes. For $5, there is a generous amount of ingredients , with 2 prawns, 3 slices of abalone (mock? Or lower grade abalones), 2 meat balls and a lot of minced pork. The sauce used was really delicious. It was fragrant, salty, a little sweet and rich, thanks to the oil from the fried lard but it wasn't overly oily, allowing the sauce to coat the Mee Pok beautifully without leaving that thick oily feeling on the roof of your mouth. Japanese Fusion - miso / shoyu - soup or dry ($6 / $7) We had to try what made this place famous. The Japanese fusion noodles. I went with $6 for the shoyu and $7 for the miso. Both served dry. What made both these dishes so great was the sauce and the way it coated the noodles. This wasn't just some mad experiment to add ingredients into a minced meat noodles. With the first bite, you can taste the effort and the though process of putting everything together. The sauces both coated to noodles beautifully, ensuring that you get the fusion flavors popping in your mouth with every bite, without overpowering your taste buds. It almost reminds you of a good Tsukemen Ramen where instead of a broth, you get a thick, rich, dipping sauce for your noodles. The Miso version offered a very earthy flavor. Very umami with the natural sweetness of the miso coming through delicately. It was very wholesome yet light enough to ensure that you don't get tired of the flavors after the first 2-3 bites. The Shoyu version was surprisingly the bolder version. Unlike our regular soya sauce, Shoyu is made with fermenting more wheat than soya beans. It's less salty but richer and more wholesome and this made a world of difference to the dish. It was fragrant, full of flavor and there was a hint of either Nori or Bonito that had been infused with the shoyu, giving it a sweet, fragrant, slightly more umami flavor that you normally get with regular Chinese soya sauce. And like the \"regular\" Mee Pok, they are very generous with the ingredients. For $7, which may seem steep for a bowl of minced pork noodles, you get 2 slices of abalone, 4 meat balls, lots of minced pork, lean pork slices and 2 large pieces of Japanese chashu, which almost melts in your mouth with each bite. What I really like across the board is the care that was put into each ingredient. Unlike most minced pork noodles, the lean and minced pork were perfectly cooked, tender and almost bouncy with the minced pork having a food fat to meat ratio, ensuring that it doesn't go dry while cooking. Even when preparing each dish, the cook doesn't just boil everything and dump it into the bowl. Each ingredient is \"plated\" carefully, showing off the typical Japanese pride when it comes to cooking. Teochew Dumpling soup While the dumplings (wantons) were pretty normal and the soup (to me) a little on the salty side, they were again very generous with their ingredients. No plain soup with dumplings here. The soup was nice and chalky from the cooking of the pork and there was minced pork and lots of cabbage in the soup. A great way to balance and otherwise very meaty lunch. Overall, I really enjoyed the noodles here. For the traditionalist, it may be a step too far away from an authentic bowl of teochew minced meat noodles but from a consumer / foodie stand point, it certainly was special and offered something so familiar yet so different, showing that sometimes, maybe drifting slightly away from tradition may just help take what is deemed as common hawker food, to the next level. After all, with Japanese / Asian influences making its appearance is michelin star restaurants across the globe, it's only a matter of time that our local hawker favorites receive the same treatment. There is certainly no confusion in this Japanese Chinese Fusion. Remarks: Do take note that because he doesn't dump all the ingredients in to cook at once and because each bowl is cooked individually and with care, waiting time may take longer jan the average Mee Pok seller.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "udrrMBH_m5H9KhB2FFtKQw",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/udrrMBH_m5H9KhB2FFtKQw/o.jpg"
      },
      {
        "img_id": "1nGPbKCU1k-Thur9Ztnt9Q",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. The $5.00 Special Mee Pok.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1nGPbKCU1k-Thur9Ztnt9Q/o.jpg"
      },
      {
        "img_id": "f3BH8000byVveN6FLjGWwQ",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f3BH8000byVveN6FLjGWwQ/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "STJoksqw9RpQKwKNPcox8Q": {
    "date": "2/8/2017",
    "text": "One of the best mee pok I have ever eaten. The texture of the mee pok is thick in a tasty way. The noodles are springy. The lard is sinful but really enhances the taste. The first mouth felt a bit salty but afterwards it is fine and I did not feel thirsty. The staff is thoughtful to terminate the queue when the food is finishing. The queue for lunch time stopped around 11:40am! That's how popular this place is. Another valuable asset is the great attitude of the staff who readily customizes orders!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cryllqqhqQkKibDmIrpZhw",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. Mee pok with mixture of ingredients",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cryllqqhqQkKibDmIrpZhw/o.jpg"
      }
    ],
    "user_id": "pDk2mjq7RTpIc6AWIvrbfw"
  },
  "LY-qdbOa7SjDAp2JqbeH0g": {
    "date": "4/4/2016",
    "text": "Seeing a Japanese family selling traditional hawker fare instead of Ramen is definitely a novelty. The $4 Bak Chor Mee has quite a generous serving of braised mushrooms, mixed tender sliced and minced pork, 3 bouncy pork balls and 2 slices of chewy canned 'abalone'. The texture of the noodle is cooked al dente and well-coated with a good balance of sweetness, tanginess and spiciness. The noodle is laced with crispy and fragrant pork lard (I don't eat pork lard and thought they were ikan billis initially) and a bowl of cloudy looking soup to complement (Pork broth with a tinge of abalone).",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4RaEXT7Eg6JiFbsEHMwzgw",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. Stall front",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4RaEXT7Eg6JiFbsEHMwzgw/o.jpg"
      },
      {
        "img_id": "u00y28garBiUwVxDAvxOQA",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. $4 Bak Chor Mee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u00y28garBiUwVxDAvxOQA/o.jpg"
      }
    ],
    "user_id": "cHwoUWjI0p0ZDKYvlE9kNQ"
  },
  "yDhCDNNwoRrsNA4kqmVuzg": {
    "date": "9/12/2016",
    "text": "Ordered: 1.30pmFood in hand: 2.11pmNot sure why it takes so long given the pace she works at (which is incredible by the way).Special noodles with abalone and prawns ($5) - 3 starsThe noodles tasted great - 4.5 stars - only for the first five minutes. They quickly lost their \"crunchy\" springy texture as I ate and thereafter tasted lackluster. The abalone was deliciously sweet, but the prawns were just okay. Not quite worth the wait unfortunately.Order here to pick up in advance or for delivery if you really have to try it. Worth paying 50 cents ($5.50 instead of $5) or $2 more ($12 instead of $2) to avoid the wait.Ambience - 2 starsRuined by the stray cat that kept brushing against our legs as we ate, while the girls next door kept taunting it! Ugh.japanesemeepok.getz.co/H…",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "ZKskBiq8pBXxPRnWjBgTAg": {
    "date": "5/14/2016",
    "text": "This is the newer stall at 713, the original is at 710.This stall is usually operated by either the mom or the son. They have additional help to take orders. The Q here is not that long compared to 710.The taste is similar, but today the mee pok noodles is slightly undercooked. I had additional chilli which is always great.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dpB9hFOgViorFUzBEikCTA",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dpB9hFOgViorFUzBEikCTA/o.jpg"
      },
      {
        "img_id": "3Lyg57e4UKxVgiZhHQay1w",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3Lyg57e4UKxVgiZhHQay1w/o.jpg"
      }
    ],
    "user_id": "BSzE4Vu-yzyTMSJpwZtIBw"
  },
  "KzAxQMOtWTmlu7hLzjukEw": {
    "date": "1/16/2016",
    "text": "Somehow I came here after the big hype online where most people would write great reviews about how a Japanese came to Singapore to pick up the skill and set up shop to sell mee pok, just like how any other Singaporean would.Unfortunately I didn't wake up early enough to reach here at 0700hrs, but got here at around 0940hrs instead and there was a long queue. While starting at the back, it seemed that there was a large order to go, which I understand, family breakfast, gathering, it's fine. When I finally got to move a step, it was 30 minutes later. Ok my expectation was growing as I got hungrier. Another 30 minutes passed and my order was taken in advance. I ordered the special noodle no.1 and added noodles for 50 cents more. Ok, another 20 minutes wait and I got my food.The noodle portion was generous, a pretty hearty amount. It came with a prawn, 3 pieces of abalone, and minced meat, all glaced with lard. One of the main characteristic of the noodles is that it has a lot of lard (crispy not soft) which is good I guess, to prevent the noodles from sticking together. However, I reckon the crowd caused Naoji san to undercook the noodles and it was slightly hard still. I must say that the overall taste was very balanced, a tinge of vinegar, soy sauce, except for the lard part, very overwhelming. So somehow it was not overly tasty, but the chilli sauce helped a fair bit.I also ordered a bowl of teochew dumpling soup, there was a lot of lard in the soup as well. Again, I had the same observation, the dumplings were not cooked enough, the skin of the dumpling was slightly undercooked with the pork filling.Would have preferred to give a 3.5 stars but I guess it's not available yet. Given the hype, I will go to the original Ah Hoe mee pok, lesser queue and more flavorful mee pok.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tbxJENG9AEs0vR5-8MHhzQ",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. Teochew Dumpling Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tbxJENG9AEs0vR5-8MHhzQ/o.jpg"
      },
      {
        "img_id": "q538r8OURn2pP2GnEoPBlQ",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. Special mee pok no. 1",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q538r8OURn2pP2GnEoPBlQ/o.jpg"
      },
      {
        "img_id": "UjQ5je1LJ_3WtbeZh-1bgA",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. Soup and Noodle cooking \"partitions\".",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UjQ5je1LJ_3WtbeZh-1bgA/o.jpg"
      }
    ],
    "user_id": "zkJ7aPyIzH61ei_nftYStA"
  },
  "Oo3pvAJD8-qAEzi_jKU6UA": {
    "date": "9/12/2016",
    "text": "I've eaten the #1 Deluxe Mee Pok here twice, once from takeout brought home by my brother, once in person. It's a wetter bak chor mee, doused in a flavorful broth. Both times I admit the overall flavor profile is better than most bak chor mee I've had, probably enhanced by the addition of the abalone and prawn juice broth at the bottom of the noodles. Unfortunately that also makes the noodles soggy quickly which negates the initially al dente crunchy texture :( The meatballs are tasty but the meat slices and prawns were underwhelming. I don't think it's worth the wait, order online and do pickup, it's only 50 cents more for a 40 minute saving in time. They do delivery too but I'm unsure of the delivery radius. -- This was even though there seemed like only 4 parties ahead of us? On weekends they do a japanese fusion mee pok, and they also serve large prawn noodles ($10).Protip: Get the $5 version for more ingredients, and add 50 cents for extra noodles!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rphq190m4y6GgNMocgd88g"
  },
  "ZkYi0ROSrb8vLfqGbVVJnw": {
    "date": "10/26/2015",
    "text": "One of the best bak chor mee I have tried.Meticulously done by a Japanese cook who takes pride in his preparation. Be prepared to wait if you are going during peak hours. The stall opens from about 6.30 am. The crowd starts coming in at about 9.30 am.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JGY8ccdU26gYzPZ-ENMdNQ"
  },
  "a3Z10BDdEiIvXIPDCyXXMw": {
    "date": "8/1/2017",
    "text": "This places comes with a lot of hype. Japanese-Singapore fusion. It is fine, but it didn't blow me out of the water. It was just a decent bowl of mee pok with a twist. Complaints? None. Did it excite me? Not really either.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYeADFgNxbtbiOMCdlIDlw"
  },
  "UBmnev42kBqMUijADAsHLg": {
    "date": "10/7/2015",
    "text": "One of the best mee pok I've tasted. Located in a nondescript coffee shop, run by Japanese expat family, captures the local taste and flavor of a classic Singaporean noodle dish! Try it dry with their homemade chili sauce.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "twCllxQkXlskbFTPLRw3HA",
        "caption": "Photo of Ah Hoe Mee Pok - Singapore, Singapore. Storefront",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/twCllxQkXlskbFTPLRw3HA/o.jpg"
      }
    ],
    "user_id": "6BnaC0yh0utlAEqFJR8BjQ"
  }
}