{
  "mLu0M8oOSYqSgGZnhnQeeQ": {
    "date": "7/28/2018",
    "text": "The pizza is great.  The beer (Stella) is horrible. You probably need to replace the lines.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hokvnEQNSmNkTTMeB3ov7Q"
  },
  "wx2ejmmWQMSa7ZjGcA3MsA": {
    "date": "3/17/2016",
    "text": "I really enjoy my moment in that resto, they have some more outlets across singapore, i went to in zion road after church st. Bernardeth. The place itself not big and spacious, good enough for singapore anyway We celebrate my birthday there and what i love as well aside from their food, the bring the cake with a happy birthday singing lovely... Feel so warm! Not many resto in singapore doing it! Okay lets star reviewing the food, we were like 20 people and we order one giant pizza like 21inch bacon miele (pork) sgd55 taste really good! Love it We also order prosciutto crudo di parma (pork) - combination of parma ham and rocket salad, love the combination, the salad give a vegie taste to neutralize the pork taste (im not really a fan of pork though) Pizza margherita - not that special like the taste of margherita We also order chicken wings and calamari - they are ok but not outstanding.Overall the highest rating given with combination of everything place and staffs are warm enough and the food love it so much! Will come back for sure",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DS_EnOZXhJfSpmzdTAIzqg",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DS_EnOZXhJfSpmzdTAIzqg/o.jpg"
      },
      {
        "img_id": "iVRjriLD0VQ-kRK2nen7zQ",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iVRjriLD0VQ-kRK2nen7zQ/o.jpg"
      },
      {
        "img_id": "MUhPsgMm01MJdN4Lv6C-RQ",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MUhPsgMm01MJdN4Lv6C-RQ/o.jpg"
      }
    ],
    "user_id": "ykj_bzOhA4qt6p-8HAHoaA"
  },
  "a436ywTNBlfsu5E1wDJlFg": {
    "date": "7/14/2017",
    "text": "Love the pizza here!  Come early or make a reservation.  Not cheap, but well worth the price.  Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3l-Rmqcw_Cm1mTxlqEmLEQ"
  },
  "5BIcMxlpIQWRKuvSTCmosw": {
    "date": "3/13/2014",
    "text": "We had our first taste of their wonderful giant pizzas at the Greenwood outlet and when they started to branch out to the various parts of Singapore. We were honestly quite happy. Seafood Pasta - I have always appreciated the fresh seafood and the amount of seafood in the dish is really quite enough. I would say that I prefer it more flavourful (more salt pls) but hubby tried and said it's me. :PGaint Pizzas - we had 2 giants so that 4 flavours altogether. The pizzas were very well received by everyone.  Kids like the square shape pizzas they cut them into and happily dug in with their hands. We were a part of 5 adults and 4 kids, and still had to doggie-bag quite a bit of pizzas. Oh well, hubby was happy to be able to have more pizzas for the subsequent days. Definitely a place to return to. Should call to reserve seating in the future so that we can eat in aircon comfort.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oz71O_3_ucWYbhA3KzyXrA",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Pepperoni & 4 Cheese Pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oz71O_3_ucWYbhA3KzyXrA/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "9R1jTznb_rcgtH47nsbpUQ": {
    "date": "12/31/2017",
    "text": "We've been here twice so far and we love the pizza! We really like the thin crust. The Nutella and banana dessert is great too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4RrfJ8FJqFIa2qCD5SXqJg"
  },
  "Fzs1baUjsidzEBVoNucfZA": {
    "date": "3/9/2014",
    "text": "The food was not too bad, but I had a really bad experience with the stubborn and rude staff. A friend booked a table for 6 at 6pm. The plan was to have some pizza, a couple of beer and then catch a movie like a proper boys night out. Little did we know that we were chased away by 730pm. We were not told we had to scarf down our food and beer with 6ppl in 1.5hrs! They insisted that they told us even though they obviously didn't. They even took our order of a glass of red wine and a pint of beer and expected us to be done in 5mins.The most outrageous part was when they decided to waive the beer and glass of wine and rather take back the beer that had already been consumed, DIRECTLY from my friends hand and throw it out rather then let him finish it since they waved it so they can chase us off their premises.This was one of the most shocking displays of service I have ever encountered with a bill close to $200.Oh well.. There will always be service staff who behaves this way. Lesson learnt.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0JZTfCsirEWJWRRqPuZAIg",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. The biggest size pizza that fed 6 of us. They give u a time limit of 1.5hrs before the rude staff chase you out.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0JZTfCsirEWJWRRqPuZAIg/o.jpg"
      }
    ],
    "user_id": "jq7Pb7s68wi2NDTFEXvwbw"
  },
  "90VUnGUCZ0F3k3FQty5PXQ": {
    "date": "1/23/2016",
    "text": "Have been here twice and food quality has always been consistent. I love their capriciosa pizza，pasta aglio olio and carbonara! On our 2nd visit，we tried the pork ribs and it amazed us as well. Service staff was always within sight so things were always prompt. Happy hour is before 7pm on a weekend and drinks are reasonable. Always my go to place for pizza. Limited indoor seating place so reserve ahead if you wish to avoid the heat sitting outside.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "WJqeWhTqv-csYmilV1vmQA"
  },
  "WN5vjRNmjWJVLAdQnZSxTQ": {
    "date": "1/2/2014",
    "text": "Great pizza and pasta, one of my favorite joints in Singapore to grab a nice hearty Italian meal.I highly recommend their Aglio Olio with an extra topping of bacon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NJ9fr7JgoXTzMDiwHI1VeA",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Signature pizza.....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NJ9fr7JgoXTzMDiwHI1VeA/o.jpg"
      },
      {
        "img_id": "yVLDaEE8-OdV4xZP4izigQ",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Their carbonara...a little too rich for my digestive system",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yVLDaEE8-OdV4xZP4izigQ/o.jpg"
      },
      {
        "img_id": "Nbdxgl3tl-4nB4h-vFDqaQ",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Their Aglio Olio with additional bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nbdxgl3tl-4nB4h-vFDqaQ/o.jpg"
      }
    ],
    "user_id": "mMjxhRn4h0LD1_jI3RT4cQ"
  },
  "691UInCoo-eGHFX4hx9qcg": {
    "date": "4/11/2014",
    "text": "Near one of my past favorite hotels on Robertson Quay, Peperoni Pizzeria has been one of my favorite places to go whenever I'm in Singapore.   I can't wait to go back again in May.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EcBIMqc1zZTY_X0Y0Kq1sg"
  },
  "D8res8aVSk9sTpMkOQ_YxA": {
    "date": "8/29/2012",
    "text": "We were really glad when Peperoni Pizzeria opened up a branch in our neck of the woods as Greenwood Ave and Binjai, their earlier outlets were a bit out of the way for us. However, it seemed we weren't the only glad ones as it's always packed to the brim when we swing by, so we could only get the XXL pizzas to go. This time, we decided to make a reservation and have a proper dinner there.We got the calamari and pancetta pizza to start while waiting for one of our friends to arrive ... the calamari was pretty decent and went well with the mayo and salsa dip provided. The pancetta pizza was pretty good except we would have preferred the egg to be runny like the one from Spizza. Love the peach and banana smoothies! We then proceeded to get the pepperoni pizza and the Amatriciana (linguini with smoky bacon & sautéed onions in zesty tomato sauce) when our friend arrived, before ending off with a tiramisu to share.Everything was pretty good for a casual pizza joint and service was pretty efficient. We'll definitely be back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nLOy8Rmg2ZGDrpOfEPxdUw",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Pepperoni pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nLOy8Rmg2ZGDrpOfEPxdUw/o.jpg"
      },
      {
        "img_id": "47U17numZgTeQI83lrQLSg",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Calamari",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/47U17numZgTeQI83lrQLSg/o.jpg"
      },
      {
        "img_id": "O5LHc6vzyT2dA59zflzfRw",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore. Pancetta pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O5LHc6vzyT2dA59zflzfRw/o.jpg"
      }
    ],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "j7YTofYFY1Hplckk0lHhKQ": {
    "date": "3/11/2015",
    "text": "I've only lived in SG a year and a half, but to date, this is easily the best pizza I've found on this island. I've tried a number of their pizzas, and they never fail to hit the spot. All they need to do now is open a location closer to me.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "yVx0rLOJHIyPo_Uz0fV9tg"
  },
  "PUgk68Jy_pQ3A0p8E5RfLg": {
    "date": "10/17/2015",
    "text": "very good pizza and calamari.delivered fast. and take credit card on the phone for delivery.will go back",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y24jb9BKFgxU5L2OZKI6_w"
  },
  "MkJrCGiPEIoJn1Gw2gwcOw": {
    "date": "1/9/2013",
    "text": "I LIKE this place.Peperoni is comfortable, unpretentious and welcoming.  Its location in the old walkup apartments across Great World City is convenient whilst retaining a more charming and private vibe than the shopping centre eateries.Naturally, Peperoni is best known for their pizzas, which are very good.  Thin crust with the right amount of bite, and generous toppings.  They've got the classic types of pizza covered, as well as some more unusual varieties.  The XXL pizza is always visually impressive and a fun challenge for larger groups.Though I might actually like the pastas better...  Like the pizzas, they're cooked precisely, done al dente.  Sauces are flavourful and portions generous.  Fantastic comfort food.Prices pretty reasonable too (20ish for pasta. sub-30 for meat-based mains) particularly when you consider that it's part of the Les Amis group.Definitely recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qvVaHr04qHp-iooOBzJk3A"
  },
  "Yc_AXZHj9uHnnKJYAblGzg": {
    "date": "10/21/2012",
    "text": "A friend of mine recommended this place to me brought me over to try it out. Firstly is the ambience, this place has a nice and homy with a nice touch of italian design which I do enjoy a lot. Secondly which is the most important is the food, I had their carbonara and my main course which was a good but the sauce was too thick for me (might be just me) but it taste great. I love this one dish which I could not remember, it is a large fried mushroom with chicken on top which was excellent and am craving for again up to this point. Highly recommended from couples, family and groups of friends.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-hA5h1gPHAvRuKEjJIJfbw",
        "caption": "Photo of Peperoni Pizzeria - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-hA5h1gPHAvRuKEjJIJfbw/o.jpg"
      }
    ],
    "user_id": "YgIQamlfZBHoeCjANSUdxQ"
  },
  "QN4ArtMk9bpR31ryDB-IOQ": {
    "date": "9/9/2012",
    "text": "Awesome pizza that's for sure! It's a family friendly place and going there with friends was just the thing. Fresh ingredients, generous too! Had pepperoni one of course and oh the beers to choose from. That's the kicker for me!Loved the German beers, we all had a go at different favourites. The staff was friendly and the place was lively. Awesome place for group outings!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKY29o3cqaQYcFdR_bZdg"
  },
  "M4VeN0FKXu3q5nSh6ayyoA": {
    "date": "8/30/2012",
    "text": "As fans of the original restaurant on Greenwood Ave, it seemed only right to visit the newest kid, if only to see if it was going to be any good.Thank goodness it was. My motley crew of uni friends demolished a \"family-size\" pizza, as per our usual habits, and we are proud to report that they've kept standards high here. Birthday Boy Gus even got a dessert on the house, so happy faces (and bellies) all around.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "kD2yJuoRb6U78lv-HbLCEg": {
    "date": "9/6/2012",
    "text": "I really love their pizza as the crust is super thin and crispy with good variety of toppings.I hate pizza with thick crust which made me feel that am eating a lot of flour. Their pizza is also well known for their XXL size Pizzas which is perfect to share with friends. Well, it is also a nice place to chill in with friends which I usually did.The staffs there are very friendly and pay attention to our requests even when the place is crowded.And while waiting for the food, they also placed a cup of crayons for you to doodle on their paper laid table. I will recommend for the salmon pizza which is really good and served in large portion. A must have when I'm having my meal there is the tiramisu. Well. There's only one thing I don't like which is the location as it is not easy to find and not bus-friendly.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k4B4gZFiZscBR9yFFUsc6Q"
  },
  "dxt7Jc4BS-vPZRjgOtFntw": {
    "date": "9/2/2014",
    "text": "Pharma ham lacks aroma, so does the Arugula leaves; the mildly spicy sensation in your mouth is nearly non-existent! Feeling very cheated and disappointed. Definitely nowhere close to what I get from Mozza in MBS. Furthermore, the cheese used in thePepperoni pizza tasted like powdered Parmesan cheese melted at high temperature to cover the surface of the pizza. You definitely get what you pay for at this kind of pretending-to-be Italian restaurant in Singapore. Guess the reviews on Yelp should be taken with a pinch of salt sometimes.......",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wd-gPbPNdo34CHSbrBeUZg"
  },
  "IKvnM-gsv_i1_pdk9rK0ew": {
    "date": "10/24/2013",
    "text": "Honestly I feel that the food here pretty much taste the same. I ordered 3 different types of pasta and they taste similar, just salty. Wouldn't come back if you ask me.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-UOFKjZ1cdCiym6H3BrshQ"
  },
  "kHk2NyvxnZb_Js90QtnVIA": {
    "date": "1/3/2014",
    "text": "I didn't come here for skinny pizza. That's a different restaurant. This place used to have great pizza. What happened guys? You seem to be cutting corners, thinning the pizza base similar to slice of paper, adding little cheese, and burning the pie. On a positive note, this is the catalyst to get me to try new pizza places around the corner. Peperoni, I wish you well in your future endeavors... good luck...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9WW7DSHEtp7uNfndhrYjQ"
  }
}