{
  "YLLUFQw3eazcWv1pZSGzRQ": {
    "date": "6/10/2018",
    "text": "Open 24/7, this is the premier place for Indian/Pakistani and halal food in Singapore. Accessible near \"Beauty World\" MRT. I recommend the butter naan, butter chicken, and date shake. (June 2018)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lsar8pko4Rlkm-qkN1Phww",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lsar8pko4Rlkm-qkN1Phww/o.jpg"
      }
    ],
    "user_id": "WwTYfD8TysD1isAEhSEOoA"
  },
  "0xrJW_eOu812ZlgFgFTA5Q": {
    "date": "3/20/2017",
    "text": "This is a weird review because I'm going to rip this place to pieces.....but will go back to eat. To say this place is chaotic would be putting it mildly. Staff have no idea what's going on, get orders wrong, forget things, ignore you etc. Kitchen screws up orders just as often, tables who arrive 15mins after us get their food (i.e.  The same dish ordered) 10mins before we do. Complaints and protests are brushed off, greeted with a head scratch, or ignored completely. In other words, if you enjoy the pain of being rectally probed with a broomstick that has fire ants crawling all over it and would pay money for the privilege, then come here. I personally don't like that very much, but I do enjoy a good naan and curry once in a while, so will come back here (where the food is actually rather good!) at a less chaotic time of the day. You have been warned....",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "32qrLiaH5c6uTd3NJpSLyg": {
    "date": "12/31/2015",
    "text": "Note: this is not really a food based review as I only had 1 plain prata and Bandung drink. Considering the size of the menu, the review of a plain prata won't do justice to the entire shop.That being said, the prata is ok-ish. It is not the crispy type, but it is also rather tough to eat. I had to use my spoon to cut the prata ($1 for 1 plain) into smaller sized pieces. The curry provided to go with the prata was simply spicy and had no \"deep favour\". Al azhar offers a very casual ambience and you can sit there with your friends and chit chat. It might be a tad noisy for some but I enjoyed the lively atmosphere.However, since it's so crowded and popular, there seems to be not enough staff, so you might feel that service isn't very stellar. For instance, I had to spend at least 1,2 minutes just to get the attention of a waiter, and they mistook our orders about 3 times (there was 7 of us)But parking is ample and nearby, and with the recent Beauty World MRT opened near it, this place has become even more accessible.Still an ok place to come if you want supper into the 2am time period.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLBVA6fOq5CTWuSqOcofpA"
  },
  "Aq6e8b8h7I7NjsK2LNzABQ": {
    "date": "4/12/2016",
    "text": "I've been transferred to a new site recently, the site office is not yet ready so we are currently stationed at our companies head office here in upper Bukit Timah. Me and my colleague came here for lunch. Most of us crave Malay/indian food so we decided to eat here. The place is big (it occupied two units) and well ventilated. You won't have difficulty looking for a place to sit even on rush hour. You can order at the counter, wherein you'll have your food right-away or look at their menu and be serve. I want indian food so i ordered from their menu. I have prata, buttered chicken and pineapple juice (i'm suppose to order teh tahrik  but its already hot outside so i opted for a cold drink). The food is good but it took them a long time before serving it. I would have given them a 4star but the slow service is a minus point.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "E3IKZo-qeJSRFVMYKvLu4Q"
  },
  "k5VTDRxSnWJGYWqHzo0xfw": {
    "date": "5/20/2015",
    "text": "They really have a wide range of dishes served here. From Indian (prata, chapati, naan, thosai, uttapam), to your carbo rich dishes like nasi goreng/pattaya, mee/maggi goreng, to ala muslim dishes, to even Western food like steak! For this area I guess the food is pretty reasonable (just that I find the drinks are not cheap $1.80 for a teh tarik i can easily get for a dollar elsewhere)I had the teh cham/yuanyang, a mutton chapati which really looked like a burrito/popiah and butter naan. I started with the naan. Having gone to India and tried it there, I have high expectations of it. The butter melted on the surface of the bread and it tasted okay at the first bite. However, the texture is more of the crispy side and not soft and fluffy like it is usually is in the Indian version. It's also a little thin and burnt and the butter could have permeated the dough more evenly. I give it a 2.5 over 5.0The chapati looked puny and quite miserable, but it was actually quite good. The mutton had a rich flavor, was soft and chewy when you sink your teeth in it. And had onions and a sweet gravy. Yum!There's a narrow alley in front of Cheong Chin Nam Road which you can parallel park and it's free after 10pm. If you are using Nets Flashpay, you need to spend a minimum of $10",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OqIBdIWd-vk-rXIqX5XWYw",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore. Mutton chapati has become a burrito. Tastes good though",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OqIBdIWd-vk-rXIqX5XWYw/o.jpg"
      }
    ],
    "user_id": "vua8-Q3D8KmrxZ7yNL3PeA"
  },
  "NjKFVyKquLKj5l-1gksLxg": {
    "date": "7/16/2014",
    "text": "I've been here a couple of times for lunch and because I come with colleagues as a group of five,  we often get a couple of naans to share, with a few curries. They do decent naans - get the garlic and onion ones. I'm not a fan of the butter naans and the cheese ones, but my colleagues like them. The cheese ones I've seen tend to have more cheese than dough, be warned!We like the palak paneer,  egg curry, mutton vindaloo, chicken masala. Drinks here are hit or miss, as they have a wide, wide range of drinks. My advice is to stick to the mainstream drinks. We eat here a fair bit and we average 10$ per person,  but that's because we eat a lot. Affordable food, don't be fussy.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "HVq68dywty4MXWWSlt9i9g": {
    "date": "1/26/2015",
    "text": "My friend had a craving for Indian dishes and she was wondering where to eat as she had to rush back to meet one of her friends.Reached the nearby parking lot at around 9.15pm and saw a few LTA enforcers giving summon tickets to some cars. Since after 10pm, parking will be free, I tore out the parking coupons and placed them on top of the dashboard.When I first reached this open-concept dining area, I was amazed as its size was double or almost triple from previous experiences. I remember my friends will hang out at this place when we were much younger and chit chat.Even though there were a lot of people dining in when we arrived, we were given a seat next to the cashier. Pictures of food are all around this store and we were also given a menu where it has more varieties of the food they served.My friend and I agreed on getting the plain Thosai and beef soup. For the drinks, we decided to go for fresh lime juices. The dishes come pretty fast even though there were quite a number of tables who are waiting for their food to arrive. The plain Thosai came with a few other sauces (not sure which is which). The Thosai was crispy and thin. All I could say is that I was addicted to it after a few bites with and without the sauces. It was quite big too and I am glad that we shared as I had my dinner a few hours prior to coming here. The beef soup came with quite a generous portion of sliced beef. The soup tasted like Tom Yum but was much spicier with the chill padi or pepper that was added to the soup. It was like a combination of Vietnamese pho without the rice vermicelli and Thai's Tom Yum soup without seafood. We ordered the $7 worth and there were at least 7 sliced beef in it. Worth it. We decided to go for another round of plain naan. The plain naan looks big but we were able to finish consuming it and had to go another round of garlic naan. I prefer the plain naan. After ordering the dish, I realized that this place served quite a bit of different types of pratas/naans/thosais, etc.Price wise, it is reasonable price. You have to actually walk to the cashier and let them know your table number before proceeding to payment. Will definitely be back soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MHDM-rEB_JlfQQRIQGwfYw",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore. Al-azhar Martabak :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MHDM-rEB_JlfQQRIQGwfYw/o.jpg"
      },
      {
        "img_id": "YRJKVw2IZ1e9cG3h8z1CjA",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore. Plain Thosai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YRJKVw2IZ1e9cG3h8z1CjA/o.jpg"
      }
    ],
    "user_id": "Qr-WoW6Vye4aH3I-YZ2ZyQ"
  },
  "45CYIahEpDS8DvT_jN87Bg": {
    "date": "11/17/2015",
    "text": "It's the current go-to place for malay eats in the west. Along the Chun Tin Road stretch, Al-Ameen used to be the hangout a decade ago, occupying at least three shop lots at its peak! Now, I'd prefer Al-Azhar. I'll usually have the Mutton Chop and Teh Halia. The mutton chop is kind of gratifying, while the Teh Halia tends to be sweet for my taste most of the time. It's a pity that there needs to be a minimum spend before you can pay by NETS - but for a muslim \"ze-char\" I can't ask for more...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YdW7DZzg7YCaxn5YUCarTA"
  },
  "an4zF0oOYQ14WSzwNAblCw": {
    "date": "7/5/2016",
    "text": "Indian food here is not bad and the price is reasonable. We ordered a plain naan, a garlic naan, a veg curry and 2x ginger lime. It was very crowded, at 10:00pm, it's a nice place to have a night snack.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lkq9AKAB2buesLDAS-uM2w"
  },
  "8VpJdpLBohCtrnGQhe5raA": {
    "date": "7/31/2014",
    "text": "I came here a few times during my latest visit to the wonderful country of Singapore. It was actually the first stop that my relatives took me too when I landed past midnight because it stays open quite late...even on weekdays! I really enjoyed all the meals that I had here, and I think that's because 1) I was really hungry and 2) they feature a variety of different cuisines that embody the food and culture of Singapore. They serve many different types of Singaporean style dishes...so you will definitely find something on the menu that will satisfy whatever it is you feel like eating.I think the first visit I came here I tried the Thai fried rice, the butter chicken, as well as some paratha and cheese naan. I think I also sampled some mee goreng too. I have to say that each bite made me more happy than the last, and even as I type up this review my mouth is watering thinking about the food from here! The butter chicken and the cheese naan are definitely things that are to be recommended from this place! The second time I tried the gobi manchurian, which was also delicious as I expected it to be. Gobi manchurian is a type of Indo-Chinese dish, and consists of fried cauliflower topped with a tasty glaze/gravy...I would recommend trying it. I also tried the dosas that they had and they were also delicious! I think that the only downside is that it's quite hot here because it's an outdoor eating area, so it takes some getting used to especially if you are not a local. The menus might also seem to be a bit old and used so it doesn't appear to be the cleanest place, but we had no problems with sanitation in terms of our food. I will definitely make it back here again during my next visit! The servers are all very friendly as well, and take your order electronically, so this decreases error by a lot. It's not fine dining, but it's good!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WdE8eWEeZ7aYcnR8kf6u8A"
  },
  "zsFZV9rM-U-O6Zt8b4S-_w": {
    "date": "1/26/2013",
    "text": "I had high hopes! I used to come here, but I guess it was mostly for prata. Tried the thosai the other day and was somewhat disappointed. The thosai wasn't as crisp/thin as I would've liked, the sauces were okay. Lentil curry was pretty gd!Soursop juice was pretty gd, a bit sweet though. Really fast service (this was after 1pm on a weekday).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NOGeHy6KoGRISx12NKNlHw",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore. Lacklustre thosai ($1.20)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NOGeHy6KoGRISx12NKNlHw/o.jpg"
      }
    ],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "lUgKycYld9QrNC3kJ_yy4w": {
    "date": "8/16/2012",
    "text": "Al Azhar, which I was told means 'the most glorious', is one of the most popular eating houses along the Cheong Chin Nam stretch. There is no surprise why this place is popular- their menu is extensive, and contrary to common misconception, not at all limited by the Halal requirement. Apart from good (indian) muslim food, they also serve everything ranging from chinese to thai to western. Definitely a supper to-go when you are meeting up with indecisive friends wanting to have different food.Service here is super efficient. Orders are taken by a palm devices/pdas, waiting time for food is usually short and there is hardly a queue at the cashier counters. The waitstaff here are also very diligent, and you will hardly experience any problem with getting their attention.I really enjoy their mee soup (just yellow noodles in clear soup). The broth is flavorful (especially late into the day), they are generous with the seafood, and its just about satisfying and light enough for a good late night snack. On days when I'm feeling hungrier I will opt for their nasi mui fan, basically rice drenched in thick soupy gravy. The chicken chop with mushroom sauce is also pretty decent, and especially satisfying if you have a protein craving. In general, the food quality is at the very least pretty satisfactory.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jB14kZT-bd9VCfTp8skYgw",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jB14kZT-bd9VCfTp8skYgw/o.jpg"
      }
    ],
    "user_id": "W9zo-15IyloXhPeO78Myjg"
  },
  "1_shgZ2Hgv8lKMcKMJ7UkQ": {
    "date": "8/26/2012",
    "text": "This has been one of my favorite places for supper for a very long time.The place is also full of paper at all times, and the boisterous atmosphere always makes it a great place to hang out with friends (and talk really loudly :P).Anyway, this place sells a huge variety of food, you will be amazed at the sheer size of the menu. One of my favorite dishes around here is the chicken tikka, which just tastes absolutely amazing. The butter naan here is also worth a good mention, and it was fluffy and tasted great. The chicken itself, in particular, was really well-cooked and I found that it was very succulent and tender.When I come here, I must always order the mutton soup. The soup here is devilishly spicy and the meat portions, although quite little, are really delicious. The prices at this place is somewhat on the high side, but that is made up for by the high quality of the food here. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cur67PdFoFmsqwalmjQbHA",
        "caption": "Photo of Al-Azhar Eating Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cur67PdFoFmsqwalmjQbHA/o.jpg"
      }
    ],
    "user_id": "Wnjh_5SaxBDNZ0YUux8m1w"
  },
  "YWGlHG7sZIz40WqE8mjeyg": {
    "date": "7/23/2012",
    "text": "I used to work in the offices opposite and this is one of the places which i come most often for lunch. I have never seen such a wide variety of malay food under one roof. They have run of the mill pratas, nasi padang, satay, seafood, all the different malay mees(mee siam, mee rebus). All the foods range from decent to fantastic. When i go in the morning, i usually eat the me rebus which is very good. Good balance, not too sweet. I eat it with a bagadil, which is a potato cutlet. It goes well with the remaining gravy. They also do a pretty good thosai, try the paper masala. For lunch I go straight for the nasi padang and pick the dishes. I love their sambal goreng, and their rendang. They also have this deep fried bitter gourd fritters, which are very very good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmDQrAExEkqwqni0e_WEIw"
  },
  "qcApth8EYyb2gMt7voMX1w": {
    "date": "3/19/2015",
    "text": "I shall be honest here, the food is so so, took very long to serve and honestly I feel it's a little unhygienic.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5KQqtzqJ9qlOcZVITx7q3g"
  },
  "nPU2qdVkbC09-09O_OPX_Q": {
    "date": "5/13/2014",
    "text": "If this weren't so close to home and open 24 hours, I don't think I would come here. As it is, they charge pretty high prices, and the prata is not crispy. Convenience is their main selling point, unfortunately. I cannot comment on their nasi padang-type dishes, but their mee goreng is not very good either, so perhaps you should follow the other reviews in ordering chicken, etc. I've also had their murtabak and while the portion was large, it was $6! and not very good either. Their drinks, e.g. teh and kopi, are normal but that's just a baseline expectation. I'm sad because it used to be better! Perhaps lack of business and the constant construction, right next to them, has started a vicious cycle. Will have to update once the MRT station is complete, if they are still around, although they've managed to survive for many, many years!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AQD1EJMHV42TM-mXyIXGjg"
  },
  "_9cFBX1QPS1RTh2hu2BxRw": {
    "date": "7/23/2013",
    "text": "Al-Azhar can be found in the Woodlands Ramadan bazaar, which I went to last weekend. There was a really long queue snaking round the stall, the smell of the food hanging deliciously in the air.  My mom bought 2 each of nasi Bryani and mi Hun Bryani- the latter is her favorite of the stall's for many years- and 'sup tulang merah'. The lamb rendang was my dad's fist-sized piece of moist and thoroughly-spiced meat. I was happy eating just the rice though; the fattest and non-oilest Bryani I've ever had. Anyone looking for a really good Bryani must try Al-Azhar's. I swear it is the best Bryani I've eaten.  The sup tulang merah is so delicious and a beautiful red. The lamb is so soft, tearing easily off the bone. Also one of the best sup tulang merah I've had. It's not soupy, it's more like a stew, and the portions are generous.  Lastly, the mi Hun Bryani, bee hoon fried in Bryani spices and at Al-Azhar, a little bit of minced meat. The orange colour looked very appetizing, not oily at all. My mom is not disappointed, neither am I.  Don't get a shock seeing the long queue at the bazaar, because it is worth the wait. Expect to have sore fingers from carrying the food! ;)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jH-ErR4rQ-aE31vFBgH2eA"
  }
}