{
  "QkouoLL_7D-89S4PN_6wGQ": {
    "date": "8/5/2018",
    "text": "Beef ball is good! Try the beef combo pho. The spicy beef soup is a little too spicy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TbFxxnEMXRIazJVy4PsbUg",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TbFxxnEMXRIazJVy4PsbUg/o.jpg"
      }
    ],
    "user_id": "iwMRD1d7f5t2fSkC4xLmHg"
  },
  "G4u2j9wx-xukkzCqyfjp_Q": {
    "date": "3/9/2018",
    "text": "Egg noodle with prawns and spare rib- delicious! There was no queue and everyone enjoyed their meals. They lost a star because they don't provide water- even if you purchase other drinks. They only sell bottled water.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giFcAr3cGw96zlMR3uP-Vg"
  },
  "Eni02u6V05Kam5VKyIyPhA": {
    "date": "10/13/2016",
    "text": "Egg noodles with prawns and pork rib ($11) - 3.5 starsLoved the crunchy texture of the noodles and the pork rib was well done. However the three prawns that came with it (I could only stomach two) tasted fishy and not fresh. Gross. Portion is also small and didn't taste very authentic. Also, I don't know of an actual Vietnamese dish that looks like this so perhaps I'm ignorant.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "hWgywpkF54bfSLr7-vrObg": {
    "date": "7/2/2016",
    "text": "Banh mi is an amazing sandwich... Now I have had my fair share of sandwiches and growing up in New Zealand I have eaten them from breakfast to dinner But when you have bahn mi, you get to taste a lot more than just mayo and pickles.Bahn mi is all about the flavors and spices. This place has them, they're run by Vietnamese people and the place is quite at first but then gets lively when that 10 am hits as Singapore starts their day around then.I grabbed the sambal chicken which had chicken cooked in sambal or CHILLI. It's amazing what spice can do to a dish and this place has it. I can't wait to have some pho as that is hard to get as well in the shore in New Zealand !!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RTtAN8Xk--QOtC42mH-J9w",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RTtAN8Xk--QOtC42mH-J9w/o.jpg"
      }
    ],
    "user_id": "6sfst9iiSjl5cB4P5ijtbg"
  },
  "ze7qfpRN3vxhZe-ZPwpaNg": {
    "date": "11/13/2014",
    "text": "Have been seeing Nam Nam with ridiculously long queues but finally had the chance to try it at PS (yes, slow, I know).Not sure what to expect but everyone knows how hard it is to find good Vietnamese food in Singapore. I must say I was please tot surprised! The soup was nice and delicate and everything tasted fresh and crisp, the way Vietnamese food should be. The Spring Roll's skin was a little bit starchy as compared to others I've tried but the Pho was delicious! Over the course of 2 visits, we tried the beef slices, pork ball, beef ball and mixed beef. The beef balls were a little touched than your average beef ball, and the beef slices were lacking that fat content, making it turn hard and dry very quickly, however, the pork balls are to die for! We even had the chance to try their friend banana with coconut cream and that was lovely as well. It's a good casual place for a reasonably price bite in orchard (sandwiches at $6.90 and Pho's starting at $9.90).The only setback about the place was the service. Staff were a little rude and the last at the cashier always gave this \"matter-of-fact-ly\" tone, while they had no idea which direction they wanted customers to queue to pay. Was a bit chaotic at the entrance while customers who are there for the first time, aren't sure if they should order and pay before being seated or after as the queue to be seated, leads straight to the cashier. However, despite the service, the food comes out at a decent place and it's a great place to grab lunch as their lunches come with a free drink, which is great for a simple yet tasty lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "TKBR90HWwWUxNx6sjUSECA",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TKBR90HWwWUxNx6sjUSECA/o.jpg"
      },
      {
        "img_id": "Ea0GVNGRz_SOcGtacKP79Q",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ea0GVNGRz_SOcGtacKP79Q/o.jpg"
      },
      {
        "img_id": "_pl9DoZcsTFvABYEvlv3cw",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_pl9DoZcsTFvABYEvlv3cw/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "shHGAlQLrNYUxnEt0BUGMA": {
    "date": "12/12/2015",
    "text": "I always have a thing or two for Vietnamese noodles - one of my favourites in my list. This restaurant always catch my attention whenever I enter the entrance or the extended building. I have been here a couple of times, but to be honest I haven't been convinced by the quality of the noodles and soup. On this trip, I ordered the beef combination beef clear noodles and it cost $11. Don't be misled by the size of the bowl, it looks huge but when I saw the portion of the noodles, I was disappointed and left shaking my head especially to my friend who was as bewildered as me. The noodles and soup are average, I taste better ones at food courts and at a lower price, so my overall experience was a disappointing one and not to mention the meal was hardly filling. Perhaps 1/2 full? My friend ordered the sandwich and it looks small but he found it to be nice. As for the service, it was slow, perhaps short-handed. To order your meal, you have to go to pay first before your food comes. For this part they get points for it as the food was served quite fast. Overall, I am not in a hurry to come back here, there are other better Vietnamese food outlets out there I feel.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m5d0sBRlV0AHC4YDS-JXsg",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m5d0sBRlV0AHC4YDS-JXsg/o.jpg"
      },
      {
        "img_id": "oMZ3eA3uBaoxCpsm-1A36Q",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore. Beef combination noodles - $11",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oMZ3eA3uBaoxCpsm-1A36Q/o.jpg"
      }
    ],
    "user_id": "Vtdm-QpN5yYxT-O00cuqFg"
  },
  "X4khZt2Jy6EpSDO9KVU6zA": {
    "date": "6/9/2014",
    "text": "Nam Nam will never be my first choice for Vietnamese food, but in Singapore, beggars can't be choosers. The great thing about Nam Nam is it's convenience:. It has two locations in Orchard and another one in City Hall. I usually order the beef pho and/or chicken meatball baguette. I say and/or because I would order the beef pho and then take out chicken meatball baguette for dinner :P I like the beef pho broth here bc they add cinnamon so there's an extra kick of flavor. The noodles are usually too soft and I always have to request for extra mint, but overall, not bad pho for Singapore! As for the chicken meatball baguette, the pate is chicken pate. So, ask for extra! This particular branch isn't bad and is quite roomier than the Wheelock one. So I suggest popping by this branch during peak hours as opposed to the one at Wheelock. Tip: If you're doing takeaway, make sure you tell the staff. Take away orders get to jump the queue. Do note, they charge an extra 50 cents per each item for takeaway.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3wFB5HmMpbg3gFYeFkotTQ",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3wFB5HmMpbg3gFYeFkotTQ/o.jpg"
      }
    ],
    "user_id": "3g_vgaCNlvR5uKmUkSz8Rw"
  },
  "uxludyMQBDzqwushlel0lA": {
    "date": "2/21/2015",
    "text": "Order at cash desk and pay directly. Cash and credit card works. Staff is neural to customers - neither overly friendly nor rude, mostly preoccupied with cleaning and serving the dishes.Food arrives rather quick after paying at the cash desk. My pho was okay but nothing fancy. Asked for extra herbs and bean sprouts - still trying to find them in my bowl... The iced jade tea needed a lot of sugar before it was drinkable.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HQPk3HzuFtxcqqkR4r4v6A",
        "caption": "Photo of Namnam Noodle Bar - Singapore, Singapore. Chicken pho and iced lotus tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HQPk3HzuFtxcqqkR4r4v6A/o.jpg"
      }
    ],
    "user_id": "AGNC1JghSlODc4K8lA8wow"
  },
  "PLr0DTRtTXmPZAenZxgcUg": {
    "date": "2/13/2016",
    "text": "This place was alright. The Pho beef noodle soup I had was good. The broth one of the best I have tasted in Singapore after a bit of searching. Don't expect any service or direction from the staff. It was all very confusing. I suddenly realised I had to fill out a form for my food. This is fine as long as there is some sort of direction to do so.Also the place also seemed slightly unclean with fruit flies buzzing around.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mE_9VmYIoUrf78R2decIQ"
  },
  "P7Wr5zo2jpT-su2zexHejw": {
    "date": "2/4/2015",
    "text": "OK - for being relatively close to Vietnam, I've had some very mediocre Vietnamese food in Singapore.  I admit I have yet to visit the country, but after dining at Vietnamese restaurants in the States, Namnam left me puzzled.  For starters, the system was annoying.  You get seated first, only to immediately go back to the cashier for your order.  Second, the pho did not come with any of the usual toppings like basil, bean sprouts, or peppers.  The noodles were also quite different - thicker, and the portion was small with little meat.   Still hungry, I then ordered a bahn mi, which was marginally better.  While the pork was decent, the texture was mushy and I could really use some mayo rather than cream cheese.  The bread, however, was delightful - perfect for the sandwich.  The place was packed and popular at lunch, but for me personally, it fails to deliver.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "YpCSdVc3FTsb_1O-wnaC1g": {
    "date": "7/17/2015",
    "text": "Been to this chain noodle bar many times before. Although there's slight taste difference between outlets, they're generally consistent. Love the clear soup and generous use of herbs. Keeps us coming back, and most importantly pocket-friendly, especially with the passion card 15% discount. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mhAocrTEzYlMAke_BFd1NQ"
  }
}