{
  "bMgnpiJ4ol3HDKFMs92-DQ": {
    "date": "8/13/2012",
    "text": "This was an unexpectedly pleasant place for a lazy sunday brunch. Along a stretch of Robertson Quay that's better known for coming to life at night.My fiance and I have a standard brunch habit - we almost always order salmon poached eggs and pancakes. They didn't have salmon and poached eggs in their menu but I requested that the eggs benedict be replaced with a salmon and they accommodated it just fine, no need to pay extra, etc. Just for kicks, we also ordered the huevos rancheros - that's what mexicans have for brunch and its made of scrambled eggs, refried beans, salsa, avocado and crispy tortillas. The avocados needed abit of salt but otherwise I really enjoyed this dish! Just dump everything on the crispy tortilla and enjoy the mini mexican party in your mouth. The poached eggs and salmon were scrumptious and satisfying. The pancakes were generous but we've had better. Overall, we left as happy campers and all set for the rest of the lazy sunday...Final verdict: Just like a boomerang, I'll definitely be back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BfGaLB2oyXwtskhzXRvvsg",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. boomarang",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BfGaLB2oyXwtskhzXRvvsg/o.jpg"
      },
      {
        "img_id": "orJuqP30z0fn-yhhfbnpMg",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. delicious potatoes, boomarang",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/orJuqP30z0fn-yhhfbnpMg/o.jpg"
      },
      {
        "img_id": "Khs7NqYbl6uv7LUV8wBE1w",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. mexican brunch, boomarang",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Khs7NqYbl6uv7LUV8wBE1w/o.jpg"
      }
    ],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "r79hDMo6vV9yCQaCG_3mAg": {
    "date": "5/4/2014",
    "text": "If you are an AFL footy fan, the Boomerang Bars show AFL on the big-screen, in two locations: (1) Boat Quay (right next to Raffles Place ie the CBD if you area-get off at the Raffles Place MRT station) ; and (2) Robertson Quay as well,",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqbS--hnMESOXSV_quMziA"
  },
  "6v7djO-MrqHBROeQSbGY7w": {
    "date": "8/23/2012",
    "text": "I ate here for dinner one night and it was pretty decent. Not a place I would come back to though, as there are better places around the River Valley area in my opinion. I had the calamari and the mezze platter which was good enough but nothing fantastic. A bit overpriced actually I thought, for the quality of the food. The crowd is mainly expats, lots of Aussies and people who live around the area. Its a nice enough ambience, overlooking the river.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "cuYPgmSkbTWcjLNr23DSPQ": {
    "date": "9/14/2013",
    "text": "Extremely disappointed by an interaction with Assistant Restaurant Manager Janice Cunanan. Although we were promised American football coverage for a specific window of time (via email and phone conversations days in advance), the channel was changed 15 minutes early, causing us to miss the winning touchdown (which was scored about 5 minutes after Janice changed the channel). VERY disappointed in how the situation was handled.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lcYSBdIeE3QcXmacz5uxXg"
  },
  "OwV7Ja7cTPGa0wVzWc23BQ": {
    "date": "5/14/2013",
    "text": "Good pizza. Plenty of hubbub, even during weekend brunches. Trivia nights on Tuesdays are alright. Do not love the sports streaming constantly on the TVs.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zWvA1Zc4sRv0DuDJb9g32Q"
  },
  "6FL8p-7g7Jp1zfgpyTGxZg": {
    "date": "1/26/2018",
    "text": "Feeling homesick travelling thru Asia? Drop by this iconic Aussie place right on the river in Singapore and you will feel at home. Great music, Aussie beers at reasonable prices and good tucker.Some great traditional food -chicken parma - and some new ones with an Aussie twist.Not a fan of Roo but that is here to and made well according to the guys I was with.Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "boGCMHEUmiKQTVyhcV-Q9A",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/boGCMHEUmiKQTVyhcV-Q9A/o.jpg"
      }
    ],
    "user_id": "1VOO2rkqJv1mHuX0fTSTOg"
  },
  "QaJ-q3doeStDQHVpeO88wg": {
    "date": "4/5/2018",
    "text": "Classic (Aussie) bar food favorites. Stopped by on the way back to my nearby hotel. Ordered the grilled chicken with bacon sandwich (added avocado) and a Caesar salad. The chicken was a bit overcooked and tough, while the Caesar dressing was a bit dull. They have all the comfort foods and a great spot outside, but keep your level of expectations at bar food and drinks.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0TJQ3NHXFmisVkxc03ZsnA",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. Grilled chicken sandwich with bacon and added avocado",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0TJQ3NHXFmisVkxc03ZsnA/o.jpg"
      },
      {
        "img_id": "pZai8O3gqWVEh5zjzdpJsw",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. Caesar salad (take out)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pZai8O3gqWVEh5zjzdpJsw/o.jpg"
      }
    ],
    "user_id": "qJGVQ8uvm7KEdIsHpYAjmQ"
  },
  "UoPMeaVyOUkXeOsD3DTBZQ": {
    "date": "1/20/2018",
    "text": "I agree with most on here.  Food is nothing to write home about but prices on buckets of beer is decent. It Has a nice view of the river and outdoor seating. We would come back to share a pizza and beers. Pizza also decent. Just come knowing it's a meh but decent.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4MeyfdyeJ38A_wOKLapRMQ"
  },
  "AcO9JQS57hO5NDI8HLbsQQ": {
    "date": "7/12/2017",
    "text": "Went for lunch brunch with my family and it was a pleasant experience. Food was simple, no frills but fresh, tasty and good value for money. The coffee was also decent. Service staff was friendly and this place is very child friendly. Love it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VRwa-urIF1g30w3yTwGmrg",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. \"Bondi\" plate with added smoked salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VRwa-urIF1g30w3yTwGmrg/o.jpg"
      },
      {
        "img_id": "7oDEyUMZCMjiIHqq5VEQDw",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. 3 egg omelette with brioche and added a beef sausage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7oDEyUMZCMjiIHqq5VEQDw/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "0gGNt3bMjCw9b16zs_Bsmg": {
    "date": "4/3/2017",
    "text": "Breakfast was great. Try their pancakes as well. Service was also good. I would recommend if you are in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zuTumMcPR-ySoBNk7qtM5g",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. Breakfast at Boomerang!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zuTumMcPR-ySoBNk7qtM5g/o.jpg"
      },
      {
        "img_id": "huUwtu_X3SHdi8eqp0H5Sw",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. Breakfast at Boomerang!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/huUwtu_X3SHdi8eqp0H5Sw/o.jpg"
      },
      {
        "img_id": "wpgLykrtFHqWVsaRXY6-tw",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wpgLykrtFHqWVsaRXY6-tw/o.jpg"
      }
    ],
    "user_id": "96QyUMl7s7ysceUopvPYxA"
  },
  "yLlkqARRhVnsXgnWz0UYYQ": {
    "date": "12/18/2016",
    "text": "Convivial enough establishment, but doesn't warrant the high prices (even in the Lion City).Chicken club was pretty good, but the fries were tired. After Meggetigans and Murphys, I was astounded to see that the beer selection didn't compare, but the pints still came out highest. $14 (Singapore dollars) is crazy without a stout, much less an IPA, on tap.You can still choose to ignore all that, and come for the gentle breeze on the canal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GPOTcmGfunURQPfzcNk1A"
  },
  "sNUEDmX8Ge74P81cTLDoyw": {
    "date": "6/6/2015",
    "text": "I've given this restaurant a few shots and left feeling the same each time. The food is either bland, greasy, or the flavor and food combinations are just disagreeable.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dYuYB2sNZx9Vx1P3x5JbA"
  },
  "A3HORwDT9ZhD_-L_p1YG8g": {
    "date": "7/29/2015",
    "text": "Planned to go to Boomerang (grrr, Boomarang??)on a Friday evening. Made online reservationists just in case. Heard nothing, so made a follow up phone call and confirmed our reservations. We do not live anywhere near Robertson Quay so getting here was quite a trek. Hindsight, believe or not, should have driven.Finally get to Robertson Quay and we are dodging gobs of free range dogs and kids roaming about the area. Gobs! Clearly this is a very family friendly part of town. Show up to the restaurant on time. There is no record of our reservation. Kind of bugs me, but only kind of. The place is about half full so no big deal. We are seated. There is indoor outdoor seating, a nice sized well stocked bar area and tons of TVs playing a variety of sports. Another plus is the restaurant sits alongside the waterway and you can watch the tourist boats gliding by. Aside from the reservation snafu, service was really top notch. We ordered our food and it was out within ten minutes. The waitress was really great. She was very attentive.Our starters were the kangaroo sliders. And a side order of garlic bread. Sliders were very good. We ordered rare and they were rare. After the sliders, the rest of our dinner was okay to not good.. I ordered the fish and chips. It included a little salad. The dish was good. The fish was nicely  fried. But the plate that was used was too small so fries were constantly falling onto the table. My companion ordered the lamb. He got a much larger plate, weird, since his portion was smaller. Lamb was very tough and flavorless. We decided to pass on dessert.All in all our experience was okay. I now realize It might have been a better experience for my partner and I if we approached Boomerang as a pub and not a restaurant. So on our next visit (via cab) maybe do a Tuesday trivia, stick with the bar menu, and let loose! Hopefully darting children will be safely tucked into bed as I stumble home.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb-HKe1tQHf3NloRZ61c8Q"
  },
  "bsHiEixHqPsXOjG7jupFTQ": {
    "date": "1/2/2013",
    "text": "One of my favorite places in Singapore around Robertson Quay area.  Lots of seatings, tons of TV to watch rugby (go All Blacks!), fans (all seats are outdoor or open air) and lots of friendly people everywhere.  Why only 3 stars?  Their food needs little more improvements!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qE9-o30-M60yerRtTD9V0Q",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qE9-o30-M60yerRtTD9V0Q/o.jpg"
      }
    ],
    "user_id": "lpnPcoRGXy5N4mbkqMAjvA"
  },
  "6i8G8fHpdTAUdl0CS4p5lQ": {
    "date": "3/9/2014",
    "text": "The menu looked great, but the result was disappointing. Bruschetta on soggy flat bread instead of golden toasted bread just doesn't cut it. And the \"Aussie Steak Sandwich\" had everything in it as promised on the menu, but one sad piece of lettuce, the steak and some soft onion was a real disappointment.Thank goodness the piece of steak was tender and cooked well. Apart from that saving grace the result would be one star. Such a shame as it felt like the food was rushed and no care taken. We have eaten there before and enjoyed it much more.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BTMMefC6YszKm2LREs7bSg",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BTMMefC6YszKm2LREs7bSg/o.jpg"
      },
      {
        "img_id": "7ReVjRduLvl5xPHlHzS-rQ",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7ReVjRduLvl5xPHlHzS-rQ/o.jpg"
      }
    ],
    "user_id": "ZqVmEFD99Q-SVPaATwY4vQ"
  },
  "Jl7D5D9DdCifH_721R9TUQ": {
    "date": "9/13/2012",
    "text": "Boomarang (why they insist on spelling it incorrectly, I don't know) is one of my favorite places to come for a nice, relaxing evening. The food is good, the service is friendly, and they have happy hour. The food is a little pricey, but pretty standard for the area. But the food is very good. The Wagyu burger is pretty great, and comes with beets in it. You can add a fried egg and bacon for a bit extra. I was happy to find that the fries that came with the burger were good also. For lunch, they have a lunch special for $12. It involves a sandwich and soup which is really good. The sandwich menu changes weekly depending on what's in season and what the chef feels like making, so there's always something new to try.  Happy hour is weekdays 5pm - 8pm and weekends 2pm - 8pm. They also have some weekly events. Tuesday is trivia night. Wednesdays is beer and burger night where their great wagyu burgers + a beer is $25 and also pint night ($10 for a pint).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qq_fV6NFDnu7sKuScVS5Gg"
  },
  "HioE6jV6UtQUDaqL__yQgw": {
    "date": "5/21/2016",
    "text": "Decent morning brunch menu, with multiple options. Chose the vegetarian omelette with long black coffee and was not disappointed.  Nice ambience along the river and staff was reasonably efficient. A little hard to find for visitors, but overall a nice experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ZMdQqa5yxTEAQu9z8DFPg"
  },
  "5cIoQwD6W-ZK9Un6bixztg": {
    "date": "10/28/2014",
    "text": "Good steak. The portion is just nice to go with a vegetable side dish. We ordered a plater of grilled sausages, prawn and lamb. It was ok, nothing amazing. The price is slighly on a higher end I must say.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iOP5E-AvfZnR49crgKVAMA",
        "caption": "Photo of Boomarang Bistro & Bar - Singapore, Singapore. Beef steak, tomato salad morazzela with cheese, grill platter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iOP5E-AvfZnR49crgKVAMA/o.jpg"
      }
    ],
    "user_id": "Efzsad0UyWDj6O6ngyIwfA"
  },
  "j68oHsC_gJumNsIpP87fCg": {
    "date": "8/19/2016",
    "text": "The food here was way below my expectations.  We had the pancakes which were too thick and dry and the french toast which was way too sweet for me.  The fresh squeezed orange juice was good, hence why the review is 2 stars and not one.  I would avoid this restaurant for breakfast .",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_ivP9MrMxD5BXpY0Dhbvw"
  },
  "RZfMRAePXzvoihTsKgnIpQ": {
    "date": "5/23/2014",
    "text": "I pass by this place often but until recently have avoided this magnet for boisterous salmon-tinted overfeds reeking of beer.I finally went and was pleasantly surprised.  My husband and I went on a date and put our well-behaved kids at a table on the other side of the restaurant.  It's a good venue for decent Westernized food.  If I had endless resources and extremely high metabolism, I'd come here more often, because the atmosphere right by the river watching the Australian Football League and people watching can be fun, and the food is tasty.  However, I don't, and the food here is pricey.  It's typical bar fare priced at about $40-$50/head.  My small tumbler-sized margarita was $20.  The service is not impolite but just indifferent.Note that the kids meals are only appropriate if your children don't really eat.  They are tiny.  It's like one of those \"Where's the beef?\" commercials.  Hamburgers are sliders.  Each of my kids needed to get a whole 'nother meal after their kids meals.  Six people - I only had a salad, 4 kids meals, 2 pork cutlets, a margarita and 2 beers, 3 lava cakes = $200+ with kids leaving saying: \"We're still starving!\"",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgPgfu6KIvCMsarRczXnZA"
  },
  "GEHFRlAcSIn8nfimMXdNrw": {
    "date": "7/9/2014",
    "text": "A friend of mine wanted to hit this place up because she wanted to bring her dog out to spend the day with us. I liked how it was an out door kind of place with a good view of the Quay. It wasn't quite western so it was in line with my pact to not eat anything I can find in the US. So, when I saw that there was a Kangaroo meat pizza it was a bit intriguing. Why not? I had never had it before and the rest of the menu seemed run of the mill American esque.  It was the most disappointing thing I ate the entire trip. It was small slivers of meat on each slice. The only good thing was the buttery flakey dough. My chai latte had way too much milk. I wish the service was nicer or at least a bit more cheerful. Rather they acted like the customers were an inconvenience. Should have picked a better profession if this were the case! Eh, at least the company and conversation made the day good.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LOK4oCby0Ou46W65YMO6-w"
  },
  "mOU6hgpKWrGrF3HatqtEsA": {
    "date": "1/20/2015",
    "text": "My 'go to' place in Singapore when you do not want to miss out on any sport from back home.  Multitude of screens for watching all Australian sports live.  When not watching sport location and view over Robertsaon Quay is excellent.Food is generally good.  Last time I was there the ribs were supurb.  Only suggestion would be to introduce a better choice of boutique beers like a nice IPA!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfTEfhJXQ1XDIcMiO7HBeg"
  },
  "ic8ISk59s1wf6c_APx_79Q": {
    "date": "4/1/2013",
    "text": "Boomerang featured prominently in a list of top kid-friendly brunch spots in Singapore...Perhaps after being featured among such august company, the restaurant decided not to bother anymore, because the effort was seriously lacking at brunch one sunny, Singaporean Sunday...The harassed wait staff managed to weave around shimmying, speedy scamps while completely ignoring our requests for condiments and unapologetically refusing to replace an incorrectly entered entree.  (Frankly, I'm not sure how you justify this when you have two open face melts with the same name)...Our vegetarian friend was left staring aghast at an open face turkey melt...The only saving graces were the wonderful company and the lovely, riverfront setting...and at least my eggs were served over medium as ordered...PARTING THOUGHT: For an Australian restaurant, there weren't many Aussie options on the menu...",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ss6Fz9oK7HCOvYllxpdwEw"
  },
  "6bf03zJlOAvsRBX3NsRUXA": {
    "date": "8/13/2014",
    "text": "Very good coffee. Great atmosphere for brunch and dinner. Food generally high quality. Can be very busy but I find the staff very attentive and helpful. Nice range of dishes. Perfect spot for watching sports with some friends. Right on the river so nice ambience. I go here all the time and quality is consistent. Only reason I didn't give 5 stars is it is very very expensive. 10 bucks for a mug of coffee is nuts even for Singapore. But it is superb coffee..",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BcsJIPPBET8lJLQXR20t9w"
  },
  "X4UfrMt-QHgYQG1ZXcYCsA": {
    "date": "11/28/2013",
    "text": "An australian pub directly at the Singapore river. Happy hour from 7 to 10. And on Wednesday one of my favorites: Burger and beer, for 22 dollar. Last time I tried the Kangaroo burger. The meat is a little bit dry dispite medium doneness, but with the served topping it is really delicous. So you can sit here in nice atmosphere, watching some rugby other other sports stuff on the flatscreens and simply have a good time.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qqhzaEFZjMtK-3GTV0X0Q"
  }
}