{
  "Jzd2PfQpdEn4BxAZv6M-og": {
    "date": "10/1/2018",
    "text": "Super friendly service, good happy hour prices ($5 for a half pint). Interior is all over the place - is it a restaurant? a bar? a darts place? Menu similar - Thai, Indian, Japanese?! Could use a little focus. I guess it's part of the charm. Lots of uncles inside.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "gJT_H3xkUoJpP9OQkOZ3-A": {
    "date": "4/21/2018",
    "text": "Had a Saturday dinner at this place with a friend. Purposely came here for their special dish, pitan maki. Basically it is a sushi rolls topped with their special made century egg sauce. It is good, and I enjoyed it very much. I ordered other food like unagi kabayaki and sukiyaki beef as well. However, I would not recommend the unagi and sukiyaki, the unagi taste cheap and the sukiyaki was tasteless. They have wide spread of variety from Japanese to Thai, but lack of focus and signature food. Well, it is a good place for a beer and some snack food though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "74X1aPt4Nms2_uxjNoXiOg",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Pitan maki (century egg)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/74X1aPt4Nms2_uxjNoXiOg/o.jpg"
      },
      {
        "img_id": "YmjIbPfKRbM-fwlNa5LBAw",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Pitan maki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YmjIbPfKRbM-fwlNa5LBAw/o.jpg"
      },
      {
        "img_id": "kgWPMaecYG4Z2DgyrCUv4Q",
        "caption": "Photo of Mad Nest - Singapore, Singapore. A good dinner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kgWPMaecYG4Z2DgyrCUv4Q/o.jpg"
      }
    ],
    "user_id": "aFXnLTwv-dWdbFC-2b-kdg"
  },
  "pjNeSH-3op5phdMn7xIu-g": {
    "date": "11/29/2014",
    "text": "I remember walking into this restaurant last year with a bunch of friends, browsed the menu and then left. \"Jack of all trades, master of none\" is probably the best description of the food they are trying to do here. From THAI to JAPANESE to ASIAN-FUSION to WESTERN - we were actually tired of reading all the description in the almost 30-page thick menu. If you're here, just ask the waitress for recommendations.  Fast forward to last night, my friend suggested we go MAD NEST for dinner and trust me, I was very reluctant to go. She's into the arts and craft scene here in Singapore and apparently there is a \"Flower Exhibition\" going on at the restaurant. Little did I know that MAD NEST host art exhibition every other month and it's all displayed on their wall. For this season, its a collaboration of local florists and photographer where beautiful bouquet of flowers were created and photos were taken (think Kinfolk, Cereal style) and all the photos are on sale (if you want to buy). Coming from a photographer's point of view, the photos are pretty rad. At one corner of the restaurant, there's a display of small edible microgreens in small pots. We got to know you can be part of the \"ADOPT A PLANT\" programme where you can pay any amount you want and take back a jar (which consist of soil, seed and fertilizer you just need to water them) and grow your own plant from the jar at home! All the donation will go towards the Nature Society of Singapore. I think this is a very good initiative on sustainability. Now, moving on to food. As usual, I was totally confused and we leave it to the waitress for recommendations. Eve (the waitress) was very friendly and helpful and suggested a couple of \"best sellers\" . For starters, we ordered  fried squid with salted egg yolk and 2 temaki (sushi). The volcano hand roll was pretty good and the salted egg yolk squid decent. For mains (all shared), we ordered seafood fried rice, stir fried long beans, and steamed fish thai style. Fish was particularly good, very fresh and executed perfectly. You have to order if you happen to come. All the dishes come in medium sized portion so it's good to order a couple and share among a few people. In total, we ordered 6 items with no drinks and paid $95 total. No doubt the price is very reasonable and the food was pretty ok, I walked out of the restaurant still feeling ............. confused.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "F7x5jCbN-zlcgZf9Q6y77w",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Flower exhibition",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F7x5jCbN-zlcgZf9Q6y77w/o.jpg"
      },
      {
        "img_id": "ws351H4nKOev4yvCziPd6Q",
        "caption": "Photo of Mad Nest - Singapore, Singapore. 'ADOPT A PLANT' corner. Check it out!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ws351H4nKOev4yvCziPd6Q/o.jpg"
      },
      {
        "img_id": "Jj69ZA-iiVqbX3pj3E7E_w",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Very very good steamed fish (thai style)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jj69ZA-iiVqbX3pj3E7E_w/o.jpg"
      }
    ],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "wSnq7zfpGPOLnXAfw9rGLA": {
    "date": "9/10/2017",
    "text": "The ambience indoor is eclectic and cool. The staff always on point. The sheer variety of Indian/Japanese/Thai makes it a go to place",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "opWu8JEqJED1WxdkMq0NCQ"
  },
  "SSCQHxba8kYM8PrI_V11UQ": {
    "date": "9/1/2016",
    "text": "Been here a couple of times . Good beers. The Jap food, good couple of items, skip the ramen though. Thai and Indian food is definitely above average so do give it a go. $2 for white rice?Reckon I just cut my carbs in that case. Service, Oh the service.Let's put it this way.I stand a better chance getting hit by a car standing in the middle of the road than to get a simple glass of water the first time I ask for it. By far my record was 13mins and after 3 attempts before I decided to walk up to the bar with the glass to get water. It just get ignored the moment the wait staff acknowledge your request for water. For that, kinda struggle to give it any better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjRA4kPd-pesQf2Ki2PyYw"
  },
  "UIv_aqC3-p8n43hWaCJSTg": {
    "date": "3/7/2016",
    "text": "The food here is really good! I've been here several times and ordered from the Thai, Indian, and Japanese menus. All were really good and the sushi is outstanding.I would give them more stars if the service were better. The staff are friendly but that's where it ends. The servers have a knack for spilling drinks on you and making you ask several times for your bill before they bring it to you. It's not so bad that I would stay away though-- the food is too good and the location too convenient!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OgkKbsSyM2_SfCrQezEDog"
  },
  "jM-zwbIKYp242Y5REn3ahA": {
    "date": "9/14/2012",
    "text": "What kind of food can one find here? There's Japanese, All-Day Brunch, Italian-Asian, Northern Indian and tapas. Nice spacious indoor dining, with art pieces decorating its walls.We tried Oiishi Maki, Sashimi Moriawase San Shu, Mad Nest Wings, Mad Nest Breakfast, Old Bay Frites and Chili Crab pasta. Food was good, and the wings and fries came with their own dips. The wings were well marinated and flavourful. Oiishi maki was tasty because it had many ingredients such as avocado, unagi, salmon, tobiko in/on it. The Chili Crab sauce was refreshing, and the pasta was not undercooked. Liked the brioche in the Breakfast set. Tasty with good texture. The bacon would be better if it was crispy, or softer. Happy hour till 8pm, and a jug of Stella Artois goes for $25+. There's a mounted TV screen outside the restaurant, so diners at the al-fresco area could watch football or whatever sports that's on that day. Have seen people with pets at its outdoor seating area.Service crew are mostly young and ernest.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tlcGgCSYJ31Q630zmKSW_A",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Sashimi Moriawase San Shu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tlcGgCSYJ31Q630zmKSW_A/o.jpg"
      }
    ],
    "user_id": "SWbswbo44E_48GobGdw5Gw"
  },
  "jMmefNYQHLEPkpb7r_ofVw": {
    "date": "9/9/2012",
    "text": "Having passed by Mad Nest so many times (I live nearby), I was determined to give it a shot. I loved what they had done with the space. It's very modern and clean, with art pieces on the walls that are also for sale, and a large al fresco area. A glance at their menu proved to be rather intimidating. There's just a little too much going on in that restaurant, and I'm not sure if I want to have tapas dishes with Indian curries or sushi - just saying.In the end, I settled for trying their brunch. I arrived one early afternoon and ordered the Eggs Oscar ($16) - crabmeat and asparagus with poached eggs, cheese and hollandaise sauce with an English muffin. It was really good! I really loved the flavours that came together in that brunch dish, although I have to say, the portion was kind of small.I tried my friend's order of the smoked salmon & spinach eggs benedict ($16), but it was somewhat disappointing. There was so little salmon on it you couldn't really taste it at all.The coffee here is weak and not worth making a trip down for, if you're into coffee. On the plus side, they do have an extensive drinks menu of cocktails, shooters, liquers, whiskeys, japanese sakes, ciders, beers and wines though.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Il0i9Ipd_JZ1TkR-JHut2Q",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Eggs Oscar (crab meat with asparagus with poached eggs)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Il0i9Ipd_JZ1TkR-JHut2Q/o.jpg"
      },
      {
        "img_id": "OfC4X8oihL4qOSIzeEX_iA",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Salmon & Spinach Eggs Benedict",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OfC4X8oihL4qOSIzeEX_iA/o.jpg"
      },
      {
        "img_id": "UnjyFWSOJADwUckGEDdK3Q",
        "caption": "Photo of Mad Nest - Singapore, Singapore. Coffee was rubbish.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UnjyFWSOJADwUckGEDdK3Q/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "rEyRSw3Y3hXni5IHtgQEVw": {
    "date": "8/19/2012",
    "text": "Standing out from its neighbours, Mad Nest at East Coast is a chic bar eatery that serves up a smattering of cuisines from Northern Indian grub, Spanish tapas, Japanese fare and also brunch items. The first time we went there, we thought it was actually a Japanese restaurant, thanks to the bottles of sake on display and its décor is quite Japanese as well. The food is pretty decent and affordable, but so far, what we've seen was that more people are coming for after work drinks rather than dining. The locale is quite and parking is fairly easy, seeing as how most of the neighbours don't really draw large crowds. There's ample space, but the al fresco areas don't have any shelter so all it takes is a sudden downpour to spoil your night out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0pwvRJ8iRCU1SXAof5Kb_g",
        "caption": "Photo of Mad Nest - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0pwvRJ8iRCU1SXAof5Kb_g/o.jpg"
      },
      {
        "img_id": "FIn-wFv3cF7KJtZsJ7XstQ",
        "caption": "Photo of Mad Nest - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FIn-wFv3cF7KJtZsJ7XstQ/o.jpg"
      }
    ],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "Kd_k3Ok5nXab-MnprYZUGw": {
    "date": "10/14/2012",
    "text": "1. French toast - It came cold. Would have preferred it hot. Otherwise, it was nice. The fruit and nuts mix at the side complimented it well and the toast was thick and soft inside. - Love butter slice that came with it. The waiter said it was imported from uruguay but he failed to spell the butter's brand name correctly (he said it was spelled \"Canerbroule\" but that name had 0 hits on google - anyone knows what it's proper spelling is?) 2. Ice cappuccino- Average. Service - Good. It was rather empty when we headed there at noon on a sunday. There were only 2 tables (including us). Ambiance - Good. Only thing is that I could not get any internet reception inside the restaurant which was a bumper! I suspect it was those thick concrete walls that blocked the internet signals.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "MgfljtbdGCAriUWLZ5CVgw": {
    "date": "8/23/2012",
    "text": "If it looks like a Japanese restaurant, chances are, it is. Mad Nest however, doesn't seem to stick to that line of thought. Since we were there when they were about to close, we didn't really get a chance to try out most of their mains, just whatever they had that didn't take too long to prepare. But based on that alone, I have to say its interesting enough to make me want to come back. And with a large and spacious al fresco area that allows smoking, I've got to admit I'm quite sold on the concept of it all. Going through their menu, you'll find smattering of cuisines that range from Northern Indian, tapas, Japanese and even brunch items. Getting here is convenient and parking is just a minute's walk away. Rain however, is bad news for al fresco diners as there's no shelter at all in sight.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  }
}