{
  "nYYyBfgK1EHbkjGCyLEP9A": {
    "date": "2/5/2016",
    "text": "Hi, my name Catharina and I am a brunch addict. I find every reason a good reason to go brunching....and I think Choupinette is awesome!Reasons for giving it four stars:- Their eggs benedict are consistently good. The poached eggs is one of the better I has in Singapore so far.- Despite what previous reviews said, I like the service and good service is rare in Singapore: they are always super friendly and chatty. I must admit they sometimes forget things but they are always apologetic which I find more important.- They are located walking distance from my home (ok, I realize that this is probably not applicable for most other people so not a real argument but it counts for me, ok?)Reasons for not giving it five stars:- It is not cheap, but I don't think it is overpriced either. You pay 25++ for eggs benedict, a coffee of your choice and a juice. Other places in Singapore charge similar prices though.- The juices are not fresh, they are long life juices but I like that they offer a big selection.- They do not serve cocktails and I think a brunch is not complete without a bloody mary or a mimosa but I guess that is aligned with their French concept, however eggs benedict is not really a French dish either.This is one of the cases where I wish there was the possibility to give a half star, I would definitely give Choupinette four and a half stars!Would I go back? Yes, already have been several times! Recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JrLh1mXWDL-yOj1oWtUpqg",
        "caption": "Photo of Choupinette - Singapore, Singapore. Eggs benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JrLh1mXWDL-yOj1oWtUpqg/o.jpg"
      }
    ],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "cqLr_K0DDU-AvndiuiGHiA": {
    "date": "12/3/2016",
    "text": "Nothing really exceptional and rather expensive. Don't get me wrong, there's nothing really bad about this place, but it's not quite value for money as the set brunches are rather costly at around S$26 for coffee, juice and eggs benedict. The portions were on the small side and while the eggs were done right, the sauce was pretty much average. The coffee also really wasn't up to scratch. Final price for 2 people with tax was around $60.The interior was done to evoke the interior of a french cottage. Maybe it's just me, but the french folk music and accordion were getting on my nerves before the one hour mark. It was just too touristy and cliched. My idea of french music is two guys wearing LED helmets before getting on stage and hitting the decks...It's okay, but there are other better places to get your brunch fix.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "CoBILvq6evXtVw-DwW09Lw": {
    "date": "11/1/2015",
    "text": "Service is good. Food is delicious. Ordered the salmon egg Benny, portion is just right for one. However, space is very tight. Nice to sit around and see out the windows and while the time away, if they are not crowded. Be advise, price $$ is on the high side.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "in5m7qFrFAchUDSW1Qq2FA",
        "caption": "Photo of Choupinette - Singapore, Singapore. Salmon Egg Benny",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/in5m7qFrFAchUDSW1Qq2FA/o.jpg"
      },
      {
        "img_id": "nWOM46r6W-rUAmfbLj038w",
        "caption": "Photo of Choupinette - Singapore, Singapore. Ham sandwiches",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nWOM46r6W-rUAmfbLj038w/o.jpg"
      },
      {
        "img_id": "ybcmfSkepKuWY8W9Jmdu-g",
        "caption": "Photo of Choupinette - Singapore, Singapore. Danish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ybcmfSkepKuWY8W9Jmdu-g/o.jpg"
      }
    ],
    "user_id": "jgyImyPkliUbJuc_Gtk6Zw"
  },
  "-EVk1MdRu62c4H-3GiHZEg": {
    "date": "12/30/2016",
    "text": "My favourite place for eggs Benedict with salmon! Macarons and hot chocolate are not bad too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Mils6AfdsCgUah7jmTd1Q"
  },
  "a6Mz707d6JRExTKPnJg3uA": {
    "date": "11/22/2014",
    "text": "I heard about this place in reference to their eggs Benny - supposedly the best in Singapore. I thus ordered the smoked salmon eggs Benny while my eating mate got the regular eggs Benny. Hers were slightly better; while mine were average as far as eggs Benny go. I had a few issues with this place though; for one, the dishes are massively over-priced. In terms of value for money, you are better off going virtually anywhere else for this meal. We paid $56 for the two brunch sets. They come with a juice and either coffee, tea, or hot chocolate. I got lime and my friend got orange. Her's tasted suspiciously of the minute maid variety while my juice was terribly bitter.They also brought out our hot chocolate at the exact time as our juice so it got cold. The eggs Benny are regular sized portions, but for $26 I expect the whole nine yards. We had to ask for more hollandaise sauce, and I was unimpressed by the amount of meat they served to my friend. The seating is rather cramped, but the setting is still quaint. I liked the atmosphere but it certainly did not make up for the feeling of paying an arm and leg for only slightly above average fare. I will not be returning here on my own volition unless I am feeling particularly charitable!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2F0_P4kmnrgvS9nSf5NDOQ",
        "caption": "Photo of Choupinette - Singapore, Singapore. Smoked salmon eggs Benedict",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2F0_P4kmnrgvS9nSf5NDOQ/o.jpg"
      }
    ],
    "user_id": "qnXgtXUvHRn0L0_8SirnWw"
  },
  "pJbOM14nRxKS_ms7j43I8w": {
    "date": "5/31/2014",
    "text": "I don't think this serves the best Eggs Benedict in Singapore. But to be fair, one man's meat is another's poison. I tried both the Eggs Benedict and Eggs Royal. The Benedict did not impress me. The hollandaise sauce is so so only. The Royal is another story. The smoked salmon is nice when eaten with the bread and eggs, but too salty on its own. My photo of Eggs Benedict was labelled wrongly.We sat by the side and the sun was glaring into our eyes at 8.30 am. There's no offer to pull the day curtains to block the sun rays.We took away a quarter loaf of poilane bread. I bought it before from a shop in Dempsey Hill, was surprised they have it here too, but comes already sliced. After trying out the poilane bread, I noticed that it is not as fresh as the one I bought from Dempsey Hill.The sourdough bread is... what can I say? My search for true sourdough bread in Singapore continues.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gAkyilVVA1uQWq4Bsnnsmg",
        "caption": "Photo of Choupinette - Singapore, Singapore. \"Quarter\" loaf of poilane",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gAkyilVVA1uQWq4Bsnnsmg/o.jpg"
      },
      {
        "img_id": "HTj1vgfPbv4AqcqFZ6dvoA",
        "caption": "Photo of Choupinette - Singapore, Singapore. Sourdough bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HTj1vgfPbv4AqcqFZ6dvoA/o.jpg"
      },
      {
        "img_id": "m-aF28TttsyhS6j5jO8TVQ",
        "caption": "Photo of Choupinette - Singapore, Singapore. Small brioche",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m-aF28TttsyhS6j5jO8TVQ/o.jpg"
      }
    ],
    "user_id": "wH-yhddRO8Uc2e4kjwf1RA"
  },
  "aa66AwkEi33KhbJJcfDTBw": {
    "date": "8/8/2016",
    "text": "The food was alright. Decorations were nice. Very cozy, but a bit on the cramped side. Wait staff were not very attentive. Had to ask several times for the bill. A tad overrated as I've heard from a number of sources about how great the eggs benedict were. They were just okay. Not sure this place is worth visiting.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HXkgU0zTESSX7udfwk80jA"
  },
  "lMm1q6n0av6upWJNSseLjQ": {
    "date": "12/17/2014",
    "text": "My husband and I ordered the bennies from here. Mine was with the salmon. His was with the ham. When the order came, we shared and compared the bennies. I prefer the salmon. He prefers the ham. We visited this place because of all the reviews that said it has the best bennies in town. I can probably agree with that since all the eggs were nicely done. Based on the reviews, they probably are consistent with this. I can't say much until my next visit (if I do go back).One reason that will make me think twice before going back is the price. It is a little bit too steep compared to other places that serve similar items.  My husband couldn't get over the fact that we need to order the 'set meal' that comes with a juice (not freshly squeezed) and tea/coffee. The set costs about $26- and if i remember correctly, it's before GST and service. The wait staff also forgot to bring us the juice so we ended up gulping some down before we left the place. Would have been better to serve the juice before the mains and end with coffee or something....",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DvFz8y_bUxQrhUWQZDFdKw"
  },
  "dc7bD3RjzBfLcWNyyTHtpw": {
    "date": "7/29/2016",
    "text": "Cozy place for a quiet coffee by yourself (on a weekday... May get hectic on weekends) and some very decent eggs Ben/Royale",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rNf2jWhsxiPww8sq8rLWgg"
  },
  "T59EwUVfDHKulaQqxNdfog": {
    "date": "2/2/2014",
    "text": "My default brunch place after church on Sundays when the dude wants to eat AM food and we're too lazy to be adventurous. 2 Croque Madames, one with a salad and one with pomme frites.Enough said.With the exception of one guy, the servers either have an attitude problem (\"What croque do you want?\" Me: Croque madame please. \"No what croque do you want??\" Me: a croque madame like I said...\"*rolls eyes*...chicken? ham? eggplant?\" Me: oh you meant what FILLING!\") or are inexperienced. Your water glasses never get refilled unless you ask and the person managing the waiting list doesn't know how to manage it. So this is a bit like your favorite grumpy hawker. Just eat your food, think zen and leave.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "2zbO5Cpuu0svXn3br0T84Q"
  },
  "w1ZA82j_QI6nPVeAWpMjUQ": {
    "date": "8/21/2012",
    "text": "Tucked away in a corner of the intersection between Bukit Timah Rd and Princess of Wales Rd sits a quaint café, Choupinette (that's 'sweetiepie' in French).Tiptoe pass the out-of-worldly decorations on the patio, and take a trip down the rabbit hole. Such unconventional interior design was carefully thought out and selected by owner cum Parisian art dealer Agnes Verrier, who switches up the furniture regularly to keep her sweetiepie relevant and trendy. Amazing décor doesn't always translate to fantastic food. Well, the quickest way to vanquish (or confirm) doubts is to put the fork to the test.Their Eggs Benedict's might come across as slightly expensive ($20+ with a fruit juice & any hot drink), but if you haven't taken the clue from the disproportionate chairs and the avant garde décor, the servings here are fit for giants! Served atop two hefty freshly toasted slices of bread, air-flown from France, are slices of honey-baked ham and sizably huge poached eggs, topped with generous servings of Hollandaise sauce. Yes, Choupinette does offer their brunch fares everyday from 9 to 6 except Mondays, when they observe the same traditions as eateries in France, closing on the first day of the week. Other mouthwatering offerings are their Chocolate Chouchou (their signature chocolate doughnut), as well as their Macaroons, which are handmade and polished to lofty French standards.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H7djsyPfU0L8BBPX9uUqnw",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H7djsyPfU0L8BBPX9uUqnw/o.jpg"
      },
      {
        "img_id": "usC75oOEZ2UiJmjZLnNm1g",
        "caption": "Photo of Choupinette - Singapore, Singapore. Eggs Benedict!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/usC75oOEZ2UiJmjZLnNm1g/o.jpg"
      },
      {
        "img_id": "9-Di-w2EaVbldjm_KZxcaA",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9-Di-w2EaVbldjm_KZxcaA/o.jpg"
      }
    ],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  },
  "gaC0CLi185_tUH79ROuPuA": {
    "date": "8/12/2012",
    "text": "Choupinette is possibly my top brunch place in Singapore. When I think about the perfect eggs benedict, this place comes to mind.From the name you can tell that it is french. It's also quite an establishment along the Bukit Timah stretch that is just near my old junior college. I can't remember who told me about this place but I am glad I found out. It is a very small shop with seating of probably around 10 tables, so do be prepared to wait.Their smoked salmon eggs benedict is really divine. They also have other delicious things on the menu, and what I liked is that you can order them together with a juice and a coffee. This is exactly how people in France/Switzerland have their breakfast. I love it! They also have a wall of breads for you to buy and take home. Baguette anyone?",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u15CNC3wMY0ko6tcFzp8XQ",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u15CNC3wMY0ko6tcFzp8XQ/o.jpg"
      },
      {
        "img_id": "spA0yP9pMpPak8e1hizY0Q",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/spA0yP9pMpPak8e1hizY0Q/o.jpg"
      },
      {
        "img_id": "pA2n7H1zHx8GoF823eAkJA",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pA2n7H1zHx8GoF823eAkJA/o.jpg"
      }
    ],
    "user_id": "9nWcII-Fqn5Hagfib-H76w"
  },
  "U-9YnbCdBgQAcNYupI-DvA": {
    "date": "10/2/2016",
    "text": "Brilliant, love the le croque Madame!best Western type breakfast in singapore by far :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnuLNQxCCau3iBPfbxQvLw"
  },
  "5b-bdluOgSO6O89E6lykTA": {
    "date": "5/1/2013",
    "text": "*Update*Not sure how these updates work (it's my first) but I wanted to add that I went back to Choupinette and have confirmed that they now hold the title in Singapore as Best Eggs Benedict.  They have perfected the bread toasting and now offer more hollandaise sauce.  Well done!  You didn't earn another star rating, but you are on your way...",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_gyBH_pVycVOnjikFVXuBQ"
  },
  "S4ZVreTWx6bM8V1CDw1O4Q": {
    "date": "8/19/2012",
    "text": "Very french and while it was over hyped back then when they were the more prominent french bakery open by a french, I have to say their Croque Madame and Danishes are still really good. What makes the sandwich this good I reckon is the creamy Bechamel Sauce and the perfectly set sunny side up. The ham is of good quality and it hardly disappoints. The staff aren't always the friendliest, but if you aren't just loitering this small shop and genuinely hoping to buy something, their attitudes are not all that harsh.It is a nice place for brunch or just to pick up bakes for a picnic out. go early for the danish, my favourite, cherry danish, is always grabbed up by the time I roll out of bed and make my way down!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKY29o3cqaQYcFdR_bZdg"
  },
  "a1cWxcbdyNsS-UcCUKRZIA": {
    "date": "1/14/2015",
    "text": "If you haven't tried Choupinette you are missing out. I've been here countless times with only one thing to order from the menu- Eggs benedict. Hands down the best I've tried in Singapore (and we've tried a handful).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c6ZHZWqI_Q2XF5eUb2Iryw"
  },
  "-S7SLqKVMHwtC6CDMKgAGw": {
    "date": "8/30/2012",
    "text": "Really love the interior of this place, the row of good-looking bakery goodies really make the best backdrop of a nice quaint cafe.Came here for brunch on a weekend and it wasn't as crowded as we thought it'd be, or perhaps we were really early.Had the poached eggs with salmon, my usual. It was great but I felt they were a little too heavy handed on the vinegar. Also had the creme brulee for dessert, not the best one I've had. The almond croissant was delicious though, crisp and creamy flavourful.The service here is satisfactory - was rudely acknowledged with a snooty head nod when I called for service.Not sure I'd come back here again for the food, but maybe only if I'm in the area and craving for some good pastries.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9y-CVSVnhA9jLJa0RVv5Gw",
        "caption": "Photo of Choupinette - Singapore, Singapore. Almond croissant, Choupinette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9y-CVSVnhA9jLJa0RVv5Gw/o.jpg"
      },
      {
        "img_id": "xF950yERTej-xygVhHjoKg",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xF950yERTej-xygVhHjoKg/o.jpg"
      },
      {
        "img_id": "kZlPBPc0E0CKSsh0X76Xkw",
        "caption": "Photo of Choupinette - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kZlPBPc0E0CKSsh0X76Xkw/o.jpg"
      }
    ],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "M1HfaJWHEz0dPWLfWUtahQ": {
    "date": "8/15/2012",
    "text": "I've had brunches at many places in Singapore, but nothing is quite charming like Choupinette. Tucked in a corner along Bukit Timah Road, this place got popular only very recently-up till a year ago, you could walk in on a Sunday and immediately sit down for a brunch. The interior of the place is furnished in a homely, cozy fashion; a nice alternative to the unanimity of modern 'minimalist' cafes. The menu is not extensive, but the food all taste pretty good. Having tried almost everything, my favorite still has to be the Eggs Benedict and Eggs Florentine. Unless you catch them on a super busy/off day (hardly), you should be able to expect nicely poached eggs, well seasoned salmon and wonderfully light, silky, buttery hollandaise sauce. If you wish to opt for something light, they also serve the fluffiest, flaky and flavorful croissants that go extremely well with tea or coffee.But as with most things in the area, the food is pricey. I would say $50+ is considered average for a brunch for two. Whats comforting is that the food is almost always consistent, and I have never left disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9zo-15IyloXhPeO78Myjg"
  }
}