{
  "OuVjIm295wJOWeNQ_Ll7Mw": {
    "date": "5/26/2015",
    "text": "One of the better Korean restaurant in town, in my opinion. Good spread of marinated meat; very nice. Love the pork belly and the Kimchi is good too. Service was average and expensive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  },
  "uqOzoND_hj6yAYqDjG423w": {
    "date": "5/29/2018",
    "text": "This is a decent Korean bbq place. Prices are a bit high even for SG standard for what you get. However the quality is good and the service is friendly.  If you are in the area I'd recommend this place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6uxJzwfCS-EsGACRocTBg"
  },
  "ukvpp3O1UDoivXrCfBOqMA": {
    "date": "11/1/2018",
    "text": "During a recent trip to Singapore, I decided to revisit this place for some Korean BBQ. When I lived in Singapore a few years ago, this wasn't my favorite Korean BBQ place, but it was good and close to where we use to live. This past visit did not really meet my expectations and the rowdy guests chugging beer at the table next to us on a Tuesday night did not help. The BBQ and Stew were good, but not great like I remembered. But the worse was I remember really liking the kimchi fried rice, but now it has cheese in it. What??? They just ruined a perfectly good dish, unless my memory is totally off. Anyways, there is lot of food choices in Singapore, so I'm not sure I'd choose this again during my next visit.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eFjdODvQbf9zWJgGrtj48A",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eFjdODvQbf9zWJgGrtj48A/o.jpg"
      },
      {
        "img_id": "W7ixhLTSeKj-2zeI13-6Ow",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W7ixhLTSeKj-2zeI13-6Ow/o.jpg"
      },
      {
        "img_id": "tZFsP7U7M9YA3jriZr8DDA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tZFsP7U7M9YA3jriZr8DDA/o.jpg"
      }
    ],
    "user_id": "3c57DbE5YVzaBqJzXTixcA"
  },
  "I6krmBbgOMRNMUCuaKCKzA": {
    "date": "2/27/2018",
    "text": "Met up with a group of friends for dinner on a Monday night. 5 of us shared their Eight flavors set meal. That's 8 different flavors of pork belly from the Mangaloca Pig. Meat was served 4 types at a time and grilled in front of us. Starting with the mild flavored ones and ending with the more flavorful types. Flavors here refers to the seasoning / marinate used on the pork belly. Some of the meat pieces were fatty and may turn some people off. It is the fatty pieces that are the most flavorful. The meat is cooked and cut into pieces so it is easy to share. Each set of meat cane with kim Chee and sprouts served on the front side of the grill. They and the fresh lettuce leaves complement the meat well. There are also typical Korean side dishes as appetizers or snacks. Service was ok. There seems to be a lack of water to quench the spiciness of the kim Chee. Maybe they charged for each carafe of h2o. It was a quiet night and one of the staff came over with a camera asking if they can take a photo to post on Facebook. It seems they post every 1st of the month for the last month so hoping to see our group pic then.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y-8nS1Gxm3_Zb7Q_SC82Ww",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y-8nS1Gxm3_Zb7Q_SC82Ww/o.jpg"
      }
    ],
    "user_id": "Gh6sagblKhuMpWUDWeQjNg"
  },
  "M86wElZTx-wadzVHJxaUKg": {
    "date": "1/22/2018",
    "text": "We first tried 8 Korean BBQ in Seoul. It blew our mind. When we heard about them opening a store in Singapore, we jumped at the chance to try it. The taste didn't failed us. Meat was succulent and well marinated. Just like how we tasted it in Seoul. Although we are limited by the variety of vegetables we can get in Singapore, it did not diminish the whole experience.Price here is on the high side compared to Korea. The price for 2 pax in Singapore would feed 3 in Seoul.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qDhuwADQ7LEcA81insWgpQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. Army stew",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qDhuwADQ7LEcA81insWgpQ/o.jpg"
      },
      {
        "img_id": "TR0i7lnK9YWo3GzTS3GvyQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TR0i7lnK9YWo3GzTS3GvyQ/o.jpg"
      }
    ],
    "user_id": "72cr3sRaakTv2Znw_QQ8Cw"
  },
  "ALXIjhryDIW3sesbxQpyoA": {
    "date": "5/14/2016",
    "text": "Been here twice for dinner, and got varying flavors of the pork belly. I have no idea why they put kimchi on the grill, yet not provide kimchi as part of the banchan unless asked to. Bewildered.Both times I've gotten a kimchi jjigae, and it is okay. The pork belly flavors are a bit of a gimmick. After the staff kindly cooked the meat, they all tasted pretty much the same. The prices are also on the high side here. I was not impressed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B6DplEWzNLOyYsBH_kIMjA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B6DplEWzNLOyYsBH_kIMjA/o.jpg"
      },
      {
        "img_id": "tDLyLFCov9egvYwz4e07MQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tDLyLFCov9egvYwz4e07MQ/o.jpg"
      },
      {
        "img_id": "lD1w_ODAy8cpNcV6zHqsPA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lD1w_ODAy8cpNcV6zHqsPA/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "YUrkkqx5H8j2-yBedYJSbQ": {
    "date": "5/28/2015",
    "text": "Maybe the BBQ/Grill meat will be the better option. We did not order that as our focus was on the Army Stew.Apparently most places' Army Stew was big enough to feed 3 or 4 persons. As it was just two of us, we were looking for a smaller portion and 8 Korean BBQ had that. My first experience with Army Stew and I was not too impressed with it. It was nice but it was not spectacular. Instant noodle in a Kimchi broth with some vegs, a cheese slice, ham, hotdogs and luncheon meat (spam). I could not see or taste the luncheon meat though my friend said it was there, in tiny pieces. We also ordered a kimchi fried rice which was quite good. The highlight would be the banchan. It was different from other places with the ubiquitous kimchi, anchovies and huge bean sprouts. Over here, there were only 4 but they were all tart which were very appetizing. I love the strips of cuttlefish which were salty sweet and sour. Maybe I would have to order the grill meat next time. The 4 or 8 color pork belly were huge! Definitely enough for sharing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "akYP4kSWNnr1Q43RbROktw",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. You can order from both lunch and dinner menu during lunch time.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/akYP4kSWNnr1Q43RbROktw/o.jpg"
      },
      {
        "img_id": "JWijYgRFSECvOw2cakuWBA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JWijYgRFSECvOw2cakuWBA/o.jpg"
      },
      {
        "img_id": "fTQLbmTPlSshLOQxnLE1Vg",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fTQLbmTPlSshLOQxnLE1Vg/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "kH2w9A4bu7SPc7aqCHHL9A": {
    "date": "3/1/2016",
    "text": "Good quality tasty and nice casual ambience.We had the Ginseng Black Chicken soup and Pork Belly Kimchi Stew. Both came out piping hot and smells great. They have served the side dishes which were usual in Korean fares.The side dishes presents Kimchi, Cuttlefish strips, white carrots (radish?), beansprouts, & small potatoes, all nice starters for the main meals.We like the Ginseng Black Chicken the best. The soup is almost thick and flavourful, almost collagen-like. I think it's a whole chick in there, stuff with rice. The portion is definitely large enough for two. The pork belly kimchi stew when compared to the Ginseng chicken is less impressive. On its own it would be a nice meal, though it is stingy on the pork belly. Lots of kimchi and the stew is spicy and appetizing enough. I finished my bowl of rice with it.On the whole, the ambience is casual, and probably surprisingly nice as we left the place without smelling like food. And the pricing is exceptional, $38.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "opPAZd9yVEF8kC8WQryIYA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/opPAZd9yVEF8kC8WQryIYA/o.jpg"
      },
      {
        "img_id": "AoWODgh0i4raPzoemUWgjQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AoWODgh0i4raPzoemUWgjQ/o.jpg"
      },
      {
        "img_id": "MPcGtDT7Dddk_t7qITYpHQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MPcGtDT7Dddk_t7qITYpHQ/o.jpg"
      }
    ],
    "user_id": "BSzE4Vu-yzyTMSJpwZtIBw"
  },
  "Sy31o0WotpXP9l4uwdb8Ww": {
    "date": "8/8/2014",
    "text": "We tried out 8 Korean BBQ last night and I'm a huge fan. The place was hopping and I'm happy we had a reservation. There were three of us and our server was very helpful in explaining the menu. We started with the vinegar soju with plum and then  ordered the pork belly, the ribeye and the seafood stew with bean paste. I was happy with the drink, but my husband may have found it a bit girly for his tastes. The meats and kimchi were awesome. I was really impressed with how everything was cooked at the table and the level of service we received. It wasn't 5 minutes since the time we ordered that the table was swarmed with servers toting a ton of food. What an experience! We'll definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "sRDj29Ge6pxTeERt2ORkqg",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sRDj29Ge6pxTeERt2ORkqg/o.jpg"
      },
      {
        "img_id": "tdz7DFi8Vol6Ty-lMs5XfA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. Pomegranate vinegar infused soju",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tdz7DFi8Vol6Ty-lMs5XfA/o.jpg"
      },
      {
        "img_id": "3i1iO31UQTqANVXQpmxxEA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. Ribeye ($58) with 8 set pork belly ($98) - possibly too much good for 3 people with the seafood bean paste stew and sides!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3i1iO31UQTqANVXQpmxxEA/o.jpg"
      }
    ],
    "user_id": "IOtmx8Zebl3wOOqNEobFMw"
  },
  "ptnVJ4yIlKCsLBTrCnNlLw": {
    "date": "1/12/2017",
    "text": "Good restaurant for the show. The food is rather basic standard and quite spicy for western taste.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zeNqYZNwRcXPM0HcKvZOKw"
  },
  "8On9CTM8fm3fToa1c1cnng": {
    "date": "8/14/2013",
    "text": "Without a doubt the best Samgyupsal (Pork Belly) in Singapore. This is the same franchise as the one in LA's Ktown and Korea (although in LA, it's called Palsaik, which essentially means 8 flavors anyways) I'd been to Palsaik in LA (and became a fan!) and was eager to try it out here when I read that they opened about a month ago. One of the things I miss most about LA when I'm in Singapore is the good korean food and was hoping it'd taste just as good here. It did, if not, better. 4.5 stars... Here's why,When you first arrive, you're greeted by a dim interior, with Kpop girls dancing around on the TV screens attached to the brick walls. The space isn't particularly big (and I can see it becoming really crowded, once word hits the street) but it's very well decorated with a nice hip underground feel to it. The staff are super friendly and showed us to our table as soon as we got there. The thing to order here is definitely the '8 flavors' samgyupsal. It sounds like a lot of food but it's really not as it's essentially one thick strip of pork belly for each flavor (good for 2-3 people). The 8 flavors are: Wine, Original, Ginseng, Garlic, Herb, Curry, Miso, Red Pepper. Every single flavor tasted good, my favorites being Wine, Ginseng, Garlic, Curry and Miso (okay I guess that's almost everything) Now, what makes the singapore branch BETTER than the LA one? The service and the flavors.The service: Service here is top notch. Possibly the best I've experience in such a restaurant (of course, not comparing with fine dining type places). Aside from being super friendly and attentive, they cook your food to perfection. Yes, perfection. Sure, there are countless amazing korean bbq places in LA but the one thing I find annoying is they often start cooking your meats for you and then walk away and come back too late only to have it become slightly burnt, overcooked or resulting in you having to flip it over yourself. Not here!! They flip it at the perfect time, cut it up, and then turn off the fire and transfer it onto a small plate for you after it's perfectly cooked so it does not get burnt. This results in pork belly perfection.The food: The Samgyupsal here is actually better than their branch in LA because, the flavors are more distinct. In LA, they do the 8 different flavors as different \"cuts\" of pork belly as well as marinates. However, though yummy, I didn't think the flavors were very distinctly different from each other there. Also, with the different cuts, there were cuts of the pork I didn't like as much resulting in a lot of uneaten meats. At 8 flavors here in Singapore, however, every flavor is made with the same pork belly. This allows you to differentiate and really taste the change in taste with each flavor. The cut aside, the flavors itself really are most distinct too. Super well marinated and bursting in flavor, you can no doubt tell wine from miso from garlic etc etc. The only slight downside for this place is the price point. For a plate of 8 flavors, you're looking at $98. This is before soups, drinks etc. And since (if you're a big eater like us - heehee) a plate of 8 flavors only feeds 2-3 people, you can imagine it becoming really pricey with a big group. Thus, I had to knock of 0.5 stars (but only because of the price) Still, I'll be back, and 8 flavors has no doubt earned the title of best Samgyupsal in Singapore in my books. I just hope the service and food quality remains just as good, even when they start to get super busy (because I know they will soon enough).",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "1FhEQOL-CwPKY0hxDpB0Ew",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. Left to Right: Wine, Original, Ginseng, Garlic, Herb, Curry, Miso, Red Pepper flavored Pork Belly",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1FhEQOL-CwPKY0hxDpB0Ew/o.jpg"
      },
      {
        "img_id": "A_39TPaJtL6sySUMq3Z2fQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. Wine, Original, Ginseng and Garlic flavored pork belly cooking on a hot plate that is angled downwards so the oil drips down.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A_39TPaJtL6sySUMq3Z2fQ/o.jpg"
      }
    ],
    "user_id": "FQZZsU3J88IGF8n5e3XYZg"
  },
  "OzjbouZtGK3jX4_9EYVuUA": {
    "date": "2/21/2014",
    "text": "Delicious.I came here with my sister and here are the dishes we got:- 4 color pork belly ($58) - we are pretty big eaters and could have easily finished the 8 colors, but we wanted to try other dishes too so we settled with 4. We chose garlic, smoked, curry and miso. All of them were tasty, with my favorite being smoked - it's just downright divine when wrapped in one of those crunchy lettuce. Curry is a close contender.- beef bean paste stew ($18) - tasteless and not nearly enough beef. I'd skip this- steamed eggs ($12) - this was just alright. The texture wasn't what i expected. Korean steamed eggs are usually more soft and smooth, but this one has a rather rough texture and might have been overcooked. Portion is huge though.- kimchi fried rice ($8) - SO delicious!! And this being relatively cheaper than other dish with good size portion, i'd definitely get this again.Overall, i'm pretty impressed with this place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "muFhGhZXHYwT7L1ineJOTQ",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/muFhGhZXHYwT7L1ineJOTQ/o.jpg"
      }
    ],
    "user_id": "WjFI4zVmeDkA7c3tcOy3-g"
  },
  "bWrrDC6f8sJCbXxyJJ5JTQ": {
    "date": "3/28/2015",
    "text": "I ordered the Flower pork, with belly, jowl, neck steak.Apparently this was food enough for 2 or 3 people. Something never pointed out to me.  But I don't care, it was amazing.I am very much a fan of anything porcine, and the jowl being the best of the porker. So I had very high hopes going in, and I was not disappointed.Meat is griddled right next to you, the fat runs down and cookes the bean sprouts and kimchi. What is not to love.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DJe5TpgrBacHlXH9LzaO4A"
  },
  "y5Rp2-l8UzCbCdDlbqGbxQ": {
    "date": "5/13/2015",
    "text": "Like the concept of different types of marinated meats. However, taste is average. Side dishes are limited, a bit overpriced compared to other Korean restaurants along Telok Ayer/Tangjong Pagar area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ROrG7IDTRx2BbWK7tpTfhA",
        "caption": "Photo of 8 Korean BBQ - Singapore, Singapore. Pork bbq",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ROrG7IDTRx2BbWK7tpTfhA/o.jpg"
      }
    ],
    "user_id": "KXy4m5JDEegBLk5x9aiViQ"
  },
  "u_OtX2bAIecqM_6MGyaxqg": {
    "date": "10/16/2013",
    "text": "(Let's put aside the fact that I'm vegan. There are times I will socially eat meat. Don't hate.) GETTING THERE: The restaurant is located in The Central Mall on the 2nd floor. Near the escalators. This mall is like a labyrinth so try not to get lost. DEJA VU: When I saw \"8 Korean BBQ\" I immediately thought of Palsaik, a Korean bbq joint back in Ktown LA. The menu looked especially familiar. The flavors were the exact same as Palsaik's. Turns out the two restaurants are under the same owner. TASTE: I used to be a hardcore carnivore. Meat and carbs all day. So I know a tasty piece of meat when I encounter one. 8 Korean BBQ is legit yo. I didn't expect much because if you've dined at Koreatown LA many times before, you know what's hot and not. 8 Korean BBQ is hot. Their pork belly is JUICY. Their kimchi is a bit salty though. At least the day I had it. So awesome they had brown rice instead of white rice. Puts a smile on a health nut's face. INSTRUCTIONS: Take a piece of lettuce, place on a pink round radish, a slice of pork, then some kimchi. Wrap it up and into your mouth. Repeat. PRICING: 8 Korean BBQ is pricier than Palsaik. The set of eight flavors at Palsaik costs $50. The similar set, if not exactly the same, is double in Singapore's sister location. But if love K-bbq, it's worth every penny. Their juicy pork belly will not fail to disappoint. CONCLUSION: If you ever miss Koreatown LA, you know where to go... 8 Korean BBQ. Make sure you order a bottle of soju with your meal. Gunbae! Cheers! And if you get drunk, don't fall into the river. Those stairs are steep. Please have a designated walking buddy.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "_PqD0q8FSxMd2f_XleqECw"
  },
  "ZIBukQkbpcLh_U1Z0tPuTw": {
    "date": "7/24/2013",
    "text": "Fantastic food and service. Hailing from my hometown of Ktown LA, this is the same owners as Palsaik, which in Korean means \"8 Flavors\".  They have recently re branded and decided to situate themselves here in Singapore.  I was super excited and eager to try this awesome place before it got super packed.OG Website: palsaikbbq.comDecor/Ambience: Very modern and urban. Clean use of concrete, exposed brick, the whole nine yards.  The grill is customized with \"8\" logos on the corners and everything is shiny, new and clean. Very sterile.  The unique designs of the seat is that you can lift the cushion up and it serves as a \"locker\" for your bags and such so no pork fat or grease will get on it.The service: Great! Man, the Singaporean manager was very helpful, friendly, kind and attentive.  She answered all questions quickly and we also had the chance to meet one of the LA quality control guys, Jae.The food: Amazing! Pork lovers rejoice! The 8 flavour combo comes in: Wine, Regular, Ginseng, Herb, Miso, Curry, Garlic, Gochujang. Comes with an array of banchans as well as grilled kimchi and bean spouts for you to build your own wrap.  The stew was good and had plenty of seafood however after reducing on the flame it got super salty.  As a treat, Jae ended up making bokumbap for us with the leftover stew which was the highlight of the meal.I highly recommend coming here for some of the most authentic Samgyupsal in town. It will be packed within weeks- I just know it!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "WPw0LDmsT5HLc5itX8YLVA"
  },
  "XaAdcyb1bAnf4z0uPkKkzw": {
    "date": "4/12/2014",
    "text": "So we wandered around Central Mall, looking for somewhere we both could agree on for dinner. Husband: \"I don't really like Korean\"Me: \"Oh, so this place is no good then?\"Husband: \"Never said I didn't like Korean BBQ\"So we manage to get a table on a Saturday night. Outside. By the lights of Clarke Quay. We choose the 4 color pork, wine, original, miso and garlic. Service was a little slow, I managed to devour the kimchi before I could even imagine our meat arriving. My 3 year old didn't have many options other than rice. So she played with that a while. Finally our meat came out with the seafood broth. The meat was delicious, cooked so well and so full of flavor. Surprisingly, my non seafood eating husband, not only tried the soup, but went back for more and then some. I'd say that's testament in itself that we wandered into a good Korean BBQ place. Best I've been to so far in my 30 years!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FhxAqcdQAtHQkPltpBDMUA"
  },
  "lBlrTANhpmIlJwkfErvwXw": {
    "date": "11/2/2014",
    "text": "I have only compliments for the food = 3 thumbs up!But behind the \"friendly\" faces lurk rude and insulting servers. Most visitors probably compliment the \"good\" service because they do not understand what the Filipino servers comment when they exchange communication amongst themselves in Tagalog.I visited the restaurant today with a friend who understands and speaks fluent Tagalog but is Chinese. The servers, Joey and Del, didn't suspect one bit that she understands Tagalog and continuously exchanged insulting and rude comments about us between themselves in Tagalog while masking their insults with wide smiles - while serving us.Good food but such service standards would make anyone lose an appetite.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d1RNE5LeGJ-y-k15Ur60NA"
  },
  "E75bymJT5vniFo7HFvLYTQ": {
    "date": "4/27/2014",
    "text": "A Serendipitous Find!We had the 4 colour set at 8 korean bbq. The  4 colour set comes with four flavours of BBQ Pork from a total of eight flavours and we also ordered the pork belly kimchi stew as part of the set.The stew - tastes savoury and rich, has a smooth texture, and is not too thick. it's one of the BEST Korean stews I've ever tasted. I try a few pieces of the pork meat in the sizzling stew and they are delicious, too.The meat - It is juicy, savoury, succulent, and tastes perfect no matter how you eat it: I wrap it with kimchi in cabbage, eat it with the multi-grain rice, and dip it in sesame oil. No matter which method I try, the meat still tastes oh-so-fabulous!Beer - Had the Korean Hite Beer while indulging in the 8 Korean BBQ feast. Light and refreshing with a smooth texture, and has a nice bittersweet aftertaste.Overall, everything was good. The meat tastes heavenly, the stew is delicious, and we enjoyed good service throughout. It was surreal. My bf & I are both completely satisfied. Check out our full review and photos at eatandtravelwithus.com/2…",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Fx3krf1zjVRDooyCS21Ug"
  },
  "wqYdgKhM5iXpANBVo6Cf1A": {
    "date": "10/17/2013",
    "text": "I'm from LA and this place is a disappointment compared to the original. Around $90 something for 8 different kinds of pork belly, with less side dishes and smaller meat portions. In LA, i think it's around $38 for better everything. I guess I can't complain though that there's now a 8 saik in Singapore.  The only upside to this place was its kpop atmosphere fit for pregaming.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "iPL8V_dOtrcMUH6tQZq-Dw"
  },
  "n9RlHpDQI_3c7FKm6xQehA": {
    "date": "8/14/2013",
    "text": "As a person that has tried the original in LA (called palsaik), I can say this tastes better. However, the LA one has different cuts of pork and this place just has 8 different flavors. Each 8 flavors are bursting in taste and immensely delicious. The price is about 2.5 times more expensive than the one in LA but its probably bc the overhead is higher in sg. And the quantity is much smaller as well. 98 bucks for 4 people but honestly, 2 people can finish that portion.  I would say its probably one of the best in korean bbq in singapore but thats not really saying much bc korean food in sg is not that great.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "CKXG8pIWcN27PHk8JSIcig"
  }
}