{
  "JppTBYStMZNobmA10iDBfQ": {
    "date": "8/23/2015",
    "text": "Rang Mahal is an ultra modern yet classy Indian restaurant on the third floor of the Pan Pacific hotel. My girlfriend and I joined for a nice Sunday DINNER and were immediately taken away by the incredible ambiance from the moment we walked through the dramatic hallway entrance.We sat down and were again in awe over the high ceilings and Indian music subtly playing in the background, feels very zen-like.Service was quick and friendly, helped us out with recommendations. We ended up ordering:1) Murgh Makhni - Their version of butter chicken which is very well done.2) Prawns (don't remember what it was called) - I initially thought it was prawns cooked in the tandoor oven by itself which it is but also they add this sauce to it which tasted like I'm eating chinese food. The prawns were amazingly cooked and had great flavor but the sauce took a lot away for me.3) Paneer Tikka - Their Indian cheese dish - extremely well done. Loved it.4) Pani Puri - They had these Indian street food snack items as appetizers. Loved it!!5) Plain naan and rice - fluffy naan and rice was great. We ordered just enough not to get overly stuffed. Then for dessert, we ordered:1) Rasmalai - these cheese dumplings soaked in a milk type liquid. Indian staple dessert. It was ok.2) Gulab Jaman - best described as cake balls soaked in a sugary type liquid. Another Indian staple dessert, this was well done.3) Fig Kulfi - Indian ice cream with fig flavor. Surprisingly really good.The mango and sweet lassis both were pretty typical that you would find at any Indian restaurant. Always refreshing to get masala chai tea anywhere.The setting at this restaurant was on point and the food was very good. I would recommend this place over any other Indian restaurants in Singapore by far.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "xEV5tB8_5Fw5Q8ArN7vP3g": {
    "date": "3/12/2016",
    "text": "Overpriced for what it is. This is one of the highest end Indian restaurants in a convenient Area of town for people who do not wish to Journey to little India. However for the price this place has some of the most average food that you will find. The presentation is awesome however the taste leaves much to be desired. For literally 1/20 of the price I found a place near my office that delivered amazing Indian food. I will not be back to this establishmet for dinner again. Have been here for the lunch buffet as well and that is a far better deal and worth going to.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hY6RNf_jibCzuJT2_dmDyQ",
        "caption": "Photo of Rang Mahal - Singapore, Singapore. Appetizer plate from set menu. Looks awesome.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hY6RNf_jibCzuJT2_dmDyQ/o.jpg"
      }
    ],
    "user_id": "hVHYycPzGMg_Gmb5QMjB9g"
  },
  "SNNprRurRv09luFk4SjH8g": {
    "date": "6/24/2017",
    "text": "Undoubtedly one of the most beautiful and classiest Indian dining rooms I have seen. Unfortunately, the food - while good - is not great. If Dum Pukht in Delhi is a 10, this would be s 6. In fact, even in Singapore, Punjab Grill at MBS or The Song of India by an alum of Rang Mahal are better! Extremely expensive at SGD110 Per PAC for lunch before alcohol.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "Ntr_-a7Dr-xHn1WBvYa8Jg": {
    "date": "5/28/2015",
    "text": "Starter was a little cube of watermelon and a cube of coconut water soaked bread and a little shit of coconut water, tandoori chicken piece was tender, small shush kebab and a small vegetarian samosa, followed by a scoop of lemon sorbet.  Main course was rice with small chicken tikka masala, fish curry, Dahl, rice and dried okra. Desert was a very sweet coffee ice cream.The place is nice, service is good, the food was good, but not amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EleQKGrUDo_-zvpfOVHYMQ"
  },
  "VHipMoy-DmP2vwVFU-duJw": {
    "date": "5/19/2015",
    "text": "I probably am contradicting myself BIG TIME when I say this bc I love great hole-in-the-wall restaurants, but I am super picky when it comes to the establishments from which I get my share of delicious Indian cuisine. D and I love Indian food, but those curries in hawker centres or even the cheap $15 buffets seem very questionable. Perhaps its the sauce and spice-rich nature of Indian dishes that make me question whether a bug or two in an unsanitary kitchen haven't accidentally fallen and dissolved into its goodness. Sorry! that was disgusting. So here's Rang Mahal, an authentic, high-end Indian restaurant in Singapore that is delicious, clean, and superb in its service. On weekend lunch it becomes a buffet, at $50/person from 12pm-2pm, serving you a wide variety of Indian cuisine. The interior here is serene and simple, exactly as you would expect from a fine dining restaurant. I marked off one star for charging me $10 bucks for one glass of coke, without refills! I do not support such shady tactics to rip more money away from its (loyal, or soon to be loyal) customers. Other than that, I'm a fan.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 5,
      "cool": 8
    },
    "photos": [],
    "user_id": "iPL8V_dOtrcMUH6tQZq-Dw"
  },
  "1v2JJ4Rz7G_fTPCVQEgZgQ": {
    "date": "7/2/2015",
    "text": "Here for the lunch buffet.  Great value.  A very good assortment of foods with 3 protein and many vegetarian options.  There is an appetizer station, mains selection and a great dessert bar.  It was nice that not all desserts were Indian and there are French style desserts from the talented pastry chefs at Pan Pacific.  The service is excellent. Very attentive.  Some of the best in the city.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jd3zDm_qigq0Ni5l_WOeLQ"
  },
  "sh-nMogi73j83Xf7ZozXfw": {
    "date": "12/3/2016",
    "text": "Expensive but pretty good food. Great vegetarian choices and huge wine list. All of the food was fantastic except the subtz which was a bit oily. Service was excellent and background music was suitable Indian origin. We would go back as it's in my TOP 5 Indian restaurants in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CXO3WsJ8IV9YsE6zG22QXg"
  },
  "SqqfKPVuLYvC3ysAd-Ss0g": {
    "date": "5/10/2013",
    "text": "Successful tinkering with traditional Indian dishes. Most delish and the cooking is done with a light hand so you don't feel too bogged down after a meal.Love the pappadum basket with the various flavours - the black pepper one packs a sneaky heat and the one with fennel and cumin is very addictive. The quinoa is the best quinoa I've ever tasted. And the artichoke pakora is lovely despite the unexpected vegetable. The seafood is cooked a bit unevenly although the spicing levels are perfect. But it's a minor quibble. The service is a bit lacking for a restaurant of this caliber. There were quite a few waiters hustling around but it took effort to get them to come take our orders and to get their attention to pay the bill. And when my friend and I arrived, there was no one manning the podium out front. They need to brush up on that aspect of their restaurant. Great twist on familiar favourites. I'll be back to try the brunch buffet",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3wdkJbDCU4aV-ZQ425Y9AQ",
        "caption": "Photo of Rang Mahal - Singapore, Singapore. Butter chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3wdkJbDCU4aV-ZQ425Y9AQ/o.jpg"
      },
      {
        "img_id": "HZEiRyQzHhaK95U-1IyBqg",
        "caption": "Photo of Rang Mahal - Singapore, Singapore. Sea bass curry. Heat builds up but it's good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HZEiRyQzHhaK95U-1IyBqg/o.jpg"
      },
      {
        "img_id": "df-XjQIubbyOHST6n9MVgg",
        "caption": "Photo of Rang Mahal - Singapore, Singapore. Bindi fry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/df-XjQIubbyOHST6n9MVgg/o.jpg"
      }
    ],
    "user_id": "wuRI6NhRB6cUWERRmcvOMQ"
  },
  "5rUlktx5yvsQa6smkd0DnQ": {
    "date": "6/21/2013",
    "text": "there are few places that do indian fine dining... and even fewer that do it well. in my limited repertoire of indian fine dining places, rang mahal ranks very much at the top. judging by the loyal followers that have poured in after the panpac's location renovation - i guess quite a number of people agree.there is a lunch buffet that allows you to try an array of items. all still exquisitely done with the same attentive service. about $50 a pop? i am a huge truffle fan and was pleased to find truffle naan on the menu... truffle and carbs... a dream come true!must also highlight that they have a lovely private dining room for parties big enough (10 maybe? call and check) and a great outside patio area to chillax with a cuppa masala tea after you are done. vansh (at stadium walk, also under the rang mahal group) is actually my preference between the two. however i couldn't find vansh listed on yelp despite it having been around for about 6 years now?love.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "qc8-DYXrOqvnW8vK3YfZow"
  },
  "roTIYAHZdKvzmQIER0qroA": {
    "date": "8/29/2015",
    "text": "Probably the best Indian and one of the best restaurant in Singapore. Service is excellent",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e35plyPvp1--SuHcSFeOGA"
  },
  "oo-UiU4HQbyNHzoQCEnKOw": {
    "date": "9/12/2013",
    "text": "Expensive and okay. Just not fantastic. Started with veggie samosas which were tasty.  Had the palak paneer which had no taste.  Also had the aloo gohbi which had a nice flavor .  The naan was good as it should be.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x7EccVeR50LzYBzE8xwcgg"
  },
  "udBGoAMcw6dq_QwSZTk99A": {
    "date": "4/13/2014",
    "text": "My favorite Indian restaurant outside of India. Very authentic food. The ambiance is classy. A fine dining experience; one of the priciest Indian restaurants I have been to. Desert is great. I go there for the Sunday brunch. Make sure to make a reservation.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqSysTUueCTx2-Qdnbk61Q"
  }
}