{
  "tyA8eTvaNPqJDgK0McBh5Q": {
    "date": "11/1/2018",
    "text": "Daily happy hour from 3 to 7: 2 drinks for the price of one! Awesome Singapore slings with a cherry on top. The view from the open bar on Middle road and Bencoolen road is awesome! Open for drinks and burgers late at night: what could you wish for more? Burgers are tasty and the waiting staff is very friendly. If you stay in the neighbouring hotel Hotel G you can pay on your roomnumber.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K0Bepj6x99RTy6jAY33Djg",
        "caption": "Photo of 25 Degrees - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K0Bepj6x99RTy6jAY33Djg/o.jpg"
      },
      {
        "img_id": "BW_UXSG-kZeEL4pjqoa3eQ",
        "caption": "Photo of 25 Degrees - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BW_UXSG-kZeEL4pjqoa3eQ/o.jpg"
      }
    ],
    "user_id": "_qLWO4mM4OZeu2IMc3sWKA"
  },
  "AR2HNyoUExHF8O7zFmawQw": {
    "date": "1/3/2018",
    "text": "They make ok burgers...the patty is a tad dry and a little bland. But the sauce and cheese does make the Burger taste overall ok. Their burgers warrant a 3-star rating. The service by the manager gets the 4th star. I didn't get his name but he made sure our dinner party of 9 was well taken care of. That really made my mum feel good as the meal was her birthday celebration.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "dqIHq18ijY1I09GiHk_1yg": {
    "date": "11/5/2017",
    "text": "For all the years I lived in LA, I never went to or even heard or 25 degrees and now I understand why. There are probably much better burger joints around, like Umami Burger, Father's Office or my personal fave, In-N-Out!That being said, we are in Singapore, where we have none of the above and burgers are generally overpriced. So how does 25 degrees stack up? The #1, which consists of patty, bacon, gorgonzola, caramelised onions and arugula, is quite tasty and sizeable for $14. However, I take issue with the bun to patty ratio. It is too big compared and you can barely fit the burger in your mouth. I usually end up having my burger topless. If their bun was better proportioned, Id give it one more star. The fries and onion rings are pretty good ($5 each or you can order a mix for the same price). The tuna fish burger (#4) was nasty. Really fishy and bland.Once you add in the beer and fries/onion rings, the bill for one person is close to $40.Id come during lunch: burger + fries for $12. The burger patty is a little smaller than the a la carte one, but it's lunch! From 11am-3pmThey also have a decent happy hour from 3-7pm,with certain beers and cocktails discounted, and 1-for-1 specials on certain food itemsIt is also open late, so if you're craving a burger and beer at 1am (and dont Mickey-Ds) this is your place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c_15_PHy9v86uKnGAYf9_w",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. onion rings were delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c_15_PHy9v86uKnGAYf9_w/o.jpg"
      },
      {
        "img_id": "Yct8JwabVmOu0bInokcK1w",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. #1 burger up close. burger bun proportion is out of whack compared to rest of burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yct8JwabVmOu0bInokcK1w/o.jpg"
      },
      {
        "img_id": "wz-trCstjmKtkna6ymggdw",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. #1 burger, onion rings and beer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wz-trCstjmKtkna6ymggdw/o.jpg"
      }
    ],
    "user_id": "GQh4KSCygodKKum529q_LA"
  },
  "fSew_4PeH61EWDs7iPwFMQ": {
    "date": "3/31/2018",
    "text": "Visiting and honestly my boyfriend just needed an American meal to break up the Asian meals overload that we have been experiencing the entire trip. For a burger in Singapore, this place was definitely a pleasant surprise, since we did not know what to expect. Burger was classic American style burger that was juicy, cheese was melty and bun was just great. Ketchup was strange, I think it was a phillipino ketchup, making it so much sweeter, which was not pleasant.The food is decent, its marked much higher than average prices in Singapore honestly. These burgers are priced at the same equivalent of like sushi ($15)....but lets all be honesty. These are burgers, were decent but not amazing. For the price, honestly you should get sushi instead or just a TON of singaporean food (average $5)!! Service is super duper slow, it was not super packed when we went there but it took over 30 minutes to receive our burgers, french fries, and milkshake. The happy hour is decent deal to buy one, get one for the appetizers like french fries which is great but honestly....there is so much food in Singapore....go for street food or Hawker food instead!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kArTuWjGVEHXDvXcEvYh-w"
  },
  "Bsz5dzoI10ZFhCjUyStzXQ": {
    "date": "10/6/2018",
    "text": "Located in a hotel. Several areas to eat in. We ate in the bar area. Good selection of burgers, and a few salads. Good french fries and delicious onion rings. Service was fast and the staff helpful. A nice change from the Asian food scene.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5m52J8_rxc_XJ0CCIiDzEg"
  },
  "i7Vmu44CTabtv9hFjQBHkw": {
    "date": "12/4/2017",
    "text": "This gives me the burger sads :(25 Degrees is a chain that I first tried in Bangkok (it's annexed to the Pullman G Hotel), and I had a fairly good experience there. However, the one thing I do remember was the bun to burger ratio being completely off - and that was definitely the case here.I had the #2 at this location and it was just too much bun. Unfortunately it also was very unwieldy and sogged straight through so I basically had to eat the burger with a knife and fork. Whenever that happens, the burger experience has failed, and it needs to go back to the drawing board to be retooled.I feel like there is potential here, but the bun overload is not working - they need to figure that out first, and then work on building in a better taste profile overall for the burger. Mine was overdone also.At this stage I wouldn't return unless someone told me they've changed the menu/management.",
    "rating": 1.0,
    "rated": {
      "useful": 22,
      "funny": 12,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "_qp5IfNGxfeiJr3hlTLMpw",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. Strawberry Milkshake, 25 Degrees",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_qp5IfNGxfeiJr3hlTLMpw/o.jpg"
      },
      {
        "img_id": "_1V77PJAnHI-QQV_Tk6b-A",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. The #2, 25 Degrees",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_1V77PJAnHI-QQV_Tk6b-A/o.jpg"
      }
    ],
    "user_id": "YziRZOh5MrqN5b84dQ9AIQ"
  },
  "LB52eix2y29H1sooJZhKKg": {
    "date": "3/27/2018",
    "text": "What was I thinking getting a burger in Singapore?? I was thinking \" pictures look great, how bad can it be?\" Sadly I found out. Falling after, odd tasting, clueless servers, $16 beers! Avoid at all costs!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D7Vg-ZzDG2AVIeQpSEvgVg"
  },
  "gnu4r8BQSGfTlE-OKpm52Q": {
    "date": "3/9/2018",
    "text": "A decent spot for late night burgers. The atmosphere is nice - especially the long table which is partly outside. Flavors are not mind boggling but definitely worth a try. Decent value for money - 30$ for a burger, fries and a drink.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtkejwtqXX8-EvLvZl3hng"
  },
  "8Iqa5qBCDCHKJ4M-Xv3kKw": {
    "date": "8/11/2017",
    "text": "One of the better burger places in town. No1 is good with bacon. No2 is meaty and meat lovers will like it. Good choice for those with sweet tooth. Just hope the service timing is improved.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XBJnozO-yoJKBw9WmNnzyA",
        "caption": "Photo of 25 Degrees - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XBJnozO-yoJKBw9WmNnzyA/o.jpg"
      },
      {
        "img_id": "B6IiYQ3FoqVOrvSm0t6OqQ",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. No1 Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B6IiYQ3FoqVOrvSm0t6OqQ/o.jpg"
      },
      {
        "img_id": "X4EmLizu-xKvkGVAhsoWSA",
        "caption": "Photo of 25 Degrees - Singapore, Singapore. Milkshake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X4EmLizu-xKvkGVAhsoWSA/o.jpg"
      }
    ],
    "user_id": "4xwfZ_5Ae8SNP2bseoBj0Q"
  },
  "dQrbNjbW2pmwwaBLfNthqQ": {
    "date": "8/26/2017",
    "text": "This may be a meat lovers paradise but I wouldn't know. I came here based on the recommendations of coworkers (still haven't learned from this). In any case, I don't eat meat so I had the veggie burger. Looked amazing, but it was whack. The patty tasted like unseasoned broccoli. I love broccoli so if you're gonna do it then spruce it up. The buns, while soft, are too large. Next was my strawberry 'smoothie'. I'm about 95% sure it was more milk than fruit. The added and completely unwanted whipped cream tipped me off. On to the tomato soup...you can't mess up tomato soup can you? Of course you can. It looked red and visually pleasing but had I been doing a blind taste test I never would've known it was tomato soup. Lastly, the cheesecake. Big sigh here folks. It was on some kind of super hard wafer and the cheesecake was bland. The Oreo on top was the most flavorful thing on that plate. It's said when a processed cookie tasted better than...oh a processed cheesecake so never mind. This place is not worth the price tag. Find a street vendor selling ANY other food. Guaranteed it'll be cheaper and tastier. Don't mind the text on the pics. I was excited and texting to my gf lol. The convo went a different direction while eating though...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zsVEyjyGmRQ-WVLpZy_fVg",
        "caption": "Photo of 25 Degrees - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zsVEyjyGmRQ-WVLpZy_fVg/o.jpg"
      },
      {
        "img_id": "PPObT0AUIot4wBncWXyQOw",
        "caption": "Photo of 25 Degrees - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PPObT0AUIot4wBncWXyQOw/o.jpg"
      },
      {
        "img_id": "mDbv-W_cRu8ehb2H-GERTw",
        "caption": "Photo of 25 Degrees - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mDbv-W_cRu8ehb2H-GERTw/o.jpg"
      }
    ],
    "user_id": "hgVeWViRsC9d3greMKm-ZQ"
  },
  "n0QKrhrbRkDun8ODlg67uw": {
    "date": "5/1/2017",
    "text": "It's a great concept - burger and beers! Opens late too! Decent fries and onion rings, good service and pretty tasty burgers but... and this is a huge BUT. Our burgers had dry and overdone patties which is a huge letdown for a specialty burger place. :(((",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qK33YxMmj3nE_7nzxXNbog"
  },
  "rOjUBg1xFxZbZLF2xBshNQ": {
    "date": "3/13/2017",
    "text": "So I'm staying at G Hotel in SG and they have a 25 Degrees downstars.  Being a little jetlag I wanted something to eat and in my room is a flyer for this restaurant, so I went down and figured I'd have some onion rings and ordered them and I just wanted water.  The place only had two others inside when I ordered.  How long could it take?  5 minutes max?  So while I'm waiting a group of 3 come in and ordered beer, fries and bugers.  They got their beers, OK I get that.  They got their fries. Where's my onion rings right?  My order was in before they even ordered anything at all.  Then their bugers came out and I thought it was a little odd.  Well one guy opens up his buger and I see an onion ring on top of his buger patty and I say to myself WTF!  So, I grabbed my bag and walked out.   I'd normally would call for the manager and complain but instead I hope the owners read this review instead!   This is the first time in over a decade that I have walked out because of being so unhappy about service!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0hQqB5opTt95jEGIwaqDrA"
  }
}