{
  "P2kyXhfjVTwjQppHy0vhNA": {
    "date": "3/25/2016",
    "text": "Friends of mine will know that Samy's and Karu's are my two favourite Indian restaurants in the west side of Singapore. I remember visiting Karu's for the first time during my student days, where I had the fish head curry (and what a fish head curry it was!) and how my brother went crazy with the free flow basmati rice - being the \"rice bucket\" he is. Thankfully, the standard has remain relatively consistent over the years, and the food here has not failed to disappoint. If you're a big fan of Indian food, you'll definitely want to give the Chicken Masala/Mysore dishes a try. The tandoori and Tikka dishes are also delightful, with every dish served in generous portions. Do take note that the restaurant will get VERY crowded on weekends and parking space is shared with the other restaurants in the area, making it very limited. (If you're staying not too far off, cycling or walking is recommended. Good way to burn off all the food after dinner too!)",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TmzkkbAL6NQjldq83D4p3w"
  },
  "OUEch0rcsAV2Tg65gFGB1g": {
    "date": "11/24/2017",
    "text": "Went for a late lunch today with my mother and i found the staff to be exttemely rude. The server who served us our banana leaves and took our orders had a major attitude problem which we observed he did not have with male cuatomers. Service is so disappointing and he actually said sarcastically to my mother when she asked for a different part of chicken..\"you did not ask just now\". The food was okay..biryani rice was good and the mysoor mutton and fish cutlet were delicious along with the vegetable sides. We however found that the standard had dropped. Food is good but service needs major improvement!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rfe9i5wxtQk4C33UORoMsA"
  },
  "TQsP2QOcbl1Ab2e5gr9lxA": {
    "date": "1/5/2017",
    "text": "The best Indian banana leaf restaurant in Singapore, and I have had quite a few. The clincher here is that the food tastes home-cooked, and are not too oily or stodgy or watered-down like the others. Servings are generous, and waitstaff excellent. Most dishes are standouts but the lamb mysore and liver curry are delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Fo5D5l8DsROK6roOgZCeQ"
  },
  "53PMSmJJDl0bQrnFLWsTVA": {
    "date": "7/25/2015",
    "text": "Real banana leaves and real flavors (I hope,  unless my taste buds need some fixing).  Super fast service.  You'll leave a satisfied person.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0ZD_n8Q5uBU2fVGRUpcm0g",
        "caption": "Photo of Karu's Indian Banana Leaf - Singapore, Singapore. Check out the long grain basmati",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0ZD_n8Q5uBU2fVGRUpcm0g/o.jpg"
      },
      {
        "img_id": "CPpUDy_VzBYKI6tCVVSRlg",
        "caption": "Photo of Karu's Indian Banana Leaf - Singapore, Singapore. Masala Chicken and fried fish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CPpUDy_VzBYKI6tCVVSRlg/o.jpg"
      }
    ],
    "user_id": "LcGHtqY9eKVSyHbeXQaTfw"
  },
  "_ZXXIyoFjimKzoAGlMRgCw": {
    "date": "9/7/2012",
    "text": "It was a Friday night and for some reason, I was craving some good Indian fare, I picked Karu's, after picking up some of my friends that they're pretty decent. Fortunately, the crowd wasn't too overwhelming and we managed to find a seat quite soon.We sat down & instead of plates, we were quickly given a large banana leaf each, which is an authentic touch. The Veg White Rice Appalm set costs $2.80 per person. This means that for that price, one will enjoy a free flow of white rice, poppadom as well as side veggies. Very yummy. For our dishes, we ordered a Chicken Masala, a Fish Curry & an Onion Omelette ($2.00). The chicken masala was excellent and the masala sauce went very well with the chicken which was neither tough nor lacking. The fish curry, I felt, was excellent. It was really great with the rice & the poppadom. Overall, Karu's is an authentic indian restaurant that is a wonderful place for a meal. The service is attentive & the food is really tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QS3V9hTI1G3eoFHQu3_y8g",
        "caption": "Photo of Karu's Indian Banana Leaf - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QS3V9hTI1G3eoFHQu3_y8g/o.jpg"
      }
    ],
    "user_id": "Wnjh_5SaxBDNZ0YUux8m1w"
  },
  "EyLojFCPnz6ClEb7Guhadw": {
    "date": "2/2/2015",
    "text": "The best Indian food and for sure, my favourite food place in SG! Excellent service due short waiting time to get the food served to you. Totally loving it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gJxn8C2r_TNtIX3_dz5RSQ",
        "caption": "Photo of Karu's Indian Banana Leaf - Singapore, Singapore. Shiok-ness level infinity!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gJxn8C2r_TNtIX3_dz5RSQ/o.jpg"
      }
    ],
    "user_id": "nSDwbjusbLDXfrlikB1Tmw"
  },
  "JsZRsF8PLdJQ6-kczVKwOA": {
    "date": "8/18/2012",
    "text": "Karu's is not very easily accessible, parking can also be quite a problem but its worth the hassle if you're craving for the bold flavours of indian food near the bukit panjang area - you just have to head towards upper bukit timah road and its along the shophouses on your left. Came here on a weekday evening and it was bustling. It's also air-conditioned so you can dine in comfort from the humid heat outside. They are known for their fish head curry but haven't tried that (not a fan of fish head) but I have had a go at their fish curry with their prata. It's finger-lickin good. I've also had their thosai, served warm it just melted like butter on my hot hungry appetite. I'm definitely coming back for their briyani, served authentic and old school style on a banana leaf!Final verdict: One of the best Indian food in the northwest!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l0csEbBt8mobvVY7VChoJg",
        "caption": "Photo of Karu's Indian Banana Leaf - Singapore, Singapore. Thosai & tea, Karu's",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l0csEbBt8mobvVY7VChoJg/o.jpg"
      }
    ],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "8NBh49sglAWKMi1-FPUisw": {
    "date": "9/2/2012",
    "text": "This is one of my favourite banana leaf restaurants in Singapore. The masala chicken, briyani and fish head curry are fantastic. The other dishes are really very good too. You can take a look at the options before choosing.It is also very reasonably priced compared to other banana leaf restaurants. Although it's in a more ulu location, throngs of families still flock here, especially on the weekend as many come from the Hindu temple nearby. The restaurant feels very authentic and has a real bustling vibe. The service is super efficient and serving portions very generous, especially compared to other banana leaf places like Samy's which is probably more famous but honestly is outdone by Karu's food wise. Karu's is a well kept secret that you should definitely check out if you like Indian food.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9zo-15IyloXhPeO78Myjg"
  },
  "uJcDqqvjIN0rSJqPPC1yhw": {
    "date": "8/19/2012",
    "text": "This is definitely worth checking out if you live in the West. I used to frequent this restaurant in my army days, where $3.50 would net you free flow of rice, curry and vegetables. The briyani is really authentic, with the rice pilaf served on banana leaves. You have the option of having fish or chicken curry - I would alternate between the two on different helpings. Service here is great too. One time, I shared a large bowl of fish head curry with some friends. At the end of the meal, we were very satisfied, but noted casually to the owner that the fish could have been slightly more fresh (or perhaps ours was just overcooked). We weren't expecting anything, and were about to leave, when they brought out a whole new plate of curry for us. We were astounded and promised we'd come back to do the place justice. Also worth trying is their chicken masala, and their bandung made with goat's milk. Great place for a casual, unassuming and air-conditioned fix of Indian food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Uf6g20S-2ZcxJSuvVIjJg"
  }
}