{
  "OJFhQQcpaL41mkcl8vACVg": {
    "date": "4/14/2013",
    "text": "Always enjoy a great crepe and what more, when it's one for one. Heh.Not sure if they still have the promotion but DBS/POSB card holders can enjoy one for one crepe or waffles at Out Of The Pan.My favourite has always been the peking duck but I ordered the beef stew crepe that day. The flavour was right and the beef was tender. Wrapped snugly in the sun-dried tomato crepe, this is now my 2nd favourite option.Often crowded, lunch time can be tricky when you are dinning in this restaurant cos being situated just beside the fountain in the basement of Raffles City, the sun shines strongly through the glass roof thus you may find yourself dinning under the hot sun even though you are actually in a air conditioned mall.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "xgGUH5tINt-ngz2Y9KtvJg": {
    "date": "8/26/2012",
    "text": "I love crepes but after trying the ones from Out of the Pan, I reckon that if you don't want to spoil your expectations of crepes, its better to give it a miss. Meeting a friend there for lunch, my first time also became my last time. The sweet and savoury crepes we had were pretty off. The rest of their selection of salads and soups were average. The only redeeming point was the waffles. But if I'm coming for crepes and feel that the waffles are the best, then something is seriously wrong somewhere.And for the level of food, I have to say it's not worth paying so much. I don't see what's the fuss about the place, and I'd rather go elsewhere if crepe fever strikes me.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4vGMPmTKfDVw-nM_LnZ8Jw",
        "caption": "Photo of Out of The Pan - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4vGMPmTKfDVw-nM_LnZ8Jw/o.jpg"
      },
      {
        "img_id": "cug_LAjCalG4rK0Z3RJKew",
        "caption": "Photo of Out of The Pan - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cug_LAjCalG4rK0Z3RJKew/o.jpg"
      },
      {
        "img_id": "UHFkMRNd1q_TahYABiKrNA",
        "caption": "Photo of Out of The Pan - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UHFkMRNd1q_TahYABiKrNA/o.jpg"
      }
    ],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "BjQMLvfnW_t_lHcttRRKig": {
    "date": "8/24/2012",
    "text": "If you like crepes then you should give this place a shot. It's hard to miss - next to the fountain in B1 of Raffles City, and it serves both sweet and savoury crepes, the latter in the most unusual of flavours.In addition to their Asian- & European-style crepes, their menu offers a selection of waffles, salads and soups. I tried the Korean BBQ pork crepe but my friend's smoked salmon one was better. What did it for me was the Strawberry Cream - it was just perfect, enough said. A crepe from their menu costs about $14-16 and drinks are $5-7 on average. When we got here there was a queue, but we didn't wait longer than 10-15 minutes. If you like healthier options, you can ask for a whole wheat crepe. I'm probably going to come here more often, so I definitely have to hit the gym more often too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uIMjx3Y-3SAlSxzufowlrA",
        "caption": "Photo of Out of The Pan - Singapore, Singapore. Lovely crepes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uIMjx3Y-3SAlSxzufowlrA/o.jpg"
      }
    ],
    "user_id": "vTo_hR_R5GH4bjmo90HSLg"
  },
  "47jpeM-WPBkvyeHv-RN58Q": {
    "date": "8/13/2012",
    "text": "If you have been to Raffles City for shopping often, you will definitely be aware of this restaurant. It's right at the basement where you can see beautiful water fountain.As it is my first time visting the restaurant, i do not know what to choose. Many different selection of crepes, ranging from main to dessert. I ordered Peking Duck on a Sundried Tomato Crepe, one of the chef's recommendations. Thin slices of duck dressed in a sweet sauce and some lettuce leaves, wrapped in a thin sundried tomato crepe and accompanied with a side salad dressed lightly in balsamic vinaigrette. The duck was not juicy enough, Overall, the dish was not as fantastic as i imagine it to be.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GrtuzMHBlBMW7iYxfCuenA",
        "caption": "Photo of Out of The Pan - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GrtuzMHBlBMW7iYxfCuenA/o.jpg"
      }
    ],
    "user_id": "H5giEryaio2xzYX6qKraPQ"
  },
  "feNdX1Ihu9n3xoDnTKgONw": {
    "date": "8/11/2012",
    "text": "Anyone who has sourced for food in Raffles City Shopping Centre should have walked past Out of the pan. You know it's always there next to the water fixture, but have no idea what it sells. Well, it sells crepes, and it's better than expectations. Their crepes come in flavours that are mostly Asian-Western fusion. There's Peking Duck ($15.50), Tandoori Chicken ($15.50), Korean BBQ Pork ($14.50) to name a few. Others include vegetarian options such as Yum Yum Mushroom ($14.50) and Avocado & Mozzarella Cheese ($15.50). We each ordered one of the above, and also had their Chocolate Mania ($14.00) sweet crepe. If you've noticed, the prices at Out of the pan are not really cheap, especially for crepes, luckily we went during a UOB credit card promotion. Each set of crepe was filling and delicious enough to satisfy a hungry stomach. The sweet crepe topped up as a chocolately dessert shared among us.The food is good. Now if only the promotion runs forever...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gs9z5s2chqJL4nf90q7zMA",
        "caption": "Photo of Out of The Pan - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gs9z5s2chqJL4nf90q7zMA/o.jpg"
      }
    ],
    "user_id": "1wWXchH7yRlFCxfC4dkQnA"
  },
  "fFmRbegFE4famEl57uHNKg": {
    "date": "9/2/2012",
    "text": "I generally come here for the crepes as a dessert and not a main, even though they have them here. Why? The crowds will thin out considerably after lunch and dinner hours and the sweet crepes they serve make for a decent dessert. I've tried the mains, and while they're decent, aren't really what I'm looking for in a crepe. The waffles here are really good as well, so mark it down as a dessert joint and not a place to dine for meals.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "nB2gyTRoOwczRufXnK7P0Q": {
    "date": "8/28/2012",
    "text": "This place is located next to the water fountain of Raffles City shopping more. I had the Peking Duck on a Sundried Tomato Crêpe ($15.50) which is extremely delicious. The duck slices were thinly cut and drenched in sweet sauce and wrapped in sundried tomato crepe and came with salad tossed with balsamic vinaigrette. The skin on the duck was not crispy though, but the texture saved it. Overall, this ranked very highly for me. Do also try the Grilled Honey Soy Chicken ($15.50) which featured chunks of diced chicken drenched in a delightful honey soy concoction. The staff were attentive, and constantly refilled our glass with water.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "VC4z2Fi4j8oUCR7FGadgYQ": {
    "date": "8/14/2012",
    "text": "One of the few places in Singapore that serves a fairly decent savory crepe with a generous selection as well. Owned by Raffles Hotel, Out of The Pan serves a range of savory crepes (Asian inspired to Western) including sweet ones as well. I tried the Korean BBQ pork option which is basically like a hotplate Kimchi pork in a wrap. The flavors were good but there was way too little Kimchi for my liking and I had to request for an additional bowl on the side to kick up the spice! I wouldn't sit by the fountain unless you enjoy the stares you get from curious onlookers coming down the escalators!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  }
}