{
  "TqEKl-ZUawJkhjHNDlnuGQ": {
    "date": "4/26/2015",
    "text": "Big fan of New Ubin Seafood's beef fat fried rice. Sounds like a heart attack waiting to happen but you forget all that when you bite into that tasty black sauce rice with bits of fried beef fat. Oily, tasty and oh so good! The rice goes perfect with the chunks of juicy and bloody medium-rare steak served with horseradish sauce, salt and ketchup.Other outstanding items: The pork knuckles were crispy good. A little dry but just as yummy as the german pubs. The local fave mee goreng looked fantastic too. Then I had for the first time - garlic crab. Fried with butter and whole cloves of garlic, the crab was fresh and really flavourful. Butter dripped down my hands - no complaints.They have quite a wine list too. Pretty fancy for a local seafood spot that's low key and friendly. The only downside to this place is the spotty service. They are nice but disorganized. So patience is key and tip: drink up if you come really hungry!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3c22LgxU9DkpT8oF74754g"
  },
  "_Pjm2C3yVrlFDjwuumADMA": {
    "date": "8/22/2012",
    "text": "New Ubin Seafood is what I'd call a modern day zi char. It might be located in an industrial / residential estate and come with all the trappings of a regular kopi tiam, but a quick glance at the menu and the plethora of fine wines and whiskey will prove otherwise. We were fortunate to dine with A, whose family owns the restaurant so we got properly fed with all the best dishes.We loved both the salted egg yolk and chilli crabs! The latter comes with deep fried mantou that goes really well with the eggy chilli gravy. We also had the hei zhor, salted egg yolk oysters and the HK kailan done in a pretty unusual way. A insisted we try the signature US wagyu steak with potato wedges, which was really good ... but the piece de resistance was definitely the caramelised 'heart attack' beef fried rice, which really was amazing!New Ubin Seafood also offers a wine pairing with the dishes available ... we'll definitely be back to try the shovel nose ray and butter cream crab!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JPVIfbhWBFkybd60P6SL2w",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. US wagyu ribeye steak with potato wedges",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JPVIfbhWBFkybd60P6SL2w/o.jpg"
      },
      {
        "img_id": "645BFoqvF9E_Pyz1x7SwTg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Salted egg yolk crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/645BFoqvF9E_Pyz1x7SwTg/o.jpg"
      },
      {
        "img_id": "Wb_WH_yZ-cPtggVU9BU1FQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Chilli crab",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wb_WH_yZ-cPtggVU9BU1FQ/o.jpg"
      }
    ],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "H9PcNesJAik7BUc4yoHM-g": {
    "date": "9/16/2012",
    "text": "modern zi char...it's a hit or miss for me.despite the location, it is crazy busy especially on weekends. so be sure to make reservations. Service is very fast and no-nosense.We were there mainly for the beef ribeye. it was good, and there is a plate of fried rice with beef fat that comes with the order. The other dish that was good was the veggies done two ways - one traditional stir-fried, one finely chopped and deep fried. can't remember what type of veggie it was.The crispy baby squid is not as good as those in traditional seafood restaurant. The salted egg prawns is also not good, maybe the prawns are too big and the taste didn't get inside. They have both aircon and non-aircon seating.BYO is brilliant!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IJd9M1Rlavzsgi4hQRQqFQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. US ribeye",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IJd9M1Rlavzsgi4hQRQqFQ/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "Al9hwHKLE9GUuHL4-if4Pw": {
    "date": "3/31/2016",
    "text": "Their steak is really not bad, other items on the menu is comparable to other good zichar.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iwyBRww8jZrhZezPzHTNow"
  },
  "ITv8CDL3mB-4101IOzm0-g": {
    "date": "8/26/2012",
    "text": "It's not often you get a zi char place that dishes up Angus ribeye steak. And that for me, was the main attraction to go there and give it a try. There's a bit of waiting time involved, thanks to the hordes that seem to be packing the place, but once your food starts coming, it doesn't stop till everything is served (which is good in my opinion). I kept my expectations of the ribeye steak rather low, to avoid disappointment, but when it arrived, I was really, really happy that they did a fantastic job. Served on a wooden platter with a plate of potato wedges, the Ribeye is sliced into cubes, making it easier to pick up with chopsticks. The other dishes we had along with my steak were good as well, but nothing to shout about really. Overall, I'd say it's a good place to try out. Especially for their Angus Ribeye steak!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "OvSy8lBLCtYtVuY4W7UGog": {
    "date": "9/25/2013",
    "text": "Great! And I don't even like crabs! Must try the steak rice and white lobster! Also watch out for their deals. They tend to have 2+1 deal with crab dishes. Sometimes they even give you lobster as your plus one, which I think is actually a better deal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AhXpSHXjBU95GGxPxQMzWg"
  },
  "huWIHC9t9hJWrRuRH5PJ1A": {
    "date": "9/21/2013",
    "text": "This restaurant is tucked in the middle of Sin Ming industrial park. I givr it points for being more hip than the usual seafood restaurant, great wine list, their BYOB policy and the colorful chalk board menu on the walls. The ambience of the place is pretty cool, with a lot of young people drinking themselves merry with a fair mix of the usual big family crowd. The food, I have to say, in general looks better than it tastes. The bamboo clams could use a bit more flavor (more garlic!) and a tad chewy. The salted egg yolk squid was cooked well, but lacks a bit of flavor despite its richness. The steak was pretty decent, nothing much to shout about, although, I have to say, I'm not much of a steak fan. The beef fried rice was the best dish in my opinion, flavorful and fragrant. The baked garlic crab had a tad too many cloves of garlic even for me. The sauce was sweet and tangy, sorta like marmite, but the crab was not that sweet. The tofu was a disappointment. In general, the food was pretty good, just not as good as I'd expected it to be considering the hype.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cNMaaKH9nOejiJhirAjsNQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Beef fat fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cNMaaKH9nOejiJhirAjsNQ/o.jpg"
      },
      {
        "img_id": "9sYhi1XHHN2XnhprCJm4Ng",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Steak and fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9sYhi1XHHN2XnhprCJm4Ng/o.jpg"
      },
      {
        "img_id": "_zOiSabUQkYRwJfbyqt_Ew",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Salted egg yolk calamari",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_zOiSabUQkYRwJfbyqt_Ew/o.jpg"
      }
    ],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "Ku4JJLVXk0adj7ooWEXrDA": {
    "date": "9/3/2017",
    "text": "Singapore Chilli Crab with fried Man Tou, always my favourite and a delightful combo. This place does it well and at a more affordable price as compared to some other establishments. Check it out for sure!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p1xvn77d_GC9nX9n7PZl7w"
  },
  "3tSmF7FgOO_bf3cbsQJeYw": {
    "date": "12/30/2015",
    "text": "The decor doesn't say much but your taste buds will tell the true tale.  Call ahead. Sitting difficult at times due to high wait.  Parking is also difficult.  We had the pork satay, lobster sashimi , lobster broth soup, deep fried calamari  and salted egg coated squid for appetizers.  Main entrees were ribs, steak, beef gravy fried rice , fried bihon and bread with kaya spread.  Excellent wine stock.  We had 5 bottles of 2004 wines ranging from Shiraz , ect.  They have decanters to allow reds to breath.  Manger very knowledge on his wines. Staff n owner very friendly.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cNrontXl7TroJ9aJxsM--g",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cNrontXl7TroJ9aJxsM--g/o.jpg"
      }
    ],
    "user_id": "CY5yCvzJpkgsQUnO-S1Mtw"
  },
  "nOdFqR6nwCmYGeLSKvceMQ": {
    "date": "5/24/2015",
    "text": "Hard to give s truly indicative rating since we only ordered 3 dishes - Angus steak, salted egg squid and prawns in herbal broth. The steak was nice enough ($12/100g) and was done medium rare as ordered. The real star was the beef fat fried rice that accompanied it though. Really morish, just don't think of the calories. Squid with salted egg yolk was pretty nice too, though surprised that the squid wasn't deep fried. Didn't blow me away but pretty tasty. Prawns in broth were terrific. Very large prawns in a super \"sweet\" and tasty broth, beautifully herbaceous. Would like to maybe try some of the noodles and other seafood next time  Book ahead. We arrived around 6:15 and left at 7 - there was already a crowd outside waiting for tables and I'm not sure if they already had bookings or were walk-ins.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0Z8om5jkPv-OLIlD9iFgHg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0Z8om5jkPv-OLIlD9iFgHg/o.jpg"
      },
      {
        "img_id": "miHKHFwFaPIwUe3GszovDg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/miHKHFwFaPIwUe3GszovDg/o.jpg"
      },
      {
        "img_id": "Mx8OoPB6knGZoCkQwAvNGw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Mx8OoPB6knGZoCkQwAvNGw/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "yP-ycvbnmF24ABFrFOI0Rg": {
    "date": "9/22/2013",
    "text": "New Ubin Seafood is... not on Pulau Ubin anymore. Despite that, it is still somewhat out of the way in Sin Ming, hidden in an industrial estate behind all the vehicle repair shops. This place serves an eclectic mix of the usual seafood dishes and western-inspired fusion dishes with a twist.The first thing you observe is the USDA Choice Ribeye sitting on everyone's table. This is the star dish. An interesting take on steak, it is grilled to your specifications, cubed and served on a wooden board. Caramelised onions, fries, mustard and ketchup complete the setup. Accompanying that is an extremely sinful fried rice on the side, containing the trimmed beef fat from the steak. Essentially heart attack on a plate! So bad yet so good. The \"wok hei\" aroma is apparent, and the rice bursts with fatty smoky flavour, not overly oily or soggy.They also serve up a fairly decent salted egg yolk crab and chilli crab (see photos). The rest of the day's offerings and experimental dishes are written on a chalk board on the wall. I also heard that the \"boss\" bee hoon (rice noodles) is also a good dish to try, however I did not get to order it this time. The boss is Mr. Pang, and that's the way he likes his noodles. The Shovel Nosed Ray and German-style Crispy Pork Knuckle are also good bets.I'm not sure why there is a proliferation of 3 star reviews. I guess Singaporeans are extremely hard to please and spoiled for choice in this food mecca. No matter, I'm coming back the next time I'm in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5zyOIBlgnKCHvN0SV2PinA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Salted egg yolk crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5zyOIBlgnKCHvN0SV2PinA/o.jpg"
      },
      {
        "img_id": "0iOeHjLnDZCfI2Up28HXAg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Beef fried rice accompanying the USDA Ribeye. Notice the fat sitting on top.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0iOeHjLnDZCfI2Up28HXAg/o.jpg"
      }
    ],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "-I1w9WnbQaksWQ1OIJSQwg": {
    "date": "12/15/2017",
    "text": "Easily the worst crab bee hoon I've had. Ordered both soup and dry versions of the crab bee hoon and we were all taken aback by how terrible and insipid both dishes were. The soup tasted diluted and stale. The bee hoon in the dry dish was bland beyond belief. Both were left unfinished even given how much we spent on it. The crab meat was sub-par -- tough at points. Far behind the rich, flavourful dishes you get at Melben's or Sin Huat (even though the latter is pricey too).",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJWt7F1Uyq0nA1r4rmhlGA"
  },
  "gwrV6ifd1yMe2xQhf447ow": {
    "date": "1/14/2014",
    "text": "I'm not sure if I classify this place as western food or zi char, probably a fusion of both?The rib eye steak is a must order! You'll probably see this dish on every other table anyway. Dont forget the beef fried rice too!The sambal kang kong and hei chor are both pretty standard zi char dishes. Fairly decent.Definitely make a reservation before coming since it gets pretty crowded.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d5PWk57vq_08tBMoqumodA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d5PWk57vq_08tBMoqumodA/o.jpg"
      }
    ],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "Gpwm3s3YZy-1_s0M19Cp0w": {
    "date": "8/29/2014",
    "text": "Finally managed to grab dinner here after 3 tries- it's almost fully booked on weekends, and reservations are a must. (you wouldn't want to travel all the way here just to find out that there's no space available, would you?)Best recommended for big groups, so that you get to try the large variety of dishes available- their menu is really extensive! Since there were only the 2 of us, we settled for the rib eye steak with beef fried rice (minimum 500g- $60) and oyster omelet. The rib eye steak is a must-order, our medium well USDA choice ribeye was cooked perfectly, and firm yet tender. It came with sides of potato wedges (so-so) and ketchup/mustard/salt for dipping- but these really aren't necessary as the steak already tastes SO good on its own! The fried rice (fried in the beef fat, only available with an order of the steak) was good (the best bits were the crunchy pieces of ?fried beef fat) and tasty but not as mindblowing as expected (perhaps my expectations had been raised too high after reading so many reviews about this). On the bright side, it also didn't taste as unhealthy as expected!Our oyster omelette with sambal was good- while I'd have preferred it to be a bit more crispy (like the one at Newton Food Centre's stall 73!), they were very generous with the oysters (my dining buddy commented that it was the plumpest oysters he'd ever seen in an omelette) and the sambal was rich and flavorful.Seems like a return trip will be needed to sample the rest of their offerings! Maybe with a larger group next time. Yelp dinner, anyone?",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "FWLkUmt4IGXI8m_ylG-G2w",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Heart-attack-inducing beef fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FWLkUmt4IGXI8m_ylG-G2w/o.jpg"
      },
      {
        "img_id": "ZAtUXRmWJ9qv43jxsWuMMw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Rib eye / must-order!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZAtUXRmWJ9qv43jxsWuMMw/o.jpg"
      },
      {
        "img_id": "6_2whONd_7HWutc3dN8GHA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Oyster omelette with sambal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6_2whONd_7HWutc3dN8GHA/o.jpg"
      }
    ],
    "user_id": "RbecDhCFzlsmPwSEAoYBpA"
  },
  "fEirotG6r5widqnZOZIFYA": {
    "date": "3/29/2016",
    "text": "Best dive you'll ever dine at... that's if you can find it and then dare to go there. Get the foie gras skewers and the Sri Lankan 1.45 kg crab. And eat in the air conditioned egg carton ceiling room.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DNntARwKLJmAMH-FgihowQ"
  },
  "qavGnHVmC0rO1u5l6ReboQ": {
    "date": "4/21/2014",
    "text": "A $20 taxi ride via a few back streets and u-turns eventually got us to this little semi hidden gem in an  industrial estate opposite a panel beaterbut given it was a Monday night  the place was humming with tables of 6/8/14 people so clearly the locals must love it !!!S$9:00 for a 700ml bottle of Carlsberg was a good find and the Saint Claire SSB from NZ was  a little pricey @ S$45 but eminently drinkable!Crispy squid was not what we expected but absolutely true to description... whole baby squid fried until ... crunchy...S$14Slightt mix up with rhe angus rib eye saw us hooking into the beef fat infused fried rice and then moving on to the Wasabi prawns.... $9:00/100gms so S $27 for 4 bigguns that I can still taste now!!! Great!Rib eye arrived cooked as requested (Med-rare) and gorgeous melt in the mouth Angus that would rival Wagyu for taste and tenderness...accompanied by a nice dijon sauce and some caramelized onions this was a highlight and so filling we left the wedges and dead horse (tomato sauce) be ause we were STUFFED! S$200 For two inc drinks and 2xTaxi fares  seemed like good value - highly recommend by these two Aussie Yelpers and thanks for the suggestion from the Singapore Yelpers!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MOVhJ2nvS3go0XOUPZy0rQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Angus beef....mmmmmmm good about S$70",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MOVhJ2nvS3go0XOUPZy0rQ/o.jpg"
      },
      {
        "img_id": "yH1f5jczt7jgCRXHVnFHkw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Big juicy Wasabi prawns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yH1f5jczt7jgCRXHVnFHkw/o.jpg"
      },
      {
        "img_id": "aZCRQqckKeilHvqRHP4ldA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Crispy/crunchy little suckers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aZCRQqckKeilHvqRHP4ldA/o.jpg"
      }
    ],
    "user_id": "MmTG0_aDuw274H7pzBSB6A"
  },
  "LFxqv3nCnRSJ5BxLE-Wl7g": {
    "date": "3/23/2014",
    "text": "Reminds me of Malaysia and Indonesia seafood restaurants! This is definitely not your high end seafood restaurant and I probably wouldn't come here just for the seafood.The tender beef with the fragrant fried rice is definitely a must try. The salted egg squid is also awesome. Even the veggie with kale is prepared like no other restaurants that I've been. Basically, you can't go wrong with all the recommended dishes!Although, I must say, the black pepper crab was a bit dry so you are better off with the chili crab. Don't go for the special, get the big crab, much nuch better...This one is definitely on the to-eat list for Singapore!Oh, definitely make reservation, even though it's out in nowhere, it gets packed...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vHdtI28DBP_KqUPllp62wg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. kale",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vHdtI28DBP_KqUPllp62wg/o.jpg"
      },
      {
        "img_id": "deyOkCIvSH1jToF3PKflrQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. salted squid",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/deyOkCIvSH1jToF3PKflrQ/o.jpg"
      },
      {
        "img_id": "3rViNEmZT86ThR7Fu3Zh-g",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3rViNEmZT86ThR7Fu3Zh-g/o.jpg"
      }
    ],
    "user_id": "jL_F0469SKjLZ8hgxm7smA"
  },
  "MZGO2m5tHr-e2mwMYkXHaA": {
    "date": "3/3/2016",
    "text": "My uncle raved about this restaurant! It was so awesome he made an impossible reservation and took us to dinner. It was hidden in an industrial area where there were car garages but obviously there was a great following and people knew exactly where to go. There were both indoor and outdoor spaces. They also allowed BYOL - bring your own liquor? It seemed like a favorite activity amongst the diners. Besides that, they also boast a great collection of French wine and liquor of their own. The menu was eclectic, a mix of local favorites with imported high end ingredients. For starters we had these fresh scallops on half shells, lightly steamed with garlic and light soy. It was tasty! We had local favorites like the satay, salted egg squid and vegetables half cooked/half fried. They were all good! The angus steak seemed like a signature dish, served with some fried potatos (chips). It was ok I couldnt comment much as I could not eat the mostly medium rare meat and had just returned from Kobe where I had A5 kobe beef that melted in my mouth. And I live in the US where my favorite cut is New York Strip. The fried rice cooked with the beef fat was interesting as well as the chay po fried noodles, I really enjoyed the crunch texture of the chay po. Overall it's great place for good food. Service was also excellent. I would go there again but would have to be able to get a reservation!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_OETe5Xr26FTNRPkRQ4zw"
  },
  "Mfyyz7yQl2JkBlybFRKEuw": {
    "date": "11/6/2016",
    "text": "Love this place and quite sad to see it move out of the neighborhood...their online ordering system is also excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eoCOG6LK_c0JcrU31OAnjg"
  },
  "6GU1bO-6F3D8y1BHQdE99Q": {
    "date": "3/28/2015",
    "text": "Beef = Yes. So we went crazy and ordered alot because... I don't know, everything seemed appealing. Western is better than Eastern here honestly. The steak and heart attack friend rice was good, tender and juicy. 'Signature' bacon fried rice was pretty good too. Sad we didn't have space to try the foie gras satay. High on the oily side but hey, we weren't there to unclog arteries, they delivered what the menu described.Seafood =  No. Buy 2 get 1 free crabs was a good deal for the tourists in our group to get to try 3 different flavours. We ordered salted egg yolk, black pepper and butter crab. All came slightly over cooked and tough but taste was ok. I don't think this is where you go for the authentic Singapore Chilli or any crab experience. Butter crab came in starch soup with no butter taste. Cereal Prawns' cereal came out sweeter than any other cereal prawns I've tasted. Disappointed. On the menu, salted egg yolk squid looked pan seared, ours came out looking white broiled and mixed with salted egg yolk but the flavours did not meld. That made me wonder why other people were waxing on about how good their salted egg yolk squid is. Maybe we got a different chef that day. Basically, pay a little bit more and go to the big wigs of seafood heaven elsewhere.Service = YesThere was a confusion in tabling but I won't elaborate. Waiters were nice and gave helpful recommendations, knew the extensive menu and prices off the top of their heads. We added orders three different times from 3 different waiters so service was consistently helpful.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IKDi-XHJJ-bCR28yDBZOnA"
  },
  "ZZqHWhTltCtmgKJFsp9PUw": {
    "date": "8/3/2013",
    "text": "You must try their signature dish: US Angus beef rib eye steak and the beef fried rice. The beef is tender and juicy and the rice is so tasty, it just makes you want more.If you want to go on a weekend, you must definitely call in to reserve a table. Despite the reservation, I still had to wait a good 20min before a table was ready for my family.Parking is a problem too. Be prepared to park at least two lanes from the eatery.But all these aside, this place is worth patronizing.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yQXxHgqSFsYYpudCLkezKA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Almost gone. Yums",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yQXxHgqSFsYYpudCLkezKA/o.jpg"
      },
      {
        "img_id": "8KHzNO9CZER3_9KVNa0WzQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8KHzNO9CZER3_9KVNa0WzQ/o.jpg"
      },
      {
        "img_id": "WaUmXdl8-J3XrWfVpU9y2g",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Braised Crab on Bee Hoon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WaUmXdl8-J3XrWfVpU9y2g/o.jpg"
      }
    ],
    "user_id": "Hc5Y3Gk6p-GerRM70tQpJQ"
  },
  "FsUI2moSa1NLmwbC2XT2tQ": {
    "date": "10/12/2014",
    "text": "One of the best local cuisine spots in Singapore. It's a bit out of the way for most people but the food is consistently good. Like that it's a mix of local and international dishes. The butter cream crab, fried eggplant and salted egg squid are my faves. For international, try the foie gras satay - and the Wagyu beef with fried rice is a must-have. The only complaint I have is regarding the inconsistent and, at times, rude service staff. A handful are very friendly and helpful while other servers are extremely short when dealing with basic things like taking orders for the table. One night, a runner started clearing our plate of chili crab which still had about three pieces of crab left. Then she cleared two sets of cutlery and dishes without replacing them. We thought she was replacing our plates, as requested, but we were wrong. And the woman who helps assign tables for the servers (sitting with a tablet device and near diners) curses repeatedly to her colleagues. I get they're having a good time and most likely joking with each other, but it's unprofessional behavior for any restaurant. Jolene who helps schedule group bookings and the private dining rooms is fantastic - super friendly and helpful. Regardless of the service inconsistencies,I'd definitely go back for the good and affordable food (no corkage is a major bonus, too!).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "6SqRvIk3H0n02M3RhjmQrA"
  },
  "7GyrNXaIVukbzWdUGBKpNA": {
    "date": "3/6/2016",
    "text": "Looking for chilli crab but want to avoid touristy places (I still love Jumbo)? opt for this hidden (literally hard to find - make sure you uber/grab tax) gem which brings to the table the basic SG seafood staples (Sri Lankan Crab) with some atypical complimentary dishes such as american angus ribeye steaks, foie on poached egg, and sashimi carabinero shrimp, etc. For the price, you're getting above par food with decent service in a environment that one may describe as 'very authentic/local'",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vIjSA6rHk0UoXKJycGyXtQ"
  },
  "DwvFIr79K3Q8F-HVsCnTtA": {
    "date": "10/27/2015",
    "text": "So this place is a little sketch hence -1 starThis place is also a little dirty hence another -1 starBUT!The food is pretty good and service for me at least is not bad because my father in law knows the owner (if I don't go with him who knows, maybe it's different) another star deduction maybe if their service is not so good when I go myself? haha jkWhat to order:Chili crab and black pepper crab (most expensive thing on the menu for us.. I prefer black pepper)American beef steakBoss bihun is well known here (a bit spicy so be careful for the non spicy people)Tried the beef fried rice too but I think the boss bihun is betterI forgot what else we ordered but these are the main things to order I think. I've never actually seen the menu, it's more of a local thing, the locals order and then you just eat. They have indoor and outdoor seating, but mainly people will sit outdoors. Bring hand wipes or something, they have a sink and soap but just be prepared because in Singapore it seems you always need to bring your own hand sanitizer because I find that their soap is not sufficient for me. My hands will still smell like crab afterwards, so I recommend bath and body works or Aesop hand sanitizers to make your hands smell nice and clean again after your wash your hands twice with soap ;)",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PK5NTAjdVY9mPdtwU0Ve3Q"
  },
  "ZEegzGLmCGgBGGEliSEEPQ": {
    "date": "6/27/2015",
    "text": "Wok hei is hard to come by but the dishes we ordered had this in abundance. Our family of 11 had a great time. Favourites were the Boss Bee Hoon, looks like nothing but rich scrumptious flavours fill the palate; Smoked Pork Carbonara lorded  it over the famous Heart Attack Fried Rice; and the brinjal was uniquely interpreted, do try it. We ordered many dishes and everything was either good or excellent. It was evident that talent in the kitchen was a priority.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "xiYPnFLCVV7PsGRq5Lqx7g"
  },
  "enGzHEVy1uTRIGOf4JXnTw": {
    "date": "1/26/2014",
    "text": "One of the best finds on my most recent trip to Singapore. Great for big groups (13 adults, 14 mostly seafood dishes, app S$350).Highlights:Buy 2 get 1 free crab. We had the garlic, black pepper and salted egg crabs. Garlic was surprisingly yummy. Thought it was gonna be plain. Fried rice from the ribeye steak. When it was placed on the table, all of us were so confused. What was that? Then we dug into it and I almost hoarded the entire plate. Deliciously smokey and amazingBoss fried beehoon. Another delicious carbHokkien Mee. Perhaps a little too much gravy, but yummy nonetheless.Prawn paste chicken. Crunchy, tasty but my fave is still holland xo fish head beehoon's. Was surprised too, by the extensive and fairly reasonably priced wine list. Only minus is the location. Completely out of the way and hard to get to, unless you're driving.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lCmvpQfFpdxhbWVM59eUCg"
  },
  "Wcb2iSmCJp1JNlkDo3ZWFA": {
    "date": "3/6/2015",
    "text": "huge fan. tasty as always. buy 2 for 1 crab deal is awesome with my crab lover friends. and never failing to have the tender and juicy beef steak! :D yums",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "GbV_dgwQ5QLPghx047d9Ig",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. The standard must haves. Beef and crab. 2 get 1 free deal!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GbV_dgwQ5QLPghx047d9Ig/o.jpg"
      },
      {
        "img_id": "1CLCQ-RFv7_G32a7xa-yIg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Beef 500g! More people to share please! Comes with rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1CLCQ-RFv7_G32a7xa-yIg/o.jpg"
      }
    ],
    "user_id": "rWM9b0X9eKkAGdkBjpGGJQ"
  },
  "N8Zno8EPBum2gZjgrNDoIw": {
    "date": "9/26/2018",
    "text": "New Ubin Seafood is one of the most interesting restaurants I've had the good fortune to enjoy in Singapore .Our dinner tonight was arranged by a friend who is a local.  The entrance of the restaurant is at a parking garage of an industrial area of Singapore.Christian, the owner's son was a great host.  He was personable, he had a lot of fun facts to dish out (no pun intended) and he gave us numerous suggestions for other restaurants we can try during the rest of our stay in Singapore .We started with a deliciously and boldly flavored rice noodles - the best rice noodles I've had to date.The black pepper Crab  was incredible.  Christian even provided us with the sauce that is usually served with chili  Crab - we had the sauce with delicious man tou (fried steamed buns) instead of the Crab  since the black pepper Crab  stood on its own.The Oyster pancakes were great.Another highlight was the Steak  which Christian was pushing for us to order- no regrets, everyone at the table loved the Steak .I also loved the steamed Fish  Hong Kong style.  Nice fresh, fresh water fish, steamed the traditional way with soy sauce and scallions.  The magic was created with the addition of fried chopped garlic.  The steamed Fish was a wonderful rendition of a dished Ive eaten and enjoyed hundreds of times in the past.Great food experience in addition to the interesting location and decor.  Plus Christian was a wonderful host.I'm my opinion, New Ubin Seafood should be a must try restaurant list for visitors to Singapore .Wow!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "ao9yPJE7gR-7zL_UQvM2MA": {
    "date": "10/3/2018",
    "text": "Back again on Oct 3rd '18.   Did the reservation for 7:30pm but came in about 6pm.   After we left at 8pm then we got a call checking if we are showinh up for dinner??!!   i would have gladly given a 4 star but two staff at the wheel amd still getting things wrong? that is a one star gone :).   For this round yet again to us the star dish is still the mee goreng.   the fish with sambal chinchalok was second and of course the BBQ King Prawn.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "5MlymmccLoqRUAnYM3hqeA": {
    "date": "8/11/2018",
    "text": "service was not fantastic and it was just a gloomy atmosphere for a Sunday evening. My favorite dish was the steak set. grilled to perfection and a delicious fried rice served on the side. side perks: if you like their facebook page, you get a free glass of lime juice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "A5ActkQ-fgGiW631BnwF6A": {
    "date": "3/25/2018",
    "text": "Made reservation for and got a big round table in the air conditioned room for a family dinner.   There were 14 of us.  Lots of great food with crab at the end.  The dishes started coming out slowly like an orchestra slowly setting up on the stage.  First came the plate of broccoli. A few minutes later the chicken satay.  Then the large shrimp lined up on a plate came out like a drum roll.   Conversation poised for more as the fish roe balls scooted in followed by the fried rice and shrimp noodles.   Everything tasting and looking delicious.   Just one thing missing.  The first string violin.   And there it came.  The audience looked up in awe, quieted down as she took seat.  Plucking a single string to tune the orchestra.   It was the one and only.  The amazing chili crab.  Great meal.  Great service.  In a fun filled casual family setting.   Enjoy.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4YEJ_ofObovdL_B4gcS-Zw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4YEJ_ofObovdL_B4gcS-Zw/o.jpg"
      },
      {
        "img_id": "mzXH4Xl-gAkibw7MGbWfdA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mzXH4Xl-gAkibw7MGbWfdA/o.jpg"
      },
      {
        "img_id": "IwpEUIywKP3NbiaGi_tIbQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IwpEUIywKP3NbiaGi_tIbQ/o.jpg"
      }
    ],
    "user_id": "RKfETgoe0wuZds8EMDBw0Q"
  },
  "XNWc1jYjdb1Zu4wCHwyMlg": {
    "date": "5/9/2018",
    "text": "I maintain most of my ratings below for the dishes I reordered this year. However, the smoked pork collar really dropped in standard. It was delivered a lot lighter looking than last year and tasted overwhelmingly smoked instead of savoury per se. I especially confirm my previous recommendations of the garlic crab and hokkien mee - please don't miss out on these!There used to be a buy 2 crabs get 1 free promotion, which doesn't apply anymore. That really raises the price of dinner. Corkage is still free though!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yrLYyzU7AhG9BgLuC16ygw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Do not get!! Horrible ice-y ice cream!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yrLYyzU7AhG9BgLuC16ygw/o.jpg"
      },
      {
        "img_id": "u4j1tLOt40X5La__ZOBaQQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u4j1tLOt40X5La__ZOBaQQ/o.jpg"
      },
      {
        "img_id": "mmXtbSt42b5_IZ3iIeTYpw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mmXtbSt42b5_IZ3iIeTYpw/o.jpg"
      }
    ],
    "user_id": "3Mils6AfdsCgUah7jmTd1Q"
  },
  "9W0dGUPPnU90L0r8LxMAOw": {
    "date": "7/21/2018",
    "text": "Its a long journey out to Hillview for the original New Ubin Seafood, and its sorta worth it.They use high quality chicken for the satay, which is of the best I've had in Singapore. The caramelised eggplant is crisp and delicious, alongside flavoursome Kai Lan. The famous Ribeye didn't blow me away - and at this price, it probably should. The Prawns were delicious and the heart attack rice was rich and moreish.Delicious? Yes. Worth the journey this far out?Probably not.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-S7_R9du3GsIT7AwAv9ww"
  },
  "g8JEFtu8IHxXiTTFBctIEw": {
    "date": "8/8/2018",
    "text": "This restaurant is not an easy place to find. It is tucked away in the back of a parking lot in an industrial building. My former coworker took me here to have a local Singapore experience. Given the location the food must be good. It is definitely not getting any patrons from street traffic. My 4 star rating is based on the following:Food: 4.5 starsAtmosphere service: 3.5 starsValue: 4 starsRecommended dishes: salted egg crab, sate, & beef fat rice. My favourite dish here is the beef fat fried rice. It is also known as \"heart attack rice\" because it is prepared by using the rendered beef lard from the steaks they make to fry the rice. You really can taste the beef lard flavouring and is the one dish that I had which was really memorable. The salted egg crab was also a good dish. This is something that not everyone will like but if you have a Singaporean or Cantonese palate you will love it.  The sate is also good but not necessarily better than what you would find at a hawker center. They are still way better than anything you get outside of South East Asia. The steak here is ok. Not bad but I wouldn't recommend ordering it given the other options. We didn't have the chilli crab so I didn't comment on that. Overall a really good meal at a decent price. I left the place stuffed and needed to go for a walk after dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-PdP5aXeLGG-Bmg1Wd0KQ"
  },
  "GcK_Ya8-6EB4TbeaCeIftQ": {
    "date": "8/6/2017",
    "text": "Came here for a team dinner to have the famous Singaporean chili crab. The taxi driver warned us that it was in an industrial area, and he was right... not sure it would be so easy to find on your own.We were quickly seated and while there was plenty of room when we arrived, the restaurant was packed by the time we left.We ordered a variety of dishes including the chili crab, black sea bass, mutton satay, a veg dish. It was an insane amount of food, and we made a reasonable dent in it.We finished with desserts of Kaya toast, gula malaka.I think our server may have picked larger crab and fish for us, leaving us with leftovers we couldn't take, but service was attentive and helpful. If you can find your way there, you're in for a treat!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BwpJ_b_cUX4XB71J4wm3qA"
  },
  "nRLGUxXL1vXsFGcgMgUyAQ": {
    "date": "6/27/2018",
    "text": "Good food but a tad pricey. Reservation necessary. Must try the steak and rice fried in beef fats.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K43SkdYq7-ih9gruxeJSVw"
  },
  "m2FY6ly-T-tw1JayflL2Lw": {
    "date": "5/17/2016",
    "text": "Very good and very consistent tze char at this almost hidden restaurant located in Sin Ming industrial estate. Getting there might be a bit tricky. If you come from Upper Thomson Road, it will be quite a walk into the industrial area and nearer if you come from Marymount Road. A little tip on how to get there - stop at the bus stop opposite Whitley Secondary School, just 2 stops away from Marymout MRT station. Once at the bus stop, walk down the slope of stairs and you'll pass by a basketball court on your right. Follow the smell (haha.. ) and as you reach the first junction, turn left. Voila! that's the place! Now that you're here, probably sweating and panting from the walk, what better way than to reward yourself with some unpretentious, delicious food this place has to offer. It was my 2nd visit (first was 2 years back) and the food is still as good as I can remember.  This place is very famous so book in advance especially if you're coming in big group. The restaurant adopts a pretty high tech reservation system. It is linked to chope.com, even if you call, the automated teller will ask you to leave your phone number and will send you an sms with the link to the website. AMAZING ISN'T IT? Gone are the days when you're put on hold until god-knows-when and when got through only being informed that it's fully booked. #wtf The food - Ive tried a fair bit of their bestsellers here. From the famous rib eye steak that comes together with a plate of cow fat fried rice, deep fried pork knuckle, fried noodles, steamed fish and bamboo clams, crabs and various Chinese stir fried greens. The rib eye steak is good and a must order. Tender cubes of meat grilled to perfection accompanied with potato wedges and various dipping sauce (mustard and ketchup). The cow fat fried rice is superb. Even though your arteries might hate you, but this once in a lifetime fare should not be missed. The fried rice is filled with layers of flavor, most importantly \"wok hei\", a Cantonese term meaning the energy from the wok when stir fried over high heat. It might look simple and not entirely photogenic, but the minute you devour it, trust me, you'll be in heaven. I would highly recommend this place if you have a bunch of friends and crave for a good tze char fare with everything for everyone - meat, seafood, vegetable. Everything also have lah!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "2XMcWoM0CXmQF8pAvy3rJg",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. make sure you book a table in advance, via chope.com",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2XMcWoM0CXmQF8pAvy3rJg/o.jpg"
      },
      {
        "img_id": "to6MMGAgYYglXMIF3CosLA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Foie gras satay? Foie fras egg?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/to6MMGAgYYglXMIF3CosLA/o.jpg"
      },
      {
        "img_id": "2xxPGobvp-MqER0TNFAYQw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Bamboo clams",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2xxPGobvp-MqER0TNFAYQw/o.jpg"
      }
    ],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "WP5SUC0RgsJWUYeqKbl4RA": {
    "date": "2/27/2017",
    "text": "New Ubin SeafoodTip: Park upstairs @ Level 6. It is next to the carpark. Don't go into the industrial building space.This is the Canteen but Yusuf Nasi Padang closes at 3 p.m. 3 outdoor zones2 air con zones - book early.From 6 p.m.  You get 1.5 hours to eat. We called on Saturday for dinner on Saturday. Not a single table left unless it's at 9.15 p.m. !So here we are on Sunday night.Garlic baked crab 1.4 kg -  ordered on the recommendation of the owner's son but we much prefer the grilled pepper crab we had the last time Crispy baby squid - better than Jumbo @ DempseyStir fry Hong Kong Kai Lan with a nice touch of fried seaweed Mee goreng - better than Jumbo @ DempseyLime juice - good although it's not fresh lime juice",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "ZfGZxuAsh2f6mw6Lb2kITA": {
    "date": "6/9/2016",
    "text": "When the Hong Kong relatives were here, we brought them to a seafood dinner at New Ubin on a Tuesday night. Surprisingly the restaurant was crowded but with a reservation, we didn't have to wait for a table and the food was quick to arrive.  For the 6 of us, we ordered a fairly large amount of food. Not all pictured here because at some stage (read: when the crab arrived), I just didn't bother with the photo taking.There are certain foods that (in my opinion) are definitely not to be missed at New Ubin, and they are :(i) Boss Bee Hoon (say hello to a tasty plate of pan fried bee hoon with just the right about of char, lots of wok hei and lardy flavour!),(ii) 3-egg spinach - you need some greens to balance off the guilt. while it's not extraordinary, it is well done, not too salty and greens are fresh and still crunchy.(iii) Garlic baked crab - the garlic has been fried / baked til soft and they are so tasty and addictive. I can attest to that because I ate more than 40 little cloves and still I am salivating just thinking of it.  Beware though, eating too much garlic causes fatal gas! D will tell you that :P",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TF3crOdTDEkDhFzFbVnTWA",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. herbal prawns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TF3crOdTDEkDhFzFbVnTWA/o.jpg"
      },
      {
        "img_id": "W_KplpvuOHhWcxPiakVJxw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. oyster egg + 3 egg spinach at the back",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W_KplpvuOHhWcxPiakVJxw/o.jpg"
      },
      {
        "img_id": "ZqbV3PaDx_TuPEXWp2Crsw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. `garlic baked crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZqbV3PaDx_TuPEXWp2Crsw/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "blGZadWTcaTTRrY_4NBbsw": {
    "date": "2/3/2018",
    "text": "Steak and fried rice was superb. Had the 500gm garlic crab and was heavenly. The chili crab 800gm was not as good but acceptable.$305 for a table of 6 in the aircon room as worth it and the service was good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IHw0VJ44ydiJGei5TVfkQ"
  },
  "68Rc6RBX0NT_BG5saaisjg": {
    "date": "11/22/2016",
    "text": "Good news to Westie! For those who have not heard of the relocation of New Ubin Seafood, I'm please to tell you that they are now located in Hillview, Lam Soon Building.The reason of their move from Sin Ming Industrial to Hill View is that the original area will be redeveloping in Dec 2016. Though it is still located in Industrial Property, I already feel the great difference as soon as I stepped into the canteen of the \"ulu ulu\" Lam Soon Building.It was horribly packed with people, be it expats or local. Not to mentioned that the private rooms were also packed with people. I was kind of amazed that the roads outside the building was quite calm and quiet while the entire canteen was bustling. Lightings were well hanged on the ceiling, creating a different kind of atmosphere apart from the old facade.Having visited on their 2nd Day of opening, I can see that staff were still not very familiar with location of table numbers and hiccups were visible. Nevertheless, staff are friendly and trying their best to serve.Since the set comes with two bottles of Pellagrino Sparking Beverage, we decided on Mandarin Orage and Limon Drink. Drinks were served in its original glass bottle and comes together with a chilled glass.I didnt give the menu too detail a look before ordering the set meal, thus I was kind of surprise with Sous Vide Egg and Char Grilled Foie Gras served. It was indeed a very special and total new experience to me to have such dish from a Cze Char place. Moreover this dish was scented with truffle Salt making it out of the ordinary.We were more than amazed to be served with another special dish before our eyes. Hong Kong Kai Lan was specially prepared with its leaves fried to achieve a crispy texture while the stalks still remain in its crunchy \"green suit\". Though special, a little down side about the dish is perhaps its oiliness.You can choose fresh Carabinero Prawns or freshly chucked oysters Sashimi as your starting appetizers. However if you are a non Sashimi diner or do not feel like having raw food, don't worry, there is still alternative for your appetizers. The Chefs are flexible and can change the style in cooking the Oysters for you.They suggested that we go for Oysters Mornay with no additional cost incurred for the similar menu.Though it may takes a little while for these Fresh Pacific Oysters to be served, its totally worth the wait. The Oysters were well cover by the creamy cheese sprinkled with chopped parsley.We choose the US Black Angus with fried rice to the meat platter. If you choose the meat platter, you have 3 choices to choose from, New Zealand Lamb Rack for 2, Small Size Smoke Pork Collar or Kurobuta BBQ St Louis Style Ribs (Half Rack).Interesting enough, US Black Angus deserved some praises even though it may not be the prime type. The steak cubes were well executed and definitely worth every cent that I had paid for. The total sums up to about 600g, perfectly prepared in medium rare doneness with distinctive char flavours sprinkled with grinded blackpepper corns.They were served on a heavy wooden chopping board with potato wedges as well as caramelized onions by the side. Condiments like sea Salt, Ketchup and mustard were readily placed by the side. You won't regret ordering this!I guessed I will regret if I'm skipping this. The fried rice was definitely awesome. It had the style of Claypot Rice coated, best still with every grains coated in the sweet black sauce. It was savoury by itself even if did not paired with those Ribeye steaks above.Balancing out the Fusion, we had something local from the Dessert menu. Durian Pengat was served in small bowls warm and if you like it, you can add some coconut milk to enhance its taste.I'm not too much of a coconut milk fan and thus I added quite little to my dessert.Banana dessert was served in a hot plate. With Gula Melaka coating all over the banana, the fruit can never be sweeter! The texture was soft and together with the sugar, it was totally not my kind of dessert.The plain and not so sweet coconut ice cream served had actually complemented the sweet dessert well. Cooling and refreshing ending we had here!After paying the bill and nearing the exit, we noticed this gigantic chalk board that had drawn up with 18 kinds of recommended dishes in Snake and ladder form. Perhaps the next visit, I will need to throw some dishes and decide my dishes! :)Being one of the happier folks in the West to welcome New Ubin Seafood, I will not deny that Cze Char Places like this has come to a whole new level with creative dishes. It is no longer the traditional kind of Cze Char that we are looking forward to nowadays.Now, don't say Hillview Area is \"ulu\", you will find hidden gems like this there! *Winks*",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "w91OgyE6GjOuZ_MtBk21uw"
  },
  "xA8_kJ4XZuCBE8yn57vjhg": {
    "date": "5/4/2017",
    "text": "Not the easiest place to get to without a car. But that has not stopped anyone from getting a good meal... (plus this time, I had a car hahahah)... this is in Hillview, turn off to a warehouse looking place, with big trucks and lorries all over. Read reviews that should park on 6th floor where the restaurant is location but we paid no heed to that. Parked on the 4th (ground level parking) and took the cargo lift up. That was easy enough, but maybe should have gone up to the 6th floor as recommended by the review...Despite being a Thursday at 8pm, the place looked packed. When we asked for a table for 2, a tiny table next to the \"reception\" area was pointed to us. At least there is a table right? We saw people coming after us, we got turned away or asked to wait.Sat down and took in where I was - a warehouse looking building, open air, a big canteen sign at the restaurant, seemingly full place, there is a aircon area, and ppl were drinking and had loads of food on the table.So we ordered. Wanted oysters so that was the first thing we looked at - $4 each, buy 10 free 2. So obviously we ordered 10+2. The steak was also highly recommended by reviews so we went for it. Plus two coconuts. Oysters were great! Plump and juicy.... steak came all cut up (since we were eating with chopsticks so it made sense). It was good. Steak came with a big plate of fried rice (delicious! But had so much food! Had to ta pau and it was just as good when I reheated it for lunch the next day) and wedges (very good - Crispy on the outside, soft and mushy on the inside) and half boiled egg with foie gras topped with truffle oil. I don't eat foie gras because of how you get it (I know, arguable for everything that we eat, but to each his own), so Friend ate it and enjoyed every bit of it, and I had the some of the half boiled eggs - which was perfectly done - and I need to now go get truffle oil to put on my half boiled eggs when I go to Toast Box or yakun It was an extremely enjoyable meal. We also took went around the restaurant abit to see what else is there - the usual seafood flare, a lot of ppl enjoying a lot of food and beer on the table. But this meal didn't come cheap. All in $160. There was a set meal for 2 on the menu for $135++ and we would have gotten much more food - not that we would have finished.. cos as it was, we finish everything and ta paued the rice and wedges - waste not want not - pls order responsibly. So ya, good food but be willing to pay. Can't wait to organise a dinner there with a bigger group and try other stuff on their menu!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tOnAuTqwPr5fwoVsXJ4s8A"
  },
  "EBWOec11rq2F5V0FKPqyZw": {
    "date": "6/19/2016",
    "text": "I have visited this place close to ten times. I have also been rejected 3 times as a walk in (even when there are just the two of us). So better make a booking to avoid the frustration and disappointment. It's really located in the 'ulu' part of upper thomson and requires a bit of walking if you don't drive. The restaurant is surrounded by car repair workshops so getting a parking lot during peak hours can be quite tedious. Apart from the MUST MUST order (medium-rare) US Angus Rib-Eye Steak which comes with to-die-for claypot-styled fried rice cooked in charred fat from the steak, there's another one unique dish you should try: Soft Boiled Egg Special ($9). It's a teeny tiny cup but packed with a giganic flavour. It's slow-cooked egg served with truffle salt and a huge slice of foie gras. The combination of eggs and foie gras is heavenly. It's a cholesterol bomb, but, hey, it's okay to have a bit right? Ah, one last thing, there's no corkage fees here for wine! The service staff are more than happy to change your glasses when you are different wine.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvFz8y_bUxQrhUWQZDFdKw"
  },
  "GuxNZM0tl8D0e_df4_so-A": {
    "date": "2/20/2016",
    "text": "You know those weeks that never end?  When it feels like the longest Friday ever and the weekend will never get here?I know the perfect local antidote to that...Shhh...Let's keep it between us Yelpers...It's better than a perfectly crafted dirty martini for curing those Friday blues...I dare you to try holding onto your stress when ladling spoon after spoon of \"heart attack\" fried rice into your eager mouth...This epic fried rice, fried in liberal luxurious beef drippings, screams YOLO, BABY, and suddenly all desk jockeys are transformed into international men and women of mystery, seizing life by the horns, danger be damned, and laughing all the way to the next adrenaline rush...The setting in the restaurant is extremely local, full of celebratory cheer in the form of 12-20 person tables.  We were a bit of an anomaly, snagging one of the only 2 tops...Of course, the main event is the fried rice, which comes as part of a set with the steak... Minimum size is 500g, so bring friends or be ready to stuff your belly... Steak is also delicious and was perfectly cooked medium rare...Other items we enjoyed included the crispy eggplant, the boss style kailan, the boss bee hoon and most especially the gula melaka bananas with homemade coconut ice cream...We could have done without the foie gras egg dish...PARTING THOUGHT: Just getting to the restaurant is an adventure, I wasn't completely sure if I was on my way to dinner, to Malaysia or to my doom... It's pretty damn far away, but well worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Ci4HK97cNKXuRIhPTlqtjw",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Gula melaka bananas with home made coconut ice cream",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ci4HK97cNKXuRIhPTlqtjw/o.jpg"
      },
      {
        "img_id": "Ism98dXFXSAFdUbQ85A1gQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. Heart attack fried rice, at last we meet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ism98dXFXSAFdUbQ85A1gQ/o.jpg"
      },
      {
        "img_id": "RvGJyowZF8EvUCZTnhSF1Q",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. The main event: ribeye, medium rare",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RvGJyowZF8EvUCZTnhSF1Q/o.jpg"
      }
    ],
    "user_id": "Ss6Fz9oK7HCOvYllxpdwEw"
  },
  "j4QP5evUJQVWHwkkCIO4Qg": {
    "date": "12/24/2016",
    "text": "We had the US Black Angus Rib Eye Steak. Nice.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gQkA3Bn3vSbxzjNwgVaE5w",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore. We had the US Black Angus Rib Eye Steak. Nice.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gQkA3Bn3vSbxzjNwgVaE5w/o.jpg"
      }
    ],
    "user_id": "qUUNoA4QsU4w1MbXE9ylGw"
  },
  "ziL_W8HRpRP2-AyT2YATkQ": {
    "date": "2/11/2016",
    "text": "One of the best eateries I have been to.. Tucked away in the heartland industrial area, it's forgiving if one have lost way trying to navigate to the locate, google map is your best friend for this. To go for:- Steak- Beef Fried Rice- Salted Egg SquidThey have a large chalk board with the rankings of their most popular menu item if you are one who just simply wanna go for what's popular on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M6TBHnD_R2IRifXRo5NbPQ",
        "caption": "Photo of New Ubin Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M6TBHnD_R2IRifXRo5NbPQ/o.jpg"
      }
    ],
    "user_id": "6mrYGref0Tpnv148yALorw"
  },
  "MZ2dQWWxxpTd2SfNvDCO5Q": {
    "date": "2/26/2017",
    "text": "wonderful steak that I would recommend to my friends - fried rice and potatos that come along with the steak is just enough to balance. Would like to try other dishes if there's a chance for next time. not an easy place to find.Just note to clarify the weight of steak they chose for you. we (2 pax) requested for as small as possible as the menu says (500g +), but ended up finding it 600g in the bill and realizing no wonder it was more than enough...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NueVo7bvyT4ropk_vbTuTw"
  }
}