{
  "hJyAl2SnSXexMLBahTH6iw": {
    "date": "8/10/2018",
    "text": "Mediocre Korean place in the Star Vista shopping mall. Had barbecue meat, kimchi stew and beef soup - all are mediocre. Appetizers are also not very good. A bit expensive and def not as good as the Korean food I have had elsewhere. This explains why it's the only empty restaurant in Star Vista when we walked in.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "EJbYJoDhPqCuFhcZN_XCsQ": {
    "date": "6/10/2017",
    "text": "Haven't tried everything but the Japjae & Bibimbap are decent quality and value for money. The steamed egg is nice, light, fluffy & flavorful but not overly so. Service at lunch time was ok, though not stellar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_njgo4OBgYnbxu-nY30Fw"
  },
  "aGbMOhZ1QLNxvs_oPkyTeA": {
    "date": "11/26/2014",
    "text": "A great place to satisfy my Korean food craving. the seafood sundubu jjigae (soft tofu soup) was delicious - not overly spicy but yet enough to make you keep wanting more. There were 7 sides and all of a good portion which is quite rare in Singapore. Eating this on a rainy afternoon really brought me back to Seoul. i paid a total of $14 for the business set lunch. only down side is they slap on a dollar charge for the wet towel which can be quickly taken off the bill if you see it in time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pDe5oo6WE5ps3BSwyy_M1w",
        "caption": "Photo of Bornga - Singapore, Singapore. Bunchan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pDe5oo6WE5ps3BSwyy_M1w/o.jpg"
      },
      {
        "img_id": "izTHnNUg_Z_eu_ipF7Qayw",
        "caption": "Photo of Bornga - Singapore, Singapore. info on the veggies they serve",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/izTHnNUg_Z_eu_ipF7Qayw/o.jpg"
      },
      {
        "img_id": "rnBdeyg9-MgnhU-TBX2P6g",
        "caption": "Photo of Bornga - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rnBdeyg9-MgnhU-TBX2P6g/o.jpg"
      }
    ],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "5DCmusZAdSqBWS9OZsyEIA": {
    "date": "11/10/2013",
    "text": "This is still a great restaurant but they increased the price of the woo samgyup marinated beef from $22 per order to $28 per order. Seeing how you are required to order two orders of meat to have anything grilled at your table, and the whole ++ thing adds 17.65% to any restaurant bill, this change makes a meal for two people over $14 more expensive. This brings the bill closer to $40 per person, no longer the bargain it once was.Also, our waitress told us it is a franchise with foreign owners who are not Jong Won Paik (or even Korean, for that matter), which is kind of deceptive given that their marketing says it is \"led\" by him. I think most people wouldn't consider someone who doesn't own a restaurant and hasn't visited it more than once to be \"leading\" it.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "OyDnbyjWZn3P8ZEsX3ueVg": {
    "date": "1/15/2013",
    "text": "Bornga- it is the brainchild of Jong Won Paik, one of Korea's most successful and renowned celebrity chefs. Since 2002, it has grown steadily into a BBQ chain that is popular not only in Kimchi land but also in China, US and Indonesia.The size of each piece of veggie served in the patented veggie tray is massive! It doesn't matter if you're eating alone because you'll still get the whole tray of 10 varieties of veg! That certainly helps with the guilt of eating BBQ meat. It's practically health food. ;) Go for the signature Woo Samgyup, a thinly sliced US beef shortplate with Bornga's special sauce ($22). This recipe is patented by Chef Paik and no one knows what's in it. The sauce is flown in from Korea regularly and the recipe secretly guarded. We only know that there are fruits in it.The sauce is only poured on the meat shortly before serving to maintain the meat's natural color. Due to the thin slices, the meat absorbs the flavors very quickly. I like that the mild sweetness, which is unlike the typical cloying bulgogi.More dishes awaits at my blog!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "_INQXB9Ugts2YYfe2L0jwA": {
    "date": "9/18/2016",
    "text": "Shitty service. Hard pass. Food is pretty okay but the wait staff and front staff really spoil your night.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTKFhm00rnG8fNH2WSYCIw"
  },
  "DiyLEFGX8xTAYyQf4UDGhQ": {
    "date": "5/13/2013",
    "text": "Love and hate this place.  The food- LOVEChain Kogi place that has pretty good food. The highlight was the Woo Samgyup. The deliciously thin marinated beef wrapped in crispy fresh lettuce from the lettuce platter is a party in your mouth, especially with the added special secret sauce.The Chadol Dwengjang Chigae is also a unique creation. Delicious, rich and tasty.IN all honesty, everything else was just OK, so I would just stick to these unique and delicious creations.The service- HATEBeware however of the service. The hostess was rude and even after reservations our party was still forced to wait an additional 30 minutes before being seated. In addition, when serving our banchans, she pretty much \"threw\" the dishes on our table. If this was to happen in Korea or even in LA, the restaurant patron would pretty much get up, yell, and leave at such terrible service.  Not to mention, there is not enough and ample ventilation or air conditioning. We are in Singapore, not having air con while meat steams up in your face is very unacceptable, especially when you are paying premium prices.The only redemption that made the rest of the evening bearable was our sweet auntie. She was very friendly and was cooking for us the entire time. Without her, this crap show of \"SERVICE\" would have resulted in our party of 6 to walk out.  Good job, Auntie.  Shame on the rest of you.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPw0LDmsT5HLc5itX8YLVA"
  },
  "CJUGnpzcODHNWs2sky9U_g": {
    "date": "3/28/2016",
    "text": "Service is awful had to wait long and they overlooked Me seversl times when assigning to a table",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7swhAtovGfh5-sPw6Xej5w"
  },
  "Igsx4YVRiMqWq5nw4tiL6Q": {
    "date": "11/16/2012",
    "text": "The food here deserves a four easily, but there are certain points that I need to point out about the dining experience. First of all, this is one korean restaurant that doesn't come with ventilators. It is very smoky inside, and well, you pretty much smell like barbeque the rest of the night. Also, we wanted to sit outside (since it was really smokey inside), but the hostess said that they only allow outdoor seating over the weekend and friday nights. There's nothing wrong with that, except, when we left, there was a bunch of white guys seated outside. Maybe they were super aggressive, maybe the hostess was especially obsequious towards white people, but it didn't really sit well with us. Also, my friend found a piece of plastic wrapping in one of the small dishes. The guy changed it swiftly, but didn't clarify or apologize for it. The rest of the crew were very attentive and helpful though. The meats were on the steep side, but the array of lettuces and vegetables to wrap the meats in was stunning. Plus, the bean paste sauce was really good, and I always like slices of raw garlic as an option. We got the bean kimchi stew too ($40), and the soup broth was really tasty. The ingredients (spring onions and assorted vegetables and beans) were fresh and the soup was really good, especially coupled with ramen noodles. I would go there again, only if I am seated outside, and in a big group (since it is a little too expensive for a party of 2 to order the mandatory two choices of meats, which will already be about 80 bucks).",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  }
}