{
  "z55Vxq1CpD94aK-lTUyhLg": {
    "date": "8/22/2012",
    "text": "A pretty restaurant decked out in the the premises of a bungalow, how quaint! The setting is elegant, and much pride has obviously gone into the decor and comfortable furnishing. It's a bit of a pity that more people don't patronise the restaurant. Indeed, when I was there for lunch one weekday, there were only three tables filled, including ours. There was a buffet going on at an attractive rate, and we partook in the offer - a rather wide spread of curries, naans, meats, vegetables, biryani and even dessert. Food was well executed even for a buffet standard, and there were vegetarian friendly options. The naans are a little on the chewier side than what I'm used to though. My only other gripe was that the servers were a little too keen to clear off the buffet items on the dot. A quick flip through the menu evidenced that the a la carte dishes were on the pricy side though. I suppose with the addition of wine, your credit card might smoke a little at the end of your meal. Parking is easy, given that there are ample lots around the bungalow (and not many customers around).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  },
  "DSP5PKB94zTN0yAY4vuVnA": {
    "date": "5/29/2014",
    "text": "I don't particularly crave Indian food, but I do crave Song of India food.  Located in an elegant black and white next to Indocafe / the White House and just a few doors down from the Sheraton on Scotts by the Newton MRT, this restaurant  has an elegant, romantic feel and suburb service.  The food is amazing.  Someone who knew what he was doing took charge of the ordering and did a commendable job.  Fantastic food.  On the must return list.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgPgfu6KIvCMsarRczXnZA"
  },
  "L_cAq73OWuW738Y1XFbW_Q": {
    "date": "11/2/2014",
    "text": "Great northern Indian with smart service in a nicely appointed facility.  All the dishes as expected served fresh and hot with care.  A little on the pricey side for Indian but it's all done very well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KqR71xx01uMNccPnkvKSyw"
  },
  "8XI24KQF1bmDPKaVrfdt7g": {
    "date": "4/14/2013",
    "text": "Definitely higher priced for Indian food, but then again I always feel like a princess when eating here. The atmosphere is very upscale, and I love all the deep, rich colors. The wine list is extensive, and the food is refined Indian food. Everything I have had is delicious here. I would highly recommend it for a fine dining Indian experience.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eEqC9RndEAYXLBnqofYBCA"
  },
  "213SP0rO6ObxrAuN9-CHGw": {
    "date": "10/17/2012",
    "text": "On the pricy side of Indian fare, but then this is not ordinary Indian fare. The food was delicate, correctly spiced and well cooked. Kudos to the chef. On the A list when I am in Singapore.I have not tried the buffet which does not get rave reviews but then what do you expect. Go for the menu, sit back and enjoy a culinary delight.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5PiccgZPWuHioRZabkztOg"
  },
  "S5hBy1gBlgYEhJTaP2f9RQ": {
    "date": "8/14/2018",
    "text": "was concerned a 1 Star Michelin Indian restaurant would be too remote and disconnected from Indian food for my preference. Somehow Song Of India was both authentic and innovative. Tastes and flavors were familiar but heightened delicate and enjoyable. Excellent staff and setting. A true Michelin experience",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "heVh-17wtO20ioqhd9YnPg",
        "caption": "Photo of The Song of India - Singapore, Singapore. Entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/heVh-17wtO20ioqhd9YnPg/o.jpg"
      },
      {
        "img_id": "cVu8qLHfXGz3xFnz39QgvA",
        "caption": "Photo of The Song of India - Singapore, Singapore. Fish curry main excellent",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cVu8qLHfXGz3xFnz39QgvA/o.jpg"
      },
      {
        "img_id": "7-G3Qy8pqWj1AnLDhExXLQ",
        "caption": "Photo of The Song of India - Singapore, Singapore. Their pre fixe Tour of India",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7-G3Qy8pqWj1AnLDhExXLQ/o.jpg"
      }
    ],
    "user_id": "tuSxPYf1reh9hgzUQ3VvlQ"
  },
  "ANcmNXAc7GllBV_BQbc3QA": {
    "date": "2/17/2017",
    "text": "Solid, Indian fine dining in Singapore.  The Michelin star is well deserved.  I opted for a delicious tandoori appetizer which consisted of chicken, minced lamb kebab, paneer and aloo.  All were delicious but not quite as spicy as the tandoori meal that I recently had in Delhi.  As a general theme, ask for spicy if you are accustomed to it.I followed the appetizer with butter chicken and naan.  The butter chicken  was excellent and the naan was thin and crispy in a way that I typically find only in India.I passed on dessert to ensure that I could make the 1.5 mile walk back to my hotel.The service was gracious and professional, as one would expect from an establishment with a Michelin star.  The service was also kind and light-hearted.  The staff took extra care of this lone diner to ensure my time with them was as pleasant as possible.I really like \"The Song of India\" and I hope to return for another meal in the very near future!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "0zP-EihZSGFQRWe4AetL1w",
        "caption": "Photo of The Song of India - Singapore, Singapore. The Song Of India",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0zP-EihZSGFQRWe4AetL1w/o.jpg"
      },
      {
        "img_id": "xp3xdgYGCOCVV6xDW67ztQ",
        "caption": "Photo of The Song of India - Singapore, Singapore. Crispy butter naan",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xp3xdgYGCOCVV6xDW67ztQ/o.jpg"
      },
      {
        "img_id": "v3ESmoROe13wyQxBSByhlA",
        "caption": "Photo of The Song of India - Singapore, Singapore. Curry Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v3ESmoROe13wyQxBSByhlA/o.jpg"
      }
    ],
    "user_id": "BIkivGwMblK3_r2N0pSE8A"
  },
  "zN6Vtq22xbzAN-Rrmmk8Yw": {
    "date": "4/27/2018",
    "text": "Very interesting place to say the least. Very well set up Indian restaurant and this pleasantly surprised me. Very few Indian restaurants I have seen spend time in food presentations and this was most unique point for this restaurant. We were an office group of 9 and opted for the set course - non vegetarian - Journey through India. Good appetizers in salmon and tandoori and a very nice dessert choice. Definitely worth trying if you fancy some \"fancy\" Indian restaurant!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mtl5l-pjogZE2Id-E-2bDw",
        "caption": "Photo of The Song of India - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Mtl5l-pjogZE2Id-E-2bDw/o.jpg"
      },
      {
        "img_id": "Oa32oL9zUmxTnaa0rXZtxA",
        "caption": "Photo of The Song of India - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Oa32oL9zUmxTnaa0rXZtxA/o.jpg"
      },
      {
        "img_id": "cR95VCkZhsGuMlp2uPn7yg",
        "caption": "Photo of The Song of India - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cR95VCkZhsGuMlp2uPn7yg/o.jpg"
      }
    ],
    "user_id": "R6TPmf9CSSn3ghW2jKr2mg"
  },
  "B82ItdpjH7UutSix1xMcgg": {
    "date": "4/3/2018",
    "text": "It's been a few years since my previous review and I believe they have figured out their footing since being awarded the Michelin Star. The food has improved tremendously, so much so that I have been bringing colleagues and friends here where many try Indian food for the first time.Both the buffet and their a la carte menu are wonderful. I highly recommend their samosas, Delhi Chaat, Tandoori Prawns and any of their naan. Their chicken tikka masala and butter chicken is quite normal.Their kulfi and gulab jamans are excellent.It is my no means the best or most innovative Indian cuisine out there but it hits the spot for a good meal. Definitely check it out if you are wanting a great Indian meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "P0R_1jvhb0fyjftYGstQEg": {
    "date": "4/15/2018",
    "text": "I had booked this restaurant with great expectations as well as with high hopes that this will be our second Michelin Indian dining experience (The first being Taj Campton Place in San Francisco)! I had opted for the veg tasting menu while my husband chose the non-veg tasting menu. The interior of the restaurant is very weirdly oriented and has few private rooms too. I liked the open kitchen concept. There was just one complimentary starter of bread roll which was very bland & definitely not the best taste to keep me wanting for more. The service was very mediocre & definitely not upscale of that a Michelin dining experience. Food was hit or miss, nothing to make me feel wow. They never changed the cutleries nor cleaned the table of the crumbs. I couldn't find any difference of food-taste or style or presentation or service that could justify its Michelin rating. The worst part was to find a dead ant on the rim of the glass where some gravy was served! Although the manager came & apologized, nothing was offered as complimentary to compensate for that worse experience. I have dined in several Michelin restaurants in different parts of the world to state that this could have been a normal Indian restaurant. What I liked was the starter.. which was a mix platter of samosa, veg patties & gol gappas. In the main course, okra fry & daal was good! My husband loved his chicken tikka gravy. In the dessert option, I really enjoyed the beet root halwa. In short, the food can be hit or miss... don't go here with Michelin dining mindset but just an ordinary Indian restaurant. I don't think I would like to return again, there are far better restaurants in this country to enjoy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CpUPiDDIYy44foR5FmSlcw",
        "caption": "Photo of The Song of India - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CpUPiDDIYy44foR5FmSlcw/o.jpg"
      },
      {
        "img_id": "tHdhAaphVKiPTKGYdLlO3w",
        "caption": "Photo of The Song of India - Singapore, Singapore. The Starter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tHdhAaphVKiPTKGYdLlO3w/o.jpg"
      },
      {
        "img_id": "joMoO2UWytpXfm6bSvX3iw",
        "caption": "Photo of The Song of India - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/joMoO2UWytpXfm6bSvX3iw/o.jpg"
      }
    ],
    "user_id": "kwDFW024bbAd4O3YcwACcA"
  },
  "_O8tYm_saTD_bDyjR3-fiA": {
    "date": "4/30/2017",
    "text": "We heard about this Michelin rated restaurant and decided to try it out for the lunch buffet. The setting is very nice and the waitstaff are attentive and friendly. However, the food really fell flat for me. For such a highly rated place I was expecting way more. There was a good spread of curries, vegetable dishes, biryani and rice, but they all lacked any real flavor. For some reason all the dishes were bland and not even a little spicy. I was confused because the made to order appetizers were fantastic! The meat was tender and  flavorful. This was not the case for the main buffet, unfortunately. I really wanted to like this place, but for the price and prestige it's not worth it.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKbv3KDqjEmYQeADqevsnA"
  },
  "matjFL6tIgYtAuej1XkiPA": {
    "date": "9/10/2016",
    "text": "We found our way over to The Song of India one Thursday night on our quest to check out more Michelin Starred restaurants in Singapore.Overall, the experience at The Song of India was mixed.  There were three things that made me super happy and 2 things that could have been better...Let's start with the happy things:1) The restaurant is a Poke stop...now I know this may be cool for only a short time, but for right now, this is something that makes me very happy!  I didn't catch anything new during dinner, but I did catch quite a few pokemons...an awesome diner had a lure on the restaurant the whole time so it was pretty fantastic2) The restaurant is participating in the Citi wine and dine promotion, so we got a free bottle of wine (we picked the red, but there was a choice of red or white)...the only condition is that you have to order at least $100 worth of food, which is pretty easy for 2 people at The Song of India3) The ambiance is really cool...it's a stand alone house and there are a lot of dramatic decorative touches inside as wellThe things that could have been better:1) It feels like there are too many tables in the restaurant for a higher end place and we felt a bit too close to the table next to us...perhaps the crowding is because the restaurant also has a buffet?2) The food was rather hit or miss...we like half the dishes we ordered and the other half were just ok...this was disappointing given the high acclaimThe food:We liked the Kebab Tasting Platter as a starter as it gave us a chance to try several different kebabs.  The Cottage Cheese Bhuna Makhni was also very tasty.  Unfortunately, the Kashmiri Roganjosh (traditional lamb curry) and Goan Fish Curry were both quite forgettable.PARTING THOUGHT: For the same price point, Punjab Grill seems to be a better alternative, although with a far less compelling ambiance...",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nbznbxA3bPegCI8j5nkqLw",
        "caption": "Photo of The Song of India - Singapore, Singapore. Kerala style fish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nbznbxA3bPegCI8j5nkqLw/o.jpg"
      },
      {
        "img_id": "mxrkkMW8yHgwVffpMxV4iA",
        "caption": "Photo of The Song of India - Singapore, Singapore. Paneer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mxrkkMW8yHgwVffpMxV4iA/o.jpg"
      },
      {
        "img_id": "bqHDLhD9MSM3eRFxj-cQXg",
        "caption": "Photo of The Song of India - Singapore, Singapore. Lamb curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bqHDLhD9MSM3eRFxj-cQXg/o.jpg"
      }
    ],
    "user_id": "Ss6Fz9oK7HCOvYllxpdwEw"
  },
  "9rl7uFbqUAtXL8s0HZRM_A": {
    "date": "9/1/2017",
    "text": "Worst Indian upscale restaurant I have ever been too. Service is sub par. Food is very bland. Can't believe they got Michelin star",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "055DdffhGx4JQW33m8d5MQ"
  },
  "sfzjTaN0gQ_nkVsmAFxt1g": {
    "date": "6/4/2016",
    "text": "I have to say the one restaurant that I wanted to return to on my second trip to Singapore was The Song of India. The food is excellent. It did not disappoint on my second visit. My coworker and I ordered one starter and split one vegetarian and one lamb dish. The one thing to watch out for is they don't ask you the level of spice that you want. I love spicy and it was very reasonable for me. My coworker thought the cauliflower dish was too spicy. I loved it. Definitely worth a visit especially if you are on an expense account.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g9vj9rOpsw6pJ_K42HEYlQ"
  },
  "R2J8xFj1voOOpmWREzmR7A": {
    "date": "5/22/2016",
    "text": "I actually went here on my birthday with a bunch of friends and their families so I had a good time there. First impressions were that this was a very posh restaurant. I was right. The whole place itself looked very grand and the furniture was great. The lighting was perfect and it just makes you feel rich just by being there. It's set in an old Singaporean Bungalow-ish home so thats pretty unique.Now the food. Was honestly one of the best North Indian food I have ever tasted and that's coming from a South Indian. The food was cooked perfectly and I didn't feel like there was much room for improvement. There were Indian desserts, side dishes, main courses and just being there and eating their food which is so rich in flavor just made you feel like a king. The customer service was great and all the waiters were smartly dressed so I have no comment on that. Only problem is there might be a bit of a jam in the road outside this area but that isn't because this restaurants is well known. It's because it's located in the city area or at least, close to the city area.  So if you are looking for an Indian Restaurant to bring your partner out on a date, look no further! This restaurant is perfect for the two of you. Although quite pricey, the food is definitely worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHnUwz-i9J4M-Y9zw3CKZA"
  },
  "-17h9M9I7nhHeAvsEoXTPg": {
    "date": "9/1/2017",
    "text": "Don't see the quality of Michelin star restaurant. Food was out of taste. Service was very poor. Overall don't recommend this to anyone.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uodIFSNSad7r5JX_S4L6aw"
  },
  "0qb8xjQNb9UHx-4yw4lgWQ": {
    "date": "7/24/2016",
    "text": "I kept quiet because my friend really enjoyed it but I found the Sunday brunch to be overpriced, bland and boring. I typically eat only vegetarian Indian but tried the chicken and regretted it. Most dishes were watery and thin, like the daal, so bowls would have been better than plates. The watermelon was rotten. The service was slow. The ladies room was absolutely filthy and smelled like a barn. The soap dispenser was broken and had been filled with water. Bottled water and tea weren't included in the $39.90 buffet so it was $59 per person and a true waste of money. I do not understand how they received a star from Michelin Guide Singapore.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncQakDQwswLutRIYumgl_g"
  },
  "-2ma_nb5GepmuhfUmswD2g": {
    "date": "8/10/2016",
    "text": "HORRIBLE SERVICE AND DISGUSTING FOOD! I ended up with food poisoning for the next one week after having dinner here. First of all I had been to this restaurant 7 years ago and was so annoyed by their service and quality of food that I never went back. But recently they have been advertising and I thought maybe they have improved so I decided to try this restaurant again. As soon as I entered they asked: Do you have a reservation? But what I don't understand is why do they have to ask this question when the restaurant is completely empty. The food was pricey but I don't mind paying that price if the quality of the food is great. But it was horrible and this is the first time my family and I left the food as we couldn't finish it. While leaving we thought of providing a feedback about the quality of the food and all the manager replied: Please come back again and we will let our chef know. Hahah I think he fails to understand that I will never even of think of going back again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tMT5-YXZPtzZ7itDAqrhw"
  },
  "5BB_tf-PaYQsYd0-maN8DA": {
    "date": "12/14/2014",
    "text": "When you dine at Song of India you are paying for the atmosphere. This restaurant is set in a lovely historic Black & White Singapore home. The appetizer(s) I had (Indian sampler) was very well thought out offering a good mix of items. The main course was nothing special and honestly I feel I could have received the same item at a hawker center for much less . The waitstaff was very attentive.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bGpCq08ViEx77Jlkdvaysg",
        "caption": "Photo of The Song of India - Singapore, Singapore. Main course. Lamb curry and chicken curry.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bGpCq08ViEx77Jlkdvaysg/o.jpg"
      }
    ],
    "user_id": "BNgs67ayYRDqdmrYNREnsg"
  },
  "kU4zucbkNFX_OY1q7OCZCg": {
    "date": "1/6/2013",
    "text": "I love that this restaurant is in a Black & White house along Scotts Road.The interior is pretty nice but a little too dark when you go for lunch. It felt like I was having dinner and got blinded by the sun when I got out. (Yes, it did not rain that afternoon!)So I decided to have lunch there that day after passing in front so many times. During lunch, they have a buffet so I decided to try it to sample a few of their dishes.The food was just okay. The naam was hard, the vegetables dry, and the meats in the curries not very tender. Maybe the A La Carte is better, but the buffet is not worth trying.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jTZf5BolBcfli0cNch4V7Q"
  },
  "RScNPnHDmPRj8Cj96fbRyg": {
    "date": "1/6/2017",
    "text": "I have eaten much better quality food at places which don't call themselves Michelin star restaurants.  Disappointing and slow service is to be expected.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSI8_aMfg4q3isKK9eYPQg"
  },
  "iQyCUaG4tKeypRMdM5NErg": {
    "date": "3/28/2015",
    "text": "For the price, it was just ok. Chicken tikka starter too thick with coating and dry. Tikka masala main flavour was good but not a wow.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W5sqmNHTziqihHe2p2sBBg"
  },
  "cxFP8RZr6CRwp1f5BHr3iQ": {
    "date": "8/1/2016",
    "text": "How exciting, Singapore's first Michellen Star Indian restaurant. I went here for Sunday lunch right when they opened. The service was very good, the decor is very upscale and nice. The food was not impressive. The chicken was even a little tough in butter chicken curry. The selection was not very big. As a comparison i found the lunch buffet at Yantra significantly more impressive in the quality, taste and selection. I dont plan on coming back and wonder what Michellen saw in this place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MCCq6FmUfb7KdVrSJ_qW_A"
  },
  "qEsdU6KqrH0ADCJlwD7Sog": {
    "date": "8/20/2016",
    "text": "Great Lunch Buffett, I have tried this once and now eat the lunch buffett nearly every week.  They have a good selection of dishes and dessert.  The price is reasonable at 28++.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_ivP9MrMxD5BXpY0Dhbvw"
  },
  "l9b37cir7nJKiP1Tii3XUA": {
    "date": "7/26/2016",
    "text": "The naan bread is one of the best I have had - crispy, chewy and slightly sour. Service was exceptional as well - they made an excellent clear soup off menu for us without cream.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PW-VwwSX5W9rNRSIqlIoNQ"
  }
}