{
  "91_TavBKKLflJmBy_-1_XQ": {
    "date": "11/16/2018",
    "text": "The only real German food in Singapore! The pig knuckles are to die for, get the combo it's a lot of good but great!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBut-ocMiT3oyZhm7sJ19g"
  },
  "N2uhkl2HT8fLOtRxCMTEXw": {
    "date": "8/11/2018",
    "text": "I had a dinner here tonight with my wife, brother and his wife, and my sister, all 5 of us. We had the grill platter, and meat and cheese platter to share. We had a small rosti on the side. Very good dinner indeed. Very satisfying too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QAH7Gl8nTVSCn99JwQ3y0A",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QAH7Gl8nTVSCn99JwQ3y0A/o.jpg"
      },
      {
        "img_id": "iZlm6WFU3RyGjcBp1h_PjA",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iZlm6WFU3RyGjcBp1h_PjA/o.jpg"
      },
      {
        "img_id": "8TGUljAA17EBE0DV64BeTg",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8TGUljAA17EBE0DV64BeTg/o.jpg"
      }
    ],
    "user_id": "qPMX0LylFc65ZXkivCRPsQ"
  },
  "4jIvf5uYQC8ds_KeK7w22Q": {
    "date": "3/25/2017",
    "text": "This is not a review for this restaurant per se but a review on the new food and drinks menu, which we were invited to explore at a dedicated tasting event.Group Executive Chef Wolfgang Ranner presented the new menu with lighter additions such as modified, small versions of the Austrian onion tart, a delicious super-food salad, local (!) Barramundi fish from sustainable fish farming with noodles and the heavier, typically Austrian-German meat courses such as a wonderful, juicy whole chicken, pork knuckle with potato salad and sausages wrapped in cheese and bacon - the latter bringing up wonderful childhood memories of BBQs in my home country Austria. The new beer cocktails included a new take on the Margarita and the Hugo, the latter having been the summer drink in Germany for many years and it had the same refreshing effect, with no overwhelming beer taste.We had a fabulous meal and I will definitely visit my local Brotzeit soon :)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "eXabbF1dq3udZJVbELGbcA",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore. Chef Wolfgang professionally handling the chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eXabbF1dq3udZJVbELGbcA/o.jpg"
      },
      {
        "img_id": "uJlDnvARevxaliMRudxWnA",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore. Fresh, local Barramundi from sustainable fish farm with noodles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uJlDnvARevxaliMRudxWnA/o.jpg"
      },
      {
        "img_id": "e8-AUiHIxSN52Hd024sR4A",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore. Super-food salad - tasting as good as it looks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e8-AUiHIxSN52Hd024sR4A/o.jpg"
      }
    ],
    "user_id": "mI2Q4dVJ92weGouEabb9Bw"
  },
  "2kdRX2she0Bmlibx-gW90Q": {
    "date": "1/20/2018",
    "text": "One of the best beer places in Singapore.Genuine German Beer and dishes - wursts, schnitzels, u name it. Their fries are f*cking delicious!Be sure to check the haply hours and promotions - they're definitely worth it.1 star less for the prices - the place is not the cheapest...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qzBeeMsIkK6gwO1tIuJXIw",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qzBeeMsIkK6gwO1tIuJXIw/o.jpg"
      }
    ],
    "user_id": "eLWTYog8x589Po9XObEFGQ"
  },
  "lnRZucu6AJRFynmhh8XpYQ": {
    "date": "2/18/2018",
    "text": "If you like an outside atmosphere with great food, this place is nice to check out. We ordered a lot of food with great beer! They have tons of beer on tap for a reasonable price at happy hour. The sausages are tasty with nice side dishes. I'll deff come back for more",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mO7vAnIJmeVLPl-5YMbw6A",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mO7vAnIJmeVLPl-5YMbw6A/o.jpg"
      },
      {
        "img_id": "cJP9QwL8IQmitG6LH7zyrg",
        "caption": "Photo of Brotzeit German Bier Bar - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cJP9QwL8IQmitG6LH7zyrg/o.jpg"
      }
    ],
    "user_id": "vEeTRdmbQ5XcYUQ6vaH3MQ"
  },
  "y1macmQfSHh75aL8RzZvIQ": {
    "date": "3/26/2017",
    "text": "I was given the opportunity to try out new Brotzeit menu and was pleasantly surprised. We were welcomed in their 313 outlet and got the chance to chat with their super charming executive chef Wolfgang.I have been to Brotzeit a few times before at Vivocity and Jem and have always thought that the quality of the food was good but somehow I would often skip them as I thought most dishes were on the heavy side. Turns out I was not alone! Brotzeit has revamped their menu and added quite a few lighter options.We were given following dishes:Trio of savory tarts: this was the one of the highlights of the evening, I liked the quiche-like tarts with a side salad.  Superfood salads: I am a big fan of a good healthy salad and this was for sure a very good salad. I will for sure come back to Brotzeit to have this for lunch (I wish they did takeaways for this).Pan-seared Barramundi: the fish was very good, it was seared to perfection but I fear that the full version of the dish would be a lot of noodles.Wunderplatte: this was the crown of the evening, the Berner Sausage on this plate was so tasty that I wanted to hide some in my purse! Minor remark: I did find the ribs way too sweet.I really liked all, even the beer cocktails were not bad (and that is saying something since I dislike a beer cocktail) they showed that they can do more than just sausages and pork knuckles. However, I do wish they would offer more contemporary Western cuisine, although the new dishes were very good, they were still very classic. I would like to have seen some more daring, new dishes on the menu as I feel like there is a genuine lack of that in Singapore (except at a much higher price point) but hey, maybe it is just me who wants this...Will certainly recommend and come back soon!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "cJoNDLX3wpE5Yj-VhLUfQg": {
    "date": "5/16/2018",
    "text": "Amazing food incredible menu so many options however so expensive !! The ribs are amazing and their drinks menu goes on forever. A nice place to go but definetly not too often due to price.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5VTy_OiJqbuWvHZYDM3pw"
  },
  "m6IZWt64zSzPAbycOZb5Rw": {
    "date": "5/13/2016",
    "text": "Food is good and tasty. Ordered a Fennell beef thin pizza and salmon poached egg dish. The cheese on the thin pizza blended well with overall taste of base and beef, the tomato makes the pizza more appetising, it lessens the fullness of cheese with its soury taste. Go for the salmon poached egg for only $14, good combination of sweet (hollandaise sauce), soury (mustard), slight bitterness (spinach), saltiness (smoked salmon) and some wetness from the oozing poached egg in middle. Great as a brunch dish! They have a second level deck that's air-conditioned. If U love alfresco dining, or came here just to watch live soccer screening, this area is perfect! It gets a little humid at times but the huge fan up above provides some 'interlude' breeze, so it's not that warm afterall. DO NOT ORDER their WATER. It's the worst water I've ever drank in my entire life. It taste like melted rubber/plastic water soaked in fungus filled wooden barrel over a week... It was horrible. Had to spit it out immediately upon drinking it, to my horror. We were guessing it's probably their way of deterring customers from ordering water and opt for a beer instead. Oh wells. The water incident was an unpleasant experience for me else this restaurant may just earn a good 3-4 star for its food and bustling ambience!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j21GdRmmPI2vzVVxaYpKbg"
  },
  "Ba4HnOU_yr80bMxzkZAebg": {
    "date": "11/9/2015",
    "text": "Let's face it, the whole alfresco dining experience near 313 Somerset is over priced and Brotzeit is the better experience over the surrounding restaurants. Beers selection is on point and the Nurnburger platter was fine. Value side play was the $3 pretzel and mustard and $5 spaetzle. I will definitely be back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MMzE2p8FwNt_xDt4ZqFi1w"
  },
  "g8-Zp9vZo3Gpl7DkUdaR6w": {
    "date": "4/11/2015",
    "text": "Quiet nice but not a must haven. Prices are too high for quality and quantity of food.Tast is equel with the german food and the beer is great.Staff is unfortunately very slow and lazzy but friendly.Nice location but there are a lot of better ones",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OUE0e8kRQzdeWzc1tWIpkA"
  },
  "iKvAcVYJJyKfTG914iWUhg": {
    "date": "11/8/2012",
    "text": "The first time I tried their pork knuckles was at Vivocity, before they have it on their menu. It was love at first taste. The meat was so tender that I could tear it away from the bone with my hands. I declared it the best and most authentic pork knuckles I have ever tasted in Singapore. Fast forward to 4 years later, at 313 Somerset. This time, the meat was so tough our hands were sore at the end of the meal from trying to saw it away from the bone. The skin was also somewhat rubbery and difficult to chew through. The sauce that accompanied it was watery and too salty. What a disappointment! I don't know whether the drastic fall in quality is confined to only the branch at 313 Somerset or across the board. What I know is that I will never get the pork knuckles there again.Get their sausages, salads and side dishes to go with the good beer - simple fare that is hard to go wrong. And go there with friends and colleagues for a rowdy night. Seats are cramped close together and the atmosphere is loud and, due to the limited air-conditioning, somewhat warm.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hC1HjO-Tye6dar3Bg0aZMw"
  },
  "-SQuovABjWHQ77HhBlu0Aw": {
    "date": "10/2/2014",
    "text": "As a German: this food is ok for German-Singapore. I would love to see better quality meat for the asked prices. And what the hell have raw tuna to do with German food? If you pick a concept for a restaurant and want to be a German restaurant, then stop serving food which is not even European. And secondly, if you cook \"Schupfnudeln\" then not mix it with rocket salad and sweet tomatoes to make it taste like Italian food.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LFtUGFO9bZV_gI_cbxDs4w"
  },
  "aYGBupTiLKFRFamVuKHE2g": {
    "date": "8/14/2012",
    "text": "For a pleasant evening, do not attempt to pronounce the menu items in German! Just point and gesture to save your reputation. Heh heh. On a serious note, the service is good, so no worries about ordering.The atmosphere is pleasant enough, but the lack of air conditioning is a curse on warm evenings. And if it rains really heavily - it's bound to happen in Singapore - you might get a little bit of drizzle on you.The food is pretty much standard German restaurant fare with a good selection of meaty stuff. Vegetarians will have a tough time here. Just don't get the spinach pizza, I thought it was awful.And unless you have a real hankering for German beers, I suggest heading just next door to Jibiru for some excellent Japanese craft beer.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kR2t_vMvggiSDNV6taSPPw"
  },
  "YjTG0v9AISbmy2Ij3Pw_tg": {
    "date": "6/27/2015",
    "text": "Good beer, poor service, ok food, overpriced.  There service is painfully slow.  It took 15 minutes for them to come by for our drink order.  The 10% service charge is built in so they just don't care.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJUohUMe0MMdHaTEMm8Z4A"
  },
  "o2eqgBg99NFvZ7EP06_2MA": {
    "date": "5/27/2013",
    "text": "Outdoor seating, wooden bench style dining and yummmmmmmm desserts! Limited vegetarian options, but still worth repeat visits!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XQ6VtlcqPthCjWJUCFa8Zw"
  },
  "K-Kr_T-nx7SxWVedvQpWZg": {
    "date": "8/5/2012",
    "text": "Plenty of seating and an al fresco dining place make this outlet at 313 all the more enticing for young adults to hold boisterous gatherings and celebrations. With a wide variety of authentic German fare that ranges from meat platters to bratwursts and German lager, all at an affordable price, the best time to visit would be in the evenings after work. There really isn't much of an ambience, thanks to the large throngs of people that walk past the restaurant but don't let that bother you. Service can get a little slow from time to time when there are large crowds but compared to other outlets, getting a seat happens almost immediately. The second floor is more compact and better suited to smaller groups who prefer privacy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "uADxJYbOUOX5EheSqxo8KQ": {
    "date": "10/7/2012",
    "text": "The only other German style biergarten as an alternative to Paulauner in Singapore. Enuf said.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6dsc7ibCyCJzPITbpzuNAQ"
  }
}