{
  "6TAfjtTAazbjwGtzP4gDAg": {
    "date": "9/2/2017",
    "text": "Firstly, this review is for the store in united square off Thompson Rd but I could not find it on Yelp. I ordered the toast set which comes with two soft boiled eggs, two kaya and butter toast sandwiches and a cup of coffee. All-in-all a fairly good deal for the price. The meal brought back many memories from my past and it felt good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NaKIUQrZGA9gL7jvq1p0_w"
  },
  "LbM0wpNatzthPlbRwgjfRA": {
    "date": "2/22/2018",
    "text": "You must come here for the kaya toast and milk treat. They are a perfect combo to start off your day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xfBVS_KVgW4C5K5EYSiR4Q"
  },
  "tZgFjnF7-0TB-9xFO2uXew": {
    "date": "1/8/2017",
    "text": "Straight forward, no frill, solid Kaya toast! Ya Kun dates back DECADES perfecting the Kaya toast and you just cannot go wrong. When there's barely a menu and the auntie asking you straight up \"how many\", you know you've come to the authentic place.The toasts are crunchy on the outside, and sweet and tad creamy inside... hmmm taste of singapore in one small bite!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ax2W2agdZHKeHjfrlVa58A"
  },
  "gEns5ktkIJZkpMVwBWzNtQ": {
    "date": "9/5/2015",
    "text": "Quintessential Singaporean breakfast! Kaya toast, runny eggs, and coffee. Well I don't drink coffee, so I had tea with milk and sugar instead.A really nice man asked me if I was eating there or for takeaway, and when I said it was for there, he told me to take a seat anywhere and then brought over a menu. I got the above mentioned breakfast set, which was set A. There was a set B, C, and D, which had different kinds of kaya toast. I remember set D was a kaya peanut butter toast which also sounded amazing. The kaya butter toast was pretty delicious the bread is very toasted and crispy. At one point, the nice old man sat down with me and showed me how to properly eat kaya toast. He asked to put soy sauce and some black pepper into my runny eggs. Then I mixed it and he told me to dip my toast into the runny egg/soy sauce mixture. Really tasty! Great hearty way to start the day!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BPgzcvmqYePWRWQwRcIz6A",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Kaya toast breakfast: kaya butter toast + runny eggs, tea with milk and sugar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BPgzcvmqYePWRWQwRcIz6A/o.jpg"
      },
      {
        "img_id": "9h7D6NJkWHiJqvh8NyLhWQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Kaya toast poem",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9h7D6NJkWHiJqvh8NyLhWQ/o.jpg"
      },
      {
        "img_id": "HhdwcDIu4xTisXuZHm45DQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HhdwcDIu4xTisXuZHm45DQ/o.jpg"
      }
    ],
    "user_id": "_uwuKDqYXnTM2qrpcs3P2w"
  },
  "NxyomQVavV6uPbXp9hi0jA": {
    "date": "12/7/2014",
    "text": "How is Ya Kun only 3.5 stars?!?Kaya toast was a MUST when I visited Singapore. My friends and I first tried kaya toast at Nanyang Old Coffee and thought it was so good that we wanted kaya toast again. We found Ya Kun and now I'm constantly craving it.We ordered 3 different toast sets:      -KAYA TOAST WITH BUTTER     -BUTTER SUGAR TOAST     -KAYA PEANUT TOASTThe sets come with a stack of 4 toasts, 2 soft boiled eggs and a choice between iced coffee and milk tea. My favorite toast by miles was the KAYA PEANUT TOAST! SO GOOD. The bread here is thin and crunchy, which I preferred over Nanyang, which was thicker and softer. I think the thin bread makes for a better bread to kaya/filling ratio, and crunchy food is just better than soft food!The other two toasts were pretty good as well. Not as memorable compared to the kaya peanut, but I still enjoyed them. There was a little too much butter in the normal kaya toast though. The soft boiled eggs were cooked nicely and the iced coffee was pretty average.I'd DEFINITELY RECOMMEND coming here for breakfast. Or lunch. Or dinner. Or all three. Try the normal kaya toast but you MUST get the peanut toast as well!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9uJz-PpEhbspgSoNQPS53w",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. peanut kaya toast set - SO GOOD",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9uJz-PpEhbspgSoNQPS53w/o.jpg"
      }
    ],
    "user_id": "ofZzcj1oiHS64f7jbGCXxQ"
  },
  "e1r3tAtrcbdUTUbpNyqZAQ": {
    "date": "12/21/2015",
    "text": "This is a very famous Singaporean style breakfast/brunch cafe.  They have locations all over Singapore.  Supposedly they have been in business since 1944. Our aunt took us there to try it.  Like most of the local markets in Singapore, the place is cramped (although not outdoors).  The small wooden chairs and tables are packed tightly together that it is hard to get around when crowded. Yet it is worth the wait, even with the long queue (line). They have a very strong milk tea that is best served hot.  Get the Kaya Toast with butter.  You can usually mix it up with two runny eggs, or you can just have it plain.  Either way, you will enjoy the lightness of the bread, the crunch of the toast, and the rich full bodied taste of the coffee.  Come here if you want to enjoy a good start to the day!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmBhB9T1lsIFFdKkrerj9Q"
  },
  "0EktkEkh6d1Z_HHITbV4kQ": {
    "date": "12/25/2017",
    "text": "If you want to meet the rudest person in singapore. Go see the lady who makes the toast in the morning. Enough to ruin my impression of this place for a first time.  Surprised a franchise allows this.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZHLkfi1lrd_f-C8I4LCNw"
  },
  "HpOeWcbhJWgUG7Zx7SmFgA": {
    "date": "9/14/2012",
    "text": "This is the original Ya Kun Kaya Toast Shop. It's just outside of the Far East Square along China Street with a few other great eateries!If you're ever visiting Singapore, everyone will tell you to try the famous kaya toast at Ya Kun. I honestly think you should try kaya toast when you're in Singapore, but not at Ya Kun (I like Toast Box better). I don't understand the hype of this place. I'm not a fan of over-toasted, hard bread. With very little kaya jam and way too much butter, I had to go to another kaya toast shop later that day just to make up for the disappointing experience. I just wanted to try one slice of their toast with the kaya jam. But they suckered me in to their pricey combo special: 2 toasts, soft boiled egg, and a drink. Overall, I was super disappointed with my first kaya toast experience here.Service: 4 starsKaya Toast: 1 starOpening HoursMonday to Friday: 7.30am to 6.30pmSaturday and Sunday: 8.30am to 5.00pmPublic Holiday: Closed",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_KAoUMyrU-rIG4ufdJEPow",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_KAoUMyrU-rIG4ufdJEPow/o.jpg"
      },
      {
        "img_id": "97fYvNzQ5_QxmE_MC_clLw",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/97fYvNzQ5_QxmE_MC_clLw/o.jpg"
      },
      {
        "img_id": "ah_lNelK_1Od0cUsXzmtDQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ah_lNelK_1Od0cUsXzmtDQ/o.jpg"
      }
    ],
    "user_id": "CZQUtmO5NIY-bZWkCqHeJg"
  },
  "hM_8rDdGUhZ23gd8_0VIFQ": {
    "date": "6/7/2016",
    "text": "Ya kun has the best toast and coffee as compared to other similar local cafes. This particular branch is also the only branch I know that serves you at the table if you're dining in. Butter sugar toast is also worth trying, I prefer that to kaya",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C64vnYvvV1pXLJn0MJ_IJw"
  },
  "-RVdBnhIqdK3DzNL9dwxEw": {
    "date": "9/28/2015",
    "text": "hmmm kinda runny for my taste but glad I tried it. Id eat it again and bought Kaya jam? to give out as a present.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pbd9NIYgxMXbf2I6Grsf7g"
  },
  "XcUMzArjSO8RmOkn3lmiMQ": {
    "date": "10/26/2015",
    "text": "So apparently this is the traditional Singaporean breakfast, coffee brewed in bags (which you can see hanging up), runny eggs and Kaya Toast (coconut jam/french toast kinda thing) in a stripped back, functional cafe.Ya Kun is a franchise, there is a model of the first store in here, but don't expect anything posh and fancy, half the point is that it's 'as was'. Metal tables and chairs, plastic cutlery but hey, who cares as long as the food is good, right?And it was! Coffee with condensed milk, runny eggs with a dash of soy, and Kaya toast, all delicious! They have a few different options/combinations, all of which are cheap.Definitely worth a visit if you get the chance.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_lCUJN3MObQvNDxIiE2kA"
  },
  "-TNvp3578MYvUbbQVKqR7Q": {
    "date": "1/27/2017",
    "text": "during my first visit to singapore, i knew i wanted to try Kaya toast for breakfast! luckily Ya Kun Kaya Toast was right next to our hotel (AMOY). while I knew this was a chain, every time we walked by this location, it was full of people so i figured it still had to be good if locals were frequenting it haha. we came right around opening (8am i think) and the place wasnt crowded yet. of course i had to order the Kaya Toast with butter set  (~$4 USD) that comes with boiled eggs and kopi. i must say that i thought the kaya jam was a bit too sweet for me, but when dipped into the soft boiled eggs, it was delicious! and omg i was all about that kopi. the kopi still had a strong flavor and the condensed milk gave it just enough sweetness. service was quick and efficient, but this was a quick breakfast stop anyway so i wasnt expecting anything more haha. loved my first taste of a Singaporean breakfast!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HO35wso-psqx0GF--QSwGA"
  },
  "Vz_luvHC0MPNl2Fuwg_KtA": {
    "date": "3/2/2015",
    "text": "I like coming to Ya Kun when I am in Singapore.  Yes, it is overhyped among tourists but I still find myself coming back every time.  The food is solid.  It's very filling too.  I feel like I could skip lunch after eating the \"full breakfast\" here.  If you come early enough, you may even avoid the tourists (who generally comes later during the day).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dgMaDPbbdn7lmSP3wxYFeg",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dgMaDPbbdn7lmSP3wxYFeg/o.jpg"
      },
      {
        "img_id": "l0Vy0t6n73nqxdSEIwoqHQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l0Vy0t6n73nqxdSEIwoqHQ/o.jpg"
      },
      {
        "img_id": "NgwSSJvLEdLkh3oWm0d0sQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NgwSSJvLEdLkh3oWm0d0sQ/o.jpg"
      }
    ],
    "user_id": "2tOny3tty9BlhrGRLWPHqA"
  },
  "_6SLLgMFLHF5WQ0gtztrjA": {
    "date": "9/14/2012",
    "text": "Ya Kun, which has dozens of outlets across the city, does traditional Singaporean breakfast:  kaya toast, soft boiled eggs, coffee.  I'm crazy addicted to soft-boiled eggs doused in soy sauce, so I've been in a lot (or to one of their other shops) for breakfast.  Their kaya toast is good too-- white bread toasted to the point of crunchiness with a thin spread of kaya in between.  And A LOT of butter.  Four huge pats of unmelted butter per sandwich, which is way too much for me, so I always request without.  This location is the original, and kind of neat because they still use the traditional marble topped tables and wooden chairs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jkr3YVCEoRNKkxinUZpW6A"
  },
  "HSLSVkET4qmJ3t2Bh9v4NQ": {
    "date": "3/30/2016",
    "text": "I knew I had to at least try a traditional Singaporean breakfast before leaving.  The menu is stripped back and simple - choose from coffee/tea kaya/kaya french toast all for the equivalent of about 5 quid.  This is a stripped back (as others have mentioned) cafe and if you're in a rush it's probably best to order at the counter and take it to go - once you seat yourself it's all about getting the attention of the staff, so you definitely need to make your presence known by a few waves and constant eye contact. My food came out piecemeal - coffee, then 10 minutes later eggs, and another 15 later the toast but luckily I had the whole morning to hang around so enjoyed people watching in the interim.  This was clearly a super popular spot, and you can see why. If you like a breakfast on the sweeter side, you'll likely enjoy this runny egg/jam and french toast like concoction with sweet Singapore coffee. Be prepared for the sugar rush that follows and don't forget to bring your own wet wipes/napkins (probably an obvious for most of you used to Singapore but I was constantly walking around with sticky hands!)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "zwVYz5sXfeaxdbRr7nXb7g"
  },
  "T2Uj99r9fLhMCHgnb5BpFA": {
    "date": "2/24/2014",
    "text": "So I like too much butter and I don't care if it's melted or not and iced coffee to wash the toast down with was perfect for me. I didn't eat enough kaya toast in different places to make proper comparisons and having just gotten off a really long flight and not adjusting well to Singapore's weather I def didn't want to eat half boiled eggs with soy but I could see how the contrast with the sweet toast would work well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-PoCbyNa4xc4yvReuj5pqw"
  },
  "d74uUX75_iag-iGjr8TD1w": {
    "date": "8/25/2014",
    "text": "I remember asking everyone about what I should eat or buy when I was in Singapore. Kaya (toast) came up multiple times.I was like...\"yeah, that sounds so good!\" In reality, I was thinking...\"what the eff is kaya?!\"For those of you who don't know, kaya is a spread made with coconut, eggs, sugar and pandan...or so Wikipedia says.So I walked into Ya Kun Kaya Toast and of course ordered the kaya toast with butter, and decided on an iced milk tea to go with it. I guess this is a very traditional breakfast for Singaporeans, so I had to try it since breakfast is my absolute favorite meal of the day. I could seriously eat it for every meal. I loved the flavor of the kaya and it meshed really well with the toasted, warm bread. The butter was something I had a hard time with. I felt like when I got to the middle of the toast, I was just eating an entire tablespoon of butter along with the toast/kaya. I could seriously feel my arteries clogging by the second. However, when I asked a Singaporean if it was supposed to be like that, she said yes, and the butter is the best part! Perhaps I'm not cultured enough to understand all that butter, and next time, I'm just going to get kaya toast, no butter! I mean, the butter was good, I just couldn't stand eating it, knowing that it was just a chunk of butter. On the other hand, the milk tea here had good flavor, although it was a little too sweet for my liking. However, it was a great drink to drink with my food! Overall, my first experience with kaya was really good, and I even went to the store later on to purchase a jar of it to bring home. I'm just going to cut down on the butter when I do make my own!",
    "rating": 4.0,
    "rated": {
      "useful": 16,
      "funny": 16,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "3SivZLbETja0J6lIzIVXJA",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Kaya Toast with Butter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3SivZLbETja0J6lIzIVXJA/o.jpg"
      }
    ],
    "user_id": "rNKC5wNAuYCghcQ9ltG_iQ"
  },
  "kcCwF6TNo3IAD7cxzyTXRQ": {
    "date": "8/14/2013",
    "text": "I guess everybody has their preference on where to get the best Kaya toast, but Ya Kun is definitely one of my favorites. The thin toast, runny soft-boiled eggs and teh tarik make a great breakfast and for S$4 you just can't beat it anywhere.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9HxQ24U3rfvQCbGHsEQvQ"
  },
  "gUo2HpiAcqplIxJKtX-Qnw": {
    "date": "1/8/2013",
    "text": "kaya toast overrated.  eggs in soy and hard dried out toast with a slab of butter?  much better meals to be had.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kS1MQHYwIfD0462PE61IBw"
  },
  "HvkR1iI8GEp6ojifNIwqyA": {
    "date": "6/21/2018",
    "text": "Classic Singaporean breakfast that you have to try! The toast on its own is really sweet, but the key to enjoying it is to add soy sauce to the liquid eggs, mix it up and then dunk the toast into the egg mixture, making sure it is well coated. Don't be afraid to scoop more on top! The cold drinks were good as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPM2LPkKHr6apexgbsqXXQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Sets",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OPM2LPkKHr6apexgbsqXXQ/o.jpg"
      },
      {
        "img_id": "CUfwoxTgJP6uygfzzejGlg",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Drink menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CUfwoxTgJP6uygfzzejGlg/o.jpg"
      },
      {
        "img_id": "yAVaBdADK1SeM-PqJf3c2w",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Kaya toast and peanut butter kaya toast set",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yAVaBdADK1SeM-PqJf3c2w/o.jpg"
      }
    ],
    "user_id": "hFpNIimvmgvDIDEo7t9-OA"
  },
  "H8orP8fAAIrwljD6HM0zxA": {
    "date": "10/26/2018",
    "text": "Despite the many recommendations that came to us from friends to try this place when visiting Singapore, it had just an average impression on us. FOOD:- Kaya Toast +3.5/5It's just toast with their famous spread & butter. While it is definitely unique, taste-wise it was just ok.- Soft boiled eggs +3.5/5I'm a HUGE fan of eggs and was excited for this but this also was just... ok. SERVICE:- is quick and fast. Be prepared to pay as soon as your food comes out - that's just the way they roll here. While I would still recommend newcomers to Singapore to try this place when visiting, I would say it's a one-time visit spot only.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "y9i25F5YTTNqUFpuWpAnEQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Kaya original toast, peanut butter toast, & eggs!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y9i25F5YTTNqUFpuWpAnEQ/o.jpg"
      }
    ],
    "user_id": "fFKhHqwhENswtBQQGGhB9A"
  },
  "7cN5Z5hby45f8zehaolLow": {
    "date": "10/16/2018",
    "text": "It's hard to miss Ya Kun Kaya, they are everywhere in Singapore! This particular joint is located near Far East Square, a much bigger venue than the other Ya Kun Kaya outlets. Plus point that they are open at 7: 30 am, to have your early breakfast in solitude. Their menu is simple - it's all about toast+ coffee/tea + soft boiled eggs, but those three things have served me well!I got the savory chasu toast and the durian kaya toast. The chasu toast was quite flavorful, but the DURIAN kaya toast won a sweet spot in my heart!!  Perfectly toasted crisp bread sandwiching the rich and creamy durian paste added with kaya and butter - delicious and they smell so good *sniff sniff* :P Service was not exactly friendly, but at least they are speedy and efficient. Overall, Ya Kun Kaya Toast is an awesome spot to get your quick breakfast fix. I'll most definitely be back!",
    "rating": 4.0,
    "rated": {
      "useful": 36,
      "funny": 23,
      "cool": 32
    },
    "photos": [
      {
        "img_id": "lbZ4VpInLWacQW_zQS0oGQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Durian kaya toast... *Love*",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lbZ4VpInLWacQW_zQS0oGQ/o.jpg"
      },
      {
        "img_id": "fNOOADhK7e8NGinyVfMifw",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Chasu toast.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fNOOADhK7e8NGinyVfMifw/o.jpg"
      }
    ],
    "user_id": "9lU5zOPluc6Y8JZUL9nzsQ"
  },
  "SZ20AOVlfUF62SoDPGk5pw": {
    "date": "7/2/2018",
    "text": "I can not find any listing for the Ya Kun Kaya Toast located at Tiong Bahru Plaza, 302 Tiong Bahru Road, Singapore.I have therefor posted it here, but I wish to stress that this review is in no way reflective of the other outlets.This is not a one day occurrence, in fact it happened two days... in a row!I went there to have a cup of coffee and some kaya toast.The coffee came out after five minutes.   I finished drinking it before the toast came out....12 minutes later and stone cold.How long, I ask you, does it take to make toast....what were they doing...grinding the wheat to make the flour to make the dough to bake the bread to slice it so that they could make toast??Next day, same deal...coffee after a few minutes, and then the wait...and wait....and wait.Finally, after waiting 15 minutes for kaya toast.....and outrageous amount of time, even by the pitifully poor standards of service in Singapore....I very obviously got up and walked out.....even after I had ordered and paid.Can you imagine a Singaporean getting up and walking out after paying for food and not getting it??!......that would NEVER happen.The service in this place stink...stinks... it stinks to high heaven..it stinks worse than rotten tuna fish left out on a hot August day.How is that for hyperbole?I challenge any Singaporean to verbally spar with me on this issue.This place deserves to go out of business.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4G46JJeN-fcYLhvA4mRew"
  },
  "t3dk-j_TEV4f72b7x3PfBw": {
    "date": "1/6/2018",
    "text": "Wow! Amazing! It's so simple but so good! Kaya is the coconut jam that's spread onto the toast then they also put a sliced of butter in the middle. I love how it's dipped into the soft boiled egg, the whole combination is quite unique. Don't forget to add the sweet soy sauce into the egg! This is a popular shop with numerous franchises all over town, I find this location's decor to stand out more than ones you find at the malls! So come to this shop! It's also in a nice area with other restaurants because this is obviously just an appetizer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0CaVxxUHJykxw7dYidi4mA",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0CaVxxUHJykxw7dYidi4mA/o.jpg"
      }
    ],
    "user_id": "SbdPAMSFczxj9USeV_zYsA"
  },
  "T7s3p_jdeXnIOLMTKv73gg": {
    "date": "7/26/2018",
    "text": "A classic establishment in Singapore. Would go for the famous kaya toast, which is surprisingly good considering how simple the dish is. Their kaya paste is not too sweet and has a good sticky texture. The bread is toasted well and the butter adds to the decadence /creaminess. The traditional coffee/tea (Kopi, Teh) are ok - you can find better ones elsewhere.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qIonJzs8hJAlatFLm7xxng",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Toast and Barley drink",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qIonJzs8hJAlatFLm7xxng/o.jpg"
      }
    ],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "7FtqZOWIyiDd87y3wnOJaw": {
    "date": "7/12/2017",
    "text": "I wanted in on this kaya business, as I saw references to it everywhere. Asked my friend KM what it actually was. Just toast with Asiany brioche-like bread with a slather of coconut jam atop.Liked so much, I ordered it again at Terminal 1 in Changi, where there is also a little first floor kiosk!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "1tlkvgP6qkv97hFNPVM1Eg",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Coco jam",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1tlkvgP6qkv97hFNPVM1Eg/o.jpg"
      }
    ],
    "user_id": "g3HFkZgloxLQCvoJ5Zs5gg"
  },
  "6HcuNcG-7Pux3faeLDpx4g": {
    "date": "1/26/2018",
    "text": "This review is for the coffee only. The black coffee with the condense milk has a very bold flavor, but is easy to drink. Wish this was available in the USA. So good!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UQMWAliaJ7oKEwCf0tgo2w",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UQMWAliaJ7oKEwCf0tgo2w/o.jpg"
      }
    ],
    "user_id": "HN-2o_s91nULyyIBa7x2Vg"
  },
  "1Szst0dyvzRSo-OVbGLu6g": {
    "date": "1/3/2018",
    "text": "I don't care what anyone else says: this is the best thing I ate in Singapore. I got the standard set butter kaya toast with milk tea and 2 soft boiled eggs. It was delicious and the only thing I could ever ask for in a breakfast. Toast was perfectly crunchy and toasted; the butter inside not yet melted which is apparently how it is supposed to be. The kaya was the perfect amount of sweetness. My friend who just got an iced coffee said it was delicious too. Don't think you can go wrong here. I could eat this everyday.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "GC4TViVcSHnFaRdTX7nEyA"
  },
  "QbyYCB8hC60AroMnWNHtnA": {
    "date": "6/4/2017",
    "text": "Although this place is a chain, I'm still a big fan of this classic Singaporean breakfast chain. The usual kaya toast with butter, and soft-boiled eggs and iced Milo is the winning combo.My boyfriend and I walked into this place on one morning and got told that the hot drinks maker was down, but Singapore is always warm anyway, so why get the hot drinks? We were however puzzled on how on earth the soft-boiled eggs would be consumed, but the instinct took over and we soon munched the toast-dipped-in egg like a local would.Service is neither friendly nor rude, just the usual efficiency you see in Singapore and I was at least being grateful to be greeted in English, and not Chinese as everyone in Chinatown assumed that I could speak Mandarin (in which I couldn't). I would still go to this place again if I'm nearby, but for now - a jar of kaya jam bought from Singapore should do the trick when I'm at home in Copenhagen. It won't be the same, but at least I didn't have to endure the 12-hour flight.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ca-qtTa9nKS9BjVr2EFGEg",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Kaya toast with butter and iced Milo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ca-qtTa9nKS9BjVr2EFGEg/o.jpg"
      }
    ],
    "user_id": "R0Ko9rVnXc3M_23UzGkgjA"
  },
  "6OjENKdvJSvykYmJ6hNwVA": {
    "date": "4/4/2017",
    "text": "My friend highly recommended the coconut jam here and told us to save room after dinner to try their toast.  Good thing we walked around before trying this place out and glad I had extra room to stuff this down.My husband had a small cup of coffee. He said it was too sweet for him. I personally did not try this so I can't comment on that. Hes also the type of person who drinks coffee black with no sugar or creams. Their Ya Kun Kaya Toast... omg.. i just have to say.. I have never had anything like this before. Super delicious where it wasnt super sweet and just the right amount of jam to make me want to finosh my toast even if i was full from dinner. PLEAsEEEE open in the US!!! I saw they had multiple locations around Asia but non in the US!!! Im going to be sad once my jar runs out of jam! Soooo delicious. Once you try it youre gonna wanna bring a ton back home!!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5SahxlsHH1uLTSkOMMKFCQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5SahxlsHH1uLTSkOMMKFCQ/o.jpg"
      }
    ],
    "user_id": "aA-kQeG86xMsxjKgF14pcQ"
  },
  "lYETtzugVtDBcwawXQyFdw": {
    "date": "12/6/2017",
    "text": "I actually didn't go to this location but I couldn't find a yelp page for the location that I did go to (it was in some mall that is connected to my hotel).. so I'm just going to post my review here lolI came to Ya Kun Kaya Toast for breakfast and ordered the Kaya Butter Toast Set (#1), which came with a coffee and runny eggs. The coffee was good, but it didn't taste that out of the ordinary. I have a really weak stomach when it comes to runny eggs and these eggs were SUPERRRRR runny.. so I didn't eat them and can't comment on how good it is.But the kaya toast... omg SO GOOD. I will admit that I felt a little sick afterwards because of how buttery and sweet it was but it was so worth it! The jam that they put in it was heaven!! Highly recommend a visit if you're in Singapore!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQH7Dq_spE-J9u1mInZ8mQ"
  },
  "ZXWg5TILdzFxjD_8lo5abQ": {
    "date": "5/2/2018",
    "text": "Obsessed with Kaya Toast. One of the few spots I went religiously every morning on my trip. Great spot with fast service.Tips:- Try the white bread kaya toast (no crust). Soft & delightful!- Kaya toast comes with a sliver of butter inside with Kaya- Coffee: Coffee with Milk- Coffee-O: Black Coffee with sugar- Coffee-C: Coffee with sugar & cream (condensed milk)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJhM1_CWTxLrR8YV50Iv_Q"
  },
  "vOc9lAGDGObLnnSqM7vqFA": {
    "date": "3/29/2018",
    "text": "This place was closed for 2 days for Chinese New Year but finally opened on last day of our Singapore trip. Had to try the traditional breakfast. This place has interesting history that you can read about while waiting in the queue. Once we ordered, the food came out fairly quickly. It's a family business and the service was excellent. The coffee was amazing and made the old fashion way w a sock! Order one of the Kaya Value sets and you can't go wrong. Great prices too! Would highly recommend this place for traditional Kaya toast",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yz0nLOEgD7meeoqAkwOOxw",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Yz0nLOEgD7meeoqAkwOOxw/o.jpg"
      },
      {
        "img_id": "NIUVgScvvaPlsZK9xmuNbA",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NIUVgScvvaPlsZK9xmuNbA/o.jpg"
      }
    ],
    "user_id": "g23ioXsVNl2Fvjf-E1W2ig"
  },
  "1kWs2uabtHqkIPxmEugGVA": {
    "date": "11/25/2017",
    "text": "Ordered Menu A, kaya toast with two runny eggs and tea with condensed milk. Not very good. Toast looked sad and didn't taste anything special. Waste of a meal.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kiKyT3FN1H3d3jSTU5I3zg"
  },
  "TqwrO9_PVdapVbM5HfHI9Q": {
    "date": "1/15/2017",
    "text": "This was a very solid breakfast that felt very authentic.While this was my first time having kaya toast, the down-to-earth staff and the other people reflected how this isn't a tourist trap type restaurant. Now about the actual foodKaya Toast - kaya jam is made from eggs, coconut, and pandan. While eating the kaya toast, the flavor is primarily sweet with a hint of coconut richness and a whiff of floral pandan, but sweetness is really the primary impression here. Also, due to the generous spread of butter/margarine, kaya toast feels a lot heavier than you might expect. I thought that the soft and runny soft boiled eggs would be too much for me but I think the quality of the eggs are better here or they're just perfectly cooked. They didn't have any of that raw eggy aroma that can sometimes make me retch a bit.Milk Tea - not quite as rich as hong kong milk tea. I think the UHT milk gives it a bit more of a cooked milk flavor which is quite nice. It's not too sweet, has some decent depth of tea flavor.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CX_vdhW5enA_RceS6NOR1Q",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CX_vdhW5enA_RceS6NOR1Q/o.jpg"
      },
      {
        "img_id": "zQkUD-ESsrYCpIb1OXvgew",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zQkUD-ESsrYCpIb1OXvgew/o.jpg"
      }
    ],
    "user_id": "R4irnMMK_CPECttV9lSzZA"
  },
  "DP7040CWyVUfKXsBrps6ow": {
    "date": "5/6/2016",
    "text": "Put down that nasty free hostel breakfast and go spend the $6 SGD on breakfast here. Gotta eat kaya toast when in Sing; it's their version of dessert for breakfast. This is the orig, so skip all the makeup and go sweat it out at breakfast. The sweetened iced coffee is strong and delicious. Runny eggs you should mix a little with soy sauce and salt. Yum. As others suggested, bring wet wipes! Kaya will glue to your fingers, and Sing is a land of BYOT (tissue) wherever you go.  Staff is so very friendly, but when the boss lady walks around to collect before you eat, better pay up quick!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "omQDcjH68uAsDfim89ghqw",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Singaporean take on dessert for breakfast.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/omQDcjH68uAsDfim89ghqw/o.jpg"
      }
    ],
    "user_id": "lUPSEbFRd3jDOM5agGnjWQ"
  },
  "HiZbNBw4JhuEEFuaRZkVYw": {
    "date": "11/20/2016",
    "text": "Starbucks Singapore style style? There are are several of these in Singapore. They do coffee, soft boiled eggs and toast with butter and kaya (coconut) jam. Comfort food.My only gripe is they have too much butter and not enough jam on their toast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d2RMrjUq9Mgw7HksrorC1Q",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d2RMrjUq9Mgw7HksrorC1Q/o.jpg"
      },
      {
        "img_id": "CHK7SCXsnlOEcDr45X7_1Q",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CHK7SCXsnlOEcDr45X7_1Q/o.jpg"
      },
      {
        "img_id": "M4IJAbkxLQv7NPCANjWqFQ",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M4IJAbkxLQv7NPCANjWqFQ/o.jpg"
      }
    ],
    "user_id": "kpL9GJYRkE_DYV6dsM-Y_g"
  },
  "2bLIUKTVpAbehGt9YrpE4w": {
    "date": "4/18/2016",
    "text": "LOVE YA KUN KAYA!This was our first ever bite of kaya toast. We came here for breakfast one morning before exploring S'pore's Clarke Quay and Chinatown areas. This is the ORIGINAL YK location and it automatically feels \"authentic\" and \"historic.\"This location has the most seating out of all the other YK locations we visited. There is outside seating as well as fans-equipped inside tables. We the set of kaya toast and sugar kaya toast with iced coffee/tea and soft-boiled eggs. HOLY SMOKES. We've never had kaya toast or traditional Singaporean brekkie before and our minds were blown. I still salivate a little thinking about that delicious savory runny and sweet crunchy combo. Pandan is what makes up a lot of the kaya spread...and by golly it's amazing. The servers here all speak flawless English and Mandarin--as well as other languages! Bosses. The service was amazingly quick and efficient, and their menus are easy to navigate--so fret not, foreigners. Shoutout to the amazing staff. We were tourists totally soaking up the atmosphere and DELICIOUS food, but we also saw lots of locals eating here from families to single customers.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "86uSVkO4JM42-FZM1-0V5w",
        "caption": "Photo of Ya Kun Kaya Toast - Singapore, Singapore. Got regular toast ans a sugar toast order",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/86uSVkO4JM42-FZM1-0V5w/o.jpg"
      }
    ],
    "user_id": "0VYzR15p6G18-2_KCsvuEw"
  },
  "zYUXCREjL4yD0Pdz0tQPfg": {
    "date": "4/6/2018",
    "text": "I came here twice in four days for breakfast.  It's a very simple setup.  You get four toast sandwiches with kaya - coconut spread and butter as fillers and then you dip/slather with two soft boiled eggs.  All served with coffee or milk tea.  All for 4.8 SGD; it's a satisfying way to start the day.  Everything comes out moments after being ordered.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvIPL_QTv5Y63pJl60zjCA"
  }
}