{
  "Al4OjaRtVMcjMfJIlI8BJg": {
    "date": "4/13/2017",
    "text": "We were here for a lunch with families and we all enjoyed the experience. The food is very good and the restaurant's location in the art centre makes it an interesting and relaxed venue. Will definitely come again",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BbAr5pdyz1kPApiilQA2jQ"
  },
  "2vE8nDcg69_sKy6_n6GZbQ": {
    "date": "9/1/2018",
    "text": "We went to La Barca on 1st Sep. We have been to this place a few times in the past (an year ago). I must say there is huge deterioration in service standards and courteousy extended to guests. Food quality was nothing great, but the portion size is measly for the money charged. The biggest disappointment was the indifferent attitude of the Manager or person incharge there, when we complained about the portion size of pasta arabiatta which was very small for the price charged. This place is certainly avoidable if you value your money.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_R1LeZsAwburWkDNcJCxA"
  },
  "Ft_KmmguYzsR4vI8W6tz_w": {
    "date": "1/25/2016",
    "text": "LOCATION & PARKING 3/5La Barca is one of 2 eateries located in Goodman Arts Centre, the other being Cafe Melba. There are 2 car parks at Goodman Arts Centre. The first is open to the public & operated by a semi-automated gantry. However, you will need to insert your cash card to gain access (hence semi auto). There are limited lots here so highly likely to be full when there are major events. You can park directly opposite instead. The other car park is for staff access only & there is a security guard house next to it. So unless you are staff or manage to get on the special access list during events, don't bother trying to enter here as the security guards are quite strict. GETTING TO LA BARCA 3/5Once parked & having remembered to lock your car, do remember where you left your car & at which building. Otherwise you might end up taking a long tour of the buildings looking for your vehicle later on. Look for the general sign postings to get to the restaurant, which is almost in the centre of the entire compound. It has a large sheltered al fresco dining area (~30-40 pax seating) cooled by fans that might require further assistance with fine water must jets. The interior seating (~30-40 pax seating) is more comfortable with air conditioning but do make reservations in advance especially on weekends brunch. FAMILY FRIENDLY 4/5The nice thing about this place is that it is especially child friendly. There are baby chairs available. There is also a small play room for the kids. Next to it is also a bouncing castle which is almost always filled with kids & the occasional adult who thinks that they are still a kid & can still fit in. There are no baby changing rooms or nursing rooms however. AMBIENCE 3/5Expect the outdoor seating area to be very noisy with screaming kids running around, with or without clothes, depending on if they were playing in the nearby inflatable pool. For a quieter tete a tete, best is to sit inside, right at back, away from the kids play room, to avoid kids streaking by your table while you are having your drink. SERVICE 1/5I just ordered a spicy pork sausage pizza, and some warm & iced water. The water took 20mins & after I looked at the waiter in the eye from afar, which might have triggered his memory. The pizza took 55mins & 1 check with another staff. The same waiter brought the pizza over & placed it on the table with no apologies whatsoever. Which spoilt my experience there. FOOD 2/5I had trouble locating the spicy pork sausages on the pizza. All I could see were blobs of brown meat spattered around the pizza. Maybe the chef was having a bad day & thought I should go vegetarian. PRICE 2/5S$22 for a pizza & ~S$25+ after GST is not really value for money, especially with the overall taste & experience. Unlikely I will be back unless I'm in the Goodman Arts Centre area again and don not have any other options.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "3Y_CUOUNrGc7M_ZVSruUFg",
        "caption": "Photo of La Barca - Singapore, Singapore. External view. With a bouncing castle next to it",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3Y_CUOUNrGc7M_ZVSruUFg/o.jpg"
      },
      {
        "img_id": "nfgW1-jmqIzdi5Q08Npm1w",
        "caption": "Photo of La Barca - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nfgW1-jmqIzdi5Q08Npm1w/o.jpg"
      },
      {
        "img_id": "twCemdr3hM0HKnSaho8wJA",
        "caption": "Photo of La Barca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/twCemdr3hM0HKnSaho8wJA/o.jpg"
      }
    ],
    "user_id": "X8iuTWYz3zToT4RWa7aBUQ"
  },
  "wh2vLGn-4nepwOAoK0E00A": {
    "date": "9/23/2016",
    "text": "Had the oven baked sea bass and eggplant parmigiana. Both excellent. I would definitely come again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eYACEHMOQPhx-YYR37STEQ",
        "caption": "Photo of La Barca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eYACEHMOQPhx-YYR37STEQ/o.jpg"
      },
      {
        "img_id": "eSp_Fec10fU7New1mfJ70g",
        "caption": "Photo of La Barca - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eSp_Fec10fU7New1mfJ70g/o.jpg"
      }
    ],
    "user_id": "SKxW8e4Tnv5oJzuFIVsUXQ"
  },
  "g9-W8J5xuzPeFm02DiH94Q": {
    "date": "5/28/2016",
    "text": "Food is very mediocre. The few pastas and pizzas are all ordinary.The thing it has going for is it is extremely kids friendly, which means parents get a opportunity for a decent meal without pulling your hair out. They have an indoor air conditioned kids room where they are various toys to entertain the kids. On the outdoor front on weekends, they also have a bouncing castle- water slide thing. All these means that the adults can eat in peace while the kids can run wild. So one star for this. If you don't have kids, save the trip here.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "Q_lDstcpWD9QDnX-S2T3rg": {
    "date": "8/21/2015",
    "text": "Other reviewers have covered it well so I'll just get straight to the point..The place has some unique dishes that are not found anywhere else in singapore. Thumbs up for creativity. Good vegetarian options as well.The place has some middle eastern influences in the cooking as its from south Italy.Taste is good but prices are around 10% higher than average for Italian food from places like Pasta Fresca, Spizza but cheaper than the fine dining ones.The place is actually very good for steaks and I have seen a couple of wine tasting club sessions happening here on weeknights on a few occassions.Best children's playroom for a restaurant anywhere in Singapore.Would go there for the different dishes that have and for the laid back atmosphere that it offers.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "uNGREyb7yQQqxWqrONexaw": {
    "date": "4/30/2015",
    "text": "Came here because Cafe Melba was full. La Barca surprised me with their food! Surprisingly delicious! We had a pizza, seafood pasta, and  a risotto. Chilled and relaxed atmosphere (not crowded at all) good service and great food!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "v29EfuH-GX9kV2hXDeW8Hw",
        "caption": "Photo of La Barca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v29EfuH-GX9kV2hXDeW8Hw/o.jpg"
      },
      {
        "img_id": "P_ESW_DVTwnBUjiCGweBQA",
        "caption": "Photo of La Barca - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P_ESW_DVTwnBUjiCGweBQA/o.jpg"
      }
    ],
    "user_id": "yLovURBrLkNWNhx6sM-KcQ"
  },
  "53At3d20JvBQcreclcGfHA": {
    "date": "12/21/2015",
    "text": "If ur italian and miss home... Here is where it will bring bck home just eating their food!! Amazing!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JZwNjP--bpFZ1wguIqp1Ag"
  },
  "QdqZ3eoGrDd0SZMQi_JwCg": {
    "date": "12/7/2012",
    "text": "The first time I ate at La Barca a few months ago, I had the Bolognese Ragout which was quite good. So I decided to go back several times since to try other dishes. Unfortunately the other pasta dishes I have tried were disappointing...I tried a seafood Ravioli which was the recommended dish then and today I had the Carbonara which is suppose to be done the traditional way.The Ravioli was cold inside and the sauce tasted like canned sauce. I was surprised it was the recommended dish.The Carbonara was really salty and the sauce had a very unpleasant texture... It's just suppose to be cheese, lards, egg yolk and pepper but there is a way to do it so the sauce it makes doesn't become lumpy. So for the pasta dishes I will stick to the Ragout if I do go back for pasta.However, they do make a fantastic chili sauce to eat with the pizzas or with the steak that is pretty good.The ambiance and service is nice.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jTZf5BolBcfli0cNch4V7Q"
  },
  "1Mv7AdIIDHN5juG71EaQ9g": {
    "date": "7/15/2012",
    "text": "It's touted as a restaurant with a one-michelin star chef, but I suspect on the two occasions that I was there he wasn't around for my food, because i don't even recall what I ate now.The food is so-so, it's what I would call a \"Big Plate Small Food\" type of place. Given that I actually in the building right next to it, nothing much about it has really inspired me to visit it that much, even on a rainy day. Probably doesn't help that it's pretty pricey and not something you can do on a usual lunch budget. They apparently do get a lot of people coming from the surrounding Siglap and Katong areas, so I suspect I'm just not part of their target market. I do like their al fresco area though, which has a view of the surrounding Goodman Arts Centre.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "3lyUhHjIj5I98jLcC2wQbg": {
    "date": "7/11/2012",
    "text": "La Barca is a stunning restaurant in an otherwise nondescript location. It shone like a shiny diamond amidst the dusty coal of its surroundings, an unexpected sanctuary in the grey dreary maze of a building that is Goodman Arts Center.Food : The bread basket was cold despite its variety, and honestly we couldn't really taste the flavors of the sundried tomato, the olives or the chilli flakes. It would have helped if the butter we asked for was salted but it wasn't, though the olive oil and balsamic vinegar served as a decent enough dip. The mixed mushroom terrine and eggplant timbale were pretty awesome ...  if more vegetarian-ish dishes were done as well, I'm pretty sure more people would eschew meat. The mushroom risotto was OK, not the best I've had (that honor belongs to Pontini and I had it cold, too). The tortelli was so-so, bit cheesy for my liking. The monkfish wasn't great, and I bit into something hard in the middle ... not sure whether it was because it wasn't thawed properly or something. The beef mille-feuille was rather lackluster, the meat lacked bite and flavor. Tiramisu was ordinary, but the chocolate tart was out of this world! However our overall consensus was it isn't value for money ... portions were pretty tiny ... and the boys actually suggested pizza after the meal.Ambience : Very pretty. Surrounded by paintings, including one that resembles a Rauschenberg (not one obviously). If only we didn't have to walk through a maze to get there.Service : Excellent! Attentive and helpful.Bit of a ghost town when we went. Would do better in a more prominent location. Food not so bloody fantastic that I would go back though.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gZmT_88AEJtk-xT1t_lEuA",
        "caption": "Photo of La Barca - Singapore, Singapore. Chocolate tart with white chocolate sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gZmT_88AEJtk-xT1t_lEuA/o.jpg"
      },
      {
        "img_id": "ULTpY0Z98Bt_rEKuTArKOw",
        "caption": "Photo of La Barca - Singapore, Singapore. Mixed mushroom terrine with bacon and extra virgin olive oil",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ULTpY0Z98Bt_rEKuTArKOw/o.jpg"
      }
    ],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  }
}