{
  "9JLonndi3UkP1DzeLrFgCQ": {
    "date": "5/27/2014",
    "text": "Been wanting to check out this place ever since I saw a friend posting it up on Instagram! Finally made it down to the Eunos branch today, just a short 5 min walk from the station (exit c). I was a vegetarian while studying overseas; it was much easier to find alternatives while eating out... I'm not a vegetarian anymore as it got really difficult while eating out... so I am really grateful for such eateries / restaurants opening up here, to offer vegetarians and vegans more options :) Had the creamy shrooms burger + broccoli (for sides) + Miami peach (juice) for $11.80. Was quite surprised broccoli was offered as an alternative to seaweed fries as a side; thumbs up, in my opinion, for offering this healthier choice. And this may sound a little contradictory to what I just said about the broccoli... but wished they had more soda or even beer selections! Who doesn't love burger with a soda or beer? Heehee My creamy shrooms burger was good! The patty was crispy and tasted a little like chicken! Totally no \"jia liat\" feeling after this meal :) Would definitely love to go back to try out the other burgers :) Crossing my fingers they will open one in Bishan so I wouldn't have to travel as far for it :p",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EP7ASIRUnNEMTacoAnEVHQ",
        "caption": "Photo of VeganBurg - Singapore, Singapore. Creamy Shrooms + Broccoli!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EP7ASIRUnNEMTacoAnEVHQ/o.jpg"
      }
    ],
    "user_id": "EZ3oYT5F_kmhLNQoC-PvUQ"
  },
  "lsEwWaeit0NtZx8WK0-3Cg": {
    "date": "3/17/2017",
    "text": "VeganBurg was at the top of my MUST-TRY vegan food list when I came to Singapore.I even took a combination of two MRTs (a 40-minute journey each way) just to get there. That's how keen I was.VeganBurg is way out near the Eunos MRT, in an area that's not of much interest for the visitor to Singapore (unless you want to check out the brightly-colored Joo Chiat terrace houses nearby to get a taste of Peranakan culture.)Although the location is unimpressive, VeganBurg does have a super-cute atmosphere with a nice outdoor seating area, plants everywhere, and a nicely-designed menu with eye-catching self-advertising artwork on the walls.But the food at VeganBurg disappointed me so, so hard. I had MUCH better vegan burgers at NomVNom in the CBD (Clarke Quay), and I'd go there in a heartbeat over VeganBurg.At VeganBurg, the burger patties are either mushroom-based or soy-based. I'm not a giant fan of mushrooms, so I scanned the menu for one of their soy-patty burgers instead. Their \"Hawaiian Teriyaki\" burger had a soy-based patty and was marked with the \"best-seller\" icon so I decided to opt for that.What a mistake. The burger was completely disgusting. The soy taste of the patty was overwhelming and gross. (And I'm a vegan, so I'm very used to the taste of soy-based mock meats. So this isn't me being some picky carnivore trying mock meat for the first time.) The pineapple taste didn't match well with the taste of the teriyaki (and I also lived in Hawaii, where both pineapple and teriyaki sauce feature prominently in the cuisine). The contents of my burger kept falling out, making for a very messy meal. Bits of the pineapple rind kept getting stuck in my teeth. The seaweed fries were meh, nothing as special or exotic as they sounded. The only drink choices are two flavours of overly sweet punch from a machine. And, ultimately, the food was overpriced for the quality.Very very disappointed in VeganBurg, especially after my long journey to get there. Maybe the mushroom burgers are better, if you like mushrooms.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nOKu51_Cz3ks6eQbPdG-7g",
        "caption": "Photo of VeganBurg - Singapore, Singapore. VeganBurg exterior at night",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nOKu51_Cz3ks6eQbPdG-7g/o.jpg"
      },
      {
        "img_id": "U-xRR_3yeUWoz_xh6nXR9w",
        "caption": "Photo of VeganBurg - Singapore, Singapore. Hawaiian Burger, seaweed fries, and drink. #tourist",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U-xRR_3yeUWoz_xh6nXR9w/o.jpg"
      }
    ],
    "user_id": "iFjKasqkx7shSFsYOgNG2g"
  },
  "0MK31WSINpZmzlDX27tUlQ": {
    "date": "10/24/2017",
    "text": "Very tasty veggie burger. They had many different options of burgers and all of them looked amazing. The soup and spinach pops were also incredible. Definitely a must visit place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SjVQWs8k4h6-0GyK156pfg"
  },
  "SHTt53kiD5uHBfgba7TPgQ": {
    "date": "3/6/2016",
    "text": "In my mind vegan food is pretty boring but I have a vegan friend who has proved me wrong several times so when she suggested to go to Veganburg I enthusiastically followed along.This joint near Eunos mrt serves Vegan fast food and has a nice vibe to it. The cafe has a quite green theme so kudos to that. I definitely think the concept is quite unique: vegan fast food is bot something you see everyday.We had the the sliders combo, the spinach bites and the burger of the month which was a Japanese style (so a rice patty acting as buns) sesame curry burger. All were quite tasty and I did not miss the meat at all, however I wasn't blown away either.Considering this is quite far for me, I don't think I will travel East especially for it, however, if I am in the neighborhood, I might jump by.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D4nLFyxVcjk8M3laqb0xHA",
        "caption": "Photo of VeganBurg - Singapore, Singapore. Buzzer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D4nLFyxVcjk8M3laqb0xHA/o.jpg"
      },
      {
        "img_id": "AoASgAQdw4t5VSTaxkQc3g",
        "caption": "Photo of VeganBurg - Singapore, Singapore. 3 sliders for 9.90S$",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AoASgAQdw4t5VSTaxkQc3g/o.jpg"
      }
    ],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "0Fxad_Rnm9FEk2Ue2EsoOQ": {
    "date": "2/19/2018",
    "text": "Insanely good vegan burgers. Doesn't taste like a legit burger, but delicious n definitely satisfies your craving for one. Even the meat eaters with us loved these vegan burgers. Try them!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7Edu3Ia2giRFbwGpvJt-w"
  },
  "ZFhj63lsmZ8lCPd-foBIPQ": {
    "date": "6/15/2015",
    "text": "Bumped into this (can i say it's fast food?) restaurant in Eunos.Just looking at the restaurant signage made feel healthy.Had a cafe vibe outdoors and a fast food joint counter inside.ordering is easy enough and the menu is simplified..you know what you're getting in that burger.I was pleasantly surprised that it's only $5.90 and if you want a meal it's just a $3.90 top up.Staff was friendly and helpful, eager to please :)So the sausage tasted like sausage and the potato balls thing tasted pretty good.The soy burger tasted like chicken.that's normal right ?It's a good burger. Not over top , not those $30 burgers.Just a simple burger. no frills.I guess it's alright!",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "uWKQ9S3itiA5G110RRJrVA",
        "caption": "Photo of VeganBurg - Singapore, Singapore. Peek a boo   Mustang relish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uWKQ9S3itiA5G110RRJrVA/o.jpg"
      }
    ],
    "user_id": "HVI-zkVRU8gHfsShr7kc8w"
  },
  "kv5ZEwKztRQcTjHtxSFR8Q": {
    "date": "7/15/2014",
    "text": "For vegan burgers, they don't put much veggies in them. I had a Shrooms burger, which was a fried patty, some mushrooms in sauce, and a leaf of lettuce. I was surprised that it didn't have many veggies and the freshness and crunch I was looking for.It wasn't a bad tasting burger, just could do heaps better. I did add one star for having fresh veggie options instead of plain ol fries. My companion got the seaweed fries which was very underwhelming. Go figure.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "EDZTPZ_bn3R2HQA6bHl7hg": {
    "date": "7/30/2015",
    "text": "Best Vegan fast food I ever tried in Singapore. Found this place on Yelp and decided to give it a try. Had the Mustang Relish with a cup of chilled Broccoli. The burger was very good. The patty and bread tasted awesome with the mustard and relish. The cup of broccoli could be better if they add abit of butter or salt for taste.Would definitely visit again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "FVAjHqV3JZDhqG-8uDX8UA",
        "caption": "Photo of VeganBurg - Singapore, Singapore. Mustang Relish w Broccoli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FVAjHqV3JZDhqG-8uDX8UA/o.jpg"
      }
    ],
    "user_id": "zs_GDugp4_WuftbvB-iR_A"
  },
  "6aPPt6eLNhecBB5SLfi4oA": {
    "date": "8/5/2012",
    "text": "Almost everyone who has been down to VeganBurg loved their burgers and have been raving about them. I mean, I love my vegs and I'm a good kid who polishes them off my plate (I only ever pick out the celery sticks) but going vegan was a notch further.I'm glad I made the trip down because... my, my these burgers have a fantastic bite and flavour to them! Quite different from the usual vegetarian fare we have out there. I even convinced my colleagues to order VeganBurg for lunch just two days later.Try the creamy pepper shrooms and smoky bbq. Sure the patties are slightly drier than usual but I do like that it is more fibrous, a texture which I enjoyed in my burger. Plus, it makes you feel good to go vegan for a day. Have them with seaweed fries, you can't go wrong with that.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Ujq7tuRheNOM1Xex5Bzug",
        "caption": "Photo of VeganBurg - Singapore, Singapore. Cracked Pepper Mayo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-Ujq7tuRheNOM1Xex5Bzug/o.jpg"
      }
    ],
    "user_id": "W8vFfu8VMe9EAhDcphjDuQ"
  },
  "VuMzEtcfhecOdEX5nmKUJA": {
    "date": "2/1/2014",
    "text": "It's simple for Veganburg. The food is fantastic, the service is bad enough to make my stomach release enough acid to digest the fantastic food. The burgers are lusciousssssss. Love that they stock ginger beer and the ambience is good. Near to Eunos MRT and easy to drive to as well. The staff seem either hungover and slow, or irritated and impatient. It could be a one off thing, holiday season and all that, but bad service is bad service, yknow?On the whole I'd say order, and bring it home to enjoy. By the time you reach home, hopefully your irritation with the staff would have faded enough for you to nomnomnomz in peace.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TsI3kOjuVkZzJThuiJb3RA"
  },
  "w84ksNEYg0Gh_7AEWINorg": {
    "date": "12/19/2015",
    "text": "VeganBurg is a great place to stop for a mouth watering veggie burger.  The patties are nice and succulent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6tWC8li_ro7dxQtKdvSBw"
  },
  "OET2Fg2PRtBvUp1RUi8oNA": {
    "date": "4/11/2015",
    "text": "Top notch food! Specially for me a vegetarian. Couldn't eat a good decent burger anywhere before love the place! My favorite is Mustang Relish! Must try even my non veg friends love it I can eat with them here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mjxixkAnZTRiSxbX3DO9TQ"
  },
  "vszwguKe2rTArVEJrDD97w": {
    "date": "8/24/2012",
    "text": "As Vegan Burg demonstrates, vegan food does not need to be stuffy, tasteless and unsatisfying. They serve delicious organic vegan burgers in a casual, but really hip, café setting in the East. The vintage bikes at the entrance really set the tone for the ambience of the place, and I love the stylish yet unpretentious feel of the interiors. They have a good variety of burgers to choose from, ranging from classic options to more original recipes. My personal favourite is the cracked pepper mayo burger - yum! Get a meal to have a mixed juice and seaweed fries thrown in. While the burgers are great, there are a couple of sides that just don't translate very well into the world of veganism, such as the hotdog and franks. I've tried both of these tofu-based sides and didn't like them at all. That aside, I am giving Vegan Burg 4 triumphant stars. Don't let the \"vegan\" put you off - their burgers are delicious, and it's a great place to hang out!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OID9ZOyljsyx7HVAP_29aQ"
  },
  "nbKtOXjLzkgi51d9x5xIvw": {
    "date": "7/27/2014",
    "text": "I had never been to a fast food vegan joint--didn't even know they existed (although I have often thought I would like one to).  It was fun.  The seaweed fries needed more seaweed--they tasted like normal fries (but not bad for that).  The Hawaii burger was very good.  The portions were smallish, but maybe I am just American.  I would definitely go back (someone should start one in the US).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ay2fd521w-dAJbrHKAx6Cw"
  },
  "CV1i_qidALliPIJmb6kXtQ": {
    "date": "7/22/2012",
    "text": "For someone who hates most vegetables except peas and spinach, I never thought I'd enjoy vegan food. My experience with vegan food has been pretty nasty. It is usually oily with a weird grainy texture and tastes nothing like what they're trying to substitute. I believed that if I were ever to go vegetarian, I'd rather have a meal that is meant to be without meat like vegetable soup than substitutes for meat. Veganburg definitely proved me wrong.I was introduced to Veganburg by a vegetarian friend. The burger patties are delicious, and not oily and fatty like most other fast foods. It is definitely a healthier option to our usual fast food places and not because it's vegan but because of the way the food is prepared. Although I'm still not very fond of meat substitutes, the patties still taste good which is more important, and taste nothing like meat. Due to the vegan restriction, the options are also unique and creative like the seaweed fries.If you've never tried vegan food, this is a good place to start!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5av7ZYxifKl1jPttRSvt7Q"
  },
  "j8JhOpoNZeek9oftXh8A_g": {
    "date": "7/11/2012",
    "text": "Really tasty, organic vegan burgers, in a funny old spot in Eunos.We used to get in the car and come here especially. But it's right by Eunos MRT.Been here several times and everyone has always enjoyed it. I've had the smokey barbeque, cracked pepper and satay one. All were really tasty. I think cracked pepper might be my favourite. The patties aren't rubbery or oddly textured. If I'd had it when I was a child I wouldn't have even noticed it was a vegetarian meal, I'm sure. A good healthy alternative to meat.There are nice outside seating areas and the inside is white, clean, and airy. I left Singapore before the new branch opened in Raffles Place and the website suggests they're going to Marina Bay too very soon. Try them out!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TSyFKnoCPCngncabkd54tQ",
        "caption": "Photo of VeganBurg - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TSyFKnoCPCngncabkd54tQ/o.jpg"
      }
    ],
    "user_id": "FLemW70cdBvhmQalAVoJXw"
  },
  "ifytAslB5q7oseCJrxE6LA": {
    "date": "7/14/2012",
    "text": "If you've ever thought vegan or vegetarian food is boring or bland, think again. Veganburg will convince you otherwise and raise the bar: fast food that's delicious, original and absolutely free of any animal products. The first of its kind, Veganburg is expanding quite quickly; it now has 2 branches and 2 more on the way, and is looking to expand out of Singapore too. Hipsters may want to try it now so they can say they tried it first ;) Popular on the menu for good reason is the Creamy Pepper Shrooms burger ($7.85), which is the vegan equivalent of Burger King's Mushroom Swiss. Just as appealing are sides like Vegan Franks ($3.80) and the Seaweed Fries ($3.80) that go great with your burger. One thing that distances Veganburg from the convenience of a fast food joint, however, is its price. Expect to pay $11-$12 for a meal (burger + drink + fries), although for what you're getting - completely scrumptious, organic and cruelty free good - the extra couple of dollars is justified. Veganburg also has a delivery service: 6844 6868 for Vegan goodness delivered right to your doorstep!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8H2waZrjUBU5-lbHo7ouw"
  },
  "iRtT3H7kbfc11Jl_PLoTzg": {
    "date": "10/13/2014",
    "text": "Man was that gross!  The spinach pops, seaweed fries and \"chillers\" were great, but mashed up mushrooms into a burger patty is nasty.   Evidence that I've gone too far with my vegan diet.  I wanted to run to omakasee and make up for my error.  Instead I punished myself by not getting a full meal that night and just ate my seaweed fries.  So sad, as I was really looking forward to supporting a restaurant that offers my liefstyle choices.  I agree with someone else's review and would love to see more veggie options.  Maybe a burger full of lettuce, real mushrooms, big slices of tomatoes, raw red onion.   Maybe a chick pea or quinoa option would be nicer.  The bun was quite soft.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LavQOLaS9_eg3MDXNxYxog"
  },
  "p6mMKPmsoqDUFCRINB0QBA": {
    "date": "8/26/2012",
    "text": "I LOVE Veganburg! I am so happy to be able to find a tasty vegetarian burger joint here in Singapore. Veganburg has an array of different vegetarian burgers. All of the ones I have tried have been really good. Expect a healthier version of fast food here. The fries are seaweed fries and instead of sodas, chose from yummy juices. Everything is vegan here and even if you are a meat eater, I am sure that you will leave satisfied. They are expanding fast around the island which is awesome! And they also deliver to certain locations aroudn Singapore. Try the satay burger--in one word, amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "pdEIKdBYjqhtlpqnrqS9Qw": {
    "date": "8/20/2013",
    "text": "Ok burgers at reasonable prices. Not a fan of the fat, greased fries and the dry patties.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tp9EvdZZzFFwfH1m2SVJ9A"
  }
}