{
  "I2F_w988-Ie7-NJQOttMJA": {
    "date": "3/20/2017",
    "text": "Overloaded and Overflowing with GoodnessPhotos of Izy's Signature Nokke Roll have been appearing on my facebook and Instagram feed for a while now and we just couldn't resist the opportunity to give it a try. Sushi at 10 pm? Why not! Izy is a very modern yet cozy dining bar with counters for seats. No fancy table cloth or setting, just a bar, a napkin and the most powerful tool you'll need in a Japanese restaurant, chopsticks. The senior staff members were very friendly, thanking us for coming down, explaining and proudly showcasing his in house made bottled cocktails to us but the younger guy.... looked tired and a little stoned but not unfriendly just.... monotonous. Japanese Nokke Roll ($45)Yes... at a glance, $45 is A LOT for sushi but once it hits your table, you'll understand why it's worth every cent. 6 rice rolls were overloaded with a heavenly mixture of crab, ikura (salmon roe), negitoro (fatty tuna) and my favourite, Uni (Sea urchin) The rice here is very lightly vinegar-ed, allowing you to taste the full flavour and sweetness of each protein. The seafood was very fresh and didn't have any hint of fishiness. Ikura's were bursting with a rich, almost creamy saltiness, while the negitoro melts in your mouth, leaving behind a pleasant hint of tuna. The uni was to die for. Rich, creamy, melt in your mouth goodness that brings together that indescribable sweet, umami, fresh from the sea sweetness. Rainbow Roll ($20)While this may seem like the more \"common\" modern sushi, the rainbow roll here is amazingly well executed. The salmon was wonderfully fatty, the tuna, fresh and delightful, the snapper, amazing, I've never had snapper that tasted that clean, sweet and fresh before. With a mixture of fish as a topping, each bite brought a different experience yet, the flavours and textures of the different fishes brought out  different complexities in the dish while the cucumber added that fresh crunchy bite and the avocados, which were so creamy, tied the flavours together harmoniously. All I can say is, having a sushi roll at Izy's isn't just a dining experience but an adventure you hope would never end.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k8Hr8AIGg9wcsWLIJok5DQ",
        "caption": "Photo of Izy - Singapore, Singapore. The mindblowingly amazingly delicious Nokke Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k8Hr8AIGg9wcsWLIJok5DQ/o.jpg"
      },
      {
        "img_id": "MV80jnYsax-2svKi2ctApg",
        "caption": "Photo of Izy - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MV80jnYsax-2svKi2ctApg/o.jpg"
      },
      {
        "img_id": "AJ1c3j7x2NdGJHPlMLSKBg",
        "caption": "Photo of Izy - Singapore, Singapore. The rainbow roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AJ1c3j7x2NdGJHPlMLSKBg/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "iTZeWqbpuL-eyFUH-L-6SA": {
    "date": "5/12/2018",
    "text": "This is my favorite restaurant in Singapore. I always get the Omakase menu. They are very creative and the staff is always super friendly. The waygu course is amazing, probably worth ordering that on its own. Can't wait to be back in a few months, is always the highlight of my trip.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrPtef5zHbstkhx5-WoHCA"
  },
  "bNIjAWvl_24lh4czPZtukg": {
    "date": "7/24/2015",
    "text": "Though their interior was well decorated and their website is tech savvy, their food was mediocre and didn't seem to justify its price.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MJatHPTT8NgC8nRYqxaZWw",
        "caption": "Photo of Izy - Singapore, Singapore. Wagyu rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MJatHPTT8NgC8nRYqxaZWw/o.jpg"
      },
      {
        "img_id": "KddtnH9Zu6WS3PHAFXb9BQ",
        "caption": "Photo of Izy - Singapore, Singapore. Uni pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KddtnH9Zu6WS3PHAFXb9BQ/o.jpg"
      }
    ],
    "user_id": "v-GbMECGvcOscLlBEdn6Zw"
  },
  "dwV9rr40ao9xvtokVfZ3JA": {
    "date": "9/9/2015",
    "text": "This place is worth a visit, I've been here now for both lunch and dinner and found it to be highly enjoyable on both occasions. This is an awesome place with some of the coolest \"classy graffiti\" I've seen in Singapore. Upscale yet modern and hip feel. Ideally, you should opt for the counter seating so you can see the magic with your food being prepared by the chefs.For lunch, I ordered the Truffle Waygu Don. Seemed like a no brainer to visit a place for the first time and get that one and I have no regrets for doing so. Sliced truffle and perfectly cut waygu that melted in my mouth made this an incredibly worthy choice for lunch or even for dinner. The rice was excellent as well. I also ordered their fried chicken which was also very good. Ice cream was included which was a choice between blue cheese with shiso or pineapple. We got one of each and surprisingly the blue cheese didn't taste like the blue cheese that I dislike so much. Very much enjoyed it.For dinner, I brought out a group with 5 others and we all thoroughly enjoyed it. Sitting at the table outside, we did the pork skewers, the sea urchin linguine, the fried chicken and also one of the fish dishes. Everything was perfect, we ended up ordering multiple orders of each. We topped it off by ordering a few bottles of sake and felt pretty amazing afterwards.I love it here. The service is great, location is right at the start of Club Street which makes it easy to get in and out (or hop to another bar after dinner), and something to take note of is that there is a cool speakeasy in the back with some awesome creative drinks. One of my favorites in Singapore and I know I'll be back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "aJKLRcTZUSrKaPNejCyf8Q": {
    "date": "8/24/2017",
    "text": "We really enjoyed eating here. Every dish was so delicious and so fresh. Particularly the sashimi. You must get the wagyu beef truffle don. We finished every rice grain. Also the crab croquette is a must. Best we ever had!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sLHTIxIvPyB91eLUXKLZTA"
  },
  "y3DWSUKARbSUvmQNQ3CdKA": {
    "date": "10/5/2016",
    "text": "Time to try local places.  The owner was really nice to recommend a sake. He also poured for me while I was sitting at the counter.  I learned that Wed is \"ladies night\" in Singapore.  It was a tasty \"set\" and I will come back agai",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4GnNN8nAdcjx9gBlGO7NA"
  },
  "WiJ7r7NvRDOvPvdX2OceQg": {
    "date": "5/18/2014",
    "text": "I wanted to like this place, I really do. But the dishes definitely has a \"trying too hard\" issue. The chef tried to ensure that there is a burst of flavors in almost every dish - sweet, spicy, sour and salty.....and not in a good way.With good ingredients, sometimes all you need is to let the ingredients shine through and there is no need to over-season. We tried practically almost all the recommended items, and some were just bad (karage chicken), some were interesting (like hmmm, interesting, but we don't have to eat it again).Another disappointing tapas bar. I am almost giving up on tapas in Singapore.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dkWNUGIrzaDWDp11CHjd9A",
        "caption": "Photo of Izy - Singapore, Singapore. Soba with spicy tomato and uni",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dkWNUGIrzaDWDp11CHjd9A/o.jpg"
      },
      {
        "img_id": "rZxOYM2lE0olATHRHcIkLQ",
        "caption": "Photo of Izy - Singapore, Singapore. Pork belly ginger roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rZxOYM2lE0olATHRHcIkLQ/o.jpg"
      },
      {
        "img_id": "O9DHfCArT80-5S1uBegnbA",
        "caption": "Photo of Izy - Singapore, Singapore. Garoupa and sea urchin",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O9DHfCArT80-5S1uBegnbA/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "7FZZqjQV6rSzf0DLjIepcA": {
    "date": "4/16/2014",
    "text": "Last Friday, five of us visited Izy for the first time and sat in the back room.   Service was attentive and the selection of tapas we ordered were all tasty.  We all agreed that the pork skewers were exceptional.  It ranks up there as one of the best encounters with pork I have ever had.  Simple and straightforward, this pork is flavorful and melts in your mouth.When the skewers arrived, all of us dove in at once.   Immediately, there was a collective gasp, an exchange of knowing glances and then a long moment of silence as we slowly savored the first bite.  Once finished, we quickly called the server over and asked for two more serviings.  The drinks seemed a little light on the alcohol, but we fixed that problem by switching to Sake.  The Good: Pork Skewers, tapas, and attentive staffThe Bad:  The first round of drinks was weakThe Verdict:  You had me at Oink!  Looking foward to another visit.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TLyCfP11oClvrpGN-enPew"
  }
}