{
  "HPF1xvz9OmvErCMAYIJZrQ": {
    "date": "7/24/2018",
    "text": "I was a big fan of this no frills, family run establishment, which we were introduced to by a friend who lives in Singapore. We had a family style meal with a wide array of dishes but the curry crab and the tofu dishes stood out to me. The restaurant also has ice cold tiger beer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hvm17O89JE3Gv63glW7TQ"
  },
  "UpUHBbLr9GsKMgq9abOZhA": {
    "date": "10/6/2016",
    "text": "Woken up at 2:30 am in the morning by the room next door blasting effing Selena Gomez and Rihanna.  Ooh na na, what's my name...?  I have a few names in mind for you...Anyway, rather than kicking their door down, I decided that my energy would be better spent searching for some grubs, since I had roughly 5~6 hours to go until proper breakfast time.  Sin Hoi Sai was one of the few places that open past 3:30 am in this quiet little area of Singapore, and as far as I could tell, Selena/Rihanna haters were welcomed.Menu selection were listed on the lighted boards above the restaurant.  I went with the Indonesia chicken and baby Gai Lan since I recalled that both of those had pretty solid mentions.The veggie came first, and it was solid with a nice garlic flavor.  Texture was crunchy and that slight bitterness that I like in Gai Lan really came through.  The Indonesian chicken came with a bit too much breading for my preference.  The taste was also a bit too salty for me.  When I looked at all the menu selection again, I realized that pretty much of the chicken options were pretty much breaded...  They had shrimp and fish available that appear to have no breading, perhaps those would have fared better...Well, next time I get woken up by RiRi, I will certainly keep that in mind...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2n0i_AhJujmaWLG_4lvojQ",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Indonesian chicken.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2n0i_AhJujmaWLG_4lvojQ/o.jpg"
      },
      {
        "img_id": "A95ZkJwS_9d4vJ1QRHTooQ",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A95ZkJwS_9d4vJ1QRHTooQ/o.jpg"
      }
    ],
    "user_id": "PMMcGelLIQEF_7mILSBkJA"
  },
  "zuXfpOsNuXPy_D5EgkQaiQ": {
    "date": "3/5/2018",
    "text": "I was in Singapore and my friends who lives here brought me out to this place. They did the ordering so I can't recall the names of everything ordered. I know we had the chili crabs, gailan, baby clams, eggplants, and fried chicken. Everything tasted really good! I felt like an insider eating here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3qPEWkgD32MxP9bIp2zow"
  },
  "pjvVjhVVqMNcX9uFQFRDwQ": {
    "date": "1/3/2017",
    "text": "This place is fine, but pricier than I would have liked. We paid about $270 for 11 people. The food tends to be a tad salty. My biggest gripe about this place was that they charged $2 per person for tea, and never once changed the leaves in the pot. This means, we paid $22 for one pot of chrysanthemum tea--that's outrageous and disgusting. Had it been 2 or 3 pots of tea, fine. But one pot of tea that gets topped up with only water? $22 is way way way too much! We ordered everything sized large, but some of the dishes were impressively small for a 'large size'.We ordered:Chaipo Tofu--OK. Tofu quite soft. Chaipo not crispy though.Guinness Pork Ribs--Very small portion. There was not enough pork ribs for everyone to have a single piece on their own. Tastes very good though, but portions were too small. Not worth it!Cereal Prawn--The prawns were a little overcooked and dry. Cereal topping was not bad, but there were not that much cereal topping.Salted Egg Squid--Very good! Squid was overcook and slightly chewy.Yam Ring--OK. A bit salty.Har Cheong Gai--Good and crispy!Thai Style Chicken--Good! Folks liked this dish.Sambal Kangkong--Very salty.Garlic Huang Di Cai--Very salty.Stir Fried Lala--Not as good as it was touted to be. Lots of shells that didn't have any meat in them.Sun Moon Hor Fun--Very impressive with raw egg on top, but taste like regular horfun or pad see ew. Not very special.Sap Gam Hor Fun--Not bad, but not that much wokhei flavor.Mee Goreng--Too spicy for a lot of us.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BuzKnDvh5Ds_K0-PHKN81Q",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Thai style chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BuzKnDvh5Ds_K0-PHKN81Q/o.jpg"
      },
      {
        "img_id": "SiRBzuFHvWnTuY9s5SbEbQ",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Mee goreng",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SiRBzuFHvWnTuY9s5SbEbQ/o.jpg"
      },
      {
        "img_id": "0xpOiihyAdMKCCgr8epY6g",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Chai po tofu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0xpOiihyAdMKCCgr8epY6g/o.jpg"
      }
    ],
    "user_id": "6wGjjZkbAhcPnorLeh6INg"
  },
  "PxUyDzJrLt0sAypLpdnHtw": {
    "date": "5/25/2016",
    "text": "Our favorite east coast eatery introduced by a buddy who bailed for vietnam! Marmite chicken and salted fish fried rice. Nuff said",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8kS6vb1zS4Yj5bY4i3qPjw",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8kS6vb1zS4Yj5bY4i3qPjw/o.jpg"
      }
    ],
    "user_id": "4CibfBhfRWkGQMWH0enmFQ"
  },
  "v6v5CJOxjyTdvS5jb-kShA": {
    "date": "6/26/2015",
    "text": "I recently went to Singapore for vacation and one of my family friends invited us to eat here. He said that the food was much better than more well-known seafood restaurants in Singapore and it was much more affordable.The ambiance was very similar to a restaurant in Vietnam, where most of the seats are outside and the chairs are plastic (if I recall correctly), and the exterior seems a little dingy. Don't let that fool you though, because the food is actually really good.I didn't order the food so I can't recall everything, but I really enjoyed all of the vegetables we ordered and the Indonesian chicken! We also got the famed chili crabs and pepper crabs, and while they were good, I'm not the biggest fan of crab so I didn't enjoy them as much as everyone else in my party did. The chrysanthemum tea was also really yummy! I'll admit I'm not a huge fan of seafood restaurants (though I love sushi and sashimi) and I had food poisoning whilst i was in Asia, but even I could tell that this is a really decent restaurant. If you want to save money but want to enjoy good seafood, definitely come here instead of the other famous restaurants. You'll basically get the same quality of food. If I come back to Singapore, I would definitely come back here as well. Perhaps I'll be healthier and be able to enjoy the food more next time!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DswhAs2lFqkfBjKlRFo50A"
  },
  "d-12-BzA3rz-GYV1Gvr46g": {
    "date": "5/11/2015",
    "text": "Rule No. 1: Do not follow the crowd in Singapore when choosing a restaurant. I live down the street and often see this place packed in the evenings, more so than the Five Star Chicken Rice place next door. So one evening we decided to give it a try and it was probably the last time we'd ever go there. Dishes we ordered: garlic baby kailan, three-cup chicken and garlic stir-fry clams. What was brought over to the table was half cooked kailan with some visibly blackened leaves, overly sweet three-cup chicken and very gooey stir-fry clams. We couldn't finish them. It was completely uninspired cooking, and these materials deserved a lot more tender, loving care. Service wasn't bad, which was probably the saving grace.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lleClbpw96fc972yzbDZLA"
  },
  "DBJ5SKbgAji95KgKuBL0aw": {
    "date": "6/24/2014",
    "text": "Sin Hoi Sai Eating House - If I lived anywhere closer to the East, I am guessing I would be here a lot more than I'd be willing to admit. In a tight group of 8 friends, 7 of them live pretty close to Sin Hoi, and these 7 congregate here for dinner at least 2-3 times a week.On the few occassions I've been here, service has been excellent, also in part due to the fact that my friends are regulars. They swiftly take your order for beverages, leave, bring them to your table and collect your food orders while they are at it. On weekends this place does get crowded, so avoid peak dinner timings, or be prepared to wait for a table and for your food orders to be served.We have a few favourites, I'll list them out - do be certain to give them a try! We love going for their sambal char siew fried rice, prepared with an adequate amount of spice and served in a portion good for 1 person. We swear by their Indonesian chicken dish, a slightly tangy crispy chicken dish where the fried chicken is glazed with a light, spicy gravy and onions. Being chicken fans, we almost always have to have their hot plate chilli ginger chicken as well - a bowl of it dropped right on to the hot plate at your table so it's sizzling and all the more enjoyable when had with the fried rice. The few other favourites include their baby kailan in oyster sauce, crispy noodles, fried salad you tiao, sambal kang kong and prawn paste chicken. Their menu is expansive, and I wouldn't say that the food here is inexpensive, but given it's prime location and good quality, you pay for what you get. (I spend an average of $10 - 15 here including soft drinks and food shared with about 4-5 friends). I would definitely have to come back here many more times to try everything else on their menu. Lucky I have friends who are regulars.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rRas1bGzAjZmEspPM7BdZA"
  },
  "nG1qmPUn_xe-yuO2WjNIew": {
    "date": "9/18/2014",
    "text": "Black pepper crab, oatmeal fried prawns, samba stingray, baby gailan - So good! My first dinner in Singapore did not disappoint! So flavorful, so fresh, food here was amazing! I would take my friends here in the future when visiting Singapore again! Shiok!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gjYfXvUFjqeOWqESVq8OwQ",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gjYfXvUFjqeOWqESVq8OwQ/o.jpg"
      }
    ],
    "user_id": "bWvuUQ0XsduI_V5z4DaDSA"
  },
  "kM1nGcVNOwKXZ4vaGMUZAw": {
    "date": "10/12/2012",
    "text": "standard tze char. nothing fancy. Pricing is a little high, I thought,  but then this is Katong.I love san-lou horfun. This place's not bad, but still lacking that elusive wok-hei flavor.The marmite chicken - I had better marmite dishes. I love marmite and the salty-bitterness of it all. The marmite flavor is not enough for me. (then again, for people who doesn't quite like the taste of marmite, they like this dish as it is more subtle). Also didn't like that the portion came mainly with chicken breast pieces only. I will eat there if I am around the neighborhood. but nothing to hike the distance for.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bIM3yiJqodo-hQK8utNGhg",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Marmite chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bIM3yiJqodo-hQK8utNGhg/o.jpg"
      },
      {
        "img_id": "5egwITyb65tgLVVMmE55DQ",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Baby kailan with garlic",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5egwITyb65tgLVVMmE55DQ/o.jpg"
      },
      {
        "img_id": "xc_gfWTS_90ZujRG8i9Klw",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. San Lou hor fun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xc_gfWTS_90ZujRG8i9Klw/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "P_U6m1zkvFSAsIdX7d4YOg": {
    "date": "11/3/2014",
    "text": "Had a wonderful dinner last night. Was actually going to go to a burger joint but this place caught my eye. The service was great and so was the food, basic simple flavours that the kids loved. Definitely will be eating here again before I leave Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3vmjPFxynwUHpOSDM2ilCQ",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore. Soya prawns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3vmjPFxynwUHpOSDM2ilCQ/o.jpg"
      },
      {
        "img_id": "-qFMyzES3vMOfJLDhSkrmA",
        "caption": "Photo of Sin Hoi Sai Eating House - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-qFMyzES3vMOfJLDhSkrmA/o.jpg"
      }
    ],
    "user_id": "nkoz7KpYFh0-FyhtGZk-kA"
  },
  "okksJHYIv01ZyumBfSYEoQ": {
    "date": "7/10/2012",
    "text": "Having supper here is always the best way to cap a night of partying off. The explosion of tastes from the awesome Sambal Beef Fried Rice is always a good way to wake yourself up from that drunken night that almost ended with you in an alcohol coma. A plate of prawn paste chicken on the side should help with that burnt tongue from the sambal. Yup, do beware. It's spicy!The operating hours are from 5pm to 4am however, they do start washing the place at about 345am so try to get there and place your orders by 330am. There are lots of parking lots within walking distance at Chapel Road, Chapel Close, Cheow Keng Road or Lor Stangee however, it can get quite busy at dinner time because of the many restaurants in the vicinity. Late nights, are never a problem.I'm there at least 3 times a week and I really hope to bump into you folk soon. See ya!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "uOTNLX7v8MyEikB1yVux3Q"
  },
  "NjfJCQY9nidsDkzN52maEw": {
    "date": "7/16/2012",
    "text": "Known for its seafood and extensive ways in which fried rice and noodles can be served, Sin Hoi Sai is a secret gem for vegetarians too. It isn't on the menu, but there are a number of dishes cooked with mock meat that you can choose from, as well as customisable options from the regular menu. Just ask! Highly recommended is the Indonesian Chicken. which always manages to fool even the most meaty of meat-eaters. It goes great with fried rice, which you can ask for with only veggies (instead of meat) and tofu (instead of egg, if you're vegan). Go green with Garlic Kang Kong, a veg-friendly alternative to Sin Hoi Sai's Sambal Kang Kong. Just those 3 dishes and you're set; that's pretty much all I order every time I'm there, which is pretty often :) It's also cool for enjoying some beer before or after a big night out partying!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v8H2waZrjUBU5-lbHo7ouw"
  },
  "DoBYvZMKLlRha8Feqg6WEQ": {
    "date": "9/9/2012",
    "text": "My mum is in love with this eating house, and then she made us all fall in love with the awesome hor fun and sambal kangkong. There is a charred fried flavour that the chinese call \"wok hey\" with the hor fun and they have concocted a really solid sambal  for their vegetables. Prices are really reasonable, for a family dinner with 4-5 dishes, we would probbly pay $60- $70. It can get really crowded and noisy over the weekends. So if you're starving maybe it's not so good an option to go for dinner on a weekend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKY29o3cqaQYcFdR_bZdg"
  },
  "5tqMVqm-WjZenvKiC0ZZkw": {
    "date": "12/2/2013",
    "text": "Followed the reviews and saw most people were really happy with the food. I decided to go with Indonesian Chicken (spicy) and Shrimp and Pork Fried Rice. Great flavors and adding the chile soy sauce to everything just made it much better. Highly recommend this if you are in the Katong neighborhood.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1LD7-5WA4494Hr6N8TwM6w"
  }
}