{
  "VVHU3zyEBmCbrwafe2H7ig": {
    "date": "3/2/2017",
    "text": "Was craving for pancakes, and what better place to try out, than this place with its obvious name. The menu is really strictly pancakes both sweet and savory. I went for the standard stack of pancakes with maple sirop and better. You get the option to choose a small, medium or large stack. Since I did not know the actual size of those pancakes, I just went for large. Oh boy, and it was definitely large. A bit too much. The taste was nice, but the last pancake was too much. So I asked them to pack it for me. Nicely packed in a box, with some maple sirop on the side, I got to take it home. And I warmed it up the next day. Nice. Overall only 3 stars, because it was just a pancake.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IhW5tW8-yRhxX5nQjYIxGA",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IhW5tW8-yRhxX5nQjYIxGA/o.jpg"
      }
    ],
    "user_id": "O5c8SgONRdgDdej4A9W1KQ"
  },
  "IT8gL_jjdsVuwDnpxzfpZg": {
    "date": "5/9/2016",
    "text": "Came here on a Monday evening for a meal with friends. The meal was going well up until I found a large piece of eggshell in my chocolate pancake. I went to the staff to show them the piece of egg shell and complain. I was met with a sense of apathy and a mumbled apology. I told them that perhaps they should let the chef know. I was really disappointed with how the staff dealt with the issue.The staff made no attempt to recover the issue and just looked at me with a blank expression.I felt like I was the the strange person in the situation who had made a mistake rather than vice versa.I don't mind if the chef, staff, or management make a mistake but it is important that they try and deal with the issue and situation at hand.  The staff at strictly pancakes made no attempt to deal with the issue. That's why I am giving one star.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pAqFPoG4iv1Y8Z3krTV2lA",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. Eggshell in my pancake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pAqFPoG4iv1Y8Z3krTV2lA/o.jpg"
      }
    ],
    "user_id": "N4n86fjkr4Z9puf3wg0xpw"
  },
  "SMyhv1NdE7Q9egeiNfRUgA": {
    "date": "11/19/2017",
    "text": "We tried to go here on Saturday morning as a family.  Ot sounded like a good place for Saturday brunch from the internet.  It is really surrounded by a bunch of pubs.  At 11am and the outside tables still had beer towers and dirty dishes on them from the night before.  Zero cleanup Friday night apparently. We peered through the window of Strictly Pancakes and it looked in disarray and also, unclean.  The staff didn't even notice approaching customers.  We turned around and left without spending a dime.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aQnd3nfJtMwCtCpfZLs_Gg"
  },
  "XqzUBqR8WEc9TlAZagiUgg": {
    "date": "12/4/2015",
    "text": "A cozy place to have pancakes and chill.Tried the pancakes with kinder bueno. The pancake was well done and the kinder bueno compliments it very well. The ice cream that came with it is good too!The only downside is that the sauce was too sweet for my tasting, and this comes as a shock as I have a sweet tooth.It is a little too pricey for pancakes but you can go try it yourself! Pancakes with ice cream and kinder bueno- 6.5/10",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HxDn0n3utolDDusLzX5Q_Q",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HxDn0n3utolDDusLzX5Q_Q/o.jpg"
      }
    ],
    "user_id": "r0QB_cBSApIM7JCEUV5EVw"
  },
  "C-1lwUW3FcWWTYiWXhnQ0w": {
    "date": "12/30/2016",
    "text": "I've been here multiple times and location is a good one. The cafe seating upstairs is bright and airy due to the air well. Coffee is also good. As for its signature pancakes, standard seems to have dropped over the years.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2YfaOxC0cUy1KeMr8aCBMA",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2YfaOxC0cUy1KeMr8aCBMA/o.jpg"
      }
    ],
    "user_id": "elaLkfhrp_1O5kDA7ssuwA"
  },
  "UBT4hwJiHiIshdB9RalBUg": {
    "date": "8/17/2013",
    "text": "It been a while since I've been back to Strictly Pancakes. My recent visit back has been nice but I think I made a wrong choice in the Garlic Prawn Pancakes.Dont get me wrong, it's so garlicky, garlic lovers would be in heaven. But it was a bit too strong and too much for me. While I'll like to have a little bit of savoury to balance out the meal, but I also like ability to put some maple syrup on my pancakes. This garlic prawns totally dont gimme any room for syrup! :(in any case, it's still good and the next time Im back, i want space for my syrup!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sKCp7mm1gpmjk1lV_7Abpg",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. Garlic Prawns Pancakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sKCp7mm1gpmjk1lV_7Abpg/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "Yl_y8GtUJP2zSldfnMwOBA": {
    "date": "11/4/2014",
    "text": "Went to Strictly Pancakes @ Prinsep St during lunch time and luckily my friend had made a reservation because the queue was really long! I ordered garlic prawn pancakes, and it was very very filling! Finished only 1 pancake and was already full, so personally I feel that it is better to share with 2-3 friends :-)Atmosphere was not the best, place felt a little too crowded to feel cosy. Service wasn't the best as waiters were sulky. 2.5/5 stars because service was pretty bad but the food was okay!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iec7fqFuZk1p9sPEbEwLTQ",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. Garlic prawn pancakes!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iec7fqFuZk1p9sPEbEwLTQ/o.jpg"
      }
    ],
    "user_id": "pDSjxnisLn0bHtVzZ7jOgQ"
  },
  "NwKNJmjBGrTwqG24Q4QdHg": {
    "date": "10/2/2016",
    "text": "Worstest experience ever! Waiting in a empty place for minutes to be served and then taking another 10min to prepare a iced coffee! Paying only with the manager who don't have any idea about nothing! To bad to go again!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u22eebDEMoaiJlQ9IbGW3A"
  },
  "oqnmMdtg8BZbdqsak4HdJA": {
    "date": "10/25/2014",
    "text": "late dinner with a friend after her exams... was greeted at the door and sent upstairs to the seating area. very small homely place with a cosy feeling. the staff were all pretty young people and always in a rush. sometimes it feels like they weren't listening as much and always rushing off somewhere.ordered the stack with turkey ham and hash. had the impression that it was a DIY stack but it came out deconstructed. i was a little dismayed as it looked really flat on the plate. the pancake was a little thick and there was a doughy aftertaste - like it wasn't cooked through. would have liked it a little thinner and crispier and of course with the ingredients IN the pancake and not on the side.but the saving grace were their sides. sweet potato fries and wings were good. although they are called 'strictly pancakes', their sides trumps the pancakes anytime. maybe they should rethink their brand... or rethink their pancakes for that matter. to say the least was disappointed with their pancakes. maybe i had a very high expectation - thinking they are the pancake specialists... sadly I know of other cafes that do better pancakes.come here for a late night snack with the good ambience and late night openings. just order drinks and sides. try the pancakes only if you are really really craving for them.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4eE9ACHaK7-CSjDL6YPr7g",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. fried wings are always good :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4eE9ACHaK7-CSjDL6YPr7g/o.jpg"
      },
      {
        "img_id": "kD_5wF00PeskFUMMXdHkjA",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. deconstructed pancakes with corn hash and turkey ham... was a little disappointed. thought they will be cooked together.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kD_5wF00PeskFUMMXdHkjA/o.jpg"
      }
    ],
    "user_id": "SUxcerD3p3AXUII_Qqu3ZA"
  },
  "4aw3F4n3EWnaNNtV3wLxIQ": {
    "date": "9/6/2012",
    "text": "Friends around my age are always raving about this place - but I don't get it. I wouldn't pay $14 for a stack of flat flour & egg filled things(talk about processed carbs!), and we waited close to half an hour for our orders (despite being told they'd be out in 15 minutes), and we even had to walk in and ask them about it! They are clearly understaffed, but what I don't get here is that they have an upstairs seating as well? Are they out to displease all of their customers by making them starve while waiting?Food was meh, pretty alright, the hamburger steak they made was pretty good (needed more salt), and they are pretty filling (well they are almost 100% carbs - what do you expect?). Wouldn't come here - and if friends insist, I would sit out.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CKDSbFbH2uQwA_qanbURUA",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CKDSbFbH2uQwA_qanbURUA/o.jpg"
      }
    ],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  },
  "aHSw-1dgfbdRa1nhbIhfsA": {
    "date": "1/12/2014",
    "text": "I'm not sure how I feel about this place.. I want to say nice things because there wasn't anything glaringly bad about our late brunch/lunch but if you asked, 'what's so good about Strictly Pancakes?' Uhhh, lemme get back to you..It's just painfully average - decent food, the plain stacks aren't mad expensive, there's some sort of ambience and a little sunlit alcove upstairs, service was perhaps a touch better than you'd expect, but still.. just alright.I wouldn't kick up a fuss about going back, but it's definitely not on my list of best brunch spots in Singapore. Sozz.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BYMkKm1hlV2eIX9hDY_Q5w"
  },
  "ZtB-7SJDAe5xYQnx5NxEvA": {
    "date": "3/13/2013",
    "text": "This quaint little 2-storey shop is found in the midst of a row of shop-houses along prinsep street such that you might almost miss out on it. The second level is most certainly the more desirable level to be on as the first level is often empty.The serving in this shop is definitely an overkill for just one person alone as one will get sick of the taste of pancakes after having it for awhile. I went there as a group of 4 and ordered 3 meals to share amongst the 4 of us, thus the portion was then, just right. The Garlic Buttered Prawns with Pancakes is personally my favourite and I highly recommend that you try this. The sauce that this pancakes are served with is almost too good to be true. However, the cherry tomatoes may just stink your mouth up so I suggest you don't eat them unless you've got mints on you.To counteract the savoury-ness from our first meal, we ordered the caramelized apples with pancakes and it was indeed a heartening choice. The caramelized apples were not overly-sweet and thank goodness for that. The scoop of ice cream that comes along with this meal is quick to melt thus I suggest that no one should hesitate in digging into this meal upon its arrival.Our last order was the \"Snuggle Up\" whereby 2 sausages were wrapped between 2 pancakes with toothpicks holding them together. This meal is considerably good, however it would seem to fall short if you've had the above 2 pancakes already.This place caters more to people who would just like to catch up with their friends instead of dates( unless you take the window seat and you go really early).In total, we spent $11 per person which is absolutely worth it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_zPfcUKlNIrN3glQ7ezS3w",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. Caramelized apples with ice cream and pancakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_zPfcUKlNIrN3glQ7ezS3w/o.jpg"
      },
      {
        "img_id": "OMkL-7tP8zEc9MDdohkvDQ",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. Garlic buttered prawns with pancakes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OMkL-7tP8zEc9MDdohkvDQ/o.jpg"
      }
    ],
    "user_id": "-WzhULBlAxyFkxxbO0q_fA"
  },
  "8obrYcOAVun6x1yBQek-Tw": {
    "date": "8/14/2012",
    "text": "What does Strictly Pancakes sell? Obviously PANCAKES in all shapes, sizes and whatever innovative food they can throw in to go with Pancakes.... Strictly Pancakes has done it. Ever heard of a pancake burger? Two thick pancakes that are suppose to substitute the typical burger bun with a beef patty slapped in the middle. Go to Strictly Pancakes and you can order this unusual dish. If you are like me and find it a bit odd to eat such a dish, go for their desserts... which are pancake based (Ok, it's quite a duh thing). I went for their triple chocolate pancake with a scoop of chocolate ice cream, strawberries, chocolate chips drizzled with chocolate fudge. A chocoholic like me can only clap my hands with glee when it was served. However, after going through one and a half pancake.. oh boy was I filled up. One thing I have learnt from this.. Strictly Pancakes may sound like a \"Meh... probably desserts only..\" place, but boy, I was in for a surprise with their interesting menu and their uber filling pancakes. If you ask me why I didn't rate this higher, it's because the location is pretty out of the way and the service was kind of terrible.. took us quite a while to order our meals and to get our food served.. and it wasn't peak period to boot!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TW8rktMwm51g3Otllquuqg",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. Take a look at how SINFUL this is!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TW8rktMwm51g3Otllquuqg/o.jpg"
      }
    ],
    "user_id": "_6zTmwRscQUpbyo8etB0nQ"
  },
  "GifQP6CvhEDkBdrbQ2gfsg": {
    "date": "2/9/2015",
    "text": "Strictly pancakes was strictly lame. The waitress seemed like a zombie. (I've seen The Walking Dead. I can spot a zombie from a mile away.) The pancakes were okay but I just expected more. I opted for the short stack with unsalted butter, maple syrup, and scrambled eggs. The eggs were too watery. The pancakes were crumbly and not in the good way. Super disappointed. I've heard there are a lot of other brunch places so I guess I'll try some others.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "dEH03F7nGsdS_zftd0Gckg": {
    "date": "11/29/2012",
    "text": "I'm guessing novelty pancakes are a thing no matter where you go. Discovered Strictly Pancakes one morning (when kaya toast just wasn't cutting it) searching the interwebs for a reasonable brunch dive where I could throw down on some flapjacks. We hopped over on the Circle line to Bras Basah MRT and walked our way up Princep where we found it--damn near hidden in a cute little complex of other restaurants and shops. The two-story shop was renovated about two years back and is really aesthetically sound. It's really cute in there--very stylish in a Singaporean avant garde kind of way. While it can get a crowded on the weekends, the wait in my experience hasn't been long. I ended up scratching my garlic monkey and went for the Potatoes Leeking Cheese, which is two pancakes stuffed with potatoes, cheese and leek, served with a side of sauteed mushrooms, garlic and herb butter and a  side of bacon to balance it off. For a drink I tried the Ice Blended Hazelnut Latte, which always seems to disappear as fast as it comes.I was actually surprised to see so many locals in here. Although most were younger, I would think that the Western palette would probably appreciate this place much more. Then again, theres no need in trying to make sense of Singapore. It's an anomaly in itself!The one thing keeping this place back would probably be the service. Cold and aloof (and this is coming from a pretty cold and aloof person) the staff sometimes seemed to not know what was going on or wasn't able to understand what their patrons wanted.Check out Strictly pancakes if you're craving a flavorful (good portioned) treat. Since my first visit, I've been a frequent visitor, telling any and everyone about \"funky pancake place!\" From savory to sweet (yay for options right?) you can't go wrong heading here for a brunch date.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tV2_gkppGeXPEdodbwmyBA"
  },
  "UWLcn6-Y5zfmUUuLNuH-Nw": {
    "date": "8/25/2013",
    "text": "Get Fun and fancy w/ur pancakes. Enjoyed my garlic prawns short stack and butter options. Learned the hard way: plan to eat here AFTERNOON more like 12:30 when they are ready to serve full menu, sweet and savory dishes and drinks are avail. Don't eat outside (too many flies). Would give 4-stars if customer service is better and restaurant was cleaner (but that's every place in Singapore).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "65uanCxCQIkiw76wbVWtHw",
        "caption": "Photo of Strictly Pancakes - Singapore, Singapore. It's a short stack underneath that garlic butter prawns!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/65uanCxCQIkiw76wbVWtHw/o.jpg"
      }
    ],
    "user_id": "dssWr3EdIPlfnhR4AE602g"
  },
  "PClUlvdxUcXPvHcDk_R73Q": {
    "date": "8/5/2012",
    "text": "If you love pancakes, you might enjoy Strictly Pancakes. For the casual dinner who has the sudden craving for pancakes and are lazy to make their own, or if you're past McD's breakfast timings, then you're in luck. Not the most fluffy of pancakes, the pancakes on offer are pretty decent, and decently sized for the relative cheap price. You get a choice of salted or unsalted butter (go for the salted one, it makes a difference trust me) with maple syrup. You have the option of asking for another serving of butter and syrup at a slight cost, if you love your pancakes sweet! One thing to note, unless you're really crazy about chocolate pancakes, it might be wise to stay away from the Druggie as that is one seriously \"heavy\" pancake. Don't have it alone but share with friends.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "K9P-EynUeEBDmqyXGvwBPQ": {
    "date": "8/14/2012",
    "text": "I really wanted to love this place. Truly, I did. Imagine the prospects: a beautiful, golden brown stack just off the grill. A pat of butter and a drizzle of maple syrup. Or a side of smoked salmon. I mean, it does look as pretty as I fantasised in my mind but taste wise, it sadly bombed. These pancakes are dense, and after one, I was starting to fill up rather uncomfortably. Also, if you're seated on the outside of the premises where the trees are, a word of caution - there be cockroaches afoot.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  },
  "ZKOse76RdacU5khA6w13hQ": {
    "date": "8/3/2012",
    "text": "Strictly Pancakes at Prinsep Street is a wonderful place to have breakfast or a quick brunch with a friend. Everything there is served with pancakes, and although the food there is rather pricey (for pancakes, and taste exactly like MacDonald's), one can choose to have short (2 pancakes), medium (3 pancakes) or (4 pancakes). Had the Savoury Pancakes-Salmon Run($14++) and would recommend it to those who do not want too sweet pancakes, and enjoy salmon from time to time. Opening hours: Mon 6pm-10pm, Tues-Thurs 11.30am-11pm, Fri 11.30am-12am, Sat 10am-12am, Sun 10am-11pm.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g8VcsAZyMrak3vdrLr3b7w"
  }
}