{
  "hjE4kvNC4SJFDYNszMpdWw": {
    "date": "1/10/2016",
    "text": "Fantastic Restaurant, in almost every way. We stopped in here after some Diwali shopping and were happy to escape the heat and crowds by heading upstairs to the air conditioned dining room.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "_DDTeIubkh7QcgMQgcVn6A"
  },
  "mdkBqHawJnrTuZhjpRGt0A": {
    "date": "11/26/2015",
    "text": "We're Americans living in Singapore. We decided to have our Thanksgiving dinner at Khansama Tandoori, because we are very thankful for Indian food and we have heard good things about this restaurant. When we first arrived, our server seemed a little unfriendly, but he warmed up to us. I could not remember what palak paneer was called, but he knew as soon as I described it and added it to our order. We also tried the butter chicken, the assorted tandori and the butter and cheese naan breads. Everything was delicious and the atmosphere was comfortable, clean and very nicely decorated. There is also a fairly well stocked bar as well as a descent house white wine. I would happily recommend this restaurant, and only suggest that you prepare to leave very full.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8w8ZB4jT-s6-mP3m3kG-wg"
  },
  "az6HTus3iv7mwjey4WlJHA": {
    "date": "12/20/2014",
    "text": "Made a walk down to little India and stopped at Khansama tandoori for a bite to eat with friends.   The butter chicken, lamb rogan josh, tandoori chicken, samosas, lamb boti kebab and chicken tikka masala were all amazing.   Also should point out it was the most reasonably priced meal we had all week and it was the best.   A couple Heineken and a curry.  Does it get much better than that.   Atmosphere was awesome sitting on the patio with all of the activity of the streets of little India around you.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OqPZCBH-g5vlzsYSAloYLQ",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Butter chicken and lamb rogan josh before being devoured",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OqPZCBH-g5vlzsYSAloYLQ/o.jpg"
      },
      {
        "img_id": "AXJYQmrzja095OKWjRkKig",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Tandoori chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AXJYQmrzja095OKWjRkKig/o.jpg"
      }
    ],
    "user_id": "B7SDhAA7ed5yoRpJrtvs2A"
  },
  "2So0spvan48SsO_-5ARvLg": {
    "date": "11/7/2013",
    "text": "One of my most beloved Indian restaurants in Singapore that is non- vegetarian (which also means they sell alcohol, beer with spicy Indian food is great!)We eat there all the time. Or we order in and they deliver for free above 50$. So far we have never been disappointed which is why we eat there and order in so often. Love it! Staff are super friendly and helpful and willing to recommend things especially when they get to know you and your tastes. I am addicted to a few of the dishes, the chilli pakoras (green chillies stuffed with red chillies, battered and fried - heavenly!), the samosas, mushroom mattar (mushrooms with peas), dal, baingan bharta (smoked mashed aubergine) and I could go on as their tikka is great too. I have posted about it a lot on the blog but here is at least one review:mylifeinsin.com/2013/01/…",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2lrdQWjAlTpVYklsYsUa3w"
  },
  "nTaZV2hpqeWZ6TC-KPNBYA": {
    "date": "7/22/2016",
    "text": "Awesome food. Tandoori perfect amount of spice. Curry excellent and service was great!!  From USA so owner was extremely helpful with what to order.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5g4vKcU55Ews_37w_e3WSA"
  },
  "lWztetNH0P7WhybY1dNNBA": {
    "date": "2/24/2015",
    "text": "The food is good especially the kebabs, however a special mention has to be the chicken roll they are authentic and remind me of the rolls found in New Delhi .... A must have here",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CpGjjYQ8LRBmAn6ARE9qWA"
  },
  "7vfiElNqx8mItDG1npYzJA": {
    "date": "7/18/2012",
    "text": "A place that has wicked kebabs and butter chicken. This the best kebab place i know in singapore. All of their dishes are pretty rich and fattening with lots of butter and good stuff. However i must confess between my second last trip and my last trip i did feel like the quality of the food went down while the price went up. I might have gone on the wrong day. However i am generally a big fan of the quality of food here. The prices are not too cheap. The staff is friendly and the ambience is pretty nice.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oV1Mu13jOS3sBhYpGBHJeg",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oV1Mu13jOS3sBhYpGBHJeg/o.jpg"
      }
    ],
    "user_id": "T9aL7kkxRYJVkysnFPQefA"
  },
  "oQiPeKC7Vp0GVO2LBdJtBw": {
    "date": "11/6/2015",
    "text": "The food is great but it's pricey and the waiting times ruin the fun. Be prepared to wait 20/30 mins for food to be served. Even an extra bread could be an extra 10 mins.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_HoNXCnz_0UemsmPtWZbCw"
  },
  "NjoDol4JYS8JvYjeC1VDrA": {
    "date": "10/5/2015",
    "text": "To notch north Indian cuisine! Had the tandoori chicken, pakoras, mushroom mataar and a tomato based shrimp dish (forgot the name, sorry). All was superb. WARNING though, I ordered this sour and salty herbal drink out of curiosity. It was described as a digestive drink. It is a VERY acquired taste, aka it tastes awful. Be warned.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_faajOJ58vhKCjOGbd-tQ"
  },
  "TfnDLRQtrDV_YlWYiP1Dyg": {
    "date": "9/2/2013",
    "text": "Food was very good.   The chicken masala was overdominated by Green Peppers which neither of us enjoyed.  The butter chicken, rice and Naan were excellent",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0UmAZ-ZGg3Iych1sllMaxw"
  },
  "syhayeBwD0NXkVRWJK8ccg": {
    "date": "3/16/2016",
    "text": "The service could be better. It would have been good if the servers are more informative especially to customers who are unfamiliar with the food. It would also nice to have a service with a smile - that will help to improve the dining experience. Such a pity as the food is quite good.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "igArJzH3TqD_71_76chkBw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Garlic and cheese naan with chicken tikka masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/igArJzH3TqD_71_76chkBw/o.jpg"
      },
      {
        "img_id": "r6_jq5RzZ-eKcj1RQtGnNA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r6_jq5RzZ-eKcj1RQtGnNA/o.jpg"
      }
    ],
    "user_id": "HZNNx5s6cIY7s0XOrstWIg"
  },
  "mR2pXdjNiGEp9aMSAwaZjg": {
    "date": "4/21/2016",
    "text": "Update:  Returned this week and they're still using the table and chairs that makes Khansama Singapore's \"most uncomfortable restaurant\".  The sad thing is that the furniture obviously cost them a small fortune.  It's very detailed and over designed.  Sadly, the chairs are so large and the detail on the tables so low that it's impossible to maneuver the chairs under the table.  Two chairs barely sit side by side under the table.  Plastic outdoor furniture would be an improvement.  Tip:  The waiters are there to upsell you on more than you need.  Be cautious because they've mastered the art of persuasion, and don't seem pushy at all.  They will suggest more than you need.  Unsuspecting Ang Mohs beware - Best to order less then order more as you gauge your hunger.Reducing my rating by one star for the torture chamber devices that they call tables and chairs.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sIoW8-MdaP-mZiP476K_kQ",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. The furnishings here are like medieval  torture chamber devices. Most uncomfortable restaurant furniture in SE Asia.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sIoW8-MdaP-mZiP476K_kQ/o.jpg"
      }
    ],
    "user_id": "TLyCfP11oClvrpGN-enPew"
  },
  "xXXxDFwrIiTHvof1YzikCQ": {
    "date": "2/16/2017",
    "text": "Food and service was amazing. I highly recommend this place also a plus that it was air conditioned.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pcpQDY4Us7vEr3CpRSKSng",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Some of the best ChickenTikka I've had.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pcpQDY4Us7vEr3CpRSKSng/o.jpg"
      },
      {
        "img_id": "QL7SuFkRa7kcyMvTULpf-g",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Samosas were great and filling",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QL7SuFkRa7kcyMvTULpf-g/o.jpg"
      }
    ],
    "user_id": "4Liz6kDpOvofBjz23rePkw"
  },
  "IA3-hQJnveAtajFPt2uloQ": {
    "date": "1/20/2018",
    "text": "Eaten here on two separate trips  both time the food was very good and nice staff. Sitting on the street  Sunday afternoon watching the people. Very relaxing",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Svond8F7AND7u6Tn3jfBOA"
  },
  "ZMH73vE98OITsaJvN8NWHg": {
    "date": "9/27/2016",
    "text": "Mom and I went in for an early dinner while here in Singapore...we were seriously craving some good Indian food. Well, we found it! The Kahali Prawns and Curry Chicken were delicious. Perfectly spiced, good sized portions. The naan bread was good too. The server, however was not very friendly at all. No smiles, had to flag him down constantly. But maybe after our week in the land of smiles, Thailand, it was more noticable lol!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yp0Q3dcGDnilHXVe74rY9Q"
  },
  "z8_mNrAhf9dPf0XVn8ekUQ": {
    "date": "6/18/2017",
    "text": "Unattentive, on the verge of being rude, but that might just be their regular everyday attitude.  Aside from that, really good food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ha-MAYCH6T3dEzdMjr5U2g"
  },
  "bOKGtXloyrDZGBC99epmQQ": {
    "date": "9/12/2016",
    "text": "Delicious dishes and beautifully decorated.Located in the middle of little India.Waiters were very attentive and helpful in explaining the diversity of dishes.We are very impressed and for sure we'll come back",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eR3mln6O2HM4ujoecu6hHw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eR3mln6O2HM4ujoecu6hHw/o.jpg"
      },
      {
        "img_id": "fJ4ZC3ddwECAue59ZuSBiA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fJ4ZC3ddwECAue59ZuSBiA/o.jpg"
      }
    ],
    "user_id": "cqONDpoQIEqA9kiaEaYAcA"
  },
  "GkCQE_6k2Im_h_nhPXSkDw": {
    "date": "6/27/2017",
    "text": "This place is popular among tourists and has really great paneer dishes. 10/10 would visit again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kK8S1kl39AmyIrPjFR-aQg"
  },
  "Fi5I4XWQhLIpdjuCNSUu1Q": {
    "date": "3/17/2016",
    "text": "First let me say that the food is wonderful, but the service needs CPR. The waiter never smiled and I had to flag him down for water even though he passed me several times seeing an empty glass on the end of the table. It seemed as if he was too busy flirting with the waitress to take care of the customers. Truly, this is my only complaint, but it was definitely aggravating. Like I said, the food was wonderful and I will probably order delivery from now on from them. Definitely order the king prawns if you go there. You won't be disappointed.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "mffEboZ125tHS7UpmXC90w"
  },
  "S4Q_n2X0x_fT7b4aNFRL3A": {
    "date": "7/22/2016",
    "text": "I'm a regular at Khansama ever since i moved to Singapore about a year ago. This is my \"Happy Place\". I go here every weekend and atleast twice during the week.The food:Authentic, yummy, delicious North Indian food. You will *NOT* be disappointed! My favorite order here is the Chicken Tikka Masala with some Kulcha. The meat is always done just right, lots of flavor in portions that aren't too large, and aren't too small. A portion of curry here would serve two people just about.Recommend:Non Vegetarian:- Chicken Tikka Masala- Mutton Biryani- King PrawnsVegetarian:- Dal MakhniBreads:- Masala Kulcha- Rumali RotiThe service:The staff is very friendly, contrary to other reviews here. Just set up a conversation and remember that this is a very popular restaurant that's packed to the limit almost everyday so they're bound to be a little busyThe chairs:Oh gawd, this is the worst part! They're not comfortable at all no matter what size you are. There's no clearance between the chair and the table so it's a really awkward way to sit. The food makes it up for everything though :)Price:A typical meal for one here without alcohol comes to ~SGD $28 - $35. Remember to pay with \"Nets\" which is a state controlled payment method that has no fees compared to Visa which will tack on a few more dollars ;)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwcQ7wgzmTr0cHcJ8e_ZfA"
  },
  "wSDZEnxrWprklswH3IOmuA": {
    "date": "3/29/2016",
    "text": "An evening of exploring lead me to this place, of which I can say I ate one of the best Indian meals I have ever had.You can sit inside, or out on the street - I chose the latter and ordered a beer while I waited for my order to come.The food came quickly - some mixed vegetable pakoras, mutton vidaloo, and naan. Wowzer, the flavours were spectacular, and the customer service was amazing. I topped it all off with gulab jamun - the traditional Indian desert.Out of all of the places I ate when I was in Singapore, I will be going back here ASAP. Totally _totally_ worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGlMoo7wlj22_VuJzmrFJA"
  },
  "ZSmswD0_tpLKUZUNjWF2Bw": {
    "date": "5/30/2016",
    "text": "Excellent quick service, I had so many people waiting on me at the rush hour I was amazed. The food was great and I even ordered more to take home with me. I tried the mutton curry and it was excellent. I ended up bringing some chicken home with me and it was awesome.I definitely will be eating at this place again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eeNJj7clxxalXJVKQibTyQ"
  },
  "2-SFpq3E5Ei8fkTN1qB2QQ": {
    "date": "9/5/2015",
    "text": "So far, my fav restaurant in Little India. I have been here a couple of times, and will be back for more...  Anything from the tandoori oven is great, as well as lamb dishes ...and the dal makhani.  Rice biriani also good.  Butter chicken may be the only thing so far that was just meh.About the venue:  I have to say that the fact that there are no windows in the upstairs room is a bit strange! :-)",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "yoeZxztSGb1yW7g1C6-AHQ": {
    "date": "9/30/2016",
    "text": "Food was good and price was not bad.We ordered 2x naan, vegetable samosa, tikki, butter chicken, and mutton masala, and it was just below $50.Butter chicken was a bit too sweet and masala was a bit too salty and naan came in cold though.Overall Verdict: 4Taste: 4Amount: 3Price: 4Atmosphere: 3",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "flSaZwD9S3J-fKdaOzQ12Q"
  },
  "1BQ6uYGP3Quagk5Kvc8YNQ": {
    "date": "10/22/2016",
    "text": "We had the samosa, butter chicken sauce, garlic naan and butter roti and everything was delicious. The decor is pretty traditional with givers crowd.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7oSgqGh8nIcNdjSwZF3qA"
  },
  "FjLQREiFJYKm7PQ0ya6uOQ": {
    "date": "7/4/2017",
    "text": "Nothing great just average food. Service was very good. AC is not effective unless you are sitting right next to it. They have a desert cooler in the same hall, not sure how AC is suppose to work with water cooler in the same room( one is a humidifier and other dehumidifier:-)) Saw good reviews so decided to try but was a bit disappointed",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uv3xwMD2H8lV0jOWSq5kLA"
  },
  "TH8IdYYt18vGX2jb20bUrg": {
    "date": "5/12/2016",
    "text": "Upon searching Yelp for a good Indian restaurant in the area, the family and I stumbled upon this place! And boy, what a great find on a Thursday night! Amazingly flavorful, perfect amount of spice, and so much bang for your buck. I highly recommend this place to anyone craving solid northern Indian food in the area and beyond. Highlights included the mixed vegetable pakora, prawn masala, chicken tikka, and the heavenly crispy/buttery/light butter naan!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "-FBlM0Ob214xhPEJNFa0Dw"
  },
  "r5yWOecsDMFZFv2_37i1vg": {
    "date": "6/25/2015",
    "text": "Very good tandoori chicken that goes great with the Strong indian beer (Haywards 5000). This is how the food is cooked back in a tandoori restaurant in India. Very good mughlai pasanda (better than the usual butter chicken which is good in itself). Good Indian food like the one in India. Reasonable pricing too.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1tQfj737uhgdKcQ-5akTdA"
  },
  "urDCvdZ8j7FE0dLO6otmQQ": {
    "date": "4/30/2013",
    "text": "Yes, yes, yes, yes, YES. The spice, the flavours, the bustling outdoor seating, the naan (oh god the naan), it was like each and every dish they brought out was better than the last. The menu was a feast in itself - I knew it would be bad (read: really freaking good) when there were 7 types of naan to choose from, but it got to the point where we were all just pointing and shouting and gesticulating wildly. As for the dishes that I dug into? The chicken tikka masala was dark, rich and spicy and the kadahi prawn was easily the best prawn dish I've ever had, but the real stand out was the super decadent chicken mughlayee. It was one of those situations where we wanted everything we saw going out to tables around us, so I doubt you'll go wrong. We were a bit surprised with the relatively high prices and rather slow food service (waiters were attentive, but it just took a reeeeeally long time for our food to arrive) but the second the food came out, all was forgiven and forgotten. All I can remember now is the food korma I had for the next several hours.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Q1EbVCR52U4_LHpyWXTP3Q",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q1EbVCR52U4_LHpyWXTP3Q/o.jpg"
      },
      {
        "img_id": "xBPwNU5cPB-ie9vNhAb2kg",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xBPwNU5cPB-ie9vNhAb2kg/o.jpg"
      },
      {
        "img_id": "Q31h3wFi1HlSgdDKhpi7vA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q31h3wFi1HlSgdDKhpi7vA/o.jpg"
      }
    ],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "ROxmtPdKqb_jjHPnXO2N1g": {
    "date": "1/18/2013",
    "text": "This is a review of a dinner date at Khansama Tandoori.tinyurl.com/amlyu3sThis is actually my second visit to Khansama.  I thought I had previously reviewed it.  I uploaded the photos but I must have forgotten to write the review.I will focus my review on my most recent visit.Khansama offers street-side outdoor seating and indoor seating (upstairs).  The outdoor seating was mainly full.  The restaurant does use staff on the street working very diligently and trying to get customers to eat there.tinyurl.com/aj7amvgThe indoor seating area is quite beautiful.  It is an odd combination though.  The room is very ornate.  The table tops are some type of granite or faux-granite.  But the chairs (and the plates) are plastic.  The first seat I sat in basically gave way.  Luckily, I did not spill onto the floor.On this evening, the indoor seating area was mainly empty.  tinyurl.com/bat3zcxThe staff was friendly, professional, and efficient. They are very attentive and helpful.  The order is quickly taken.  The food comes out quite fast.  They did insure there was a little staging with the starters versus the appetizers.  But, like most Indian restaurants, this is a relatively fast paced meal.I thought the food was pretty good.  My dinner companion thought that it was a bit spicy.  This included some dishes that are not necessarily usually on the hot side.  I expect it from a chicken vindaloo but not necessarily from a prawn masala. I actually didn't find it that spicy though.The starters were all quite good.  I thought the vegetarian samosas, Noor-eh-Elahi, and vegetarian pakora were delicious and also offered nice crisp textures.  I was less fond of the paneer pakora.  But that is primarily a person taste issue.tinyurl.com/b6as2wqtinyurl.com/bepc73btinyurl.com/a9xcwkxFor mains to share, I selected chicken vindaloo and prawn masala.For mains to share, she selected palak paneer and palak chicken.  She thought she had ordered only one dish.  The ordering was pretty frenzied so I am not sure.I thought the food was very good.  Lol, I especially enjoyed my two selections.   The vindaloo was spicy.  The chicken was tender.  The potatoes were well prepared.  For the prawn masala, the shrimp was also tender and the dish came together quite well.  I only dabbled a bit with her spinach laden selections.Of course, we also had saffron rice and naan (plain and garlic).I thought the rice was spot on.  The naan was only average.  The garlic naan just didn't seem to have that super freshly cooked garlic flavour that really makes great garlic naan great.tinyurl.com/a85z75uReceipt ($114.00):You can't really beat getting that much food for $114.tinyurl.com/a85z75uWe had way too much food and unfortunately neither of us are doggy bag people.  So, we left a lot of food on the table.  That was a shame.  I thought it was some pretty good Indian food.Overall, I like the room.  The service was good.  I thought the quality of the food was consistently there.  I do not think my friend enjoyed it nearly as much.  For me, it was a solid 3.5 stars but I rounded up.(another note, my first experience was very much in-line with my second visit)",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iU5wyw3QSO-yb1y-heVf7w",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Vegetable Pakora (2nd visit) - Khansama Tandoori - Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iU5wyw3QSO-yb1y-heVf7w/o.jpg"
      },
      {
        "img_id": "ZSiA4nX2LLSxjKGLs0W2dA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Table - Khansama Tandoori - Singapore (Prawn Masala - Chicken Vindaloo - Palak Paneer - Palak Chicken - Saffron Rice...)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZSiA4nX2LLSxjKGLs0W2dA/o.jpg"
      },
      {
        "img_id": "-6Mek5Xm3wiWeaQ4XCso0w",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Samosa (2nd visit) - Khansama Tandoori - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-6Mek5Xm3wiWeaQ4XCso0w/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "KCLPPtOODbfaiLm0FoORnw": {
    "date": "10/21/2018",
    "text": "This place is in the heart of little India. Just a 5 minute walk off the MRT. Covered outdoor seating makes for a very comfortable experience. The food is fantastic and reasonably priced although I'd recommend a party of more than one. Lunch can be pricey if you want to try more than one dish.  Not complaining at all however, well worth the higher than usual lunch expense. I can't recommend this place more highly. If you find yourself in Singapore, and you like fantastic Indian cuisine, don't skip this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iS6V3OAZCWcpxv1TwVWqpA"
  },
  "4qf8TXvX4h9tMp9smrZiHQ": {
    "date": "4/27/2017",
    "text": "I'm a big fan of eating with my hands. Not that you have to they're have forks but when you order roti and stuff it with everything in your reach you really don't have a chance!This food is delectable! We passed by the first time in hope we would find something better maybe and no cigar. We walked right back. The place isn't much to look at they're under construction. The chairs are lawn chairs but who cares I'm here to chow. We had mutton kebab, chicken tandoori, mutton curry, vegetable rice and roti with a side of white sauce. JUST WOW. Spicy, delicious, savory. My mouth is watering I miss it so much. The staff is a little stand off ish but once you get their attention they're incredibly nice. Food is fast we ordered and ate in a half hour bc we had a tour to catch. I honestly will miss this place the most!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Ga8YMyvKPf_zN_tJUTPjug",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Roti wrap of everything",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ga8YMyvKPf_zN_tJUTPjug/o.jpg"
      },
      {
        "img_id": "UD5DBPvoaTwMoUR-BCdwkQ",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UD5DBPvoaTwMoUR-BCdwkQ/o.jpg"
      },
      {
        "img_id": "JARlsZHDyFIrpT8_F0E1LQ",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Probably! THEY ARE!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JARlsZHDyFIrpT8_F0E1LQ/o.jpg"
      }
    ],
    "user_id": "54OzgLaUiDjGa695caPLpg"
  },
  "0wXt5K8GZ-nEG9ocrcqMiw": {
    "date": "7/3/2017",
    "text": "You think it's a tourist trap, or maybe it is, but when the food is good I don't care.This place is one of the many Indian restaurants in Little India. It's not easy to stumble into the restaurants if you're not looking for it, albeit the corner location. However, the food was lip-smacking good. We ordered the grilled fish, the mushroom tandoori and the pakora starter and washed everything down with good old Tiger. Shortly said, I was happy with the food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L7cT7NW5ZjZfor-4BZFxTw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Tandoori mushroom & fish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L7cT7NW5ZjZfor-4BZFxTw/o.jpg"
      }
    ],
    "user_id": "R0Ko9rVnXc3M_23UzGkgjA"
  },
  "wlMbPFLw2LBipDe5PWfOCw": {
    "date": "6/2/2017",
    "text": "Location: This place is located in Little India, Singapore. When I came here around early/mid April, they were doing construction downstairs, so it wasn't a place I would considered just by looking outside. I came here through Yelp and since I was around the area, thought I'll give it a try. Environment/Service: I had to go upstairs, since downstairs was constructing (so I was told). If you know Singapore, it gets pretty damn hot. It was pretty hot upstairs and it was poorly ventilated. It's a horrible experience when you're sweating so much, yet trying to consume food. It was pretty busy due to the area being a tourist friendly area, but service was slow and waiters were not attentive. Their chairs are so heavy and huge, which makes it so difficult to even get up to use the bathroom. Food: I tried their chicken curry and their jumbo prawns. The chicken curry was okay, meat was too dry and wasn't really my type of curry (I had Indian food before and it was better). Their jumbo prawns did not look like prawns and rather more like regular shrimps. It was also on the pricier side for mediocre food. Their menu is like a book. A lot of choices, but definitely overwhelming. If I remembered correctly, it was about 30 pages or more!Overall, I give this place two stars. Two stars only because maybe other dishes on the menu could've tasted better, but I wouldn't know. Other than that, service was not great, it was too hot to even move, and our food wasn't that great either.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T-sdRzvwrdiZ9hQ_9KBEgA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T-sdRzvwrdiZ9hQ_9KBEgA/o.jpg"
      }
    ],
    "user_id": "S0zMs1AMbqai6By7yx6VEA"
  },
  "xo58-XGb8x4RyCXDbnbwOw": {
    "date": "5/19/2017",
    "text": "The restaurant claims that it's possibly the best Indian restaurant in Singapore. And this is very possibly true. I ordered the Curry Mutton, a low- to medium-spicy lamb dish full of flavor. The meat was tender and the combination of spices very authentic. I would avoid the fancier naans and opt for the plain naan instead. The garlic naan was a bit drier than I had hoped for.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q_bgVPT4308o55D7PVPNzQ",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q_bgVPT4308o55D7PVPNzQ/o.jpg"
      }
    ],
    "user_id": "B6kHo5Bfik1kAK7SFtYtCg"
  },
  "7ikW49uvQDgMO9lU781Iyw": {
    "date": "3/19/2018",
    "text": "Deep breath 'TOURIST TRAP, TOURIST TRAP!!!!!'True storyI ordered the koftas $12.50. Pretty pricey but hey this place is meant to be good right? Dish arrived and I thought ' erm here is the sauce, where are the koftas?' Dig around with my fork. Found koftas... - two, yes two. Looking at waiter...'erm there's only two koftas here?!' waiter 'erm that's how we do it, I'll see if I can get some more' Returns with one kofta and cuts it it two - I sh^* you not. Seriously people, do yourself a favour, walk around the back to around the House of Tan Tieng, grab a masala milk for $1.50, a plate of Chenna masala for $1.50 and enjoy the tranquility and food which is heaps better. Hey go crazy, if you spend $5 you will get an absolute feast, or feed the whole family.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_NhZXJWHiDcac_Yha6Og7Q"
  },
  "-W9qEWFEWKWV9gWTJ7s-dw": {
    "date": "10/5/2018",
    "text": "Easy to find and well worth the trip to Little India. Food is delicious. I had butter chicken, which was yummy and had the right amount of spice. Should've skipped the rice. The naan is fabulous!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqiwgaoEm3p9Io_-SA5q1Q"
  },
  "rCLHn7CR3K04StJe31Awzg": {
    "date": "8/20/2018",
    "text": "Every dish we got was excellent: vegetable pakora, agra chaat, garlic naan, fish tikka and aloo matter.  Service was quick and attentive.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dmq0nRDZBHzj0l9CBVnDsQ"
  },
  "g3znfMiDqW525XGSuZX1jw": {
    "date": "2/5/2018",
    "text": "Khansma delivers and it is oh so good, chicken tikka, samosas, lassis, tandoori Chicken, biryani rice all are so yummy.  Love being able to call up and have this delivered to my place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "lalHFnjO_kDtqVzrwIPYMw": {
    "date": "5/6/2017",
    "text": "Delicious food! The friendly waiter was patient with me while I stared at their enormous menu and decided on what to get.  I ordered the mutton kebab masala and chicken biryani.  Both were incredibly flavorful and the meat in both were tender.  Way better than most of the Indian restaurants I've had in the U.S.  My only regret is that I came along and I couldn't order as many dishes and I wanted.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "q9juvjkyxbFqv51lfNJlvA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Mutton kebab masala and chicken biryani=So damn good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q9juvjkyxbFqv51lfNJlvA/o.jpg"
      },
      {
        "img_id": "KQ_If9H5DK8Kg6wDNBV2vw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KQ_If9H5DK8Kg6wDNBV2vw/o.jpg"
      },
      {
        "img_id": "d9vlFZsd6agjU2scVGSNsA",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Menu as of May 2017",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d9vlFZsd6agjU2scVGSNsA/o.jpg"
      }
    ],
    "user_id": "Oavbr8dUe96Ap75kSwHhww"
  },
  "KRg8f9FSlNfTqj5S6OesCA": {
    "date": "1/19/2018",
    "text": "Food was EXCELLENT! Service was GREAT! and the restaurant was CLEAN. Recommend chicken tikka masala if you like real spicy and butter milk chocked if you like not so spicy and chicken curry no spicy...and for beers, kingfisher was AWSOME!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2uGIPGpyWRKC6GIRfo0AKw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Best Indian beer!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2uGIPGpyWRKC6GIRfo0AKw/o.jpg"
      },
      {
        "img_id": "nZPDVYHvsPAEpzsi1RftPw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Butter milk and took a masala chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nZPDVYHvsPAEpzsi1RftPw/o.jpg"
      }
    ],
    "user_id": "rzPt-y9BvoemFoPQrcWkJQ"
  },
  "c1REx3NHNG2LmZqhxY_vFQ": {
    "date": "4/14/2018",
    "text": "Awesome Flavors (flavours) central Little India!  Portion sizes are perfect for sharing.  Great drive menu.  Top notch service!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOY-ASHCuoKljX8EPN9Xyw"
  },
  "ahULKKB_SfDCgVGeMz3-6Q": {
    "date": "9/22/2017",
    "text": "Was expecting more since it was a 4 star spot. Got the chicken masala and chicken half kebab. There wasn't any chicken in the chicken masala. Like 2 pieces, and everything else was sauce and green pepper vegetables. Lots of seating and friendly staff.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cC26aeti505y8pO8jO53DQ",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. 2 pieces of chicken in the chicken masala. Hmmm (-_-)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cC26aeti505y8pO8jO53DQ/o.jpg"
      },
      {
        "img_id": "RhFKT77gSsGN5AF7NzrgEw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RhFKT77gSsGN5AF7NzrgEw/o.jpg"
      }
    ],
    "user_id": "DJpozfHfS2j5z6dB1GJ4hQ"
  },
  "MVnRQjoT4I0lHH88R1mxng": {
    "date": "4/30/2017",
    "text": "Been here twice, this would be a great place for you to explore Indian foods!Kind of like the ancient set up, especially the furniture used, very nostalgic (try to move their chairs too, I've ever joked with the waiter, I would need to eat more in order to pull/ shift the chairs...lol).Foods wise, I have ordered twice the:Butter Chicken, well marinated chicken piece, tandoor grilled with pleasant aroma, served in rich buttery gravy, one of the best Butter Chicken that I've eaten.Cheese Naan, gooey cheese hidden in warm and soft naan bread, with strong tandoori fragrant. Heavenly yummy when dipped with Butter Chicken gravy, opps, it should come in set!Try the Biryani, Vegetable Pakora (served with good mint dip) and Mushroom Masala. With wide selections of the menu, they will guide you through the authentic Indian taste!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dAVF1d4iEzSPG1W0wmxRHg",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dAVF1d4iEzSPG1W0wmxRHg/o.jpg"
      },
      {
        "img_id": "FH-2HROnz6GMUV95C405zg",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FH-2HROnz6GMUV95C405zg/o.jpg"
      },
      {
        "img_id": "wdHKvIliPOGOH5OEwYDWJw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wdHKvIliPOGOH5OEwYDWJw/o.jpg"
      }
    ],
    "user_id": "KPRclbGn7m3a-zXXIFbCBw"
  },
  "DCA7f4J5Znui0TFTTjbPNQ": {
    "date": "8/2/2018",
    "text": "A fantastic restaurant with wonderful spicy food. The service is fast, efficient and spot on. You will not regret taking the time to try this place out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2fGaWaKZ2e-tIqIDD51YQ"
  },
  "OvayQ08otS4csY3VmR69Qw": {
    "date": "4/1/2018",
    "text": "Excellent meal. A little bit more in price than others but safe and flavorsome! The staff were very helpful and the menu had sooo many delicious options.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G4ziGzDGniJBUxjAEVUu1A",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G4ziGzDGniJBUxjAEVUu1A/o.jpg"
      }
    ],
    "user_id": "IFresO-i-ro3y7QKfDaycQ"
  },
  "BsC7IojwY581JTFXxAJrUQ": {
    "date": "7/9/2017",
    "text": "We found this gem on Yelp. The food was AmaZing and the staff were very attentive and offered some great suggestions. I had the chicken tiki marsala and the agoo gomi (spelling???), a vegetable dish with potatoes, onions, cauliflower, tomatoes and curry. OH My Goodness!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7hdDN8Hh9GAA7DZW-UEGUg",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7hdDN8Hh9GAA7DZW-UEGUg/o.jpg"
      },
      {
        "img_id": "00UxRKrTZnYtyJg-aO5-2w",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. We loved this guy! Ankush had us laughing from the time that we entered. Thanks for making us feel like family.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/00UxRKrTZnYtyJg-aO5-2w/o.jpg"
      },
      {
        "img_id": "eeubEIVDyEZuu1Wm_S7xsg",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. We found this gem on Yelp. The food was AmaZing and the staff were very attentive and offered some great suggestions.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eeubEIVDyEZuu1Wm_S7xsg/o.jpg"
      }
    ],
    "user_id": "bqHJX6xfOPZc2T31w5cZ8Q"
  },
  "9x8jb5Lxmn1dirZUHI-WTg": {
    "date": "10/17/2015",
    "text": "Nicely decorated and air conditioned upstairs, table and chairs are very ornate and clean.The mixed chicken tikka is heavenly! I ordered it as a starter, ended up getting another order, together with mutton keema naan and sesame naan made a great tandoori meal.  Half a mutton seekh kebab has sealed the deal!Defiantly coming back.  This place is good.In the photo comments, I couldn't edit the iPhone \"autocorrecting\" mutton into mitten! :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TSN9V0cR191-NyNk6otmfw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Sesame naan.  iPhone is correcting \"mutton\" into mitten!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TSN9V0cR191-NyNk6otmfw/o.jpg"
      },
      {
        "img_id": "8HzA4xLfKC0g0CIpf-abPw",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Mitten keema naan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8HzA4xLfKC0g0CIpf-abPw/o.jpg"
      },
      {
        "img_id": "OTS_ZcYFRqftQLCQ89yE1A",
        "caption": "Photo of Khansama Tandoori - Singapore, Singapore. Mitten seekh kebab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OTS_ZcYFRqftQLCQ89yE1A/o.jpg"
      }
    ],
    "user_id": "EleQKGrUDo_-zvpfOVHYMQ"
  },
  "i5THViyo-AXj3-fOrd3srg": {
    "date": "11/21/2017",
    "text": "We went here for lunch on a Friday afternoon. It wasn't crowded. We were seated upstairs. They have two options - upstairs has ac and downstairs just fans. It was a hot and humid day in Singapore so we decided to sit upstairs. They have a lot of items in their menu. It will take you sometime to go through it to make a choice. We ordered starters and main course. Food was good, but it was pricey. Service was quick and the place was clean but nothing fancy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cC0K9xQ-5s92-8jSVmdKgw"
  },
  "VouWnye-4TCozCGs69fGNw": {
    "date": "6/29/2017",
    "text": "Food is okayishCurrently under renovation hence even air conditioning room is not so cool.Paneer bhajia and chilli bhajia were good.Butter chicken wasn't good.Service was quick.Nans were soft and yummy.Do compare price/quantity of beer before you order a mug/pitcher/bottle and buy the one that is value for money.Overall just an okayish place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NmhUf3QZwgnxbsTxWqjnhw"
  }
}