{
  "jSu7_VnYE4zfwRNgSr1K5Q": {
    "date": "1/22/2013",
    "text": "Tasty dim sum. Pretty standard offerings with ha gow and siu Mai.Get the pork bun pastry. That was a stand out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6tWC8li_ro7dxQtKdvSBw"
  },
  "wcwUaCykhcHxWv1MKeldKw": {
    "date": "9/7/2012",
    "text": "This concept restaurant of Paradise Holdings often gets outshone by the infamous rainbow xiao long baos of its counterpart, Paradise Dynasty, that lies steaming just four storefronts down. But If you are in the mood to shell out a little more for a fantastic chinese meal, this is just the place to be.Brought a visiting relative here for dinner and every dish was worthy of praise. The spare ribs in sweet sauce is the first dish that comes to mind - caramelised sauce hangs off succulent tender meat that you won't be able to get enough of. The tasty crackling skin of the peking duck wrapped in thin popiah sheets is also probably one of the best I've ever tasted in Singapore. Another must-try would be the perfectly baked cod that simply melts in your mouth. The interior of the restaurant is little too over-the-top for my liking but most will probably like it for the posh feel about it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FU5mC0OWVYL2vqP-9ZBT9g"
  },
  "-FQt3RQfY70pJrT4LQMiKA": {
    "date": "5/17/2014",
    "text": "Son't get me wrong, this place had some good dimsum, but the rent and tablecloths in this place are clearly not cheap, and the prices reflect that. I'm not sure it was so exemplary to be worth paying the type of prices they demand. For example, the wasabi shrimp were unique and interesting, but the shrimp themselves were not that flavorful.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NeopksW_Qs2GL57K1aifEQ"
  },
  "0uTrkesEOGqvDuuW3w0H_g": {
    "date": "4/27/2014",
    "text": "Situated in the ION mall, this restaurant, specializing in dim sum was excellent. Comfortable seating and modern design. We sat in one of the side rooms next to the window and were served tea to start(btw tea is not complimentary). The service I have to say was on point, very attentive and accommodating. One issue was they forgot to bring out a few bowls of corn soup that was ordered so we ended up canceling and the English proficiency wasn't great but overall we were pleased. Preparing the Peking duck rolls takes time. The star of course was the outstanding food. The dumplings - fois gras, pork and shrimp were excellent. The previously mentioned Peking duck was beautiful - the crisp, fatty skin rolls were scrumptious and the meatized with noodles was delicious. We loved the light, bouncy xo carrot cake - which by the way I still don't know why it's called carrot cake. The beef and scallion was juicy and creamy. I'd highly recommend Taste Paradise for your dim sum gorging pleasure.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zbaDu2-bRAuTm7bXKhY9sw",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. XO Carrot Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zbaDu2-bRAuTm7bXKhY9sw/o.jpg"
      },
      {
        "img_id": "SX5PBN06npq9vQWEprSaFA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Peking Duck: the skin is put into rolls with deft skill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SX5PBN06npq9vQWEprSaFA/o.jpg"
      },
      {
        "img_id": "njoVKxs_wJoNNANyqCxQkA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Peking Duck...don't worry, they carve it up",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/njoVKxs_wJoNNANyqCxQkA/o.jpg"
      }
    ],
    "user_id": "SIT2McFNaq6F9cyBH0ciIw"
  },
  "fYloYxN85KEYSs96KCGpBg": {
    "date": "7/12/2012",
    "text": "Taste Paradise is one of my favourite places for dim sum. They have a good variety of the traditional har gau siew mai stuff, but they also have some innovative new dim sum items that aren't available anywhere else. Food : M and I are fans of the salted egg yolk custard bun! Taste Paradise offers one of the best salted egg yolk buns in Singapore ... my only gripe is that they only offer the steamed version and not the deep fried mantou version at Man Fu Yuan. Their har gau (shrimp dumplings) and siew mai (pork dumplings) are very fresh and well executed. May, the manager of Taste Paradise informs us that they are made fresh every morning. I really liked the prawn mango roll which is encased in a lightly crumbed roll instead of beancurd skin. Mayonnaise is also thoughtfully included in the roll, so it all oozes out nicely in one moreish bite. The char siew sou (puffs) are really quite awesome, good meat to pastry ratio and the latter is light, buttery and flaky. The carrot cake with XO sauce is not bad but I prefer the one at Space @ My Humble House. The steamed beancurd skin with bacon rolls are pretty awesome as well but the wu kok (deep fried yam puffs) don't taste as good as they look. The double boiled soups are also excellent ... very tasty and great for a cold day. The dessert of aloe vera with ice jelly and wolf berries is extremely refreshing too.Ambience : I like how they have private rooms so one can request for them if one chooses not to be caught up in the hustle and bustle in the main dining hall. The layout is a bit labyrinth-like but nice modern Chinese decor with pictures of the different emperors from various dynasties in the private rooms. Service : Prompt, polite and overall perfect. May runs a tight ship and trains her staff well.Will be back for dinner soon!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "etxkyLXCSB9Vdd-vWXYtjg": {
    "date": "6/18/2018",
    "text": "It's official! Taste Paradise is my favorite dim sum place in the world. This is no exaggeration! Been to this Taste Paradise for many years. Never a time the food was bad or experience a service lapse. Today was no exception. Lunch = delicious + satisfying = Happy Me :)FOOD 5/5*I ordered the following (nah, I did not finish eating all, the staff packed whatever I could not finished for me to take away), *5/5 for every one of the dim sum dishes I ordered. 1) Classic XO Carrot Cake - A must order, nobody does carrot cake like Taste Paradise. I had tried similar elsewhere but there is no comparison. 2) Baked Honey BBQ Pork Pastry - This pastry was another item here that was the best compared to many other establishments which offered the same. The crust was buttery and flaky in a good way. I only despise flaky when it is associated to humans. The filling was generous with savory honey BBQ pork. 3) Char Siew Bun or Stream BBQ Pork Bun - The buns were so fluffy :9 The fillings which were honey BBQ pork were savory and so good.4) Steam Cheong-Fun with Honey BBQ Pork fillings - Rice flour rolls which were thin and soft. This is how it should be. It was light, healthy and tasted good.5) Deep-Fried Prawn Dumplings with Salad Cream- Generous and fresh prawn fillings in every of the dumplings. The dumplings' skins were so thin and crispy ;D  AMBIENCE 5/5No tacky décor but elegant beautiful surrounding. Comfy plushy chairs, nice table settings and lots of seatings. SERVICE 5/5Jorrine the hostess at the door had been working here for years. I recognized her. Always friendly and hospitable. She led me to one of the room inside. The server Shaun took very good care of me the moment I sat down. He was very pleasant, well-mannered and attentive. Taste Paradise has never let me down. This is THE best restaurant I would recommend anyone who visits Singapore when they want some top class dim sum/Chinese food accompanied with 5 star service and ambience. This is truly a well deserving 5 stars establishment in Singapore and ranked the top among all the 5 stars restaurants I rated.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "81d9npk1TuxbYgUD2wj6Ng",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Baked Honey BBQ Pork Pastry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/81d9npk1TuxbYgUD2wj6Ng/o.jpg"
      },
      {
        "img_id": "QluK1BsPJhT49gnm-yw4nQ",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Deep-fried Prawn Dumplings with Salad Cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QluK1BsPJhT49gnm-yw4nQ/o.jpg"
      },
      {
        "img_id": "35_JgJkLa7a5IVHpBRHPBg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Classic XO Carrot Cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/35_JgJkLa7a5IVHpBRHPBg/o.jpg"
      }
    ],
    "user_id": "0V_C2aOTDKuR8CO3P3RvJw"
  },
  "L-PF3sI0Gvzf5-G-n-Vx3g": {
    "date": "8/13/2018",
    "text": "Semi-upscale dim sum / Cantonese place in Ion. Overall good dim sum / Chinese dishes. Personal favorites are the carrot cake (stir-fried perfectly for the right balance of crispiness / chewiness with complementary tangy sauce). The pork ribs were also very tender and the char siew pao is definitely one of the better ones I have had at Cantonese restaurants in SG. The standard items like siew mai, etc. were standard good / what you would expect from this type of Chinese restaurantNice ambience and convenient location - good for family gatherings. A bit expensive and should make reservation",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bPMnBu2kTnZRSoFiuhr3Vw",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Pork ribs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bPMnBu2kTnZRSoFiuhr3Vw/o.jpg"
      },
      {
        "img_id": "i3GdaL9Mve2Be_UmQtK5Sg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Dimsum",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i3GdaL9Mve2Be_UmQtK5Sg/o.jpg"
      },
      {
        "img_id": "2LoBrxX-TabZhiCFNMjRJg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Dimsum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2LoBrxX-TabZhiCFNMjRJg/o.jpg"
      }
    ],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "UpzE_x6pdJEWGELkkHYSog": {
    "date": "12/31/2017",
    "text": "Made a reservation for dinner a couple weeks ahead via phone and was promptly welcomed upon arrival. Eating Cantonese food in Singapore by a Singaporean chain was questionable at first. The experience was world class.Meal started off with pickled vegetables which were tasty and flavorful. Opted for the Peking Duck, Wasabi Prawns, and Foie Gras appetizer which was just heavenly! Peking duck was perfectly crispy and the wasabi Prawns was flavored to perfection. The foie gras was decent. Entrees included the salted egg prawns which consisted of a dozen or so juicy and flavorful prawns lightly fried and then dipped in salted egg yolk. Yum!The US beef with Gai Lan was also excellent. ...it was rather odd having US beef in Singapore. ...trust me on this one!Next came the Kurobata Pork with mushrooms which was also heavenly! Super tender pork in a world class gravy. Ended off the meal with Lobster with XO sauce noodles and their famous mango pomelo sago. Lobster was delicious and their XO sauce was on point. Service throughout the meal was decent. Seems like we were serviced by a new hire... $110 SGD/head after tax and service for dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 19,
      "funny": 13,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "yhV1SvnOAC9clkN35Jd3vg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Mango Puree Sago Pomelo - SGD $6.8",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yhV1SvnOAC9clkN35Jd3vg/o.jpg"
      },
      {
        "img_id": "-YY-gXiZ9FGsLnKB8z2Ojg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Ramen Lobster XO Sauce - SGD $28",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-YY-gXiZ9FGsLnKB8z2Ojg/o.jpg"
      },
      {
        "img_id": "qVChtPx8uFvEE_B-ZPfUsg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. US Beef Kai Lan - SGD $26",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qVChtPx8uFvEE_B-ZPfUsg/o.jpg"
      }
    ],
    "user_id": "ZpUI9ze0YlA6nMSHwx3ZYQ"
  },
  "MI4AIQ2cndhEO8ihwjAr4w": {
    "date": "2/11/2018",
    "text": "We visited the restaurant, which is located at the Ion building, for dinner. If I would have to classify it, this is a fine dining Chinese restaurant. Extensive, but well appointed decor throughout, clearly stating that you are at a classy restaurant. Very comfortable sitting, nice tablecloth - all sets you in a mood. To prove that this is a fine dining restaurant, it offers a great wine selection, which includes practically all first growth Bordeaux (Lafite, Latour, Mouton Rothschild, ...), as well as Petrus, Massetto, DRC and if I was not mistaken, even a cult California Screaming Eagle. We had 2011 Rauzan-Sègla with our dinner, and the wine was outstanding after 20 minutes in the glass. Excellent service, starting with wine and food pairing recommendations. Considering our choice of wine, we got recommendations to go with crispy duck instead of Peking duck, as crispy duck is less sweet - and the recommendation was spot on, excellent pairing - also the duck was cooked perfectly. We also had tofu and green beans, each dish is excellent on its own. One of my dining companions was raving about his cod with spinach sauce. We also had the dessert - fresh mango purée with an ice cream, which is also beautifully presented on top of cold steaming bowl - another high point of the dinner experience.Once again, excellent service - prompt, attentive, helpful and friendly. Definitely recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eLl1wezrbCEP-wWyDyJLJA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eLl1wezrbCEP-wWyDyJLJA/o.jpg"
      },
      {
        "img_id": "th2jKuF3gKWV_ak5-E80qg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/th2jKuF3gKWV_ak5-E80qg/o.jpg"
      },
      {
        "img_id": "pfEZkaJ4CcW2_nyGwXyyqw",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pfEZkaJ4CcW2_nyGwXyyqw/o.jpg"
      }
    ],
    "user_id": "yBbhNiEwzSf8T8xWvfTLhA"
  },
  "M2Vd4gZN9KinvIDtVySUwA": {
    "date": "11/27/2016",
    "text": "Hands down this is the best dim sum restaurant I have been to anywhere in the world including Hong Kong which had seen a drop in the quality and service quality the last time I was there.  The hargow and siewmai is excellent as well as the lobster noodle.  Their soup is also great with excellent flavor!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "NNXEgNby-EJXH_fFA3d5CQ",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NNXEgNby-EJXH_fFA3d5CQ/o.jpg"
      },
      {
        "img_id": "fUCBX_BnbjWHk-1ierQ3Tw",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fUCBX_BnbjWHk-1ierQ3Tw/o.jpg"
      },
      {
        "img_id": "IBvjr4u-cPb2Ui_8_IELRQ",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Spring chicken fried",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IBvjr4u-cPb2Ui_8_IELRQ/o.jpg"
      }
    ],
    "user_id": "9Vmqj86WQ6WTU8SdSkfBCA"
  },
  "s_li0N-Nw2W0ezPGF1Y1zw": {
    "date": "10/4/2015",
    "text": "We had lunch from the dim sum menu - as other reviewers had pointed out, the dim sum is all round very well-prepared. We had plenty of items, and the hits included carrot cake, sheng jian bao (soupy pork buns), har gow (prawn dumpling), shumai (pork dumplings).However one star off for slow service. Repeated badgering was required, and we had to wait unduly long to be brought our menus, to have our orders taken, and to get our iced water refilled.We paid S$131.82 for 4 adults and 1 child.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "i0x6MWNiFLQ2cV3aIVjO5g"
  },
  "Bh0Waw1brdHRAEFWe1w0FQ": {
    "date": "10/5/2016",
    "text": "This is one of my favorite dimsum spots in Singapore. It's in orchard where all the action is. The decor is amazing inside. Tea kettle is quite peculiar. Food is amazing, from the egg tarts to the pork ribs. A must is a Liu sha bao or the egg custard bun. Careful though as it is very hot.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "so2UHOAeDr30D9RA8nbCVw",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/so2UHOAeDr30D9RA8nbCVw/o.jpg"
      },
      {
        "img_id": "aM3dOzduD635NC4lQcCQDg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Har gao",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aM3dOzduD635NC4lQcCQDg/o.jpg"
      },
      {
        "img_id": "u4uJtbt00Ig8BTijhfGJEQ",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Tea kettle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u4uJtbt00Ig8BTijhfGJEQ/o.jpg"
      }
    ],
    "user_id": "Qb2JVUzeSmVKBlC1qJENug"
  },
  "zOn5pBompBrQE0IXmqL6ng": {
    "date": "12/21/2013",
    "text": "Weekend dimsum brunch here is usually pretty crowded and require a reservation. The dimsum here is delicious. The hargao has two shrimps in it, and the XO carrot cake is savory and flavorful.The xiao long bao doesnt break easily and has lots of soup in it, while the liu sha bao oozes when you bite into it. The egg tart is also best eaten when served warm.The bbq pork is rather pricey, but one of the best I've had.Definitely highly recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "g3pUQ5tCIaWJEN6EGpeTAg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g3pUQ5tCIaWJEN6EGpeTAg/o.jpg"
      }
    ],
    "user_id": "bqJNDwrpF-vULjAVAh_LyQ"
  },
  "qwjqjoeIMXGT1bSp7nEzKw": {
    "date": "2/28/2016",
    "text": "I don't give out 5-stars lightly. Best dimsum in Singapore. Forget the TERRIBLE Tim Ho Wan (seriously???), or the cramped and overrated Victor's Kitchen (WTF???). This place has dimsum to match HKG, has great service, and is reasonably priced. XO sauce carrot cake is a \"die die must try\", and all other usual dimsum fare are of great quality. Har Kow and Siu Mai are large and full of flavour. I'm also slightly addicted to the little pickles they give for appetiser...Just make sure YOU MAKE A BOOKING on the weekends. Forget trying to walk in.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "hmLRzeycyvYyWbP-MmOfXQ": {
    "date": "2/4/2015",
    "text": "Move aside crystal jade! Taste paradise is the next big thing for Chinese food in Singapore... Why I keep coming back despite having to reserve every time I wanna eat here:1. Conveniently located above Orchard MRT which is in highest floor of Ion mall.2. Not overpriced or overrated.3. Polite servers.4. Have dim sums every sundayMy 3 most fave dishes:1. Blueberry foie gras2. Braised vermicelli (their bestseller in Carb dept)3. Hot almond paste soup for dessertLove this place a lot",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yvo6zvWToWS954Ys20vcpg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Really good blueberry sauced foie gras! Price is decent too!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yvo6zvWToWS954Ys20vcpg/o.jpg"
      },
      {
        "img_id": "WOtryvgYTfeDZJU2mt3upA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Nice roasted chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WOtryvgYTfeDZJU2mt3upA/o.jpg"
      }
    ],
    "user_id": "xhBeTgxlGon8gd_gTop-Lw"
  },
  "Q9ha4M8O7XHoVNeUjFvgUw": {
    "date": "10/9/2014",
    "text": "Is this what paradise tastes like? Because I can definitely get used to this.First, let's start with their impeccable service. The servers here are polite, friendly and actively try to engage in conversation. They see you as an actual person rather than just another customer, constantly checking in to make sure everything is up to standards.Their interior is very similar to hotel restaurants you find in mainland China, with revolving round tables and private VIP rooms. Their food might come out a bit slow, but it's worth it given the fantastic quality. The shark fin soup is best I've had anywhere. Clear, crisp broth with subdued flavoring that enhances the shark fin rather than overpowering it (which is something I've experienced on numerous occasion in the past). The spring roll that comes with it also adds another element in the texture department, with the flaky, crispy shell playing foil to the soft fins. Their garlic fried and boiled lobster was also delicious, offering two interesting takes on the classic lobster dish. The fried pieces weren't overly greasy, and had enough meat to counterbalance the shell. The boiled meats, however, were the real creme de la creme. Served in a butter garlic sauce, each tender piece of meat melted the moment it entered your mouth, delivering an explosion of flavor. Among the other dishes, I thought their Peking duck was cooked perfectly, though the sauce was a bit too sweet for my liking. Their braised pork cubes and steak bits were also pretty good, though a bit on the fatty side. In terms of drinks, there was nothing too standout, so I'd recommend just sticking to Tiger. All in all, a fantastic dining experience at one of my favorite places in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Lv2sMLQjtMWjWDZYYkL_HQ",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Garlic fried and boiled lobster",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Lv2sMLQjtMWjWDZYYkL_HQ/o.jpg"
      },
      {
        "img_id": "mb6FtlDToBoDhEQifsV4yw",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Peking duck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mb6FtlDToBoDhEQifsV4yw/o.jpg"
      },
      {
        "img_id": "u_9tz8Y5ftpHUnO5-N4hHA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore. Shark fin soup!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u_9tz8Y5ftpHUnO5-N4hHA/o.jpg"
      }
    ],
    "user_id": "Gr17h3JDn7wWQo40kJKaGQ"
  },
  "OpTTwjmejyyJP3Kz1qua2Q": {
    "date": "10/25/2012",
    "text": "My friend strongly recommended me the place for dim sum. I have been meaning to bring my parents here for weekend's dim sum galore, alas, they are always fully booked! On a lazy Sat afternoon, I managed to get a table for after 2 pm. They still serve dim sum at that time. Yay!We ordered the usual char siew so, which is extremely delicate and crispy! It is a must order dish here. Next, came the XO carrot cake, which I heard so much about. It tastes good and the carrot cake is chunky. I think another place which may be better than here or on par is at Chinatown's Spring Court. I honestly, couldn't be bothered with taking photos subsequently cuz the food was just too delicieus to ignore. We had the braised foie gras in blueberry reduction! It is super yummy!!! I would say it is basically foie gras terrine with blueberry jam! Crackling pork belly could be one of the best served in Singapore. I could have a whole plate to myself. Again, I think that goes for every single dish that we ordered. Will come back for moreeeeeeee",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "KPA3VRm-3O5RC5Nvib3GGA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KPA3VRm-3O5RC5Nvib3GGA/o.jpg"
      },
      {
        "img_id": "5Z8w65a9QEFe-QPfYqQYXg",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5Z8w65a9QEFe-QPfYqQYXg/o.jpg"
      }
    ],
    "user_id": "ZoYVSk3hhn1NRYM2RbERGg"
  },
  "_rdsok9QRPze-ptQ-WQZ0Q": {
    "date": "1/6/2017",
    "text": "Have been coming here for the last 4-5 years, and their egg custard bun is still (in my opinion) consistently the best.Great location, great ambience, the rest of their dim sum is great as well. Crackling pork belly is heavenly.Unfortunately everything comes at a price... in this case quite literally, the pork belly costs something like $13 for a tiny portion. The rest of their dishes are also pricey - worth it, but you probably can't afford to come here too often.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQ6MAHSW4jTAzGRUvio1yA"
  },
  "4ED10c3KGEhqJ1WITvzZKA": {
    "date": "8/26/2016",
    "text": "Coming from the US, I've never had an amazing dim sum experience such as this one. The place is very classy and the attentiveness of the staff is on par with restaurants that cost 10x as much over in the states.The price is a little on the heavy side compared to the local street food, but you certainly get what you pay for (and comparatively from the US it's the same as regular [crappier] dim sum establishments).If you're looking for some of the best brunch experiences in Singapore, Taste Paradise is certainly one of them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnHlvut7ucPNka9O_tM94A"
  },
  "mu0gvP5j-mL5ZSGdabZlBg": {
    "date": "8/4/2016",
    "text": "My family & I are their loyal customers & we have been following them since their 1st cze char & seafood place in Defu Lane Industrial Eastate.We love their signature dish, stone pot shark's fin soup, super much. They use superior stock for their broth & they are generous with their ingredients. Their ingredients are fresh & not inferior at all.Their Peking duck, set dinner, reunion set dinner (always overwhelming response & my family has to make very early reservation) & their dim sum are also our family's favourite. Yummy........Worth trying :):):)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "90tv-lK4wM_q1OahO-XcwQ"
  },
  "Wql8AhdpAJX8VC_G1kInlQ": {
    "date": "9/11/2014",
    "text": "I've been here a few times and keep coming back. Convenient location inside Ion, reliable dim sum and elegant surroundings make me a repeat customer. Yes it's a bit pricier than other places, but I like the fact that there's quality food, proper tablecloths, porcelain china and pretty teapots. Dim sum lunch was $40 and we left with happy and satisfied bellies. For the same price, I was at Marmalade Pantry at the Stables where I paid for 1 subpar dish and 1 latte (helped me decide to not go to MP again :)Ask for a table in the back section...the drapes are drawn allowing the sunshine in. I sat in the front section of the restaurant this time and it was kinda dark. Must: XO carrot cake (exquisitely made here), shrimp dumplings Avoid: BBQ pork belly. It was something like $18 for the tiniest portion I've ever seen.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "UEOgOAFIlH2vpGKNlGsDcA"
  },
  "Ooa-NjpPoJK8ha1Dp2Zp8A": {
    "date": "5/18/2015",
    "text": "You'll need to reserve a table on the weekends at Taste Paradise. They do at least two seatings at lunch.The Carrot Cake is excellent. A re-interpretation of a hawker favourite. And well interpreted, I think. The addition of succulent bean sprouts is so welcome.The roast pork (siew yoke) was recommended to us. It comes in a slab that has been cut down to look like it came out of a factory. It was okay, but for me, nothing remarkable in the way it was done.The roast duck was good, if you like a roast duck that is trying to be a chicken. ie a little too juicy. I prefer duck that is like duck - allowed to be a little drier. But that's just a personal thing. It is very high quality, with crisp skin.Between two roasts, take the duck.There's some mango dim sum thing, fried and with too much mayo. To me, unless you are a huge mayo fan, it was cloying and just too mayo-ey. Why did Singapore ever think mayo and mango is a good combination? Or mayo and prawn? Ugh!There's also a laksa bean curd dim sum dish. It was all right.Chee Cheong Fun also okay.I like that there's an attempt at incorporating local dishes/flavours rather than just offering standard Cantonese dim sum.It's a pity that during the day time the curtains are drawn and you can't see outside. So it feels like it's night time at Ion. And some of the placement of tables is quite awkward.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-B07E1F0tZ3HvgVdwJTj_A"
  },
  "RhAcxvA49zIWA9Pn8sANZQ": {
    "date": "7/14/2012",
    "text": "One of the better ones in the league of siew yok (roast pork) in Singapore. I've returned time and again for it alone. Crispy and crunchy skin with tender flesh and a sliver of fat, not too much, just enough to be justifiable for those counting calories.Whilst most rave about dim sum here (best dish in my humble opnion is mango prawn, not quite the traditional favourite, but the best one for me), I thought their usual fare was more impressive. Winter melon soup was served steaming hot in a hollowed out winter melon, a little corny but may be the reason it tasted better than others. Cod was very well cooked and it made my day that my mango sago came with a trailing smokey stream of dry ice; for only $4.50, I was getting all the fireworks.The restaurant is lavishly decorated, typical of chinese opulence but with just a touch of modernity. It may annoy you that the wait staff continuously stress that you can only stay for 45min/1hr/1.5hr before you have to vacate your table, but service is prompt and attentive, and the quality of food easily makes up for everything else.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pd8224JfuOyH2LGJ5zWyoA",
        "caption": "Photo of Taste Paradise - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pd8224JfuOyH2LGJ5zWyoA/o.jpg"
      }
    ],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "aCgCvScbKcETu5MUkpv2gQ": {
    "date": "6/19/2013",
    "text": "I am from Hong Kong, and let me say that Taste Paradise probably makes the most exquisite dim sum in Asia outside of Hong Kong. Their egg tart melts in your mouth, salted egg yolk buns has so many layers of flavor I thought I was in paradise. Must order dishes also includes the Xo carrot cake, peking duck and the foie gras xiao long bao, which are much much better than those from their sister chain paradise dynastty: you can actually taste real foie gras in them! The restaurant is a bit on the pricey side, but really I think it's well worth the money!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "60S1f9efCHbSp4AxJJnsrA"
  },
  "nMdKM_JsCvfmOxx0tHomwA": {
    "date": "8/12/2012",
    "text": "Currently my favourite restaurant for Chinese food and dim sum, the dishes at Taste paradise are more exquisitely crafted and refined compared to Crystal Jade, Imperial Treasure and Tung Lok. Must try dishes is their signature superior shark's fin in supreme broth accompanied with crispy spring roll that's served in a Japanese stone pot. If you are a supporter of the no shark fin campaign, the other dishes you must order is the XO carrot cake, peking duck, char siew and custard buns. A great place to host clients and overseas guests, as well as weekend dim sums. My family has been holding our reunion dinners there since 2010 and it continues to exceed our expectations every year without fail so far.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  }
}