{
  "LhdvTNFt4pmm-_GdLWkhsA": {
    "date": "5/23/2016",
    "text": "Ma Ma Mia!Tonkatsu by Ma Maison has been one our favourite, if not favourite restaurant for Tonkatsu. Naturally, the star of a Tonkatsu restaurant should be.... Well the Tonkatsu but as important and glorious as that piece of beautifully fried pork should be, I personally feel that the side dishes that comes with it plays a very big part too. There's no use having a great piece of protein, only for it to be ruined by a lousy bowl of rice or a soggy salad. Thankfully, that's the part Tonkatsu by Ma Maison gets perfectly right.There are a few option of meat to chose from here but after trying a few, I would highly recommend getting the Rosu (Pork Loin).Jumbo Rosu Katsu Set ($29.80)This is for the ultimate meat eater. 250g on perfectly fried, juicy pork loin served with rice, soup and free flow salad. First, the loin. A perfect balance of fat, ensuring that every night is a good one. Mix it the perfect crispiness of the breading and the Rosu Katsu in the fantastic Tonkatsu. It's seasoned beautifully, perfectly fried and juicy with every bite. Perfect! The salad that comes with it is perfect as well. It may only be cabbage, but the freshness, crispness and sweetness of the cabbage helps cut down the oil in the Tonkatsu, making it easier to finish. The soup that comes with it is perfect as well. These aren't simple bowls of pre-mixed miso soup as well. Made with carrots, Radish (daikon) and pieces of pork, these little bowl of soups are stars of their own, helping ensure the sweetness of the cabbage and its sesame sauce, doesn't over power the pork loin, allowing its umami-ness to shine through. To ensure that we don't over eat or overload ourselves, we tend to order a Jumbo Ruso set with an additional rice set ($4.00) to share, which is more than enough for us. Overall, we really love the restaurant and really can't find any fault with it. Simply love the Tonkatsu here and still our go to place whenever we have the craving for it!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ro8Nuoyz9LoHBT4vDgfqmQ",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ro8Nuoyz9LoHBT4vDgfqmQ/o.jpg"
      },
      {
        "img_id": "RSzn4PqsViU3Fijgh-JPpg",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RSzn4PqsViU3Fijgh-JPpg/o.jpg"
      },
      {
        "img_id": "IEtQijrFut02Xb9AVdDabg",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IEtQijrFut02Xb9AVdDabg/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "DHx44TRNvUcYeri2-jKdAg": {
    "date": "11/17/2017",
    "text": "For a weekday night, the place packed fairly quickly. The menu consisted of deep fried meat and seafood. Most of items in the menu was in set, which served with rice (choice of white or jyukkokumai (multi grain rice)), tonjiru soup ( miso soup with pork), cabbage and pickles and all were refillable. Each meal was accompanied with roasted barley tea, started with a small dish of grated radish and ended the meal with a bowl of plain looking jelly.There was goma (sesame) dressing and soyu on the table to add to the shredded cabbage. For the deep fried items, there was sweet and spicy Tonkatsu sauces to dip with. Want add kick, add some freshly grated sesame seeds.Mille Feuille Truffle Katsu (S$33.80++)Truffle chips, Top quality truffle salt, Special truffle pasteOne could smell the truffle when it was served. As the meat were thinly sliced and layered on top of each other, the patty was tender and soft.Cheese Mille-feuille KATSU Set ($26.80++)Deep-fried Multi Layered Sliced Pork Cutlet with CheeseSimilar to the truffle version, the meat was tender and soft. The melted cheese really stretched and very long too.IBERICO PORK Rosu (Pork Loin) Set ($34.80++)The most disappointing dish out of the 4 ordered items. The meat was quite tough and dry. One could not if there was any different from the usual pork loin. A waste of money for this dish.Katsu Don ($21.80++)Deep fried pork loin topped with egg and special soy sauce Although it was the cheapest among the 4 dishes which we ordered, it tasted not bad.As the place was packed, one had to wait for the bill. There was some error with the bill but it was swiftly corrected.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gud_BlSNUyJrLIw3iZuDZw",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gud_BlSNUyJrLIw3iZuDZw/o.jpg"
      },
      {
        "img_id": "ISs72UwdW4tFhzq0yNwFFQ",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ISs72UwdW4tFhzq0yNwFFQ/o.jpg"
      },
      {
        "img_id": "H6NfYtnv2TCzVdR5XCTXYQ",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H6NfYtnv2TCzVdR5XCTXYQ/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "1dY0Sgta1Zi4UNGnKHFsSQ": {
    "date": "5/1/2017",
    "text": "Regretted ordering the oyakodon with pork katsu the moment it arrived. Covered by both egg and sauce, the crisp outer layer quickly became disappointingly soggy. The meat within was nothing special either and wasn't as tender as expected. The dry one that came with rice on the side fared much better. The crispy katsu tasted pleasantly mild, without the all-too-familiar stench of reused oil. However, it's definitely not worth the price at ~$25-35 per set. Service was impeccable. The waiter checked in on us regularly, ensuring that we had no shortage of rice and cabbage. Also, I quite like the DIY aspect of it all where sauce is poured at our discretion onto the little platter with demarcated wells.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "okbMpg1Zp_yEMMV_K-AUgQ",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. Where's the meat? Ooo there it is!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/okbMpg1Zp_yEMMV_K-AUgQ/o.jpg"
      }
    ],
    "user_id": "JXrx-kwCSuf1xCkwuv0Nfw"
  },
  "B5ZwgIVTOGG0Dfu4Rg0nIw": {
    "date": "3/11/2017",
    "text": "One of the most expensive pieces of fried meat I've eaten. Can't say I'd eat here often or even come back again, but I felt pretty satisfied after polishing off my set meal. The restaurant was half empty(full) when we walked in around at almost 9pm on a Friday evening. They had a \"MisoKatsu Fair\" special at the time: sizzling negi miso rosu katsu set (pork loin with negi miso sauce and egg) for ~S$24++. Pork fillet went for a dollar more. FYI pork fillet is also known as tenderloin and is the leanest of all cuts, so it's a healthier choice. My friend got the pork fillet, and it was less flavorful in my opinion. The chefs cook the meat in a open kitchen right in front of the bar, so you can see the marbling of the meat before they fry it up. To be honest, I expected the pork to be cooked with a bit more skill or technique. Although the meat was very high quality, the end result was just like another fried piece of meat. The sizzling platter was a nice touch as it kept the food warm, but it wasn't a testament to the cooking. The side dishes were nice, but nothing spectacular or unique.After adding on a chocolate cake dessert (just for good measure), the damage came up to about S$35. Glad I tried it, but not willing to pay this much again for some fried pork cutlet.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyqnCAQsARyayfkl0dSNKg"
  },
  "KBZkhxCkbFr6oQ0FzIAsmw": {
    "date": "5/13/2015",
    "text": "Tried this place for the second time, when I come to Singapore for business trips I normally stop nearby so it's within walking distance. The place is nice, good sevice and quite similar to a Tonkatsu-ya in Japan, food is not exactly cheap.I loved the miso, tsukemono, brown rice choice and all the sauces. Shame for the main thing, which is the tonkatsu, it wasn't all that great, quite dry despite me ordering the Kurobuta Hire which is meant to be the best pork that they have on offer.ALl in all I have had better, but it's a decent option if you are in the area and really want to eat Tonkatsu.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BzxHtbMbEr3SEQ75uTXvQA",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. The kitchen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BzxHtbMbEr3SEQ75uTXvQA/o.jpg"
      }
    ],
    "user_id": "6G3tlx3-W5IH1lmaPXBSoQ"
  },
  "Rv7afYVpRjgnKLr5FzQTrQ": {
    "date": "6/25/2017",
    "text": "This has always been one of my staple Tonkatsu restaurants despite its higher than average price tag. The quality is decent for the katsu itself but recently when I returned its tonjiru that's always served in the teishoku was weak and flavorless. The tea jelly dessert too was pretty awful. I'd return just for the katsu and the delicious rice!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCZpMsB_EXkMyn_OvQbdEA"
  },
  "qIieqniUqerBpwjGCizZpQ": {
    "date": "10/12/2015",
    "text": "2 stars - this place isn't the best for tonkatsu, but if you're at the mandarin gallery and are craving it, then don't hesitate. They give you a scoop of rice, japanese cabbage salad both with unlimited serving and a small bowl of miso soup. I get that they serve many types of pork but the quality just isn't there. I have had much better tonkatsu elsewhere. I was really disappointed with my dish. Since you can't go wrong with rice and cabbage, my grief is with the other items on the plate. I had the mangalica rosu katsu and guess what, the meat was stale, not crispy, not tasty, and jerky. Other people who think this place has the best tonkatsu either they haven't had real good ones or I was just unlucky to be facing a gruesome experience here. It's really a nightmare for me. The cashier was nice though. On the side note, you may want to put the sauce on the side, because your tonkatsu might get soggy by the end.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xhBeTgxlGon8gd_gTop-Lw"
  },
  "ID0tIB-8pQmeLP3aog_a7w": {
    "date": "11/23/2015",
    "text": "Good food, great service. Totally worth a visit.We were here for lunch and try out the set meal.The portion is a lot but tasty, the taste get better with the sauce added.Thoroughly enjoy the meal",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "MTGDLSnARJr4hoH1IXcG9w"
  },
  "ycT-GYj3qKMHUAFkkgT_6g": {
    "date": "1/17/2013",
    "text": "This tonkatsu is to die for!!! I loved it. Well, I also haven't been to Tonkichi in a really long time and that used to be my go-to place for gd tonkatsu, but my bro said this place won over Tonkichi when he went on a tonkatsu hunt with his gf. Anyway, I don't like very fatty cuts of meat, so I went for hire-katsu and it was deliciously juicy! As other reviewers have mentioned, the tonkatsu tasted really light and not soaked in oil as is typical of not-so-good places. It was amazing and made me very happy. I got the 120g portion, which actually didn't look like very much but was pretty filling. $22.80++The tonjiru soup, pickles, and cabbage are all free flow. Soup was delicious! And had a ton of ingredients.. Very comforting and brothy and hearty. Cabbage dressing was also very good, went well with cabbage. OH, big plus for being able to get brown rice! I LOVE brown rice. and at no extra charge. Makes me even happier :)Only thing is that I like Tonkichi's actual sesame seed grinder (sort of like mortar and pestle) as opposed to Ma Maison's plastic container thing that effectively does the same thing. Oh! But Ma Maison had both spicy and sweet tonkatsu sauce, never had the spicy one before. Pretty interesting. Liked both of them!Orange jelly that came after the meal was really strange and artificial tasting though, skip that.. Service was okay, took a while to get anyone's attention, I suppose things were getting busy on a Thursday night. It took a while for them to give us warm water and I had to keep asking for more though.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AUsVj46MugSRbXJA2GeVdA",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. Weird orange jelly that came after meal, skip it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AUsVj46MugSRbXJA2GeVdA/o.jpg"
      },
      {
        "img_id": "v0ThQrYitEaid5ZlIvNPVw",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. Delicious hire-katsu!!! 120g, $22.80++",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v0ThQrYitEaid5ZlIvNPVw/o.jpg"
      }
    ],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "sR-VQ60ai6zGw7opxAB4hw": {
    "date": "10/21/2015",
    "text": "A long time ago, I had a really good dinner here with a friend and remembered it for a year and a half whilst away from Singapore. When my craving for katsudon hit me last week, I made the rare special trip to orchard on a weekday to have some katsudon and was sorely disappointed. I'll cut to the chase. The service was appalling. I understand being rushed and busy. I was perfectly happy to wait. However, I do not appreciate being shooed out of the restaurant and made to feel like it was my fault while the manager, I think, scolded the waitress for almost sitting us before another couple that we (and apparently the waitress) hadn't realised was waiting. Embarrassed, we walked out and endured the glares from that couple although all we had done was said 'table for two?' When we were seated, the appetiser came in a very rushed rambling of the description as though he didn't have time for us or this at all. We then proceeded to wait eons for the food until, after realising we kept looking over, the manager finally came over and said 'There's some quality issues with the white rice. We are cooking a new batch now. I think you should change to the brown rice.' When told that 'no, we would prefer to wait for the white rice, thanks', he kept trying to convince us to change our minds before, defeated, he went to the kitchen to check how long it would take. Incredibly, two seconds later, we were told that they weren't sure the second batch wouldn't have the same quality issue (in the white rice? Really?) and we should take the brown rice. 'Should' was being used in a 'you should take it or you have no rice' sort of way. At this, we had no choice but to agree to the brown rice. At this point, I'd like to say that I have nothing against brown rice, but my partner really did not want brown rice and was willing to wait for the white rice anyway.The katsudon did arrive with very little rice drowned in the sauce. It definitely wasn't a good katsudon sauce either and the lack of rice made for a too salty too sweet katsudon. Perhaps they were running out of brown rice, seeing as there isn't any white rice apparently. There wasn't an apology though he did appear at the end of the meal and asked 'did you like the food'. We just smiled, as we didn't want to deal with him anymore, but it was an awfully disappointing experience. In fact, I was still thinking about that satisfying katsudon I never had the next day, and went to Ginza bairin for dinner promptly. I wouldn't recommend people not to go for the tonkatsu, but just a word of caution about the service. Also, I've heard the service at the Bugis branch is much better anyway. For that price and quality though, I'd just go for the cheaper Ginza Bairin's chicken katsudon set. It's much much more gratifying.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5av7ZYxifKl1jPttRSvt7Q"
  },
  "Lh-22Q2dPbHkqwDefUXtLA": {
    "date": "1/10/2013",
    "text": "I came here because Ippudo had a que but I did hear that this place has some of the best tonkatsu in Singapore and I would have to fully agree. Ok, take this as you will, I'm from nyc and obviously not from Japan, so my opinion might be a bit skewed, but still very much honest. I have had tonkatsu many times in nyc/nj but at ma maison, it was the best I've ever had. The service was great, super friendly and very helpful. It's hard to find good service like that here so it was really refreshing to see that again since I left America. The miso beer and sweet potato sochu...awesome! My boyfriend ordered the black pig tonkatsu and he wasn't impressed. The meat was tough, and I'm not sure if its because it might have been a little overlooked or maybe that's just how the texture is naturally. I actually enjoyed his dish. Yes, it was a bit tough and chewy, but it was still juicy and flavorful. I had the tonkatsu fillet and, again, the bomb! That dark sauce is salty and flavorful, plus the nice shredded PILE of cabbage. The sticky brown rice was also fantastic. It was nutty and hearty, just awesome. I want to find out how to make that, because I can get used to that kind of brown rice! Not cheap though. 2 drinks and 2 meals was $100. Thank god the food was good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qN8rx-I5kErMaSmMcj2sAw",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. Black pig tonkatsu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qN8rx-I5kErMaSmMcj2sAw/o.jpg"
      },
      {
        "img_id": "-MopEvFOqo6nU4faXFrqwA",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. Tonkatsu fillet with brown rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-MopEvFOqo6nU4faXFrqwA/o.jpg"
      },
      {
        "img_id": "tF8dq2-3qaZvwSnyzG8o4g",
        "caption": "Photo of Tonkatsu Ma Maison - Singapore, Singapore. Sweet potato sochu and miso beer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tF8dq2-3qaZvwSnyzG8o4g/o.jpg"
      }
    ],
    "user_id": "FKWeca2cwUkxJTgW_Tj1nA"
  },
  "BD5-1Yu0eERy4uugNAdOEg": {
    "date": "6/15/2013",
    "text": "Sometimes when I go to a place like this I am afraid that I want to give them five stars only to justify how much I spent, so I don't feel like a sucker. This meal was excellent, probably the best tonkatsu I have had in Singapore. I am not sure if it was worth $80 for two people with no drinks. The condiments are amazing and the service is great. I am just not sure it is worth spending 2.5 times more than Romankan Yokohama to go here. The black pork tenderloin is really big and satisfying.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "sXYSPO5bjp9MpO4yRMpAJQ": {
    "date": "6/8/2013",
    "text": "This place serves pork cutlets that are crispy on the outside yet very juicy on the inside. I never hesitate to pay a little more to get the Hungary Mangalica Rosu Katsu set at $31.80. The meat is more tender than the other options which are sometimes too dry due to the lean cut.I love the free-flow cabbage as I can gluttonly feast on my favourite sesame dressing that they provide on every table. It also helps me to feel less guilty to eat more vege to balance out my sinful meat.They also serve tea-jelly at the end of your meal. I always enjoy this humble looking jelly as it washes your pallete after the feast.Tonkatsu is a very popular dinner spot. Be prepared to queue at least 45 minutes if you are going at 7pm.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ms9qgxOyQ8ul_WVJk4_Z3Q"
  },
  "1zLw7adcGSX5xHzbp07ReA": {
    "date": "10/7/2012",
    "text": "So we were there for an early dinner, and it was a toss up between Tonkatsu and Ippudo. Having never patronised T before, it was a clear winner on the freshness list, and we were warmly greeted by chirpy servers. We were quickly served balls of chilled, grated radish and a detailed look through the menu saw us ordering up Mameton, their self proclaimed bestseller, an Iberico pork set, and an Ebikatsu set. All orders come with a side of rice (plain or multi grain), pickles and soup.Taste wise: wow. It's a clear difference between pedestrian pork, dished out in the Mameton set, and Iberican pork. The breaded crust (panko?) was delightful to bite into, and not cloyingly oily as katsus are wont to be. The Iberico was well marbled, I.e. fatty, which provided a juicy burst or meaty goodness with each bite. It's not to say that the regular version was shoddy, but it just paled so much in comparison when side by side with the Spanish cut. The ebikatsu wasn't too bad, though strangely I adored the side of finely shredded cabbage. Icy cold, the servers would come around offering extra servings of fibre, which went very well when liberally doused with the accompanying sesame dressing. In addition, the meals come with roasted tea and a small cube of jelly as dessert. The flavours seem to vary daily, and ours was peach - cold, clean tasting, and not overly sweet. Price wise, three sets came up to shy of $100, though it also has to do with going for the premium pork. I do enjoy the service though, we're hard pressed to find sincere and friendly waitstaff around here. And the fact that it consists of cute Japanese blokes makes it so much more of a rarity!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  },
  "22a8A3BpQRAj--mwvL_nLw": {
    "date": "5/1/2013",
    "text": "The good:  Unlimited rice, cabbage and oh man the condiments.  By the end of the meal my food companion had to stop me from dipping my finger into the sweet, sweet sauce.  I guess my table manners go out the door when it comes to succulent sauce.  Next time I'm bringing a zip lock bag and bringing some home, no joke.  Also worth noting is the breading; light, fluffy and full or flavor.      The bad:  Lots of inconsistencies all around.  The temperature rivaled Antarctica and as a result we shifted not once, not twice but three times until we finally found a spot where we could feel our toes and fingers.  Service was spotty, sometimes we got what we asked and sometimes not.  I'm guessing they were as confused as their logo which is (and I'm not making this up) a pig serving pork.  Speaking of pork, I ordered the one from Hungary and although it's supposed to be fattier than the rest,  it was 40% fat.  I lost almost half of my meal to chewy, inedible swine bits.The ugly:  Given the options, price and location, this is probably as good as it gets in Singapore.  I feel with a little quality control and management direction this spot could skyrocket to the real deal, but it probably wont.  Why?  It doesn't need to, it's the best in Singapore...for now.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gyBH_pVycVOnjikFVXuBQ"
  },
  "BtvfKYp84Z40V1zaZMWPCw": {
    "date": "7/31/2014",
    "text": "My favorite katsu place in Singapore. Although on the pricey side, their pork katsu are always juicy and tasty. Warning though, I brought some senior citizens here once and they complained of too much 'chewing' lol. Their pork katsu are always perfect to me though. I especially love their giant prawn katsu, it's the size of an adult's arm but the meat is still sweet and tender! I also love their miso soup which comes full of yummy veggies and fried tofu skin.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIl2vuddRLlfjf9ya_aUSQ"
  },
  "7hWQbcgF_x8LfQ4Mbmyy2w": {
    "date": "1/22/2013",
    "text": "I dream of crispy panko fried porky goodness!One would never guessed that you can open a restaurant with a menu based on Katsu pork. These guys offer fillet and loin cuts from you basic pork, black pork (more fatty tasty), and pork from Hungary (even more fatty goodness). Sized from 180g to 250g. Go with friends and try the different cuts.Comes with free refills of brown or white rice, Soup, and cabbage.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6tWC8li_ro7dxQtKdvSBw"
  },
  "bUf6WTqjj17EdwZP3iTKjA": {
    "date": "9/19/2013",
    "text": "Tried this place for the first time. The daily set lunch was pork stuffed with filling that included roe. My lunch partner had the ebi-tonkatsu. I must say that we both enjoyed the meal and that it definitely met expectations. The portions were good and service was efficient. I would recommend this restaurant and would certainly return again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcIZcp8ftDEH1sNiucp-kw"
  },
  "GQvd2a4mY71GAW_YqTFxxw": {
    "date": "7/3/2013",
    "text": "Like a lot others, I was pretty skeptical to pay 3x higher than normal price for pork katsu. But considering it's inside the Mandarin gallery, the thought of overspending during vacation, and words from friend that actually have tried it, I decided to go - and boy, I'm happy that I did! Had a tough time deciding between the Hungarian or black pig rosu katsu, but I finally chose the Hungarian after seeing how fat the pig is in the in-store brochure. The set comes with soup, radish (which said to negate the negative effect of fried food such as katsu), bowl of rice, plenty of cabbage, and jelly for dessert. The meat is tender with the right amount of fat just I like it, the batter is crispy. I just used the sauce provided in the table, but you can ordered few special sauces for extra $. You can sit at the bar if you wanna see the cook prepared the meal for you. If you don't like pork, it also serves few seafood katsu options.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K175l53A-ciYnt0xS_V4CQ"
  }
}