{
  "xkSJwp256PL7CpefRWg4aQ": {
    "date": "8/4/2016",
    "text": "What's the best way to get over too many bowls of loudmouth soup the night before? A big bowl of Ramen soup from Suzuki today!This place is off the charts good and one of my favourite Ramen in Singapore!It's cash only, steers towards the expensive end of the market (it's on Circular Road no less) and at lunch times it's packed to the gills with guys and gals. Even with these challenges it's an easy one to recommend because the experience makes it all worthwhile.The menu is heavily customisable and you get some good options to go with. I almost always go the 5x spicy for that super kick, and salty because we are in the business of curing last night's mistakes. If you're a big eater you can plump for an egg and extra char siew to tide you over...Still hungry? There's help-yourself potato salad and a bowl of hard boiled eggs on the table to bang into your broth.If that doesn't satiate your hangriness then you shoulda gone the gyozas for starters - better luck next time rookie!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "YziRZOh5MrqN5b84dQ9AIQ"
  },
  "XNWHZU1Y2bS4W6__AuBckA": {
    "date": "11/7/2018",
    "text": "Me, together with my family, have been exploring some of the best ramen shops around Singapore and I could say that all of them are pretty good tasting. Some are really super delicious.Time now has come for us to visit and try Ramen Bar Suzuki's ramen, it was our first time. I'm excited and curious about the taste as I have read some good reviews about it. Reading all the reviews, it sounded to me as if it will overthrow my number 1 ranked ramen somewhere in Tanjong Pagar :) There was no queue at that time as we went there just about a few minutes after they've open. We ordered tonkotso ramen, our favorite broth.The ramen was then served, and this is my honest opinion; Presentation is fair. The aroma is not that intense. The ramen is not served hot enough. I stirred the noodles then took a first sip... The broth is definitely not so rich and not so creamy. The broth is a bit bland (I'm sorry).I hate overcooked and soggy noodles, but their noodles, though I chose \"normal\" texture, is way way undercooked. Anyhow, I dove in but I wasn't able to finish the broth. Overall, we're not satisfied with the ramen. The ramen we just tasted at that particular day and time was definitely not as per our expectations. Was it because they've just opened and the ramen was not yet ready for order?  Shouldn't be the case right? I don't know.Anyways, maybe I'll try it again next time and re-update my reviews.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSQyD1uyNUGpIfed6HZb7A"
  },
  "pFI63JVotZtKRXGvvQZhAQ": {
    "date": "3/2/2017",
    "text": "The tonkotsu broth is not as creamy, more on the watery side and it reminds me of Japanese-Taiwanese ramen. The noodles are thin. I ordered the Red version but its not really spicy. Overall the taste is ok, but if you refer a thicker broth and more chewy noodles, it might not be for you. The price is steep since its in Boat Quay",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lohsGY_w9b4e7lgDJfHmoA"
  },
  "b7TJOpybcLKI4BKVSKa1hA": {
    "date": "12/20/2012",
    "text": "Had to check it off the ramen list, and I'm glad to report it was worth it. Pretty close to Tonkotsu King in taste and presentation, so you kinda know what you're getting here. Rich, tasty broth, and thin noodles (i'm a fan - no udon for me) mean simple satisfaction in a bowl.Learn this lesson though: go early. REALLY early. I was there at 1205 and already there was a queue eight people deep. Made me wonder how early these people snuck off work.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "DFN8OCFUilXHBFdF1oSsTg",
        "caption": "Photo of Ramen Bar Suzuki - Singapore, Singapore. I'm here at 1145, and there's a queue this long.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DFN8OCFUilXHBFdF1oSsTg/o.jpg"
      }
    ],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "pgcEVHaYKQzHrWM-SVqiBg": {
    "date": "12/12/2012",
    "text": "Crazy lines at lunch time, so either come very early or very late.The ramen here is very thin. Thus, they have a tendency to get soggy if you are a slow eater. I ordered mine harder and it still retained a bite at the end of the meal. I presume any order softer than that may result in soft noodles towards the end.Broth is flavorful. On first bite, it doesn't come across as being too salty. Thumbs up for that. However towards the end, it did.The standard serving only comes with one slice of pork, but you do get to choose whether you want belly or pork loin. So it is great for the health conscious.Free flow of hard boiled eggs at every table and more free condiments like rice, cabbage, etc.I would eat it but I don't crave it.Cash only.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_GeeBGtt1Nhp50NGgGq7xA",
        "caption": "Photo of Ramen Bar Suzuki - Singapore, Singapore. Original tonkotsu ramen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_GeeBGtt1Nhp50NGgGq7xA/o.jpg"
      },
      {
        "img_id": "dBNhxMwc4UpFNhJhwajm5g",
        "caption": "Photo of Ramen Bar Suzuki - Singapore, Singapore. Jet black ramen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dBNhxMwc4UpFNhJhwajm5g/o.jpg"
      },
      {
        "img_id": "5aJYUeID3N2qhpF8S5D7IA",
        "caption": "Photo of Ramen Bar Suzuki - Singapore, Singapore. Free eggs on each table",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5aJYUeID3N2qhpF8S5D7IA/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  },
  "3DexEn1VsYde1yCvphb3jA": {
    "date": "2/22/2015",
    "text": "Pretty legit ramen joint in Boat Quay, popular with the office crowd.Had lunch here today and there was no queue at noon or during our meal, most likely due to folks still out of the office on the Monday after a 4-day CNY weekend. Perhaps the popularity has waned a bit, not sure.Kudos for all the free flow rice, seasoned bean sprouts, hard boiled eggs, and mashed potatoes along with busting out two types of Tobasco sauce without prompting.The place is cash only and you jot down your order on a paper order form giving your preference for noodle firmness, broth flavor strength, level of oily-ness, etc then pay at the front register before finding a seat.The spot seems popular with expat Japanese workers in the area which is always a good sign.Def worth a visit and I look forward to returning for lunch again soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hRMpQlJQDObCpNSJ1qd_fA"
  },
  "H6nQjBgVS1VLNhDpVR-LwA": {
    "date": "8/28/2015",
    "text": "So I got this ramen kick. Every day had to have one, tried many places but this one is my Favorite. Flavours are bold, make sure you get amber broth, limited to 10 bowls per day only. Service and ambience is fair. The only downside is cash only and the order forms can be a bit confusing for a first timer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1fNIaKrS42i9DK6YoJqU5g"
  },
  "2lvDPsFI5U52ADqGhb7SDw": {
    "date": "10/28/2014",
    "text": "The queue is insane at lunch hours soooo go early! It's pretty decent, and comes with free flow of eggs and whatever side they have up on display at a side. A bowl is really satisfying on a nice cold day. Get there early if you work nearby! :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pu0p-tEbEzaDwv59d3YozQ"
  },
  "9SVK1Z5F_YVtTBuJ4Q02ig": {
    "date": "1/27/2013",
    "text": "Fresh Ramen with all of your special order fix-ins is GREATER THAN Dehyrdrated ramen from the grocery store.Came here on a Wednesday night around 8PM. The restaurant was full -but no line from what I could tell.  Each dinner gets to select his/her own soup noodle base + special order fix-ins (e.g extra meat, extra toppings, flavored soft-boiled egg, etc). If you're still not full from all of the noodles and yummy broth, then you can get your fill from the all-you-can eat shredded cabbage + dressing  and/or rice that your little tummy desires.  If you leave not feeling satisfied (and perhaps with some spots of soup splattered on your clothes), then shame on you!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x7ykv2z_d0aIawhvEraRuQ"
  },
  "g_7vmU-JoGCj4pPrVw6PBA": {
    "date": "2/21/2015",
    "text": "Soup is thick and flavorful enough - Just how I like it. Char siew needs improvement though as it is quite difficult to chew, Recommendation is to get the Pure white special because you get 4 char siew and 1 flavored egg for only $13.00. Would be nice if they can add dipping noodles to their menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LLRmCX0Gl7_x6bxSE-T3A"
  },
  "qj7rOC9b3BwVRpekBpRhvw": {
    "date": "10/24/2012",
    "text": "This is a dinky little ramen place smack right diagonal from my yoga studio, and what better way to nullify a hot sweaty workout than stuffing my face with carbs? RBS specialises in Tonkatsu ramen, with choices of white (original), red (spicy), black (squid ink), tsukemen (dipping noodles) or fish flakes. I opted for the white, and aside from the customisation available - taste, flavoured oil, noodle hardness etc, you can also partake in the hard boiled eggs and bean sprouts available. Hm, isn't that quite similar to a certain ramen place at Orchid Hotel, your though bubble visualises. Yes, but RBS manages to one up them by providing jugs of iced tea, fried pork lard and fragrant garlic chips at each table! That's pretty ingenious I think! And in addition, there's complimentary free flow of rice and shredded cabbage with homemade dressing to go with your remaining soup too, which makes this joint even more of a win.Taste test: I went with the white Tonkotsu and the soup base was thick and flavourful without being too oily as most ramen places are wont to do. Sure, a lighter touch is very much tweaked to Singaporean tastes, but hey, that's how I like it. The noodles are on the thin side, so I chose to have them hard (they also have a \"harder\" option) as I was pretty sure they'd get soggy in no time. And they did, so I'll opt for harder on my next visit. The char siew slice was thin, and I was a bit disappointed at that, but it was deliciously tender. What a crafty ploy to get customers to opt for the extra char siew version, but then again, it works! Extra char siew next visit it is. In addition, they also put in a kicker of a really cute Japanese chef - great eye candy and he's got the girls' votes. Er. Have I mentioned that I'll be going back?",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  }
}