{
  "CJNar3JuRJW3kcOLD1orSA": {
    "date": "6/5/2016",
    "text": "AURA is located in the new National Gallery of Singapore. Besides its quaint location, this Italian restaurant serves a wide array of wine that complements with their food. Plus point! They have very fresh, yummy homemade pasta. I am very particular about pasta as it is my favourite noodle, so naturally its flavour, the chewiness, the presentation all comes together as one when I review whether I should visit them again.  This is one of the few restaurants that blown me away with al dente pasta, hearty portions, worth every penny price points and impeccable service.The bar also has a picturesque night's view of Marina Bay, recommend you making a reservation before you go over. Without alcohol its about $100 a person with a three course meal, but if you just order a pasta and a non alcoholic drink, $50 per person will suffice. Great for date nights and corporate dining.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "cYNObRuxZ4aLzYZ0kEc01w"
  },
  "zmYYo2kQg1zseSnHux-Khg": {
    "date": "6/19/2018",
    "text": "Expensive and kinda meh service, waiters either keep interrupting you or plain ignore you. Generous portions of pasta though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "SEAXT4hjWN-hq0vQfr3T1A": {
    "date": "9/27/2017",
    "text": "My wife and I ordered the tortelli and raviolli - the only vegetarian items on the menu.  The tiny portions could fit on a tea saucer though they put it on a big plate with a tea saucer-sized indentation in it.  It would be just okay if it were a $6 appetizer at Olive Garden (or pick any generic food chain really) but they were $35 and $32 respectively.  Mine was lukewarm when they served it and had sprigs of parsley with tough stems that I had to pick out.  Our friends got the buffet and seemed happy so I suggest doing that if you have to eat here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VqgKru-YscUlaIVVbSbHKg",
        "caption": "Photo of AURA - Singapore, Singapore. Totally not worth $100.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VqgKru-YscUlaIVVbSbHKg/o.jpg"
      }
    ],
    "user_id": "InfoR0pWdTWAkgNBwVuhtg"
  },
  "VHn7IhLW0AeLqhkx--FGnQ": {
    "date": "11/3/2015",
    "text": "The restaurant is located at the going to open National Gallery Singapore. It is opened by Beppe de Vito who is the one behind il Lido in Sentosa. The restaurant offers Italian cuisine in posh style. The main restaurant is located at the level 5, the sky lounge is located at level 6. With a restaurant week reservation, it is interesting to find that I am being showed to a table at the sky lounge. The place has both aircon and alfresco dining areas, overlooking the The Padang, with a great view of Marina Bay Sands. Today we are having the restaurant week lunch which costs $40++ per person and consists of a starter, a pasta, a main and a dessert, with bread and coffee or tea included.We start the meal with some breads, served with olive oil dip. While the bread is not served hot, it is soft and fluffy inside. Hokkiado Scallops Crudo with Truffle ($25)The raw scallops are lightly seasoned, and goes quite well with the tangy sweet pomegranate arils (seeds) and puree sauce. The dish is served in a colorful and playful, which looks very appetizing. The smoked quail egg is like mini version of the lava egg which is usually found in ramens. Whole Wheat Stracci with Duck & Foie Gras ($32)We are surprised with the chunks of foie gras, which tastes buttery smooth. Although the dish is filled with minced duck meat, the gamey taste of duck is not overwhelming here.For mains, there is 2 choices available.Black Cod with Beetroot and Porcini MushroomsThe cod is juicy and chunky, served a richly colorful bed of beetroot puree. Beef Sirloin with Asparagus and Red Wine SauceThe serving is rather small, about half the size when compared to the cod. Although cooked medium, the texture is a bit tough than preferred. There is barely any sauce.Lastly for dessert, we haveStrawberry, Pistachio & Chocolate Profiteroles ($18)Although the dessert is simply profiteroles, they are distinct in their own taste, especially the pistachio - strong in flavour and light without feeling too creamy.We end the meal with a selection of Fine Teas and Coffee.Overall the food is not bad. Service is not bad too, although it would be better if the staff has made a better job of clearing the bread crumbs on the table. It is not often to see staff using the metal ruler like stuff to clear the table. The restaurant is such a relaxing place that 2.5 hours of lunching has gone in a blink.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6-4pKn4e7bwGQxE-xUFD6w",
        "caption": "Photo of AURA - Singapore, Singapore. Strawberry, Pistachio & Chocolate Profiteroles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6-4pKn4e7bwGQxE-xUFD6w/o.jpg"
      },
      {
        "img_id": "l5tckTINMddIEkAgQRdhJg",
        "caption": "Photo of AURA - Singapore, Singapore. Beef Sirloin with Asparagus and Red Wine Sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l5tckTINMddIEkAgQRdhJg/o.jpg"
      },
      {
        "img_id": "Rynu3YLTWaNq85l2J78bUg",
        "caption": "Photo of AURA - Singapore, Singapore. Black Cod with Beetroot and Porcini Mushrooms",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rynu3YLTWaNq85l2J78bUg/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "LHOfCrcGEc9y-kypDJcU4Q": {
    "date": "1/1/2016",
    "text": "it's been years since i last visited il lido on remote sentosa and i'm real glad aura was created in a much easier to access prime location.two festive meals were partaken here and both times the nom did not disappoint.the christmas set lunch in particular offered real value for money with a cleverly crafted and well executed menu plus entertainment thrown in.the seafood antipasto tantalized the taste buds to start.the cod with savoy cabbage struck a nice chord but it was indeed the tenderly juicy, crispy skin, guinea fowl that really wowed! and by the time the beautifully scrumptious christmas log cake made it's appearance, the now satisfied stomach had little choice and duly but thankfully expanded.  and finally, the surprise hazelnut gift package was a sweet thoughtful festive pairing with post dessert caffeine.it was precisely all of the above which drew us back for a new year's day dinner in an attempt to try their ala carte items which were not available for lunch on christmas day.and so choice is mostly overrated although often demanded.sometimes a set can outdo what personal choice cannot quite achieve with a limited budget.but you can't go wrong with any of their ala carte pasta selection.all artisanally al dente with a gastronomical permutation for each democratic soul.and i do strongly suggest having it after one of their appetizers.i had the grilled octopus as i do love my octopussy and know the italians do theirs with aplomb!nicely charred yet tenderized tentacles lie surrounding, as if protecting, an oishii crispy onsen egg.as for the final stomach stretching exercise, i chose with my final vote, the bailey's and hazelnut feuillantine.though not alcoholically pleasing, it was the most photogenic and totally calorie worthwhile.service was cordially competent on both occasions but can definitely be more polished.do check your bill if you are in a big group as 'mistakes' may be made, sometimes.in this new year ahead, may it's distinctive but intangible qualities continue to radiate and satiate.",
    "rating": 4.0,
    "rated": {
      "useful": 15,
      "funny": 10,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "fNnapazWz6mMaUb37Ow2cA",
        "caption": "Photo of AURA - Singapore, Singapore. Cod with basil orzotto and cherry tomatoes, $38++.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fNnapazWz6mMaUb37Ow2cA/o.jpg"
      },
      {
        "img_id": "ZDV4kDik6CvZDc56WZ0ERQ",
        "caption": "Photo of AURA - Singapore, Singapore. Spaghetti with prawn, part of $80++ dinner set.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZDV4kDik6CvZDc56WZ0ERQ/o.jpg"
      },
      {
        "img_id": "hoCdXqFdrBpanm28x72M3g",
        "caption": "Photo of AURA - Singapore, Singapore. Grilled octopus with crispy egg and corn, $28++.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hoCdXqFdrBpanm28x72M3g/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "uk7Fl4weCK5pSTdrAHkcQA": {
    "date": "2/6/2016",
    "text": "Visited for lunch on a Friday. The set lunch (Green Asparagus Soup, Linguine Bolognese, Mango Delice) looked boring, so we decided to order from the main menu instead to share.We had:Scallops Crudo with Truffle and Smoked Quail Eggs - this came BEAUTIFULLY presented, complete with edible flowers and ikura topping the raw scallops on a bed of mashed avocado. This was unanimously the best dish of the meal. The scallops were fresh and flavorful. Definitely order this, it's a delight for the senses.Spaghetti with Crab and Porcini - they were generous with the crab; thick juicy chunks swirled with the spaghetti. Crab was the star of the dish, the sauce and porcini just average. Enjoyable though.Burrata Cheese Ravioli with Amatriciana - I found this a little too cheesy, though my other 2 dining companions did enjoy it quite a bit. Only order this if you are a fan of cheese and carbs. But it went well with the sauce and crunchy bits to provide texture.Italian Seabass with Artichokes and Saffron Sauce - fish was nicely cooked, though I'd have liked the skin slightly crispier. The saffron sauce didn't stand out, and there was a tad too much artichoke. The food was decent, though not mindblowing for its price ($142 in total incl tax/service). Only the scallops stood out. The 3 of us left decently satisfied. Good place for business lunches.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w4PnxzS59OOEk1W5A1BPKA",
        "caption": "Photo of AURA - Singapore, Singapore. Spaghetti with crab and porcini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w4PnxzS59OOEk1W5A1BPKA/o.jpg"
      },
      {
        "img_id": "Agmr_EIRYSycyTbWXfrO6Q",
        "caption": "Photo of AURA - Singapore, Singapore. Burrata cheese ravioli with amatriciana",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Agmr_EIRYSycyTbWXfrO6Q/o.jpg"
      },
      {
        "img_id": "Ri8tdv7bBoRnKsb8B3X1aQ",
        "caption": "Photo of AURA - Singapore, Singapore. Italian seabass with artichokes and saffron sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ri8tdv7bBoRnKsb8B3X1aQ/o.jpg"
      }
    ],
    "user_id": "seb6_XUoH4q-mtJ6pCCXlg"
  },
  "zb9FzWaAvT-_uNJGrBiaPw": {
    "date": "4/30/2017",
    "text": "An amazing view that is definitely a must do on your Singapore list. However, drink portions are incredibly stingy. If you are going to charge 16-20 for a glass of ok wine that is half a correct serving, charge 20-24 and fill the thing correctly.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgVahucUB54JgXPJYZIizg"
  },
  "SATJv48RJ2hgp4tWzDKQZw": {
    "date": "5/21/2017",
    "text": "I tried this place twice to be objective. First time was bad service -- cold food, unemotional staff. I wrote it off as opening month jitters. The second time was six months later. Nothing's changed. Given a choice, I would get Olive Garden.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "2wifStD3TDphOlSuUd0zuA": {
    "date": "2/29/2016",
    "text": "Been here a couple of times, for drinks mainly. The view is to die for, both in the daytime and in the evening. It's got an unblocked practically 360 view of Marina Bay. So it's worth coming up here to see the view. But the service is non-existent. Waiters take forever to come over. One evening I was there with friends, we had to wait at least 5 minutes for anyone to pay attention to us. We just plonked ourselves down after we got tired of waiting (the lack of service was not due to crowds, in fact, the place was practically empty although there were tables outdoors which were occupied). We literally were helping ourselves to napkins because the waiter did not come over, forgot to deliver even after one of my friends went over to ask and we finally got so fed up one of us walked over to the bar to get the napkins. The bar food is decent but not spectacular. Given the prices they charge, it'd better be edible. So be forewarned. Come here for drinks only if you want a view and do not mind slow, patchy service.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wuRI6NhRB6cUWERRmcvOMQ"
  },
  "YiO7VN2AheA91KqVenHCGQ": {
    "date": "10/12/2016",
    "text": "Splendid location and setting and fantastic wine list of you are into Italian wines. Food was mostly good,  although the daily special, uni pasta,  was not that great,  it tasted like uni was not really top quality. Generally i felt a bit meh with the food,  was expecting more. Seabass was good though. My biggest problem with the place was the noise. It is very very noisy when the restaurant is full,  to a point that it feels like sitting in a night club.  Seriously noise level was unbearable. I wanted to like the place,  i really really did. Food not being up to expectations and the noise level especially will keep me away from this place. If you don't mind to shout through the dinner,  then try by all means. Otherwise take ear plugs with you.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tnoaMYqfoA3hK8tJvY0LkA"
  },
  "yMm4k3pNCUt5_5NPrf0OaQ": {
    "date": "5/16/2017",
    "text": "We went to Aura for lunch on a day it was raining, so the overall  ambiance was amazing given that the full length glass windows made everything seem softer and nicer. The food was tasty and beautifully presented. Service was excellent, very attentive, always ready with suggestions. We will definitely visit again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJzu5EUE13Cxf2ghRhJG7g"
  },
  "4-P1EowuLJpK7_FdRtKKJQ": {
    "date": "12/3/2015",
    "text": "3 stars for the not so great service, but food is good. Highly recommend the homemade pastas. We tried the pappardelle with oxtail, the ravioli and the truffle pasta (but we changed the pasta to tagliolini). For the mains, I recommend the pork, beef, and scallops. Well that's what we tried and everything was delicious. Service is super slow, they serve one course at a time. My water glass was always empty, same comment as another girl on trip advisor: she had to serve herself the drinks. So I recommend coming when you have time to kill because you have to wait a while for your food to come, but when it comes it's good. Show you some pics of the main :)",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mUG6MY67fm_1l4JCDobHFg",
        "caption": "Photo of AURA - Singapore, Singapore. Hokkaido scallops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mUG6MY67fm_1l4JCDobHFg/o.jpg"
      },
      {
        "img_id": "677aJE0MduNe9bObn_Cp9g",
        "caption": "Photo of AURA - Singapore, Singapore. Beef medium rare with bone marrow",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/677aJE0MduNe9bObn_Cp9g/o.jpg"
      },
      {
        "img_id": "aIf5-pur9tLpHJWkH_i0LA",
        "caption": "Photo of AURA - Singapore, Singapore. Pork Milanese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aIf5-pur9tLpHJWkH_i0LA/o.jpg"
      }
    ],
    "user_id": "PK5NTAjdVY9mPdtwU0Ve3Q"
  },
  "KaywXegfMxy0oWtW7y6Kmw": {
    "date": "2/16/2016",
    "text": "We were lucky enough to have our wedding hosted at Aura sky lounge and padang deck.  It was an amazing night for us:Ambiance - breathtaking views of Singapore.  We were able to see the light show and fireworks during our dinner.  Those who preferred the AC stayed inside (very comfortable, still a great view), while those who wanted some air would go outside.  Restrooms were easily accessible down a set of stairsFood - Although we didn't have much time to eat (lots of people to talk to!) the food was all quite delicious.  Beverages were very good as well. All of our guests were very pleased with the quality and timing.Service - Couldn't be happier.  The staff is very responsive to planning (Gene was our main point of contact) and the wait staff during our event was great.Awesome place to have a wedding or event!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtD1tpYbZK30VgmvlvETtQ"
  },
  "UhlwHpM8-6tRxAeAOx9UGw": {
    "date": "1/3/2016",
    "text": "Aura has many good things going for it - housed in an incredibly beautiful building and seasoned restauranteur Beppe De Vitto's touch. I went there for brunch on a Sunday; the first thing that hits you as you enter is the buzz running through the restaurant, not raucous, but sufficiently energetic so you don't get any of the usual stuffiness in museum restaurants. Service is attentive but not uptight;  the wait staff strike a good balance of professionalism and chumminess, offering suggestions for life-changing dishes (which btw was the grilled octopus). One waiter even offered to move us when he saw us struggling with our stroller in a packed corner. I really liked the interior - comfy seating, classy combo of white marble, brass, and lovely lighting pieces. The food was very good - I didn't think it was life-changing, but everything we ordered was solid. We started with the grilled octopus and tuna tartare. Both were delicious, but the octopus at Bochinche still has my heart. For mains, we had the duck stracci with foie gras and their signature taglialini with scampi. The duck ragout was the winner here - homely and full of flavour. For dessert we had the hazelnut feuillantine, which was super indulgent with lovely texture. My prosecco was fruity and perfect for brunch; my husband was pretty happy with his pinot noir.Aura is just what Singapore needs more of - versatile option for date night, an important business meeting, must-do for visitors to Singapore, or a great spot for boozy grown-up brunch with friends.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-DPyJgX9hXNk_RJc3kcCHg"
  },
  "BgkKxWgpe5cBU2TUNZ1YAA": {
    "date": "4/30/2017",
    "text": "Second time at the restaurant.  Had had a very good experience the first time a few months ago and so was expecting a good dinner and was prepared to disagree with some of the poor reviews.  The food is good but the service this last time was terrible.  Sticks in one's craw to pay the amount charged after having had to chase the waiter numerous times to take our orders.  After a decent initial show when we first arrived, no effort was made during the balance of the meal, perhaps because what looked like an Australian chef was seated at the next table.  Had to chase for the bill and left the restaurant without any effort from the staff to say goodbye.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KGDeSGEyQ_W3YSBs-X--Jg"
  },
  "VIOVHDK3pY8-ve_yKO7boQ": {
    "date": "9/17/2016",
    "text": "Happy with everything we ordered. Got a crispy octopus for appetiser, beef and lamb chop for main, and finished with French toast with banana, strawberry and hazelnut. Every course exceeded my expectations and that is actually quite rare for me as I often find a lot of restaurants in Singapore underwhelming. Happy to go back again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "96N9dLpi_B-5DrGL0vh0yQ"
  },
  "IRUAw_ENuWVh4NmtsrYm3g": {
    "date": "1/11/2016",
    "text": "Great views, nice ambience and good selection of yummy dishes. Additionally execellent service. Highly recommended",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tBEJgZP8uf8_nXx-O6XYtA"
  },
  "Q3s5kHqe698wXDXvDxl91A": {
    "date": "2/13/2016",
    "text": "Fantastic view, on the rooftop of the newly opened Singapore National Gallery. The atmosphere, the environment is superb. Some of the food is great - like the salmon benedict -, but please avoid the toasted barley with yoghurt and baked figs. Somewhat pricey, but worth the visit for special occasions.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aEi9QSrciMFIjTGDffogOA"
  },
  "Phsf4cUuSkxKo5a3Q5n1cw": {
    "date": "2/20/2016",
    "text": "Tried to make last minute reservations at the main restaurant for lunch but they were full. They nicely suggested that we go for the antipasti buffet upstairs in the Sky Lounge, which was delightful. You get to choose from around 8 different types for just $18+++, which is a steal in my book!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsIVj_AszmnnsykBrKgdHw"
  }
}