{
  "UWl5YfHdIpJagrZ3mPnCGA": {
    "date": "6/21/2013",
    "text": "Came here today in particular cos it is located indoors in a shopping mall and away from the hazy outdoors where brunch is usually done in. I must say that their savory items are just okay. I had the norwegian breakfast that didnt look as appetising as other brunch outlets nor did it taste like anything special. It seems a little hefty for something that could be done at home.But the desserts - damn! The profiterole I had is just divine. Almost as good as what I had back in Australia. The vanilla seeds are still visible on the vanilla ice cream and taste oh so heavenly. Though sweet with the honey and chocolate sauce topping... But its really smashing. Service is friendly, with a smile and they are quick in assisting you when seated. However, as the service window (where food is dished out and most service staff are there to get nosh out) is at a corner and blocked by a pillar, the staff usually are a little slower to get you seated. So just be a little more patient while you wait to get seated. :)So come down here if you want a quality sweet treat! Ask me along so I can enjoy the desserts along with you. If not, sending me a picture of your dessert here will definitely make me jealous. :p",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mlTbnIwfGRYAqB8JwO4npg",
        "caption": "Photo of Pique Nique - Singapore, Singapore. Profiteroles the way it should be...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mlTbnIwfGRYAqB8JwO4npg/o.jpg"
      }
    ],
    "user_id": "SUxcerD3p3AXUII_Qqu3ZA"
  },
  "Uklvv3wkLQp40tjJLKdyfQ": {
    "date": "12/10/2012",
    "text": "Only in Asia will you find complaints about dessert being too sweet. Damnit, people, that's why it's dessert. So I love my sweets to be SWEET. sugar? yes. carbs? hell yes.chock full of fatty goodness? bring it on. So Pique Nique scores on the sweetness level. None of this fake half-sugar crap that the rest of the Asian bakeries try to pass off as dessert. And this is one of the few places on the island that actually carries salted caramel macarons (with real salted caramel). After Canele started filling their caramel macarons with butter cream burnt caramel, I had to run crying to Pique Nique to satisfy my cravings. Admittedly, the texture can be slightly improved -- I often find the shells a bit overbaked and crunchy. But the filling to shell ratio works well. Top off the experience with more sugary goodness -- like their homemade marshmallows, cupcakes (that actually taste like cupcakes with real icing!), and whoopie pies (more filling please) -- and you are in a sugar high coma. If you like your sweets to be exactly that, then this place delivers.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PSiioYMqJ1r0On_RijpQaA"
  },
  "S8slzAEGJR31JwA2iZouEw": {
    "date": "10/24/2015",
    "text": "The shop is located in the Ngee Ann City Shopping Mall.  If you need a quick bite, they have food and coffees, but nothing wow-ed me.  I had a $14 Norwegian Benedict.  The salmon was fresh and good, but the plain bun it was served on left a lot to be desired.  Not to mention there was no hollandaise or any kind of sauce, just the run of the egg.  The egg was done well.  I also had a latte, which tasted pretty standard which is what I was looking for.  While the decor is cute, the chairs and benches seemed a little dirty.  The lighting didn't help.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CgiW9YTVnfNk-PR93QHmjQ"
  },
  "PuKNHzZx5Jm-x72udExKZQ": {
    "date": "11/5/2014",
    "text": "This has been the numerous times we've been here.  Food remains consistent.  The only thing is the attentiveness of the waiting staff needs a little pricing up.  Got to watch the blind corners for customers asking for help.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-pojBbjwBNAFrZp3vM2maw",
        "caption": "Photo of Pique Nique - Singapore, Singapore. Mango Madness",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-pojBbjwBNAFrZp3vM2maw/o.jpg"
      },
      {
        "img_id": "fN1k3bJpDaSX-Ka8vcUV0g",
        "caption": "Photo of Pique Nique - Singapore, Singapore. Spaghetti Meatball",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fN1k3bJpDaSX-Ka8vcUV0g/o.jpg"
      },
      {
        "img_id": "ExnhPzQFHv315MfGMtF6JQ",
        "caption": "Photo of Pique Nique - Singapore, Singapore. Classic Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ExnhPzQFHv315MfGMtF6JQ/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "WVV8kediI24y-gIs9JreQw": {
    "date": "8/13/2012",
    "text": "Yet another snazzy snack-and-dessert place to be found in town, Pique Nique's main highlights are its pretty cupcakes, which line the platters that populate the front of the small café. The décor is pleasant, aiming to recreate a Parisian atmosphere with quirky wallpaper and cute chairs and tables.I passed over the cupcakes as I was hungry and desired something more substantial, so I opted for their fries. A good call, since they were nicely cut and cooked to perfection. The dip was pretty delicious as well. I washed it all down with a banana milkshake, which was flavourful and balanced. I wanted to try the cakes on display but was sadly too full to do so. On another occasion, I bought their cakes, and they packaged it in a delightfully charming box with their logo on it. If you're thinking about desserts for presents on occasions like birthdays or holidays, Pique Nique probably will win some points for presentation. Upon tasting the cakes, they didn't fare that badly either! Only thing is that they can be a little pricey (think $6-8 for a slice, on par with places like Canele).Service on the weekday afternoon was relatively fast and fuss-free, and the staff seemed cheerful and willing to attend to my requests.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S2L5ha4hyYcwod2QcsZxAA",
        "caption": "Photo of Pique Nique - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S2L5ha4hyYcwod2QcsZxAA/o.jpg"
      }
    ],
    "user_id": "hC1HjO-Tye6dar3Bg0aZMw"
  },
  "U13tNdQOAemyYow-GxuogQ": {
    "date": "8/26/2012",
    "text": "Coming across another one on the list of dessert places by chef pang, I was pretty interested to give it a shot. It is an American themed restaurant serving burgers, fries and shakes, as well as an extensive list of desserts. A bunch of friends and I dropped by for lunch one afternoon. The place was nicely decorated, slightly casual with a nice chilled-out vibe and a dreamy ambience. I ordered a burger and was pretty disappointed with it. The bun was soggy and kinda oily, and the patty was dry and blend. The fries were ok, but nothing to shout about. I had a taste of my friend's Mac 'n' Cheese and that was pretty yummy, comfort food material. The egg benedict another friend had was not too bad either. Well, I guess I was just unlucky with the burger. I had a couple of macarons to end the meal and ordered a pistachio, red velvet and salty caramel. While the texture of the macarons were really good, they were a little too sweet. I wouldn't exactly call it pretty either, as the colours were way too bright. I've heard great things about their cupcakes and I guess I may return to try it out if I am around the area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3hSujKcpbD-HpEXUPDLbPA",
        "caption": "Photo of Pique Nique - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3hSujKcpbD-HpEXUPDLbPA/o.jpg"
      }
    ],
    "user_id": "I0Ml519BP2Ya3-Ec5GgVgA"
  },
  "TyQZOJrWk23r3nY6YSfPyw": {
    "date": "8/16/2012",
    "text": "I went to Pique Nique with a friend for a snack. I love the decor of this place. However, I find the service here a bit lacking.. took us quite a while to get the attention of the waiting staff. My salad came and I love how generous they were with the amount of chicken..however the lemon dressing did not sit too well with me. My friend ordered their iced chocolate which I have sampled and it was good, that is something I will order if I should go back again. Oh and their desserts, I have to try it one day as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ktMg_GX7Zl27jsQnqLtYfQ",
        "caption": "Photo of Pique Nique - Singapore, Singapore. Chicken Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ktMg_GX7Zl27jsQnqLtYfQ/o.jpg"
      }
    ],
    "user_id": "_6zTmwRscQUpbyo8etB0nQ"
  },
  "7d20CqV5ZIPuInN3Ps78fg": {
    "date": "6/14/2013",
    "text": "I was here yesterday, ordered the classic Benedictine just to try their hollandaise sauce. Sad this is that it's a little too sour. Otherwise it's alright but it lingers too much in the mouth- most likely caused by the butter content in it /.\\The eggs were just this slightly overcooked. I was quite shocked when I was given ham like the ones you find in NTUC.. I was expecting something more like real pork. However, The side salad was awesome! At least the veggies were fresh and there was enough dressing- maybe too much, for some.Then we went on to try their fries, OH MY GOSH IT'S TOTALLY A WINNER! Do try this if you're there! It's much of a straight cut and they are as deeply fried as the ones you have in MacD's (: I guess this is what they call \"a healthier choice\"...? Hahaha!This is also one of the places whereby the waiters and waitresses serving you are very friendly!WHERE'S THE BAKED POTATOES?! (°°)(",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kZJQlU5MmyZAj_biIDRmdw"
  },
  "O7nkhAZn1xRVFLHepClWnQ": {
    "date": "8/1/2012",
    "text": "I had rather high hopes for Pique Nique, opened by Chef Pang of Antoinette and Canele previously, and its American-style food and desserts. I have not actually had an opportunity to try the food there but have been there a few times for desserts at tea time. As expected, it was a stylish place with pretty food that you'd want to stare at all day. The general feeling of the place is very different from Antoinette just as high street fashion is different from high end. The service is casual, perhaps not the friendliest but not a turn-off either. I ventured to try their cupcakes, after being told that they were really good. I have to admit I was a little disappointed. I first tried the red velvet cupcake which looked disturbingly bright and lacked any hint of cocoa, and violet cupcake which had a very interesting dropped sticking out at the top. They weren't bad, although the amount of sugar could be reduced a little, but lacked uniqueness in taste and a more multi-faceted flavour beyond sugary sweet. Also, it was a lot more dense than I like my cupcakes to be with a thick layer of cream. I very much preferred the violet cupcake, which is actually somewhat of a berries confiture filling and a simple twist to the traditional vanilla cupcake. I've also tried their very American Whoopie Pie. It was interesting, and definitely not a macaroon, but I'm not crazy about it.Cupcakes are about $5 each and cakes are about $8, so while it is not exactly an expensive dessert place compared to many of such similar Western cafes around, I wouldn't exactly be craving for it or returning too often.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5av7ZYxifKl1jPttRSvt7Q"
  },
  "koGOjd7N0b4-zbXEbHSgWA": {
    "date": "3/24/2013",
    "text": "Although the decor of this place is cute, the food is really super meh. Nothing stood out and my basic breakfast meal was beyond ordinary. We also tried the red velvet cake, since some reviews recommended it, but it wasn't good at all. It was dry with hard frosting....",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Sy0izMlyQ0_M-vLpmmfyw"
  },
  "RU5DXU5Am3SR7Er6cG6dtg": {
    "date": "9/8/2012",
    "text": "It is difficult to find a café in town that serves decent food at affordable prices, but Pique Nique is one such café. It is an American-themed café that serves all-day breakfast, desserts and pastries. It has a rather pleasing ambience, with princessy seats. Having dined there twice, I have had one good experience and another disappointing one. The Eggs Benedict was passable and came in a large portion. The poached eggs were cooked right, fully cooked on the outside but with a runny yolk. The hollandaise sauce was rich and buttery. The omelette was a miss, since it was overcooked and far too ordinary. Seeing that they had Whoopie Pies on display was a pleasant surprise. Whoopie pies are like American versions of macarons and the difference is that whoopie pies have a chewier and more cake-like texture than crispy macaron shells. Pique Nique is one of the rare few places that sells this snack.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "NywSk-EPc7t1MP92r1zJDQ": {
    "date": "8/27/2012",
    "text": "Possessing unique décor and staff dress code, Pique Nique takes one away from the hustle and bustle of Takashimaya into a little sanctuary to rest your soul after a hard day of shopping. Although pricey and with seemingly small portions, their array of finger foods, burgers and meats team up with a quaint selection of beverages and desserts to soothe both soles, souls and voracious appetites very well. With staff that are willing to go the extra mile and ensuring service with a smile, Pique Nique is a perfect place to recoup while you strategize your next romp around the vast shopping centre that is Takashimaya.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J-NdrqdYuaBZnD8zo9pgjg"
  },
  "KJRdMksHzWEVPC0OVkPYqQ": {
    "date": "8/7/2012",
    "text": "I visited the branch at the recently opened J-Cube in Jurong East a couple of weeks ago. Initially I was rather impressed at the decor and set up of the cafe; there was a little raised platform with 2 tables that seats 4 people each in the center of the cafe. This platform was covered in fake grass and had a distinct picnic feel to it. The rest of the seats consisted of an endearing medley of ottomans, armchairs and wooden rickety chairs. Service was a tad slow for my liking, with a perpetual sour face on their staff - not cute! We had the Chilli Fries, which was one of the tastier ones I've tried. The sauce wasn't as thick, meaning we didn't have to fight over scraping our fries on the leftover sauce. The Sticky Date Pudding was great too, but it didn't come with the scoop of ice cream - we had to order it separately. The price was ok only because we shared 3 dishes among 4 people - I would not recommend going there with an empty stomach as their pricing is definitely not worth the heartland mall location nor quality of food! It was nice place to have a short afternoon chat, but then again there are many nicer places. Would not be going back again soon!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05tSDymzhXyvaxO1G24d0g"
  },
  "0wWcSzhsdYmSmEDqsuPJLg": {
    "date": "3/13/2013",
    "text": "it's a small, open cafe that doesn't seem very crowded at the moment, and while I remember they had a glass counter of cake and the like, nothing really seems to have stood out - but then again I wouldn't have gotten anything else seeing as the words sticky pudding were on the menu.it's a small portion of cake and a drizzle of sauce alongside a scoop of bean-speckled vanilla ice cream. not the best or the most innovative (this goes to artichoke for the moment), but it was well-warmed and moist, and not too sweet. a decent rendition, really.photos here: andmorefood.wordpress.co…",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  }
}