{
  "nVNgVD3ZFPhD5xT9Zsjlkg": {
    "date": "10/2/2018",
    "text": "One of the best Turkish resturant in singapore. Excellent atmosphere and service.The food tast is fantastic. We ate here many times and will come again. The Kebab is tasty and melt in your mouth. We ordered Adana Kebab, Musaqa, Hummus, kebab and pita, all are excellent. We liked the fresh bread which served with Hummus. I ordered the food by pick on picture from the menu and thought is lamb, but when came was chicken, eventhough they bring other order for me and kept the chicken just to make the customer happy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmsFNfQTaM7imm0BrAdgnw"
  },
  "7bYm8F1Ngs3fZY6ZRU2bsA": {
    "date": "10/13/2018",
    "text": "Owner takes pride of what she serves and cares about customers.  Food is great and authentic.  Glad to have visited this restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oqJkKfiy1Yo5RJGh0mzSJg"
  },
  "joz2GAYFBbMe00qx_iuj4w": {
    "date": "10/24/2016",
    "text": "This is a Michelin bib gourmand Turkish restaurant near Arab street. Their hummus with their special breads are the highlight of the place. I would NOT recommend the chicken kabob, it tasted like leftover chicken.I definitely will be coming back quite often just for a hummus and bread snack. One of the best hummus I've ever had and the bread is soft and fluffy!Great ambiance if you come by in the evening and the tables are set outside along the street.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "hmq5ZNbOBOKJaQ0UesYx1w": {
    "date": "3/17/2017",
    "text": "Hey guys, i just moved to SG a month ago, i do have Turskish roots and i am fluent also. This food is not worth the money it is being asked for. The food was lacking real Turkish taste since it was missing so many spices and flavors, the Ayran lacked Salt, and our Kebap order was forgotten. Kind regards",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjgQ93PcQGmX9PqIqjwqvw"
  },
  "NrCvBTupqVo0D6-7E17QJg": {
    "date": "7/7/2014",
    "text": "So-so kebabs with asianized-sauce, disappointing dessert. Perhaps I ordered the wrong menu items?The sigara borek is pretty good - think fried Turkish spring rolls with cheese filling. The karisik kebab (mixed kebab plate) was next. Although the meats (lamb, chicken, ground beef) were grilled well, they came smothered with an asian-like brown sauce and accompanied by stir fried broccoli and cauliflower (!). Don't get me wrong, it tastes good but I don't think it's authentic.Sadly, the künefe was also disappointing. The kadaif pastry (noodly phyllo dough) was left too long over the fire and was pretty charred when it came to the table (see photo). Too much of the element with atomic number 6 isn't my idea of a good time.Eh, so there's this row of Turkish restaurants along Bussorah St leading up to the Sultan Mosque, all in competition with one another. The menus were mindbogglingly extensive and restaurants were filled with tourists. Had to pick one restaurant to try. Decided to come here as the menu items looked pretty authentic, but I guess I was wrong. I don't claim to be Turkish food expert, but I've lived with a couple of Turkish roommates and was educated on the food and how to make a mean pot of Turkish coffee. I'm sure Singaporean stomachs can digest the authentic stuff. Off to try the next restaurant along the row.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "trV7BcS4sFlEPNjNON5Yxw",
        "caption": "Photo of Alaturka - Singapore, Singapore. Charred kunefe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/trV7BcS4sFlEPNjNON5Yxw/o.jpg"
      },
      {
        "img_id": "iNvOdSpbbuSU5i6W4iSFhQ",
        "caption": "Photo of Alaturka - Singapore, Singapore. karisik kebab",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iNvOdSpbbuSU5i6W4iSFhQ/o.jpg"
      }
    ],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "Q7T5NOaFpUjx7BjkFv-ITw": {
    "date": "6/9/2013",
    "text": "Sometimes you wander around the Kampong Glam area wanting to have some authentic middle eastern food but alas, some of them do not serve alcohol! Alaturka is the place to go for some really good turkish cuisine and still have a cool glass/bottle of beer to go with it. (Alaturka sectioned their restaurant into 2 areas where those who would like to order alcohol can sit in the other section, away from the main restaurant where they strictly do not serve alcohol.)If you want to truly enjoy a hearty turkish meal here, I would advise to come with a few more friends. This is because the serving is rather generous and between 2 pax, it may be challenging to order a variety.Some staple that will ALWAYS be on my table, regardless of whether Im there with only 2 pax or more, are the HUMMUS and one of their huge platter for two that has a combination of different types of kebabs. The hummus is really smooth and the amount of olive oil is just right in my opinion, thus it not too wet nor too dry. The bread that comes along with it is also exceptionally delicious. It's definitely a great complement to the hummus.As for the platter, it would have been more ideal to share between three to four light eaters as it comes with a whole lot of different types of protein such as chicken, beef and lamb and a serving of veg and rice. The gravy is slightly salty thus the rice (buttery on its own) is a great side to neutralise the saltiness of the dish.To round up the meal, a pot of the hot turkish apple tea will surely do the trick. Slightly sour while rich in it's apple fragrance and sweetness, I simply love the taste of it. Will definitely introduce it to my friends. :)",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "n00yc8iXoxtJXColbBP8Qg",
        "caption": "Photo of Alaturka - Singapore, Singapore. One of the Good for 2 kebab platter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n00yc8iXoxtJXColbBP8Qg/o.jpg"
      },
      {
        "img_id": "bd4wX-5PkmS6KsTG9bfMuw",
        "caption": "Photo of Alaturka - Singapore, Singapore. Extremely yummy Hummus!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bd4wX-5PkmS6KsTG9bfMuw/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "6Cz-ypN8InlfpOvdclEdPg": {
    "date": "5/3/2015",
    "text": "I decided to eat here based on other Yelp ratings. The place has an inside and outside sitting area. The decor is modest, but nicer than most in the immediate area. I ordered the Meze platter (which offers small amounts of 5 different speciality dishes), I also ordered hallumi cheese and lavaz bread. (Plus a glass of house Merlot - booze in restaurants is not common on Arab street).Overall the food was okay. Nothing memorable. Total bill for 1 was SG$58",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jnC1CcEF9KjCs2gw82SfSQ"
  },
  "hYT7zMVb_dSrUYa1vt-YhA": {
    "date": "11/25/2016",
    "text": "Been here many times today was an ultimate surprise.   Quality of the food was absolutely horrible.   Apparently the chef was not around so some in the kitchen is not doing a good job.   Humus of all thing came in sticky like peanut butter.   It was not smooth and creamy as it was before.   had a grilled platter and everthing was burnt and dried up.   worst thing is the food was cold!! how is that even Michelin standard.   i will give then one more chance hopefully they get it right if not i am gone for good.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "bNXPTxO6etBRrurW6aJdwg": {
    "date": "1/24/2015",
    "text": "Great to have something different in Singapore...We really enjoyed the hummus, the halloumi and the lava bread as well as the barbecued fish in garlic and lemon sauce - yummy!Would definitely recommend and will be coming back :-)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RmMbDOMp_BFS_kllQbRNxg"
  },
  "PKmfkcZfnUmdYVnYH6YYUA": {
    "date": "2/28/2016",
    "text": "Delicious Turkish food with some licalized twist, boss is from Izmir, cook Turkish, friendly staff who has  no  understanding of Turkish culture (naturally)....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTsACAkpKKvq2asW6PoVwQ"
  },
  "NMiHSWRoNIpflJAB_9i1oQ": {
    "date": "7/15/2012",
    "text": "What I love: The food & ambiance is great. The place is small, a little narrow and tables are close together - but it has a nice homey feel. The food is yummmmy! Rice and Kebabs are my fave, the Adana Kebab, and their traditional Turkish bread, the Sarmusatli & Ekmek. There are not too many Turkish places at Arab Street, so it really does stand out.MUST HAVES: The Musaka, eggplant & lamb stew, Omg, I'm like literally aching for one now. Hahahaha. The Ali Nazik is yummy too.Desserts: Baklava and Kunefe is REALLY REALLY yummy here! Especially the Kunefe!What I don't love: Prices. It's quite a pricey place. But the food is good. It's an average of $18-25 per pax, just for the mains. So, if you're getting a starter, main, drink and dessert, it would range from $30-35 per pax. So, it's pricier than other places in Arab Street. But it's a nice and romantic place - great for a date.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s4pQupJLMm6ZDzUrbP0IUw",
        "caption": "Photo of Alaturka - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s4pQupJLMm6ZDzUrbP0IUw/o.jpg"
      },
      {
        "img_id": "D7esfELuTnqz91lmN83org",
        "caption": "Photo of Alaturka - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D7esfELuTnqz91lmN83org/o.jpg"
      },
      {
        "img_id": "fWdhrrcJIzmA99ru7aIyTQ",
        "caption": "Photo of Alaturka - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fWdhrrcJIzmA99ru7aIyTQ/o.jpg"
      }
    ],
    "user_id": "0jmAZwCwQN9ByyWsLx7khA"
  },
  "7-jqI-IID1Mg3IXt21pDDw": {
    "date": "4/8/2014",
    "text": "This is my go to place for Turkish Kebabs & Middle eastern fare in Singapore. The apple tea (hot) is terrific & their breads are fantastic, fresh & rather delicious. The kebab platter or rack of lamb, beyti kebab, shish tawouk or adana kebab are my go to options when it comes to ordering food. Also order in a portion of their Baba Khanoush (egg plant tip) and some Lavache if you're in the mood for some piping crispy hot bread! The service is attentive, cheerful & take good care of you (small gestures such as immediately topping up your glass of water matter). They also held on to my hat for 2 months & returned it to me when I visited them next. A great place for a quiet dinner with a small group of friends. Make sure you have a reservation if you go on the weekends.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1RVnBOq0xCCelu0QPcUjRw"
  },
  "f7MZ56H05vk08u2FMAualQ": {
    "date": "1/10/2016",
    "text": "Great food but with the worst service I've ever had. I will definitely never go there back again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIcM9j0nRiJkZNXVdDz1nQ"
  },
  "xoWzcQyuxi4VVKrIZPo0Ww": {
    "date": "1/11/2014",
    "text": "Asianised with funny bbq/tomato sweet sauces, broccoli and cauliflower side dishes and very expense for what it offers (and what it does not)There is always a first time and off went mine.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJvfHTYDf3s9D8pY8rrUcQ"
  },
  "ozZCmY7UfCRL7iZ1BLUVxA": {
    "date": "7/15/2012",
    "text": "There are lots of places to get kebabs in the Kampong Glam area, but of all the various Middle Eastern food places to eat, Alaturka is probably my favourite place to have kebabs and hummus. The menu is quite extensive, and the food is quite consistent, if a little bit pricey. Bring your friends along, this is where you want to share your food!I particularly love having a nice hot teapot of Turkish Apple tea when I have my meal, no matter how hot it is. The apple taste is nice and strong and the tea is so flavourful, really yummy! The coffee is served the thick Turkish style if that's what you like.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIcZfbtAEHNoWqre4yHcPw"
  },
  "sSzhdu9rmfc48wKBWKotRQ": {
    "date": "5/30/2014",
    "text": "Great ambiance. Good food. Chicken Tavuk Sis and Borek were great! Bread was good. Hummus and Haydari were just okay.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iSzHCbznNVoYRnUqDT1GJA"
  },
  "zNTKhLZ3XUGMvU5KwIBJtA": {
    "date": "7/22/2013",
    "text": "Delicious Turkish food off Arab street. Personally I loved their chicken or lamb beytti, but recently they changed from grounding the meat to serving it whole. It was more moist and delicious when ground. The hummus is great and has delicious bread, I just always want more for how much humus you get :). The babbaganoush, yes my spelling needs help there, is mediocre. Just not as flavorful as I like. Finally, the dolmas need more rice at the very least. I also prefer it with ground beef as well. Definitely recommend though if you are in Singapore and craving middle eastern food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eEqC9RndEAYXLBnqofYBCA"
  },
  "17TVTW9uTLdRfudRiuqFoA": {
    "date": "10/7/2012",
    "text": "We ordered the lamb and cheese Turkish pizza but they served us the chicken and cheese one instead. To their credit, they offered to replace it but my dining companion didn't want to waste food. The chicken one wasn't great, we couldn't finish it. The portion was just too large, and it didn't taste particularly special. The chicken kebab was good though, juicy and flavorful. Wish this serving could be made larger and the pizza serving made smaller.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D6-pwyZgXy8wxFy-NbCWCw"
  }
}