{
  "K1XW1jdwHu6bHKPXbLFb4g": {
    "date": "3/12/2015",
    "text": "Food is quite nice and the Kiwi Burger is delicious with the beef patty fairly moist and not to well cooked.There is also a section of smaller portions which are like tapas. Great for sharing.The service could be improved as the attentiveness is not quite there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJf90zf0DMbdu-1LNQx6Vg"
  },
  "9s-81E6hfzEDQ6tBuFbz9A": {
    "date": "12/30/2014",
    "text": "Only a couple of tables were occupied when we got there around 2+pm on a Saturday. The reviews on Yelp looked positive and so in we went. The food was sadly just average and the price has increased after the renovation. I had the eggs benedict ($16, up from $12) and it was really not good. The muffin was very dry and hard that I decided to just eat the eggs (nicely poached) and ham (very thin slice) on its own. The salad that came with it was so-so. The hollandaise sauce was thin and a bit tasteless.The risotto was slightly better. My friend ordered the regular portion but it looked tiny in a big plate that we thought it was a \"small plate\" portion. The marmite soldiers came in a basket and was topped with cheese, making it quite a salty affair. The flat white I had was bitter. The tea looked better, it was served in a clear teapot. Maybe the average food and higher prices explained the lack of customers when we were there. It is definitely a place I will not want to patronize again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_-aFmP_k5Di_s-13-E17mA",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Birds on ceiling",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_-aFmP_k5Di_s-13-E17mA/o.jpg"
      },
      {
        "img_id": "jpWFR7phcyQnMzHZ5tqJrA",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jpWFR7phcyQnMzHZ5tqJrA/o.jpg"
      },
      {
        "img_id": "lUz8yLisVf-ubJCifyPayA",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Flat white",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lUz8yLisVf-ubJCifyPayA/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "0mk8plKrmN-SOlTX_JeTYA": {
    "date": "2/20/2013",
    "text": "It is  a small, comfy café for tasty dishes at reasonable prices. It has  an inviting interior and a charming patio by a large, artistic sculpture.  The wait staff is very friendly and efficient. Of course, it's also a very nice place for coffee and patries. Its coffee prices are  comparable to Starbucks and Coffee Bean, e.g.,  $3.70 for a small brew. Back in late Jan and early Feb, my wife and I, along with a couple of friends, came here a few times and really enjoyed its delicious Seafood Risoto (S$20), Jay Risoto (16),  Lasagna (16), and Tuna sandwich (12), Hamburger(12)... The wine here at $9 per glass during Happy Hour was a little high, but certainly a lot better than $18/gl normal price! Well, alcohols in Singapore are generally pretty high indeed, even during Happy Hours! We heard that Blackbird is quite popular for brunches, as well as for take-outs. Next time in Singapore again, we'll give its brunch a try, too. BTW: - Beer in Sungapore is quite expensive. A case of 24can pack of Tiger Beer for S$48 from a 7-11 store is considered a bargain!- However, at\"Kopitiam\" (a very NICE food court), one can get a LARGE bottle of beer at $5.80! Wow! [-See separate teview on Kopitiam]. Jan 2013",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "t4s-0wSUZNx_OO1eLZgM9g",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Elegant lounge in the hallway to gallery",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t4s-0wSUZNx_OO1eLZgM9g/o.jpg"
      },
      {
        "img_id": "dGKXOfQYHPhCurso5YhCTg",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. An attractive, comfy interior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dGKXOfQYHPhCurso5YhCTg/o.jpg"
      },
      {
        "img_id": "h_cOlSIWMIwfwokU4A7MuQ",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Part of the charming patio by a gigantic sculpture",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h_cOlSIWMIwfwokU4A7MuQ/o.jpg"
      }
    ],
    "user_id": "fZY97UjlP-iv35beOl_OfQ"
  },
  "Rw0s1UsxMRu7-lLJ0vl_Gw": {
    "date": "9/2/2012",
    "text": "There is a brunch menu which is served from 10am - 3pm. Made a reservation to ensure we get seats because i heard that it gets pretty packed on the weekends. The Brunch Menu is pretty limited- Big breakfast, Eggs Ben, Ham & Cheese Omelette, Croque Monsieur, Buttermilk Pancakes, Bread Basket, a couple of sandwiches and salad. There is also a choice of 1 Main of the day. The prices are reasonable, all items priced below $12 except for the Big Breakfast ($18). However, several items were unavailable that morning, so it really depends on your luck.I went with the Eggs Benny ($12). I'm quite boring when it comes to picking items for brunch. It's usually Eggs Ben or Big breakfast (due to its sheer variety). 2 perfectly shaped poached eggs came dressed with a light hollandaise sauce on top on the crispy muffins which were perfectly toasted. Despite the small servings, i was extremely satisfied after my meal.Buttermilk pancakes weren't that good. Hits and misses for this one.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "FVimAdcn3mt-_JLook6MPw": {
    "date": "7/7/2015",
    "text": "Well, tried twice to eat here at the recommendation of my daughter.  First time, the place was closed.  The second time, we were told the kitchen was closed and we should come back at a later time, which we were not able to do as we had a flight.  According to my daughter, she has eaten there multiple times at different times of the day and she is shocked to see the price increases, as they seem to have increased since the renovation as well.  I don't try that hard to eat at a restaurant as there are so many excellent options in Singapore - this one is way too far out of the way and not worth the hassle.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1ciJDWa9zy87K7FhjIV8A"
  },
  "g_fhSLXlrQaKaTbupOThiw": {
    "date": "9/5/2012",
    "text": "Blackbird is a cute little kiwi bar that's situated in between Plaza Singapura and The Cathay. It's simple and cozy, with comfortable chairs and a relaxing ambience. My favorite spot is in the alfresco area, where a nice breeze blows through and rustles the plants around.Happened to pass by on a weekend and decided to drop in for brunch as they had a brunch menu. It was fairly quiet - there was only 2 other couples seated inside. The cafe lattes we ordered were satisfactory, though the beans were a little tart and acidic for my liking. We ordered breakfast sets and tried the generous serve of Big Breakfast, priced at $18. It came with a mediocre sausage, fantastic bacon, your usual baked beans, good bread, and interestingly, a potato croquette. I was more than pleased with my meal here.I also tried the eggs Benedict my friend ordered, and it was decent, thought a little bit on the small side. It is served with a large, luscious salad on the side though. It was very fresh and came with a tiny bit of vinaigrette dressing.Service here is pretty good. Staff are attentive and do their best to keep you happy. Nothing really that special here, but I do like it, and will be back for a quiet afternoon of reading,should I pass be in the vicinity.:)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GRSEcL1hYND8-eVaiJvNCg",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Exterior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GRSEcL1hYND8-eVaiJvNCg/o.jpg"
      },
      {
        "img_id": "fcIQwKl0ZgXmQJNqS8Hv6Q",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fcIQwKl0ZgXmQJNqS8Hv6Q/o.jpg"
      },
      {
        "img_id": "4gRnpczHhwRlQG6DRwME0w",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Eggs Benny with ham",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4gRnpczHhwRlQG6DRwME0w/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "jU2khuFLr0lAEGgYZhQPRg": {
    "date": "5/4/2015",
    "text": "Quality food and service. Burgers there are great, so are the salads and pastas. Their risotto is pretty well done too. Coffees are also well made.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M4paOnygnrAHET5MkcdJSg"
  },
  "WvibNGBTI5QLo-4o_N1txQ": {
    "date": "1/8/2013",
    "text": "Cosy place for a brunch (would love to read a good book there on a lazy sunday morning). Clean, sleek and modern interior. 1. Eggs Benny (ham) - Portions are pretty small. - Eggs are poached to perfection. - Overall pretty standard. no surprises. 2. French toast with bananas (my friend had this dish)- The french toast looked like an oatmeal bread covered in cereal. Didn't look anything like the usual egg-drenched ones. This one was dry and crispy. - Banana was served on the side. - My friend said it was pretty decent but the portion was too big. 3. Coffee - ok",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mLNFKajc56CqeZA6WkgREQ"
  },
  "DNxQA2KGQwnjc6XvecHD3A": {
    "date": "8/24/2012",
    "text": "Was looking for a nice place to chill out before going to a concert at the nearby Fort Canning Park, and my friend and I decided to give Blackbird cafe a shot - its away from the hustle and bustle of Plaza Singapura and Cathay, sitting in between the two malls right in front of The Luxe condominium.It's got a simple cafe vibe, further inside is actually an art gallery but not sure if its open free to public to ticketed. The menu here is also pretty simple, it's got soups and sandwiches and finger food plus coffee and short list of alcoholic drinks like wine and beer. My friend and I shared the mushroom soup and had some iced latte and iced mocha. The mushroom soup is definitely above average, you can smell the truffle oil in it (if you're a truffle) which is very alluring.The coffee wasn't something to rave about but it was a really good caffeine kick on a hot day.Final verdict: A nice quiet cafe in the middle of busy dhoby gaut.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-5fabRhx9DGwQrM7MIgVvA",
        "caption": "Photo of Blackbird Cafe - Singapore, Singapore. Iced mocha, Blackbird cafe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-5fabRhx9DGwQrM7MIgVvA/o.jpg"
      }
    ],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "E39H1263WFIGn_wdg2Zrgg": {
    "date": "9/1/2012",
    "text": "The blackbird is a somewhat casual cafe with its dark black walls and tables without table cloths. The staff there did not seem to work well with the kitchen staff sometimes as they were not aware if the particular food item was still available or not.The wagyu beef was amazing as it was juicy and tender, however i thought that it was a little over priced when i got the whole set it came up to about $40. I did like the sides that it came with which were the vegetables and mash potatoes and i think they were one of the best i had tried so pricey amount aside, the food was good.Service was on the ball too and even the new staff knew how to handle some difficult customers. Especially when they did not know how to answer certain questions they went to ask their manager for the answers rather than saying no so that was a good point.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5giEryaio2xzYX6qKraPQ"
  },
  "qZ6po5egS5qEyLc71zDi6w": {
    "date": "8/26/2012",
    "text": "Visited this cafe purely because we needed a place for brunch and this is one of the most accessible in terms of public transport by train to Dhoby Ghaut.I met my girlfriends there at 11am on a Saturday. The cafe was rather empty. However the air conditioning seems to be spoilt as it was very warm inside. The menu is also half of the full menu with only breakfast and sandwich items served.On the food itself, I had a hankering for pancakes so I ordered that. Bad decision - the pancakes turned out to be cold and hard. They seemed to be the type you defrost and heat up from boxes. The butter did not even melt when i smeared it on! I must have been spoilt by years of Mcdonalds hotcakes advertisements. The margarine needs to melt! The staff was very kind to help me heat it up a little bit more though. Being dissatisfied with my pancakes I decided to add on with some scrambled eggs, which turned out to be only $2 additional! Wow, now that's a good deal. The scrambled eggs were much better - fluffy, not too watery but still creamy smooth.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nWcII-Fqn5Hagfib-H76w"
  },
  "2snJl-H746b8WlTRun5qqg": {
    "date": "12/29/2013",
    "text": "surprisingly good brunch food at this hideaway near the cathay. the food was good, prices reasonable - a much better option than one caramel that was previously here, in my estimation. and, it's not overrun by hipsters or noisy teenagers - which makes brunch here the relaxing meal it ought to be.we started with an avocado milkshake - and hello there, it was gorgeous. incredibly thick and luscious and probably hedonistically luscious - but it's a vegetable, right - it was not-too-sweet even after you stirred in the thick dark gula melaka (dark palm sugar) they poured over the top.I wasn't paying an incredible amount of attention to the mains after I caught sight of their cake-and-dessert counter (my sweet tooth is insatiable), but they did us well too. a sandwich of pulled pork and beetroot slaw came on pleasantly-chewy ciabatta on a stone slab, and that green salad on the side had just enough bitterness to cut through. it's not a neat sandwich by any means - there was sauce and coleslaw dripping throughout bites, but it was plenty tasty.as was my chicken salad, actually, though it came was a rather generic too-sweet-and-too-thick dressing that clearly got squeezed out a bottle. I got the dressing separate, as always, so it didn't matter - but you might want to watch out for it. we ended up too full - darn that oh-so-delicious milkshake - to have more than one dessert, but we rather lucked out with our choice of tiramisu, served in a large mason jar. it was a good creamy end to a decent meal.it's a good choice for a cafe in an area otherwise sparse of choice, and it doesn't hurt that the food is decent and prices are reasonable. service is a little inattentive - friendly when it arrives, but they spend plenty time rather absently smiling at everyone without really noticing when our hands were raised.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  }
}