{
  "K13Lzl7MCigz7UED_ED8Aw": {
    "date": "9/29/2018",
    "text": "I guess this is as good as it gets in Singapore.This appears to be (east) Texas style barbecue, and I see the smokers parked at the back, ready to go. The brisket and ribs are pretty good, however the sides are generally a hit and miss. Beef brisket is cooked over wood and served dry with sauce on the side.I'm a little partial to Kansas and Memphis style barbecue (dry rub), but I definitely end up here when I have a craving for American barbecue. Please skip the other places like *cough* Morganfields cos this is definitely far more legit.The place is named after Elliot Decker, the chef/owner, who learned the ropes in Austin.4-stars relative to what you can get in Singapore, 3-stars if compared to other places in the United States. Can't complain, otherwise you'd have to get on a 22 hour flight back to get your barbecue fix.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "dCloTbEYOSCtt093FO-V1w": {
    "date": "7/14/2018",
    "text": "Brisket sandwich was just ok.  Room temperature food. Don't look at the mac and cheese on the menu above the bar.  It doesn't let you know they put sauce on it (ruined the mac and cheese altogether).  My husband ordered the smoked old fashion, it was tequila () $20 drink. I would not visit again.  Best thing I ate here was the \"miniature\" fries.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Epxf1gcKetJlspIfA7Xw4Q",
        "caption": "Photo of Decker Barbecue - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Epxf1gcKetJlspIfA7Xw4Q/o.jpg"
      }
    ],
    "user_id": "v2-NxiEKYJNT70NK9PjeRA"
  },
  "hfBwEAJ4BBumflaHKLO2mg": {
    "date": "8/2/2017",
    "text": "Pretty good BBQ. Although it's not my most favorite (I prefer ribs a little chewy and served with a spicy vinegar sauce) it still hits the spot if you're craving a meat fest. The mac and cheese come with Louisiana hot sauce but you can ask to get it on the side. My only wish is that they would serve some other veggie sides besides kale salad. Pulled pork was a hit and everyone liked the brisket too. Would definitely recommend if you've got a hankering for some Que in Singapore!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "e-kFl3RHyqynyhwYgp4D1Q"
  },
  "nPcXZ5dWEnY12v0tqMVrdw": {
    "date": "7/12/2018",
    "text": "Okay so here goes.   I'm giving 4 stars due to the staff and the effort!  Not sure what I expected but being from the US and in particular Texas I know Texas bbq and sadly this is not it!   The brisket is tender and that's a big plus but there's no flavor, no smoke ring and left me wondering what wood if any was put on the meat.   The Mac and cheese was okay but leave the bbq sauce off.  On the plus side they have an ample beer selection including a Texas standard \"Shiner\".",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKoVsuyTZ2r4f9P4fD_Tzg"
  },
  "R8aX5OeqWT18DVmxa2VjJg": {
    "date": "1/14/2018",
    "text": "Eaten here a dozen times. Best BBQ in Asia, as good aany in Austin (way better than Dickies allOver the state I'd Texas). Burnt Ends and brisket are heaven sent. Easy to get seated on a weekend evening usually. My favorite casual dining spot in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vH5Z1-pp49t1MwXOBMzGtA"
  },
  "hX3LaCLWT1PMNqncvDvKmw": {
    "date": "4/11/2017",
    "text": "Probably the closest thing to Texas bbq in Singapore. But reviewers who deem it \"authentic\" are in desperate need of new tastebuds. Decker Barbecue is worth a visit. They take great pride in their work, and it shows through the well executed smoked meats. I particularly like that they use a variety of local wood (lychee last time I was there) to impart flavor. Having said that, I don't know if the food at this price point warrants multiple revisits. The experience brings you close to the familiarities of proper bbq, but nothing puts it over the top. You leave full, but not entirely satisfied. I've been here twice, and frankly wouldn't come back unless I had a rare hankering for Southern bbq. FOOD (order like this for 3 pax): - plate for 2 (brisket, pulled pork, pork ribs + beans, mac & cheese) // $76- 100 grams of pork ribs // $9- side of coleslaw // $6SERVICE: - fast- knowledgable staffPRICE: - $30 / person (not including drinks) OVERALL: - best for groups- come earlier than later; do run out of meats- decent beer selection",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUAiW8Lcdla5Ii53kV6RFw"
  },
  "EbWkH5iwl0alCVQ12cTAoA": {
    "date": "11/15/2015",
    "text": "Barbecue means different things to different people around the world and even within the US the answer as to which barbecue is best really can depend on where you ask the question. Texas? Kansas City? Memphis? Carolina? All would claim their barbecue is best. Of course none of this matters when you live in Singapore and develop a craving for some, any good US barbecue joints. Yes, there are a few but this latest place may claim to be the best yet. It really is that good. We went looking for it having read a posting on another website talking about Decker Barbecue which had only just opened behind Boomerang at Robertson Quay. We arrived to the wondrous  sight of healthy portions of delicious barbecue meat being served to patrons in a simple open air restaurant. The menu is simple as you can see from the photo. We ordered a couple of Brewdog beers (the only non Non-American beer  that they stick) and strode to the counter to order. And then heartbreak as the staff started to put Sold Out signs on the Brisket. Denial!Disappointed but not broken we ordered turkey with pulled pork and chopped beef with the two side dishes of Brisket Beans and Potato Salad. Service was fast and very friendly (in truth a rarity in Singapore). However good as the service was, it was the quality of the food that was the star here. It was simply fantastic. The sliced turkey was very tender and the right side of moist. The chopped beef had some spice with great flavour and the pulled pork was the first one that we finished, so that should speak for itself. The brisket beans were great with enough brisket in to give us a hint of what we were missing, with the potato salad trailing behind a little in the flavor stakes. From talking to Elliott and Min,  the partners of the restaurant this place is clearly a labour of love. As their first week in business at the location finished, more sold out signs went up. Disappointing for them and the customers who came along only to be denied. For sure they will make sure this doesn't happen again and for sure we will be back to try the brisket the next time.  For those craving some fantastic Barbecue, don't miss Decker.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "OFxFN_Mke_dxla9htyxomA",
        "caption": "Photo of Decker Barbecue - Singapore, Singapore. Located behind Boomerang at Robertson Quay",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OFxFN_Mke_dxla9htyxomA/o.jpg"
      }
    ],
    "user_id": "i2G5mQrL1g_wgSuL8DGExQ"
  },
  "_6Og7Pt5qmOnXlY45LzA7Q": {
    "date": "9/4/2016",
    "text": "Let me explain the three stars -- because based on food alone I'd give it a solid 4, if not 5.. but hoolllyyyy shit this place is expensive!  I got three slices of brisket with sides of mac & cheese and cole slaw and an iced tea and it came to S$60... wtf.  That's downright offensive y'all. If you're rollin' in cash, this place is legit, though.  The brisket melted in my mouth.  I didn't need any sauce with it, but the raw onions paired really nicely.  I loved the mac & cheese made with some really sharp cheddar.  I love coleslaw so I was bummed I didn't really care for theirs... maybe I'm just a fat ass that likes their coleslaw a bit more soupy like KFC's (I'll see myself out.)Sadly I won't come here again due to the price.  Sad trombone.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kxr5ZrFUgQLDMOUDPlqTGg"
  },
  "B0cOpesg8oovcxoeJiah0Q": {
    "date": "5/22/2017",
    "text": "Buttery soft brisket and fantastic ribs. Love this place! Wish they had better beer on draft but their fridge selection of craft beers is decent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z7rZ6eRJotUFwT1LI50DLw"
  },
  "E-aHftdf9eenN2gB3pKoCA": {
    "date": "1/31/2016",
    "text": "Let's start from the best part:  the food is actually really tasty! Five start easily just for that. We had spare ribs and brisket sandwich and both were amazing......but.  The service is horrible. Ok, I get the casual ambience, but why does everyone need to stand in line until their food is ready?  It's just a broken system (and a recipe for long lines... I wanted 20 mins for three people ahead of me, all with large orders). Just take the order and let people go!  And second, the prices are outrageous.  $93 for two people (with two beers ...two total, not two each!) You are seating outside, by the back exit of Boomerang, not a place that could justify that prices!Drop the prices, and improve the service!  Because I live next door, and really liked the food... :-)",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "aAQsf40paHmppDx-m5hPJA": {
    "date": "2/6/2016",
    "text": "Food is fantastic.  Lots of attitude from front counter owner staff. IF THEY FEEL THAT YOU HAVE NOT ORDERED ENOUGH.  Expect to spend at least $45 two or you will experience their negativity.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6SBedMGc93C6CQJ8trzag"
  },
  "qIsbEp8_OebCizZfaHrGSQ": {
    "date": "10/17/2017",
    "text": "The Brisket was top notch. Tasted just like real Texas Brisket that I smoke myself with mesquite. I will eat here every time I am in SG.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RY4651-ZPcocwwRe-r7UsQ"
  },
  "xsEHKaSE43uiJX6prECCtQ": {
    "date": "4/6/2017",
    "text": "Pork was good, chicken seemed a little slimy indicating it was old or undercooked,Tea was ok, not real strong, kale salad was pretty good.  Potatoe salad was good.30 grams is way too much food but they push the portion. Had the ribs the other night and they were very good.Guess it depends on. The day and what cook you get smoking the goods!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8KqasuAEKRdiIPWc32VybQ"
  },
  "ZAo9UIpFRtU7pCxZCMcajw": {
    "date": "7/28/2016",
    "text": "$29 for a salad wrapped in aluminum foil and a dry brisket sandwich. I will not be going back. I'd rather order Burnt Ends sanger and a butter lettuce salad (in a reusable plastic container) for $30 on Uber Eats.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncQakDQwswLutRIYumgl_g"
  },
  "8K3qxSWJLqkbg4mpPNkgKQ": {
    "date": "7/15/2016",
    "text": "A truly Texan joint in the middle of Singapore. Prices are on the higher end and options are very limited, however the brisket and pulled pork are rely good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C54YrKKqOdMIdNrzOBgRCg"
  },
  "Ry2jR_-IrvElrw873eGoEQ": {
    "date": "4/3/2016",
    "text": "This Texas girl gives Deckers 5 stars! Hands down best BBQ in Singapore. They even have your grandma's banana pudding.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7uUYUYhf1klhOG5GS8pNew"
  },
  "EZAUB4Z56ok-YpXbnLAZxA": {
    "date": "12/6/2015",
    "text": "Fantastic pulled pork! The sauce was slightly spicy, perfect. Service was great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UErVlWIYHbCXvfZIMs6bsQ"
  }
}