{
  "Wdx337vJIexOBonLsPL-1Q": {
    "date": "8/23/2018",
    "text": "High tea at Lime Restaurant I adore high tea and unfortunately there aren't many choices where I live in California.So whenever I visit Singapore, I have to have high tea at least once.My friend made a reservation at Lime Restaurant at Parkroyal Hotel on Pickering Street.Their high tea set starts at $44++ for one serving of coffee or TWC tea.For unlimited servings of tea/coffee it's $50++.Not pictured are the scones which to be honest were a bit disappointing - the sides were too hard but luckily the inside was still nice.This was the one I was most curious about - \"an expression of Nasi Lemak\". Nasi Lemak, if you've not heard of it, is a coconut rice dish usually served with fried fish and peanuts, egg, cucumber and a really good sambal chili. This ball was a good representation of all the flavours of Nasi Lemak. The rice ball was coated with peanuts and had a dollop of sambal on top. Their cute little carrot cake with a white chocolate carrot on top. The carrot cake was nice and moist.There was also a yummy Peking duck profiterole, a coconut pandan tart, a chocolate peanut butter cup with Gianduja chantilly cream. As well as some open faced sandwiches which weren't anything to rave about.But my favourite was probably the passion fruit meringue tart which unfortunately I didn't get a good photo of. Funny thing is that I'm not really a fan of passion fruit but I loved the refreshing tartness of the mousse which was silky smooth and topped with a perfectly light meringue. And the pastry was just the right thickness and firmness.High tea and good company made for a delightful afternoon.Originally posted at reallifereading.com/2018…",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7qBqHOcivebxIo44eW2NoA",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7qBqHOcivebxIo44eW2NoA/o.jpg"
      },
      {
        "img_id": "3qIPzG2_7jdbfcrbGC1NNA",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3qIPzG2_7jdbfcrbGC1NNA/o.jpg"
      },
      {
        "img_id": "JNCepUpfdb1NEuZ3HC4QFw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JNCepUpfdb1NEuZ3HC4QFw/o.jpg"
      }
    ],
    "user_id": "581xoJ0Ulr7a1XseVaZ2WQ"
  },
  "eKrR0R1TTH2xza2mReDg2Q": {
    "date": "4/12/2016",
    "text": "Pricey but well worth it. We've had the dinner buffet twice and a Sunday brunch. Typically we find ourselves here when we don't want to walk out in the blistering heat and humidity. This place is located inside the hotel we were staying at.What I love:+ foie gras (my first time and it was extremely tender)+ lobster Benedict + ahi tuna + curry + pineapple fried rice + tri tip+ paratha, made to order + their cheese selection + dessert crepes, made to order+ nitrogen ice cream+ etc. What I found tough and chewy was the lamb. Lots of Western dishes but I did not try any.Service is unpredictable but the chefs behind each station were friendly, welcoming, and detailed. If the dish requires cutting, cooking, whatever.. they'd make sure that they plate it nicely.",
    "rating": 4.0,
    "rated": {
      "useful": 16,
      "funny": 16,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "oSOm9iI_R6SJJ5isZ5bUHw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore. My 2nd plate of desserts.. nitrogen Bavarian ice cream, Nutella crepe, and chocolate mousse cake. Yum!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oSOm9iI_R6SJJ5isZ5bUHw/o.jpg"
      },
      {
        "img_id": "M1Ztb3rmJPL6FJ56UBcNCw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore. Lobster Benedict, FTW!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M1Ztb3rmJPL6FJ56UBcNCw/o.jpg"
      },
      {
        "img_id": "sDAyXmipmY-Zjmp79zuwrw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore. Trying Foie Gras for the first time.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sDAyXmipmY-Zjmp79zuwrw/o.jpg"
      }
    ],
    "user_id": "0QeJC2inz6P-OVzROU_LNw"
  },
  "UHjrhO31igJSJfEV1H2Fhw": {
    "date": "12/4/2015",
    "text": "We came here for an end of year work lunch, and got the Christmas buffet. The place came recommended by a friend of my colleague who is a chef. We all left happy. There was another larger company having their end of year lunch at the same time, and they looked like they were having a good time.The decor at Lime is on the casual side, which is perfect for our occasion. Walking in, you see the desserts all lined up and it looked really good.Compared to other buffets, Lime's thing seems to be appetizers and dessert. They had three long tables of desserts, and another three long tables of appetizers. There was a station for raw food like sashimi, but it's not a highlight. I was impressed by the selection of shellfish- they had more than shrimp, mussels and scallops. There was a meat station with turkey, ham, wagyu beef, braised beef, lamb, duck and chicken, that also has sides of brussel sprouts, glazed carrots and caramelized pearl onions. The onions were absolutely delicious. I liked the attention to detail. Some places give you the meats but not the sides. There was a shared Indian and Chinese station. I didn't try the Indian food. The Chinese food was okay. The appetizers were a standout. There was a corner with Mediterranean dips - hummus, baba ganoush, pita, various salads. There was a long table of bread, cheese, olives and meats. The meats were excellent. I had the blue cheese and it was good. What really stood out was the loaf of bread, which was very soft and tasty. It's hard to find good bread in Singapore. Paired with the echire butter, it was amazing. Everyone tried the bread and butter, and some of us went back for seconds. And the salad bar looked decent, although I did not eat there.The desserts were beautiful works of art. Cakes, puddings, mousses, ice cream. I highly recommend the mini macaroons, which are free. The large ones in the showcase are sold separately. I didn't try the nonya cakes, although my colleagues liked the durian pengat. Their chocolate fountain was orange chocolate, but I had no room to taste it. I'm definitely coming back again with people whom I know like trying many appetisers. Some buffets are for seafood, and others are for their mains. Lime's offerings are great for people who like to graze.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HeR31vQvmG2CifUU8rtV2A",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HeR31vQvmG2CifUU8rtV2A/o.jpg"
      },
      {
        "img_id": "Jr_xkh5FgCTnBoccRSSCwA",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jr_xkh5FgCTnBoccRSSCwA/o.jpg"
      },
      {
        "img_id": "ZbxzoxxAGU9q5l3K7JrhLQ",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZbxzoxxAGU9q5l3K7JrhLQ/o.jpg"
      }
    ],
    "user_id": "_g9zTyHT5Z-1_b-oWhrP3g"
  },
  "u0iHJXMf1vcoSQhz1RZMcw": {
    "date": "7/1/2015",
    "text": "SG50 is probably the most important holiday on our national calendar this year. And as befitting for such an important festival, it's time to go \"loco\" over lobsters with Singapore's FIRST local Lobsterfest at Lime at PARKROYAL on Pickering. On every Wed, one can tuck into mouthwatering Maine Lobsters in various styles ranging from lobster gratin to Peranakan Nyonya LOBSTER laksa!If the natural sweetness of this delicacy is what you are hankering for, you may like to park yourself next to this station. In fact, this is my favourite way of enjoying lobster, with just a bit of horseradish and red wine sauce. If Lady Luck is with you, you might even pick one with a bonus lobster roe! Moving on to the hot food section, the unanimous crowd favourite was the Singapore Chilli Crab Maine Lobster, judging at how frequent the giant serving wok was emptied every time a new batch is furiously cooked and served. The sauce is luxuriously rich and not too sweet.But something more outstanding was the Wok-fried Black Pepper Maine Lobster that boasted good wok-hei and excellent aroma imparted by the use of curry leaves. One dish that might ring in some nostalgia is the Maine Lobster Kam Heong style. Meaning \"golden fragrance\" in Cantonese, this is said to be a Malaysian stir fry dish whose sauce base is a magical concoction of fiery bird eye's chilli, curry powder, curry leaves and soy bean paste. However, the gravy was short of the necessary fragrance that would imbue this dish with a sharper character. Do keep a lookout for special lobster dishes such as lobster pizza and lobster bisque with cognac as you claw your way through the extravagant buffet spread! Who knows? Maybe you will be luckier than me and catch a lobster dessert on your visit!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "HJ0Qw6v3t3ENJ9Xy57-0yA": {
    "date": "7/28/2016",
    "text": "This place is meant to be one of the best hotel buffets in Singapore.  Esp with a focus on local foods vs a western spread of roasts and baked pasta.  For $52 SGD on a Saturday lunch I would have eaten better at almost any place else.  While the room and hotel design is very \"urban green\" and it's nice to see the open kitchen that doesn't make up for mediocre food options, poor service and an underwhelming buffet experience. Funnily enough the space is called \"Lime\" and their signature drink, a non-alcoholic limeade, is not included in the buffet price!  Go to Straits Kitchen or the Mandarin Oriental.  Save your money and make your own limeade folks!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_DmfFaGGZ7GM4GzoEUy5ow"
  },
  "9dN1jOMTkhf9lXUlQE6LyQ": {
    "date": "6/22/2016",
    "text": "Amazing service, great food and outstanding selection of items. The lime drink - their signature - is absolutely my favorite Singaporean food memory! Like the whole hotel, the restaurant decor and set-up are beautiful and very close to nature in feel.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JhmcCAOpyd2imJnBgRSTw"
  },
  "yW_9dWjkh2eb5VphZgXNYw": {
    "date": "2/28/2017",
    "text": "Outstanding breakfast buffet.  Varied selection, high quality and worth the price - especially if you're hungry.  After breakfast here, I didn't need to eat again til dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ss8VEYHv_Ram2iGQ8ucxug"
  },
  "UfKoMY4jLNR2jF4jnAX1Dg": {
    "date": "9/27/2017",
    "text": "Not good at all. The oysters are not fresh at all. Sashimi is ok. I went there when there is a seafood event which costs me $233 in total. So pricy. I didn't even feel full at the end since there are not so many seafood choices and desserts. Really disappointed and won't come back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNCcv9rQqeWCP52y5K29Zg"
  },
  "Kht0eFlDr8xl9PpnckSAEw": {
    "date": "3/3/2017",
    "text": "Great buffet. Great selection. Wonderful decor and airy space. Major food regions were well represented and they had my childhood beverage, Yakult, readily available! Only qualm is you have to make your own noodle soup compared to other buffets where they make it for you.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6KTvDt5kF40JPMJNTb2yg"
  },
  "JBlqjScRkdjseqrwlSxE2g": {
    "date": "6/6/2015",
    "text": "Being the hotel restaurant at my hotel, I have been eating from this kitchen more than I wanted, as they also provide the in room dining; the necessary choice on busy working nights. Since I have only had time for their a la carte menu choices, I can not give a fair rating on the buffet, that seems to be quite popular. I have had chicken as in room dining - slightly overcooked and with hardly any meat on the bones. The mushroom sauce and the hot fires was really good, though. I have also tried the pepperoni pizza for in room dining - it was lukewarm and boring.One day we had lunch in the premises, and I was hoping it would be better when we got it fresh from the kitchen. It wasn't. My rare done burger was a tasteless beef tartare, hardly done at all. Service was also somewhat strange, the waiters seemed slightly confused and all in all I just do not recommend this restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ppx8mioUZuj3Xiss9vrQRA"
  },
  "2Rn2Sc2IGhgCLGkHwL25Hg": {
    "date": "1/25/2014",
    "text": "We went with a visiting friend as we had heard good things about Lime restaurant and as it is on The Entertainer application we thought we would preview it via the champagne brunch. We will be back!There is a huge selection of food, from seafood, to Western, to roast meets, to salads, to Middle Eastern to Asian, to Thai salads, to cheese, to breads, to cakes and ice cream and many many more. Check out my blog for the full review:mylifeinsin.com/2014/01/…Some of my highlights were the oyster sauce stir fried vegetables, the macarons, the bread! The chicken rendang, and lots of other great items and my friends would be waxing lyrical about the cheese and roast meets and seafood.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "znUcaK7AkBQGXRTRYpoT1A",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore. Macaroons! http://www.mylifeinsin.com/2014/01/lime-at-park-royal-pickering-for-sunday.html",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/znUcaK7AkBQGXRTRYpoT1A/o.jpg"
      },
      {
        "img_id": "HduDZmEmzR16FWj9RPmsEw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HduDZmEmzR16FWj9RPmsEw/o.jpg"
      },
      {
        "img_id": "RJH5eX9X-nvSUh6hIKdcfQ",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore. Bread! http://www.mylifeinsin.com/2014/01/lime-at-park-royal-pickering-for-sunday.html",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RJH5eX9X-nvSUh6hIKdcfQ/o.jpg"
      }
    ],
    "user_id": "2lrdQWjAlTpVYklsYsUa3w"
  },
  "J9lCwH96LoH11AutsWilYA": {
    "date": "9/27/2014",
    "text": "Lime at park royal. The spread at the buffet is decent. A mix of western and peranakan food. As at most buffets nothing is outstanding but all generally ok. Best of all are the oysters if your in to that because it's shucked fresh. Since I love oysters I would have been happy just pigging out on them. Atmosphere is very nice, contemporary setting. Service is very good. Price is a little high at $62 +++. Frankly there are other better spreads elsewhere but it's a nice difference in the peranakan spread.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "esyZbZnhLJBjBuXpV07HFg",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/esyZbZnhLJBjBuXpV07HFg/o.jpg"
      },
      {
        "img_id": "w1OItg730ZhKZmIBW3U4vw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w1OItg730ZhKZmIBW3U4vw/o.jpg"
      },
      {
        "img_id": "mPXawutmBUE2LQfhjfhtSw",
        "caption": "Photo of Lime Restaurant - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mPXawutmBUE2LQfhjfhtSw/o.jpg"
      }
    ],
    "user_id": "91UQ_DLi_qsDXQfg6kBePw"
  },
  "0Kia7hnlIzgLsdUiyeqrUg": {
    "date": "11/29/2015",
    "text": "We were too tired to go out of the hotel so we'd thought we'd try the hotel restaurant. The choices were to do the smorgasbord or ala carte. The smorg was $68 per and it looked a little greasy so we did ala carte. We shared a buffalo mozzarella and tomato appetizer. Doesn't come with basil but with \"basil pesto\" which really was dried basil flakes in olive oil. We had it on the side so regular olive oil and basslmic vinegar made it a nice shared appetizer. We both ordered penne with red sauce and we were disappointed. The penne was fine but the sauce was high in sugar content. So chef if you are getting sauce from a jar, don't get the one that has high fructose as the first ingredient. That being said, service and atmosphere were excellent. Overpriced for the quality of food offered.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AG6k_NGNcnxiWN_QGMHzWQ"
  }
}