{
  "EnFXbgunzlGN_jM0KIgulg": {
    "date": "10/14/2013",
    "text": "Nestled in the greenery and trees of the Singapore Botanic Gardens, Food For Thought truly wins in terms of location. The atmosphere is quite nice as well, really green and casual with concrete floors, wooden tables and an open kitchen. On a Sunday afternoon expect to see many families with kids there, which makes for a loud, messy environment. I don't mind kids, I think they're really entertaining to watch, but I know some other reviewers complained that there were too many kids....The food was also very good! I've been getting a bit tired of hawker food, so I was willing to spend a little bit more to get a little taste of home. I ordered the grilled ham and cheese and roasted tomato salad, total was $13. The sandwich was served on ciabatta bread with greens and Dijon mustard vinigrette with sliced roasted ham and ooey goeey melty cheese (havarti, I think). I'm not sure if the sandwich was actually really good, or if I just missed bread and cheese so much that it didn't matter how good it was. I do think the sandwich could use more cheese- If I knew how little they would put I would have asked for extra, and been willing to pay for it. The roasted tomato salad was good, but not amazing. I was expecting grilled tomatoes on a plate seasoned with lemon and salt and pepper, but the dish was more like half of a sliced mushy tomato on a  bed of greens. It was okay, but I think the dish could use a better dressing and more tomatoes. Being the seasoned eater that I am I can frequently think of ways to make a dish better, but don't get me wrong, the food here is good.I think the cheapest item on the lunch menu is the chicken rendang S$ 9 and on the breakfast menu (served from 8:30-10:30?) is the mee rebus for S$ 5.One complaint I have is the people from the milkshake stand out front asked my friend and I three times if we wanted to buy a milkshake. The stand (some university partnership with FFT) is raising funds for children in Cambodia, which is a good cause and all, but I would have appreciated not being asked to buy a milkshake three times in a ten minute interval.If you're in the area definitely see the Botanic Gardens. Food For Thought makes a great reward for your long, sweaty walk though the gardens. :D",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zRMflt0EY0C66kE9oWiL5Q",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Chicken Rendang with steamed rice S$ 9. Wasn't quite the rendang I'm used to- tasted more like lemongrass chicken, but was good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zRMflt0EY0C66kE9oWiL5Q/o.jpg"
      }
    ],
    "user_id": "QuL_wU2Vh93gaxTMrxTnEQ"
  },
  "hGEGBu6k6LPTH7dBKJ6k0g": {
    "date": "5/14/2013",
    "text": "Food for Thought is a large restaurant in the basement of the Botanic Garden (not by the MRT side - you have to walk to the other end of the park, or can get here by driving and there is parking available). Serves the typical array of American breakfast foods, from eggs & hash browns to pancakes, some with an extra flare. Two people in my group had the chocolate and raspberry pancakes, which were delicious! I also loved the hash browns I ordered (which were like American tater tots). The other food were tasty too. We came here for brunch so we didn't try a lot of the lunch menu items. The one I did try-- the ratatouille -- was mediocre. The ambiance was casual.They get docked some stars because of the ordering system which is a little confusing. You have to order and pay at the counter, and give them your table number so they can deliver it to the right table when the food comes. We had to make sure someone was sitting at the table so that it wasn't taken. It was also pretty crowded and busy so the service wasn't the fastest (although it's mostly self-service so you have to be pretty proactive about asking the wait staff for what you need). But, overall, we enjoyed our time here and I would recommend it as a nice breakfast or brunch place before (or after) a day out at the Botanic Gardens!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g0VLoZzqXgcmDHEfKYpV5w"
  },
  "jP1KFqxrTZOxjrGiB0dGwA": {
    "date": "12/28/2013",
    "text": "Just love the banana walnut pancakes... And the fact that its inside the beautiful botanic garden makes this restaurant a nice place to visit for brunch on weekends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D3VbmEw0iFonx-Joi1IoxQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Full works",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D3VbmEw0iFonx-Joi1IoxQ/o.jpg"
      }
    ],
    "user_id": "dsdTP1cPkdqiK3W5WNLW-Q"
  },
  "5BxvU_AjowfITGB3Kg_Bug": {
    "date": "9/1/2014",
    "text": "This is a great little spot for brunch after a walk around the Botanic Garden. Service was quick and impeccable! We'd read about the berry and chocolate pancakes on a blog post and decided they were a necessary addition to American-style eggs, toast and bacon and an order of chicken laksa. The pancakes were tasty but not particularly special for pancakes. The homemade brioche toast was a clear winner, as was the laksa. The lattes were perfect for cooling down after the humidity of the gardens. Overall, a perfect spot to grab a bite.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BpHoMr3yBlv-bhB-_dZarA"
  },
  "6-vQCOW1PwB5oht-nLoEVQ": {
    "date": "10/7/2012",
    "text": "If you're visiting the gardens and looking for a nice, casual dinner, this is the place to go. Unlike the other restaurants in the botanical gardens, the atmosphere here is very relaxed and child-friendly. There's a playground outside and plenty of indoor space for kids to run around (they seem to throw good birthday parties, too).The food here was pretty good, albeit a little expensive. It's one of the only places I've found in Singapore that serves good quality, authentic Western food. For $20, I got a nice portion of grilled barramundi with basil pesto and a huge serving of mashed potatoes. The artisan burgers are nicely prepared too, at around $10, plus extra if you want drinks and fries. I also HIGHLY recommend the basil mayonnaise for $2 more. It was so good, we ate it with just about everything, even though it was intended to be eaten with just the fries!The drinks and desserts were nothing exciting, though, and rather pricey. A regular can of soda costs $3, and the specialty Pellegrino sodas are a bit more. The red velvet cake was the biggest disappointment of all. It was very dry and the frosting tasted like unsweetened cream cheese. Definitely not worth $6. Overall, eating here is a very pleasant experience, as the staff is very friendly and accommodating. The food comes out in a timely manner, and the waiters will wait to bring things out (i.e. dessert) until you want them to.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPbm4PQ3dJ9j8OVBuaIavQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Cheeseburger with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OPbm4PQ3dJ9j8OVBuaIavQ/o.jpg"
      }
    ],
    "user_id": "_Yz6MRW4ZribqxPxfQxFcw"
  },
  "8ZiVqLwnHmL410HmwK1Fqg": {
    "date": "7/29/2012",
    "text": "I came here one late Sunday morning for brunch. And sure enough, the crowd was thick. The problem with a popular place on a Sunday morning is getting seats and I believe they do not do reservations. So the troop of us, about 6 managed to squeeze ourselves on to a single small table in an odd corner of the place. The menu is a replicate of the one found in the other branch at Queen St. Nonetheless, the space and ambience fortunately makes up for the lack of a waiting staff. I would imagine that need to hire a lot more if they were to get people seated by waiters, the dining space is sprawling, indoors and out. The food, I had the works. And a beer on the side. Yes, Sunday morning beers. Heh. We had to line up at a counter to place our orders and pay for them at the same time. They advised that the food would be served in 30 minutes or less but in actual fact they came in about 10. Very fast and efficient I thought! The food was as expected, good. All in, a rather enjoyable Sunday morning for all us.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e29O5Km857BCJnUj7mblkQ"
  },
  "PiTqBnkHP17ekOi_oqZTuw": {
    "date": "8/26/2012",
    "text": "Food for Thought started out as a little café in the Bras Brasah area and has now expanded to include a restaurant in the Botanic Gardens. They serve no frills comfort food at a pretty decent price. The branch in the Botanic Gardens is huge and it's a nice place to go for lunch or brunch after a walk in the park. They've got a wide array of desserts, Western and local mains, as well as breakfast. Most of their dishes have a cool local twist to it. I tried the banana pancakes which was served with gula Melaka syrup. I would come back here for sure for brunch.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AEPHv5ya4iXCTMt-eVhcKg",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AEPHv5ya4iXCTMt-eVhcKg/o.jpg"
      }
    ],
    "user_id": "Cd8OdDB6wJxurtAgU-IgHA"
  },
  "sQyDiiylL4Z8036pPgK22A": {
    "date": "6/16/2013",
    "text": "average brunch food at the botanic gardens - some dishes (the simple ones) better executed than others. this placeIs rather popular, and I can see why. it's a large open space, completely casual canteen-seating predominates, and the menu is likewise expansive.it's not the best brunch I've had - really, not even close - but I don't really think that's the point. it feels rather more like a place you go to to be convivial, or bring your screaming children along - without too more recrimination, with a dash of decent food to help lubricate conversation.it's a casual place, this - you shimmy up to order at the cashier and food gets served to the table. the partner had his mind set on the trio of sliders: the kaffir lime fish, spicy thai chicken and pulled pork. served alongside fries, these were all average - the bread was soft and giving though, and we'll recommend the chicken: it was tender, moist leg meat, seasoned well.I took the salad-as-lunch option. the plate of sugar snap peas came tossed in a soy-sesame mix - refreshing in its simple greenness. the peas are untrimmed though, and I had to remove all the threads myself - avoid this if you're on a first-date-first-impressions kind of deal.the smoked salmon & broccoli plate was a great mix of flavors. chargrilled broccoli, cold hot-smoked salmon and roast beetroot - all delicious.I might return. that salad was good, and the place does brunch proud - a vibrant atmosphere, nothing too awe-inducing or surprising for the first meal of the day. comfortable like those old pyjamas you can't bear to throw away.just don't come expecting mind-blowing food, and get in on the chillness of it all.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "gajvBRsApr3WzahphX9vZw": {
    "date": "2/2/2014",
    "text": "This was our third visit within a month of moving to Singapore. Location is within the grounds of the Singapore botanic gardens and has an interesting concept where you queue and order and then your food is delivered to your table - which are organized by number. There is indoor and outdoor seating as well as a nice but small play area for kids. Today we ordered the laksa, mee rebus, house breakfast, pancakes with chocolate, and a toddlers egg, bacon and toast combo. To drink long black, flat white, lime iced tea and rosemary blood orange juice. The OJ was particularly enjoyable.The food is reasonably priced, super fast and oozes a kid friendly vibe.The chocolate pancakes are my daughter's favorite, two large cakes with a generous portion of chocolate chips that melts as you spread it around!The eggs and bacon are pretty standard fare as was the laksa and rebus. Overall worth a visit and will be a place we frequent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dwgRHXRnv6dMhUTuCw0WPA"
  },
  "jcJgDtKCj83jj8Io7MWM5w": {
    "date": "9/15/2012",
    "text": "tasteless food...though they do look somewhat good.the playground is way too small.please bring back the old old food court with jalan kayu roti prata stall.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PS0uGpc0Cwx40hMk6zolag"
  },
  "IAemTD6eMHlml1bMXkPzKg": {
    "date": "8/14/2012",
    "text": "When I first heard that FFT had opened an outlet at Botanic Gardens, I was excited to check it out. Afterall, I was fond of its concept- a cause to support, breakfast components dissected to variable portions and trendy marketing: whats there not to love?Sad to say, I was disappointed both times when I went to visit. While the interior of the place is gorgeous (plants growing out of tables, mind you)- I found the ordering system counter-intuitive and user-unfriendly. The restaurant expects you to first find yourself a table, (have someone to) chope the seat, and queue at the ordering counter. When ordering, you are supposed to tell them exactly where you are seated (basically screwed if someone else takes your seat) or they will refuse to let you order until you have found an alternative seat. I can imagine what a hard time this would give single diners, or worse, having to split up lovey-eyed couples by forcing one to queue thereby subjecting them to a painful 20 minutes wait before they reunite! The 'choping' mechanism also makes me feel very ugly- I once had to tell someone with a crying baby on hand that basically all the seats around me were reserved. It is also very Singaporean, which surprises me, because Botanics is afterall a touristy place which attracts people whose culture might be vastly different from ours. I imagine this system to be completely indiscernible to them (I have seen foreigners bitch at staff over it).Even the food is not comparable to the other outlet. My scrambled eggs came too buttery, it was like drinking oil, but I didn't even feel like sending it back because it would possibly mean having to wait for another half an hour. The menu is also different from the other outlet's- so if you are thinking of heading to this one for a specific dish, remember to check the online menu before you make your trip down.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9zo-15IyloXhPeO78Myjg"
  },
  "v9Lz_JM8XBtFLsSSxZgu5Q": {
    "date": "8/21/2012",
    "text": "Out of all the Food for Thought outlets in Singapore, this is the least impressive. It's located a midst the greenery of the botanical gardens - which means it has great potential. Unfortunately, the branch is let down by lackluster service, with the wait staff being under-trained and confused. Food wise - it's okay. It has greater variety than the other Food for Thought outlets, and is pretty cheap. This unfortunately is insufficient to overcome the terrible seating system they have - which is confusing to locals and tourists alike.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDcJsT-IhVMH6sO19V_nbg"
  },
  "Q-9c6PabEFT8i9o0uEs4zg": {
    "date": "3/1/2017",
    "text": "Double chocolate muffin ($4) - 2.75 starsNot too sweet and had a good bittersweet chocolate flavor, but it was a bit too dry. I'd get it if, like today, I really wanted a jumbo chocolate muffin.Update 25 Apr 17Afternoon tea set ($10) for a cake and coffee. Options: NY baked cheesecake, Oreo cheesecake, rainbow cake, carrot cake, chocolate fudge cake. Apple pie not included.Hot dark chocolate with mini marshmallows - 4 starsThe mini marshmallows melted too quickly! And the foam dissipated quite quickly so the actual amount of hot chocolate wasn't that much. But I liked the taste - not too sweet!Chocolate fudge cake - 4 starsI liked this cake! They warmed it up but it was only slightly warm and quickly cooled down to room temperature. It tasted better at the start. Soft and quite moist. A bit later the fudge icing melted and got too runny so my top layer of cake fell off. Still good though.Might try the cheesecake the next time. Wanted to get it but it looked too smooth and not cake-y.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LsL8sNcr_6uuaMMMTOSuLQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Chocolate fudge cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LsL8sNcr_6uuaMMMTOSuLQ/o.jpg"
      },
      {
        "img_id": "4yqxLHomVY1ukBAa5bZ1EQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Afternoon tea set ($10) - Hot dark chocolate and chocolate fudge cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4yqxLHomVY1ukBAa5bZ1EQ/o.jpg"
      }
    ],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "L3dFMxuWxeifudNQVI9eyw": {
    "date": "7/1/2017",
    "text": "Convenient and good portions. My niece and I wanted a quick bite and walked to the Singapore Botanic Gardens. I was expecting a food court but instead, Food for Thought had taken over the space. My niece had the spaghetti bolognese (kid's meal), and I enjoyed a big breakfast. Scrambled eggs, bacon, ham came with nicely toasted brioche and I loved the sauteed mushrooms. I enjoyed my meal. The eggs were a little on the overdone side, but I did not leave hungry. The decor is a little run down. The servers were helpful once you spoke to them. You have to walk to the order and pay station.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7zpWvKDNTV-hAG4I2xAEGQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Full Works: Scrambled Eggs, Brioche Toast, Mixed Greens, Pome Noisettes, Bacon, Sausage and Sauteed Garlic Mushrooms",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7zpWvKDNTV-hAG4I2xAEGQ/o.jpg"
      }
    ],
    "user_id": "9gZ4pQHdK6v8xMLig6EEFA"
  },
  "xWH9KT-YACrzW-rAVwDqUA": {
    "date": "9/11/2017",
    "text": "Cool little place to have lunch or a snack while strolling around the Botanic Gardens.  Good variety of options to choose from and a good place to get out of the heat and humidity and cool off.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "6vrc6X1zgG_S8G2xQKrvHg": {
    "date": "12/4/2015",
    "text": "A casual place that is good for family time due to the large space and playground outside to occupy the children.Food is decent but nothing special to be honest. Maybe except the Gula Melaka granola. But prices are more than fair and nett.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M_niow_8Yxgdx6AP5cAydQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Beef cheese burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M_niow_8Yxgdx6AP5cAydQ/o.jpg"
      },
      {
        "img_id": "1i9u4cWU_jhF8AWOwdi3eg",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Add soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1i9u4cWU_jhF8AWOwdi3eg/o.jpg"
      },
      {
        "img_id": "V0oTIkoQeakc0GSrqlTsqw",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Gula Melaka granola",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V0oTIkoQeakc0GSrqlTsqw/o.jpg"
      }
    ],
    "user_id": "JxQmVUwbUBAZiji4kZtVSg"
  },
  "XdxuwjMo2R27UAo2KXbKJQ": {
    "date": "11/4/2016",
    "text": "Located inside the Singapore Botanic Gardens on Cluny Road, Food for Thought at Botanic Gardens  possesses a truly tranquil atmosphere. The place looks modern and well-decorated with brick styled counter, wooden tables, clear white chairs and an innovative ceiling. Kids can hang out in the close-by playground while adults are having meals. Especially, a catchy 5-step slogan sitting comfortably on a white long wall is something you can't miss for a wonderful selfie.Recommendation: Banana Walnut Crepes, Full Breakfast/Brunch PlatterFor more, visit us as: thecoupleeats.com/singap…",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-jXqSBvoO1FsIcl_0mt9Ig",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Lovely interior decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-jXqSBvoO1FsIcl_0mt9Ig/o.jpg"
      },
      {
        "img_id": "D8EMp4eZAo6ArE_7FK_JuQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Walnut Crepe with Banana",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D8EMp4eZAo6ArE_7FK_JuQ/o.jpg"
      }
    ],
    "user_id": "YJblj_SdFVw8_QvEVo_kag"
  },
  "9SlvEXaSxBs2s3KdKun_hg": {
    "date": "9/7/2016",
    "text": "A nice place in the botanic gardens; nice ambience great for brunch and a quiet gathering Very spacious space; great for events The food was passable ; not extremely fantastic but still pretty good. Had the pulled pork pasta - pork was a little too salty; wasn't spicy enough and slightly too oily : however it was okay Latte was Normal as well; so was the carbonara - nothing too memorable. Wouldn't go back especially for the food but is a good chill and nice hang out place after a run in the botanic gardens or for brunch out of the city",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VJTjj9OA70qP0Rsjz67ejQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Pull pork pasta and latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VJTjj9OA70qP0Rsjz67ejQ/o.jpg"
      },
      {
        "img_id": "zfwGBDWD1cIJtxGwAEQEdw",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zfwGBDWD1cIJtxGwAEQEdw/o.jpg"
      },
      {
        "img_id": "1PFJnqBIEPzo9prhbFqS4w",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Carbonara and milo dinosaur latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1PFJnqBIEPzo9prhbFqS4w/o.jpg"
      }
    ],
    "user_id": "y7m3TTnHq_giLvwHMe7S5g"
  },
  "uMSVLM3rqzslx_9hRJ9FzA": {
    "date": "10/24/2015",
    "text": "Surprisingly empty for brunch on a Saturday (reached at 12.30pm). Food was decent but not great. Tried their basic breakfast ($9) and my friends got the full breakfast ($22) and their special of the day, banana walnut toast ($12). The banana walnut toast that came topped with yogurt was too sweet for my liking. The toast also tasted more like a muffin. The scrambled eggs and brioche were decent though. Not the best brunch place in town, but good for a casual catch up. Also appreciate the lack of GST and service charge. Coffee ($5) was out of the machine and not good at all.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D0qDu2aYDH0XGtsDurOYFA",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Banana walnut toast with yogurt ($12)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D0qDu2aYDH0XGtsDurOYFA/o.jpg"
      },
      {
        "img_id": "G2wGjThIiZgQxirWsz8djA",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Full breakfast ($22)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G2wGjThIiZgQxirWsz8djA/o.jpg"
      }
    ],
    "user_id": "seb6_XUoH4q-mtJ6pCCXlg"
  },
  "Ig9VgORlOOn7CASU1imERA": {
    "date": "12/2/2013",
    "text": "Had a lovely brunch out here with friends and kids. I had a bangers & mash and it was good! Hub had a pasta with Broccoli and prawn. That was good too! Best part is the kids can run outside the cafe and you can watch them play outside while enjoying adult conversations inside with aircon. 2 thumbs up for good food and location.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "76LtVTYyz7jiR3Gnli98uw",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Bangers & Mash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/76LtVTYyz7jiR3Gnli98uw/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "fxgttaHnKcx-P3c0ZvU2UA": {
    "date": "7/6/2016",
    "text": "The cashier took the wrong table number when another employee wrote onto the paper. On the 2nd order, the cashier took the wrong order and thus the food was wrongly serve. Very bad customer experience. Nonetheless, the food was pretty nice and good.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TzxMNdUHV7UyqC27xp5gFg",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Nice food",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TzxMNdUHV7UyqC27xp5gFg/o.jpg"
      }
    ],
    "user_id": "MGlJsNi4MkrXeoZCauC8UA"
  },
  "vinV9yrqqkaz54DWDEqlyw": {
    "date": "11/27/2014",
    "text": "Heard good reviews from my church mates for this place so decided to try it out with my friends. Was pretty empty on a Thursday night so we were able to choose the high chairs for our seat. As we were there for the first time, I wasn't really sure on where to order and asked one of the staffs about it. She directed us to the front where you can see the computer.Before making payments, what looked good to me was the Lemongrass Galangal Seafood Risotto. And of course, Milo Godzilla pudding for the dessert. My friends ordered the brunch platter for 2/3 pax and grilled barramundi fillet with holy basil almond pesto.Food came pretty earlier than what I expected. Mine came first and I started digging in without much hesitation. Was into risotto lately (hmmm).. My food has a strong aroma (which made me even hungrier than before) and the first bite, you can taste the different flavors bursting on your tongue. I love the touch of the ingredients especially the lemongrass condiments and the chilli inside the risotto. Overall, two thumbs up. The downside was that it was on the higher end and the portion wasn't big. Tried the brunch platter - it consist quite a variety (seen on the picture). I always crave for good fries and the fries have a crispy touch on it. I tried hashbrowns and the lemon dill fish fingers has fresh peach on it. The Crispy Chicken Tortilla was also good. All of them has perfect touch of condiments/sauces in them which made the taste last inside the mouth. The grilled barramundi filet wasn't that wow. For the Milo Godzilla pudding, I was searching for \"rare\" desserts and this one caught my eye straightaway even before my friend announced that she would like to order one portion too. Like a molten lava cake, it has ice cream on top (coconut flavored if I wasn't wrong) and chocolate cake at the bottom. The chocolate cake was moist. I am glad that we ordered just one dessert as we couldn't probably finish if we have more.Interior design wasn't too fancy. Open concept kitchen and open concept layout with some modern touches on its furnitures. Price like I mentioned, it is on the higher end but since it is located at one of the touristy places - Botanical Gardens, price range for me was al-right. Will be back for more in the future :)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "qUJZruzfCB4QZkQvCL-Rhg",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qUJZruzfCB4QZkQvCL-Rhg/o.jpg"
      },
      {
        "img_id": "7eu1nZSogdKP9zW2CGNo9w",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Brunch platter for 2-3 pax",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7eu1nZSogdKP9zW2CGNo9w/o.jpg"
      },
      {
        "img_id": "gdzcvwgql_FP-XcZT3_N6w",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Seafood risotto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gdzcvwgql_FP-XcZT3_N6w/o.jpg"
      }
    ],
    "user_id": "Qr-WoW6Vye4aH3I-YZ2ZyQ"
  },
  "-eDPbksMJa9_1thwFN9IHw": {
    "date": "4/25/2014",
    "text": "Saw my gf  post on facebook about this place and have decided to give this place a visit.I went to Botanical Garden on a lovely weekend.Upon arrival, this place is real big and they have the indoor and outdoor seating. I join the queue and place an order on their breakfast specialty and oh my didn't realize that the portion was so big. Anyway, I have sat there for hours enjoying my reading and food. Overall this place is a gem and its a good place for family hangout and spend your afternoon lazing around.Their scone is simply too delicious, im a big fan of scone and I would simply had it for meal. The scone is big and filling and I brought 2 home for teabreak.Would visit here again .....",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uYoYdaCsplympH0uJ3hl7w",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uYoYdaCsplympH0uJ3hl7w/o.jpg"
      },
      {
        "img_id": "j3V6I2vHriqjoRKwqzDZUg",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j3V6I2vHriqjoRKwqzDZUg/o.jpg"
      },
      {
        "img_id": "q92LPm6DP3TxUz6ZHZ_gaA",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q92LPm6DP3TxUz6ZHZ_gaA/o.jpg"
      }
    ],
    "user_id": "UwWtpjalT2xlJyglRRITug"
  },
  "z-mhqGi5QeZqOOjBNTpQcw": {
    "date": "11/9/2014",
    "text": "A very convenient place to have a bunch in a before going to Botanic Garden.The place is very family friendly (could be a bit noisy for couples tho). Overall the food quality is good. The french toast with bacon is fluffy and yummy with the malaka syrup. The burger is good too. Last year I came here for the full breakfast (Full work) - which is fulfilling but a bit too much for a girl...haha....coffee is lovely too..",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Xb0c3rA2fQMDqwhkdBkI3w",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xb0c3rA2fQMDqwhkdBkI3w/o.jpg"
      },
      {
        "img_id": "6Bqg098KAU8oqaln80EZ9g",
        "caption": "Photo of Food For Thought - Singapore, Singapore. French toast with Melaka syrup and bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6Bqg098KAU8oqaln80EZ9g/o.jpg"
      },
      {
        "img_id": "y_q4Z-rhshbfM1-LlfCDrw",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Beef cheese burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y_q4Z-rhshbfM1-LlfCDrw/o.jpg"
      }
    ],
    "user_id": "QGP0TcL_0maoS7NvbXVi2w"
  },
  "YxVOl_XUhAWCAllO1rv_tA": {
    "date": "2/2/2013",
    "text": "Food For Thought always hold a special place in my palate... the all day breakfast and pancakes are always so delectable.The food offering at the Botanical Gardens outlet is slightly different from the one at their restaurant at 8Q but it's equally tasty. For first timers the ordering system may be a little confusing cos it's mainly self service and the wait staff are mainly there to help serve the orders instead of taking orders at the table. Utensils, water etc are also to be taken by patrons themselves.Since this restaurant is much larger than the outlet at 8Q and the atmosphere is supposed to be a lot more casual and relaxing, this \"do-everything-at-your-own-pace\" system is pretty alright. Finding a seat first may be challenging on a crowded day but hey, lighten up and enjoy the smell of nature! You are afterall, in the Botanic Gardens! :)However, the place depends a lot on natural lighting thus it may get a little dim when the sky is cloudy. The lights used are mainly spot lights at the area where the long tables are, thus it may also get a little warm. Understand your own preference and choose your seats wisely, I'm sure the overall experience will still be enjoyable.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "MrqRwj9UzDuG4UtWh8gAcw": {
    "date": "9/1/2013",
    "text": "Food for Thought is located in the basement of the Botany Centre. It is close to the Tanglin Gate (Napier Road) and is reachable from Orchard Road.I did not find anything exceptionally great about the food, but that is not to say that it wasn't delicious. I definitely wouldn't want to make a trip to FTT just for the food but I would eat here if I happen to be spending a day in the Singapore Botanic Gardens. I do like the decor of the restaurant though - lots of natural lighting in a very casual environment.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_1shEcETunFVLgdB8edGww",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Some food for thought.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_1shEcETunFVLgdB8edGww/o.jpg"
      }
    ],
    "user_id": "f-BMmGIbwmT_iCu7gJHZGA"
  },
  "6UNrPwqbNOXjNKclV0HLng": {
    "date": "7/28/2012",
    "text": "Located right in the botanical gardens in the middle of the city, this place is a lush, tropical oasis where one can seek respite from the heat and get relax in FFT.Great ambience here - I especially love the plants growing out of holes in the concrete tables. Its spacious, bright interior is welcoming and cheery, with floor to ceiling glass panels and a high roof. There is even a little playground just outside the restaurant, so this place is popular with families on weekends.They serve all day breakfast here from 8am to 5pm, and even give early birds a local black coffee or tea offer at $1 when you order local breakfast items between 8am-10am.There's the Full Works breakfast pieces at $18, and it comes with scrambled eggs, bacon, buttered toast, chicken sausage, hash brown, garlic mushrooms and a toasted tomato salad. Nothing mind blowing, but it's definitely a hearty breakfast! They bake their own pastries and desserts here, and I ordered an old southern red velvet cake for $6. The cake was dry and unpalatable, with a weird cardboard aftertaste.However I was pleasantly surprised when I brought the cake back. The staff were very apologetic and offered to exchange it for any other dessert, making recommendations for me as well. I chose the passion fruit curd cheesecake, which was quite heavy and but tasty and kept me quite happy. Decent coffee is served here, bit when it gets really hot, I order a fresh juice or a San pelligrino to cool off.I've yet to try the lunch and dinner menu, but would definitely be back for more!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "563hfz-EY18-XHCxwT8nJA",
        "caption": "Photo of Food For Thought - Singapore, Singapore. The passion fruit curd cheesecake they exchanged for me tasted much better!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/563hfz-EY18-XHCxwT8nJA/o.jpg"
      },
      {
        "img_id": "lwC9FaPAIYAm92rjEz6wbQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Old southern red velvet cake that tasted like cardboard :(",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lwC9FaPAIYAm92rjEz6wbQ/o.jpg"
      },
      {
        "img_id": "ICPDAarGKp0ryCMATxNH8g",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ICPDAarGKp0ryCMATxNH8g/o.jpg"
      }
    ],
    "user_id": "wQ4iE0PQZy1FF1znVR40Yg"
  },
  "tyoWkauClYe04JDc4cyKqg": {
    "date": "9/19/2013",
    "text": "Such a beautiful setting! These guys have made great use of this space with its high, high ceilings and lush greenery around (hey it's the Botanic Gardens after all), it's really a treat to come by.It was a pretty cool afternoon when I came by for some lunch, so the seats outdoors where actually a feasible option made easier when you find seats within the reach of the fan. Yes, we Singaporeans are so dependent on the wonders of air-conditioning. Okay I am so dependent on the wonders of air-conditioning.So back to the space. It's big. And it feels a little too big sometimes, especially when you have to wander around to: a) order your food, b) collect your utensils, c) find a seat. Almost like a school canteen on your first day... but thankfully the food is better here. Check out the lunch time specials - great deals there, but of course there are lots of other tasty options. Remember your table number!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDCCEp_bOJ6kcyxZOfkedQ"
  },
  "cCsu5h39wGkY0VW7UaNngQ": {
    "date": "8/28/2012",
    "text": "The service at the Botanic Gardens outlet is slightly different the one at SAM. This is a semi self-service system where you order and pay at the cashier and then the food gets served to you at your table. Even though it's pretty big, but it takes a while to get a table and then a little more to get your food. I prefer the sit down service at 8Q because at least i don't have to stand around to grab tables a la food court style. However, Botanic wins in terms of space and the close proximity to nature. Take your pick.Food is pretty much the same. Customize your own breakfast set with their creamy scrambled eggs (must order). FfT has one of the better scrambled eggs around because they actually use cream in theirs to give it that runny and buttery texture. I would say skip the Toasts unless you really need carbs. Their spreads are really pathetic though.What you should not miss out on is the pancakes. 2 Buttermilk base Pancakes served with Fresh Cream and Gula Melaka Syrup with the choice of different flavors such as Banana and Walnuts, Milk Chocolate, Dark Choc and Raspberries etc. Prices range from S$8 to $12.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "sUsNAsojJHY2ra5EiCAqyg": {
    "date": "7/16/2012",
    "text": "This is going to fast become one of my favourite joints.Good grilled portobello salad with ginger and sesame dressing, great pancakes (banana walnut is my usual choice), decent brunch (pick any 3 items from the list of usual suspects for $8 only), decent prices and bread and butter pudding, the last being the clincher. Oh and there's free Wi-Fi.A satisfying bread and butter pudding can be had for a mere $6ish, drenched in milky vanilla over it. This always makes my day.(Electronic) parking is ample in the underground Botanical gardens carpark, which means rain or shine, you're covered from your car all the way to your pudding. The fact that the restaurant/cafe is next to a children's playground and surrounded by greenery with sun shining in makes it that much more pleasing to dine in. Every table has a hole shaped in it for potted plants, and the lights overhead are fashioned from tins. I love just about everything about this place.Food for Thought does not charge for service, GST is already included in the listed prices so what you see on the menu is what you pay. So if you dig their service, remember to leave a tip, or choose to donate $2 when you take a glass of free clean water, so an African can be blessed with the same for a year.Cool cafe with a great concept. Love it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FkUwrcxb68AhojiJ5DcdiQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Bread and butter pudding - second love of my life",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FkUwrcxb68AhojiJ5DcdiQ/o.jpg"
      },
      {
        "img_id": "6BlHzvlhn9eG6QE2lNDQGQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Banana and walnuts pancakes - it's so fluffy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6BlHzvlhn9eG6QE2lNDQGQ/o.jpg"
      },
      {
        "img_id": "nqGI9YtX4IWqS2Ucr3UjMQ",
        "caption": "Photo of Food For Thought - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nqGI9YtX4IWqS2Ucr3UjMQ/o.jpg"
      }
    ],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "grQoqDIErqxHBPk7oM5big": {
    "date": "8/26/2012",
    "text": "Food for thought is at one end of Botanic Garden hiding at a basement. Along the way, there are no signboard to lead us there. But when you reach the restaurant, it is still filled with people. If you take MRT to Botanic Garden, you may have to walk from one end of the park to the other to reach the place.The restaurant is very spacious with nice decor. You can choose to sit indoor or take the out door seats. For us, after a long walk and all sweaty, we went ahead with siting inside without thinking. Orders have to be made at the counter. To speed up the ordering process, the restaurant have two ordering counters.The food were average but the ambience was great. You wouldn't want to go back out under the Sun after finding a place like this in the garden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ETCs1zwvFs7ljAOerG2LCA",
        "caption": "Photo of Food For Thought - Singapore, Singapore. Brunch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ETCs1zwvFs7ljAOerG2LCA/o.jpg"
      }
    ],
    "user_id": "9evC7g5uOFAtp-UTbi1tWg"
  },
  "rJGUKMmG-rrED_Y3NoucXQ": {
    "date": "8/23/2012",
    "text": "Having been to the spacey, tastefully and artfully decorated Food For Thought @ 8Q, some expectations were set for their rather new Botanic Gardens venture... so after a good 25-minute trek through the Botanic Gardens (my gal pal and I entered from the Bukit Timah Gate, much to our dismay), we arrived in a large, spacious, forest-y restaurant with a large variety of different sized tables (imagine a small table coupled with high stools, and next to it, a giant table with 8-10 chairs)! They were working on the AC indoors so it didn't bring us much relief from the heat (and exercise), but I hope it's done now!Exciting!They do the all-day brunch (as with their other branches), and my gal pal got the scrambled eggs with mushrooms & toast, and I went and ordered the Iced Earl Grey Tea with Milk (exhausted from the trek before). I had a nibble of her food (thank goodness for small appetites!) and found the scrambled eggs to be really fluffy and deliciouso, and the sautéed mushrooms to be the highlight - salty, bursting with flavour and juice, and uber fragrant! If you're getting the all-day brunch, I'd highly recommend the mushrooms.My drink however, was sub-par and disappointing, and with the $4.50 price tag, it was something I could have done at home - dunk a tea bag in hot tea and heavily dilute it with milk, then pour it on ice. I'd definitely come back, but I wouldn't get the Iced Tea. That's a no-no.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WSRnkS_mlOo-7lPWTinQGw",
        "caption": "Photo of Food For Thought - Singapore, Singapore. 'Linner'-ing with my friend Elise",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WSRnkS_mlOo-7lPWTinQGw/o.jpg"
      }
    ],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  }
}