{
  "n7RRDPUaZXKnOp5KYkB6jA": {
    "date": "8/4/2015",
    "text": "So wanted to try this place when I saw it that I didn't care that it was a weekday... Asked my colleague who was totally game and another who had to be dragged along. Walking in, you see the mess on the table, people in white plastic aprons and elbows propped up on the table, with both hands holding seafood, sinking their teeth into it... Oh ya, there is also the look of I-don't-care-how-I-look-I'm-enjoying-my-food-so-bugger-off look on most people's faces.So yup! It's my kinda place.Ordered the basic bag ($88) and a side of chicken wings and fries. And that was more than sufficient for the three of us. Fries were average. Chicken wings were great - crispy even when it has been on the table for abit. For the basic bag, we had their signature sauce at spicy (the medium one, not the hottest, but was a tab bit too much for me - colleagues seems perfectly ok with it though). In the bag - one decent size crab, 6 prawns (I think), clams, potato, sausage, carrots and corn. Love the whole experience of picking food off the table and pouring sauce (hot sauce) on the table for dipping :)For drinks, I had the lavender lemonade ($4) which was different but taste was so so. There are other varieties. Colleagues decided to try their bottled beers at $15 each. Ouch.For the full experience, we ordered dessert too - waffles with chocolate ice cream. Ice cream was ok, waffles were not that great. Heard there are other dessert places out there... So many can skip dessert from this place :)Enjoyed the experience very much :) recommended :)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t1v2pHd5_GId39Y86b4uzw",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Basic bag @ $88",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t1v2pHd5_GId39Y86b4uzw/o.jpg"
      },
      {
        "img_id": "KbTTXFdNai0Vr0lhk5yMvg",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KbTTXFdNai0Vr0lhk5yMvg/o.jpg"
      },
      {
        "img_id": "9AbNKthMFU6xS5tZtScejQ",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Very yummy chicken wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9AbNKthMFU6xS5tZtScejQ/o.jpg"
      }
    ],
    "user_id": "tOnAuTqwPr5fwoVsXJ4s8A"
  },
  "CReMyWf1uSuIjIK6fnfxUA": {
    "date": "7/11/2017",
    "text": "The place was pretty empty for a Saturday afternoon. We were showed to a booth table at the far end as it was one of the available pre-covered with disposable cover. There was also tissue paper and spicy hot sauce available on the table. Remember to help yourself to the plain water at the counter. Hand wash area was just next to the kitchen.Combo Bag #02 ($40++)350 grams prawns, 250 grams mussels, 300 grams clams, corn, sausagesserved with Beurre Blanc sauceWhen the food was served, we had the option to serve in the pot or pour everything onto the table. We decided to have everything on the table. The sauce was rich and creamy, went quite well with the seafood. The sausages were a tab spicy. The corn was quite juicy. The seafood was big and juicy.Washed everything down with a glass of Pink Thyme Lemonade ($4++).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aHLsToBojl-mJCZNwba03Q",
        "caption": "Photo of Dancing Crab - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aHLsToBojl-mJCZNwba03Q/o.jpg"
      },
      {
        "img_id": "cFAbeC4zjhGe5jUrMPKSCA",
        "caption": "Photo of Dancing Crab - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cFAbeC4zjhGe5jUrMPKSCA/o.jpg"
      },
      {
        "img_id": "FZaiWeOFtuhVVH4jYh6zIw",
        "caption": "Photo of Dancing Crab - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FZaiWeOFtuhVVH4jYh6zIw/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "aEcvbpkSu3xx1Qz_mrcbSQ": {
    "date": "4/27/2015",
    "text": "I was having a birthday celebration with my friends on sunday lunch, the place is fun, the food is pretty good for variety, well singapore signature black pepper and chili crabs are still singaporean type of food, i would say this is good for variety. Love the butter garlic saos crab so muchActually Price wise, they are pretty much at the same level like jumbo or long beach though our total cost per person was about sgd35 after discount from american express credit card maybe because we were having it with many people and we were looking for fun more than full tummy?   well in this kind of places, you better eat with many people so you can try many variety of food with considered manageable cost",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3YWWTvNBa9TItLUm15V8PQ",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. The big chair, fits 3 slim ladies",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3YWWTvNBa9TItLUm15V8PQ/o.jpg"
      },
      {
        "img_id": "XrtNpfdpHgxfY6J3rbGK7A",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Calamari is mediocre",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XrtNpfdpHgxfY6J3rbGK7A/o.jpg"
      },
      {
        "img_id": "vYz_Ct-KyFLxjNc_GDZdAA",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. The fun table",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vYz_Ct-KyFLxjNc_GDZdAA/o.jpg"
      }
    ],
    "user_id": "ykj_bzOhA4qt6p-8HAHoaA"
  },
  "KKiVaqvUWKdvhPVZbfZAZw": {
    "date": "9/23/2016",
    "text": "Given Singapore's love affair with Crab, it's not surprising that a place like Dancing Crab has opened up and offers some interesting alternatives to the local chili crab.  Their concept is to offer crabs in a Louisiana/Cajun style, although with some interesting deviations.  Being from Seattle, I will take a Dungeness Crab over a Sri Lanka mud crab any day.  And the Dungeness Crab we went with a zesty garlic preparations.  For the most part, it was quite tasty!  The crab itself was very fresh and the meat was easy to pick off .  The whole thing was also served with a bag which included clams, prawns, sausages, and corn.  The problem, however, was with the zesty garlic sauce which was way too rich.  Also, the price of the Dungeness crab was high - about $12/100 gram, which made me cringe as my usual source in Seattle charge $5 per whole crab...).  Another unexpected bonus was a decent beer/wine list that was not overpriced.  Anyway, it's an interesting concept, and perhaps the next time, we will try the Cajun style, but it may be awhile as dinner was over $300 for 2 people, and for that much, there are other places I would try first.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "vRuHPM06W9iQJXK8XHbC3Q"
  },
  "D_XA0FzSCX9Y_mJws7LFSQ": {
    "date": "9/1/2014",
    "text": "A girlfriend and I decided to come here on a Saturday night for dinner, and we decided on that only on Saturday afternoon. Mistake! After calling them for the third time, someone finally picked up the telephone to tell me that they were fully booked. They do take online reservos but the website says they only take reservos two days in advance. Not that I advocate coming here. I know someone who works at Tung Lok (Dancing Crab's parent company), so we managed to get a booking at 9pm, without having to wait outside. We arrived at 910pm, to see about 6-8 people waiting outside. Jesus.And we come to discuss the food! We ordered a lobster roll (comes in two mini rolls, and with fries, and combo bag 1, in herb butter. The lobster roll was insipid. Chunks of lobster in mayo and not enough flavoring. Let's just say the brioche bun was better than its filling. We chose herb butter for the combo bag, because we didn't feel like spicy food. Boy oh boy, it is a giant puddle of grease. Potatoes, carrots, and sausages do not taste good in a giant bowl of oil. The crab, prawns, and mussels were reasonably fresh. That's one advantage  herb butter has over a spicy sauce - freshness can't be masked that way.I rate the food 3/10 overall. Service was spotty. We waited 5 minutes for our table to be \"prepared\" despite having a reservation. Before our meal, I had to grab the disposable aprons and paper towels from another table, because we weren't given any. Shameful. We also had to request for crab-eating utensils. I tried, but just couldn't dig flesh from tiny crevices with my already small hands.Bill was 120ish. We didn't get any drinks. Would I come back here? Not even for half price.P.S. 15% off for DBS credit cards.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "0yFTU12AqylSTRIG5GAW8A": {
    "date": "5/31/2014",
    "text": "So this is my first time trying this messy seafood Creole cuisine which seems to be popping up all over Singapore since Cajun Kings, Crab in da bag and now this Dancing Crab.I've only known about this place as it was popping up quite a few times on my Instagram by a few friends. I also did a quick research on online reviews and basically tried the ones people said were quite good. So anyway this is what me and my party of 4 ordered - 1. Combo Bag #1 (from what I \"remembered\" it came with a small Sri Lankan Crab, mussels, corn, potatoes and prawns)2. Cold Platter (prawns, mussels, 4oysters, Alaskan crab as seen in picture)3. A bag of clams 4. Calamari5. Lobster Roll (comes in pairs)6. Moonshine Tiger Prawns7. Crab CakesFor no.1, they gave you 3 different types of sauces to choose from. There's the original, in 3 different levels of spiceyness. Then there's the butter herb sauce and lastly the cream sauce. First time trying creole so let's go for the original with spicey level 2. It was pretty hot! So ya watch out! I've heard the mild is way too mild so maybe they need to work things out a little bit there! All in all.. Not too bad. The seafood was definitely fresh and this taste was new and interesting to me, albeit a bit small in size. (I'm used to eating big crabs local style with my black pepper or chilli!) On to the cold platter - again fresh seafood but nothing that wow for the price. Even oysters were super small! Maybe the size just enough to put on my \"orh lua\".Bag of clams we ordered the cream one, again it didn't really leave a mark to remember for me.Calamari was fresh and well battered and full of taste, not disappointed there!Lobster Roll, well I really like the lobster roll as I was pleasantly suprised how quite generous they were with the filling with the bread being very fluffy and tasty. ( I might just come back just for this!) It comes in pairs with some fries and a bit of salad, just nice for a small meal for one person.Moonshine Tiger Prawns; well if you're a minimalistic prawn lover. This is quite nice. I think it was a bit more fancier than anything else becoz they flambé it infront of you mixing 2 types of wines inside it. I heard it's a mix of both western and Chinese wines. The prawns tasted fresh, sweet with only small hints of the alcohol. It's nice but can be a bit gimmicky! Heh!Crab cakes were also fully loaded! Crispy and nice! Loved them!In conclusion, me being just ME, I can't help but to know what's already out there and already love the way locals cook our seafood. Places like jumbo, red house etc.. and still think that's the BEST way it should be done! But then I would be giving a BIASED 3stars. I DID however, could not say I didn't like any of the dishes and still it was really tasty with a spicy KICK and most importantly with fresh ingredients! Go ahead and try this place, I doubt you'll regret it. But after trying, I probably will be going back to my same old local haunts for my seafood fix! (Okok maybe ill back for the crab cakes and Lobster Rolls!) ;)Oh btw.. The damage for all that was almost exactly 70bucks per pax.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Bb5S7nG5KhduBk_0vg4ZA",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Crab in the tank",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Bb5S7nG5KhduBk_0vg4ZA/o.jpg"
      },
      {
        "img_id": "xN3jQM1A9UPMCzt_9ikFkA",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Moonshine Tiger Prawns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xN3jQM1A9UPMCzt_9ikFkA/o.jpg"
      },
      {
        "img_id": "-F5GI_c8gJ3VZpuBh8LU-g",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Crab Cakes come in a pair.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-F5GI_c8gJ3VZpuBh8LU-g/o.jpg"
      }
    ],
    "user_id": "jq7Pb7s68wi2NDTFEXvwbw"
  },
  "6r8xKVwcK_mkGGXnkxyMoQ": {
    "date": "8/8/2014",
    "text": "My husband is from Louisiana and I lived there so we knew we had to lower expectations when trying this place, but we didn't lower them enough. Nothing here resembles the special food of Louisiana. The gumbo is tomato, not roux, based and lacks filé and the holy trinity. The signature crab is too saucy and has way too much garlic. The cornbread looks and tastes like muffins made with cake flour and yellow food coloring. The fried oysters, though not really Cajun or Creole, were OK.Lesson learned: In Singapore, stick to pepper crab or chili crab and you'll be happy.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1CHT_Z5UG_sVUcCkYIuZcw"
  },
  "BZJSsD2y7bha9K3EJaaNrA": {
    "date": "10/23/2015",
    "text": "Fresh seafood, lovely drinks and side dishes. However the seafood combo signature sauce wasn't really delicious IMO. It overwhelmed the freshness of the seafood and we were struggling to finish the food towards the end. Their chicken wings were awesome though, and service crew very young and enthusiastic -- servers were all smiles and kept coming to play with my kids, but they can be a little clueless when you really need service. Still, I think this is a good place to have big gatherings and get a little rowdy and dirty (fingers), price-wise on the high side (we're talking about seafood here) but with Amex platinum card discounts can be quite substantial. Hope they can improve on kid service in terms of a kid-sized bib, kids meals and maybe a play area.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fXn6q2AZqll28q5JpkCyEw",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Chicken wings. Da bomb.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fXn6q2AZqll28q5JpkCyEw/o.jpg"
      },
      {
        "img_id": "mAFsk4kobrv3VG-T7d11cQ",
        "caption": "Photo of Dancing Crab - Singapore, Singapore. Combo A with signature spicy sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mAFsk4kobrv3VG-T7d11cQ/o.jpg"
      }
    ],
    "user_id": "xjMzK8Us6RcalMSKb-DZ5A"
  },
  "znUKEZxSEU7cVCdsYRtz3A": {
    "date": "5/2/2015",
    "text": "While the food is definitely fresh, fries are coated with a tad too much seasoning and salt...(the poor crabs are over-crowding and cramped in a tank with restricted movement for them)the spicy sauce is really too spicy (not even at the highest level of spiciness) for adults, would appreciate the waiter to caution customers before ordering (good that we are all spice-lover)However, its  distinctive beurre blanc sauce is perfect!the lobster roll/ bread can be easily done by any housewife who knows nothing about culinary (wish that it doesnt come with unhealthy fries and hence the price at S$30 can be further lowered instead)It can be quite costly just on the food alone! (w free water)The kids' fav- drawing wall area could be a haphazard place for service staff dishing out food...the place is pathetic with only two taps for hand-washing!Disliked its rigid reservation system (that doesnt take in any special request) on the website and phone system...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_x5sqWYKrsfaDlrGlalAQ"
  },
  "k0RVYG7oMY7m4VONweJFhQ": {
    "date": "6/12/2014",
    "text": "While Singapore is known for our chilli crabs, we do have other styles of seafood as well. Recently, seafood boil in Cajun style has been hitting our shores, with restaurants such as Crab in Da Bag, The Cajun Kings and Full of Crab being a few of the pioneers. However, a new kid on the block, Dancing Crab, is emerging as a strong competitor. Dancing Crab, backed by Tung Lok Group, is definitely here to stay and also determined to knock down all competition.The crab cakes were AMAZING. Chunks of succulent crab meat were used to make these crab cakes and deep fried to perfection. Crispy and yet not oily, these were the perfect light snacks to placate our rumbling tummies while waiting for our main courses.While the seafood gumbo did not amaze us like the crab cakes did, we have to commend the use of extremely fresh seafood in this dish. The prawns were firm and sweet while the shellfish were plump and fresh. However, the rice was too soft for my liking and the tomato sauce was just a tinge too thick. Nonetheless, this would be great to fill up the tummy if some carbs were what you were looking for in addition to the seafood.The star of the meal: Combo Bag #01, consisting of a huge Sri Lankan crab, 300g Prawns, 250g Mussels, Potatoes, Corn and Sausages. As mentioned, the seafood was super fresh, with the meat being succulent and sweet. We were told that only live seafood was used in order to maintain the freshness. At Dancing Crab, you also get to choose the type of sauce that you want your seafood to be cooked in. This was served in Dancing Crab Signature sauce (Mild) and I loved it. I also tried the Signature sauce in Spicy and Extra Spicy but preferred Mild out of the 3 as Mild was mostly tomato based. The spiciness, unlike Chilli Crab sauce, tasted like hot sauce (i.e. Tabasco sauce). So be warned, it's not the local type of chilli padi spiciness but Tabasco-like spiciness. So if you like tabasco, you may want to opt for the spicy sauce.So while fried mantous are dipped in the chilli crab gravy, cornbread is used at Dancing Crab instead. These cornbread tasted pretty good on their own as well and can be ordered as an appetiser too!We also had the Alaskan King Crab Legs, this time round in Herb Butter. The Herb Butter was delicious and slightly reminiscent of the spread on garlic bread. Once again, the crab meat was fresh and sweet and we really enjoyed the meat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdrtQOfdHihtseKEgr896w"
  }
}