{
  "Jclgz9kG7ZQsyFnnVuEqpg": {
    "date": "11/16/2018",
    "text": "I've avoided Din Tai Fung for years, wary of the wait, the prices and the hype. I was pleasantly surprised! I arrived early, so there was basically no wait. The food came quickly. The XLB were perfect -- thin skin and plenty of soup. The duck pastry was just okay. I was a little disappointed with the ambiance, which felt like a cheap Chinese restaurant from the 90s. Make sure to check your credit card receipt before you leave. As in most places in Singapore, the cashier manually enters the amount of your check into the machine. This time, she accidentally keyed in a 5 in place of a 2, overcharging me by 30 SGD, which I then had to dispute with my credit card company.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uDbyAUfKaKNKBK8n4M-kyg",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. XLB 11.33 SGD",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uDbyAUfKaKNKBK8n4M-kyg/o.jpg"
      },
      {
        "img_id": "EJwMET6H8ZbSkgEuM_hLlw",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Duck pastry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EJwMET6H8ZbSkgEuM_hLlw/o.jpg"
      }
    ],
    "user_id": "nrAmtxW718JcrJGA3AwUQg"
  },
  "cVTe5IVr1Mw_2jQXw4MB-Q": {
    "date": "6/22/2018",
    "text": "A really great place to enjoy a good dim-sum meal with a friend.A little pricey but service is really great. Very attentive staff. Great food as well.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "lfoCpRQNjvi2dvKGm0kWtQ"
  },
  "Tu2XZzv276WGhBfxmc_Jsg": {
    "date": "6/24/2017",
    "text": "Excellent service & delicious food. We decided to pop in for some dumplings as there was no line, a rare occupancy if you've ever been pass a Din Tai Fung. We ordered wan tans in black vinegar and chilli oil - these were filled with flavour, I think these were the best wantans I've ever had. We of course ordered xiao long Bao which were as expected, delicious. The pork baos were great too and the sui mai was beautifully presented with a shrimp on top of each one. The service was attentive. The waitresses filled up our tea after every couple of sips. I would definitely recommend this Din Tai Fung. Arriving early will save you lining up too!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PRteYqhKAfgTkiR_HUWwYw",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Suimai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PRteYqhKAfgTkiR_HUWwYw/o.jpg"
      },
      {
        "img_id": "AKCIB5Qiwwu-QIRvbwinRw",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Baos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AKCIB5Qiwwu-QIRvbwinRw/o.jpg"
      },
      {
        "img_id": "xIja8osxNjLzP0pQtrs1GA",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xIja8osxNjLzP0pQtrs1GA/o.jpg"
      }
    ],
    "user_id": "UCromCPHXYozYaDt-gRdgA"
  },
  "g8VfCnZtBZMqKl1qJFBMKw": {
    "date": "5/11/2017",
    "text": "Well had the off chance looking for ozone of my favorite dim sum restaurants I experienced in Taiwan.Was super happy they have multiple locations in Singapore. One was just a short walk from my hotel in China town. Located in the shopping center right near Chinatown MRT station.I placed my order for Steamed pork and vegetable dumplings, a set of 10.A set of 10 pork and shrimp shumai,Wonton pork and shrimp soup.Egg fried rice and jasmine tea.Also had a frozen mango pudding!!The service is as fast as expected. Since the cooks make the dumplings fresh for each order. The waiters bring each part of the order as they come from the kitchen. I'm glad I came on a weekday. Weekends can be a long time waiting for a seat. This chain Resturant is very popular and often has full booking.The price is average for the meal and I don't mind the price for the quality of meal I received.Totally recommend This Resturant for the Dim sum hunter!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hkHJkXZvxZU-BabFlD8mtw",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Frozen mango pudding",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hkHJkXZvxZU-BabFlD8mtw/o.jpg"
      },
      {
        "img_id": "f5Q4-HBvLmgYxmDNoC7AzA",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f5Q4-HBvLmgYxmDNoC7AzA/o.jpg"
      },
      {
        "img_id": "bFmrBfUx91eAJxRkLC08AQ",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Pork and shrimp wonton",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bFmrBfUx91eAJxRkLC08AQ/o.jpg"
      }
    ],
    "user_id": "Dy21CGlNTRyL8GfVAwOy-w"
  },
  "Hrrj68BX7eO4yw_uX9rEGg": {
    "date": "6/6/2015",
    "text": "I first discovered Din Tai Fung in Bellevue, Washington (US) and I really liked their dumplings and wontons. It's very hard to eat Din Tai Fung in the United States since there are like no chains, but in Singapore there were at least two in a one mile radius or so!This one is in a shopping center with multiple levels.The waitstaff mostly speaks Chinese but they can speak English too.The menu is not much different from the one in Bellevue. We got the xiao long bao and the spicy chili wontons. The xiao long bao tasted like what I expected. The chili wonton sauce looked a bit different from the ones I was expecting but they were still good!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BN1gz2NBQV8IBegrcFCPJA",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BN1gz2NBQV8IBegrcFCPJA/o.jpg"
      },
      {
        "img_id": "-OFGbfc6llY3uI7b-6rV-g",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-OFGbfc6llY3uI7b-6rV-g/o.jpg"
      }
    ],
    "user_id": "taPq7IxYskEWH7Vfc261pQ"
  },
  "IRmDHjG8gok_l4KYEp7bKA": {
    "date": "2/5/2016",
    "text": "I really enjoyed their starter salad. It's got bits of tau gwa, vermicelli and seaweed and their special sauce. They also have very nice xiao long bao of course. Soft skins and juicy, tasty pork fillings. In terms of lamian, I enjoyed their chill sauce tossed one. What caught me unaware was their beef brisket lamian soup, my uncle ordered that and I thought I'll just try it. Wow! The beef chunks were so soft and tasty!! The soup broth was also hearty and flavourful! Totally enjoyable!Overall awesome meal!!!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "8rvRPDPXYBAwUI9DUpvBDA": {
    "date": "9/18/2016",
    "text": "Giving it 4 stars because of its uniqueness and quality. The food was great but because of friends I know who have came to this restaurant I expected more than great . Anyway try the dumplings. I've had better tasting dumplings but theirs is mellow tasting and have that curiosity with it. It tasted like a lot of effort made into one dumpling. Once you bite into it expect a lot of juice from it. Also try the black sesame type dessert. Now this one was my favorite.  I won't mind recommending this restaurant to my friends. Heads up though. Prices here aren't that cheap. I paid around over $100 for four people for dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BqfJIQlXr13Xq_WeAM7bdw",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. So perfect. Just had to take a picture.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BqfJIQlXr13Xq_WeAM7bdw/o.jpg"
      },
      {
        "img_id": "-0YTwsKpTqUx8PlOEET0Dg",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. I forgot what type of vegetable.The sauce that goes with it is good. Better than the other 3 I tasted here in Singapore.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-0YTwsKpTqUx8PlOEET0Dg/o.jpg"
      },
      {
        "img_id": "T4BtnUG4Ujug3_tXMHS1UA",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Black sesame. Sweet but not too sweet.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T4BtnUG4Ujug3_tXMHS1UA/o.jpg"
      }
    ],
    "user_id": "vV2MaHfBRsq_613BD1cx4Q"
  },
  "-uPykXhMTZzGleFajYXGLw": {
    "date": "7/3/2016",
    "text": "Din Tai Fung@Chinatown Point. I'm a huge fan of their original dumplings. No idea if you guys know that if you find any broken dumplings upon arrival, they will gift you another serving of dumplings (FOR FREE, YAY!).Pork cutlet fried rice is my favorite too! If you look closely, you can see that each rice is wrapped nicely with the egg scrambled in.Another recommendation is the earl grey iced tea. PLEASE, PLEASE, ORDER THIS DRINK whenever you are there. You will never regret it. Word. Really, lah! It gives your ordinary earl grey/lemon tea a very refreshing twist. I'm going to keep you in suspense here of how it looks like, because I want you to feel the same happiness as I would whenever I order this. I have never had the same drink in any other restaurants.This is the place I A-L-W-A-Y-S bring my co-workers (who mainly come from the states or Europe) here at this outlet because 1) it is near our office, and 2) less crowded. Come on, you do know that DTF is so crowded during lunch and dinner hours right? Hate the crowd? This is the SECRET place. You know I know okay!Did not give five stars because the service hasn't been that attentive. It will take a bit longer for the staff to notice you, and this has been consistent. Hence, four stars.So.... manage your expectations for the speed of service!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RquBfxSJLrM_K5wk2vU2gw"
  },
  "kplzCjMwPck2X_S3RU7z-w": {
    "date": "4/25/2013",
    "text": "I went to this Din Tai Fung twice within 6 hours...AsiaOne polled fans for favourite brands, and Banana Leaf Apolo and DIn Tai Fung made the list for 2013 Best Asian and Best Chinese respectively. stasiareport.com/premium…  Today I had 2 hours free from client obligations, so I made a dash to Banana Leaf Apolo for lunch and then stopped at this Din Tai Fung right before dinner, though not hungry at all.  I didn't order the famous juicy pork xiao long baos.  While walking back to the hotel, I felt that it would be remiss not to have eaten the xiao long baos, so rather than living with regret for the next 12 months, decided to come back at 9pm after dinner.  I could have had Din Tai Fung in Taipei two days ago at the location where Tom Cruise learned to make the juicy pork dumplings with the owner...but I was staying too far away from the city.  Here's the newspaper clipping that this DTF displayed.  yelp.com/biz_photos/din-…The fare is as expected.  The menu offerings are pretty similar to the other DTFs in Singapore.  Here, instead of a busboy or wait staff dropping off orders on the table, someone from the kitchen will come out with several tables' orders and deliver directly.  It's smart since the risk of miscommunication (orders to the wrong table, etc) would be next to nil.Service is friendly though not forgiving.  They don't call the xiao long baos \"juicy pork dumplings\" as they do in the states.  Simplified Chinese characters, conducive to Singapore, is my pet peeve so if you can't read, be sure to match up the item number from the menu with the item number on the order form.  A lot of the dumplings sound similar in their English descriptions but are different things entirely.When the dumplings arrived, I was disappointed in myself.  I ordered the wrong thing that cost more, compared to the xiao long baos.  I had made a special trip tonight to eat dinner #2, so I asked the waiter if I can just pay the price of the more expensive dumplings and get the XLBs instead but he said no, so looks like once the bamboo basket hits your table, the sale is final.  What to order here?Oriental Wanton with Black Vinegar and Chili Oil:  In Los Angeles, these are called \"Vegetable and pork wonton in spicy sauce.\"  The sauce itself is the most delicious part.  Order a bowl of white rice or something and eat that sauce!Vegetable and Pork Dumplings: Looks like these also have 18 folds and a little bit of soup inside.  I used the tableside chili for additional taste.Steamed Pork and Chili Crab bun:  Just set aside S$50 and eat a real Chili Crab instead.  Last year at the DTF Marina Bay Sands, they ran out of these and I was :( not being able to try one, but turns out I was :( for nothing.Steamed Pork Dumpling: In Los Angeles, these are aptly named Juicy Pork Dumpling and these are what made Din Tai Fung famous.  Just make sure you order one of these (despite people saying these are overrated)  so you won't regret not doing it and have to come back in 6 hours to eat dinner #2 before saying goodbye to Singapore!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "keRa6nKdlp7TEG-TChOHaQ",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. The view from DTF",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/keRa6nKdlp7TEG-TChOHaQ/o.jpg"
      },
      {
        "img_id": "SCxjmKOZrTQc2JW39Ft36A",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. Dining area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SCxjmKOZrTQc2JW39Ft36A/o.jpg"
      },
      {
        "img_id": "RKLJqLcZkSHE5honCpY9cQ",
        "caption": "Photo of Din Tai Fung - Singapore, Singapore. sample ticket.  $1 for tea",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RKLJqLcZkSHE5honCpY9cQ/o.jpg"
      }
    ],
    "user_id": "wh4_AwDV2NSsZ-LEmNWffg"
  },
  "DeeMV_PAwcvVNrBrk1jqRA": {
    "date": "3/3/2017",
    "text": "This was my least favorite branch of the famous dumpling chain.  The food was good and consistent with other locations, but the atmosphere and service felt flat.  There's a more robust location in the suntec center.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ss8VEYHv_Ram2iGQ8ucxug"
  },
  "n1Tj6s1ye9ct6Na6EDqDAw": {
    "date": "2/26/2017",
    "text": "The steamed pork dumplings oh my god.  Divine.  I probably looked like a idiot shoving them in my mouth.  Also loved the spicy cucumber dish....was very tangy and tasty!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Glm-8-Q-bQN_gL358remqg"
  },
  "KoBW-mdihE_5L8fOdb24JQ": {
    "date": "7/16/2016",
    "text": "I was looking forward to some great dumplings but was fairly disappointed - the chicken were flavorless and the prawn and pork only slightly better. Service was quick and we were in and out in a flash, sadly the good was nothing to write home about.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwwD7LU4dgOf2Bt-z_5YxA"
  },
  "4ozgccpr9IEvYcKkTkIGNw": {
    "date": "3/29/2014",
    "text": "I once naively thought that all Din Tai Fungs were created equal.I now know better. This branch does not have the truffle xiao long bao (which is awesome and you should totally try it if you haven't).It does do everything else as you'd expect of a Din Tai Fung, and admittedly it's less crowded than most of the other branches, but not having one of my staple menu items does mean it's generally just not as good as most Din Tai Fung branches in my eyes.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "rENk52c6ooKjs7Gs8LZ17w": {
    "date": "5/14/2015",
    "text": "My go-to comfort spot for xiao long bao. I find this outlet to always have available spots, so there's never any of the dreaded wait as there typically are in other outlets around Singapore (and, actually, around the world if you think about it). Their fried rice is very good too, as are many other of their dishes. While you might be tempted to chomp down an entire 10 piece order of the xiao long bao, do save some space for some of their other dishes. I always find it a bit pricier than Paradise Dynasty, but it's never anything too scandalous (for Singapore, anyways). Also, while you're there, why not enjoy a nice Taiwan Beer?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zrT9ajIiHc_wUi-pC77aaQ"
  },
  "mG10ZWzhrZqays5MWRAA1Q": {
    "date": "7/31/2013",
    "text": "The Steamed pork dumplings or xiao long baos are really fantastic here. Add some black vinegar + ginger as a condiment and they make a delicious, juicy mouthful.My office-mates either loved or hated it and those that hated it did so mainly because of the price. Their argument is that you can get as good a quality food from the hawker store nearby, and that is true. But for something different Din Tai Fung is a nice option.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9HxQ24U3rfvQCbGHsEQvQ"
  },
  "U3cnsfTgilUlRJgSiP4eRw": {
    "date": "12/19/2013",
    "text": "I am not really a fan of Xiao long bao. but sister's bf is picky on food... a plate of duck spring roll is expensive... I can get a plate of duck for the same price but I get duck. Din Tai Fung only give me 6 tiny slice of duck.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wi6SGtwS5ff8OLchrfAvEA"
  }
}