{
  "RSKE6h_4rmWL8jxJnTByFQ": {
    "date": "7/28/2016",
    "text": "We were at Lolla for a reunion, there were ten of us altogether, seated at the communal table. First and foremost, I must commend the staff at Lolla. They are friendly without being overbearing, considerate, and truly appear to want you to have a good time; all of the staff seem to really take pride in their jobs. I find this so refreshing as it is rare to encounter this in Singapore eateries. We tried almost everything that was on the menu, and the specials that were available that night. We found that for the food, there were some hits and some misses, but generally, we were happy with the offerings. The wine list is extensive, and we enjoyed most of the bottles we had. That said, the price is a tad too high for the amount of food you get, and even though we ordered multiples of each plate, the sizes of some dishes were too small to be shared. But we will definitely be back because we really appreciated the way this restaurant is ran.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Fo5D5l8DsROK6roOgZCeQ"
  },
  "wrmn8EtRVWoAfZphNk-YCw": {
    "date": "7/5/2015",
    "text": "First impression as you walk in: the place smells! A little oily, and a little fishy-smelling.. The food's good though! It's a little awkward that the board with the specials are at one's back, and the servers don't seem very familiar with the daily offerings.Not impressed with the wine selections - I believe there were only 3 or 4 each of the white / red, and paying $20+ for a glass of average rioja's a bit rich if you ask me",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsIVj_AszmnnsykBrKgdHw"
  },
  "sS8S1INhx8m3LZsdL74osQ": {
    "date": "8/16/2015",
    "text": "Food is creative and decadent. Atmosphere is quite hip and european. We didnt get the umi, but we will next time. Food 4*. Atmosphere 5*. I round up to 5*",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "xrQfwNWI5gPYWKiuH4zlgw": {
    "date": "1/8/2013",
    "text": "Lolla is a pretty new place, well-located on buzzy Ann Siang Hill.  It's a pretty intimate by-the-bar dining, small plates kind of place.  It also has a private dining room in a basement area - that's where I had the chance to try out lots of their food!I like that Lolla has a very cool, slightly industrial feel to it what with its concrete flooring and wire cage lampshades.  Great place for hanging out with friends or even a casual date.  And, as they proudly advertise, they've made a lot of effort in selecting their providores for their bread, meat, seafood, cheese, ice cream etc.  I found the ingredients, on the whole, to be very good quality.  Also, given Lolla's ownership (the name Lolla derives from an owner's wine boutique Lollapalooza), there's naturally an extensive selection of wine and other booze. Highlights for me including the uni/squid ink chawanmushi.  Personally found it a bit strong-tasting, but certainly a unique and daring dish which many of my friends enjoyed.  The steak was brilliant in texture and flavour, and though it's simple, their duck fat roasted potatoes were beautiful and addictive.  Lolla's donuts with lemon curd were sinfully delicious too.Yet, there were also some shortcomings to the place.  The main one was the Mozambique prawns dish.  Unfortunately the prawn meat stuck to the shells something fierce, usually an indication of the prawns not being fresh.  I thought that was a real miss given the emphasis on the ingredients.  Also, dishes like the spatchcock and lamb ribs were pleasant but somewhat bland.On a side note, I found myself wishing for more descriptive item listings on the menu, instead of plain \"grass-fed ribeye steak\" or \"sea urchin pudding.\"  But perhaps that's because they want to keep the focus on the main ingredients.I'd really like to give this place a higher rating (3.5* would be a more accurate reflection of my sentiments) but I just didn't find the place outstanding enough to claim that \"I'm a fan.\"  Especially given the price points and portion sizes... So whilst my dining experience was a good one all-in-all, I'm not in any hurry to head back again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "qvVaHr04qHp-iooOBzJk3A"
  },
  "i_KDRMSsk9qQkqW_T7HX7w": {
    "date": "6/23/2014",
    "text": "Lovely food and service. I chose to eat the specials,  and it was all amazing,  right to dessert.Great atmosphere. Recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nMeagx5rAUZEN6iingKQRA"
  },
  "xdfXZVRAW4uyJguL76Lydw": {
    "date": "6/28/2016",
    "text": "Amazing food -- we had Manchego, lamb, tomato salad, avocado, and bread with butter, and it was all exceptional. The avocado was especially delicious -- it sounds plain on the menu but has feta and bread crumbs and pine nuts, and it's really, really good. But best of all, the staff, who was incredibly nice all night, helped me find my credit card, which I had dropped on the street near the restaurant after leaving. They got out flashlights and got on their hands and knees and everything. Such incredible kindness after a delicious meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTXkG5QET-yz6y9Br4zj6w"
  },
  "9CnMWqHC_9yK3sa3qvn2yA": {
    "date": "11/21/2012",
    "text": "A wonderful little restaurant with very attentive friendly service. You won't go wrong either sitting and eating at the bar with the open kitchen concept, or outside at one of the little tables taking in the quaint shop house-feel or downstairs at the tables and benches for a communal experience.  But, the portions of the plates are very small, and considering the price and the fact that none of them really blew me away, I'm not all that impressed. We had the beef tongue, pig tails, sea urchin pudding, goose fat potatoes and the spanish tortilla with smoked eel. They were all...meh.All in all, nice restaurant with good service. Food was okay and sort of painful given the price and what you get.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyeTkSzxaW_ZnDNgnb2xDg"
  },
  "0gjg82Yg2lYcArr5_tVb8g": {
    "date": "12/27/2013",
    "text": "Loved the atmosphere. We came for lunch with another couple and had a great time. The chef was friendly and interacted with us. We recommend the sea urchin pudding, the Iberico pork collar, the salad with buffalo mozzarella & prosciutto, and the chocolate pudding. Will have to come back to try some of the other dishes. The toilets are nice, as is the communal dining table downstairs.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GFW4odivS5Fh7P85R8pPUg"
  },
  "aP_lIlEywfWaZQHL6lah6g": {
    "date": "5/20/2013",
    "text": "The uni pudding is genius. Velvety decadence on your tongue. I'd go back just for this. Was fun watching the young chefs work in the open kitchen. I very much prefer sitting at the bar than the communal table downstairs. Agreed with an earlier reviewer on the soft shell crabs. Too oily and gut busting. I stayed away from that. I don't recall much else, save for the desserts. The doughnut fritters (?) were lovely. Incredibly light and fluffy and totally hit the sweet spot for me. I also liked the smokey chocolate ice cream which I understand is from Creamier. Service was good with friendly and helpful servers.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Imxj8nYyM2Vw56l2y1noQ"
  },
  "Ky0EeEB9Rx7gZDvJGAPg5w": {
    "date": "5/27/2013",
    "text": "If there would be a 3.5 star rating, I certainly would have given them half star more. I'm a fan of the open kitchen and for the chef to be interacting with the patrons of the restaurant. Food here is really creative. And what you've read is all true about the squidink pudding with sea urchin. Yum! place is rather friendly for vegans as well. I enjoyed the portabello mushroom with mango salsa. Go with a friend or not :) you'll be entertained if you're a fan of cooking",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNN55srvPlGIPSHm8G0B_g"
  },
  "ILsS6kn9I9ALClGRz5rINA": {
    "date": "4/11/2013",
    "text": "I like this restaurant, don't get me wrong. I would have given it 4 stars if the prices were a tad lower. The dishes were all solid. My only complaint is that there wasn't a dish that was outstanding, and they could go a little lighter on the oil. I had the uni pudding to start. The uni wasn't the freshest, but the dish was only 19 bucks which is low for that much uni. It was fresh enough though, and I really like how it compliments with the pudding. The pudding is an extraordinary plethora of flavors which I can't really pinpoint. Squid ink, tomato, black garlic and maybe soy? I'm baffled, in a good way. I really have to give this dish high points, and I would have deemed it outstanding if not for the fact that the pudding was a little too thick, hence the dish was a tad too heavy. The baguette with home made tomato sauce was tasty and nicely toasted, loved the garlic. The duck fat potatoes were melt-in-your-mouth little balls of fatty goodness. The frisee salad with anchovies and garlic was a tad too heavy for my liking, too much oil dressing. The pork collar was well done and a solid dish. And I love the carafes of white wine...",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "lWtngWzfQ3_afuAY9VCEDA": {
    "date": "7/1/2016",
    "text": "Came here for lunch to try the sea urchin and squid ink pudding. Didn't really like the pudding, but I generally don't enjoy squid ink. Wouldn't have ordered if I knew that was what the pudding was made of.The grilled octopus was nice and fun to watch getting grilled. Pork was average. Bread was average. Duck fat fries average. Small portions, shared among 3 people (later went to Maxwell eat some more).But I think I will still return to try the avocado.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ndgHYecgAWEqtjnjE7LtfA"
  },
  "udOzbdKGiLiuqrjTrcQJZA": {
    "date": "4/1/2018",
    "text": "Came here on a Sunday night with my girlfriend - online reservations weren't available so I'm really glad we decided to visit Club Street and stroll by anyway, because we were able to get a seat right in front of the chefs. The food was amazing - highly recommend each of these dishes: grilled avocados, sauteed kale, chorizo with egg, duck fat potatoes and the steak. We had all of that with a bottle of Cotes du Rhone. Then we treated ourselves to donuts with lemon curd at the end. Simply scrumptious. The price for two was high (~$350 Singapore dollars) but so was the quality of the food and the service. We almost had the place to ourselves, so the chefs told us all about the dishes they were preparing for us.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "40BGvjjB6H9WdAvDKJBUAQ",
        "caption": "Photo of Lolla - Singapore, Singapore. For dessert - donuts with lemon kurd",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/40BGvjjB6H9WdAvDKJBUAQ/o.jpg"
      },
      {
        "img_id": "tvEQG3NtzI4OgHXdSgaXdQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Chorizo with egg and duck fat potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tvEQG3NtzI4OgHXdSgaXdQ/o.jpg"
      },
      {
        "img_id": "P2b1XyGHtKfmOODloy4BPA",
        "caption": "Photo of Lolla - Singapore, Singapore. We had a front row view of the action",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P2b1XyGHtKfmOODloy4BPA/o.jpg"
      }
    ],
    "user_id": "JHY6J7Z3MJY5WsivAEDr3Q"
  },
  "JjGbYAQZhVH1lbtgqNmxJQ": {
    "date": "5/23/2016",
    "text": "One of the best restaurants located along Ann Siang Road, a small enclave within Chinatown area. Let's face it, the F&B business in this very densely populated part of the city must be so competitive that chefs must think of a way to sustain their business, to keep customers coming back asking for more. You probably have read all the glowing reviews from other yelpers about this small establishment, how the sea urchin pudding changed their lives and a great selection of wine list. I have to agree. The sea urchin pudding is smaller than I imagined, but of course, with pieces of these rich bright orange goodness, it would be too cloying to eat a portion more than the size of your fist.  We started off the evening with a bottle of Chapuy Brut Tradition NV, a light and refreshing bottle of champagne to set the pace for the night. We were then served with the house specialty of sourdough with kombu butter. Kombu is a type of kelp and once mixed with butter, it gave a distinct salty taste to it and paired perfectly with the warm sourdough. Up next is the sea urchin pudding where everyone polished up the small cup-like pudding almost immediately. One of my friends actually commented that the pudding actually tastes slightly like mashed century egg, just less pungent. Mixed cured meat ensued where various cold cuts of lamb and beef were presented to our table.By now, we were almost done with the bottle of champagne and ready to proceed with our second bottle for the night -  Pazo de Senorans, 2014 from the Albarino, Spain region.  It was good. Then came three other dishes - tuna belly \"chutoro\" tartare, grilled avocado and grilled iberico pork collar. The tuna belly and grilled avocado were delicious. I am not an avocado fan (gosh, taste like tasteless butter!) but it was served warm with a dollop of cream cheese with bits of pieces of crispy bacon (I think). The pork collar somehow reminded me of char siew.Overall, a great place to bring your date or just a gathering with friends alike. We were seated at the private dining area located at the basement of the restaurant and away from the kitchen, so there was no funky smell on our body and hair after dinner. Service was good without being too annoyingly attentive. It gets very busy towards weekend so make sure you reserve a table well in advance.  And speaking of sustaining their business, it is eminent that Lolla has created a buzz with its best seller along with a range of other well executed dishes that attracts customers from near and afar and regulars coming back for more. Now, that's smart.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "mUGsW-KKAPlbHUjWf2oW5A",
        "caption": "Photo of Lolla - Singapore, Singapore. Brunch menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mUGsW-KKAPlbHUjWf2oW5A/o.jpg"
      },
      {
        "img_id": "RWqCtzbBQBxi3XoBwRriUQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Grilled avocado - never thought ill say this, but GOOD STUFF!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RWqCtzbBQBxi3XoBwRriUQ/o.jpg"
      },
      {
        "img_id": "Vi7jYQ3Y6VzQs86q1ogTiw",
        "caption": "Photo of Lolla - Singapore, Singapore. Tuna belly 'chutoro tartare",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vi7jYQ3Y6VzQs86q1ogTiw/o.jpg"
      }
    ],
    "user_id": "K4ZeG8WAPfTS1AjD5GoJTw"
  },
  "Nmc391M9BGKIhfDWgkLIqQ": {
    "date": "6/18/2015",
    "text": "Came here on a Wednesday night for dinner with a companion. Overall, I was pleasantly surprised by the food. We had the full-sized signature uni pudding to start, and cold inky goodness topped with sea urchin; can't quite go wrong. If you are a fan of rich, rich, food, this may appeal strongly to you. Yum! Following the pudding, we had bread and kombu butter - full of umami and salty goodness. I love butter. Butter butter butter, oi oi oi! Next up: beef tongue with red cabbage, and duck fat potatoes. The beef tongue was tender, and paired well with the crunch of the cabbage. Ordinary and simple. The duck fat potatoes were as expected, crispy, soft, fragrant, and I requested for some garlic aioli to eat them with - much better with a sauce!Specials - grilled avocado topped with pickled fennel, pine nuts, and the beef short rib with watercress and couscous. Oh I really loved the avocado. Warm, rich, smokey, grilled, and the richness offset by the tang of the pickled fennel.  Short rib was soft, couscous was not spiced and did not detract/distract. Watercress is a slightly cumbersome veggie to eat, but whatever.I deducted one star because of their wine list, because they have very unique French/Spanish wines, with none of your usual Merlot/Chardonnay/Shiraz/SSB/etc. It was pretty hard to pick a wine, when the \"sommelier\" wasn't of much help. We went for a bottle of Sela, which is as good a gamble as any. The wine list isn't too expensive, but given nobody knows the varieties well enough, it is hard to gauge value. They should probably have a more educated wine professional in the house. All in all, a very good meal.P.S. If you are female, do not wash your hair if you're eating here, at the counter, because you will smell of cooking after your meal. I don't know if your Hermes bag would catch some smells, but play safe and leave it at home.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "moIGPQBSiXLRr6vu6hZDfA",
        "caption": "Photo of Lolla - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/moIGPQBSiXLRr6vu6hZDfA/o.jpg"
      },
      {
        "img_id": "2nt4GOmVHCSFk7gIhoRO7g",
        "caption": "Photo of Lolla - Singapore, Singapore. Red.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2nt4GOmVHCSFk7gIhoRO7g/o.jpg"
      },
      {
        "img_id": "hQSWX3_NawlCu05Lc0HvDw",
        "caption": "Photo of Lolla - Singapore, Singapore. Short rib, watercress.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hQSWX3_NawlCu05Lc0HvDw/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "PrVLsVscMiiw5vy154eFlQ": {
    "date": "10/1/2017",
    "text": "Very much want to like this place but unfortunately based on the overall experience think u are better heading to Burnt Ends which perhaps more expensive but service extremely attentive.  What was a big minus for us was that we were there on a Sunday afternoon without many customers.  Ordered Urchin, fennel, beef, tongue, leek, pork,egg eel, squid,tuna.  Can u imagine everything coming in at almost the same time.  The food is cold by the time we get to eat it.  Looks like the staff is eager to get the orders out of the way then to making sure customers enjoy the experience.  Their focus seems to be more on their kitchen prep for dinner? Did not see the chef tasting the food before it goes out.  Fennel under seasoned. Pork belly dry. Stuffed squid under-whelmed.  Did love the donut :).  Steak was good.  Not sure why the menu on web was different from what was there. I would prefer the octopus and pork collar.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WUeqz6xCukptrx2FFXk7pw",
        "caption": "Photo of Lolla - Singapore, Singapore. To gue",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WUeqz6xCukptrx2FFXk7pw/o.jpg"
      },
      {
        "img_id": "S-FiZrsckWeb1Ma2sRqe5w",
        "caption": "Photo of Lolla - Singapore, Singapore. Tongue",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S-FiZrsckWeb1Ma2sRqe5w/o.jpg"
      },
      {
        "img_id": "vP3bpuTnCcsxm6qq0kKYxQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Eel",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vP3bpuTnCcsxm6qq0kKYxQ/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "aIDQGO5U7TK84wM1cJCTdg": {
    "date": "5/3/2016",
    "text": "Easy online reservation system, attentive services... It is a little pricey but the food is the bomb!  Love their signature uni squid pudding.  It does not look like much but it is very rich, so sharing is caring :)The other dishes we ordered were also very nicely executed.  Especially love the sourdough with kombu butter and the duck fat potatoes.  Not a big fan of the counter seating / communal table setup.  And yes, the chairs were uncomfortable but will definitely return for the food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5PjLpeM7Nr5T2n4MudO5MA",
        "caption": "Photo of Lolla - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5PjLpeM7Nr5T2n4MudO5MA/o.jpg"
      },
      {
        "img_id": "SvixzXPJN5FEbZ8Wuu4e3A",
        "caption": "Photo of Lolla - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SvixzXPJN5FEbZ8Wuu4e3A/o.jpg"
      },
      {
        "img_id": "WIb-YU-gfoZkLmDIX4eXRg",
        "caption": "Photo of Lolla - Singapore, Singapore. Duck fat potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WIb-YU-gfoZkLmDIX4eXRg/o.jpg"
      }
    ],
    "user_id": "2tOny3tty9BlhrGRLWPHqA"
  },
  "5xks58ttrYaor9XLUaSqXg": {
    "date": "3/18/2018",
    "text": "Tuna belly tartare was good, sea urchin pudding was an interesting experience (no regrets, but once was enough for me), chocolate pudding was delicious. Would come back sometime.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEuN03y0jBQY4epKq1xwAQ"
  },
  "mkOp03bO-oNiE1jSM-Ga3Q": {
    "date": "2/19/2016",
    "text": "Great little dishes... The burratina, duck fat potatoes, and the hiberico pork collars are must haves.The communal table downstairs is great for a group. The bar upstairs is interesting if you are into Hells Kitchen like TV shows--minus Ramsey screaming... the head chef is friendlier then him, even talks to you if you have questions! :-)Ok service (not a given in Singapore) and a never ending list of (expensive) wines make this one of my favorites in Singapore. Will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fObhRLyqX1ZnSOgASGdW1A",
        "caption": "Photo of Lolla - Singapore, Singapore. Upstairs bar with kitchen view",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fObhRLyqX1ZnSOgASGdW1A/o.jpg"
      },
      {
        "img_id": "v9WfZ8VgEcp4ipfGwKw6kQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Burratina",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v9WfZ8VgEcp4ipfGwKw6kQ/o.jpg"
      }
    ],
    "user_id": "Nv_gr_ujHLRQ8_y0MjfKnw"
  },
  "CX1p-OTrbsOKSxMFsk68KQ": {
    "date": "7/21/2015",
    "text": "The sea urchin pudding was definitely worth the drive over! The wait staff were very attentive, and I love the the way the place looked.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mwg3pXmwQsHJcAxMoU852w",
        "caption": "Photo of Lolla - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mwg3pXmwQsHJcAxMoU852w/o.jpg"
      },
      {
        "img_id": "9Pk9iFs4-64pWSZ6P9224A",
        "caption": "Photo of Lolla - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Pk9iFs4-64pWSZ6P9224A/o.jpg"
      }
    ],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "e8Dj0pKO4rDkbSjqwlEiGg": {
    "date": "4/8/2017",
    "text": "Visited Lolla for dinner and very much enjoyed the experience. The uni squid pudding was a big hit, and we really enjoyed the lamb and duck fat roasted potatoes. The small plates are very easy to share, but also somewhat expensive for the quantity of food. We sat at the bar and enjoyed watching the preparation of the dishes by the chefs. All in all, it was a fun place for a date night!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ah5q6PLi5LSVEtBr5bU8pw"
  },
  "qZHHsAW1V_6V_zrsAz81aQ": {
    "date": "2/16/2013",
    "text": "This was probably one of the best dinners I had in a long time with loads of good food and great wine (the friend that I was with is a sommelier so I dont think his recommendations can go any wrong).What I really like is the concept is interesting. If you could get the live station seats and enjoy your meal while checking out how the chef create the little \"miracles\" that he's serving, that's like the ultimate. But luck wasnt on our side and we were place in the communal basement which also has a pretty cool concept but personally felt that its not as ideal.When banished into the dungeon, the ceiling is pretty low and with concrete and glass mirrors all around you, not forgetting the LOUD music that they play (though the music selection is not horrendous), one will find holding a conversation extremely tough. The acoustics is terrible cos the sounds were bouncing off the walls and every corner of the room. For the first half of my dinner, we were seated right beside a group of six who were engaging in an animated conversation, I could hardly hear my friend from across the table. Fortunately the group left and we could change our seats from the centre of the large communal table to the side. Dinner was a lot more pleasant cos I could finally enjoy my food properly without having to stretch my neck just to hear my friend has to say.What we had:Cinco Jotas Jamón Ibérico de Bellota Hokkaido Scallop CappacioSea Urchin Pudding -- This is the restaurants MUST TRY dish so dont miss out!Grass-fed Rib Eye SteakOther must-trys:Any of their eggsGoose Fat PotatoesAs for dessert, I was told the Donut and Lemon curd is not too bad but cos we were so full from the meal, there was no more space for dessert.If you want to head to Lolla, do go down early cos seats are allocated on a first come first serve basis.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G_fnDGVfJJl9OjM2ghesaA",
        "caption": "Photo of Lolla - Singapore, Singapore. Large communal table in the basement",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G_fnDGVfJJl9OjM2ghesaA/o.jpg"
      },
      {
        "img_id": "tvxOFvuyVQXhf4Sf6XYpQA",
        "caption": "Photo of Lolla - Singapore, Singapore. Sea Urchin Pudding -- This is the restaurants MUST TRY dish so dont miss out!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tvxOFvuyVQXhf4Sf6XYpQA/o.jpg"
      },
      {
        "img_id": "9XG8l0OTbdFIKBq05q9MQQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Grass-fed Rib Eye Steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9XG8l0OTbdFIKBq05q9MQQ/o.jpg"
      }
    ],
    "user_id": "nbYBWghA9fWHz-0JokGotA"
  },
  "0fQ2zmsUBag7FOpDYpiRcA": {
    "date": "10/23/2014",
    "text": "Thank you Singapore for yet another great find when I was not really trying; Lolla was empty when we entered at 7:00pm on a Tuesday, so we were uncertain what to expect, but by 8:00pm the place was packed.I surmise that the good, honestly and friendly service we got at the bar overlooking the kitchen and flavoursome meals must have got around.I do question the claim on the menu that they simply like to let the ingredient a speak; as I found there was rather a lot going on in all the dishes I tried... though it does not shake my certainty that it was a tasty meal.If you are after a recommendation, try both the soft egg salad (tradition caesar) and chocolate pudding (with vanilla ice-cream).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QO29xu_kDLJIqFL6c4J4Aw",
        "caption": "Photo of Lolla - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QO29xu_kDLJIqFL6c4J4Aw/o.jpg"
      },
      {
        "img_id": "O5hNx0ts9wBIJHxoJAxqTA",
        "caption": "Photo of Lolla - Singapore, Singapore. Dark chocolate pudding and vanilla bean ice-cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O5hNx0ts9wBIJHxoJAxqTA/o.jpg"
      },
      {
        "img_id": "VetLZaWyl0nrjssnM9cQvQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Lamb rack",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VetLZaWyl0nrjssnM9cQvQ/o.jpg"
      }
    ],
    "user_id": "2BKqNWXvukhZdq6_8Gbfxg"
  },
  "OFf4u58KKUHxKpNHmfirFg": {
    "date": "8/18/2013",
    "text": "First things first, I've never seen a Yelp review that placed so much emphasis on a restaurant's chair. I'm a particularly fat man and I'm very picky with my chairs. I've got frequent back aches too. But I really did not find any problem with Lolla's chairs. We sat there for about 2 hours, just chowing down good food after good food, and I have no complaints at all.Now back to business, Lolla was a place that I heard about so much from friends, and even news article. I first knew of this place from a friend's facebook post and I Googled about it; there was so much hype to this place it was unbelievable. Heck it was even included in one world's top 10 restaurants.We had the baguettes & butter and baguettes & tomato spread for our appetizers. It was pretty decent but nothing special tbh. When served hot, the baguettes were nicely crisp on the outside but soft on the inside; just my kind of texture.Next, we were served the gnocchi with cherry truffle sauce and duck fat potatoes. The gnocchi was one of the standout dishes of the night. It had that great cloud-like texture and the truffle cherry combination surprisingly worked well. The duck fat potatoes was a huge letdown however. It failed to have that wonderful duck aroma.Octopus carpaccio was one of the special dishes of the day and it was once again underwhelming. Very mediocre dish that just lack the x-factor. I was quite down at this point because I expected so much more from Lolla.But then come the start of the night, the belle of the gala, the UNI SQUID INK PUDDING. Just the name of the dish itself should tell you that it kicks ass. The uni and the velvety texture of the squid ink pudding were a marriage made in heaven. The aroma of the two things also perfectly match. It was so good I had to order a second one.Next come the egg dishes. The scramble egg with bottarga was another wonderful dish. It was very creamy and decadent, and the plain taste of the egg was just a perfect platform for the rich, salty bottarga. The other egg dish, Spanish frittata with eel, was another disappointment though. Both the egg and the eel was just too dry. It tasted like a thicker version of those triangular fried egg you have at a nasi lemak place tbh.And finally, the main course. We ordered the beef tongue esaclopes and the braised tripe. The tripe was wonderfully cooked, charred on the outside, but still tender. The tongue was not too bad either. At first taste, it was very plain and lacks flavor but once I eat it with the aioli and beets, it was a very interesting dish.Overall, the dishes in Lolla were hits & misses. They were either very good, or very mediocre. I would have given it a 3 star had it not been for the uni squid ink pudding.And a special mention to the price, I usually don't make a mention of this, but I thought it was very decently priced. As you can read, we ordered tons of dishes but it only costs us $65 per person, including a couple glasses of white wine, tips and taxes. I was shocked when I saw the bill tbh.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "2AxPxRLyeX5fosY5oi5Dkw",
        "caption": "Photo of Lolla - Singapore, Singapore. SGP - Lolla - Uni & squid ink pudding 2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2AxPxRLyeX5fosY5oi5Dkw/o.jpg"
      },
      {
        "img_id": "iL3P20EG87xHiC-y7HwExQ",
        "caption": "Photo of Lolla - Singapore, Singapore. SGP - Lolla - Uni & squid ink pudding 1",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iL3P20EG87xHiC-y7HwExQ/o.jpg"
      },
      {
        "img_id": "MFd_u1N9hEjKGAhJYazoQw",
        "caption": "Photo of Lolla - Singapore, Singapore. SGP - Lolla - Spanish frittata & eel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MFd_u1N9hEjKGAhJYazoQw/o.jpg"
      }
    ],
    "user_id": "BKBBNwnF__qx7KfJsu8AOQ"
  },
  "vBgbgNpdmmm9S88Grjrr6Q": {
    "date": "12/18/2015",
    "text": "Came here on a Friday night, reservations recommended. Thoroughly enjoyed dinner, every dish was consistently good. Pricey but worth every penny - every bite was an explosion of flavors. Bill came up to $131 including GST and service charge, without drinks. We had:- Sea urchin pudding half order ($22): Ordered this because everyone I knew who went had raved about it. It was rich and fresh with the sweetness of the sea. Personally enjoyed it, though a tad on the heavy side. Highly recommend trying this. (Not to mention how gorgeously photogenic it is...) It's great in small quantities - we nibbled on it throughout the course of dinner since it had the tendency to be too heavy. A half order is more than enough for 2-3 people.- Grilled octopus ($22): My favorite dish of the night. Never had octopus so meaty and tender before . The charred exterior contrasted nicely with the tender interior, and the squeeze of lime juice over it really elevated the dish. Please order this! Also pretty affordable for great octopus.- Scrambled eggs with Bottarga ($22): Eggs were perfectly cooked - creamy and soft, went nicely with the bottarga. - Lamb rack ($28): This took pretty long in coming, and was a small portion for the price. The lamb itself was flavorful and tender though, and I loved it. However, it might be too gamey for people who are averse to lamb. - Doughnuts with lemon curd ($12): Doughnuts were very light and airy, rather than doughy. Imagine a crisp empty profiterole. Lemon curd went very well with the doughnuts, which were freshly fried but not greasy. Perfect end to a wonderful dinner.Every dish was pretty rich and small-portioned, but the 5 dishes were enough for both of us to leave stuffed. Also pretty fun to sit at the bar and watch your dishes being plated. Would have loved to try the oxtail and porcini tart (daily special) if only we had space...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XkKjc6tFgnq4QCfZNfxuew",
        "caption": "Photo of Lolla - Singapore, Singapore. Doughnuts with lemon curd $12",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XkKjc6tFgnq4QCfZNfxuew/o.jpg"
      },
      {
        "img_id": "KR0nlsnW7CnNxQlxocbCFA",
        "caption": "Photo of Lolla - Singapore, Singapore. Lamb rack $28",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KR0nlsnW7CnNxQlxocbCFA/o.jpg"
      },
      {
        "img_id": "BQn2TJyNTABflHe47pvaZA",
        "caption": "Photo of Lolla - Singapore, Singapore. Scrambled eggs with bottarga $22",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BQn2TJyNTABflHe47pvaZA/o.jpg"
      }
    ],
    "user_id": "seb6_XUoH4q-mtJ6pCCXlg"
  },
  "qbpYmEmNSoOHMMfy_uFymw": {
    "date": "2/11/2014",
    "text": "The revival of Ann Siang Hill, with its smorgasbord of restaurants, have brought gleeful smiles to the hungry diners. One of the hottest restaurants is Lolla and i'm sure many of you have already heard/seen their signature Sea Urchin Pudding making its rounds on Instagram and Facebook.A long overdue catch up session with B provided an opportunity to check out this small but uber hip tapas bar. Reservations were made but it was only for the communal table in the basement. Thankfully we were early (7pm on a Wed) and managed to score seats at the most coveted spot in the restaurant- the 13-seat zinc-topped bar counter (walk ins only, except for lunch).The tapas dishes are a fusion of European and Japanese flavors. Portions are on the small side for some dishes but give yourself time (and tummy space) to decide and order along the way. B and i ordered the following to share.Sea Urchin Pudding ($19/half portion) is a must order. This is a rich, creamy, sweet and savory ink pudding adorned with tongues of creamy raw sea urchin. This 3 inch ramekin, though minute, is packed with decadent breakfast flavors. It is made from squid ink, egg yolks, cream and tomato sauce. The taste can get quite overpowering and we spent the whole night nursing it in between the other dishes. We can't fathom how people can even finish a half portion on their own.Another must order is the Scrambled eggs with Bottarga di Muggine ($22). We could taste every bit of the TLC Chef put into it. He stood there over the low fire and did not stop stirring for a good 3-5 minutes. Well, the results speak for itself.Instead of following the crowd and ordering the Grass fed Ribeye ($52), we opted for the Lamb cutlets ($28). This is by no means less inferior and turned out to be the highlight of our meal. The lamb is first seared and then finished in the oven, simply seasoned with salt and herbs and served in its own jus but oh that crust and oh that juicy tender meat. And i'm not even a lamb fan (i only have a weakness for lambskin). The dish is rather small, i wouldn't recommend sharing if you're not ordering many dishes.Dinner concluded on a high (from the sweetness) with the Steamed Dark Chocolate Pudding ($15). There is so much of that rich chocolate sauce with dark chocolate chunks on top of the cake. I thought the cake was a little dry that night though. Lolla is certainly going on my favorites list. B, who didn't have a good impression of Lolla, became a convert after this meal. All thanks to my stellar taste in food no doubt. Our bill was only $110 because we weren't up for more eating and drinks weren't included.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "2qJmhJXbIyr_fCCCeIXk5g": {
    "date": "4/2/2013",
    "text": "At Lolla, food is served Tapa's styled and almost everything is covered in a green and fragrant chive oil.That day, we had duck fat potatoes, Scallop Carpaccio, lamb chops, and a soft shell crab dish. The biggest letdown was the oily crab that was paired with a gut busting sauce. Everything on that dish was too heavy so I wouldn't recommend it. However, the pièce de résistance is the Sea Urchin Pudding. Briny sea urchin sitting on top of squid ink pudding. Tastewise, I would say it's similar to angels painting rainbows on your tongue. If you are planning to come to Lolla, I would recommend making a reservation in advance so you can sit at the bar and watch the chefs work. The alternative to that is a large communal table in the basement that isn't all that appealing.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wwiZAk1tm92yUMRKe2yvBQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Scallop Carpaccio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wwiZAk1tm92yUMRKe2yvBQ/o.jpg"
      },
      {
        "img_id": "lxcUcdnOcdRJferdYb6cAA",
        "caption": "Photo of Lolla - Singapore, Singapore. Squid Ink Pudding with Uni",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lxcUcdnOcdRJferdYb6cAA/o.jpg"
      },
      {
        "img_id": "nkGMOnWow_GJz4Fv-rPRIg",
        "caption": "Photo of Lolla - Singapore, Singapore. Soft Shell Crab",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nkGMOnWow_GJz4Fv-rPRIg/o.jpg"
      }
    ],
    "user_id": "Ncq1J7jnPTZDPRdZnHOt9w"
  },
  "QcmSw6AtG-xrhYUvTOiMEw": {
    "date": "5/9/2013",
    "text": "This is a review of a dinner date at Lolla.tinyurl.com/cxjxdzyI went to this restaurant wanting to love it.  I had recently went to Esquina and I was hoping Lolla would match that wonderful experience.  It didn't.The service was inconsistent.  The staff was friendly and polite.  In the beginning, it seemed they might be slightly understaffed.  Later, as we were finishing our meal, the staff seemed to disappear.The ambiance was ruined by two things.  The first was the actual seats.  These are basically tools of torture.  I am sure for people of smaller frame, they are not an issue.  However, it Is obvious the owners simply did not consider larger people in their design choices.  I was in pain the entire meal.tinyurl.com/bv2m6cbThe second was the communal seating is cramped.  The server couldn't even really pour our glasses of wine without a lot of bending and stretching.  Outside of these issues, the room does have some nice aesthetics going on.Sometimes owners just need to remember function when they are trying hard to be cool.If the food had been amazing, I would have overlooked these issues.  However, the food was very inconsistent and some of the food was very poor.Toasted Baguette, tomatoes, roasted garlic - $7 for a baguette.  It was a good baguette.  But so many restaurants provide very good bread.  We did like it enough to order a second one.  Only problem is the staff forgot and it didn't show up until we were able to flag them down and they brought it at pretty much the end of the meal. tinyurl.com/cyhbdjmSea urchin pudding with squid ink - This is a very rich dish.  My dinner companion really enjoyed it and ate every last morsel. tinyurl.com/ccnnjjjGratinated Leek Fondant - This was basically inedible. We couldn't believe it.  The internal texture was of lumpy undercooked eggs.  The flavour was of burnt eggs.  We each took a bite and just set it aside. tinyurl.com/chuj3b3Tuna Belly \"chutoro\" Tartare - This dish was pretty good.  We enjoyed it.  The only negative was some of the other flavours slightly overpowered the fresh taste of the tuna belly.  tinyurl.com/ctdm8xbCinco Jotas Jamom Iberico de Bellota - This was some very good ham. The flavour reminded me of southern country ham.  Honestly though, I can cut up ham and put it on a board.  They could try to do something with it or provide something to contrast with the saltiness of the ham.tinyurl.com/c74ybcgDuck fat potatoes - These were winners.  I could eat these all day long.  They were perfectly prepared and the taste was heavenly.tinyurl.com/bw53gxsRib-Eye - This was a pretty good steak. It was perfectly cooked.  It was just a touch on the oily side.  But that wasn't a significant negative.tinyurl.com/cmtnl5fDesserts - Both of the desserts were very good.  She had the doughnuts with lemon curd and I had the dark chocolate pudding.  We enjoyed them both.  The pudding was an explosion of decadent chocolate.tinyurl.com/d54wg8htinyurl.com/cl2hn5fReceipt (Dinner for Two): $409.60tinyurl.com/czv3z49Overall - I was uncomfortable and cramped the entire meal.  I was actually in physical pain and didn't know if I would be able to remain.  The  service was, at times, very friendly and, at other times, missing in action.  The food was very inconsistent.  I would not return.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tM42BOh1czlv56sph3iGMQ",
        "caption": "Photo of Lolla - Singapore, Singapore. Receipt - Lolla - Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tM42BOh1czlv56sph3iGMQ/o.jpg"
      },
      {
        "img_id": "In18dYUAyX5N5pqs9p0_Aw",
        "caption": "Photo of Lolla - Singapore, Singapore. Photo taking - Chocolate Pudding - Lolla - Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/In18dYUAyX5N5pqs9p0_Aw/o.jpg"
      },
      {
        "img_id": "48NlWmnjCZ5pyP71Ehb5Ug",
        "caption": "Photo of Lolla - Singapore, Singapore. Gratinated Leek Fondant - Lolla - Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/48NlWmnjCZ5pyP71Ehb5Ug/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "EGthRn8gyMAlvlRcuRao9A": {
    "date": "8/30/2013",
    "text": "I've heard so much about Lolla. Mainly that the food is good but overpriced. Finally popped by to have a bite- let's call it a second dinner, we had the beef tongue, sea urchin pudding and doughnuts with lemon curd. It was AMAZING. The sea urchin pudding was so full of flavour, tastes so much better than it looks, I promise you that. The beef tongue was perfectly cooked, crispy on the outside, melt in your mouth on the inside. And the doughnuts. Deep fried clouds coupled with an incredibly tart lemon curd. Perfect. To top it off, the music is brilliant - from The Cure to Death Cab for Cutie. Will definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "qgTL8MF0qCN2OFAI025T9w",
        "caption": "Photo of Lolla - Singapore, Singapore. Doughnuts with lemon curd",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qgTL8MF0qCN2OFAI025T9w/o.jpg"
      },
      {
        "img_id": "OB6oEOf2eF2pgizdbo4dLg",
        "caption": "Photo of Lolla - Singapore, Singapore. Sea urchin pudding",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OB6oEOf2eF2pgizdbo4dLg/o.jpg"
      }
    ],
    "user_id": "l9xM3HObyPS0OCa38OEdoA"
  },
  "CZ1YyJcky908BVXIF4FHmg": {
    "date": "7/20/2013",
    "text": "Chairs. They're something you take so much for granted at any restaurant, but you never realise just how much a bad chair can really PISS YOU OFF until you suffer a whole meal through one.The reviews on Yelp have been pretty mixed, but quite a few of my friends profess much love for Lolla. I can only conclude that those people are slimmer and taller than me, because quite simply there's no way for anyone who doesn't fit both those requirements to sit comfortably on one of those. They're like bar stools, high enough that I can't sit with my legs at 90 degrees, and without a rest so you can't mitigate the height. They're narrow, so that even my not particularly generous frame felt a bit precarious. It just makes no sense that a person that wants to provide you with a memorable dining experience would put chairs like that in their restaurant. And that really just taints the entire experience. Because to me, a person that's genuine about wanting to give you a memorable meal would take everything into consideration. Chairs. Lighting. Temperature. Everything.As for the food at Lolla, it's really not that great. Decidedly three stars (and I took one off for the chairs), the signature sea urchin pudding was indeed delicious, but not perfect nor novel.  The sea urchin was almost superfluous, and the star of the dish really is the squid ink pudding. It's rich, velvety, and so flavourful. The uni really just provides a slightly salty-sweet offset, but really so many other things could have possibly done that.The scrambled eggs with bottarga. Brilliantly cooked scrambled eggs, just slightly runny.The bottarga was generously heaped on the eggs, and the combination of chicken eggs and mullet eggs did work pretty well. It was a big plate of eggs, and while pretty tasty, I wouldn't go back for it. The duck fat potatoes were, well. Good potatoes. Crisp on the outside, and fluffy on the inside, they were plenty tasty. But, I've have good potatoes elsewhere, so it's hard to understand why it's a signature dish here. For the meat dishes, the braised beef shortrib was well cooked. The meat was very tender, but it wasn't that unique in terms of flavour. Something that I could've done at home with a pressure cooker and time. The beef tongue escalopes were, well fried but the taste wasn't that amazing. In fact, by the end of the dish, I was actually quite sick of it. The grilled squid, like a dozen other grilled squids, well executed definitely, but the broccoli puree did absolutely nothing in terms of flavour. Even the much vaunted donuts with lemon curd was vaguely disappointing. I will say that service was pretty good, and the staff member serving our table was friendly, fairly (but not very) knowledgeable, and generally present whenever we needed assistance.It was odd though, that my companion was told she couldn't put her bag on the chair next to her, even though throughout dinner the chair wasn't used, and the woman sitting on my other side put her bag on the chair between us without repercussions. I think you can easily tell that I'm not a fan of Lolla. The food was slightly above average, the service good, but that chair. Furniture like that says \"my food's so good I don't care if you're uncomfortable\", and unfortunately, it's not.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "HQ-AO4e3Cwst6O_HdUV9fQ": {
    "date": "1/6/2014",
    "text": "I had a team work dinner here a few weeks back and I'm glad it was \"on work\" as I would have been rather disappointed paying those prices for those portions... Memory a bit hazy but the main reasons for the weak reviews is:1. Price-value ratio is way off. Food is good, but not that good and portions are very small2. Waiter was unable to recommend great dishes, in fact if anything, he often put us off meals?? 3. There was NEVER enough bread... when you see a group of 6, perhaps suggest doubling or even providing some extra bread?4. The wine list seemed rather random?? Unable to find \"standard\" wines such as merlots, cabernets, pinots, chardonnay, sauvignon blanc etc..... Maybe again it's my sheltered antipodean ways however surely I should recognise at least 1 wine on a wine list? Apparently not... The food itself wasn't bad by any means... it just wasn't great. Everyone else mentioned that they were likely to get a bite to eat later as it hadn't exactly \"filled the gap\" and we were all rather underwhelmed. The venue is hip and it's great for a date (upstairs) or commual dining (downstairs where we were). Strangely loud music in the toilets... like there's a party going on in there! I guess the final straw for me was the sizeable cockroach that we saw crawling along the wall's edge and then under our table... I debated whether I should mention it on yelp but as a cockroach-phobe (yes, I should harden up, I'm in the tropics!) this definitely put my mind off all interest in food/wine and I was keen to get out of there! Not actually sure how restaurants prevent this in Singapore (and it wasn't anywhere near the kitchen)... least it didn't fly!All in all, I think there are much better dining options in Singapore and the Club Street area.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MTQAGVEdfXjvFRPwsqvnlQ"
  }
}