{
  "91ja-jtaCc5btT_OSrT3rg": {
    "date": "10/30/2016",
    "text": "holds special place among my Singapore memories not for the food, but for the person I was visiting with. salmon avocado sandwich was alright, macarons were standard fare. We got it to go for the light/water show but missed it anyways. tbh salad was a bit pointless..",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BLe54kYuzmCC6V78JOl6Og"
  },
  "UTAb6p_9Ac8Duswe4u68_w": {
    "date": "4/13/2016",
    "text": "They should just stick to selling tea.. Everything is either overly sweet or salty. Get your tastebuds checked if you think otherwise.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lzEZASaOHX_h4VsVMhnS2w"
  },
  "h0D5ZYQ4S5Y0pJvFrzJ6lQ": {
    "date": "12/4/2012",
    "text": "I fell in love with their teas on my visit to Singapore. This cafe/ restaurant is nice too - smack in the middle of the mall on top of a bridge.Space is limited and may involve a wait.Food and tea options get pricey real quick, but worth the experience for the teas!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_fqINvA1SYEbqC_RR-egLQ"
  },
  "QOKNLFUfJDOzH1L78QY9kw": {
    "date": "7/26/2015",
    "text": "TWG is really one of those places that you see and the last thing you would think about it is that it is a Singapore Company. I love the atmosphere here, it feels fancy and service is great. However should you find yourself wanting to try what they have to offer you do need quote a bit of patience as service is rather slow from waiting in line to the serving of the food. Food is good however the menu is a little messy whereby I had to ask the waiters questions about the things I'm about to order. Taste wise is above average but price wise it's more on the pricey side.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YgIQamlfZBHoeCjANSUdxQ"
  },
  "h_TcvvNOnzSr_58h544p4Q": {
    "date": "1/22/2015",
    "text": "They simply serve the most delicious burger i ever ate in my whole life , wagyu beef burger",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wjH3pTLk2jyRyw3tNcxwSQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Wagyu beef burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wjH3pTLk2jyRyw3tNcxwSQ/o.jpg"
      }
    ],
    "user_id": "gzvDBSYWbYsoeOGpQNao0A"
  },
  "i3g4sHhsNd45LhEsoBiUFw": {
    "date": "8/12/2012",
    "text": "Sitting right smack in the middle of a bridge, the TWG outlet at Marina Bay Sands is definitely a sight to behold. However, it is severely lacking in space and you'll find yourself sandwiched between different groups of diners most of the time. Expect bumps to happen whenever people move around, which may not be the most comfortable of dining experiences to be had, considering the setting and all. Overall, I'd have to say that the service is brisk and polite, but the lack of space is a severe flaw in the overall planning. They have to expand or people will just get sick of paying them a visit!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jIh6diCRYMuJfleSJDqTNg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jIh6diCRYMuJfleSJDqTNg/o.jpg"
      }
    ],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "ytSItGH6uhKtAc17Oig-pw": {
    "date": "5/7/2014",
    "text": "Every Twg Tea spot is immaculate and well designed with servers creating a tea experience to remember. Quiet and modern, you can choose from the BIGGEST TEA LIST I have ever seen with tea from all over the world. This really excites me and I know it sounds nerdy but tea is super relaxing and delicious.This tea salon is anything but boring, you can get tea mixed with alcohol, light snacks and all sorts of tea ice-creams. Next time you are in Singapore, make sure you visit a Tea Salon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dvb-aoT0gPdfNrroHH-LMg"
  },
  "pgZRL1oazKWy8--GzVel0A": {
    "date": "12/30/2012",
    "text": "5 star for the beautiful indoor decoration.4 star for the infuse tea. 1 star for the service. After I tasted their tea during afternoon high-tea at The landing point, I wanted to bring some of their tea back to US. The store is beautifully decorated with a whole wall of large tea cans. There are designed tea cans from small to big. The infused tea were similar to Tea-forte, the tea spot and Teavana. The salesman has this snobby facial expression on his face all the time.Why is he so arrogant about selling tea leaves?  After I purchased a few of their infused tea and macarons, the female cashier looks very annoyed when I tried to take a picture of the store\" No pictures\". She waved her hand right in front of my camera lens. And the guy who just sold us the tea pretended it wasn't his business. Cuz his job was done, right after we paid him.  Wow, Really? I assumed this is not a fashion store, it's just a tea store. What's so secretive about the store that I can't take picture with it? If there is a no-photograph policy, you should just mention it in a polite way instead of being a bitch. This TWG is trying to be an upscale store,but unfortunately the people who work for them are discourteous.",
    "rating": 1.0,
    "rated": {
      "useful": 6,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "KKtmvU4o3xmTkeHK9FSGdg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. TWG",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KKtmvU4o3xmTkeHK9FSGdg/o.jpg"
      },
      {
        "img_id": "n2CEqCUiMH6cTZAgv3HrRw",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. TWG",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n2CEqCUiMH6cTZAgv3HrRw/o.jpg"
      }
    ],
    "user_id": "IF_G8EqbNODvD8RjTsvo8A"
  },
  "5vXXCTzVarpJZaxeLj_WnQ": {
    "date": "12/28/2013",
    "text": "Tried all 3 fish I.e salmon, sea bass and cod.   All done well.  Tried the imperial rose and lemon bush tea and they all turn up well.  We also got the chocolate fudge as well as the apple tartan. Both were equally tasty and well executed.  Wifey had the imperial rose but I thought my lemon bush tea came out ahead perhaps because I like rioobos tea to start with.  Service is good despite being a busy lunch time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "stD1kcc9cJ4dmxnArjLNGQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Apple Tartan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/stD1kcc9cJ4dmxnArjLNGQ/o.jpg"
      },
      {
        "img_id": "UkfWHaiIxX33kanMd2bY3A",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Chocolate Fudge",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UkfWHaiIxX33kanMd2bY3A/o.jpg"
      },
      {
        "img_id": "g2lX2YLrpWxSMiAgrkuEMA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Imperial Rosw",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g2lX2YLrpWxSMiAgrkuEMA/o.jpg"
      }
    ],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "9iVjEYgNCpjrb5pe7UVyUw": {
    "date": "9/28/2014",
    "text": "The place is just beautiful so its nice to sit and just enjoy your tea.  The cutlery and plates are just so pretty!When you go to this place, make sure you are not rushing.  Their tea menu is so extensive, that it will take you at least 15mins to select one.  The tea was great with the subtle flavors.The let down was the dessert --- it looked very pretty but the flavors were not there -- felt like it was not good chocolate.  It was just sweet...I went for afternoon tea so did not try any of the dishes.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bHfBMb8ABQpmSR1wzzZAFw"
  },
  "OH2neLUWMW-zqHnbcfUC7w": {
    "date": "9/5/2013",
    "text": "No doubt a unique, fun location situated right in the intersection of 2 halls, on a raised platform while shoppers walk with envy....sort of.  Guess it's not your traditional British-style high tea in a hotel setting like the fabulous one back home at the Fairmont in DT but to us, was just a touristy thing to do.Will give props to the overall marketing of their tin cans, easily recognizable.Scones were a bit dry, and the sandwiches were OK.Of the 3 macarons i added to the set menu, probably the caramel was the best but nothing like back at home.  Not as chewy or sweet haha.Will say that service was impeccable, as a few different servers served us, and acted quite professional more than friendly, if that makes any sense.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xwnf20FKuikiHcSpcEbpKQ"
  },
  "yOfsGp4ZfjzYun11kvQkhg": {
    "date": "10/21/2014",
    "text": "Good rating, mainly atmosphere, nice view,  just had wine and olives/apps.  Very attentive staff,  nice stop over after s stroll throughout the gardens",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "n5uHKWOlIgCSfW0NwEWTwg"
  },
  "vLEGos1ASf865Az1_nxLxQ": {
    "date": "9/13/2012",
    "text": "Mediocre food and overpriced. Unless you are really into tea or like paying for ambiance, steer clear.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "gm-MdXnk425F6bhWn0lp3Q": {
    "date": "11/18/2012",
    "text": "I ended off my visiting friends' short stay in Singapore with a posh afternoon hi-tea experience. So some basic information about the place. TWG is a tea boutique franchise based in Singapore, set up by a Singaporean and French pair of friends who met in Morocco. They aim to transform the tea experience - which I understood to mean poshing it up many levels higher to trump the usual coffee&tea places. I like that idea as afternoon hi-teas are supposed to be posh, posh.Ambience: I have visited the TWG tea parlour branch at Ion Orchard. I prefer the branch at MBS as it is more spacious and enjoys more natural light. This is a fancy tea place - but somehow some patrons dine in shorts and tee-shirts. So please dress up nicely. Expect proper napkins, cutlery and fancy tea sets!Service: Impeccable - tonnes of servers milling about making sure that you are well-taken care of!Tea: Such a huge selection of tea flavours to choose from. Apparently, their white teas are quite popular. But they cost approx $26/pot. The more ordinary teas such as Holiday in Paris (I loved it) and Earl Grey are approx $13/pot. Quite pricey for tea ... and when I was at the Ion Orchard branch, they did not refill my tea pot with hot water though my girlfriend said they did so at the Taka branch for her. I ordered a tea milk shake when I was at MBS (the Asian tea flavour) - which was so satisfying - wasn't too thick nor too sweet - and you could sense good tea in there with all that milk and sugar!Food: or rather, confectionary. I'm a huge huge macaroon fan. The macaroon flavours here are all tea-inspired! I tried quite a few flavours that day ... I can't tell you my favourite as I need to try more of them to decide. Don't expect Laduree/Piere Herme sort of premium macaroons ... but these macaroons are still decent macaroons, good enough for a posh afternoon hi-tea experience. and we had the creme brûlée tart as well - it was rather underwhelming :( And I heard the savoury options aren't too impressive either.If you want to posh it out slightly in MBS (as a tourist or local), I would definitely recommend coming here. But don't expect much of the food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b2-SnqnodDY26c9cJJCSTQ"
  },
  "CWMkVVAgP0sf48T6REGv2A": {
    "date": "7/29/2012",
    "text": "This is just one of the two TWG outlets at the Shoppes and is situated right above a man-made river running through the mall where gondolas glide across the waters. As with all its outlets, the table settings and decor exude a sense of luxury and class. My friends and I swung by from their ION outlet which closes rather early at 9:30 daily. To say they have an extensive collection is putting it mildly. Their menu is choke full of choices and amusing names, especially the tea blends. Be sure to ask for the tea book if you want more details about a specific tea. I ordered a pot of Silver Moon tea, a green tea blend which was meant to be shared by two. I was told I could pour about 3 cups from the pot. It turns out that the fancy tea pot with an insulator only poured out two cups worth of tea leaving us disappointed but we did fill out cups up pretty well so I gave them the benefit of the doubt. What you're really paying for is the location and the ambience. I'd definitely bring a date here to round off the evening with a good cup of tea.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QErLqUm2M7pnFaHaGpKndw"
  },
  "3o7xLnFUUJCjqoOg54sCFQ": {
    "date": "8/24/2012",
    "text": "I had the tea set with scones, macarroons and a choice of tea, and subsequently ordered an extra pot of tea (total cost was $40). The tea selection here is Extensive - I capitalize the E for the added effect. Request for the tea manual - where each tea is explained in much detail. A tea connoisseur will probably spend hours sipping tea here from the finely designed tea cups and plates. The setting here is lovely too, as it is located right in the middle of the bustling MBS shoppes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LWxq_9zOU7jVyq0NdmJNQA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LWxq_9zOU7jVyq0NdmJNQA/o.jpg"
      },
      {
        "img_id": "WTPKXmi38eONBqfpa1F8Rw",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WTPKXmi38eONBqfpa1F8Rw/o.jpg"
      },
      {
        "img_id": "tZazmB8GpaJmc81CJ_osUA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tZazmB8GpaJmc81CJ_osUA/o.jpg"
      }
    ],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "pe3romuBgUwsZAr8aC9w8g": {
    "date": "4/30/2014",
    "text": "tea service is pricy.. but the desserts are pretty good.. it's pretty popular so we had to wait to get seated.. it's a great place to sit and just people watch and relax inside a mallthe store also has plenty of teas and you can buy them in individual wrapped bags for a quarter of the price than in their TWG canisters.. we bought 4 different teas back to the u.s. and bought some canisters of amazon..",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW-iz5OKzzp2WOHh-CC9uQ"
  },
  "_wvT3kiud9QmZQPvgjTa8w": {
    "date": "9/7/2018",
    "text": "You're paying for the experience. From the elegant food to the bougey ambiance of the Marina Bay Shoppes, that is pretty much what you are paying for when you dine here. I've always walked by this location every time I've been to Singapore and I was always curious to what it was like. I landed in Singapore in the late afternoon and wanted a quick snack time with some caffeine involved.I ordered the Fortune Tea Set during their high tea hours. I thought the food was very delicious. Just what you would want for an afternoon pick up. My tea tower included one of the finger sandwiches, scones or muffins, and three macarons. I decided on the truffle croque, the golden raisen scones, a earl grey tea macaron, a rose macaron, and a tiramisu macaron. For the tea, I decide on the hot original Black Tea 1837. I would be back again for afternoon high tea. Not sure if I want to eat here for a full meal because there are a ton of other heartier and more \"value\" options around the Marina Bay Shoppes. I say give this place a try if your looking for high tea and live your glamorous life! You're in Singapore in the first place!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X-ERCG__I8e4gXdesp8sGQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Truffle Croque",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X-ERCG__I8e4gXdesp8sGQ/o.jpg"
      },
      {
        "img_id": "TQcqZNjGBpymmv4y-p4G6w",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Tea, black tea 1837",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TQcqZNjGBpymmv4y-p4G6w/o.jpg"
      },
      {
        "img_id": "O4bjYYYoFPYGdavrx9V9nQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Fortune Tea Set",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O4bjYYYoFPYGdavrx9V9nQ/o.jpg"
      }
    ],
    "user_id": "cbzM6kE426dOaTvj9NPqww"
  },
  "Pij_twzAijWXkzxJ5_gPnw": {
    "date": "10/8/2018",
    "text": "The employee was nice to serve me even though I only bought one macaron to try during closing. The manager or supervisor on the other hand was a bit rude, while I was paying for my one macaron he didn't look at me nor acknowledged I was around he just handed me the receipt to sign and didn't say thank you. I stayed at the marina bay sands hotel, which was a amazing experience for me. As well as I know I can get different type of food downstairs at the food court. By the way The macaron is so good ! $2 Singapore money",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfFezDPP-zIieX0W6JleDA"
  },
  "RVgJCs2nUs4dqSvwefV52Q": {
    "date": "8/28/2018",
    "text": "I was staying at Marina Bay Sands and decided to do tea time before dinner!In America we don't have TWG so I was excited to try it out!As soon as you walk in you'll feel like you got transported to a Parisian cafe! The ambience, decorations even music was on point!I loved how they were playing Andrea Bocelli the entire time!We ordered macaroons and champagne! The macaroons were sensational!Also! Big thank you to the staff for never letting my glass get empty! Can't wait to come back!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "27KE0JZN6DA6HRKsYFW1NA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. TWG Marina Bay Sands  Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/27KE0JZN6DA6HRKsYFW1NA/o.jpg"
      },
      {
        "img_id": "IhZ5ihLbmypbT9Dq8SlDRA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. TWG Marina Bay Sands  Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IhZ5ihLbmypbT9Dq8SlDRA/o.jpg"
      },
      {
        "img_id": "vu_2mE1U9wndtyc1BMLnHg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. TWG Marina Bay Sands  Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vu_2mE1U9wndtyc1BMLnHg/o.jpg"
      }
    ],
    "user_id": "dExtP9gwWgPRK7N5pyMlPg"
  },
  "yJuzpBe7lnKOTnKxsTcBdA": {
    "date": "10/29/2018",
    "text": "You can't take photos in the store but you can whatever you want if you're having tea!  Service was outstanding and the truffle sandwiches were so good.  The Parisian tea set with two teas and snacks for two was $70.  So worth it.  And you can drink from the $200+ teapots and admire all the TWG branded swag like the linens, all porcelain, etc.  They have so many teas - it's ridiculous.  I'd recommend coming here at least once!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4NtjNvPExEowl8v2spCR7A",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4NtjNvPExEowl8v2spCR7A/o.jpg"
      },
      {
        "img_id": "OgUldG7tM6iVwiie8-rG3g",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OgUldG7tM6iVwiie8-rG3g/o.jpg"
      },
      {
        "img_id": "f77qETJ3wXIxCun9s3VmUA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f77qETJ3wXIxCun9s3VmUA/o.jpg"
      }
    ],
    "user_id": "uZdFsE_aHbFBChgN6Xa8tw"
  },
  "zsTTLuBfYsZLUR2swim_Bw": {
    "date": "3/13/2018",
    "text": "My boyfriend loved this place. Hands down, of all the places we went to, we went to this place TWICE because he liked it that much (the pasta). Our first dining experience here was amazing---service was spot on and spectacular. Second time, we had to flag down our server several times and it left us feeling a certain way we didn't care for. The place is situated right in the middle of mall which certainly gives  great opportunity to people watch. Definitely worth the trip depending on what server you get!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HlX0NO6y7qtpvjgaggLg5g",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HlX0NO6y7qtpvjgaggLg5g/o.jpg"
      },
      {
        "img_id": "Qq41dM00VTT6nsskrzpMwQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Waygu meatballs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qq41dM00VTT6nsskrzpMwQ/o.jpg"
      }
    ],
    "user_id": "ms7gg62p6gEfc6-YHNaebQ"
  },
  "d3JuPyWiTqbYmmiXrtx31A": {
    "date": "12/11/2017",
    "text": "TWG is very old tea house and famous.  They have multiple locations..  This store is located inside the shopping mall next to Marina Bay Sands.   Very small place but have everything to enjoy afternoon tea.  So many choices of teas to choose..  I took the recommended tea and loved it..  It was summer something (can't remember the exact name).Price of the tea is not cheap but it will be great experience since they are not instant teas. Relaxing and enjoying the afternoon tea with sweets...  it was very meaningful.  Most of all, my wife loved it..",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PxL7jbwnO5rSMnQ6qcaMvg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PxL7jbwnO5rSMnQ6qcaMvg/o.jpg"
      },
      {
        "img_id": "iM-3dfH9tAlHDXPwI6l9gQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iM-3dfH9tAlHDXPwI6l9gQ/o.jpg"
      },
      {
        "img_id": "YhMGOsuNySoSQedk99Tp7g",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YhMGOsuNySoSQedk99Tp7g/o.jpg"
      }
    ],
    "user_id": "0XTNLVKxvFbYna7FiJtfHA"
  },
  "P5cGcq1RIsZBLJoog5RRPg": {
    "date": "1/21/2018",
    "text": "Great afternoon tea spot after shopping/window shopping all day! Their tea menu is INSANE - there's a guide book too for those who want a more detailed description of the teas. You really can't go wrong with any of the selections. The basic tea set is S$19, which comes with a pot of tea and a pastry or 2 scones/muffins. This would also be a good lunch spot for a date or something. Even though it's in the middle of the mall, the space is quite nice with some privacy behind the pots of orchids. Besides from the pastries in their trolley, you can also get special desserts. We tried the tarte tatin, wouldn't really recommend it. The tarte that the stewed apple came in was quite hard, so it was hard to eat it all together. The black berry fruit tart was quite nice though! Oh, and scones come with clotted cream and jam. TIP: there's not a second steeping (they brew the tea in the back), but you can ask for more hot water.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ibLJepOH7tg0wBMRoju4w",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3ibLJepOH7tg0wBMRoju4w/o.jpg"
      },
      {
        "img_id": "emwhQ1uBkq4qju6Z_1-chw",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Tarte tatin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/emwhQ1uBkq4qju6Z_1-chw/o.jpg"
      },
      {
        "img_id": "b81xsCgmKpSA_fIgkJOvNQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Black berry fruit tart",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b81xsCgmKpSA_fIgkJOvNQ/o.jpg"
      }
    ],
    "user_id": "9HFDd8KWXNrQJ4mBKGr9lA"
  },
  "iBStqXi6eWUxMy2Int4R4A": {
    "date": "12/30/2017",
    "text": "Fancy tea place in Singapore.  Bit overpriced but a huge selection of teas. Great ambience.. well deserved 3.5 stars.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "ymiohz-DlNLHGAlXbVhw5A"
  },
  "a4P7QncjlCl7rpVxiY1A0Q": {
    "date": "7/20/2016",
    "text": "The tea was very fragrant and flavorful but what really stole the show was the crepe cake!!If you guys decide to have afternoon tea here, the crepe cake is a MUST! Crepe cakes are hard to perfect given the delicate layers and the perfect texture. However, the crepe cake here is definitely comparable, if not almost better than Lady M!Even though it is located in the middle of the mall, the ambience was very nice and elegant!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-uvfK2gCYrlckps5FZr6qQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-uvfK2gCYrlckps5FZr6qQ/o.jpg"
      },
      {
        "img_id": "QPpdDlhybM9m3ycHkZNY5w",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. The Mille crepe cake is a must!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QPpdDlhybM9m3ycHkZNY5w/o.jpg"
      }
    ],
    "user_id": "TGfq5DDVipv47Qyp9_QLdg"
  },
  "QEIxWEPHVsGPLfv3WFZVMw": {
    "date": "9/11/2017",
    "text": "What a classy tea shop,  great tea selection, not inexpensive but worth every penny.  Their macaroons are to die for, so many delish flavors and they always look so good displayed in their window.  Service is always courteous and friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "LuT6Lg-HTkil25vKhn0PQg": {
    "date": "3/29/2018",
    "text": "Makes buying tea seem like you're purchasing fine wine! Loved the teas that the staff took time to share (sniff test), sans pretentiousness. The tea I tried was delicious! Enjoyed their macarons as well. Would recommend stopping by for a spot of superb tea (at at least 11$ per person depending the tea you order, it better be) and a civilized discussion with friends. They've at least one restaurant and one store. It ain't cheap, but it's worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0uNxhZAFbkalQImzJ6UDUA"
  },
  "S7dZE80pJ9jNMgWjcNyX_w": {
    "date": "9/12/2016",
    "text": "Pretty much everything went wrong, but sometimes you have to find humor in disaster. My girlfriends and I stopped by for a (very expensive) snack because one of them desperately needed to charge her iPhone. This is what defines millennial friendship- spending money for access to a power outlet.We were seated and left to peruse the menu. 20 minutes pass without any server attention. Well, I guess there's no rush since her phone was charging behind the bar and our feet were in dire need of rest. A server finally approaches, but to move us to a table on the other side because our current section needed \"maintenance.\" Sketchy, but ok. After 10 minutes at our new table, our order still hadn't been taken. At this point, we thought of it as a game and actively tried not to get their attention...until I noticed ants crawling all over my silverware. We informed a server and he moved us to...the table immediately next to it. Because ants keep to themselves and wouldn't bother us if we're 1 ft away. Anyway, at our third table in 35 minutes, we finally placed our order- earl grey tea, mushroom soup, 1 earl grey macaron, 1 grand wedding macaron, and 2 black tea blackcurrant macarons. We tore into the macarons, and my BFF noted that the black one tastes nothing like blackcurrant. I commented that it actually tasted like caramel, then realized that we may have been given the Napoleon tea with caramel by mistake. I asked our server what flavor this black colored macaron was, and he confirmed my suspicion. I told him we ordered a different one, and his response, \"oh I heard you say black so I thought you wanted the black colored macaron.\" Wtf? I didn't order them by color- I ordered them exactly as listed on the menu. \"I guess it's okay, we already ate most of it...\" I trailed off, expecting he'd come thru with an apology for his dumbassedness and offer to bring the correct ones. I got nothing but an awkward staring contest. Poor guy had a blank look on his face and didn't know wtf to do, so I just said it was fine. To add insult to injury, these black macarons have dye that stained my lips and teeth, so my selfies for the night were ruined. The more I thought about this, the more my rage grew, so I asked to speak to the manager. He handled it like a pro and sent over 3 black tea blackcurrant macarons (threw in an extra freebie since there were 3 of us). Btw, they were red in color.If you didn't have time to read the above novel, just know the food and tea are mediocre, the prices aren't justified, and the service is lacking. But you can charge your phone behind the bar if needed.",
    "rating": 2.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "rkoRDWw3M_0WcbujXP-Wkg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. What the black tea blackcurrant macarons look like",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rkoRDWw3M_0WcbujXP-Wkg/o.jpg"
      }
    ],
    "user_id": "e6k1MHf4-os9QI1EpsEhHA"
  },
  "DMENKEPRSnIoP8adaD3Nmg": {
    "date": "2/1/2016",
    "text": "Doubting between two and three stars here:Food and drinks: definitely two stars.I was extremely disappointed to discover that these huge & attractive tea pots are served less than half full while the cheapest tea is 11 S$. As a huge fan of cream tea, I decided to go for the 19 S$ set which offers two scones, jam and clotted cream plus a tea of your choice (as long it is the 11 $S kind though). I honestly fell disappointed and cheated upon, the scones were tiny but what I thought was even worse was the amount of tea served. Like indicated above, the pots are filled less than half, more like a quarter.I must admit that the scones were nice but considering the price and size I take that as a given, additionally the clotted cream was not really clotted cream.Service and atmosphere: three stars.Overall the service is average, they do provide you with extra lemon slices for your tea when asked but the real reason for going here is the location: this place is in the middle of MBS, which is one of the poshest malls in Singapore and you sit in \"the luxury circle\" surrounded by Prada, Louis Vuitton and others. So it is excellent for people watching and you feel like you are part of that luxury world (what do you want after paying 11 S$ for a empty-ish teapot).So would I go again? Nope as I think it is horribly overpriced but I guess you pay for the location. Any other TWG in Singapore would get two stars.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "xv_x6C_kwqJWHva4vEo9Xw": {
    "date": "8/31/2015",
    "text": "+Before we begin, It was 10.30pm when I got there. The first thing I asked out loud was \"Where'z the coffee\"true story.--------------This place, when you sit down, you don't just watch people. People watch you.So when you eat, a good tip is to eat like a lady.-----------------I had the chocolate Earl Grey tea. It was damn nice. I loved it. It smelled and tasted of chocolate and tea.The only horrible thing was they only served 1 pot and the cups were too dainty.Give it to me in a beer mug and a barrel of tea , i SAY!Food..i had some foie gras salad thing and chicken.I'm sorry if i can't give you the exact details. 10.30pm was way past my bedtime and they don't seem to serve coffee.Chicken was meh. it was alright. tasted like chicken. I've had better chicken elsewhere.I think i had better chicken at a hawker centre.¯\\_(ツ)_/¯Foie Gras...meeeehno opinion. sorry guys-----Tea FantasticFood MehFrench Waiter Cute but my singaporean accent threw him off",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rSM1x1xMRdRSEDHi1o4CTA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Ayam.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rSM1x1xMRdRSEDHi1o4CTA/o.jpg"
      },
      {
        "img_id": "3mo80R4wcbjYxNPTRQ-AUA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Fooo grah  Apple was nice.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3mo80R4wcbjYxNPTRQ-AUA/o.jpg"
      }
    ],
    "user_id": "HVI-zkVRU8gHfsShr7kc8w"
  },
  "y9xwqBPAERKi2enJ3QK0eg": {
    "date": "5/6/2014",
    "text": "The ambiance is incredible, the food itself is OK. So this location is located on top of a bridge inside the Marine Bay Sands. Underneath the bridge they have gondolas going by kinda like they way they do in Italy. It's 100% tourist, but the experience was a lot of fun. This is essentially a tea parlor with some savory and some desserts, the list of teas they carry is mindbogglingly. There are some many different varieties of teas, it can get overwhelming, but just make sure to talk with your server.The food:Chocolate fondant- warm chocolate cake served with a light custard cream and a scoop of homemade vanilla bourbon ice cream. The combination all worked nicely. The cake did feel a little too dense, the ice cream was lighter and easier to eat. For me, it was good, but not great. yelp.com/user_local_phot…",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Aod55R1VaA4PKZz98eAaRg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Chocolate fondant- warm chocolate cake served with a light custard cream and a scoop of homemade vanilla bourbon ice cream",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Aod55R1VaA4PKZz98eAaRg/o.jpg"
      },
      {
        "img_id": "6d0hxUbe4sHkVlDwi10Euw",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6d0hxUbe4sHkVlDwi10Euw/o.jpg"
      },
      {
        "img_id": "mNmkqIfzp56XZuU2Q9oIOQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mNmkqIfzp56XZuU2Q9oIOQ/o.jpg"
      }
    ],
    "user_id": "Y_iTTjKvV5hLy-880SZzlA"
  },
  "DY1Ba09o05kMpXArDwFA9g": {
    "date": "6/9/2015",
    "text": "Lovely place to chill, chat and hide from the heat. Decided to take a break after walking quite a bit in town and at the mall. We were there on a weekday afternoon so it was rather empty and we were served promptly. The waiter sits you down, hands you the menu and help with placing the napkin on your lap. The \"classy\" experience they try to portray and carry. Not too bad I must say.The tea menu is ultra long. It's about an A2 size back and front printed with font 12?! AWhat I usually do is have the waiter make some recommendations based on what kind of taste I feel like having today. Otherwise, I will probably take around 1hr to choose! And a Tea Book which is sort of a dictionary for the tea offered. I asked for Sweet and Flowery. He recommended Silver Moon tea and Alfonso Tea. Took the silver moon option, tasted great. Pleasant and smells lovely.My friend had a chocolate earl grey. It did smell like chocolate but tasted funny.Ordered a tarte which was average. They have a decent selection of food, appetizers and snacks too. Love to hang and chill at this cafe with friends. The atmosphere is very classy and soothing, allows you to chat at a comfortable volume unlike the local kopi shops which are great just a tad noisy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qqZzCpD70nRd-UilsywRQA"
  },
  "F6DNcM6lfCVMdwHuCA0fAw": {
    "date": "4/28/2015",
    "text": "Seated promptly but had to flag down a server before our orders can be taken. Water is bottled so it's not free. No tap water available. We ordered the tea set with sandwiches,muffins and macaroons and your choice of tea. I was disappointed when the tea cannot be refilled with water. So it's only  1 serving so if you are sharing it might not be enough to go around. For $39 I expected more.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IWSBptsf0-nHpIfTGb1XuA",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IWSBptsf0-nHpIfTGb1XuA/o.jpg"
      }
    ],
    "user_id": "ZiO2Wr41kZ4Vz64aheBFPQ"
  },
  "8b4EG9p_-mN7lAfleTtpMg": {
    "date": "12/16/2014",
    "text": "\"TWG Tea is a brand of tea which was established in Singapore in 2008. The company promotes itself as a luxury brand. TWG stands for The Wellness Group.\" - Wikipedia / TWG website.This is a classic example of how money cannot buy you class. The location is great, the furniture is great. These two alone must have cost TWG a pretty penny.The look and feel of the brand screams \"Twinings\". And Twinings have been around for 300 years. TWG, in the age of the internet, surely you cannot expect people to buy into your \"been around since 1837\" myth? Also, for extra credit, homework tonight: Read about the lawsuit filed by another tea company over TWG's logo. Good reads!Back to TWG!Even with the great location and ambience, TWG disappoints in all three areas: Tea, Food and Service._The Tea_Ahhh, a tea shop! Prides itself on the range of tea and knowledgeable staff. What I got was snotty, rude wait staff. No help with the tea selection, no charming conversation about the brand. Just a slightly grotty thick menu with a lot of BIG words describing tea._The Food_The food was overpriced, and just NOT good. Example of overpriced: SGD$32 for a \"Chic Tea Set\"- 3 finger sandwiches, 2 baby scones, 1 glass of iced tea. - SGD$32! ANYWAY....if the finger sandwiches were good, or IF the scones were fresh or IF the iced tea was topped up, it wouldn't be too bad. But nope. It was just NOT good.Macaron - $2 each. Pretty enough, I pointed to the colours not flavours. There were no signs identifying the flavours. I just chose the prettiest ones: Purple and Blue. Later, in my bill, I find out it was vanilla and passion. (Passion?) The macarons were soggy inside and crumbled too easily. Where's the almond meal? Where's the flavour? Where's my macaron!!?Iced Tea (in a glass) SGD$11. I was so beyond disappointed by this time, I had no energy left to rage about the $11 iced tea._The Service_Cold, unattentive service. At some points, there weere 8 staff on the floor, 3 behind the counter looking busy, the other 5 with their backs to the tables, talking to the staff behind the counters. (Wow, sorry about that long sentence.)They didn't seem to know the menu very well, or if they did, they sure didn't share their knowledge. In summary, stop kidding ourselves. TWG (since 2008) is not what it makes itself out to be. May get better, may even live up to it's self-generated hype. But till then, let's spend our money elsewhere.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lElhMOxCai6JfV2nxxog7g",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Three finger sandwiches. Sad, wilted and SOGGY.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lElhMOxCai6JfV2nxxog7g/o.jpg"
      },
      {
        "img_id": "0QUbj5pdyMLYBVjWREfcJQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. No staff in sight. Oh, wait. There's one, facing the counter!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0QUbj5pdyMLYBVjWREfcJQ/o.jpg"
      },
      {
        "img_id": "oYXyU-xG3bHWqc7fmdhC6w",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. No staff in sight.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oYXyU-xG3bHWqc7fmdhC6w/o.jpg"
      }
    ],
    "user_id": "Xs4wlPwWUCdQSqqFDG1b_A"
  },
  "O-AzCYf3i0gdpfKBrTU7gQ": {
    "date": "7/20/2016",
    "text": "We went for tea on a weekday to celebrate my friend's birthday. We ordered cakes and tea. My friend did not know the name of the cake, so she pointed at the fridge to highlight that she wanted the red colour cake. The waiter acknowledged. When the cake is served, instead of a cake, the waiter served a creme brûlée! My friend told him it was a wrong order. He then served the correct cake. But with no fork. We were a bit surprised at the whole series of event, given that it is TWG.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lbmhD_C4geK_Y0FgnSTMzQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. The \"red cake\"...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lbmhD_C4geK_Y0FgnSTMzQ/o.jpg"
      }
    ],
    "user_id": "NYhYBYcIRwD2jeMSzHVIag"
  },
  "q4UsO0Nyb3oYAfY9DaoFTQ": {
    "date": "11/27/2014",
    "text": "Everywhere I look something is sparkling: gold, fine china and most precious crystal, which you can likewise purchase. We see the most wonderful wooden tea tins, which are filigree hand-painted. The rear walls are covered with huge tins full of fine teas. It is not surprising at all, that TWG is known for its innovative tea variety.There is, for example, a tea from Japan, which is usually not sold out of the country. Only TWG may offer it outside of Japan. In addition, there are also some sorts of tea, which are offset with gold. Later, when the very nice tea master opens one of the large tins, golden tea dust gets swirled up. A visit to this store is truly an extraordinary tea experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TNgBDNfBmi5ev16glq73dQ",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Tea Flower",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TNgBDNfBmi5ev16glq73dQ/o.jpg"
      },
      {
        "img_id": "SCxQ30QYxQGvnwqecJnurg",
        "caption": "Photo of TWG Tea on the Bridge - Singapore, Singapore. Endless tea possibilities at TWG",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SCxQ30QYxQGvnwqecJnurg/o.jpg"
      }
    ],
    "user_id": "I3RjQ8asxq2xe72g7HrS8w"
  }
}