{
  "xo4HLc-Dw5bzECdAdb46XQ": {
    "date": "10/1/2018",
    "text": "The dimsum here is finely crafted, and we were a party of two on a Saturday lunch.Upon knowing that we were two, they kindly offered to make all three-item dimsum to be two-items for us instead (prices are also 2/3 of menu price accordingly). I felt this was a great touch as we could order a lot more things.I particularly liked the abalone (~$60). Soft, tender, chewy. Yum. This place is nice, yet doesn't really break the bank. Upon knowing it was a birthday of my friend, they gave us some longevity buns. Nice service, great food. Would return! P.S. if you pay by chope vouchers online, they have a 10% discount.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tapEMXZc42XjWfLwTmC6sg",
        "caption": "Photo of Summer Palace - Singapore, Singapore. Salted egg yolk buns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tapEMXZc42XjWfLwTmC6sg/o.jpg"
      },
      {
        "img_id": "Yytk6r1edjh1P3QCNchb6A",
        "caption": "Photo of Summer Palace - Singapore, Singapore. Complimentary longevity buns for birthday girl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yytk6r1edjh1P3QCNchb6A/o.jpg"
      },
      {
        "img_id": "WwRORUQMI1vU2FgxomKdmw",
        "caption": "Photo of Summer Palace - Singapore, Singapore. Baked egg tart",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WwRORUQMI1vU2FgxomKdmw/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "Ogat2-40hFdc_ZTUZXMAEw": {
    "date": "7/7/2018",
    "text": "Fantastic value Dim Sum. 30 SGD each for delicious fluffy pork buns, fantastic turnip cake and delicious Sichuan dumplings. The truffle spring rolls were a surprise hit. The prawns with wasabi were on point. The Mango deseet was nothing special, but the Egg Yolk Custard Buns were special.Topped off by impeccable service and daylight robbery prices - would absolutely recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M0WcgEUXLGGp4c-2AxBTNA",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M0WcgEUXLGGp4c-2AxBTNA/o.jpg"
      },
      {
        "img_id": "NjQVHGhCFFoIuEKYyl7OxQ",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NjQVHGhCFFoIuEKYyl7OxQ/o.jpg"
      },
      {
        "img_id": "QX73iGg2osts29JLffffmQ",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QX73iGg2osts29JLffffmQ/o.jpg"
      }
    ],
    "user_id": "4-S7_R9du3GsIT7AwAv9ww"
  },
  "FzKhT-wk3zPlpo4GqMUkbA": {
    "date": "9/24/2017",
    "text": "The décor at Four Seasons or Regent hotels is always understated but elegant; here, it is quite dated, so the dining room looks more comfortable than smart. The dim sum menu is short but has many innovative dishes, like squid ink dumplings. No major creation in the à la carte menu, but even simple dishes like fried rice (we had the 8 treasures variety) and crispy chicken are prepared with refinement. Service is courteous, but not terribly pro-active.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jg2oNcs75V58g10gWtixPQ",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jg2oNcs75V58g10gWtixPQ/o.jpg"
      },
      {
        "img_id": "v7uCKLIDMXU9EyGUvK0kUA",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v7uCKLIDMXU9EyGUvK0kUA/o.jpg"
      },
      {
        "img_id": "MWh75vEpZUBZilVmLcL0Hw",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MWh75vEpZUBZilVmLcL0Hw/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "yIX5XVrm-TneNK2SbLdRvw": {
    "date": "3/17/2014",
    "text": "2014.03.17American Express Restaurant Week.Summer Palace.Lunch Menu.This is my first time visiting the restaurant and I went with my wife and 18 month old daughter to have lunch.Service was excellent throughout the lunch.  Hostess remembered our names.  The service team covering our table was prompt and polite and is experienced and confident enough to introduce the dishes as they came as well as making polite conversation.  The team looks to be very experienced and table service was rendered with minimum fuss and complete professionalism.Tea.  We had the jasmine tea and it was very good.  There was a light but delightful fragrance and was very good value at S$3.00++ per pax.1st Course.Chef's Dim Sum Selection.  Pan-Fried Carrot Cake, Steamed Prawn Dumpling with Bird's Nest, Deep-Fried Prawn Rolls with MangoVery good.  I would come back to try the dim sum menu simply based on this course.2nd CourseDouble-Boiled Bamboo Pith Soup with Mushroom and Chinese CabbageVery well flavoured soup.  The Chinese Cabbage was very cooked to the point of being very tender but not yet mushy.3rd CourseBraised Homemade Beancurd with Crabmeat and Spinach.There was a very generous serving of crabmeat but the dish was very bland overall.  The very light flavours did not come together and the various ingredients tasted very one note.  There was also a hint of bitterness to the spinach.4th CourseBraised Ee Fu Noodles with LobsterI find that the lobsters I have here in Singapore tend to be cooked to the point of being chewy.  However, the half lobster that came with the dish was cooked just right, with the meat springy but not chewy.  The Ee Fu noodles was, unfortunately, very bland.  Compared to the Ee Fu Noodles served at Wo Pheng, which is delightfully infused with wonderful flavours, this is very poorly executed.  The kailan was simply boiled and served with the noodles and only adds to the overall blandness.5th CourseCombination Of Dessert.  Aloe Vera with Lemongrass.  Mango Sago.  Osthamus Wolfberry Jelly.I find the Mango Sago and Osthamus Wolfberry pretty much the same to what we would be able to get at any decent chinese restaurant.  However, the Aloe Vera with Lemongrass was very well executed and was very refreshing on the palate.  It was certainly the right note to end the lunch with and it left me feeling very much perked up and looking forward to the rest of the afternoon.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1DIMduhs1FrAhdInEJcaeA",
        "caption": "Photo of Summer Palace - Singapore, Singapore. Summer Palace.  American Express Restaurant Week 2014.  Lunch Menu.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1DIMduhs1FrAhdInEJcaeA/o.jpg"
      },
      {
        "img_id": "BzkWBbHLDCyTzQq9YPot1A",
        "caption": "Photo of Summer Palace - Singapore, Singapore. Combination Of Dessert.  Aloe Vera with Lemongrass.  Mango Sago.  Osthamus Wolfberry Jelly.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BzkWBbHLDCyTzQq9YPot1A/o.jpg"
      },
      {
        "img_id": "4E7poD8BdYX7SnYlnQRj3Q",
        "caption": "Photo of Summer Palace - Singapore, Singapore. Braised Ee Fu Noodles with Lobster",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4E7poD8BdYX7SnYlnQRj3Q/o.jpg"
      }
    ],
    "user_id": "5fgqWcx0lsgEKveT7dAxVQ"
  },
  "ox57XTRRFm3Mc3sL2j1TuA": {
    "date": "2/15/2015",
    "text": "I had the first of what will no doubt be many multi-course Chinese dinners for Chinese new year, at Summer Palace. This is an excellent, value-for-money Cantonese stalwart that has been around for years. I'm not sure why people would classify the restaurant as pricey when given the quality of the food, portions, decor and service, it really is the farthest thing from pricey. If one refers to the absolute price of the food, I think its a foregone conclusion when eating fine dining anything. Unless you catch your own abalone and other treasures yourself I guess... Anyway if that prevailing view works in my favor i.e. less people fighting for good seats in the house, I'm all ears :PWe had one of the set menu's (can't remember if it was peony or jade or something) and extended it to 8 people and swapped one of the dishes. It worked out to about $110 per person and we got:- suckling pig AND roast duck for starters- a brimming bowl of treasures each (diced abalone, ham etc soup with a very generous chunk of bird's nest on top)- broccoli with plump and juicy scallops kissed by XO and dried scallops- the best salted egg yolk prawns with asparagus - crunchy and rich without being overwhelming- a very fresh and large steam soon hock- light, but flavorful glutinous rice...annnnd nian gao + one of those light herbal jelly/aloe vera type desserts to finish the feast. That's quite hard to beat. Barring some annoying tables nearby that were a tad loud, we had a very enjoyable meal and service was unobtrusive.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "2zbO5Cpuu0svXn3br0T84Q"
  },
  "TIn_lQIouRZXUm_D0hhhfw": {
    "date": "4/21/2015",
    "text": "Overall a pretty good experience.  Started with the suckling pig as a main event since it is my father in laws bday celebration.  This was followed with the crocodile with asparagus.  Really do taste like chicken unlike what we had in New Orleans.  Compliments to chef as obviously he does stir fry very well.  Pork rib with shrimp was delicious too.  Shrimp with salted egg was done just right.  Soon hock fillet with veg was also done very well.  Staff was efficient and lots of initiative seeing that my mother in law cold acted quickly to keep her warm.  My only wish was the food to come a little faster otherwise all good.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "9syOkBLM-MKYCq6OJc0FEw": {
    "date": "8/14/2012",
    "text": "Summer Palace is where you come to have high end Cantonese food. We made a reservation for two on a weekday and when we arrived, the attendant promptly ushered us to a window seat facing out into the Regent's swimming pool. We ordered the set meal at $62++ per person (minimum two persons) and was treated to a 6 course dinner. The menu included the typical cold plate for starters, birdnest soup with crab meat and dried scallop, veal meat, fish, lobster noodles and a light dessert of 3 tasting items. I have nothing bad to say about the food. The seafood was fresh, veal meat was tender and the birdnest just melted in my mouth! Love every bite of everything. Portion was just nice for us, if not a bit too much. They also have dim sum in the afternoon, for those who want some Chinese afternoon tea.Service was excellent. While it is a Chinese restaurant, they assigned an English speaking staff to us without prompting - most likely because we made our reservations in English and they took note. When they saw my bags, they immediately offer a small stool for me to put them down. Everything was thought for and done without any prompting from us. The dishes were served at a good pace so that you don't feel too rushed nor too impatient waiting for the next dish. An overall excellent experience indeed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B9p__oeMbWdg_i0cWR5srQ",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B9p__oeMbWdg_i0cWR5srQ/o.jpg"
      },
      {
        "img_id": "AFLt8c_LwrUxAe4TWlzt0Q",
        "caption": "Photo of Summer Palace - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AFLt8c_LwrUxAe4TWlzt0Q/o.jpg"
      }
    ],
    "user_id": "hC1HjO-Tye6dar3Bg0aZMw"
  },
  "O8R7m7xekFU0NyrHY-18sQ": {
    "date": "9/8/2012",
    "text": "Came here with a friend from San Fran who was craving some authentic Cantonese food - and since we were willing to break the piggy bank (quite a few, in fact!), we went all-out and I got a table for two for us in Summer Palace.We had the Chef's Tasting Menu for two (which came with 8 dishes, including dessert), and they were all spectactular! Even the chicken feet, which I usually swear off, smelled and looked to appetising to pass up! Their Homemade Beancurd with Fish Fillet, Fish Gluten and Vegetables sounded super simple, but it was the BEST I've ever had! The beancurd is perfect - soft and smooth inside, and slightly rough on the outside, and the fish fillet was tender, soft and fresh. Wow!Will be back next time (hopefully soon!) and try the rest of the dishes that we didn't see on the menu!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "tBoiIg3s8gUtYNeFrYHBLw"
  }
}