{
  "YhytZa0NegXhmGtR9CUeGA": {
    "date": "8/29/2014",
    "text": "Great, attentive service, but my sushi set failed to inspire. For the amount paid it should have been a lot better than your regular, no pretense, local sushi joint. It wasn't. Tuna roll was quite fishy, the rest of the set was just ... plain. There were no melt in your mouth, lip smacking, dreamy fairy sea horses swaying in underwater symphony happening anywhere. Luckily, I was here for lunch and didn't splurge. Oh, no complaints with dessert though - delicate whisper of ice cream and jelly.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XbC7sTsEWUdLrTLVxdfu6g",
        "caption": "Photo of Aoki - Singapore, Singapore. Expensive lunch set (SG$60) that has left a great deal to be desired, like SG$35 change",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XbC7sTsEWUdLrTLVxdfu6g/o.jpg"
      }
    ],
    "user_id": "RW_-rW-eQS9gMgGt7XV-Eg"
  },
  "6JkmdVuiN5s7kSMAO9g3_w": {
    "date": "7/23/2013",
    "text": "First up, we had Ootoshi ($3++), which for that day was a sort of chicken and radish stew. We were also served hot green tea which was constantly refilled throughout our meal. The set also came with a salad as well as miso soup which tasted pretty good but was nothing exceptionally remarkable.The main dish of the day, however, was different. Introducing Aoki's famed Mazechirashi ($35++).Ahhh. Even just thinking about it now makes my mouth water. Aoki's Mazechirashi is a large ceramic bowl filled with goodies that include uni, toro, akami, ikura, tako, tamago, yellowtail and hotate, amongst other things. Just look at the colours! What makes it even more delightful was that the goodies:rice ratio was about 2:1, just how I like it (:Special mention goes to the incredibly creamy and delicious uni and tamago (the best I've had so far). Aoki also serves freshly grated hon wasabi and every mouthful of the mazechirashi was just pure umami joy.Before deserts were brought out, Genmaicha was thoughtfully served as a palate cleanser and to aid digestion. Desserts (part of the set) was a trio of mango sorbet, a green tea mousse and umeshu jelly. Each was equally delightful and a great end to the meal.For pictures and the full review visit voraciousappetite.wordpr…Thanks!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wuSH0qImBnvzRTyMnJdffw",
        "caption": "Photo of Aoki - Singapore, Singapore. Mazechirashi @ Aoki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wuSH0qImBnvzRTyMnJdffw/o.jpg"
      }
    ],
    "user_id": "cL7IHL2BDgW22oQK69G1QA"
  },
  "2ZEP2pW8VybPcG_QIshUWQ": {
    "date": "10/27/2013",
    "text": "Been here before at the invitation of a good friend. Very expensive, but very good and fresh stuff! So many reviews here about the chiraishi, I think I need to go back for lunch to try it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCkITr-ZoIE3_LjhL_WVPg"
  },
  "-2YxDUV99LFvvzjk5LsVCA": {
    "date": "3/13/2013",
    "text": "really awesome mazechirashi, and alright sushi at a small restaurant to the back of shaw house. I've now had lunches at the two  famed value-for-money-but-really-expensive-otherwise japanese powerhouses, tatsuya and aoki, and while the quality of the food is definitely really high at both establishments, I came away pretty underwhelmed. I'm not saying this is a fair judgement by any means - they and their techniques might probably shine at dinner or with fancier (read: more expensive) courses, but there is something to be said about getting something great for a reasonable amount of money, and I'm not completely sure these places do it for me.before I quibble, the quality of the ingredients were pretty high, the flavours were clean and bright - I suppose I expected to be blown away, but that didn't really happen. that mazechirashi is worth returning for though.photos here: andmorefood.wordpress.co…",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "ioDJewmpW6GeeV3INSzXzg": {
    "date": "11/18/2012",
    "text": "I wish I could give this place six stars. I found this place on yelp, and decided to try it based on the rave reviews. I am particularly particular about japanese sashimi and sushi, because I have been spoiled by the abundance of fresh fish in California and Japan in the past, and I have always found the japanese sashimi in Singapore disappointing. This place has a similar decor to Tatsuya at Goodwood park hotel, with similar price ranges, but it is waaaaaaaaaaaayy better. Let me explain. First of all, they make their wasabi from the real wasabi plant, not the colored store-bought horseradish fake wasabi that other places serves. Also, their fish is airflown from Tokyo, and during our meal, the chefs were constantly bringing out slabs of the freshest looking fish before our eyes and processing them. It was quite an experience. I got the bara chirashi ($45) because it was raved about in the reviews, and I didn't want to put in too much money before I know it's good. It came with chunks of toro, magura, hamachi, tai, ikura (salmon roe), tamago and morsels of uni (sea urchin on it). It was the BEST chirashi I've ever had, for many reasons. The rice was perfectly cooked with a hint of vinegar and dusted with toasted nori and shiso, and with the tamago (sweet egg) and japanese seasonal garnish, was a delight mix of sweet and salty. Secondly, the fish were incredibly fresh, the toro being an explosion of sweet oily goodness and all the other fish being super flavorful, My favorite thing in the world is uni, and I am very critical about the quality of it. This is the first place in Singapore that serves uni that is fresh, sweet and creamy. Definitely a top grade. Also, the salmon roe were barely salty, implying that it is fresh, since salmon roe are usually preserved in salt water (the longer it is in the brine water, the saltier it becomes. Very impressive. Also, the chirashi was served with pickled ume, radish and mountain yam which went really well with the rice. Everything just worked perfectly together to create the best bowl of chirashi ever. Everyone around us (80% japanese) got the tasting menu ($165), and I will try that in two weeks. The night I was there, the tasting menu included a bowl of salmon roe, snapper carpaccio, uni and scallops topped with caviar, and an oyster which was really big and beautiful. I had serious food envy! Can't wait to try it soon!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wuW_YJNIkbngq4DsFw3QMg",
        "caption": "Photo of Aoki - Singapore, Singapore. Looks familiar? Yes, it is the wasabi plant. Aoki makes its wasabi from scratch!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wuW_YJNIkbngq4DsFw3QMg/o.jpg"
      },
      {
        "img_id": "dUNwGh6uB5lUF9Ndz6oxxg",
        "caption": "Photo of Aoki - Singapore, Singapore. Fresh catch from tokyo cut right in front of your eyes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dUNwGh6uB5lUF9Ndz6oxxg/o.jpg"
      }
    ],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "uKwaLr42zgp_H2eZNiY8LQ": {
    "date": "3/2/2013",
    "text": "Had my birthday lunch at Aoki with my partner and we both tried the $50 selection - 9 pieces of assorted nigiri sushi, complete with appetisers, salad, miso soup, chawanmushi and dessert. The sushi was generally of good quality. I especially liked the toro, tamago, unagi. The nigiri that were served were generally of high quality. Dessert was good too - plum wine jelly, white sesame pudding and black sesame ice cream. All were exquisite. Probably one of the more authentic places in Singapore to get high quality sushi, complete with the decor and attention to detail. They do have a smart casual dress code too - so that means no flip-flops and slippers.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "K4q20vSY-NbgAIl-uCJUCQ"
  },
  "hTslxjWwwMY8dasCdwkvkg": {
    "date": "10/25/2016",
    "text": "Had a solo lunch here, and got the Taian Bento ($88++), which came with sashimi, nimono, veggie tempura, sushi, miso soup, and dessert.I was really impressed with the service here. They took my bag and kept it for me, and there was a hot towel. They were also very attentive, but I suppose at an establishment where you pay top dollar, good service is to be expected.My food came pretty quickly after the appetizer - some pickled yam. Sashimi was fresh and fine, and the quality was impeccable. I could not find fault with anything in the bento. Beautiful, Instagram-worthy lunch, at a price considered to be a steal compared to dinner!I am officially in love. I managed to get a reservation for 1 for lunch, an hour before, but I suspect that was because I was a party of... 1. The restaurant filled up quickly, so do call before popping by.Would I return? Again and again.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pB9qh7uw6eUpg2nEabHzzw",
        "caption": "Photo of Aoki - Singapore, Singapore. Dessert. Jelly, lychee sorbet, warabi mochi.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pB9qh7uw6eUpg2nEabHzzw/o.jpg"
      },
      {
        "img_id": "yYjh2-btv1QQVBlefNqHCA",
        "caption": "Photo of Aoki - Singapore, Singapore. Complete Taian bento w miso soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yYjh2-btv1QQVBlefNqHCA/o.jpg"
      },
      {
        "img_id": "oCU_8pAKYJf-VWHt2WVcXw",
        "caption": "Photo of Aoki - Singapore, Singapore. Sushi and sashimi, part of Taian bento",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oCU_8pAKYJf-VWHt2WVcXw/o.jpg"
      }
    ],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "LYxf5a9uBNkztDFrrO8xpw": {
    "date": "8/5/2018",
    "text": "Nice deco. For a Les Amis restaurant, the chirashi and sushi lunch set is just average, non-spectacular for this price range. Appetizer is not up to par. Small establishment with just 4 tables and bar counter for 12.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5jJ89R2NriXe3T5aePoJEw",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5jJ89R2NriXe3T5aePoJEw/o.jpg"
      },
      {
        "img_id": "OAILHg8IasAAyVW2KE3KLA",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OAILHg8IasAAyVW2KE3KLA/o.jpg"
      },
      {
        "img_id": "VtcD3hYa7vseLZJaEmbYWA",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VtcD3hYa7vseLZJaEmbYWA/o.jpg"
      }
    ],
    "user_id": "F1V99_cvuFFYzXpyumWboQ"
  },
  "ri-MqOpQV1QiuGYAaNvyog": {
    "date": "7/22/2017",
    "text": "Pretty high-quality chirashi here, with generous portions of sashimi. It's pretty rare to have uni with chirashi so that was a nice surprise. I'm not usually a dessert person, but their dessert trio (ice cream, jelly, mochi) was really refreshing as well. Recently renovated and the decor is much improved now, it's a lot more well-lit than it was previously. Service is friendly but it can be a bit hard to get a server's attention when the restaurant is full.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "qPduG9uoRuRMEsH68ecL_w": {
    "date": "2/16/2016",
    "text": "Are you a diced or sliced chirashi-don person? Well if you are a sashimi person who don't mind some vinegared rice, i guess you would go with sliced. Well, i was that person until Aoki Restaurant, fine dining Japanese restaurant by the Les Amis Group, and they have been known to convert the hearts of many to the diced maze-chirashi style with thueir superb value for money and delicious lunch sets. Omakase would definitely be the best way to enjoy the Aoki experience but lunch is much easier on the wallet with sets starting from $33 and they come with salad, miso soup and dessert. Make sure you call early for a reservation.I had to have the Mazechirashi ($40). They only have it in limited quantity each day. Look at that gorgeous bowl of vibrant colors, flavors, and textures! Aoki is super generous with the amount of fish and I actually ran out of rice for a first! So there's toro, tamago, yellow tail, ikura, tobiko, sawara, and most importantly UNI! The fish has been seasoned in soy already and that brought out the umami, which was perfect with the sweet vinegared rice in contrast.Sushi lovers could pick from the Nigiri Sushi Jyo-sen ($33, 7pcs + maki) or Nigiri Sushi Tokusen ($55, 9pcs + maki + chawanmushi)The tamago is one of the best served in Singapore. And that slice of unagi.. Oh and the silky soft chawanmushi.Another set that tuna fans may like would be the Goma Dare Tekka Don ($40), which has seasoned sliced tuna, poached egg, and an unconventional sesame-soya sauce pairing with this fish.Value for money set lunches at Aoki. Lunch service was a bit rushed though, I much preferred the ambience at Shinji or Tatsuya for lunch but that's ok since you'd be too busy finishing your Mazechirashi. Well I did not look up until after. ;)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "4WlVklOsSd409skDsWwQkQ"
  },
  "zkMHw1x1xeTVUiQM7ayjlA": {
    "date": "11/22/2016",
    "text": "On a quest to have meals at all the top sushi restaurants in Singapore, Aoki was an immense disappointment. A solo lunch at the sushi counter was not as intimidating, because the restaurant fills up quickly and busily. I was also not the only solo diner. My Nigiri Sushi Tohuken set lunch at $55 includes a cold appetizer (stewed cabbage and enoki mushrooms: meh, 2*), a salad (radish, lettuce, Japanese yam stem: 4*), miso soup (2*) and dessert (plum wine jelly, beautifully transparent, delicious, banana ice cream, and peanut mochi, 5*), and nine pieces of nigiri sushi and tekka maki. A chef did ask me what I do not eat, and i asked for kohada. So I had: amadai, maguro, hamachi, aji, ikura gunken style, anago, kohada, tamago, and one other Sushi. It was that unmemorable I couldn't even remember the fish. First, the shari: rice was slightly too warm for my liking, packed slightly too tightly (but I suppose it has to be, as it's all served at once on a platter and not one by one) and unevenly -- one Sushi came apart in my hand as I picked it up, and bits of rice flaked off and stuck onto my fingers from various sushi. It's alllllll about the shari and Aoki fails. It just wasn't tasty. Second, the fish: were passable. I'm reviewing this with the price point in mind, and the claim from many that Aoki ranks highly, so no, it doesn't deliver. The kohada I asked for was fishy! It was actually fishy! Argh. The anago was tasteless. The tamago... was way too cold. Moist, yes... but cold. Third, the dipping sauce was generic. Some of the nigiri was prepared with too heavy handed on the wasabi, and speaking of that, the wasabi was NOT REAL wasabi. Well, I didn't see any real wasabi root lying around, and I'm sure if they were using the real thing they'd leave the root visible to the diners! It was also too sharp tasting, insufficiently sweet, to be the real wasabi. Now, the chefs. I believe none of them were Japanese. That isn't an issue,  but perhaps because of that, they lacked a certain finesse, a grace, a rhythm. In slicing the fish, in handling them, even placing the fish back into the trays or wooden boxes, they were tossed (!!) instead of placed with care. They were sliced almost carelessly. The main chef is some Cantonese dude who didn't even smile at me when I sat. Each chef is delegated a job to do: one to prepare the mezachirashi, one to prep the maki, the main chef to slice the fish for nigiri, etc. it was essentially a production line, perhaps with better fish and rice and all than sushi from a supermarket. In all, I paid $69 for my meal. There was a charge of $4 for \"otoshi\" -- what, the appetizer!? That is ridiculous. For about $20 more, I could get the most basic lunch menu at Hashida or Shinji, and I'm willing to bet it would be much, much better -- each sushi served per piece, with carefully sourced soy sauce brushed on, each nigiri perfectly packed and made. Never returning (this is my second visit -- the first, years ago, was also marred by surly, rude chefs) and if you do, opt for non-counter seats. But honestly, either go for the Sushi Bar for sushi without any frills half the price, or fork a little more for real sushi.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2LI8C0Fl6-YfFqZPL4EEw"
  },
  "had4RQCaZXY9xqRcIFz8UQ": {
    "date": "7/19/2013",
    "text": "I'm in love...with Aoki, that is. I have heard a lot about Aoki but somehow I just never made my way there (and it is so near my office!) until now. In fact, I love it so much it may just become a monthly lunch affair. The last time I fell in love with very good Japanese food was at Inagiku (now known as Mikuni after the revamped and the food never tasted the same since) and I have yet to find a replacement. Somehow Tatsuya does not do it for me either. I love sashimi and tend to order chirashi everywhere I go. For this meal, I had the shokado which had a bit of everything served in a \"bento\" box. The entrance to the Aoki is so discreet that it is a \"blink, and you will miss it\" moment. I have walked past it without even realizing it since the name is not loudly emblazoned anywhere on the glass window or store front, unlike the rest of the Les Amis group of  restaurants along the stretch. There are 2 seatings for lunch at either 12pm or 1.30pm which seems rushed but is actually quite do-able with more than enough time to spare. The service is efficient and polite, with little thoughtful little gestures such as storing your brolly and then bringing it to you without being asked. Tea was topped up frequently without any prompting, everything was set up so quietly and quickly that we did not even notice when new cutlery was set on our table while setting up for the next course. The food.The sashimi was very fresh and of decent portion. The kakiage tempura was nicely done, crispy but not soaked in oil.The chirashi was filled with plenty of chopped sashimi and uni. The only gripe my friend had was there need to be more rice. Proportion was probably 60% sashimi and 40% rice. The dessert trio of the jelly, sesame pudding and strawberry ice cream was good. I will definitely be back again. And yes, reservations is highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4DYzhvXmLFVO1e2w5ovMMg",
        "caption": "Photo of Aoki - Singapore, Singapore. Dessert trio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4DYzhvXmLFVO1e2w5ovMMg/o.jpg"
      },
      {
        "img_id": "fq07cjw1cmKuUIkFMx6eiA",
        "caption": "Photo of Aoki - Singapore, Singapore. Very fresh seafood",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fq07cjw1cmKuUIkFMx6eiA/o.jpg"
      },
      {
        "img_id": "4v6AJLCCRnFNC35iekCGKQ",
        "caption": "Photo of Aoki - Singapore, Singapore. Chirashi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4v6AJLCCRnFNC35iekCGKQ/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "KZfcw7C-1iDIzdyOmqSOpA": {
    "date": "1/7/2015",
    "text": "The recommendations for the chirashi are well founded - it was one of the best bowls I've ever had   some of the other dishes were not as well done but overall experience was very good. One of us had grilled sea bass/ cod type fish which was very good, not great. It came with egg and tofu \"crust\" which was a strong mixture of tofu \"cream\" - but unfortunately didn't have much flavor. Sushi dish was tailored to our taste and top grade fish of various sorts (toro, chu toro, and 3-4 other top grade fish) and was also excellent. Dessert was great ! 3 types of dessert, green tea ice cream (rich and delicious), a clear sweet  gelatin (it grows on you) and a sweet curd type dessert with fruit topping. All were small portions that left a sweet aftertaste and nice memory of fine meal. Would def go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "VVyjFrfsYt1i9o3QkhIdGg"
  },
  "Z60_ZT3q8lSsI6wG5tzvMw": {
    "date": "12/15/2014",
    "text": "A nondescript entrance, marked by two bowls of salt on each side. Oh Aoki how I miss you, you haunt my dreams!You really can't go wrong with the Wagyu Donburi. Imagine this, A5 wagyu with poached egg on top of perfectly cooked rice. You can choose to have it with deliciously fragrant truffle shavings but I would not recommend on it. The strong umami from the beef is quite enough, and in my opinion it is a waste of delicious truffle.Another fantastic dish is the White fish with Chopped Seaweed and Truffle Shavings. As far as I know, the fish used in question is Hirame (Flounder) but it is simply described as \"White Fish\" in the menu.Come here also for the shockingly affordable lunch set.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DYuh-LAtZBniRXgYAlZvsw"
  },
  "IMYTDGzzEPoMoSusJSYq9Q": {
    "date": "9/29/2015",
    "text": "Aoki is a restaurant where you will walk in, sit down, order your sushi or cooked dish and enjoy it regardless of expectations. Unlike most other highly expensive sushi places in the city which are beyond overhyped for what I felt was normal or worse, Aoki is that place that you will not feel any sort of buyer's remorse because this place hits exactly the spot for any Japanese food craving.My girlfriend and I made reservations for a weekday night at the counter and ordered the omakase. We've been here a number of times in the past but for lunch and ordered the charashi-don which is incredible (cubes of fresh sashimi with uni and ikura over rice), but never been for dinner. We did about 11 pieces before we could call it quits but every piece was solid. From what I remember, we had toro, chutoro, amberjack, sardine, mackerel, mirugai, some other fish part that I couldn't understand, ikura, two types of uni, ebi, torched toro, and a toro with union roll. We finished off with miso soup and the Japanese musk melon (so good!!). Service was perfect throughout. The chefs were very interactive and good at what they do. If you want a good omakase where you know you will be served the sushi (and other Japanese cooked foods) you expect in a quality manner, this is the perfect place for you. Highly recommend for lunch chirashi-dons or dinner omakases!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "JiZtfLaK8xLNnZt589eiMA": {
    "date": "10/1/2014",
    "text": "\"Dinner Minimum Spending $100++ (Mon to Thurs) & $180++ (Fri to Sat) per person *for food only\"My friend and I did not know about the minimum spend (although this is one of his favorite Japanese restaurant) until it was whispered into his ears after we ordered.  Seriously?? What kind of shi shi place is this?? I've been to plenty of high-class/Michelin-star restaurants that do not treat their customers this way.  All I read in reviews before I went was to try the chirashi - the bara chirashi was the cheapest option at $60 (and it was delicious) but being told that I need to order more to hit the minimum spend has left a bitter taste.  It is also not good restaurant practice to have a minimum spend that is greater than your cheapest entree option.Note: A lot of the other reviews were glowing but mostly from lunch diners who did not encounter the minimum spend and lunch sets start at $33++.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OEYiXqln7ltEgOH9ENOT8A",
        "caption": "Photo of Aoki - Singapore, Singapore. $60 bara chirashi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OEYiXqln7ltEgOH9ENOT8A/o.jpg"
      }
    ],
    "user_id": "4b4qCwOfj-HECmN1xRuCSA"
  },
  "X1vyNsFQKNfqnF7AQ0GK9w": {
    "date": "2/14/2013",
    "text": "keira h. made me promise to try them, so here i am.called to make a booking but got the answering machine instead as they were closed for CNY.they returned my call the very next day to inform me that only counter seating was available.they also politely mentioned something about minimum spend, though weird in sg, but it was not an issue for me.so a date with aoki on VD it is!it was raining and the les amis group provides valet parking, so why not.rather busy they were, being just reopened, post CNY break.also a busy VD night but most here were evidently regulars.a very professional setup with well oiled machinery.watching them churn out fine dining with such JIT precision was a delight.the authority gradient along the sushi bar was pronounced.from the left you have the prepper/assembler, then the assistant sushi chef and finally the japanese honcho.being our first visit, we decided on omakase.the kimono clad staff then whispered in my ear, $300, $400 or $500?a safe bet is always the second most expensive one, right?:)i also chose the kokosyu sake at $65 for 180ml.for that you get to choose from a basket of fancy looking sake glasses.it was a chilled sake with a clean dry taste.so the culinary journey begins........what looked like braised beef was actually tuna.bold flavours, a good start.next fresh bean curd skin.silky pillowy soft.with a touch of soya sauce and wasabi to kick start the senses.boiled sora mame(japanese broad beans) followed.need to peel off the skin for a bitter sweet soy finish.a trio of ankimo, oyster and codfish sperm in vinaigrette jelly descended upon us.clearly their produce is superior.every bit worth your money in terms of quality.ankimo creamy, oyster plump and sperm, not particularly memorable.but the next dish was.sweet baby shrimp mixed with uni then topped with caviar.easily the highlight thus far.but the climax kept climbing.the hirame sashimi with chopped seaweed and freshly shaved black truffle brought it to yet another crescendo.the saltiness from the seaweed and wonderfully woody earthy truffle slices made the fish very pedestrian, in a good way.the fish became the canvas that was brought to life by them.a palette of assorted sashimi ensued.toro, kanpachi, maguro and leather jacket fish.the leather jacket had a firm bite to it and was accompanied by it's own liver dressing.kanpachi did well with a squeeze of lime on it.but the maguro stole the show!awesome texture nothing compares to it, not even the toro!the sinewy toro disappointed but nothing freshly grated wasabi cant fix. for us the orgasm seemed to have come and gone but the food kept coming!fresh hokkaido crab meat in the now familiar vinaigrette jelly.i just polished off the exquisitely sweet crab meat for both of us.dejavu flavours appeared again in the chawanmushi.chopped seaweed and freshly shaved black truffle???just replace the flounder with egg custard???not that it is a bad thing.but can be boring? no?simply steamed bamboo shoot signalled the end of cooked dishes.served with a green miso paste, it was mild in taste quite unlike the distinctly smelly taiwanese version.hirame sushi was first up for our sushi course.faultless, safe that it is a repetition in fish used.maguro(seasoned in soya sauce) sushi was as good as it gets.aburi toro sushi seemed to have arrived on the wrong side of the inverted bell curve, with tongue falling into a coma.then the uni sushi acutely awakened me from my food comatose and i caught a second wind.only to realize the end is near when mr. negi toro maki landed on our plates and boy was it packed full of strong, sinus clearing japanese negi, delicious.asari miso soup was also a winner.the clams were super fresh and well cooked, not over.the finale took us by surprise.pale white strawberries!a first for me.not screamingly sweet but the icing sugar is there for those who need it.some minor imperfections but for sure they are in the 5 star category, albeit a weak 5 for now.",
    "rating": 5.0,
    "rated": {
      "useful": 11,
      "funny": 6,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "9hmTHQF7TLG-9zTNbDNd-Q",
        "caption": "Photo of Aoki - Singapore, Singapore. codfish sperm with vinaigrette jelly.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9hmTHQF7TLG-9zTNbDNd-Q/o.jpg"
      },
      {
        "img_id": "QMqlwNxRqmQjnQW-NfK8zQ",
        "caption": "Photo of Aoki - Singapore, Singapore. oyster with vinaigrette jelly.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QMqlwNxRqmQjnQW-NfK8zQ/o.jpg"
      },
      {
        "img_id": "I4WThKNtHsnBdiCh8bMVtw",
        "caption": "Photo of Aoki - Singapore, Singapore. ankimo with vinaigrette jelly.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I4WThKNtHsnBdiCh8bMVtw/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "cKFc0kMKI5eg7ZfjT7rCuw": {
    "date": "3/13/2014",
    "text": "Looking for fresh seafood and fine Japanese dining? Look no further! Aoki is located on the side of shaw center. Walk further up from the taxi stand and it is next to the French dining. Came here with a friend at around 2 pm. First of all, I did not know it was fine fining area and I did not notice the two timings for lunch.. And we are supposed to reserve cause the place is pretty condensed. (3 small rooms 2-4 people, 1 large room and sushi bar 10 people).When we were seated, a tray with an appetizer was placed together with the soya sauce. The cutleries were placed in the same manner and in a perfectly neat arrangement. If you are a perfectionist, you will notice the soya sauce container is different from tray to tray. And chopsticks have two ends too.Called bara chirashi and the lunch special 7 piece nigiri set. After the appetizer we were given salad. Then the main dish arrived.Bara chirashi contains a mix of sashimi, tamago (egg), Ikura (salmon roe), uni (sea urchin), and a small teaspoon of homemade wasabi. The sashimi are fresh and tasty. I've been looking high and low for this kinds of sashimi restaurants in Singapore. The rice was soft and they mixed a vinegar like sauce so it made it to be tangy.The sushi set came in smaller portions. It is bigger slice of sashimi than the bara chirashi. They also placed the homemade wasabi inside.Next the waitress served us miso soup (one by one in an orderly manner). As it was almost closing at around 2.30, the waitress reminded us of the last order. My friend and I still had 1/2 of each dish we called but we were extremely full. Consumed too much rice. At the end, they gave us a cup of dark roasted green tea with three small cups of desserts consisting (caramel pudding, mango ice cream and aiyu jelly). Like I mentioned earlier, they are detailed in terms of arrangement. Overall, coming here for lunch is a wise choice but next time I will know the timing for the lunch. Reserve it if possible :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oMS0AnI8_EqjNgJjH2lnxg",
        "caption": "Photo of Aoki - Singapore, Singapore. Desserts!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oMS0AnI8_EqjNgJjH2lnxg/o.jpg"
      },
      {
        "img_id": "jrt0XiGmm9J_wpTpZ97PJA",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jrt0XiGmm9J_wpTpZ97PJA/o.jpg"
      },
      {
        "img_id": "0ab7Hy3Rv68YrF_ghYIKkw",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0ab7Hy3Rv68YrF_ghYIKkw/o.jpg"
      }
    ],
    "user_id": "Qr-WoW6Vye4aH3I-YZ2ZyQ"
  },
  "3YfvbXQElM1ojX9LTr4Odw": {
    "date": "4/7/2013",
    "text": "I don't eat raw fish, just not my thing. So when I brought the husband here as a belated birthday celebration, I wasn't expecting much. But the mazechirashi has completely changed my mind! It was amazing! At $35 for miso soup, small veg appetizers, dessert trio and a bowl of amazing goodness. There was toto, scallops, sweet shrimp, egg, salmon roe all on warm sushi rice. The fish to rice ratio was slightly more than 50-50! The wasabi was fresh and I felt I was in Tokyo! My husband had the 9 types of nigiri and maki with chawanmushi. He was staring at my chirashi with such envy! So order the chirashi cause it is mind blowing! Reservations are a must",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "n0VzKpVBmanmfa_tZG9nCQ",
        "caption": "Photo of Aoki - Singapore, Singapore. Half eaten chirashi pic for you to admire the abundance of fish!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n0VzKpVBmanmfa_tZG9nCQ/o.jpg"
      },
      {
        "img_id": "TNa1CPlUBJ7wwe9o85HlbA",
        "caption": "Photo of Aoki - Singapore, Singapore. Dessert trio of milk pudding, banana ice cream and jelly",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TNa1CPlUBJ7wwe9o85HlbA/o.jpg"
      },
      {
        "img_id": "MP3YJzoDq8qsB5UzoKCUxQ",
        "caption": "Photo of Aoki - Singapore, Singapore. A nice close up of the mazechirashi...love at first sight!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MP3YJzoDq8qsB5UzoKCUxQ/o.jpg"
      }
    ],
    "user_id": "hiUDfQ5UdPfi5UqnOmDdfQ"
  },
  "FbaIWSa6axW_QLTpZrpQbA": {
    "date": "5/18/2015",
    "text": "There is no need for introduction of this fine Japanese restaurant. Every time when I'm craving for sushi, Aoki is the only choice. But their signature dish Mezachirashi is the best chirashi don in town. A set lunch cost around $50. An alternative is Barachirashi, slightly more expensive (with more ingredients) but equally excellent. Japanese food fan must give Aoki a try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "20UNau7IN_QSEAJNLwT2sA",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/20UNau7IN_QSEAJNLwT2sA/o.jpg"
      }
    ],
    "user_id": "f77hr8UQ2XQbsXobTm7_ZA"
  },
  "tygX_JgBXKWAkTruAXT8NA": {
    "date": "11/14/2014",
    "text": "I feel like I've been robbed..This is the first one star review I've ever written. Maybe my expectations for this place was just too high.. My mom was in town and I wanted to treat her to a nice meal. After quite some research I decided to settle on AOKI. First of all, I personally think the design of the rooms is incredibly poor, the \"private room\" was inconvenient to get in, offered no privacy since the servers freely open our door. I knew about the SGD100 min spending per person, but that shouldn't take away our right to know the price of the food before we order. I'm saying this because the seasonal menu had no price whatsoever. Of course it's so easy to exceed the min. since all the dishes were incredibly overpriced.I don't mind paying for good food. I've paid more for a meal than what I paid here but it had to be worth it. Unfortunately AOKI was not. The food was generally underwhelmed. We had the seemingly most popular dish sashimi with truffle - the fish was chewy and just not worth $130. So is the otoro sushi - which I was so looking forward to because it's one of my favourite cut.Good dishes are: tempura (light, fresh) + ice cream (refreshing flavors: sakura, tofu). If I had to go back, I would order $300 worth of sakura ice cream instead of the dinner that day.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xd8dPasNWNiy28rtqksD-g"
  },
  "5i9G8BQhZYwEqp17QRrshg": {
    "date": "2/2/2014",
    "text": "I've only been here for lunch, and I've never made a booking to come here, but I've always been lucky enough to get a seat at the sushi counter. From what I've heard, the lunch sets are most value for money, and after being here, I do agree. Lunch includes: an appetizer, miso, (whatever main you're having), and dessert. Everyone goes ape over the Chirashi here but in my opinion, everything is chopped up too small and my mouth gets kind of tired of chewing before I'm halfway through my bowl. On the flipside, it is bang for your buck as the fish is of high quality. What I do like better is the 9 piece nigiri set. It's the right amount of sushi that allows you to leave the restaurant feeling satisfied and not regretting that you didn't wear your stretchy pants. Aoki-san doesn't have the most pleasant face on all the time. But just let him do his job, and he'll amaze you with his sushi.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "Ncq1J7jnPTZDPRdZnHOt9w"
  },
  "qZurTsQZWF-yJimENlP5vg": {
    "date": "7/16/2012",
    "text": "You wouldn't find it if you didn't already know about it. That was why it was a huge draw for us. An obscure cloth door hangs over Aoki's entrance (along the Les Amis stretch) revealing a very tastefully decorated interior when you venture in. I was falling down the proverbial rabbit hole.Fish and most ingredients used in Aoki are flown in daily from Japan, this is as close as I'm going to get to Tokyo without buying an air ticket. The Nigri Sushi Jyo-Sen (7 types of sushi) and Chirashi are a great deal at $35++ at lunch. The quality of fish is unbelievable.The same sets cost $50++ at dinner so lunch time is invariably popular. Book ahead if you don't want to be turned away at the door disappointed.Going to Aoki has spoilt all other sushi/sashimi joints for me because I will always be thinking \"I could have spent this money eating better at Aoki\".Do me a favour will you Yelpers? Don't tell anyone else about it.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "x-xH4lsnPnbL3M47EfbSjA",
        "caption": "Photo of Aoki - Singapore, Singapore. Dream Chirashi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x-xH4lsnPnbL3M47EfbSjA/o.jpg"
      },
      {
        "img_id": "7fSGBDquEyw9oEJgUmejzg",
        "caption": "Photo of Aoki - Singapore, Singapore. Nigri Sushi Jyo-Sen (7 types of sushi)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7fSGBDquEyw9oEJgUmejzg/o.jpg"
      },
      {
        "img_id": "N4H3infako_NglMzCTyBFQ",
        "caption": "Photo of Aoki - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N4H3infako_NglMzCTyBFQ/o.jpg"
      }
    ],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "8scqsHzeVVTV2wLomDmLTw": {
    "date": "4/20/2013",
    "text": "The mazechiraishi was worth rowing ashore for. All of the pieces of seafood were very fresh and seemingly high quality. The sushi was also fresh and well-prepared. I would recommend sitting at the sushi counter because the guys are pros. In the course of our lunchtime meal we saw the chef in front of us make sushi and sashimi, prepare slabs of fish and put them in a wood case, cut a bucket full of giant clams out of their shells, grind orange zest, and read a Japanese newspaper. It seems like they might prepare all day for the dinner service. The place feels very legitimately Japanese compared to chain restaurants.The service is also certainly a step or three above the norm in Singapore. The small dishes like miso, salad, green bean appetizer, and dessert were also meticulously flavored and prepared. The wasabi is also phenomenally delicious and not overpowering because they use the real thing instead of the overprocessed colored horseradish.The only even remotely bad thing is the prices, but particularly at lunch, taking all these factors into account such as the sheer epicness of the quality and presentation, I think it is worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "UqODeiQQ6QaiVsgjZ-gODA": {
    "date": "10/6/2012",
    "text": "This is a classic Japanese dining experience.First, there doesn't appear to be a sign for the restaurant.  It is located on the side street by Shaw Centre.  It is the last of three restaurants in a line.  There are  curtains marking the entrance.Once you walk through, there is a dining bar.  There does appear to be a small private dining area.We had a reservation.  The restaurant strongly suggests reservations.  However, the restaurant was not very busy.The ambiance is restrained with clean lines and a natural wood look.From their simple website:aoki-restaurant.com.sg/a…The service is impeccable with touches of homage to traditional Japanese restaurants.  For instance, selecting your saki glass and servers with traditional wear.The meal started with a small set of greens.  While not exactly my thing, I did enjoy it.tinyurl.com/92ar7lpThis was followed by a chef's selection of sushi.  It was well prepared and diverse.  The vinegar rice was excellent.  The quality of the seafood was top-shelf.  For me, the fish was the star of this plate.tinyurl.com/8byw3c2After this, there was what I would consider a chawanmushi.  But it was thicker and simpler in flavor profile than ones I've had before.  i did enjoy it though.tinyurl.com/9gxqoo2Next up, there was uni.  I thoroughly enjoyed it.  Uni can be overpowering.  However, this was very mild and delicate.tinyurl.com/8p27qu3Served at the same time, there was chirashizushi (sushi on rice).  This was simply amazing.  Once again, the raw fish was the star.tinyurl.com/8urzdpctinyurl.com/8q4r7r2The meal was very well paced.  It was never rushed nor were there pauses.  We also enjoyed a very nice saki but I can not remember the name of this.This was simply an excellent dining experience.  It is Japanese food at its finest.  Service, ambiance, and quality food combining in a near perfect manner.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "U5Hy1UfzAVd4_4_twZfqpQ",
        "caption": "Photo of Aoki - Singapore, Singapore. Uni - Aoki - #Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U5Hy1UfzAVd4_4_twZfqpQ/o.jpg"
      },
      {
        "img_id": "RsPbK7e1BFecCk6wmKNtmA",
        "caption": "Photo of Aoki - Singapore, Singapore. Chirashizushi (Sushi on rice) - Aoki - #Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RsPbK7e1BFecCk6wmKNtmA/o.jpg"
      },
      {
        "img_id": "y2mUEuyUXwA1iohby2I6Zw",
        "caption": "Photo of Aoki - Singapore, Singapore. Chirashizushi (Sushi on rice) - Aoki - #Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y2mUEuyUXwA1iohby2I6Zw/o.jpg"
      }
    ],
    "user_id": "3S53VaMDPy8Lywk2TuPb4A"
  },
  "wYldIam1HxTceXZe3UJqVQ": {
    "date": "9/14/2012",
    "text": "Maze Chirashi -  it is hard to find a better chriashi deal than Aoki lunch set. At $35, you get a good serving of different type of sashimi on a bowl of perfectly seasoned rice. Note that the chirashi here in maze - which I was told means messy. So it is little bits of different seafood chopped into the bowl. That said, it is not leftovers. I have sat at the counter and watched the chef prepare my bowl and it is all from the same cut of great sashimi. You even get a bit of uni in the bowl.The lunch deal also includes a dessert platter and I will always, and i mean always, switch my dessert platter to 3 scoops of black sesame ice cream. I am not a sesame fan at all, but the black sesame ice cream here is mindblowingly good. I never liked black sesame icecream in most places as they tend to taste oily to me. but here, it is perfection.Secret wish: I need a perfectly good excuse to come for a omakase and be fed by Chef Aoki! right now, I will just remain happy with my $35 lunch deal.Reservations necessary!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1HEB_iN2cHdb3HpDsbVICA",
        "caption": "Photo of Aoki - Singapore, Singapore. Tuna!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1HEB_iN2cHdb3HpDsbVICA/o.jpg"
      },
      {
        "img_id": "hONRIe37sw0AgosSBa_VXQ",
        "caption": "Photo of Aoki - Singapore, Singapore. Uni with white shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hONRIe37sw0AgosSBa_VXQ/o.jpg"
      },
      {
        "img_id": "3G8AUI611V4M7-Lt_1yZXA",
        "caption": "Photo of Aoki - Singapore, Singapore. The best black sesame ice cream ever.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3G8AUI611V4M7-Lt_1yZXA/o.jpg"
      }
    ],
    "user_id": "4y4obgWxi_CL25nRHrhuEA"
  }
}