{
  "zhTG06QqzJbnS_Zf-GzWvA": {
    "date": "2/17/2015",
    "text": "The service here approaches restaurant quality. The menu is on the counter but there are no prices and you have to ask. The price for a standard chicken rice combined is $3.50, when separated $4.20. The price for a can of drink is $1.60.The rice is a bit sticky and the chili is quite hot so put in small quantities. The chicken is damn nice though, especially the skin, as advertised. They have a separate dining room which is nice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_V4Dc_u5Zap2JB40-qPWsg"
  },
  "LGL5xo7J8YjiUl_ECAIqkw": {
    "date": "2/27/2018",
    "text": "This place is the first chicken rice \"black-shop\" that i have encountered in my life... no prices on the menu, turned out that chicken rice set for 1 is a small plate of meat that costs $4 and a even smaller bowl of rice for 80 cents... all tastes mediocre. Basically its the same meal (or lesser portion ) as the typical $3 chicken rice meal at most of food court but it costs $4.80 (a 60% price mark-up).Do not be fooled by the nice newspaper marketing review advertisement that they have on the walls, those golden days are over... this place is out to maximize their margin and treat or chop customers like car-workshop carrots.Lesson learned: Always check online reviews first before trying out a new shop in SG.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aRhvIdqQCIDO7-OHe7XItQ"
  },
  "NRSSe7ocy4AlzfHm7WkThQ": {
    "date": "1/10/2017",
    "text": "Worst over priced chicken rice. Chicken tastes like rubber despite the fact that I ordered the drumstick. Rice was lukewarm and lacked flavour. Never coming back and definitely would not recommend it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNfrNUsmqGMKdo4giMGdhA"
  },
  "fN-94uM2W-_bzxf0Lvtl2g": {
    "date": "11/9/2013",
    "text": "I've been coming here for more than 5 years. The chicken is tender and boneless. And there is also achar on the side. I love their chicken liver and gizzard dish. The sauce is just right. I also called bean sprout and the Thai style tofu. I love this place and will come back for more delicious foods. They have lots of side dishes that you can order. Overall, this place is a must try! Parking might be difficult but it depends on the timing. Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VYqIovLhIFX1we1sdNRzYA",
        "caption": "Photo of Evertop Hainanese Boneless Chicken Rice - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VYqIovLhIFX1we1sdNRzYA/o.jpg"
      }
    ],
    "user_id": "Qr-WoW6Vye4aH3I-YZ2ZyQ"
  },
  "RoLfSr74VNwJvE-7fB7gCA": {
    "date": "11/25/2014",
    "text": "The chicken rice is very average; hidden costs include paying for the rice and the vegetable dishes are very expensive ($6 for a small-ish serving). The portions of chicken are also rather small (for $3.50 excluding rice), and the taste is nothing to rave about.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qnXgtXUvHRn0L0_8SirnWw"
  },
  "rsxZwM39r7s1chE6oEx7-A": {
    "date": "8/19/2012",
    "text": "This eatery is located at the end of a stretch of other coffeeshops. It's one of the few places in Singapore that whips up halal duck rice. There's chicken rice too, but we can easily get that elsewhere, so we got the duck rice here. They care enough to debone the meat for you, so there's no need to dirty your hands.  They've got lots of variety in their menu. We also ordered the deep fried tofu, kailan and  omelette to go with our duck rice. The rice was fragrant and the duck meat was tender and cooked to perfection. Plus, it didn't cost a bomb! We were contented with the meal.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dy_BrraKSl-I5Duq-xleKg"
  },
  "-K5_0aadHkTKgCeXwra_KA": {
    "date": "10/18/2013",
    "text": "the chicken rice is awesome. The seafood dishes are so so... Well It is called evertop chicken rice. Heh. what I don't like about the place is that you'll need to walk up to the counter to place an order and the menu is only accessible at the counter. and the drinks is ordered separately. well, it won't stop me from eating here again but it'll be better if the management sort this out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "evIjahgjJHGsuunzD9aT1A"
  },
  "jI9JO_bqoB3TdEx-gzyiGw": {
    "date": "8/16/2012",
    "text": "If you're looking for halal duck rice, this is one of the few chicken rice joints that serves it. They used to be the famous halal chicken rice store at tanglin halt but have since moved to clementi. I like the range of choices in the menu, you can choose from roasted to hainanese chickens to duck. If you're in a group, you can order a bunch of dishes and share and it won't bust your budget either! My favourites off the menu are the roasted duck and/or chicken, chap chye vegetables, omelette - it's a very satisfying meal just sharing those 3 dishes. The only thing I don't enjoy sometimes is that the chicken or duck is served cold. The rice is usually hot so I guess that makes up for it? Otherwise, it's a great place for halal chicken and duck rice!Final verdict: Not always evertop in quality but good enough to come back for more!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  }
}