{
  "8a7TfcxACrw-dpR77iKFCg": {
    "date": "7/10/2015",
    "text": "Service is just so so.. ordered fish and chips, bangers and mash, crab cake and shepherd's pie and truffle fries for dinner.Truffle fries were excellent.. shepherd's pie was abit too greasy but tasted good. Fish and chips were good. Batter was crisp and fish was fresh. For the bangers and mash, the sausages were too dry and tasted bland. Mash was also very dry. Disappointing. However the biggest disappointment was the crab cake as it arrived cold and was bland.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ledNgwf-myE-_Or8dfDhDg",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore. Fish and chips, bangers and mash, Shepherds pie, crab cake  and truffle fries. Shall see how it tastes!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ledNgwf-myE-_Or8dfDhDg/o.jpg"
      }
    ],
    "user_id": "Wj-rhPp1HqdRMNTb4Y20Ow"
  },
  "EIUgnQumkcUxsg5wU5nUPQ": {
    "date": "10/3/2018",
    "text": "Super strange place that can't decided if it wants to be a cafe, bar, pub or restaurant. Stopped in for a coffee and a Pimm's. Coffee was a little weak, think it came from a machine.Decor very disjointed, nearly tripped on the huge carpet on the floor. Overall, just a strange experience.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "tY95uAB3GEobSqaae8hvGw": {
    "date": "4/12/2015",
    "text": "This place definitely has my heart sentimentally because it's part my nickname, part a university haunt when I was studying nearby. This was a go-to place for one of my girlfriends and I after class because we loved their unique salad dressing - however, that was a few years ago and that dish has since retired, along with their service.I had initially planned to go to another restaurant for drinks after a long day out in Sentosa but it was very unfortunately closed for renovation - I headed here because it was something familiar, and because they had Archipelago beer plus some pretty okay Happy Hour prices. A pint will set you back $11 (before 3pm) / $13 (3pm onwards, third tier of pricing applicable but I can't remember exactly how much it was) during their Happy Hour - but that's about all the awesome there is to this place already. Service here is very slow - for some reason their 4 - 5 waiters/waitress were all lingering in the al fresco area, leaving the indoor seating devoid of people. Thus, trying to get attention from them is pretty hard. After ordering a beer for myself and tea for the partner, it took about 15 mins for both to come. I subsequently ordered truffle fries which took another 30 mins to come - they had actually forgotten my order when I asked again, and had almost no truffle taste which was disappointing. Trying to get the bill took another 10 mins to get the waiter's attention - which was sad because the indoor seating had filled up. I would understand if service is lax when we were one of the two tables that were used inside, but by the time we left, the indoor seating was 60% - 70% full, and there were still no waiters stationed within the indoor area for guests to call if required. I would therefore recommend sitting in the al fresco area if the weather is not too hot - you'd probably get better/faster service there.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3z2Vz7g1FUSFcRdpp2jmQQ",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore. Truffle Fries - these are extremely disappointing, don't bother ordering them especially if you're craving truffle fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3z2Vz7g1FUSFcRdpp2jmQQ/o.jpg"
      },
      {
        "img_id": "sgx6FJawD64ICQCJBdmFFA",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore. Beer, once again, saves the day.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sgx6FJawD64ICQCJBdmFFA/o.jpg"
      }
    ],
    "user_id": "fP1GIiU0j5Ie69h6f7kh6g"
  },
  "86gNRUAZkhuO0tKO1mD1UA": {
    "date": "2/28/2016",
    "text": "Been here several times. Beer is excellent and fresh - Archipelago. Ordered the Ale - dark and nice. The food - got the \"bar bites\" - Shish Toaruk - very nice presentation and excellent taste !! The source was spicy to the exact point. The Mrs. had the regular portobello which was, as always, very good. All in all nice food, great beer, helpful a quick staff.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u_0ik_3xthm5QJ1cyTuK6Q",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore. This is the Shish ... Greta taste and presentation.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u_0ik_3xthm5QJ1cyTuK6Q/o.jpg"
      }
    ],
    "user_id": "qIuGZkObPda1US3TbFWQAg"
  },
  "mAhQdnaN9fvuNXTV8DGzpw": {
    "date": "8/8/2015",
    "text": "Over-priced and subpar foodWe came here for dinner this evening and left really disappointed. Service was subpar and the standard of food dropped drastically from when they first opened a couple of years ago. My BF and I wanted wholesome healthy fish mains this evening, so we ordered the salmon and pan-seared barramundi. When the salmon arrived it was sitting on what looked like melted cheese on heavy cream, with roasted potatoes soaked in the fatty creamy sauce. The sauce was so darn oily that I felt queasy after eating the dish. More importantly the salmon tasted soft and mushy vs soft and firm. The barramundi on the other hand was well cooked and fresh. However the risotto that was supposed to complement the fish was ultra bland. Overall, pretty bad and over-priced food experience! Did I mention? I actually had diarrhea when I got home. Needless to say, we will not be going back! :(",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FF6_14nPF_MRFDHWwDasaQ"
  },
  "GpqJ7GrRTWr7FaxA7euWRw": {
    "date": "2/4/2016",
    "text": "My wife and I ate at the Vivo City location on 1/30/2016 around 9pm. We sat at the table in the back close to the outside bar. I'm not trying to be insensitive towards the lady in red that was working that night, if she had a rough night or what not. She put the menus on the table without saying a word. A simple greeting, like a \"hello\" or \"how are you today?\" would be appreciated. Even when she took our orders, she felt lifeless. Anyway, when we started eating, she decided to rearrange the tables. She pulled the table that was attached to ours to make another table, but I guess she didn't like the way it looked, so she pushed it back. A lil' iexcuse me\" would've been nice. I would've given a 4 star, but she knocked it off to 3. I felt like she had an attitude. This was my first time eating there and my wife's third, she told me that's the same lady with the attitude that served them before.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iUMm001szRIsRJ6TW2D_rw",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore. Lamb Shank @ Queen & Mangosteen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iUMm001szRIsRJ6TW2D_rw/o.jpg"
      },
      {
        "img_id": "6S-vDRQfNLGDvb8KZQ-9Hw",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6S-vDRQfNLGDvb8KZQ-9Hw/o.jpg"
      },
      {
        "img_id": "CAnzsAYbIFERbTB1chbDgA",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore. Thai Crab Cake @ Queen & Mangosteen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CAnzsAYbIFERbTB1chbDgA/o.jpg"
      }
    ],
    "user_id": "u_59qPKMwYo3kHWgXpmejA"
  },
  "sg9bJq0a6bvFhZugdg630g": {
    "date": "8/18/2012",
    "text": "The first time Missus and I went to Queen and Mangosteen was a Friday night. we were looking for a chill place for cold beer and hot food late at 9-10pm. we walked into Q&M and thought it was deserted but as we walked to the back of the joint, we were hit by the crowd, noise and lack of service and left in horror.We gave Q&M a second chance one late afternoon and discovered an entirely different side of the gastropub that was quite charming. The place was quiet with a few tables of idle tourists who were enjoying a cold beer on a hot afternoon facing Sentosa with a wonderful waterfront view. it was entirely resort like and a perfect romantic and cozy ambience. Its menu had classic Brit pub food like guinness pie, mini burgers, etc. happy hour promotions are also relatively worthwhile. So what's the catch? Tiny tiny food portion that cost an arm and leg. definitely a downer for people looking for value for money.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wx-zcLWVaoW6hGl-mNF3WA",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wx-zcLWVaoW6hGl-mNF3WA/o.jpg"
      },
      {
        "img_id": "Z3rhG8uk4C1gGRrSqqKGEA",
        "caption": "Photo of The Queen & Mangosteen - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z3rhG8uk4C1gGRrSqqKGEA/o.jpg"
      }
    ],
    "user_id": "j8UlPZDO6K5iI8T7LKPqEA"
  },
  "vcQE3V7CZCb-dzPs9Ii30Q": {
    "date": "1/13/2015",
    "text": "Went here for the happy hour with a friend. Service needs improvement. The waiter was just walking aimlessly that makes it difficult to get his attention. When he did take our order he had to come back twice to check what we ordered which is basically two drinks and truffle fries. Lousy service!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6ZHZWqI_Q2XF5eUb2Iryw"
  },
  "6bHuv-waT6ZyaXCz3vHNNQ": {
    "date": "8/15/2012",
    "text": "I've always liked the name of this restaurant, I'm happy to say, I've finally dined here and it was good. This is an English pub with some Asian fusion, which makes it tastier than regular boring British grub.Well, it was my Finnish friend's idea to dine here before his flight home. I have only eaten here once, but I would surely come back. The dishes that I had for dinner were the Thai Spicy minced beef served with corn chips and sour cream, Roasted rack of lamb with rosemary potatoes, asparagus and mint yoghurt plus two bottles of Thatcher's green goblin cider.The lamb was delicious and tender tender. Very nicely done. The minced beef dip with chips was very interesting and very declicious... this has chilli padi in it and combined with sour cream and chips. It's a hard decision, but I think the corn chip minced beef dish was the star of my meal. A nice view of sentosa if you sit outside. A memorable dining experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dj72iGHf6TNoh1KorpY4aw"
  },
  "obkcSri-qPaY2Osps2tfRA": {
    "date": "8/27/2012",
    "text": "Pricy outfit, and I suspect patrons are paying more for the nice view and decor than anything else. Food is ho hum, slanted more towards high end pub grub. The duck rillette is pretty good, but nothing else stands out. Fisherman's Pie, fish and chips are all run of the mill items that are easily located elsewhere. Beer is good, I guess, but only because of the extensive Archipelago range that you'd be hard pressed to find anywhere else.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  }
}