{
  "ehX2zp2ffu-JjjzY3lmcKw": {
    "date": "10/3/2015",
    "text": "So, a New England native comes straight from Boston to live in Singapore. The first thing he notices: you can make buildings out of materials other than bricks. Several epiphanies later, he realizes that most of the pizza here is awful and exorbitantly overpriced.Relatively speaking to Singapore standards, Bella's pies are good, and though they're a bit more expensive than the average place, it's not the kind of shakedown you can expect from other spots in the area. If they're still serving the salmon pizza, I'd recommend it; original and surprisingly well done.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DNLvYly7X7022U9xFbbhUQ"
  },
  "IlphEWyd_ITUTALarWzzvg": {
    "date": "4/1/2018",
    "text": "Ample serving of fresh mozzarella with Parma ham.  Grilled veggies fine.Pizza margarita didn't have enough basil to make it being anything other than a cheese pizza. Not terrible but ordinary",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fyCkExL2ex-I5DBbLND5Q"
  },
  "tF4Zkp6YM5-xK_fizCbsWg": {
    "date": "10/1/2015",
    "text": "Is it the best pizza in the world?  No.  Is it the best pizza in Singapore?  Yes.  And I've tried many a pizza in Singapore.   Excellent crust.  Not too thick.  Not to thin.  Properly baked.  Very good quality ingredients.   Service --- well, it's Singapore.  Good service in Singapore has become very hard to find in the past twenty years or so.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EcBIMqc1zZTY_X0Y0Kq1sg"
  },
  "nAGvR9f1brBUrrH1r03i-A": {
    "date": "6/26/2015",
    "text": "I came here because it had good reviews and was close to my hotel. I didn't order pizza, and maybe that was my problem. After looking at the menu I settled on the gnocchi, and I must admit that I had a mixed reaction to it. The flavored and presentation were very good, however I'm giving my this three stars because the gnocchi was over cooked to the point of being mush. Otherwise the space is lovely, though not set up for single diners. I hope the pizza is better than their pasta.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "itqYLlz8cNXsrIETTZ5Rbg",
        "caption": "Photo of Bella Pizza - Singapore, Singapore. Gnocchi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/itqYLlz8cNXsrIETTZ5Rbg/o.jpg"
      }
    ],
    "user_id": "kH7xTjeWHwJVdPfYSe7cew"
  },
  "7okl094qh2ywoiMijF8Q_g": {
    "date": "9/2/2016",
    "text": "It was very good before a change of ownership and still just about OK but food standards and service have both dropped.  Not inexpensive.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oxtvclcRL09DVvRtH0TaqA"
  },
  "NXBetU3xBDRH372495_G9A": {
    "date": "1/24/2016",
    "text": "I am traveling solo and went for dinner. I asked to be seated outside but since I was dining single, the only option provided to me was a high top under neon lighting outside the door. Opted to sit in. Was excited based on reviews. The pizza was pretty good. I'd go back for that again. Also had the avocado and mango salad. Would not recommend. Was a pile of spinach with a few slivers of avocado and mini-cubed mango pieces. There was also ship, two to be exact that were halved. Stingy with the good stuff. So pizza and don't go alone. You won't get a decent table.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZgycvwRKLxZ8GRIb0LWqg"
  },
  "3to_qszqtlMoklP822dMRA": {
    "date": "11/12/2013",
    "text": "This is good pizza but I am not blown away by it. It is too thin for my tastes. It is like the pizza in France, or a little thicker than the pizza in Rome (but with a little worse cheese), both of which I consider inferior to pizza in Napoli. However, they may be catering to the Singaporean palette, and that would probably mean making a similar style of pizza as the early entrant Da Paolo. If this is true, they execute their efforts toward that goal very well.I am in love with Bella Pasta which is under the same ownership.The weekday lunch special is a steal. 18++ for a salad, a pizza, ice cream, and coffee or tea.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "Epm3VAmxP7EY67kF6ledoA": {
    "date": "6/13/2016",
    "text": "Very nice pizza. Traditional taste, very nice dough and crust and a sauce that compliments rather than overpowers. When I find a nice pizza like this I usually go traditional and get classic margarita. You can't go wrong. I have been many times but always forget to review. Will check in with photos next time. Cool spot too if alone or with group of people",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eRu0WjYfmbZk7a0Zf1YrQA"
  },
  "7zhPPMYUfxdGEdwRqI0G6g": {
    "date": "3/31/2015",
    "text": "Whenever anyone tells me about a good pizza place I make it a point to check it out... and guess what? Bella Pizza wasn't only good- it was great! The margarita pizza was cheesy with just the right amount of sauce. The garlic bread was perfectly crispy and everything seemed it was made to order. Can't wait to come back to this little gem!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "d6LyIPcVYZ_OU_RRUNboQQ": {
    "date": "2/7/2015",
    "text": "Tasty Italian food, reasonably priced, good service. Tried their white based pizza with salmon, short pasta with eggplant, tiramisu, and bruschetta. The first 3 were good. The bruschetta was mediocre.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t62KNJ36AZjLhgycA6Xz0A"
  },
  "ChbR41vvs0BiNf4DqS6Cww": {
    "date": "10/12/2012",
    "text": "Amazing, amazing pizza! Thin crust, gourmet toppings, extremely flavorful but not greasy. This is my favorite pizza place in Singapore thus far. MUCH better than Tomatoes, Pizza Hut or Dominoes. Too bad they don't deliver.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p83o6EGHQb8KleEgxBlyMQ"
  }
}