{
  "Aigsb0VxSpcnAVI435YJ_Q": {
    "date": "10/3/2018",
    "text": "This has to be one of my favorite dimsum buffet places. It's slightly pricey at about $70+ per person after taxes, but so well worth it.We had Sunday brunch here and definitely have to make a booking as this place is IN DEMAND. You come here, order what you like from the menu (no cranky old ladies pushing carts), and have a dimsum binge. Oh! I started with the pumpkin soup - I think I had 3 helpings. My favorite appetizer was the deep-fried almond prawns, which had roe and wasabi sauce on top. Making me so hungry right now.The roast meats are absolutely delightful too, though I felt portions were a bit tiny, probably so we could try more things. Consistently good, would return, and starve myself before I come here again!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "r3zUJKsEC4No5S52sBgJLg": {
    "date": "7/21/2018",
    "text": "4.5 stars. Excellent dim sum buffet in the Mandarin Oriental Hotel. This is the buffet type where you sit and order from a menu and they serve you (as opposed to having a buffet line). Not cheap at S$68/pax but I think it's good value for money given the quality of ingredients. You could order dim sum, cooked dishes as well as dessert (all included).We find the cooked dishes standard good like what you would expect from an upscale Chinese restaurant but the dim sum were excellent, in particular the Kurobuta char siew pao and siew mai. Desserts were ok.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d9lsS0EKzUhkOIMvU8KVkg",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d9lsS0EKzUhkOIMvU8KVkg/o.jpg"
      },
      {
        "img_id": "bE7pAahUOKOl5vSomK-pxA",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bE7pAahUOKOl5vSomK-pxA/o.jpg"
      },
      {
        "img_id": "raLFdDN1v03mCmdCiotCaA",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/raLFdDN1v03mCmdCiotCaA/o.jpg"
      }
    ],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "E945olHujD5maF_z3FDxzQ": {
    "date": "2/14/2017",
    "text": "I wanted to do something a bit special with Hubby when we visited Singapore so I decided to book Cherry Garden restaurant for dim sum buffet. It literally combines the two best things together: dim sum and buffet. Hubby was so excited for it and we even arrived at the restaurant 15 minutes before it opened for trading. We went for the first seating that started at 11 AM.The restaurant was quite grandeur and calm at the same time. The dark wooden furniture gave a very classy feel to the whole restaurant. Hubby and I were used to the bustling dim sum carts and noisy tables. I think it was quite calm because there were only a few people that morning. We quite enjoyed the warm and luxurious atmosphere at Cherry Garden. Yes, there wasn't any dim sum carts rolling around the place that morning. We ordered what we wanted off the buffet menu through the friendly staff. Our tea pot always got refilled promptly by them too. The menu also consists of soup & appetisers, desserts and other hot Chinese dishes (rice, congee, noodles, seafood, meat, vegetables).We started off with something light so we ordered the rice congee and a serving of hot and sour soup. The rice congee came with the century egg and shredded pork while the hot and sour soup contained a good amount of seafood in it. Both items look small in the photo but the size of the serving bowl was actually really good. We really enjoyed our deep fried Chinese-bun that came with chilli crab meat sauce. It was so yummy and if there wasn't any time limit on the buffet I'd just sit there and keep on ordering this dish (heheh).We ordered quite a few dishes from the dim sum selection such as chicken feet in black bean sauce, pork siew mai with baby abalone, juicy pork xiao long bao, and the yummy deep-fried escargot dumplings. I never seen or heard of any escargot dumplings before so we decided to order it. It was a sweet and creamy surprise! The Kurobuta char siew bao had a really fluffy exterior and juicy sweet meats on the inside.We really liked how the serving is suited for the number of people in your group. As it was only me and hubby, they gave us a small serving of the braised beef fillet. The beef was really tender and juicy.We really enjoyed our brunch at Cherry Garden and looking forward to go back there again next time we're in Singapore. The dim sum costs SGD $68 per person and there are two seatings available: 11 AM to 1 PM or 1:30 PM to 3:30 PM. It's definitely a great place to celebrate a special occasion as well although you might want to book in advance for weekend or public holiday seating.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "imAIWgHjKnQbplVIEaUheg",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/imAIWgHjKnQbplVIEaUheg/o.jpg"
      },
      {
        "img_id": "09LGU9nGxe4S-EHiOO9xsQ",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/09LGU9nGxe4S-EHiOO9xsQ/o.jpg"
      },
      {
        "img_id": "8ZiqyerlTAPCpMIvcT0JvA",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8ZiqyerlTAPCpMIvcT0JvA/o.jpg"
      }
    ],
    "user_id": "H7xdcr4D5TeHTeueBjWe4g"
  },
  "wE98N2TUune_q5Q01wRutQ": {
    "date": "8/8/2018",
    "text": "Wonderful place, secured, quite, nice waitress, good taste, good sets. Comfortable surrounding. Only non-convenient is no restroom there.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjYejIbZOB89b8jHs0OaOg"
  },
  "5S8Uv7-dtXr7-vbKr_OHrA": {
    "date": "6/18/2017",
    "text": "Considering this restaurant has earned a Michelin star, we had high hopes for our dining experience at Cherry Blossom, however it unfortunately fell very short on our expectations and we left feeling very disappointed. FOOD - We did not select one of their pre-fixe menus, but instead opted for ordering multiple family-style items as suggested by our waiter. We ordered the Peking duck, scallops, pan seared chicken, fried rice, and wasabi prawns. The food was mediocre at best, aside from the Peking duck - which was quite delicious and I would come back for only that. The other items were nothing special, and certainly not \"Michelin-Star\" quality in our opinion (and we're experienced Michelin Star diners).SERVICE - What a disappointment! For this caliber of a restaurant we were extremely dissatisfied with the waitstaff.  While our courses came out promptly, our table was constantly left with dirty plates for sometimes up to 10 minutes after we had finished eating. Disgusting. We also ended up pouring our own wine several times since the servers did not seem to notice our empty glasses despite how many times they walked by. Unacceptable. The waitstaff was nice but very inattentive to us even though the restaurant was not that busy and we were seated next to the hosts stand. This was another annoyance in itself. Upon arriving we were seated at the table right next to the host stand and entrance - in other words, the worst table in the house. It had no atmosphere and it barely even felt like we were dining in the restaurant. Considering it was 7:45 and the restaurant was less than half full, we requested a different table but were told \"they were completely booked\". By the end of our meal, the restaurant had only became more empty, and there were PLENTY of open tables, so this was quite annoying. Our experience was so disappointing overall we skipped desert and opted to leave early. For a Michelin-Starred restaurant, they have A LOT of areas to be improved.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utUE4f2cHFIpb6J8pdosNA"
  },
  "RyVXax4FUtjfVca9bQNUcA": {
    "date": "11/2/2015",
    "text": "A nice dinner in a nice restaurant with really nice n helpful service. The ambiance is nice, the Chinese foods they're serving is Cantonese but judging from the rice soup with pork that they served, I think it's more to Hokkien style porridge. But, I'm no expert to the Chinese food. The cod fish with vegetables and pumpkin soup also very nice. We tried the lobster soup which also very nice. Portions were small and just enough for one person. Price wise this restaurant is moderate. Some food's selection can be very expensive too. Next time I'll try their lunch :-)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wHSBiZx5JGuc5rrlW5Y-mw",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wHSBiZx5JGuc5rrlW5Y-mw/o.jpg"
      },
      {
        "img_id": "o9Ipds6OJwBzvPOqcoAl3Q",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o9Ipds6OJwBzvPOqcoAl3Q/o.jpg"
      }
    ],
    "user_id": "qPMX0LylFc65ZXkivCRPsQ"
  },
  "A-RGZXsObBeXe-DD21pdOQ": {
    "date": "11/25/2013",
    "text": "The location of one of our more recent Yelp brunches, Cherry Garden was in truth, a little disappointing.I've been here for dinner, and one thing that is really top-notch is the service. They really commit to delivering excellent service and deserve due recognition.I enjoyed dinner more than the brunch buffet, mainly because the star of the buffet, the dim sum, was more lose-sum than win-sum.Don't get me wrong, there's plenty of variety, and some very unique selections. The custard bun with chocolate was to me, just delicious. Not too sweet, super rich chocolate filling that other people at the table made rather unflattering analogies with, I was more than happy to eat two.The cooked items such as the pork, duck, and other seafood items and meat were definitely of an excellent standard, and probably stole the show. It's only a pity that there's a limit on how many of certain items you can order because they cost more.The soups were... alright. I wouldn't describe them as bland, but they weren't any better than something you'd order at Soup Restaurant. Overall, while the value for the buffet brunch is undeniable (particularly if you're a bottomless pit comme moi), but I think the quality of the dinner menu is far superior. A good compromise? Go for the buffet, but aim for the cooked items. That's where all the delicious lurks.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FeAqsRjK6vIKrroDJq9kNg",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FeAqsRjK6vIKrroDJq9kNg/o.jpg"
      }
    ],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "y85WX4NEDmVtcHX6zBPQYg": {
    "date": "11/28/2012",
    "text": "Why does Singapore work for gluttons like me? Oh yeah, the endless buffets. It's only fitting I post a SG review for a Chinese buffet... it harkens back to the good ole days of yore, when I willingly posted about my piggy-ventures on the east coast. But the difference lies in the standards of this a la carte buffet of Cherry Garden. This place is good. And by good, I mean goooooooood. Order as many of those little juicy bite-size delicacies of dim sum as you want, and it arrives steaming hot ready to be scooped up and chomped on. Shrimp fillings are surprisingly plump and springy, and the dumpling skin is not too thick (okay, not super thin, but willing to overlook this small fact). If an overload of dumplings isn't enough to satisfy your weekend hangover, top it up with a choice of soup, meat, fish and vegetable dishes-- and even dessert! (I recommend the refreshing watermelon aloe dessert in all its liquid nitrogen foggy goodness). Does this food far exceed any Chinese buffet I've ever experienced back home? Um, yes.The price is only marginally more than you would pay for any normal dim sum excursion, so is it worth it? Um, yes. Have I gone more times than I can possibly admit on a public forum and not seem ridiculous? Um, yes.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PSiioYMqJ1r0On_RijpQaA"
  },
  "X8vNunWkcTwS5qnPKiIbVQ": {
    "date": "9/15/2013",
    "text": "I spent two years in Hong Kong so yes I'm picky about my dim sum. And I've also always been incredibly disappointed with the dim sum offerings in Singapore. Even back home in Melbourne there were better options than here.Cherry Garden is the one exception. I will admit that I feel as if the standard has dropped a little since I first came here. But it's still the best dim sum I've ever had in Singapore.Their dim sum brunch deal is good value for all you can eat. There are a few mis-steps, eg. the skin on the har gau is too thick, the fried tentacles are bland and the hot & sour soup also lacks punch.But there are also a lot of hits. The char siu bao is very well executed, the loh bak guo is in the Singapore hawker style rather than the Cantonese dim sum style but tastes excellent, and I highly recommend the wasabi mayo prawns.Service is professional and polite and the restaurant is a fairly comfortable one to sit in.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XE9Tc6dizP3_rYm_4AjU2A",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XE9Tc6dizP3_rYm_4AjU2A/o.jpg"
      }
    ],
    "user_id": "41MtZiv6L0dB4S9NdnO6_g"
  },
  "suzmVLIiKRTX3fNvFwS6Kg": {
    "date": "12/8/2013",
    "text": "Our experience at Cherry Garden was a polished one from beginning to end. It was a little on the pricey end but we did eat a number of delicacies and receive impeccable service. Their ability to adapt their traditional dishes to be gluten free was done with a can-do attitude and at the end of the night our waiter came over and gave me a fresh long stemmed rose to keep. A sweet gesture that brightened up our hotel room for the duration of our stay.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1uSR3bNjYwZZiyOzT55PZA",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1uSR3bNjYwZZiyOzT55PZA/o.jpg"
      },
      {
        "img_id": "1j3qzgUBf9aRQpK2FVwpHg",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1j3qzgUBf9aRQpK2FVwpHg/o.jpg"
      },
      {
        "img_id": "gBm3XA7UpWxPcD1rvKhOFg",
        "caption": "Photo of Cherry Garden - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gBm3XA7UpWxPcD1rvKhOFg/o.jpg"
      }
    ],
    "user_id": "695WsVwMJ4wQ1vzvguZsZg"
  },
  "O6ovxICquzAUBTR6El73TA": {
    "date": "11/9/2013",
    "text": "Love love love it. But haven't been since they stopped the champagne brunch where we were regulars. But I do plan to go back soon just for the food as the food is utterly amazing. I would say that compared to Yan Ting, Cherry Garden has huge highs but some lows, whereas Yan Ting lacks the highs, but is consistently very good across the board for all items. I don't know about you, but for free flow dim sum, you can stick to the amazing items. I still dream about the gyoza and the crystal mushroom/courgette dumplings, and the drunken sesame chicken. Awesome! And don't forget the chocolate ball desserts, oh my.... I could eat those all day. And my friends all loved the mango dessert. Check out my blog for more info! Here is one of my posts:mylifeinsin.com/2012/11/…And heremylifeinsin.com/2012/12/…",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2lrdQWjAlTpVYklsYsUa3w"
  },
  "U6CcBudBbekjPcbKI00xvQ": {
    "date": "1/7/2013",
    "text": "Maybe my expectations for this place was too high. I went with my taiwanese friends who were in town, and they wanted to go due to high reviews on trip advisor. The general consensus was a \"meh\". Sure, it's a buffet, for a relatively affordable price, but the items are, in my humble opinion, not as tasty as say Imperial Treasures or Crystal Jade dining in. It was oooookay, but nothing blew me away. The soups were a little bland, and the various dumplings were somewhat well, buffet standard. Definitely not coming back.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "czQaebxtOTD56TC3jtPEiQ",
        "caption": "Photo of Cherry Garden - Singapore, Singapore. Wasabi prawns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/czQaebxtOTD56TC3jtPEiQ/o.jpg"
      }
    ],
    "user_id": "Ruh7DvkWtO_oXqyrCYbXig"
  },
  "7xRfg63d5oKLhq9BFAjGQg": {
    "date": "12/11/2014",
    "text": "Weekend dim sum brunch here is as good as it get i.e. on par with any of the other famous dim sums you can think of. Ambiance here is excellent to give you a comfy feel. Do try out their crispy wasabi-aioli prawns with fresh mango and roe.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SfAHIf_hNYrRdhew4pmlA"
  }
}