{
  "WQT42Kdilx3umWcDl-y8RQ": {
    "date": "12/2/2014",
    "text": "Never been to turkey for turkish food so my review is not comparable to the \"real thing\"Ordered a salad plate to share with sesame bread - bread was fresh, warm and very tasty! Kebab was sssoo good. Service is great. Try this place!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "dAFE7U__mmGB0qTdcWvQ1A"
  },
  "NKi_8NXHYwDtR-xbxKG60w": {
    "date": "10/30/2018",
    "text": "Surprisingly quite a few people dining here on a Monday night. Quick walk from Bugis MRT. Weirdly located at a mall. I've never been to turkey for real Turkish food before but this place was not bad for something different in Singapore but we expected more flavour, presentation and service from a 4.1 rating and for the price we paid.We had hummus ($6.50) with bread, which as not bad but perhaps needed more garlic or tahini or something.The chicken pide ($14.50) was okay. Just tasted like a regular pizza. The crust was nothing special.The hunkar begendi (roasted eggplant with cheese $19.50) was a mix of eggplant with lots of cheese on top. Kind of bland and tasted better with chili or hot sauce.Adana Kebab (mixed beef and lamb $21.50) was also just okay. The meat was tasteful but presentation of the sides was sad and don't think this dish was worth the price.The Turkish tea just tasted like regular red tea in a special glass.Service could have been better. It took us more than 10 minutes trying to pay for our meal so we could leave. Unfortunately, don't think we'll be returning because luckily there are other places with better Turkish food with similar prices in Singapore.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FY0wCNcv5-svBLyMH2mJng",
        "caption": "Photo of Sofra Turkish Cafe & Restaurant - Singapore, Singapore. Adana Kebab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FY0wCNcv5-svBLyMH2mJng/o.jpg"
      },
      {
        "img_id": "ApesHoqUlGFr5pxhHi7Muw",
        "caption": "Photo of Sofra Turkish Cafe & Restaurant - Singapore, Singapore. Sesame Bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ApesHoqUlGFr5pxhHi7Muw/o.jpg"
      },
      {
        "img_id": "OFwW7Vd8rVYceRhveuneOA",
        "caption": "Photo of Sofra Turkish Cafe & Restaurant - Singapore, Singapore. Pide",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OFwW7Vd8rVYceRhveuneOA/o.jpg"
      }
    ],
    "user_id": "823Dnvcl40ilhKcixVfTkA"
  },
  "0KvIfsIDilu5GJn2sWEeoA": {
    "date": "9/25/2015",
    "text": "We braced ourselves for their poor services when we came here for dinner. Maybe because we were here at 6pm and we were only one of two tables occupied, service was ok. Not the warmest expected but no bad. We had a Chef Platter to share and the meat slices though they looked very dry, they were full of flavour in your mouth! Very very good!!!We also has their Hummus which was also very good with the Turkish Bread. Roasted Eggplant Salad turned out to be a cold dish and we kinda didn't expect it. It's not bad but I won't order it again. I had the Sultan Kebab which I didn't realize it was with that much cheese. I loved the cheese and stewed meat combo. Hubby had the Pide which is essentially a Turkish pizza I guess. He enjoyed it. Two of my friends had the Chicken Baked Rice and they liked how cheesy and creamy it was, with a generous amount of grilled chicken meat that's with good flavour. We enjoyed the Chef Platter the most in the end and would probably get that...one for each one of us! Haha",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0zZsmdE1Y0vm7SMc3-zRqg",
        "caption": "Photo of Sofra Turkish Cafe & Restaurant - Singapore, Singapore. Sultan Kebab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0zZsmdE1Y0vm7SMc3-zRqg/o.jpg"
      },
      {
        "img_id": "KloBSvbJ6HgwM5uVGkBoJQ",
        "caption": "Photo of Sofra Turkish Cafe & Restaurant - Singapore, Singapore. Pide (Turkish Pizza)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KloBSvbJ6HgwM5uVGkBoJQ/o.jpg"
      },
      {
        "img_id": "DCWSX_Xdq0smVhGBWwNFnQ",
        "caption": "Photo of Sofra Turkish Cafe & Restaurant - Singapore, Singapore. Chicken Baked Rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DCWSX_Xdq0smVhGBWwNFnQ/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "gJjRf2Cc_OaZH4jnjnZLCw": {
    "date": "10/28/2015",
    "text": "Sofra is the Turkish word for table located in a comfy corner in town. You can sip a cup of relaxing turkish tea while enjoying the renown hospitality from the dedicated kitchen crew, all of whom hail from turkey. It is located on the second floor of Shaw Towers which gives you a great view of the bustling street. It is a about a 3 minute walk from Bugis MRT.Checking out the menu, you will realize the exotic foods of Turkey mainly come with bread or rice and for protein, you can pick from Chicken, Lamb, Beef or a mix of these 3 meats.The restaurant ambiance is comforting and cosy. The atmosphere has a Mediterranean feel with soft Turkish music playing in the background and an open concept kitchen with a see through window where you can see how the kebab is prepared.If you like meat, you will feel quite at home over here.They have quite a huge dining area and there were big families coming in to dine on a saturday night.1. Pretty Dolly $4.90++The Pretty Doll was a lemon soda that tasted like a lemon flavoured sprite. Nothing fancy to be honest. I would rather get the Sofra Mocktail which had almonds, plums and pistachios in the drink for $5.20++. Nonetheless it was still an interesting drink to test out.2. Turkish Bread and Humus $2.90++ + $5.90++I love bread with dips and this Turkish Bread was shaped like a UFO dish and steam was still piping out as it was served to us. The thickness of the bread was just right and it reminded me of my trip to Israel for weeks we ate hummus and pita! The bread dough was very flavourful but with the hummus dip, it was perfect! Hummus is a traditional turkish dip of mashed chickpeas and spices and with a zest of lemon juice. Sofra's rendition of the dish was even better. The flavours blended well together making it a delicious appetizer and complimenting the freshly baked bread.3. Jumbo Kebap Combo $38.90The Jumbo Kebap Combo is great for those that love their meat but can't quite decide what to get. The meat is served to you on skewers hot off the grill. When it arrives, our jaws drop. Sword, candle, flowers, all the works. It certainly has that wow factor doesn't it?This Jumbo combo comes with various kinds of kebab, or kebap in Turkish, including shish and döner. This dish can be quite initimidating too! While the menu advertises this as being a platter for two, the generous portion makes it large enough to feed three adults.The eggplant kebap was a roasted SWORD of eggplant and minced beef. It was an actual stainless steel turkish sword that the wait staff would gladly get it out of your way, in case you hurt yourself with it!I love the touch of a onion flower bowl to hold the salad. So pretty to look at and the salad was so refreshing to eat!4. Shish Kebap (Lamb/Beef) $18.50++ per choice of meatAnd it wouldn't be a Turkish meal without Shish Kebap (Kebab/kebap) would it? I'm not so sure why the menu description says it comes with 'cracked wheat', since the plate seemed more like a generous platter of vegetables, protein and carbohydrates. It was a melange of pickled red cabbage, onions, roasted peppers, tomatoes, deliciously smokey chicken and beef chunks, and a tasty mound of short-grain rice with chickpeas. If this isn't a well-balanced dish, I don't know what is.5. Chef Platter $22.80The Chef Platter is a combination plate consisting of Doner Kebap, Izgara Kofte and a skewer of Shish Kebap . The mixed beef and lamb was tender and juicy and so was the chicken! The skewer of chicken Shish Kebap was a tad dry to me but it was nicely marinated. Izgara Kofte which is actually grilled flat meatball. Chef PlatterThis piece looks like chicken meat to me as the colour was quite pale as compared to the other piece. It was juicy and delicious! The other grilled flat meatball on the plate, probably a mixed of beef and lamb, tasted great too!6. Yogurtlu Kebab $18.90++Beef and Lamb Kebap flavoured in Sofra's own yogurt sauce. It had bits of bread mixed in with the meat. The bread would be soggy but would've soaked up the yogurt goodness. I think this is a high protein and yet rather healthy main! The rice was also very flavourful and not too oily. I had trouble trying to finish this dish despite sharing it with someone else!We were really full and satisfied so gave dessert a miss. Anyway we will still go without it as Turkish desserts are generally too sweet for our liking.All in all, great service and great food. The ambience is truly exotic and you can have a fun time. I witnessed several groups of people celebrating birthdays at Sofra.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "5YncQQmoV0PTaXWdS-Tz9w": {
    "date": "7/4/2015",
    "text": "Came here to break our fast last night with a group of friends and though the food was decent, service could have been better. I ordered the the Adana Kebap with mixed lamb and beef and I was surprised. It was delicious. The meat was flavored perfectly, it was juicy, and the kick of spices took it to the next level. As great as the kebap was, it didn't make up for the lacklustre sides. The Spanish rice it came with made no sense at all. Identity crisis much? And what looked like a different take on salsa didn't taste remotely fresh. To get water we had to wave down the waiter twice.. Only for the waiter to come and bring only half the table water. I consider the entire experience to be just okay.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "XB5nwY68o3ZPeUloLSaglA": {
    "date": "9/8/2012",
    "text": "Located at Shaw Towers, where all the good food resides, is Sofra Turkish Café and Restaurant that specializes in Middle-eastern Turkish halal fare. The interior décor of the place is Arabic-themed with carpet runners and colorful ornaments. The menu leaves you spoilt for choice with their wide variety of dishes. They had more than a dozen kebab varieties alone. For starters, I ordered Turkish bread along with Hummus Dip. The bread was served fresh and fluffy and tasted delightful when dipped in Hummus, which is basically mashed chickpeas with spices. The dip was light and not overpowering. Next, the Chicken Donor Kebab arrived. It is sliced meat from the turnstall roaster and the chunks of chicken were tender and intensely flavorsome. I gained a hearty meal at a really decent price. To top it up, the service was commendable as well as the staff were polite. I would definitely return for the meat again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "zO7uTCEF5m11IyDIQJ7biw": {
    "date": "8/8/2014",
    "text": "Competent Turkish food. This restaurant has been in business for the longest time. It's clearly found a niche and adapted the Turkish dishes to suit local expectations of a \"main\" and starters without being too \"ethnic\".",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6dsc7ibCyCJzPITbpzuNAQ"
  },
  "wrLHKQpxGLUNRvhShGVBRg": {
    "date": "7/28/2012",
    "text": "Sofra is nested in the old school shaw towers and it is not the most appeal restaurant even if spot the huge sign board from across the street. Well, if you are too quick to dismiss this place, you are missing a great turkish joint with possibly the best eggplant dishes. From not wanting to put anything remotely eggplant into my mouth despite my love for vegetables, I was instantly converted into a die-hard fan thanks to Sofra. They have a roasted eggplant dip offer as a seasonal special. Pleasantly surprised as it was cold, the midl garlic flavour with a touch of paprika that went well with flatbread, which is ordered seperately. The Chef Plate is possibly the most tempting combo and more often than not I always order that for the value of its portion. It can easily feed 2-3 person. If you really like your eggplants as I do, do go ahead and order the mussaka. Creamy, flavourful and filled with a portion of meat, this alone could be your main course!When you leave the restaurant, you might just be lucky to be greeted by a staff in a traditional turkish way; they will pour some rose water unto your hand and invite you to take a sweet candy, making the experience rather authentic afterall!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKY29o3cqaQYcFdR_bZdg"
  },
  "CWjj_TnGs1cIxj7R_Duk3A": {
    "date": "8/30/2012",
    "text": "Sofra has been around for quite awhile and it's a good choice if you're craving for turkish cuisine in the area. The menu is pretty authentic although after frequenting this place often, I get the sense that the tomato base sauce is used in almost every dish!Some of my favourite stuff on the menu include the turkish style pizza or the pide - you can choose your choice of meat - lamb or chicken or beef.The kofte or meatballs is also pretty good. When you order the kebabs, it will come in the dramatic sword-like skewers, always love seeing that on my dinner table!Seats near the glass window overlooking beach road traffic, is quite a nice sight at night - so make sure to book a table at that area if you're planning a nice date, adds to the ambience!Service is hit&miss, mostly made up of foreigners. You'll get the friendly and attentive ones if you're lucky.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  }
}