{
  "fDsHM_NWjmpQzHKJEWWYcA": {
    "date": "9/30/2017",
    "text": "value for money!simple selection but big in quality.i love the cheese platter, the oyster bar, the salad bar (kale,quinoa,romaine, assorted nuts, sauces), and the mountain of scones!they also serve salmon and tuna sashimi, beef stew, veggie pastry, prosciutto di parma, polo bun, curry puffs, assorted sliders and a lovely 2 tier dessert tray served directly at your table with unlimited refills of items. drink wise, you have a choice of fresh juices, tea, coffee and chocolate if you opt for no champagne. Excellent service and great speed of food replenishment. would love to return soon!note: if you prefer local food then this high tea is not for you.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "0KBfe9SsBJKH0uLqBwYZjQ",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. This week's tier of desserts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0KBfe9SsBJKH0uLqBwYZjQ/o.jpg"
      }
    ],
    "user_id": "Xij-B5G19fXDZ9uYGPZAqg"
  },
  "D7cqa-jactBgYWUJsHrQgg": {
    "date": "4/16/2017",
    "text": "Afternoon lunch buffet with a local flair! Not quite what I expected but probably more suited for tourists looking for a more Singaporean experience than I was lol. Huge spread of food including salmon and ice cream.. definitely great for lunch",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5yHEhlNRwMvxcFxvvK77RQ",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. Scones with kaya, jam and clotted cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5yHEhlNRwMvxcFxvvK77RQ/o.jpg"
      }
    ],
    "user_id": "86kWlG8XZiVG7NhfpdI1LQ"
  },
  "vyzP3NVqB7uBqzrgBaUT6w": {
    "date": "10/4/2017",
    "text": "The lunch buffet has limited items, and almost no local dishes, but what's there is fresh - salads, oysters, a few sandwiches, 2 kinds of sashimi and 1 sushi, 2 kinds of cheese, fruits, scones; hot items include a soup, a pan fried dish made to order, excellent crab cakes, good curry puffs. Service is swift and pro-active, by far the best among all the outlets we've been to at the Grand Hyatt (Straits Kitchen, mezza9). If you have the Hyatt Club card and there are only two diners, the 50% discount makes the reasonable lunch outstanding value!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VdvAsW-5au70DJqRk1LmjA",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VdvAsW-5au70DJqRk1LmjA/o.jpg"
      },
      {
        "img_id": "BX9EEf53B9LjlsgdDN6sxw",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BX9EEf53B9LjlsgdDN6sxw/o.jpg"
      },
      {
        "img_id": "5sQNoCi5rEOMqUvVVe84TQ",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5sQNoCi5rEOMqUvVVe84TQ/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "ETQM2MmSWPO_fJjWRMuBlw": {
    "date": "1/13/2016",
    "text": "I have to leave an updated review. Someone left a 2-star (or is it 1-star? Sorry, goldfish memory) review which needs correcting. The service we received for our Saturday 3-5pm seating was great. Vanessa our captain made us feel at home and all her staff were attentive and friendly. Our champagne glasses were never empty for long and our plates were cleared promptly the minute we left to take more items from the buffet table. The only reason this is not a 5-star review is because I think the food (at the buffet table) isn't as good as before. Oysters are still there, but the range of cheeses is more limited now. Just one variety of blue cheese. The desserts are good but I find the number of savories to be limited too. Just some sushi, popiah and three stations of hot food (one was lentils. Really?!). Anyway, I go purely for the champagne. So I am very happy each time I'm there. Hahahaha!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ll8i_MbVPTMUiCijKoQuQw",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. Easter cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ll8i_MbVPTMUiCijKoQuQw/o.jpg"
      },
      {
        "img_id": "P29cjVuPp9T_tgPheVhUew",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. 10 Scotts has a Lo Hei set during CNY",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P29cjVuPp9T_tgPheVhUew/o.jpg"
      },
      {
        "img_id": "qTtkdagppnS0YtvLtL7KDQ",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. Oysters!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qTtkdagppnS0YtvLtL7KDQ/o.jpg"
      }
    ],
    "user_id": "m369Z6yvE3E5vBww9DSJsw"
  },
  "pJWLFnbNh9JLYVUlnr8zRw": {
    "date": "2/23/2015",
    "text": "Having heard many rave reviews of this place, we decided to give it a try on the 4th day of Chinese New Year even though we are High Tea newbies.First thing that we noticed is the attentiveness of the staff, all the way from making a reservation, to seating us, to patiently explaining the different kinds of teas to us. We were thrilled to discover that the High Tea is replenishable with selected items being available from the buffet counter (cheese, fruits, sushi, chinese new year crackers, sauteed beans, popiah etc). The tea we chose from the menu is replenishable as well.Another plus point we enjoyed was the seating area. Towards the end of the high tea session, servers placed candles on our table creating a soft, soothing effect which is very good for relaxing.One thing that we noticed was the high tea edition came with a small plate of yu sheng given that it was chinese new year season. We had great fun having another round of lo hei!It was such a cosy experience that we would definitely come back here again. Minor downside is that the price for high tea per pax is abit steep.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LH2XQEZEekcdGGdL_6JLyA",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LH2XQEZEekcdGGdL_6JLyA/o.jpg"
      }
    ],
    "user_id": "ZNyfGsIwsedPlpjmoaq3Eg"
  },
  "HITcM6UZnt2POKoR6c78Nw": {
    "date": "3/3/2017",
    "text": "lovely place.  Ice cold beer. nicely decorated.  comfy chairs. As nice as it was I wasn't  sure if I would get a drink.  Whenni did,  i didn't know if i withs ever leave. Eventually the guy that sat me asked the girl that gave me my menu if she had taken my order.  I often find that in Singapore that unless you are frantically waving your arms around,  that means you don't want anything but this system only works if the person that takes orders ocasionally looks around the room.  Luckily the guy who sat me noticed that 15 mins later I was still waiting and didn't have anything.  Very patiently I might add. The beer was cold and a fair price for Singapore and I got some nice free nuts.  However when I wanted to get my bill I was similarly ignored until some people sat next to me got their menu (mind you a girl walked past me about 6 times without looking up once. ) This was my chance and i waved frantically enough to get noticed.  Almost embarrassing to wave like that. I thought it would be uncool to yell out in a peaceful bar like this. i would have happily drank 2 beers in my 1 hour that I was there but it was too difficult and I didn't have 2 hours to spend. I feel bad giving this review as it should be 5 stars and when i did get served the girl was lovely. She was clearly doing some work innthe computer which maybe her boss made her do but her service makes me only dare go here if I have some time to kill which today luckily I did.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AMexPsUO1CRpLm9g4qbojg"
  },
  "cBPOrVv1lLi837djWWu2Vw": {
    "date": "12/30/2014",
    "text": "Afternoon high-tea at the Grand Hyatt? What can be better? After all, it's the Grand Hyatt so I do expect to be blown off my feet. And $80 for food and free flow champagne, oh baby! There are two sessions available, one from 12-2:30 and another one from 3-4:30. We opted for the former, treating our high tea as brunch! The spread was decent but quite limited for a buffet, only 1 table. The spread includes the likes of  sushi, soup, small sandwiches and pastries, fruit, cakes, bread, cheese platter, and...raw oysters! The raw oysters were definitely my favourite! The next best thing was the cheese spread! There was an assortment of 8-10 different kinds of cheese, 3 of them were blue! If you like blue cheese (like moi) + champagne then the $80 was definitely well spent. The other food, meh? I had much better. The savoury/sweet tower of pastries/scones/puffs were not bad but not great. My friends swore by the crab cakes, but I was less than impressed. Too dry and not enough crabmeat, and not to mentioned, canned crab meat. The snob in me was appalled. I preferred the scones...a little bit of butter, some raspberry jam...YUM! Some champagne with that? HEAVEN! Okay, the bad: This is possibly the worst service I've ever seen at a 5 star hotel and definitely not on par with what the Grand Hyatt supposedly offers. We had to clear our own plates and refill our own champagne and water glasses. The waiters were simply talking to each other in the corner. I ventured into the kitchen, not once, but twice to ask them for the tea selection. When we brought the champagne bottle to our table (like any decent alcoholic) they were not pleased. Well, if it takes 10-15 minutes to refill an empty glass, I think we might as well keep that bottle at our table, especially since operation was only at a 25-50% capacity. You know what I'm sayin'? Overall, would I return? I think not. The service was really bad and there are much better high tea places elsewhere (with a better spread, food, and, most importantly, service). For about $50 more, it is possible to enjoy a much wider spread for Sunday brunch + the free flow champagne. This was not a good experience. Major fail Grand Hyatt.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3g_vgaCNlvR5uKmUkSz8Rw"
  },
  "4FhhzJjQDefX2HTnG9OlDQ": {
    "date": "6/22/2014",
    "text": "From the ambiance to their service, 10 Scotts amazed me. They have an extensive list of tea to choose from, be it hot or cold. The buffet spread and tea-tray spread was curated nicely to compliment a nice afternoon tea any day. It is definitely a place I would come back again.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "S9qxxaL0ATElOhTF6WzA7Q",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. Flower-pot ice-cream.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S9qxxaL0ATElOhTF6WzA7Q/o.jpg"
      },
      {
        "img_id": "fxY6uWZmQBNXrhh_kGemGw",
        "caption": "Photo of 10 Scotts - Singapore, Singapore. Tea-time.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fxY6uWZmQBNXrhh_kGemGw/o.jpg"
      }
    ],
    "user_id": "Jd4LuJ2nCNBMayehLhhL4w"
  },
  "vTgGsx486uoNLpF-KreDpQ": {
    "date": "9/2/2012",
    "text": "If you like a peaceful place to chill and catch up with friends, 10 Scotts is a great place to go to. Unlike the SPG filled Martini Bar at the Mezzanine, this is the place for High Tea and cocktails! It is comfortably lit with nice sofas and private corner sittings.High Tea runs till 5pm and if you can't make it in time for high tea, the cocktail happy hours run from 6pm to 10pm daily. With a minimum spend of $100, you can claim a complimentary car park coupon as well. Make sure you try the crab cakes because they're good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5kAWAwrrLQkwJwB5bKH4DQ",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5kAWAwrrLQkwJwB5bKH4DQ/o.jpg"
      },
      {
        "img_id": "iKEoclefN_7RDfVWdoK8fg",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iKEoclefN_7RDfVWdoK8fg/o.jpg"
      },
      {
        "img_id": "-ZRg8Wp6pfLZ_TX-bU-WdQ",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-ZRg8Wp6pfLZ_TX-bU-WdQ/o.jpg"
      }
    ],
    "user_id": "k0_Z5cdfaNC2F--70UzalQ"
  },
  "e0hjrJoMdOL3VjkyvC5oOQ": {
    "date": "11/12/2012",
    "text": "We were here for weekend high tea. Simply described, it's a la carte high tea with a decidedly upper class slant.Double tier high tea trays are filled with nibbles like sandwiches, cakes and canapés. Also includes local bites like popiah and curry puff. All refillable. Scones are served with clotted cream, jam, and kaya for a touch of Singapore.Buffet table includes cheeses, ham and dessert like brownies and cakes. The plum with hazelnut ice cream in grand marnier is potent. A wide selection of tea and drinks is included to go with the food. Decor is cosy, in a lounge like environment. Sofas and armchairs are plenty for those who prefer to laze. Definitely different atmosphere to the busy straits kitchen opposite.Good service.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "6dsc7ibCyCJzPITbpzuNAQ"
  },
  "vmcdEWW2b5hB-PZzOJR_rw": {
    "date": "8/23/2012",
    "text": "Nothing like its sibling the Martini Bar upstairs, 10 Scotts is a more chilled out and uber chic locale that serves up a good offering of champagne cocktails. And with the happy hour running an hour longer (from 6pm to 10pm daily), you know you're in for a jolly good time here. There's plenty of nooks and corners you can plonk yourself at should you want to enjoy a little privacy, unlike the crowded Martini Bar upstairs and one of the better spots we've found was right at the back of the lounge where you can sit back and enjoy your drink in peace. Other than the price ($11), the fact that they use Perrier-Jouet champagne to craft these drinks makes it all the more worthwhile. And if you can't drink on an empty stomach, there's a cleverly assembled Best in Show menu that features top eats from the various dining options within the hotel. The crab cakes and remoulade sauce are one of the better ones!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aBKh52ePGd3OG8di20wdw"
  },
  "31tmW0kz-ZdDymwdoxc01Q": {
    "date": "8/9/2012",
    "text": "High Tea Buffet anyone? 10 Scotts is the place to be or rather the place to been seen. Delightful canapés are served on a two tiered silver tray and best of all they are refillable! My personal favourites being the crab falafel and the fig & brie on a bite size toast. If you have not tried figs, the sweetness they exude is a perfect match with the lightness of brie so be sure to give that a shot! Finally what would a high tea be without dessert, from mini éclairs to Japanese red bean pancakes, 10 Scotts has it covered.  There are two seating's on the weekend being 12pm - 2pm and 3pm - 5pm (This seating is always full, it's tea time obviously so be sure to book a day in advance at least!).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HkabXXCFzbdK2swHAyoc_A",
        "caption": "Photo of 10 Scotts - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HkabXXCFzbdK2swHAyoc_A/o.jpg"
      }
    ],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "VcbJ0DYxvUhM67vMNhaCow": {
    "date": "1/17/2013",
    "text": "quite popular and not easy to find seating.  sometimes have to wait up at the martini bar upstairs (quite the martini menu selection there).  recommend to bring out of town guests here as a starting point for the night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kS1MQHYwIfD0462PE61IBw"
  }
}