{
  "mYxPLcdbkSf7-SyQqpznrQ": {
    "date": "3/20/2015",
    "text": "Oh my.. This is one good Thai restaurant... The sea bass with chili and lime is yummy and so is the soft shell crab with the salts yolk gravy. Check this place out when you have cravings for Thai Food",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3Td38Drv_8iIyHaUSfjt8g"
  },
  "LFCkuHuKVsz4thTPVbYlxA": {
    "date": "5/18/2014",
    "text": "Cool logo. Nice atmosphere. Waiter very astute, but service was tag team. Food was excellent , as was variety. Reasonable price. good value.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScCkd6Ikf3zsWsYFRIH06A"
  },
  "Pv5KqNejNWwY8hkrIImvzQ": {
    "date": "4/21/2014",
    "text": "On the second day of my Singapore layover I found myself in the super upscale ION Orchard mall at lunchtime. Deciding to continue with the spicy theme started at Aromas of India, this small Thai restaurant in the basement looked promising, and indeed I wasn't disappointed. The friendly hostess took my order on her iPad and in short order I received the assorted hors d'oeuvres, comprised of tasty Satay, shrimp cups and eye-watering Larb Tord pork balls. Next up was soft shell crab pad Thai and green curry rice with salted egg, both exceptionally yummy (and not especially salty). The parent restaurant in Bangkok is highly regarded, and clearly the tastes have been transferred to this outpost in Singapore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kJTb9JGu3mAK9I0zBCTp1Q"
  },
  "2d8xnJpQYxubi9D4ROic-Q": {
    "date": "4/28/2017",
    "text": "This Thai restaurant is located in the Ion Orchard mall and was recommended by a fellow Thai coworker to go there. I came here with a party of four.We ordered a variety of dishes and I thought everything was rather tasty. I've never had Thai food outside of the United States so this was a first! Everything is a lot spicier here and there are certain dishes that are missing from the menu (where is my pad see ew). We got the papaya salad and it was incredibly spicy but rather tasty. I like strong savory flavors and thought this one was great. The heat from the salad was a killer though and I'm pretty sure I started sweating at one point.The tom yum soup was also delicious and quite spicy. I love rich flavorful soups and this was good.We also got the dessert that looked like flour or rice balls in a coconut sweet broth (like Chinese tong yuan). They tasted really good and not super sweet. I like Mochi like items so this was a good fit for me.Service was kind of hit or miss despite nobody being in the restaurant though.If I'm in Singapore again I'd love to try this place again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5132vXB5hEEYYYd9X2TmtA",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Papaya salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5132vXB5hEEYYYd9X2TmtA/o.jpg"
      },
      {
        "img_id": "o0JQMJG2S5fk-m7qarP-QA",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Tom yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o0JQMJG2S5fk-m7qarP-QA/o.jpg"
      }
    ],
    "user_id": "taPq7IxYskEWH7Vfc261pQ"
  },
  "cLP5A9uHpm-HwDzc-n9VSw": {
    "date": "10/17/2017",
    "text": "It was my first time trying this place which was highly recommended by my friend who said that it's the best Thai restaurant she has eaten at in Singapore. Menu was quite extensive and price was higher than average. I decided to splurge a bit and tried the claypot of vermicelli with tiger prawns. The vermicelli has infused the essence of the fresh prawns and the portion was satisfactory. The iced milk tea was disappointing though. We asked if it was possible to have a less sweet version and were surprised when the waitress said we could give such an order. The tea that got served was still too sweet and definitely not worth S$5.90 before tax. My friend ordered stir fried vegetables and some of them were rather hard. Overall still a positive experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LNxwwIGKWx8k4kInQTAxJw",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Vermicelli with tiger prawns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LNxwwIGKWx8k4kInQTAxJw/o.jpg"
      }
    ],
    "user_id": "pDk2mjq7RTpIc6AWIvrbfw"
  },
  "w-x0OYLqDwrtfcNHRLw23Q": {
    "date": "2/2/2017",
    "text": "Food wise, this place wasn't too bad. I particularly enjoyed the beef noodles (though the noodle isn't the fat chunky ones they have in Thailand, but it'll have to do). You may want to try their soft shell crab with blue butterfly pea rice as well!When it comes to affordability, I would say that there are definitely cheaper options out there. I paid $6.50 for an average tasting lemon grass drink, which I felt was exorbitant, but it was my first time so I didn't know better. The service could be better; I was afraid to raise my hand to ask for something because one of the waitresses looked really annoyed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6cXxmIuUgmSaSRvLjIdOzQ",
        "caption": "Photo of Nara Thai - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6cXxmIuUgmSaSRvLjIdOzQ/o.jpg"
      }
    ],
    "user_id": "g-P058qnhLVXnEZYKBaVug"
  },
  "Nq4w0eKnsU3RyzjSp3Iqvg": {
    "date": "8/17/2016",
    "text": "Recently the menu had gone through a change with a list of new items added. The place was not crowded when I came for a light weekday dinner.Hor Mok Ma Praw On ($16.90++)Seafood & Coconut OtahServed in a coconut husk, and topped with coconut milk. The otah was rich and not too spicy. There was chunks of fish, prawns and squid in the otah. Best with rice.Khrim Maphraw Linci Khnom ($7.90++)Yam & Pumpkin in Lychee Coconut CreamThe dessert was served hot. The first taste reminded me of Bo Bo Cha Cha, a local dessert, with the pumpkin tasting like sweet potato minus the sweetness and firmness. The dessert was quite sweet.Do take note that plain water is chargeable at $0.50++. Service was fast and there was free wifi from the mall.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Y30hhmfucMlReCO0ka1QA",
        "caption": "Photo of Nara Thai - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9Y30hhmfucMlReCO0ka1QA/o.jpg"
      },
      {
        "img_id": "-yXar62OmJrziFfPEh7L5A",
        "caption": "Photo of Nara Thai - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-yXar62OmJrziFfPEh7L5A/o.jpg"
      },
      {
        "img_id": "5GrSBjWF1Mv2tTrfNmT42A",
        "caption": "Photo of Nara Thai - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5GrSBjWF1Mv2tTrfNmT42A/o.jpg"
      }
    ],
    "user_id": "2F38Uc4UNNbFVdyUUnBjOA"
  },
  "-euNVl22VvBNd3Y9Ea032A": {
    "date": "3/4/2018",
    "text": "After a dip in quality of food and service, Nara seems to have rebounced, although it is much less full than when it first opened. It distinguishes itself for having unusual dishes rarely found elsewhere. Pricey for its shopping mall location next to a Korean army stew eatery!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "L5bggu_9sZNFC0MIsRF80w": {
    "date": "7/24/2014",
    "text": "It seems like I keep ordering the same thing whenever I dine at Nara Thai. The lunch sets are affordable with prices starting from $13.90++. There are only 3 options for now and I have only tried the basil chicken with fried egg and rice set. It comes with prawn tom yam soup and a choice of drink. I usually have the Thai iced milk tea which is really good.The portions could be smaller than a la carte but I find it sufficient and filling. The basil chicken with fried egg is flavorful and spicy. The spice level is medium and you could ask for more or less spicy when placing your order. I finally found a use for the cucumber which does help to tone down the fiery heat on the tongue. The tom yam soup is creamy and also spicy with the tangy sweetness of the tamarind. They are generous with providing 3 prawns and some straw mushrooms in the soup. None of those watered down soup here. The Thai iced milk tea finished off the meal with a sweet aftertaste. Coffee and lemongrass are also part of the choice if I remember correctly. The other two options are:1. boat noodle (choice or pork or beef), pandan chicken, mango salad (I think, either that or papaya salad) and drink. 2. curry pork and some side dish and the drink. I cannot recall what is in the  set now.Lunch set is only available on Monday to Friday, excluding public holidays etc.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "AffcWKSS-9R_mPUhYxR07Q",
        "caption": "Photo of Nara Thai - Singapore, Singapore. New set lunch menu. Mix and match for more flexibility.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AffcWKSS-9R_mPUhYxR07Q/o.jpg"
      },
      {
        "img_id": "7UTw6gUO7xhkOxBJ6jsCZQ",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Coconut ice cream with house made red ruby. This is good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7UTw6gUO7xhkOxBJ6jsCZQ/o.jpg"
      },
      {
        "img_id": "FoJvD-yo-ndUZOrVQa2LiA",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Sesame chicken, lunch set with the boat noodles.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FoJvD-yo-ndUZOrVQa2LiA/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "HCDyrdkm-M4n9OcRQBEshQ": {
    "date": "11/22/2015",
    "text": "Tried this place with the Entertainer app. \"Nicer\" Thai restaurant with more refined food, but ultimately doesn't taste any better than Golden Mile. We ordered a basil pork with rice and a beef kuay Teow and a plate of veggies. Just basics to test the place out. Jasmine rice comes dyed blue, which is a nice visual touch but adds nothing otherwise. Basil pork was very spicy, to the extent it radiated through my head and numbed my mouth. Tasted nice enough.Disappointed that the fried egg was well-done as I always like a runny yolk with my Thai food. According to the waiter it's how the Chef always does it. Nonetheless, big minus for me...Kuay Teow was nice enough without being spectacular. Service was good and the waitresses were very pleasant in a \"Thai way\". Even with the entertainer, the few dishes came up to $42 which probably wasn't worth it. If you want good Thai food for half the price, go to Aroy Dee onMiddle Rd instead.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QgeKLzZJIW5KL-bRBLxFNQ",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Basil pork with blue jasmine rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QgeKLzZJIW5KL-bRBLxFNQ/o.jpg"
      }
    ],
    "user_id": "1cZkSCFPon7CiQTVkP7fuA"
  },
  "2IaQPThuXJlq_GQD2s-jZw": {
    "date": "8/23/2017",
    "text": "Thai cuisine is one of my favorite foods and I have tried most of the Thai restaurant in Singapore. This is one of the best Thai restaurants in Singapore. The food is super yummy, staffs are friendly and attentive and atmosphere of the restaurant is very good. We went there for family dinner with my wife, my mom-in-law, and brother-in-law. We ordered Papaya salad with shrimp, Clear seafood tom yum soup, mixed vegetables, shrimp cakes, tom yum fried rice and fried soft shell crab with garlic. Fried soft shell crab with garlic is super delicious and it is one of the must-try dishes. All the foods were served within a reasonable time. The price is at a bit high sided and the portion of foods is not very much. However, the quality of food is superb and they are absolutely delicious. I would definitely go there again and whoever love Thai food should try there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aHnaKCWFazTC5PbSt5uW4A"
  },
  "P312TdAkZ-hbh8xILAvObA": {
    "date": "7/26/2015",
    "text": "Spending around $15 to dine at a restaurant at ION Orchard seems to be a very very affordable- I know. During my visit I had Kao Kra Pao Nua ($14.90), which is a stir fried minced beef with chilli & hot basil served with blue jasmine rice. Overall dish was so bland... Just when I thought any dish couldn't be even more bland than mine, my partner's dish came it was so strikingly unbelievable I almost burst out laughing. He ordered Kao Phad Kung Fried rice with prawns $14.90 and seriously not just the taste was SO bland (wayyy bland than mine), it only came with 3 small prawns.. Service was bad. I guess that must be due to the fact that it was a full house when we came. It took quite sometime before someone took our order. It was amazing to witness the long queue every day at this place.. Even the food at Food Opera (the food court at B4) was much nicer... and way cheaper too!Price is subject to GST & Service charge. Water is not free. Will not come back again.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EGkun4jhBb4RF6i8EPm42w",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Kao phad khung $14.50 (fried rice with prawns).. only came with 3 pieces of small prawns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EGkun4jhBb4RF6i8EPm42w/o.jpg"
      },
      {
        "img_id": "bxb2btYSI3hXJehvEy4lJg",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Kao kra pao nua $14.50 - stir fried minced beef with chili and hot basil.  Such a disappointment",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bxb2btYSI3hXJehvEy4lJg/o.jpg"
      }
    ],
    "user_id": "kszt8vOPh4xos8OtOqmr5Q"
  },
  "bPp3xV9uEw0uRv2mVscTgg": {
    "date": "12/1/2016",
    "text": "Although the taste is good, the service is unexperienced and not well trained. This is very disappointing because the restaurant's decoration looks nice.The waiter seriously needs some training or a good management.Firstly, I've been here 3 times and they never give automatically the lunch set cards.  Secondly, we were 5 today and took lunch sets. The waiter puts every coming dishes at the empty place without announcing which set the dishes belong to. In such a well looking restaurant, you would expect better service.If you need to bring your clients or business partners in ION ORCHARD and don't want to have to criticise the staff during lunch time, this is not the place to go...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SO5B0U096RjupQIHOnzRXA"
  },
  "TJFrXqmhj7vxK4xTJqrUoA": {
    "date": "9/9/2016",
    "text": "I had lunch here on Tuesday. Was a bit skeptical at first because of the mixed reviews it got. Nevertheless, we decided to test it out.I was a bit frustrated at first because whenI raised my hand to order, the waiter saw me, nodded and walked away. Not just once. But 3 times. By that time, i was getting a tiny bit angry. Thank god, on my 4th try, they finally came. We ordered:1. Deep Fried Sea Bass2. Seasonal vegetables3. broccoli and mushroom4. Morning glory with chili5. Stir fried chicken with cashew nuts6. Omelet with crab meat7. Some kind of pork from the appetiser sectionSadly, we didn't order the Tom Yum Soup - don't know why but know i realise it was a pretty dumb move... ahahaThe food came out surprisingly fast and nearly everything arrived at the same time. We absolutely love the food here despite the mixed reviews we read. I think my favourite would have been the deep fried sea bass, broccoli and the morning glory. The pork had a bit too much fat on it. But other than that, my family and i really enjoyed our meal here.Our total bill came to $100 ++ which is usual for our family of 5. Although the customer service was a bit poor at first, i would definitely return. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kYplHDg9iYqLOU2-NLsNow"
  },
  "l84OXtQZPZw3DeAWBxP3hw": {
    "date": "2/8/2015",
    "text": "Disclaimer: I lived in Bangkok for 5 years until 2013 and I am a rather picky eater.The whole family was experiencing withdrawal symptoms over the weekend, so we decided to get takeout from Nara Thai. I am not a fan of Thai Express as they put MSG in almost every food item, so this was - I felt - the next best alternative. I ordered:1. Morning glory 2. Pad Thai3. Stir fried sliced beef4. Chicken satay5. Chicken wrapped in pandanus leafThis was for 3 of us, and it was enough for 4 (I had the leftover from dinner the next morning). The star was the Pad Thai - having attempted this dish several times at home, I know how challenging it is to get the spices just right. This tasted exactly how it would back in Thailand at the Erawan Team Room where I used to diner almost Every. Single. Day. (I kid you not - they still remember my name and order whenever I go). The morning glory and sliced beef had too much gravy for my liking. It could have been \"drier\" and would have enhanced the taste. It also was a little bit too spicy. Chicken wrapped in pandanus leaf was tender and the spices were delicious. My mother had two helpings - a rare sight. Chicken satay was a little too tense.. it tasted good, but I assume that it was on the grill for perhaps a few minutes too long. I do recommend this place, though.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gDmLSG8gahMJXl90pN9-RA",
        "caption": "Photo of Nara Thai - Singapore, Singapore. We got it as take-out, and this is what the spread looked like at home on the dinner table.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gDmLSG8gahMJXl90pN9-RA/o.jpg"
      }
    ],
    "user_id": "vOlPtKtcYDKopg9esopUCw"
  },
  "ZsvooDBfRQ50pSXTxjQ34A": {
    "date": "12/10/2014",
    "text": "I came for lunch on a weekday.I had Set C - $13.90++ for Ayutthaya Boat Noodles, with Fried Sesame Chicken. I also added on Pandan Chicken, Thai Fish Cakes and Coconut Ice Cream with Red Rubies, as well as an Anchan Cooler.The Anchan Cooler is a premium drink - at $2.90 it, together with the Roselle (Hibiscus) Cooler, is more expensive than the Lemongrass or Pandan Coolers. The taste is not for everyone - it had a vaguely plum-y taste, with a sour note.The Fried Sesame Chicken came in the shape of 3 rather small pieces, which seemed to be mid-wing joints. The pieces were slightly dry, but that's not unusual for this kind of fried chicken and the dish was a decent appetiser.The Pandan Chicken unfortunately hardly tasted of Pandan, was a little dry and the two pieces we got were quite small too (relatively small servings seem to be a hallmark of this place - or at least its weekday lunch sets). Given that many other places (even much cheaper ones) can do decent Pandan Chicken, this is quite surprising (and even unforgivable for such an upscale joint).The fish cakes were pretty good - moist and flavourful.Happily the main event - the Ayutthaya Boat Noodles - was really good. The soup was full of flavour (it didn't seem to just be the MSG) and the pork balls were quite bouncy, tasty and juicy. And everything was topped with crispy fried bits, which added a contrasting texture to the dish (and even more taste to the stock). The slices of pork were a little too tough though. The soup was so good that I slurped it all up - even though I normally don't finish spicy soups.I ended off with Coconut Ice Cream. Virtually all Thai Coconut Ice Cream I've had is bursting with flavour, and this didn't disappoint. It was a little too melted when I got it, so ideally they'd store it at a lower temperature so it reaches the customer still-frozen, but that's a minor point. What made this version stand out was the Red Rubies - they tasted fresher than other Red Rubies I've had, and had a particular note to them (possibly more water chestnut).While I'm giving it 4 stars, an important caveat is that this was for the lunch set price. I had a look at the a la carte menu and it made my eyes open wide. If the quality of those dishes is similar, I would take this down a star to reflect the relatively poor value (you're better off going to other Thai places to get bang for your buck).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fBL9s_Cym7VJ3AY7Ioeaqw"
  },
  "4PVyG3DEIRwZN7p1LNBLHA": {
    "date": "9/15/2013",
    "text": "Thai food that seriously stands out. Originally hailing from Bangkok, Nara Thai has recently opened a branch here in Singapore. My husband and I love Thai food and the only other authentic place we've been able to find in Singapore has been Folks Collective. So we were ecstatic to try out Nara as well. We started off with the salmon tartar salad with Thai herbs, which was extremely flavorful and paired well with the crunchy veggies they give you on the side. Pomelo salad was good, but a bit on the sweet side.  We also tried the butterfly pea juice, which was tangy and nice..tasted similar to roselle juice to me.  For our main we ordered the stir-fried soft shell crab with yellow curry. This dish knocked our socks off! It was very rich and indulgent, maybe a little too sinfully delicious :) We paired this with the thai herbs fried rice.  The rice was really good but a bit steep at $10 for just one scoop. Next time I might just get the jasmine rice ($2.50), although we really wish they offered red or brown rice like most of the places in Bangkok seem to do for a more healthy alternative. Also, thumbs up for friendly and smooth service, even on opening weekend :)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qy_RZ6AAXv6-rmNc4pKSzQ",
        "caption": "Photo of Nara Thai - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qy_RZ6AAXv6-rmNc4pKSzQ/o.jpg"
      },
      {
        "img_id": "DfLza9TVaxsAzL32DIJ0yw",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Pomelo salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DfLza9TVaxsAzL32DIJ0yw/o.jpg"
      },
      {
        "img_id": "EPrv6gc4RXN09cY0VcEIPw",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Thai herbs fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EPrv6gc4RXN09cY0VcEIPw/o.jpg"
      }
    ],
    "user_id": "velzbr5_h-6xhr-o4mn4sQ"
  },
  "qeMtoS-ifPXJXbkNylarRw": {
    "date": "4/19/2014",
    "text": "Overall, the food is pretty ok. Not sure if it's really the best Thai restaurant in Bangkok. The tom yum kung and sea bass dishes are a bit too salty.Pad thai is nice. The chicken breast pieces are tasteless though.Service is fast. The plate given to me is not clean. Dried pieces of food is still firmly stuck on it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iyQwf5xpU6Qe9YdjThHtAA",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Sea bass",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iyQwf5xpU6Qe9YdjThHtAA/o.jpg"
      },
      {
        "img_id": "M9BLabd0stnVXq_zryvoPg",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Pad Thai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M9BLabd0stnVXq_zryvoPg/o.jpg"
      },
      {
        "img_id": "DpiN30B9up-PTdjSUnO2EA",
        "caption": "Photo of Nara Thai - Singapore, Singapore. Tom yum kung",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DpiN30B9up-PTdjSUnO2EA/o.jpg"
      }
    ],
    "user_id": "wH-yhddRO8Uc2e4kjwf1RA"
  },
  "ZBLx4Mb8g6DJAkcAdQ-a1w": {
    "date": "10/5/2015",
    "text": "For what it's worth, I wouldn't consider myself to be a Thai connoisseur by any means, but I do believe I know good food and good service. The food here is pretty good. The sautéed morning glory is really delicious and flavorful, the chicken basil rice set is decent (aside from the rice being blue for no reason) .. It's a pretty legit place. My only little gripe about this place is that they took forever to bring out the water .... It's water. It's not like they have to make it.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "6kEfVfKfJQo38jFqVfk9CA"
  },
  "zt_s9B1xC6cx5VFPf-bO9g": {
    "date": "7/10/2016",
    "text": "Accidentally bumped into Nara Thai for a quick lunch but such a waste of my time , food here lousy and nothing taste like Thai cuisine at all . Absolutely disappointed with Green chicken curry , Tum Yum kung and Mango sticky rice :((",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJfyx-0sqv7g5ZKC5SQMTg"
  },
  "Xi0VaglwI7SoZQW-_hy7ag": {
    "date": "4/3/2016",
    "text": "I eat here every time I come to Singapore and stay locally. Food is above average and service is excellent. It is always a good meal",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FgwTLP2uoa8bIYgl1kymwQ"
  },
  "T9vY38jc-l7B9JNs1X4KUQ": {
    "date": "11/9/2013",
    "text": "Nara Thai supposed to be the best Thai restaurant in Thailand but I beg to defer. I was there last week and the food was rather....disappointing. Don't get me wrong, the food wasn't bad but it just doesn't live up to my expectation as THE best Thai food from Bangkok.As a starter, we ordered the Assorted Nara Hors d'oeuvre and the Rice Crackers with Pork&Prawns Coconut Dip. Out of the 3 items from the assorted platter, I only liked the fish cakes. The rice cracker was interesting, but not fantastic.For mains, we had the Stir-fried Soft Shell Crab in Yellow Curry, Tom Yum Kung, Stir-fry Kale in Oyster Sauce, Basil Minced Pork, Phad Thai, Pineapple Fried Rice and Braised Noodle in Oyster Sauce.The supposedly signature Soft Shell Crab in Yellow Curry was forgettable. The crab was tiny and not crispy, while the sauce was too thick. My friends joked that the curry tasted like the Twisties curry seasoning.Do not every order the Braised Noodle! It was deep-fried hor fun with oyster sauce. The hor fun was fried till crispy and the sauce was tasteless. The only saving grace was the Tom Yum Kung. It was a pretty big serving with big prawns. The soup was the right level of sour+spicy-ness.I don't think I will come back again. If you happen to be in Orchard and looking for good Thai Food, my suggestion would be walk further down to Orchard Tower. There are many small stores serving authentic Thai food there.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ms9qgxOyQ8ul_WVJk4_Z3Q"
  },
  "Qxb4eM1OZGYDYDikY9asDg": {
    "date": "6/27/2015",
    "text": "I would say the food is good but not the service and cleanliness, lipstick stain on the glasses, leftover rice on the bowls, why? The restaurant is too dark. Its not even fine dining or anything, its just dark and too many dark color in it. Add a higher watt of yhe light, trust me your place will get more crowded a little.waitress face not interested no idea they are sleepy because its dark or simply they are just unhappy.I like their curry crab. It will be better if they can make big fresher crab than soft shell battered crab. Tom yum is good. Som tum portion is too small. Vegetable dish is all sweet and boring there.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k3qoYekjAhO1UpwRdgzdYg"
  }
}