{
  "IWpKD83m5qbELDORzToljw": {
    "date": "3/17/2015",
    "text": "The food was great and the manager was very friendly and helpful. We had the cheapest marinated beef and I was glad we got that instead of the more expensive ones because it was very good. The Kimchi soup is also great. I think it is pork inside which makes it more flavorful than usual.My Korean fiance eats here for lunch several times per week.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "YrSXP6igPN1RrK-CVj0w5g": {
    "date": "10/3/2014",
    "text": "One of the best Korean meals I had in Singapore. We booked in advance and got a private room, this is one of the few places I ate Korean BBQ without having the BBQ smell after the meal.The Kimchi fried rice was savory and was packed with ingredients. The portion was huge and we couldn't finish it, as we over ordered. We ordered the Ginseng Chicken soup and it was fantastic, one of the best I have tasted.The main highlight was the BBQ, the meat was fresh and well marinated. Will definitely be back to try their other dishes.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "vB4dzG6igiyO7ks4el2oqA",
        "caption": "Photo of Hyangtogol Korean - Singapore, Singapore. Rich and nutritious Ginseng Chicken soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vB4dzG6igiyO7ks4el2oqA/o.jpg"
      },
      {
        "img_id": "aIX8LKcK5sx6Vt8ep4U0Lg",
        "caption": "Photo of Hyangtogol Korean - Singapore, Singapore. Awesome fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aIX8LKcK5sx6Vt8ep4U0Lg/o.jpg"
      },
      {
        "img_id": "YLiVX7TJtKqewhqcaM1Zsw",
        "caption": "Photo of Hyangtogol Korean - Singapore, Singapore. Marinated Beef Short Ribs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YLiVX7TJtKqewhqcaM1Zsw/o.jpg"
      }
    ],
    "user_id": "mMjxhRn4h0LD1_jI3RT4cQ"
  },
  "aNkyZaiCT1a6O2U7_HyFSQ": {
    "date": "3/6/2016",
    "text": "Family dinner - the restaurant seems to have taken a bad drop in food quality and service standards... The marinated Meat was tasteless but worst part of the experience was there was very little service attention. When the servers wce around, they were rushing around and not paying attention to details... Definitely not coming back",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qTxeuTTvkyg2n0OXKCqYbQ"
  },
  "iVvX306gAomOj7pr50UQDg": {
    "date": "12/13/2016",
    "text": "Best Korean I've had since leaving NYC and DC two cities with great Korean restaurants. As a Korean American on long term travel, I am constantly looking for good Korean food and often disappointed. My yukgae jang and haemul pajeon were excellent and banchan best I've had in a long time. Will go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KfahSmdgc4ms1dDc9iXWvg"
  },
  "gWziEzjcI32wKoxwhGSyxg": {
    "date": "8/14/2012",
    "text": "Located at the second floor of Amara Hotel, this Korean joint is one of the pricier places where corporate drones opt for during special occasions like Christmas or birthday parties. Do come dressed in a smart casual attire to avoid feeling too out of place, especially on weekend nights. They serve one of the best beef bbq I have tried, and the best part is there isn't any chance you will mess up any great quality meat with our own less than satisfactory bbq-ing skills, as the staff will do the cooking right in front of you - something like Teppenyaki style but more casual! Their meats are soft and tender but with just the right amount of crispiness on the outside, and is skillfully cut by their waitressing staff from the bone into small manageable pieces. They also portion it out equally amongst those seated at the table, so no ugly squabbles over the last piece! If you're feeling a tad adventurous, you can try ordering a plate of their beef innards, which are various segments of cow intestines. These are slightly more pungent and chewy and takes some getting used to the taste, but is definitely one of the must try items on their specialty list! To end it off, they serve a sweetened persimmon drink to help cool down the body and soothe the throat after a heaty bbq - really great service with attention to detail.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ByFfTb6t_Q2CkblkV6Xjlg",
        "caption": "Photo of Hyangtogol Korean - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ByFfTb6t_Q2CkblkV6Xjlg/o.jpg"
      },
      {
        "img_id": "caA5gnvrhFZxjAxV_QM-6w",
        "caption": "Photo of Hyangtogol Korean - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/caA5gnvrhFZxjAxV_QM-6w/o.jpg"
      },
      {
        "img_id": "hSWxJCqDUq8stRBK6XPleA",
        "caption": "Photo of Hyangtogol Korean - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hSWxJCqDUq8stRBK6XPleA/o.jpg"
      }
    ],
    "user_id": "05tSDymzhXyvaxO1G24d0g"
  },
  "fYWDvGtz0x-5FlFlA91jvw": {
    "date": "2/11/2013",
    "text": "The highlight of this restaurant is that it is a great Korean BBQ place where you can emerge after the meal and still smell reasonably fine (no BBQ smells in your hair and clothes, yay!).The BBQ meats here are of good quality. And their kimchi soup and banchan are also very yummy.A possible downside would have to be the slightly higher price. But on one of the occasions, my friend who had the korean tourism card scored us a great discount=) So if you have one of those, then you should look out for the next promotion period. But even without the discount, Hyangtogol is still one of the better Korean restaurants in Singapore. A must try for all Korean food fans based here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oUZ3fmICiFLVrUBl0lDx4g"
  },
  "cokTwSKuoHTHc5uAiDy2HQ": {
    "date": "9/21/2012",
    "text": "This is one of my favorite places when I don't want the long queue and I just want some peace and quiet meal time. You shouldn't take a date here since you might get slapped (it's at Amara Hotel so she might get a wrong idea but then again, you might want to. Wink wink).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpnPcoRGXy5N4mbkqMAjvA"
  },
  "-lJPhE0ddGiDVRo3m8QxoA": {
    "date": "7/28/2012",
    "text": "Authentic and reasonable Korean food. How do you know? There are Koreans! Restaurant's private rooms are perfect for group dinners and family birthdays. The sides can feed an army. Ventilation is good- you don't smell like BBQ!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D1QrGYT6Mo8OdwzjO9oQ2w"
  }
}