{
  "quLGiemdmkq8kgoLjXIB1A": {
    "date": "12/26/2016",
    "text": "Both the Hazelnut Sticky Bones and the Cranberry Sticky Bones $29.90++ (Half Slab) / $45.90++ (Full Slab) were extremely delicious. If you've tasted their normal sticky bones before. Think of these as sticky bones with a hint of sweetness over the thick slab of meat. A perfect fusion of Christmas flavours on ribs indeed. I would say, I couldn't distinctively taste the hazelnut or the cranberry but they both added a sweet pleasant flavour that were done to perfection on the ribs.Crackling Pork Roast $38.90+ 1kg Pork Belly roasted & braised to deliver tender & juicy meat paired with crispy crackling skin. You can't get enough of it.I love Pork Bellies especially the ones with the least fats and with crispy skin! The pork belly was delightfully tasty with a rich and lean texture and a light sweetness. The meat was mostly tender but there was a bit of chewiness here and there where it might have dried out a little from sitting.Roast Chicken $32.90+ Juicy & plump chicken, stuffed with Rosemary, onions, celery & carrots, Served with Roasted Potatoes. (1.4kg)I didn't quite expect such a good tasting roasted chicken at Morganfield's as they are more famous for their ribs. But the chicken was so tender, it was extremely easy to eat the chicken. The meat was umami and the skin of the roasted chicken was a tad crispy!If you don't want to share the love with your friends and family. Check out Morganfield's Weekend Ribs Buffet with Free flow Sticky Bones, sides and soups, take this chance to try out all the different sauces, sides and soups. Only at $40++. Available from 11am to 4pm on weekends and public holidays. The weekends can't get any better than that.Overall : Morganfield's provides a great location for any christmas gathering, to bond over good meaty food and drinks. Definitely try their ribs in any sauce! Not to mention kids dine for free on Saturdays, Sundays and Public Holidays, for each kid below 8 years or 120cm in height with every adult's main meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WEYjiPQVA7WEAFEDcRy3fg",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WEYjiPQVA7WEAFEDcRy3fg/o.jpg"
      },
      {
        "img_id": "IGXG0-dxZZBxq5LYM7hDqA",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IGXG0-dxZZBxq5LYM7hDqA/o.jpg"
      },
      {
        "img_id": "9Jbd37M3XQjsPIEVZS3IUQ",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9Jbd37M3XQjsPIEVZS3IUQ/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "jTQdQcHdOkf8S6m2LmvNEg": {
    "date": "6/21/2016",
    "text": "Not Quite the Field of Dreams I Was Hoping For. Being the foodie nation that we are, we've had a slew of foreign restaurants open their doors on our tiny island over the years. Steakhouses like Outback, rotisseries like Kenny Rogers and of course restaurants specializing in good ol' BBQ ribs. For years, Tony Romas have been spear heading the rib-olution in Singapore and for years they have been doing a great job. But like all great restaurants, the key to longevity is fighting off the competition. From Smokey's to Jerry's and now, Morganfield's. Though it's opened its doors for a few years now, I haven't had the chance to try it till now and I have to say.... Sadly... That their sides are better than the ribs. Since it was Father's Day, we decided to go with the Ocean Feast ($119.90) with a couple of additional sides. Beer Battered Fish Fillets. Crispy better but they used either dory or sutchi (Although I have the feeling it's the latter), which I'm not a big fan of. It's not the tastiest fish in terms of texture or flavour. Tequila Grilled prawns were nice. Sweet, well seasoned and juicy. Of course like all prawns, don't let them then cold if not they'd turn semi-bullet on you. Grilled Sausages were fairly normal and you could get similar ones at a supermarket.Grilled corn on a cobs were nice. Sweet, well grilled. Corn bread. The star of the platter. The corn bread was sweet and very moist. Definitely a million times better than what you get at Kenny Rogers. Hickory BBQ RibsWhile the sauce was pretty good, and the meat does fall off the bone, it did feel a bit overly cooked. The area with ample fat was good while the rest felt a bit dry. Chilli Con carne (side dish) Hmmm... A little disappointed with the Chili. While it was tasty, it felt more Bolognese sauce than Con Carne with the distinctive lack of beans. Coleslaw Pretty good coleslaw and a good dish to break the meatiness of the platter. Pilaf Rice If you're a fan of Aston's tasty rice, you will LOVE the pilaf rice here. It was moist and very very good. While the food quality was average, we were pretty disappointed with the service. Forgotten drinks, sides coming a good 15 mins before the main platter and the platter itself took nearly 45 mins to arrive, it certainly wasn't a good first impression. On a whole, with a little bit of tweaking, Morganfield's could very well be the best BBQ / Sticky Ribs in Singapore but till then.....",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FrWXC2FPA3mB3saCPtekng",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FrWXC2FPA3mB3saCPtekng/o.jpg"
      },
      {
        "img_id": "Oj50umVcPOwxs1agWdeYdQ",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Oj50umVcPOwxs1agWdeYdQ/o.jpg"
      },
      {
        "img_id": "lWA5ovVMxVlmrVaekjp8vw",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lWA5ovVMxVlmrVaekjp8vw/o.jpg"
      }
    ],
    "user_id": "oGtf2Wbi2Wq6TTJecDZFMQ"
  },
  "2ZxYcXcjd_eug8eQxoUJFA": {
    "date": "6/20/2016",
    "text": "Was quite torn between a 3 or a 4. Decided to give 4 to help them bring up their average to 3.5, which is where they really are. The food is decent, I did enjoy the hickory bbq ribs, and their corn bread is good, an American couldn't make it any better. Servings are generous, especially if you order the family platters. And there's happy hour too. Wait, did I fail to mention that kids under 8 eat free on weekends? So they are doing quite a few things right. And budget wise, for my group of 3 adults and 4 kids, with drinks, it didn't blow a massive hole in my pocket. Worked out to less than $20 per head. It's not all bad. Which is really a shame. If they were just to improve on their service a tad, they could really jump up a few notches, and Yelpers wouldn't have to wonder whether to give them a 3 or a generous 4, but instead just brandish a 5 or a stingy 4! So Morganfield's, it's really up to you now. Give us something great, you're not far off.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8wdJwRwFVJHeQTlc1QKLow",
        "caption": "Photo of Morganfield's - Singapore, Singapore. Look for this sign!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8wdJwRwFVJHeQTlc1QKLow/o.jpg"
      }
    ],
    "user_id": "3KYixk4HwDBFFBwws__tkw"
  },
  "JmD9mqCP3WkZL6-XYnwk2Q": {
    "date": "7/14/2017",
    "text": "Overpriced. Expected better craft beer selection.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owI_FQdAKZQFY8UnkQoD8g"
  },
  "0AfF7qzxGUAmhOtdfKurwQ": {
    "date": "3/21/2015",
    "text": "This review is 3 stars, but it is possible you will get very pissed off with their sometimes spotty service.I've eaten here a couple times for lunch, and sometimes they have a mailer that my colleague gets, for one-for-one rack of ribs. You ought to find out how to get that mailer, because it is quite value-for-money. Otherwise, it seems a little, little pricey for what you get.Service here is generally okay, but I've waited years for some water before, yet other times, they offer me extra sauce for my ribs without me asking. I came here around Xmas season once, and they had the best cranberry ribs ever. Sadly, this flavor is seasonal, so wait out. Last time I came, I had the Hickory and Tuscan ribs. Hickory, is well, hickory. Tuscan ribs felt like eating pasta sauce on top of meat, which wasn't entirely bad, but maybe a double Hickory would have been better.I like their sides - red skinned potato mash, cornbread, fries, garden veggies... Yum!",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "aSxgIPfZ0JXxFOXn7Qdalw": {
    "date": "8/30/2015",
    "text": "Food expensive for the portions. View is pretty nice but paying 21 dollars for a burger that takes almost 45 minutes to arrive is quite ridiculous.  Side order of fries took a while too.At 10 pm it was starting to get empty and staff were cleaning as some of us were still there which was quite rude. Getting their attention for the bill took a while and was irritating.The burger was succulent and juicy and I have no complaints but the size was ridiculous.  Won't be going back there.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TnAi9Wt4nyiDJj2xtzNjtg",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TnAi9Wt4nyiDJj2xtzNjtg/o.jpg"
      }
    ],
    "user_id": "gxuJBymMbg82cM_3M6J-vQ"
  },
  "ahKffGEcYyRuZhXdu0ioXA": {
    "date": "12/1/2014",
    "text": "This is not your Man vs Food show. It's the Morgansfield's Christmas Platter ($149.90++) that contains more than enough meat to probably last an individual till the next Christmas. But the good thing is that you don't have to beat the clock to finish this; neither do you have to embark on a solo meat conquest as this can be shared theoretically with 4-5 pax, or realistically speaking, even 6 or more. Sourced from Spain, Morganfield's showpiece sticky bones have been updated with a seasonal festive touch by tempering it with some American Rogue Hazelnut Nectar. The result is a rich, shiny, dark brown caramelized glaze and the meat underneath has a lovely smoky quality. The best part is the slighty charred crust that has such a smooth malty taste that keeps me nibbling on the crispy edges.Bathed in a reddish hue, the Cranberry Sticky Bones didn't taste as fruity as expected but the bits of cranberry sweetened the deal. The meat turned out to be more moist than the Hazelnut beer, with bits of fat tucked incongruently between layers.I sometimes wonder why restaurants like to serve turkey and not the turkey drumsticks? These two massive Smoked Turkey legs, like a miniature monolith on the plate, has a great chewy texture that makes you want to gnaw all the way down, leaving the bone bare. But I was particularly drawn to the Ham as the mildly sweet juicy honey glaze makes the meat even more appealing to the tastebuds. There was plenty more to discover on the plate with four beautiful bouncy sausages that reclined lazily on each other. Spicy Italian, Cheese, German Pork, each has a character on its own but the Cheese sausage grabbed the attention with delectably gooey cheese spurting out at the instant cut of the knife. Non-carnivores need not avert your eyes from the plate as there are plenty of greens to balance the plate; soft caramelized onions, steamed carrots, long beans, roasted potato. The Signature cornbread, a crumbly sweet corn muffin with crusty top, fully qualifies as a delicious pre-dessert snack or maybe even as a dessert for some. Christmas or not, there is always good reason to come for Morganfield's honest-to-goodness sticky bones because the quality still stays consistent as my previous visit. And, my nostrils confirmed this as soon as the meat platter made its entrance on the table, it's great.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wOHXiqnoYmUS6klJYS0Vnw",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wOHXiqnoYmUS6klJYS0Vnw/o.jpg"
      },
      {
        "img_id": "P86ToNUlPLA6RkSr1oaC2g",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P86ToNUlPLA6RkSr1oaC2g/o.jpg"
      },
      {
        "img_id": "pKPd0Y6SB4yKFq9bV1FODA",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pKPd0Y6SB4yKFq9bV1FODA/o.jpg"
      }
    ],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "I8QXpNbUj1adILh-PfK1Yg": {
    "date": "9/28/2014",
    "text": "Oddly empty on a Sunday lunch, I thought it would be flooded due to crowd from the post-service upstairs. Only half the restaurant was filled, so pleasantly delighted that we could be seated as soon as we arrived.The ribs had been highly recommended by a few of my friends and wanted to see what the fuss is all about. Ordered the Garlic BBQ spare ribs (about SGD$24 for half slab. Full slab will be around SGD$40) - comes with sides of fries and coleslaw. The meat is really tender! Wanted to share but everytime I dig into it with my fork, only a small piece get removed - PERFECT, get the whole thing to myself heehee. Nicely charred on the top, sides and LOVE the cartilage. Chunks of it were still attached to the ribs, most restaurants will just serve the meat but this is THE GOLD. It would have been flawless if not for the copious amount of sauce slathered on the ribs - it felt like i was drinking an extremely tangy soup at times. A thin layer and additional sauce on the side would be a better presentation option imo.Also had a serving of Garden Salad - meh. Corn - meh-ish, Cornbread - not bad, crust could have been crunchier.4* for the Ribs2.5* for the rest.Not really a fan, based on Yelp's 4* description more towards A-OK at 3*.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "C9Z7dTBkR9ROwfpR0Ad9gA",
        "caption": "Photo of Morganfield's - Singapore, Singapore. Garlic BBQ spare ribs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C9Z7dTBkR9ROwfpR0Ad9gA/o.jpg"
      },
      {
        "img_id": "2PhG694VRtdfHjYRoo7aKQ",
        "caption": "Photo of Morganfield's - Singapore, Singapore. Garden salad and corn bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2PhG694VRtdfHjYRoo7aKQ/o.jpg"
      },
      {
        "img_id": "KSbRK_QD8llk-0II_HrbpA",
        "caption": "Photo of Morganfield's - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KSbRK_QD8llk-0II_HrbpA/o.jpg"
      }
    ],
    "user_id": "dWSV7poBgsV5zvOYt5-NPA"
  },
  "eBTNbdrbZEUfEtw134C-bg": {
    "date": "2/7/2013",
    "text": "I shared the $34 rib + chicken combo with a friend. There was a LOT of food.Delicious ribs! fall off the bone tender, four giant pieces. could've done with more sauce, actually. Their tequila spiked chicken was also not bad, glad we got to try some other meat (besides ribs).Our choice of sides: Pilaf rice was good! Yum :) Steamed veges were normal, nice variety of zucchini, broccoli, sugar peas, cauliflowers, carrot slices.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fd3-ypX1v6IEMOAZqqWlSw",
        "caption": "Photo of Morganfield's - Singapore, Singapore. Hickory smoked ribs! Tequila chicken, pilaf rice and steamed veges. mm :) $34++!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fd3-ypX1v6IEMOAZqqWlSw/o.jpg"
      }
    ],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "kOe0XI51h2HPgK9tNZGG5A": {
    "date": "5/9/2013",
    "text": "3.5 stars for Morganfield's. The food is quite good for the price you are paying. The rib eye steak was kind of fabulous. And that is probably THE thing that will get me to return. Having said that, the noisy environment and the slow service makes me quite apprehensive to consider a return visit. A note to the management. This place is understaffed. The service staff were largely polite and friendly but they were so hard to catch. And our food took more than 30 minutes to arrive. Which is not exactly acceptable. However, the manager was rather apologetic after we made the delay known to him and made amends by offering us a free dessert. And the lava cake was actually quite yummy so appeased I am.The acoustics of this restaurant is kind of shite. The noise level was terrible. It was understandably crowded but the noise pollution was rather unbearable. Not a place for decent conversation. Just come here for the steak.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUZ3fmICiFLVrUBl0lDx4g"
  },
  "RtHsDSuRB-rU1kfkWpKoJQ": {
    "date": "7/8/2013",
    "text": "Was here for a company luncheon, with a table for 12. The servers are nice people, ensuring you are comfortable and explaining to you the menu where needed. Food was a-ok. Their signature dishes might have better luck.I had the Silrion Steak, medium rare, value lunch set meal. The spicy gumbo soup was an instant hit, though it seemed to have taken some local flavors in the process. The main dish itself was a little but of a let down. The steak was cooked to medium rare as requested, but it seemed to have been charbroiled instead of been properly grilled. Which is rather weird for a restaurant of this establishment. Overall atmosphere was fine, not too noisy, though the mounted small TV screens showing Popeyes might not be the right choice for the crowd that comes to eat here. Might come back for a second try. Their ribs and fish&chips look a lot better than their steak and pork chops. Might have a second go before deciding whether to add this place to my fave lists.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fNIL-9w_BzsIDysV42rvPg"
  },
  "x63-LPVqTltopxzCu0n_mA": {
    "date": "2/21/2015",
    "text": "Ok.  So I thought I finally found a BBQ joint worth checking out.  Was certainly not going to do the usual Tony or Outback.  Well.....on second thought...maybe should have.  Portion size is good but really can't call it BBQ without the smoky flavor!!!!!  Tastes like steamed ribs with some oven time.  Lol.  On to the next....",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gthQ44T-R1vi-p4fBuQQAQ"
  },
  "qO3S59BQhKYk8jaFU1jSLg": {
    "date": "5/29/2013",
    "text": "decent american food in the huge rock that is the star vista mall. if you're looking for a place this weekend to meet up with the large family and consume a large amount of food, this could very well be it. reasonably priced, large portions and decent cooking, this made for an enjoyable mother's day dinner - I know, I know, it's the end of the month now - and its way on our list of family-congregation-venues.it's a large restaurant with outdoor seating and a surprisinly spacious interior. it was very cosy - good for conversation but with enough visual distraction in case you've got one of those awkward families (I don't, thankfully). their specialties here are platters and ribs - both of which were adequately tasty to deserve that denotation. the ocean platter a large array of item: battered fish, a rack of ribs, grilled prawns, corn-on-the-cob and -in-the-cornbread-muffins, a couple of sausages and a pile of fries. every component was tasty and went down easily. my granddad's portion of fish and chips were rather fantastic - even better than the fillets on the platter. thick fillets of firm white fish encased in a crisp batter. the seafood basket I thought a little less impressive - still a competent rendition though.our tequila spiked chicken was very good too - tender and moist - especially the breast, and with a well-seasoned skin that the partner was happy to finish.we were told at the end - when we were stuffed beyond ourselves and had requested mercy in the form of a doggy bag - that our set came with a lava cake. piping hot - with no evil microwaving so oft inflicted on innocent, unknowing cakes - and paired with a scoop of vanilla ice cream, it was so good we found anatomical capacity we never thought we had. it may not have been the best, nor the highest standard - but it was deep, dark and not-too-sweet.and so perhaps this is the holy grail of family restaurants. a large menu to satisfy everybody, with competent cooking that's well able to deal with providing quite these many choices, and food that came hot, fast and very commendable - the staff were friendly, our large order taken accurately; it's going on a list of reliables.p.s. I've just checked the menu online, and prices seem to have risen slightly since we were there - bringing it from reasonably-priced to just-within-what-you'd-be-willing-to-pay. still a good option for family dinners though!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "znaofcTB6CKmdUqJSd17iA"
  },
  "xIHdfjEqtmPUZwL3S285Gw": {
    "date": "2/13/2014",
    "text": "Can't recommend. Misleadingly advertised set lunch prices, absent service, slow service. High prices.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5lEhYKYMEuTAH6CZGUcpaQ"
  }
}