{
  "4oafZvrUKDJbeSpOSZAPGw": {
    "date": "7/15/2012",
    "text": "Where else can you watch ponies trot by as you enjoy brunch? In a lovely little cottage-like house with wooden beams and everything else that makes it feel like a modern ranch, Riders cafe is as laid back as brunching can get. If you take a sanity leave day from work, this is where you should come to get away from it all. Eggs benedict, smoked salmon and pancakes next to horses, the world might be alright again.It's a little out of the way, best if you drive, or else it might be a pain getting in and home.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dawy6OzNphOfecDP4De8g"
  },
  "pFbvlokUkMmgI4IUTht9yQ": {
    "date": "8/24/2012",
    "text": "A non-airconditioned place which is great for brunch. Do get there by car/taxi though, as it is relatively unaccessible otherwise. I love the lush greenery this place is set in, and how it is housed near horse stables. The eggs benedict here with salmon is pretty good -  the portions were not that generous but sufficient. Do remember to make reservations if you want your date to be impressed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w6VRer-yn8wOHPtlMp7O-w",
        "caption": "Photo of Riders Cafe - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w6VRer-yn8wOHPtlMp7O-w/o.jpg"
      }
    ],
    "user_id": "5EWSLyXrh4WWpAL1ghrgng"
  },
  "G00OIwg1vAyEEv2o52CTNQ": {
    "date": "8/12/2012",
    "text": "One of my favorite brunch places because of the excellent food and view they have, I am quite sad to find that more and more people know about this place. That's because then it gets really crowded and the quality of the food/service might be affected as well. However, barring that, yes I would recommend this place since I last had it because their brunch was really delicious. It was wholesome, yummy eggs and sausages with the usual other sides. An iced coffee while watching some horses gallop by is nice as well.Prices were also reasonable if I don't recall wrongly.Getting there however will require a car. Otherwise it is too much of a hassle to travel in and out of the place. Reservations are definitely required because it is super popular with the expats and locals alike.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nWcII-Fqn5Hagfib-H76w"
  },
  "iuLD6OFeW2SqNxMeEW5YoQ": {
    "date": "8/11/2012",
    "text": "Excluded location tucked away in Fairway Drive near the Singapore Turf Club. Rocked up on a Saturday for brunch one weekend. I didn't have a booking, and Im not too sure if they take brunch bookings, though had to wait for a wee bit to get a table on the verandah. No air con in this place, though they have done well to make sure it quite comfortable and airy. Straight forward comforting food here, think shepherd's pie, beef burger, eggs ben etc etc. Well priced items, freshly squeezed orange juice always wins extra brownie points in my books. Had the shepherd's pie which was ok, would of gone down better if it was perhaps made in the classical way with mince lamb as opposed to braising diced lamb.  Service, at least the young girl who served or table had to be one of the cheeriest I've had in Singapore.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZqj0zcaOXV63mVVVLAhhQ"
  },
  "QKlGNGU3ixzqkgt9x55eQw": {
    "date": "10/8/2014",
    "text": "Reservation is essential for brunch, especially on weekends, if you do not want to be turned away in disappointment. Nice ambiance for couples and families for a morning of chill and relax. Travelling in is a problem, though. Would be great if you have your own transportation.Food is very good for such a hipster location. Really loved their french toasts and big breakfast, quality of food matches up to its aesthetics. Dinner crowd is significantly smaller than its brunch's, superb for couples who value some quiet time.Outside of norm must trys: french toast with caramelised banana and bacon (brunch), and seafood risotto (dinner).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9ih3knffJlAgC2OBI4zNbw",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. French toasts with caramalised bananas and bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9ih3knffJlAgC2OBI4zNbw/o.jpg"
      },
      {
        "img_id": "ICV705HyvOROcqBGiCPjwQ",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Add on side of sunny side up",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ICV705HyvOROcqBGiCPjwQ/o.jpg"
      }
    ],
    "user_id": "sKiTgxREch5YObeR0rcwxg"
  },
  "MGkm3AmaIH5kMmhN0GM-Zg": {
    "date": "8/26/2017",
    "text": "Pan fried snapper ($26++ = $31) - 3 starsSmall portion, and the \"creamed kale\" turned out to be one kale leaf... when I asked they said the \"kale is in the sauce.\" Snapper was cooked excellently but then ended up being too salty at the end.Service was also really slow, it took our food a good 20-30 min to arrive. We sat by the window and be aware it smells like manure. However it was a cool night and overall very pleasant and the waiters and waitresses were very accommodating and friendly!We paid $15 each using the Entertainer app so I can't complain.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "p3YaTqeY_ARd0dJYti3JNg": {
    "date": "9/2/2017",
    "text": "Good food. Nice ambience. The service staff are efficient, informative and accommodating. The food is a decent standard - value for money. Hope they will have more variety in the choices of food available for after Brunch Hours. Place is ideal for a private event.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3Qudeppg5jCm2rm4VBRWww",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. 'The Usual' breakfast (Brunch menu)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3Qudeppg5jCm2rm4VBRWww/o.jpg"
      },
      {
        "img_id": "hvxHe7Gr5-O1KNKKsJ6CKg",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Cowboy hanger steak (main)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hvxHe7Gr5-O1KNKKsJ6CKg/o.jpg"
      }
    ],
    "user_id": "Ccp18w8Ljnv7uSwW3HGORA"
  },
  "W7pF6_1pmi3qpIEBsy6Yrg": {
    "date": "12/5/2017",
    "text": "Fantastic location and used to be perfect for breakfast, but unfortunately menu recently changed and now overly sugared and fussy for my taste. Could be great again if they bring the old menu back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nd-bnFQODYrvOjerkjelBw"
  },
  "UNtgF9m7YIrIb6NmGSDKYw": {
    "date": "4/6/2017",
    "text": "One of my favorite brunch places in Singapore! I always have trouble deciding between the crab omelet and the Blackstone Benedict, but the best part of the meal: the molten lava chocolate cake. Rather indulgent for breakfast, but it's worth it! I especially love being able to enjoy brunch while watching the horses.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ah5q6PLi5LSVEtBr5bU8pw"
  },
  "W5TO0sMQTLwUZJJlq_S4pw": {
    "date": "6/20/2015",
    "text": "We went to Riders on a Saturday for brunch and it was packed. We overheard the staff saying that the waiting time was about half an hour. Fortunately, we'd made a reservation, so we practically sailed right past the waiting line. I like the atmosphere of the cafe. It was open, inviting and bustling with activity. Perfect place for people-watching. We were seated on the balcony facing the stables. My initial concern was about the smell, but it was unnoticeable. We had the corned beef croquettes, Riders Burger, and homemade sausages with creme fraiche scrambled eggs. The croquettes were good - the crispy, golden brown breadcrumbs gave way to creamy potatoes with the occasional chewy beef bits. The corned beef offered a pleasant pop of flavour that accented the mild potato taste. They were truly enjoyable to eat. The portion was generous too. I expected maybe two pieces of croquettes but there were four - more than enough for a starter. The Riders Burger was all about the beef. The other ingredients were reminciscent of Burger King's Western Whopper, but they were all overwhelmed by the beef. This burger would be perfect for meat lovers.I chose the homemade sausages and creme fraiche scrambled eggs because they came with a leek and potato rosti. Unfortunately they looked better than they tasted. The hollandaise sauce was the best part of the dish. The scrambled eggs were fluffy and creamy, but for the most part tasteless, but that was ok as we had salt and pepper at our table. The rosti was, strangely, creamy. It was essentially fried mashed potato and leek. There was a mild taste of leek on the fried surface, but that was overpowered by the flavourless mush that was underneath. Next to the mild flavours of the eggs and mush, the sausage tasted too strong, which shocks the taste buds. I dipped most of what I could in the hollandaise to get some flavour, but there was barely a spoonful of it to begin with. The food may have been slightly disappointing, but the service was excellent. The crew was attentive and proactive, and we could really tell that they were properly trained to provide high-level service. For that, kudos to the staff AND the owner/management of Riders Cafe for caring. Service really contributes half, if not more, to customer experience and satisfaction. For this, I would definitely go back to Riders (and order other things on the menu instead).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kqGy9vdXOEd5e1WTJ3WB2Q",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Homemade sausages with creme fraiche scrambled eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kqGy9vdXOEd5e1WTJ3WB2Q/o.jpg"
      },
      {
        "img_id": "_YHV6H2XQFSRiIT81iB9uQ",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Riders Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_YHV6H2XQFSRiIT81iB9uQ/o.jpg"
      },
      {
        "img_id": "f-dqIBSjkGsqfaMeBdTSkQ",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Corned beef croquettes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f-dqIBSjkGsqfaMeBdTSkQ/o.jpg"
      }
    ],
    "user_id": "fAY7S51J_9uMMZRVTO8f3w"
  },
  "1JSSPnjEHtYvv-T_ULPVLw": {
    "date": "4/11/2017",
    "text": "Love the chocolate lava cake! The eggs benedict is great too. My friends and I really enjoy the pleasant setting on a Saturday or Sunday morning - if you like horses, it's a plus too. Remember to call ahead to make your reservation, as it can get quite busy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DLnIktEiEyzxNWrN0Tq5Mg"
  },
  "paErq8DmfomF8FU6AR8LQQ": {
    "date": "5/7/2013",
    "text": "It is definitely advisable to make reservations at least 1 day in advance (they don't take same day booking) as it is still full house at Riders Cafe on weekends. They do take walk in customers but likely you just have to wait for at least 30 minutes or more. It is not so bad as you get to gaze at the lush greenery, clear blue sky (if it is not raining) and listen to the neighing and clopping of horses every time they are led back into the stables. Quite enjoyable as it is not a common sight in this concrete jungle.Being my 2nd visit in a span of a few years, I am glad the food is still as good. We shared the pacific benedict and brioche french toast with bananas. They were excellent. Quite a generous serving of swimmer crab meat with nicely poached eggs and spinach and shrimp hollandaise (couldn't taste the shrimp) sauce. Something different from the usual egg benedict or eggs royale. The soft brioche made a perfect french toast. Loved the grilled banana caramelized with a thin layer of sugar, crispy bacon and maple syrup. The cafe mocha was also decent. Being a full house, service was a bit slow but not as bad as some places. There is no air conditioning throughout, except for the washrooms below stairs, adding to the charm of a rustic setting with fresh air coming in through the verandah. Note: You need a car or taxi to get to the restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QXv01JTDpzsBNqwcVEFeGQ",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Pacific benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QXv01JTDpzsBNqwcVEFeGQ/o.jpg"
      },
      {
        "img_id": "v3WBQ3Os2YpJRGEf02VB6w",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. French Toast with bananas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v3WBQ3Os2YpJRGEf02VB6w/o.jpg"
      }
    ],
    "user_id": "Q1oMmm7tKPOzA7_gqcV4zg"
  },
  "cH4uL-EcDnugeH437r9wfQ": {
    "date": "2/8/2014",
    "text": "Riders Cafe is one of the earlier brunch spots which was so popular that reservations have to be placed in advance. Fortunately and coincidentally, there was a table cancellation when I called on the previous day of visit and so we did not have much problems securing seats. The usual brunch suspects were delicious and certainly lived up to the predominantly positive comments that were aplenty in the media or online community. Brioche French Toast with Fresh Berries and Vanilla Mascarpone $14 are great for those who like to start the day on a sweet note. The alternative french toast option comes with maple butter, smoked bacon and burnt bananas. Unlike \"The Usual\" ($16), Black stone Benedict ($15) comes with the extra hollandaise sauce on poached eggs and crispy bacon instead of bangers and mushrooms.To me, hollandaise sauce is the supporting cast that makes the leading cast (soft poached eggs with bursting egg yolk) shine. I had been tempted all along to challenge the Death by Chocolate Cake with Vanilla Ice cream $12 but I was disillusioned eventually. This won by quantity and not quality. The chocolate ganache was not velvety and stood unmoving like a rubbery coating. There was not much contrast in the taste because everything from the cake to the ice cream was cloyingly sweet. Instead, the Salted Caramel Cheesecake with Crumbled Honeycomb $8 would attract one to take a second bite or even more. The cheesecake itself tasted as natural as it could get, without too much sugar added. Would be ideal if there is more of the salted caramel frosting. Special items of the day are written on the black board. Even though many other brunch spots and cafe have sprouted incessantly in Singapore, Riders Cafe is a good option for brunch or even dinner with the accompaniment of horses. But the location is only convenient if you can find your way there in a car or by a taxi.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oPQAc-GID4XML9p0YeNcGg",
        "caption": "Photo of Riders Cafe - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oPQAc-GID4XML9p0YeNcGg/o.jpg"
      }
    ],
    "user_id": "dJzKwp5k65MK3R_qn4Xpow"
  },
  "W-NEODUjktTrFqwhWAeQiw": {
    "date": "12/25/2016",
    "text": "We went for lunch to rider's cafe on a day when the weather was amazing - very pleasant, not too sunny. The ambiance is very laid back and nice. Food for us was ok, nothing spectacular. We did like our milkshakes and juices though.  We had scrambled eggs, chicken blt, beef burger and pasta.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJzu5EUE13Cxf2ghRhJG7g"
  },
  "WnGLikJf29uTYKyKYhXsIQ": {
    "date": "2/22/2015",
    "text": "We alighted at a bus stop at Dunearn Road and then walked in from Eng Neo Avenue. Poor people like need to take public transport. :( As we don't drive, we had to walk in and it is a LONG journey. The road aren't exactly people friendly. I suggest people who are going there to drive in.The place is located beside ranches and you can probably see some horses outside the window.The decor is nicely decorated and place looks cozy for a lovely afternoon brunch. I suggest you can try this. PACIFIC BENEDICT WITH SWIMMER CRAB, POACHED EGGS,SPINACH AND SHRIMP HOLLANDAISE.Theres a pleasant surprise underneath the eggs. You can see huge chunks of crab meat. yum yum.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6LLRmCX0Gl7_x6bxSE-T3A"
  },
  "0h-S-1w5GatqfvzwgTtMzA": {
    "date": "6/8/2013",
    "text": "I haven't really explored many brunch spots in Singapore. But from those that I have visited so far, Riders Cafe is my favorite. We tried to get a reservation the day before and was told that they were fully booked. They would still accept walk-ins though, and that's what we did. We had to wait for about 30 minutes for our table. Not too bad, considering you can wait in the car until they call you.I had the poached egg, portobello, sweet corn polenta and it was cooked very nicely. It's a very simple dish but the execution was very good. Another dish that we had was the almond-granola crusted fried chicken. I think the crispness of the almond & granola matches very well as a batter for the fried chicken. I must note that they also served the corn polenta in this dish, too repetitive IMO.We also ordered the roasted pork belly and it was the letdown of the meal. It was such a sin to cook a pork that way. The skin was hard and not crispy and the meat was just dried out.I'll definitely go to Riders Cafe to try the other items in their menu again though. I heard that their dinner menu is also good and that's another reason to come back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jePv6hlv-F_Zw4NyLgm1KA",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Roasted pork belly",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jePv6hlv-F_Zw4NyLgm1KA/o.jpg"
      },
      {
        "img_id": "YH7rKL2UMRm7HVqpPoO1fg",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Poached egg, portobello, sweet corn polenta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YH7rKL2UMRm7HVqpPoO1fg/o.jpg"
      },
      {
        "img_id": "zqZGXyurqtsaN17vLAlWzw",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Almond-granola crusted fried chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zqZGXyurqtsaN17vLAlWzw/o.jpg"
      }
    ],
    "user_id": "BKBBNwnF__qx7KfJsu8AOQ"
  },
  "eRQAnAEwAhpY4aIPhRwl8A": {
    "date": "12/12/2015",
    "text": "The location is great and the burger was really delicious. Simple but nice fries. Good coffee. The only issue with this place is you have to drive or take a taxi. Friendly staff, good crowd. Will come back again",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0m73a5Z-KYZQ2ULgsSq2w"
  },
  "0aNQ9HpQhJGwjS-E2F1dBA": {
    "date": "8/21/2013",
    "text": "The Riders Cafe is decidedly one of my favourite brunch places in Singapore. You don't get too many awesome poached eggs around here (or maybe I just haven't tried enough), but they do it pretty good here. Coffee's also good, and being in the middle of nowhere is fantastic. It's a great way to get away from the skyscrapers and clogged roads that characterises much of Singapore these days. Smell a bit of green grass, smell a bit of horses.. it's very therapeutic. If you've eaten too much of it's good food, you can always loiter around afterwards and explore a bit. A very nice way to spend a morning. The only gripe I have is that it's extremely inaccessible. Even if you are up for a bit of a trek. It's quite impossible to walk in from Dunearn Road, or I haven't found a way yet! Then again, it's a small price to pay for the wholesome experience.Oh and I never never manage to squeeze in a reservation for weekend brunch unless I call at least a week in advance.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "AA8s4nbXp3yZLb4yJG4P2A"
  },
  "V-pYJ7SgvwhoVO-bYO8M6A": {
    "date": "8/20/2012",
    "text": "Choose this place for friend's meet up suggested by my friend. This place is only accessible by car so we took a cab in. We went there around noon time without any booking made. As expected, we need to wait to be seated. Waiting time was 45mins and since we are already there, there is no reason why we don't wait. Located at the Bukit Timah Saddle Club, we take the chance to walk around the place enjoying the scenic around us. On and off, someone will ride a horse pass you.We were seated and served. service was good where service crew introduced the different dishes to us. The food was passable but on a hot day without wind can be quite unbearable for people who can't tolerate warm like my friend. We still managed to sit there for 2hr of chit chatting without the crew any hint to suggest us to leave. Definitely a good place to gather for meetup. If you come in by cab, most probably, you will need to call a cab out again. Very inaccessible.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l6R_iENS57mIuqXGLiGZtA",
        "caption": "Photo of Riders Cafe - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l6R_iENS57mIuqXGLiGZtA/o.jpg"
      },
      {
        "img_id": "hoxVio2mXG3_sxJcqbwMWA",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Egg's Benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hoxVio2mXG3_sxJcqbwMWA/o.jpg"
      }
    ],
    "user_id": "9evC7g5uOFAtp-UTbi1tWg"
  },
  "C5_vih5kgbgB6OAYeBIHOQ": {
    "date": "7/22/2012",
    "text": "One of the best places to head to for a good breakfast/ brunch on the weekends!The place is non air-conditioned, but pretty well-ventilated with the in-house ceiling fans and outdoor natural wind (and lots of sun in the morning!) The best spots to dine at are the few tables on the side of the cafe that overlooks the stable. (Check out the pictures I've uploaded!) For breakfast, meals are usually accompanied with eggs that you can have it your own style: poach, scramble or omelette. The waiting line during the weekends is pretty long. So, make sure you call up the cafe to make reservations before heading down. Getting there is another obstacle. The nearest bus stop is a good 15- 20 mins walk away. I would suggest driving  or cabbing in.  But hey, I assure you the experience, food and service is worth the all the trouble! (especially to wake up early on an early Saturday morning just to have brekkie!)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gIgh--znOfvZ1wo0ZYv6Xg",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. Riders Cafe storefront",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gIgh--znOfvZ1wo0ZYv6Xg/o.jpg"
      },
      {
        "img_id": "GcIupbLV40WEx8cmQoAl8Q",
        "caption": "Photo of Riders Cafe - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GcIupbLV40WEx8cmQoAl8Q/o.jpg"
      },
      {
        "img_id": "8CC5a3KFZ3bzm4Kn_g_WYQ",
        "caption": "Photo of Riders Cafe - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8CC5a3KFZ3bzm4Kn_g_WYQ/o.jpg"
      }
    ],
    "user_id": "-gSBIKGqb13BjdR7hylOzQ"
  },
  "B8FszmZTDlQ2Ge9RrA8p4Q": {
    "date": "8/23/2012",
    "text": "Rider's is on the favourites list of many brunch-goers, which is why if you plan to have a brunch date here on weekends, you better plan well ahead because its hard to get a seat if you didn't make reservations. Fairways Drive is not a place you want to go to if you don't drive, if you're taking a cab, you'll have to direct the cab driver because not many are familiar with the place. But even with its remote accessibility, its still packed! Because the food and ambience are something you'd travel for, they're that good.To me, they have the best pancakes! Fluffy, buttery, creamy goodness with fresh blueberries and cream. Their poached eggs and salmon comes a close second. Plus enjoying it in a cosy setting against the greenery with horses grazing in the background doesn't hurt!You can take a walk outside and maybe have your kids go on a pony ride (only $10!) after brunch, its not just a nice romantic brunch place but good for families too.Final verdict: One of the most quaint brunch places in Singapore in one of the last countryside corners of this urban jungle.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qbEAserSUQwYnc_TM7bWaQ",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. poached eggs & salmon, rider's cafe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qbEAserSUQwYnc_TM7bWaQ/o.jpg"
      },
      {
        "img_id": "wp7_D43ghqFyuYCp2Ce9IA",
        "caption": "Photo of Riders Cafe - Singapore, Singapore. pancakes, rider's cafe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wp7_D43ghqFyuYCp2Ce9IA/o.jpg"
      }
    ],
    "user_id": "kWpV8BiFGNRhpeHYXl_q6g"
  },
  "HyH9q9Z-EAovZ7YjzqLnOw": {
    "date": "3/25/2016",
    "text": "Very kids friendly and excellent brunch menu.  It is a popular place on the weekends - the ambience is nice - old black and White House.  The highlight is the weekend pony rides at S$10 / person.  A place recommended with small or big group.  Book ahead.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKzv6PG0p_lsEDFtwyJepA"
  },
  "BSpgNLxcWRizQop0ZSZ91g": {
    "date": "7/22/2012",
    "text": "Riders Cafe is a lovely quiet cafe with alfresco dining available. Was there for dinner, and thought it a great place to chill out over a nice dinner.Food: A better option than Marmalade Pantry @ The Stables. The pork chops were absolutely delicious, and so was the Chilean cod. Really liked the lavender creme brulee, and the chocolate cake is to-die-for.Ambience: Quite a nice chill out joint for dinner, one can opt to sit alfresco if the weather is cool. There's no aircon, so if you're not one to tolerate heat and humidity, highly suggested you go in the evening. Slight pong of horse manure, but not overwhelming and one gets only very faint whiffs now and then.Service: Generally friendly and polite, but seemed a bit lost.Only reason I wouldn't recommend this place is 'cos I wanna keep the crowds away.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blxzOOhWwU_VtgVYxwL0AA"
  },
  "M_5ueqbQkLYcYGoGfWQPSA": {
    "date": "8/11/2012",
    "text": "NAAAAYYYYYYYYY. That was me imitating horses.This riders café is a little bit atas, you can't deny it. It's not every restaurant that can have horses at their backyard. Okay, not exactly backyard, it's the Bukit Timah Saddle Club. That said, it's a great selling point. You get to see horses galloping by and reconcile the Black Beauty part of you.They serve you jars of water the moment you sit down (WOOTS), service is prompt. Go early and try the egg dishes from their breakfast menu, couple good choices are poached eggs or baked eggs. Their Death by Chocolate Cake is a must-try dessert. OMNOMSNOMSNOMS.The al fresco atmosphere was very wind-in-my-hair, especially on Sunday mornings. It's been a while since I went there, not sure how it's like in the recent heatwave though. Be sure to make bookings in advance, now that everyone knows about this café with horses in the backyard.Check out eatlikeawhale.blogspot.sg for more pictures and reviews.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wWXchH7yRlFCxfC4dkQnA"
  }
}