{
  "mS8m0owqfpf_TIwP_ONrJA": {
    "date": "1/10/2018",
    "text": "My favorite congee (porridge) hawker stand in Singapore. I came for an early lunch when there was no long line. Normally have to wait 30-45 minutes to get your food.It is so creamy and delicious, I know of no other place anywhere that has rice porridge as awesome as this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "u6tOetlgR9ffdZV_njXfhg",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. First time I have never seen a long line of people",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u6tOetlgR9ffdZV_njXfhg/o.jpg"
      },
      {
        "img_id": "9gU7i_k-99w1QD3BY0CfLQ",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Chicken porridge. Congee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9gU7i_k-99w1QD3BY0CfLQ/o.jpg"
      }
    ],
    "user_id": "DIckqqZNAQwL5ySdqWIJyw"
  },
  "UMPARD6c4_GpSjBuel4Ogg": {
    "date": "6/7/2018",
    "text": "Food: 3.5/5.0Service: 1.5/5.0Value: 3.5/5.0Decor: 1.5/5.0Overall: 3.5/5.0Don't hate me, but I think Zhen Zhen is a bit overrated.  The porridge is good, but it was a letdown v. the hype and when it's not that great, I suddenly care more about the sloppiness of the preparation and presentation, etc.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9LtRKwgaSpMY6wXWy4fcWQ"
  },
  "-ued2kn6SAVRTaCTITmyqQ": {
    "date": "9/19/2018",
    "text": "though it is truly (zhen de) authentically traditional type of porridge/congee, it has really nothing to rave about apart from being affordable(in price) esp u have to queue for it... hence the ability to q at the right timing is important ....at least it is not a disappointmentI felt the cooked porridge is too mushy till i can NO longer recognise it is made of rice",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_x5sqWYKrsfaDlrGlalAQ"
  },
  "RUPMBjbyRxBz6e8nZNkTwQ": {
    "date": "9/12/2018",
    "text": "I don't know what the hype is about this place. Really disappointed, feel that the porridge is quite watered down and lacking in taste. The average porridge in HK is significantly better. We tried the fish porridge so the other ones might be better/why ppl like it but I wouldn't go back...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "9xnSHaItKxNhoI9Q3JvhvQ": {
    "date": "2/1/2016",
    "text": "Really good porridge,  but I prefer porridge with thicker consistency. It is smooth and you can't taste the rice texture in their congee at all. I can see why some people love their congee for the smooth texture, but I personally find it is too smooth to be considered porridge - more like blended rice soup. Really generous portion, with great taste. They don't heat up individual serving of porridge when customers place their orders, which is a no-no for me too. Porridge ends up being lukewarm when served with a raw egg. In theory, porridge is supposed to be piping hot and the egg will be cooked instantaneously when added to the porridge.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "U3l7I52ng0LryXHyi1zvBw",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U3l7I52ng0LryXHyi1zvBw/o.jpg"
      },
      {
        "img_id": "RkhMg3Fyq24j_YUh5SKrPQ",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RkhMg3Fyq24j_YUh5SKrPQ/o.jpg"
      }
    ],
    "user_id": "J6n308FUoKLLkwxNUH6a6w"
  },
  "k_blfHmv9iBowLePl7DMlg": {
    "date": "6/20/2015",
    "text": "Zhen Zhen has one of the best congee I have ever had!!!  My mom and I arrived at Maxwell food court around 10am on Saturday and this place was the only booth people were lining up for.  So I immediately jumped in the line, not even knowing what kind of food they offer.  The line was, too be honest, really slow.  We waited about 30 min to get a bowl of porridge but it was so so worth it.  I ordered a small bowl of fish porridge and I was super full.  But the porridge was so easy on my stomach and the fish didn't smell at all.  I know the line is long, but go there as early as you can and get a bowl :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pum3tCgLwAC6NqS19vzf8w",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. small bowl of fish porridge",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pum3tCgLwAC6NqS19vzf8w/o.jpg"
      },
      {
        "img_id": "xU8QWqU_if3Up5BXF4aehg",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xU8QWqU_if3Up5BXF4aehg/o.jpg"
      }
    ],
    "user_id": "mVA4IeYyVKPUWRrN5oplMA"
  },
  "Gg1JT26zk_5CZhymgLec_A": {
    "date": "5/28/2015",
    "text": "Really good congee! Ordered the fish slices, chicken shred and thousand year old egg (#4) and it will not disappoint!A small size for $3 is a good size. We shared one and it wasn't overly filling that we felt we could try other items in the food center.Always a line up but definitely worth it! Note: they open at 5:30 am",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dHIRYBz3Q4BzK_bMF2CljA",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. #4",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dHIRYBz3Q4BzK_bMF2CljA/o.jpg"
      }
    ],
    "user_id": "u0LXt3Uea_GidxRW1xcsfg"
  },
  "hFgV-_Tk80Wzf62FJvc1OQ": {
    "date": "9/19/2017",
    "text": "We were at the Maxwell Centre around 9 am or so and decided some congee would be the perfect breakfast.  We ordered a century egg and chicken to share and it was fantastic.  Very flavorful and the best way to start a day.  The only reason I'm knocking off a star is because as we got to the bottom of the bowl, it got overly salty.  Perhaps we just need to mix it a bit more in the beginning.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGngZdkxRpeZckIE-2wPZA"
  },
  "BUSHYSWvNeopQvYARViCfg": {
    "date": "1/18/2014",
    "text": "Easily, among the greatest conjee experiences I have ever bad in my entire life.  Zhen Zhen is located inside the Maxwell Food Center.Coming here seems like a religious experience because, why else would one wait in line on a Sunday morning for 40 minutes for jook?I had the Fish jook with duck egg.  The amount of fish added is generous.  The woman at counter systematically adds cilantro, chopped green onions, delicious fried shallots, and a few drops of some kind of oil.  I added soy sauce, red chili peppers, and a sprinkle of white pepper to my bowl.The consistency, flavor, and texture of this jook was out of this world.  A home run and provided justice to the palette for such a long worthwhile wait.This is the only hawker stall at Maxwell Food Center with a line.  It is directly in the center of all the stalls.  Note the many certificate of food awards humbly posted here.I also recommend the sashimi salad. It's very similar to ceviche and tastes excellent too.For two medium bowls of fish jook and the sashimi salad, it'll cost you $S10.So far, my single best food experience in my brief stay here in Singapore.As this place opens at 5:30am, I wouldn't be surprised if people camp the night before to get this porridge greatness.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9F25MLUyX48L7UqbZ-8oQA",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Note the items.  The crossed out item was a fish head congee that appears to be discontinued.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9F25MLUyX48L7UqbZ-8oQA/o.jpg"
      },
      {
        "img_id": "Ep5a9R8gKR6AbQwI005ofg",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Fish and Duck Egg Congee.  Best congee I've ever tasted.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ep5a9R8gKR6AbQwI005ofg/o.jpg"
      },
      {
        "img_id": "ame5R8kahBE7WDiphGvtLw",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Sashimi Salad.  Very good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ame5R8kahBE7WDiphGvtLw/o.jpg"
      }
    ],
    "user_id": "pMltyeuU4SjT6Y8YVy7HBA"
  },
  "0_V29GxnlaIUCvHBM5Ll2w": {
    "date": "7/16/2017",
    "text": "This place reminds me so much of the soup Nazi in Seinfeld. You MUST follow the correct line and correct order procedure or else you will get a earful from the auntie. This always cracks me up when I am ordering porridge or congee to those from overseas. Line on the right - order. Line on the left - pick up. Porridge portions are generous, with spring onions, ginger and pepper. Varieties are fish slices , sliced pork, century egg, fish stomach. You can do various combinations of course. Price wise, S$3 up.Taste wise, yummy delicious! Be armed with a cold drink as you are sure to perspire when eating the piping hot porridge. Shiok!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "nw4MCu8V_FhP2yRldvdrfQ"
  },
  "BCpXH_a2ZadCgU7Lid6cTA": {
    "date": "5/9/2016",
    "text": "Porridge is pretty close to my heart. I've had a few varieties in some great places. This absolutely knocks it out of the park. The pure comfort food goodness sends positive waves throughout your body.  Little else is noticed when partaking in this delight. It is Creamy, salty, meaty, herbaceous celebration in your mouth. If you make it to Singapore, it's a must try.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tQdFQUnu7I0YzARBollW3w",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Carrot cake on the left. Not sure of the name on the right.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tQdFQUnu7I0YzARBollW3w/o.jpg"
      },
      {
        "img_id": "j35QPZdJ4Q535_cbp2tf1Q",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Fish chicken and century egg porridge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j35QPZdJ4Q535_cbp2tf1Q/o.jpg"
      }
    ],
    "user_id": "FNy9giAPTGxCPQOY1AFudA"
  },
  "zDDE4qxtTDVMeH8FBKHBlA": {
    "date": "1/26/2016",
    "text": "When I told my husband we had to eat here, he wasn't that excited. He thought, \"what's so special about porridge?\" Boy, were we in for treat. Again, no wait time at all. I walked right up and ordered the #4 with fish, chicken, and preserved egg. It was absolutely amazing. I eat porridge on the regular. It's one of my ultimate comfort foods. Zhen Zhen's blew it out of the park.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "03RJcIDcNwH4WQmqjIvwIw"
  },
  "Lz8rBby0nrwfhEGmQoKS2g": {
    "date": "9/14/2013",
    "text": "This is the best porridge I have ever tasted, and worth every minute of the 30 minutes we waited in line (at 11:25 am on a Thursday).  Porridge will never be the same for me, and every subsequent bowl will likely pale in comparison.  They have a vat of porridge cooking in the back of the stall, then each order is individually cooked with what you want added (thousand year egg, chicken, fish).  Each bowl is topped with pickle veggies, fried shallots, scallion, and remember to add some vinegar.We ordered the $3 bowl, #4, to share (we wanted to try other food as well) and it almost filled my wife and I.  Totally worth $3.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "meHj3r5k8HIQ3hliFhpMog",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/meHj3r5k8HIQ3hliFhpMog/o.jpg"
      },
      {
        "img_id": "6TSoI7vICNTrG5PVZG61cw",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Remember to add white pepper and vinegar!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6TSoI7vICNTrG5PVZG61cw/o.jpg"
      },
      {
        "img_id": "1WD9C0jlkA_A11in2TCkZQ",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Vat of porridge",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1WD9C0jlkA_A11in2TCkZQ/o.jpg"
      }
    ],
    "user_id": "NvVj9v3RvQRZuYwnkRjU2w"
  },
  "wrsRZDsJ089qS1E9GweROg": {
    "date": "3/29/2016",
    "text": "Good jook Cantonese style. S$3 for a small bowl. Fish could have been bigger pieces.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DNntARwKLJmAMH-FgihowQ"
  },
  "Xzmh1_LyfLG5scfymQdc1g": {
    "date": "2/6/2014",
    "text": "This is the longest I've ever had to wait for a simple bowl of congee but boy was it worth it. The lady running the store may be the meanest and most sarcastic person I've ever met but that 10 seconds of interaction would hardly change my appreciation of how well they cook their food here. First thing, get the smallest bowl of congee ($3). It's has more than enough in it to fill you up. Getting anything bigger would be overkill. Secondly, get the Yu Sheng/Fish Salad, it's layered with so many flavors and textural contrasts and it would only set you back $3. Now I've got to start planning when I'm going back.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7T5_UsjNiGj_Y3FpYHsUmw",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. Fish porridge + Yu Sheng",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7T5_UsjNiGj_Y3FpYHsUmw/o.jpg"
      }
    ],
    "user_id": "Ncq1J7jnPTZDPRdZnHOt9w"
  },
  "POTmSAaEnxEF3tH1W4tQyQ": {
    "date": "12/28/2015",
    "text": "My boyfriend and I were jetlagged on our first day in singapore and woke up at 4am really hungry. Luckily this place was open at 6am and the congee was really good and very cheap. Maxwell center is our favorite hawker center in singapore so far.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0tcLUaqM1Jd_gfnaTeTd5w"
  },
  "zxdb-dulqw4EQZTXfFhUbw": {
    "date": "9/14/2013",
    "text": "This may be a tourist point of view but this is the best porridge I've ever had, my husband agrees too. We went to Maxwell Food Centre early in the morning around 10:30 when most stalls are still closed. This one already has a long line. Being a tourist we thought if all the locals line up mean either cheap & decent food or really good food. There were about 8 ppl in front of us, boy it took 45 min til we got our porridge!!! There's a ginormous pot (more like a huge tank w an automatic stirrer) cooking the porridge, then the 1 and only chef move each porridge portion into small pots and cook w the meat of choice (fish, chicken, century old egg or combination).It was worth the wait!!! We got the small $3 bowl to share w fish, chicken, and century old egg. Wow big portion for $3.. We promised to save stomach space to eat  food from other stalls but everyone spoon we ate had meat/ egg in it, that's how much content it had. Most delicious and best deal of homemade like food we've ever gotten. By around lunch time the line has gotten longer around the corner!! Looks like this place opens at early 5:30 am til 2:30 pm and they are closed Tuesdays.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "G8C6RuafQbmcZMmT-HqJgA"
  },
  "R9HeyPcZHaqaPciBLSZcVw": {
    "date": "8/13/2012",
    "text": "Feel like I may end up being smote by some Foodie God for not giving Zhen Zhen Fish Porridge a 5 star review but here goes.Do not underestimate the mettle of this store. Maxwell is a stone's throw from my office so I frequent it often enough to be certain that this mystical porridge holds an amazing sway over the masses - the storefront is almost never without a snaking queue. Waiting time is anywhere between 30 - 45 mins, so bring along a book or play many rounds of scramble with friends to avoid ending up questioning your sanity. Patience has never been one my strongest suits so the wait made me a tad grouchier and enraged my expectation of the food to a few notches too high.Let's start with the best bit of the meal. The yu-sheng was spot-on - I can almost confidently say it is the best I have tasted in Singapore. Fresh fish slices are lightly marinated before being tossed with fragrant sesame seeds and crunchy spring onions. Patrons get to top it off by squeezing on some zesty lime juice. The hawker lady generously threw 6 limes into my box of $5 yu-sheng and I was a little perplexed by this plentitude but decided to go for 3 which turned out just perfect.   On to the porridge. The uniform consistency of the thick white gruel is certainly a feat. Every single rice grain has been subjected to prolonged methodical stirring that has ensured the gruel's acclaimed homogenity. And therein may also lie the reason as to why I am a staunch 4-star fan - being Teochew, my ideal porridge has got to have fluffy bits of rice grains still intact so this doesn't quite cut it for me.Despite my irrational porridge discrimination, I must say that stall is generous with the ingredients that go into each bowl. I ordered the century egg and sliced fish porridge and had a sliver of meat to go with every single spoonful - a rarity nowadays. All in all, try this if you aren't going to lose your temper over the wait. I am definitely more of a true blue Zhen Zhen Yu Sheng fan.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "FU5mC0OWVYL2vqP-9ZBT9g"
  },
  "NIK_xDi7pHfrXK8X4oknFQ": {
    "date": "8/8/2012",
    "text": "Undoubtedly my favorite stall at Maxwell Food Centre! It serves the best yu sheng (aka raw fish) in Singapore, and unbelievably smooth congee. The yu sheng tastes good because there is no bone (there are so many out there which has small bones still stuck on the fish) and are sliced thinly. It tastes good with the sesame oil, black and white sesame seeds, and the garnish. For the porridge, even if you order the plain one, trust me it's smooth and tasty. It probably does not have the Crystal Jade plain porridge standard, but with the generous amount of sesame oil and sesame seeds, it's perfect to go along with the yu sheng.It gets sold out pretty early, and the wait can be pretty long. But I assure you that this is definitely worth the wait!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5qnan1MZhuF8LetcU-Ziw"
  },
  "F86_Ad_1WXeM1s39_Hzl7w": {
    "date": "8/8/2012",
    "text": "One of the few hawkers I know to sell out and close for the day by lunch time.  Zhen Zhen serves a well-cooked porridge that is neither too sticky nor wet. Fresh fish and ginger strips further enhance the overall flavour of the porridge. Raw fish or \"yu sheng\" is also a popular add-on dish to accompany the porridge. The raw fish is dressed in vinegar, sesame oil and a multitude of other sauces topped off with fresh spring onions and chopped chilli. Before you jump to any conclusions, the fish is extremely fresh and the seasoning kills any taste of rawness. The only downside is queuing but don't all good things take time?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E6xW81pBEJQLND4ew-5p3A",
        "caption": "Photo of Zhen Zhen Fish Porridge - Singapore, Singapore. The famous Zhen Zhen Porridge & \"Yu Sheng\"",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E6xW81pBEJQLND4ew-5p3A/o.jpg"
      }
    ],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  }
}