{
  "kDCVhXht8LhP69-tUbL9Bw": {
    "date": "9/27/2018",
    "text": "Visiting Tiong Bahru Market and Food Center area.We saw Old Tiong Bahru Bak Kuh Teh across from the market.The Bak Kuh Teh (literally translated to Beef  Bone  Tea ) was peppery with long and short ribs.  Broth was excellent.  The black sauce with chilies  served on the side added another dimension to the Bak Kuh Teh.Watercress side dish we ordered was excellent!Braised Kidney was a little undercooked but tasted great.Longan based iced dessert courtesy of the house - refreshing especially on a hot day.Consider visiting Old Tiong Bahru Bak Kuh Teh while in the area.  The hawker stalls inside the market are also good options for lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "ncm2BhE3eRSelSKfYGvGLg": {
    "date": "8/2/2016",
    "text": "Haven't been here for years!Best are the small intestines. So tender.Yoo char kway was also very good. Large and not hard. Soft.Cabbage was good although I don't remember this as an accompaniment to bak kut teh.Liver was sliced too big and too thick; slicing properly might have helped. Some were a bit hard and others not bad.Ribs were only so so. Meat not so tender even though we asked for softer meat.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qJeXDReWVtA8fi_miIY4Kw",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore. Liver you can give it a miss",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qJeXDReWVtA8fi_miIY4Kw/o.jpg"
      },
      {
        "img_id": "rp7j_wGfS3JhwAwiAyWMFw",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore. Not tender enough",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rp7j_wGfS3JhwAwiAyWMFw/o.jpg"
      },
      {
        "img_id": "RR-4i36N71fLqX6sOLunww",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore. Good cabbage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RR-4i36N71fLqX6sOLunww/o.jpg"
      }
    ],
    "user_id": "ij3UcrQUXl7YBoBTcH89rQ"
  },
  "2f24DpvgqKkoU-yTbPfaZg": {
    "date": "3/10/2017",
    "text": "Came here with family friends who are regulars. I loved it. Delicious BKT - nice and peppery. Huge variety of dishes too!! All very tasty. I found the service to be a bit on the slow side for a traditional, open-air, side-of-the-street restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cw7MbdbY5VOduL34__hPcw",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cw7MbdbY5VOduL34__hPcw/o.jpg"
      },
      {
        "img_id": "wqne6heFySor03E6oiFmxA",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wqne6heFySor03E6oiFmxA/o.jpg"
      }
    ],
    "user_id": "HcgxpwJwblQqNGNKdbZiaw"
  },
  "7XOqyg3lPL2nxG3AUdguqw": {
    "date": "4/30/2016",
    "text": "My go to place for BKT. It is the closest to what I am use to from back home - clearer soup, peppery and stronger herb taste. Located opposite the Tiong Bahru market, there is usually a fair amount of people but I never had an issue locating a seat. I usually go for the big ribs, pork kidney and noodles - all good. Not the cheapest around. That combi that I usually order, with a drink, would cost about $20 for one person. Of course there are other stuff on the menu and with everywhere else, it very much depends on what you order.Service is good. Staff usually busy busy but attentive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SW2MLxdATfBrk-i3IwkCHg",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SW2MLxdATfBrk-i3IwkCHg/o.jpg"
      }
    ],
    "user_id": "tOnAuTqwPr5fwoVsXJ4s8A"
  },
  "wLJQ5xGiIrY--eD41QQj-Q": {
    "date": "6/13/2015",
    "text": "Sat down and tried using some Chinese to order. I thought I got bitter melon and potato and but I misunderstood and got bitter melon and fish head. It was delicious. Much better than potatoes. The rougu cha was great and would fix you up great if you were getting over a cold or a broken heart.And of course cold coconut juice. Hard to go wrong with that stuff.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "McrQSLpu4Nm8tezpzAb8eQ",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore. Fish Head with Bitter Melon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/McrQSLpu4Nm8tezpzAb8eQ/o.jpg"
      }
    ],
    "user_id": "BDuIdscw8KNCyDyNMJsgPA"
  },
  "_yaUqLqgLDUjKnhJmlqsNA": {
    "date": "7/19/2014",
    "text": "Had lunch here on a weekend. This style of soup is best if you like to drink heaps of it, as it isn't overly peppery and tastes more like the natural sweetness of pork. I confess I had three bowls of it - free flow right?Perhaps considered a slightly unique preference, I like to eat BKT with innards. They serve a mix of innards here - liver, kidney, and a some large intestines. They serve the innards BKT with the liver slightly undercooked so it bleeds into the soup. If you do eat innards, but dislike them bloody, make sure you tell them about it, or wait a while before tucking into your food.As usual for BKT, you eat them with fried dough crullers (you tiao) soaked in soup, ad salted vegetables, black sauce, and soup with rice. YUM! Come here for a casual meal with your friends, and prepare to sweat. Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "yM3QoZxABbzYgdZUp67Uxg": {
    "date": "4/15/2014",
    "text": "This is a great local spot that is perfect for group lunches. I'm no bak kut teh expert, nor am I very particular about the bak kut teh I eat, so my indifference has always equated to an a-ok meal here. :) To be honest, I've never actually ordered here, as I've always depended on my colleagues who speak Chinese. If you know Chinese, I think it definitely makes the ordering process a lot easier.I'm always a bit embarrassed eating bak kut teh with someone other than my husband because I am an ANIMAL when it comes to eating pork ribs. I am amazed at how deft my colleagues are when they eat pork ribs with chopsticks.* I, on the other hand, have no choice but to get my hands dirty! Thank goodness they give us those wet napkins!Overall, this is an affordable place that keeps the traditional outdoor eating scene alive in super trendy Tiong Bahru.*If anyone from work is reading this, you can't say I never said anything nice about y'all!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "-yx14hRIhgTA9rCV-NuKmA": {
    "date": "6/7/2013",
    "text": "I like Bak Kut Teh, and back when I was studying overseas, I used to cook it using some really good soup-spice-packet style things, and letting everything simmer away for four long hours. I suppose Bak Kut Teh is to me what chicken rice is to most other people.Now, the Bak Kut Teh here isn't really the peppery sort, nor is it the herbal sort. WHAT SORT COULD IT BE THEN you ask?It's... the sweet sort. Ostensibly peppery, the pepper here is so mild that you actually get the natural sweetness of the pork coming through. For those of you who've had various Chinese-style pork soups (like, pig stomach soup for example), you'll know the sweetness I'm talking about.That's not bad mind you, some people like the milder, sweeter flavour of the soup.But it's not for me. I like my Bak Kut Teh peppery, with a zing. The other dishes are a-okay too, since it's unlikely you'll turn up just to order BKT.Peanuts, salted veg, youtiao, they're all done decently. The star here though is always going to be the soup, and the 'dragon ribs'.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "Q_iqaHiLYRt5W5Qh11IEXA": {
    "date": "5/11/2013",
    "text": "I'm not usually a fan of bak kut teh.. but after trying this, I wouldn't mind revisiting! I liked that the broth wasn't overly peppery, yet retained lots of meat flavor. The pork rib meat was also very moist and fell off the bone. Besides the soup, they also serve the full range of teochew side dishes. Definitely worth a visit!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yGnrudXEXUZ_nrKLKmHq9g",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore. Ice jelly lime honey drink",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yGnrudXEXUZ_nrKLKmHq9g/o.jpg"
      },
      {
        "img_id": "TctEn1ZZM97_AUWQRa4TYw",
        "caption": "Photo of Old Tiong Bahru Bak Kut Teh - Singapore, Singapore. Bak ku teh and side dishes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TctEn1ZZM97_AUWQRa4TYw/o.jpg"
      }
    ],
    "user_id": "xzK_JMVlLECDtAHZtViYsQ"
  },
  "CiqGCmgDMpCWOEwjyEpOGQ": {
    "date": "8/16/2012",
    "text": "This is usually a bit further away than where we usually go for lunch, so we typically save it for days when we're depressed, when a colleague leaves or when a new one comes in. This establishment serves up the white peppery kind, and there are two types of ribs available, the regular and the dragon rib but we usually go for the former option. Add to that a side of of stewed salted veggies and plain white rice, and you're good to roll. The soup is not always consistent - sometimes they are heavy handed on the pepper, and other times it can lean more onto the sweet side. The pork is tender with sufficient give at each chew, and the salted veggies and gravy are complement the rice nicely. Humble fare with homely food - while it's not knock your socks off awesome, it makes a great option for a simple lunch. The coffee shop does get very crowded, which only serves to attest to its popularity.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfJF7wNEYW53_h1mE21ztg"
  },
  "4X82-TrhRxryO6pAMQZ2Pw": {
    "date": "5/11/2013",
    "text": "I rarely go for bak kut teh, but this place wasn't bad. The soup was tasty, though I could have used a little more of the peppery flavor. The meat itself was pretty good and was tender. Overall, if I am craving bak kut teh, I will probably be back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FBn1SPQ_t2yzytf6KGnafg"
  },
  "ls_XbEarWJsVhHZuHV3k-A": {
    "date": "9/5/2015",
    "text": "The best Bak Kut Teh that I know of. The soup is just so good that you cannot resist the refill. Watercress with soup is very nice to have as a side.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmTEAZ1vxeaZBUNTiasbwA"
  },
  "Ch8thu_zMd8eqm-kOz-WVQ": {
    "date": "10/3/2012",
    "text": "Different from the usual peppery flavours. Milder and allows the flavour of the ribs to shine through. Worth a try.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6dsc7ibCyCJzPITbpzuNAQ"
  }
}