{
  "oPUlV-feqI96-GpOMUAwag": {
    "date": "10/24/2013",
    "text": "I've taken a lot of my friends here and am extremely fond of this place. For 8.50 SGD a plate for the Chicken Biryani & 9 SGD a plate for the Mutton Biryani, is a steal for the generous quantity that is served!Most importantly, the Biryani that is served here is of truly excellent quality albeit the taste can be a tad bit inconsistent at times. Sometimes the rice feels powdery & a bit dry but that was probably because of the weather. The key to a great Biryani is that the meat & rice needs to be slow cooked in traditional spices for it to be at it's juiciest best. That is exactly how the owner approaches this complicated & subtle dish.This is as authentic as it gets & it's NOT that brown goop they serve with yellow rice at most places which even the owner at Bismillah agrees is an abomination! Biryani was the dish of Mughal emperors & soldiers & signified feasting in a royal manner. It was considered a complete meal in itself & it is with that respect for tradition & flavour that the owner/chef Arif bhai cooks it. It is his love for crafting this complex dish that adds to the old school charm of this place in addition to the brilliant food. Try chatting up with the owner if you visit the next time, he's a wonderful gent with a well informed viewpoint on food & life...& throbbing passion for what he does.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1RVnBOq0xCCelu0QPcUjRw"
  },
  "3GJZoLb0aBNgxVT6es3pgA": {
    "date": "3/8/2015",
    "text": "Nice hole in the wall as expected. The biryani is a typical Persian dry version and was exceptional. What was troubling was the price, $15 for a plate of mutton biryani, was surely very expensive, and the mutton was not as good as the chicken. The little pot of yoghurt they give, is just abysmal and watery. The guys serving and taking orders have oodles of attitude which makes the place quite unfriendly to go to. I didn't find the Biryani, attitude and portions worth going again. I am still on the hunt for the best briyani.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dh5-CV0EYc8jckFs0YaXg"
  },
  "CplXNjhuq6k3ahUlE5xqYg": {
    "date": "11/12/2012",
    "text": "Still weary from our flight the night before we tracked this place down because of \"The Layover\" and you know what?It was damn good.Our first proper meal in Singapore did not let us down, thanks Anthony B. (I wonder if you have a secret Yelp account?)Anyways...A Lamb Biryani with a Mango Lassi on the side and I was in heaven. Perfectly floral and fragrant and slightly spicy to my Canadian tongue. It was exactly what I needed to get going.I had been to Little India 6 years before and vividly recalled the smells and colours that slapped me across the face on my own 5 hour Layover. What a gem. Once again you did not disappoint!Someday I'm gonna have to go to Big India though.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "UTzUG8exwDoHDW6V0BSE2w"
  },
  "QWmHLcxI7eA80olf1BPffw": {
    "date": "3/27/2015",
    "text": "No idea why this place can even be ranked above a 2.  Soggy rice.  Mutton is ok.  One side diluted white sauce no clue what that is.  Had lime juice that taste more like plum juice.  Horrible.  For those that give this place above a 2, i dare you to try Ali Nachia Briyani Dam and rework your review :).",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNraV5fC6-0m-kgF5P7hqA"
  },
  "UVwnEnU6PcCNM4PKkUK9Cg": {
    "date": "7/17/2012",
    "text": "Probably one of the best biryanis in little india....if you go at the right time. The ambience and look of the place is not the classiest for sure. In fact it looks slightly run down and you might have questions about the hygiene levels of this place. However no doubt, this biryani, both chicken and lamb are pretty solid. There's a trick to this though. You need to go at a certain time, which changes on a daily basis and can be luck oriented....it's when you get the scoop of the biryani that takes in the most amount of the masala that you enjoy this biryani in it's peak form. I recommend 330 - 4 pm for an afternoon biryani",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jgwofr-4H9fkrzsEyKlOig",
        "caption": "Photo of Bismillah Biryani - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jgwofr-4H9fkrzsEyKlOig/o.jpg"
      }
    ],
    "user_id": "T9aL7kkxRYJVkysnFPQefA"
  },
  "9WUsG0b9natTLw_G3bHhbQ": {
    "date": "1/6/2013",
    "text": "Quick stop here to try the chicken biryani. I had never had it before and it was ok, I can't really compare it to much else. I guess I expected a different taste? I can imagine finding better versions in this enormous city though. I was a little star struck by the owner, regardless. Also it was a gigantic portion so three of us split one and tried the lime juice and mango lassi as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yrWJ4YZWvFj_NDOvTRaAqA"
  },
  "6IUFPexsgHqvjnJfQtzoNw": {
    "date": "12/7/2014",
    "text": "Food was decent , nothing special. Don't expect customer service, not designed for patrons to fine In.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S9QXxgtKZhChdlFcTyFzJw"
  },
  "QWkDup7WZNByn9t_eHzrWw": {
    "date": "7/12/2012",
    "text": "Bismillah has been heralded by some food bloggers to be the 'best biryani'. It certainly is one of the contenders for \"one of the better biryanis in Singapore\" but it isn't the best.Many of the biryanis we would be used to here would be the southern kinds. Bismillah is different, serving a very northern style of biryani (and even then not quite a Lucknowi biryani... they're Pakistani). It's decent and it will fill you up, but I wouldn't say it was superb.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ml61UOrHtdUCwW0JcTM_Vg"
  },
  "UvPaae6V1ORg1A-0J4hngw": {
    "date": "7/30/2013",
    "text": "Having eaten the gold standard Indian biryani from Hyderabad, my food snob radar was on high alert while trying this place. I have to say that the radar stayed silent throughout the meal. The biryani was very good - by far the best I have had in Singapore. It was cooked in the Pakistani/North Indian style, and packed a solid punch of flavor, grease and meat. Would go down really well with an ice cold beer.Before I forget, the mutton biryani has a clear edge over the chicken version.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rvG8Lwhs28GftJA16f79Qw"
  },
  "L5gQD9nE0tidvrXbSjsgjQ": {
    "date": "11/27/2013",
    "text": "I know very little about biriyani (what we get in the US isn't that great), but I thought the mutton version here was awesome. A bit expensive for Singapore standards, but hard to complain given how good it was. Well spiced, super flavorful rice, and super tender mutton.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5KyVI3WXqOr79UVh-LjdA"
  },
  "wPfBDPYGwbq9scT6OZtNxA": {
    "date": "6/10/2013",
    "text": "Yes the place is dark, dinghy, and on a crowded alley - but I came there for the food. Great dum biryani - doesn't matter chicken or mutton. The boiled egg inside was definitely a +.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "K175l53A-ciYnt0xS_V4CQ"
  },
  "WG-_6cq_-X9ENK7TFenchA": {
    "date": "1/10/2015",
    "text": "I agree they offer very good Biryani. However, every meal and product has a right price. I will give five stars for mutton biryani. This is one of many casual restaurants and nothing was special. I am not in favor to pay $15 for one plate of biryani.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zj-J7PQ1WU8J0JR375hJag"
  },
  "o-OOU-im5eyA7Otc3-4SWg": {
    "date": "10/16/2018",
    "text": "Famous / Michelin recommended biryani restaurant. The biryani here is rich in flavor / full of spices. The chicken is soft and tender. The portion is big though they give way too much rice compared to chicken. Would prefer if the ratio is more balance.Very authentic according to my Indian friends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvGrSl1MoDlJrFamOGObEw"
  },
  "SJlmvQXRGheuPT1W8G6PhA": {
    "date": "7/20/2018",
    "text": "For a self service place saving money on a waitress this place is way way way overpriced and the food is very average.I had the signature dish, chicken biryani, it was average at best.I won't go back",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q9lJfKj9aln2TFcL2nSvOA"
  },
  "eNoI9HhBI1QaoBdsW0JKfA": {
    "date": "6/25/2018",
    "text": "one word.. WOW !! I am recalling this from couple of years back and still in my mind this is fresh!! I was in Singapore for 3 weeks and was looking for a good Dum Biryani.. Found this place on yelp and wanted to try it...Went all the way looking for it and must say when i saw it from the outside I was very skeptical.. This is what one says that dont judge a book by its cover..The biryani was amazing!! Hands down the best i have had in Singapore. Given the fact that I was not sure till i tasted it.. made the experience even better.. The rice was full of flavor and the mutton was so flavorful. I has few bones to suck on and that was amazing.. I read one reviewer mentioning that if you get from the bottom of the pan then you are lucky, and I guess i did get that as the flavor was  so good..   Can wait to get to Singapore again !!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tT8DUiIeRkI1dbwQa3TNkg",
        "caption": "Photo of Bismillah Biryani - Singapore, Singapore. Don't judge the book by it's cover!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tT8DUiIeRkI1dbwQa3TNkg/o.jpg"
      },
      {
        "img_id": "xdPqOcmlRhs8uDkpCjqhDQ",
        "caption": "Photo of Bismillah Biryani - Singapore, Singapore. amazing flavors in the mutton Biryani.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xdPqOcmlRhs8uDkpCjqhDQ/o.jpg"
      }
    ],
    "user_id": "zdQHVSZgD_xo-aMq3myR9w"
  },
  "8XFuzfeI2sfgK32jLPWVfQ": {
    "date": "8/19/2018",
    "text": "Delicious, flavoursome Biryani. Its pretty expensive for this dish - $20 each for a Biryani plus a drink - but you get what you pay for. The Lamb Biryani was succulent and rich, and the Lamb Chops excellent. Desserts were pretty good too - worth trying! Service was fast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3lDv8hW48mv-DtNlSVpTcQ",
        "caption": "Photo of Bismillah Biryani - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3lDv8hW48mv-DtNlSVpTcQ/o.jpg"
      },
      {
        "img_id": "kk2JO2LOHBNOPq3fiW9f9Q",
        "caption": "Photo of Bismillah Biryani - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kk2JO2LOHBNOPq3fiW9f9Q/o.jpg"
      }
    ],
    "user_id": "4-S7_R9du3GsIT7AwAv9ww"
  },
  "0X-w4JHz6cTujPkSII7YnA": {
    "date": "4/22/2017",
    "text": "It's all about the mutton soup and the kulfi here. And if you get biryani, get the mutton one. The chicken can be very hit or miss, and mine came out quite dry while some of the others had chicken that was more moist. Sometimes the biryani will come in a neatly packed dome shape, and other times it'll come a bit disheveled and shoved in front of your face. All up to your luck and their mood I guess.Don't expect much in the way of service here. It's pretty low-maintenance. You have to call over the waitstaff pretty insistently for anyone to come and help or serve you. Kulfi is a really interesting indian ice cream that's not too commonly found in Singapore. It's simply ice cream with some spices/pistachios in a little plastic cup. You have to rub it in between your palms to get the popsicle out. The ice cream also has various spices and pistachios sprinkled in it. Quite simple, but also quite comforting and refreshing; a great way to end the meal.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xyqnCAQsARyayfkl0dSNKg"
  },
  "-TLe5qnL2SaJPR0lwaA5sQ": {
    "date": "7/8/2017",
    "text": "Extremely overrated restaurant. Don't know what Michelin was thinking, while making this is a Michelin recommended restaurant. I came with my friend while traveling to Singapore and of all the biriyanis I had I was highly disappointed. However there mango lassi is good.Also sanitation extremely unwelcoming and dirty.Had : double kid goat biriyani, chicken biriyani, Haleem , chicken chapli kebab and mango lassi.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4xeChYqztJizFwqhv-lmA"
  },
  "9k9jmn2cmhiKG8D0WP449w": {
    "date": "9/1/2017",
    "text": "Anthony Bourdain was wrong, the Biryani was just so so. I would rather recommend Biryani at the Tekka market food court. The workers were friendly but they did not make you feel welcomed as they were all busy with their cell phones. What happens to the mamak people used to rule the Biryani world?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RObwLPbOlpYnW5H-P70TzA"
  },
  "XJIDOkfoYVuExdXsUzdo_A": {
    "date": "8/28/2015",
    "text": "This place is all hype. Food : 6/10, I got the baby goat biryani. I've had better for cheaper. The white sauce on the side was watery. The meat itself was tender and tasty. The rice felt old. Service: 1/10, I felt pretty unwelcome honestly, like it was a burden for me to show up for lunch. Was not handed a menu, offered a drink, or asked how I thought the food was. Fuck that grumpy old man. Price: 2/10, rip off. This guy is still riding the \"Bourdain visit\" train. And I fell for it. Ambiance : 2/10- the place is dirty and gross. I should have just walked out and tried some place else but that thought of \"if Anthony Bourdain liked it...\" Kept creeping back in my head. Avoid this place, trust me. You're not missing anything. I regret wasting a space in my stomach and money  from my wallet on this place.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F0Kwh48Ehp83QT-jZmAomA",
        "caption": "Photo of Bismillah Biryani - Singapore, Singapore. Yesterday's rice.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F0Kwh48Ehp83QT-jZmAomA/o.jpg"
      }
    ],
    "user_id": "d5BpyRtd03vpxguCa8NmFg"
  },
  "04XEXEMzkDtcFoNqYRT_ag": {
    "date": "6/4/2015",
    "text": "Came here about 8pm on a weekday night, to grab takeaway of mutton briyani. I would not recommend eating in as it can get pretty hot, and the fans within don't do very much.Mutton briyani, $15 - worth it?The style of the briyani is the dry kind, with the mutton cooked within the rice, and some raita is provided. The rice is well-spiced, spicy, aromatic, but can be slightly mushy in some parts from meat juice, and for $15, there was sufficient meat within, and not too much bone. Meat is tender and comes apart easily. I am just unsure if it is worth the $15 price tag. I'll return if I happen to walk past.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SBVNVima7JWeA-6TXVvJbw"
  },
  "Qf3dquJXxHUOEzeFyPPMHQ": {
    "date": "11/28/2016",
    "text": "I've been going here for months. It is hands down the best dum biryani in Singapore. If you don't think so, then you need to read about what dum biryani really is. A lot of people recommend the biryani at Sankranti, and, while it's a decent biryani it's not a dum biryani. The meat here is tender and the rice fluffy. They cook the rice in two batches fresh everyday, so come early to have the freshest pick. Don't expect a restaurant with amazing service, this is a no frills place where emphasis is put on the food. Biryanis are priced appropriately. If you're going to eat a fish or a vegetarian biryani then don't bother.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLaOVAM3oyFwTNsZvdsaxg"
  },
  "CaJEUlx89pIMP8C7Lsz75w": {
    "date": "8/30/2015",
    "text": "The decor makes it feel like a construction site canteen,there's usually a queue,you won't be greeted nicely (if at all),if you get served, someone has just done you a favor.The whole place is as auhentic as it gets, and it serves what is undoubtedly the best briyani in Singapore. (To qualify this, I'm a North Indian)The flavor (like the ambiance) is authentic, the meat (lamb & chicken) is very tender.Skip the raita (watery yoghurt accompaniment)I'd recommend you SMS a pre-order for take-away/pick-up.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rjd4R7zjvD5Gn7DNzu45nA"
  },
  "24cmtrUWPcUtTSFF3ykSbQ": {
    "date": "8/5/2015",
    "text": "Was a bit hesitant due to all the Bourdain hype and even more so after seeing all the reviews from Singaporeans about how it's not all it's cracked up to be. However, after trying the chicken biryani, I have concluded that the bad reviews are coming from Singaporeans that are used to their own version of briyani(which has its own separate appeal), that's covered in curry/gravy. This type of biryani is completely different. No need for the sauce, all the flavor has been soaked into the perfectly cooked rice. The server wasn't there to please, but when the meal came so quickly, I didn't mind at all especially after my expectations for the meal were exceeded. I'd probably give a 4/5, but I think some people harshly give 2 or 3 stars for arbitrary reasons that have to do with things other than the quality of the food, like their ego. 5/5.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-T-QGRkLsFGfoW4b_N0Y9Q"
  },
  "mv5JOIe9HJm9CKmd3j8hBA": {
    "date": "12/30/2015",
    "text": "Coming from the US, I have been pretty disappointed with the typical dum biryani found commonly here in Singapore. This place, however, has the best biryani I've ever had hands down, let alone in Singapore. Both the chicken and goat biryani were delicious. The rice and meats were fresh, moist, and flavorful.The place itself is pretty run down (and not in a charming way) and the service is mediocre, but who cares when the biryani is this good!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tC_XsZuOjUHMhwvQyT-8Q"
  },
  "FP8_ocIAjsmm4DAM9xXw0Q": {
    "date": "7/12/2017",
    "text": "Overrated on many blogs, but reviews here are generally accurate. Average food, not a great place for a meal. Skip it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "03FwU4BcyHJnft4uVlx9NQ"
  },
  "4jT7bu_2a6kXiPWcxlRQlA": {
    "date": "9/18/2016",
    "text": "Really flavorful biryani. The signs on the wall boast that they don't serve sauce with their biryani and you really don't need it! We ordered the chicken biryani, the chicken was tender and had a nice little kick. The only complaint is that it had whole cloves in the rice, which added to the flavor but we're difficult to avoid when chowing down (however I will chock this up to my American tendencies). We also ordered the mutton kebab which was juicy and delicious - totally melt in your mouth. Pretty spicy, but cooled down really nicely with the green sauce provided.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T9PXjL4PxIpimr18yE4Wog"
  },
  "o-grD1NmUlFutMquHyEUPg": {
    "date": "11/26/2015",
    "text": "I agree with Sean B. It's all hype. I've had better biriyani for cheaper. The rice was half cooked & the sauce was watery. Don't expect any customer service cause you ain't gonna get any. Moreover they make you feel like they are doing you a favor. Food quality : 5/10Customer Service: 1/10Overpriced: hell yes",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBLrC41QUa9mfMiqORA1eg"
  },
  "FSkTmbuy1ijIyNkORdIGYg": {
    "date": "7/22/2016",
    "text": "Over-rated. And very bad attitude of the owner. He was upset that he got mentioned in the Michelin guide as now he will have to serve more customers. It was shocking to hear that from a business owner. Their Biriyani and shaami kebabs are at best, ordinary. Don't know how they got mentioned in the Michelin guide. Similar sentiments have been expressed by my colleague. In fact, try the Biriyani at Sankranti on syed alwi road. It's much better.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4b7-0k0XBiZwRbRgs4AZA"
  },
  "fPaVAo8IiNjnlAotrjUZsA": {
    "date": "9/23/2015",
    "text": "Followed Anthony Bourdain's review of the famous dum biriyani in Singapoe. The place could easily be missed as its a very small small shop on Dunlop Road. We had Chicken Dum Biriyani and Mutton Dum biriyani. Both were very delicious and fulfilling bit spicy but that's ok :). As it was a weekday evening there wasn't much crowd and hence the staffs were quite accommodating and friendly.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "daTXfN05GtMWsv-eD-PZNw"
  },
  "8ooRJbYD4Tz4EhAbGkdSuQ": {
    "date": "12/11/2016",
    "text": "Very average. 31 dollars for a Mutton briyani and one chicken briyani. With 3 drinks. Went with a Friend based on reviews from others nothing special and very expensive for what it is. Have had much better food at nearly every hawker center in Singapore.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EhXwYDnkkjLDeWY0yqr8A"
  },
  "GITXVtrWCdAby0RaCiAYdg": {
    "date": "12/6/2013",
    "text": "The place doesn't look so hot - the shophouse is a bit rundown. But the dum briyani is the bomb. The rice is fluffy, aromatic from the spices and entirely greaseless because the owner cooks with safflower oil rather than ghee. Happy me cos then I can down the whole plate without feeling like I swallowed a rock but carbo-phobic eaters might wanna avoid this place cos like all briyani places they're generous with the rice. The chicken is tender and fall off the bone.But what the aficionados go for is the mutton and kid goat briyani. The latter is only available on certain days but the portion of meat is super generous for $15. I'm scared of gamey meat, but my foodie friends swear by the mutton and kid goat, so next time I shall drag them along and pinch some off of them to try.The lassi is fabulous - rich and creamy, and not sweetened to tooth aching levels. I'd advise going early cos when we went at noon place was full and a queue was already forming. And the owner said forget it during fasting month cos the queue starts at 5.30am which is when he starts cooking the briyani!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wuRI6NhRB6cUWERRmcvOMQ"
  }
}