{
  "1TIDQrQB6uktKREeGmjPCw": {
    "date": "12/9/2014",
    "text": "This place is incredibly overpriced and disappointing. The margaritas taste like there is no alcohol at all. We had a waiter that invariably pointed us towards the most expensive things on the menu. Our meal for three was over $500.The Mexican chocolate dessert was decent though.Paul has a review which is currently \"not recommended\" that says it all better than I could. I would have given this two stars if I didn't think it was so overrated at present.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "ptxbCPBgyE_SChr1eIhbWQ": {
    "date": "8/18/2015",
    "text": "Grasshoppers in my food! why???First off, this is a restaurant with great decor in a beautiful setting within Chijmes. Major points for that. Service was good too, no issues here and found the staff to be pleasant. Overall the food was tasty too. Not the best tasting ever but on food taste merits, would be worth another visit. What bothered me most was the fact that they put grasshoppers in my order of Guacamole. I respect that grasshopper is found in Mexican food as a delicacy but if you are going to put bugs in the guacamole, please disclose that on the menu before I drop $18 on it. The menu clearly says: Guacamole - Pico de Gallo, Tortilla Chips $18. Why would i expect to have grasshoppers in my Guac if it was advertised as \"Guacamole, Pico de Gallo and chips\"? When we questioned the wait staff, their answer was \"because it's Mexican food\".I'm from California where we eat our fair share of Cali-Mex and I've never had or heard of grasshoppers in Guacamole. I understand it's a real thing, and that's totally cool, but friggin' disclose that REALLY important ingredient on the menu!I also got the Chicken Mole dish ($34). It was comprised of a chicken breast dropped into Mole sauce. They didnt even bother to put sauce over the chicken, let alone slow cook it, mix it or marinate it. Literally just chicken dropped into sauce accompanied by Chinese/Thai style rice...We also got the corn on the cob. I was expecting some Nacho Libre style corn with the white sauce and spice. We got baby corn on the cob instead. I must admit that the donuts that came with the corn were the bomb. those were extremely yummyWhile the atmosphere was cool, we felt the food preparation was very underwhelming and expensive!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m1ZkT10ggXZSgWE6qFAGKQ"
  },
  "AlQzkBgfRWrIr2B2QLoSew": {
    "date": "6/22/2015",
    "text": "This restaurant is nothing like a Mexican restaurant. The decor is very posh, which is nice, but doesn't really go with the theme. When asking if they had rice or beans the waitress replied no. When I asked her what kind of Mexican place doesn't have rice or beans, after stumbling a bit she, she replied.\" Well it's sorta Mexican-French Restaurant.\" Wow. The portions were tiny except for the steak burrito, that was a decent size. The taste was just ok. Each entree, which was the size of an appetizer at any other restaurant, were bland. The Carnitas were salty and the duck tostadas ha! You can forget it! Cute place, nice passion fruit margarita but other than that don't waste your money! It was too pricey for the bird food they fed us. Pretty disappointing:(",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "T083fWYAGe2qwPJL9V5EGg",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Duck Tostada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T083fWYAGe2qwPJL9V5EGg/o.jpg"
      },
      {
        "img_id": "-lKCTNfY12u4OeKP35gm0Q",
        "caption": "Photo of El Mero Mero - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-lKCTNfY12u4OeKP35gm0Q/o.jpg"
      }
    ],
    "user_id": "cIdh1PWm1hJubfrNBU6T7Q"
  },
  "Ly6p-AXjaOBU63d_h1pjvQ": {
    "date": "4/25/2015",
    "text": "We had a late dinner here on a Thursday evening.Chijmes is generally not the place where you'd want to go for a quiet, peaceful dinner, and boy was the place busy for what naive me thought was the end of a regular working day. The operators of the various eateries at Chijmes seem to be engaged in a fierce competition of who can play music loudest as part of their campaign to astroturf maximum amounts of fun to the venue, and the result is that in most venues you hear the soundtracks of at least three other places plus live music and can generally not hear each other talk. Unless of course, you scream at each other and add to the overall cacophony. Not exactly romantic.Yes, you could argue that if you're a claustrophobic, crowds- and noise adverse kinda fellow, you should just stay away from Chijmes altogether. Point taken. But if you now are one such fellow, and happen to get stuck there hungry and desperate, then maybe... After some wandering we were relieved to find that El Mero Mero had a nice, non crowded back room where the music of the other eateries was not quite as audible and we could discern the beat of what came out of their proper loudspeakers, and better even, we could actually talk to each other, one or those totally underrated activities it seems these days, where a 'fun night out' often gets equated with blood coming out of your ears on the cab ride home.So, long story short, they get points for a bit of good old fashioned privacy and peace in an otherwise rather caustic, crowded environment. But now to the stuff that matters: The staff was friendly and attentive, we got taken care of promptly. But do double check the bill before you pay - we had an extra dish on ours and almost didn't notice.The interior is nice and cosy, the usual interior designed eatery experience, old bookshelves with Mexican sounding books and the works. Not exactly a fireworks of novel ideas, but providing a good ambience for some nice enjoying of foods.They feature a small selection of Mexican beers, the usual suspects, but also smaller breweries I never heard of before. The usual north of $10 beer prices are to be expected in a place like this. We're supposed to be sober at the office tomorrow, after all. If you want to get hammered for cheap, surely there's a kopitiam nearby.I went with the carnitas tacos, and they seemed just about right, like what I remember they were from the taco trucks in LA. Except, of course, the ones from the truck were $2.50 apiece, while here three are SGD 26. It may sound shocking, but I'd almost say that's an acceptable bonus for foreign food, and a peaceful ambience.All in all, a not un-recommendable experience. Not the most uniquely original place in the world, but you can't really blame anyone for not experimenting too much in a locale where rents surely must be astronomical. So, give them a chance, and they get three stars, which is to say: good, but not awesome.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xN45eOPGBfuLr1F5beq4VQ",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. The room in the back where it's a little quieter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xN45eOPGBfuLr1F5beq4VQ/o.jpg"
      }
    ],
    "user_id": "8uhSaRacb0fkPxe4re4StA"
  },
  "PYDmm4849i-D4PO7h2Zdjg": {
    "date": "2/15/2015",
    "text": "Ok, so I went there 3 times, before, and last night was the only time I ate there!Previously, the prices scared me away. I mean, for mexican food, it's expensive, and how premium can the dishes be, using the traditional ingredients?It was in all honesty, a little bit of fusion, like 20%, and the portions were just perfect, but it was expensive. The only exceptional dish was the chocolate dessert, but most places do it well.I really don't know what to say. It's in a premium place, and it's commanding palatial prices, but the food is essentially mexican, which is as basic a cuisine as possible, and then it tries to be fusion-ish.I've no reason to return.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KxvJJTsFqDKnuXYXO4tyog"
  },
  "7jb6YEfBotkrZZprztKlnA": {
    "date": "10/9/2014",
    "text": "My wife and I and our 2 daughters had dinner at El Mero Mero. To begin, we ordered a pitcher of margaritas... I drank 4...no buzz at all. My wife, who is extremely sensitive to alcohol didn't turn red (she's asian and sensitive to all alcoholic drinks). My daughters, likewise felt nothing. There could not have been very much tequila in that $54 jug... bad start.Then, we ordered the \"salsa sampler\" for $14. What came out were 5 large tortilla chips and about 8 tablespoons of 4 different sauces! Then, I ordered the Veal Sweetbreads. They were served slightly pink inside.Next our main course. My youngest daughter ordered the beef fillet taco with bone marrow - $45.00. The beef was overcooked - it was dry, and tough as shoe leather. The tacos were soft, not hard as expected.I ordered the beef burrito - that came served inside a plastic bag with a bunch of taco chips thrown in! The beef again was overcooked and tough, although the burrito had nice flavour otherwise - Damn, for $29 it should have rolled off my tongue bouncing with flavours. Not quite...and the taco chips??? Very strange presentation, as there were no salsa or Guacamole to dip them in.My wife ordered the Carnitas. That wasn't too bad, but for $32 it should have been outstanding.My oldest daughter ordered the Enchilada Suiza and she hated it. The sauce was quite sour - a waste of $28. We ordered a portion of guacamole for $14. This was beautifully served in a stone mortar, but while rich in avocados, was badly underseasoned to my taste. Not spectacular. It was also served with what looked like roasted crickets... yuch!We decided to take a pass on dessert after all of our experiences and disappointments.The menu while extensive is perhaps badly worded, as very little that we ordered came out as expected. I've eaten a LOT of mexican and Spanish food and I was very, very disappointed.The bill came to $280, but the worst was yet to come. About 3-4 hours later I began suffering from diarrhoea, cramps, and intestinal gas. That lasted all night Saturday and Sunday. I couldn't look at food again until Monday. I'm sure it was something I ate at the restaurant as I had fasted for 28 hours previously... no food at all.And, that's another reason I think the margarita's were very short on Tequila... I had an empty stomach, and should have felt a buzz after drink #2...nothing even after 4 drinks.I was really sick. I suspect it may have been the sweetbreads as that was the only dish we did not share.In retrospect, the filet was suspect, the sweetbreads possibly badly stored or prepared, the beef otherwise all overcooked and tough and the margarita I think was watered down or weak.I would not recommend this experience to anyone.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "L-ZddnpGzdffR30Lf8k-Ew"
  },
  "JVrinaW_5DVMGWlSL3-fhg": {
    "date": "12/14/2015",
    "text": "One of our Singapore faves and we often bring guests. Proper classic margaritas and a couple of other interesting cocktails (one that is something like a mango lychee habanero martini) service is consistently friendly and knowledgeable. Orlando always participates in service and says hello. The El Mero Mero ceviche (ceviche served in a Bloody Mary mix) is a light, tangy must - have starter. We've tried most of the tacos. The fish are hands down my fave. These serves are on the small side but perfect if you had starters and might want to share dessert. Skip the dense, doughy churros. Totally have the pecan pie, tdf .",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LcW3-e6vlSOcBkpPaGxO7w",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Tacos... I don't think the goat are on the menu any more",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LcW3-e6vlSOcBkpPaGxO7w/o.jpg"
      },
      {
        "img_id": "D8wYsW_3naTF8mRIZAZ8qg",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. El Mero Mero ceviche",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D8wYsW_3naTF8mRIZAZ8qg/o.jpg"
      }
    ],
    "user_id": "qrJihVA5aJhbEc6LEQmUQQ"
  },
  "7n8PU1wmSz0HnU-c14fBcA": {
    "date": "6/13/2015",
    "text": "Ambience was nice, really trendy with an open kitchen.  Highlight of the meal was prob the appetizers: guac and chips, salsa, and grilled baby corn (REALLY good). But $16 for guac that doesn't have any special is pretty pricey.  The beef burrito and the vegetarian & carnitas tacos were mediocre. We ordered four desserts (chocolate, rice pudding, pecan pie, pineapple) but the only good one was the braised pineapple. Service was ok, nothing good or bad stood out. We most likely won't go back for Mexican.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7HTWYD8pEjHcYTvK9yoVwQ"
  },
  "PqZpEo8vEmmZ-0-BhEEyFg": {
    "date": "10/27/2015",
    "text": "I don't know why this has so few stars but I really like this Mexican restaurant. My future sister-in-law is Mexican and like from Mexico herself and she was the one who brought me here first. They have very good tequila cocktails and I love their food! She says the chicken mole is super authentic. I came back a second time with another friend of mine from USC before we went to bible study and we had three different tacos each - one beef, one chicken, and one fish. I highly recommend the beef and chicken. The staff recommended the fish. I am a beef and chicken kind of person, not really into seafood, but we devoured all 3. I remember it was on the pricey side and the restaurant was not super full, but we went for an early dinner 6pm and the first time I came for Sunday brunch before I had to fly off. More packed on Sunday. Less packed at 6pm. But I like this place and I'll go back with people that can afford a little more to pay for the ambience and the food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PK5NTAjdVY9mPdtwU0Ve3Q"
  },
  "lBSH99AqU3-xXptkUWlHZQ": {
    "date": "6/20/2015",
    "text": "Service was non existent. Food tastes good but very over priced. Go to Cafe Iguana.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a6trKy_55YukMIAE3r_9Ww"
  },
  "7utFr7AhRb8DLVXLucCTOQ": {
    "date": "6/4/2015",
    "text": "Overpriced, teeny portions, bad service (we ordered the roasted lamb main, and the tacos arrived after we finished the meat. And even before we finished that, the waitress was impatient to clear the plate). Overall a sad experience. Would have expected a lot better with the beautiful ambience in Chijmes.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0PVywTipWyR9BOk9prmC6g"
  },
  "M1u6I_QkoMxjh93tikL6QA": {
    "date": "12/17/2017",
    "text": "They defiantly have a new chef. The food kicks ass.  Had the blue fin tostada.  Full of flavour and super fresh. Balanced!  Wild fish was fresh. And for a non seafood restaurant they worked that fish well.  Suckling pig.  Can't compete with Chinese suckling pigs. But the mexican version was yummy!!!Now I thought the desert menu was average.  Damn how wrong was I.  We got the tequila peacan pie with cinnimon icecream.  Defiantly one of the best deserts i have had for a while. Well done meromero! Thanks for the wondeful evening.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hz4u_UfEv9m8N-faNcgznA"
  },
  "2jbPs1XanGQksLNHPtwdZA": {
    "date": "6/7/2016",
    "text": "We wanted to seek out a great Mexican restaurant and found it we think we had! We started with:Guacamole - chunky yet creamy that went superbly with the red and original nachos. It was Taco Tuesday today so we whacked only the taco list! We ordered:Kurobuta Pork \"Al Pastor\" - caramelised slice of pineapple with strips of pork. I found the pork rather mild in flavour and quite Asian tasting. Ok tacos. Roasted Dorper Lamb - burnt chunks of onions and other wonderful something with slices of grilled lamb. This one is very good!!! Grilled Free-Range Chicken - spicy popcorns are added in this taco but not that you can taste it. The grilled chicken chunks were really good! Not as good as the lamb but very good still. NZ Angus Beef Tenderloin - this! THIS was the star of the night! The seared slices of beef were SO good!! Biting into the burnt fats were just flavour bursting in the mouth! Wow wow wow!!! I could eat this everyday and twice in Sunday!Excellent meal and service is good! Definitely a come-back-for-more place!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MBNB7B5B4lH-I2QhbmttcQ",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Lamb Tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MBNB7B5B4lH-I2QhbmttcQ/o.jpg"
      },
      {
        "img_id": "zPHsMk3CMqhL_QmFjRsc1w",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Beef Tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zPHsMk3CMqhL_QmFjRsc1w/o.jpg"
      },
      {
        "img_id": "ux3Z-IpI2Q9OFroPztHCgQ",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Chicken Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ux3Z-IpI2Q9OFroPztHCgQ/o.jpg"
      }
    ],
    "user_id": "t5XN2Lmv_VeXRSw9YdGf_w"
  },
  "KvnhJFVTKR_nT3h17SNVPQ": {
    "date": "11/13/2016",
    "text": "Long overdue update to my previous review! I was last here years ago.Overall: 4 stars with the Entertainer App deal, 3 stars without because it is Pricey. If you have the app, definitely try this place out. My 3 friends LOVED the place. If you don't have the app, I'm on the fence. Go if you're absolutely craving good Mexican food and want something fancier-looking. Else go for Belmonte Latin Foods.We paid $75 for 4 mains thanks to the app! The waitress said we could use the promotion for anything (including appetizers and desserts) below $30. Portions are decent - 4 mains for 3 of us (our last friend had already eaten) was too much, although I wonder if 4 mains for 4 people might have been too little. Probably about right if you're not huge eaters.Grilled Wild Fish Tacos ($28) - 4 starsPretty solid good fish tacos.Creamy Green Enchiladas (Tiger prawn) ($28) - 3 starsMy friend loved the enchilada sauce, although I thought there weren't enough prawns and the (corn?) taste of the enchiladas was a bit too strong.NZ Angus Beef Burrito ($29) - 3 starsDIdn't have much of this as I was pretty full by then. Nothing special, and the beef was a bit tough but the dish was cold by then.Roasted Poblano Pepper ($26) - 3.5 starsWe loved that it was stuffed with grilled corn! Expensive dish for a pepper though.Unfortunately I'm not as much in awe on my second visit, and I suppose it's because I've tried Belmonte Latin Foods (another plug for this humble down-to-earth and reasonably priced cafe). So I'm not jumping at the next opportunity to return. But if you're in the area, want fine-dining Mexican food for a fancy date, want something different from your usual food-truck burrito and taco, or have the Entertainer App, hit up El Mero Mero.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-16ryk-5pdzUs_6cI_5aw"
  },
  "BCeU9z5ZeRvp6Jt333rGLA": {
    "date": "3/30/2018",
    "text": "The food was decent and the atmosphere was great. We had the tacos and octopus, and enjoyed our meal.Worth a visit for good Mexican!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQ6MAHSW4jTAzGRUvio1yA"
  },
  "2vG3DxP71sdZrG4xcEXzFQ": {
    "date": "7/24/2018",
    "text": "The tacos were yummy but very overpriced in my opinion as the portions were incredibly small.  Nobody greeted me at the front entrance and the staff wasn't super nice.  Prime location in front of the church but they need do a better job of greeting customers and serve more food for the prices they charge.....",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5zCwwfMn0t8ncxF90xAT1A"
  },
  "Srd0g4xB3DtrrgL9ojahOg": {
    "date": "6/30/2017",
    "text": "Worst food ever. $18 for something they call a cerviche that is not only non edible and a massive ripoff. Avoid this place look the plague.Can I give this place zero stars? Or negative stars?Just look at the pic of the cerviche..Worst place ever.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WGXzvYVJ1lLVXn8PgJOhHw",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. This is what they call a cerviche for $18  It is not edible and a total ripoff.  Avoid this place.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WGXzvYVJ1lLVXn8PgJOhHw/o.jpg"
      }
    ],
    "user_id": "vykrqBR-52eovfPlLpwWyw"
  },
  "8M029tu77BqaXvk_mJgoLA": {
    "date": "1/8/2018",
    "text": "Was initially hesitant to try this place after reading the bad reviews but some folks in our party wanted to try so off we went. I was surprised by the food quality -- the tacos were excellent, ceviche was good and desserts not too bad. Despite the empty restaurant and many waitstaff and front of house folks milling around, service was dismal. The waitstaff could not speak English, had trouble keeping orders correct (wrong food served). Not sure that I will be back as tons of other food options around.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Fo5D5l8DsROK6roOgZCeQ"
  },
  "WL5ChNUhcLC9eTmH9XNSfg": {
    "date": "10/30/2017",
    "text": "Disappointing. The Wild Fish Ceviche was boring and bland. The classic green enchilada was also bland and a paint-by-numbers affair. The street corn sampler was the only winner here. Others at the table who ordered tacos were also disappointed with their food. Overall a completely \"meh\" dinner and definitely would not return or recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-d_m8Fj1zFJx1O7UjTP8Q"
  },
  "DHBvgdaO6UXHnofGzGK7vA": {
    "date": "11/5/2014",
    "text": "Mostly Mexican favorites dressed up to cater to the high-end crowd, with \"high-end\" prices to match.El Mero Mero replaces Señor Taco and is owned by the same guys. In the open kitchen, I saw that the restaurant came decked with the latest in high end cooking equipment. Josper Grill ($30,000)? Check. Sous vide machine? Check. Vertical spit for the Al pastor grilled meat? Check.Everything from the pulpo (octopus), carnitas to the chicken mole was immaculately plated, an upmarket rendition of humble street food and home-cooked favorites. The carnitas were not overy dry, and the mole had some depth of flavour but the sauce was rather thin. The rice reminded me of chicken rice.The flavours were not too far off mark and the desserts were actually pretty good and rather creative when they rolled around. To put things in perspective, food's okay, but not mindblowingly amazing.The pricing still drives me nuts. How can such simple food and ingredients warrant such prices? I gave up on ordering alcohol.I'm undecided. Years of living in CA means you kinda sorta know your Mexican food. It's good, but not that good to part with that many dollars for your dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-EfYvIFUMBiDq7xx9T_48w",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-EfYvIFUMBiDq7xx9T_48w/o.jpg"
      },
      {
        "img_id": "xzdlV_u_SAwWiy-nOhJAFQ",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Open kitchen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xzdlV_u_SAwWiy-nOhJAFQ/o.jpg"
      },
      {
        "img_id": "A-5CyX_2RRv2AdeLUtmUdA",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. Crepes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A-5CyX_2RRv2AdeLUtmUdA/o.jpg"
      }
    ],
    "user_id": "SzJ3Fcmj_qFTI5_JrMhZEw"
  },
  "X2K2k-zS5NRdvggadEfh3A": {
    "date": "8/16/2016",
    "text": "Pretty decent mexican fare in Chijmes area. Were already one dinner down so had just stopped for the appetizers to top up our hunger! Got the guac and chips which were tasty and the cheese stuffed rolls in the green salsa sauce which was nice too. They also gave us a complimentary avocado and cilantro shot which was superb! Might go back there for the food sometime!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ymiohz-DlNLHGAlXbVhw5A"
  },
  "KXxOgdo7xMtAt-B-6h-p1Q": {
    "date": "8/16/2016",
    "text": "Got to know this Mexican place in gorgeous Chijmes. I somehow feel duty-bound to review every Mexican place I visit in Singapore, so here it goes.In Chijmes' lush and posh setting, El Mero Mero is quite visible, and appears to be fairly busy. It's a comfortable place to sit outside in the evening and sip on nice, cold, light Mexican beers (once you take off that annoying lime wedge), or some good (and overpriced) tequila or mezcal. The best thing is they don't have any of the stereotypical \"Mexican\" imagery most Mexican joints have: no skulls, no hats, no horrible ultra-vivid colours, no fake moustaches, aztec warriors, mariachis or \"mi casa es su casa\" signs (believe me, nobody in México ever says that). If only they got rid of those lime wedges.We tried a few of the tacos they offer as starters. The grilled chicken tacos were superb, and so were the veal tongue ones. I also tried a shrimp taco which had a  surprising hint of coconut that made it sweet. I'd never had a sweet taco before, and I must say I liked this one.The usual question I'm asked is if the food is \"truly\" Mexican. I must first say I don't believe in such thing as purity in food. But I must also say there are a few basic rules that define dishes. When it comes to tacos, the basic rule is they must be wrapped in tortillas, be it corn or wheat, taking for granted that tortillas are always soft. There is no such thing as \"taco meat\", \"taco sauce\", or \"taco shells\" in Mexican food. So, having proper tortillas, anything can be used to make a fine taco. The guys from El Mero Mero understand this, and they make very good, creative tacos with some unusual ingredients such as coconut or even pop-corn garnishes.We also had a decent guacamole and some interesting, but not that good, huitlacoche donuts. We were disappointed by their famous churros, which were very dry. Service was good, but they should stop bringing mayonnaise in toothpaste-like tubes and saying that is \"how it's served in México\" (the waitress' actual words), because that's not true.El Mero Mero offers inspired, creative, modern Mexican food. Purists will dismiss it as \"non-mexican\", which would be unfair, since the basic rules are being followed. I will come back to try their mole. If they get that right, they can get most Mexican dishes right. I'll have to save it for some special occasion, though, since El Mero Mero is awfully expensive, and that is their main flaw.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AbfS_oXF8H6HJb5jFqhrLw"
  },
  "Arkcaln-Y2K-jSCxU-o7ig": {
    "date": "7/3/2017",
    "text": "What they have done to Mexican food is criminal. Portion so small. Price so high. Unit economics make no sense. Sad! Apologize!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3UeOW3VDrvwGZKbKHQy8A"
  },
  "qhfyvwc_0CdhUtWi3Tc0-g": {
    "date": "8/23/2016",
    "text": "A pretty decent mexican joint here in CHIJMES. The al fresco area is pretty nice but may get slightly rowdy if the neighbouring restaurants are having events. It's best to come here in the evening to avoid the scorching hot Singapore weather. Onto the food review. We ordered some burritos and tacos. The burritos were delicious with a rich sauce and rather generous fillings. The tacos on the other were rather disappointing, especially at that price point, as it tasted rather like your average fast food outlet tacos. Service wise, i noticed that some of the staffs were very welcoming and nice which is a nice plus point. But others were rather unresponsive, which led to wrong orders and whatnot. An improvement to the srvice would be highly welcomed.Overall, el mero mero is still a pretty decent mexican resto here in Singapore (especially since Singapore suffers from shortage of any mexican resto) but its steep prices may be unappealing to many.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ji8g8h3pvQTvID2HLNBuaw"
  },
  "uW5kF8Opslhtqtshwq9WgQ": {
    "date": "11/17/2016",
    "text": "Rude staff, overpriced and poor quality food. Avoid avoid avoid!Staff and management are just plain rude for no good reason. Tacos are $28++ for 3, and itty bitty small. Everything else is sub-par.There are much better Mexican places in this city - let this one die a quick death and close down.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyiSA0yxVGN8zSRaYHoyMA"
  },
  "AlFMS785rW_E0oY4CvUAaA": {
    "date": "9/23/2016",
    "text": "Wasn't expecting much as my impression of Chijmes is that of a tourist trap, but I was pleasantly surprised by El Mero Mero. We had the fish tacos, chicken tacos and a ceviche. Ingredients were really fresh and tasty, although the avocado could have been a bit riper. Service was attentive and on point. Will be back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "_bLxDZVFm_fW5W45P6l5AQ": {
    "date": "7/9/2015",
    "text": "A Mexican restaurant with a touch of loveliness.The experience was amazing; from the interior to the plating of the food; to the fantastic team and last but not least, the food. I've tried a couple of dishes and one of them that I will definitely recommend is the Tenderloin & Bone Marrow Tacos. The only sad part is that I don't have enough stomach space to try their dessert. Though it's more fancy than I actually expected, I love every bit of my visit there. I'll definitely come back for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Qz_jirJFiS1MZWuaUrAg2A",
        "caption": "Photo of El Mero Mero - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qz_jirJFiS1MZWuaUrAg2A/o.jpg"
      }
    ],
    "user_id": "Jd4LuJ2nCNBMayehLhhL4w"
  },
  "Nba1dORZ_mdEicEEYyhA9g": {
    "date": "10/13/2015",
    "text": "This was pretty disappointing. I definitely advise sitting inside as the atmosphere is impressive and nice. I was wowed walking in by the open exhibition kitchen, bright lights, white counters, well dressed staff. With the rest of the atmosphere around I was excited for dinner. Unfortunately the rest of the experience did not match the atmosphere. It started with the service, when we flagged someone down they were so unsure and soft spoken I thought they were just bus staff not actual waiters, nope they are the actual waiters, and they are all unsure and soft spoken. You have to strain to hear them, and when they deliver food you have no idea what they are saying. I don't know if they are unsure of the pronunciation or if they don't want to interrupt, but it is always a guess as to what they are bringing out.The food was also a disappointment, Tapas sized, Mains priced. The Street Food Corn Sampler sounded so promising, but it is actual baby corn, that vegetable that comes in American Chinese food everyone leaves out. The seasoning on the baby corn was good, but the actual \"Corn\" was, as always, disappointing. Serve real corn. The Huitlacoche Donuts on the sampler were a pleasant surprise, these would be worth ordering on their own, Fantastic. The rest of the meal was small bites that had some flavor but nothing fantastic and nothing filling.The capping disappointment were the Churros, they were too dense, the dough, and didn't appear cooked enough, additionally the sauce on the side was a very odd taste. We left Churros on the table and had people who \"Can't get enough Churros\" until they had these :(The drinks were okay, my Margarita with an old dry lime was unique. The mojito in the bamboo glass was popular.Overall, based on the experience, the portions and the service, it was overpriced in my opinion.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Kw5oMisiz4XuYIPkUtxrug",
        "caption": "Photo of El Mero Mero - Singapore, Singapore. The impressive exhibition kitchen.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Kw5oMisiz4XuYIPkUtxrug/o.jpg"
      }
    ],
    "user_id": "_DDTeIubkh7QcgMQgcVn6A"
  },
  "qoDidtt8216eE4oAeAClOg": {
    "date": "2/28/2016",
    "text": "Came here as it showed as being good for gluten free (gf).Menu more limited than what I thought based on the gf recommendation I had found online. When I arrived but the chef went through the menu and said what I could have being gf. The tacos were off limits as were the tortilla chips as the chef said they couldn't guarantee no wheat. I appreciated the attention to detail in making sure I was given safe choices. The chef also personally plated and delivered my meal.I had a rump steak, mash potatoes and salsa sauce. These were all fab - huge steak, cooked perfect medium throughout. The mash was whipped into a thick potato puree and the salsa was fresh and tangy.I had this, plus two cokes and was $90 (sing). Good size portion though and I couldn't fit in dessert. Not the cheapest dining option but this was great quality. If you were getting tacos it would be cheaper. A-ok for me. Great steak, open plan kitchen inside do you can watch the team at work. Order seating too and great location at Chjmes. If I wanted a good steak, I'd go here again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "SMQlkG_7vxccrMdY9_MM4A": {
    "date": "8/16/2015",
    "text": "El Mero Mero... El Mediocre Mediocre.Actually, it's closer to El Meh Meh.Came here for a client lunch last week, after we were unable to secure a booking at a Japanese restaurant.Walking around the Chijmes complex I had high expectations - and the look and feel of the place upon entering is probably the best thing about it. You get the impression this would be a good place to chill in the early afternoon and have drinks and a good nacho been dip... but you'd be all kinds of wrong.First off the service was comical. The staff are friendly but clueless. It's like they've never served a human before. We had to ask for everything, you lose a star right there.Someone order a shared starter (mushroom I think) for the table, and we had to request plates. Before we'd even had a chance to try the starter, the plates were removed. The person ordering, requested the return of the plates... and back they came, after about 5-10 minutes, lasting just long enough to sample the starter before they were removed again.When mains came out one side received all of theirs and waited very patiently, before we told them to start... Unfortunately they were basically finished theirs before the other 3 (all beef burritos) came out.The beef burrito wasn't what I was expecting. I've had great, good, average and bland mexican, and this sits close to the bottom of that spectrum. The serving size was huge - the burrito was sliced in half and stacked, but it's really the only positive. The meat lacked seasoning and flavour, whilst the tortilla was extremely doughy and soggy; I finished half out of politeness. None of the 3 burrito eaters finished their dish, and it wasn't because of the size; though again I might have said it was the size, out of politeness.Lastly the drinks. I asked for lemonade and got some weird green tea with a wedge of lemon in it with no ice... (that may have been my fault, have they not heard of Sprite in Singapore?). I had to order a Coke (which was the syrup kind) to wash it down.Then came bill time, and I had elected to pay for all 7 of us. I regretted that immediately when I saw the pricetag, which was over $50/head. Now, I get this is Singapore, and you expect to pay more, but for what was delivered, $25-30/head would have been much more on point. I think $35 should have been the absolute ceiling given what we were served. Considering I've had better mexican for $12; and made better for $6; I felt we'd been stiffed.All in all. With the disorganised service, disappointing food, and the exorbitant price tag I can only go as high as a 2, and that's seriously being generous, as this place sits between 1.5 and 2, but I don't think it's a 1. The place looks the part, but it just does not deliver.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "YziRZOh5MrqN5b84dQ9AIQ"
  },
  "3kDD6HSo8OqBspIoLB-PWQ": {
    "date": "11/28/2015",
    "text": "It is on the pricey side: yes; but the food quality is excellent; the pork bao is devilishly delicious. For us Mexican food is maybe as alien as Indonesian food to westerners, but we know for sure the ingredient are fresh and they tasted great. Ambience is great and service was very good as well.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bSXsy_BEC8L5Ujs4mycNzg",
        "caption": "Photo of El Mero Mero - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bSXsy_BEC8L5Ujs4mycNzg/o.jpg"
      }
    ],
    "user_id": "A3vvP7tuNU5Tj2qII6fJIw"
  }
}