{
  "V6zgmSyiJo9OFtQXi7Hthg": {
    "date": "6/4/2016",
    "text": "We had 11 people, so we got a private room. The food was very good but expensive. It seems like it caters to tourists. It was fun to eat family style as it allowed us to try a lot of different items. Good food but expensive and they charge you for everything including the peanuts and wet wipes for after you have eaten the crab. Go to Chinatown for great food at a much lower cost.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9vj9rOpsw6pJ_K42HEYlQ"
  },
  "oa4Ua5FF-C3NUfM__lxQ_Q": {
    "date": "12/22/2014",
    "text": "Our hotel recommended Jumbo, but I'm always a bit leery when hotels recommend since they are probably getting kick-backs of some kind.  But they checked out OK with Yelp, so we went.Atmosphere inside the restaurant wasn't much, but the drive up the street with the Christmas lights was nice!We ordered:Hong Kong-style Noodles - My daughter liked these.  I tasted them and felt like they were pretty standard, not bad but not great either.Chili Crab - I wasn't satisfied with the \"chili\" part of the dish.  First, wasn't very spicy, and it was too sweet and saucy for me.  And if I'm not mistaken, the sauce was ketchup-based and lacked sophistication of flavor. The crab quality was also lacking.  The texture of the crab, in some parts of the crab was off.  I had hoped that the sauce (even though it wasn't the greatest) would permeate the meat inside the crab, but I found the crab to be very unaffected by the sauce smothered on the outside.  WAY too much sauce in that dish for me!The service was pretty bad.  Nobody checking in on us, except for the very end when the meal was over.Kudos to the restaurant though for giving me the option to pay some of the bill with U.S. dollars.  I accidentally left my wallet in the hotel but luckily I had some cash in my pocket but still left me short in Singaporean dollars.  They agreed to let me pay the rest in U.S. currency.  If they refused, I would've had to take a taxi back to the hotel to fetch the $.  Very thankful that they did that for me.As for the crab part of the experience, it definitely fell short for me.  Crab House in San Francisco on Pier 39 is the winner for me.  That is the standard for whole crab.  I guess I'm spoiled.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "46g1PTpxcRkT9KFsrXLFhg"
  },
  "xVWYWjPhvnGXE1TdSpcYTw": {
    "date": "11/17/2015",
    "text": "Out of the branches, the outdoor seating in Jumbo Dempsey is beautiful. Brought a friend visiting Singapore few weeks ago and we couldn't have asked for a better atmosphere/seating. With guests, D and I always get:-the award winning Chilli crab/black pepper crab + dozen (or more) bread-Deshelled prawn with salad cream in golden nest, or deshelled wasabi prawn. -Scallop wrapped in Yam Ring-Steamed bamboo clam with minced garlic and some fried ricetook off one star bc while the waiters were generally honest at this branch, the chilli crab came with basically no chilli. We were done after dipping our breads into it for a bit. Usually, there is so much chilli leftover that I end up taking it away and eating it with rice next day for lunch. Disappointing, but the great atmosphere and the other dishes made up for it. Make sure to make reservations early! for visitors, i also recommend No Signboard in Esplanade bc of the beautiful view of marina bay sands and raffles place, though you have to keep alert NOT to get ripped off by the greedy waiters.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "iPL8V_dOtrcMUH6tQZq-Dw"
  },
  "ANoPeSDNpnA-wKbWG8VK9Q": {
    "date": "1/19/2013",
    "text": "Chilli crab!!! My brother is a huge aficionado and avers that they have the best. Also, bf's family friend also swears by the chilli crab at this particular outlet of Jumbo Seafood, apparently. Although, I have to say, Forture Seafood along Bkt Timah Rd does a pretty gd rendition (and their mantous are to die for, really) for cheaper. Not as nice ambience there though.Soon hock in soy sauce was fresh and delicious!Spinach beancurd with spinach/three types of mushrooms (enoki/shimeji/shiitake, I think) was delicious too!Roast chicken, mm.Black pepper venison, very tender!Kai lan in garlic, normal.HK mee, pretty gd too! Nice al dente/bite to the noodles, crunchy prawn, shredded cabbage and bean sprouts.Yam paste dessert and mango pudding were pretty gd!Can't comment on prices as this was a treat. But Jumbo card holders get 20% off ala carte and 10% off set menus. They also sell the chilli crab paste should you wish to try making your own chilli crab at home!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rkVAc3WRDIOyxQ7UuPf4MQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Mango pudding!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rkVAc3WRDIOyxQ7UuPf4MQ/o.jpg"
      }
    ],
    "user_id": "RACaZuc0YD9jRPAtaust5g"
  },
  "452UyqZ4ltAvtnuFF3iZgA": {
    "date": "5/3/2015",
    "text": "Excellent pepper crab! The price is cheaper than in Hong Kong. Razor clams are also very very good!!! The drinks are probably the weakest part, the lychee soda tastes quite artificial.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UIpb9dhAV0s6DQVM1XRuCA"
  },
  "S2te2DMJuuam9_R6vTSRww": {
    "date": "1/3/2014",
    "text": "jumbo is consistently good. their food is always tasty and well prepared, although probably not the best. their chilli crab and pepper crab are both excellent. the pepper crab is very peppery which i love. the chilli crab sauce is fantastic and such a great pairing with their mantous. i had the cereal prawns this time, and got them without the shell because i'm lazy. unfortunately they just didn't taste that great. not sure if it was this particular jumbo, or if it was because of the lack of shell. i love the razor clams dish, but they were out the time i came here.drunken prawns are also excellent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2B6LFJ6sJGq03ooznvu8A"
  },
  "TeCbi0KS0URm3DI6cryvXg": {
    "date": "5/2/2013",
    "text": "If this was a normal dining experience, I'd really rate JUMBO Seafood at Dempsey only three stars. BUT. As a JUMBO privilege card member, I got 20% off our a la carte orders, AND 50% off the fresh crabs. Yes, you read that right. HALF PRICE off the Chili crab and Pepper and Spiced Salt crab that we ordered. So for that awesome value, I'm adding a star. Dinner was a pretty last minute decision; we only realised that the voucher for 50% off crabs was only valid for April on the 29th of April... so at 8pm we frantically tried calling the Dempsey branch because it was the most central for all of us. As expected of a busy restaurant there was no answer... so we went online and Chope-d our seats. SCORE.Got there, and as we ordered, we were a little disappointed. They'd run out of a few drinks, and didn't have anymore pork ribs. So we ordered two crabs, their scallops wrapped in yam, black-pepper venison, baby kai lan fried with garlic and mantou.I won't talk about the crabs, since everyone does, but I highly recommend the scallops wrapped in yam. The yam is light, crispy, and sweet. While a little overpowering for the scallops, they're still very enjoyable and actually quite addictive. The black-pepper venison was also a pleasant surprise. The black pepper sauce was incredibly rich, fragrant, and really stole the show. We were mopping it up with the mantou instead of using it on the Chili crab. It was THAT GOOD!So all that food, with some drinks... at $50 a head? I MEAN COME ON! That's definitely worth one star right there. I'm just looking forward to the 50% off fresh lobster month. :D",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "EYEvKYninX6eJvPL1yDMQw"
  },
  "28Z_WkebazdwVIAgYEAW3g": {
    "date": "7/10/2015",
    "text": "The Outback Steakhouse of Singaporian Seafood. Heavily sauced.... The foods, not me. Overrated.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y19s0ORc70orlVuftrFcLA"
  },
  "vnuaHDhmIPwNplZs0LMJ4g": {
    "date": "12/5/2014",
    "text": "Love the atmosphere. Staff was friendly and courteous. We had the chili crab, deep fried squid, buns and oatmeal prawns. The crab and prawns were a bit too sweet, but scrumptious, regardless.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bNYSwevuNaL-PHditmF6TQ"
  },
  "7OBK4X13VGxBVg4QtPlz6A": {
    "date": "1/24/2015",
    "text": "Walked here post-drinks@WhiteRabbit down the hill. 3 of us had the signature chilli crabs, 2 baskets of fried mantaus and kailan cooked w garlic. Everything was tasty but my fav crabs (in this type of setting) is still Malaysia's FattyCrab in PJ. Extra star is for the airy patio seating.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "__Ksf1CCgaKdS3Gi5f6PcQ"
  },
  "xjgOrAaQYLMXpIc6EuvzCg": {
    "date": "8/21/2012",
    "text": "I've never seen chilli crab advertised so aggressively! Ask any local about Jumbo Seafood and the association with chilli crab comes to mind. Besides chilli crabs, Jumbo does serve up a decent black pepper and salted egg version. Order a side of chinese buns to go with your crab instead of rice! Located in Dempsey, this is a great place to enjoy a taste of local flavor before heading off to any wine bar in the vicinity to enjoy a relaxing glass of wine under the lush greenery and foliage.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPTc3zhaCi4FEG-v-k2d7w"
  },
  "SS_0ed7nM0sQOXbwq0HcDw": {
    "date": "8/18/2012",
    "text": "Jumbo Seafood at Dempsey is a great family restaurant. The seafood is always fresh and well cooked. I've been here several times, all reasonably satisfying experience. The service is prompt but not on the polite-side. The staff are mostly Chinese-speaking and do not understand a lot of English, which for some, myself included, makes it very difficult to give a simple order.The interior is nothing great, following their corporate colours, and themes. If you've been to one, they're just about the same as the rest without a hint of uniqueness. Jumbo about the biggest player in Singapore's seafood market, just about every local has been there! They've definitely built a big name for themselves, and for that they have my respect.Generally a place for family or co-workers, it is a great place for a reunion and even a company dinner.Mon - Sat, 12:00 pm - 9:00 pmSunday, Closed",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvDgC3dqLYUJvoefGBJM8A"
  },
  "2XI9b1JCYZEb5-qwS9ljvQ": {
    "date": "5/15/2014",
    "text": "Both the chili crab and pepper crab were extremely good- neither were very 'different' from other places I've been in Singapore- but in this case the lack of 'special touch' was welcomed. Just straight forward, Singapore style/quality crab.We had the crispy baby squid heads, which when coupled with beer, were fishy-squidy-amazing. We dipped them in the sweet chili garlic sauce (pretty sure that was a faux pas but do not care) which made them even better.The bun situation kind of bugged me though- the buns were on the small side and didn't come with the chili crab. Weird.Dempsey is ideal in that if you didn't make a reservation and had to wait, there are pubs/breweries in short walking distance to pass time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hp8lLJuWR0eAzdPVcM5kEg"
  },
  "VTx2PPn8YyObgeI0t6ApOg": {
    "date": "7/29/2013",
    "text": "Nice food, but a few items were not available.  You definitely need a reservation and basically full every night.  Black pepper crab probably best in town and prices are reasonable if you have the Jumbo privilege card.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSphcDFYUZW4cDBW7XPjdA"
  },
  "flCVV0tPO9XgXoL8B5s3ng": {
    "date": "8/23/2012",
    "text": "Jumbo Seagood is one of the stalwarts of seafood dining in Singapore. It is famous for its chili crabs - the gravy is thick and luscious. Order a side of fried mantous (little buns) to dip into the gravy, and you're guaranteed to leave feeling satisfied! Other dishes which are good include the ever ubiquitous cereal prawns and black pepper crabs. The Dempsey outlet in particular has a rather nice atmosphere. It has a decidedly more upmarket feel than the other Jumbo outlets - this could also be due to the fact that it's one of the newer stores. Bring your tourist friends to Jumbo for a seafood dinner, and I'm pretty sure they'll have a good impression of Singapore (:",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDcJsT-IhVMH6sO19V_nbg"
  },
  "f3OI9o37y2m3RnpBsTgDLg": {
    "date": "10/21/2018",
    "text": "This place was superb. The food options were very great as it had lots of seafood to choose. We chose the feature dish of jumbo chili crab. We ordered two type of buns: fried and steamed to dip into the chili crab sauce. We also ordered the scallops, it was great! The service was wonderful as it provided with all the tools to avoid the mess that it requires to eat crabs. The tools were: plastic cover for your belongings, plastic bag for your phone, cover for your clothes, and many more. We also ordered fried shrimps,veggies, meegoreng, and many more. It was an awesome experience!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zrnVqJMsN-2PFfxn0zBkyw"
  },
  "i6YbFtANfdUmstmCJo72JA": {
    "date": "6/4/2018",
    "text": "Delicious seafood close to the city! This location is most easily reached by car, so I would suggest driving or grabbing a ride as it's situated in the heart of the Dempsey estate. It's a great place to bring out of town guests as the air conditioning and upscale decor are pleasing and comfortable, compared to its seaside location which can be tricky when it's rainy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JuaNYsyImG1SID-4PMLHAg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Baby Squid",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JuaNYsyImG1SID-4PMLHAg/o.jpg"
      },
      {
        "img_id": "Dppwz0uUTEq2_Th6dS66Eg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Chili Crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Dppwz0uUTEq2_Th6dS66Eg/o.jpg"
      },
      {
        "img_id": "Opzmg-8SC7ConvnNYPE4mA",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Pepper Crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Opzmg-8SC7ConvnNYPE4mA/o.jpg"
      }
    ],
    "user_id": "cP4hNTBDlUTuWJlJGCtlhQ"
  },
  "3nzSA1p3U2XMXOommcj9WA": {
    "date": "8/29/2018",
    "text": "I've been meaning to write a review for this place...on my recent trip to Singapore..everyone suggested to try this place. It's the best and biggest crab ever!!! I also loveeee the duck salad...I was one happy girl!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1vScAObyh4Lr_KBVhyJOrw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1vScAObyh4Lr_KBVhyJOrw/o.jpg"
      },
      {
        "img_id": "FBkaqt_haaACXMLVNCK2JA",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FBkaqt_haaACXMLVNCK2JA/o.jpg"
      },
      {
        "img_id": "auOJvy04l1hk6SyZbNQIQw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/auOJvy04l1hk6SyZbNQIQw/o.jpg"
      }
    ],
    "user_id": "bEGn9McLn9QXArLCWxw0MA"
  },
  "G3aACcWMkj5A78K_ruV-2Q": {
    "date": "7/28/2018",
    "text": "Odd place.  Kids running like wild animals with no supervision? Main course of spicy crab takes over one hour to be served.  Food is good but the other antics destroy the atmosphere.  Service poor, food good.  Best for tables of 8 or more.  Best outside or private room.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j4rebB6ilXa05UPQDqta_A",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Large razor clam shell",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j4rebB6ilXa05UPQDqta_A/o.jpg"
      },
      {
        "img_id": "jfsneeMQBTRd3gw84_GVLg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Razor Clam",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jfsneeMQBTRd3gw84_GVLg/o.jpg"
      },
      {
        "img_id": "hlDgmcKwHDCmn8NWbpYVsg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Kids screaming, and climbing the fish tanks like animals.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hlDgmcKwHDCmn8NWbpYVsg/o.jpg"
      }
    ],
    "user_id": "YHiyxTbTEMiSHIWV4Cod6Q"
  },
  "CQa_PT7wdy9Nznv6nOq7tA": {
    "date": "3/29/2018",
    "text": "Chilli crab: 80$ for 900g of Chilli crabService: 3/5 no complaints, just that staff do what is required of them only....nothing moreTaste: given many of these crabs are flown in from Sri Lanka, I'd recommend trying this in places like Ministry of Crab or Far Crab in Sri Lanka. Preferred dining experience & taste at Ministry. Repeat: no",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0uNxhZAFbkalQImzJ6UDUA"
  },
  "ayWeGjctYCN0QsRtkO-MTQ": {
    "date": "7/29/2017",
    "text": "Visited this restaurant twice. Love the traditional chili crab here. Juicy, tender and flavourful. Best paired with warm bread rolls to soak up the crab. The fried rice, fried mini squids, and cold jellyfish were also delicious. Made bookings ahead of time and there was quite a queue outside for no bookings. Toilets could be cleaner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zSu5yHWvH0m97gSL6uz4CA",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Chili crab.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zSu5yHWvH0m97gSL6uz4CA/o.jpg"
      },
      {
        "img_id": "VvZWGo4epFAkzkd3b-GUtw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Chili crab.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VvZWGo4epFAkzkd3b-GUtw/o.jpg"
      },
      {
        "img_id": "3PtqxHCo8aa0ceAeK51Uiw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Chili crab.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3PtqxHCo8aa0ceAeK51Uiw/o.jpg"
      }
    ],
    "user_id": "PnPSF2hzkpH091naz99msw"
  },
  "6jzdFU3u4fxcocrD3tK6UA": {
    "date": "6/25/2017",
    "text": "The only place to go to try the chili and black pepper crab. We opted to sit outside and the weather was perfect for our enjoyable dinner. I am a huge seafood lover so this just hit the spot for what my palate was craving. I believe I prefer the chili crab over the black pepper, but it was a very close tie. Enjoyable experience and atmosphere!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XF6SR0CwImz_ZDEmC0pOqg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XF6SR0CwImz_ZDEmC0pOqg/o.jpg"
      },
      {
        "img_id": "XKFQZ4jRXKfyxqpt2_FtKg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XKFQZ4jRXKfyxqpt2_FtKg/o.jpg"
      },
      {
        "img_id": "oBXd6Ejck7JhDx7vMp5b9Q",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oBXd6Ejck7JhDx7vMp5b9Q/o.jpg"
      }
    ],
    "user_id": "4YS4p4mF2jGLPb0jfKFpGA"
  },
  "CZrtr_z7q-b4bHmpBoPjRg": {
    "date": "11/22/2016",
    "text": "Quite an experience and a MUST if you are visiting Singapore and have an interest in something authentic and local. The service was brisk and but attentive with a system that was ore teaming oriented - which I liked, but which sometimes caused cross services issues (drinks vs. food etc.).  But somehow it worked out and everything worked very well.  We had some game dish and then some terrific pepper steak strips.  Both relatively salty but cooked medium rare so were absolutely tasty. The crab was king of the night....  The two styles were equally good with the pepper (dark) being my favorite.  Each crab had enough meat and the sauce was deliciously tangy with a strong burn but not overwhelming.  Quite an experience. Must visit",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t3eVjISUbqppg6pmlEVNNA",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t3eVjISUbqppg6pmlEVNNA/o.jpg"
      },
      {
        "img_id": "igHv3IqOxDIh4T9wM6oawQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/igHv3IqOxDIh4T9wM6oawQ/o.jpg"
      },
      {
        "img_id": "Ks1YHdEJtEV49LJRyGGofw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ks1YHdEJtEV49LJRyGGofw/o.jpg"
      }
    ],
    "user_id": "k24QIVcmhhOnv9MCY3dELA"
  },
  "hzgZxqBKPSu_GWTetmE8mQ": {
    "date": "1/27/2018",
    "text": "Such a great experience. The service was fabulous. So attentive. And the food was delicious. We ordered chili crab, drunken shrimp, cod, salted egg shrimp and chicken fried rice. Everything was excellent. I highly recommend this restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uR-BRiyTfDvgYzkdD4sGpQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uR-BRiyTfDvgYzkdD4sGpQ/o.jpg"
      },
      {
        "img_id": "NNTbM39U_ogw4VekGEsymg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NNTbM39U_ogw4VekGEsymg/o.jpg"
      }
    ],
    "user_id": "mV-p9xEBvkbkoA8wAsAteQ"
  },
  "SCIJSXsaBNaORmbkSTowLw": {
    "date": "3/28/2017",
    "text": "I like to come her for \"atas\" seafood. For those of you are not familiar with Singlish, atas means \"high class\", \"boujee\". I do like this location of Jumbo, its more convenient than going all the way to East Coast. There is both indoor and outdoor seating. Personally, I hate sitting outdoors because the mosquitos start feeding on me! Nothing is worst than going for dinner and leaving with lots of mosquito bites.TIP: if you mosquitos love you, and you have to sit outside, wear long pants. And spray insect repellent if needed. This is not 100% fool proof, but it will help a little, thus enabling you to enjoy your meal more.Everyone loves eating chili crab here. I personally enjoy eating black pepper crab here. It is quite spicy! Be prepared to get your hands all dirty- but that is part of the experience! Don't worry, there are finger bowls as well as bathrooms for you to wash your hands.The food here is excellent. Some of the usual dishes I like to order are:-sambal kang kong-Hong Kong style steamed soon hok -Deep fried yam with scallop-Fried Rice and Fried Hor Fun Overall, a great place for seafood!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9FFlGXZmxeqqzi5Na9DTKQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Black pepper crab. Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9FFlGXZmxeqqzi5Na9DTKQ/o.jpg"
      },
      {
        "img_id": "e8Okdb8qW1XRtW7YSCRFWg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Sea bass cooked Hong Kong style",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e8Okdb8qW1XRtW7YSCRFWg/o.jpg"
      },
      {
        "img_id": "EnTKaYggV0ctKQ-ObLBy-A",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Seafood fried rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EnTKaYggV0ctKQ-ObLBy-A/o.jpg"
      }
    ],
    "user_id": "FC1ZSB9fd4WlDMSAbEjq8Q"
  },
  "94QPhJWtafkeAfJGq7torg": {
    "date": "3/30/2016",
    "text": "Took the city bus with my family to try this outpost on Dempsey Hill and it was very much worth the time and effort!  A little hike up the hill from the bus stop past some other great looking restaurants including a wine bar got us ready to eat.  We were promptly seated indoors (by choice, since it was still insanely hot and humid outside) and ended up ordering a number of items, the highlights of which were their signature Chilli Crab, a perfectly cooked fish, lamb chops, and an amazing seafood fried rice.  My family (3 in all) ended up eating every bit of the 7 items we ordered, which is quite an accomplishment!The chilli crab (pictured) comes in a spicy/tangy broth and was great with their fried mantou.  While I generally don't love crab, just too much effort for too little meat, this was worth trying, and you can't really visit Singapore and not get it.  Their steamed fish was among the best I've had, and at over $100 Singaporean Dollars, it should be.  Loved the lamb chop, which was perfectly cooked, although I ended up scraping off a bit of the sauce to make it less salty.  A pitcher of Tiger Beer shared among us complemented the meal perfectly.I'm told that the Jumbo Seafood on Dempsey Hill is the best among their multiple locations in Singapore.  Minus one star for their reservations policy.  We had a Chope reservation for 8:30 and called to try to come in early to this location and other ones (Riverwalk, Riverside Place) and they told us that they were completely booked all night.  The Dempsey location was maybe 50% full the entire time we were there, so I'm not sure why they are so inflexible and unwelcoming about their reservations.  Oh well.  They were nice enough to call us a cab to take us back to the city.Overall, a great place for seafood in Singapore, and a must visit for the Chilli Crab if nothing else!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fBBL2pERXqf73ymqtSgztQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fBBL2pERXqf73ymqtSgztQ/o.jpg"
      },
      {
        "img_id": "TupV4Eh7jfMLNVs8ffON_w",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TupV4Eh7jfMLNVs8ffON_w/o.jpg"
      },
      {
        "img_id": "2E35eLRcaFktTcNNMv-_Bw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2E35eLRcaFktTcNNMv-_Bw/o.jpg"
      }
    ],
    "user_id": "C9m5v69J__PNRm4N30t55g"
  },
  "7cL7o8P7S9m1Vthc1Xvewg": {
    "date": "1/26/2016",
    "text": "Out of all the Jumbo branches in Singapore this one in Dempsey is hands down my favorite. The food simply tasted better than any other place and the service is far superior; you get your food quick and the service was very friendly. It is tough picking between the two flavors, but for me the chilli crab slightly edges out the black pepper crab. Fortunately I've had enough people in my party to try both. The chilli crab has a nice balance of sweet and spicy flavor. It comes in a rich, delicious eggy broth and is best enjoyed with steamed or fried buns. The pepper crab is packed with black pepper flavor and has a slight kick. Also if you don't want to get too messy they will crack your crab for you!Besides the crab, the surprise dish during this meal was the cereal prawn. It's a perfectly cooked prawn coated a thick cereal batter. The crispiness of the batter and the small chunks of green chilli give this dish a delightful sweet, spicy and crunchy flavor. Along with the great food and service, there is also outdoor seating which is nice when the weather is cool. If you have to choose one place to get some delicious crab, this is definitely the one you want to pick.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "skvsVnh_vTJjgLsa5erWvw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Chilli crab - didn't get a pic with my nice camera :/",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/skvsVnh_vTJjgLsa5erWvw/o.jpg"
      },
      {
        "img_id": "GJ0cTAeLNNp_nEikgnzyiw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. black pepper crab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GJ0cTAeLNNp_nEikgnzyiw/o.jpg"
      }
    ],
    "user_id": "T8Gvjcw-Z_MKELdynTGJAQ"
  },
  "0DmYBv1vRH029Wa1Q5c4GA": {
    "date": "4/21/2018",
    "text": "My first time trying chilli crab and it was amazing!The restaurant was very clean and modern, the service was excellent, and the food was delicious. I will definitely be back for more.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6N0MnOR4fxDK0SHw_Y5R3g"
  },
  "7XEVfcI5jPS_IQdkz9J3Sg": {
    "date": "7/24/2016",
    "text": "On a nice breezy night, this is a great Jumbo outlet to have dinner at.Jumbo remains my go-to for chilli crab, and I'm glad I was able to take my mother here to finally show her the wonderfulness that is Singapore chilli crab.Unfortunately they ran out of live prawn when we visited so the drunken prawn was unavailable. We ordered the cereal prawn instead and it didn't disappoint!In addition to the normal chilli crab and fried buns, we also got their seafood fried rice. Delicious as usual.Definitely make a reservation for dinner or weekends as far in advance as possible, as this place books very easily.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 1,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "satqDOQUSMwpJ3upfBIWng",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Cereal prawn",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/satqDOQUSMwpJ3upfBIWng/o.jpg"
      }
    ],
    "user_id": "nzIq7_i0C79ToOp-U5e0fA"
  },
  "hVHOpyF4bw_4sWwagiysOA": {
    "date": "10/7/2017",
    "text": "It's our first time eating chili crab in Singapore. We ordered the warm king crab leg appetizer, fried rice and chili crab. The chili crab came in at almost 2 lbs, which was too much for us. The flavor was good,  but a bit too sweet, and not spicy enough. The king crab appetizer was really good. Fried rice was also really good. I think I may try another chili crab place next time, for something a bit more spicy and less sweet.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8fPgOsnir5Lmu0eYEKCVA"
  },
  "xSvP0h56CDpdymuIvxxfrw": {
    "date": "9/30/2017",
    "text": "This is one of the best sea food experience I hadHighly recommend their Black Pepper Crab and Coffee Ribs",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uva8WLMCjsKOQt51PbA1lQ"
  },
  "Vq7DYZXKbWEmlKlCVlQkig": {
    "date": "4/30/2016",
    "text": "Jumbo's our go-to place for a good quality chilli crab.  Better order some appetizers to begin with, specially if you're a bit hungry already. Our Chilli crab came after 40mins. Our fave here - Chilli crab(of course!), fried buns, salted fish fried rice and sambal veggie.We tried something new- the crispy chix w salted egg and pumpkin sauce (see pic). I liked the sweet touch that the pumpkin added to the taste. The polite waitress taking our order and the servers added to the good lunch experience at Jumbo Dempsey.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rX49RNte8YuTSHEDmrsTNQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. On a sweet side but still a fave when craving for Singapore Chilli Crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rX49RNte8YuTSHEDmrsTNQ/o.jpg"
      },
      {
        "img_id": "TokhhLq3eI8aeMZlJvGpeg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Crispy chix w salted egg & pumpkin sauce. Crispy skin & juicy chix meat. The pumpkin gives a hint of sweetness to the salted egg mix. Yums!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TokhhLq3eI8aeMZlJvGpeg/o.jpg"
      }
    ],
    "user_id": "B0ikZnJnyIJdtSuO8n3Grw"
  },
  "1yrkt4gXumCAJpPzBFprwQ": {
    "date": "12/25/2015",
    "text": "2nd visit this year, totally love it. Good food and good atmosphere. The outdoor seat is cooling but still will advice to avoid when the day are too hot.If you prefer indoor aircon seats, please make a reservation before visit. (You can use chops to make reservation as well)We ordered fried baby squid, salted eye prawns, egg fried rice, chili crab and scallop with yam ring. For me Jumbo serve the best chili crab among other major seafood chain, the sauce taste are balance and fried/steam mantou is a must eat with the chili crab sauce. Aaaaa is like heaven.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4DSlPs8EHJrSBvvHz7RvkQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4DSlPs8EHJrSBvvHz7RvkQ/o.jpg"
      },
      {
        "img_id": "Pyzgk_OQA22GKxePy-L1SQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pyzgk_OQA22GKxePy-L1SQ/o.jpg"
      },
      {
        "img_id": "rO1LgPQa7ElvXlnqkbLvOQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rO1LgPQa7ElvXlnqkbLvOQ/o.jpg"
      }
    ],
    "user_id": "1Q2GYf4LGZiJ-r3kvKvGWg"
  },
  "UMBqYwY7TLLW4XF-79E-pA": {
    "date": "6/21/2015",
    "text": "Apparently this is the place to go for Singapore's famous chili crab. Came here for a team dinner while in Singapore and work had rented out the private room. If you come here on your own terms, be prepared for pretty steep prices. It was a really good experience but I deducted one star because they have shark fin on the menu and the service was a little lackluster and slow. The salted egg crab (coated in a rich layer of salted egg yolk) was my least favorite. I definitely enjoyed the chili crab (not really spicy at all) but actually found the black pepper crab more interesting in flavor. From the huge choice of appetizers, the scallops and the dragon fruit with lobster stood out the most.  Word of advice: don't wear a white shirt or any piece of clothing you care about. This affair is messier than your average Maryland  crab feast.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o2Bb-T23JLSudqIjG3WcCA",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. By far my favorite appetizer: dragon fruit with lobster meat. Little heavy on the mayo but very good overall",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o2Bb-T23JLSudqIjG3WcCA/o.jpg"
      },
      {
        "img_id": "P7bWRnVJQhz8tB6_hTMVKg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Wonderful scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P7bWRnVJQhz8tB6_hTMVKg/o.jpg"
      },
      {
        "img_id": "09ntF29KjbdmVkXc2MqNpQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Prawns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/09ntF29KjbdmVkXc2MqNpQ/o.jpg"
      }
    ],
    "user_id": "_wsTuYYmfDmQdlQlAZmQJQ"
  },
  "nzOlCZTlTKXSvNdvAiz7JQ": {
    "date": "6/7/2015",
    "text": "The 4 of us ordered 1 chilli crab which I thought was very good. It was not too spicy so that it went well with the Man Tau. The crab meat was nice and firm and filled the claws, indicating freshness and a high turn over. Some places the crabs have been sitting around a long time starving!The prawns cooked with salted egg yoke was good, but the dish was small. I liked the tofu cooked with broccoli and mushroom. Overall it was a very pleasant meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2cUGEwL7hqCpgEKmNdA7Fg",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2cUGEwL7hqCpgEKmNdA7Fg/o.jpg"
      },
      {
        "img_id": "hFvLcXv0ngb5SkOgWspksw",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Prawn in Salted Egg Yolk",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hFvLcXv0ngb5SkOgWspksw/o.jpg"
      },
      {
        "img_id": "zKjuXGgsvEW6f1dc5BZ1mQ",
        "caption": "Photo of Jumbo Seafood - Singapore, Singapore. Singapore Chilli Crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zKjuXGgsvEW6f1dc5BZ1mQ/o.jpg"
      }
    ],
    "user_id": "kOkQQ2h5p9QrQ_JBwF6d6Q"
  }
}