{
  "TMchrh746dHUCIDLTHCf4w": {
    "date": "8/23/2009",
    "text": "I loved this place, was there on a special ocation a few years back, great food, good prices, fantastic service,",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "x2W0ghuXJskrlbH2dmgSpQ": {
    "date": "11/19/2008",
    "text": "The food here is superb. It is very much a traditional restuarant serving sausages and steaks. pies and liver etc. The interior is very well lit and complements the immaculate decor and there is a decent amount of space between the tables. The service is excellent and the food of a very high standard and wonderfully presented. The wine list is very good and not too overpriced. All in all a very enjoyable dining expierence.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nPdQ2jf9nj83Dn1pICndeg": {
    "date": "11/18/2008",
    "text": "This restaurant is an institution. The atmosphere is very relaxed and, at times lively, the staff friendly and helpful. The restaurant is set on two floors but try to book a table on the ground floor where you often see a number of celebs. The menu is traditional English and the portions are large. The food is excellent and you will want three coures - though you may not make it! The wine list is also impressive and reasonably priced for the West End. Book a table when you are able to spend the whole evening enjoying the restaurant, this is very definitely not a pre-threatre eatery.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "st0x5F_QSiW4AV3XenPRLQ": {
    "date": "7/26/2010",
    "text": "For the location and quality at this price this is a winner - long standing and long may it last",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0d0MqKPovb1enACrvp-BmQ": {
    "date": "4/26/2010",
    "text": "10 words...perfectly crowded, food is straight divine, get mushy peas always",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yUjZtSgj5GofAUe0eGTZeQ"
  },
  "ndU6g8Nmhkb8ypogeV0Ezg": {
    "date": "3/13/2011",
    "text": "Not having been to Langans for some 20 years I decided it was time to take a chance that things were still as good as before and took my wife, son and daughter -in-law for the late sitting, arriving at 10.30pm. The service was impeccable and the atmosphere vibrant, relaxed and unstuffy. However, the food was disappointing, and I suspect that this was just maybedue to the lateness of the hour. My duck was a sort of lukewarm pink blotting paper and had perhaps been hanging around for some time, and the accompanying Mashed potatos were very poor; dry and tired. The real let down was the creme brulee - a signature dish for this restaurant at my previous visit. The brulee was granular uncooked sugar and the creme was very runny and just not right., Don't know the answer, but I suspect this was the end of a long day; however the prices were still up there, and it's a real pity the food wasn't.Tiredness manifests itself in many ways, and I would recommend the management take a careful look at the late offerings. Sorry guys.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VYy_oIzzw6IivmInh4gIpA": {
    "date": "3/13/2012",
    "text": "Langan's Brasserie is the place I take friends and colleagues from abroad.Traditional, English food, hearty, delicious, and reminds you of home.The atmosphere is great, the staff are friendly and knowledgeable, I enjoyed each and every meal I've had there.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yzNop8xImMjziGFz1h77WQ": {
    "date": "5/31/2010",
    "text": "A great restaurant for a celebration.  The decor and people watching are wonderful at this busy restaurant in Central London.  I did not see Michael Caine or any celebrities but the staff made me feel right at home.  The specialty drink list is excellent and fairly extensive.  We sat on the ground floor in order to have the spinach souffle which was well worth it.  I had the Bangers and Mash which were wonderful.  All of the entrees offered very generous helpings.  I had the sorbet for dessert that was very refreshing.  On my first trip to London, UK this restaurant really stood out as a great and memorable evening.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOU73K85NeMzBsqwJtfu0A"
  },
  "7mM7JzWPUrSPDlFJcdV07w": {
    "date": "2/7/2015",
    "text": "Love this restaurant as I always spend my Birthdays here.  Good service, great atmosphere, warm welcome.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_dUXagQu9o3ejlui3cu4Q"
  },
  "1AgnLZD06uf8pCAKg8ZeIA": {
    "date": "2/16/2012",
    "text": "Stuffy place.  I went there because it was right by the train station and it was a rainy night.  Food was very overpriced though it was good.  I had a salad, fish, and soup.  I was traveling from teh airport, so they put me in a corner somewhere and didn't really know what to do with me, so service was a little weird.  Overall, just ok.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FrvbWjNjQT91cQbD0mTV_Q"
  },
  "qB6k_oJ-4shDlQi7VzkYgA": {
    "date": "10/18/2009",
    "text": "There is most certainly better food served around London but Langan's has it all - atmosphere, old friends, history, food, celebrity - for me and do try to be there after 10pm on Thursday as that's when Fay usually turns up.Fay is a wonderful slight-of-hand artist who is witty, absolutely charming and could probably throw a mean left-hook if pressed to do so.By the by, seating along ground floor windows is hallowed ground.  If you've been seated upstairs or are offered seating upstairs, please know that you are rated lower than whale shite.Langan's is a must-attend when in London!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HDofmxUbwB2ap0rfVxS4dg"
  },
  "XDq3wMqA1ihmuS2ecJ1M5g": {
    "date": "5/27/2010",
    "text": "I have eaten at Langans many times over the years. What I really like about it is the quality ingredients, top notch service and atmosphere. You don't get rushed out so that someone else can take your table and you are allowed to relax and enjoy your meal the way you should. Comparable to other London restaurants the wine prices are very good. If you are looking for a relaxed dining experience and have a reasonable budget then Langans is a great option for you. Never fails to deliver.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bf_42JJBaPiUjUHFgw00mg": {
    "date": "8/24/2014",
    "text": "Increasingly mundane food and service. Menu has no changed in 15 years at least. Better venues in the area and much better if you're willing to travel 10 minutes more. A mystery why Michael Caine continues to lend his name to this establishment.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5D2mR5NMM0LAnqFKfEhxA"
  },
  "u3rqRrLR8ChoNtHq7XgenQ": {
    "date": "6/12/2013",
    "text": "Old school British food done well, nothing has changed here in years, and it probably won't either for years more, if its not broke don't fix it Excellent service, charming dining room, the food is what it is, solid fare.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkmbUa-JyqPco4NL5AFofA"
  },
  "re15FLrGQ93kzbWfSz3GSg": {
    "date": "1/7/2009",
    "text": "Did you know this place is the brainchild of Michael Caine?SIR Michael Caine?My Dad makes sure to remind me of this EVERY TIME WE COME HERE.  Which, since he lives around the corner, is a lot.Centrally located, excellent food, impeccable service.  Really, get the grilled ribs if it's on the menu still, it is A-FREAKIN-MAZING.  They also do excellent duck, and if you're lucky to be dining with Dad, make sure to order lots of top shelf wine, otherwise the house red is good as well.It's quaint, it's cute, it's expensive.  And I dig it.  Especially with all the interesting and weird crap on the walls.  Sweet lampshade collection guys.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "Y6s2HEIcQUcBAMWdDnQ8OA"
  },
  "JvE9VVA0w4FbEPWsYYUtJQ": {
    "date": "4/13/2012",
    "text": "Large, traditional British steakhouse with friendly staff.  Excellent steaks and side courses.  Great for visitors and locals alike.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WFXDZGajdGDcey0aGtSoLA"
  },
  "utwH5vJS-6wCRsVxFQASqg": {
    "date": "2/11/2014",
    "text": "I had seen reviews before arriving in London and knew this would be my place for breakfast. Great food and great service. They were flexible in allowing me to order off-menu and by my second day Darren already knew my preference. Fantastic!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RqpWPfgmexsFA_XDoR6mA"
  },
  "Ib7a8s7IQFiWNH5C9W7MIw": {
    "date": "4/10/2011",
    "text": "Went here several times in October 2010. The atmosphere is perfect for a relaxed night out, neither formal nor too relaxed. There were people in tails as well as people like us in jeans. We all fit in. Everything we ate was great and the service was impecable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4LzIZ5-RfdCvq8aYFUuGA"
  },
  "zjU_LKWNl0_eraOezm_gyw": {
    "date": "8/3/2008",
    "text": "We had a 'girly night out' for Christmas and 8 of us went up to Langan's. We did the works - hired the limousine to take us all and had champagne on the way - very nice. We were seated upstairs in Langan's and the atmosphere was very nice and relaxed - not quite what I expected. The food was wonderful, as were the wines and the service was exceptional. After our meal, we went downstairs for coffee before going home, which was equally very nice. All in all we had a fabulous evening and I wouldn't hesitate in recommending Langan's to anyone. Our evening was topped off rather nicely by having a quick chat with Tom Jones on our way out!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nsFryUt38GRs78xGlXRDuQ": {
    "date": "7/1/2008",
    "text": "From what I understand Langan's is a London institution, so I was delighted when a friend invited me to join her family for a Birthday lunch. The location, reputation and appearance of the restaurant would leave anyone to expect a stuffy, formal interior. On the contrary, I found the staff friendly and the atmosphere casual and relaxed. The restaurant is large, and although the decor is somewhat dated in places, the walls are crammed with an impressive art collection. The food is traditional, hearty English fare - don't be surprised to hear the phrase \"My mother made it just like that\". The roast duck (a huge portion) was outstanding, as were the grilled swordfish and sirloin steak (hey, that's what I was told). The extensive menu is hand-written and changes frequently. You can see a sample on the restaurant's website. langansrestaurants.co.uk  All in all, a great place to take your parents for dinner.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HtznM4tlRGC2-wXqLbQp0A": {
    "date": "4/5/2010",
    "text": "I went here recently on a Thursday in the evening with 4 friends and was sorely disappointed.The starter that three of us had, spinach souffle with a anchovie sauce was delicious but the other two starters were just 'okay'Our main dishes, mine the lemon sole, didn't set the world on fire or even makes us go mmmmmOnly one of us bothered with desert (£8.50)The toilets are very tired, roller towel and grubby tiling is so secondary school.A bottle of house white and a glass of house red and a vodka martini (£10.50) and peppermint tea (£2.50 each) made with a tea bag is more Lyon corner house than quality restaurant.  No thumbs up on the liquids then.The waiting staff were excellent but otherwise it was a very poor event that may have worked in the seventies but these days is far from acceptable.Total bill upon leaving was £232.88 including Service - so £46.60 eachThe Service does not go to the staff as tips but to bring their wages up to the minimum basic wage - that should be illegal as should this piss poor restaurantNever again and that was a unanimous view.  We liked the staff but they were all that shined",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B51-WjhKFcR58THOoj4i-w"
  },
  "eMDBcyWSqR2_R1OemMJ6-Q": {
    "date": "3/30/2011",
    "text": "Let's be totally honest, the main attraction of this restaurant is not the food ! I have been going to Langans for many years, and will continue to do so. The staff are excellent, and it is run very well. Service has always been very good and that is why people keep going back. The menu could probably do with a shake up more often than it is, although the daily dated menu card is a nice touch....even if it does look like something from the 70's....which it probably is ! The last few times I've been there, the food has not been great. Fish and Chips....very greasy, Sausage and Mash....very stodgy........the seafood is usually very good, and the field mushrooms with lancashire cheese is still a great starter A good wine list, and overall I think it is priced fairly, considering where it is. The atmosphere is always great, with a great mix of people from every walk of life. I find lunchtimes is best it is usually very lively, and the people watching is very entertaining ! It's not unusual to have a 1.00pm lunch reservation, and be sitting in the bar at 5.00pm Well worth a visit, for the atmosphere alone, just don't expect too much from the food.....",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DBEAT5u042OdukVsZUEn_w": {
    "date": "1/23/2010",
    "text": "Over the years I have been to Langans a few times. Never been disappointed. I think it's reasonable to describe the food as bistro food. That is not meant to be unkind but reflect the happening bustle busy style of informal dining. Good food, friendly staff, good portions reasonable prices in a very \"Happening environment I like the art, bit's and bobs on the walls, I think it works well. It's not fine dining, but it's also a long way from fine dining prices, I think it is modestly, very modestly priced. Many restaurants could learn an awful lot from Langans in respect of good quality, fresh, food served in an un-pretentious.... but nice restaurant by helpful staff. I think they do it well. I remember the glory day's when \"The chef\" Richard Shepherd was in the kitchen and I feel it was better. (Maybe that's just a romantic view in time who knows) Don't get me wrong not saying it's not good, just think Richard Shepherd knew his way around a chopping board. One of the huge advantage of having on board great Caterers like Shepherd is that They have done the mileage, been about, learnt the job Not a lot of people gonna teach the likes of Richard Shepherd a lot about food and restaurants. I hear he is pretty much semi retired nowadays but no doubt still has a guiding hand. Now after all that boring waffle, and praise in support of Langans and Richard Shepherd i went on to the web site to have a look before posting this review. I have to say (Sorry about this guys) they have one of the most boring, boring web site i have ever had the missfortune to visit. Sorry guys but it's true. Don't let this put you off because it is no reflection of Langans whatsoever! I'm just guessing they are so busy, don't give a hoot about the web site....because they don't really neeed it? Who knows. Lastly, one great thing about Langans...they will always try and fit you in, late at night, very late at night, if they can get you in, always do their best. If you have not already tried Langans, in respect of value for money, good food and fun easy nice times, try it. Cannot believe you will be unhappy, certainly for the very reasonable cost. I like it, i think it's great.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "orM_loj7qHyvRbwZ4PqFyA": {
    "date": "11/26/2009",
    "text": "I've eaten here a couple times and on both occasions have found the food to be superb and the service excellent. The portions are a good size and they do use quality ingredients. The atmosphere is friendly and relaxed and there's never a rush to get you out of the door once you've finished eating. This is a great venue if you're looking for somewhere to go for a special occasion as everything about Langan's is just that - special!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "esLEbkeUWelYnnQMZ_UL4g"
  },
  "3vRHg_SLfJG-JPjpPdjygA": {
    "date": "9/5/2012",
    "text": "The menu is very simple; no fancy sounding name dishes that you can't pronounce, but is excellent quality and great sized portions. The service was absolutely excellent here.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uu-9DoMZBOEjX60201ToGw": {
    "date": "6/16/2009",
    "text": "If you want an introduction to good British nursery food, this is it.  I love this place!Good atmosphere and service but it's the food.   The most simplistic of dishes like bubble and squeak are superb.  Any of the grilled meats are very good but save room for the side dishes and the desserts.There's no better place to have dinner when you've partied too hard the night before and slept half the day.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-NRk9oEr03PIsbTpkNc-zw"
  },
  "4yPHHXYqBB7oymQZAsCPFQ": {
    "date": "5/20/2018",
    "text": "Excellent everything....went back the next night. Service was impeccable.  Especially noteworthy was the Scotch Salmon appetizer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4cHtpWiAyhYlMNrltwb6yg"
  },
  "mxP7nB92EMuul7nkmetC5w": {
    "date": "8/16/2017",
    "text": "A classy Mayfair bistro with British flair, the space is reasonably large and can accommodate groups large and small.In particular, the offerings skew towards seafood and meats, whether traditional dishes like cod and chips, bangers and mash, or English pies, to heftier ones like grilled swordfish, veal cordon bleu, or Angus rib eye. Indeed, there didn't seem to be many vegetarian-friendly dishes apart from sides and salads, but other than that there should be plenty to choose from for everyone.The quality of the service was fairly standard, and prices were quite reasonable by London standards. Basically, you take New York or San Francisco prices, switch the dollar signs to pound sterling, and forget about the fact that the pound is more expensive. A decent, classic experience all around.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "bQCHF5rn5lMI9c5kEwCaNA"
  },
  "w5OIxcXhVZEYDIq-SaaxOg": {
    "date": "7/31/2017",
    "text": "Good British food with some French bistro dishes as well. Quiet, attractive dining room. We had shepherds pie and fish pie. Both were well prepared. Side salad was beautiful and large enough to share. Creme brûlée was huge, and one of best we've ever had. Beer selection should be expanded. Also would like to see British sparkling wines by the glass. Service was not consistent. We should have been offered more water. Overall very good food, service could be improved.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ylAS0cKyFL7QjvM8NjBy-g",
        "caption": "Photo of Langan's Brasserie - London, United Kingdom. Try the duck breast with creamed cabbage.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ylAS0cKyFL7QjvM8NjBy-g/o.jpg"
      },
      {
        "img_id": "7U-mnBYJeAbBzcMWryI48A",
        "caption": "Photo of Langan's Brasserie - London, United Kingdom. Fish pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7U-mnBYJeAbBzcMWryI48A/o.jpg"
      },
      {
        "img_id": "jdtFfzvjty3H9xGTXJdaHA",
        "caption": "Photo of Langan's Brasserie - London, United Kingdom. Mixed green salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jdtFfzvjty3H9xGTXJdaHA/o.jpg"
      }
    ],
    "user_id": "rsANaqziyO6YTa3xXdwLjA"
  },
  "YyTmL5UVJv5DGUwWiCQWhg": {
    "date": "7/7/2017",
    "text": "Not sure what the bad reviews are all about. This was one of the best lunches in London. I would call it \"upscale pub food\"The spinach soufflé is a must have. Been on the menu for 40 years and you will see why. Atmosphere is quiet and feels upscale but totally chill.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2q0e33HFk3y4IxToaUgZ2w"
  },
  "kdiqK-hHhGN4kkoJFBH7RQ": {
    "date": "12/12/2017",
    "text": "Always fun, lively ambiance and quality unpretentious food make this a great choice for sophisticated yet casual dining in Central London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sTEYs0x6BfJf-6yNZTGtvw"
  },
  "xEYLOGPnFtpT-SaUfHosEA": {
    "date": "7/22/2017",
    "text": "Recommended by a friend who grew up in London as his favorite traditional London spot.  Arrived with my family and were seated at a table that was next to a large table that was soon filled with loud business types who were yelling across the table to one another.  After asking to be moved, they sat us up in a nice quiet table and our meal began.  Drinks were nicely prepared and the service was excellent.  The food for all was tasty and well prepared, from fish dishes to bangers and mash for our youngest.  Our son has a nut allergy and they were extremely careful to ensure that he ordered nothing with any allergens - including the cocktail that he ordered!  This is a wonderful and traditional restaurant with great attention to detail and excellent food.  One of our fondest memories from our time in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvrZfXpYRSVNsqmjt94IVQ"
  },
  "fSknegg7hGZ05g-dwWZOcQ": {
    "date": "1/19/2017",
    "text": "Upon arrival servant was very rude and asked us to leave restaurant within an hour even though the restaurant was empty. A few minutes after our food arrived we found a hair in our fries to which the manager refused to accept that there was an actual hair in our fries. Obviously I can differentiate between a human hair and things found in a kitchen. Very disappointed, came here expecting great service and quality food but got the exact opposite.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPywsue1mWFkjXl87JL-9Q"
  },
  "tyc25e55IoI-aRf_0Ulnpw": {
    "date": "10/3/2015",
    "text": "Was there last week for a week event and was really disappointed. The food was pretty bad (insanely dry chicken) and the service was just so/so. I am giving them a 2 vs a 1 to give them a break since it was a 30 person party. I would not go back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7naik8VS6sPsfI0E_fEKg"
  },
  "7SRSWGf1Mw3Zb1FyGDSKkw": {
    "date": "7/5/2017",
    "text": "When this restaurant opened in the mid 1970s, it was an oasis in a city whose food was still in the basement.  Now that London is a global foodie capital, it still carries its weight, with a more inventive and consistently well-prepared menu (even if it did steal '40 garlic chicken' from The Stinking Rose in San Francisco).  Almost every time I stop by for lunch, something amusing happens, due to either a server or customer, and that's part of the reason I've been going there almost every one of the last 8 visits to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-_XhY4jnHSwlSDCo6tjC7w"
  },
  "TpUYPyiZZ4BA49TYeRVLjw": {
    "date": "1/12/2014",
    "text": "American in London.  Strolling the Mayfair area I was taken by Langan's curb appeal and posted menu.  I decided to take a chance on this somewhat off the beaten path restaurant.After reviewing the menu out on the cd damp sidewalk I knew what I wanted before I was seated.  Hendrick's Gin & Tonic (I discovered this unbelievable Gin while in London at my brother in law's stag several years back.  Hendrick's is a staple in my home), Caesar Salad and English Rack of Lamb.  I would classify each o these as an American Homerun!  Reggie Jackson would be proud.  3 Homeruns.The Caesar Salad had a perfect balance of saltiness and bitterness.  The Rack was cooked to perfection and lightly coated with a Dijon Herb (or as the Brits would say HER-B not ERRB) Rub.I loved this meal.  I loved this Restaurant.  If you are British be proud of Langan's...if you are an American on 'Holiday' this establishment is a no-brainer.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nVMdbAjEk4QhXgsGuHGSqw"
  },
  "iooyyQziDXz0EwgdH7f4Ig": {
    "date": "5/13/2013",
    "text": "Michael Shame's restaurant re-heats food!We were seated promptly and the service was professional.  Our duck salad was very nice, but a little more \"gamey\" than I prefer.  My wife's bangers and mash was oh so average- the bangers were good quality but without taste, the mash was nice (but add enough butter to anything and it's gonna taste good).  My Veal Cordon Bleu was awful- so dry and absolutely inedible.   The manager was about to explain veal to me (for which I would have exploded having to listen to him tell me how my favorite food should taste), but he stopped himself and said the kitchen would investigate- still a pompous response.  He came back and said he agreed with me and that I would not be charged.Here's the rub, this dish was barely overcooked.  It was CLEARLY re-heated.  There's absolutely no question about it.  Eat at a restaurant or cook at home and you can tell re-heated meat in a flash.  How could Mr. Caine put his name behind a kitchen that re-heats food, a expediter that let the dish pass by him, and a server who served it and NEVER asked how my meal was.  The breading was slightly burnt, the veal thin as paper, and the dish was crap to the eye- as I saw when another table received a gorgeous version of the same dish.I was just finishing a great two week Europe vacation and I chose to eat here for my final meal.  I could have not looked forward to this dinner with any greater anticipation and I was served crap that was seen by several people before it was served to me.  Shame on you Michael Caine.  Shame on me for letting them get away with saying this re-heated dish was simply overcooked.  Finally, when I order $100 worth of food, don't charge me a cover charge!  There's no club here.  No lounge.  No Michael Caine waiving as we enter.  I paid the cover charge when I ordered drinks, salad, and two entrees.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "sP8-a_xDC8oo7EMQTRqJ3g"
  },
  "GsIGf0xL0BwkUowDZIy-Sw": {
    "date": "9/4/2012",
    "text": "Nice place.  Professional service, and formal wait staff.We were offered to have a drink at the cramped bar, or at the small table clothed tables to the right of the main dining room.After a drink we were seated promptly with a reminder of our reservation after our drink.  In the center of our crowded and loud dining room, there is a mix of families, tourists, business men and \"lovers on the sly\".I had the pot pie with both chicken and ham.  It was served nicely and fully removed at the table, from its \"pot\" onto my plate.  This is one of their weekly specials, which they offer a different item each night of the week.  $17 pounds was not bad.The food was very good, and plenty of bread to around, sans bread plates, which I found odd and requested.  No problem.Others order some liver and such dish, which was pounded flat.  Other orders were for chopped steak.   Wine selection was nice.Overall a good experience, but a little pricey for tourists on a budget.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HzoQKKHDq9BI37dyJAAtGA"
  },
  "Lw9RAeKJbhBqT9X5ryK2sQ": {
    "date": "9/5/2015",
    "text": "Way too stodgy and salty for me. Very old fashioned - if you are below 55 of age you will feel a bit out of place! The staff were very sweet and accommodating but my soufflé which is apparently one their most celebrated dishes was just far too salty for my tastes and the fish cakes (I believe salmon?) were very dry. I really wouldn't recommend unless you want to take your grandparents to an ultra traditional French restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2g8qeK-wr6pJOVY3CNXoQ"
  },
  "li4RKPo5VDA1Jpn9px47Fg": {
    "date": "8/27/2015",
    "text": "Very traditional working mans food served properly. Try the Spinach Souflete (sp). Pies and fish and chips were very traditional and tasty. All around great experience- easy place to entertain and feel at home in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALj3JMyGnVWheJ5IuPNdiA"
  },
  "bS1g_kOq-rzBVoZC4degYQ": {
    "date": "7/7/2016",
    "text": "Would have loved to give you more stars, yet that's not in your stars.   A friend took us out for dinner yesterday stating it was a fun fixture in Mayfair.    I read some reviews and they were mostly positive, I did note someone recently complained about the microwaved veal.   I highly doubted that or figured it was a one off bad meal.   I was wrong.    I love veal with lemon and ordered the same entrée with the same result as the other Yelper, thin thin thin and dry dry dry.   Ok, the other three diners loved their meals, two have the veal shank, it was real good.   Ok, one bad dish out of three, deserves no lower than a three year me, so why a two star?   Two additional events, the waiter was insistent I order a dessert with coconut ice cream and something that sounded like pie to me.   I shared with him that I didn't care for pie, cake or cookies, ice cream alone would be fine.   He insisted that it wasn't like pie so I ordered it.   Guess what, it was like pie.   I didn't eat the veal, told him it was over cooked and thin, then I got pie.    He did bring an extra scoop of decent coconut ice cream, yet, my friend was charged for both the veal and desert.   I objected, yet his expense account could handle it, I guess.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KcqBSDp461EXqhpfapivJQ"
  },
  "A4G66RLTttq1CK5Hv0L-LQ": {
    "date": "5/18/2011",
    "text": "My Father first took me to this establishment when I was so small I didn't even know who Michael Caine was, but my Dad certainly did, in fact I believe because Michael C. was then one of the owners, dear long gone Father who - I since learnt - never ever missed a Caine Film, was probably hoping to see the great man himself hoeing into Bangers and Mash. On that day, sadly, for Dad, I believe it was a case of 'No appearance your Worship!'Nevertheless, over the years, from the time I was a mere copy-girl who knew absolutely nothing about hacking into celebrity's phones, till later in life when I learned that in order to get information out of 'political suspects' you had to ply them with grub and booze and then sort out the mash in their brains from the chips on their shoulders, I was a very frequent customer at Langan's for lunch.In those days the fish was great, the steaks were lean and well cooked - and the staff, considering they were mostly English, were a reasonably friendly lot. Which means, of course, they were allowed to drink on the job.Unlike the branch that Caine opened in Century City in Los Angeles, a city where service is first - before they even know if they have any fish or potatoes left - so, in those days, for London, the Langan's Mayfair Flagship location wasn't really too bad at all.Sadly, when I was there last - which was only a few months back, I suffered a disgusting culture shock. To use the word 'deterioration' would only be praising this once admirable eatery. Paper on tables instead of real table cloths, no sign of 'Caine' and the staff were very far removed from being even slightly 'Able' and the lights definitely so bright and strong they surely had to be nicked from a movie set - and, as for the food, well, I can't find in the three different dictionaries I prowled through, any words stronger than 'deplorable, disgusting and 'orrible' to describe it. That is without delving into expletives not becoming of any lady of the day or night!I'm sure the talented Michael Caine removed himself from the owners list long ago, because no 'Dirty Rotten Scoundrel' I know would want to own this place now. In fact, if I thought I could get my money back from my badly- battered fish and soggy, micro-waved chips, I'd 'Get Carter' in a flash.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1A48Yf55jHOM5dolYqlO0Q"
  },
  "mIcGgq-oxtuTk3JQuO0_OQ": {
    "date": "9/24/2016",
    "text": "Service, wine list, and food were all superior.  One of my favorite spots now in London.  Highly recommended",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vn8OxtvRLHscjtFd9pOAdw"
  },
  "0RK5B0SzZLFFNyWpv-UGYw": {
    "date": "9/15/2015",
    "text": "Traditional UK food, good service and nice place to eat. I had the seafood salad entree which was good followed by the roast Grouse main. My first time eating grouse and I enjoyed the meal. Profiteroles for dessert were also nice. Overall a good experience in a nice restaurant",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpDyeDRUjqGKHGbJSmJqjA"
  },
  "MgQNBplaxaqlL-BQdpI3oQ": {
    "date": "6/11/2010",
    "text": "I had the opportunity to dine here with coworkers on a Monday evening not long ago and quite enjoyed Langan's.  We had a party of 10-12 and were seated promptly in the middle of the bustling dining room.  On to the food-For a starter, I tried the avocado and prawn salad.  I was expecting full slices of avocado to go with the prawn, however, they guacamolieed the avocado.  The mushy-ness of the guacamole just didnt work that well with the prawn.Since it was Monday I went with the special of beef medallions with peppercorn sauce which was delicious. For dessert, I ordered the Treacle tart with ice cream.  I had no idea what this was and my Britsh counterparts were howling that that I was going to lose a tooth, pulled out by the Treacle.  Needless to say, my teeth are intact and I quite enjoyed this dessert.Again a very nice place for a business dinner or some other large gathering.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1CBMzn7DK58zijUX8ve8pA"
  },
  "9qRmxfkMmZpGfaifwEEJGg": {
    "date": "6/25/2014",
    "text": "Based on other reviews I thought I was in for a real stodgy evening. Surprise... Front desk group cheery and welcoming. Service professional and efficient. And, our dinner really good. Had Sea Trout with a dab of this and a smear of that. English food has come a long way. Desserts necessary. Push through the full belly and have warm Treacle cake with Carmel sauce and vanilla bean ice cream.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzmOYRBcMikhMHiAIsDXcw"
  }
}