{
  "rY0xEnuGo41WWoy-5_wWqg": {
    "date": "10/28/2012",
    "text": "I was not that impressed with Wahaca. My burrito was not as big as I had hoped for for 6 pounds (almost $10 US).  The medium spicy sauce wasn't spicy at all.  Skip this place and find some better Mexican food in London... there has to be something better than this.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1O638BDK_fWuxgTVJwff-A"
  },
  "kwf11ndjzQwRBIqjaeVtfg": {
    "date": "9/1/2014",
    "text": "It was very crowded the night we visited, and it was very hard to talk through the noise. The waiter explained the menu quickly, but mumbled a lot so we could barely hear her. The food however was really good. Perfect roast chicken with spicy green rice and the best burrito in Europe so far. The sweet potato fries were crisp, seasoned nicely and really tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8q-d3gR830GKnwOUANt2DQ"
  },
  "mrY03G5GplyjE7V7VSg7HA": {
    "date": "3/6/2013",
    "text": "After my last dramatic encounter with Mexican at Lupita, I was hesitant to try another place that served Mexican food. Coming from the States, I am also hesitant trying Mexican food anywhere else. The service was great, the waiters were extremely friendly, and the menu was good. I would not say that I was impressed by their food, but it did hit the spot for someone craving Mexican. Also recently turning Vegetarian, the menu was vegetarian friendly which was a plus !",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ds3UiUBoqHup5tEueDonhw"
  },
  "XmqMcC1VN5OGpQhaFgdU_Q": {
    "date": "3/30/2015",
    "text": "Mexican street food at it's finest. I am American and the one thing I miss about back home is goooooooddddd Mexican. Give me a pitcher of Margaritas and some queso dip....on fire! The food here is so delish. I am obsessed with the pork pibil soft tacos and chicken taquitos. Top it off with a passion fruit margarita and you will be dancing in the streets. Oh Wahaca, how I love thee.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxHbaxWSoXUXPZN2OLf8_A"
  },
  "Mt6vuwyVD52DRGgENLhnUg": {
    "date": "12/3/2014",
    "text": "I live in Los Angeles & have grown up eating Mexican (authentic & not) food. This place is mexican-inspired -- much in the same way Chipotle (a favorite of mine) is. It's a sit down, but your tapas style food comes pretty quick. I've tried about 5 or 6 items on their menu and they are all pretty good -- but my favorites are the chicken taquitos & pork pibil tacos.Their food is a good balance of healthy & delicious. It's also pretty fast. Price point is good as well. The only reason I'm not giving 5 stars is due to the lack of consistency. Sometimes my taquitos will be drowned in lettuce, others times there is too little. The pork tacos can be a bi dry sometimes while dripping wet others. They also forgot to add the toppings on my tacos once. The horchata has been amazing at times, while lackluster at others.Minus the inconsistency, this place is nearly perfect at what it does.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yo91IX-9pcwz_yTQLx9VPQ"
  },
  "o0xSINQ97g6hdARGYEm0Nw": {
    "date": "7/9/2014",
    "text": "Love the \"naked\" burritos! Big fan of the Chipotle burrito bowl, and I've never been to one in London, but Wahaca is where I go to now in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ea8jta2spziMUgH13bKVsA"
  },
  "57qyXhK1jxrfF0YFyVtKzg": {
    "date": "6/17/2013",
    "text": "Considering i am a HUGE fan of the Wahaca in soho, i was very disappointed with this branch. The service was very slow and the food was nowhere near as good as the soho or the covent garden branches.A shame.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZPrEHeYY-Q1rMQ6LxmlzEQ"
  },
  "5g1Mgw-GdT76V4T661ZFVw": {
    "date": "6/28/2014",
    "text": "Great atmosphere. Loved the decoration, and the bar has good music. Great place for drinks after work and have a bite.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhGHUAQX18_JsuOt_n-Ndg"
  },
  "OtOzlCn1DL7dB1m9mNyUiw": {
    "date": "9/12/2012",
    "text": "Delicious tasty burritos. Eaten at the branch in Westfield and had some delicious food, will be back for more here",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw81aVQdsfiVXOq2Kgl8EQ"
  },
  "F-Cjqzco6fv-PGdQibbnAw": {
    "date": "11/2/2014",
    "text": "We have had Mexican food throughout a large cities in the US -- and this was as good if not better! REALLY fresh tastes from the fish tacos (properly served with pickled cabbage) to the pork pibil to the sweet potato side and the frijoles. Our kids had the steak tacos with no complaints! Wish they would open up across the pond!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dFoEsvgL--BZEtuInuVKw"
  },
  "DM0xQBOyvQKKz0PvlYbvcw": {
    "date": "2/8/2013",
    "text": "Love the guacamole. it is strange how a fruit and some seasoning can taste so good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTJPKLMSq1JC07jPwttnyA"
  },
  "m56spNZVXKgduSTq9yTTkg": {
    "date": "5/2/2016",
    "text": "Great place in an excellent spot!  I just moved my apartment to Fitzrovia this weekend and wanted something off in a quieter section near my home and I was craving Mexican and found this place.  Unfortunately the upstairs bar was closed for a private party but it looked awesome, very modern and hip!  I will definitely go back to check it out...anyways my colleague and I took advantage of having the bank holiday off and proceed to have the chicken wings (nice spice but too dry), enchiladas (excellent), chorizo and potato quesadilla (ordinary), steak tacos (excellent) and some guacamole (very good).  Of course there were some tequila shots and beer too!  Service is what made me leave five stars as the staff was incredibly friendly and attentive!  That's why they got a £20 tip!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pu4L_r5lyoX1nFEEJYPtvw"
  },
  "ZR6AqDmOMHZSNdaQSvVntQ": {
    "date": "12/22/2014",
    "text": "Possibly my favorite chain restaurant in London, and the one on Charlotte Street has an especially cool upstairs bar section, with swing chairs and comfy couches and a generally great ambience. Drinks here are great, and the margaritas are fantastic - my favorite is the tamarind. Guac is very tasty - not fresh, as I watched them pull it out of big bags. Food-wise, it seems like their smaller plates are better. I've had the small fish tacos and the larger meal-sized portion, and the latter was very mediocre and very disappointing. Smaller haddock tacos are quite tasty. Service is not great at all, and I've had friends wait an upwards of thirty minutes at the bar for a drink, while others were getting their drinks much more quickly. Go for an inexpensive, good Mexican meal and great drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bvBtfpCgD7RTthxaTVGJug"
  },
  "ZzYqMle8VHWA2nb5QdiypQ": {
    "date": "4/25/2015",
    "text": "This is a spacious branch with some nice people serving there, so worth dropping into. Wahaca food can be hit and miss. Some of the items are bland (the black bean quesadilla), but others pack a good punch (the pork taco and the sweet potato side). I generally find that I need to load on the sauces, but both those two are tasty just as they are. The horchata is surprisingly flavoursome and refreshing, so worth a try for a non-alcoholic beverage. The margaritas are delicious though!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pJSkkQ3Rqvqgxb0pU_lwg"
  },
  "URrMmEQfbrBuD9V2nTsoIw": {
    "date": "1/19/2013",
    "text": "I went to Wahaca with one of my friends from school and her boyfriend. It was quite busy but we were seated right away. After looking over the menu, my friend ordered the guacamole with pork scratchers and she ordered the pork burrito just like me. Her boyfriend ordered some of the tiny tacos.After waiting a little while, the pork scratchers came. She devoured them. They looked pretty good but I was waiting for my burrito. Coming from SoCal, I guess I'm pretty biased when it comes to Mexican food because I can get great Mexican food for dirt cheap prices back at home. When our burritos came, we all devoured the food so quickly. The food was decent nothing to rave about but nevertheless I'd go back again. Decent service decent food. A-OK in my book.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3TslLFPk0tZlltzivN1Y6A"
  },
  "GYxgCkk71QhRWihTcbCw7w": {
    "date": "2/22/2016",
    "text": "Between the enthusiastic DJ, yummy, well-priced cocktails, holiday vibe kind of interior and a table football in the corner, what's not to like about this place? I had fun here and it's definitely a good place to start off the night (or end it if you want to be sensible and home by midnight).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zpnbBQKYFuuduMWf2B_yRQ"
  },
  "vnYAux-_Nl_3SpWYCo76yw": {
    "date": "11/25/2012",
    "text": "After various attempts trying to get into Wahacas across London (2 hour wait on a Wednesday at the South bank location - meh?!), I made it in here with I think a 40 minute wait. In this location there is a large bar upstairs which is ideal for a delicious mocktail (I'm big into mocktails, although this one was mostly ice) and some guac and chips. The guacamole I thought was excellent - fresh and punchy flavour and a well-balanced texture.We ordered the Wahaca selection which is ideal if you're lazy/indecisive/too busy gossiping to figure anything else out. What was even more ideal was that they appeared to accidentally double up at least 3 of the dishes, so we had an obscene amount of food. Overall I thought the quality was quite good - lots of nice flavours and well presented too.Service was generally pretty bad, both bar and restaurant staff seemed to forget about us. However, food was served quickly so I was basically happy.I had to check Wahaca's website to check the name of the Wahaca selection and was confronted by loads of irritating graphics and noises that took ages to load (and in fact didn't load at all on Chrome thanks to Google not providing an updated version for my old mac) and then eventually just led me to my ultimate bug bear, the pdf menu. PLEASE restaurants, stop having such awful websites. I don't have time for your shenanigans.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "H-PkEMskFjYGjFnBHtrwVA": {
    "date": "8/12/2014",
    "text": "This Wahaca is a bit tucked away and seems to have fewer people in the way of me and their guac. Win.Wahaca is always good across the board. They can tell you what is vegan and most of their veggie items can be made vegan. I usually choose the seasonal items with cactus or the taco salad which has an obscene amount of avocado in it (together with the spelt and crunchy bowl- divine). Waitstaff are always friendly, drinks and snacks come quickly. I just always love going to a Wahaca, where there really seems to be something for everyone.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "5ICAFLSUi1KIVhA9aPN1-w": {
    "date": "11/30/2014",
    "text": "The service is a little bit questionable at this particular Wahaca. When confronted with a 30 to 40 minute wait for a table on a Saturday evening, Vicky L and myself elected to skip the queues and eat under the heat lamps on the seats outside. It's late November but actually pretty comfortable outside. After a 15 minute wait, no drinks menu or server came to take our order - despite my frantic and deeply uncool gesturing through the window.  Wahaca - why bother with tables outside if you aren't willing to serve the people seated at them? Unable to wait anymore (...if the mountain will not come to Muhammed), Vicky L goes inside to give our order. Suddenly they can accommodate us inside - aka the waitress couldn't face the thought of having to add outside to her serving patch. Actually once seated we can see there are quite a few spare tables inside to boot - definitely not the 40 minute wait estimated.  Anyway the service continued to be inattentive, however lucky for Wahaca the food is pretty darn yummy for a chain. Food highlight of the night was the plantain tacos with feta, but the mushroom and cheese quesadilla was a complete treat. Vicky L and I were accidentally served each other's very different cocktail drinks but failed to notice for an hour - because they were so good. Also as the drinks are good, we decided the spacious cocktail bar upstairs might be the perfect little first date place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOH02K684lzDHKtNanaigg"
  },
  "Ds_wlYlQirgtP7sVeCy_bQ": {
    "date": "2/2/2015",
    "text": "Pros: 1. Amazing margaritas that are quite strong! 2. Delicious burritos that are big enough to satisfy you.3. Good guacamole.Cons:1. Service can be slow, especially on weekends so be prepared. 2. On the weekends the food is not nearly as good because it is so crowded. My burrito had about 4 pieces of steak in it which was very disappointing. Overall, good Mexican food and drink. But don't expect great service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5-Cn2lkmQ6274aAL5eRBNQ"
  },
  "rXXL_iT-6XVowj-kuNb_lA": {
    "date": "10/15/2014",
    "text": "Mucho kudos for serving horchata.Having a choice over cabeza and lingua (meat) would make this Mexican dining experience complete.This Oaxaca is as predictably busy as others in London, but only here can they boast of a pretty schnazzy upstairs bar/lounge. The bar and landing area can handle a large group; couples can instead opt for the quieter, secluded corners - there's space for everyone.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCOwZztY3w6KbmlETuHm4A"
  },
  "O0tQUM0AGoR2pFZrs4tj8w": {
    "date": "3/16/2015",
    "text": "Serve great cocktails and amazing food. Love the atmosphere and interior but this is not a place to go if you want a quite, relaxing meal.Perfect for a work lunch or after work meal with friends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kmsKoZe1sBsfs7ltVZdn7g"
  },
  "NpIdVRzf2EpDN-cD7WnhNw": {
    "date": "3/31/2014",
    "text": "Finally, a Mexican restaurant that tastes like \"real\" Mexican! Fairly large menu, most in small portions, so you can choose two (or three) items to try. We ordered appetizers, mains, and dessert, and were satisfied by the freshness of each. And let me just say -- get the guacamole! They start all of the dishes at the same time, and bring each out as it is ready. This means that my main dish came out a full 15 minutes after the rest of the table, and my friend's appetizer came out with her main. It wasn't even a busy night! Our server was extremely unfriendly as well. (Maybe she needed one of their own margaritas?) The night-time atmosphere is unique: floor-to-ceiling mirror, hanging lights, and tree branches on the ground floor. The first floor features a bar with comfortable seating to lounge with a drink and friends. Overall: great food, good atmosphere, quite pricey, and don't expect friendly service.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ahp0w9mCzkL1TjYqxdLEWA",
        "caption": "Photo of Wahaca - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ahp0w9mCzkL1TjYqxdLEWA/o.jpg"
      },
      {
        "img_id": "65xuLhvOdxH0tJUeYY_Tvw",
        "caption": "Photo of Wahaca - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/65xuLhvOdxH0tJUeYY_Tvw/o.jpg"
      }
    ],
    "user_id": "oJVak030sqemDJf6oKVjfA"
  },
  "-NkxTgbmsdNvBD-RN1M5gg": {
    "date": "6/2/2013",
    "text": "A solid Wahaca experience. I took a friend out here for his last night in London a few weeks back, because it was a good option on Charlotte Street, and we both love Mexican. We split the £20 sharing set, and had the chance to try a lot more than I normally would, including taquitos, quesadillas and tacos. They have great drinks, the food is always rich and savory and for £35 I fed and watered both of us.The restaurant itself is cool, with different areas that have slightly different atmospheres. The whole place is hip and fun, and the service is good. This is a different place than the Wahaca in Soho, but equally enjoyable.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "q86cs_PRuVzc8WrONWpM_A": {
    "date": "6/7/2013",
    "text": "Having never been to a Wahaca before, I didn't know what to expect. My friends, however, did. \"Get the sweet potato thing... and the corn... actually, just pass me the menu, I'll order for you\". Everything I ate was delicious and relatively inexpensive making for one happy customer. The only thing that let it down was the service. Refusing to sit us until all 8 of the party had arrived (apparently the 7 of us just didn't count) , the waiter so over enthusiastic he could have just said at the start \"I want a big tip\", and how long it took for our food to arrive. Great for dates with mates. But only ones who like to share. But who'd have friends who don't?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZqFItgRf8HQs7Qm46UegSg"
  },
  "Fe6Ntz7Ac7Bn4ebr2qCQhQ": {
    "date": "3/29/2014",
    "text": "Lovely burritos. Great for takeout.Sit down: Staff were a bit slow when we ate here. Was in a bit of a rush at lunch. Slow service, had to rush eating. Not impressed as they weren't even half full. Restaurants lacks atmosphere, perhaps better in the evening.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5vSc5wgoj-49FIw0y5BFg"
  },
  "JziNXNKbJkQ4a8wNS6zLNw": {
    "date": "4/29/2013",
    "text": "Wahaca is a bit strange. Being from LA, I'm well versed in how amazing authentic Mexican food can be. I'm a bit of a purist when it comes to Mexican, and I don't like the fake stuff. I wouldn't call Wahaca authentic, but somehow I like it. I guess because I can't get Mexican like I can at home, so this is the next best thing. I dunno. What I love about the cuisine is how simple and no fuss it is, but just so damn good. Wahaca tries to jazz things up with sauces and combinations that most mexican places don't use. That normally annoys me, but I'm going against my better judgement here and just going with it. What I can recommend are the chicken tacos, potato chorizo quesadillas, sweet potato and guacamole (overpriced, but good nonetheless - perhaps the only thing that I had that I would consider authentic). The quesadillas are weird - I've never in my life seen a potato and chorizo quesadilla before in any Mexican restaurant, but the flavor is there and I like it, so I'm not gonna question it. The restaurants seem to be quite trendy at the moment and get really busy around dinner time, so come early if you don't want to wait for a table. There is also a bar area where you can get margaritas and such while you wait, but I've not tried it, so I can't say anything about that. On a side note, I've had a burrito from the truck outside the restaurant along the Southbank and it was awful. The worst burrito I've ever had...so dry and flavorless and just no.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e1j1w_Qx_FIQucBDzT1_TA"
  },
  "CMS5hgQ9Ngk5bXLg1u7_2g": {
    "date": "12/9/2013",
    "text": "Brought a group of 12 people here and they were totally accommodating - quick to book over email (easier than the phone, actually) and our waitress was tons of fun, attentive, and despite the number of us, all our food came really quickly AND at the same time. Plus it was delicious. As for the food - tasted fresh, nothing was greasy or overseasoned. The grilled fish was especially yummy.As with most \"small plates\" places they over-recommend on the # of dishes you need per person. Especially if you're getting some chips and guac to start, 2 should be plenty. But then again if you want to hang out and nibble while you sip on some yummy tequila cocktails... why not just try a bit of everything? Prices are fineee and no one's rushing you",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TNNRmOheG5PFV7qXop151A"
  },
  "iqeavdyhZ5dum_oMBESgaA": {
    "date": "7/14/2014",
    "text": "Great Mexican street food. The steak burrito is amazing for the price, especially if you're looking for something filling... add cheese or go home! The smaller street dishes make great sharers and if you like your spice there's plenty of sauces packing heat to keep you happy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNc1ZZ9a9BnNWk9SKOhS4Q"
  },
  "EPQ8wapgNZbOV2AlL4oy4Q": {
    "date": "5/22/2015",
    "text": "Had a great time here, during a short trip to London. The pork tacos were amazing and the chorizo emenadas were just as good. I tried a couple new to me mezcal based cocktails that were very good. The bartender even took time to discuss mezcal combos I knew of from the states and he was more than happy to experiment. All around great experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qnwhKamE0rRINvOawinavg"
  },
  "sXxOvqmkSwZ7bdJSkzQR6Q": {
    "date": "4/16/2013",
    "text": "Hipsters, yuppies unite to reinvent Mexican food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrzo6epsAUau7pC-EWSPKA"
  },
  "3PrjkLEAFUSFmZjZUKtwHA": {
    "date": "7/12/2018",
    "text": "Definitely sit outside if you can. Our seat was right by the hostess stand even though over half the restaurant was empty, and it felt a bit claustrophobic. My friend and I ordered chips and guac to share. Unfortunately, the chips were stale and the guac, while fresh and chunky, lacked flavor. It's saving grace were the chili sauces on the table--I especially liked the smoky habanero one. For main, I got a Mexican bowl with chicken and it was yummy! It was a small-normal sized portion but loaded with beans, salsa, pickled onions, guac, and more and left me quite satisfied!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l4ymEXQ590mgJXqjC6oATQ",
        "caption": "Photo of Wahaca - London, United Kingdom. chips and guac",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l4ymEXQ590mgJXqjC6oATQ/o.jpg"
      },
      {
        "img_id": "hMLZXMl1ueXDGNR8wnCqew",
        "caption": "Photo of Wahaca - London, United Kingdom. Mexican bowl with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hMLZXMl1ueXDGNR8wnCqew/o.jpg"
      }
    ],
    "user_id": "ZIqfha_9skWRwmX9EOWeIw"
  },
  "nYPMzgRQtzWhZvJdcSVEfQ": {
    "date": "11/14/2018",
    "text": "Tacos are just ok. Sloooooooow service and the taquitos and tortilla chips where hard as rocks.  This isn't what mexican street food is. This is a anglo version of Mexican Street food.  The salsa verda was like water.Por Favor no puede!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9LZZrYg8i9YNFxt3jSmn7w"
  },
  "piE3WAoyG-VorIt7fvCHlw": {
    "date": "8/25/2018",
    "text": "Pretty poor service, nachos came without dip and we had to ask multiple times for the dip before it arrived. Quite inattentive despite it being only half full on a Friday night, lots of staff idling or talking amongst themselves.On to the food... it's actually not too bad. Chicken burrito was tasty with quite fresh ingredients, albeit doused in chipotle sauce. Food and drinks are quite reasonably priced as well.Overall, I hear this experience is not representative of the Wahaca chain, hope to find better at their other restaurants.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "3yWoCTHx_SOiWnouRJhKbQ": {
    "date": "11/23/2017",
    "text": "The drinks are fabulous (and priced reasonably) and the atmosphere is very trendy. Head upstairs for the cocktail lounge and enjoy the swing chairs, and the instagrammable seating areas. BUT like other reviews mentioned, the bathrooms are horrendous. DO NOT follow the \"toilets\" sign, those lead you to porta-potty style, stench-filled, horrendous stalls. Instead head over to the green door next to the upstairs bar that's hardly marked as a bathroom, the stalls are much cleaner, nicer, and much more pleasant. TIP: the mixed berry margarita is worth ordering.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybjpSy7tjupXA5znYkjDww"
  },
  "UnfAFJZOyQXgSzLXy-i0cw": {
    "date": "7/25/2018",
    "text": "Not the friendliest or attentive waitstaff. Have come multiple times, and have been treated with the same disrespectful attitude",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ARr0PrmlIo1CLvllOu7xpg"
  },
  "OFYwqizy9UDu4DnhlFDH6Q": {
    "date": "4/29/2017",
    "text": "Nice place for a work lunch!Attentive staff and they also have gluten free menu! I recently discovered that I am coeliac so eating outside is now a bit tricky because you need to ask what you can have and  the menu will shrink to few dishes called \"gluten safe\".This place was a nice discover!I had the Mexican style chicken enchiladas that was lovely and comes with beans and rice as a side. Taste was good and not too greasy.I've also ordered the basil and strawberry daiquiri which was OK but nothing amazing.Will definitely come back maybe for a dinner!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TQJ6MA2P1lEA4A2qdf_s4Q"
  },
  "RqNIEw4QERbOkvw45UOiLg": {
    "date": "11/1/2017",
    "text": "A Mexican style place but felt more as a fast food place.Fun to choose different courses and also the service level was good.Price and food experience as an average and worked fine for the family as to enjoy just some food.Large place and lots of seating so it didn't give the cosy feeling up to more than an average grade.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omk4Ashv2h1AI3GLzdrvKw"
  },
  "jVE0HpZ9Yx9uudDi99vsMA": {
    "date": "6/10/2016",
    "text": "I wanted to give 5 stars but.... the loos are horrendous! I get the gist, they wanted to make it authentic. Well played I felt like I was in a Mexican suburb. Now: the michelada is delicious and cheap, the food is well priced and fresh, the space is simply amazing and staff is professional. Totally worth stopping by.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lZGxyUK2uGcqfIlHxb0q3w",
        "caption": "Photo of Wahaca - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lZGxyUK2uGcqfIlHxb0q3w/o.jpg"
      },
      {
        "img_id": "StGIyJPGJg6zb_O7O8BXPA",
        "caption": "Photo of Wahaca - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/StGIyJPGJg6zb_O7O8BXPA/o.jpg"
      },
      {
        "img_id": "lEGhAl2s4jiYnIEm4iqE3w",
        "caption": "Photo of Wahaca - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lEGhAl2s4jiYnIEm4iqE3w/o.jpg"
      }
    ],
    "user_id": "eof5BdqbG0dSVTWRyLj_2g"
  },
  "NIoA2_2RzuY7GrcMcB7BEw": {
    "date": "7/19/2015",
    "text": "As a Californian and avid lover of Mexican food, I came here with low expectation (it's London, you don't come for the Mexican food), but I was throughly surprised. It's also a chain in London, so even more reason to set the standards low. My boyfriend and I shared the plantain and the steak tacos, salmon and crab tostadas and a chicken quesadilla from the street food menu. They were all quite delicious. Great flavours and just the right amount of food. Although, I don't think I will get the tostadas again. The toppings were great but it was basically on a stale tortilla chip. We had the churros for dessert and a hibiscus and a classic margarita which were both delicious. Save room for the churros.I would definitely come back here for some happy hour margs with the ladies as well as a yummy dinner. Also, service charge was not included so the service was better than average London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dzg8p8eSo_8S1ep_bYs-Eg",
        "caption": "Photo of Wahaca - London, United Kingdom. Churros with caramel sauce, so good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dzg8p8eSo_8S1ep_bYs-Eg/o.jpg"
      },
      {
        "img_id": "RxreMlO7dKLBQm7SFnVi5A",
        "caption": "Photo of Wahaca - London, United Kingdom. Salmon sashimi \"tostada\" which was more like just a large tortilla chip, but good flavour on top.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RxreMlO7dKLBQm7SFnVi5A/o.jpg"
      },
      {
        "img_id": "3LoBUxKYQ2Oy16j4nI19kw",
        "caption": "Photo of Wahaca - London, United Kingdom. Plantain tacos and steak tacos. Hibiscus and classic margaritas.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3LoBUxKYQ2Oy16j4nI19kw/o.jpg"
      }
    ],
    "user_id": "h60yWLFyntYFF8jpAJsXfQ"
  },
  "WddtV6dettEa5IPkpTLHcA": {
    "date": "1/18/2016",
    "text": "Wonderful food. Great street food options plus the usual suspects. All freshly cooked and very tasty! The rooms are bright and inviting. I'd go again like a shot if I was in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jrJ6FWrM3VK5aeY_3V2dBg",
        "caption": "Photo of Wahaca - London, United Kingdom. Free gift of chilli seeds. Cool!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jrJ6FWrM3VK5aeY_3V2dBg/o.jpg"
      },
      {
        "img_id": "QHbrMi40QFSzdwcUPl7iTA",
        "caption": "Photo of Wahaca - London, United Kingdom. Churro a with chocolate sauce. Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QHbrMi40QFSzdwcUPl7iTA/o.jpg"
      },
      {
        "img_id": "rEWBjxCqFuxiJO69Nh4jbQ",
        "caption": "Photo of Wahaca - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rEWBjxCqFuxiJO69Nh4jbQ/o.jpg"
      }
    ],
    "user_id": "2GbY5VsA-sJ-_pjrVnVAtQ"
  },
  "dt7mmyumY3Tb5haiAkum2Q": {
    "date": "4/11/2017",
    "text": "Good service with Miguel, good environment, food came out fast. I had the chicken ensalada which was tasty. Only reason I give this 4 stars is that it's not that much food for the money.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PbaFHKN1lz2ED7uzqmy3ZA"
  },
  "bWsjGq54B_nAw4rvrVTDoQ": {
    "date": "3/20/2016",
    "text": "Wahaca manages to achieve the almost impossible mission of success without decline. Each branch that opens has a slightly new take on the bright Mexican street food eatery selling healthy South American tapas and the best tequila in town, all at mega affordable prices.  I have never had a bad meal or a bad margherita at Wahaca. These guys know what they're doing. Whether it's a crunchy chicken ceaser tostada, a crispy sweet potato & feta taquito or a delicious pork pibl taco, the mini dishes are a dream. Load up and enjoy! The bigger dishes are great too, whether you're into fish tacos, burritos or a salad where you can literally eat the bowl, it's all great! Make sure you start off with THE best guacamole and chips, and end with the decadent churros with chocolate sauce to complete your Wahaca experience. And don't forget the tequila! This location had a tequila bar upstairs so you can relax of an evening with a range of margaritas and some chips and dips at your side! They also have a lunch area for take away burritos on your lunch break. Amazing. The restaurant area isn't quite as comfy and fun as other locations, but the food is still great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W41-ZkAIjOTx_ftYMdUAUw"
  },
  "lsub0aeu6eyIzxOe13oEOQ": {
    "date": "2/24/2017",
    "text": "Decent but not what I'd call authentic.Almost like a British version of an American version of a Mexican restaurant. Guac appetizer was a little soupy -- I wish restaurants just used fresh Avocado rather than some mixture that seems liquid-y or blended a bit too much. Burritos were good .... the little tacos sounded interesting too and the £1 special for 3 made them appealing. I'd go back but I wouldn't rate it as \"the best Mexican\" option I've found in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "90vrCBl4vTCbrxDrHqy7nw"
  },
  "uckAK5tkY6eeQKia_iI5OA": {
    "date": "7/6/2015",
    "text": "OK so it may have been an after-work peak time but service was exceptionally slow... waiting 30 minutes to be asked if we'd like a drink or water was the tip of the iceberg because it took another 20 to get it. Service aside, I wasn't super impressed here... the salmon ceviche tostada wasn't as fresh tasting as you'd hope, four of our dishes came out together... fine.. .then the tacos came out 20 minutes later... we almost forgot about them.... ....I've regressed back to the service.....sorry! well.... make a day of it, or just go to waitrose and make tacos at home.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "4DVOi2Gs4Z45aMhVF_niYQ": {
    "date": "6/30/2013",
    "text": "Great food, great location, great service! I would always suggest ordering a few dishes and share among the people to go with. Share a little bit of each but never miss out on the Burrito. It is amazing!! And take it with cheese!!! Wahaca does not come cheap if you order a drink and food but you'll enjoy great food and a good atmosphere. On weekends, expect to wait for a table (up to an hour) - no reservations!In the end, it is all worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "vgQ0injDOypxAfNzkmZhlg"
  },
  "8G28VBZztXiUAAZwxnOykA": {
    "date": "9/27/2015",
    "text": "Amazing Mexican food with a friendly, Mexican street market feeling. Good variety of food downstairs, a cocktail bar upstairs if you're thirsty and they do take away!!! The chicken quesadillas are AMAZING",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s626koNrReH_IFvjKae3_A",
        "caption": "Photo of Wahaca - London, United Kingdom. Chicken enchiladas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s626koNrReH_IFvjKae3_A/o.jpg"
      },
      {
        "img_id": "c9fAdL305ZtJRy87gzyLnA",
        "caption": "Photo of Wahaca - London, United Kingdom. Rhubarb mezcalita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c9fAdL305ZtJRy87gzyLnA/o.jpg"
      },
      {
        "img_id": "4LT1pnqQ7mNbjAQomwa0Ow",
        "caption": "Photo of Wahaca - London, United Kingdom. Lovely chicken quesadillas and cactus & corn tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4LT1pnqQ7mNbjAQomwa0Ow/o.jpg"
      }
    ],
    "user_id": "MBkS6x3Isl7d0AJnSQM87Q"
  },
  "E4lupWzlmLs9ccMOgLIzPw": {
    "date": "7/11/2016",
    "text": "I come from Southern California, and I feel like the Mexican food here is poppin' since we live close to the Mexican/Californian border. I can get tacos from a taco truck in Santa Ana for $1 (£0.77 ) that taste better than what I tasted at this restaurant. We ordered food and every plate came out at random times. The mains came about 10 mins apart, so by the time I finished what I could eat, the other person still hadn't received their main dish. Here is what we ordered:1. Mexico City style chicken enchiladas - no flavor and totally not worth the £9.95.          ----came with nasty re-fried beans and overcooked and just awful rice2. Chorizo topped frijoles (£4.50)         -----Chips tasted old and the beans were awful3. Pastor marinated grilled chicken (£11.95)    ---- This was the only edible thing in my opinion.     -----The bed of rice included in the plate was also overcooked and tasted awful.The manager did comp 15% off the bill because the rice was indeed overcooked, but we didn't enjoy our meal here at all. Even with the comp we still paid around £35 I believe. I really don't like leaving a restaurant feeling hungry and this is what I felt like after eating here. I do need to state that if this is all that London has to offer in terms of Mexican food then the people of London are being severely let down.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S2sMGbTa6wYpdfLA_Teetg"
  },
  "zFZkisFf86ddjeP-x8gcUg": {
    "date": "2/4/2013",
    "text": "Walked in on a Friday night and didn't have to wait to get a table. Our server (Erica?) was super friendly all night and helped us to pick out our dinner. Between four of us we ordered, the guacamole, pork tacos, steak tacos, barbecoa tacos, chicken taquitoes, chicken quesadillas, bean quesadillas, potato quesadilla, slaw, and sweet potatoes. We ordered double of a few dishes and boy were were stuffed afterwards!The pork tacos were the all around winner. The only dish we were slightly disappointed with was the potato/chorizo quesadilla. There was just too much potato and made it a bit bland.The food came out quickly and we got a few drinks. The tamarind margarita was awesome. I'd definitely come here again cause the service was great and the food was tasty!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrGFc2IUccf2sKcvLc78LA"
  },
  "h0H5WXgiJ3517Z9QtJtY0g": {
    "date": "9/28/2012",
    "text": "I''m a huge fan of Wahaca. HUGE. Why? Because the food is so good it can even trump some dishes from home in Southern California. I came to this location for a promotional free burrito deal and I was not disappointed. I actually ate my burrito 3 hours later and it was still amazing. Oh wahaca how i love thee.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "izL-dgYeHSn_yPG8x3hL0A": {
    "date": "3/22/2016",
    "text": "Wahaca makes this America  girl smile. Closest thing to Mexican food you can find in  London.  Love the street food style dishes...it allows you to try a little of everything! Their margaritas are super delicious (I love the passion fruit one!) Everything is super fresh and  not too heavy. I love their wide variety of veggie options too.  Fun atmosphere in a great neighbourhood.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  }
}