{
  "joowET5H59zoyYLGelqI-A": {
    "date": "11/21/2014",
    "text": "Love this place! so many fun rooms, amazing history, great ambiance. If I lived in London I would frequent here. It does get busy and can be difficult to maneuver after a few pints so its more of a casual drop in for me and not a night out type of place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rd_k48XNACxaSBN0D8uk3Q"
  },
  "Dc2kIAOcJFH-xHpT2X8bNQ": {
    "date": "12/19/2012",
    "text": "Monopoly Pub Crawl - Stop #16 - Fleet Street (Red)Time to break into the red color group and what better place than Ye Olde Cheshire Cheese? This is my favourite pub on this crawl and is definitely not one to be missed. This is one of the oldest pubs in London, and as Ben Y said, it's in fact older than the USA. Yet despite its age, the Cheshire Cheese isn't a stodgy pub stuck in a different era, but rather a fairly vibrant seductive pub hidden in central London.The interior is segregated into a number of bars and seating areas which gives you quite a variety to choose from. We crowded into the beer bar area which offers a in house brew  that is light and hoppy (think Leffe) and quite delicious. You can also get your full range of Belgian and other top range beers. There are also some fruitier options for those that aren't partial to the bitter stuff.Dark wood panels cover the walls and are decorated with random bits that seem to be have been collected over the years. It gives you a feeling of calm and provides an oasis to relax after a busy day. Unfortunately, we had no such time and were off to the next one! But I'll definitely be back one day to really enjoy Ye Olde Cheshire Cheese as it deserves to be.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "u-2KZDz6rWsX1Q5Pli7rdQ": {
    "date": "6/6/2015",
    "text": "Sorry to report that The place has fallen hard times. We stopped in fir a late lunch on a Saturdsy (1400hrs) and the staff was so rude and non service interested we left and went down the street.  Not worth a visit to eve darken its door.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTRWLLeYx5O3eySrlxs8HA"
  },
  "ACNWQNPV-C5sJ7INMKQApQ": {
    "date": "4/28/2015",
    "text": "It does get a bit overrun by tourists at times, but the downstairs rooms have a great atmosphere and there's something to the place that keeps me coming back. Beer selection is ok, bar food is fine. I've eaten dinner there once, and thought it wasn't all that great. Four stars for the ambience and the history.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FZ-s6urV2V_cHFmUT6Nt_Q"
  },
  "IcoZvDYfyLlKu6tO0IBNpw": {
    "date": "2/1/2016",
    "text": "Quite easily the coolest bar I've ever been to. This place was RE-built before America was a country - let that sink in for a moment. Grab a pint at one of the bars, and wander around to the various rooms, including the cave like carve out with extremely low ceilings.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6gDy6VvbEg0V-6FznieuA"
  },
  "oXXB3h4bH7LSz3Hx9X3Y1w": {
    "date": "5/4/2015",
    "text": "If you want to get a feel for real a London pub, there is no finer place. The signage is a dinky little lantern and the original doors and fixtures are great. They even have sawdust on the floor to keep the original feeling! a long list of the royals who have been in the monarchy whilst the pub has been there all adds to the overall ambiance. Its dark, it's small, its reasonably priced, though you couldn't be there too long, one drink is enough to soak up the atmosphere but a must see for out of towners!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uawJPlGG447N1lQpnATYgg"
  },
  "fLoek8he4upqys2yBsBBYg": {
    "date": "7/22/2012",
    "text": "This is hands down my favorite pub in London, or better yet, my favorite pub EVER! Love the atmosphere with the multiple areas (with their own bartenders) for unwinding. I think what made this place unique is when we had to use the restroom that's in the basement and saw more stairs to head lower for more bar areas, and then it goes even lower and we are now drinking in a cave like area. This is the second oldest bar in London, so I figured it would be very touristy, but this to me, was my favorite relax spot for a pint or two or three.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-4qwL9LI6FFBfJUeO5w1KA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-4qwL9LI6FFBfJUeO5w1KA/o.jpg"
      }
    ],
    "user_id": "eHmlxL9Jme-CvuV5SqQVwA"
  },
  "emFNIVRjb6U6R8J7qzaG4A": {
    "date": "4/2/2016",
    "text": "Went here for the first time in years. Had forgotten what a lovely place it is. Don't try and find a group of friends downstairs as you're mobile won't work and there's so many different areas you might find yourself hunting around to find each other. And I'd avoid stillettos if I where you, the floors are a bit of a nightmare. But have to say I'd forgotten what a lovely place this is!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j8AUaF4r7H2YNOc1OVpQkA"
  },
  "U_DVrrI3KyjRNgxuxAmuyw": {
    "date": "3/7/2012",
    "text": "#513 Having dined at plenty of old and historic establishments, I wasn't blown away by the antiquated architecture of the Cheshire Cheese. Instead, I found that the short ceilings and tiny steps kick-started my vertigo. Seriously, walking down to the cellar, I was slightly concerned that I might tip over and fall straight down the stairs! But, of course, that's a personal problem that the Cheshire Cheese can't help. Regardless, I was surprised that food was only served down in the cellar during the lunch hour. But, Adam B. and I had no problems with that. We actually went straight for the largest table just because we were in need of some sprawling time. We had to wait a little while for the rest of our party to show up, but I got myself a nice, bottled ginger ale to sip on and enjoyed soaking in the authentic British aura that the bar oozed all over. Once we were ready to order, I walked over to the bar to get myself a Scampi entree. Unfortunately, they tack on a 1-2% card fee to cover the credit card company's charge. So, I ended up paying about 12gbp for the Scampi and a side order of Calamari. The bartenders were nice enough to bring our orders directly to us since we were sitting right in front of the bar and it didn't take too long. My Scampi was absolutely delicious. It was fresh and fried to the perfect crisp. I couldn't even finish all of it! The chips were also a crispy delight, but the salad left a little to be wanted. You had the usual tossings, but they added too much vinaigrette and I ended up picking around most of it. I wouldn't say no to a second order of the Scampi though. There were hardly any parties when we first got there, but over time the place started to fill up. People were clearly eyeing our table, so we finished up quickly and headed out. I say that this place is worth the visit for the historical factor, but otherwise, it's just your usual pub!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNQylgySLXYSiAe3i_nvYQ"
  },
  "0QVFdoc1QUh-DV38QqRNIg": {
    "date": "4/22/2014",
    "text": "TOURIST TRAP. Sure the place looks charming-- but DO NOT eat here. Come, take your picture, have your beer and leave, ASAP. This was the WORST food I had in London. I ordered a \"spicy chicken breast\".. what I got were three chicken tenders with some fries and a few greens. It was just horrible. My husband ordered a burger, which was worse than an American school cafeteria meal. Also feels like a cafeteria since you basically serve yourself. Yep, pickup your food at counter and haul it to your table. Everyone in there had a backpack, which should have tipped us off.  Just awul.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohtJIP4gBmCa6bKgvaYZqA"
  },
  "2r9PrmnhKSCnHCPTxO8Y2Q": {
    "date": "9/3/2012",
    "text": "cute bar!everything in london is super expensive but not this bar! it's in a little alley, and has about five levels in the basement. looked like a dungeon but has character. we went about 5-6 ish so there's a lot of people just getting of work. lots of young people just having a good time. cheap beer and i liked the chicken mushroom pie.good stuff!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-d2daWmftYumOaYpbD5D8Q"
  },
  "MBo7G9ByE3ob4T05QjSQ0A": {
    "date": "7/3/2014",
    "text": "We went to 3 Sam Smith Pubs.The ChandosAnchor TapYe Old Cheshire CheeseThere are about 40 Sam Smith Pubs. I wish we could have known about them the first day we there. For the most part they are very similar.First and foremost, their beer is great and very reasonably priced. My wife loved the Teddy Lager (she is more of Blue Moon type). I got the Extra Stout and it was excellent. I can see why the English drink so much.Second, we fell in love with a dessert called Sticky Toffee Pudding. The locals get the pudding topping but we went with the ice cream. The size of the scoop of the ice cream did vary from pub to pub.Third, was the food. We tried different items each time (except we did order the Fisherman's pie and Bangers & Mash twice). The food was ok. Nothing special. The fish on the Fish & Chips were good but the Chips were not crisp. I would recommend getting regular peas instead of the Mushy Peas. I thought they would taste similar but they don't.In all the pubs you order at the bar and sometimes you pick up your own food and sometimes they bring it to you. Could be it depends on how busy it is.The service in all the places were very good and the female bar keepers were very friendly.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nujl6gOabdHI1ROSKqJm9A"
  },
  "ARnIbHQHM5vVykHwlJAlYQ": {
    "date": "11/27/2012",
    "text": "Perhaps I'm generous with this review, as this was the first decent meal I've had in London (two days in). But I thought this place was quite solid, and central to many of the offices in the City.Per the other reviews, I went down to the basement bar (down some series of levels and twists and turns -- at least two floors below street level) to grab dinner and beers. Sure, many of the accents I heard were American or otherwise foreign -- but London is a global financial hub, after all. I ordered a Shepherd's Pie, which came with fries and veggies, and a pint of the extra stout house beer. Both were quite good, and the total for both was GBP 9.65. Not bad, for this area of the city. I went back for a chocolate pudding and a pint of cider, and the total for that was GBP 6.95 (mainly due to the higher price of cider vs. stout). The chocolate pudding with custard was actually really awesome -- quite memorable, and a great deal at GBP 2.70. The bar is unpretentious, the service decent, the decor interesting, and the buzz is quite nice. I'm sure I'll be back before I leave London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LTWUnGE5dCVGFsKuwuWV9A"
  },
  "1-6_LXEqkOCCYOVNnd0qcw": {
    "date": "10/11/2011",
    "text": "Have you ever heard the phrase \"Polly wants a cracker\"?  Well, if the story I heard from the bartender is true, it was invented here.As we sat drinking our many pints of Samuel Smith's various ales and talking with a couple of scots we met (who bought us many of those pints), my friend inquired about the stuffed bird in the glass case above the bar.  Apparently, back in the day, (way back) many of London's journalists and writers would drink there and they taught that bird, Polly, all manner of dirty phrases.  One of the favorites apparently was \"What will you have to drink?\"  Polly would respond with \"I'd like a scotch.\"  Apparently, Walt Disney visited and heard the story.  At that point, he decided to make Polly a part of Pirates of the Caribbean and thus \"polly wants a cracker\" was born.The Polly story is the only introduction that you need for this place.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 7
    },
    "photos": [],
    "user_id": "mzL0zHFGyd9866OUljq49g"
  },
  "Mb0uXrmH3CxUw4_F_GEYxg": {
    "date": "7/28/2012",
    "text": "In light of the 2012 Olympics, I've decided to review some places in London that I've tried out to help our fellow travelers find places to eat with that traditional British flair. I found Ye Olde Cheshire Cheese Pub on Yelp, as a devoted follower I was happy to see that this place had a lot of character to it. It is one of the oldest pubs in England rebuilt in 1667 as it burned down in the London Fire so you can trust you will really get a feel of cultural England in this place. Dark and kind of dimly lit with wood that has warped through the ages this pub, like The Blue Anchor, is a pub out of time. A pub that has been frequented by old English author Samuel Johnson, and perhaps more famously Charles Dickens, this pub gives you a feel and taste of old English HistoryThe food here is relatively good, staying true to the traditional British foods, there are plenty of helpings of traditional roast beef with Yorkshire pudding, lamb shank, and roast pheasant. The food is excellently prepared with a heaping helping of potatoes on the side. The food was well cooked, most came with a lovely gravy. The man serving us was an elderly man who seemed to be very happy to help and incredibly knowledgeable about the pub itself. Overall, not a bad choice. I, myself, am not a fan of traditional British food but if you're looking for a cultural experience and a pub with character I would recommend Ye Olde Cheshire Cheese. It is small and the dining room is a bit small and cramped. There are several rooms separated for the pub and a eating area, and a restaurant so make sure you're in the right place. It is a Samuel Smith Pub so it only serves that specific brand of Beer and Cider. All in all, a good restaurant with a Doctor Who time traveling feel. It is, a pub that truly has stood through the ages and earns the albeit hokey title of \"Ye Olde.\"",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LRI0mAoTfhWIhU1FBIJ0cQ"
  },
  "P48_K4btx4ILcFDXegNKrA": {
    "date": "7/5/2009",
    "text": "This is the second time I have eaten here and both times were great fun.  This is the most interesting restaurant I have ever eaten in.  In reality it is multiple restaurants in one.  Every section is a different menu and motif.  Last year we ate at the upscale section, this year we ate in the basement pub.  The most confusing part of the entire restaurant is that each area has its own hours.The food is consistently good and the service was excellent.  We had beef shepherds pie on our last visit and it was very good.  Last year we had fish & chips and I forgot what else.The entrance is tucked away in an alley so you have to keep your eyes open for the little signs.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "bXmJD9Xcr8H1wgIkjC1Blw"
  },
  "iHJc4mrxBmvx3teMMI-yLg": {
    "date": "4/11/2014",
    "text": "Had to make a stop here, heard it was the oldest pub in London still in operation.  Cool old building.  We got a table way downstairs.  Had a few drinks and I went with the fish and chips.  Chips were perfect, crispy on the outside soft inside.  Fish was just good.  A little greasy (but then again, fried, is fried) great for the atmosphere, \"rebuilt in 1667\" that place has seen some things!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TyCZDhjgP5eNSFLnKxc86w"
  },
  "qXvfp8Cb6tc96SL6DOpi0w": {
    "date": "11/2/2014",
    "text": "This pub deserves 5 stars not because it is on a technical level the best pub, with the best seating and dining arrangements and the best choice of beer and ale. This pub deserves it because it represents a time capsule of an era really long lost, of an easy going culture, with a dark and dingy atmosphere of the Victorian times and before, which although doesn't seem like not something to be romanticised about in our electronic age, but yet is something we search for all the time - to be secluded in a hole engrossed in our own thoughts without being barged in upon constantly by notifications. That very feeling is there in this pub, unchanged in its dark wooden surroundings, an almost Gothic feel captured like a photograph, and all this, even though it has fewer seats than one would like, making it quite frustrating to visit it on a sunny afternoon. The beer/ales are good, and on future visits, will try out the food as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1gLJvyU9-KAPsK7omgXloQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Look up to find this as you enter the bar area.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1gLJvyU9-KAPsK7omgXloQ/o.jpg"
      }
    ],
    "user_id": "HW8EgSawK-MyQ_onz923ww"
  },
  "d_R8lOIPNzYHa8UCWKHa0w": {
    "date": "8/2/2014",
    "text": "Very good pub in the city Of London.  Great atmosphere,  Can be a little touristy.  Good food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "83zQAHCvZGYgm8bjQoJ5wg"
  },
  "cEpc9CjCCsa6ernKdUemWQ": {
    "date": "10/24/2014",
    "text": "Didn't eat here as it was a Friday night and very busy. Great little pub. Many nooks and different levels/areas to hang out in. The Samuel Smith beers are very good. Couldn't get a seat anywhere but thoroughly enjoyed drinking at the different bars within the pub.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJGAMht_lekIYKVyQyomPw"
  },
  "_q0LOuQ-nhBuWRdXSUXLFg": {
    "date": "11/25/2015",
    "text": "Loved the history, but too crowded, too loud when crowded, and to our dismay, a more limited beer selection upstairs (the only place we could find a seat).  Did not eat here.  I get some people like shoulder to shoulder pubs full of noise.  Not me.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvVe8LaHBuhjEw6GvjhOoA"
  },
  "yAUWlEdM0PKAuwNSe7fIxA": {
    "date": "5/22/2014",
    "text": "I couldn't not go here since it's the oldest pub in London. Like Suki B. said, I loved everything about this pub.I liked:1) How it's in an alleyway off a main street2) How there are like 3 bars/dining rooms3) How the walls are all dark old wood4) How the ceiling is low in some doorways5) How they serve amazing draught beers from a cask6) How the fish and chips were exceptional7) How the mac and cheese had a British twist I've never tasted (it's called Cheshire Cheese)8) How it wasn't crazy busy when I went in the late afternoon9) How the prices are very reasonable (like £2 for a brew)10) How lots of locals actually go here and doesn't seem like a tourist trapWith these things said, I highly recommend coming here not only because of the history, but because of the great atmosphere and yummy food. The fish and chips were great but not the best I've had. Get the mac and cheese for sure. At the least, you must grab a beer and wonder which random famous British people sat where you are sitting.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "82dCHyU-ANOgdhxUgZsUeg"
  },
  "PG6tjerFVGfijc7nTzbzPA": {
    "date": "2/23/2016",
    "text": "Went here with coworkers due to it being taunted as the oldest pub in central London. The beer is good- all Samuel smiths. Service was quick and friendly. I really enjoyed the different, very unique rooms that were throwbacks in decor and materials to when such people as Dickens actually drank and wrote here. Another famous celeb is the parrot from \"Polly want a cracker\" fame...he can be found stuffed and on a shelf in the first room after entering the place. Also loved that there were a few fireplaces with coals burning warmly in some of the rooms. All in all a very neat, very cool pub. Although a bit touristy (I was a tourist more or less, so not complaining!), still comfortable to have a few pints with friends, and maybe write a novel or two while there as well. Also, try the fried cheese, it is fantastic!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BsgfHcD8voeleNtlZK7GVw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Ye olde Cheshire cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BsgfHcD8voeleNtlZK7GVw/o.jpg"
      }
    ],
    "user_id": "8tXHM0mQ20S5pxkxRPGbJA"
  },
  "ryUSxtPdVGkaYd8HS8mqQg": {
    "date": "3/6/2016",
    "text": "Cool pub tucked into a small alley off Fleet Street.  We came here under a recommendation from a friend.  The atmosphere is friendly and relaxed.There are a number of levels and rooms tucked away so it may come across as quite the maze.  We ended up in the lower cellar floor.  Be careful of your head as you duck down to go to the lower levels.Service was good and the Steak and Ale Pie even better.  I ordered the Organic Wheat Beer which I loved.  My hubby ordered a number of different lagers--all good.A definite must try if you are in the area!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpaRcm8j5vC1C-Mjor_12w"
  },
  "MgndRn_SSFJEjf6oNCwjXw": {
    "date": "12/15/2016",
    "text": "I just love the history of this bar. Many levels of caverns and places to hide and drink. I felt transported in time. Also Samuel Smith beer is excellent!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tIZS7vUsc-HSm29SUzrLxA"
  },
  "kzr_kisz2HvBM9tgQ4besA": {
    "date": "7/14/2017",
    "text": "found this place during a recent visit to London.  Great beers and fish & chips.  Would come back again next time I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCyx_2khOx41T1P6Qnxl8g"
  },
  "tSJvXczk9Dht6j4-kg-XfQ": {
    "date": "8/15/2015",
    "text": "This stop was a highlight on our trip to London.We read about it in the Frommers guidebook and hit it on a weekend afternoon. Surprisingly, there were very few people there. The service at the downstairs bar was fast and friendly.We LOVED the cozy, unique \"drinking rooms.\" That we were drinking a pint where Charles Dickens once drank was a fact that thrilled my husband. The fish and chips were fantastic, the  chicken pie went over very well with my kids, and the custard did not disappoint.We should have gone back a second time. Really, truly a highlight.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1J87dFZT5VspbEZm5SWHAQ"
  },
  "HX8pjjBcwsauM-ZpvDOSJg": {
    "date": "9/23/2015",
    "text": "Literature nerd alert!! One of the oldest pubs in London, Ye Olde Cheshire Cheese was the drinking establishment of choice for famous writers. Legend has it that Charles Dickens wrote A Tale of Two Cities here, W. B. Yeats threw down some poetry, and even Sir Arthur Conan Doyle was inspired by a proper pint of Ale. The very environment of the pub arouses one's creativity. With dim lights, low entryways, and a fascinating labyrinth-like layout it is no wonder authors were driven to write. Although they don't really have a great selection of pints, their ales were creamy and tasty and certainly offered a greater variety of Samuel Smith beers than we're used to in the states. As a good little tourist I had the fish and chips with mushy peas, and my wife had the steak and ale pie. As my first meal in London, it did not disappoint! The fish was crispy, tarter sauce tangy, and the pie was meaty and flavorful.A truly magnificent place with friendly bartenders and a rich history.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QEXsDThdCw2Zfb8OLBKRqg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QEXsDThdCw2Zfb8OLBKRqg/o.jpg"
      },
      {
        "img_id": "QwpZg5QuQ9jZVsAbf-YdgQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QwpZg5QuQ9jZVsAbf-YdgQ/o.jpg"
      },
      {
        "img_id": "fALrcc45OGCAackCjgns0A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fish and chips and steak and ale pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fALrcc45OGCAackCjgns0A/o.jpg"
      }
    ],
    "user_id": "bEXTFtJye9fsAk-4l2goqQ"
  },
  "ZoZUjmNj_bVpO9KsIr_UXA": {
    "date": "7/22/2017",
    "text": "Great pub for the atmosphere and drinks. We didn't try the food and kids aren't allowed in the evening so we couldn't stay long with our boys, but highly recommended stopping by for a pint.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "An_SJ1XX5h-uZzKNqhRgbQ"
  },
  "3wPD-APoBJUHPT3egNbgzQ": {
    "date": "3/30/2014",
    "text": "Loved everything about this pub - it's one of the oldest pubs in London, which made the experience even better. Located on Fleet Street, keep your eyes peeled when looking for this place. It's tucked away in an alley and can be easily missed. We walked right past the alley a few times before finally finding it. There are three levels, you have to take a flight of really tricky stairs to go to each. You literally have to hunch down to get through - I hit my head going back up when we were leaving, so be extra careful. We went down to the 2nd level and found some seats. The place is really charming. Loved the ambiance - it's dark and candle-lit, but still very lively. Definitely felt historic. As we sat down, there was a huge group of Brits trickling in for what seemed like a family reunion; they were having an awesome time. It kind of felt like we were watching a British movie, haha! You seat yourself and to grab drinks and food, you have to go down to the basement level, which was my absolute favorite. Sadly, it was way too packed, so we couldn't find a seat down there. Their fish & chips were DELICIOUS! Just what I had been searching for. Definitely the best I had during my trip and believe me, I tried it at several popular places.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T3uweQYK0vaPfVSb0YQ9mQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. The middle room.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T3uweQYK0vaPfVSb0YQ9mQ/o.jpg"
      },
      {
        "img_id": "XFkJJLg_NhNAVuYMhIsFiQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. The entrance is in an alleyway. You'll miss it if you don't pay attention!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XFkJJLg_NhNAVuYMhIsFiQ/o.jpg"
      },
      {
        "img_id": "DEAiD6aHp5kf6qNRgQPBjA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Hands-down the best fish & chips I had while in London!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DEAiD6aHp5kf6qNRgQPBjA/o.jpg"
      }
    ],
    "user_id": "UNbRVJql-hopPSuvYmsDmQ"
  },
  "vyU3RN_m4gj0ZhPpN4nEHw": {
    "date": "1/25/2017",
    "text": "I'm going to be honest - I totally went here because of the awesome name. Then I found out about the history of this landmark pub and was even more delighted. We were seated in the cozy corner, which was this really cute little corner surrounded by curtains. Service was fine. We had the cheese plate and the goat cheese salad (had to go with cheese, given the name). The salad was just ok - small serving & not much of a salad to speak of, just some lettuce surrounding the cheese. Cheese plate was also quite small, but the cheese selection was ok. The cider, however, was lovely. Would recommend this place for its ambiance and drinks selection, but would not order food again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAjUKa-wE-OCaMwMaMzY6Q"
  },
  "yzf4M0gDAlxUpxWyH2toaw": {
    "date": "3/11/2012",
    "text": "It's not everyday that you get to eat and drink in a pub whose history predates that of the establishment of the United States. Rebuilt in 1667 after the Great Fire, this historic pub can claim Charles Dickens and Mark Twain among its former patrons. Everything from the alleyway entrance to the winding stairs leading to multiple basement levels gives you the sense that Ye Olde Cheshire Cheese is from a different era.We settled in the basement, which resembled more of a dungeon, for lunch. Wanting to get a taste of traditional pub fare, I couldn't turn down trying ye famous steak and kidney pie. The flavor of kidney overpowered the steak and pretty much anything else on the plate. It was then that I realized that I'm not a fan of kidney. On the other hand, the fish & chips were outstanding. But, it would have been nice to see them have some homemade tartar sauce rather than have them in packets. All the specials are £8 and most of the main courses are £5-6, which makes this pub quite the affordable place to eat. The portions are also quite large so the half pints of beer or cider are perfect with the meals.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xt4d1r2ZIujMtoFRCwDcRQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xt4d1r2ZIujMtoFRCwDcRQ/o.jpg"
      },
      {
        "img_id": "bwTrSefhaD7MdW0t2OsB1Q",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Ye famous steak and kidney pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bwTrSefhaD7MdW0t2OsB1Q/o.jpg"
      },
      {
        "img_id": "0dpGpmmW5lKOOeFGVgXKbw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0dpGpmmW5lKOOeFGVgXKbw/o.jpg"
      }
    ],
    "user_id": "fgkJ6KUlrmbKyLDQervxsw"
  },
  "66QUrYxMzfSHrs6SogWZWw": {
    "date": "9/24/2013",
    "text": "I think for the pure historical aspect of it, this place gets five stars from me, hands down.I also think I must be the WEIRDEST person they have ever encountered, ever. I came here on a rainy day when I was wandering around London by myself. I had gone to a couple of places early in the morning and managed to check off a ton of things on my list including an awesome little coffee spot that I found near this area to have a sit down, legitimate, cup of joe - complete with latte art and all.When I showed up here, it was tipping 11:30am. I was pretty much the only person in here because they had opened at 11am. The lunch service was not available until 12, and I had other places to be on my crazy whirlwind tour. So of course, I sat down at the bar, and ordered a beer.Yup. 11:30am. On a Monday. I did that. And guess what, IT WAS AWESOME.The beer was actually quite delicious, and sort of refreshing as I gazed outwards on this rainy day in London. The inside had this musty but comforting smell to it, like something familiar and safe. There was a nice fire place, but unfortunately it wasn't that warm. The bartender was more than happy to make conversation while I took DSLR shots of my single little beer, but alas I was done in less than 10 minutes. Still, great place, I wish I could come back when it was more happening!",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 5,
      "cool": 9
    },
    "photos": [],
    "user_id": "EiwxlbR8fb68lMgEXhcWKA"
  },
  "OfPD734P81a2UYdGqJFpbA": {
    "date": "10/6/2015",
    "text": "I can't say much for its beer, ale, etc., but the food wasn't all too great.  Portions are small and the place gets insanely crowded.  I can't help but feel that this is another tourist trap.  In fact, at one point 3 out of the 4 tables around us were occupied by tourists from the US.  So...message to my fellow USA citizens, again, I can't speak of the EtOH, but the food here is just okay, nothing worthy of it's 4 star rating.  Plenty of good fish and chips and steak pie  establishments back home.  Perhaps, we go because of our love for Charlie...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jCNrky1-s4ZNIDeFL3C4w"
  },
  "rb21j8iFqETVZsk8cVfCzg": {
    "date": "8/24/2016",
    "text": "I love this place. It's like 5 or 6 floors, most of them underground via narrow, crooked steps. Very good fish and chips, oodles of beer. Order at the bar. Find your own table. It was crowded in the early evening on a week night. Lots of locals! I highly recommend a visit to this historic pub. Mark Twain and Charles Dickens like the place, so did I.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "T3-F6v1BUk3BBDHVz1cBig"
  },
  "djIsdCC14bRjjDsrRFZbmg": {
    "date": "6/17/2017",
    "text": "Oldest pub in London. Stopped in for a pint in one of the rooms. Crazy to think how long the pub has been open and operating. Not much more to the experience for us than that.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lt04HYovKbFSVjXqCUFCFQ"
  },
  "bZ8NI6Ueoxpix46uue36kw": {
    "date": "9/3/2013",
    "text": "I had an old car once that caught on fire in a freak accident. I still needed a car, so I replaced it. Now, I sometimes still refer to my 2011 vehicle as the \"new\" car, and the now-no-longer-in-existence vehicle as the \"old\" one.My \"old\" car, if I still drove it, would be more than 330 years newer than the \"new\" incarnation of the Cheshire Cheese pub. The \"new\" bar, only 110 years old, is in the cellar.A place like this would be worth checking out just for the history, but to have a place like this on Fleet Street that was NOT setting out to gouge tourists made our visit even more special. Prices were actually quite reasonable, the staff was very friendly and welcoming, and the kidney pie and local ale made for a nice stop in London. We saw enough locals in the cellar bar playing cards, chatting and drinking, that I could almost see another life if ancestors hundreds of years back hadn't bailed.A fantastic place to visit and grab a pint.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KZ20ACDNSnrYWvox_zda0Q"
  },
  "zMITjy8oORn3kvknRxxkbw": {
    "date": "7/22/2016",
    "text": "Went to Ye Old Cheshire Cheese last night and had the starters and the fish and chips (battered fish cod). The starters was a bit of a mix, but the pie (tart?) was really good. Recommendable. The fish and chips was really good. Especially the fish was nicely made. The chips/fries were a little old school (like free way cafeteria soft), and I would have preferred them more crispy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EoxXcRVZX8J76hZvwqU7nQ"
  },
  "aKLO3i_7L8RgqUL14ygNtQ": {
    "date": "7/30/2015",
    "text": "My wife and I ducked in this pub after visiting St Paul.  What a cool place!  Unfortunately we weren't hungry but there is something great about having a beer in a pub rebuilt in 1667 after the fires.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "51K0w1o2K2_wYgphWxBFdA"
  },
  "Dsag-iaIYpQQA5ZS790bQg": {
    "date": "6/14/2017",
    "text": "Beer is great, ambiance is great. Food in the dining room however is bad. I think they made it in the morning and just reheated. Everything was either cold or overcooked.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtfYBhefe2Qm9V4JdQnojg"
  },
  "binNbykfQJglDONRXaB68Q": {
    "date": "10/26/2009",
    "text": "Absolutely one of my favorite spots in London to grab a quick drink. The beer and food are both good and are reasonably priced, a rarity in my experience, and for a history lover like myself, the atmosphere can't be beat!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ot24Oiqacu1-Oa5306YiDA"
  },
  "CSu-_BG30NXe3_O4x_J_5Q": {
    "date": "4/16/2010",
    "text": "This place is so touristy but I like it.  I think I drank the best organic wheat beer I've ever had here (but I was incredibly thirsty when I got in!) The restaurant food was pretty good too.  Prices are ok for a London tourist-type pub... they serve both a sit down menu and typical pub food (which would be a little cheaper if you're looking for value).  I thought it was a good find.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9tmXiR5SraowOGnfReLc0w"
  },
  "67R-mFci4WGp0G5TDT694w": {
    "date": "4/22/2010",
    "text": "I have a love-hate relationship with the Cheese. Yes, it is nice and ye oldey-worldey, and yes the beer is nice and cheap, but something about it makes me consider it a definite back-up pub. It lacks a certain je ne c'est pas for me.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "M-FxpkVI_pbj5BEuU592fw": {
    "date": "3/30/2009",
    "text": "From the toasty fire in the tiny front bar to the cavernous collection of subterranean rooms, Ye Olde Cheshire Cheese is a worthy experience. I'm a big fan of the Sam Smith's bitter from the cask and my girlfriend loves the pure brewed lager. The chips are thick cut, resembling steak fries in the US, and go perfectly with liberal doses of vinegar and salt. The Dickensian aura of Cheshire Cheese is tangible; a big plus for history buffs. The barkeeps are personable and funny, calling cantankerous customers wankers with aplomb. Ye Olde Cheshire Cheese is a good fit for visitors of all stripes.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oOV3teAh5SOlH2D0nTW8iQ"
  },
  "7ROQWiDEoJP1dfIJI2PjDQ": {
    "date": "3/6/2010",
    "text": "I love this old place too.  It is full of atmosphere, and history.  My first visit was in 1966, when I was served a wonderful beef and mushroom pie on a Wedgewood plate.  The Wedgewood is long gone, and so is the good food, but Ye Olde Cheshire Cheese is still a great place for a pint.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "auD5KaqpMtdWr8bFpI13Tg"
  },
  "6oZ0yCTlHcKe9EuqWcyokA": {
    "date": "5/1/2009",
    "text": "One of the best pubs in the city.  Best thing about the place is sitting in the cellar (watch your head on the way down) along side the picture of Mr. Johnson.  Great history, Samuel Smith beers and quality food.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byhHth5T8whNssxHQ9tRnA"
  },
  "hpdaPCR2pEQ_LB3oZzRxXA": {
    "date": "1/11/2009",
    "text": "This was my second favorite pub in England. A bit off the main path but nonetheless worth our time. Be aware that there are multiple rooms each with its own menu. Watch out the bartender on room to the right will direct you to wait for a table in the room to the left...keep walking through the corridor, there are other places to eat within the same pub! As a Charles Dickens fan, I enjoyed every moment of this place. Its hard to imagine eating in a room older than anything standing in the USA. Highly recommend a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z4kjqUOZ6FEQFNf6CwPg0g"
  },
  "F8OUmYJMhQZltzn2Vph5GQ": {
    "date": "3/15/2012",
    "text": "This historic pub is fantastic.  I love the small spaces and the architecture, the beer and cider is cold, and the food is great by any standard.   We had lunch in the basement.  It was crowded, but it wasn't too loud.  There wasn't a wait for a table, and we were able to get our food quickly.  On my next visit to London, I'll definitely return here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "elO6H690rrADGviefWytgQ"
  },
  "ppB_0qOF9_uiDwOf0zifYQ": {
    "date": "5/30/2009",
    "text": "Oh, the Cheese. How I miss my old local. Great history (don't miss the charred rafters on the lowest floor that took their scar in the great fire), great beer selection, friendly service, and surprisingly good traditional fare.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjUH6WPYyGSIUos_Tfwznw"
  },
  "lIamneKW9zQVnbL4qQ3WPg": {
    "date": "5/22/2009",
    "text": "Widely regarded as the oldest and best pub in London, a title of which it thoroughly deserves. Being a Samuel Smith's pub it has a limited range of drinks, but one pint of the Alpine larger at a very cheap price, and you will not mind. The dark and dank interior is something not too dissimilar to a Harry Potter film, and really gives an excellent old world ambience to this pub. Truly my favourite pub in London.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OrUTuNmUWJoeJrE9povKAw": {
    "date": "4/17/2011",
    "text": "Funky interior, can get you spinning even before you hit the bar. Not exceptional amount of beers to choose from but the price is unbeatable for Central London. Food is OK, on the level you expect to find in a pub.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBTXwR3DKhyFb-0rQ7MkJw"
  },
  "xDPvRxhNPzN4HWjQKEYEfw": {
    "date": "2/2/2009",
    "text": "Love this bar!  Historic ... sit in Johnson's seat and feel histroy (he wrote the dictionary) ... go to the deepest part of the pub to hang in some old, I think 1100's spots and do take time to eat up stairs (street level) as the food is good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lm_GjrigKTP84YUEnRtg_g"
  },
  "7CKXImIUkgQpWbmVz6QqTg": {
    "date": "1/29/2009",
    "text": "A lovely olde pub full of history and great food too! Well worth a visit with friends. There are lots of rooms to choose from but a word of warning re the stairs and how dark it is although that's no criticism, as it should be expected. The first room you see as you enter is on your right-hand side. This is more of a bar really and usually has a lovely fire going. A few other places can be drafty but just as charming. I have only visited during lunch so cannot comment on the evening but I know they have lots of tourists visit and private parties at Christmas. Check it out.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GLQwIPJIg4U6JhNNoBd2iQ": {
    "date": "5/30/2010",
    "text": "This pub was too warm and crowded on a winter mid-afternoon.  The pints were sloppy and not very cold, and the fish and chips were limp as if they'd been under a heat lamp for half an hour.  The pub is in a nice building and has great decor, but the rest of the experience is lackluster at best.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U31blLVd1kbMQ3l9hD0rgA"
  },
  "TR-r4dXpvx5ldXGaozYrww": {
    "date": "8/28/2008",
    "text": "Nice little place and very friendly beer good get full and why not great little pub",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "71Yxef5CrbjK2JmA3S4edw": {
    "date": "10/27/2008",
    "text": "Ye Olde Cheshire Cheese is a 17th century pub/restaurante down a narrow alleyway off Fleet Street with an atmospheric darke woodene interior, selling ye olde greate foode and ye olde greate beere. Highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LoNH0-LsDM6G1Qj_q5G9yQ": {
    "date": "11/15/2010",
    "text": "Great pub, a very traditional feel to it, but I can't help but feel a bit sad that it's a Sam Smiths. Nowt wrong with that, but if they served a series of guest ales and put a bit more effort into the food it'd be a 5-star job.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5_Q_8geA2XRWeQuUYAoxhA": {
    "date": "11/27/2008",
    "text": "A gem, particularly so considering that it's in such a busy part of town. The pub is perfect for winter evenings. Service and selection of beers are ok, the real plus point is the fact the pub feels hidden away. Has a very Olde Worlde look, which could be tacky, but it works. Worth having a wander in the back streets off this side of Fleet or around the Inns of Court to the south either before or after your beers.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "S6WBCCZqAXSoFC9Cdded_A": {
    "date": "11/24/2008",
    "text": "Such a privilege to work near this ancient pub. It's a fantastic old building and really puts you in mind of what London used to look like - if you ignore all the modern buildings and brands around it!! It's a bit disconcerting sometimes to find whole tourist groups being directed in for the 'Ye Oldie London' experience. It sells good food for lunch in the basement but there are more formal dining rooms which I've yet to sample.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q6uiY_pc-Cn26TmWeFa9Eg": {
    "date": "11/22/2008",
    "text": "This is the coolest pub I have been to in London. Inside is maze-like with what seems like 5 or 6 different different levels, each with their own seperate bar. It is filled with nooks and crannies and edges. This is a very different, definitely quirky place to hang out and have a beer",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0sqBDsINI-slTn-HKWmRGw": {
    "date": "7/11/2011",
    "text": "I love the Cheshire Cheese. It is always a place I take my dates. I was recommended it by someone who works nearby. I don't drink as I don't want a beer gut but I only go there for the cosiness of the cellars, enjoy the history and to play a quiet game of cards. It has a nice atmosphere although tourists are flocking to it now, and gets too crowded in other bars. I wish it wasn't on the tourist trail.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "omDVy6aM-xTQRBLeI-ND2w": {
    "date": "9/8/2011",
    "text": "Great little boozer. Good prices",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uiTRN8IxnkN1CikCeog7iw": {
    "date": "6/8/2010",
    "text": "You can almost *feel* the history wandering lost through the twists and corridors at this ancient pub.  The only stronger feeling was that of indigestion after daring to eat the bar food.  Looked nice, tasted like every stereotype of bad British cuisine.  Still, this place is old and cool with lots of nooks to hide out in and interesting spaces.  The staff was super friendly, and I will totally come back to have a few pints again some time.  Be sure to duck when you visit the loo!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1vSKO0xWt16WpA-YQCEjg"
  },
  "qitSIe3veK3CSY9_la-4VA": {
    "date": "3/27/2013",
    "text": "Despite the traditionally cheap brewery owner increasing its prices, this remains a gem.  Try and forget the hordes of toursists (including some organised groups) that descend on the place, and enjoy the rabbit warren of cellars and tiny hide aways.  Beautiful, historic and at times incredibly busy.  Worth treking across London to get to",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fzD3iC-ORnDrE_9swIpEpQ"
  },
  "sGr5JnyXz1A-99OL3yHrXg": {
    "date": "10/10/2007",
    "text": "Hiding in a tiny alleyway half way down Fleet Street, Ye Olde Cheshire Cheese is a rare treat. It's cheap, being Sammy Smith's and all, and you feel like you're in a little miniature world. I suppose, back in the day, everyone was smaller, so pubs only needed to be this big. These days, it's a tight squeeze, but get your elbows in, and find a place at one of the bars, and you'll get served soon enough. When you get sick of the being hemmed in/too hot, walk down to The Old Bank of England, a Fuller's ale and pie house a short hop from here and get yourself a pint of Discovery to freshen up.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sYQR2gxflm2Una1J_xDnRA": {
    "date": "6/10/2008",
    "text": "I think you could call this the best pub in London, although it may be a little modern for some tastes, being rebuilt in 1667. I might be a few years off. As you can imagine, this pub is straight out of an episode of Blackadder or the pages of Dickens, who I'm sure drank here since all the writers did, including, famously, Dr Johnson. This is a Samuel Smiths pub, so the beer is the cheapest and best in London. Their cheapest pint is £1.80 (yorkshire bitter)and the most expensive bottle is £3.50 (oatmeal stout i think). There is brilliant food served in every bar (steak and kidney pud will finish you off) and if you can manage to get a seat in the tiny restaurant (no bookings) you can enjoy pheasant for a tenner! Mind you don't chomp on a bit of shot though. Smiths make their own spirits, so their shorts and mixers are cheap as well. The upstairs bits are reserved for private bookings, and are very nice indeed, and the fantastic cellar bar is closed on the weekends, but after a couple of pints, which should cost less than a fiver (in central London!) you won't care. Particularly if you're sat next to the real coal fire.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Eskn7XxiUDEyaJBVRmyIoA": {
    "date": "11/18/2008",
    "text": "This is a great little pub tucked in a tiny back street along Fleet Street. Dark and cosy with numerous caverns to eat and drink, it definitely has a lot more character than your standard pub. The pies are great and for £5.50 you can make a meal of it which includes a potato side (chips or mash), and either mushy peas, beans or salad. Although good value, it can be a bit hit and miss, with the last time I was there just under a month ago, there were huge lumps of partially cooked potato that had not been mashed properly - really put me offbut then again at least they are using real potato and not that packet mash I suppose. Judge for yourself and head down there if you're in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_P4QuJVnDh9W35S7nKo4hw"
  },
  "fxtX6iiFu4m7qUXl7_uBTw": {
    "date": "7/7/2013",
    "text": "Came to eat here on a trip as your typical American tourist. Despite all of the old decorations and seats, which some might find boring, I think it's very neat. Also, the food tastes good, and that's all that matters.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8dFdEamaYDijTSdqu4kbA"
  },
  "9HH9dWWTeiDPX6xufH-yVQ": {
    "date": "5/23/2008",
    "text": "Wood chippings. On the floor. The first thing you can imagine as you enter the unassuming door in the side alley off Fleet Street, is that this is a very traditional pub, with one excellent facet to it. However - if that's all you imagine, you're aiming too low. This pub has so many facets it's a veritable engagement rock. The key to this pub is that there is an element to satisfy nearly all types of pub clientele. There is a small snug to the right of the entrance that feels like it was designed for village regulars. To the left, there is a pub restaurant area. Straight ahead, and it's a standard pub - mostly standing room only, long bar running along one wall. But it doesn't stop there. Upstairs there is a cosy boothed restaurant area that puts you in mind of Noel Coward's Still Life (latterly the movie Brief Encounter). Each booth has coat hooks on the outside, and you could almost imagine yourself conducting an illicit liaison on the Orient Express. Downstairs and you are back in time again, as the Cheese has converted some of it's old cellars into more seating area - with low, arched ceilings and warm lighting. Descend further and you are in the lowest bar, with long benches, stone flooring and whitewashed walls. I'm a big fan of Sam Smiths - and while I haven't had any issues with short pints - I can't recall the bar staff being particularly friendly or attentive. In fact, on one occasion it felt like I was being ignored. That aside - it is a lovely pub - and the staff problems are all fixable. I'll give this place 4 stars - only to encourage folk to visit here at least once. It's a bit of history, and an awesome place to be able to tell folk Yup - I know that pub..",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3LAmERHlh4rxxy_2s21beQ": {
    "date": "3/15/2011",
    "text": "If you like the pub scene this is the place for you.  Three different areas to drink and the cellar to eat. Pub grub mostly. Nice environment.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DBm0o-cXV0aFh1NcZ8l6A"
  },
  "6jxHMAgJ0WLEARKPbOuXRg": {
    "date": "2/23/2010",
    "text": "Yea, it's got loads of history, character and the Lagers are really good, but that's about it. Food isn't great, service isn't great, it gets really crowded in the small cave-like spaces, it's not the most comfortable place, but it's still worth taking some visitors to, just to let them know what a really old pub with loads of history looks like.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MblTcCAVpuS6eM3ZT_JMg"
  },
  "pM3vkzeZVqbaz65FLcfVXA": {
    "date": "11/19/2008",
    "text": "This place probably shouldn't work, ticking (as it does) every cliche in the 'olde worlde pub' book going. It's got the nooks and crannies, the old framed copperplate writing histories on the wall, the low ceilings, the timber frames - the works. And given what that normally means for London (crass tourist rip-off job) it is something of a surprise that Ye Olde Cheshire Cheese is such a good pub. The atmosphere is always lively (but kept friendly by the intimacy of the many areas); the staff have got a real buzz about them and provide quick, efficient service; the beers are cheap, varied and in tune with the surroundings (Sam Smiths); the food (served mainly in a more formal area on ground level) is simple pub-grub but typically delicious and without the 'straight out of a microwave' taste you often encounter in London pubs.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bNn2-LfuJILs7YwE8mkBZw": {
    "date": "11/17/2008",
    "text": "Cracking pub, good atmosphere, good (and very cheap) beer, good central location and plenty of history to the place. I would put this in the category of pubs I would go out of my way to visit as well as very good pubs that are near places that everyone generally visits. If you get a chance go to the cellar bar downstairs (sometimes it's not open on weekends).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "51g5lywJdHi4it_84HY8DA": {
    "date": "5/31/2012",
    "text": "This is one olde pub. While in London, my wife and I wanted to visit some olde haunts of infamous Londoners and Ye (the) Olde Cheshire Cheese is a must see. This place was built one year AFTER the great fire in 1666. However the pub was there a hundred years before that! The staff was very friendly, a rare treat in London. The food was really good too, very unexpected. It's pretty traditional fare so don't go ording a pizza or cheeseburger. My wife ordered the fish & chips and I got the kidney pudding, which was outstanding. The ambience is delightful and rich of history, you can literally feel the history of this place. Gorgeous woodwork and original stained glass windows are located throughout. This place has multiple levels so be sure to take a little tour. Besides having good food, great ambiance, and having a pint with Dr. Samuel Johnson, this place is OLDE school. They still heat the dining room with coal, which accounts for the smokey atmosphere. A must see while in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_xd7iwTQ9fhtduHYboudg"
  },
  "t_SlcQxWQdY_rIan7sMjZA": {
    "date": "11/28/2008",
    "text": "Love Ye Olde Cheshire Cheese! Always take family & friends there when in London - great bit of history! And the food I think is very good I know it's a bit of a tourist trapbut at least the staff are friendly and there are so many little rooms up and downstairs, always somewhere to go!Recommend the fish & chips!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IsmMPSMpMSkdL8khM8SIMw": {
    "date": "11/27/2008",
    "text": "I have only been to the Cheshire Cheese a few times over the years, it's always good to go back to. As others have noted the prices are good for central London, and the atmosphere positively leaks out of the fabric of the building. Yanks do seem to like the place for it's age and history, but I like it for that too, even as a well travelled and somewhat world weary Brit. This is a good stop if you are poking around the backwaters of the City and Inns of Court as a tourist, and I definitely try to take people in who haven't been before as most everybody likes the place. Highly recommended.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Chx8TCZI1CVrKQUczMX0TA": {
    "date": "10/10/2007",
    "text": "Well, I was going to write something wonderful about the history of this place, but seems I've been beaten to it. Just three stars from me too, but not because of the pouring technique of the staff (who I also found very friendly, but could do with a little more bar-queue awareness. As mentioned the original burnt down in the great fire of London, however I suspect the only room to survive was the gents toilet - that's the only reason I can come up with to explain the stench.. Otherwise, a nice enough place with a bit of a barn feel to it..",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "iNz4JnQHuTJkfh8GS0fDRA": {
    "date": "11/13/2007",
    "text": "This pub was built in 1667. It goes down for what feels miles below the surface of London. And its probably the most fun place you'll ever drink. The cosy layout of this pub, with snugs, mini-bars and myriad tiny rooms, allow for intimate meetings and nice, friendly get-togethers. I have enjoyed multiple university parties in here, and many more quiet pints with a friend. The clientele are both Fleet Street workers, and King's College students, along with a smattering of regulars who look like they've been coming in since the pub was built. Staff are friendly and efficient, and the Alpine beer is exactly what you'd expect: Cheap and refreshing. The food isn't all that, just your typical pub fare, fish and chips and some pies; but the atmosphere is so snug and happy that although you come for the cheer, you will stay for the food. Pint of Alpine £1.98; Fish and chips about £7.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oe39Xa_noq2-YQx6AHFeTw"
  },
  "0KaU6pUcrccnAH5ZCwNoig": {
    "date": "11/17/2010",
    "text": "700 year old cellars and 1.99 pints! It  was my favorite pub on my vacation in London. The bartender there at the time was super friendly too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyhb2i5aYM3AOqX6fSQrwQ"
  },
  "yX6VJ8BaxLSN9zxq2qiHZQ": {
    "date": "8/11/2009",
    "text": "Some times I love this place and sometimes being in there is just painful (quite literally if you hit your head on the low ceilings).  This is a great winter pub but in the summer it's not that great being stuck underground.The Cheshire can get really crowded - especially on payday when it seems most of the city are there, which is what I refer to on the painful front (low ceilings aside).  Most Thursdays and Fridays though there's a good crowd of people in and the atmosphere's good.  It's a good place to go with a group of work mates for a couple, maybe before moving on elsewhere.The best thing, history aside, has to be the drinks.  There's no branded drinks, which is quite cool, as it's all their own brands which are really good and the price is excellent for a city pub.Definatley one to have a beer or two in if your on Fleet Street.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-_R4VdIwk00GrgIhP0PH-w"
  },
  "hqchEjzUETuuvhV0yUbdvw": {
    "date": "8/27/2016",
    "text": "Came here on a recommendation from a friend. Loved the maze-like ancient space and decor. Very Old-London. Beers were great, service was nice. Fish and chips were eh. Skin was still on (blech) and it was oozing frying oil. Like way too much. Chips were nice. Redeeming factor was the divine sticky toffee pudding. Served with custard as God intended man to serve it.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "woFthCAsX2JYi8i2qEBb1w"
  },
  "w7ZKP12TNY-N7xnuj1gkAw": {
    "date": "7/18/2015",
    "text": "Amazing place, with so much history in it. High quality beers, great service, reasonable prices, and the hidden entry made of this bars one of my favorites.You have formal and informal meals, tables for two and tables for big crowds.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "js0WNegi8Ns1I8B9cwzc-g",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/js0WNegi8Ns1I8B9cwzc-g/o.jpg"
      }
    ],
    "user_id": "sVkubCXBa92Y7s-jm-R9pw"
  },
  "pfztiVQ46tRKz8NDe2SGqw": {
    "date": "4/12/2016",
    "text": "Lovely old English pub. No, it really is old. It has lots of charm and best of all, it's reasonably priced. You may want to mind your head in this place though, you may struggle a bit if you're particularly tall. You should venture downstairs, I've never been to a pub quite like it. The staff were actually very friendly and it was great that the person we spoke to working behind the bar had so much knowledge on the history of the pub.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cadgsnf6CIReGSt6yIcnWQ"
  },
  "e_1Dzpjst25y3d8W7SGQyw": {
    "date": "6/24/2015",
    "text": "We ordered the house steak, the sausage trio, and another dish that was almost the same as the house steak... The food was alright, but felt a bit boring. It wasn't bad, but I felt that the flavors could have been a little more pronounced. I have had better English food, but I suppose most English food is somewhere along the same line of excitement. Not horrible, but I wouldn't be back for the food.The environment was very nice and cozy though! We sat in a booth with walls that went up pretty high so we got a lot of privacy and it was a unique experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jte5OCBP9_EuypMnQmYXmg"
  },
  "FC0KIMfTrBSjVDpbRBiUjw": {
    "date": "11/15/2017",
    "text": "Loved this place!   Charles Dickens used to drink here among other famous writers.   Food was very good, service was great upstairs in the dining room off the side of the entrance.   It's been around since the 1600's.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ymw2pJ0BNbe5xs_EVO5euQ"
  },
  "Mcu19DwOOh-z0C6gjoFV2w": {
    "date": "4/11/2015",
    "text": "One thing I must wonder about this pub is how many tourists must walk through the door because of how famous it is.  I get paranoid because then I start wondering, \"Is it good enough to be something even locals would visit?\"  Obviously, I can't really say since I am one of the tourists to visit, but I had a decent enough experience at this pub to appreciate it.After being told this is one of the older and more well known pubs to still be open in London, my travel buddy and I went for lunch for the stereotypical fish and chips.  Pretty standard fare in my opinion.  The fish: good; the chips: good; the peas: good.  What I found was that the main reasons I liked this place was because of the location and fruit beers.   The overall feel of this place was charming and a bit dark, but honestly, it's very lovable.  With a couple of floors to accommodate guests, we ended up in the basement level to eat.   I only saw a few other people so it's probably not very crowded in comparison to other tourist spots, but we went at lunch, so that may be why.  I ordered one of the Sam Smith fruit beers, and while I normally hate beers in general, I really liked this one.  Surprisingly light and subtlety sweet.  I think this place is worth checking out for its history and location.  The beers were good as well but I only wish I was blown away by its food too!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jbMCjG1hc_cZW78qDIGjqA"
  },
  "MBQ_kL5990oxggwQNM3kuw": {
    "date": "5/5/2017",
    "text": "Dropping with history on every level. Great beers, fish & chips, bangers & mash. Tucked away but perfectly accessible. Can't beat the legacy and the vibe.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6KUinM1BcoD_ozvFSPSevQ"
  },
  "D2Tab_sSlMPHPOAHA30c5Q": {
    "date": "3/23/2017",
    "text": "Service is great here, very cool old spot. Samuel Smiths needs to fix the old brewery bitter up!!! I went to 3 places there was no consistency. I go to London just to have one of the old beers I remembered to be so great, I was so disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_tMb_YrR0wRuZq0oXpeMg"
  },
  "IG5t3TggRvqOfTlRYg9DAQ": {
    "date": "4/29/2013",
    "text": "Ye Olde Cheshire Cheese was our first pub stop in London and it delivered as promised.  Ye Olde Cheshire Cheese, rebuilt shortly after the Great Fire of 1666, is one of the oldest pubs in London. There are several famous literary figures associated with the place: Oliver Goldsmith, Mark Twain, Alfred Tennyson, Sir Arthur Conan Doyle, and G.K. Chesterton are all said to have been 'regulars'.  Ye Olde Cheshire  is absolutely charming and crammed with tons of history.  The low door entries and tiny steps give you an idea of how short people used to be!  It took us a few moments to locate the dining area. Initially we thought the stand up bar area was the entire pub!  If you walk downstairs, towards the bathrooms, you will see two levels of dining areas.  We lucked out and were able to grab the last table as a group was leaving.  Since our table seated 8-10 we decided to be neighborly and invited another couple to join our table.The atmosphere is very casual.  Order drinks and food at the bar and the bartender will give you a pager while you wait for your food order.  Whoever said English food sucks is absolutely nuts!  Our fish and chips and Shepherd's Pie were awesome!!!  I did skip eating the lackluster peas and carrots on the plates, but overall I was very impressed with our \"pub grub\"!  The prices for our meals were also very resonable.It was tempting to spend the rest of the night here, but we had other plans in Hampstead and eventually had to leave.  I highly recommend checking out this pub if you are visitng London and want to experience an old fashioned English Pub!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "xWPcc7IdbEfvV0K6WJu4yA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Bar area @ Ye Olde Cheshire Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xWPcc7IdbEfvV0K6WJu4yA/o.jpg"
      },
      {
        "img_id": "Pk4Z_jS5rHEnAqaOwtQLCQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Cottage Pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Pk4Z_jS5rHEnAqaOwtQLCQ/o.jpg"
      },
      {
        "img_id": "eCsSreGDLJMptOG5omnlAA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fish and Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eCsSreGDLJMptOG5omnlAA/o.jpg"
      }
    ],
    "user_id": "5O3VvfDu_HDvgUviAqmTEA"
  },
  "lVXorLIXMeB471XfRedveg": {
    "date": "1/3/2016",
    "text": "Solid old world pub - definitely a step back in time and worth a visit for everyone. Really great prices too especially for central London. Tip: there is a nominal surcharge on credit/debit cards so bring cash if you want to avoid that.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ysafjbp3KMfC5ok7vmK0GA"
  },
  "bEi5X-Klie_rRVnvqZ9aTw": {
    "date": "12/28/2015",
    "text": "One of the oldest pubs in London. It has a list of all the past and present kings and queens of England that have reigned during its time open which is quite an impressive list to say the leastA few mod cons have gone in since it opened with electric lights and plumbing being the major ones! The architecture has remained the same with the low ceilings and doorways so mind your headsThe brick work is fascinating with the arches and the old style wooden stools and table certainly don't take up much space but there isn't much room to swing a cat between the walls. There are a few sections which give it a feeling of space.Not bad food and a standard selection of ales available. I was there with a friend when it was quiet so no idea what the crowd is like at peak timesBy the way it's hidden away down a lane off the Main Street so you need to keep an eye out or you will simply walk straight on byWorth a visit if you are looking for a quirky tourist pub steeped in history, if only the walls could talk in this pub!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "RxMRWHRTloNSZwB050QtMQ"
  },
  "IEPko3msFr88lTAw3h49CA": {
    "date": "2/24/2015",
    "text": "Come for the history!Stay for the beer!If you're hungry they can feed you.Tourists and locals alike crowd this place from shortly after opening until closing, it seems, as I've never been here when there wasn't a crowd about.Wonderful beers, and helpful staff, and soak up the vibe along with your beer and before you know it you'll be glad you are here. (nice, that)Cheers!Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TY_Nb_e5criDA0yfhW6TQ"
  },
  "K3-bD-zGT_j0bfusYWlwlQ": {
    "date": "2/19/2016",
    "text": "Probably in the top 3 bars in the world I have ever walked into.Built for another time, a time before even Dickens (who apparently hated the place), its cavernous, creeky, haunted, and its the London outpost for the Samuel Smith brewery a few miles away.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e2G7YIplKFuKtsmcFs271w"
  },
  "HjFswwfF2k_PukwRSiSEcg": {
    "date": "9/30/2017",
    "text": "\"The Cheese\" was recommended by a friend who travels to London for work. The atmosphere is very local and authentic. The small unique rooms make for a cozy feel. We only ordered an appetizer- nachos, which were tasty. The salsa was sweet and completed the dish.  Our room got a bit loud at times, but that should be expected. I met the owner on my way out. He was pleasant and recommend another local pub. Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsyxETKKqha0RoFximT1TA"
  },
  "zhVC3b6jfEpVCr0i_vaz2w": {
    "date": "9/3/2016",
    "text": "Ate here in the early eighties which might seem like a long time ago until you read that Dickens frequented the place and believe me he was a late-comer. The place was rebuilt a hundred years before there was a Declaration of Independence. Anyway, we tried a couple of the dishes- fish and chips and bangers and mash and found them tasty. Very authentic as the peas really were mushy! Why is that? That afternoon our two-year old was making echoes in Westminster Abbey. A woman with a child on a leash (!) said to us about our daughter \"Why don't you pick it up?\"  Not in Kansas any more.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBTtAGcLznKMQYR7IEPyKA"
  },
  "t9qXjG8QdzBC64-qLgdCRw": {
    "date": "6/21/2016",
    "text": "Very very cool place. Almost missed it  because it is in a small alley. Good beer, good fish and chips, good people, some history to dig.  Be sure to go all the way down and check out every room on your way. Also look the ground at the beginning of the alley.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dkLLtPO5bsegqlnZotr_qA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Alley entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dkLLtPO5bsegqlnZotr_qA/o.jpg"
      }
    ],
    "user_id": "TNWKF9kQjPsLpmDqHvHKig"
  },
  "-sCfzYewFxJWcA8CgoDZuA": {
    "date": "3/26/2015",
    "text": "Really cool atmosphere as it is very dark and very maze-like in the cellar.if youre a tourist you totally have to check it out once. its actually not as croweded as you think it is, which is an advantage or a disadvantage, however you like it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zEQrO5uv0fV_qBE6tHm3Bw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. they have a cool variety of beers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zEQrO5uv0fV_qBE6tHm3Bw/o.jpg"
      },
      {
        "img_id": "2ZmX11qV7oqqkP3D0ruzAQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fruit beers. i recommend the apricot one. it really fits in a beer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2ZmX11qV7oqqkP3D0ruzAQ/o.jpg"
      },
      {
        "img_id": "uozWzJXuJCa6ekh4OTsbHg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. this meatpie was just delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uozWzJXuJCa6ekh4OTsbHg/o.jpg"
      }
    ],
    "user_id": "deqHvMCTW4gLBH8572iHYg"
  },
  "Z7ba6kAnLhHhq8bSRYRbiQ": {
    "date": "3/26/2016",
    "text": "This place is so cool! I did a walking tour of London with my family and this was on one of our stops. The oldest pub in London! We all enjoyed a nice pint, conversed with a few locals, and then headed on our way. I definitely recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L7o0bpIdAp3_ROPyM9DLzA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L7o0bpIdAp3_ROPyM9DLzA/o.jpg"
      }
    ],
    "user_id": "a9CfEnuVZp_bWheY1kRfyw"
  },
  "44xFOCBQwUMFlXYQKScoWQ": {
    "date": "5/1/2016",
    "text": "We had a great time here visiting with friends while in London.  The little side rooms are super cute and perfect if you don't want to sit in the noisier area by the bar.  The fish and chips were tasty, the fish was nicely done.  They also have amazing beers.  My husband loved his chocolate stout and I enjoyed my cherry beer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WGLtDNWwOu4MKncCvuxeiw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fish & Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WGLtDNWwOu4MKncCvuxeiw/o.jpg"
      },
      {
        "img_id": "bVfauP0O8KvNXzjVny0bKQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Cherry beer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bVfauP0O8KvNXzjVny0bKQ/o.jpg"
      },
      {
        "img_id": "BfSd0fNpcvd0PboXXaE7nw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Chocolate Stout",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BfSd0fNpcvd0PboXXaE7nw/o.jpg"
      }
    ],
    "user_id": "QM_kZqK-Y2bcQb86cWqIpg"
  },
  "jVDE5jRg4xK_V0Hr-drBOQ": {
    "date": "6/8/2016",
    "text": "Satisfactory experience !! Good beer, cheerful service, and inimitable ambience. Go.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2aQO-hJhIyvxlTxNTY7Aw"
  },
  "_XDHTyA0qwVzHTKX_vUNtA": {
    "date": "11/11/2016",
    "text": "Warm and cozy, authentic and delicious -- What I look for in a pub. Went back twice in one week while traveling through London and would go back again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5e_CsuZKRugN52jhQZfypA"
  },
  "ggBKUEIuYEa-j9WzlPcRQA": {
    "date": "8/16/2015",
    "text": "Fantastic pub. Apparently one of London's oldest pub. If you manage to get a seat in the little bar just in on the right with the big log fire, you could easily be stay all afternoon watching people coming and going. It is worth going into just to have a look inside. It is however full of tourist doing just that. Not sure if it is somewhere that has many locals. Definitely not somewhere to go with a large crowd.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HmCWifSQH4OGFuJx6tn1zg"
  },
  "pLpQ1OXNrN1BAtEoMf3dJw": {
    "date": "7/17/2015",
    "text": "A really good British pub experience - the Sam Smith bitter is worth the trip, and the food doesn't disappoint!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJsScC0CbhhqB5ExVijecA"
  },
  "xdPBrSC2Sd3i979K1z5HLw": {
    "date": "8/4/2015",
    "text": "On of our favorite pubs we visited in London when there in July 2015.  We had our best Ale there too.  We had pheasant for dinner and the kids had Burgers and Chips.  So Good!!! One of the oldest pubs in London dating backing to 1600s.  Can be easy to miss since entrance is in a side street but a small sign does hang on Fleet Street marking.  Dickens frequented this pub in his day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T4gU1dyu94OxvP7Wpft1zQ"
  },
  "HAKcVKSIhi2NBlUXmL6qBQ": {
    "date": "5/23/2013",
    "text": "Quick glance: + wonderfully atmospheric+ traditional pub grub+ big portion of foodThe pub was rebuilt after the Great Fire of London in 1666 and all I could think while sitting in the cavernous basement was, what would the walls say if the walls could talk? It's great to imagine that this pub has been around when straws probably lined the road, and Lamb Street actually was a marketplace for sheep rather than home to investment firms. Visiting this tucked away pub is great for the imagination. There is an upstairs dining area which you need to book, but downstairs is a fairly roomy and atmospheric basement where you can tuck into a selection of traditional pub grub, washed down with a pint of ale, cider, or stout. The selection of food and drinks may not be extensive as the everyday modern pubs we are accustomed to, but that just adds to the whole experience. The food itself was good and came in large portion, so definitely worth coming back with friends who have never been. And despite its rather touristy status, the food was fairly priced - a main and half a pint was less than a tenner.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "---ApoNeg7jrH46vV1hAuw": {
    "date": "9/3/2015",
    "text": "What a terrific pub! Rebuilt, yes rebuilt in1667......oh my! Classic Samuel Smith's on tap and in bottles. Delicious!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlBKs6OBeWbFQSCazFk0OQ"
  },
  "ygBrZymCS6PmOyIfeTewGg": {
    "date": "9/12/2016",
    "text": "Stop in for a pint, have a look, and then head elsewhere for dinner. The building is fantastic, and the history a delight to consider, but the food is horrible.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrAuQNOOjADOKqNQtGV28A"
  },
  "dReNnOUTm874QXt5NZpS5w": {
    "date": "7/4/2016",
    "text": "Came here for some fish and chips which were really good. Pretty big portion! You can kind of feel the history seeping through the walls. A great stop if you are in the Fleet Street area",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvPKx9pL9bP6-LEwouxIPg"
  },
  "LfhKPzXPiugkrcNDziamXw": {
    "date": "8/5/2011",
    "text": "I am really not fond of this pub  it's dark and dingy with quite low ceilings and narrow corridors. I know it's an old building, but for me I still feel it lacks character.I've also always found it hard to find a place to sit. However I have only been with large groups and at night.This is a Sam Smith's pub so it's very cheap, but then I don't really like the taste of Sam Smith's products.Don't get me wrong, I think if I wanted to get drunk for cheap this might be the place to go, or maybe in the day it is quieter, but for me whilst I usually really like pubs with history, this just feels a bit gimmicky.I have not tried the food so cannot comment on this.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "tlG8ATZgVnwlDocBMU8ksw": {
    "date": "8/2/2016",
    "text": "Dissapointed. Some beers were unavailble because manager wasn't there to replace kegs. Poor selection of healthy food.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zmyUlnRzC7ry7EJDSQM_Ew"
  },
  "iwWhESCE0YobqHJlviuG5A": {
    "date": "4/21/2013",
    "text": "Supposedly the \"oldest bar in London\"... so we had to check it out. Again, I'm not a \"pub\" kind of girl, so I probably didn't appreciate this as much as the next girl, but I was fascinated with the dark, almost \"shrunken\" decor! I mean i'm not what you would consider tall, but seriously you have to watch your head everywhere you go because the ceilings are so low and the hallways are so narrow!! We went all the way down to the basement. I had some sort of \"pot pie\" with meat and mushrooms. it came with fries and it was good. I'd suggest this place, if for no other reason, then the novelty of saying you went to the OLDEST pub in London!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yBIjUO5u-1S_c662NQnh8w",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Bar downstairs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yBIjUO5u-1S_c662NQnh8w/o.jpg"
      }
    ],
    "user_id": "abSv4EROV16qmh0W-xHZAA"
  },
  "Wh1eNDOXqWNq89P5SvdMFg": {
    "date": "11/27/2012",
    "text": "I'm fond of this place. I like the small removed entrance, and the old, dark interior. I like the good value Sam Smith's brand drinks. I like the sawdust spread over the floor.The pub is very old, and you get that impression from the coolness and calmess of the inside. It makes me feel like I'm curled up in a Dickens novel. This has the overall effect of giving the place a dim and sleepy feel, although it can get rather busy after 5pm.The smoking area is slightly removed from the entrance and doesn't really fit the feel of the venue, but it's still better than most 'stand on the street' options available at other pubs on Fleet Street.In general, as I've already mentioned.. I'm fond of this place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Q0VOtDU5gQPLYsCR3V-X1w"
  },
  "HYkIfAPbBUIUIiqKZZ2Oig": {
    "date": "10/30/2012",
    "text": "Oh, I am an asshole for having never reviewed this place. When you first arrive, you expect it to be overly touristy. It is. But strangely, magically, it doesn't even matter. This place still rocks. It doesn't try to sell you t-shirts despite being a historic and popular pub (can you tell I'm American?). Prices are more than reasonable since they serve Sam Smith's. Awesome photo ops for the ladies under the entryway to the formerly men's only bar right inside the entrance. If you're a lit fan, you'll have heard about Dickens referencing this place, and other legends slinking around. I am never sad to be here. Ever. It's a great place and there's plenty of seating, even if you have to wait a short amount of time for a table.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "-P4kl_8bPXxHaLFLCUOyKw": {
    "date": "3/30/2015",
    "text": "Overall, I'm a fan of this quaint bar. It has an amazing backstory, and minus the low ceilings on the stairwells. I had a great time. It can get a little warm, but that's not a real issue. The staff was polite, friendly, and helped us pick the perfect beers for our evening. The only downside is the fact it closes early on the weekends. Aside from that, we had a great time exploring and taking in the history!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ak_wXdBsUccSgYg-i2mjYA"
  },
  "t6jtiRThK-WtmRWF-UhhTg": {
    "date": "3/27/2013",
    "text": "This was definetely an adventure.  The stairs spiral down out of control into the bottom floor where it looked like a scene from inglorious basterds.  The staff friendly and welcoming.  We ordered our libations, then headed up what seemed an endless twisting and turning of stairs and hallways where we arrived in the top to be seated at a long table.  Our waiter was friendly and inviting laughing with us as we rambled on in drunken slurrs.  The London steak was no compare to Texas, but it wasn;t bad either, and the price was right for being downtown.  It was cooked to perfection!!  The peppercorn gravy was delicious.  Lots of fun, a must for the casual tourist.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3nx4jyDFZeZFjynAbo4NDA"
  },
  "TIlHVwPb81wXRpqma82jnQ": {
    "date": "3/25/2013",
    "text": "I'm sure I'd already written a review of this place already, but I guess not.I used to really like this pub with all its different sections and nooks. In fact, I still do like the place, but the novelty has worn off slightly. It is still a nice place to come and drink, especially in the winter when coming in from the cold streets somehow accentuates the warmth and cosiness of the venue. I like the innovative solution they have found to serving food in a pub with so many hidey holes. They give you a beeper, so that you know when to come and pick up your meal. Of course everyone prefers their food brought to them, but that would be tricky here.So for drinks there is the usual cheap Sam Smith's selection, which I like as a change, but get a bit bored of if I visit their pubs too regularly. I don't go that often recently anyway...especially since I learned what jerks they are - oldham-chronicle.co.uk/n….The vaulted cellars may date back to the 13th Century, the rest of the pub was rebuilt after the great fire of London reduced it to fondue. It also has its fair share of famous patrons if you care to look it up.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "ZRWiaoNN-KJLaISnlOamcg": {
    "date": "5/12/2015",
    "text": "I consider this a must stop for anyone visiting London or England for the first time. You just don't get the opportunity to see a place like this back in the USA where the place has about 1,000 violations of the fire code, ADA, and on and on - which is awesome. At 6'1 you are ducking to not hit your head many places, there are so many little tucked aways rooms and seating areas, and the place smells like wood burning stove from 400 years ago! You really can feel what it must have been like in generations past to sit there, and the best part is there are no TV's and no loud music - just friends and family enjoying a pint and pub food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LAs0dLp7ntWXbwNfqYgIPA"
  },
  "DEOxj5GqH1ZOM9ww3DxoUQ": {
    "date": "7/1/2015",
    "text": "Service was pretty good, but I'd say that was the best thing about this place along with the design. It is cool to eat in a table that you know could've been seating Charles Dickens back in the day. It is a little hidden and you must go behind an alley to find it. The food was okay, I think people are overrating the fish 'n chips because they honestly weren't that great. The chips are served warm and were the best part but the fish is scaley and don't even bother asking for tartar sauce. It came with no sauce and I see why. I ordered some tartar sauce to go with and it tasted like old mayonnaise so don't bother. They do have many different unique and organic drinks though which I heard they are pretty good. Don't bother ordering them if you aren't 18 though, this place is strict.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyjAwlBPblIhdaOApezj-w"
  },
  "5AS95y5ryramXXoEu6zcAg": {
    "date": "12/4/2014",
    "text": "This pub oozes with character and history. There are at least 5 distinct seating areas,  each with their own vibe, although not all of the areas are open all the time. Sam Smith beers and ciders are your only option, although they have some great selections. Keep in mind that the beers listed on the print menus are for all Sam Smith pubs, and the selection at each particular pub will vary. Prices here are very fair, and the food is good, although not the best pub food I've come across. It's an order at the bar kind of place, which is fine by me.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTXlKUa49O12YDHvrTamsA"
  },
  "aUEiwTZc0oZnPoHtT04CpQ": {
    "date": "7/9/2013",
    "text": "I had a good time here. We came in from the heat and went 3 floors down to an almost crypt-like bar. They say the place hasn't changed since Dickens was there and I think I believe it! I'll admit if it wasn't famous for being a favorite of Charles Dickens, I would not have found this and that would have been a shame.Great place and it was nice and cool.The prices were fair and the portions were good.  Yes, I had to try the Steak and Ale pie since it IS on Fleet Street and all...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXnH6W74FAJQ7q7b-NuBsA"
  },
  "CfjRioaS3jUkVED61sqJFw": {
    "date": "2/8/2016",
    "text": "After reading about this pub in one of JK Rowling's books, i had really wanted to come check it out. The opportunity came when my friends from Toronto came to visit and we wanted to take them to a traditional English pub where people stand around and order drinks and food directly at the bar. This place was more than we bargained for. Not only are there more than rooms of bars, there are also two dining rooms so it got a bit confusing.As soon as you walk in, there's a small standing bar in one room, then a dining room on the other side. Keep walking past the stairs, another room with a big bar and plenty of seating. Down the stairs, there are two half levels with short cave-like ceilings for dining, and one more floor down is a giant room with a big bar and picnic tables. We did not venture to the upper floors.Food-wise, it was alright. My boyfriend had a steak and ale pie that was absolutely delicious, while my fish and chip was plain. No tartar sauce available so you gotta stick with the vinegar (or mustard if you like it that way). The Chicken pie was decent, but nothing mind-blowing.If you are just there to check out a really old pub in london where a lot of old famous Londoners used to hang, this is a great place for you to grab a pint - the only issue might be that every bar in this pub might have a slightly different selection of booze (they have a relatively wide selection).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lVi02TEuh1cwp5atx5ALmg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lVi02TEuh1cwp5atx5ALmg/o.jpg"
      },
      {
        "img_id": "VjM_NNkxWA2MZPgNoac8uw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Steak and ale pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VjM_NNkxWA2MZPgNoac8uw/o.jpg"
      }
    ],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "h9WKsnGn2Yu4oLvgZQr69w": {
    "date": "12/13/2016",
    "text": "Wanted something very \"British\" for our last meal in London and came across the Olde Cheshire Cheese. We walked in right as the restaurant portion of the place opened up and were able to get a seat for 2.Started with a cheese tart (yummy!) and had the steak and kidney pie for the main. It was ok, but definitely for the adventurous if you're not used to eating kidney.Had an orange chocolate mousse to finish and it was DECADENT. Thick rich chocolate mousse took some time to finish.  Overall, great meal in great atmosphere. The waitress was a doll despite being the only staff in the restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMAmkqtFhhqkzTWKcsARSw"
  },
  "DURwIzrkEk4pWCb8QeEcTg": {
    "date": "6/8/2017",
    "text": "This pub is full of twists and turns and has a fantastic ambiance. My husband and I came in after a friend recommended it on our first night in London and really enjoyed it. Beers were affordable and the Ploughmans Board we nibbled on was delicious. This is a great spot to see one of the areas oldest pubs.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QPSZDaUn6UeZt3ysj8Hx8g"
  },
  "zLB1xjmuX-mPJxUM84EHAw": {
    "date": "12/1/2016",
    "text": "What an awesome pub.  A true history where likes of Sir Arthur Conan Doyle and Benjamin Franklin were regulars. It was burned down and rebuilt since 1667. The entrance is in a small little alley way with a tiny door. But once inside you have several different room, bars and floors which go underground. Old wood bar counters, alot of wood and bricks, low ceilings where at times it has a sign to watch your head, tiny clean toilets. Such a cozy place. Little coat racks around to hang your coat. Quite a few beers on tap and by the bottle. They seem to have some wine and a couple of hard liquors but not mixed cocktails. Some of the different bars served different drinks. We also ate here which was great for bar food. Got the fish and chips, the fish was tender, outside flaky & not too fishy. Plenty of fries and side of mashed peas. Really great prices all around. The bartenders are nice. No table service you order at the bar.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jWDlhgMsRXxlEXwdqgaH1Q",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. It was almost like a bar for little people",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jWDlhgMsRXxlEXwdqgaH1Q/o.jpg"
      },
      {
        "img_id": "q9YF001hmvfStPhuFITEow",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q9YF001hmvfStPhuFITEow/o.jpg"
      }
    ],
    "user_id": "EUcYEai08EwoJBz9rCeKFg"
  },
  "iui6bnpXr4kneUT0uft6CA": {
    "date": "5/31/2017",
    "text": "Please, please don't go here. Or if you go, just do a quick tour and head out. It is totally not worth the hype. We went here for lunch and walked out after having ordered our food and beer. First, they have a weird system where you order the food in the basement and when the buzzer buzzes, you have to carry it to your table, even if you're seated on the upper levels. Second, the food is just horrible. The fish and chips I ordered was sad. A big filet fried in thick tasteless batter. My wife's mushroom stroganoff was equally tasteless with nothing other than cream and lukewarm, dried up rice to go with. The food overall was almost cold by the time we got it. The beer is also a disappointment. The bartenders are quiet, don't really engage with you and you just don't feel like you're in a pub. Hardly any locals here either. Overall I'll say the place has a nice dungeony feel to it but nothing else about it stands out.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRSBpNeDYSmCXKNFNVN77w"
  },
  "AUhiQDFysFo651RHtd0g7A": {
    "date": "1/24/2018",
    "text": "This is a fun spot because of the history but is overwhelmed with tourists.  Our party of 4 stopped for a late lunch, barely found a table in the basement, and were told we couldn't order food for at least 30 minutes because the kitchen was backed up.  Drinks were on our own and had to be fetched from the bar on the main level.  I had been there before and with a party of two on a weekday it was okay, but it wasn't able to stand up to holiday crowds.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "My4-FKTO7xW-cDkZXtixqQ"
  },
  "YUh0oax-YsRhoTx8f4XkWQ": {
    "date": "7/29/2017",
    "text": "I give it 4 stars- 5 for historical value and atmospheric value and 3 for the actual food. If you've never dined in a 300+ year old pub while in London, you're doing it wrong.The house made cola was great! The roast beef sandwich was tasty and the sausages and mash were good too, just nothing really special. Just to sit in this place made for a good experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "las4DWdOJZ2oWaPVa2nBIg"
  },
  "JIswVGyuP-OHqqK_gnoV-g": {
    "date": "4/9/2017",
    "text": "The basement service at the bar wasn't that great, the bartender forgot one of our orders and we had to go back to ask about it. We came on a rainy day and while walking up from the basement pass the restrooms, there was a strong smell of urine. I don't know how the people drinking on that level can stand it. The upper level bartender was much better and served us up right. I will come back, just not downstairs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sJTYOxP_5Ve23EFqzGt0CQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sJTYOxP_5Ve23EFqzGt0CQ/o.jpg"
      },
      {
        "img_id": "-MyAY88o83kN31pPnUMB2g",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-MyAY88o83kN31pPnUMB2g/o.jpg"
      },
      {
        "img_id": "DnfToerBD2zCABvcMsd-vw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DnfToerBD2zCABvcMsd-vw/o.jpg"
      }
    ],
    "user_id": "75OBxtyITK3O0JofLsAYVg"
  },
  "Tn2w6ODDoAyKwyg4Y80kkQ": {
    "date": "9/27/2016",
    "text": "One of my favorite pubs in London.    A lot of pubs claim ancient provenance, and some of them are  even seem plausibly Victorian---but Ye Olde Cheshire Cheese is plausibly ancient.   Of course, the original bar burned down in 1666 (this isnt all that far from the monument), but this bar has had many famous drinkers, from Samuel Johnson to Benjamin Franklin.   It's kind of a tourist trap, but there are so many small alcoves you can get away from the crowd.   The food is good---by pub standards .  I think the room upstairs has a chophouse with a different menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9bPSt15Y1aQNFq0wegf5A"
  },
  "fn4g7vNLMkkUwLYRsEDAlw": {
    "date": "11/24/2017",
    "text": "Loved visiting this 400+ year old pub (rebuilt in 1666) in the heart of London. Friendly service and great Samuel Smith's beer (get the stout). But the real selling point is having a pint in this ancient room, you can feel the history...it's a sacred place for beer lovers!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7oSR_nzy_4KvlvAehcjYg"
  },
  "ql2vd6n5tdXakw_FERJ76Q": {
    "date": "3/3/2017",
    "text": "Oh, how I loved this place!Everything you want from a cozy, historic pub: Tiny staircases, small tables, low ceilings, original features and great drinks! We were in a hurry, and only stayed for one drink. We also didn't have food. But, I could see myself staying here for hours, and making it a regular fixture in my weekend routine.  A major plus: The bathrooms had been fully renovated, so you could enjoy the historic charm with the added benefit of a swanky toilet.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "tZtXllxS7SZ3tTHFWrIlpg"
  },
  "KT-irc5heNkqTLSMDeKBVg": {
    "date": "10/30/2017",
    "text": "This curious pub has lunch served two flights down in a basement.  It feels really old.  The fish and chips involves a real fish, rather than a filet.  It was super yummy.  Great selection of Samuel Smith ale.  Price for fish and chips was L 12.50 and service seemed to be added into the check, so lunch for two with two pints was about 32 pounds.  Not cheap.  Good though.  Particularly if you like eating in a basement.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wBwMi3-YtCN0JSOQMtIR6Q"
  },
  "18FmDsGbAzV5WIRycvHLcA": {
    "date": "5/18/2018",
    "text": "Cool \"cave\" sitting area when you go down. Sat and read abook with a pint. Definitely what you think of when visiting an old city like London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xXrC88jHeaMI3sRaIUPsGQ"
  },
  "Ab7O5mRrTG_MKS__kkZ1Fg": {
    "date": "12/27/2015",
    "text": "It is with a heavy heart that I have to give Ye Olde Cheshire Cheese a 3 star rating. This pub has been one of my favourites in London for the last 2 years however until this week I had never eaten in their restaurant or spent longer than an hour or so in there - sadly this week I did just that and the service really let the pub down.We were seated in the restaurant and straight away the problems started. We had to ask to be given the menus, we had to ask to order drinks, we even had to ask to have our order taken (twice) and this continued throughout the evening with further drinks, desserts, the bill etc etc. I realise it was Christmas and they were busy but I do think that if we didn't continue to ask we would have been sat there for hours on end and never received anything.Now for the food. I was VERY excited to see that steak and kidney pudding was on the menu (it's the northern in me) but when I went to order it the waitress informed me that they'd run out. I really felt like we should have been notified of this before hand as we then had to take a further 5 minutes to decide what we wanted and amend our orders. So, I eventually opted for the roast beef. The beef was cooked well and the gravy flavoursome however there definitely wasn't enough of it and you had to order additional vegetables and gravy if needed (which we felt was needed). Overall it was a slightly disappointing evening but what I will say is that this hasn't put me off Ye Olde Cheshire Cheese, it was just a bit of a let down. I will definitely head back when it's quieter and give the pudding a try.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "T_r-3V_Inu0RTt5yVj9DyQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Samuel Johnson (the man to write the first dictionary). We were sat at his favourite table :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T_r-3V_Inu0RTt5yVj9DyQ/o.jpg"
      },
      {
        "img_id": "Bn_BETC0oiy20dQHZHpbQA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. The menu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bn_BETC0oiy20dQHZHpbQA/o.jpg"
      },
      {
        "img_id": "c-HE6UgZb4Cd3OnlC87qaw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Sausage and mash - recommended!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c-HE6UgZb4Cd3OnlC87qaw/o.jpg"
      }
    ],
    "user_id": "Ry0REo4iHIAdZv42csbxWQ"
  },
  "re5J_niKZCIjJ5_gGPwgqQ": {
    "date": "11/17/2015",
    "text": "This pub is not on London's top tourist attractions list, but it might as well be. Every time I have a guest over from the other side of the pond, I conclude my Fleet Street tour with a sojourn up and down the many stairways and levels of this fabulous pub. The best part? It's older than at least a few dozen countries, mine being one of them!Walking into Ye Olde Cheshire Cheese feels like walking into a hobbit's house in the best possible sense. Turn down a Dickensian alleyway to enter the wooden panelled interior, with dim lighting and curved ceilings that make you feel as if it was carved into a hollowed-out tree. The tight entryways and cavernous bottom floor give this pub even more character. The good beer selection and its prized location means it's almost always packed. However, it is surprisingly expansive so you can usually find a place among its many drinking areas.  Absolutely a must visit for every true Londoner. I am definitely a devoted fan. The fact that it is literally a three minute walk from work (doesn't) helps!",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "zAZpV6TnwXB-bXyhEVBccg"
  },
  "0IVaoa2Z3KYbHr-iZQqg1g": {
    "date": "11/24/2014",
    "text": "The hubby and I are visiting London for a couple days and found this place through yelp and I'm glad we trekked all the way here for a drink. Less than a 10 min walk from the Blackfriars stop, located in an alleyway with a big round sign stating its presence. The top floor is for proper meals like steak and the such while the bottom two floors are designated more for drinking and bar food. We opted for the latter so we made our way down the creaky staircase into a room that looked like a wine cellar with little alcoves that held about 6 small tables in total which led to a bigger room with cafeteria style seating where the bar was located. Cool old pub vibe, it felt like I was being transported back in time. According to the hubby, the beer is on point and damn cheap at about £2 a pint. Can't beat that in the U.S. even after the exchange rate. I tried the alpine lager and I usually can't handle much beer bc it makes me feel bloated but it was surprisingly refreshing and light. Food is ok, tried the chicken & mushroom pie and bangers and mash. Expect your typical bar food - decent/edible but by no means worth trekking out here for. Would definitely visit again for the beer and old school pub vibe if I had the chance",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F1gmmUnVei-l4EHXHNaXbw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Chicken & mushroom pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F1gmmUnVei-l4EHXHNaXbw/o.jpg"
      },
      {
        "img_id": "KSKghvDPnWPyQiYPIdHFWQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Bottom floor where the bar is located",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KSKghvDPnWPyQiYPIdHFWQ/o.jpg"
      },
      {
        "img_id": "fu6wK1DaTlD9e18FF5r_kQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Entrance to the lower level seating",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fu6wK1DaTlD9e18FF5r_kQ/o.jpg"
      }
    ],
    "user_id": "nRHreRvxWdg_m99JVElu0g"
  },
  "lsGcuOqERenTCk0pUJKBtA": {
    "date": "7/21/2017",
    "text": "A historical gem hidden in an alley way on Fleet Street. I was staying in a flat in the 'Queen of Scots Building' next door and knew I had to try this place out. We actually ate here twice on our 7 day stay in London. The Bangers and Mash with onion gravy is amazing. Great cider on tap too. You cant find cider like that in the states. The pub is a dark multi-level labrynth. The chop house in the ground floor. I never went to the upper levels, but down below are 3 split levels with more dining space and a bar in the cellar. The cool cellar was welcoming on a hot day in June (it was in the 90's Fahrenheit and humid when we were there!). The cellar had large bench tables perfect for bug groups. I also had their fish n chips, which was good, but the bangers are my go-to dish. Prices are reasonable. A pint is pretty cheap and dishes go for around 10£. The loo was surprisingly modern in this 400 year old pub. Charles Dickens was a regular here and has a favorite table in the chop house. A great way to experience a very traditional British pub.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ZzJ_vUxlojfxYy7fwrgxg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Get it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ZzJ_vUxlojfxYy7fwrgxg/o.jpg"
      },
      {
        "img_id": "p8kmQtwffHHZATLXqTpz2w",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p8kmQtwffHHZATLXqTpz2w/o.jpg"
      },
      {
        "img_id": "kmQN7oldLWl4kd7Yvpc-DQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kmQN7oldLWl4kd7Yvpc-DQ/o.jpg"
      }
    ],
    "user_id": "33O3WZ_odvT2GdwTKMXROg"
  },
  "wsY3v0HaLyMj4QN_F7E_AQ": {
    "date": "5/24/2017",
    "text": "Great atmosphere..food was lacking.  I got the fish and chips and thought this place would get it right..they didnt.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gg9TZo-6VMPXwYbYLbmT7w"
  },
  "gDVlswsYAcEmnScsGcY6uQ": {
    "date": "7/8/2015",
    "text": "Five for the pub, three for the food. This pub is awesome. It's not too far from downtown and it is the perfect old, classic, traditional pub. You walk in and its almost like a maze - it has small adjoining rooms where you can sit, eat or drink. Its really fun - but always watch your head! They had a good selection on draft and in bottles. Well rounded menu and kind staff. We got the fish & chips with mushy peas. Unfortunately it wasn't very good - probably a 2 star. I like my fish without skin on, this came with skin on, which caused the breading to not really attach. The chips were little cold/soggy and the mushy peas were so bland. Come for a drink at this traditional pub but go for food somewhere else",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "fKXvfS2n5PNuCqz8fLxcGQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fKXvfS2n5PNuCqz8fLxcGQ/o.jpg"
      },
      {
        "img_id": "VxYVj_B3QOtP_9neAQVwFw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VxYVj_B3QOtP_9neAQVwFw/o.jpg"
      }
    ],
    "user_id": "WtBfZpY5xW1Gji6x04Fdwg"
  },
  "ykhrB5bPlWYb0LZlHhOHeg": {
    "date": "2/8/2014",
    "text": "This is one of the oldest and most historic pubs in London; well, it's really more of a complex than one pub. There are several floors but the basement is the neatest, as long as you're not claustrophobic. In the basement, you'll see pics of how the bar used to look back in the day which is pretty cool as you compare the area you're sitting in with the pic.I think it's super cool the notion that this has been around since the Great Fire and people still flock here after work to get a pint or two and try the meat pies. We are, after all, on Fleet Street (Yes, I really like Sweeney Todd). The food is actually pretty good (I LOVED the mushroom beef pie) and of course they have chips galore which goes splendidly with all the beer they have on tap.Be forewarned, the place is standing room and elbow room only. We happened to snag a table and some grateful locals shared it with us. Others, who were sitting or standing on steps that rainy day, weren't as fortunate.This pub is just NEATO and AWESOME AND AUTHENTIC, and why you go to London pubs in the first place.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "n_dvGnUZ5px1963WZ4wTTA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Meat pie is a MUST on Fleet Street!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n_dvGnUZ5px1963WZ4wTTA/o.jpg"
      }
    ],
    "user_id": "P6S7G1dex1QIhWntV_f0IQ"
  },
  "9tl9BctAcjYaqeEKzni2cQ": {
    "date": "7/2/2012",
    "text": "This place is brilliant. The ales are very good and the atmosphere is very friendly. It gets crowded, but what good pub doesn't?! I agree with the other reviewers, it's well worth a visit and then another and another! By the way, I like the photo that a fellow Qyper took for this establishment- I took one and it wasn't nearly that good! :D",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uQiAjlAvDfm_7FZDcH5HOg": {
    "date": "11/16/2009",
    "text": "What a great place and so much history.  An old friend recommended this place and told us that Charlies Dickens use to drink here!If an out of towner (like me), it's definitely a tough place to find.  Its like located in a narrow alleyway with a little old sign hanging above it.You first walk in and thing, wow...this is hidden and small but if you explore further, you'll find a narrow, low ceiling, hidden stair case towards the middle-back of the place.You walk down the stairs and there are several floors of cavernous drinking space.  You would have never thought that at first.  You hit the bottom floor (I think like three levels down) and its like the biggest room with another bar and serving delicious food!Overall, this place is awesome and its WAY older than any bar in NYC (yes, even McSorelys).  Definitely have to check it out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_fVMuRsHwaOIgNoKhkJ6wQ"
  },
  "-0t4rLMWNPPuxfP-naPD0Q": {
    "date": "9/13/2011",
    "text": "I've been here several times since my last review and have changed my mind regarding my rating.  The first time I went I did not have access to the bottom floor of the pub which has great atmosphere, and I've also been to a function in one of the upper rooms which had a lot of character.  The food is not so overpriced when you're ordering from the pub menu rather than the dining room menu.  Nothing special, but decent pub food and a fun, historic-albeit-a-bit-touristy (it is Fleet St, after all) atmosphere.  I've been here for just drinks, too, which is always fun.  Lots of great brews.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8JIDyRkzWPIW91_6Vco7A"
  },
  "vRDdGYyXptYZiB_3r2XhgQ": {
    "date": "12/18/2012",
    "text": "Fish and chips - the traditional British thing - not really nicely preprared here. I read all these reviews saying fish and chips are great, but I did not like my dish. Sorry, I do not think I am coming back again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAyjqhQkEqgn3CExccEQcg"
  },
  "ZgusyYjiCovGyjw5NruROQ": {
    "date": "3/2/2010",
    "text": "Out on a Saturday evening's pub-skylarking with a friend we found ourselves in Ye Olde Cheshire Cheese, and I have to say - I was very impressed! Initially the heat from the fireplace seemed oppressive, but that was possibly in contrast from the frigid chill we'd come in from. As our eyes adjusted to the stygian darkness of the front bar we managed to find a couple of chairs and thought \"Ah well, this is a tourist pub - we'll just grab one and then be on our way\". 2 hours later we were still there, having shifted to pints of ale with port chasers & chatting to a few punters who'd rocked up - we met a couple of lawyers from Lancashire, and a couple of tourists who had romanced across 4 continents. Maybe it was the fact that the pub - erected in 1667 - claims to have played host to a couple of hundred years' worth of literati, such as Dickens, Twain, Voltaire, and Dr Johnson, and so visitors entered eager for it to present a memorable trip and experience, rather than just another nice old building to stand in, look at, and walk out of again. As we sat, sipped & extemporised more than one new group of tourists ingressed - typically a shivering & slightly dejected looking gaggle led by an excited young man in front clutching a guidebook: and all of whom warmed up nicely, put away at least a swift half, before returning to the arctic Fleet-Streetian wastelands. I can't comment on the quality of food, as we only supped of the hop & vine. The pristineness of the toilets was remarkable - we suspected a recent renovation, but in contrast to the ancient smoke-stained walls upstairs, the loos were almost hospital-like! Having read other reviews here complaining about short pints & whatnot - the \"standard\" beers are dirt cheap (as Sam Smith's pubs always are), so getting 1/4 of an inch more head on your pint than you'd like isn't the end of the world... either let them know the tide's out, or quit whining. Realistically, the joy in this pub's in sitting back soaking up the atmosphere & ambience and enjoying a snug fireside chat - so get to it! It's a treasure. The only regret I've got is that the darkness in there was so impenetrable that I wasn't able to get a decent photo of the front room. And it had nothing to do with all the beer I'd drunk, honest.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wDjwfSuxNxfjQx1wbQfmHQ": {
    "date": "3/26/2012",
    "text": "Popped in here for lunch after a nearby meeting. I had heard of it, as the oldest or one of the oldest pubs in London (perhaps even the UK) but since I no longer live in the UK and a decent pub is one thing I really miss, this looked like a great place to try out. So the inside is dark and dingy, small rooms partitioned off, with steep creaky stairs leading to each floor. We sat upstairs on a table and I had a MASSIVE steak and kidney pudding with a pint of Bitter ('we only have the one, Sir') It was lovely but I wasn't hungry for two days afterwards!! Service was OK  seemed like there wasn't enough staff for the numbers of diners but not too bad.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cAP5gX5wKuAuUbPyYuc6nA": {
    "date": "7/12/2011",
    "text": "I had researched some traditional pubs to try when I had first arrived in London because I wanted to try traditional British food. This was one of the places I came across and so a group of us decided to venture out and give it a try. It was a little bit hard to find but it is a little bit of a hidden gem. There are sort of two floor which sort of threw us off guard. There is a top floor which is a little more upscale. Then, you venture down several windey staircases into a lower basement which is a dim lit area. It gives off a very old school vibe and you definitely feel like you are in a pub many years ago. I ordered some sort of pie that had mushrooms in it along with a snakebite to drink. I know some of the people I was with ordered the fish & chips but I can't remember any of the other entrees. My pie was quite good and I remember my friend saying his fish and chips was good as well.This place has a very nice little ambiance to it. It is definitely not fancy by any means but if you are looking for a traditional pub this is an awesome place that really gives you that old school pub vibe with some great food and drink as well!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MQ_gtoH3gb4ATeH30vDhtA"
  },
  "fZNI34c0m5ZJh7sf1TvsxQ": {
    "date": "2/10/2009",
    "text": "I can travel across the world and still find someone from the same city as me. Being an American is really annoying. I came to this place and managed to run into two guys from San Francisco, and we discussed our local coffee, weather, and they liked baseball, so not much else. Oh, and I also explained to one of them that \"pickle\" in England does not mean dill. A pickle is a different food entirely. We drank and mused that it is particularly odd to be sat in a building that is older than every Western-influenced thing in your entire country. Strange.Ah, but this is a Sam Smith pub. We can pick up some of the Samuel Smith brews back here in Crapland, but they don't export their organic fruit beers. Samuel Smith's Organic Cherry Beer is my favourite beer of all time. Screw every other beer, this one tastes like cherry soda and I love it. Downstairs in the cellar was about the only place my very tall friend could sit without hitting his head (constant reminders to mind his head never help), but down there on a weeknight we got attentive bar service and were able to eat our fish and chip baskets in comfort. I can't tell you how many times I went back up to the bar and plunked down a £2 coin for that Cherry Beer, but I do remember hugging an electric car later, so I'd say I had enough.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "nTNSvmAdVwczLHelQIIjVw"
  },
  "9G--DWutp8fhwjnpBUQicQ": {
    "date": "1/23/2011",
    "text": "So it's a bit of a tourist standard, but imagine my pleasant surprise one Saturday while schlepping my parents through the City's sights, to find the luncheon room open and beckoning with seats and solid 'auld English pub fare' that didn't make me choke!!!  With my mother enthroned in Sam Johnson's corner (the resemblance to his portrait above was a bit eerie...) and my pops in Charles Dickens' old seat, the coal fire in the grate gave just enough heat and smoke to make me mistake the place for a pretty authentic and well run reenactment joint.  Of course the Aussie accent on the super friendly service put the lie to that, but lo it's a real-life, runnin' pub!!!So, have some out-of-towners visiting? Get there around 12:00-12:30 (lunch is done by 14:30), order up some lamb shank, scotch roast beef, steak & kidney pudding and bubble & squeak, and settle back with an indy ale safe in the knowledge you've outdone your tour-guide duties, with the least amount of pain.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2QQzQi2gzwg413gQO2UZHQ"
  },
  "_5km_jo5vs6m_AEzaUXL9A": {
    "date": "1/8/2009",
    "text": "Great old pub on Fleet Street. Lots of History. Often crowded. Cheap pints. No branded booze. Mind your head on the stairs.It's also quite near the Templar Church if you're into that whole Crusader military order thing.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmVy4kTjG9-trE_UYnfCMw"
  },
  "Mvhz-14tw9299XfSa7zQXQ": {
    "date": "9/24/2011",
    "text": "A 1667 rebuilt pub was the draw for us to come here.  It is nothing spectacular.  The beer was the same as everywhere else and the food was mediocre.  My entire party ordered the fish and chips and was so disappointed with the tasteless dish.  This pub warrant just a 1/2 pint if you want to do a pub crawl in London.  The downstair bar in the wine cellar was really cool.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jdp8GdEeIkLT570RLwKSVQ"
  },
  "jBjphAS8oUkTMZzyl-ccAw": {
    "date": "1/25/2010",
    "text": "Great Sam Smiths pub. Not sure I'd want to be in there during peak times but it's a great old building and I found the beers cheap (Sam Smiths pubs stock all their own brand drinks and are usually cheaper than other pubs). The toilets are totally modern. Check out the writing in the old books on the way to the loos upstairs too. Can someone tell me what the double-decker tables are for? Empties? Candles? What?Oh, we had nibbles in here. The mushroom soup was very warming on a snowy winter afternoon and the fried cheese tasty. Not sure about sit down meals here, we were only stopping in for a couple.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sYSWgNMQuOcbs1XEsIsONQ": {
    "date": "10/4/2013",
    "text": "this is my third favorite pub in all of london and a great place to take my friends when they come to visit the uk. the historical aspect was what first got me to come around a few years back and i loved it ever since. the maze like hallways and various little rooms are anything but off-putting. the atmosphere is really relaxed and very much open for anyone. love the house cider and ale, which are definitely worth a try",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FXGmIucl8I1Ag0dslBEr9A"
  },
  "hpWrAdmIbnPUFklol2vnFg": {
    "date": "9/6/2009",
    "text": "I really really want to give this place five stars. It's a lovely pub while great little cubby holes and nooks and crannies (although does it have more nooks than it's sister pub The Princess Louise? Probably not). It's a Sam Smiths pub so you'd expect the rounds to be cheap, right? Nope. Not if you order anything other than the draught beer. I was feeling hungover so ordered a cheery beer and a soda water. The bill was £5.10. EXCUSE ME? £5.10?! Apparently charging £1.20 for soda water is normal. Their tap water is free - so they've just charged me over a pound for bubbles. But they'd already poured it and I had to pay for it. Not impressed. £4 for cherry beer means that it's not a cheap drink - you only get a bottle. My cheap (hungover) night out was somewhat marred by this. But dammit the cherry beer is really yummy. But if you're looking for a cheap night out, best stick to the draught beer. Had I done that, this place would have got five stars.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_DUz-LiMGvE0MGDAxRo8lA": {
    "date": "12/21/2013",
    "text": "First time visiting London and was expecting some great pub experiences. Although we had plenty, sadly, this was not one. Brews are the same as you get at any of the pubs in London. Atmosphere was for sure \"old world\". You come into the main bar and if you want something to eat, you wind your way down stairs to the three rooms where they serve food. Ofcourse, no one from the establishment tells you this, you have to ask the patrons. They don't have wait staff, and don't bus tables. When we got there we found a table free so we waited for someone to come by a clean it. After ten minutes, I couldn't find anyone and a lady nearby told us to pile the dishes aside and order at the bar in the next floor down. We did, and got fish and chips and the meat pie. Both were really lacking in everything. I don't understand why in England the chips are not crisp, and the peas are mushy but, this was the same just about every single place we went to. I would say that if you want a pint and maybe a n appetizer in a really old pub, this is the one. If you want to go for a meal, go somewhere else.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ewf7SiicRovQr-70TKnszQ"
  },
  "vXmh9fldNusTFXXQKA8ZBg": {
    "date": "12/19/2010",
    "text": "I HAD to make my way down to this pub, mainly because of the location and the fact that it is the oldest pub in London.  I had to see if it was worth the trek.  And it WAS!  While it wasn't all that crowded (which I was grateful for) I did wish there were a couple of more bartenders, and/or waitstaff.  But the food was great (for England, that is...HA!) and the prices were reasonable",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2UsODzVseLTjBA6RC6P-Ew"
  },
  "tF2qJtMWfpP73_gJLcc28A": {
    "date": "2/21/2010",
    "text": "This is a real quaint olde world style pub on fleet street. It was a damp saturday night in the heart of the city and it was still busy so its obviously quite a pull. The tourists ove it because its untouched and genuine. Made up of lots of tiny crocked rooms over 4 or 5 floors its very cosy with warm roaring fires in a couple of the rooms.the prices are very reasonable maybe the cheapest place to drik in central london. The low star rating is simply because the choice of drinks is so limited. However for a quirky visit its well worth it.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rhCi-6R4seJky6B9H2FqQg": {
    "date": "12/11/2010",
    "text": "This pub oozes character. And I will admit, I had walked past the alley entranceway about 20 times before realizing (through Yelp) that it's actually a pub. Inside, the place is classic: wood everywhere, lots of different seating options, staircases, big rooms, little rooms, dining rooms. For ambience this place gets five stars, no question. On the night I visited (Friday, 8pm) the place was full but not crowded. There was only one bartender preparing drinks, though, and I think there should have been two. Not a huge deal, but we did have to wait about seven minutes for a beer. And as far as drink selection goes, this pub is about average. I do like Sam Smith, so as far as tied houses go, I would rank Ye Olde Cheshire Cheese above, say, a Youngs or a Fullers house. But compared against a free house with decent selection, Ye Olde earns runner-up status. Although, to Mr. Smith's credit, he does charge bargain prices for his pints; there's almost nowhere in this city where you can find a pint for £1.99.So to sum, Ye Olde Cheshire Cheese is a good pub with that old-world, historical vibe. For the discerning beer drinker the beer selection is average, but for the average drinker (or tourist, or cost-conscious dude) the Sam Smith range will meet their needs. I would bring a guest here and will probably return at some point as the pub is about one block from my lady's place of work. Overall a nice pub that everyone in London should check out at least once.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "_uoK7XKECF9S5NqRh210ug": {
    "date": "2/9/2012",
    "text": "As a Yank, this was my first visit.  As I like to search out the oldest pubs when in European cities, this made the google cut.   The location and appearance certainly lends to the authenticity.  Upon entering there was a warm fire and the wood of centuries gone by.  We grabbed a couple pints of Smiths and headed downwards into the earth.  Mind your heads going down.  Apparently Englishmen were much shorter in the 17th century.  It is cozy and intimate with small rooms.  You can feel the history as you sit there.  No food for us, but well worth a stop for a pint or two.  We'll be back next time we're through London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o2ioyS8jziHToWTFusP8ZA"
  },
  "_fhKEbirxATNDTy0CO3i1A": {
    "date": "10/16/2011",
    "text": "if I had to sum up this place in one word it would be BRILLIANTthe number of nights I've spent in this pub drinking decent beers & wine with my mates!atmosphere is greatstaff are fantasticthey even do great food! (only gripe is that their kitchen closes a tad too early)great location close enough for me to stagger homewarm and welcoming pub",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_8NT16NtZm9RuX9iLDxWzg": {
    "date": "2/6/2013",
    "text": "I really enjoy going to places with a bit of history and this place did not disappoint.  It has been around since the 1600s.  We mostly sat in the upstairs pub by the entrance.  It was small with a couple of tables but it had a nice historical feel.  Came here and had a few pints after exploring the city.  This is a great place to stop by to have a pint and rest if you are a tourist and need a little place to stop and rest while walking up and down fleet street.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzqWuFQTOUSkbnVQBKbnyw"
  },
  "HQV6jdpIwkfx0JyBCheFCQ": {
    "date": "8/5/2012",
    "text": "Not a fan.  Will never go back.  The 2 stars come due to the fact that the location and atmosphere of the place is super cool.  Maybe if you just want to drink beer this is a great spot.  I had fish and chips, and it was a terrible experience.  Some people may have had better than me, but my wife and I disliked it thoroughly.  I had fish and chips one other time while in London, and loved it.  I cannot say the same about my experience here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PpPSNutizb28mEmje8IDxQ"
  },
  "71MbQtIIqRYzyZoEld9s6w": {
    "date": "11/5/2009",
    "text": "My wife, who is Texan, was awed by the fact of it being rebuilt in 1667 just after the great fire. About 65 years before George Washington was a twinkle in his father's eye. The atmosphere was welcoming with friendly staff and happy diners. The menu was festooned with potentially repugnant old English delights for me along with the less adventurous traditional roast meats and puddings for my wife and our 9 year old daughter. We were a little concerned at first as the wine list consisted of Red or White but our fears were unfounded as the red turned out to be very good indeed. The food was good honest unpretentious English grub. My wife enjoying the roast beef, Yorkshire puddings with trimmings, which was well prepared and the meat nicely rare, My daughter had some of the best bangers and roast potatoes, they mercifully allow substitutions, I have ever tasted and I had the steak & kidney pudding although neither of them wanted to try mine for some unknown reason. My steak & kidney pud was indeed traditional. It had a mildly worrying ripe flavor and it contained more kidney than steak which was crowned with a thick stodgy suet crust (absolutely delicious). The presentation of the meals would have sent Gordon Ramsay into apoplexy but this went well with the surroundings & I don't think Charles Dickens would have complained. My bum started to hurt about thirty minutes into the meal as the benches are hardwood. However I think this may be a Dickensian way of getting the diners to finish their food quickly & move along. In the spirit of the place I endured this discomfort as I am sure these benches have been shined by more auspicious bums than my own. We went for a couple of the English puddings and tried the Welsh rarebit out of curiosity all of which were reminiscent of school dinners. The sticky toffee pudding was great but I would advise you to give the bread & butter pudding and anything with custard a miss as it was watery & tasteless. Good fun, interesting and cheap food, nice staff, bring a cushion.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ktjw5B1IQUTzk4Zepp7qTQ"
  },
  "sQWWF-zq7KiFgVEw9encNQ": {
    "date": "1/16/2010",
    "text": "Tricky tricky... to find, and apparently to pronounce while giving directions. Say it five times fast, go on... But you know how I love finding places off of main roads in dark alleyways, so Cheshire Cheese and I are bound to be meeting again in the near future.  We stopped in after being around St Paul for a bit, and I was skeptical that there was going to be anything worth stopping at off of Fleet st at night, it all kind of seemed to die out after 8 or 9. The beers were great, and the abundance of rooms gives you the space to pick a spot without being jammed in somewhere...and the prices were all pretty cheap.  It's going to be added to my list of must-stop pub hops!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "S-hJ4jFb5hfkqwODmHqBZg": {
    "date": "8/10/2010",
    "text": "Yes it's touristy, but what would you expect from the oldest pub in London? It's still got plenty of character and the multitude of levels and rooms makes it quite easy to escape the wankers.And the beer (Sam Smith's) is only £1.99/pint.  You really can't do much better than that.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvVj-bD8-ccNW1m7zCO7WA"
  },
  "dKmVMy1NMBI4GSq3r0O4Jg": {
    "date": "7/2/2010",
    "text": "THE oldest pub in London - it's definitely a hole in the wall since the entrance is via an alleyway! It's very dark inside but it makes you feel like there's been a lot of history and deals being dealt here. The pub is pretty small but the beer is really cheap. Definitely worth checking out if you're in the area, if not for beer, than for the history of this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-qbpumFHhpiT7BLK2yGXg"
  },
  "81wSXTjyBc3iMeJYWdiIkA": {
    "date": "7/15/2010",
    "text": "A true pub where you can dine and drink amidst the dark wood and tight corners, knowing that such famous literary figures as Dickens, Tennyson, and Twain once spent their hours here. It has a truly old and historic feel while offering delicious, real English food (it wasn't until I ate here that I could say I'd had real English food). I had the steak and then an apple crumble - both were amazing comfort food.I would definitely go here again, making sure to take any new comers to the city here as a site-seeing stop as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1bjOt3gHjOVEHR4GcWm2w"
  },
  "GiniizfqMyHD7eZWCf2jkA": {
    "date": "1/22/2010",
    "text": "this bar has it all! HISTORY- but i don't know what it is. SPACE- because no one can find it. CHEAP DRINKS- and i'm broke so i need it. STICKY TOFFEE PUDDING- because everyone loves a good pud pud!the bar made for a perfect post-graduation celebration location. as we all gathered centrally walking up fleet street looking for a new place to go. I had heard of the cheshire cheese before and had always been curious about seeing it. and i am so glad that I did, it was my lil treasure chest of pubs. I have a feeling that it's not always as empty as it was on that fatefully freezing thursday, so I know I was lucky to have such a good introduction.lets go back there again. now. and lets be sure to get a table again... maybe this time we can get one by the fireplace, and lets open up those strange/empty decorative boxes on the wall.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "-5iKWUMlzitL_AFR8tm93A": {
    "date": "3/4/2012",
    "text": "I'm really torn on this place, and I see the good and the bad, but I know that I would never ever suggest going here, and wouldn't go back unless there's no way around it.In my positive review, I'd say:An absolutely interesting pub to bring friends or visitors to because it feels like a historic maze, and you can almost imagine dice games being played among whores and returning soldiers in 1724.  There are multiple rooms and nooks and crannies over three stories and a courtyard.  The food is cheap and not terrible, and the drinks are decently priced.  Mostly this place is worth it for the history and the story.In my negative review, I'd say: If you have any issues with claustrophobia or any inclination toward cleanliness at all, skip this place.  It is always SO PACKED in the evenings that you can't move from one room to another, have to fight to get the to bar, and have to wait ages to get up or down any stair case.  It's a terrible place for meeting friends because you will never find them, and there's no cell signal in half of the place.  The bathrooms are pretty gross, and the temperature control is atrocious- from sweaty, smelly, nastiness in one room, to parkas in the next.  They measure their alcohol pours a bit on the stingy side, and while the food is okay, it all seems reheated and is uninventive and underwhelming.  There is a nicer dining option upstairs, but the tables are mixed in with the bar area, and the space is really small for everything going on, so you're going to enjoy your meal with someone's ass in your face and a non-stop flow of traffic.Overall,  MAYBE stop in for a pint for historic reasons- or just walk in, walk around, and get out to go somewhere less like a theme park.  There are boat loads of historic places in London, it's not enough of a selling point to make it worth the hassle.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gf1UQyDGfNI_xfoxqItpmw"
  },
  "-w0FR1b3wXDnucqa59QSOQ": {
    "date": "2/13/2013",
    "text": "Perfect old pub right on Fleet Street. The Chocolate stout was outstanding.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BnrHIwU8GMJJ401Upom_Hg"
  },
  "pECOHdOHKDkPfR5gZ325pg": {
    "date": "11/18/2014",
    "text": "Great pub, good food, good history, and so many good memories here.  This is a great place to bring out of town guests to visit an historic English pub.  The food is good and they even serve a Thanksgiving Day meal if you are American looking for a place following the service at St. Paul's.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5zA1P5MLL1eEw4jN5i5cDg"
  },
  "ziT1VzQS8Tjwvd-rfIZhbg": {
    "date": "4/2/2013",
    "text": "If you are a fan of the whole pub experience this is the it place. I have been there few times. When you are there it feels like you are in different time. The food is nothing special, but it is a great place for tourists.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JGW2js6hleK6A3ZOYWugTg"
  },
  "k0W1Qq1lyfUZFUhkgHHFzA": {
    "date": "9/22/2014",
    "text": "Great pub, not too crowded or busy.  Interesting interior and very good beer.  The fish and chips was just ok however the hubbies meat pie was quite good.  Very old place to boot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7mdILTAwibC8sTEMw0PY2g"
  },
  "F_NYILaAtYdbYOHkJGaN-A": {
    "date": "3/25/2009",
    "text": "Cheeeeese. I love this place. There is not a single bad thing about it. The multiple levels and different areas of this labyrinth of a pub. They serve a good mix of beers and have McCoy's chips. One of the best nights since I've been in London came to fruition courtesy of the Cheese. I prefer the down-downstairs part as there is an easy access bar and tables. My only recommendation is for YOU to go here. It is just fantastic and why I love going out on Fleet Street. This is definitely the place you go after you've already had a couple. This is where you spend the remainder of your night till they kick you out and you find somewhere still open nearby.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 9
    },
    "photos": [],
    "user_id": "GhPsVqtRtf1t-H9OIa1jMg"
  },
  "mLUrCAI-dhxRAVxgpqB6DQ": {
    "date": "6/15/2009",
    "text": "You know how sometimes you just want to feel like a 65 year old man who's lived in London his whole life?...this place makes me feel that way.  Its as traditional as \"traditional english pub\" can get.  And the biggest plus is that its cheap!  Some pints are less than 2 quid.  Its tucked away making it great for just hanging out and conversing with friends.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jdn3EG9KBRyjZH0HP_orzg"
  },
  "N8gtQtriN-rCTTWS7xM_7A": {
    "date": "8/11/2009",
    "text": "A great place to drink or eat. Foreign tourists will love the sense of raw Englishness and history you get in there. And Brits will love it too, because drinking in there is like drinking in a timewarp - it really does take you back to 18th and 19th century London in a very authentic way and without coming across as kitsch or overly romanticised.The pub even seems to reek of coalfire smoke, which really added to the ambience for me. And the dark, heavy wood panels and tables take you back to a much browner period of history.The sausages are good, as is the rarebit.The beer is good, I thought a bit pricey, but that's to be expected from a pub right on the Strand.I love the historical info next to the stuffed parrot too. It was a pub pet famous for its proficiency in swearing, which, when it died, received obituaries in hundreds of papers worldwide. Utterly bizarre.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wHFwNWe2fF4xofrbMjItMQ"
  },
  "6wgDyK3T2ODDjy76L_rn-A": {
    "date": "3/13/2009",
    "text": "Try not to go here when already drunk and locate someone. It's really difficult. And mind your head!You've got to love somewhere that has a wine list of two: red, or white. The place is great: it's full of history, nooks and crannies, tons of seating space, standing space, eating space, getting lost space... Olde and Englishe and a perfect place for a pint or five.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  },
  "d_3GITotASb6CdmL15T2gQ": {
    "date": "2/18/2010",
    "text": "This is everything you really want an English pub to be: a pub with character, history, cave-like rooms, a little bit of grime. The sign underneath says it all - \"Rebuilt in 1667\". That's right, as in, there was another pub here even before this one, a mere 343 years ago. Great atmosphere, reasonably priced Samuel Smith beers (amongst others) on tap, and they even serve bar food, which is of decent quality if you've had a few pints. Authentically charming, which is a rarity, I think.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9m9adcWg9h8mRX9idm9Qw"
  },
  "Eo29VOz-Yaud3Xp0Im4yeg": {
    "date": "12/2/2012",
    "text": "This has got to be one of the best pubs in London. Mostly for its \"olde worlde\" charm and the fact it is hundreds of years old. You can't help feel like you are going back in time when you walk through the door!It has some great history to it and considering its tucked down a little side alley, you would never think its as big as it is! It's massive! Multiple different rooms and bars, a huge cellar bar, restaurants, saloon bar etc.The staff all seemed nice and being a Samuel Smith pub the drinks are very well priced too!A mate of mine recommended a new iPhone pub-finder app called \"Smith Finder\" bit.ly/TxB5ki that features this pub in it and loads more like it. Great for doing a bit of a pub crawl around London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqj7a6cosMvficdjd7oULA"
  },
  "yPgDlWw3C4Rf42jMXRDKbQ": {
    "date": "5/28/2009",
    "text": "As a tradition, everyone at my work goes for a slice of the Cheese every year after a service in nearby St. Paul's Cathedral. And it's the best bit of the day.Tucked away from Fleet Street, this not-so-secret secret is a real treat. A pub with huge character, the cosy interior, dim lighting and log fire set the mood for a long night of boozy story-telling and, if it takes your fancy, a game of hide and seek. Unless you're as mature as the Cheese and don't do childish games anymore.The downstairs area has its own bar and with a good selection of tipples as well as the usual bar snacks, you can easily wile away the hours without even realising where the time has gone.Time for another trip to the Cheese. Anyone?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "5vD1hK-oG4tKgnLKZCGRhw"
  },
  "kLcaAue6pVhOqm0f2gcTeQ": {
    "date": "10/17/2017",
    "text": "If History and experiencing a friendly and classic London Pub is on your \"to do\" list.  This is a must stop.   Located in the Central London area, it is near many significant attractions.  Have a pint, maybe two... enjoy the history and the patrons.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SmfLVH36iSeVGdK8xrIlJw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SmfLVH36iSeVGdK8xrIlJw/o.jpg"
      },
      {
        "img_id": "46XBScVv-I8cGp6BOVErlQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/46XBScVv-I8cGp6BOVErlQ/o.jpg"
      },
      {
        "img_id": "3LsgBc9NinJnGu97zBNuBQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3LsgBc9NinJnGu97zBNuBQ/o.jpg"
      }
    ],
    "user_id": "WtL-L8gfnNzI1ipYNn4UMw"
  },
  "-Ov2bGDvK_SRCPGtE-dBhA": {
    "date": "9/30/2018",
    "text": "Ye Olde is definitely an old tourist trap. In fact, I think Ye Olde is the the Disneyland of pubs in London. They have a not so subtle gift shop right by the front entrance.  But who cares?  After all, it is the oldest and possibly the most interesting pub in London and you just have to check it out (like Disneyland). Right outside the entrance is a sign chronicling its 400 years of history with the ruling kings.  (It puts the McDonald's \"billion served\" sign to shame.) It is rumored that Shakespeare hung out here.  To think all the drunks, scandals, and pub fights that occurred there over the hundreds of years, it's amazing that Ye Olde is still in business.  Beyond it's history, the pub also has an interesting floor plan.  It has multiple floors which are below ground.  (It must have been a conveniently cool place to hang during the air raids of WWII.)  each floor has tables and benches.  The pub also serves food but my local friends tell me it's expensive and not great.  Ye Olde also has its own beers too, but I wouldn't trek to Fleet Street just for their brew.  I would, however, go for the history and the ambiance.  Cheers!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_F8kIRSuCIlatAzG1rk6g"
  },
  "8J4dBoItRRa8_GUp-jA4bw": {
    "date": "6/29/2017",
    "text": "This is the greatest pub in London and my favorite pub anywhere . . . Anywhere! Truly an amazing place, located on London's famed Fleet Street, just a half mile from St. Paul's Cathedral.  Originally opened as a pub in 1538, it burned down in 1666 during the great fire of London, and then reopened in 1667, as it has since remained.  Where else can you sit among the ghosts of such notable regulars as Sir Arthur Conan Doyle, Alfred Tennyson,  W. B. Yeats, Benjamin Franklin, Samuel Johnson, Mark Twain and Charles Dickens,  to name just a few.The interior consists of a maze of different rooms, a chop house, numerous bars,  spiral staircases, narrow passageways, coal fireplaces and a variety of antique grandfather clocks throughout.  One of the most interesting rooms is the cellar, with its vaulted white ceilings  and white stone floors.  It is believed that this was originally a guest house belonging to a 13th century Carmelite Monastery which used to occupy this site. It is amazing how big this place is once inside, as it seems unassumingly small from the main entrance.    Part of the charm of the Cheshire is that it lacks natural lighting, giving it that gloomy aura of centuries past.The food and drink offered is better than average 'pub fare',  but the reason to visit is for the history and charm of the Cheshire.  It really is a mandatory stop for all who visit London.  Ye Olde Cheshire Cheese gets my patented 4 thumbs up!!!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "g2WNlF9CC8_0NiTHHKtIuQ"
  },
  "_Jf3s4o5QAY7hO5MW1d8zA": {
    "date": "8/24/2018",
    "text": "Charles Dickens' fave hangout? YES PLEASE! The staff is super cool here! Drinks are SO reasonably priced and what a cool piece of history the building is! I was going to give it 4 stars as the food is not too impressive, but the 5th is for the staff. I asked if I could pop open some windows and whatnot and they were so sweet and let me open as many as needed on the upstairs floor. I love this place. Just go!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4LOfakAyk0Atxc0jDWNVg"
  },
  "zKpH2oaox1qvrpsRe6ZuwA": {
    "date": "3/28/2018",
    "text": "Being from the States, this place is hands down amazing. Great atmosphere and great company. This place holds a lot of history and should be visited by every grader schooler.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "quJ6v6B2e6vVV24_FwD3YA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/quJ6v6B2e6vVV24_FwD3YA/o.jpg"
      },
      {
        "img_id": "K0_X7awQe4wdFHEkaUDjCg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K0_X7awQe4wdFHEkaUDjCg/o.jpg"
      }
    ],
    "user_id": "2oMw6aPhb1pd419WR9ri3Q"
  },
  "zLG41Z4g76MprsvpXAeLww": {
    "date": "1/15/2018",
    "text": "One of the oldest pubs in the world. You can't go wrong. I also am a big fan of the Sam Smith pub. I believe there are better Sammy pubs in the city, but this one is the classic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXhscxwFTd-ayLTdPx_2yA"
  },
  "QJVx09eeOKl3hXv0FiHEMQ": {
    "date": "3/30/2018",
    "text": "incredible and amazing experience! The history, the atmosphere. My husband happened across the review. Must see!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIrihnFa4CvFn0PqiMZaYg"
  },
  "7x6wHNEs0WtNFmoBNVkorA": {
    "date": "11/18/2016",
    "text": "Ye Olde Cheshire Cheese is a cool historic pub in the center of London. You'll find Samuel Smith on tap here. I had one half pint and sat in front of a radiator, which was the best part of my visit. It was so damp and cold outside, so having access to direct heat was incredible.I arrived earlier in the day, so it was mostly just older folks. Plenty of visitors though for early afternoon! I'm sure it's more fun at night (or with other humans) though.Bathroom is downstairs. Clean and tidy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uAR7v3PY8loLFA8y5zxvIA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Half pint",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uAR7v3PY8loLFA8y5zxvIA/o.jpg"
      }
    ],
    "user_id": "GcdYgbaF75vj7RO6EZhPOQ"
  },
  "GDMuEecBHwyk4LUN73qZVQ": {
    "date": "6/27/2017",
    "text": "I love this pub because of (1) our amazing waiter Michael, (2) the amazing dishes we had, (3) the real pub experience. Michael was the most friendly waiter I've ever had. Not only was he accommodating, he told you about everything from British beer to Parisian culture and made exceptional conversation throughout. The British beer had my head spinning but I could still taste the hearty mash potatoes and succulent cod from the cod and chips dish. This is a must go to pub because of the amazing service and excellent food and beer :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ppVqcmn5cjyC6JCtdB6kw"
  },
  "8U4bKU7M190JGf2GkQS_JA": {
    "date": "3/16/2018",
    "text": "Cute historic pub that happens to have yummy fish and chips. The mushy peas are also good. Touristy, but definitely worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7cWGy2ouO4mWn5tETUcV9A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7cWGy2ouO4mWn5tETUcV9A/o.jpg"
      },
      {
        "img_id": "vQXI-ZNLJeOH--G5YQEGEQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vQXI-ZNLJeOH--G5YQEGEQ/o.jpg"
      },
      {
        "img_id": "JVDp4e3bHfN4h4WrFJaUDQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JVDp4e3bHfN4h4WrFJaUDQ/o.jpg"
      }
    ],
    "user_id": "_0deBaPEYnOalzjZ-tUEAg"
  },
  "LvZA2J5UdmNbXxb-IDazkw": {
    "date": "4/20/2017",
    "text": "Cool pub. The place is huge there are tons of rooms and separate bars on all floors. I had a slow pour beer(my favorite) and my sister and I shared the fried goat cheese with a small side salad. It was tasty and came with a delicious sweet sauce on top. This is a great pub to grab a pint!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qNtakVaGl8V4PmUCQghmkg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qNtakVaGl8V4PmUCQghmkg/o.jpg"
      },
      {
        "img_id": "OegXvxQJe9zFvg8-j6K-XA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Goat cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OegXvxQJe9zFvg8-j6K-XA/o.jpg"
      }
    ],
    "user_id": "1gov-oAqh5LMrOkYeP7tbA"
  },
  "QwPsLAHk4GujQrYwJthRxg": {
    "date": "5/9/2017",
    "text": "During our tour of London highlights, the guide mentioned as we past this pub that it was the oldest operating pub in London; on this site since 1538, but it was rebuilt in 1667 after the great fire.  With that type of history, l could not resist going back to try a pint.  We worked our schedule around and found a way back.  The pub is located off Fleet Street but down a walk way to the left of the pub's sign.  Don't worry if you go in under the sign, there is a map directing you to the pub's entrance. Upon entry, you are in a very small room; very low lighting and very rustic.  You can order here or go down the stairs where there are two more counters to order from in two separate rooms.  We ordered drinks first and then explored.The server in the first room was great.   I wanted to try something new and local to England.   He was very patient and explained and suggested something that was towards my taste.  Our next task was to find a place to sit.  The inside is arranged into small and medium rooms with tables for 2, 4, 6, or 8. The atmosphere is rustic and lots of stairs to get you to different levels.  I thought it was unique in how you could chose how private you want your setting.The beer was very good and produced by a local brewery.  They serve food but unfortunately,  I did not have time to order.  I loved the history and character of this pub and will definitely set a return trip when I find myself back in London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XucG0m9HGT8IE_GPDyn33A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. A place not to miss",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XucG0m9HGT8IE_GPDyn33A/o.jpg"
      },
      {
        "img_id": "WTdT8wHZa1SQrthsgzqpMg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. A taste of English brew",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WTdT8wHZa1SQrthsgzqpMg/o.jpg"
      },
      {
        "img_id": "NaAlBrErrmPv5Qd3NcXQ7A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. You can get non alcoholic drinks too",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NaAlBrErrmPv5Qd3NcXQ7A/o.jpg"
      }
    ],
    "user_id": "QS6ZvpEBWt5Ap2tGtO7jAA"
  },
  "19spKuiQ4AVrQoz9gmxCOg": {
    "date": "8/27/2016",
    "text": "Service at least with the young man that took care of us was great! Everything he recommended was delicious and he was pleasant Beers to order... the Taddy and the Bitter! Food to order.. sausage and mash, bubble and squeak and the toffee dessert for sure! The cheese tart was interesting but I wouldn't say a must order. Try to eat in the Chop room! It's the room with the adorable Parakeet and the table that Charles Dickens sat at!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "701L70RaTHYTNUbNiUj1fQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Toffee dessert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/701L70RaTHYTNUbNiUj1fQ/o.jpg"
      },
      {
        "img_id": "G-XulCIdqxfAApc0biDLNQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Bubble and squeak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G-XulCIdqxfAApc0biDLNQ/o.jpg"
      },
      {
        "img_id": "FwMJwcohOMbdS80LYz4kJw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Sausage and mash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FwMJwcohOMbdS80LYz4kJw/o.jpg"
      }
    ],
    "user_id": "kHAgdAPmzY7rNekrFFNLBQ"
  },
  "cyqXRdWKM9rb_3iO1s_5YA": {
    "date": "5/12/2017",
    "text": "Rick Steve's audio tour took us here and of course we had to have a snack! The oldest pub in London! The best local beer in London. This was one of the best meals with had in London as well. The menu was VERY basic, but delicious. The sandwiches come with tortilla chips, which we found a bit odd, but they were very tasty! I recommend one of the sandwiches with tuna!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "W1vE_AgMZ3YqJIX2J49NMQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Tuna cucumber sandwich with delicious mini salad!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W1vE_AgMZ3YqJIX2J49NMQ/o.jpg"
      }
    ],
    "user_id": "1gz0_ZfZrtddgA1NjTz4xA"
  },
  "mJkEx0KKCZwwW6x2i_0SqA": {
    "date": "5/24/2017",
    "text": "Looking for a cut gem tucked away with locals - we'll join Charles Dickens on a time back in history as he frequented here !",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pls57cXcvpf8MftMAgvAdw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Samuel Johnson a regular here - history says he was first English Author of the English bible !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pls57cXcvpf8MftMAgvAdw/o.jpg"
      },
      {
        "img_id": "l2nacQSVSacf9863rd4a0w",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Down narrow alley way and a hidden gem",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l2nacQSVSacf9863rd4a0w/o.jpg"
      },
      {
        "img_id": "DDfEwLwF2Y7fLAwd_ekB-Q",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Downstairs bar cool temp and lots of history !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DDfEwLwF2Y7fLAwd_ekB-Q/o.jpg"
      }
    ],
    "user_id": "2bqPc1yFS0V4UKyfxEOWZQ"
  },
  "GiNz7PcoLUIa8n-A564oMQ": {
    "date": "4/5/2017",
    "text": "I've been here twice, once in 2015 and again this year.  The ambiance is amazing.  It's cozy and there are nooks and crannies everywhere.  So even when it's really busy you still have a feeling of intimacy.Oozes with history and one of the oldest pubs in London.  Charles Dickens wrote poems and proses and read them to anyone who would listen while sitting and having a pint back in the day.The food is classic pub fare and it's good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GA9blngx5p5OrgzEEScwGQ"
  },
  "iqEx21bZk8l8xzg9eJSJzg": {
    "date": "7/3/2016",
    "text": "Steeped in history that goes back to 1538, this is one of London's oldest pubs. It was rebuilt after the great fire of 1666.This place is like a labyrinth with six  levels with different bars and rooms on each level.Noted for being the frequent haunt of notable writers and poets; Sir Arthur Conan Doyle and Mark Twain. It's said that Charles Dickens wrote the Tale of Two cities here...It was the best of times....'it was the worst of times.'If you are a tall person, over 5'5\", you will bang your head on the low ceiling while negotiating the stairs.This is owned by the Samuel Smith brewing company, noteworthy for being one of the oldestbrewers in the UK from Yorkshire since 1758..As such you will find they have ample supplies of stouts and ales.This is where I discovered their Organic Chocolate Stout. If you like a Guinness you must try this beer. It can be found at most Total Wine stores.Very casual but you won't find a pool table or cell signal here and the menu is limited.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KH96Q5i6uN6yoZooeDpbkw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KH96Q5i6uN6yoZooeDpbkw/o.jpg"
      }
    ],
    "user_id": "rv9d5TcnnxuOCX7ole_Clg"
  },
  "g7tEobIHzeurvMjl0Fw6wg": {
    "date": "9/23/2017",
    "text": "Necessary stop after our ghost tour!  Bartender was so knowledgeable and friendly. Great suggestion to mix the raspberry beer and chocolate stout!  The interior is amazing as we were told it's been this way since 1667, with a cellar bar. Great find!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aRPlMRzfSUg5gL0U5H8ZQA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fruit beer is always a must!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aRPlMRzfSUg5gL0U5H8ZQA/o.jpg"
      }
    ],
    "user_id": "0Mz7-Qus7i3Hwm4jXnCd7Q"
  },
  "XZ3ejcW-5QwWxFHlulvEmA": {
    "date": "2/9/2017",
    "text": "You do not come here for the great beer but you come here for the history.  And for the history alone, they got a star.It is a classic british pub with small secular rooms and many floors (namely as you go lower).  They serve Samuel Smith beers on tap and darn are they good.  The history, however is fasinating.  Charles Dickens, Mark Twain, Sir Arthor Conan Doyle all use to call this place their pub.  To drink here and think of their novels is pretty awesome.If this wasn't so old and was just a regular pub, it would be a 3 stars.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXG-proxqxxbFbBoFfRh7w"
  },
  "GginJ6BKbSU_RtExAtMajA": {
    "date": "7/30/2017",
    "text": "This is a pretty interesting pub. Most of it is down the stairs and in the cellar, with pretty low ceilings as you're going down the stairway (mind your head!). I made the mistake of waiting in a queue for 15 minutes in the tiny bar upstairs to only be told to go down to the basement where they serve most of the food. My wife had the fish & chips while I had a Steak + Kidney Stew with several pints from the bar. The uniqueness of the bar and interesting ambiance make it a must try.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yH2kFp89W-qG1hyQfV5Ykw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Steak and Kidney stew delicious food with chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yH2kFp89W-qG1hyQfV5Ykw/o.jpg"
      }
    ],
    "user_id": "Z0SKDWUEcSrRPMD-Z60Z8Q"
  },
  "NNqa0QicAn8lQ-OFiwjOcQ": {
    "date": "5/15/2015",
    "text": "Stopped in to take in the history but was left disappointed. If you get a seat on the ground floor then it's excellent but don't waste your time on the lower floors. No character down there",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ni--wIn-qEtwjDYAm_4DQA"
  },
  "6LOsWSeeu2MCEcy1K_12EQ": {
    "date": "5/21/2013",
    "text": "I can abide a tourist trap, but the sullen teenager serving beer at the front, I simply cannot. Not really worth a stop. The Seven Stars has a bit more character, and the service was friendlier.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRl0Xa87r-dPcNXjCKpmew"
  },
  "GvvYhLJqZvnlLkhqZHSNbg": {
    "date": "8/7/2010",
    "text": "This is my absolute favourite pub in all of London. A treasured place since my 2006 study abroad, the Ye Olde Cheshire Cheese is sure to delight anyone or everyone with the historical atmosphere. If you come for a visit this is the first place I'll bring you. It's known as being a pub from the 1400's but it burnt down during the great fire of 1666, therefore it was rebuilt in 1667 and has been that way ever since. It boast that Mark Twain and Charles DIckens wrote here, enough for any writer to want to grab a seat to think where and what they penned over a pint of ale. It's got a great selection of beer and ales. The best part is that they are cheap with great quality. In celebration of completing my dissertation for my Master's, myself and a fellow colleague had dinner over our favourite pint Alpine. She had the soup of the day (mushroom and vegetable) while I had the three cheese mac and cheese. Although fairly priced, we both were hesitate about ordering the mac and cheese. She hails from the South and as American's we've taken notice to how different the English make our comfort foods over here. Before I ordered I asked the staff if they honestly would eat the mac and cheese with them reassuring me they usually pick what they would only eat themselves on the menu. (it is possible they just gave me a line but I appreciated the humor) We were able to sit in my favourite section, in between the lower dinning room and below basement banquet seating bar. With our buzzers waiting to vibrate letting us know our food was ready we enjoyed the slightly echoey cave like clean dungeon setting with original lighting that wasn't too dim nor very bright. (if you've been here you know what area I'm trying to describe)Upon first glance at the mac and cheese it appeared to be a kind of casserole rather than what I was expecting. Nevertheless it was absolutely fabulous! The cheeses were all melted together, pasta perfectly cooked, and icing on the mac was this mixture of bread crumbs, pepper and garlic toping. It was the perfect size complete with butter for the roll and a light salad with a pleasant dressing made it more filling than the under £6 would have suggested. My friend's buzzer happened to be broken but the staff were able to bring her food out without letting it get cold due to the malfunction. It does get very busy in after work hours, but the beauty of this pub is that there are so many different places to sit and enjoy that it shouldn't be a problem. If you're tall you have to make sure to watch your head, it's over 400 hundred years old, before being able to accommodate everyone. It's a must visit pub whether you've lived all your life or are just passing through. It's also situated a couple of blocks above where The Black Friar is meaning it's a little out of the way to get too as Blackfriars station is closed for renovation. Enjoy it now before the Olympic rush will pack it to the point where you won't be able to breathe.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjDgWfROZfFt8OSGz6GJCQ"
  },
  "1kYubau7YBiTkgH_2GZWCA": {
    "date": "3/26/2011",
    "text": "This was one of the few places I had to go while I was in London.  The place is so old and you can tell upon entering.  There's an upstairs and then separate bar rooms on the first floor as well.  We went to the back bar, which was empty at around 5:30 but packed by 6:00.  It looks and feels old and dingy, which was its charm.  Thinking about the amount of people over the hundreds of years that have sat in the same seat as myself and drank was just an awesome feeling.  I got the beef and kidney pie and my husband got the spicy chicken.  I didn't see anything special about the spicy chicken; it was similar to any chicken at a bar you'd get in the states but the beef and kidney pie was very good!  I would've preferred it with mushy peas as opposed to regular peas and carrots, but other than that it was great!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dgiVMQrLMxYubREFUU6QQg"
  },
  "_vavdUHh3coWu0Zcz31ZYw": {
    "date": "7/6/2007",
    "text": "This justifies the 'Olde' in its name, as there has been a pub at this location since the 13th Century, although the present building dates from 1667. The date gives a clue why: the original was a victim of the Great Fire of London in 1666. Mark Twain and Dickens certainly drank here, and Samuel Johnson lived close by, so he probably did too. The building is a wonderful warren of small, wood-panelled interconnecting rooms, all on different levels. It's tourist heaven, but it gets a mixed clientele of lawyers and office workers as well. There are two bar areas, with the main entrance, on one of Fleet Street's little side lanes, adding to the sense of atmosphere. The pub is tied to Yorkshire brewery Sam Smiths, and when I went recently they only had Best Bitter on tap, though it seemed well kept.. It ought to get four or five stars. But they really need to train their staff better: I was served pints with the largest heads I've ever seen (over two inches). This was largely because the sparklers on the pump were too tight (even though Yorkshire beer is normally served through fairly tight sparklers). When a friend (who is a head brewer at a different brewery) pointed this out, the barmaid said, 'what's a sparkler?'. That said, the staff were very willing to top the pints up to a reasonable level, when asked, and were generally very friendly. But an unknowing tourist would have received two very short pints. Sorting this out would deliver four stars, which it really ought to be able to earn, on account of its history.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_pYTNf90AKN0MoxPFXc4Q"
  },
  "pvCFp9k3EXut50VfGsmErg": {
    "date": "2/11/2010",
    "text": "I now know what it feels like to be a mouse, to have a lust for cheese and to inhabit an abode that is nothing but tunnels, alcoves and doorways. Finding a group of friends in here is not an easy task unless they have a homing devise on the. Unfortunately non of mine did, so I called them and they came out to find me.This unsuspecting doorway off Fleet street opens out into a rabbit warren of a pub, serving honest British basic food and Sam Smith beers. A round for 10 cost less that £30, thats £3 a drink... in central London. Bargain! This pub oozes atmosphere and a chilled out vibe, great for drinking wine and escaping the rain in the city or snuggling up with a hot date. It shows the people you take here that you really know the hidden gems of London... just don't tell they you found it on Yelp! ;O)",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "p5C2fdkz6Y5VZRtz8FbloQ": {
    "date": "2/22/2010",
    "text": "The best pub in London.  Historic, cheap beer and you're likely to get a seat.   The building  is so wonderful they can have sawdust on the floor and not be stupid.  This pub out pubs them all.PS I forgot to mention that they open the cellars at 6pm, so if you happen to be a-lurking you get your pick of the nooks and crannies.  Also, you'll get to bang your head on the stairs.  This is a very important ritual.  I've heard if you bang your head on the stairs at the Cheese you'll have a clear head No Matter How Much Cheap Beer You Drink..  Yes indeedy, this is a FACT.PPS Err In the Summer on a stuffy day the cellar is... even stuffyer.  The pub is next a court yardy area where you can go but  still.  BluegghhhhPPPS  This is a pub you go too to get slowly drunk and bond with people.  Do Not Buy Food here.  No non noonnooo...  Gastropubs have a whole new term all to themselves for a reason people and the Sam Smiths chain have worked out that they will sell food two groups of people,   no 1 Tourists who don't come back - and no 2 Drunk people - they don't remember..  Locals come here for the cheap cheap  beer, the lack of music and the four centuries of ambiance. These are great reasons.  Absorb these as your reasons before you go!!! NO FOOD.  Ok?  Good.PPPPs Ok, except chips and wedges.  You may have chips and wedges.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "eCKMAdMvP2Zg1CATe-AL_A"
  },
  "kOOp6SKNAwCql0_N4LVArQ": {
    "date": "5/7/2013",
    "text": "Amazing old pub with a great feel . It bleeds history and was once frequented by Charles dickens. The beers are cheaper then most other pubs in the St Paul's area and the serve their own unique drafts. There are multiple bars to drink at but the best is the one in the cellular.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-BzgJA8XBm0HV91vfVBpA"
  },
  "QNNsx3e_kZWtO4u3QQXldQ": {
    "date": "2/10/2010",
    "text": "As my late granny would say, 'cheeses darlin', this place is AuLD!' In fact, Ye Olde Cheshire Cheese is much older than my 99-year-old grandmother was when she passed, although it's hard to believe that anything other than Cher and cockroaches could survive for near on 350 years. Well go on then, YOCC! 344 and counting! This maze of a pub is sure to tick all of the boxes for your \"traditional London pub\" experience, with low ceilings, secret drinking spots, cosy wine cellars, seemingly endless stairways, and the smell of 300+ years of drinking den debauchery. Basically, it's amazing. Back to my earlier tangent, I can't tell you why or how granny could always make two syllables out of monosyllabic words like \"AuLD\" (or would it be \"Owl-ed\"?) But what I can tell you is that good 'ol granny Francis - built from hearty, corn-fed, mid-western stock - would have loved this place for all 99-years of her life, and would haunt the place in a heartbeat if she knew of its existence.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "ZYen9RfZFXu2Q3n0_JpN1A": {
    "date": "3/16/2010",
    "text": "This is the best pub I have ever been to.They have cheap, yet delicious beer on tap.  It is right in the center of London.  There is not just history here, but you almost feel as if you are a part of it just by winding down the short stairs and into a dungeon-esque atmosphere.  There are all sorts of corners to sit in, and did I meantion that they have cheap delicious beer?If you can find this place off Fleet Street, it is your duty to enter.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "cvkLinqobaKn4jAh-SHS6w"
  },
  "oYgdFC9YkJhtnSQePZilwQ": {
    "date": "9/26/2010",
    "text": "Lovely underground banging decent ales, decent prices... it's a classic on the tourist trail as well as on the monopoly trail. It's a Sam Smith's pub, so Yorkshire prices. It's allegedly the oldest pub in London.And it's good. Not fabulous, but good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "y1dBSR67IPkXu-oDXV-40w": {
    "date": "3/6/2012",
    "text": "I did not expect this place to be what it was. We arrived early afternoon and were directed downstairs. Down very very low stairs. Where the cavernous cellar greeted us with a variety of table setups, nooks and communal seating. We settled on the very lowest level, hogging a communal table to the 4 of us as it was still rather quiet. As I expect the others will yelp about their own experience I'll only write about my enjoyment. From the downstairs bar I ordered a Cola. It came from a unique brew bottle and it was rather delicious. There is nothing better than a nice soda brew.I had a rather large breakfast and so I was in no mood for too much for lunch. I ordered from the fried section the battered calamari. I have a slight tendency to order calamari when I can, I just love the stuff. I've had good, I've had bad. This was some of the best I've ever had. It tasted as if they had caught the squid within the last hour. Fresh, the perfect tenderness, with excellent flavour. Even the batter was delicious, light yet crisp.If I lived in London I would frequent the Cheshire Cheese just for the calamari.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "cqaXsUE90c2TUL53uyp4qQ"
  },
  "DAeOv7qNy34keZ_PP5SwyA": {
    "date": "5/20/2010",
    "text": "Everyone's stated the obvious and no one's mentioned the pie's, so i'll start and let others take over.  the pie is very tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ULK94n8lgBIG0_F1aIYhvQ"
  },
  "DtWk0vNrgMtzRv0_egOfNw": {
    "date": "2/22/2010",
    "text": "Last winter, I spent a week with some friends visiting pubs during the day and checking out Premier League games by night.  While we were in London, we happened upon this place and it was a gem.  There's quite a bit of history, central location, three different rooms (although seating can be sparse) and some great Samuel Smith beers on tap.  And they're reasonably priced: 5 pints for 11 pounds was the best deal we found all trip.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "h6DDUgM1XVtfVyw5QAuxZQ"
  },
  "d80SyVsEemCP6hiiN3yICQ": {
    "date": "9/8/2010",
    "text": "A slice of Dickensian London, a few hundred yards from a number of Dickens' landmarks ( such as The Old Curiosity Shop). The atmosphere here is laid on with a trowel, with very dim lights and fires burning all year round. Also very cheap beer. Good place to bring visiting relatives from overseas or those easily overawed by \"history\", or to have a couple of quiet pints with chums; not the place for a raucous night out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GUUH2FU7r36h1KxEhZFXQ"
  },
  "VY9895ZQS9IHnT9WUJUM2w": {
    "date": "10/2/2009",
    "text": "Where better to end a month-long hiatus from drinking than at a historic London spot like the Cheese?It's Sam Smith's, so I probably should have picked a beer instead of a glass of red, but I wasn't in a beer mood. And the wine was pretty good!I love the entrance, I love the maze of rooms, I even love the stink of booze in here. But only because it's the cheese.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "XGaMoQ6sg0B5hSzC5aRmdw"
  },
  "MrQN7DIVnZA3ooQwVKcUDw": {
    "date": "4/24/2010",
    "text": "I do love this place, especially for the £1.94 Samuel Smiths :)But the food is good, the service was pretty slow in the restaurant but our server so was so great we totally forgave her and the ambiance is crazy, especially if your sitting in the downstairs pub...crazy loud, fun & a bit touristy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bthy5xUTVgg4QfZ6AJCaJA"
  },
  "V_sxSMNPFcxe4AMZCGiq5w": {
    "date": "1/21/2011",
    "text": "Amazing place, you cannot leave London without visiting Ye Olde, neat neighborhood.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zXmuqjTJtfyipHFiEBUR1A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zXmuqjTJtfyipHFiEBUR1A/o.jpg"
      },
      {
        "img_id": "mnPHMTHMPthpdlx9X3hmqA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mnPHMTHMPthpdlx9X3hmqA/o.jpg"
      }
    ],
    "user_id": "2b_Qh4RR9uBb5ALGov5x4g"
  },
  "Lqi_DfM5OycGP5pxpRziHg": {
    "date": "9/17/2009",
    "text": "It's an institution, Ye Olde Cheshire Cheese.  You might think, 'What the hell kind of name is that?  It must be a gimmicky olde englishe London pub'.  But, in fact, you'd be wrong.  I mean, this place is on official maps of London for crying out loud!10 Downing Street... checkShakespeare's Globe... checkBritish Museum... checkLondon Eye... checkYe Olde Cheshire Cheese?  Yes, it's there on the map too.  Check.Compartmentalised into numerous drinking and eating rooms, with several bars, the Cheshire Cheese has old (at least I hope) signs that say things like, 'This room is for the enjoyment of gentlemen only'.  I stayed out of that room, not because I'm a woman but because it was at the entrance and I preferred to explore the pubs other, more cavernous rooms.This place is down an alleyway off of Fleet Street, offering it absolutely no opportunity for natural lighting; its interior is dark and dank with low ceilings. It's positively gloomy inside.  But, I say, the atmosphere is just perfect for some afternoon drinking on a miserable, rainy London day.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "j4hGVd1XUA7lR4-ndCR-Mw": {
    "date": "2/9/2013",
    "text": "An excellent spot to enjoy a pint of your favorite Sam Smith beverage- mine is the Extra Stout- and conversation with a friend.  Be sure to explore this very old establishment.  It seem there are endless stairs and small rooms.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nCvnNpsJ6q-YGd5Mm_lHA"
  },
  "2VSq1_VzZV1FvwhiqDfuNA": {
    "date": "11/14/2018",
    "text": "If you come to London you have to visit one of the oldest dining establishments and pubs, right?  There's been a pub here since 1538.  That's 69 years before us Yanks even started to colonize across the pond!!    I consider it a huge bonus if you can sit under a painting of one of your favorite memes (Dr. Samuel Johnson), and he's not the only famous literary figure associated with the place, as it can also count Charles Dickens, G.K. Chesterton, Alfred Tennyson, Sir Arthur Conan Doyle and Mark Twain among it's patrons.   That is a very impressive list.You now another thing you can do?  Whisper an inappropriate joke about the menu items while there too.  Oh yes, Spotted Dick.  *titters*  By the way, I strongly suspect our waitress was NOT amused by my giggling at Spotted Dick with Custard, but she hid her annoyance well.  (You really can't take me anywhere.  I have the maturity of a 12 year old boy.)Anyway, all of this and I forgot to tell you that the food was delicious.  I had roast beef with potatoes and it was amazing- hearty and satisfying.  In fact, forkfuls of that was the only thing that kept me from being a full time giggling, Yankee jackass.  I'm trying to do better....I swear.  *giggle*",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rklSpVv_f3WR-l5lqycl5A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rklSpVv_f3WR-l5lqycl5A/o.jpg"
      },
      {
        "img_id": "x-MskXCy9URafIJjs1zgIQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x-MskXCy9URafIJjs1zgIQ/o.jpg"
      }
    ],
    "user_id": "XMy-OTpVY8O1L-8w1zOKcw"
  },
  "09DeCWSvU6JVOg4Gz54SSQ": {
    "date": "8/2/2018",
    "text": "Obviously coming into London there are a few things that one wants to eat, try, and see. You definitely want to see some history, you want to eat some fish n' chips and you want some good beers. Ye olde Cheshire has all of that, it's charming in a way that transports you to a different time. Once you walk in it's dimly lit along with candles on the table. The pub itself has portraits of old patrons and has shiny black painted walls. We were seated right away near the portrait of a patron that favored that particular part of the bar. Do go downstairs, it looks as if it used to be a speakeasy down there. The service is amazing, our waitress was sweet and informative. We ordered their organic line of fruit beers, the cherry was my favorite. Then we ordered the fish and chips, which came with mushy peas and scraps. She was nice enough to inform us that scraps are the pieces of the fish fry that fall off. Once eaten as a snack with salt & malted vinegar but was banned for being detrimental to ones health. Although the fish as so many have commented was under salted, we didn't mind adjusting it to our liking. Squeeze some lemon, add some salt and don't skimp on the malt vinegar. It was delicious, moderately priced and exactly what we wanted.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 5
    },
    "photos": [],
    "user_id": "oh3tI4bX14h20eDfwQEAAA"
  },
  "88U05HiRytj0Yv_0AmODFA": {
    "date": "8/1/2018",
    "text": "Absolutely the worst fish and chips I've ever had.Not only was it overpriced it tasted as if the oil was months old and they didn't even bother to take the skin off some of it. Tartar sauce was Heinz from packets. Simply terrible.Pathetic. Hopefully I don't get food poisoning",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gIMtfHxfngSeuBQLv2KNeQ"
  },
  "YxE0E91b80QOXT4YmWJbuA": {
    "date": "9/6/2018",
    "text": "Steak and kidney pudding wasn't as good as the sausage & potatoes I had on my first visit. We got there before 6pm, so we had to sit downstairs. You have to go to the bar to place your food order, and to get your food when it's ready. (They give you a buzzer) Dining room at the main entrance opens at 6pm.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-mxKFyIszvknSZ_fOBTeaQ"
  },
  "NK9xrKxqAjNofm0m5uED3w": {
    "date": "5/14/2018",
    "text": "I'm almost tempted to rate the place at 3 stars, because the food was rather mediocre, but it could be my choice of a meal, so 4 stars it is.First of all, the place is ancient. I mean really old. I mean eating in catacombs kind of old. The historical value for me was that this (supposedly) used to be Sir Arthur Conan Doyle's favourite haunt. I certainly liked to think so, and therefore I've enjoyed a few beers there.The basement bartenders are a fun bunch (that's where you go for food, and for the catacombs), and the vibe is positively fun (so fun I've ended up with a stain on my tie, and had to urgently buy another one, but that's a story for another time :))Will repeat, when the opportunity arises.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gMw0qqsyOPC2v47wSC47eg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gMw0qqsyOPC2v47wSC47eg/o.jpg"
      },
      {
        "img_id": "2VEh0kwDqpf73wwt1-Q9zQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2VEh0kwDqpf73wwt1-Q9zQ/o.jpg"
      }
    ],
    "user_id": "fjFYpwpvlIlqoiNa3myDEA"
  },
  "U3pb2AI8_ykzEhvL8lmHRg": {
    "date": "12/30/2017",
    "text": "It's old and dungeon like. You'd be safe coming here if there was going to be an alien attack, as you are around 20 feet under ground surrounded by solid brick with no windows. It's dim lit and feels like you went back in time  They have the greatest drink I have ever tasted. Their bitter is absolutely wonderful. I was here 2 years ago and I have never forgotten it. It was the highlight of my second trip to London. I can't get this stuff at home, and I will always stop in for a pint every time I'm come back. I love the history. It's in a great spot on a beautiful road. And it's usually quite packed. Just mind your head as if you enter the dungeon. DRINK THE BITTER!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eUeObRAxGsGkDUCD-ZGzeA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eUeObRAxGsGkDUCD-ZGzeA/o.jpg"
      },
      {
        "img_id": "VWMIcFyvM1bIq3O5oghyIg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VWMIcFyvM1bIq3O5oghyIg/o.jpg"
      },
      {
        "img_id": "K4vVirBrmvG2DoW_whzAgg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K4vVirBrmvG2DoW_whzAgg/o.jpg"
      }
    ],
    "user_id": "r1WfF83sPjX4VtmuJH-v3w"
  },
  "chzQVkXVIDMnLFzwVh5miA": {
    "date": "5/31/2018",
    "text": "Overall, not a bad place to have a beer. I think more than anything, one would go for the experience and for the ambiance, knowing that this is a place that has catered to people for hundreds of years. This is kind of an amazing thing, if you really stop and think about it. However, the beers themselves weren't phenomenal (though traditional) and the food was just ok. It can get crowded (with tourists) so finding a spot to eat and drink might be difficult. I stood awkwardly along the edges until I sat down at a table and made friends with the people (tourists) already there. I would say: go for the historical aspect. Revel in the fact that you're in an establishment that far exceeds you and your existence.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-VSlrMM1cKRs7_KMmyTKew"
  },
  "5YEh9Cof5VSC5jedTq49bA": {
    "date": "8/29/2018",
    "text": "It is hidden, but worth the visit for a different kind of pub to visit. It is thick with history and has hidden nooks and crannies with tables to sit back to enjoy the pint. It almost makes you feel philosophical sitting there.We had a ploughmans and a pint of ale, it was enough for two to split for a solid between meal bite.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G5djbF3QkJIKzG_C4l53SQ"
  },
  "GZuInglk06k37qtll829IQ": {
    "date": "5/18/2018",
    "text": "We came here not for food, part of it for beer and other part is for history. Since someone mentioned that Charles Dickens and Mark Twins were here, just to pay tribute to these great authors and their books of my childhood. Environment-wise it's a traditional English bar with 3 floors and each floor contains semi-secluded sections. Good place for young people to fly their spirits.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ot6C10vk1-a156dpWLSDA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0ot6C10vk1-a156dpWLSDA/o.jpg"
      },
      {
        "img_id": "0SmzQ-B2kqZiNUb6rEeFNw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0SmzQ-B2kqZiNUb6rEeFNw/o.jpg"
      },
      {
        "img_id": "dZYPOdgAvX7K1sZdHXbjiw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dZYPOdgAvX7K1sZdHXbjiw/o.jpg"
      }
    ],
    "user_id": "eekAvFuO9vuIEPA1Gv7-rA"
  },
  "GkH11qgcLVFa8Djt4LscaA": {
    "date": "4/20/2018",
    "text": "Lovely little pub known for being over 400 years old. Had a lovely light lager. 'Tis' was recommended by a Liam at the Borough Market. It was great to sit and enjoy the cellar on a rare hot day of London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4_1PrW0qCcxuSp6g8W3cxQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4_1PrW0qCcxuSp6g8W3cxQ/o.jpg"
      },
      {
        "img_id": "xGgHud2zUYax960uU_vB7A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xGgHud2zUYax960uU_vB7A/o.jpg"
      },
      {
        "img_id": "Y-rhlY0eHuUfx_0BVXPkQA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y-rhlY0eHuUfx_0BVXPkQA/o.jpg"
      }
    ],
    "user_id": "l9q2jp0U11cBNTYH93EzSg"
  },
  "5XAFuWFaTXiwk-CmnJVytA": {
    "date": "8/30/2018",
    "text": "Book a reservation!  Had no idea they were needed but the place was fully booked with space only in the basement. Which by the way, is insanely cool. But it did mean that I wasn't able to order from the full menu which was a bit of a downer since I'd heard so much about the Welsh rarebit there.  I almost gave it four stars due to the barkeeper who was quite rude and even insulted my drink of choice - could do without that. But the pub was well worth the long walk and I'd go again in a heartbeat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fvDGIC7azQHev04UKtri6w",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fvDGIC7azQHev04UKtri6w/o.jpg"
      },
      {
        "img_id": "p4tjNljqMyT45z0dMmU3BQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p4tjNljqMyT45z0dMmU3BQ/o.jpg"
      },
      {
        "img_id": "PnoA8DR5W6TcmLp9EWgWVQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PnoA8DR5W6TcmLp9EWgWVQ/o.jpg"
      }
    ],
    "user_id": "jGUCpUll9sVK56PBWj2vIQ"
  },
  "QjOVofPIhhEtxji24AIwdw": {
    "date": "12/11/2017",
    "text": "Two London Pride pints for 4.45 quid?  Why, yes.Wow, they do have happy hour in Jolly Ole.The steak and ale pie with vegetables and mash was so deelish.I love that it's difficult to get a table in this Uber historic pub. It keeps you fat Americans outta here.Cheers, mate.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Z349ZJiVoQn_g5Tr3Eqkgg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Yup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z349ZJiVoQn_g5Tr3Eqkgg/o.jpg"
      }
    ],
    "user_id": "Yjer78RnYr7OCzirgdcOaw"
  },
  "UtRADJtejAnYdCL1HeBjAg": {
    "date": "8/5/2018",
    "text": "Very cool atmosphere. Rebuilt in 1667!. If only those walls could talk. We had the fish and chips.. very tasty. Local beer excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDyF6_uGL5BW7PkwspB3Qg"
  },
  "FKNIX39wSIUVRFSPevy9zw": {
    "date": "6/15/2017",
    "text": "Apparently this place has been around for hundreds of years, and it's also one of the most reviewed restaurants/pups in London within Yelp. That got my butt down here, especially since the wife was craving fish and chips.They didn't have Guinness as I've been meaning to try it in the UK as some claim its better than in the states, but alas they didn't have any, as they serve their own stout.  Well, how was it? Pretty good.  The food was also top notch and you really feel like a person out of time when you come in here.  It's also a bit hard to find as you have to walk down an alley. It was a great London dinner experience and I couldn't have had it any other way. It might be a bit too dark in here for my tastes, but overall thumbs up!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rjzJLIrcQgTXTVKC2I6EUQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rjzJLIrcQgTXTVKC2I6EUQ/o.jpg"
      },
      {
        "img_id": "oItNPwUfA0SyHWCQa9ttEA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oItNPwUfA0SyHWCQa9ttEA/o.jpg"
      },
      {
        "img_id": "FHAsRgD3zGCT1ouPK5AsNQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FHAsRgD3zGCT1ouPK5AsNQ/o.jpg"
      }
    ],
    "user_id": "ODsM6-_BvHt6-cqNylJn7g"
  },
  "AeOjKUFd3-BxHBR7ulTxbQ": {
    "date": "12/20/2017",
    "text": "Both a friend and Anthony Bourdain recommended we stop here for a pint and we were really glad we did. Before you even enter you feel like you are stepping back in time, and possibly having a rendez-vous with Sherlock Holmes. As soon as we entered the bartender directed us to go downstairs and to \"mind our bog\" (watch your head) because the ceilings are low as you go down the stairs. Really low. We made our way to the cellar bar and ordered a pint and chips then found a fantastic corner to enjoy them. It was a really cool pub with great atmosphere. The chips were on point and I hope to go again on our our next trip.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GgkfyVPbuotd5NAz6m8e-A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GgkfyVPbuotd5NAz6m8e-A/o.jpg"
      },
      {
        "img_id": "NtlCGZPQs7ZNDApWMBhpbg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NtlCGZPQs7ZNDApWMBhpbg/o.jpg"
      },
      {
        "img_id": "uuOLG5LD2IFMnK8cW0lsGw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uuOLG5LD2IFMnK8cW0lsGw/o.jpg"
      }
    ],
    "user_id": "oCQL1K75KqzptANKH5eUCQ"
  },
  "npgVCUjMRzxdgwy4C9r5eQ": {
    "date": "5/28/2018",
    "text": "Went here because of a recommendation from a friend. However, I would not recommend it. It's definitely a traditional pub and the atmosphere was added to experience of \"traditional pub\" but the food had absolutely no flavor to it and was somewhat cold. I got the cheese, onion, and leek pie and my mum got the fish and chips. We both felt the food had no flavor to it. The fish also had a lot of skin still on it.Waitstaff was friendly though.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRkKF7NVeXIFgyNHS_H2oA"
  },
  "6mwmTAz8GSQs48cC7mJmAw": {
    "date": "6/25/2018",
    "text": "This restaurant is about 400 years old. The inside is well maintained keeping the same style. The food was great and it definitely a great spot in London to get Fish and Chips.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DfAB7GPkwT1Y0VLX-nfTiA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DfAB7GPkwT1Y0VLX-nfTiA/o.jpg"
      }
    ],
    "user_id": "3ad7ewAbfW8wiaxpfUq34Q"
  },
  "KjiOuFqhSdIEdNFpZInogg": {
    "date": "9/29/2017",
    "text": "Ye Olde Cheshire Cheese is one of London's most iconic pubs. This ancient establishment located on a tiny alley off of Fleet Street has played host to the famous, infamous, not-famous, and me!   Samuel Johnson who lived around the corner was a frequent imbiber here as was Charles Dickens who lived a few streets to the north. Mark Twain stopped in when he was in London - you get the picture - it has many associations with more than a few literary greats.  Tourists do find this spot or perhaps I should say their tour guides find it for them but there is still room for Londoners and frequent travelers to London as well. If you want to eat in their restaurant room, think reservation only.  But don't despair if you have no reservation .... it's cooler to eat at the self-service downstairs. You order at the bar two levels beneath the ground level and you will be given a beeper that will flash red to pick up your food when it is ready.  The pub food can be very tasty and don't forget to help yourself to the condiments.  I had a very good steak and kidney pudding accompanied by veggies and potato slices.  Naturally you would expect some good beers to be on draught and they were - I especially like the house ale. My only recommendation is that bubble and squeak is on the restaurant menu but not the pub menu. Aww guys - put it on your pub menu as well.The prices are very fair and the staff are friendly.  Sir Arthur Conan Doyle devised some of his Sherlock Holmes mystery plots here.  After a few beers at the Olde Cheshire Cheese, you might just come up with their solutions!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "htny-vu8Tf_enh4KrASB7g",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Steak and kidney pudding, potato wedges, and peas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/htny-vu8Tf_enh4KrASB7g/o.jpg"
      },
      {
        "img_id": "qVj_aAZ8Hg3SU4I3mDg3Ag",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Grab an ale and your pub grub condiments",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qVj_aAZ8Hg3SU4I3mDg3Ag/o.jpg"
      },
      {
        "img_id": "LxU_yOCOcMBTDpgjC8OUkg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Two levels down",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LxU_yOCOcMBTDpgjC8OUkg/o.jpg"
      }
    ],
    "user_id": "8EMU7d4pCkdqUnvlIW40CA"
  },
  "3ndaso3fU72StxPa3U6ahg": {
    "date": "9/18/2017",
    "text": "I highly highly recommend ye olde Cheshire cheese for anyone who likes a pub and history. The building has multiple different room and the layout can be confusing to figure out where to go to get food.We ended up all the way downstairs in the cellar bar. The bartender was equity with all the history about one of London's oldest bars so you got a full show with your pint and bite.The meat pie that I had here was AMAZING and I believe this is a dish they change up. My plus 1 had the bangers and mash and thoroughly enjoyed it. It's pretty cool to sit in one of the favorite pubs of Charles Dickens. Perfect for lunch or stopping for a snack during your London pub crawl.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "lhfBYKIUPIB2M7U-Q97BHw"
  },
  "R_BZeMH4XBAGfZzqv1iKRg": {
    "date": "6/16/2018",
    "text": "Love this place. Historic and well kept. Your best bet is to head straight to the basement to get food; but, it keeps with the charm. Wonderful selections of beer and food. I really enjoyed my steak and ale pie.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WMrNNb7qJY1jBFypNZdPhg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WMrNNb7qJY1jBFypNZdPhg/o.jpg"
      },
      {
        "img_id": "p5DhWhJDxzKnYvyPh1HZpQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p5DhWhJDxzKnYvyPh1HZpQ/o.jpg"
      }
    ],
    "user_id": "NtQg7dlLlG8QMWqP7DuPgQ"
  },
  "xSjg0IWfoVWwOPfgH2oX6A": {
    "date": "10/18/2014",
    "text": "This place is pretty awesome. Lots of personality and vibe, super old, historical, good hand pumped beer and good food. Seemed like there were more after work drinkers than tourists when we were there. There are lots of interesting rooms and corners to peak around, and don't worry there are a few different bars. Watch your head if your going downstairs, but the low ceilings add  to the charm here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ws6u2g1O_608ybQCZHHoUQ"
  },
  "JfnP3u7uHDVO70yneY_ZbQ": {
    "date": "12/10/2014",
    "text": "Feels like walking into an episode of Game of Thrones. If you like beer, the Taddy Lager and the Wheat beer are a must have.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYE0C0pEsr3PBrYO7O4DIQ"
  },
  "1rueRIYopc_dfD7uuVF88Q": {
    "date": "11/5/2015",
    "text": "This is another typical London pub.  The atmosphere is good.  The food is good.  The beer is good.  My wife had fish and chips and I had bangers and mash.  It was some of the best pub food we had during our visit.  Be sure to check out the pub's history before you go here.  It adds more charm to the place.  Legend says that it was re-built after the fire of 1666 and that a pub has stood in this spot since 1538.  Some of the regulars in the past have been Mark Twain, Charles Dickens, Sir Arthur Conan Doyle, and others.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvtPpo0clUKWLlNy5MxUbA"
  },
  "qwoTAkU4Q55cejWW6a94kw": {
    "date": "6/3/2011",
    "text": "In search of a great London pub, my wife led me to Ye Olde Cheshire Chese on Fleet Street.  Finding it was somewhat of a challenge, but well worth it once you step foot.  Nestled in the Wine Office Court, the setting is the home to some of history's greats.  This Cheese was rebuilt in 1667 (after the Great London Fire).  Once you step inside, you see the counter right away and you have your choice of libation.  I chose the Samuel Smith Old Brewery Bitter and it was awesome!  There are multiple floors, and pub food is also available.  But be careful and \"mind your head\" because you'll likely knock your head in the doorways.  On your trek downstairs, check out the wine cellars and relax with some true CAMRA (Campaign for Real Ale) good beer.If you've had a truly good time, I'd remind you to \"mind your head\" on your way out!  Check out the CAMRA sign, and the list of English sovereigns that have reigned since the Cheese has been open.  To sum up this experience, I'd somehow wish I never made it here.  Being back home, it's truly depressing to be so far away and searching for an equivalent.  One thing is for sure, I'll be back...",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0Xjezp55LeuGChvmMcu-6g",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Outside Sign",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0Xjezp55LeuGChvmMcu-6g/o.jpg"
      },
      {
        "img_id": "CxmwaYirrChVyhvG3m6BPQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Wine Office Court",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CxmwaYirrChVyhvG3m6BPQ/o.jpg"
      },
      {
        "img_id": "pQYmMcpJpw8xzigNZ9vBWg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Ye Olde Cheshire Cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pQYmMcpJpw8xzigNZ9vBWg/o.jpg"
      }
    ],
    "user_id": "Sgy7yQPxb00-6OaLuARelg"
  },
  "uy1_5l8NqrhOAQI_Cvy_4w": {
    "date": "5/4/2014",
    "text": "Went here whilst visiting London due to the historic cool factor. Hard to find walking with gps but we made it.  Husband had the chicken mushroom pie, which is now his nickname because it's just fun to say. It was yummy. I had a burger...it was ok but you can't beat the weird factor with good beer. If you are looking for a culinary adventure go elsewhere, but if you are just a tired American seeking a cool place to have a pint and say you have been here, do it!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAj-r2FzO-xMxA8rt_HMFw"
  },
  "aOfSuAxb3g4mIoPb9QbUSA": {
    "date": "4/4/2013",
    "text": "5 stars from a tourist's point of view - this pub is as good as it gets and exactly what we were expecting coming to London.  And who can't love that name?!  It was REBUILT in 1667 (not est), due to that foolish baker on pudding lane. The first floor has a bar right when you walk in with sawdust on the floor and a wood fire burning.  There is a dining room to the left that was closed when we were there, so we headed downstairs to the pub area.  The ceilings were really low and there were cool nooks in the wall for seating.  We both got a cider and drooled over other's food.  There's large communal tables by the bar with plenty of room to spread out your tourist maps!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rw8VcGgVxJavNc1LePlDgQ"
  },
  "rLeBKBOX4LJJjKAD6645YQ": {
    "date": "1/17/2011",
    "text": "Like all Sammy Smith pubs the beers are cheap and the food is decent enough, but it's the historic feel of this pub that draws tourists and locals alike.From the alleyway entrance to the wooden tables in the second basement, the venue embodies the feel of an old London pub.  Whether this is your first or hundreth visit, the first thing to do is head down the small staircase to the basement areas.  Don't expect to find a table after 5pm Thurs - Sat, but you will never be alone if you slip down for a cheeky pint at lunch.I have impressed many visitors when I bring them to this pub for the character and history of this pub, though I have been assured by pub guru Hitesh P. that Ye Olde Mitre is actually older than this pub.Always worth a look and will undoubtabley be back for a pint.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "oW5UYJCJMeegNF2Tnxz-Wg"
  },
  "ojKCos6N0FPDIft89KzWBg": {
    "date": "6/29/2015",
    "text": "This was our favorite pub in London.  The Samuel Smith beers we tried were all excellent, the prices were great (about 6 pounds for two pints, which was very surprising), and the history of the place and it's guests is amazing.  We really liked the cellar rooms.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOu5t9HG51UDqm4ahVatqA"
  },
  "zdfD6z8jWNfBp5QDuifZ-A": {
    "date": "1/17/2011",
    "text": "Walking into Ye Olde Cheshire Cheese you instantly get the notion of how much smaller the patrons of this pub were back in 1667 when it was rebuilt. Being 6'3 I find myself doing gymnastics just trying to get through the low hanging walls and small crevice-like doorways.This being said - my colleague Mark S. gave me a shout one afternoon after work and told me to come meet him at this 17th Century locale. It was a cool spot with mucho historical ambiance fuming from its walls. I became quite enamored when I discovered that it was a Samuel Smiths pub - - which immediatly drew praise and made the cheap pints flow much quicker. Cool place to hang out and enjoy a pint in the heart of St. Paul's. If you are into London historical locales - you have found the pub for you. If you are into having a cheeky pint with friends - you have for the pub for you. Go here and enjoy yourself, just please watch your head & step when moving about.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "UdFpFux1mTIV-GXkspHE-g"
  },
  "1mudMHxwHnp3Xa-2LQnRPA": {
    "date": "8/8/2009",
    "text": "What can I say about this place that has not already been said? As a tourist in London you have to pay it a visit for a real authentic piece of London (well post great fire at least). Well for me it's a great pub with lots of nocks and crannies, serving great beer and hot fresh food. The staff are friendly and the prices are very reasonable (especially as it's located in the centre of the City) If you go during the week for lunch ensure you arrive early to beat the queues!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jMBuIgI8UkUdrDJ_Jmz6PQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jMBuIgI8UkUdrDJ_Jmz6PQ/o.jpg"
      }
    ],
    "user_id": "tQ2hhIr2q94RBOFKYu_nUg"
  },
  "XmSK94JuCLf4rScL3luSgg": {
    "date": "1/8/2011",
    "text": "One of the coolest pub discoveris ever!It really old which makes it really coolGreat bar and really good food.Great ambiance.Nuff said",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "V3JRlSzcqx8B-eI_hyPqeQ"
  },
  "HZPICHS9ZiT-j-1KYxwVzw": {
    "date": "7/2/2012",
    "text": "I had a great time here. I was visiting London with my boyfriend and he loves taverns like this. The seating was underground in these catacombs and the age of the place was apparent. Next time I return to London I'll be sure to bring some friends with me and drag them here.The food was good, not amazing but decent. The cider was fantastic and that was really the point of my visit. I was kind of disappointed they closed at 11. I would have liked to have stayed there all night if they'd have let me.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lNi_-4lT1r_1aEE_Y0OT8w"
  },
  "8LvbVMoInVmez8VKr-0ZOA": {
    "date": "12/11/2008",
    "text": "The Ye Olde Cheshire Cheese is a Sam Smiths pub on Fleet Street. It's slightly contrived name is justified by the history and decor of the place. There has been a pub on the location since 1538, being rebuilt after the Great Fire of London. Additionally it is mentioned in Charles Dickens' 'A Tale of Two Cities'. The decor is as one would expect from somewhere with this heritage. There is lots of wood paneling, pokey little rooms, and a slightly dangerous stair case. My favourite place to sit is the lower most room which has its own bar and looks like a cellar. As a Sam Smith's bar the drinks selection is very good value if a little limited. The clientele is a mix of businessmen, tourists and students. The staff are personable and efficient.A good pub with lots of character and a wonderful sense of history. If you're a tourist visiting London I'd particularly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VuJ27_Z8OkOd-8Obc1tMsg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VuJ27_Z8OkOd-8Obc1tMsg/o.jpg"
      }
    ],
    "user_id": "lHjrUujYLS-cOu--fnXCJQ"
  },
  "ID0G2hjBvwN9_JHTzWGdEA": {
    "date": "1/23/2011",
    "text": "Oh London London. How I miss your pubs! My London college life mainly consisted of studying and drinking, so pub drinking inevitably formed a very VERY important part of my weekly (almost daily) agenda. Cheshire Cheese is absolutely charming and is conveniently located only a 5 minutes from my college library, so it was a regular meet up spot after lectures/classes. The atmosphere is adorable, and the vibe encapsulates London pub culture. Walking inside is like entering a wooden maze of low doorways and winding stairwells (definitely not a spot for the claustrophobic)....and nights are usually filled with local banker/lawyer types. The drinks are pretty standard (usually I just go for beer or cider) and according to my friends, the food is decent enough. Wanna re-live your Dickens/Sherlock Holmes fantasy? Come visit! And thank you Cheese, for all the memories and for providing me the warmth and solace of booze when I'm depressed from either the London gloominess or the fact that I have a 20 page essay due the next day.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TRwpliky3V41hhIOWYkVaw"
  },
  "2RJJwCKJEUZnC4xBu68TSQ": {
    "date": "9/2/2014",
    "text": "A totally English experience!! I am so glad our friends had recommended us to visit! It was so hard to find as well! I am always always going to be a fan of good old fish and chips! English grub, English beer...English 100% Nothing better out of life i'd say! I think I nicked about 4 saches of mayonaise and ketchup..you never know when it could come in handy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VxB90-kOgEf-cIVXc76kKA"
  },
  "TAz0HnHCLtoA4VuRizKPjg": {
    "date": "10/3/2009",
    "text": "This place is iconic.  It was a must see stop on my first visit to London.  It really plays with your head to think that people like Ben Franklin may have stopped here for a bite on his visit to the UK.  History alone is enough reason to stop here.  But, on to the food!The beer never failed to please in London, and Ye Olde Cheshire Cheese was no exception.  The entrance is down an ally off Fleet Street.  As soon as I entered, the bar was on the right.  I put myself on the waiting list and had one of many great beers in the UK.The wait wasn't long.  I was seated at a booth across the hall.  Before long, I was joined by an Australian couple (nice folks, we did the touristy talk thing until our food arrived).  The food really isn't the big reason to come here judging by my roast beef, potatoes, and Yorkshire pudding.  No great complaints.  It was fine really, but nothing special.  Unfortunately, there was no Yelp back when I was here (2007) or I might have tried some of the other suggestions I see posted here.  Still, I'm glad I came and I'm likely to come again.  The food is fine, the beer is great, and the atmosphere doesn't get any better!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m6MTy0YsmS-CZ0jhtS7IrQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Dining area to the left as you walk in the entrance.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m6MTy0YsmS-CZ0jhtS7IrQ/o.jpg"
      },
      {
        "img_id": "fbnl-NHgISskPzxAsz4s5A",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Roast beef, potatoes, and Yorkshire pudding.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fbnl-NHgISskPzxAsz4s5A/o.jpg"
      },
      {
        "img_id": "f0Ei_p5tWyI-Bk2XW8TxWQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Roast beef, potatoes, and Yorkshire pudding.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f0Ei_p5tWyI-Bk2XW8TxWQ/o.jpg"
      }
    ],
    "user_id": "R9UEj7MhxC4Hz2RimgCX3g"
  },
  "nGKW6Lurq37ft-1nakA7sA": {
    "date": "8/7/2015",
    "text": "Great location.  Would recommend at least having a drink here just to experience this place. Food was good - not great.  We enjoyed the sticky toffee pudding.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzK_RPD0pS94v8jlrMXwbg"
  },
  "-TOQXrrDNB_QQNj9ODax1w": {
    "date": "8/18/2010",
    "text": "As a Cheshire lad myself then I award 1* for the name alone and I award myself 1* for being able to find it.....If Pubs were Racehorse then the Cheese would be 'Red Rum'. Mature, full of character and never lets you down.It provides full on good grub (Steak & Kidney pie is delish) and a pint (or three) of Sam Smiths will see you right. I had not been here for yonks and was not surprised to see that nothing, abso-bloody-lutely nothing had changed. Awwe Bless. It's like a home from home and you get the usual eclectic mix of locals and tourists wandering in. We always used to use the Cheese as our 'meet up' spot. Rule was ... 6PM in the Cellar bar on any given Thursday or Friday night whenever you happened to be in town and it is setup such that, even when the place is packed, you feel like you have your own 'ickle' private niche. We have had some brilliant pissupz in here, you just can't knock it for that 'Feels like a proper Pub' effect. I also think this particular boozer was formative in my fascination with ceilings. Take a look up whilst you're there ... see the charring on the Oak beams? Could that have been from the Great Fire of London 1666 ?.. take a look outside and see the sign that says \"rebuilt in 1667\" Nuff said. This place puts the 'Story' in historyAs a side note .. many moons ago I worked at the John Smiths brewery in Tadcaster and the story behind the two brothers, Sam & John is fascinating stuff. Go WIKI it and, if you get the chance ...go to Tadcaster and do the brewery trip. Trust me.",
    "rating": 4.0,
    "rated": {
      "useful": 13,
      "funny": 11,
      "cool": 11
    },
    "photos": [],
    "user_id": "pD9zgz1Z71Ru89v98lKdWw"
  },
  "cAhkyG1MWOnqdFuyZj9j8Q": {
    "date": "9/26/2010",
    "text": "One of the oldest pubs in London is a quirky, nooky little Sam Smiths joint selling cheap but strong lager and other own brand treats.More rooms than you can shake a stick at and as most of it is underground you're best off meeting friends in the usual spot, or outside the front door if you want to make sure you find them. It's old. Very old.. an ideal place to take Americans in London.The food isn't up to much. Cheap and fried for the main. You're better off without it to be honest, there are plenty of places nearby to fill up on first.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "J5ddoqFi3XyW6WFuP7-_3g": {
    "date": "3/23/2013",
    "text": "Pubs don't get any better than this one founded in ~1664.  Dickens drank here!  #enoughsaid!!!  The food we saw come out looked great as well, but can't speak to it otherwise.  Still not a place to be missed if pubs are your thing!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "msRUiBE7Sa5A9145ZdFBow"
  },
  "IlIv8Q38WzoUXoPDcv0__w": {
    "date": "5/16/2012",
    "text": "Ye Olde Cheshire Cheese (what kind of name is this) was on our checklist of pubs to check out before leaving our four month stay in England, and we finally hit it up this week!It's cool to grab a pint in a place that predates the country you're from, I can only say I've done that a couple of times. This place is clearly covered in history and that is definitely part of its appeal. Its charm lies in a very worn, classic environment. The stairs are chewed away and the whole place is a little raggedy, but in the cool way. This is a great tourist location if you're trying to experience a classic London pub while you're here. Honestly, there are ironically very few like this still remaining in London. Everything is owned my Taylor Walker, Wetherspoons, or Sam Smiths it seems. This, however, is a thoroughbred original London pub and should be visited just for the novelty of its originality!!It's enormous once you get inside and there are many places to sit on its multiple levels. There are multiple bars too, so that's a great way to control traffic.Definitely visit Ye Olde Cheshire Cheese while rolling through, it is not an old cheese factory as you mistakenly may have thought. Also a quick tip, don't pronounce it \"YEE Olde...,\" pronounce it \"THE Olde....,\" something I picked up while in England.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "lgPCm2v8ZGOQpLKlTTQKOw"
  },
  "xb8K01y2BYm1y3vEKRYKYg": {
    "date": "1/24/2016",
    "text": "Oh you just have to go here. PG Wodehouse has been here, Charles Dickens has been here, TA so cozy and warm, it's such a PUB. Just go. But definitely prearrange with your friends to meet outside, because once you go in it's a maze with ting spiral staircases and you may never find them. So cool. Order dessert!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rIvBn_8Bj4BpAWu1PHr6xg"
  },
  "aqZ3x6Jy4y5MIVIs8pJ_LQ": {
    "date": "1/8/2013",
    "text": "Well its a pretty unique pub loads if history but the beer is expensive . The pub is sam smiths of tadcastar . In Durham at the Swan another of their pubs i pay less than two pounds for the same beer . Oh hell got to upgrade to a 5 star have managed to get a seat in the old bar . Just imagine this bit dates back to the great fire , Johnson and Dickens used this as their local :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e-jVwvMAiHTUYIRSmJKFAA"
  },
  "p4PPnrI_4EhlgZYyRJa4Hg": {
    "date": "3/9/2014",
    "text": "This is supposed to be one the oldest pubs in London, having been rebuilt just after the Great Fire of London in 1666. There has been a pub on this site since 1538, although the vaulted cellars may have belonged to a 13th-century Carmelite monastery. I would estimate that the shepherd's pie I had here certainly dated back a few centuries.... It's a wonderful place to go and have a drink - loads of small dark wooden panelled rooms on several different floors that seem to change location every time you turn around. I'd suggest dropping breadcrumbs when venturing to the loo, but the sawdust everywhere would mask them. My gripes are this: I was too cold in here (it was winter and we were in a room that did not have an open fire, as we wanted something more substantial to eat.) I was uncomfortable (they may look amazing, but 14th century wooden pews were not designed for bottom-luxury). The food was not brilliant (think school dinners). I would strongly suggest that if you have not been here before, then go and hang out where Dickens once drank, but don't eat here, and don't expect too much other than history, a sore bottom and a chilly draft.",
    "rating": 2.0,
    "rated": {
      "useful": 15,
      "funny": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "Kwz6LPHSIlHxN1SaNjiEIw"
  },
  "Pr-wu12UFGa-aKQ03MrnTA": {
    "date": "11/20/2014",
    "text": "As a rule I generally both loathe and avoid establishments of any sort that contain the words \"Ye\" and \"Olde\" in their title.  Perhaps it's because I'm an American and have been to more than my share of \"Shoppes\" and \"Parlours\" for \"Old Fashioned\" \"Cookin'\" and trinkets and sundaes.  In America, words like \"Ye\" and \"Olde\" in a title generally foretell truly terrible experiences with mediocre food, the worst sorts of touristy junk and LOTS of fakey old-time charm.  Really, it's enough to make the gorge rise.And so, I find myself deeply confused by Ye Olde Cheshire Cheese.It's a pub.  It has pints of good ale and cider and bitters.  And because I'm American and know well enough than to claim to know anything about pints of ale, cider and bitters, I'll say that they seemed tasty enough, better than you get most anywhere in the States, but otherwise not particularly special.And the food was likewise perfectly fine.  The roast beef was tasty.  The yorkshire pudding was...yorkshire-y...and tasty.  I suspect that the gravy was right out of a jar, but that seems to be par for the course in London pubs, and after all the diner meals I've eaten back home, I can't quibble too much about gravy from a jar.So yes, the food was perfectly fine for a diner.  Or maybe for a pub.  Not special.  Just fine.  A solid three stars.But then there's the \"Ye Olde\" part of the Cheese.  It's impossible to mind the use of Elizabethan vernacular in the title when the dining room you're sitting in has clearly been in use since the time when people actually spoke like that.  This is the real deal.  It's old old OLD(E) in here, and you have no doubt whatsoever that you're actually sitting in the place where Charles Dickens or Samuel Pope used to sit and eat their roast beef and pick their teeth and talk.  And that, for the tourist looking for some of Ye Olde Londontown with their dinner, is pretty darn cool.So would I recommend that visitors to London seek out the Cheese?  (And really, you have to seek it out - it took us fifteen minutes just to find the entrance!)  Absolutely!  You're not going to have the best food of your trip, but you're certainly going to have a memorable meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bq5WrIy-AHk-Bc6wOPBDVQ"
  },
  "wXdZOnoyr7qSZfOHt1krZA": {
    "date": "2/3/2015",
    "text": "Love this place. Great food and beer, especially for the price. It is open seating and it can often be hard to get a table. Additionally, most of the rooms are pretty small so getting a table in a good location (depending on what you're looking for) can be even harder. But when it does work out and you get a good seat, it's my favorite pub I've been to in London (albeit a relatively small sample size).Definitely recommend the stake and ale pie and the Ciders are quite good as well. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mBKuHptuYsgl5TBqEgx6eA"
  },
  "7Fxk3ICohK0lfDtIgJQ3zg": {
    "date": "1/22/2014",
    "text": "I really liked the ambience of this pub. It's has strange floor plan and staircases made for people from the past (ie...when people were shorter) but it certainly adds a charm to this place.Apart from W9 beer which was ... well a good beer I had fish & chips and they were nice, crispy and ... traditional.They don't play music I noticed - which makes it a great place to meet up with someone you'd actually want to talk. It attracts mainly City folk but also some random crowd (City folk on a dress down day?) too.In fact - the play is longing for old knights shouting for a serving wench and downing ale by the cask.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "6hVGwtNetpgdMSgOgv8PWQ"
  },
  "bW3VInXXtMuYNVjSzBLeTA": {
    "date": "3/14/2016",
    "text": "Would be 5 stars just because of the atmosphere, but food took forever. You have to be ready to wait for your food in most pubs, especially \"authentic\" ones. The atmosphere in this pub is so cool and you can feel the history!  Grab a steak pie and a cask beer. Bartenders were very friendly in the cellar!  Cheers!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6a0ejp8XKI2QMVBZL-uBkA"
  },
  "37hB4vKXYne6xnod8CHdvw": {
    "date": "9/19/2012",
    "text": "Great stop on a tour through London. Number one tip: Don't eat at the restaurant on the first floor, go downstairs to the bar! They have the same food except it's cheaper. And the downstairs isn't a grimy dirty bar that you might expect. It had a great casual atmosphere and we had a great time without even buying alcohol!Fish and chips were pretty good. The pheasant was so so. Lemonades and dessert from the bar downstairs hit the spot. The building is pretty cool to check out. The first floor is pretty formal, but then super narrow spiral staircase brings you down to several table areas on different levels before you end up at the main open area. It's a little overpriced, but go for the experience (and then spend the rest of your trip eating somewhere else).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mgLFD1V-a5xB_itYYfn-lQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fish and Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mgLFD1V-a5xB_itYYfn-lQ/o.jpg"
      },
      {
        "img_id": "j4heC9dEy4k7Jlzlt4Uxrw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Pheasant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j4heC9dEy4k7Jlzlt4Uxrw/o.jpg"
      }
    ],
    "user_id": "JkCHnRU6KTuy-2PYIsdLsQ"
  },
  "C_aYPTj_V2iUxirJ3fonSQ": {
    "date": "2/2/2012",
    "text": "This pub was introduced to me almost a decade ago when I was told people had been going there for centuries. The place feels historic going in! You can just imagine Charles Dickens writing away at one of the tables (which, apparently he did)The food here is quite excellent, particularly by London standards. (No offense London) I really like their grilled sandwiches which go nicely with a cup of draft cider or beer, of which there's abundant variety. The many floors and many rooms give this bar a private and also spacious feel (seems contradictory I know, but go and you'll see what I mean). I went with a group of friends and they let us play quarters in the basement quarters in the basement til closing!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TU8NsFvjzLqkI87QQqkJPw"
  },
  "m3hwmUBhVsqs6tHD_A5Ysw": {
    "date": "5/14/2014",
    "text": "We originally planned to have dinner but the set up is confusing and it was really crowded so we ended up just having a drink in the lower level. The building itself is really cool with lots of different levels and alcoves. A hostess might help make things a little smoother, although perhaps that is part of the ambience.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ouIfeajiYdt7qMj1tr7e1A"
  },
  "NPy2Ec6rGQEMu3HZnoMTAg": {
    "date": "10/1/2012",
    "text": "The storefront is quite traditional, and the pub offers a historical ambiance augmented by the dimly lit setting and darkened wood. The staff is helpful and exceptionally friendly.I ordered the Steak and Kidney Pie which came with vegetables and chips. The dish to be centered around the gravy which was acceptable. All in all, the dish was a bit top simple for my liking and lacked layers of taste; however, the meal was unquestionably salvaged by the stout that I ordered to accompany the dish.I settled on a pint of Samuel Smith Extra Stout. The coloration of the beer was incredible. I was not able to resist temptation and ended up trying some of the head which was extremely reminiscent of cocoa. I allowed the rest of the head to settle and tried some of the beer; it was one of the finest stouts that I've ever had.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "506QAkhXU8PP4h7Dc9-nBA": {
    "date": "1/9/2014",
    "text": "Nice place to stop off for a nightcap and obviously very historical. Not my favorite pub in London, but it's worth a trip just to have a drink in one of the oldest pubs in the city.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jGUdsAMkurKYZCh6l84n7w"
  },
  "roXUv22j8AqyW1reX0WjOA": {
    "date": "10/29/2015",
    "text": "A little secret through the hidden alleyways off Fleet St. This place feels like stepping back 400 years ago. The bartender was amazing, the prices are decent (£8-10 for a main) and the food portions are generous. Come here if you're after an authentic pub experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Dr5EEBTgZzm_vleLi9m4A"
  },
  "VT7JUdmRbLPbXB0JaqdoRg": {
    "date": "11/20/2013",
    "text": "For the historical value, it's definitely a good stop along Fleet Street. But it's not a place I can see myself going to regularly. The rooms in the basement are all split levels and cavernous which is cool for the first pint. It gets pretty stuffy after the the second and third pint. The ventilation down there is not awesome. And my date was going downhill so the fact that there is no phone service meant I couldn't even nicely claim a friend needed to talk so I had to duck out early. I can't really blame the pub for that, but it did color my experience. The food was average, the drinks weren't badly priced, but any place that serves sticky toffee pudding (my favorite dessert ever) gets a happy face from me.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "In46Vl71LOiXa0Pwj0UHAA"
  },
  "pggppvMyBzyrdSOODpT9kQ": {
    "date": "8/21/2014",
    "text": "Super fun old English pub where I've heard Dickens used to drink and write. looks like a great spot for groups to catch up over some pints, but was enjoyable for a tourist visit as well. The coolest thing about it is how old it feels. it's tucked away in a small alley with half of the bar in the cellar. there are so many small rooms, it feels like a maze trying to navigate it! The fish and chips! fantastic. get that. We also had the vegetable shepherds pie, which was okay, but felt mostly like a few carrots and peas underneath a massive amount of mashed potatoes. Go for the fish and chips and the ambiance. Super cool.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TEfjeVtKLrOrfJDa1OWow"
  },
  "w83G39BR68GI9YoCIlL_9w": {
    "date": "8/13/2013",
    "text": "So, we had just arrived in London, it was stinking hot and after noon, we were jet lagged and starving, and our absolute first order of business after checking in to our hotel was to find a pub. Enter the Cheshire Cheese, just down the road, and a must do on my touristy list. Perfect.I love an old pub, and Cheshire Cheese is definitely that. Maybe the oldest in London, maybe not, but this place oozes history. And tourism, but as a tourist myself, I'll overlook that and just soak up the history. My sun-dazzled eyes couldn't take in most of the upper floor, as it was much darker inside than out, but in short order we were directed down the stairs and into the cellar area. As others have mentioned, watch the stairs and the ceiling. It's a miracle that my klutzy self didn't get a concussion or fall down the stairs! Ah, atmosphere. (Honestly, I did love it.)The cellar area is the very oldest part of the pub, so it was officially my favorite. Plus, it was nice and cool down there! We ordered a glass of wine, a beer, the Fisherman's pie (me) and the Cottage pie (my husband). The tables in that area are pretty much communal, so be prepared to share. The food came out relatively quickly, and while I'm somewhat suspicious that the mashed potatoes came out of a box, we were starving and the food filled the hole nicely. It wasn't gourmet by any stretch, but it was pretty solid pub food, and a good portion for the price, which is exactly what I expected.I probably wouldn't head back to the Cheshire Cheese for food, but would certainly come back for a drink and some more historical atmosphere if/when I'm in the area again.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "JFIr4bbO2zjQYdA3LwbbsQ"
  },
  "-lWsPC6qJptUQR6mqgX8OQ": {
    "date": "8/23/2014",
    "text": "If you are coming for dinner, be sure to stand in the dining room to get acknowledged by the server first, then go grab a pint.  You will get seated faster this way.  If you approach from the East, it's worth the adventure to take the first alley just to see the sign to tell you to turn around.Fish and chips were delicious. Beer was delicious.  Server was del... well... he was exactly what you should expect.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "og3PpFM9AJ6f73GP6D81Tw"
  },
  "KEzqkvM4JSJydE_MniIqXA": {
    "date": "7/20/2015",
    "text": "Classic old London pub with wonky floors and nooks and crannies everywhere. It's a Sam Smith's, so the drinks on offer are of a good consistent quality - I usually have the beer but recently tried a gin and tonic there and was suprised at the excellent value and taste.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ieSrncoNtOb9AdwkSwoaGA"
  },
  "wGkpGUJDCXHzoyr15HiCUw": {
    "date": "10/23/2016",
    "text": "I went to the Cheshire cheese, crossing London in the process, especially to dine here. The hours posted were incorrect. I was told wait another half hour-which I did. At the expiration of the half hour they were \"open\" but only for bar drinks and told me the kitchen would not be open for still another 30 minutes. Once burned, shame on them; twice shame on me; I got tired of waiting,left and went to a more customer friendly pub that was open. Disappointing... they should post hours correctly and state whether or not, when they open, it is for bar drinks only.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sfcoISrUTPLo6sLAj4ZswQ"
  },
  "wuoO65wCLb9EH0UlbGnqHQ": {
    "date": "4/6/2013",
    "text": "This is one of the oldest pubs in London, as indicated not only by the Charles Dickens memorabilia everywhere, but also the low ceilings and tiny steps!  It is a really cool pub to drink at in the middle of London, as most other pubs look relatively similar (ahem wetherspoons) and are new and refurbished.  Cheshire Cheese has managed to maintain is old charms!  Just walking around, you will find rooms and little nooks and crannies that are hidden around the corner that have slipped your eyes earlier.  There are also wonderful dining areas upstairs, and the prices for the food are relatively decent!  I've been here three times and I still find new rooms and areas that I haven't seen before!  I ate dinner with my boyfriend here, and felt as if we were transported back in time!  There is a cozy fireplace and dim lighting, and large wooden seats, you can feel the history on those ceiling beams :)  The services was wonderful and everyone was exceptionally friendly!  There is another bar area downstairs where you can order cheaper, quicker pub food!  But be careful when walking down the stairs, I've hit my head every single time.  I literally have to almost touch my toes to avoid getting hit in the head. Cheshire Cheese is a great place to take visitors, and also for a relaxing night out with friends, as well as an intimate dinner with your loved one.  it is quite a unique experience, and definitely one of my favorite places in London!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TCGvCI64CDJeRWb3PRicbA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TCGvCI64CDJeRWb3PRicbA/o.jpg"
      }
    ],
    "user_id": "UE66GxGVc0xjmT6Uprr_fw"
  },
  "x-KoGidbAma4FqXQdQbecw": {
    "date": "4/15/2015",
    "text": "So this is supposedly the pub that Charles dickens drank at and is one of the more older pubs in London. Add on the fact that it was only a 7 minute walk from the hotel equals myself trying the place. The entrance is sort of hidden off to the side, kind of giving it a mystery element. As you enter and walk downstairs, because the ceiling becomes super low, almost guaranteeing that you will bump your head. There is about 3 levels to this place and I'll say about 10 beers (including one organic one which was good by the way) on tap. For food I tried their wings with sweet chili sauce (only 4 pieces but was good) and the cottage pie (can't remember the difference, but is similar to Shepards pie and was actually good). Overall a good pub to come to while in London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9Zu4BPDntg_52YmNwViyOA"
  },
  "bHTQOfuL0lEY1NsrLwYqtw": {
    "date": "9/8/2013",
    "text": "Went here on my most recent trip to London based on what I had read in guidebooks and online. It is truly a nice historic spot with good, reasonable pub grub and pints to boot. It's set back from the main street and once inside, it's a maze of rooms and staircases, which gives it real charm. I had a burger and it was accompanied with a salad and chips and all were quite good - fresh and filling. And I had an organic wheat beer (can't recall the name) that helped to wash it down. The staff I encountered were friendly and it's a place you could easily just go grab a drink if you aren't in the mood for food or just pop in and visit the various alcoves below ground.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZXQHgoLj3PZ__YMNg7A3mQ",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZXQHgoLj3PZ__YMNg7A3mQ/o.jpg"
      },
      {
        "img_id": "CGAg3idbIJRi9gn42V7wJw",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CGAg3idbIJRi9gn42V7wJw/o.jpg"
      },
      {
        "img_id": "tKWM3uYo5e8artirCBHtRg",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tKWM3uYo5e8artirCBHtRg/o.jpg"
      }
    ],
    "user_id": "6d74xseomEdQZ7u5CIkh9A"
  },
  "o3ySaEPaUE6Nw9RhPTtL6Q": {
    "date": "6/27/2015",
    "text": "I have to say that this is my most favorite of the \"olde city\" pubs that are clustered around the central part of London. There's been a pub in this location continuously since 1538 - although it had to be rebuilt after the Great Fire of 1666. Don't miss out on this illustrious gem when you're wandering around the inner confines of the walled City. Frequented by Mark Twain and Tennyson amongst many other literary greats, referred to by Charles Dickens, Wodehouse and many others, the history here is quietly astounding. The ceilings are low, the air smells musty, the light is scarce. Nowadays on weekday afternoons you'll find somewhat smart-looking men with untucked shirts and guilty smiles knocking back a few beverages - trying to hide from the hamster wheel of corporate London. The fireplaces, mouldings and original fixtures are simply spectacular. Why only 4 stars? Samuel Smith Brewery owns the damn thing!!! No!!!! Most of the beers here are from the brewery and my insides just sag when I think of a lovely place like this being taken over by a large company. But such is life and change. What remains still charms.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEMWzZ8qWY1T_K0HUoKDIA"
  },
  "aYL-nLL5c-tpZmzAfP4IoA": {
    "date": "8/29/2016",
    "text": "Amazing!! You have to go here! So much history and so many rooms and floors. It's really fun!! A must do! And great fish and chips and beer too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "heyu0iOLlFyDelrefSrd0Q"
  },
  "cgk9e5wiNtNoxEnPIiAbJw": {
    "date": "7/6/2016",
    "text": "One of my absolutely favorite bars in London -- steeped in history and lore.  You can just walk around and smell the 450 years of pub history in the the stone structure and wooden bar. A big plus is that the place does not pander to tourists -- it is still genuine and passionate bartenders and local clients.  Good selection of beers heavily reliant on Samuel Smith.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4eVxqcWuh4xjAz8kUguVg"
  },
  "I6CfDn38ai4JhxH2L4Rl1Q": {
    "date": "12/9/2014",
    "text": "The historical significance of Ye Olde Cheshire Cheese is worth a stop in by itself. A pub has sat at this spot since the 16th century, and the current edition was built shortly after the fire of 1666. There are a number of older pubs in the same area, but ya know, this one is called \"Ye Olde\". It really is beautiful! And huge. Lots of floors and little rooms. When you first walk in there is just a tiny little room to the right which is PACKED. Keep walking, there are plenty of other seats to be found. We sat down in the lowest level, which was really quite beautiful. We had dinner and a few pints. They serve Sam Smith beers, so predictable offerings. The menu is confusing in that it just lists all their beers, and not the ones they currently have on tap. Clean bathrooms, and great ambiance. The food was lackluster, probably some of the worst I have had at a Pub in London, but I'd still go back for a few pints.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "AMlrT5EPdonx-Uan3X_w6g"
  },
  "6VRcAIFMlv-hlMs5OgQeIQ": {
    "date": "1/29/2013",
    "text": "I'd give it 5 stars but the staff seem annoyed by tourists.- They gruffly said the upstairs was closed, when all I did was ask if it was interesting.- They refused to serve our group  a final round, even though it was not quite 11 p.m. - by everyone's electronic devices.  The barkeeps said they had to go by \"the time that's on the till\"  and refused service and income.  Strange.As such, I'd suggest going there in the day or early evening.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIzN19RssPWSw9nDCPXU3A"
  },
  "Xsg26_Lsa64GCAwv0tbCew": {
    "date": "8/3/2015",
    "text": "A very cool pub (the spot has been a pub since something like 1644). It's got cool rooms you can choose from and it goes down 3 floors. Nice selection of cask ales and the food (calamari, nachos and ploughman) were all very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cFKuxKR4yYAeYJ_lNT9SuA",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Somewhere in the halls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cFKuxKR4yYAeYJ_lNT9SuA/o.jpg"
      }
    ],
    "user_id": "do6Uh-c4zll0tngJJdHxWQ"
  },
  "tyLrU9-MV54ZwgWUfauhKg": {
    "date": "3/29/2016",
    "text": "I love history, and this pub looks it's age which is great. But there are way too many tourists. Takes away from the charm, I think.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g79PDsJPNUyRNFo7-34aUg"
  },
  "i70AlkqdC63ff7OqFmG1ug": {
    "date": "5/13/2015",
    "text": "Neat place.  Tons of character. The fish not chips are the best I have had on this trip.  Good portion of everything.  The down note is that our waiter was probably one of the original staff from 1667 and is miserable. That is unfortunate.  Otherwise, this is great place!!  You should try it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y_X2Eko0VCoNR4KopqiI2Q",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y_X2Eko0VCoNR4KopqiI2Q/o.jpg"
      },
      {
        "img_id": "Y5A42pimIvrng0KyLG3p4w",
        "caption": "Photo of Ye Olde Cheshire Cheese - London, United Kingdom. Fish N Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y5A42pimIvrng0KyLG3p4w/o.jpg"
      }
    ],
    "user_id": "1TSYySwBvOWZKr8XuwY0pA"
  },
  "HEoCJHFJMs1RwgaDbMO4Uw": {
    "date": "4/24/2015",
    "text": "You can't quite get something more traditional and on trend than a pub like this in the middle of london. Ye Olde Cheshire Cheese is in an unassuming place, right bang in the middle of the city near blackfriars and on fleet street, hidden with an alleyway. It has a famous sign of its own, one if you walk past, you'll remember all the good times you've spent, or will spend in this very pub. Now I hit my head on the low beams and ceilings fairly regularly but even that hasn't tarnished my view of this place. I love it to bits.The cheese has such a great post work vibe but mostly its got these wonderful dozen or so different rooms, catacombs to explore. Best done with the finest ales and traditional food. Mostly I go because it has history and my my does it feel like it when sat on the wooden benches and being served by fine londoners.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVFY09SEnPa80ZMI8XhepA"
  },
  "8SWINOxHFV-oXF4gSjQaTg": {
    "date": "5/16/2015",
    "text": "Absolute best bar!!The fish and chips are amazing!! The staff is even better, very polite and social. Emma was awesome; chatted with us while the queue was slow; helped advise us of how how to get around.Will definitely drop back in on our next trip! As Texans, we were highly impressed with the food and service!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4uAIlgvUvMSHgqWUjXeiTw"
  },
  "A53p0zUqygDl-aQW2C_8dQ": {
    "date": "4/13/2015",
    "text": "For the atmosphere (i.e. sawdust floors, low ceiling beams, and original structure) and awesome history? This pub gets an A+ from me and is a must for anyone who is visiting London. You could easily whittle away an afternoon, drinking in one of the nooks and crannies found in this historical pub. The food is traditional British fare (which makes it all the better for tourists who want to try fish 'n chips) but it certainly isn't gourmet or gastropub quality. As it's a Sam Smiths pub, it's pretty cheap and a decent place to meet friends. Never gets too crowded, either.A must-visit for anyone who's never been.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8Hd5INwzaoa_YKhDDWxtQ"
  },
  "DXxqPB3Z0qJCpjEr-fEXIQ": {
    "date": "4/6/2015",
    "text": "I have been to the Cheshire cheese on many occasions. A go to pub when we have people visit from overseas, the pub is older than the US as a country which is so crazy but cool as I am American. The original pub was built in the early 1500s and was rebuilt after the Great Fire in the mid 1600s. Very quaint, all dark wood, upstairs and downstairs. Duck your head when you head downstairs, there are signs, but I cant tell you how many times I have smacked my head, you would think you would learn. The downstairs part of the pub is cellar like and there are booths built into the rock. If you are planning on meeting people and are sat downstairs be wary that the signal is really poor. The food is standard pub fare, fish and chips, pies, scampi. However, I have never found it disappointing always flavorful and hot. It is a Sam Smiths pub so there is not a huge choice, but I dont mind Sam Smiths beers so its never been an issue. Very cool pub, that has a very Dickens feel with solid food and cold drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7hEzBcM0nHfy__xrknnPWA"
  },
  "i1yMlUkrYA5k0QOOFdQfOg": {
    "date": "5/19/2016",
    "text": "Very atmospheric place with amazing history! Provides a pretty cool contrast of the modern streets around. The food it's great too, especially in the restaurant upstairs. My only moan, the seats are not very comfortable!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZGFGCSOYvTDp9XvV-E6hQ"
  },
  "zw4GuxRf_Fbz56xi3Nf06A": {
    "date": "5/11/2016",
    "text": "Very cool spot.  Lots of history here.  Quirky, maze like place, rounded corners - more like a cave than a pub as you go lower.  I can I imagine Sherlock Holmes strutting about the place.  Reasonably priced pints, friendly service, cool location.  Don't eat here.  The food is entirely average, even by London Pub standards. Didn't see a lot of locals here - mostly tourists.  Come explore.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "toi4Asob90r-LyGsxKvYdA"
  },
  "_LYusbcP3L97Zcefwc-ZNw": {
    "date": "7/25/2016",
    "text": "One of the most beautiful pubs I've been to. ,y style is very old and pre century so if you like that King George feel, this is it. Bar is built like a house with areas to visit on each floor . Best one of the base,met which dates back to the 13 th century. It was such a beautiful place and you'll meet some cool people!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYLYnZHsZ3zXodzqTpFo_g"
  },
  "-jcvX0UWzppLd7EX2VDpQA": {
    "date": "7/19/2016",
    "text": "Don't bring the family or go for food. Fish and chips were soggy and had bones. Chicken dish with pine nuts flavorless. Services was terrible.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBd_LK1vWaJcVIjxU3kPQQ"
  },
  "a01mjoq8VWvVLKupaJd4Qg": {
    "date": "6/23/2016",
    "text": "Very cool place to get a couple beers and enjoy a snack. We went all the way downstairs and it was very cool. Nice ambience and service. Many different drafts to choose from. A little expensive, but worth it for this institution of London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qarIg_jTCINqegD82pb1qQ"
  },
  "_-TBcQw8dq2GcskrWuYqbg": {
    "date": "9/17/2008",
    "text": "A great pub, especially for a few pints after work. Beer's heaven on earth (Samual Smith Brewery) for every beer lover and incredibly cheap compared to London standard. Try the Alpine Lager, the bottled organic lager or a nice and tasty wheatbeer. The crowd's often a mix of Goldmann Sachs and Deloitte employees, as well as (American) tourists (the Cheshire is said to be the oldest pub in London and Dr. (Samuel) Johnson's house is just around the corner).",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3rjNy7t7Vg9-SahH0oZWKQ": {
    "date": "2/11/2001",
    "text": "Charm in the CitySlightly over-run by City Boys giving their pinstripes an outing, nevertheless this pub has more charm than any other. The threshold of the pub is made of stone worn almost away over the years, the floors creak with every step, and the chill of the back bar runs spookily down ones spine. With cheap drinks and plenty of cosy seating this pub is definitely worth a try.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kadGc_rnNpUl3rMpdY5Qxw": {
    "date": "5/21/2007",
    "text": "Olde Worlde in a modern cityYes, it is crammed full of office workers in the evenings after work, but get there early to get a seat and soak in the wonderful atmosphere and explore the curious building. You can have a very pleasant drink whilst you do so.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5cIg1ZGHWCljphtvEjMp-w": {
    "date": "4/25/2009",
    "text": "Like everyone else, we wanted to go here, and it was Easter Sunday evening and not a thing in the area was open. Not knowing what we should be looking for, we noticed the pub on the right side as one enters was full, so we went in the back and had a pie and a pint. On the way out, we discovered the room on the right (which was Dr. Johnson's room, and had a nice fire and available seating). Bottom line: Ask somebody about the rooms in this place when you enter. It's worth the visit, not so much for the food, but for the history and the atmosphere.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foecusHfY3x9IuWZxin9Dg"
  },
  "umuDc4lxJq5NXvNqwQZoYw": {
    "date": "2/12/2010",
    "text": "Great atmosphere, the pub (from 1667) has countless little underground rooms with ales and lagers. The food is average.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VarKqyOtDWWGZlaJswGUQQ": {
    "date": "11/29/2008",
    "text": "Beer's good and so is the food. OK, it's attractive to (American) tourists but that doesn't detract from the ambience and you can normally find somewhere in the labyrinth of connecting rooms to hide away. Not a bad place to go for a pint after work.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "x_CPYZwqtrMUPfk_1G057Q": {
    "date": "11/16/2008",
    "text": "I love this place. It's a place to pop in and have a cosy drink and fireside chat in after work one night. A place to have a pint with your Dad and talk about nothing. And a place to bring visitors and impress them with lots of facts. I can't believe how good the prices are, too. An excellent City/Fleet St pub that should be better known. But I'd rather keep it to myself!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Me29I8y3qZfm_hmygVa2jA": {
    "date": "12/2/2008",
    "text": "My one star is for everything bar the building itself. I would probably give the building four stars. But I wasn't there for the building.My gripe is this:There is only one ale on offer - Samuel Smith's Bitter. The only lager for sale is Samuel Smith's Lager (lager from Yorkshire?). If you want cider..you guessed it, Samuel Smith's cider.There is no Fosters, Stella, Carlsberg, Carling, Guinness, London Pride, in fact none of the familiar named ales or lagers or ciders, no guest ales, no Lambs, Captain Morgan, Bacardi, Teachers, Gordon's, Southern Comfort, none of the familiarly named spirits at all. It's so weird. They don't even sell Coke, or Sprite or any of those soft drinks we are familiar with. Everything is a cheap inferior substitute of the drink which you might have asked for in any normally run pub.I asked the girl behind the bar why, and she said it was to keep the prices down. Personally, I would be prepared to pay the extra and have my usual choice. Running a pub in this way is corporate suicide, surely.This is one of the oldest pubs in the country and a beautiful pub it is too, although extremely drab, and yet there is no choice for the drinker when they get inside. It may as well be a museum - after all it does feel like one.I came out of the Cheshire Cheese and crossed the road to Ye Olde Cock, where I was met with a selection of six different real ales and all the familiar stuff you would expect from an 'olde worlde' pub. The atmosphere was an improvement on the Cheshire Cheese simply because they seemed to care about their drinkers and what they want. Somebody had thought about the decor too. It was bright and welcoming and it felt good to be in there, which is everything the Cheshire Cheese wasn't.In summary, not a good place to go unless you're a teetotal historian interested in architecture. If you're in the area for the beer, try somewhere else.A bad experience.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}