{
  "ykKIJ69FLdHmzPXf2KDnKw": {
    "date": "5/12/2013",
    "text": "Everyone boasted about this place so we decided to try it out and do not regret it at all. I had the cod and chips, which ended up being amazing. I enjoyed the ambiance and the service at the place as well. I think they need a larger beer selection, but other than that, the Seashell was a great place. The price was a little bit on the high end, but this ended up being the best fish and chips I've ever eaten. I will return to this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKfuxe08E7fVKTZ_WE7p0A"
  },
  "boEQbAv6vLbK-qtToS6FOw": {
    "date": "3/4/2013",
    "text": "My fish was soggy and the chips were cold and anything but fresh. Based on other reviews, maybe I caught them on a bad day. But I won't be going back again to find out.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fs9mjJglEK2EkfUpjGrQ6w"
  },
  "gi5_WyTLIsK3XHCU5cOcpg": {
    "date": "6/7/2013",
    "text": "A stalwart favourite of cabbies, chauffeurs & those that know. One of London's worst kept secrets and best fish & chip shops. Bit pricey, but still good value.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Z1AwdhE1OtJCZ0pvufRuRQ": {
    "date": "12/21/2012",
    "text": "One of the best fish and chips I've ever tried. So fresh, crispy and delicious, yummmm. And it is prepared in the good old fashion way. The atmosphere is cozy and the service is good, but the main strenght is the food.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ccQmWMKVTj3HB0NFbvofwQ": {
    "date": "6/27/2009",
    "text": "Went here on my NYE vacation 08-09.  Stopped in for the classic fish and chips.  It was HUGE.  The fish wasn't much better than some of the pubs I have had it in, but the size was definitely bigger.  Cost was more as well.  We ate in the restaurant since we were staying too far away to get take away.  If you're hotel is a few stops away, get it for take away, much cheaper.I must say again that I have had better at local pubs around London. Kind of hit and miss.  But this wasn't horrible and I would probably go back.Note the hours.  They close for a bit in-between lunch and dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2hi4w1XywPKn_zEe5gu2HA"
  },
  "5hVGq0ZIbz_BFbJFL_5LNA": {
    "date": "8/2/2014",
    "text": "55 minute wait for food! There is a \"take-away\" side of this restaurant that shares a kitchen with the restaurant. The take-away side is mostly stand-up eating only with a couple tables, less expensive, and mostly for fish and chips. The \"sit-down\" side looks nice inside. Our party of 4 was seated right away at 7:45 p.m. However, it took 55 minutes from the time we ordered to receive all of our food. The waitress explained that the take away side was very busy, so the kitchen was backed up. The food was delicious, but unfortunately, the service was so poor- we couldn't get anyone's attention to get our water refilled, ketchup brought to the table, or help with anything else. Because of the previous good reviews, we wanted to like this place, but it just left us feeling disappointed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7qa_Afknu7zIXl7q1jqrHA"
  },
  "RPJ8409Ja9oUjDHXmaSHJw": {
    "date": "1/25/2009",
    "text": "First off, don't go to the restaurant - that part is totally for tourists that are willing to pay the extra money for a sit-down experience.  Unfortunately we were tourist and didn't know any better, so we went to the restaurant.  I had the haddock which was quite good.  The portions are huge!  The size of the fish was larger than I expected and they give you tons of chips.  Overall the food was pretty good, but didn't blow me away.  Probably the most disappointing part of the meal was afterwards when we walked outside to find that the take-away section next door was less than half the price!  Granted you probably get a smaller portion, but we didn't even eat half of the chips, and didn't finish all the fish either.  I would've been perfectly happy with the take-away version.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "YivjyoOZAUS_1P0V63K4sA"
  },
  "TC4UIoa1YS6mnEMBDEISTw": {
    "date": "4/21/2014",
    "text": "The cod was fresh, crispy and cooked perfectly. Agreed with some other review that it is bland (no salt added), but i prefer it that way as i like to salt & vinegar it myself. Same with the mushy peas, need added salt. Ordered and sat at the take out section, which seemed to be about £5 cheaper.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBhAFb7VHOqH986OSALT6Q"
  },
  "wY6N6wk8FkqjbOH8rfnAgQ": {
    "date": "7/11/2011",
    "text": "As an American visiting, I was originally setting off for another fish and chips spot in the neighborhood when my taxi driver recommended Sea Shell.  I wasn't disappointed.I opted for the lemon sole and chips.  The fish came out freshly fried and crispy.  It was battered just perfectly and still maintained a juicy texture.  The chips were just as good.  Thick cut and crispy on the outside, but smooth in the middle.Overall, the best fish and chips I've had on any of my London trips.  Glad I listened to the cabbie!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZxzaGebGT3RfjnrRNtVFzg"
  },
  "2vKlsmF21xFmgJVYELPMMQ": {
    "date": "10/18/2009",
    "text": "If you work in the Baker Street area or not, are in need of sleep after lunch or looking for a hearty dinner, please do yourself the favour of dining at Sea Shell of Lisson Grove.The fish is wonderfully fresh, the chips are just right and I do adore their mushy peas.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDofmxUbwB2ap0rfVxS4dg"
  },
  "aXxhejN_OoBbFET5Vv8jJg": {
    "date": "6/28/2011",
    "text": "Spenny and not fantastic.  Pleasant enough to sit outside and eat but it wasn't crackling hot or terribly fresh.  Plus it was 30 quid for 2 orders and a soda -- seems a bit expensive to me.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z---hyQ54NtDl39wU7A9zw"
  },
  "-eGHlZX14oUMfX7n3yZtRQ": {
    "date": "7/8/2009",
    "text": "Some of our cousins from across the pond or over the Channel may take a certain view on the idiosyncrasies of 'British' cooking. There are the names, for a start. Spotted Dick. Toad in the Hole. Severed Retina in Suet. I may have made one of those up. Fish 'n' Chips (you have to use the 'n'... it's traditional) is a timeless example of the genre, and has the added advantage of being What It Says On The Tin. And we should make the distinction here. Chips are not fries. Fries are thin, and made of cardboard. Chips are thick and made of grease. I have spent at least some of my life living in Yorkshire, and they take their fish 'n' chips seriously up there. The Seashell, though, is the equal of any Northern pretender. The pisces in question are spanking fresh and sheathed in light crispy batter. The chips, contrary to the laws passed down from parent to issue throughout the annals of British culinary history, are crisp. And they sell big bloody gherkins to go with them. Gherkins, as I may have mentioned in a previous review, are good. Oh yes, and they sell proper scampi, which remind me of being 8. Christ knows why. I must have eaten a lot of scampi as a young fella. All the usual suspects are present. I'm talking about the fish, not the clientele. There is, oddly, a restaurant attached to the chippy. Or perhaps it's a chippy attached to a restaurant. The room is clean and faintly 50s-looking, and the service is nice and friendly and tends to be a tad slow. I spend occasional Fridays having lunch there - it's my Catholic upbringing - and in this instance I don't really mind if the food takes a while. If I was rushing on a Monday, I might feel differently. Here's the kicker it isn't cheap. Lunch will set you back £11 for fish and - sorry, 'n' - chips, or the takeaway is £6 or thereabouts, depending on what you have. Annoyingly, at the takeaway you pay extra for sauces like ketchup and tartare, which would seem to me to be necessities rather than luxuries. Still, it's a small sacrifice for what is a fine, nay, pre-eminent example of the genre. Don't forget your gherkin.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QFOhNwNwrXFBiJEAEFD3Jw": {
    "date": "4/17/2012",
    "text": "I think this place has allot of history certainly allot of people seem to know it, the fish was fresh and very crispy just how I guess it is supposed to be and the chips nice and chunky the way I like them. Definitely recommend this place",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IuSbJEUSjiP4QgxXUMIm9A": {
    "date": "8/26/2010",
    "text": "Drumroll please.... The Seashell of Lisson grove has returned!  The massive portions have returned and the take out area has been decorated all lovely like...  However I don't know if I'm looking back with the rose tinted glasses of nostalgia, but yesterday's chips didn't seem as fluffy nor the batter as crispy... Don't get me wrong this is still a damn fine chippy with awesome food, it is however just not quite as good as it used to be; I'd no longer consider it the best chippy in London, just a damn fine one...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "T3oP4AC3YfAzNKsnypERpg"
  },
  "RFru3boL5_OPNUM567g3Kw": {
    "date": "6/1/2009",
    "text": "On a recent detour after a long slaving day in the heat for what used to be called work, this place caught our eye. I've never tried the take away but looking at the portions I was quietly surprised that they were not far off the restaurant portions. The batter could do with some improvement, although I may have lost my taste buds after taking a bite straight out of the fryer. Delicate fish, but not as good as up North (really bad comparison, but it's true). Try the special mushy peas!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YogMf0_d8TmR8pskrzfKQ"
  },
  "6xe0TvY04Tnro2QQHIXu4Q": {
    "date": "5/18/2009",
    "text": "I love fish and chips.  Everytime I am in London, I make it a point that I get some, either from a pub or some chippy next to a bus or train station.  I especially love the chippies in Liverpool but in London, I fell in love with Sea Shell fish and chips.Went there in March 2009.  We did not go inside the sit-down restaurant but instead the take away stand.  Maybe I was just real hungry when we went but from what I recall, the fish (I got the cod) was really fresh and the batter was light and crispy...excellent grub!  The chips that went the fish were good as well.  Perhaps there are better take-away chippies out there but for now, this is the best place for fish and chips I have been to in the last 6 times I've visited London.  Can't wait to go back in a few weeks.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1SeMTH-97EJAuZu09vPCQ"
  },
  "kua40dk43Ac_P0R-Lz5sGw": {
    "date": "1/15/2009",
    "text": "This is a good fish and chip restaurant, but not cheap. (Not expensive either just in between). A lot of people don't know there is a restaurant behind the take away. However, if you have a buggy, its a bit of a nightmare. They do have a stairlift thing though, but its still a bit of a hassle. Though its not formal, I would feel out of place in a tracksuit. More of a sweater and jeans kinda atmosphere. The waitress was very nice and treated my children kindly. The lemon sole goujons were lovely with an extremely generous portion. The take away prices are cheaper than dining in. Though there are a few stools to eat along the take away window. Not easy to park in the area.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q4VsyYGEweJ3LAEO0tBROA": {
    "date": "2/7/2011",
    "text": "The Sea Shell was somewhere I've been meaning to try for years and years but have never been in the Marylebone area. However, last Saturday on the way back from Alfies Antique Market I finally found out for myself just how excellent their fish (cod) & chips are. It's virtualy impossible to find a spot of greasiness or oiliness in either the battered fish or the chips. Massive portion of fish in it's own eco-card tray, ditto the perfectly cooked chips. Definitely the healthiest take away (I actually ate at their spotlessly clean marble topped counter) ever! Can't wait till go back but it'll have to wait until I've shed half a stone or so :)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Kv1cHG2zwe-Ai-SGx-wDig": {
    "date": "10/3/2008",
    "text": "Well my first visit here left a very favourable impression. Didn't join the lunchtime queue in the takeaway but sat in the more relaxed surroundings of the restaurant. I went for the battered skate, my lunchtime companion the Seashell char-grilled platter. The skate was delicious, a good size wing, the chips (though good) were almost superfluous! The platter (cubes of monkfish, halibut, salmon and cod) was generous too and equally tasty. I'll return, especially since it's so close to Marylebone Station!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6Z13Q_Tk0Q_2e5U_ztR0g"
  },
  "2JF7lFKFe8_LIgrDnQXDRg": {
    "date": "6/8/2013",
    "text": "A London institution The Sea Shell always has Crisp Batter and Fresh Fish, it's more expensive than most, but you get what you pay for.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XvL_D-Dj3Ag3-c5wmxlu6A": {
    "date": "6/29/2014",
    "text": "Good fish and chips with a wide variety of fish available; nice dinner we had here but falls into average rather than special.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5FMnHHSm21M6lZfTXnb9A"
  },
  "fOQmlRSr0pYwwn88MD8y2w": {
    "date": "3/20/2014",
    "text": "Said to be the best place in the city to grab some British signature's \"fish and chips\". A friend also said that late princess Diana loved this place, so gotta try what a princess likes! It's a small place with only few tables inside and a couple outside. The best way is to have it for take-always. A good deal is their mix box with 6-8 fish fingers and lots of chips for only £5.50! The fish fillet is a big one too and shareable among non-big eaters. Don't forget to ask for a slice of lemon to drizzle on top of the fries. Cheers.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cU3XCh3O5lJwZv-nC-AOHQ"
  },
  "k7SQhFX0-vmOlHLkeybI1g": {
    "date": "2/23/2012",
    "text": "Ate here for my boyfriend for valentine's day fish and chips!  I'm a novice in the world of fish and chips but I though this place was low key and fantastic.  It was busy the whole time but the line moved quickly.The portions are generous so if you are solo, a small anything would be fine.  Great price for the quality.  We ordered the fish box that was a generous portion of chips and fish \"nuggets\" small filets, I'm guessing the end pieces from some of their cod cuts.  The coffee was crap but then again, why would you have coffee at a fish and chips place?   I'm not sure what the quality is for their higher quality cuts of fish, guess I'll have to come back and find out. The fish box seemed really popular though!The chips were thick, just how we like them.  The fish was fine indeed.If it's a bloody cold day, order the soup instead.  I scalded my mouth for a week devouring that soup.  I'm back in LA now, still suffering.I do however have my sights set on some fish tacos back in LA.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jyCoGta9NHZP5naYb6kedQ"
  },
  "vzm0qBak8bJVPoaD2mQGBA": {
    "date": "3/19/2014",
    "text": "Good quality fish and chips but ridiculously expensive. Traditional fish and chips with wide selection. I like all the fish and fish roe. I hope they are slightly cheaper... Must try if you have not been to a proper chippy place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cNT93-GajYp36jMu7alv2A"
  },
  "b-Dm7jzL8lSAIpOBrasd6A": {
    "date": "8/24/2011",
    "text": "Fish and Chips doesn't get better than this place. I was initially startled at the hefty price tag on the fish - why would you want to pay £15-20 for fish? However if quality is what you're looking for go no further. This restaurant is my best fish and chips location in London. The ambience is reminiscent of a French kitchen with black and white chessboard tiling and wood accents. There is also a marine fish-tank and colouful fish artwork around the place which makes for a quirky almost Alice-in-Wonderland feel. Service is impeccable and the meal is a must for the food-loving couple or larger eaters.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VF51aW6gfvYu8iLK6g5YJw"
  },
  "pNA5cKhJZIQ2zNjZ9h0Oww": {
    "date": "6/28/2011",
    "text": "This is a place that is truly trading on a reputation of its excellence of over 15 years ago! The Seashell has slid down and down over the years (the fire that destroyed the whole place was the best thing that happened recently). Like a glutton for punishment, I returned here recently to see if things had gotten any better since the rebuild from the fire. Unfortunately, I am unable to say that things are particularly good here. Now, let me tell you why... The chips here are far below the standard you would expect from a gourmet style fish and chip shop. They do not have that good chippy potato taste and are made from the cheapest possible stock. I ordered haddock for myself and my accompanying mum went for the cod. Although it looked pretty impressive, when it turned up (i.e. it was huge), it was very disappointing that they had not cooked my haddock properly. I cannot describe how horrible it is to bite into partially cooked fish in batter. The clear liquid that spewed forth with my bite was nauseating. They were good enough to accept a return on this, however I did not trust haddock a second time and went for the safe option of cod. The staff who work there are polite enough, but they really do not have any training or any knowledge of what good fish and chips is. Not exactly a solid foundation to put a business together and especially when they charge the high prices that they do for the reputation that has gone before. A disappointing exercise. But hey I'm English right? So I must crave disappointment deep down in everything I do!",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "WgjoReAvZdgAbOXWHBtIEQ": {
    "date": "4/12/2015",
    "text": "Had not been before read the reviews, so booked a Saturday 8pm slot, wanting the Scallops, were told there were not any by the waiter, he rarely smiled at all to anyone while we were there. A girl on our next table asked for fish cakes she was told they were not available either. Forgot to bring our Prosecco, we had to remind them. 2 of us and the bill £90. Food was alright but service could be better. A good expensive fish and chip shop really, with poorly managed stock and one boring member of staff. The rest of the staff seemed quite happy. London is full of great eateries, this one is not on my return list. I have been to so many better ones at half these prices.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOZ-imwwnDij41yFevNp9Q"
  },
  "JVlOwrpFHztPL79HETpeHQ": {
    "date": "3/3/2010",
    "text": "As at February 2010 this place is still closed.  Personally I think they are waiting to ride out the recession before reopening.People always raved this place but I could never get that excited about a sit down sea food / fish and chip place. Then I started to get takeaway fish and chips after going to the gym. Yes yes... I appreciate...the contradictory nature of do that...but it was fun.The takeaway fish and chips were great. When this place opens up again I will be one of the first to queue up to see if the place is properly back up and running.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "edbF5Rsxl8ZubaYOiw6ucw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/edbF5Rsxl8ZubaYOiw6ucw/o.jpg"
      },
      {
        "img_id": "j2Ez7E_hCFTPwWt4FA03BA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j2Ez7E_hCFTPwWt4FA03BA/o.jpg"
      }
    ],
    "user_id": "q59vnLIaj0S0NbQDfAtORg"
  },
  "YcXLBpOJA5TT7xdV4HznPw": {
    "date": "10/14/2011",
    "text": "Ate here as part of a tour group (25 or so people). Took forever to get our food--I suppose they wanted to serve us as a group. The wait was forgotten when I realized my cod was as big as my forearm.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kCJ6nVZsZxJfH_cjQ0FrPg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Spotted dick",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kCJ6nVZsZxJfH_cjQ0FrPg/o.jpg"
      },
      {
        "img_id": "ItYbpmHR7V2U3iay7XryLg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod with mash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ItYbpmHR7V2U3iay7XryLg/o.jpg"
      }
    ],
    "user_id": "Mp3ECCMljaJZJGjcEfnVZQ"
  },
  "qIYHkMmLmzlCikftfL508Q": {
    "date": "5/27/2014",
    "text": "This is in regards to the take away section of the establishment.Excellent fried fish and chips, with some yummy veggie salad options too. I had the cucumber,Greek olive, tomato, and feta salad on the side. Yum. Popcorn cod and chips...the fish was good, and then batter was very crunchy. 20% off w a Westminster city save card.This place is truly British...(despite the international staff...)...meaning, service and all... ;) enjoy. (...And double check your bill, and then make sure you get all the food that you ordered!)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DziRL6vBVeZEcayZYffGbg"
  },
  "0XtAdBq2Vn9Nduqwc4iHBA": {
    "date": "8/13/2013",
    "text": "This is my favorite place in London to get fish and chips! My sister was visiting me from Los Angeles and she loves fish and chips, so I knew I had to take her here. The fish box is perfect! We split it and it was more than enough.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "u-Fsv96mBGY52u2o4eKY8A"
  },
  "51g8Ee1FkBvGC3BPgvOJkg": {
    "date": "2/21/2009",
    "text": "Being a complete tourist in London - I suppose the ratings might be correct.  Maybe there is some amazing fish and chips restaurant in London that I didn't hear about - - but this was the place we knew about, and this was the place the concierge recommended.  Every single cab driver seemed to know it, too.So - upon arriving in the city of London, the very first thing we did, prior to even getting to the room, was hit up \"the best fish and chips in London\" - Sea Shell of Lisson Grove.Now, perhaps I've been subjected to mediocre fish and chips for all of my American life...Perhaps I tasted mediocre in London and didn't know the difference between this and \"amazing\"....In any case, I was blown away!The fresh fish was expected, but the batter was SO light that at no time did I feel like I was eating something not quite healthy.  Excepting the \"chips\" (french fries, in other words) this fried fish felt as healthy as a salad w/ some ham on it.When asked what I wanted for a drink, I realized I have an irresistible urge for beer at the mere thought of fried foods, but didn't like some of their beers, and didn't recognize others until... GUINNESS.OK, that'll do.It turns out Guinness in the UK is better than Guinness in the US, but nowhere near that of Guinness in Ireland.  Not surprising, but due to proximity, I hoped.We also shared an order of calamari, and a fish soup that was on the menu.  This fish soup was outstanding, and the calamari was surprisingly good, though nothing like the calamari one would expect.  Whole pieces of squid, battered in something very light, lightly fried and only somewhat crisp, but nonetheless quite delicious, and perfectly seasoned.The chips deserve a mention also.  Very lightly crisp on the oustide but so soft, and so hot on the inside.  Again, the common theme at Sea Shells was that none of it was battered heavily, or fried to a ,massive crisp.  For someone like me who doesn't really like overly crisp things - - this restaurant hit a homerun.My dish cost about 12 pounds, if I recall correctly.  When ordering, you get a choice of about 5 fish, including the common cod and a rock salmon.  I ordered the haddock, which was precisely what I wanted - thick, juicy, and flaky.  The serving was generous, and while I devoured the whole fish before Rob was even halfway through his, I found that I had barely any room left for the chips.  Keep in mind that I did finish the calamari virtually by myself first.In any case, I feel really lucky to have dined at Sea Shell.  I'd go here time and again as my first meal when in London.  Touristy?  Perhaps.  But I maintain that tourist food is not necessarily bad food, and places like Sea Shell are the exception.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "KzmowbB6klsYqhB4z1K_Ag",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KzmowbB6klsYqhB4z1K_Ag/o.jpg"
      },
      {
        "img_id": "UyTBYz_9Ds7nu_dSnHHsYw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Fish and Chips!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UyTBYz_9Ds7nu_dSnHHsYw/o.jpg"
      },
      {
        "img_id": "YriMXCw9MmYHN1CS_TfQQg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YriMXCw9MmYHN1CS_TfQQg/o.jpg"
      }
    ],
    "user_id": "_pIG1_s6Bzymn1zeyLjBHQ"
  },
  "QcCn8HBmngwTlmgCZYiv7A": {
    "date": "6/26/2015",
    "text": "Hands down the best fish and chips hands down.  Moist and cooked to perfection!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0yz57KjYvk-clPMg8u7fw"
  },
  "GzK-byz_4LzFH1ZC3UylXw": {
    "date": "2/15/2013",
    "text": "we were recommended this place by our cab driver. we were happy we went.we ordered a fish pie and fish a chips (cod). Both were very good!for dessert we ordered the spotted dick with custard - which I had never had before. I am now a fan!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GW9j34k9JQuklhinactOzQ"
  },
  "okWCDCn1rUalawdUe4gbAQ": {
    "date": "10/16/2009",
    "text": "I popped down to the Seashell to get some fish 'n' chips at lunch... but found it a little burnt! Boom-Tish They suffered a fire a few months back, and according to the poster on the boards (see photo), should be up and running (and frying) again soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eFovVzvhyUxlJ5QIWoO4BA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eFovVzvhyUxlJ5QIWoO4BA/o.jpg"
      }
    ],
    "user_id": "rfJfowUqaeAWy7xej41RRQ"
  },
  "Yx-L9pG2huUCC2JaHjuDHA": {
    "date": "3/23/2014",
    "text": "Best fish and chips in London by my count. We have a young child and they are always accommodating at The Seashell. The fish is light and tasty, not overly breaded. The chips are chunky and are always a hit at our table. It isn't the cheapest fish and chips in town, but the portions are huge and the food justifies paying a few pounds more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMLfhx7fROMZvAyrPAXtIA"
  },
  "QvDyNYghDIvWjlEo6JDEpg": {
    "date": "4/30/2012",
    "text": "Firstly, this review is being written by an American from Wisconsin, home of the Friday Night Fish Fry...which is, in essence, the British Fish and Chips experience with a few subtle differences...we know our fish frys!Several people had recommended this establishment for the 'best fish and chips in London', so my fiance' and I were eager to try it out.   It was with some excitement when we found out that the group we were in London with included lunch at the Seashell as part of the package.   However, I think that the size of the group (20+ arriving on a bus all at once) had some effect on the experience, which I'll detail in a bit.Firstly, if you just want fish and chips, go to the takeaway area and order there.  It's about 1/2 the price of the sit-down, and in this reviewer's opinion, there's not much that you're missing.   I give the sit down experience 3 stars and the waitstaff 2 stars.  It was stuffy, hot and the service was slow.  We weren't served the drinks that we ordered before the meal until we were nearly done with the meal.  Skip all that and carry-out.The fish was outstanding.  5 stars on that!!! I'd give the fish more than 5 stars if I could.  The chips....they don't salt them like Americans do, so if you lay on some sea salt and malt vinegar, they're delicious.   I'd give them 5 stars, but my fiance' didn't care for them at all.   We also were served apple pie with custard.  Custard was delicious.  Skip the pie if you like a sweet apple pie, as is made in the U.S.  This one is a tart pie, and probably very well made for what it's supposed to be, but didn't appeal to the American palette.Overall, great fish, good chips if you like a very crisp chip and if you remember to salt and vinegar the hell out of them, and generous portions.  4 stars overall.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8mx2fc6KptFvg0zJbBKzBQ"
  },
  "eWSGnMJJqRCfrvAm13e_ZQ": {
    "date": "7/22/2013",
    "text": "If you're in the area you have the chance to get the best fish and chips in whole London. The food is truly amazing and I can guarantee you'd want to go back for more (regardless of all the calories).",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0olBpnmgpyxvyFEZiEdJ1g": {
    "date": "7/19/2013",
    "text": "Quite decent seafood restaurant. I've been to many places but the lobster here is definitely the best. It's well cooked and the meat is melting in my mouth. However, the decoration is nothing special but you're going there to eat and not to look around :)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JDAVOyk0kyOtahA8oUfaPA": {
    "date": "11/5/2011",
    "text": "There are two areas to this place, the take out and the dining in. I enjoyed dinner at the dining in portion of Sea Shell. The place was very clean and the waitstaff helpful and friendly. I had fish and chips with mushy peas. For dessert I had the apple crumble with custard. All were exceptional, as good as it gets.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5hi55_Fn9yXSSV4gSNoZEQ"
  },
  "6k_ehRVrUZF9uG9kjF2Jbg": {
    "date": "11/13/2016",
    "text": "Basic, well cooked fish and chips but nothing special. I have tasted amazing fish and chips in Brighton and Whitby  but this is not half as good.The food has no soul.This would not matter but prices are quite expensive so one expects more.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQRTvmr_aSmSNrG8FfIVYA"
  },
  "g52Tjpob2aluIVqis6aQAw": {
    "date": "12/3/2014",
    "text": "I had some of the best fish & chips when I was in Aussie and I have been searching for good fish & chips in US without much luck. When I had a chance to go to London, of course I had to research for the top 10 fish & chips places in/around London. This place caught my attention, and needless to say, I had high expectation coming to this joint and I certainly was not disappointed. I ordered cod, chips, and an order of fish cakes. The cod was fresh, made to order. The batter was medium-thick and crispy, without too much grease. The chips were done right, and the fishcakes were fresh too. They were not cheap, but the portions were big (I wasn't able to finish my order although I was starving). Service was friendly - the girl behind the counter was very helpful. The restaurant was bright & clean. Although it has no tables inside, the outdoor patio seating was lovely.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "72fP7hkRnIToH7OnCaRSZQ"
  },
  "cbSfcSnkqe4eGDVRsMc-2w": {
    "date": "11/15/2014",
    "text": "Their specialty is fish and chips and you can get your fish in two ways: fried and grilled. Grilled takes 2x the time to make. Big selection of fish from your normal cod to skate to salmon. The fish come bland and is designed for you to add your own condiments. My favorite combo is lemon+malt vinegar+salt. You can't go wrong with the cod, but watch out for the skate. Skate (think stingray) takes longer to make and has a TON of soft bones. A good meal will set you back 10-15 quids per person.Tip: The street facing shop is a quick to-go service joint but swing around the back and you'll find the sit-down restaurant portion.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5lZ6XYnI2C_JUxyEtBgpkA"
  },
  "YfR3b0ZUHRWR3pgWWYbNDw": {
    "date": "9/3/2014",
    "text": "Got the fish and chips and was a bit disappointed. Fish was large but had very little flavor. I also didn't like the texture of the fries and they were a bit too greasy for my taste. Best part of the meal was the tomato soup.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "26WeiaomM0Gx52jlgkg8sQ"
  },
  "D5rdAoPSHkeFVlISYOwYWw": {
    "date": "2/15/2014",
    "text": "First off I want to say this was a take away experience.  My wife and I were staying in an apartment half a black from this place and we were excited a well ranked fish and chip place was so close.  We stopped by around 530 on a Wednesday and ordered cod and chips.  The cod had just come out of the fryer so it was wrapped up and we were off in a short amount of time.  We took the food straight back to the apartment to eat right away.  The cod breading was crisp but sadly tasteless and the chips were the worst I ever had, not sure if they were old or what but they were shriveled and chewy... Extremely disappointing on both things.  Later in the week after moving to a hotel we got fish and chips at a random place near whitechapel tube station that was far better.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-KHwN44RxO65RV0tBy52A"
  },
  "dLZQ9iBpf6LXfFQF57IVVw": {
    "date": "9/8/2015",
    "text": "Fantastic fish & chips! First time here at the suggestion of a coworker, it did not disappoint.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRiRPlLz8qW3JtSP-1BTLg"
  },
  "DdQQxL2-oSh7J_SmJcvW2w": {
    "date": "7/20/2014",
    "text": "A-OK is about right. TERRIBLE service. We waited an hour in between appetizer and main. 2 other tables were seated, ate, paid, left, all during the time we were waiting for the food. You get a HUGE piece of fish. The fish was good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "40jyU6WuoTpYPkg8tPClXg"
  },
  "csKAguPGAskr_ayl5768uw": {
    "date": "3/17/2015",
    "text": "I tried their takeaway side (there's a sit down restaurant also) and was thoroughly impressed.  Previously all claims for great fish and chips in London have turned out to be disappointing but Lisson lived up to my friend's hype.  Firstly the batter was perfectly done,not too thick and not too oily but more importantly had the flavour of fish.  The fish was also cooked perfectly and not over done.  Squeeze in a bit of lemon and some salt and I was almost back on Manly beach, Sydney, I say almost because on this particularly day it was a cold rainy London special but the fish and chips is pretty good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "KDCu-D5ioYKpPERAywcxkw": {
    "date": "12/14/2013",
    "text": "Edit- this was one of my favorite fish and chip joints clean great service great fish. But went there around 2 weeks ago and discovered they had changed their suppliers for the fish and it showed it used to be outstanding in my opinion but now is borderline average hope they Change back to their old suppliers and will Change my rating accordingly.Great fish And chips very satisfied plus I like how clean the place looks and the staff continuously keeping things clean no complaints here top notch in my book worth the trip. Plus they more on their menu then your average fish and chip shop",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ok2enORZm5JzXl2i7MSK5A"
  },
  "RTSI3pj5vuzxqjMznxICVA": {
    "date": "5/2/2015",
    "text": "Been here a few times, given it's reputation. I think it may have lost a bit of it's luster. The fish I find was simply OK, and for the price point I would expect more. The batter was not overwhelming, which is a great plus, but the taste of the fish didn't really shine through at all. The chips were great though. It's certainly not a bad place for your fish and chips, but I suppose it wouldn't be my first choice considering the wealth of options in the city.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ukTqKLMXzZYG2X2e4Iyq-g"
  },
  "Lgqfex5NyWz89eEACduLsw": {
    "date": "8/8/2014",
    "text": "I was told this is where you find the best fish and chips in London. It was good alright, but nothing over the ordinary. I guess I had high expectations but I've had better fish and chips in cheaper places with better service. They have a lot of options which is great but the staff wasn't too keen on explaining when I had questions. You also have to buy the sauce on the side and you don't really get a lot of it. But all in all: filling and satisfying!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RBIEikBRvlpqcaDBjaCkmg"
  },
  "mS_W3ReDObd3HwaOoA73IQ": {
    "date": "4/21/2015",
    "text": "Went here after arriving at our nearby hotel and reading the good reviews.  SO glad we did !  We arrived without a reservation but they managed to find a table for us and fit us in.  I had the traditional cod and chips and my girlfriend choose the seafood pie, we also had a side order of Chilli Broccoli and the Curry Sauce. The exceptionally good fish was the best I've ever had and the chips are delicious. The Broccoli is extremely nice dipped in the curry sauce and we had an extra free serving of chips to finish the sauce off.  Finally, as we were tired and need to get back to our hotel they arranged for our Apple Pie and Ice Cream dessert to be put in a takeaway box and kept in the freezer until the moment we were ready to leave and jump in our cab.  Highly recommend eating here and can't wait to return ourselves",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OerZod0-Uk-l4li_7PiIsQ"
  },
  "_quuuLpnIe8H5US8fxMd0Q": {
    "date": "1/9/2015",
    "text": "Great spot for fish and chips, right near Marlybone station. They give you unlimited chips. The few times I have visited, it hasn't been overly crowded. The staff is very friendly and it's in a safe area. I really like this spot for a consistent fish and chips experience",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "T_3wXdVYz3XeRojGScEVWg"
  },
  "ztyOE_RIeiJsxyd6y0W96g": {
    "date": "10/27/2014",
    "text": "I got the large Cod and Chips and it was awesome.  We sat outside on a small table.  I am American but I came with my boss who is from London.  After eating here, I tried fish and chips at 4 others places from London to Liverpool.  This was the best!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0E9rEkq5J5ps_WFCybfJVQ"
  },
  "ch3jZfKBrrV-06g6hBzziQ": {
    "date": "7/13/2016",
    "text": "The fish and chips were amazingly crispy and fresh. I totally recommend this place if you really like fried foods. This place is very kid friendly and the people who work here are very helpful. I asked for a sample of the mashed peas and they gave me a whole cup. If you have about 3 people with you, 2 fish and chips is enough because they are a pretty big portion. Overall, I was really pleased and impressed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PqU07RvqkLSu9tQuw52j4g"
  },
  "7hC5Scfp7j1cQwmdhO11Tg": {
    "date": "4/25/2015",
    "text": "We approached the corner and saw a take out counter, and tables outside.  Then we realized this was not the restaurant per se, but rather a market intended for to-go orders.  The full service restaurant next door shares the kitchen.  Probably 8-10 choices of fish for fish and chips.  Never seen that before.  A few £ more than typical pun food, but helpful, friendly waitstaff and good fish (cod) and chips. If you prefer to get the same food and save a few £, get your order at the market side and save a few.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hP_45gg-MlUL4B594qtu_A"
  },
  "4PVJs1As7p9NdNhZ8AT1mw": {
    "date": "1/31/2016",
    "text": "I lived a few blocks from the Sea Shell in the 80's. I loved walking up the road for some of their plaice. Back in the states now and I would kill for some of their yummy fish & chips. So glad you are still around.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qdqQdoBKITozdVd4s3ZqoQ"
  },
  "wkFMENlofTp0jkQYuWyPZw": {
    "date": "9/23/2013",
    "text": "So, this is my first time in London and we ask our Hotel Concierge to recommend us a place for the best Fish & Chips in the area.  The second thing out of his mouth after asking why we didn't want to eat at the hotel (really? Because when I'm on vacation I want to spend time a hotel) was Sea Shell. We were sold. When we arrived it was about 45min to closing (long day of sightseeing) and left less then welcome by our female server. Sorry for enjoying your city and then wanting a good fish and chip. However, at the end of our meal a different server assisted us and he was far more pleasant.My sister and I shared the fish & chip and the session pie. The fish and chips were good but I could easily get this back home (Wisconsin, USA) at our church's Friday fish fry. We also shared the fish pie. I felt as though the chef forgot to add the seasonings. I did have an excellent red wine, Rioja.Overall, Sea Shell had a lovely atmosphere and a good meal. You could tell it was made with love just not enough seasoning.. And I bet on a second trip and different selections I would probably have a better review.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_VGF6FbsE7QjY5kkNWGdw"
  },
  "tNEzpYCSrzGguquWuyT_Rw": {
    "date": "11/9/2010",
    "text": "Chips were just awesome. I had to grab some friends fish. I was late meeting the group and were ready to leave. Close to the Tube.Very highly recommended and well known place. Yes the cabbies even know the quick back roads here on a busy Saturday afternoon.  Just up the street it turns to Abbey RD. Note. don't do the Beatles street crossing against traffic. They will not stop.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-dN_vGdrA7uYIpQG32TqGA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-dN_vGdrA7uYIpQG32TqGA/o.jpg"
      }
    ],
    "user_id": "aBFRYTkVbkA7wiB4q0OBbw"
  },
  "vqqlRR1OCUWsp8TBAr0hKA": {
    "date": "6/14/2012",
    "text": "On my trip to London, I was recommended to this place by not only by our tour guide, but by various other locals we met on the streets of London. So coming in we were expecting allot. We were not disappointed. The food was amazing and the serving size is well worth the price. I had the sea bass fish and chips and my wife had the sole (apparently this is the only way fish and chips should be). The food came within a few minutes and the fish was fried perfectly. It was crispy, fresh, and not oily at all. The fries were just as good. It was quite hard to find, but well worth the search. I would definitely recommend this place to all visitors.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLde9fTArPw_L6KkuZ60-w"
  },
  "_Obgn5daU1h7DLc4l0Gelg": {
    "date": "3/22/2017",
    "text": "Fish and chips... woot! Great food and really great service. Sit in the fish tank for a fun experience...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9ulaHHrixn_yfAtgEj0Bw"
  },
  "XwJMnbmlZcQZ_iqMcEMxCw": {
    "date": "2/15/2017",
    "text": "THE BEST FISH AND CHIPS IN LONDON!!! I usually find fish and chips tasteless and either over fried or soggy with chips that are nothing worth discussing and tarter sauce that I never touch.  I was THRILLED to visit the Seashell after multiple recommendations from friends. The fish was fresh and the panko crusted goujons were FANTASTIC - the chips were fab too! The service was very swift and friendly. There is a take away shop and the full restaurant behind. Great kids menu too! We will definitely return!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "q7naik8VS6sPsfI0E_fEKg"
  },
  "kEcUWhUn79xktPfR3HTKsQ": {
    "date": "1/12/2015",
    "text": "I had my first proper London fish and chips here at the Seashell, and let me tell you, this place has set some high standards for me. The menu has a whole page on the different varieties of fish that you can have battered. Did I also mention that the fries that come with it are unlimited?!!I was pretty basic and went with the cod and a side of salad. The piece of cod I received was fresh, crispy, moist, and flaky; like what more can I ask for?! The portion was also bigger than any piece that I have had in the States. The salad was fresh and I loved the simple dressing on it. I also had a taste of my friend's chips, which were also yummy. Service was also top notch; our waitress was sweet and checked up on us often. Service fee is not included here, so remember to leave some tip! The only setback is that this place is sort of expensive, with the fish and chips starting at 15 quid and going up to 20. Otherwise I would be here every weekend lol. I would definitely recommend this place for proper fish and chips!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wpV7BCzi3kmPUHM9RxF6Qw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod with Salad / Cod Bites with Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wpV7BCzi3kmPUHM9RxF6Qw/o.jpg"
      }
    ],
    "user_id": "HyYAc6PqiaLRH46rmtDLQA"
  },
  "G-r7yw6PpbsLeZO2y_ebMA": {
    "date": "3/31/2018",
    "text": "We came the day before and they had no seats, so we made Reservations for the next day. Our reservation was for 7 o'clock, not too late. When we got there we were told that they were out of fish pie, grilled lobster and even mashed potatoes. It's took one hour to get dinner....not sure what was going on, got lots of excuses... worst last dinner in London",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6lbphgFrfRzeGgYKY_igoA"
  },
  "vsP3wyLFxCA_3xvzBvWAAA": {
    "date": "1/2/2017",
    "text": "Amazing is a word that beat describes this place. Their service is great, their food is great and the ambience is great too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Mb5Mt76wP9z3Za40oEZ9A",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. The menu is on the top",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Mb5Mt76wP9z3Za40oEZ9A/o.jpg"
      },
      {
        "img_id": "ee24uYIFkoSux22a_HMHZw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. This is a 'must have' experience if you like fish and chips!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ee24uYIFkoSux22a_HMHZw/o.jpg"
      }
    ],
    "user_id": "BUrN46A-udFGlSukWm4npw"
  },
  "Wsd2gdW34tNlS06aixSyHw": {
    "date": "1/14/2014",
    "text": "This is a little gem near the London Business School. One of the best things about this restaurant is that it has the friendliest waitress. There is also a good sit down place with a large beautiful fish tank in the back! If you come here around 5 PM, there would be barely anyone, so you can sit anywhere you want. Most of us ordered the traditional Fish & Chips with various fish styles. I got Cod for example, and it was absolutely delicious. The fish is very fresh, and they come with \"unlimited\" supply of fries or salad. Yes the fries are unlimited and tasty! The price is also decent; we each paid about 16 pounds including tips. Highly recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vbY_gs5jS6flGTV9M5jmwA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod fish and chip with salad! Delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vbY_gs5jS6flGTV9M5jmwA/o.jpg"
      }
    ],
    "user_id": "x33z4WmRbPlOctz6Hmv2Bg"
  },
  "7vSCm-N1XpKzktitllS-Hg": {
    "date": "8/25/2016",
    "text": "This was the best F&C I had in London, probably anywhere, supper fried, great batter and chips, met a cool chap and we wound up drinking at a pub down the street. This is a must if you're looking for the real deal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvrT_21w6SsR7c5No-QcLQ"
  },
  "gxQs40eOv3ksDz3Nmx8N1g": {
    "date": "5/15/2015",
    "text": "Cab driver recommended it - the bottomless chips sold us. According to the last review, Lady Gaga comes here (see below). The fish was very fresh and perfectly fried - not dry at all. The portion was dangerously large (for your arteries) and just as delicious. The chips (French fries for us Americans) didn't look great, but were perfect. And bottomless. Did I mention bottomless? Will definitely be back next time in London (or tomorrow)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "izFEkRZD-o16vL2ZXr76zA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Amazing fired cod, delicious chips (which are bottomless...)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/izFEkRZD-o16vL2ZXr76zA/o.jpg"
      }
    ],
    "user_id": "MMG4KkK7JJgRF6A8vqqqCA"
  },
  "aWRXB7VHJMcy0DRTP6uOSQ": {
    "date": "4/26/2016",
    "text": "I always have to come here whenever I'm home. It really is the best in London. All the fish is fresh from Billingsgate and it could probably stand alone just on the quality of the chips. Don't forget the malt vinegar for the complete English experience.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wqOT82DDcFMgbg32Yos7VA"
  },
  "reJ2lJhJYexo7MKhdAq4jw": {
    "date": "12/2/2012",
    "text": "Let's just clarify a couple of things.... there are 2 parts to this place:Part 1:  There's a formal, sit-down full service restaurant, relatively priced.Part 2:  There's an informal, walk-up counter for simpler fish and chips.  If you order at the latter and want to eat there, you'll be standing to eat at a  counter.  Or you might grab a couple of small seats outside (if the English weather allows). I've only gone for Part 2 but really like the place.  They are always busy which is something you want in a seafood place.  And they offer a variety of fish at different price points.  I live around the corner and there's always a steady flow of London cabbies getting a bite.  They probably know every chip joint in London so their tacit endorsement is another good sign.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hJwbh9-029mUq6oZ35kqtQ",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hJwbh9-029mUq6oZ35kqtQ/o.jpg"
      },
      {
        "img_id": "zI4m0yAMEGhVnSnMPgM6gw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zI4m0yAMEGhVnSnMPgM6gw/o.jpg"
      },
      {
        "img_id": "eTKbxtEkELufcGUUHwJGmA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eTKbxtEkELufcGUUHwJGmA/o.jpg"
      }
    ],
    "user_id": "aIzN19RssPWSw9nDCPXU3A"
  },
  "zaegxBQPsH9tdnhBYCHwTQ": {
    "date": "7/1/2016",
    "text": "I don't usually care for fried foods but figured I had to try the traditional fish & chips in London. This place rocks!  Totally crunchy, not greasy at all and super moist fresh fish on the inside!! WOW!  We had Cod & Scampi with chips. Couldn't find anything close to this on the rest of out trip. Can't wait to get back. Great 1st stop!  PS. Sorry no pictures. Too busy eating.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l44pzbJR2jfKqKQMQ1abRg"
  },
  "QBiS6I-G6dku_AOjs4mFrw": {
    "date": "12/27/2014",
    "text": "I had to have fish and chips as part of my London experience. This place was  highly recommended and I enjoyed it. The fish was exceptionally fresh, simple and unadulterated.We somehow did not notice the sitting area of the restaurant and sat outside. Turns out that worked out because a very hungry man came and took about half our portion.So, the portions are huge. One serving is plenty for two people. Condiments are sold separately.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0G-bcpdR48tfZy6koGUiTQ"
  },
  "9cBEt3HaHmkNoMCUeO1BMA": {
    "date": "3/29/2017",
    "text": "I can't vouch for the counter service, but they have a sit down around the corner and I wouldn't recommend.Not that the food is inedible, but it's def not the fish and chip experience that I was looking for, or the flavor.The fish is cooked with the skin ON.  My fish was quite wet inside, although the outside was crispy.  The flavors were blander than I've had at other locations.  You can request the skin to be removed prior to cooking.I'd just rather go somewhere else.On the upside, it was clean and bright inside.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5pHZxDjI-2yX-yTCjh_tQ"
  },
  "qQ4X0LDvRuXBpwKhSkhEKQ": {
    "date": "12/23/2015",
    "text": "I enjoyed the food very much.  The portions are huge.  One plate can be shared.  The price is a little high, but the quality is excellent.  The fish was not at all greasy.The atmosphere was very plain.  I was expecting more of a pub style restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5z93pweC0UkPxDC0zw1Hw"
  },
  "WbGU3Sel9I4z0m2G7wodcg": {
    "date": "2/22/2017",
    "text": "Princess Diana used to eat here! Or so they say. The food is great. If you want actually good fish and chips, not wading in oil, then definitely try this.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYmyxhM6XW8kVCb7bjONCA"
  },
  "r2zxHUroBZOuR4lOHWLIvg": {
    "date": "2/3/2015",
    "text": "We went to this place cause it came highly recommended and it's where Lady Gaga tends to enjoy her fish and chips craving. The restaurant is a very higher end fish and chips place with nice decor and staff. This also raises the price of the dishes tho with the regular fish and chips being no less than 15£! I have to say it was the best fish and chips I've had though, the fry on the fish was light and coated it perfectly and the meat was tender and juicy. The fries were good but maybe could've been a little better but the tarter sauce was amazing as well. I'm not sure what they put in it but it just tastes much better than usual ones. Overall if your in marylebone come try lady Gagas favourite fish and chips and see what I'm talking about! Only if your willing to pay more than 18£ for a meal of a drink and fish a and chips.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EomWcTCj78z9Bz0PsI2OVg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod fish and chips 15",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EomWcTCj78z9Bz0PsI2OVg/o.jpg"
      }
    ],
    "user_id": "eHaNR6IWBQTBeZy9IrfgfA"
  },
  "m-mouASVwZtMxOGQVoEMig": {
    "date": "10/21/2015",
    "text": "The fish and chips are always good and is probably the best chip shop in London. Just a bit overpriced. They also do the proper chip shop curry. Everywhere else it's more like a curry sauce you'd get at a Chinese takeaway. This one is the proper chip shop stuff if that's what you're after. I would recommend getting the fish goujons which are a mix of cod and haddock. Something a bit different but delicious. Staff are alway friendly as well which can often be a rarity in other places. Have never used the restaurant myself but have heard good things.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "N0gHzaoux4jWu5poP74RNg"
  },
  "8pic-6mEZyE4gpFFKf3JQQ": {
    "date": "7/19/2014",
    "text": "Had a great lunch here as we started our tour of London. Fish (cod) and chips (all you want) were very good. Service was very average. This was in the restaurant. I would try the take out next time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0p2iPI2pjfXLBnfMDBhufg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0p2iPI2pjfXLBnfMDBhufg/o.jpg"
      }
    ],
    "user_id": "XgIgGdISrIURPz5RAXOPbA"
  },
  "arsdaBJpE9eKzlula3vf6A": {
    "date": "11/22/2013",
    "text": "Went here on a recent trip to London.  What's funny is when we got here forgot that we had taken our kids here when they were very small and couldn't even reach the counter. That was 15 years ago!There's a stand and eat counter and casual takeout in front, but they have added a great restaurant since in the back where there were many families eating. Best fish and chips etc. and service good.  Restaurant clean and bright.Prices are fair. Beer and wine too.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T4bKpy8-BT27L_nfWdlVqQ"
  },
  "sjF3lN7yHpidskdUP2miOQ": {
    "date": "5/26/2015",
    "text": "Maybe it was because I got the \"special,\" but, I was less than impressed. The chips were much thicker than I prefer. The fish was Haddock and seemed to still have the skin on. Maybe this is normal in the UK, but it grossed me out. Blech. No tartar sauce was given. Why does everything cost extra here? I didn't even think about having to request it until I had left the shop and there was no sauce.Last, I thought I was going to get a fountain drink with my meal deal (yay, ice!). Instead, I was offered a can of Pepsi when I requested a Coke, and it was warm. Nooooooo. I am ok with the can, but I am not so with the warm.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDeAD7GKyuEI3lWbsweg_g"
  },
  "CLJsj2_kpk8LlEXQ7LeCzg": {
    "date": "8/31/2018",
    "text": "Nice corner joint for fish and chips!! Definitely a go to place! Its fresh and tasty!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDepScoHDnOO5Q59-2j9vg"
  },
  "ffOJPz085h-05Jck8K7CiQ": {
    "date": "9/12/2018",
    "text": "I have seen this place in soo many media. Tv to newspapers to magazines and social. Today I took a long drive to experience.I think I had many better fish and chips in so many pubs in all over London. I'm not saying it's bad but it is 3 stars for sure. It's a bit on the oily side. Location is not unique enough. If you are a Japanese tourist you might love it.Sorry",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2r_hErjmi7dBzWO6E-P4w"
  },
  "vCAXcufsr2_9cCOgoaD2Aw": {
    "date": "8/4/2018",
    "text": "I've always heard that fish and chips in London is a must try and I have to admit, this restraunt was a little underwhelming.To begin, inside it is stuffy with low ventilation and seating outside isn't optimal for big groups. The service was also slow.The popcorn cod and fish filet was bland, oily, and didn't pair well with the tar tar sauce. The grilled seabass was good, but I wouldn't recommend this place for a typical \"fish & chips\" visit.All in all, good food, slow service, & wouldn't recommend to a visiting friend!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PjgE7ia3boFUYkux7J0n7A",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PjgE7ia3boFUYkux7J0n7A/o.jpg"
      },
      {
        "img_id": "YQgvPgs_SYQ5MeB09xTCCw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YQgvPgs_SYQ5MeB09xTCCw/o.jpg"
      },
      {
        "img_id": "YM8ek0JqDEndbeyY0gw4Kw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YM8ek0JqDEndbeyY0gw4Kw/o.jpg"
      }
    ],
    "user_id": "z__CbNBdFKguZQSij6qg7g"
  },
  "HgRqxp2B5SWPj__n4LIErA": {
    "date": "7/26/2018",
    "text": "I live just a couple of doors away from this restaurant which was famous as a very good fish and chips back in the eighties. In the last couple of years I started to go there less and less as the take away food has deteriorated so much that it is really rubbish. Last straw was last night when I bought a regular chips and got some dry, old,uneatable things that they call chips. Last time I'll go there it's crazy. And by the way if you at the restaurant read this post would you please clean the pavement outside with a steam cleaner like they used to do as it is caked in grease and oil and smells really bad in this weather. Thanks",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zNYEB7xBV-qxixaEUj1cGw"
  },
  "zHoyC0zN78ftovzV3Dtf0Q": {
    "date": "4/15/2018",
    "text": "Seashell came recommended to us from our hotel concierge, we did check out our trusty yelp before heading out and they did have lots of hot and cold reviews. We just arrived in London and was staving, what better dinner then the original London favorite fish and chips! This being my first time in London I wanted to try the local fair cuisine. Disappointed is a bit strong, but I left seashells unsatisfied. It was FREEZING outside we decided to sit in the restaurant side rather then the take out, the atmosphere was a bit \"blah\" the bathroom is 3 flights of stairs down! Yes 3 flights, service we mediocre and so was the fish and chips. I had the cod, which over all was the best my friend had the Halibut and the other had the haddock, he returned his haddock for the cod. Was not crispy, I am a fan of crispy battered fried fish, Was a bit mushy and watery for my taste. You'll see my photo it's just \"blah\"I don't feel I'd return, sorry to report not the best food I had in London! However I did try another fish and chips place that was great! Stay tuned for another review",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mUYh8vy8qHL0gjxumJl4Sw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mUYh8vy8qHL0gjxumJl4Sw/o.jpg"
      }
    ],
    "user_id": "xXWUgFpC5w-PwuZ_MES2Kg"
  },
  "Dg6wohVl3Xzug0o-Aav2gA": {
    "date": "10/23/2018",
    "text": "Seashell used to be Great 2 decades ago , it has changed management a few times , all the classical oldies are not on the menu anymore ! It s gone completely DOWNHILL and less and less people go there, the Fish is not Fresh from the day anymore, the food is over greasy and not served refinely like it used to years ago that we would go back repeatedly. No more Treacle sponge pudding, no more spotted dick :  WHY HAVE THEY REMOVED THE BEST ITEMS ????? RIDICULOUS",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F8q5LEeJzgjJ49WeUks6Tw"
  },
  "cZDKCIFgbuVpnf3szQvq4w": {
    "date": "2/27/2018",
    "text": "From the moment we walked in, it felt off.  Cheap! Tacky! And inferior.  Horrible bright lights, tables with chips of paint, tacky tacky.We came for fish and chips !It was disgusting horrible frozen cardboard some sort of cheap frozen fish ~ mushed batter not crispy! Greasy gobs of batter, fishy frozen fish!!  Mushy peas tasted like green chalk and rather conspicuous as to the consistency??? And mushy peas  were cold!  Perhaps they actually shaved chalk in to them.Chips were soggy frozen tasteless doughy yuck.Tartare sauce right out of the plastic tub from cheap food purveyors... when i asked the server if fish soup was creamy , the server said soup was more watery and kind whipped around???WORST FOOD IN LONDON.  Really cant call it food!Pig Slop comes to mind!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRnrpXVhoARcSgqSQMjkdw"
  },
  "3wXBPnPpmyNDbBB-EWfBaA": {
    "date": "7/1/2018",
    "text": "I heard this was the best fish & chip in London. It was just not good. So disappointed in every single thing we got. If this was the best in London, I'm sadly ready to go home.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tkmcct0H51dR2wT7tzp60w"
  },
  "T1AwecdLICGjA-CBPosEhA": {
    "date": "1/19/2018",
    "text": "Not sure if it was an off night for them. But, the fish and chips were flavorless just not good at all they just tasted like oil. The service was painfully slow and the woman kept putting my card backwards so the chip reader couldn't read it and she kept telling me it was declined and giving me a judgey look Until I told her that she was putting my card backwards and then it worked fine. In my opinion you are better off going to rock & sole. Since the food, service, and price is much better and they know how use cards with a chip on them.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wHWaakylsllfhuXhHCLKDQ"
  },
  "rQqkVGBBDWiHzumV61IB-g": {
    "date": "12/17/2017",
    "text": "5 stars for fish and chips! Some of the best of London... the fish is fried fresh so sometimes you may have to wait a bit for your order. Huge portions of fish and chips. Definitely no need to order a large side of chips since the regular is big enough.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6nQpHQbfdl-DZTFqqRHgtg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Some of the best fish and chips in London!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6nQpHQbfdl-DZTFqqRHgtg/o.jpg"
      }
    ],
    "user_id": "4NS07u2kxLjKcVLmGm7Sdg"
  },
  "EQ26J3IF_SiEVrlzcXhEgA": {
    "date": "7/4/2017",
    "text": "Hey you can't got wrong with these fish&chips and brews. I first saw this place on the Travel Channel and boy it doesn't disappoint. The cost is okay but real worth it if you are a traveler. No visit to London is complete without this place. After getting off my London cab, I got into this place for some dinner. They have a really nice selection that you can't find in the US or Singapore. Of course I ordered some side dishes and the good ol fish and chips. The portions are real huge here. Who knew? They put the chips first and then a large piece of fish. Of course I eat a lot and I got some side dishes. I am not very clear on this but I think they have clam fitters or something. Either way it's really nice. You can pick a nice brew here too if you are a beer person. Come by because it feels real good here.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Odc6CMAo8plVcl7uHuTjCg"
  },
  "6Rvu3JUe-rytnftskr27pg": {
    "date": "7/31/2018",
    "text": "We visited this place on the suggestion of our driver, as we were on vacation in London. In the time it took to place our order and receive it, a homeless woman came storming around the corner yelling profanities and two cars came speeding past the storefront at carriageway speeds. Although these are no fault of the shop, let this be an indicator that one should probably not sit outside to eat. There is very limited seating inside and it's very warm from the stove and fryers going. As for the food, there seemed to be a broad selection of fish prepared in a variety of ways. We tried a cod fillet with chips on the side as well as popcorn fish and chips. The fish itself was well done, served hot and crisp, but the chips were a disappointment. They looked and tasted old, possibly re-cooked, and no amount of ketchup could make up for it. If I'm London again, I will likely try another place for traditional fish and chips.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2a1rHtrOXxaM8QPI587iA"
  },
  "Ls0D62SEz7v8iFgTlGn0MA": {
    "date": "2/3/2017",
    "text": "Pretty good takeaway fish and chips here. They were out of a lot of items by the time I came here, such as the goujons and some of the many different kinds of fish they have on their menu (Friday night, the lady at the counter had explained apologetically). However, after consulting with the cashier on her recommendations of what was left, I ordered the haddock filet and chips. The meal came with a soft drink for 9 pounds. The haddock was cooked really well, with a good amount of batter and a lot of flavor - really easy to eat. It was also a really large fillet - the lady at the counter had to fold the ends a little bit just to fit it in the takeaway box. The chips were a little soggy, though that may be because I took this back to the flat to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JfLgAC2P3IXfRHEvz6vZEg",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JfLgAC2P3IXfRHEvz6vZEg/o.jpg"
      }
    ],
    "user_id": "zYMklN4CCdTyUgmr5X8jAg"
  },
  "Te0tTzpwksKuuNJUJlgO1w": {
    "date": "9/6/2016",
    "text": "Editing my review:Some parts of my original review was a bit harsh, making some edits:I went because it was a close walking distance from my hotel.  It was my first time in London and loved the fish n chips.  Group of friends flew in a few days after me and I wanted them to experience some good fish n chips so I took them to Seashell. The service was horrible. The girls working behind the counter are miserable, rude, and gives you attitude because they seem to hate life. I thought it was just our group they were rude to, but it was aimed at everyone. Want the soda can you paid for? \"wait til I feel like giving it to you\". Condiments? go grab whatever is left yourselves. We had some questions on the menu items which they answered, but they were just short and quick as if they were annoyed by us and didn't give off a friendly vibe. Food was Decent. Love that they're all in take away boxes so it's just easier to eat out of.  The servings are generous, there was no way for me to finish everything. The fish had the perfect amount of batter and the chips were crispy and fresh. I would've enjoyed the food more if it weren't for the bad service.",
    "rating": 1.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "wbe3nWYyjwaw_bgebBBaQA"
  },
  "5b3a9BU2sw1mqxKz7lly5w": {
    "date": "7/13/2018",
    "text": "Fantastic upscale fish and chips! Giant room sized fish acquarium with great wine selection",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZ5fDeIj_STyMMBtgNz5iQ"
  },
  "B_pGxJYFUMpWYQE4lxUUhA": {
    "date": "7/22/2015",
    "text": "The place to go if you want to try proper Fish and Chips. The fish was cooked/ fried perfectly. Hey, I don't even like fried food but I had to try fish and chips at least once. It was perfect and delicious- the chips were yummy as well. They give you the option to order at the counter which is much cheaper and quicker, or you can sit down to a nice meal. It's your choice, bro.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "TPNPJ8Gsnj4Mzzg3yWAv3w",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod with chips!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TPNPJ8Gsnj4Mzzg3yWAv3w/o.jpg"
      },
      {
        "img_id": "uMnkuozIyTv4M-ZRyeRZsQ",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Beer!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uMnkuozIyTv4M-ZRyeRZsQ/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "gUpb1lT30x9loAwJY4CKWw": {
    "date": "7/28/2016",
    "text": "Just had a Fish n Chips (or Chipee as the locals call it) lunch at this famous London spot. They are known for serving up the best in the city. I found the Scampi to be the best on our table. This place certainly lives up to its reputation and service was impeccable!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Uu389wpMc-F8UDSS3iFEgA",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Uu389wpMc-F8UDSS3iFEgA/o.jpg"
      },
      {
        "img_id": "Dq4_gI4wTxq65-OalwZjjw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod bites",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Dq4_gI4wTxq65-OalwZjjw/o.jpg"
      },
      {
        "img_id": "wgDI767pA3S3ZwgBA0-TYw",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. Cod",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wgDI767pA3S3ZwgBA0-TYw/o.jpg"
      }
    ],
    "user_id": "z_5ZNGoqbVl4cPDQN3GAnQ"
  },
  "A7AbRCUXPJJmFAFUdZTh_w": {
    "date": "6/23/2015",
    "text": "We all know Fish&Chips is an English staple. A must-have for any visitor traveling to the beautiful city of London. But how do Londoners feel about this popular dish of fishy goodness?--*read with a British accent for full effect*\"Yeah, I like Fish&Chips a lot. When you get it done right, it's a real treat. The chips need to be crisp, yeah? And the fish needs to be fresh so it'll be soft and flaky on the inside. Yeah, then it's pretty much the best thing in the world.\"\"Eat it outside, mate. You have to eat it outside. Fish and Chips is a happy food so it makes sense to enjoy it out in the blue sky. Did you know that Fish and Chips was one of the few foods not to be rationed during the Second World War?\"\"Oh I like it a lot with Mushy Peas on the side. I am not even sure they go together that well but it just seems right.\"\"Definitely use salt and vinegar, and maybe some lemon. Some places charge a little extra for tartar sauce but salt and vinegar is always free.\"--So where is your go to place for Fish and Chips?--\"Seashell on Lisson Grove, for their massive portions.\"\"Ummm.. I think I like Seashell on Lisson Grove. Their batter has a good crisp.\"\"Seashell on Lisson Grove. It's a tad expensive, but totally worth it.\"\"I'm gonna have to go with Seashell on Lisson Grove. You can take it out in a box and eat it at regent's Park on a good day.\"",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PcSt7ahEfGVgkuel9jNRnQ",
        "caption": "Photo of Seashell of Lisson Grove - London, United Kingdom. it's gigantic. share this happy food outside with a friend!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PcSt7ahEfGVgkuel9jNRnQ/o.jpg"
      }
    ],
    "user_id": "ZSUg9VNz150bLHEYGc6GQw"
  },
  "mLD7QOHzUDFSq2jkv5LNlw": {
    "date": "12/4/2017",
    "text": "The fish and chips were so hot and juicy. The service was amazing and the price was great. Love this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fYbx0IdSgRDMiJXainS1ug"
  },
  "m2sBC77jJIrWXdvn9qxfvg": {
    "date": "10/16/2017",
    "text": "This restaurant serves the perfect piece of fish. It has people constantly coming through it's doors which in itself is a great recommendation. I can only review the counter service side of this establishment as we had take away. But, if the quality of food is any indication I'm sure sit down part would be great too. Although there was a line the service was very fast, very courteous and friendly. We had the cod, chips & whitebait. The fish was firm yet very moist. Not greasy AT ALL. Whitebait was also cooked perfectly. Lots of crunch, not greasy. Chips are usually not my thing but these were all but finished by us...that's really saying something. This restaurant is SO clean. It seems they take great pride in operating a tip top restaurant and it shows. We'll make this one of our regulars for sure!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-jvA8hwCUF9db07sKvOXQ"
  },
  "3ncluUSTL2xqUDf5zklF3g": {
    "date": "6/27/2009",
    "text": "Back in the 70s, when I was a little 'un...this was said to be the best Fish & Chips in London and the queues stretched down the street most evenings. Then, at some point later on, it lost its status and ever since it seems to have been forgotten apart from, well, the people who haven't forgotten it and there still seem to be plenty of us plus lots of taxi drivers.It went through a rocky patch, quality-wise, a few years ago, but recently its been getting better and better....almost to perfection.The fish is delightfully fresh. The batter light and golden. The chips chunky and tasty. The portions nice and generous and all the extras I've tried, like mushy peas and coleslaw have been top notch. I'm referring to the takeaway, which also has an unfriendly stand-up eating area and a few grotty tables on the street. If you can, take your goodies home. They'll give you a good box if you ask them and it helps retain the heat.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3Z1B6Z3CuXO8XXE8ri5gdg"
  },
  "YTL6WQCLB0afX5_REOKjZg": {
    "date": "11/28/2008",
    "text": "Definitely the best fish & chips in London! It's not fine dining, it's not asian-fusion cuisine nor mediterraneanit's good old fish & chipsand done very well!The restaurant is quite basic and informal however you should be going there for the food! Great for a lunchtim meal - go for the cod, chips and mushy peas - all you need! Real comfort food!Love it!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wjHMJ2TaZ4PbMkJMJqNfLg": {
    "date": "7/17/2010",
    "text": "At last... Sea Shell has re-opened after their refurbishment- decent fish and chips that you don't have to drive to coast for. Not a lot to say about fish and chips, they are either amazing or awful, Sea Shell has never been anything but amazing every time I have eaten here...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PTHVoOkGUyh1XoWSxuWBAg": {
    "date": "1/21/2009",
    "text": "This used to be the go-to place for fish and chips in London when I lived up the Edgware Road but having gone back there recently it was just plain disappointing. The chips are beautifully chunky but no longer crisp, the fish is bland and served in flabby tasteless batter. One regular told me you had to go on a Friday if you wanted good, fresh-tasting fish, for some reason he reckoned it's not so good the rest of the week. For me, it was miles away from its heyday.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ph7YqjVrt9Xp6iDZwen1Fg"
  },
  "iICUiJnwkZexivJKB_yVlg": {
    "date": "9/3/2009",
    "text": "Excellent fish and chips here, probably the best in London.  I used to love the haddock and chips but being a vegetarian now, I just have the chips which are perfect.  I usually don't care for the mushy peas but I'll eat them from Sea Shells as they are very good.  Unfortunately, they had a fire recently but I hope they come back!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0fLHpbQnC1P86Ykbp4poxw"
  },
  "GsMZBoYI8mDE9QAFffuyqA": {
    "date": "12/1/2008",
    "text": "Apparently the Queen gets her fish and chips from Sea Shell, one of London's most famous fish and chip shops in North West London It would not be surprising because it has such a great reputation. You have not tasted fish and chips until you have tasted the delights of Sea Shell. The chips are crisp and chunky and the fish is always cooked perfectly and the batter is never too thick. The calamari and scampi are also very good. I have eaten in the restaurant but when I lived locally I regularly used the takeaway service. I have never been disappointed with the food and I can't wait to go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ibGwYz5b6zO5FA03b2EBxA"
  },
  "Yh2g_fDz4qSzUeXKSf5DUw": {
    "date": "2/16/2012",
    "text": "Amazing. Went here for birthday fish and chips today, the first I have had in over 6 years, and they were perfection. I have not wanted to taint my tastebuds with substandard fish and chippy food, but this place made the wait worth it. Great service, friendly, really upmarket without being showy, clean and neat and far from the days of newspaper with the same if not better taste. The best fish and chips I have EVER eaten.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vuCjt1XlltPn6sJN6rgLFQ"
  },
  "_rfEnF3h2VtGz2m_RG9FnA": {
    "date": "3/11/2011",
    "text": "this place is back to business. everything tastes as great as it used to prior to the refurbishment. def recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qq7ee48OwL1U2dV77dPUSQ"
  },
  "LwdnEvNC7diGvoHGrcnwAw": {
    "date": "9/10/2011",
    "text": "First time to London and wanted to find really good fish and chips. Read about Golden Hinde which was my first choice, but they were closed when we arrived. Ended up going to Sea Shell of Lisson Grove. The fish was huge and tasted light and fresh. The chips weren't as good since they were a bit hard and fishy-tasting. Overall it was good so a week later we went again. We heard another customer complain that he bit into ice in the fish and we were really surprised. Is the fish frozen? Then we got our order and when we cut open the fish, it was leaking a liquid, like water, as if they were fried when the fish was frozen. I suspect they didn't defrost enough fish and were cooking the fish when it was frozen. I was completely turned off and now would not recommend this place to anyone. Too bad I didn't have a chance to try Golden Hinde to compare.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_hlWlbCd_6DJ_88iAkj0g"
  },
  "zS3t55N0x7dZsDiMJw3Qpw": {
    "date": "2/17/2008",
    "text": "A great fish restaurant and maybe the best fish and chips restaurant (with take-away) in London. Always a line of people waiting, some local and some who clearly come just for the food theer (cab drivers). The setting and the crowd have personnality and it is simple and good, and frankly quite cheap. A great place to go if you visit the market next to it during the weekend or Alfie's, the antiques market.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMe7MW1M-4A1iEhySt4wpA"
  },
  "yGvhH3qXlCZ8kM5JMCs8Eg": {
    "date": "1/19/2009",
    "text": "Wonderful fish and chips, a rarity these days. Average £12 for two. Generous portions, cooked to perfection - what else can I say. There is a restaurant out the back, pretty basic decor, friendly staff though, but felt quite crammed in.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4n72TLhKDo7lMly5jvT3ww": {
    "date": "3/7/2011",
    "text": "Scrummy for the tastiest Skate that I have ever eaten for a takeaway and the chips are half bad either!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "54dpBDghgsxvAoctDZHH2Q": {
    "date": "1/21/2008",
    "text": "This is definatly the best fish and chip shop in london!i have never eaten in the restaurant..but im a regular at the take away!There is always a line of taxis outside and where ever taxi drivers eat its sure to be a great take out!!There is an extensive menu of everything one could possibly want from a fish and chips take out right to dover sole, if thats within your budget!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "us_4gqvkzEVIStdrh0Wj4Q": {
    "date": "11/14/2009",
    "text": "I have been to the sea shell many times for take awat fish and chips and I can only say it is one of the best in London. It is up there with the two brothers. The big difference between the sea shell and other fish and chips is that these are fresh. It costs a little but more but the taste is excellant. When you gt fish and chips here you understand what good fish and chips should taste like. It is a shame there are not more around London like this instead of those awful Kebab or CHhicken places. I must go to the restaurant next door one day. Well worth a visit.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4Vxvd4qMTFFpEGPW4Tizmg": {
    "date": "12/2/2009",
    "text": "Very good chippy. Has been for about 30 years. My dad used to tell me that Prince Charles used to get his fish and chips from here. Now I've no idea if that is true or not, but the quality of the food is such that it is plausible. Which says enough really.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}