{
  "YOyHXkjcQD_WOgT0udJLSg": {
    "date": "7/3/2007",
    "text": "Have only been to a couple of these, but the food does taste very authentic. Not a great lover of the long tables but hey each to their own, there's always a nice buzz and it's always very friendly and welcoming.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "u8uMIAy70pbigInD1MF36g": {
    "date": "1/20/2009",
    "text": "I like the service, I like the food (more about this in a second), I like the wine - good value if you order a whole bottle. A really nice place. One proviso - although my starter was delicious, my partner's choice for mains really brilliant - my main course was totally tasteless and not very nice to look at. Steer clear of No.76 on the menu is all I can say.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lQa4-hDs3XwRZPlbczjH1w": {
    "date": "1/20/2009",
    "text": "wagamama is a chain of asian inspired noodle restaurants. I have eaten at the Wigmore St Wagamamas for many years. I worked just around for corner recently, so i would usually visit once every week with a work colleague. The restaurant is always clean and tidy, and the staff are really quick in getting you in and seated. Everybody sits on benches, it sorta remins me of my old school canteen, but Wagamamas is much more posh. The food is really nice. I have not yet tried a dish i don't lilke. You have lots to choose from, and also lots of lovely dishes to start with too. The prices are really cheap for the quality of the food you get. Located near Selfridges, so great for a place to stop for food after a big shop.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "SYyOcPxULTeIsWYcUzARuw": {
    "date": "9/30/2009",
    "text": "Love this place!!  Can't wait for it to open up in Washington DC in 2010!  I used to go to the London Marylebone one all the time when I lived there.  Fast and so good.  The juice drinks are amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcIefrnccv1MNbdQtWZ0jQ"
  },
  "CutbVm3IsUc7-sNlYWa9aQ": {
    "date": "10/20/2009",
    "text": "Love this food and the restaurant layout. Great, healthy food at a reasonable price. Perfect for a lunch hour meal, just as long as you get there for midday. After 12, you may have to queue for a short time. Salmon Ramen and Katsu curry are particular favourites. Also now do take-aways. Highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UEJ1QOfeVAQsHr8jhhUG4g": {
    "date": "4/4/2013",
    "text": "The layout of the restaurant looks like a cafeteria.  Salmon was fresh but the ramen I ordered  lacked flavor.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QTDixc3JTsTrd7pya7metg",
        "caption": "Photo of Wagamama - London, United Kingdom. Pork ramen",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QTDixc3JTsTrd7pya7metg/o.jpg"
      },
      {
        "img_id": "SW0N0kk2E9s_cdCW7SD1JA",
        "caption": "Photo of Wagamama - London, United Kingdom. Mandarin chicken salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SW0N0kk2E9s_cdCW7SD1JA/o.jpg"
      },
      {
        "img_id": "MeRBOI2HwAXV5ggYoXT9zA",
        "caption": "Photo of Wagamama - London, United Kingdom. Cafeteria style tables",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MeRBOI2HwAXV5ggYoXT9zA/o.jpg"
      }
    ],
    "user_id": "GSypxq4q6fAW84xcGlRBWg"
  },
  "JEoXYoyXsjrIuYMQBgZJ8w": {
    "date": "7/25/2014",
    "text": "Pad tai noodles were Al dente and tasty but the actual flavor of the sauce it was cooked in was very weak.The duck gyosa were very tasty though...I do wish they had been pan fried...but excellent flavor",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ht8iGitRu8kynEubcIhsTQ"
  },
  "bDx618psAUwOjTr0wKs6uQ": {
    "date": "6/14/2012",
    "text": "Oh, and the one in Sydney, Australia in the big Mall , 3rd floor? is very good! Convenient if you have kids and need to grab a bite!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfZ1vqGIX31AmDFa0swSRw"
  },
  "imJNKWM8dZrP5ZbmVG15jQ": {
    "date": "3/12/2015",
    "text": "I love this place!! Great value for money and the chicken katsu curry is to die for!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rbitb_oNoqxMcuPaEs-BmQ"
  },
  "Yp5EL9nNVWEsnsOZa8xikg": {
    "date": "9/28/2014",
    "text": "Every time I am in London, I make a point of visiting  a Wagamama location.However, on this trip, I was extremely disappointed by what I was served at the Wigmore venue. My side order of Yasai Gyoza came as a partially cooked assembly of dumplings that were barely warm and felt rubbery in taste. Had to send them back to the kitchen to have them remade.On the other hand, my order of Saiben Soba was an above-average preparation, though still lacking in essential flavors. On previous occasions that I have visited this location, I have had a much better vegetarian ramen served on their menu.I am hoping the food will get improved and I would like to return soon for another tasting.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "11W23tW4_2vAskC-CVoroQ"
  },
  "nXVze3Pi7L3_QkQWfTtzvw": {
    "date": "6/16/2010",
    "text": "Wagamama seems to be a bit better than OK, but I'm not ready to call myself a fan. . . so this is probably more of a 3.5 star place, but I'm in a \"round down\" mood today.The set up is somewhat unique. There aren't a bunch of small tables or chairs, but rather a number of long tables with built-in benches. They remind me of the cafeteria tables in school, except the benches are broken up (you can fit about two people per bench segment) which mean it's easier to sit down and get up than those terrible benches from grade school that ran the length of the whole table.The space is nice. The kitchen is open. Service is OK. They seem to use a team approach, rather than having a dedicated server for a table. This lead to someone trying to take our drink orders after we already placed our orders, and three different people trying to take our orders at one point or another. There are pluses and minuses to this approach to service, but in general I'm not a fan.The ginger beer was tasty. The food is...well, not as good as I'd like it to be. My chicken katsu curry was just kind of bland, which was disappointing. The panko-breaded chicken was good, but the gravy definitely fell short. I tried another chicken dish that my friend ordered, and it was also a little lacking in flavor.The dessert was pretty average. I tried a bite of the apple & sweet yam tart, and it was a bit different, but interesting. I'm not a big apple dessert person so I'm not sure I'd order it myself. My foodie friend who ordered it didn't like the sesame seed element or the vanilla sauce it was sitting in (which turned out to be melted ice cream, according to our waitress). My baked vanilla cheesecake was OK. Nothing memorable.They bring out the food in a rather willy-nilly fashion. You might get your main dish before your starter, and your main dish might come out minutes before anyone else in your party gets anything, so be prepared to eat in front of your friends or sit and watch them eat.I'd probably eat at a Wagamama again if it was convenient, but I wouldn't go out of my way or wait for a table.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "JozaD0E6fVMFnWL7DTaTCw"
  },
  "KOaSXj5tRId3TYULS8Vz_A": {
    "date": "9/24/2011",
    "text": "This is not a Japanese food by any means, but it should be ok if you would like a change..... feeling like something oriental fusion or Asian exotic.... Honestly noodle quality is awful. Noodle soup tastes miserable. But gyoza is quite acceptable and crispy enough in a good size. Salad is what could attract the lowest mark from people if served in Japan.  I have never tried rice-based dishes as they look like a takeaway from Mars, or Moon at best. However I go and eat at Wagamama at least once a week in Spitalfield as they are reasonably quick and the service is efficient.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jpOcg0bVwcxhGLnqrmb_hA"
  },
  "KEqJ99Qnkgl_G6XW8NWdgg": {
    "date": "1/3/2012",
    "text": "Wagamama is a great choice if you're looking for ramen, chicken or rice dishes...personally, I was looking for ramen because of a sore throat, and this was just the ticket. I got the basic ramen bowl, which comes with chicken and some veggies. It was yummy, though the chicken had a bit of an odd taste/texture. Overall, not outstanding but perfectly satisfactory.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7C7vXViz5T8x5kIvqvga6A",
        "caption": "Photo of Wagamama - London, United Kingdom. Chicken ramen bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7C7vXViz5T8x5kIvqvga6A/o.jpg"
      }
    ],
    "user_id": "18jiMCoPg-IeAa55GYg8yg"
  },
  "C5I2V1TUe_827AihrhLGqA": {
    "date": "4/21/2010",
    "text": "I love Wagamama on any day.  Their menu is fantastic and the vegetables always taste so fresh.  I had the Yasai Cha Han (Rice, veg and tofu) it was very tasty.  The juices and drinks are a bit expensive, but, the food is cheap and good quality so you can't really complain. This Wagamama is quite small, and it might be worth walking to the bigger ones as there may be a queue when you get here. The only problem I have with Wagamama is that it is so noisy as everyone sits together. The service was very good, fast and friendly :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YexiwImohHNGPYUKYVaPHw"
  },
  "ZTx6lahSK060tba-UokCrA": {
    "date": "10/13/2011",
    "text": "Honestly, I don't think I really get Wagamama. [If you're looking for passable ramen, avoid avoid AVOID]. I suppose if you're looking for something efficient, with decent vegetarian options, it's perfectly fine. But it's not particularly tasty or a good value. Service was nice.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2Zftz-29j8_ttTV8rCG8Ow"
  },
  "Jghr8EPvF3e5JWkZZkEWGw": {
    "date": "6/12/2012",
    "text": "The Wagamama restaurants always have good food even though it's maybe less than traditional - never had a bad meal or experience here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9PsqcDslFktroHy_gSHpA"
  },
  "NLe_sYXFNXSFTxJBL30w5Q": {
    "date": "1/6/2010",
    "text": "Oh Wagamama.  You are one of the things that I miss most about living in London.  Whenever I would ask my (then) boyfriend where he wanted to go for dinner, he would always say Wagamama!  I would usually get the fried rice with spring rolls (unimaginative I know, but they were so good!) and the pot-stickers.  The dipping sauce for the pot-stickers is so amazingly good that I would gladly pay for jars of the stuff to dip everything else I ate in!If you've never been here before, here's how it works - You don't sit at individual tables.  There are long tables at which everyone sits, although they try to spread you out a bit.  There is a shelf under the table to put your coat/purse, etc.  When they take your order, they will put it into this little pda looking device and then write the number of dishes you ordered on your paper place-mat.  They warn you that items will not come out in order (starter, main, dessert) but rather they will come out as they are finished.  So sometimes you will get your starter after your main, but that's OK because they are ridiculously fast and the service is friendly and happy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNqeYFG_-g9SWt8wfd66Kw"
  },
  "TboRRl9ejA67rEL4tbBFUw": {
    "date": "7/27/2011",
    "text": "A great place for a quick lunch (unless there is a long line, which there usually is around lunchtime). I know everyone is obsessed with the Chicken Katsu Curry, but I prefer the Ginger Chicken Udon noodles. Don't get dessert here though. For good dessert go to Black & Blue across the street.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SWNkgZL1cJTek7odyJYkOg"
  },
  "6kK79miTWKv3QpiUBPrjKA": {
    "date": "6/25/2012",
    "text": "My uncle used to work here and so we'd often pop in and have lunch. They're foods are definitely quality and very rich in flavour. It's nicely presented and looks delicious. Definitely recommend this place for everyone.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1nHzowmbCoxk4tP88VIjLg": {
    "date": "5/29/2011",
    "text": "Wagamama was a interesting dining experience. There was a long queue lined up outside and waiting to get in. The food is really good for the price. I had a bowl of udon soup and Katsu Curry, breaded chicken cutlet with curry. I hope to make a return to Wagamama during my next visit to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xd-_yPe-2FnNxF1yh7PTmg"
  },
  "B80RTHsiM7r8DWDfSEvpeA": {
    "date": "2/5/2009",
    "text": "I like coming to Wagamama, cos lets face it you know what you are going to get. I often visit the place because i get cravings for the Katsu curry ( i very rarely order anything else). I visited this branch the other day and ordered my Kasai Katsu Curry (the veggie one) along with my Duck guyoza. Well my starter came at the end of my main course - how hard can it be to deep fry some duck spring rolls??? My curry was dissapointing - the aubergine was mushy and in stark contrast the sweet potato was rock solid. I tried to attack it with a knife, and when i couldn't i passed due to the possible repurcussions on my poor digestive system. I think everytime i visit Wagamama my heart falls slightly, it has turned into something great to something mediocre, and everytime i crave to get the first experience of my lovely curry. Even my apple and lime juice lacked pizzaz. Hopefully will buck its ideas up soon. The staff are always good, so there is a saving grace!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ipzusNzCIio8sGvoCuMcSA": {
    "date": "7/6/2007",
    "text": "This Wagamama was my regular lunch and dining location in 99, when lastminute's offices were still on Oxford St. I loved the concept from the start and it never let me down. Since then, Wagamamas have sprawled, but this one remains my favourite.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oxUNDpouxH8Y02yG6pG-w"
  },
  "nbDcYfrd4jTuttfJnzR8lQ": {
    "date": "8/25/2009",
    "text": "Wagamama a delicious placeThis restaurant was clean, the staff were friendly and the food was reasonably priced. Furthermore the food arrived quickly. I would recommend it to anyone who enjoys japanese/chinese/oriental food. The only problem was that our food arrived at different times and because Wagamama adopts a cantine style of eating it can get quite noisy and busy at lunch and sometimes you have to wait for a while to be seated because its so popular! But on the whole a really great place.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vCkmP3Uk2pabIK8hGNKiew": {
    "date": "1/2/2012",
    "text": "Love all the Wagamama's we have been to in London.  Great choice for tourists looking for good, healthy food that is reasonably priced.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-KfM_G62uu71cUdOpF7CIQ"
  },
  "U6LCO0bYvnKuYNrftZvZRA": {
    "date": "5/10/2009",
    "text": "Gesundes fast food geht nicht? geht tatsächlich doch, wie Wagamama eindeutig beweist. Die Dumplings und Scampis als Vorspeise sind ein Hit, schade das Wagamama es bisher es nur bis Kopenhagen und Amsterdam geschafft hat, Hamburg wäre auch ne Interessante und lohnenswerte Location",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hqaTN-xkUH9xYqnbkJ9USw": {
    "date": "8/20/2018",
    "text": "With Wagamama, you know what you get and if you like it, you will like it. This particular location is quite noisy as it is located a bit underground, but the food is excellent and the staff was very friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rob2vx2e7CrpV-sBu8Euxw"
  },
  "T-c6zat6AsSdjBdJTW3NAw": {
    "date": "10/10/2018",
    "text": "Disclosure, I am a former chef for 20 years. Had initially been excited to go to a wagamama and visited another location a few weeks ago and was disappointed.  This new location just opened up right next door and it looked so nice that I thought I'd give it another try. Had the Duck dunbun with kimchi & the fried squid but I was still left feeling the same. As inviting as their restaurants and ads look, the food is below par in this arena.    It's like the McDonald's burger on a a picture vs. what you actually get, just generic. The duck had no flavor and there was not much of it, they'd used radishes as filler of the kimchi and the bowl was just filled with a big amount of rice. The fried squid was ok but the dipping sauce was just syrup with some chilies. Completely unimpressed and will never come back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AhnBWnX9YmgqQ80HEK0p7g"
  },
  "vB9fq_JvLLfe5zRXe-ByZw": {
    "date": "6/12/2018",
    "text": "The cauliflower appetizer and the squid takoyaki inspired dish were mouthwateringly good and quirky takes on traditional Japanese flavors. I've ordered the katsu curry and found it to be pretty good, but not as amazing as the appetizers were, but overall some of the best food I've had in London. Service is fast and the restaurant features a chic and modern ambiance.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U6t2RbvuThODdlSM2ytE2w"
  },
  "E3kf0zUNlzw86I6S_z02gg": {
    "date": "12/29/2015",
    "text": "Wagamama is A-OK. It's a good take-away option. It's nothing special. To all you silly people that compare it to your best ramen in Tokyo, stop being silly. You're silly. I'll stop hating on other reviewers now. Anyway, this place isn't bad at all, but as I said, nothing special. The edamame and veggie pad thai is pretty good, and the veggie ramen is ok, could use a little more flavor- but couldn't most veggie ramen? Anyway, I still would like to try their curries. Order Wagamama to go and take it home and watch a movie. Happy day.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "cOSxegiQDIm84-AthvkgoA",
        "caption": "Photo of Wagamama - London, United Kingdom. Yasai ramen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cOSxegiQDIm84-AthvkgoA/o.jpg"
      },
      {
        "img_id": "JJUhpxv_M4PZXeFd6us7EQ",
        "caption": "Photo of Wagamama - London, United Kingdom. Yaki udon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JJUhpxv_M4PZXeFd6us7EQ/o.jpg"
      },
      {
        "img_id": "OOp1O8YFch8ekMxTDIj3lQ",
        "caption": "Photo of Wagamama - London, United Kingdom. Vegetable pad Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OOp1O8YFch8ekMxTDIj3lQ/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "cvfGldFgVt30pMpEg4OnYA": {
    "date": "11/20/2015",
    "text": "Oh Wagamama.....My love. You're a bit overpriced and really not authentic but I don't care. I have so many good memories of eating here with classmates while studying abroad so I had to come back tonight while on vacation! This food is very similar to PF Changs here in the States which means very good albeit a bit costly. I had the Udon Noodle plate which was about £9 but was a rather large portion a full of chicken, shrimp and scallops. It was delicious and filled me up which is all I can ask for. Service was great as well, the food came out quickly and we were checked on a few times during the meal. Finally the space (like pretty much all Wagamamas) is large, simplistic and stylish. There is a lot of choices for great food in London and Wagamama is definately one of them!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7hpAqDkpVXFXNMLiGg5v6A"
  },
  "T45o9aVdMpc_Tid7bph2vA": {
    "date": "11/3/2015",
    "text": "Usually pretty good in terms of food but service at this location seems to struggle a bit, for instance your drink or your food being ready and sitting on the counter but then it doesn't come so eventually when the food arrives, it isn't very hot.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7QuSTleFEnUE-oEj1aLWQ"
  },
  "MuIzDMnHc2c0L9VZf0OiMw": {
    "date": "5/31/2016",
    "text": "I used to like Wagamama then I thought it was rubbish then I ate there a few times at Heathrow T5, and am once again a fan.The menu was quite stale for a while but they've added new items in the past few years during my absence and am now quite spoiled for choice.  Their teriyaki chicken donburi bowl is pretty tasty, as are some dumplings and the ginger chicken udon. The service still annoys me tho",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "b91EsoJDLUTlm4BckwQWQA": {
    "date": "1/13/2013",
    "text": "You should go to Wagamama if:- you are hungry and want something quick to eat- a hot bowl of cheap ramen without leaving your neighbourhood (or borough?) It's a big chainYou shouldn't go to Wagamama if:- you want authentic Asian food- you are a Ramen snob- you want to have a quiet meal (it's very loud)That's my opinion about Wagamama. P.S:The seaweed salad was delightful, the tea stained egg was terrible, and the green tea is free.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bzIbwpknMwpOI0C24I_ijQ",
        "caption": "Photo of Wagamama - London, United Kingdom. Chicken katsu curry (weird shaped rice)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bzIbwpknMwpOI0C24I_ijQ/o.jpg"
      },
      {
        "img_id": "7301jw8W-APniegw05TQAw",
        "caption": "Photo of Wagamama - London, United Kingdom. Seaweed salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7301jw8W-APniegw05TQAw/o.jpg"
      }
    ],
    "user_id": "sY_uz6P1sux3tKt1TEGqjA"
  },
  "UjeDbzQkTyqoCD0QzN6Suw": {
    "date": "10/3/2015",
    "text": "Met my husband here on his lunch break with my one year old daughter. Props to this restaurant for having two kinds of high chairs (basic kind and the kind that attaches to the table). I really enjoyed my vegetarian ramen, however my husbands pad Thai was \"just ok\", nothing special. The main disappointment here was that the food does not come out together so my husband was finished by the time my meal came. The staff was friendly and accommodating and the restaurant was very clean. I would go back here for some ramen but probably wouldn't make a special trip for it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3T-3tMg1FAWjUxrljCoXgw"
  },
  "phhByZbLswr-TYORWTYvYA": {
    "date": "6/26/2016",
    "text": "I ordered delivery. The process is easy and the Deliveroo people where quick. I wasn't very impressed but this probably isn't the food you should have delivered. Way better in person!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ebCSRDACPdK9KERDWsZeMA"
  },
  "sbyOL3TRWJ6m9qDiNHan9g": {
    "date": "3/13/2015",
    "text": "While independent Asian restaurants are always my preference when I want some chinese food it's quite comforting to know that I can find a pretty good chain all over London that I can enjoy some of my favourite dishes. I am known to love a good chicken katsu curry and this one did not disappoint. The venue has a nice modern vibe and the food is really tasty. The desserts are also quite good and you know what they say... There's always room for dessert. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "--M77BSnjScXH8UkFzyhlA",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/--M77BSnjScXH8UkFzyhlA/o.jpg"
      },
      {
        "img_id": "3HfGx4amtDrrwfaaPdz6Lg",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3HfGx4amtDrrwfaaPdz6Lg/o.jpg"
      }
    ],
    "user_id": "YvDd_HOaHJGYUYMq_H2imw"
  },
  "LI8o5l6uesxK3_Ku69SuEA": {
    "date": "7/17/2013",
    "text": "Wagamama is my favorite restaurant in London! I love the fact that you sit cafeteria style not at individual tables.  The food comes out hot and in the order that its is ready!  If only they had a Wagamamas in Las Vegas, NV!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JOxVd7V2VMelE1qw-Rauyg",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JOxVd7V2VMelE1qw-Rauyg/o.jpg"
      },
      {
        "img_id": "sGpZ5LY8aBoHoQBzU1HgeQ",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sGpZ5LY8aBoHoQBzU1HgeQ/o.jpg"
      },
      {
        "img_id": "Oh6txvDQ98Ym8iCh-mxtTA",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Oh6txvDQ98Ym8iCh-mxtTA/o.jpg"
      }
    ],
    "user_id": "AQqOzSNf_5rmmOPxGgqSJw"
  },
  "5znNK5sZV9cbHi1VMkk_lA": {
    "date": "1/28/2013",
    "text": "I'm not totally over Yo' Mama humour:\"Yo' Mama so delicious she...erm....\"  I'm missing a link here, but point being: I like Wagamama.  And, hey - why wouldn't I?  Wagamama is reliable, it's hot, it's tasty.  I can't argue with the Waga-grumpy who complain that it's noisy, it's not authentic or there are queues: all of that might be true.  All of that, however...is not the point of Wagamama.  It's fast but not fast-food, it's hectic, it's efficient, it's lip-smacking, it's warmth-on-a-cold day (yaki soba!) or light-on-a-warm one (wakame salad!).  This location in particular, is a great oasis from the hustle-bustle of Oxford St.  Some reviews mention lines, but I've never had to wait here for a table.  Yelp note: I've heard rumour that some Wagamamas have started serving breakfast.  To which I say: I look forward to meeting up in the AM, Wagamama.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CkqmyV3UWUd70oM3F-PahQ"
  },
  "qMC4ii7nACKcehPY7pUT8A": {
    "date": "11/24/2012",
    "text": "It's a chain... I was sick during my trip to London, and desperately needed a heaping bowl of hot and spicy soup to run my system through its paces. After being rebuffed by two ramen places which had closed at 2 o'clock (I slept too long), we ended up here which has full service throughout the day.It's really weird because you can tell there is some authenticity in the menu (Wagamama is the brainchild of a Hong Konger), but all servers and line cooks are either locals or Eastern Europeans!Anyway, it was what I needed, when I needed it; I wouldn't come back normally but it satisfied me so 3 stars...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lb37hatAjI3fgHEh2lMNEw"
  },
  "i6tuhPCs2NzXNB8W_U3mMw": {
    "date": "2/15/2015",
    "text": "The pulled pork filling in the gyoza was an odd texture that I didn't really care for, but my main meal (I forget its name, but it was a chicken curry dish with coconut and lime) was quite tasty. If you don't like spicy, be sure to dodge the tiny red peppers in it :-)Our initial waitress was fantastic, but I think her shift ended, because the follow-up guy wasn't nearly as responsive. Overall, it wasn't a bad experience, but it's not a place I'd return to (my friend loves it though!)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZPZK8YWX6FdP0hVwybYdQ"
  },
  "GDnIAhIc3LTSxgeCxlEzsA": {
    "date": "1/26/2015",
    "text": "Good ramen, with a delicious soup that was nicely spiced and cooked. The meat was very nice and tons of flavours inside the soup. Served in a traditional large bowl even tho the chefs weren't Japanese they did a good job! Service was good came and sat us and greeted kindly, and gave us recommendations for the many dishes. The place kinda reminded me of a cafeteria abut like I was back in high school with an open style kitchen and long bench tables, but clean and homey. Would come here again to try something else on the menu for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sCBX5JT0WyHeXa_xDP3Qnw",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sCBX5JT0WyHeXa_xDP3Qnw/o.jpg"
      },
      {
        "img_id": "vKX8cxto2G-e_IBZMAkG6Q",
        "caption": "Photo of Wagamama - London, United Kingdom. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vKX8cxto2G-e_IBZMAkG6Q/o.jpg"
      },
      {
        "img_id": "Cu9qfQj_W4-TH1JQxEo6pg",
        "caption": "Photo of Wagamama - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cu9qfQj_W4-TH1JQxEo6pg/o.jpg"
      }
    ],
    "user_id": "eHaNR6IWBQTBeZy9IrfgfA"
  },
  "79nWL3hMwEoUBj7BXsNtsA": {
    "date": "12/29/2015",
    "text": "I was really looking forward to eating here but found the food and service very average. I asked if they had a gluten free menu and the waiter brought me the entire nutritional guide used by the restaurant. When I asked for some help he sent the manager who was helpful but the food came out as plain noodles with vegetables (no sauce). There were several people serving us and for a GF person that's unsettling as a lot can be lost from kitchen to table. This is definitely more fast food at higher prices.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "icsKqtfjENqIjhdWx9nOQA"
  },
  "QaX3e9kMDyph8pOSB5IEKA": {
    "date": "9/14/2015",
    "text": "I really hoped this place was going to be good, especially since it was the closest noodle place near the hotel we were staying. We just wanted something simple and close by and Wagamama was the choice.Unfortunately it was a bad choice!The ramen is the worst I had ... ever! And I had plenty of ramen around the world from Tokyo to LA to now London. My wife ordered the chili chicken ramen and I ordered the pork ramen. I really don't know what to say - it just didn't taste right or good and something about the flavors were just off. Oh right - there was no flavor! I ate about 1/4 of my bowl and decided I didn't want to eat anymore. And I was starving too!Not to mention, the extra cup of green tea I ordered never came (since I was drinking green tea to wash down my food) and in the end, I stood at the counter and waited for a good while to pay. It seemed all the servers were busy and just walked by me left and right. The place was busy but it wasn't packed house at all, since we went in the early afternoon. Maybe it was an off day for service and food?So my experience with service was slow and the experience with the food was just horrible. I would not recommend going there if you actually enjoy eating ramen. I'm sure whatever ramen you had before, it is way better than this.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HS72q60ChiBZt1KKyXlTvQ"
  },
  "WX-07LrdluqleLU0u7WKkw": {
    "date": "1/19/2016",
    "text": "Wagamama never seem to dissapoint. From milton keynes to london food is always good. Tasted most of their menu, top food is katsu curry obvious choice, and the grilled duck ramen bery tasteful. Im not too keen on spicy food but the firecracker is a big hit my mrs love that! All washed down with a large clean green juice! Starters is chilli squid hands down all the time!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJFIINyaLC0AbFlagyndaw"
  },
  "6vu7g9aw0lSwOTb1Dl69nw": {
    "date": "1/2/2015",
    "text": "Ramen soup stock is quite tasteless.  A lot of chili peppers and cilantro are added to mask that the soup has no flavor.  The ramen noodles are also a disappointment.  Do not order the ramen soup!!!  The cost for three dinners was almost 60 pounds...what?  For semi-fast food?  Not worth it.  There are so many better options in London!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pwmZrs6N26fOBwZcBHcLXg"
  }
}