{
  "hVHkpQP1WmPQOaCyw-7E1w": {
    "date": "4/28/2012",
    "text": "Stopped in looking for a quick lunch/brunch before heading to the pub for a football match. While the server was friendly and pleasant, they were basically out of everything and the coffee wasn't even that good. (and I don't ask for fancy coffee, just black and strong in a cup). The server was nice, but seemed confused by every interaction.There is a real parallel to an NYC diner style menu and ambiance, yet with a distinctly British angle. What I've not been able to get over is how, on a Sunday at lunch they can be out of nearly everything - no portabella veggie burger, no Pimms, no London Pride, no chips, no sparkling water, etc, etc - out of everything.So, maybe the food is pretty good, don't (and probably won't) know. Ended up going across the road to Byron for a great burger and chips.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qWyFxE4zftV_CdRMvYkMw"
  },
  "GGJQZ1--VEcygR0Q0Q5H5A": {
    "date": "2/13/2014",
    "text": "Had the English breakfast. 2 sausages 2 slices of pork 2 eggs and a potato hashbrown with a spoonful of beans. It's about 6£ coffee is 2£. Perfectly average. Quick kitchen. Nothing to write home about. Nothing memorable. Maybe it's a good deal cause there was college kids eating there. This place has achieved perfect middle of the road food and atmosphere. U should have no complaints. Other than how average it is.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVfeE1yt6Zsm3sdia2ZHCQ"
  },
  "gvSXHXca98KQLBkSTsYv5w": {
    "date": "5/27/2011",
    "text": "Atmosphere is a bit gloomy for lunch, though the lunch deals are really worthwhile (8£75 for a 2-course meal).The salad bar is attractive, and you can refill as much as you like.The wraps and other tex-mex stuff is generally good, but it's not the greatest place to grab a pizza. They're really small, and the dough is more like bread dough.Service is ok, nothing exceptional, but allright.The proximity of the tube station, the museums, and mostly, of the waitrose supermarket, make it really convenient.Enjoy !",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NWPw2mY-82hmNNJpp84R-A"
  },
  "-BLRWRUo5cUeXWul03c8Bg": {
    "date": "9/29/2013",
    "text": "Very average, would compare to an American Big Boy. They were understaffed, three waiters running around frantically trying to serve the very crowded restaurant(at breakfast time). Took about 15 minutes to get any attention from a server once we were seated. Food was ok but my kid found hairs on her toast and eggs, they gave it to us free.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lxqa0JxZmPuu44t1RHhhlQ"
  },
  "lDUDPJjv2T1CUcBdYr5gUQ": {
    "date": "10/5/2012",
    "text": "The first sign that a place is bad is when it's empty at lunchtime. My family was starving and this was close so I got dragged in despite my protests. The fish and chips were boring, thin and flavorless. And at £13, way too expensive for that quality. Bleh all around.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M2Bdj6qgYurSVTrb1MmQXg"
  },
  "zR27sqLI4-VZ5kMZ6YAQLw": {
    "date": "9/23/2011",
    "text": "My fish and chips were great! Though, it was my first ever fish n chips in the UK, so I don't really know what to compare it to, BUT it was fresh, just the right amount of crispiness...they put orange slices in your water...service is quick. Lots of things on the menu, pasta, and some group apps if you like. The loo is a bit far away though, downstairs...and it's also attached to the mall strip. Ambience is nice, very interesting feel. No pressure to finish quick at all...Though it can be a bit of a challenge to get someone's attention, but all the same, food is nice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CESIxRplQxxE0ruEXrrVSg"
  },
  "HuZvJm9Zpg6X-1jrc1QC0w": {
    "date": "7/6/2010",
    "text": "I'm a fan. Was here on my last night in London (Thursday night). Their menu was huge and service was prompt and friendly. I had the club sandwich and a side salad, which my server forgot to bring (that seemed to happen alot) but she made up for it by comping the salad. My husband had a cheeseburger, which was huge, and it came with a generous portion of well seasoned steak fries.I was also suprised to find that their food was reasonably priced - much less than the local pubs. Which was great because we had spent all our pounds and pence on souvenirs at this point!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "Gh7a3aAOlB2zMRocFzGEZg"
  },
  "VlwJTNZLVVl5_TY_Br2kYQ": {
    "date": "7/21/2012",
    "text": "Typical chain restaurant, similar to a Chili's in the States. Average burgers, pizza, ribs, and beer. It does the trick for an average priced meal, but by no means a gastronomic affair.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KplKymEIusNFwo7GaR5f-w"
  },
  "NB_lsZafKiUqkA-6Aby7lQ": {
    "date": "8/13/2013",
    "text": "Honestly just a run of the mill easy eat. Don't expect a grand dinner out of this place, you're better off going to ASK! next door. We stopped in here for a bite before heading back to the hotel across the street, and I ordered Pie&Mash, girlfriend had the salad bar and some sides. Her salad bar run was pretty disappointing although she did get cold pasta there, which was the height of her plates. My pie was decent, however the pastry was too thick to cut with the provided butter night and I ended up having to tear it like an animal because our waiter didn't come back to our table. The meat was absolutely delicious. The mash was some powdered box mix with absolutely no flavor whatsoever and almost hard. I melted some butter and added salt and pepper for a little bit of taste which made it manageable but I'm not sure why I should be making my own meal at the table. The best thing maybe was that I got a London's Pride beer with my meal, and as a tourist, I definitely appreciated it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1nmx1uZz-W3943d-TRj0eA"
  },
  "HE7UTgIkb1k70DxHPoOGZQ": {
    "date": "1/30/2011",
    "text": "I am surprised, that anyone with a tongue could actually give more then two stars. We were there with nine people after a long, hard day at work and funny enough - none of us had a burger in a place, known for burgers. We should have, I guess. There is a french movie with Louis de Funès. He produces artificial food and everything from the broccoli to the carrots to chicken looked and tasted as it if had been made in a such a factory. A variation of nothing in the mouth. Fascinating. We were so hysterical, that we had to laugh so hard about everything we ate... so at least we had a great time anyway. That is the reason, why I give an extra point. Service was alright. Red wine was dreadful. IF you have to go there: Take a burger and beer.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "60tRMVlxwEd3iW7HyUPyMw"
  },
  "oxJag3cnrCzN4QpgEWItOA": {
    "date": "1/30/2012",
    "text": "Overall, a less than satisfactory experience. we felt pressurised to order quickly as the waitress asked us for our order less than a minute after presenting us with the menu and when we said we needed more time she returned again very soon afterwards. I chose a Cappuccino and a Bacon Buttie the cappuccino arrived during the meal rather than before. The bread was almost stale, it was clear that the knife used to cut the sandwich was not clean and had been used to cut vegetables/salad or something similar. I will not be returning.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OL4uwLqvJxmn-d181NiGIA": {
    "date": "10/30/2013",
    "text": "Very average food and frustrated by misleading menu which  lead to bigger bill than expected.  My friend had a burger and he said it tasted fine and to be fair, the dessert I ordered was tasty.  I ordered off the British Classics menu which offered a dessert and coffee for 6 pounds.  The Classics menu also offered selected starters for 6 pounds and entrees for 12.   When I placed the order, the waitress asked what type of coffee I wanted (latte, etc. . . ), I asked if all types of coffee were included in the deal (pointing to the British Classics menu) and she said \"yes.\"  When we received the check, we were charged 5.95 for the dessert and 2.95 for the coffee.  When I pointed out the error, I was told by the waiter and manager that it was not an error, and in order to get the dessert and coffee for 6 pounds, I also would have had to order a starter and an entree from the Classics menu.  When I pointed out that this was not indicated anywhere on the menu, the waiter pointed me to fine print on the bottom of the menu (which indicated something completely different) and the manager said that it was all on one menu for that reason.If this were a fixed price menu with 3 courses for 24 pounds, I would understand that--but this listed starters for 6, entrees for 12 and desserts and coffee for 6.  We won't be back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-vtpZzUer__DAKR2L2Rxg"
  },
  "W01_aK0zf0J53XsLfKG7fw": {
    "date": "7/13/2010",
    "text": "Desperate for food after a long search for a hotel to sleep in, we surrendered to Garfunkels. The potato and leek soup tasted sour and the salad bar was tasty, although the plate they give you for it is slightly larger than a saucer. Two stars because one out of four diners in my party enjoyed their wrap. Less than stellar service.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xYeQ2NCstOSydXvpivpmrw"
  },
  "UqsNX20oZZmFMT6xX4ikvQ": {
    "date": "2/15/2010",
    "text": "We where staying in the Crowne Plaza opposite and had bfast at Garfunkels every day. The food was always excellent quality although the portion sizes are not huge. It was a bit pricey (for a northern lad) but not over the top when you consider it's London",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "csoRZiwwJVifH--Ww5oEgQ": {
    "date": "1/24/2009",
    "text": "Wasn't impressed - portions were on the small side, the service was slow and the food quality was no better than 'bearable'. WIll not be going back",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Y4JFyihK9ejPXVRxWQyaFA": {
    "date": "11/20/2015",
    "text": "Having heard all the jokes about how bad British food is, I had honestly hoped that they were in fact just bad jokes and not true.  But alas, my first stop was Garfunkels, which unfortunately upheld the stereotype.   Four of us stopped in for breakfast, and were all somewhat disappointed.  The food was bland and the service was slow, and we never saw the server again once our food was delivered.   I guess Garfunkels is supposed to be a chain, similar to Applebees in America.  But honestly, Applebees seemed like gourmet dining compared to what we had here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMUVULJZ_acMAm78dx8IQg"
  },
  "VAZtqJBJAGnqeoua1tQDow": {
    "date": "5/22/2015",
    "text": "A friend and myself visited Garfunkels Restaurant in, London. It was a special occasion and we were celebrating together. We had planned for a special meal.Unfortunately we were both left very disappointed. The restaurant was quiet when we arrived late that evening. We were shown to a table and ordered drinks. Service appeared to be very slow and we literally had our drinks and orders thrown at us. We both ordered the prawn cocktail as a starter priced at £5.99, which was basically a large bowl of iceberg lettuce with a few little prawns on the top. Half way through this we found a large piece of white plastic mixed in with the lettuce. It looked like a corner off a food product bag. I called over the waiter to explain that I wasn't happy with the starter as it contained plastic; he informed me he would tell the manager. At no point did the manager come over to us. It was only my insistence that I was not happy to pay for this, that the waiter agreed to take this off the bill.No apology was made and neither was the offer of a replacement starter. Still, the manager never appeared despite being made aware of our complaint.I ordered the sirloin steak priced at £15.99 and my friend ordered the mixed grill priced at £17.99. Both of us were unhappy with both meals, every piece of meat was very very dry and felt like it had been left under a heat lamp for several hours. The chips were the only nice part of the meal, as were the onion rings, however, for the price of the meals it is rather an expensive price to pay for a few rings and chips!Both of us left the majority of the meal, eating mainly the chips.Service was generally poor, and not once did a waiter ask us if everything was 'okay' during the meal.We got the impression that we was not welcome there as to the side of our table builders had arrived to fit and install a wall cupboard above a till point - not exactly appropriate when customers are still eating.Our plates were taken, again we were not asked if the meals were 'okay'.We remained drinking the rest of the bottle of wine we ordered, and within minutes, a server arrived to collect our glasses in which we were still drinking from. He appeared disappointed that we were still drinking.The bill arrived at the table, without us even looking at the desserts or finishing our drinks. We weren't offered any coffee or desserts and were made to feel rushed to pay and leave by the unrequested bill arriving. We both wanted dessert and a liquor coffee!Before we had chance to pay the bill, the lights were turned off on part of the room, then a man (who appeared to be the manager) walked over and learned across us to inform us we must leave as they are closing. We had only been in the restaurant approximately 45 minutes, and both felt that if our custom was accepted when we entered the restaurant, then they have a duty to ensure they serve us properly, otherwise, perhaps consider closing earlier.Generally it was a poor meal with very poor service and quality. This spoilt our special occasion.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7tNQ5iSouDQnn2rR5YN_Q"
  },
  "3cZONt09qnDjygOlQoYSIQ": {
    "date": "8/11/2015",
    "text": "Great service, delicious food and enjoyable atmosphere. What more could you want?This is British chain delivery traditional food.  I ordered a chicken, ham and leek pie, it was well filled with a nice crispy pastry. The pie was served with a nice creamy mash, that had a little bit too much pepper on top and mixed green veg.  My husband had fish and chips, the fish was a good size served in a nice crispy batter with chips and mushy peas.To finish we had a coffee and a mini dessert, I love this option on the menu.  I chose a cappuccino and a brownie and my husband chose cappuccino and bakewell tart.  They were both really tasty and the cappuccino had 1979 stencilled on top.Inside there are lots of booth style seating, it's bright and popular music is being played in the background.  Our waitress was really friendly and attentive and not too pushy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw81aVQdsfiVXOq2Kgl8EQ"
  },
  "n7dKz4NxIUZYrhGYSA7u1g": {
    "date": "6/13/2016",
    "text": "We had breakfast there and really enjoyed it. I had the omelette and my spouse had the full breakfast and we both enjoyed it. The service was prompt and friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssORqtA-EVxKlqq9PA4nZA"
  },
  "4_bhVenV223O_Dr4mumcCw": {
    "date": "9/4/2015",
    "text": "If I could give zero stars, I would. Tried to get breakfast about 9:00. It wasn't busy. I ordered the Garfunkel's Breakfast. My wife ordered porridge. 30 minutes late (after asking about our food) it finally showed up. My eggs over easy were cold. My toast was cold and felt like it had been sitting out of the toaster for 30 minutes, my butter was melted and had to be pores on the toast, and the sausages and potatoes were cold. We walked out. Only good thing was the cup of Hot Chocolate my wife ordered.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1DZGPdnfFqIEoRZJWhwkYw"
  },
  "SIAAGCnnni-Uh6JtgT7dqA": {
    "date": "6/15/2014",
    "text": "There is a Garfunkels every where you look around London. Unfortunately, their availability is the only thing positive. The food was pricey and mediocre at best. Similar to a very bad Shoneys or Jerry's from in the states, but lacking even old school good options, this was a sad disappointment. But even after watching the fish and chips orders at tables nearby, I'm not sure why this place is open everywhere.  No one seemed happy with their meal. If you can't find anything else open, are starving, and for some reason can't step into a pub for some excellent fish and chips offerings, then I guess Garfunkels is better than a McDonald's. However, not sure that us even true. In fact, a Big Mac would have been better than anything our group had.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Lzb8L4gQ67lcXMRg5PRGw"
  },
  "XAtAPSKu448rcxOpt6AQcQ": {
    "date": "12/28/2010",
    "text": "1) I think it's funny that this place has been reviewed exclusively by Americans 2) Here goes another American review;I was 'stuck' in London during the \"volcanic ash cloud\" incident in April 2010.  I was using Yelp and other websites to try to find good (but not super high-end or expensive) places to eat.  Since this didn't get great reviews, I had left it for last.  However, I didn't want to eat at the same place twice so I had to try it.  I stopped here for the \"Big English Breakfast\" which was 7 pounds 50, and I thought it was great. (I uploaded a picture).  I'd have no hesitation getting it again.  It could have been cheaper, but this is London, afterall.. However, I have no idea what lunch and dinner are like.This restaurant is very close to the Gloucster tube stop; one side of it is on the street, and the other side is inside a small shopping mall.Read my profile for more about how I rank restaurants. I consider this a 3 star establishment.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7uHL2A8N_aL991c4A_e_rQ",
        "caption": "Photo of Garfunkel's - London, United Kingdom. The \"English Breakfast\" at Garfunkel's",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7uHL2A8N_aL991c4A_e_rQ/o.jpg"
      }
    ],
    "user_id": "p7RiGtUfifXYYfDcxcGcFg"
  },
  "t9lImff3tU53GVathOl1ew": {
    "date": "12/10/2013",
    "text": "Exactly the same as Frankie W. Was enticed in by the £5.95 breakfast as my favourite place on Gloucester Road was full (cafe forum) . Although the food was OK, it was lacking in quantity. If you want to make it an actual full English breakfast with all the trimmings, toast, tomato, beans, 2 bacon, 2 sausage... You catch my drift. Each extra is £1.50! £1.50 for two slices of toast. Sorry Garfunkles you can do one! And 2.50 for a coffee I don't care if it's refills I only want 1.Overall I felt like a ripped off tourist which is exactly how this place remains open. Avoid!! unless you want a mediocre breakfast for over £10.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEcTPXwd08BchAb1xAGavQ"
  },
  "3pWQM11CT2V4WccuCGYBOQ": {
    "date": "3/31/2015",
    "text": "The tower of London burger was hideous, the fries were stale, the meat paddys were...alien? Don't let the setting fool you, the spacious classic saloon déco is the home to the definition of a tourist trap.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlsbzADaNBXKcLHsNZG89g"
  },
  "w68l8Fa8_lxDhbpBoZ2G3A": {
    "date": "5/4/2015",
    "text": "Simply the slowest service I've ever experienced at any restaurant. Food was average at best.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JiB0p79AZ8bg-2eQsJ_4xw"
  },
  "d2PLoUNHlzZbmHZn2nKKAQ": {
    "date": "4/12/2015",
    "text": "Starter was good but Fish cake and Fries were so average. Too expensive for very basic microwave meal quality food. Also spirits not listed on drinks menu but are extremely expensive. Will never use again!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FUp6PlHE2GkOJE6qEccQjQ"
  },
  "97UVzJkUlqHU57WfNLowAg": {
    "date": "5/19/2015",
    "text": "I love this garfunkels! Every time I visit London we have breakfast or dinner here.  It's worth the money, it's good deals, the waiters are super nice and friendly and you get good offers. What more can you ask for? A nice atmosphere, usually well lit up and tasty beers.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_exOGrKu9wQRKFEoRh-zTg"
  },
  "0_b5fLakAWj8MJ5fi5pp7g": {
    "date": "7/30/2016",
    "text": "Not good. Pretty sure they microwave their food. We were tired from a long tour and dropped in thinking it would be a good choice. Our first bad meal in 5 days in London. Our server was very sweet and attentive though.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LuS0eE_c0s7VikmrHywlNQ"
  },
  "5L3Bd15hHUFVsp3cxtGBBA": {
    "date": "5/12/2013",
    "text": "Overall very average, but of the 3 meals of fish and chips I had in London, this place surprisingly had the best.  The fish was very fresh, the batter was excellent, and the chips were above average.On another trip, I had the spaghetti with the salad bar.  The spaghetti was slightly overcooked and the sauce was too sweet.  The salad bar was a disappointment.The service was overall good, but I can't bring myself to give this place more than 3 stars overall.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyTYQo6Cn4BYB4z-McRDaA"
  },
  "Y2lMzEDDXWSDXo4wc3WAUg": {
    "date": "6/28/2015",
    "text": "Food is okay. But service is really slow. It seems like there is a lack of staff to cater to the customers.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ta1ZhhOX98uKUC18WRI-Mg"
  },
  "Qqe9ydzBR8bDTHQdFWI-pQ": {
    "date": "4/28/2012",
    "text": "Italian prob was not the best idea here.Canneloni...hmmmnot so muchI ate here numerous times because they offer free wifi, and the only way I could use my phone for any contact with the U.S. was via wifi...even to skype a video call home.So, a couple decent breakfast's and a couple average dinners.They are open from quite early until quite late, so whenever you fancy a meal, you can pop in. They do have a full bar as well, which is always a bonus for me. Very much like a Chili's here in the states - which I wouldn't step foot in normally. But, if it was the only reasonable restaurant open with free wifi and never a wait or rush, I'd make an exception.Of the 5 servers I had over the weeks period, only one smiled and seemed the least interested in service or displaying friendliness. The others simply dropped food.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AkBtT43dYcttxQ3qOzPBAg"
  },
  "GD1ciCFtaU04yPc3aXMP4Q": {
    "date": "3/12/2014",
    "text": "Do not even attempt to go here. Food is terrible, service is horrendous, and it's really expensive considering the poor quality they serve. We only ate here because it was close but there are so many better options, so do your stomache and wallet a favor by not partaking in their food.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8zZZK_ZEbjkV98J0m9qzw"
  },
  "5xkZ7RamHsTSwocnmfiyRQ": {
    "date": "1/1/2015",
    "text": "Had the fish and chips and not too bad ... Service kinda sucked and my beer was a bit frozen at the bottom .... So I had a beer slushy ... Nothing crazy about this place ... The food was just ok ....",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5x8YAOKyR33mSpC698gBQ"
  },
  "Bh0C8lwtEH3sw8tw47f7Kw": {
    "date": "6/13/2015",
    "text": "Omg it was horrible.  Frys was cold. They replaced them. But my grill chicken sandwich never again.   Just not worth it.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCmRxVJofbSifhQpul2nsQ"
  },
  "7ni7EcCSYeXH1CdeZlIXmg": {
    "date": "11/14/2013",
    "text": "This is definitely a tourist spot. I had the full English breakfast for what I thought was a decent £5.95 then I was informed I had to pay £1.50 for toast and the breakfast didn't include a hot drink. The drinks are about £2.50 extra. The food was ok but nothing exciting. All in all an ok restaurant. Not sure if I will go back.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kS7rxY7q8Wtscl-0rH4qfQ"
  },
  "lN3f9mbB7cNFbHQy6AcrbQ": {
    "date": "9/15/2018",
    "text": "My server was very nice however, this place sucks. The food is bland and that's an understatement. I ordered pizza and I'm not sure exactly how you can mess up pizza but Garfunkel's messed up. Will I come back? Maybe for a soda if I was desperately thirsty. Message to Garfunkel's : Please add seasoning to your food so that I don't have to.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ww6_SLc6sDIPi-WJXYmchw"
  },
  "kq24HEq5KUf1oTMpkmYfog": {
    "date": "5/16/2018",
    "text": "Man I really was hoping this was a hidden gem. :(After a long day of tourist activity's my husband and I were starving, we had probably walked around for a good 45 mins looking for a restaurant we could agree on when we stumbled into this nice little pub. So let's dive into that one star review shall we.....I'll start with the positive which was the atmosphere. I found this place to be very cozy, warm on a windy day and also casual which is my favorite! The only other positive I have is the staff, they seamed to be very helpful and nice people in general. Now on to my bitching season. The food! Omg was this a ginormous let down! I had ordered the steak, probably the most expensive thing on the menu but this was not my first choice. First I asked for a club sandwich, they were out. Weird. They were also out of the other 4 they had on the menu that looked interesting, all that was left was a Ruben, no thanks. Anyways the steak was presented pretty well not bad for a bar I give them that. However the only flavor I tasted was old meat that had been frozen before cooked for way too long, or it was just bad meat all together. Either was no seasoning was added I ordered it medium rare, it came out medium. They have no steak sauce either so masking the bland old tasting meet wasn't a option. Sad. My husband ordered the fish and chips his comment was it was ok, but not anything worth writing home about. My one star. Let me explain. This is solely based of the food alone not the service. To me 90% if my dinning experience needs to be actually food flavor. This place was definitely lacking in that department immensely. If your looking for a nice bit to eat and want a sit down place I do not recommend this place. Save your money and find somewhere else. As I said earlier, good presentation, not so good food.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b2w4VPoOcIGc5N1-sq7N4Q",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b2w4VPoOcIGc5N1-sq7N4Q/o.jpg"
      },
      {
        "img_id": "a-Vh2jRPImKpVp6NVtW-PA",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a-Vh2jRPImKpVp6NVtW-PA/o.jpg"
      }
    ],
    "user_id": "11ytOUj6fu2r6zJh-xNhBQ"
  },
  "d4gDZ6SBGHLtH4h2CDo9iQ": {
    "date": "4/2/2018",
    "text": "Mediocre at best. It's located right off the Gloucester Road stop, so it's in a very convenient location. I wasn't too hungry when I got there, so I ordered only an avocado toast. It was pretty disappointing. The toast wasn't toasted. It was quite mushy when I got it. It was 90% mango salsa and 10% avocado. It is not what I define as avocado toast.I also ordered a soy mocha. It was pretty average.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3TntR1kN0-cBEbQ7Ra6Asg",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Avocado toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3TntR1kN0-cBEbQ7Ra6Asg/o.jpg"
      },
      {
        "img_id": "M1ejtJp8tcp9FhO5eOhfRw",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Mocha",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M1ejtJp8tcp9FhO5eOhfRw/o.jpg"
      }
    ],
    "user_id": "09QcQYf_t1NEq_AkjJuABA"
  },
  "ovIl04cpcegHcMNaw6lAlQ": {
    "date": "1/5/2018",
    "text": "Chose this location on a whim en route to New Year's Eve festivities on the River Thames, and left a bit surprised. Contrary to some reviews, the food & customer service were actually very good. Dinner featured pasta with salmon, coupled with three large pieces of bread. Portion sizes for the entrees seem to be on the small-to-midsize of things, yet that appears to be the European standard. In addition to the draft beer of Stella for a reasonable price, the meal was nourishing enough to quell all hunger pains until 2AM the following morning. Not too shabby for 22-25 pounds.With regard to this franchise's location, I can't complain about it being close to the Gloucester Road Tube station. In fact, its right around the corner from it, and enclosed within an indoor mini mall (for lack of better nomenclature). Save for Garfunkel's downstairs bathroom (which felt as if I was entering a dungeon/torture chamber), the restaurant experience was pleasant.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "VS4X44UMzTZowa3jUXGFlg",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Gloucester Road Tube station that Garfunkel's is close to.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VS4X44UMzTZowa3jUXGFlg/o.jpg"
      },
      {
        "img_id": "SX8MPO8E2s_psKPA4jzkpQ",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Pasta carbonera entree.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SX8MPO8E2s_psKPA4jzkpQ/o.jpg"
      },
      {
        "img_id": "vGXCGlZF5vuGTP1mQdJdaA",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Pasta salmon entree.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vGXCGlZF5vuGTP1mQdJdaA/o.jpg"
      }
    ],
    "user_id": "0sl4I8R7znWXp_K4A0nZ_w"
  },
  "yNSGxIfMEqxekVs5Mc4Kvg": {
    "date": "11/4/2018",
    "text": "The 2.5 rating seems low. Breakfast was good and the service was great once we got seated. Nice staff. We ordered the eggs Benedict and it was nicely done, aside from the English muffin which seemed a little stale. Noticed a 1 star rating and I believe it related to steak. Overall, London does not do steak well, especially for those of us who are Dallas steakhouse connoisseurs :-)  This is a little cafe with breakfast, lunch and dinner so steak expectations should be reasonable. Cheers from Texas travelers!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ioKmFi3J8KcqCwH1-EqCgA"
  },
  "AMd8ZeFiZDtNx7S0PA3FKA": {
    "date": "8/12/2018",
    "text": "Great value for breakfast meals. I visited here with my wife weekend, I ordered classic breakfast and she did egg Benedict. Both are tasty and pretty valuable. Staff was really nice guys.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iGwz4dYbRMheg44rEFbTng",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iGwz4dYbRMheg44rEFbTng/o.jpg"
      },
      {
        "img_id": "H8AVJXWuk9LMPJIaDtGIoA",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H8AVJXWuk9LMPJIaDtGIoA/o.jpg"
      }
    ],
    "user_id": "OGMgJ3P6-5UHT1jHrFArdQ"
  },
  "eeOpX9dyD4nJoV4hkaqsnA": {
    "date": "6/24/2018",
    "text": "Came here twice for breakfast during out London stay and had good breakfasts.  The pancakes with greek yogurt and fruit were good, as were the eggs benedict.  Traditional English breakfasts are served also.  The staff is friendly too.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWTGoQkCgd-yKupy-ndA6Q"
  },
  "_07xulpz0byHHnc_4tgfgw": {
    "date": "5/6/2018",
    "text": "So yummy fish and chips. The ORIGINAL London's fish and chips. Delicious, very tasty, greatly priced and big portion. Nothing to miss about this place. And the service?? Fabulous by the tall, dark handsome Spanish waiter.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cy4wqbLwtliHfRzPH5ta5g",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cy4wqbLwtliHfRzPH5ta5g/o.jpg"
      },
      {
        "img_id": "YJys_N8GVHmA9pIYYxeHvA",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YJys_N8GVHmA9pIYYxeHvA/o.jpg"
      },
      {
        "img_id": "NgGp8UCVQPoTkTCmx6hKzA",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NgGp8UCVQPoTkTCmx6hKzA/o.jpg"
      }
    ],
    "user_id": "6ePnuGxn1ywAjs5lUnVmOA"
  },
  "FJovWIZagT5y9lsDVr597g": {
    "date": "8/5/2017",
    "text": "Great place, where you can take typical English food fish and chips. Honestly one of the best fish & chips ever for me. One advice, no ordering bigger one, just onion add... Also all day English breakfast .",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BvTyjVoxvwxILHPuVcwTUg",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Guacamole sauce is not for me but garlic sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BvTyjVoxvwxILHPuVcwTUg/o.jpg"
      },
      {
        "img_id": "JVYxLtX_O1QeQ9F5CAstEQ",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Great time with friends.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JVYxLtX_O1QeQ9F5CAstEQ/o.jpg"
      }
    ],
    "user_id": "IrvLNMKnYlITqfzGh1dbnQ"
  },
  "RwfULUKwElao5xHKnYhyKA": {
    "date": "3/23/2017",
    "text": "Not a bad place to get good food with good prices. The service was great and the overall appearance of the place was simple and clean. They had some nice options at the bar and it was really a great place to just relax and eat!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zKYZWR-eTa_dKWHuSd9Psg",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Spaghetti and meatsauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zKYZWR-eTa_dKWHuSd9Psg/o.jpg"
      },
      {
        "img_id": "bruuWNsw6FbiyFa-7u3QaQ",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Fish and Chips(fries)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bruuWNsw6FbiyFa-7u3QaQ/o.jpg"
      }
    ],
    "user_id": "pH_J6n-00KDiijLtocKSfg"
  },
  "Oyzwj8hNrg2VRkXYshdneA": {
    "date": "11/15/2017",
    "text": "The fish and chips at Garfunkel's is very good.  I've gone to several places near the hotel I stay in when I'm in London and so far the others I've been to are just mediocre.  Great tasting tartar sauce.  The service is good and the place is clean.  I definitely recommend Garfunkel's!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TDlBgAVNd4ibZWnVuWtC1A",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Very good fish and chips!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TDlBgAVNd4ibZWnVuWtC1A/o.jpg"
      }
    ],
    "user_id": "GoBCEZRroOGb7cl30IKlVw"
  },
  "g1vssvVyQMQuQujTBXpKMQ": {
    "date": "6/7/2016",
    "text": "Nothing special about this place I passed by on my way to the post office stopped bye just to use the wifi and get a drink pretty much. You can only buy booze if you have food. Service was pretty good. Slow to get the bill.-bruschetta was okay but way to much coriander like hands full and way to much onion, it had a nice twist to it but defs needs work.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QL_oorc1S8KwKS2b65K-lQ",
        "caption": "Photo of Garfunkel's - London, United Kingdom. Bruschetta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QL_oorc1S8KwKS2b65K-lQ/o.jpg"
      }
    ],
    "user_id": "U95wccXN_J8JwA5Ktlu8tw"
  },
  "XyUPylmRblH8kHUnsRvGuQ": {
    "date": "9/18/2017",
    "text": "A nice comfortable place for breakfast. Good value for a lot of food. Waitress got my coffee wrong but it wasn't a deal breaker. Beats fast food for $5.99",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BuMwwr-0MJWYdsiYlyAPng",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BuMwwr-0MJWYdsiYlyAPng/o.jpg"
      },
      {
        "img_id": "TCEANAiqIMmX2fDW4rrz2g",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TCEANAiqIMmX2fDW4rrz2g/o.jpg"
      }
    ],
    "user_id": "Lc4qnL0mWqoEJLDUCe7-Xg"
  },
  "Cc74QEVV-PPOLBx7Ra5_ow": {
    "date": "10/20/2015",
    "text": "I've been to many Garfunkel's and this one has got to be the worst one I've ever had the misfortune to visit. I wanted a late breakfast/early lunch, so I ordered the full English and while service was speedy and courteous, the food was terrible. The sausages were completely devoid of flavour, the eggs rubbery, the butter frozen solid. All in all barely edible and an utter waste of money. The staff was nice enough, but seemed very stiff and rehearsed. I'll definitely not return to this location.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ALJZiQG2Tt0CRK3ffVwqPg",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ALJZiQG2Tt0CRK3ffVwqPg/o.jpg"
      }
    ],
    "user_id": "HiY5E-vORIoCK61nTuqHxw"
  },
  "W7YADbcPc2fbULG7lISgwQ": {
    "date": "7/1/2017",
    "text": "This was my first fish and chips in London. Definitely a good experience, very crisp and tasty. There were 2 different sauces; would have been nice with larger portions of those. Friendly staff, cosy place with not too much noice. Good for kid-families",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEFdVQDmedIbhjJl0xOPuA"
  },
  "jERzuFzHvk7uLb7_d2blkA": {
    "date": "6/3/2017",
    "text": "We were hoping for a better experience. We had both ordered the fish n chips and both were disappointed. The free wifi was very slow and the service was ok.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "slN6bHSTnBeLWrD6hLqhbg",
        "caption": "Photo of Garfunkel's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/slN6bHSTnBeLWrD6hLqhbg/o.jpg"
      }
    ],
    "user_id": "baIs9OsD3IHluIfzJ9JvPA"
  },
  "NEKMFN6oGcFUSceudrJUyg": {
    "date": "1/30/2017",
    "text": "Staff was friendly and environment was spacious, but the food was incredibly bland and greasy. Even found a rather large black hair in my meal, which completely disgusted me.Chose this place because it was right near the hotel I was staying at, but I should have checked the reviews first!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8qkUdKmgLjgFuhzuikQQ1Q"
  },
  "--yysQa62Cl_CawdLWPnUA": {
    "date": "6/1/2016",
    "text": "I had breakfast here with my family while we were staying nearby last week, something that could've been so much better. The service was ok, the staff are friendly, but it's nothing to write home about. I ordered a bowl of porridge with a 'drizzle' of honey for £3.50, but it was the stingiest portion that came with about a drop of honey on top! The waitress did however come back with a tiny butter dish containing about a tablespoon of honey when I asked for more, but still it's completely laughable and an absolute rip-off.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MLSciF6fG6KbMpEw3b17kQ",
        "caption": "Photo of Garfunkel's - London, United Kingdom. World's most pathetic drizzle of honey.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MLSciF6fG6KbMpEw3b17kQ/o.jpg"
      }
    ],
    "user_id": "8oOazkle5FXG3YGXGRfwMQ"
  },
  "ByadIj4oVdd77Fq_g84R7w": {
    "date": "9/24/2017",
    "text": "Dont bother.  Very sterile.  Has less charm than IHOP and food is not as good.  Big chain feel.  The coffee is the worst I've had in Europe.  Has a lot of seating that makes it easy to get in, but you soon find out why.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TpVDcPcM7ttRSED4SYypA"
  },
  "UyOlAEhMsy_QjTKnsIHutA": {
    "date": "2/11/2017",
    "text": "Ok location and friendly staff, but food was bad - greasy and poor quality. One of our orders were not delivered - ordered a pie but got fish, which I accepted to eate with ny family, since I had no time to wait for them to prepare a new dish - dispite this mistake we were charged for the full cost. Kids meals can not be recommended.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bY0GdhIRDT-aWOdkaSN1MA"
  }
}