{
  "JAR8ofyivMix8_3s9fE-4g": {
    "date": "12/4/2011",
    "text": "Thai cuisine on its highest level!!! I strongly recommend this restaurant!I had the \"slow braised beef in aromatic coconut reduction with fresh lime, lemongrass and chilli \" with sticky rice: a delicious treat! My friend went for the\"yellow coconut curry with New Zealand lamb, new potatoes and baby onions\" and was very delighted about her dish as well. The range of wines from all over the world is impressive (starting with about £ 17 per bottle - as far as I remember). We went for a fruity rosé wine from Thailand which was a very good choice!The ambience of the restaurant is stylish and traditional but not to cold. The service is proficient but warmhearted.The bill for two main courses, a side dish, one bottle of wine, one bottle of water and two thai teas totaled £ 83 (service included).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hw3xhEopv76C1fJ5oJv_FA"
  },
  "jwoD9nUsct9c6Dwz6xBapw": {
    "date": "8/20/2015",
    "text": "Ingredients seem to be high quality, but the green curry is def on the sweeter side of the spectrum, to the point of overpowering the other flavors. I usually like to try at least a couple of dishes before review, but sugary Thai food isn't my cup of tea. Nice ambiance though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrVbCQ5xuyKgjYR0-EROXg"
  },
  "NZOLygaJfQZ3IcqXKnGG2A": {
    "date": "10/27/2010",
    "text": "Is this my favourite Thai in London? Yes. These fine folks at Patara know what they're doing and they know how to do it well. From the great service quality all the way down to the amazing selection and taste of the food. I've been here with a wide range of groups and have taken friends and clients a like, all with the same reaction, \"AMAZING!\" While the location is in the middle of Soho and toursity central, it's worth pushing through the confused masses and getting to this little gem of a restaurant on Greek Street!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "GhPsVqtRtf1t-H9OIa1jMg"
  },
  "1JqhO4EFG1E9qx1G7EV8Hw": {
    "date": "6/24/2013",
    "text": "Solid Thai for the area. But surprised to see it was best in this region of london. However, it was VERY reasonably priced. And I praise their vegetarian menu.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y59oUyobhSLj_Sb6GDhnBA"
  },
  "ujUiUhIqGWZKFOKOgr_52Q": {
    "date": "7/15/2011",
    "text": "It's interesting to read other reviewers issues with the service at Patara, as when I went last night I thought the service was fine. My boyfriend and I were put into a quiet corner which was nice and we were served promptly even though it was still quite busy at 9.30pm.The food was really very good and I was pleased that they did coconut rice  my favourite. I had the green curry which was tasty  although I'm not convinced it was worth the price tag. However, my boyfriend had the deep fried sea bass in light red curry sauce which was excellent  and exciting as it is a dish we haven't come across in London before.The actual restaurant is visually interesting and the ambience was bustling and generally enticing. Overall I would say this is a great experience, but perhaps a little overpriced.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "B9FAWrW0tAfPpLga9MXQRQ": {
    "date": "7/2/2013",
    "text": "I got the lunch special deal, and in it I got the spring rolls and the thai style fried noodles (pad thai). when the spring rolls came there were 5 spring rolls! They were pretty good. Then the pad thai came and it was average.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZqYuVoXpDR5Kr8zCqwx52w"
  },
  "6qiqHot3QHl-Xx2QajOzNA": {
    "date": "7/1/2013",
    "text": "Hands down the fanciest Thai restaurant I've ever been to in my life. Portions for most of the dishes were on the small side (from what my friends ordered). However, the Nua Tom Kati was by far the most filling dish on the table with several large chunks of beef. It was so filling in fact, that even after sharing a couple pieces, I still wanted to share more! Flavors here were very different than other Thai restaurants I've been to. Meats were really fresh tasting and unprocessed (you know how sometimes you'll eat meat at an Asian restaurant and it doesn't take like how it normally does when you cook it yourself). Vegetables and garnishes were really fresh as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pYaKw-hSbi9pHP06TJzNg"
  },
  "G_KDUi3QEusPKLHROSEDUw": {
    "date": "6/29/2011",
    "text": "I'm giving 3 stars because while the food was excellent (my duck with roasted pineapple: to die for), service-wise the rating would be 1.5 stars would be pushing it. Twice, they brought the wrong food to the table. The first time it was corrected (but took forever), and the second time, they just never brought the replacement dish. They were busy, but not overly so, for 9:30 on a Friday night. Everything was slow, and for two people it took us well over 2 hours to get out. Not impressed at all. I'd still go back for the food, just wouldn't expect much from the staff.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AQxK_7aanL0Vq3Ruaz731w": {
    "date": "1/10/2013",
    "text": "The food and service at Patara have been consistently excellent. I've been three or four times, with different friends, and always tried different dishes. Last week i tried the seabass and tom you soup - both really really good. Patara is my new favorite Thai place in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0r1VZVIVZGoJbMWYduju9w"
  },
  "7tshutgfHNri7ySyxgO8Wg": {
    "date": "5/14/2012",
    "text": "I've really struggled to find absolutely-blow-your-mind awesome Thai food in London.  There are quite a few cheap-and-good places, and I'm quite partial to Addie's in Earl's Court, but finding that special place has been a hard task.On top of this, I'm usually ver sceptical about Asian fine dining (excluding Japanese) - my last experience had been Plum Valley in Chinatown which, while pretty decent, really didn't do more for me than a normal Chinese restaurant.  Sure, it's nice to have something different, plus you know that the ingredients are probably not Grade Q (for questionable, or something), but it's not usually worth the mark up that comes with it.  That said, Thai food - in my mind - lends itself to fine dining more readily than Chinese; generally speaking, I find the dishes have more colour and aromatic complexity, and after reading some of the lovely reviews from you guys, I decided this was worth the shot.  Hey, if things go badly, it's on ALL YOUR HEADS.  GUARANTEED.They've really gone all out on the interior and for the most part err on the side of not tacky (the replica Buddhist temple in the centre does push that boundary though).  Either way, it's a decent space and doesn't come with the same packed-like-a-nuclear-bunker feeling that some of the restaurants in the same area do.For starter, we had the green mango salad with soft shell crab, betel-wrapped prawns and beef, and tuna tartare.  The first thing I noticed were the generous portions - hey, you get quite a lot for your money, which I don't always expect in places like this.  There were two large bits of soft shell crab which were excellent - the batter wasn't too thick, and the crab itself wasn't mushy as it often is.  There could've been a little more salad, but hey.  The betel-wrapped goodies were pleasant too - the beef was amazingly juicy, and the leaves didn't totally dominate the flavour.  The leaves don't go as well with the prawns, but it was still good.  The fusion-y tuna tartare was ok - fresh fish, and nice lemongrass garnish - but the flavour combination is a bit weak compared to other preparations (especially Japanese/French ones).The mains were similarly of impressive size: we went for the braised beef in coconut, lime, lemongrass, and chilli; the Panang Lamb Shank curry; the sugar snap peas with prawns and mushrooms; and lastly, some pineapple rice.  The braised beef was all manner of cheesy words, but I'mma go for sumptuous.  Ok, so it wasn't *quite* falling apart, but the flavours in the dish are excellent - I especially liked the little bits of lime left in the sauce which give each mouthful a little tangy lift as a great contrast to the creamy, saturated fat (aka coconut milk) sauce.  The Panang curry needs no introduction on this thread either, and totally lived up to its billing - I was just sad that I couldn't pick up the bone, and gnaw every last bit off it (and suck out the marrow).  The veg was good too - just the right amount of crunch.  The pineapple rice was ok...at its heart, it reminded me of kedgeree, but it lacked a little something to make it extra special.So, why 4 stars?  As good as this place is (and, although pricier than most Thai food, gives you a lot for your money, unlike most fine dining places these days...), I just thought that the spice levels were REALLY tame.  I understand that the chefs don't want to drown the complexity of the dishes with chilli, and that they have to cater to their audience, but for me they've just reduced the spice too much.  Even the chilli garnishes have a meagre Scoville rating...I'm guessing that you can probably request more chilli, but to completely ignore part of what makes Thai food Thai food is kind of heinous in my eyes.With that said, I still look forward to coming back here - there's no denying that the dishes are REALLY flavourful, and totally worth the extra over your average Thai.  Just sneak some sliced Bird's Eyes in with you.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "j7_FGnfY_rI4A2PFLZbkgw"
  },
  "nZ529ZGk3oin35U9NVJKOQ": {
    "date": "1/30/2014",
    "text": "Our concierge sent us to Patara as I was craving Thai Food. We loved every dish. We started with kong nueng ruam (assorted dumplings with prawn, chicken and pork fillings). Very tasty. Next we had peek gai sod sai (Golden chicken wings with crisp lemongrass and kaffir lime). I asked for a chicken and basil very spicy and wow did I get it. It was super spicy as I requested. I was craving it days later. If you are in the Knightsbridge area and craving Thai, this is a great spot. Expensive, but worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k7DWG9urvFq3WxlfNFjFbQ"
  },
  "E78ZpdgJHmpSJk2_7_YOCA": {
    "date": "6/28/2013",
    "text": "The reservation system was quick and easy to use. The Thai food here was Ahhmazing!!! My husband and I started with Kamon Bueng DIY. Do-It-Yourseft Thai tacos of chicken and prawn with cucumber tomato salad. They were delicious and fast! For my main course I tried the Kiew Wan with chicken and it was SERIOUSLY the best I've ever had...My husband had the Nua Prig Thai Dum and it was perfectly peppered and very tasty as well. This place is a hot spot and highly recommended for anyone looking for great service and fantastic Thai food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYSIT62K-YrlOKW-73Pj_Q"
  },
  "Ke9_EWNd8d3wgnnHSDq9kg": {
    "date": "7/10/2012",
    "text": "The food was excellent, subtle and delicious. The service was nice and the ambiance was lovely. We had mango salad with soft-shell crab appetizer which was the best thing. I thought they were a bit stingy on the mango salad and I would have liked more, split between 2 people. We also had lamb and prawns wrapped in betel leaves. This appetizer was well-done but not really my taste. I would skip this one next time. For main course we had white rice with Chicken and bamboo shoots green curry which was very good (a little salty but I have very low salt tolerance). We also had a slow braised beef dish with hints of lime, chili and pineapple that was amazing. That was subtle, creative and delicious. It is a bit pricey. A meal for 2 with drinks came to 80GBP.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CYvwH-v8pvaR3K3e4jtbrQ"
  },
  "tchjHTDJkEefBqKpt2v8Qg": {
    "date": "11/29/2012",
    "text": "Absolutely fantastic Thai food in Soho.  One of my colleagues recommended Patara for a team dinner, and we were all thrilled with our food.  Every single dish was fantastic and the presentation was beautiful!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBBogzrotUdkTwmiOXWtNw"
  },
  "FNQ8JzA0dUqjFG-AVpPReA": {
    "date": "6/14/2013",
    "text": "Outstanding. Went here on our trip to London from the US last month, and it might possibly be the best Thai food we've ever had. The curry lamb dish was amazing, with great presentation. Mildly pricey, but highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HVJXzJsIbmw0K7-tU9OZRQ"
  },
  "_C27Ch355uBGTj1lwH0phQ": {
    "date": "5/6/2010",
    "text": "After Bryan Y.'s review of the Lamb Shank, hey, the word frickin really is a convincing word in my dictionary... I just had to go here and try it out for myself for a little comparison study.  Well kids, this place IS the real deal.  Hands down the best Thai food I've ever eaten and I've eaten at other \"fine\" thai restaurants before.  My satay trio appetizer was cooked to perfection, sauce lovely.  Next came that fall off the bone Lamb Shank curry.  WOWZA, it was delicious, and it was not only I that thought so either, my 2 dining partners both tried it too and were then not so in love with their dishes (though they did like theirs very much too).  Mmm mmm, slow roasted lamb with a lovely penang peanut curry sauce, really I have no doubt that I will be back here again and ordering the same thing (and me knows my accompanying dinner will be ordering the same too).Sure it's on the pricey side for Thai, and I warn you it will kill your love for that tiny cheap Thai place around your corner, but trust me, both are worth the expense!  Enjoy, enjoy, enjoy people, you only live once and out of this world Thai cuisine awaits you here at Patara!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bk8vptdyN5iH9pM8_SB1cw"
  },
  "C-SK0EzedFY1H55egWBy9g": {
    "date": "1/5/2015",
    "text": "The food was good. We had two dishes - one a rice noodle stirfry with king prawns which was a 'chef recommended' dish - this was delicious - but I wouldn't say anything particularly special. The second dish was a type of red curry - this was a tofu dish but we wanted to replace the tofu with prawns. They were pretty accommodating and this wasnt a problem. although the second dish was absolutely delicious, it was quite small and there was more prawn than actual curry. In regards to the service, it didnt start off well....we were waiting almost 20 mins after being seated, before someone came to take our order - and she was pretty grumpy to say the least! However the service after that was fast and all other waitresses and waiters were much more friendly!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBFsNjZqKRAQIa0YIOilYw"
  },
  "9MCuoX8S7vAWg1F-0xZKaA": {
    "date": "2/5/2010",
    "text": "Last night I went to Patara for my first time as fellow yelpers have spoken so fondly  of it I thought I would take it for a spin. I invited 5 of my mates and to a person we were thinking \"Yummy in our Tummies\" as the food was mouth watering...I actually thought there was a New Years eve fireworks display going off in my mouth.I totally recommend Patara Soho to anyone that loves Thai and wants to chill with some friends and enjoy some fab foodies.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIVvN9k2CwYI39jX46-Ldg"
  },
  "uVqTVpTUihBi-5v9p_gIHg": {
    "date": "2/22/2012",
    "text": "Wonderful, great service, the smells hit you as soon as you walked in. It is on the pricey end of the scale, but worth it for a special occasion.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSMPUBDjYE7zoi06XtiRhQ"
  },
  "OMHlay-1xCFTNPy_fuq5Yg": {
    "date": "6/6/2009",
    "text": "Apparently we're all wrong - Patara is the best Thai restaurant in The World. So it's time we forgot about our personal favourite local gems or that street stall when we were in Chiang Mai... the powers have decreed and Patara wins.Patara Bangkok has won best Thai restaurant in Thailand for the last two years and the good news for London is that the Pataras here have virtually the identical menu, ambiance, service levels and cocktails of their little sister in SE Asia. I say little sister because London's Pataras came first... Mayfair, Chelsea and then here in Soho.. before they then headed to the homeland to win their world prize. Think of Patara as our homegrown champion.This Soho Patara is my favourite in London, and runs close to the dining mansion that they have in Bangkok. The interior in the depths below Greek Street is gorgeous, with a beautiful intricate model of the Thai Royal Palace as the worthy centrepiece. I only wish they had their own Tuk-Tuk like they do in Thong Lor.The cocktails are crafted by their award-winning barman on Maddox St and a worth a visit but let's be honest you're here for the food, and it won't disappoint. Rammed full of flavour, presented with artistic beauty and the finest quality through and through - it's easily worth the double or even triple cost compared to your local Thai, heck... it's even worth the 15-times cost compared to the Bangkok streetfood.::: and why is it so good? :::1. Real Thai, not fusion - Authentic dishes, true recipes, no compromise on cooking style, fish sauces or hot spice levels (warning!)2. The best ingredients money can buy - Not beef curry, but veal osso bucco curry. Not seafood and lime spicy salad but smoked salmon and pomelo spicy salad.3. Perfection - classic dishes endlessly studied by the chefs, worked on and improved until nirvana.It's an amazing methodical approach to get the best Thai food on Earth, and strangely behind it all is a mega corporate company called S&P, who seem to be the Thai equivalent of the Marks and Spencer food section. I guess they decided they could afford a wonderful little pet project....",
    "rating": 5.0,
    "rated": {
      "useful": 13,
      "funny": 6,
      "cool": 9
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "J6U2TtOQ_QLprY-FwukLUg": {
    "date": "2/19/2012",
    "text": "I was sort of... dreading going here. Please no more expensive, watered-down Thai food. Please no more carved vegetable flowers. Please no more mood lighting. And for god sake PLEASE no more small portions that leave me hungry on the bus home. Patara soothed me with it's... mood lighting, then brought me the kind of food that assured me that (minus carved vegetable flowers and the aforementioned mood lighting) all my wishes would be granted.I started with the Srangwah Hoy Shell (poached scallops) and not only we're they actually spicy, they were the best scallops I have ever had in my life. So well cooked and well seasoned. I also got to try some of the Miang Guaytiew (fresh rice paper rolls) and they were really good too! Really good! Even the completely ridiculous sounding \"Do-It-Yourself Thai tacos\" were tasty and well spiced. What is going on Patara? You were meant to offer me a few curries and some bland spring rolls in oddly shaped dishes, not perfectly executed SPICY FLAVOURFUL food!My main course was a slight let down, I had Gai Yang Kamin (grilled chicken and chilli dip) which came on skewers and was incredibly tender, but so unbelievably sweet I was unable to finish it. I asked for it with Som Tum, which wasn't spicy enough and only okay. The sticky rice was good. I also got to try (a lot) of the Nua Tom Kat (slow braised beef) which was a total five star dish. Zesty, meaty and flavourful and a huge portion!We finished with a mango sticky rice which we all shared, it was presented nicely and was very good. I left surprised, happy and very, very full.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "FHDLnvulXX6JtkH2PgVE_Q"
  },
  "OPxjEM3fSj5Vx__fq7uEyQ": {
    "date": "9/10/2012",
    "text": "Mouth-watering prawn pad thai! The best in london!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k-29JGbG-n7AmL34vw0nHA",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k-29JGbG-n7AmL34vw0nHA/o.jpg"
      },
      {
        "img_id": "OHe0XY7y8GUTG8siQEFeiA",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OHe0XY7y8GUTG8siQEFeiA/o.jpg"
      },
      {
        "img_id": "m1xx4KBGmKhVUZVgqzCevg",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m1xx4KBGmKhVUZVgqzCevg/o.jpg"
      }
    ],
    "user_id": "-tBp9UXVWFqOaostEtAQfg"
  },
  "0ISt1qpIQRFzEplMfKA6fg": {
    "date": "12/28/2011",
    "text": "I stumbled upon this gem of a Thai restaurant when my cousin and I were exploring London and had just left Harrods.I have to admit...I am a huge fan of Pad Thai and other American, basic noodle dishes that have no spice. I am NOT a fan of spice, and the only reason I am deducting a star for this review is that my dish was quite spicy, despite the menu indicating otherwise. I had the Gai Pad Khing (chicken with mushrooms, onion and pineapple). The ingredients tasted so fresh and perfectly cooked. My cousin had the scallops which came with the 2 or 3 spicy star warning on the menu, so I did not try them. I had a glass of white wine. I was a little underwhelmed by it, but probably just a poor choice. There were a decent amount of wines by the glass. My cousin had one of the teas they offered.This place was packed during lunch time and by the time we left there was a wait. I definitely do not wonder why!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ICBH-LQBbM9LRNuMEvy_lw"
  },
  "4MPDMqfm3Wd49FT4Zx5BTQ": {
    "date": "5/4/2012",
    "text": "I would say that this is one of the best Thai restaurants in London. The restaurant is very nice, the staff is super friendly and the food is amazing. The prices are ok for the quality. I would recommend booking a table as this restaurant can get busy.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "012_hfMATnh0nUEi9OYLug"
  },
  "Ewy590VcUOMaHeZiGamOsQ": {
    "date": "4/4/2013",
    "text": "The food was a-mazing, the personnel was very friendly and the service was quick. Although it was a bit too crowded and noisy (we were sitting at a table in the middle of the restaurant), the atmosphere was great and the interior design creates a relaxed and zen feeling. Reservation by telephone or website is recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SosVTNhn_EGjrH3s4FEETQ",
        "caption": "Photo of Patara - London, United Kingdom. Appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SosVTNhn_EGjrH3s4FEETQ/o.jpg"
      },
      {
        "img_id": "Q99A7fL8oTbUkBYogaFzTw",
        "caption": "Photo of Patara - London, United Kingdom. Appetizer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q99A7fL8oTbUkBYogaFzTw/o.jpg"
      }
    ],
    "user_id": "3_dPio0e_WUg1gLpUpp38g"
  },
  "gCt3INSSqm0scJdC_SyAqw": {
    "date": "8/27/2013",
    "text": "Youwant another experience of taste that absolutely amazed you? Thai Patara is thebest for usI'man avid costumer of this restaurant, I love the food they have most especiallythe Tuna Tartare and Nua Tom Kati even their appetizer was really good. I loveit all.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0CKjeGMMqIrZJTwOcm5DUA": {
    "date": "3/11/2012",
    "text": "I went to Patara tonight for dinner with a friend.  I really enjoyed my meal. In the US, the picey, zazzed-up Thai places are becoming very common and of decreasing quality. I was pleased by Patara. We showed up tonight (Sunday) without reservations, to find a restaurant whose main dining room was basically full. But, there was space for us, and we were seated immediately. The decor is pretty nice, not too overdone, except for the giant replica Buddhist monastery in the center of the room.We ordered two appetizers, a curry, and an entree, as well as two bowls of rice, for the two of us. It was plenty of food. All of that, plus a couple of beers, and the check came to about 75 pounds, which is not too bad, considering the food was pretty good. I'll probably never go back, but that's just because I'm in London infrequently, and there's so much else to try here. But, you should give it a whirl.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwikJQ1LXMVbgv6ujIuxxw"
  },
  "-gLHeaESh_95f5EdYoDSVw": {
    "date": "11/30/2011",
    "text": "The customer services was fantastic and the food was mouth watering. The atmosphere was buzzing on a busy Sat night but I'm happy that it didn't take too long for the food to arrive. We were not rushed and all in all, my friends & I had an amazing time!We were given a choice of a set menu or order off a la carte and we chose the latter. For starter I had the assorted rice paper roll, for main it was tender beef fillet with shitake mushroom & broccoli and for desert it was caramalised banana. They were all mouthwatering and highly recommended. The portion was good size so no one left with an empty stomach!  For the price we paid, it was very good. Make sure to reserve a table as this place gets busy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aWwYZLBuOOWpH-wGqN9q6Q"
  },
  "Wubbj2BVSiF40Ov32g7Hug": {
    "date": "6/20/2011",
    "text": "After much sauntering around Soho peering through a series of less than inspiring restaurant windows, I stumbled upon Patara. The first thing you'll notice about the place is that they've positioned a large bush directly in front of the menu outside, making it rather difficult to get a look at what they have to offer.Never mind, this only served to make me look inside and it is beautifully styled. Dimly lit with dark woods galore and a centrepiece in the main room that looks like a scaled-down Buddhist temple made of solid gold. Nice!Staff were immediately attentive, taking our jackets and showing us to a table. It was quite busy for a Monday night, and despite not having a reservation there were no complaints or waits and a table was promptly found for us.On a purely aesthetic level Patara has a lot going for it. There is an air of quality to everything from the menus to the cutlery and the tables and chairs are solid and reassuring.Having poured over the menu for an eternity, we decided not to bother with starters and opted for just a main course each, rice and a side.I had the ubiquitous Pad Thai Jay accompanied by the Pad Hed Hom and was ever so slightly disappointed. Although tasty, the dish seemed a little lacking. Not enough nuts in with the noodles and a little too greasy for my taste. The broccoli side dish was exactly as expected, well cooked green veg with oyster mushrooms and a garlic sauce. The two went very well together, but as I said, didn't light up the world.Where things started to get interesting was when the Gang Kiew Wan Pak was served. They do a good looking curry in Patara, and I wanted to switch dishes immediately! Served in a gold bowl, heated by a candle underneath we were hit with a wave of the most beautiful smell I've encountered so far in 2010. The portion was big, and accompanied by our choice of wholemeal jasmine rice.From this initial experience they've done enough to convince me that the rest of the menu will be of a high standard.Can't wait to go back.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iQxmfQjilimD9tj40S8piA"
  },
  "d-bY68QQn2Rg0k2YguAfrA": {
    "date": "8/25/2012",
    "text": "Ah Patara, I've avoided giving you a review for a while (this review will show my mixed feelings).Patara (Greek street) is part of a small chain of Thai restaurants. It is possibly both my girlfriend's and her sister's favourite restaurant, so I was there recently with both.First off, the food. It is very good, I had a beef starter special which was cooked just right then a green curry with rice that was spicy whilst allowing other non-chilli flavours through. Other diners had various other dishes and everyone was satisfied. We ordered various desserts, I had the sticky rice with ice-cream which was ok-ish.Now on to drinks. I had a rather disappointing lychee martini, though other members of the group were more than happy with their cocktails.Decor - very nice, neither too bring or very dark, the place is tasteful, clean and classy (including bathrooms). There can be a very good atmosphere when the place is quite full.Service is very good, staff are attentive and drinks are brought quickly.So, why only three stars? In a word, price. Patara might be the best Thai restaurant I've been to in London, but not by much. There are other places where the decor is not as good or there isn't a big cocktail menu or special dishes, but where you can get traditional Thai dishes for less than half the price of those at Patara (Their green curry is £14.50 excl rice) which taste just as good. I can understand why they might charge a lot for more for their less standard dishes, but if you just want a nice relatively traditional Thai meal and don't need to be sitting with the trendies it is hard to justify the £45 (incl 1 cocktail and service) I  spent for three courses, when going a little more downmarket could cut your bill in half.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxTsGFsH-hDLhpudzGBU9A"
  },
  "bwhHvf97XPTmpvrVrw_8Bg": {
    "date": "11/20/2013",
    "text": "The review is for this particular restaurant which is on Greek street. The one which is off Regent and the second one which is on the Knightsbridge are much better quality food. (Top of the chain- the one in Vienna).  Timing is good. Food varies. The spring rolls were little oily, but not dry, so- ok. The rest was also \"ok\" quality: they put too much sweet coconut milk in the shrimp Thai Curry and had very little lime leaf. Also added alcohol in it didn't make the shrimps taste on top of it structure, but rather covered it delicacy with over sweet and not well balanced sauce. It was eatable, but needs improvement in cooking skill. The rice noodles tasted of meat grease covered with dark soy sauce and thick piles of lemongrass, you cannot chew because they weren't cut in a proper size. So that dish was \"ok\" quality too. But \"ok\" isn't the level for such place as Patara. Known worldwide for its best healthy quality food and impeccable presentation. We ordered fried banana for dessert, which came like has been warmed up a little, not fried, soggy and tasteless. The ice cream was good, but isn't made in the house. So- in this particular place is a disappointment. Add to it the Bellini cocktail- simple to make and always so delicious at Patara's in Vienna, the one they brought wasn't tasty, because they didn't use it right proportions of peach syrup in it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACP5G9Mu3r88u2wtHsgulg"
  },
  "oRxk5G1m7xfcyT7FRLfjIQ": {
    "date": "5/30/2011",
    "text": "I haven't had a lot of Thai food before, so my memory of Thai cuisine is some strange herbs mixed with coconut or different kinds of curry, not a very good memory indeed. (no offence to dear Thai friends). However, Patara set the new standard of how a fine Thai cuisine should be for me.-Impressive ambience.-Attentive services.-GREAT FOOD.I ordered a king scallop in chilli sauce for starter. Very unique, especially the very Thai style spicy. Very very fresh ingredients!! Main course was Char-grilled Marinated Chicken. I think this is a more modern touch of Thai cuisine but it definitely delivers the traditional flavour your are looking for. The salad makes a very good complement.Consider the fact that it is a fine dining restaurant, price is acceptable. For me, I will come back.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WFN3iepdDI5twhkBW-9ivw"
  },
  "zXCs_2Jgum8jiTyn-0789Q": {
    "date": "12/21/2015",
    "text": "Very very bad experience....I made reservations for a Monday evening dinner. First, it took them 20 mins to get my drinks order. Then, they came back 35mins after I placed the order to tell my appetiser was no longer available. Then after waiting for 45mins, they tell me it's very busy, the food will take longer....how long? No one knows. The staff is a lost cause- they barely speak English, service speed is horrendously slow, food is below average if you ever get it. Never coming here again, God know how they opened 4 branches in London! STAY AWAY!!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lSqYyhoRQruXCJZmTbrGbQ"
  },
  "99peyfDY8Gg8RrPkW_UkCA": {
    "date": "11/7/2014",
    "text": "Excellent. the menu seems a bit pricey but the 15GBP 'business lunch'  2 -course offer is well worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSg-K15L5Syy4biOddGrWA"
  },
  "khsLP1OMfTn7dpUmIlGhZg": {
    "date": "10/27/2013",
    "text": "I love thai food - this is definitely the best value thai place I've been to - not saying it's inexpensive, but it's worth what you pay for it! Generally as good, if not better than Blue Elephant and far less expensive. The lamb shank red curry and the beef in green curry coconut reduction were both exceptionally good!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3_QUmrqK1wunXqOCfUxow"
  },
  "AY7nYhhTdds9kMwIE6PDIg": {
    "date": "12/12/2013",
    "text": "Admittedly, I have not tried everything on the menu and I've only eaten here once, so I'm working with limited review fodder. However, everything was extremely delicious. I like Thai food, but it has never been my go-to meal by any means. I have been having dreams about the red curry from this place since I had it over a week ago. The decor is nice, they keep your water glass filled, service is great. It's a little expensive to be a casual Thai dinner since there's so much good Thai in London, but I will be back for more of the red curry. Oh yes, I will.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "Lq3A7wc36P1bOvQLujYXIg": {
    "date": "1/23/2011",
    "text": "It's so worth a trip to Soho to visit Patara. ...really some of the best Thai food you can get in London. All of the dishes we tried were beautifully presented but more importantly were equally delicious. Standouts included the nua tom kati (braised beef that literally falls apart on your fork), goong-nua yang baichaplu (shrimp and beef satay wrapped in leaves), and I can't recall the name (aka I don't see it on their website), but the corn fritters are an absolute must have.Service was solid, and the atmosphere was upscale.I most definitely will be back....it was that good!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "H9nDkdVzE0MX8VwuXaqJZw": {
    "date": "3/13/2011",
    "text": "Potential Perfection at PataraWent to Patara with a new friend in London on Friday, March 11th and had an amazing dinner.- Lamb leg curry- Pad Thai- Prawns with snap peas- RiceThe service at Patara is ALMOST impeccable. Extremely friendly staff. When I ordered beer at the bar, they said they would bring it to me in the waiting room and they did promptly.The decor is beautiful and ornate without being gauche. It reminded me of the nicer OSHA restaurants in SF. I can only give this 4 stars though, because it took 3 times for me to ask for rice before we received it. Quite unfortunate as I really would have loved the rice at the beginning of the meal to soak up all the wonderful curry sauce.The food is exquisite. The ingredients are fresh and the sauces/curries do not overpower the freshness of all the elements. The prawns in both dishes were HUGE! And interestingly enough, though I feared smelling like a curry house once I left (which happens at many restaurants that use too much grease and have poor ventillation), none of my clothes smelled bad. I know this for a fact, because I didn't get any dirty looks or sneers from people when I was on the tube. lolI will definitely return to Patara--Well Done!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "4yUd-vuVC6Tcp7wsS6uTyA"
  },
  "skSery7ClOW8uvIBvLvnlA": {
    "date": "7/5/2013",
    "text": "Came for lunch, and while it wasn't advertised, there's a great lunch special deal. Full size appetizers and a smaller lunch portion. I had the pad thai, which was okay.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mONBhqFd98aDmWhdhqYemw"
  },
  "nUTIlEoSu2KMkUqGXF4w7A": {
    "date": "3/20/2014",
    "text": "Excellent Thai! The best I've had yet and lament that this restaurant is so many miles away from home.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITYLgj9Va51-SzZQpmkA3w"
  },
  "uJTd3vJwjFLnG6HcZSlapQ": {
    "date": "10/4/2014",
    "text": "Excellent food, very good service.My cocktail was very good.I had coconut milk chicken soup of some kind which was very good.The service was friendly and attentive.Cool space and good ambiance. Definitely recommend it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "w0Ioa6p8Rnu48cel4GW6TQ"
  },
  "AOl5TwARN9GxUYjbOn-PGw": {
    "date": "11/5/2012",
    "text": "This was one of the first restaurants I tried when I moved to London about 5 years ago and have to admit it is the best Thai food I've had.  I feel that all the dishes you can't go wrong with.  My fave is the lamb shank curry - it is really cooked to perfection.  My 2nd fave is the sea bass.I've been here a number of times and the only reason it gets knocked down to a 4* is that the service was really bad.  Maybe it's because they sat us at the corner in the back of the restaurant but they wouldn't even notice us when we were waving our arms around with desperation to get some attention.  When we finally got someone's attention, she would get flustered and say it's not her table and she will send someone over soon.  Being American I hate not leaving tip - but not why to tell them it was bad!  I told her I'm fine with paying the service fee but felt that it was really bad service.  She didn't quite understand and said - it's fine if you don't want to pay.  I said the point is - I really like this restaurant and hope that the service improves as it's the worst I've ever experience.  She was kind enough to bring us some thai mangos.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "0pr6lLIwQn7DExDL8EBLhg": {
    "date": "2/23/2012",
    "text": "I've been to Patara at least five times - with just one other person, with up to 5 other people - and it works well for all occasions. It is one of my go to restaurants in London. Some notes from my last visit: - Skip the dumpling starter; not bad just nothing special and frankly, a little odd.- Soft shell crab with green mango saladThe crab was so hot, tender and tasty next to the transcendant limey, sweet, nutty, spicy mango salad. My dining companion was in ecstasy as he ate this. I'm not sure which I liked more: watching him eat it or eating it myself. Either way, order it.- Presentation was nice on everything, as always. I dig their little flourishes (carrot flowers, anyone?)- Corn fritters remain a fun starter, with their lovely accompanying cucumber salad.- Don't miss the spiked ice tea on the drinks menu. All the lovely taste of Thai iced tea...with booze!Patara could take it to another level if they downplayed the sugar and upped the spice but I still remain a serious fan.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "Bs4nGX5TPgNP98_F8YomDA": {
    "date": "1/4/2016",
    "text": "A little pricey, but some of the better Thai food I've found in London (though I'm early on in my search!) Enjoyed the beef green curry, and the chef was kind enough to adjust the spice level for both of us. I'd go again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9ikZJ39zQeMc2RX9W4aPQ"
  },
  "M1aNWC2jaXPiN3O_4t9PUg": {
    "date": "1/31/2017",
    "text": "went there for lunch, not very good thai food. not as authentic as what I expected for the price that I paid.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w60EUG_C6iDM5Xd2J-a0Ag"
  },
  "qFOXdsoUfT11ZxwSaG_W8Q": {
    "date": "11/23/2014",
    "text": "The food was good, although our shellfish was a bit undercooked. I wasn't ecstatic about the service as it wasn't very busy and we waited several times to order different parts of the meal.Overall, I would suggest this to someone looking for a good place to eat, but the Thai was a bit bland for even my pretty tame tastes.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGNdgoQESLzDAy_oefMmSQ"
  },
  "l_KgHWyaRALTwNK5Z6GGdA": {
    "date": "7/12/2014",
    "text": "Great Thai  food with an interesting twist. The coconut beef was good. A little dry but the favors were wonderful. The wings were my husbands favorite. He had a lovely Thai tea. He said it was one of the best.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "frrm-e0UTQb1WN_8cbEBhA"
  },
  "7kvA4I486lx9_0zqhQzolg": {
    "date": "8/16/2013",
    "text": "Patara is well-known in London for great Thai food, and has a few locations in London. This place is easy to deal with because you can book tables on toptable.com.The Soho location is a pretty glamorous spot, and good for a loud, lively group dinner out. (I had previously been to the Chelsea location which was quieter.)I was in the mood for beef, so I enjoyed one of their signature dishes, which was beef in spicy in a creamy red sauce. Paired with sticky rice (\"glutinous rice\" - not glutenous) it was delicious.Gluten free notes: Most Thai dishes are naturally gluten free. Watch out for soy sauce. Curries are a good option.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "Sze0ps_ZC3d1W61yeWkIqA": {
    "date": "8/29/2013",
    "text": "We had heard that London has excellent Thai food and a visit to Patara on a recent trip confirmed it.  This is high end Thai cuisine with prices to match, in an elegant and subdued setting.  As tourists we weren't particularly dressed up but still felt comfortable given mix of tourists, business people and casual diners.  Every dish was delicious.  Even the pad thai, a fairly standard dish in my book, was extraordinary, topped with a large king prawn.  I'll never look at pad thai the same way again.The waitstaff are all Thai and were efficient though I wouldn't say they were particularly effusive or friendly.  Still, we let the waiter know we were in a hurry due to a theater show and he got us fed and out the door in less than an hour.  I would definitely return to this or any other Patara location for great Thai food.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-atxx_G9W1sXZ1RYDqUSVg"
  },
  "O7eOP77XKDBEQ91cCaZpDA": {
    "date": "10/28/2014",
    "text": "Exceptional food, soups were the best ever. Lobster and beef dishes are good enough to come back for.  Service is meticulous if unhurried. It will be on our London list.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ns993S5aMEJ4TN4ty91Fg",
        "caption": "Photo of Patara - London, United Kingdom. Very unusual and compelling beef dish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-ns993S5aMEJ4TN4ty91Fg/o.jpg"
      },
      {
        "img_id": "m-hKdg4obAfOsleDluf0aQ",
        "caption": "Photo of Patara - London, United Kingdom. Excellent",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m-hKdg4obAfOsleDluf0aQ/o.jpg"
      }
    ],
    "user_id": "Pucll8ZJHW1GtRCdPDvweA"
  },
  "0OeqqPcvqftJtsseuUo3ww": {
    "date": "12/7/2012",
    "text": "First of all, I have to say I have tried so many Thai restaurant in Asia. And Patara surprise me as it does the Thai food so traditional, original way. Its easy to find, so many great restaurant on Greek st. just next to my favorite korean 'Bi Bim Bap'. Nice table with just 2 ppl, the plates are just ok to fit on such small table. The chips are free, and they are nice. Drinks - guanabana juice and mango juice. its great! love it!Soup - Dong Yim Kong Soup, its ok, i rated it for 5/10Main course - FIsh(£19.99), prawn curry, chicken+veg. Sorry couldnt rmb the name. Brown rice and pineapple seafood rice. i have to admit that the pineapple seafood rice is 10/10!!! O M G delicious! last but not lease, the dessert, we tried the mango with sticky rice. Again, 10/10! I love to recommend this with frds!Its about 50pound pp. The service is ok, staffs are very nice!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "scj1GjMe6JOq_TEk8Wx4CQ",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/scj1GjMe6JOq_TEk8Wx4CQ/o.jpg"
      },
      {
        "img_id": "mNsUHsXcvRd4meFnwCIQaw",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mNsUHsXcvRd4meFnwCIQaw/o.jpg"
      },
      {
        "img_id": "dwICheez1ElOOhcSiYEl0w",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dwICheez1ElOOhcSiYEl0w/o.jpg"
      }
    ],
    "user_id": "jCiAsX7ICz1j7opyjS75yA"
  },
  "IQgleOtOE7RQzXL59iklBw": {
    "date": "1/21/2011",
    "text": "I have a pet peeve about airport bathrooms. See my distaste for certain elements of MCO's feng shui [bit.ly/eSt1i6]. I've been in a few seedy bathrooms in my life (say... a visit to the trough at WeHo's Fiesta Cantina [bit.ly/ePExbV])... Even so, I was wholly unprepared for the facilities that Patara offers to its gentlemen clientele. Not only is their urinal a trough... I realized with stunned amazement that even if I -tried- to avert my gaze from peeking/observing/sketchily cruising someone else's junk by staring straight ahead (which would normally be my tactic), I -still- wouldn't be able to avoid doing a little ogling.\"Why?\" you might ask. Well... it may have something to do with the gigantic head-to-waist sized wall mirror that's either intentionally or abysmally placed immediately above said trough. I like peen as much as the next gay, but that's just unnecessary. No, seriously.Anyway, choice of toilet design aside, Patara is exceptional. The servers float, the beer is cold, the dishes are all beyond reproach, and the decor is captivating. Between the dramatic lighting of wall adornment and the imposing candlelit temple in the center of the dining room, there's plenty to feast your eyes on. Your gut won't go empty, either. Each dish was more delightful than the last. I doubt you can go wrong with anything on the menu.This isn't your standard cheap eats Thai fare. Just know that you get what you pay for at Patara. And perhaps an eyeful more than you bargained.",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 9,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "fM0pUcXzBLel_Flr69yojA",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fM0pUcXzBLel_Flr69yojA/o.jpg"
      },
      {
        "img_id": "NSUXu4_ch7eTIjk7wNZ0fg",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NSUXu4_ch7eTIjk7wNZ0fg/o.jpg"
      }
    ],
    "user_id": "RmXIjppHNtVveguN10iO1g"
  },
  "IVAKk-f_SnqoDa25wdY8Ng": {
    "date": "1/13/2014",
    "text": "We seem to be on a roll of average London these days - as was our experience at Patara.There was nothing wrong with it, the service was ok if a bit slow but it was a friday night and the food came fast enough so we can forgive that.The ambience was ok, we were seated downstairs and the one criticism I have is that it was VERY loud - we ended up leaving fairly quickly after desert rather than to linger for another drink because we couldn't really hear each other.The food was ok, I guess. The best dishes we had were the Sragwah Hoy Shell King Scallops, Yum Mamuang Pooh Nim (a bit underdone but flavourful and in a spicy broth) and the Yum Mamuant Pooh Nim Green mango salad with crispy Thai soft-shell crab (crab was very good, salad not too sweet-sour but with lots of peanuts and cashews)The Senjan Pad Thai was good pad thai with big king prawns, the Tuna Tartare was ok but slightly forgettable, and the Nua Tom Kati slow braised beef came in a really good sauce but the meat itself was oddly dry, it felt like it maybe wasn't fatty enough to braise in this style? The sticky rice was good but eat fast, it was nearly hard and unwieldy by the time we were wrapping up the meal and I tried to sop up some of the left over sauce.For desert we had the Banana vanilla ice cream which I really quite liked!I wasn't amazing, it wasn't bad, I wouldn't throw a tantrum if someone invited me there but I don't have any desire to go back either. It was also expensive enough, although that might just be the par for the course.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6Blr6-hVZ6zsgkZdVcivw"
  },
  "oM6Ea9V2exyOmdULN5WqZg": {
    "date": "5/30/2013",
    "text": "Thank you YELP. We found Patara on the map looking for good Thai. Amazing food - excellentWhy did we only give 4 stars? An Asparagus side dish for £8.95 ?! That's just cheeky",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6lxnYSNtjdNkbbZ5i2kEw"
  },
  "i6qXwBrkhLAIFGYLGZSo9A": {
    "date": "8/15/2015",
    "text": "Well wellGood atmosphere - decent food - quick service but ultimately not worth the check at all!80 quid for starter, salad and two mains with beer and one drink strikes me as bad value for money. With so many great options in London - would certainly never come back here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPWttzBXIpoBMVrybA1vSA"
  },
  "oHx5_W2lcK90K9wdlUvCdg": {
    "date": "8/5/2015",
    "text": "Nice space, lovely staff, but horrifically overpriced for pretty but mediocre Thai food. The tom yum soup was phenomenal. To die for. But everything else -- green curry, an overly vinegary basil noodle dish, mediocre chicken satay, really gross stuffed chicken wings that my son wouldn't even touch, and an absolutely meh and ketchup-y pad thai -- was disappointing. I'm giving a star for the soup and the service. For the overall meal, especially in light of the cost, I'd give a half star. Go elsewhere!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nIbKfK5c5rTdGt8KS0llEg"
  },
  "dmt4I-C9nwvstwaoqGAWPA": {
    "date": "6/17/2016",
    "text": "Great food. The flower dumpling was a surprise. It was sweet. But still good. Lamb with papaya salad was delicious. Tender and refreshing. A good combo",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE5m1mglgwwUGZpqb2_4eQ"
  },
  "wHqZn8PqKySulPKX2MjNMA": {
    "date": "6/12/2010",
    "text": "lovely place. Went there with a friend of mine, and I think her and I were the only people in the restaurant who were NOT on a date... two levels, we were seated ine the eating area below (maybe b/c they thought we were on a date)mocktails - greatcocktails - really goodwe get a bunch of apetizers as we want to dine tapas style.  The green mango salad with tempura soft shell crab - I highly recommend (on the spicy side, but very refreshing) the new zealand lamb skewers with dipping sauce - also very tastyThe king prawn pad thai is also very tasty, and I could just have that myself (comes with 4 king prawns grilled to perfection)prawn crackers - the usual crackand for dessert, we got the baked banana with vanilla ice-cream and toasted almonds.... well that was so good i forgot to take a picture.so for two peeps, it came to about £60, and they include 12.5% service charge in the final bill.service is attentive, and relatively quick. a perfect pace for a friday night.though we pretty much stayed until lights out... well actually lights ON, i would so go back again... maybe on a date this time :)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1ixBOituybLrN_6rsRQCZA",
        "caption": "Photo of Patara - London, United Kingdom. green mango salad with tempura soft crab shell.... yum yum yum (a little bit of tolerance for oil is required)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1ixBOituybLrN_6rsRQCZA/o.jpg"
      },
      {
        "img_id": "KbQjGPt54GM-Ojtz8jIfTg",
        "caption": "Photo of Patara - London, United Kingdom. seared scallops - they were nice, but i've had better (would pass a second time)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KbQjGPt54GM-Ojtz8jIfTg/o.jpg"
      },
      {
        "img_id": "YF2EJOt7MgfAlr_mJrQyKw",
        "caption": "Photo of Patara - London, United Kingdom. new zealand lamb skewers with dipping sauce - tender, and juicy. i laik!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YF2EJOt7MgfAlr_mJrQyKw/o.jpg"
      }
    ],
    "user_id": "na3UYTLl5dFNrHrOurmM6g"
  },
  "kEPh6kDXul24QwWpZXXwwg": {
    "date": "8/16/2012",
    "text": "Great place in Soho albeit a bit expensive.  Def good Thai food and the place was packed on a Friday night.  There are so many good restos in the area, but this for sure a top 10.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FQ2eijhNd6OE1V-zAutR7w"
  },
  "307x21ItFZu1XDqUQEvaKA": {
    "date": "4/5/2016",
    "text": "Just so expensive for thai food of equal quality --- service ok, food fine ... you can find equally good thai food at half the price.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5n_ePxN2z_zWvI1lBZVvQ"
  },
  "NORNMzirL_kx4v-H2sumAA": {
    "date": "3/12/2016",
    "text": "I would like to tell you how I tried their food and rave about it and tell you how much I liked it and that it was worth the trip and the wait to be seated and that it must go on to your eat at list of places in London ... but unfortunately  I can not do that Our group entered  and was asked to sit and wait for a table  ( as we see empty tables in various locations around the restaurant ) We sat and sat and sat and waited some more then we start to  notice people walking in behind us were being seated before us,,, groups of 2  or 3  and one group of 4 ... now .. I stand up and walk the 3 steps to the counter and inquire when would be seated ...    The lady says  OH  your waiting for  a table ...  Yes I respond...  ( I don't usually just walk into a restaurant just to sit down in front of the  reception desk for a breather .... )    so I go back and sit down as she confers with the other staff..  we get to talking between ourselves again and lose track of time ( say 5 to 10 min )  then it dawns on us we are still sitting here and that the 2 people that just walked in are being seated at a table for 4 right next to us....... At this point I am done ... I get up and let the lady know she can take our group of your list as we are going to go eat elsewhere... and she didn't even blink or smile or say sorry or anything ... almost like this is a daily issue  with them ... W O W",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IE2o_LrMFLzptToCzQYEXA"
  },
  "ceMFWtWERU8omLBbaedAug": {
    "date": "9/5/2012",
    "text": "I'm a big fish fan and my dad told that I had to try the whole fish here because it would be amazing... He wasn't lying.The dish I ordered was called the Pla Tod Sauce Takrai. It's a deep fried whole sea bass that's covered in tamarind sauce. The most delicious whole fish or fried fish I've ever tasted. The only reason I didn't give this place 5 stars is because I felt the appetizers were average, especially given how unbelievable my fish was. Definitely highly recommended for anyone in London. Delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cp7OjeW8pipRT_rXWeqlBQ",
        "caption": "Photo of Patara - London, United Kingdom. The best fish ever",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cp7OjeW8pipRT_rXWeqlBQ/o.jpg"
      }
    ],
    "user_id": "_muhtS8ZFnV61s7Q4JXDwQ"
  },
  "w54d2xyQFVTqCGlFVsc7Hg": {
    "date": "6/29/2017",
    "text": "Excellent fresh Thai food! Highly recommend the Chor Muang dumpling appetizer, the Lime-Chilli Sea Bass, and the Kieaw Wan Beef.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pHmYnvI0E72lr5Uy63R9Ig"
  },
  "VKWwCYRmAkfhGCnGb79G3A": {
    "date": "10/19/2015",
    "text": "This place was absolute amazing!!All 5 dishes were spectacular!We couldn't of had a better experience and amazing lunchWe will definitely recommend this place to anyone!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPqJwZBIyvoy0CxR0Q8lJg"
  },
  "qQuoFDPByINDnCEvbXI07w": {
    "date": "9/6/2015",
    "text": "Fantastic meal, cannot fault any of it. The closest thing to eating authentic Thai in Thailand!We had a green curry chicken and chicken papaya salad  (I forget the name) - both different but utterly amazing and the very best I've had in Europe (and I've had a lot of Thai here!).Even the desert was amazing, we had the mango cheesecake - to die for!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1d-lMourvpa4F0tg4s7zQ"
  },
  "iPz3FTiIGEv0vx_jXm0SuQ": {
    "date": "5/13/2015",
    "text": "It's a been a long six years since I visited Patara, but I have memories of an amazing meal there.So, I brought myself and three friends last Monday as I remember it having great vegetarian food and as a fan of Thai (and admittedly missing the cuisine amongst other things) I figured it was about time I returned.So, decor:Nicely decorated, good ambience, good coloursVino:We had some good vino; not much I can think of to say!Food:Yeah, baby. Just as good as I remembered, took me straight back to the beaches of Ko Phi Phi.The only thing I would say is that, I was still kinda hungry afterwards! Think this would be have been about £30 per head + drinks, but the flavours, yes are wonderful.Would I come back? Hm..Im sure there are other Thai places to try, so we'll have to see!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JeTyxMflxvCvKlvWQIb9g"
  },
  "r7xJpVQt2Xg6T-ovedkgXw": {
    "date": "7/31/2016",
    "text": "Best chicken pad Thai I've ever had! Everything was delicious!! We enjoyed chicken dumplings, corn fritters, spring rolls, and delicious drinks! Highly recommend going.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJPpXWSzwiKrcmwsaq4wpA"
  },
  "0V4CWd5x7tS6M01UGreqsQ": {
    "date": "3/22/2013",
    "text": "An American friend was in town for a visit had a really bad craving for Thai food. I looked to Yelp for a place that would be a good representation of Thai food in London. This place came up with highly rated by fellow Yelpers and Elites, so I went ahead and booked this place online.Their online booking process is easy, no need to call.Their waiting area was unlike any other waiting areas I have experienced, they have booths set up so it doesn't feel like a waiting area, they serve drinks and prawn crackers while you wait for a table or wait for the rest of your friends to show up.Speaking of prawn crackers... some of the best prawn crackers I have ever had.Friends really enjoyed the food, the decor is lovely and their toilets match the rest of restaurant's decor. (I really love when restaurants do that.) It is a bit pricey, but they make up for it in their food and decor.Personally, I ordered the pad thai with prawns, plating was very well done, but my prawns were tasteless, so that was a bit disappointing.Though knowing my friends enjoyed it, really all that matters.I'd definitely come back here to try some other dishes, if not just for the prawn crackers.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOzTi_wIS2Gajy90pscoMw"
  },
  "0r-5GNugy5mkI3WoVugTJA": {
    "date": "3/12/2015",
    "text": "The food was good but I am not sure it was worth the huge price tag. It wasn't really any better than other Thai food we have had that is a fourth of the price. The only thing better about it was the ambiance - the place was really nicely decorated.The service was fine - but they tried to upsell us 4 times which was incredibly annoying. On our own accord, the bill was 80 pounds - we really didn't need to be up-sold on anything. We each ordered a cocktail - a manhattan for my husband and I ordered one of their champagne cocktail with vodka and lemongrass. The manhattan was very sweet and a little watered down - definitely NOT a manhattan. The champagne cocktail was very small and definitely light on the liquor. I wouldn't recommend those.Then we ordered Tom Yum which was delicious and spring rolls.For our main course we had Pad Thai and the spicy coconut beef roast dish which were quite good. The beef dish was more unique and delicious. There was nothing wrong with the Pad Thai but I really had no idea why I was paying such a high price for it - I have had as good or better Pad Thai elsewhere for a fraction of the cost.We were so excited that they had mango sticky rice, but unfortunately the mango was incredibly sour - it was disgusting. They didn't check back in on us for a long time so we ended up eating the sticky rice and avoiding the mango. Thankfully, they did take it off of our bill at the end. Not a great way to end the meal, though.It was my husband's birthday and I wrote that on the reservation, and they didn't even say happy birthday to him. Thus, I wouldn't necessarily recommend this for a special occasion if you're expecting nicer treatment.Overall, it's a fine place to eat. However, I think there are better places to go for a nice meal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "q7IgbnTHCJF5MNAP4hU8yA"
  },
  "T6GE4U-mgQeBNL8uL5TOrw": {
    "date": "8/1/2015",
    "text": "We had:Vegetable spring rollsLambChicken green curryMeal was average. Chef needs to lay off the pepper so you can taste the other flavours. Good ambience and attentive wait staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_f142a--de8j35hQN1AAw"
  },
  "fqZSs9-92NUFokJqKNGMJg": {
    "date": "8/10/2015",
    "text": "I'm familiar with Thai food because my wife is a Thai. I can tell you that the Thai food here is even better than the authentic Thai food back in Thailand. I'm so happy that I'm able to taste great Thai food aboard. Please come and try if you are in London. You will definitely be impressed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A3oREMD7F_Ss-O9tvb93pw",
        "caption": "Photo of Patara - London, United Kingdom. Tom yang prawn. Thai fish cake and green curry chicken.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A3oREMD7F_Ss-O9tvb93pw/o.jpg"
      },
      {
        "img_id": "07cRnDGW5fsF5gDxcBk_qw",
        "caption": "Photo of Patara - London, United Kingdom. 1st customer for dinner. The place is really beautiful and relaxing. Like a massage spa. 2 thumbs up!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/07cRnDGW5fsF5gDxcBk_qw/o.jpg"
      }
    ],
    "user_id": "wsKx_XTnnWeUeyw6BS8LIw"
  },
  "vkKr7edvUUPQb8b4PhqdOw": {
    "date": "10/29/2014",
    "text": "Great decor and ambience on the main floor but a bit more mundane in the basement where our group was seated.The food was good. High on presentation but for me the balance of flavours was overwhelmingly set to 'sweet' on most of the dishes and not balanced. Tom Yum soup was fairly good but really lacking any decent spice level which I look for in this soup. My main of red curry with duck was flavourful enough but again lacking any kick whatsoever and too sweet.I know that not all Thai food is supposed to be spicy but because the flavours are so big, it does need to be balanced. Perhaps the menu is designed for people who don't like spicy food (even the menu descriptions only go as high as medium spice) .Portions were relatively small and prices fairly high.Very good and attentive service which was reminiscent of Thailand.Overall it was a good experience but not the high end Thai experience I had hoped for. This would be a 3.5* rating for me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "ABmuD-1Diq9jqDre1mQV0w": {
    "date": "12/2/2014",
    "text": "5 stars for the food. They have a shrimp dish they call \"POO\" - something. If you like shrimps, you have been put on this earth to eat that dish. Best prepared shrimps ever with a tasty and hot spicy sauce. Really good stuff. Yumm. I wanted to order a second plate just because it taste soo good. Service could be a bit better but if you are used to Amsterdam, it's very good. Atmosphere is nice, a bit romantic. Patara passion fruit cocktail is also delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euB-Ejii11vwwgbK2C-Ilw"
  },
  "58SZVODlmXjFUy8OWvWiYQ": {
    "date": "6/17/2015",
    "text": "The fantastic starter of fish cakes came beautifully cooked and a good portion.  I could have happily eaten more.  The other starter didn't disappoint either, the crab, prawn and duck summer rolls were delicious.I particularly enjoyed the chicken and chestnut stir fry.  Chicken and creamy chestnutswith coconut rice.  The Pad Thai was beautifully presented but was overpriced.  I have tasted better also.The mango cheesecake with salted caramel ice cream was just the right sweetness.  The other sweet dish mango with sticky rice was not presented well.  It was a very small portion with salty sticky rice.  Not to my taste.  Very bad value.The service was a bit complicated, we had 7-8 servers.I do recommend this restaurant.  They serve fusion Thai food with a modern twist.Very tasty and a nice treat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU-ZbzQ-GLDoqOIzNTuT0A"
  },
  "mkb0s7Mm1a2QqJFL0JHEwg": {
    "date": "3/9/2015",
    "text": "This is a great little restaurant. The staff is nice, the prices reasonable - even if slightly on the high end - but I guess that is to be expected in Soho.The food is great! We shared a couple of starters - I had the Pad Thai, which was great and my friend had the green curry. They do claim to have the best green curry in London. Possibly true.I can strongly recommend the place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBxqbEz-XvyqQNzU0NRdEA"
  },
  "KcHV6I-xILbKmLz3cT-5jA": {
    "date": "12/18/2015",
    "text": "Food was average, service was great, price was a bit on the expensive side, I've had better for less. So if you want to pay through the nose for average Thai, this is the place for you.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oqJ1_cbVC-8b2kyB0C1NBw"
  },
  "NIgfHkmgmlJmI3JNkirsMg": {
    "date": "1/21/2015",
    "text": "Decent decor but WAY overpriced and just average food with fancy presentation. Please note that in Thailand, Thai people don't use chop sticks... So why have them here? Ignorance. Also, the menu is sexist with the sweetest, most caloric pink cocktail being described as 'perfect for the ladies' ... barf.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "znOqMFW6sEmnp6ms-BaveQ": {
    "date": "6/24/2014",
    "text": "One of my favorite go-to Thai places in the world, including Thailand itself!They have a few locations in Europe and I always get the lamb curry, which tastes the same no matter which city I'm in. It's fall-off-the-bone tender and absolutely addictive.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f0Awv9obo7lWZQhUh1C_KA"
  },
  "hDsNEMsmQx5uYWql4lwchA": {
    "date": "6/28/2014",
    "text": "Delicious!We were visiting London and Patara was close to our hotel and had great ratings so even though we weren't in the mood for Thai food we decided to try it out and we are so glad we did!  Appetizers:  Kamon Bueng DIY.  Do it yourself Thai tacos and the Tom Kha Gai soup were great. Meal:  Lobster Pad Thai-the presentation was lovely.  Pad Thai placed next to the empty lobster shell.  The food tasted even better than the presentation was.  Perfectly cooked lobster mixed into the best Pad Thai I've had in a long time.Massaman Osso Buco - Heaven for dinner...the tender meat flaked off the bone.  The perfectly seasoned meat melted in my mouth.  The cucumber salsa added a delicious dimension to already amazing dish.  I am thankful for the pita bread being part of the dish so I could use it to sop up every last delicious drop of the massaman.Dessert:  Rice pudding - made with coconut rice and topped with fresh berries it was a refreshing way to end our delicious feast.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "_NUyExk13K9psFiZwU4G-A"
  },
  "T2mjiw64COK-2J3aRn-zBQ": {
    "date": "9/27/2012",
    "text": "My only problem with Patara is that the waitress didn't take me seriously when I asked to move there. I could see myself visiting Patara on a daily basis. I could save myself transportation costs if I lived there. Yes, the food is that good. Thank you, London foodie friends! I came to Patara my last night in London. We enjoyed the tuna tartare, gae pad grachai, srangwah hoy sheli, nua tom kati, and the gati sod sundae. I enjoy their usage of tart and spicy flavors. I love how the nua tom kati melts in your mouth with a meaty coconut taste. I loved their use of exotic fruits in my dessert. I enjoy the realness of their flavors. You are now my favorite Thai restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kNL4SpfIdMC8GywGayDEOw"
  },
  "6d52MyrkNvVrdItvEqp6sA": {
    "date": "8/12/2018",
    "text": "Navigating through Greek street around 09:00pm on a summery Saturday night is an experience in itself, but once you've walked through the vibrant street you find the little Gem Patara.On entering, we were formally greeted in Thai by the front house and shown to our table.Within a minute of sitting down we were greeted by a waiter and asked wether we'd like still or sparkling water. To which we also received the complimentary prawn crackers #hmmhmmhmmmm :) very hospitable service.The decor is Thai inspired, romantically dim and not too loud.Now onto the reason you are here, food... Every course was delicious! Delicious in smell, presentation and of course... Taste!The flavoursome dishes had us reminiscing the explosion of flavours and smells we met in Phuket.The chicken and prawn satay sticks were soft, juicy and not oily. The peanut dip made the commute through London worthy!The lamb was cooked well. The meat literally slipped off the bone, whilst the Prawn and pineapple curry was perfect! Not too sweet, nor too coconutty. The portions are very generous, if personally recommend two rice portions per person.Great value for money. All in all the experience was superb, we will return soon.Kop kun khurp!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uBUNAdWNVxTjuw-G87iimQ",
        "caption": "Photo of Patara - London, United Kingdom. Mango cheesecake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uBUNAdWNVxTjuw-G87iimQ/o.jpg"
      },
      {
        "img_id": "8f_2ABTFvmmec5LebssWtw",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8f_2ABTFvmmec5LebssWtw/o.jpg"
      },
      {
        "img_id": "MjbhMO-PnFW0kuruY0PpvQ",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MjbhMO-PnFW0kuruY0PpvQ/o.jpg"
      }
    ],
    "user_id": "tW8rnrijsQ_bbgtuhtxgGw"
  },
  "MW-kJgo31sLx02Hzzy2Afg": {
    "date": "12/8/2017",
    "text": "We ordered too much I can barely move after the food. It's not the super authentic Thai restaurant that I have had in my life but their ingredients are very fresh. Lamb curry is amazing, please order this when you are here. Appetizers sampler is great too. I am not a big fan of their pha Thai because it's too sweet. If they can serve a side of chili sauce it will be much better in my opinion. Soup is ok I had better ones in the States. One thing I frowned upon was the smell on their water cups. It has dishsoap smell. Not sure why, I smelled two cups both had some odor.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IEQm5T3CpS0d6ammwFvZOg",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IEQm5T3CpS0d6ammwFvZOg/o.jpg"
      },
      {
        "img_id": "ynEOcdXhrgSZD0i1uXxy7A",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ynEOcdXhrgSZD0i1uXxy7A/o.jpg"
      },
      {
        "img_id": "5gOyxWOkXEqhdIXMiQLcCA",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5gOyxWOkXEqhdIXMiQLcCA/o.jpg"
      }
    ],
    "user_id": "C9v0_tQ8iFtgZKONZrGTlQ"
  },
  "oFisjsrpji9ZYcpyXxS82w": {
    "date": "2/17/2016",
    "text": "Any lamb lover MUST try Patara. I come here for the Massaman Lamb Shank - it never disappoints - its slow cooked, the sauce is an exotic mix of spices, herbs, coconut milk, and the lamb just melts off the bone. The marrow in the bone itself is also delicious. (I recommend using a chopstick to get it out or simply sucking works -ish)The milky Thai Ice tea is also quite breath taking. For myself this might be as close as fine dining as i ever get - because yes its expensive, and generally I don't enjoy spending loads on food because my mind always suggests - its never worth THAT much!? But once in a while I splurge - also I tend to come here only when I am celebrating something so I usually am in a great mood.I also enjoy the waiters and waitresses uniforms - its quite slick, and I feel like I am in Bali which is weird because I have never been but its what I imagine the restaurant staff would wear (although Bali isn't in Thailand..!) I love to love Patara - in small annual doses.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8MSJqiMuart1Hd_eOnS-4Q",
        "caption": "Photo of Patara - London, United Kingdom. slow cooked lamb",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8MSJqiMuart1Hd_eOnS-4Q/o.jpg"
      },
      {
        "img_id": "ihHcmF1avpYtGVflklpJQA",
        "caption": "Photo of Patara - London, United Kingdom. Best tea ever",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ihHcmF1avpYtGVflklpJQA/o.jpg"
      },
      {
        "img_id": "jOErHl11UXZS5SYYThaMAw",
        "caption": "Photo of Patara - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jOErHl11UXZS5SYYThaMAw/o.jpg"
      }
    ],
    "user_id": "wIMmumGUqiK5g3tjOdC2ig"
  },
  "Yj7Btgw1kz44GAnRSVLp1w": {
    "date": "2/22/2017",
    "text": "I took myself to Patara for dinner --- before seeing a show in the theater district --- for my birthday.Food was very good and large portions.  But first the TEA --- I had a pot of the full flower jasmine tea --- it was super good, especially given the cold damp evening.    For dinner I had the green curry chicken -- very smooth sauce and not too spicy.Food service was very good --- 3 or 4 different folks served the table --- but everything was out quickly and at the right temperature.   Menu is pretty extensive --- lots of traditional favorites but some new items (or at least new to me) as well.Reservations a MUST for evening.    Dress -- mixture of jeans, suits and nice evening out attire.   Lots of couples and small groups of friends -- theater goers etc.    I think there was another room downstairs for dining but never saw it.The thai garden room was lovely and very relaxing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PQM1AkyvrK-ZU4RaN6XR0g",
        "caption": "Photo of Patara - London, United Kingdom. jasmine tea (full flower)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PQM1AkyvrK-ZU4RaN6XR0g/o.jpg"
      }
    ],
    "user_id": "GW00SiiJGa79W2J3ExUSkQ"
  },
  "2xab6ZLMERHkngvT1t0Hxg": {
    "date": "1/18/2016",
    "text": "I have seen sooooo many good reviews for Patara that I was quite excited to give it a try. We tried:- Rice rolls filled with crab, prawn and duck. They came with a light lime/chilli dipping sauce.- Mushroom-filled pad Thai - This was really nice- Duck with chilli and basil - This was a bit of a let-down for me. It wasn't spicy at all and the duck meat wasn't cooked particularly well. I wouldn't ever order this again.I thought all the food we had was nice, and the service was impeccable...it just didn't seem *that much* better to justify the price. Our meal was £75 for two mains, a shared starter and a bottle of wine. It was all A-okay but didn't blow my mind or live up to my high expectations.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5ptp4EPW5hafA06f69S3xA",
        "caption": "Photo of Patara - London, United Kingdom. Rice noodle rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5ptp4EPW5hafA06f69S3xA/o.jpg"
      },
      {
        "img_id": "_MOmeD1r3aKaTYRsTP3I8w",
        "caption": "Photo of Patara - London, United Kingdom. Veggy pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_MOmeD1r3aKaTYRsTP3I8w/o.jpg"
      },
      {
        "img_id": "thZSyxTWPx4g3K65P01nWg",
        "caption": "Photo of Patara - London, United Kingdom. Duck",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/thZSyxTWPx4g3K65P01nWg/o.jpg"
      }
    ],
    "user_id": "93vyTaJgzQRQO4Zs9Cg_pw"
  },
  "qIXUoSuGRmqpcg9Nn1qbzA": {
    "date": "3/30/2018",
    "text": "Sadly I found this place a real let down, especially considering the price. Of the three courses we had two were fine (green curry and veggie pad thai) but nothing special at all, and our starter (mushroom and tofu skewers) was shockingly bad. Unflavoured, lukewarm and limp. Much better Thai food at Maria's Cafe on Lower Marsh, for less than half the price. And without the absurd overpowering lemongrass scent.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AaFrTyqDcfe_j5PgfOOZFQ"
  },
  "2V7rPLAx82rKXCX5nKK-sg": {
    "date": "3/10/2017",
    "text": "Our anniversary gift from my family to have dinner here! Very luxurious restaurant, great ambience and expensive food. We got some chicken satay dumplings, was something different but tasted good. The mains that we got were lamb shank masaman curry and banana leaf coated sea bass cooked in semi dry red curry. They were so good, really tasty. We also got some pancakes filled with pandan custard and served with ice cream and fruits. Didn't like the pancakes much since it had a very strong egg smell. Ordered Thai specialty cocktail, butterfly something. Overall we had an awesome dinner!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QzLC0xOkUaLDhhKdVSDo5Q",
        "caption": "Photo of Patara - London, United Kingdom. Pancake filled with Pandan Custard and served with ice cream and fruits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QzLC0xOkUaLDhhKdVSDo5Q/o.jpg"
      },
      {
        "img_id": "lM1MJZTec2uJBxr-N_bLxw",
        "caption": "Photo of Patara - London, United Kingdom. Lamb Shank Masaman Curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lM1MJZTec2uJBxr-N_bLxw/o.jpg"
      },
      {
        "img_id": "NicVNr54xneZdiR-5yyjCQ",
        "caption": "Photo of Patara - London, United Kingdom. Sea Bass cooked in Red Curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NicVNr54xneZdiR-5yyjCQ/o.jpg"
      }
    ],
    "user_id": "PSzK38F2lazBtixEi0o1hQ"
  },
  "BPfsAVaSjgNRIUIdaNYK4A": {
    "date": "3/20/2016",
    "text": "The restaurant has a lovely atmosphere, but I found the service to be disappointing.The duck Spring roll starter came out stone cold and we received another with an apology. For the mains we had the lamb which was not served hot, but tasted good. We asked for the chicken pad Thai, with the peanuts on the side, which we didn't receive. The chicken panang and Curried sea bass and the Patara passionfruit cocktail were my favourites.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XgcmwkO4Rahl3H42mUgCZQ",
        "caption": "Photo of Patara - London, United Kingdom. Patara passion fruit & butterfly kiss",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XgcmwkO4Rahl3H42mUgCZQ/o.jpg"
      },
      {
        "img_id": "mvfAgWcaR2ZED54bE61ncA",
        "caption": "Photo of Patara - London, United Kingdom. Chicken pad thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mvfAgWcaR2ZED54bE61ncA/o.jpg"
      },
      {
        "img_id": "hhZmsbUGsiq4KE5LavepyA",
        "caption": "Photo of Patara - London, United Kingdom. Lamb",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hhZmsbUGsiq4KE5LavepyA/o.jpg"
      }
    ],
    "user_id": "HSCWAsdjwLLatABu8HM6VQ"
  },
  "jTTn-DTLSRKKzYSDSHevZg": {
    "date": "7/28/2017",
    "text": "Our first time at Patara was for dinner before the theatre. The ambiance is pleasant with soft warm lighting and plenty of staff being just-the-right-amount of attentive. We had two starters, both of which were fresh, flavorful, and delicious: Chor Muang, lilac dumplings with caramelized chicken and peanut; and Goong Sarong, spiced marinated prawns in filo pastry served with avocado, tomato, pickled cucumber, and greens. Both starters were excellent, but we were really surprised by our main dish, which turned out to be the best Pad Thai we've had. (We live in San Francisco, where there are many, many good Thai restaurants.) We saw many other dishes pass by that we'd love to try, so I imagine we'll be back here on our next visit to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEox5lr7zOxQ91IhuVhP4Q"
  },
  "mp5qPVQcJtzMyVVRXlCFOQ": {
    "date": "3/26/2018",
    "text": "It's alright. The Tom yam , som tam, lamb massaman and sticky rice with mango is good. The deep fried fish, corn cakes could be better. Overall it's okay but I think you could find better thai in london.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BnpNb1ImGrFmMh45TMG3lQ"
  },
  "mrKIS19DHR_RUBQ3JtO_vA": {
    "date": "11/21/2015",
    "text": "Absolutely amazing Thai food.Patara brings thai food to a whole new level--at least to me. I haven't really had good thai food before, so having Thai food at Patara may not be a good thing after all because now the place raises my bar. I love love love the soup(forgot the name but it's white broth)and the fish curry. Pad thai and the chicken curry were also good but the pineapple rice was ehhh, not the best.I would definitely return to Patara when I visit London another time and try other dishes in their recommended dish section. Oh get the thai tea too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VdRE1cUd5R8OE5AtQ90Lg"
  },
  "5xmR8CJ81-EXLsPZY63mPw": {
    "date": "8/25/2015",
    "text": "Food - 3Service - 4I think I've just been spoiled by all the fantastic food in the States because from what I've experienced, you just can't find the same level of deliciousness for the same price point in the UK. Patara didn't contradict this theory - the food certainly wasn't bad, but also not remarkable either. The Miang Guaytiew was not quite memorable save for the lime and chile sauce, which I would've gladly drunk a bowl of. I'm actually drooling at the memory of it as I type this. I also don't remember what my main course was because the meat wasn't very distinctive in taste or appearance. I think I got the Gae Pad Grachai because I *think* I ordered lamb, except the meat didn't have the gamey flavor lamb often has, so it may have actually been beef. It was rather gummy. Again, not bad, but if I'm paying the equivalent of $30 for a dish I don't want it to just be \"not bad\"! I don't remember much else other than that it was surprisingly quite spicy. The pros: the interior is beautiful and the service is incredibly friendly! They made me feel very welcome.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1JCLuiAGCS1P5GtRgawW1w"
  },
  "5Lc4Q_Ybs1ON8IoYQBjKZw": {
    "date": "6/10/2017",
    "text": "First time in thai cuisine. Great experience. Elegant and cozy venue, kind service. Delicious food. A little expensive but OK for the level of this restaurant. I had the chicken with papaya sauce, a signature dish that I highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpdxWUmwE2LMF_9hZqwbxA"
  },
  "hIuKorX95QtafQ1-0TyU6A": {
    "date": "8/28/2016",
    "text": "This is my second experience here. I should have written a review before. It's simply amazing. You walk into the smell of lemongrass. I felt like I was at the spa. The owner or mgr was so welcoming! He was happy and accommodating  to my needs and everyone else's. Oh it's your birthday?? That's cool, he will sing to you! Saw it with my own eyes. The food was off the charts. Definitely order off of the \" we recommend page\". You will be happy as a clam. The green curry and the prawn pad Thai will change your life. You're welcome!! Every place should be this warm and this welcoming. Service and food get 5 stars! We will be back over and over.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-MiqLJ9ayFSM0AcoGG_SrA"
  },
  "cTqxtPmxin0zIx6lgCZkdg": {
    "date": "6/10/2015",
    "text": "Patara is an elegant modern Thai restaurant and offers unique experience.The starter was definitely 5-star (if I could I would give them 10-star):Tod Mun Pla-Goong was simply outstanding/flawless and the best I've ever tasted.  Fish cake was full of flavour and moreish.  The prawn cake was on the lemongrass skewer and had excellent flavour.  The dip complemented this dish very well.Miang Guaytiew was a big portion of  summer rolls filled with duck, crab, prawn and fresh lettuce/herbs.  They were very refreshing, but I preferred the dip which came with Tod Mun Pla-Goong.The main course was 4-star:Lobster Pad Thai was a bit mushy and we needed to add all the condiments (sugar, chilli, lime, peanuts) to improve the taste.  The lobster was great, but unfortunately this dish was not worth £24.95.Gai Goong Pad Gaolut showed the modern touch by adding cooked sweet chestnuts to the dish.  This combination was a revelation.Both Kao Neow and Kao Duey were cooked nicely but the portion was small.Dessert:Mango Cheesecake with Salted Caramel Ice Cream was superb.  The cheesecake had wonderful mango taste/flavour and the ice cream was milky:  definitely a 5-star.Kaneow Mamuang, on the other hand, was very disappointing.  Four very small chunks of mango had lovely flavour but was not sweet enough.  Sticky rice cooked with coconut milk was very hard and the portion was extremely small.  It was not worth £8.75.The service was very sweet and polite, but can be challenging as some of the staff does not understand English well.  After visiting this restaurant, I would think twice about going to the ordinary Thai restaurant.  I would definitely go back but would be more careful choosing the dishes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMbGqg5EovIcFnfIxUw7hQ"
  },
  "7C96k8YGZT4sV-OCrg2Utg": {
    "date": "1/22/2017",
    "text": "Great Thai food. This is a fancier place than most Thai restaurants. Most people seem to get pretty dressed up. I'd recommend making a booking they get pretty busy. The service is great and the food comes out quickly. Lots of veggie options. Most of the dishes are pretty recognisable but they're more elaborate than your usual takeaway. It's a good location if you're out for a show nearby or something in Leicester Square.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrhvYUbdikn5zdAyRh32_g"
  },
  "lQFdVK8DfmLRkttMmfyAxg": {
    "date": "2/15/2016",
    "text": "::::Food:::::I had the lamb shank and my boyfriend had a type of steak thing. Mine was definitely better but definitely not mind-blowing stuff. I've had more delicious Thai before for cheaper than this. ::::Service::::Meh, something to be desired. Polite but quite dead pan, no smiles and didn't really use the common sense on stuff like serving steak with no knives and then being sooooo slow to go get one for you.::::Atmosphere::::A bit stuffy but overall nice smart atmosphere. Quite dark so I wouldn't be tempted to go for lunch there but nice enough.:::::Drink:::::I had this chili and mango martini which was delicious and I would highly recommend this.Overall feeling was pretty darn expensive for not much at all.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "brRicYvVLTx-xByTVyRBug"
  },
  "hTaKgihcrrtPocUUgmS0Hg": {
    "date": "6/27/2016",
    "text": "I ate here or at their other location in the past.Food was good, but wait staff was snooty and service was poor.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Te0Xu6mAlJV0i7NIxDiAQ"
  },
  "98fa9LsoXiXW2URaAAkURg": {
    "date": "1/23/2017",
    "text": "Delicious delicious delicious ...The Duck with Chilli and Basil is a must try ...So is the Seafood Noodles ...Great and relatively quick service as well ...With a nice ambience to top it all ...New fave Thai spot when in London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n77a8pr9OK4uBxyKulF2zw"
  },
  "QBE-wrO80nb5RinCE62Vig": {
    "date": "2/11/2015",
    "text": "Everything at Patara is exceptionally polished and tasty! The price points are high and you have to add rice and sides to your mains so it can easily add up. I'd recommend Patara for a nice night out, but if you need to satisfy a Thai food craving, you'd be able to get something nice at a more affordable place.The service was friendly but patchy. They mixed up our starters and forgot to bring one of the rices with the main and we were charged for an extra one once it showed up. Regardless, the smiles and light conversation from the waitress made up for it.I had the king prawn pad thai which featured two large prawns (see photos). It was tasty and presented beautifully but at £17.50 for this recommended dish, it was a bit of a splurge for something you can easily get somewhere else for cheaper.Overall, my friends and I had a fun night, but my wallet came out a bit lighter than I had wished. In this price range, there are so many other places in London that can offer more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M03vKCSk2V8tRl0fOAlq1A",
        "caption": "Photo of Patara - London, United Kingdom. Peek Gai Sord Sai Golden stuffed chicken wings with crisp lemongrass and kaffir lime",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M03vKCSk2V8tRl0fOAlq1A/o.jpg"
      },
      {
        "img_id": "-_pe6oG2gVRtFAYDaTBq7w",
        "caption": "Photo of Patara - London, United Kingdom. Pad Thai Goong Yai   Thai styled fried rice noodle with giant king prawn.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-_pe6oG2gVRtFAYDaTBq7w/o.jpg"
      },
      {
        "img_id": "UHAo3ZC8u0TR-9193rLALw",
        "caption": "Photo of Patara - London, United Kingdom. Tuna Tartare",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UHAo3ZC8u0TR-9193rLALw/o.jpg"
      }
    ],
    "user_id": "255UWFKMll3xfOtUj1E_ZQ"
  },
  "TG00xx4HkiXfAY2YlyCMew": {
    "date": "4/22/2011",
    "text": "We were just touristing in Soho and wondered by this unassuming little place. GREAT find. They have an easy lunch menu at a good price, and the service was top notch.  We were  unfamiliar with many items on the menu, they made recommendations that were delicious and more adventurous than peanut chicken. I was unsurprised to see all the great recommendations on this site.  Patara is a great find!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyuFwb6iBMpzLqVByIer_A"
  },
  "vhS1DCfXevTB9NuYGdgbjg": {
    "date": "5/22/2013",
    "text": "Came here on the recommendation of a London colleague who swore that the food was amazing.  While it wasn't that, it was very good Thai food and decent service.  I enjoyed the prawns in massaman curry, although the prawn portions were small (only 3, and the prawns are not any larger than regular shrimp).  The flavor was excellent, though.  I wished that there were more noodle offerings on the menu, and overall the menu didn't really excite me.  (Perhaps I'm comparing to New York's SriPraPhai, which I know is not fair...)  But all in all a good solid choice for Thai food in London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kitcet6m7uoShzqsDPMtgw"
  },
  "1zhxcJqnJQ4WN00xy1T-Qg": {
    "date": "10/29/2009",
    "text": "Simply put Patara is the best Thai Restaurant in London (although not  \"in the World\" as one other review suggested)  striving to achieve authentic Thai flavors both in the classic and new variation on dishes. The fresh spring role appetizers have nice, but not great, flavor giving a sampling of crab, shrimp and duck but we were disappointed it didn't come with the classic peanut sauce (although they provided it when asked). Our entrees were simply delightful...I had \"pad siew gai\"  (wide noodle with chicken) which wasn't on the menu but they were delighted to make. The dish was not overly garlic, noodles were perfectly prepared, and it had a bit of warmth (spiceness) that didn't overwhelm the flavor. My wife had the calf cheeks in red curry which was outstanding....the tenderness of the meat was complemented by the red curry, green peppercorns, and other vegetables in a stew. The stew also had a nice warmth that builds over time. Lastly we shared a warm dark chocolate cake with mango sorbet which was perfectly prepared and brough a nice close to the dinner. The service was very good with the one exception of one of the waiters being a bit clueless and not paying attention to what we were saying. The waitresses however did a much better job. The other beef with the restaurant is that they charge a mandatory service charge...tipping should never be mandatory and frankly the servers lost out because I would have probably tipped more. Between the spotty service and mandatory service charge they lose a star, but looking just at the food I would give them 5 stars.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "GBfOPFlKzRXRAkQUJ1K_6A"
  },
  "35lxgLS929gFG7h3Lorqzw": {
    "date": "9/24/2011",
    "text": "My fave Thai for a few years now - \"proper\" first rate Thai cuisine, great surroundings,  good service (although a bit quick to top your glasses up) and fantastic cocktails which differentiates them.  There's something about  a Mojito before a Thai meal that transports you elsewhere :-)  A word of caution:  they throw you out very promptly at 3 at the weekend so don't book a table expecting a lazy lunch.  I find this really strange in a Soho retaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EzazP0bxfr5x1v1dKJDebQ"
  },
  "qDNF86S-3ikb34XMPmXzqg": {
    "date": "9/16/2009",
    "text": "Very impressed with this place!  Great ambiance and decor, attentive and efficient service and of course the food.... was pretty fookin damn good!  Tuna Tartare with a spicy lemon vinaigrette was tasty with a kick in the palette and the black cod was as good as any I have tasted, including Nobu.  Also, a pleasant surprise with the wine list, although a small selection, it had good variety and a well balanced price.  100% recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2Bf9o1-UX5b5jTR2tj3Nzg"
  },
  "eltNTktU78tX2aDVWBScZQ": {
    "date": "11/27/2010",
    "text": "Looking at the recent mixed reviews we were a little unsure, however we were not disappointed. Patara is a great restaurant, very lively and vibrant and even though it was full the staff were very attentive and the service was good. We decided on the dumplings; mixed rice rolls; chicken in basil; lamb in ginger; wok fried rice with egg; and finished off with chocolate pudding and ginger tea. The portions were a good size and all the food tasted great, you could really taste the freshness of the herbs in the rice rolls and the mains were just the right amount of chilli!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "SJUzOMKwIWcWOmlZooFLIg": {
    "date": "1/4/2011",
    "text": "We a regular guests in Patara and I have to say it is one of the best Thai places in London. Yes, as some of the reviews suggest, with fame comes busy times when guests will have to wait a bit for their waiter/food but that is not the norm. The food is authentic Thai food (that's from someone who actually visited Thailand) and of taste great. Is it worth the money? That's for yourself to decide. In general I would not pay this much but I like the fact that you sit in a well designed place with working airconditioning, working and clean bathrooms (no hard feeling but a rare thing in London).",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xEPZI7XgO9IA5pFeEFrRmw": {
    "date": "12/23/2009",
    "text": "The best Thai restaurant I have ever been to! Amazing food, excellent decor and friendly and attentive staff. Starters were very nice, ordered 4 between 3 people. Mains, ordered 3 with 2 rice. All really nice (although only warm) but then the puddings were out of this world! Only one issue which I hope was a genuine mistake.They had added the table next to us's bill on to our and we only just realised it. I hope that doesn't always happen! Definitely worth a visit though - just check your bill!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gI9tUGRQ-MxuBBOMqs52wg": {
    "date": "8/2/2009",
    "text": "I just loved it. Great food. Great room. Great service.  Very sadly, cannot say the same for the sister restaurant in Knightsbridge.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ael4hsUUyK_kKAmO45VIjQ"
  },
  "qkSvFf-Sa2m3MhWWQC3bEA": {
    "date": "7/17/2009",
    "text": "This is a very very lovely restaurant with excelennt food and a very friendly service. The waiter helped us choose our dishes and recommended very very good food. We shared a few startes and all had a main course after. I had the sea bass which was a huge dish! Very good though. I tried my friend's tiger prawns which were really good aswell. The food is fairely pricey but it's is absoludely fair and worth it. Nice atmosphere - good food!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JyqfcouGUeXcvx-rqcsH2g": {
    "date": "11/14/2008",
    "text": "I went here for my 21st, and it was a wonderful night. Very memorable, lovely lovely food, just the right heat, and very attentative staff. The puddings were heavenly! I had a Thai green curry and it was just lovely. Can't comment on the price, but visit if you want a great night.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bu4L8wvZ5MEX_jdWHuErkQ": {
    "date": "5/20/2009",
    "text": "My favourite Thai restaurant in the UK. Great service, great food, & reassuringly expensive price keeps the rif raf away.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fZRi9hDMMBwksU7sEu_Ndg": {
    "date": "2/8/2012",
    "text": "Oooh, this is a noice Thai restaurant in Soho, nice decor, ambience, good food and service, I'd recommend it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "dO6tbhm_D3uVHgIQegvFcg": {
    "date": "2/17/2013",
    "text": "The ambiance here's great. The place was packed downstairs on the night that we went to Patara but the service was surprisingly patient. My table ordered: the veal massaman curry, pad thai, skewered chicken, duck and rice, and a fried rice and chicken dish by request. The veal in my curry was lukewarm and a little undercooked. Would have been my favorite had it been done right. The pad thai was better than what I've had at Sripraphai. The prawns were fresh and the sauce was pretty consistent for a chain restaurant. My sister claims to like the skewered chicken and duck. and she still talks about going back.Overall this place amounted to a great night out with family and friends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "be_4aGsFJLOxsmHFmlbduw"
  },
  "ZW4fKSkQEMFU9LnqffzpRw": {
    "date": "1/17/2013",
    "text": "Really great thai food - I've eaten here quite a lot and never had a dud dish.  All amazing and a really nice atmosphere.  Definitely recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "caxEEi1xoSNOW1lvfx1a8Q"
  },
  "QSV8njlnTtMqG4xQXvFqow": {
    "date": "10/25/2012",
    "text": "Absolutely wonderful. So delicious, very attentive service.We've eaten here before on a trip to London and this really is a \"must visit\" for us at this point.I had the Tom Yum Goong which is the best of this delicious dish I've ever had. The red curry main was lovely as well, although I would have enjoyed it a bit more spicy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jLNz1cVIPXYAr6KrGoe5A"
  },
  "lfvCyaS-_mhsbwbaHFb9cQ": {
    "date": "6/19/2014",
    "text": "LOVED Patara!  - After walking like a camel for miles in London, all i wanted to do was to have a drink or 3 and have a great meal.  Patara delivered on both.  I had this amazing concoction the bartender whipped up and from then on I couldn't even feel my tired aching feet.  The wait was not that bad but I  really have to thank God for that because the line was like 20 people long and out the door but with the help of the rain gods and a little game of chicken (staring the diehards down)  poof the line moved to the italian place next door and our determination payed off big time!  After about 20 min. we were escorted to bar below and from then on ...magic.  Got a great booth and a great waiter - top this off with incredible food (we ordered and shared a lot so as to get a good sampling) and it was all consistently good.  We were tempted to come back again the following night!   This one is a winner and I will go back again soon.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGKZDZiMdR_Df7vUQQBFhQ"
  },
  "Mq2Nv3jm6GAdrQUAVjOqtw": {
    "date": "2/28/2011",
    "text": "Best thai in London.  Excellent, expedient service.  Two of us had the green curry (one with chicken, one with tofu), and three of shared an array of appetizers (various spring rolls and crab rolls and shrimp things, mostly).  The curry is delicate and spicy, not so heavy with coconut or spices that the whole dish gets overwhelmed.  Delicious food, elegant atmosphere at very reasonable prices in the middle of Soho.  A great experience all around.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dNFhUvAgvLpky1me4v5gNQ"
  },
  "1uddm1nS9VrXAJuEYJShYA": {
    "date": "7/5/2014",
    "text": "Our favorite spot in London for over 10 years.  You must have the lamb shank.  Sat next to Kevin Bacon here on our last visit, but even the pedestrian among us can appreciate one of the best Thai spots on the planet.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wA4XF94vIw8iWCSBr6ul2Q"
  },
  "ty34sjNSFJDhhRn0_LtCAA": {
    "date": "4/27/2014",
    "text": "Solid 3. A decent place for Thai food. Not the best, but it does the job when Thai is what you are craving.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eM6ubkY4XTReLtJlmYfnhQ"
  },
  "9R_7mDXKl5xmEfNCiwQqLA": {
    "date": "6/17/2010",
    "text": "This was a great disappointment. The prices do not fit to the kind of service you get. We had to wait quite a bit for a waiter. He could not help at all and seemed not motivated at all.The meals were average. There are som many better places in Soho.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUZugSrAEkvMMqw5kQn5hw"
  },
  "dMHj_h3xD-XGxs1jDTLlaw": {
    "date": "12/2/2011",
    "text": "Excellent food. Great ambience to spend time with friends. Good service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfRS6mPXaUCXxefx25jL2Q"
  },
  "AZoyYI849cpeVbOintAS2A": {
    "date": "7/4/2014",
    "text": "What a great spot. My wife is not big on different cuisines but it was simply fantastic. Dinner and wine then cruising SoHo area...cannot get better.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jgnnj6pycuAViCLBCFS00Q"
  },
  "nQpmcftopHdurYzqopI-nw": {
    "date": "6/10/2010",
    "text": "Ignore the one star review, I think he must have gone to the wrong place or got out of bed on the wrong side! I've been 3 times now and it's comfortably the best thai food I've had in London. It's not cheap (£15 a main course), but worth every penny. I can strongly recommend the lamb shank in red curry which is superb - incredibly succulent meat, falling off the bone and beautifully flavoured. My only quibble is sometimes with the service. Last time we went we were in a hurry to leave and it took about 15 mins and 5 attempts to get our bill. Minor issue though, when the food is so great.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kVdMuhThqreY_hBl5sw2Iw": {
    "date": "1/27/2011",
    "text": "The food is great here....but sometimes fancy restaurants have a bit of a strange vibe!! like the waiters so on top of everything it makes you feel uncomfortable if you catch my drift! definitely not the best thai in london in my opinion, a little over priced too.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "WJvINpnf-pGZHFsXjiY2Mw": {
    "date": "3/13/2012",
    "text": "Patara, although a chain (all of which are positioned in smart London areas) is the queen of posh Thais in town. Although more pricey than Busabi, it is better for a smart meal out with workmates or with the girls or with the other half. (Monikasays.com)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MTsrBjb88JzuqATr3mCnSw": {
    "date": "12/14/2011",
    "text": "Wow! Maybe they had an off night but myself and my wife were very disappointed as we booked based on the high reviews.5 dishesTuna Tartare - Tuna wasn't great quality and didn't feel the balance of the dressing was right.Assorted Dumplings - Undercooked and gluggyLamb Curry - pretty goodBlack Cod - overcooked mushBroccoli - also overcookedService was mediocre - ordered a second drink after entree and received it after our main was finished.There must be a better Thai meal for a 100 pound in London?So 5 dishes - only 1 was good - hence 1 star",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cr42gsu1rcEUEN0eA-_Bzw"
  },
  "T9kXBQJ_ZV2_VriCvq0O3A": {
    "date": "8/4/2010",
    "text": "Simply the best Thai food we've all had - randomly looked up the place since the 4 of us came from all different parts of the world and have met at a bar in SoHo, someone felt like Thai so we googlged it and came Patara.  Service was excellent and food was equally as good - your taste buds will be very pleased!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QBIvYP0z0OMDzHlI3pLz_g"
  },
  "ZKWLfrZrfc2IE24N31R17w": {
    "date": "8/19/2013",
    "text": "fantastic restaurant.  It's on the expensive side but amongst some of the better thai food I've had.  Not in the league with Arun's in Chicago but a step up from the thai restaurants I've eaten at in San Francisco.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sr6FRxThezQlczmxoNyTg"
  },
  "J8wK9CxI_0S94e5AduxiDg": {
    "date": "1/8/2009",
    "text": "I have very high standards of Southeast Asian food... because I'm Southeast Asian, Laotian more specifically. Don't know where that is? Look on a map.Thai food is similar to Lao food, but of course not the same. My mother thinks that Thai food is always covered in coconut milk and fried and can be very fatty, whereas she sees Lao food as more herbal and a healthier alternative.We met up with some friends here a couple weeks ago. They probably assumed I would love it. They also said to expect 25 to 50 pounds per person...I have to say, that my food experience was okay here. Ordering 4 appetizers was enough for our party of 6. And they were all pretty delicious. I ordered the sea bass with a side of sticky rice. And when it came out, it was covered with coconut milk. I couldn't help but snicker to myself. But it was quite satisfying. My sticky rice (kaonew) was a little... too sticky. They served it in a porcelain bowl, which is surprising because it's traditionally served in a bamboo basket which helps keep it at the perfect temperature.I really enjoyed the ambiance of the place though. Most of the decor is wood, which is more traditional, and not gilded (like in most other Thai places). With perfect romantic lighting. So the atmosphere was very fancy, yet down to earth. I wouldn't mind coming back, as long as I wasn't paying.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gA4MiXjhX9iZmqkIgMxWjw"
  },
  "TNBhdwsWN6F4QRF_oXw6Xw": {
    "date": "2/22/2009",
    "text": "This is my favorite Thai restaurant in London. The service and food are fantastic. I like the way they play about with certain foods and fuse them with Thai seasonings. This is definitely the right sort of restaurant to go to if you want to experience 'Royal' Thai cookery. I can happily recommend the King Scallops cooked in chili paste and Thai basil. It is heaven in a mouthful. The deep fried sea bass with red curry is not a piece of installation art but a very beautiful piece of edible architecture. It is a gem in Soho's culinary crown.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yG0MKKLCHRUDvy5SV3n3yQ": {
    "date": "4/26/2010",
    "text": "this review is talking about the patara in soho of london, and really only the one dish i tried there - lamb shank curry.i can't tell you what the prices are like, since a vendor took me out to here while on a work trip to london.  but i'm imagining it was quiet pricey, since it was quite foofy and chic inside.  i don't recall what i had to start - i think it was \"thai tacos\" or something like that, and i mirrored my vendor/colleague's choice and had the lamb shank with curry.  i don't know how authentically thai it was since the flavors were very reminiscent of indian spices, but..who gives a shit.  it was THE. BEST. CURRY. SAUCE. i've ever frickin had.  it draped over the giant LAMB SHANK that was sitting atop the plate.  that shank was stewin for forevers, cuz the meat literally SLID right off the bone.  i almost was tempted to lick the sauce from the plate, so all that was left would be one long bone.  i oftentimes dream of returning to london just for this frickin lamb shank curry",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qtRKoNH5PVaWMXEp6tKUgA"
  }
}