{
  "ykp9cwEJVF-zi8GpXvAUNQ": {
    "date": "12/22/2008",
    "text": "The company behind Pizza Express has bought this place, redecorated it, and in the process, utterly ballsed it up. It's now truly horrifying. The food is bland and expensive, the wine list is overpriced and dreary and it smells of paint and desperation. Avoid. Avoid. Avoid.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8vuZ_WmHagwCBKGiVXLiQ"
  },
  "OFXg4ZgNjdGrWCeu_Y-DmA": {
    "date": "12/16/2008",
    "text": "I don't know about the restaurant but I went to a Christmas do that was held here yesterday, upstairs. The catering was shabby. Bowls of heavily salted skinny chips, bowls of yorkshire puddings (essentially tasteless balls of batter with no dipping sauce or any filling) and some turkey on sticks. The best part about the food was when they brought out mini lemon meringue pies. They were nice, but didn't make up for the awful savouries. The staff were surly but very helpful. I know that must seem odd, but they were. They all looked Italian. I asked one of the barmen to top up my rosé and he shook his head suggesting they had run out. I looked pleadingly at him and his raised his finger to his lips in a 'let's keep this one under our hats' and made me a special drink with strawberries in it. I have no idea why he did this. I did have the most flamboyant drink at the party though, which was pretty good.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-Eu8a331B3XSfsl0kILj7Q": {
    "date": "4/2/2012",
    "text": "We went there to celebrate my fiancees birthday. We had a drink at the bar and a nice dinner but the value for money is not very good. It seems to be a quite posh place but the food was just alright. The service is good and the ambience is nice but if you really care about the food it's not the right place. The champagne bar is nice though.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TIU6eX6dc9_gVID6lkY13w"
  },
  "vMU8WF8AK8U3EAdGBq0ylQ": {
    "date": "12/18/2008",
    "text": "Classy, arty bar just off Shaftesbury avenue, Kettners is a cut above. Armed with a voucher for a free glass of champagne and a slice of quiche, me and a couple of friends marched down, determined to get our free stuff and leave. Five hours later, and four bottles of wine the drunker, we stumbled out not quite sure what had happened but sure that we'd had a good time. The early free stuff was quickly replaced by later expensive stuff, and nobody could quite remember why, apart from the desire for a debauched night. Inside it's like an old colonial bar. Mix and match regency chairs and Parisian benches are matched with chandeliers and marble. The service is excellent, and the wines not too dear (we got a lovely Bordeaux for £22 a bottle). They also do delicious quiches and champagne. That is, if I remember correctly . . .",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cOupxBtD3QepE9mligSFag": {
    "date": "2/26/2010",
    "text": "I loved this place, which apparently hosts more European and American tourists than locals. I don't care. The service was great, the champagne choices were lovely, and I look great drinking champagne in London's West End.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jM4Pp_N8s91sNeZ35nuG3Q"
  },
  "rekat79I_HBACcnwHs8Kbg": {
    "date": "8/14/2008",
    "text": "If you're looking for a post-work wine fest or fancy some bubbles this is the place. Don't let the fact that it's owned by Pizza Express (there's a pizzeria inside) put you off  it's actually a stylish alternative to the All Bar One fraternity, with a champagne bar full of old leather chairs & sofas, giant ceiling fans (very White Mischief) and a satisfyingly long bar. There's also a more modern piano bar across the hall. Perfect for groups at any time although can get very crowded between 6-8pm so those looking for something à deux try later on. Top tip: they give you a free dish of almonds with your drinks, which they'll refill if you ask  perfect for keeping hunger pangs at bay. They also serve a mean Kir Royale.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "F6y9bto3LTwlMSdJuPI7-w": {
    "date": "11/18/2008",
    "text": "Kettner's has to be one of my absolute favourite restaurants in London. I adore the atmosphere; it's upmarket enough to feel like a real treat but the staff are very friendly and the prices incredibly reasonable. Though it's run by Pizza Express the menu is varied and all the non-pizza dishes I've tried have been fantastic. I'd particularly recommend the scallop starter and the burgers.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "inmv4qM2ylQVMfua_gKskQ": {
    "date": "2/23/2011",
    "text": "I enjoyed a lovely dinner here with three friends last night, and after having a few drinks in the Champagne Bar we went through to our table which was booked for 7pm. We had a lovely waiter who was very attentive and helpful.The food was wonderful, we opted for the Beef with Mash and vegetables and an array of desserts afterwards, the price was reasonable for four guests and at times I forgot I was in Soho as the atmosphere is electric and very buzzy. Our only comment would be that we had to shout to be heard as we were seated near some loud ladies! Great venue, Great Location, well worth trying",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ldlIP8pANmR2nMK8vCYHMw": {
    "date": "8/13/2012",
    "text": "Been to Kettners on several occassions and have always really enjoyed it. I have mainly been in an evening with girl friends for dinner and you usually have to book as it gets very busy, went this Sunday for Sunday lunch and it was really good. The atmosphere was a little lacking this time as it was the closing ceremony that day and very hot so I guess people didnt want to head into soho but it picked up after a while as more people came in. We all paid roughly £25 for two courses inclusing a glass of wine/beer and one of the best roasts i've had in London.and i'm a fan of sunday roasts :P",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-UI_vWmAn27plTmgxe6EOQ": {
    "date": "10/4/2010",
    "text": "I went here Friday evening for a friends b'day and after looking at the website was very excited. When we arrived the steps that greeted us were beautiful mosaic'd tiled , it felt special from the moment we walked in. As we were waiting for the rest of the party to arrive we sat in the bar area, they only had a spirit, cocktail and champagne menu, you weren't able to order beers from here but you could in the restaurant area. I ordered a strawberry belini cocktail, it was very pretty and tasted lovely and cost £10. We were then ushered into our seats, the table was set lovely, the decor of this restaurant is gorgeous, it reminds me a bit of my fair lady. You really feel devine and posh in this setting with a pianist playing in the restaurant. The menu came, I thought it was pretty cheap considering the look of this place, the mains cost around the £15 mark and the sides £4. I decided not to have a starter and headed straight for the goats cheese and red onion tart which was served with salad, I thought this was very tasty and for the pudding I went for the Pavalova which was quite possibly the most delicious desert I've ever had! if you come to this restaurant for the pudding itself it would be worth it. I thought the food was ok overall, not amazing just good,  the pudding was exquisite. Our waiter had a great personality and was very friendly BUT the only downside was (as another rveiew has pointed out) after being handed the desert menu we were left waiting literally for 35min! till they took our order. I even watched as some waiters looked over but just left us to it which wasn't great-thank god the pudding made up for it. I would def come back here though, maybe I'd be a bit more persistant about getting the waiters attention. This is definitly a must if you're in London and fancy a treat after a show or just fancy a touch of elegance, don't be fooled by the ££££ as it wasn't that expensive! Also I heard Oscar Wilde used to frequent this place and it really does feel like something out of pride and prejudice",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ygm3vgj3OWwx-s6ocqoWHA"
  },
  "UIsZhpcXE4rlAAnm8T4j0w": {
    "date": "9/1/2009",
    "text": "we had been put off kettners food prior to their revamp, and so planned to stay for a couple of glasses of champers only, this turned into a couple of bottles and we decided to try out the new restaurant and menu. we were pleasantly surprised, all courses were well presented, tasty and good quality. service was very good, and we particularly liked the free gold pencils. would return to eat again. only quibble would be that the area behind the champagne bar is rather too dark and moody, didn't stop the bubbly flowing though ;) Update Dec 2010. booked for return family treat and were slightly let down by food this evening, not sure whether kitchen was having a bad night, though the restaurant wasn't that full. 3 of us had ordered steaks and 1 duck confit, the duck and the potatoes it was sitting on were both very dried out - seemed like they'd been reheated, or kept in an oven waiting on the steaks.....there are many better restaurants so will only be visiting for champagne from now on i'm afraid.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bRRZKFaVWYqzSaaYYvILlg": {
    "date": "9/1/2009",
    "text": "Having only used Kettners as an impromptu meeting place after having escaped some builders in the office we were using, I can only comment on the coffee and ambiance there. Both did the trick; I'd be happy to revisit for a bottle of wine and some grub.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kenn2xJ5--likMxsPaXUaw": {
    "date": "3/11/2009",
    "text": "Eventually went to the New look Kettners and wished I hadn't. The vaunted decor is a cross between bland and camp chic resulting in DULL & UNINSPIRED. Seared dived scallops risotto, was four rather sad footless scallops (supermarket style) sitting in a row on top of a very bland and rather over wet risotto, which took an eternity to arrive due to trouble in the kitchen. This trouble must have been that all the chefs had gone home leaving someone to open packets and add boiling water as the overall effect was of eating a fairly salty dish that might have been produced by Pot Noodle. The service was faultless, friendly and human, the wine, so-so, the food just plain bad and over priced, avoid this place. A hugely overpriced faux new brit restaurant with none of the fusty charm of the old pizza express palace.The star is for the friendly service.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cOqD0_0J5HHOJBTKjo0A0g": {
    "date": "11/19/2008",
    "text": "This is a VERY posh place and really not all about Italian food and pizza and burgers - in fact, I am really surprised to find that it's run by pizza express. I had salmon and it was fantastic. Great atmosphere, I particularly liked the pianist which was a great touch! My favourite thing about this place was that when I visited, I'd been walking round London all day in the rain and was wearing flip flops, and with it being posh I was worried we'd get looked down on but this was not the case at all - in fact, I would say quite the opposite.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jRlhwwIbSPenrOJbhEPzHw": {
    "date": "6/5/2008",
    "text": "Great ambience when the place fills up and that's about all I can remember - Kettner's = champagne = munchies = Soho House = sweet oblivion",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDr7bRPe97VOAsaMBp8qVA"
  },
  "8mi_zu5bS2nOxTNC7QEZTQ": {
    "date": "11/30/2008",
    "text": "This glamorous soho institution is smart, elegant and classically sophisticated. It is both restaurant and bar serving quality food and drinks with a range of different private rooms and public spaces of varying styles and design. It is especially lovely at Christmas when it's charming traditional character lends itself perfectly to the Christmas atmosphere. With 140 years behind it, it must be doing something very right in this transient and ever changing part of London. Staff are spot on.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cQ1AgcP8Ff0knBgc9E3PxQ"
  },
  "1du1dlowpd4urzELe7aMnw": {
    "date": "9/9/2010",
    "text": "I went here on a deal with another website the other day (50% off) and it was lovely. The food is upmarket normal food (steak, cheesecake), as opposed to being mediocre fancy food (all pigs trotters and liver pate), and it is good. The setting is serene and quietly posh, with a pianist playing in the corner. The tables were a bit close together for my liking but the service was good and drink prices reasonable. The kir royale I had at the bar was THE nicest one I have ever had anywhere! (was £10 though...). I woudl recommend this place highly, especially if you can get a deal. There is private dining too and the loos are top notch.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vtaVwRypktlQkLCzI3KEtg": {
    "date": "1/25/2009",
    "text": "I will not be likely to ever return to kettners. Before it's make-over I was a really big fan of this soho-based champagne bar, and loved to stop in for a bottle of champagne with my husband on a night out. However, a couple of weeks ago we met good friends of ours for a birthday celebration, and had such terrible service we were really disappointed. When we left, my friend paid the bill at the bar, but then on our way out we were chased by the waitress accusing us of trying to leave without paying! We explained that we had a receipt, but she wasn't interested and very loudly informed us in front of all the other customers that she would have to check the till receipts! When she discovered her mistake we got a very abrupt (and quiet in comparison to earlier) apology, but it was a bit late by then! Definitely not impressed at all.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tBqFSFLPUFKN7umSvY30Mw": {
    "date": "4/23/2008",
    "text": "Kettner's is great, really unique but I'm surprised no-one's mentioned the Champagne bar as thats a major reason for going there. They have an enormous range (at a price though!) and the rose champagne the people sitting next to us were drinking looked - and they said was - fantastic. Yes, the Pizza Express is nice but the bar is cosy and friendly and the perfect place to meet friends and celebrate. Different to anywhere else I know in Soho it just feels really special.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "k_s5EvJNBfnRH9jNJfu5sQ": {
    "date": "5/31/2010",
    "text": "I'm always a little bit aprehensive about restaurants with a history (they sometimes care more about who has been there rather than what is eaten there), however Ketner's was both delicious and nostalgic. I'm actually surpised none of my foody friends have mentioned it before, given its origins in Napoleanic times and carrying through as an Oscar Wilde haunt. The modern restoration has achieved both of these eras by keeping the decor simple but french, one can imagine Oscar Wilde sitting in the corner having a cigarette while jotting down some notes w an occasional glance accross the open space room to see what gossip was brewing. As for the food, perhaps a bit too exensive on the normal menu, but was a bargain for us as we stopped by around 4.30pm for an earlier prixe fixe pre theatre dinner for 20 quid. I had a bowl of asparagus soup followed by a duck confeit, both of which were delicious. C had a delicate leek and cheese quiche (gruyere tart) to start with and hamburger to follow. I think the duck confeit won the day with the quiche a second place (the dressing on the side salad with the quiche was also nice). We finished it off with dessert which was an extra fiver per person. Though given all the french bakeries and cafes in the area I would recommend moving on for dessert and coffee (though we both enjoyed our desserts of strawberry pavlova and creme brulle, though they no where not of the same quality as the starters and mains). Sure little things could have been better but this meal was delicious and the french serving staff was friedly and very helpful so four and a half stars from me! Bon appetite.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "3Syw-T3svluzqhwL8H54Rg",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3Syw-T3svluzqhwL8H54Rg/o.jpg"
      },
      {
        "img_id": "eBLhwvAEOPrDUUHS3WR7aA",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eBLhwvAEOPrDUUHS3WR7aA/o.jpg"
      },
      {
        "img_id": "5C6gRIGxXW5iaPBWkOrnfQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5C6gRIGxXW5iaPBWkOrnfQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "3W-hnZg9845jQIU8p5CImA": {
    "date": "10/30/2010",
    "text": "Quick glance:+ delicious food+ attentive service+ fun history+ good for group- crowded and noisy- long wait despite reservation- limited selection in barI came here on a Monday night and it was very busy for the start of the week, although I understand from a friend that the manager is driving a big campaign to lure local diners with special offers. I called in the early afternoon to book for 3 that evening for 8pm with no problem. I arrived at about 7pm for a pre-dinner drink at the bar. It is a champagne bar offering a big selection of champagne and oysters, but I wasn't feeling particular flush on a Monday night for a £50+ bottle of aperitif. Unfortunately their wine selection at the bar was very limited, with 3 white and 3 red only. When 8pm rolled around, we went to the maître d' to get seated but were told that our table was not ready. We returned to the bar for another bottle of wine for the three of us and waited another 15 or so minutes before entering the restaurant. (We later found that there is a much more extensive wine menu for the restaurant within a more diverse price range, which made the bar area seem even less attractive.)The dining area is big but packed with lots of tables and patrons. You don't get a lot of personal space and during a busy night it was very noisy. Consequently it's not a great place for a romantic date, but definitely a good venue to have a French meal with friends. It's particularly fun to read about the restaurant's long history from the menu.The starter I had (cured salmon) was light and whetted my appetite for the meal. I had a medium-rare steak for my main course, which was cooked to perfection. The side order of green vegetable was adequately sized to share between two to three diners, as the main course itself was quite filling. However, the side was disappointing in that it was simply cooked (steamed or broiled) and not seasoned in anyway.To finish the meal, the three of us ordered digestifs and puddings. My friend received his chocolate mousse first before the digestifs arrived, and after 5 minutes the attentive staff noticed that the remaining (hot) desserts have not arrived and apologised profusely, saying that they had to re-make the dessert. The waiter offered us a drink, not realising that we had ordered digestifs which had yet to turn up. Eventually, the digestifs arrived and so did the other tasty desserts, the latter of which were served complementarily because of the long wait. Overall, the food is delicious and the staff very friendly. Although they made a few mistakes along the way, the staff's attentiveness and flexibility made the dining experience a pleasure. The only downside is the proximity to other diners and the noise you get when the dining area is full, but consequently this is a great venue for a group of friends. I would recommend this restaurant highly for groups wishing a fine dining experience, although I would suggest a different bar for pre-dinner drinks unless you specifically want champagne and oysters.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "j_v7PqyMPmXsas6csWPX-A": {
    "date": "4/6/2012",
    "text": "Nice decor, especially highlighted on their site. All very 30s style, and the name in lights outside in a sophisticated moulin rouge-esque way was lovely. However, inside food was fancy without being great: A tarte that was made of some sort of crispy biscuit looked the part but didn't taste it, and Cocktails that sounded lovely but were fruity wines rather than cocktails. A nice enough meal from their spring set met but the staff that kept walking into my chair and the very 'whup banter' crowd let it down.",
    "rating": 2.0,
    "rated": {},
    "photos": [
      {
        "img_id": "VRxTLr05yHdtD8IZqAsOgQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VRxTLr05yHdtD8IZqAsOgQ/o.jpg"
      },
      {
        "img_id": "o5cVDFC4oSbmT16fVxJwiw",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o5cVDFC4oSbmT16fVxJwiw/o.jpg"
      }
    ],
    "user_id": null
  },
  "WtS-kFL4b6TkLJo2zz3Shg": {
    "date": "8/9/2010",
    "text": "I went here a few of my flatmates for a celebratory dinner a little while back and had a lovely evening. the food was delish. its a french-ish style brasserie, so yorue not going to find the lightest food, but there really is something for everyone. we had the beef bourguignon, which they cook for 3-4 hours in pure red wine(!!!), sea bass, with perfectly crispy skin and served with peas, rubarb and mint (it was an awesome combonation of flavors), and this veal special that is no longer on the menu, (but maybe they'll bring it back? *fingers crossed*), which had a vanilla and parsnip puree with  apple, celery and frisee salad. sweet, savory, amazing. desserts we had a bit of everything: chocolate amaretti tort (amazing texture, however i wanted for amaretti flavor in it), lemon tart (just tart enough),  creme brulee, and chocloate fondant with pisatacho ice cream (pisatacho is a gift from the gods. no joke.)a few bottles of wine a faire amount of champagne - it was lovely. our server, Julian, was french and charming. he was friendly and engaging without being intrusive. the room itself is pretty cool. during the day when ive walked by it looked a little cold, but at night with all the candles and mirrors, it felt very old world meets new world and very chic.  the champagne bar was very luxourious as well. a perfect to stop by for a bit of champers before heading out to a show or something.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 5
    },
    "photos": [],
    "user_id": "I3URSVRu24EaGWpvZB0cuA"
  },
  "IPJLkJDyTCMe4_cVQsl5RA": {
    "date": "9/21/2011",
    "text": "Had dinner there in August 2011.Adored it. The setting was brilliant, and the live piano absolutely lovely.To top it off? Delicious food, and even better desserts.A place I would definitely revisit. Come to think of it, I need somewhere to dine tonight around Soho Hmmm. :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "Qy48fyo786N3um5CtTRfmw": {
    "date": "7/15/2012",
    "text": "I went to Kettner's last night with a few friends.The atmosphere is really fun- and would not have expected such a nice place in the middle of what I generally call the \"trashy danger zone\" on Saturday nights.   Kettner's is HUGE.  We were in the Brasserie, though I did go into the Champagne Bar at one point to find someone to retrieve my coat.  They also have many many private dining rooms upstairs.  The decor is light and airy, with many gilded mirrors and candles.  The white baby grand piano with a guy actually playing it is a nice touch.We had a bit of a wait while our fourth arrived, but were not rushed to order.  I had a starter of Irish oysters, which was fantastic, not that oysters are hard to mess up once you shuck them.  Still, they were really nice.  Also at our table someone had the cold cucumber soup (and enjoyed it) and the mussels (also enjoyed).  I had the duck confit for main and it was perfect.  Others had the really really tasty looking pork belly, and beef bourguignon.  Dessert was also very good - I had a dark chocolate and raspberry tart that was a perfect way to end the meal. The wait staff were helpful and attentive, bit at the table and the bar.Overall a very pleasant experience, although a bit on the pricey side.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "uMiEr8JQEVd6NuMfEnhQ3w"
  },
  "VOkgnwvLGMAPuT1Zc7HP5g": {
    "date": "1/5/2014",
    "text": "Absolute quality-was lucky enough to be taken there twice with work only for drinks unfortunately. But to review Kettners as a bar, great service, fantastic buzz about the place on a Friday evening and stunning decor. An absolutely vast range of champagne to choose from, would definitely go back for a fancy drink for an occasion. Great location 5 minutes from Soho etc. highly recommendable",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2akOmuyvVNiNxJ2h8nX_mw"
  },
  "4TZBfTRYjVrn2v_-AKL6kw": {
    "date": "8/2/2010",
    "text": "Went here recently for a pre-birthday celebration dinner with 10 of my closest. Was really worried with a party of 10 that we'd either be neglected or treated with not so friendly service, and I must say that is not the case.  We were treated with smiles and were waited on efficiently, a lovely experience in that regard.As for the food, it was good, really, but still for me something was missing that leaves me from writing a rave review.  My fillet au poivre was a too peppery, my scallop appetizer was a bit too small (with bland risotto nero).  It was all good ingredients just seemed like every dish, even the creme brulee with too much brown sugar on top had one thing too much or too little to keep it from being really good food.Definitely worth it though with a 50% off food deal you can easily find on the internet, it was good, I'm just not 100% sure that with all of the continental/french restuarants in town that I'll be back here again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bk8vptdyN5iH9pM8_SB1cw"
  },
  "ywyJzEwjGxOvUZAQfrVplQ": {
    "date": "10/19/2010",
    "text": "My boyfriend took me here for dinner and I really loved the squash ravioli. The starter I got with the mozzarella, rocket, and artichoke was also equally good. We finished with a crème brulée and it was very authentic and delicious. The champagne bar is very nice here too. Def. would recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vI2KualZlQrsiQRgzDfs_w",
        "caption": "Photo of Kettner's - London, United Kingdom. 1) Squash Ravioli. 2) Crisp Duck Confit, Sarladaise Potatoes, Rosemary Jus.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vI2KualZlQrsiQRgzDfs_w/o.jpg"
      },
      {
        "img_id": "SIVmj8lT0_k-54VEHAnuAQ",
        "caption": "Photo of Kettner's - London, United Kingdom. Buffalo Mozzarella, Olive Tapenade and Rocket Starter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SIVmj8lT0_k-54VEHAnuAQ/o.jpg"
      }
    ],
    "user_id": "_VDlqj5-U22KcSFgBPqaFg"
  },
  "LS4AMnYfl3E7VFX98OYTEA": {
    "date": "3/17/2011",
    "text": "there are so many other places to eat around this area that Kettners just pales in comparison. Slow service and feeling ignored most of the time. the food was unexciting other than the tart for dessert. To read the complete review, please go to chopstix2steaknives.blog…",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aZd7vEPnm55lyeH_yMXZPw": {
    "date": "8/28/2010",
    "text": "I've run a few events here now as well as just going for a few drinkies and chow. I love the venue - it's regal but still contemporary (if that makes sense). They had a refurb a few years ago and the function rooms are much more functional now. It's gorgeous to go there around Christmas time because the decor is so tastefully done that it feels really decadent. I love the fact that the place has so much history! It's a bit strange to think that it's bolted onto Pizza Express, but it's done very well and their Beef Bourguignon with mash is yum! Not sure it's appropriate to wash it down with champagne, but they have an extensive and enticing wine list!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q4DrriOc08iYN9sGu6wn4A": {
    "date": "4/26/2012",
    "text": "can't tell if i loved this place because of the food, atmosphere or the great people i was with, but nonetheless - this place is getting four stars from me.it's a bit loud, but the scene is very posh and trendy. i like. i had the strawberry champagne and st. germaine champagne for drinks - both so good. the risotto was decent - nothing extraordinary, but still acknowledge-able. i had a blast here and i'll come here again just because i know i'll have great memories of this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oBLQxA8H_2t_OkK39DsQYA"
  },
  "t0_GeE04dVBjYZdPJREv4Q": {
    "date": "12/10/2012",
    "text": "Huge oasis in the middle of Soho. An absolute must if you want some relative sanity on a Friday/Saturday night. We went for cocktails in the lounge which are pricey but good then after the opera went back for dinner. Sadly, the pre/post theatre menu aren't available during December, but I had a decent steak and my partner an ok seabass that seemed to have been hanging about a bit. That said, the value was pretty good, the service excellent and the huge space with pianist in the corner an absolute joy. Looking forward to going again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6NZy0qKt9VN8f-59q76Og"
  },
  "ertTaRh4OXoY8I-hlTn4Ng": {
    "date": "1/5/2013",
    "text": "Place its nice old french classic restaurant, one of the first in London with legendary dishes. But lets talk about the food last years we went for a diner, place looks busy, fully booked. not really the best place to have a diner if you planing enjoy your food.Service was 5\\10. Drinks 4/10Food 6/10.and a bitt Pricey for overcooked stake and dry duck leg.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Vk5V-sBFwEqI25ghcsQexQ": {
    "date": "3/1/2011",
    "text": "The wine list was good and I would recommend to try sea bass. However, there's one problem of a receptionist who can't always get it right when it comes to table booking. Other than that, it was good for a friendly evening but not a quiet one.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KvUawU75Lf7i-u59Y1Ldew"
  },
  "xRArM1rUNV-12EHwIjPQ8w": {
    "date": "9/1/2009",
    "text": "I've not eaten here, but enjoyed a glass of champagne in the bar last Thursday night. I might love the chamapagne lifestyle but I can't really afford it, so a glass of house is £8, and champagne cocktails £9.50. The atmosphere was light and elegant although some people might find it a touch too dry. There are lots of seats, and I think it would be a gorgeous place for an extravagant date.d",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kO7sf5K4kV822ASuLId61w": {
    "date": "10/9/2008",
    "text": "A hard thing to come by: an affordable quality west end restaurant! I was very surprised to learn that this place was run by Pizza Express, I was only told after I had been there for an engagement party. We drank bubbly in the sleek champagne bar and then moved through to the restaurant where we had a lovely meal which had no hint of a pizza about it. We didn't even realise there was pizza on the menu! It feels like the kind of quality dining experience you would have at Quaglinos or alike but for a fraction of the price and without the pretentions. Good work Pizza Express!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-58CWJ48is4duXgpvsWEGA"
  },
  "pDFHKiBAlxN1nmvm3PWdBg": {
    "date": "3/17/2011",
    "text": "there are so many other places to eat around this area that Kettners just pales in comparison. Slow service and feeling ignored most of the time. the food was unexciting other than the tart for dessert.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAVIGAjScXWJ9ViXeJZW6Q"
  },
  "f8qtXkcoRD6ySD6sbfBFXw": {
    "date": "1/31/2012",
    "text": "I had a lovely dinner a couple of weeks back with a friend there. The place looks rather more formal than when you go in just for lunch but nonetheless, very nice. The waiter we had was a lovely chap who took care of us well. The food was enjoyable. All in all, a nice experience. I think they could increase the portion slightly for their lovely Boeuf Bourguignon! Hint, hint!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Fn4SKI89bingbcfWAY0HA"
  },
  "89EB2MjY4TkpOVKOYrgYOA": {
    "date": "1/17/2010",
    "text": "As someone who loves and lives for all things bubbly, how did I not know about this place???  A friend and I stumbled across Kettner's while looking for a place to have a quiet drink on a Saturday night.   Having passed by Thirst, Cafe Boheme, Bar Soho and were seriously considering Pizza Express (well, Pizza Express was never really in the consideration set to be honest), we turned the corner and saw this immaculate restaurant.  We walked around and discovered Kettner's champagne bar attached to the restaurant - a cozy, intimate lounge with low lighting and lots of seating.  And enough champagne to set a girl's heart a-flutter.  We ordered a round of rose which was delivered in classic wide-mouthed glasses, and our tab was held with a playing card (ace of hearts - love it).  I'm definitely a fan and will go back to try the restaurant next.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "J4MNbfV-Ohi05U6zCT059Q"
  },
  "aac9Z7_fSFwImuQFdr9vkw": {
    "date": "8/9/2015",
    "text": "What a beautiful bar! I haven't had the pleasure of dining here but the drinking/cocktail area is absolutely divine. For me it was like a cross between a Parisian lounge and a vintage American ice cream parlour - go there and you'll know what I mean! Utterly charming and very friendly staff, I will return!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2g8qeK-wr6pJOVY3CNXoQ"
  },
  "qCRTvYrsj3wfkGbgGmYr5Q": {
    "date": "3/12/2014",
    "text": "The idea of the place is amazing: a whole georgian house with bars, restaurants and private hire rooms for parties in a 1930s theme.The problem is that it is not as well organised as you would expect: I had a reservation at the restaurant at 9pm on saturday and they weren't ready, so we went to the Champaigne Bar for a drink (quite expensive) for more than half an hour.Then finally the table was ready but the place was very crowded and noisy (a common problem in London restaurants nowadays). the food is good, i had the chicken liver terrine and a steak and was satisfied with it. Wine list is okay and the service is proactive and polite. However, I was disappointed by the fact that the people were not very elegant, despite the various recommendations on the website and when I booked to respect the dress code. I felt a bit overdressed and the atmosphere looked cheaper than I would have expected.I think it is a much better place for the private parties than for the \"public\" areas.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRAnL4nPczO2JvNvsTE8wg"
  },
  "XVUproo7f9oXR4jBng_T-w": {
    "date": "8/11/2011",
    "text": "I like it. I like it. I like the funny feeling being here with you. La la la la la... Well not quite being there with you, but we could if you asked me nice. I digress, sorry.  So, Kettners. I book a birthday lunch for a friend and as organising things go, I did good (not that I every fail.) As ladies do, we started in the champagne bar, then took the opportunity to explore while our table was being prepared.  This little gem has wonderful rooms and cubbyholes that are just delightful. If you're not a guy please skip to the last paragraph, this bit for the boys. Guys, if you're working on a little filly, or looking to score some serious points with your lady, you so win if you take her here. With it's Ginger Rogers ole skool style glamour you just can't go wrong. It's actually a really good, impress the in-laws Sunday lunch kinda place place too, so go get em champ!The decor and furniture are classics but have an element if funky sass. The food is very reasonably priced and the staff are second to none. The chef even made me a special dessert because I said rhubarb crumble was my favourite - awwww love 'im.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZOJfIzyagVkh1HN6bFygIg",
        "caption": "Photo of Kettner's - London, United Kingdom. Ladies loos - how cool is that?!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZOJfIzyagVkh1HN6bFygIg/o.jpg"
      },
      {
        "img_id": "3KFdG-vCXZVwcQLsN64OyQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3KFdG-vCXZVwcQLsN64OyQ/o.jpg"
      }
    ],
    "user_id": "Pyha-8xF-Bfx27lPT1yofA"
  },
  "XtMz6oscUQFCE5t0LweoHQ": {
    "date": "6/16/2015",
    "text": "Went with work friends based on reviews here and was grossly disappointed. The place looks nice and the live piano music was great, but the food and drinks were only barely acceptable. My colleagues both sent back their barely cooked chips, my other colleague's pork was completely over cooked and my mash was cold. Would say maybe come for a drink at the bar for the atmosphere but for anything else, go elsewhere. There are so many way better places around.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aUV2PvxWCsrkXndHZYIf-Q"
  },
  "Rh-Jciy239CW6SjK-1WPWg": {
    "date": "3/6/2014",
    "text": "I feel like a 1920s flapper in this place, it's just the decor and the atmosphere! All I need now is a flapper dress and some lively jazz music to dance to, with a few guys in fedora mafia hats. I love their christmas drinks, their mulled wine even came with a Cinnamon stick stirrer- IT WAS ADORBS. (yeah, i said adorbs, what are you going to do about it?) Although, I must warn you, drinking with a stick in, and trying not to get the cinnamon stick hitting your nostril is a challenge in itself and so not adorbs. The special shots we ordered a round of, were so unique. That's the thing with kettners, they change their menu every so often that theres always a new drink you'll want to come back and try.But that's also their downfall, the second time I went, the drinks weren't so nice, there was some sort of pulpy alcohol fruit punch and it was just er..pulpy. And they kept forgetting my drink that I ordered, HALF HOUR BEFORE. Girl is getting DRY, people. I know we were a large party but DAMN PEOPLE, first rule of taking any orders down for a big party- PEN AND PAPER so you can keep track. I don't care if its impressive with smaller tables, i want the right order and at a reasonable time frame. I'd probably be back because it's quite snazzy, so if you're looking to impress a group, here's the place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "b_94nBF27vhxSWKzru1KpQ": {
    "date": "9/2/2014",
    "text": "One of Soho best restaurants :) We tend to go there everytime we are celenrating something or one needs cheering up and it never fails... Someone playing the piano while you have a good meal is lovely. Waiters are so attentive and ambience is great - Extremely organized and willing to satisfy your every wish. My partner asked them to write something on my desert and there was no objections!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dIXJKOe6vfZKO6L2-JBIwA",
        "caption": "Photo of Kettner's - London, United Kingdom. Good portion burger - Hand cut chips are to die for :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dIXJKOe6vfZKO6L2-JBIwA/o.jpg"
      },
      {
        "img_id": "puqvXGjJvfPez96zq61vdw",
        "caption": "Photo of Kettner's - London, United Kingdom. Melting in your mouth Beef :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/puqvXGjJvfPez96zq61vdw/o.jpg"
      },
      {
        "img_id": "zWNMf34r7D0zE3kRO1Q8jw",
        "caption": "Photo of Kettner's - London, United Kingdom. Goats Cheese starter - I could have it as a main! Was delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zWNMf34r7D0zE3kRO1Q8jw/o.jpg"
      }
    ],
    "user_id": "yMZgf24njfAKRU0uWfX_4w"
  },
  "S_oQGMUWG2io1f-PZkgeXQ": {
    "date": "12/29/2014",
    "text": "I've ended up in Kettner's three times in the last year or so for drinks - it's not somewhere I'd usually choose to go, but it's not to say I don't like it.  It's a funny place with quite a bit of history having been around since the 1860s and the place revels in telling you all the big names who've been in and out in that time (notably Edward VII).  I don't really care much about the 'class' of a place, but I feel that whilst the place likes to present itself as oozing class there's something a little stilted about it.  On the other hand, who am I to say considering I've never turned up wearing anything smarter than a t-shirt, so I suppose I'm one of them bringing the entire place down with me.  Or something.Anyway.  It's predominantly a champagne bar carrying stock from 23 'large' producers (the Perignons, Drappiers, and Taittingers of this world) as well as a decent selection from smaller ones.  It's champagne.  At a bar.  In London.  Bring plenty of £50 notes with you if you decide to go down that route.  Needless to say, I have not, but I found their cocktails to be pretty decent, if not wholly memorable - I first went on the infamous 2013 Christmas Cocktail crawl in the middle of their Christmas cocktail season (expect cloves, cinnamon, and ginger).  At around £9 each the cockatils aren't particularly cheap but I've had worse from more expensive places.  Last time I went I totally forgot to RTFM (menu) whilst ordering whisky and ended up spending over £20 on a Lagavulin double (50 ml).  My fault kind of, but I was totally stunned that they'd charge that much for a whisky which costs a shade under £50 a bottle in Waitrose.  Considering that somewhere like Nightjar charges about half of that price for a comparable drink, I can't help but laugh.In any case, it's a decent place to spend an hour for a drink or two although I wouldn't make a night of it there.  It's pretty spacious so it's a decent place to go on the fly on a weekday, although I'm not sure what it's like at the weekends.  Just stay away from the spirits.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j7_FGnfY_rI4A2PFLZbkgw"
  },
  "_MZutupSBQ5cNXxwqLJgag": {
    "date": "10/13/2013",
    "text": "Made a reservation here prior to a Friday night showing of Les Miz.  Did a lot of research trying to find London's pre-theatre dining version of Broadway's Sardi's and, as far as I could tell, this was it (maybe I'm wrong?).The atmosphere was fine (nothing special, but zero to complain about).  The service was very good.  Had a cute blonde for a server that my girlfriend wanted to extend an invitation to return to our hotel with us.  She never brought the appetizer we ordered and was very apologetic about it but I volunteered it was probably my fault due to a communication barrier -- although I speak (American) English as my first language, I need sub-titles to get through Guy Ritchie films.  The food:  my steak was way over-cooked.  I had to block off five-minute intervals for chewing each piece of my medium-well order.  The meat, itself was rather bland but I think they know this as they offer a variety of sauces to complement the order (a BIG no-no at any true steak house).  The dessert was terrific.  Although our server kinda botched that up too (we asked for a chocolate mousse w/raspberry caviar to share and to surprise us with a second dessert of her choice, alas, she brought us two of the same item), our dessert was perfect.  Despite the communication barrier between us and the server (of which I accept full responsibility), I'd say the cute, personable server was the highlight as the food itself weighed down the overall rating.Cute, fun server and bland, over-cooked steak is how I'll remember my night at Kettner's.3 stars seems about right.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fUnIZ6Z_hy68xjvWipXA7Q"
  },
  "XLQBIcWhaIaylFRXSjzSOQ": {
    "date": "5/29/2015",
    "text": "Stepping into Kettner's is a bit like stepping into a bygone era!  There was a piano player tinkling away on a white grand piano, our waiter was wearing a bow tie, and the powder room (!) has a chandelier. Our waiter was at our table very promptly, and very happy to get us a carafe of tap water (can't stand anywhere that tries to convince me I want bottled water instead!) We also ordered a bottle of Chilean Sauvignon Blanc, which at £26 wasn't cheap but was very tasty.  We each ordered a starter and main, I had chicken liver pate followed by sea bass on heritage tomatoes.  The pate was lovely & smooth, although the toast serving was a bit on the measly side for my liking. Seabass was cooked perfectly, fell apart under my fork, not sure tomatoes would have been my first choice but we'd ordered skinny fries and wilted spinach as sides so that more than made up for it.  The reason for the 4 stars is that we had the deal on tastecard, which made it great value, but I don't know if I'd have felt the same if I'd have paid full price as some of the servings are on the small side.  But all in all a great evening in a wonderful setting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_ZSTPsTdGoCbzl8HroaRng",
        "caption": "Photo of Kettner's - London, United Kingdom. Chicken Liver Pate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_ZSTPsTdGoCbzl8HroaRng/o.jpg"
      }
    ],
    "user_id": "8GrsAk4XtbB5I_Q7DtjHSg"
  },
  "FsiT8DBnKfw2XY0eOHbcuA": {
    "date": "3/18/2013",
    "text": "We were just in Paris last week whilst I was running the Paris Half Marathon, but I was still feeling a pang for a nice French meal. Besides, I've exhausted my walk-in karma at Brasserie Zédel, we were wanting to use our TasteCard, and we were calling tonight's dinner, date night. i.e. be a bit splurgy since we don't do it often. Now that the scene is set, here's how the night went. I'd heard a lot about Kettners prior to us reserving a table, and certainly it being on the TasteCard made things a little bit more alluring for the evening, and the menu sure looked like a classic French brasserie. And Yelpers seemed to like it. We were seated in the dining room that has a very interesting decor. It's ornately French, but strangely not as well. Bistro chairs were a little kitchy white, and mismatched, walls are grey somewhat English. It certainly loses a little atmosphere when compared to Brasserie Zedel. Service, however, was amazing. Our waitress was totalling rockin' and she was very knowledgeable about the dishes that they have.Our starters were actually really good. The cheddar and sundried tomato tarte was very well baked and certainly oozed with flavour, and the roasted red pepper soup was absolutely delightful. It was like tomato soup without the sourness of tomato, and a very subtle sweetness to it. We also ordered the pork belly and a coq au vin for mains. The mains I think were the biggest disappointment from the meal. I mean, it was good, and tasty, but I've had much better. The Coq Au Vin was a bit dry and the wine jus very very salty. The same dish at Bar Boloud was innumerably better. The pork belly was actually very well done, and I really appreciated the apple mash. It was a very subtle sweet flavour to an otherwise plain side. I think the pork belly meat itself could have had a much thinner skin to it, the crunch was perfect, but marred only just slightly by the thickness of the skin. All in all, it was a good meal, could have been better food wise, but it was a neat date night. I'd go back again on the tastecard, but if you'd like more value for money without the tastecard, go to Brasserie Zedel, and if you really just want to splurge, go to Bar Boloud. Both places have better atmosphere, and better food otherwise.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5pQIxCTGyjd89bqgUonNg"
  },
  "tfZ2JWfQsLlONG5Xq6TybQ": {
    "date": "6/21/2013",
    "text": "The food was phenomenal, and I used a tastecard so the bill was half off for food. We all loved our meals, but the service wasn't that amazing. We decided to all (4 of us) order dessert but they all came out at different times. According to our water the chef didn't understand his handwriting or something. But as etiquette demands, we did not start eating until everything was served, and my ice cream for the sticky toffee pudding was already melted. I would still go back no questions, that might have been an off day or a really busy night. The ambiance of the restaurant was amazing and a lovely location. You should definitely try!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "In46Vl71LOiXa0Pwj0UHAA"
  },
  "ruo9s87hVRCXRnvAT53Wkg": {
    "date": "3/29/2012",
    "text": "Bubbles, bubbles, bubbles!After a very long and busy week I was lucky enough to enjoy a Champagne Friday here with the lovely JB. She had already been to Kettner's previously and loved it and we knew that we deserved a little luxury after all our hard work.We went all out and ordered a bottle of champagne then were lucky enough to nab ourselves a table with a sofa and sit back and enjoy the glamour and decadence of our surroundings. I read that Kettner's was a series of Georgian town houses before being converted into a restaurant in the 1860s and Bing Crosby and Oscar Wilde have been amongst its diners over the years.I have yet to eat at Kettner's but what I can comment on is:- The bar - civilised and refined without feeling pretentious.- The staff - helpful and patient, happy to make recommendations.- The cocktails - ok, I only had one, it was the Triple 9 (vodka, strawberries and vanilla with sparkling wine) and I was not a fan I'm afraid, it was far too sweet and too much vanilla to the point where it almost tasted like plastic. It was hard to drink (but I managed... I always do!)- The toilets - plush! There are even some lovely seats to stop for a chat if you fancy (we did!)- The champagne - oh yes, the champagne, it went down well. Perhaps a little too well!All in all I had a fantastic time and I'm sure I will be returning with my Champagne Friday partner in crime for some more suitable squiffy evenings on the bubbles, bubbles, bubbles!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mvTskNQt0CMx8oTH1ku7-w"
  },
  "BaRRKgiZlkZeBtwxkYlOAw": {
    "date": "10/29/2014",
    "text": "We came here for drinks. The coctails and the champagne were great, the ambiance great. On the expensive side for what I consider to be appropriate but certainly a nice atmosphere for a drink or two.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJCV8eEoEAhARmu7R4v2AQ"
  },
  "S8HmFgVGptRHje19Av6Ijg": {
    "date": "3/23/2012",
    "text": "I picked Kettner's for a business lunch meeting because it looked a little upscale without being too pretentious and pricey. They do a £10 lunch which was a pretty amazing deal considering you get a main, dessert and coffee. Add a bottle of wine and you can do your business meeting for 4 for about £60.. not too shabby! The express menu had some good American-inspired staples like the half/half combo (soup and sandwich), cobb salad, stead sandwich, steak frites, there's something for everyone really. The service was great, lots of natural light, which was a plus for the sunny day we stopped in. Looks like there's some separate bar bits and they are meant to do wine/spirit tastings upstairs. I'll be popping back in for sure!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "9oJ2HYqCf5qi4z9XZTkoJw": {
    "date": "1/8/2014",
    "text": "What an amazing place! Original but classy decor, helpful staff and a large variety of alcohol. We were in the private section upstairs, it was for a Christmas do. The food was amazing, our host had ordered little appetisers which were small pots of different meals. Very good experience, and it has a manned coat cupboard, a very nice touch.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cTvFcE7TlYuoxoA1kShuKg"
  },
  "uqMZZETBzJC8v194-97WdA": {
    "date": "3/11/2015",
    "text": "Great food, great wine, great service. Especially love the pianist in the Brasserie. A must visit, perfect place for groups of friends or work.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nG-Esz0Pk92QXiKRunUdZA"
  },
  "fViU7P2YN-22GruwfDwfrg": {
    "date": "10/17/2011",
    "text": "I recently came here as part of London Cocktail Week, and have to say that coming to Kettner's was like stepping back in time...for two reasons.The first reason was that this place is seriously glamorous -- it has a similar luxurious feel of the Garden Court at the Palace Hotel in San Francisco,or the tea room at Claridge's here in London. I wish I could comment more on the actual detailing of the decor at Kettner's, but I'm afraid London Cocktail Week did a bit of a number on me and I can't remember it all too well. Suffice to say, though, that I half expected Bing Crosby to waltz through the doors in a tux at any moment.However, what I do remember about the decor brings me to my second reason why Kettner's was a step back in time: some of the chairs in the back parlour-esque area are ridiculously short and small. They happen to be big enough for an adult, but just barely. It's a very cute effect, but not great if you're particularly tall (which I'm not). I felt slightly like I was back in grade school again, sitting nearly at eye level with the table in front of me -- but instead of crayons, this table was covered in cocktails.Which brings me to my final point: Kettner's make lovely cocktails. We started off with the London Cocktail Week special (a bellini of sorts with an absinthe-soaked sugar cube and a curiously placed slice of fennel), but then moved on to their standards, which were the definite highlight. All of them were very well-crafted and delicious. The one that particularly stood out was the plum and mint julep, but be warned: this drink is seriously boozy!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "b5ukXoLyfPmKJ4x_LhapWg"
  },
  "XRCQKNcRMwehbKcIV9Zivw": {
    "date": "6/17/2014",
    "text": "Like everywhere else in London, Kettner's is a place of history. Apparently some king would take his mistresses there; something of that sort. I was in London on business and my company held a two-day meeting there, so I became very familiar with the place. Along with the restaurant and bar downstairs they have banquet and event rooms upstairs. The room we had our meeting room was very nice, open and had a lot of light coming through the numerous windows. They provided coffee, tea, and cookies as well as a lunch buffet of traditional English food. I thoroughly enjoyed the  atmosphere and the food along with the beverages served during the day and at night. We also had a  3 course dinner there after our meeting. The food was amazing, i highly recommend this place for events or for just a night out. Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vcZnXJANgL09LwfvBVcVrw"
  },
  "jF8NXRX_iYQqjUczL4UeyA": {
    "date": "12/18/2013",
    "text": "Yummy bubbles and small bites makes this a great spot to hang out at after a long day of walking and shopping.  Hubby and I found this place after a day of shopping for Xmas gifts, always stressful and had a couple glasses of champagne as well as mulled wine to relax and enjoy the night.  Yes pricey but so worth it as it is a beautiful space as well as attentive service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "Fcqlx1iFdSa0h-qKYFSYkg": {
    "date": "6/8/2014",
    "text": "Fabulous three course pre theatre meal. Farfalle was tasty and unique. Service was fast and the waiter was very attentive. I would definitely return!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgUJWQkPejak8JXqFi03_Q"
  },
  "i4YiVTuAYBcwyRiRHp4S1Q": {
    "date": "6/9/2018",
    "text": "My teenage daughter and I went to Kettner's for a special late lunch in the afternoon. They made us feel so welcome and special. It was mid afternoon so it was half full. The food was wonderful and the ambiance spectacular. The room had an enormous flower arrangement in the middle and the ceiling above was spectacular.We shared a couple of things. The smoked leeks were so interesting and yummy. Very unusual. We will be trying to mimic this at home. We also got lamb chops. Yum. So good. Not too fatty and grilled to perfection.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQgU1KDR4wyfK6TrleC-jA"
  },
  "x-ldEZ49XMCPUIuPoTSs1g": {
    "date": "6/26/2018",
    "text": "Kettner's originally opened in 1867 by August Kettner, who was rumored chef to Napoleon 111. It was one of the first French restaurants in London. It's also said that King Edward VII courted his mistress, actress Lillie Langtry here. There's a beautiful piano bar and champagne bar when you first enter kettner's. It's a french menu that uses locally sourced ingredients for the dishes. There's not much to say about this place besides the fact that it's absolutely amazing and beautiful. What makes your stay even that much better, is the customer service and the willingness of the staff to go above and beyond for their customers. It was my first time here and it definitely won't be my last. Although I'm not quite sure if a Soho House membership is required, I encourage anyone to stay here. It's in the heart of the cutest town in London, with AMAZING restaurants all around. Trust me, you won't be disappointed!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q1bHyhc4kzds1wrutjvXnw",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q1bHyhc4kzds1wrutjvXnw/o.jpg"
      },
      {
        "img_id": "Zf7quz8jwxFYlXzFFOYEZA",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Zf7quz8jwxFYlXzFFOYEZA/o.jpg"
      },
      {
        "img_id": "ZLKVpOUw21L-KsVoCg3LyQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZLKVpOUw21L-KsVoCg3LyQ/o.jpg"
      }
    ],
    "user_id": "bQxmERdcuss1NbgAKV3htg"
  },
  "O6lfskBMlg5N3pR5O4KVVA": {
    "date": "3/1/2018",
    "text": "Stayed with them for six nights and found food and service hit or miss. Accommodations are small but lovely. I had a beef filet one eve at bar that was tough and over-cooked. They lost my laundry and dry cleaning; was massively delayed forcing me to wear dirty clothes one day. There were other instances when Townhouse staff did not know what was going on with restaurants and what they were serving at various times of the day. I would give them more time to try and fix the details before rushing to stay. Nothing offered to compensate me for the various experiences.  Kristina was lovely and tried to address my concerns but overall they have some work to do as a team.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFdDceYFKLsDZB0uCC_g9A"
  },
  "lQpVF1ytlDj0kxm-ugyUug": {
    "date": "10/31/2016",
    "text": "We made a 530pm reservation before seeing Les Miserable. We walked in and we were the only ones there (thought it was closed!) They seated us at a corner table near the window. It was perfect. We did the dinner and show special and everything was delicious. But the MAIN highlight, my first taste of Sticky Toffee Pudding. Since I have never been to London before I thought pudding was the one that Bill Cosby used to be a spokesperson for back in the 80s and 90s...Not this one. It is a cake really rich and moist and it was served with a side of vanilla custard. I have never tasted anything so amazing! You HAVE to try this. We had really great service through our meals. The waiter and all the staff were very attentive and sweet. We hope to go back on our next trip.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m8JYCDyGfew2uWf8l7Zdfw"
  },
  "dgd-5b3cPLgjtBNut9vZUA": {
    "date": "2/12/2016",
    "text": "Amazing food, fabulous wine list and a very lovely atmosphere.Gutted to hear it's closing for a while as it was the perfect pre-thearte stop off!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "J2xqmPDW4dLNtav4z3n9VQ",
        "caption": "Photo of Kettner's - London, United Kingdom. Lovely starter!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J2xqmPDW4dLNtav4z3n9VQ/o.jpg"
      }
    ],
    "user_id": "Cbt2BfHLvRceqr0aEOBQkQ"
  },
  "AQaXW1HvrSs8QNnfid1GuA": {
    "date": "12/29/2015",
    "text": "We had dinner reservations at Kettners as it was my birthday and we wanted a nice meal after our show. Things started off fine at the bar, as this is where you wait until the dining area opens for dinner. Now let's get to the good part  once seated we decided on the lobster Mac and cheese and the salmon for starters - since we were starving we put in our starters to look over the menu for our main course - well apparently this is not customary because the server looked at us like we were crazy and then confused me as I could not understand what he was saying- now yes we are in a different country but I have had better conversations with servers in countries where ENGLISH is not the spoken language. It didn't get easier from there, they brought another tables meal to our table and then left and came back before taking the meal to the correct table, ewwwww why would not at least pretend and take the food to the back before giving it to its rightful recipients Our food came and for a £30 steak with £2.50 red wine sauce, I was absolutely underwhelmed- I've had better cuts of steak at less than half the price - my biggest gripe with this restaurant is the language barrier, I mean the menu is in English and I'm reading it to you but you don't understand what I'm saying - I personally won't visit again, the lobster Mac and cheese was the only thing I enjoyed",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o4F1OK12K72ncKj8aP2PQQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o4F1OK12K72ncKj8aP2PQQ/o.jpg"
      },
      {
        "img_id": "ICePiaVmcCUBEeRQek8Prw",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ICePiaVmcCUBEeRQek8Prw/o.jpg"
      },
      {
        "img_id": "AlphJ2RLYSWWa4tAvxC7GQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AlphJ2RLYSWWa4tAvxC7GQ/o.jpg"
      }
    ],
    "user_id": "zziWJMYwDjyVi7kJmgRUvg"
  },
  "Ol9lh_f_XPB1YrCGuncLqA": {
    "date": "12/16/2015",
    "text": "So I finally got the chance to EAT at Kettner's instead of just showing up mid-day on a Saturday for drinking. And I kind of wish I hadn't, because it has kind of soured my whole Kettner's experience. (Although I'd probably still come back for a drink or two).We opted to have our book group meeting here because we were reading Agatha Christie and apparently she used to go there quite a bit. We arrived about five minutes before our booking. We were told we couldn't be seated yet, but we could wait in the bar. WHICH WAS COMPLETELY OVERFLOWING WITH PEOPLE. It was loud and awkward. Plus I had a bit of a throat thing, so it was hard for me to talk loudly (Cue laughing from everyone who knows me). Fine it was five minutes. So we waited and got seated promptly at 7:00. It wasn't as if the restaurant was anywhere close to full at this point. I still don't know what the five minutes was about. Since I was having a throat/voice thing, I asked if they could make a Hot Toddy. \"No.\" Um, Okay... That's a bit brusque. So we look at the drinks. There was the monthly drink which looked as if it could be a warm cocktail. \"Is the cocktail warm?\" \"No.\" Double brusque.So we ordered. I ended up getting lukewarm tea and a shot of whiskey to make my own version-ish of a hot toddy. It wasn't very hot. And the waiter would disappear for ages. It was really strange. I only had one because it's not as if the waiter ever returned to our table for anything except to try to sell us dessert.I had the creamy cauliflower soup (well we all did), and it was freaking amazing. I was kind of shocked how good it was. For the main, I had venison with pear, spinach and a celeriac puree. It was also really tasty, but I ate it in like two minutes because it was the smallest main course I've had in my life (and it definitely wasn't cheap). Other people's looked much bigger. It was kind of strange. I mean it was two tiny slices of venison. Really well cooked and tasty venison, but tiny.We decided not to go for dessert. Although the steamed ginger sponge looked great. Mostly because it was SO LOUD in there none of us could hear each other when we were talking about the book. It was off-puttingly loud. Plus since I could barely talk, it didn't help. Normally I could talk over people like that, but not last night. They also really seemed to want to get people in and out. Our starters arrived quite quickly after ordering (even though they kept us sitting there for ages before we could order).So the only thing that saves Kettner's (the restaurant) from getting one star (because the service really pissed me off), is the delicious food. It's really delicious. Like annoyingly delicious given the service and atmosphere.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "3T1Y9JWGFRjZoV-DEOfV8A": {
    "date": "12/23/2014",
    "text": "Ooh these guys made me feel special! I booked one of their beauitiful private dining rooms for a birthday dinner with my closest friends. I think it was a fairly quiet night for them being a Sunday, but hey that's the date I was born and may have been part of the reason everything ran so smoothly.I booked the Cabinet Particulier which is at the top of the house and says it can take up to 18 peeps, but I had 16 and that was about right - you need a bit of space at either end to get around the large oval table that fills the whole room. It was laid out beautifully (crackers and all) and we had a dedicated waiter all night who was very diligent, from handing out Nutty Santa welcome cocktails at the start to telling me I'd run over time with too much chatting at the end woops...It was a very relaxed evening though and we all chose from the xmas menu on the night which had 3 or 4 options per course. It was spendy at £49.95 a head but delicious food so I think everyone was happy to treat themselves with it. I like pretty much anything involving goat's cheese but my starter was actually really nicely done. The portion sizes were also generous - I went for the traditional turkey and trimmings main and couldn't finish it. I was also concerned that the veggies got good value for money and it looked/sounded like they did, as did the vegan for whom I'd had to give them advance notice and they cooked up a giant cous cous stuffed red pepper for main!I covered the drinks bill for everyone which was also reasonable - there is an extensive wine list covering all budgets and for parties they'll usually ask you to choose a white and red option in advance. They don't ask for a hire charge either which is nice, just a minimum spend that I knew I would meet once you add up everyone's food and a cocktail each. Having done a lot of research on private dining rooms in London to find this place, this was the usual sticking point!Would defo recommend for a special occasion - you have complete control over the dress code and can set your own tone with the music too if you like. They have rooms for everything from 10 people up to wedding reception sized. It was such a nice treat to have a space to ourselves, and just made it feel extra special :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "LqIs_PIR0goWQL6etJAyrQ": {
    "date": "10/11/2014",
    "text": "I used to come to Kettner's on a regular basis, but have not been for a few years now. The other day, a friend called to say they have introduced a lunchtime 'Express' menu with a price of £9.95 for a main and coffee.  We decided that we would try it out and have a late lunch.The interior is just as impressive as I remembered.  I always wondered why such a classy looking place felt so comfortable.  I don't know why this is, but I still felt at ease as I ever did. The staff on our arrival were very attentive and welcoming.My friend chose the Fish and Chips; I went for the Caesar Salad. We chatted for a few minutes, when the Maître d, came to our table. He apologised for the delay, as he said this was a new menu, and they were having teething problems with the order system. We said it was no problem, but he produced two glasses of complimentary Laurent Perrier champagne for us. We were impressed as we did not feel we were waiting too long.The portions were great, and not scaled down as I expected them to be for the price. The presentation also made the food seem appealing ( I had problems trying to finish my meal as it was such a large portion).Whilst we were eating our main, the Maître d approached us again and apologised once more for the delay.  He then offered us a free desert. I went for a chocolate tart with pear sorbet; my friend went for the crème brulee. I'm not usually a desert person, but it was delicious.For a budget lunch I could not have faulted this experience. The level of food was only surpassed by the service. We will definitely return.The lunchtime 'Express' menu is 12-3pm. This is the current selection of mains:  Grilled 6oz Rump Steak, Roast Tomato Corn-Fed Chicken Caesar Salad Fish & Chips, Crushed Peas, Tartar SaucePan Fried Loch Duart Salmon, Spiced Warm Potato Salad Butternut Squash Risotto, Mascarpone, Toasted Almond (v)Warm Farfalle & Grilled Vegetables Salad, Pesto Dressing (v)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qSBRFhytY4ZfNRhaS29mBw",
        "caption": "Photo of Kettner's - London, United Kingdom. Not bad for 9.95",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qSBRFhytY4ZfNRhaS29mBw/o.jpg"
      },
      {
        "img_id": "HEbHuajgA6hMP4xf0S5M9g",
        "caption": "Photo of Kettner's - London, United Kingdom. Kettners new Express menu.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HEbHuajgA6hMP4xf0S5M9g/o.jpg"
      },
      {
        "img_id": "G3KeVX4rrFWk-WD8d6UagQ",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G3KeVX4rrFWk-WD8d6UagQ/o.jpg"
      }
    ],
    "user_id": "4ImiOF0YGpKa3X5kJ0FNeQ"
  },
  "UGpjzqkmCCyu-hNVM1yXeQ": {
    "date": "10/17/2015",
    "text": "Quick summary: The interior is nicely put together. The ambiance is welcoming. And the food is average while service is variable. One person in our party had an avocado salad, which contained a 2 cm piece of avocado. When she told the waiter that there was no avocado, he came back and pointed at the tiny piece of avocado. It was like a sketch from a comedy show. I had a salmon dish, which I thought was very well done. The fish was moist and not over cooked. Kudos. The chocolate pot dessert was chalky and overwhelmingly sweet to the point it tasted more like sugar than chocolate. Overall, it was an okay meal and worth trying but I would probably not return.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fJq7RPNxDKWan7muR058Dg"
  },
  "L_UjSXF6X9PcLLglD2_3dw": {
    "date": "5/27/2015",
    "text": "Fabulous cocktails and delicious food. I had to find somewhere of the right 'class' to take my American friends to - this was just the place. A lovely genteel, old fashioned, English restaurant - albeit with a great bar too. Cocktails kicked us off and they were fab - good prices too if you happen to be there at happy hour. Service was a little slow given it was so quiet however we were chatting so much that was not an issue. Food - beef bourguignon was amazing. Real melt in the mouth beef and lovely mash. If anything I would have liked a slightly larger portion or perhaps a serving of veg. Sorbet and coffee to finish. And all in all (for London anyway) a pretty reasonable priced bill. I will definitely be back here!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ochg_GQr_xInSsN-qO9rlg"
  },
  "5XsYJAyao3YyYj_d9F35QQ": {
    "date": "4/9/2014",
    "text": "I had the pressure of finding a dinner venue for 12 guests from around the world in 24 hours. I'm so happy with Kettner's. It's a great restaurant with a magically period building and an illustrious history. The three course party menu went down a treat. Everyone particularly loved the Sticky Toffee Pudding for dessert - it may have been a British novelty for the guests - but having eaten many of them in my life time I can say it was fantastic. The peanut butter ice cream was lush. If you're looking for a red wine definitely go for the Chilean Carmenère. It's quite incredible. What would have got them the 5 stars? The only let down was that our water wasn't consistently topped up and we had to keep on getting the attention of the waiters to top up the wine. Aside from that the service was brilliant and the evening was a success. I'm definitely going to head back there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1sfj-vk9WVnbDCFjCm4tAw",
        "caption": "Photo of Kettner's - London, United Kingdom. Someone else's mozzarella starter.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1sfj-vk9WVnbDCFjCm4tAw/o.jpg"
      },
      {
        "img_id": "tBGjj2O4xkcr31hajBL1CA",
        "caption": "Photo of Kettner's - London, United Kingdom. Steak and chips.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tBGjj2O4xkcr31hajBL1CA/o.jpg"
      },
      {
        "img_id": "AjrFfUV__JLxycf_MUyRjQ",
        "caption": "Photo of Kettner's - London, United Kingdom. Sticky Toffee Pudding with Peanut Butter Ice Cream and Caramel Popcorn. I still think about this sometimes.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AjrFfUV__JLxycf_MUyRjQ/o.jpg"
      }
    ],
    "user_id": "xR-ZqRZdz-NkR_pPdCKCYQ"
  },
  "vZs7PDyOMAN-58jCvQrMlg": {
    "date": "5/5/2015",
    "text": "kettners and I am whisked to an age of extravagance a long time ago. A scene where Oscar Wilde is telling one of his funny anecdotes with a probable motley crew of fellow eccentric artists or laggards. Anyhow, the plush environment sets the scene and I always wonder if I should be wearing attire appropriate for the rooms. There r few places in London which can concoct these feelings of the past in such measures. The food is secondary when u have this type of ambience. Soup was fresh and the beef borboignone was a little to sweet and dry for me. However this is a place were u can only have fun. The cocktails and wine were delicious and I was upset to be leaving again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tu4fyZsClRRU7hRMivOkIw"
  },
  "Xk5LzaYW-cTaXzWp-YoL4Q": {
    "date": "12/7/2014",
    "text": "I've been to Kettner's twice now, once for drinks, the other for afternoon tea. Neither time can I say I was disappointed, nor bowled over.I found the drinks to be pleasant enough, but slightly pricey. Hardly standout.The afternoon tea was better. I went with a large group of people for a birthday party. Service was quick, friendly and polite. The sandwiches were varied and tasty, the jam and clotted cream good quality, and the cakes imaginative and decadent. The quantity was satisfying too.One thing I am definitely not a fan of is the white interior. I appreciate they're going for elegance, but it just leaves me cold. Horses for courses I guess.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "sgTLdfcEXzKzKFeN0fdu2w": {
    "date": "12/5/2014",
    "text": "We came across Kettner's by chance while looking for a late-night drinking venue, choosing this place over a nearby pub as it looked a little classier. However, first appearances turned out to be deceptive - the service, drinks and atmosphere just does not match up to the price you're paying (£14 for a margherita).I chose a seasonal cocktail called Cherry Christmas, which apparently consisted of Disaronno, cherry brandy and Prosecco... Unfortunately these tastes didn't come through at all. Kettner's offers table service, but even when we had ordered our drinks it took another 30 mins before they arrived, meaning we had been waiting for over 45 mins with no drinks at all. To clarify, it was not even particularly busy.As a final disappointment, the bathrooms look beautiful at first sight, but every cubicle was dirty and untidy.... Not what you would expect from a place trying to market itself as high-end. I don't plan to return",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bRhsEMuHR8OPUudJZkFQsA"
  },
  "KOmL1hSIBlSUqALfpYzx3g": {
    "date": "8/6/2014",
    "text": "I so wanted to love this place.I'd been wanting to go for ages, and when I noticed they take Tastecards I was all over it.For those who have never seen it, Kettners is a bit of an institution in Soho. Beautiful building, beautiful rooms and just generally beautiful place (even the bathrooms).We started off at the bar and had their champagne of the month, an initiative I always appreciate, as it encourages you to try unusual champagnes, and not stick to the usual Bollinger. Then we were seated and the service is really good, but I was let down by the food massively.I had the chicken liver parfait which was nice but not amazing, but my main was the real let down. I had the black ink linguine with seabass and they were two different temperatures, everything was bland and it just didn't go.My friends also commented that their food was bland so it was a real shame - also, I hate having to add my own condiments so that particularly annoyed me.Best part was the icecream: buttermilk and cinnamon. Now that was amazing. But it's ice cream. Do I want the most memorable part of my meal out to be the icecream?I'll probably go again and order something else - anyone can have a bad day. I'll keep you posted!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_wqEP7DoN9nxhPIsi8SBA"
  },
  "8WME5UBuMQIEMAbQzOpbUQ": {
    "date": "10/11/2015",
    "text": "Went here with Mum and Dad last night, and not only have they extended Tastecard so it can be used on the weekend but they've removed the menu restrictions so you can now get all food half price. The service was brilliant, attentive but not too much. The food was outstanding. Started with lobster Mac and cheese then had steak then the Oreo cheesecake. It was all very, very nice. My parents loved their meals too. Will be back, very soon.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYggre5qf5263G_4TW4bBQ"
  },
  "rIw3QCJQunIQ6LX4c4s_Fw": {
    "date": "3/5/2012",
    "text": "Imagine a hotel bar and the SDF-3 had a child. That's pretty much what Kettner's is and you have my heartfelt apologies for dragging out such an obscure reference on a Monday. But I'm going to let it stand because I've got a case of the Mondays and I've used up my week's allotment of coffee breaks already.Kettner's was the last stop on our CMYE pub crawl for Yelp drinks and to be honest we didn't really need another one. But hey, they were half price so why not? There is a restaurant I hear is quite good, but this is just about the bar.The bar is spacious, elegant, refined, and at midnight on a Thursday very much empty. There were just three other people in the room with us although the private rooms upstairs did seem to contain a few more. The menu is adequate but by no means elaborate and they seem to focus on those pricier champagne cocktails that are full of black tie style but lacking in imagination, depth, and alcohol. This may be a bit unfair generalisation as the cocktails at Zenna we had just before were fantastic in every sense of the word but such is life.The waitstaff were friendly and service was very quick (which may be due to the high service to drinker ratio which was about 1:1 so no promises if it's busy). The seats were comfortable and I can easily see this as a good place to relax and sip a drink while catching up with a friend. The location is convenient to pretty much everything in the Soho area so that's a win too. In fact, it's pretty close to Mooli's if you fancy a late night Indian not a [insert suitable expletive here] burrito (which we did).Overall, there was little to make it memorable other than the most excellent company of Ian P (and his lovely missus), Peter S and Tisha B. But when you have them, what more do you really need?",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LFXCLFxPDDUz2Gf6wsFdZw",
        "caption": "Photo of Kettner's - London, United Kingdom. Abby should be a yelper!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LFXCLFxPDDUz2Gf6wsFdZw/o.jpg"
      },
      {
        "img_id": "D9CFco8xky5QxZIuJ3gZmw",
        "caption": "Photo of Kettner's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D9CFco8xky5QxZIuJ3gZmw/o.jpg"
      },
      {
        "img_id": "-yhAZXY9guB_2b2wdW9cTQ",
        "caption": "Photo of Kettner's - London, United Kingdom. We did pay the bill.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-yhAZXY9guB_2b2wdW9cTQ/o.jpg"
      }
    ],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "UzMxr7PoXLRJL-UlxLBZqw": {
    "date": "11/10/2014",
    "text": "A solid four star place - would have been five star if it wasn't for the food. Now, usually I base my ratings almost entirely on the food, but this is a place built on atmosphere and service, and it seemed only fair to take that into account. Both were impeccable. We were sat at a corner table in the back room and yet still felt very well looked after. A person at another table sent a dish back (the dessert special; more on the food momentarily) and they handled it very quietly, with no questions asked. Five star service; five star atmosphere - a beautiful restaurant. We had three courses, which is a rarity for me, but it was a special occasion. Started with half a dozen oysters (which, at £13.50, isn't terribly overpriced), which ranged in size from medium to massive, and tasted fresh and delicious. Absolutely no shell or grit in there, so kudos to the shucker. A bit of a fail on the mains - my partner's steak was cooked nicely, but had no sear; my duck confit was cooked too long and the skin went beyond crispy to impenetrable leather. But the actual meat was only slightly dryer than I'd expect. It was good, but not great. For dessert, he got a creme brulee and I got a blackberry/apple crumble with custard. Both were delicious. Overall, this is a great place in terms of atmosphere. And the prices were fairly standard - £16.50 for my duck; about £30 for the steak. The main course was just below my expectations for a truly spectacular meal, but I don't think it would prevent me from returning. I just might try the coq au vin (it looked delicious) instead.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zaKl7vvQ8w2GU2IZ30Nkg"
  },
  "rfO_XwKT9AVWm7ovZKyoBg": {
    "date": "4/25/2014",
    "text": "If you are looking for a nice dinner with friends or family, this is a beautiful place.  The building and interior are very stylish and gorgeous.  It felt like an old house!I ordered a \"Tesoro\" cocktail (Limoncello, prosecco and mint).  It was very lemony, sweet and refreshing.  The Beef Bourguignon was amazing.  Delicious, tender and cooked to perfection.  The mashed potatoes on the side were also smooth and very flavourful.  The table ordered a Gavi wine with our meal and it was wonderful.I would love to come back again.  Also, they do offer a Tastecard discount from monday-thursday! (Must be called in for reservation though!)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OepicbUeYRwxGWM_rp1JRw"
  }
}