{
  "ev2ZM55WD3rsLbXAT89ZqQ": {
    "date": "5/30/2013",
    "text": "Excellent food and a decent service. I had the bhel puri and mysore masala dosa. Both were very tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nov0HJsm1P9BsXGKSZd45g"
  },
  "zmmDxK-4XHxsne6MKFNnMA": {
    "date": "4/21/2012",
    "text": "This is a quality veg Indian place.  The food is tasty (we had somebhel puri, a masala dosa, and the mixed uthappam).  It's simple andplainly done.  It's not too expensive.  The food is substantialwithout being excessive.One star off because I would have liked to see more interesting thalioptions.After several medicore experiences at well-known Drummond Streetrestaurants, I have no intent of returning there.  Places like Sagarare a huge step up from them.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T0JSQjSRCKWEL0ekiwl0lg"
  },
  "PtPd2BMq9zGXcVyJDvSjtQ": {
    "date": "8/1/2011",
    "text": "I discovered this place on a recent trip and the wonderful walm welcome and clean decor drew me in.  I opted for the Indian 'pizza' uthappam as I'd never tried it before.  Man (woman) it was super tasty.  The flavours of the toping, onions, potato and coriander along with the gun powder chili were a riot and the rice & lentil base tasty and filiing.  I was bowled over by a FULL VEGAN menu and the very reasonable price.  I will definately return and sample some of their other dishes.  Super nice people. Go there!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J8L1jQzjoCrAmy3LWWZsJg"
  },
  "r5RUB3jNN6lR_uUyD9dg4Q": {
    "date": "4/10/2012",
    "text": "Wandered into Sagar for a late lunch with a friend, because of a vague feeling that we'd heard the name somewhere. Guess what, it must have been on some \"best of\" list! Because the food was delicious, the ambiance great,  and the staff a hoot. The samosas in particular were excellent - my friend is very picky about her samosas (she likes the pastry done just right), and she was very pleased. And really, the staff was awesome. Friendliest waitstaff I've encountered in quite a while. Definitely somewhere I'll go to again if I'm in the area!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ln0Qgr6zAp3OTLLA5MhjxA"
  },
  "4BSG-is0uaa3kad8obipNw": {
    "date": "10/5/2013",
    "text": "Very tasty, great value. A nice vegetarian option right near covent garden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJjh-wELn3IqqidI0xTteQ"
  },
  "EtUuYY7fUi1a53p3oJVE_w": {
    "date": "9/1/2009",
    "text": "Very good food. Also a branch in Hammersmith, North London, with equally good food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FH79bierETA44QEW86mx1g"
  },
  "W4h-j_lEG_f-Jr1TXCpLxw": {
    "date": "11/10/2009",
    "text": "Just a little update to say I came here at lunch recently for a takeaway (£3.50 for a lunch box- bargain!) and it was busy. Huzzah",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "FOH02K684lzDHKtNanaigg"
  },
  "UcR5Dkik7vy9VD6c-3smcQ": {
    "date": "3/13/2011",
    "text": "Great for lunch. £6.25 for a massive meal of dosa, bhajia, 4 curries, raita, pappadum, uppma and a sweet. Can't beat that. Dosas can be quite heavy in ghee for dinner, and the dinner special isn't as good as the lunch special (i'd give it only 3 stars for dinner).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fp92ETuvKYMljTKlU08bKw"
  },
  "7xucXg5mNqp74SEpSv0mKA": {
    "date": "2/1/2013",
    "text": "Thank you Sagar for bringing South Indian food to the area.  Dosas are a staple food for me in NYC and SoCal, but I haven't found a good place in London--until Sagar.  Although it's no rival to Udupi Palace in Artesia, CA, Sagar definitely satisfies my cravings.  The chana masala I ordered was a bit too greasy (likely made with ghee) but the paper masala dosa and puri were spot on!  A solid, affordable, pleasant lunch or dinner choice when I'm on the LSE campus and don't want to settle for the myriad, mass-produced flavorless sandwiches and soups on Kingsway.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "POwF9wTx5zxvPkte43IAhw"
  },
  "Enum7IZU3DJWee6bPC0vcw": {
    "date": "11/28/2013",
    "text": "The dosa is amazing, one of the best places in London. Staff can be a bit pushy but as soon as you sit down service is great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLHYgKyXFiY2ZgdYTz7QNA"
  },
  "tFPg_30SXLRqNx4-UDPxBw": {
    "date": "7/14/2015",
    "text": "I think I just ordered the wrong thing. after seeing the reviews, I wanted to come here and try lunch here. I'm an American studying in London, and I was really missing South Indian Food, so I gave it a try. I ordered a dosa and had to ask for water 3 times before they gave it to me, and I was waiting for my dosa, I just saw them throw it in the warmer, and bring it to me. I didn't see any lunch thali on the menu that was less than 17.95, and I wasn't about to pay that much. The entire restaurant is expensive, I don't agree with these reviews.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXqBxKJj-xhQgSzUrOnEPQ"
  },
  "i_lBisnRkszgL2F93SDUCA": {
    "date": "3/16/2015",
    "text": "We got a couple of the thalis, which are basically combination plates. The food was OK, it was not quite our style though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pliUi560OrdqFRTrBPMfAA"
  },
  "E9-OqsEd9rvwnaH_h0nJjA": {
    "date": "4/11/2013",
    "text": "This is 3.5 rating (yelp should really include half a star).I was attending a conference at UCL and being mostly vegan AND allergic to wheat I decided it best to hunt down my own food. Good thing I did as they were serving meaty-salad less sandwiches at the conference.As for sagar - I started off with pappadums that were quite OK, nothing out of the ordinary. However, the spicy orange curry accompanying was devine. It was all about that curry!For mains, I had the potato-cauliflower curry with lemon rice. Again, decent without being out of the way gorgeous. I did however enjoy the fact that it wasn't greasy as some Indian food tends to be. The lentil soup to along with the dish was good, deserves 4 stars.For drinks, I had fresh orange juice and again, just OK - a 2.5 starI would definitely go back for another quick lunch, but it is a bit too basic for dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tcTTATDVkNccRFVLZbdykQ"
  },
  "058RECBvvQwspXZCfxhfhA": {
    "date": "2/18/2010",
    "text": "Now I like a curry as much as the next Brit in line, but what I do love is veggie curry. Idlis, Sagg, Bombay Aloo, Dal... God bless a good Dal, even if my insides don't!I took my vegetarian parents here for a treat today at lunch for their special. £5.95 for a set 3 course meal Thali. That means to your a selection of tiny tubs of tasty curry on a big metal tray all to yourself. It's a fabulous budget lunch and a perfect way to warm yourself up if you've been wondering around Covent Garden in winter. As Zara L mentioned, they do tasty looking lunch boxes that you can take away, all healthy veggie food. What's even better about this place is that it's not that greasy and the service is quick so it's a perfect lunch spot. All the tables are quite close together so it's good if you want an evening spot with great atmosphere. A nice cosy restaurant. They have 3 branches and I'm tempted to do try the others too. Anyone with food intolerances should try this place, they have an onion and garlic free menu, wheat free and also a nut free selection, very impressive.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "sOSIVR5qV7D7Sk0vetuqGA": {
    "date": "4/24/2011",
    "text": "We were in the Covent Garden area this Easter Friday and needed some food to keep us going. On this strangely hot day, 27 degrees in London at Easter, we needed something tasty that would suit the weather so we decided to head to Catherine Street to check out the Southern Indian food at this branch of the small Sagar chain. We have often eaten at the Hammersmith restaurant and have always left happy with very little damage done to the wallet so this seemed like a good choice for cheap eats in the bustling tourist heart of the beast. Despite arriving at 5.30pm the downstairs room was almost full of folk busily chowing down and chatting away; as you would expect it was mainly tourists but I took it as a good sign that at least half the crowd appeared to be from India or thereabouts. The room itself is plainly furnished but has a nice vibe and is very laid back; no airs or graces here. We quickly gave the all vegetarian menu the once over and after a bit of debate, and checking out what the friendly Indian family next to us were eating, we opted to go for one pre-theatre set meal and one paper dosa which we planned to divide up and share. There is a great selection of dosa's on offer and the thali is a good choice is you are really hungry and fancy a full on meal. Our food arrived quickly and looked and smelled fine. The paper dosa, a lentil and rice crepe kind of thing, was huge. It came with some delicious sambar and curried potato and drew astonished looks from around the restaurant. The pre-theatre special came on a very fetching metal tray and consisted of a couple of curries, salad, raita, some lovely flavoured rice and a strange dessert of liquidised lentils and condensed milk. As we were sharing our food we asked for another plate which was brought with a smile. Half an hour later we admitted defeat; we had given it our best but we just could not manage to finish the very crisp, tasty paper dosa. Stuffed, but feeling full rather than bloated and heavy, we asked for the bill. We had washed down our food with a large bottle of Kingfisher larger, which was a great compliment to the food, and we still got back plenty of change from a twenty pound note which is a real bargain in this part of town. I look forward to feeling hungry in Covent Garden again before too long",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "E1B4WWjXm0wqKrIaGzmamA",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E1B4WWjXm0wqKrIaGzmamA/o.jpg"
      },
      {
        "img_id": "X-SSQOZPDAQDe3Aqq7C_uw",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X-SSQOZPDAQDe3Aqq7C_uw/o.jpg"
      }
    ],
    "user_id": null
  },
  "NFd2fCSdHIltIqC3AeEcYQ": {
    "date": "2/15/2015",
    "text": "Great food and service. Had a wonderfully spicy and flavorful curry. Nice presentation, too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Av0dIJzksxKerTmK4gKoyA"
  },
  "nkG3hrNPFAjwBA1TdyOInA": {
    "date": "6/22/2014",
    "text": "Are you vegan? Good news! You don't need to ask them what has dairy in it like you do at most Indian restaurants.  Instead, just say you're vegan and they'll bring you a dedicated vegan menu. BOOM!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u4AU3mWJx-hWi3yzYnbXg"
  },
  "BJpAzJd1S85BjVjlF68glg": {
    "date": "9/12/2009",
    "text": "Excellent post-theatre dinner to be found at Sagar.  Happily discovered this Veggie restaurant as we were making our way to The Fortune Theatre & promised the nice staff we'd be  back after our show.....sometimes it pays to keep your promises!Ordered Mango Lassis - outstanding!  Sweet & creamy in a unique way that made it stand apart from Lassis in the USPaneer Dosa - like a Cheese & Potato Curry Crepe - it was delightfulBhel Puri - absolutely fantastic & flavorful puffed rice dish with potatoes and a tangy tamarind sauceRasa Vada - crispy fried chana dal (chick peas) patties soaked in spicy hot rasam....like spicy donuts in sauceMatter Paneer - pees & cheese in tasty sauce  -  only dish we recognized from US menusAll kinds of different rices from Lemon to Garlic to Veggie & more than enough Southern Indian dishes for us to feel like we're never running out of optionsWill most happily come back to Sagar for future pre & post-theatre occasions & discover more wonderful new yummy dishes",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "37HswRimgBEf7_US-c3CDA"
  },
  "fcMR2lTFwIs05NPPn8QbtA": {
    "date": "10/17/2015",
    "text": "When I was living alone and missing home, missing idli... Was craving for some Indian breakfast. This restaurant was my savior. Well I went searching for it. There are not many places in London where you can find idli and dosa I guess. And it was worth going there... Probably the best South Indian breakfast place but don't expect more than that.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-8BFT26rFZ5_W1Kze2Nnw"
  },
  "_u9kMnOnIsfp-iLD_YwsPQ": {
    "date": "4/28/2015",
    "text": "I am *far* from vegetarian but this place is really superb. Spices were unique for my palate, probably a region I'd not tasted from. Fast service and accommodating.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qfgcE7NNjn5WcqxeueYyng"
  },
  "CYEY7ZjHYrtfCwvosTTKEg": {
    "date": "7/10/2015",
    "text": "this place is hit or miss - some of the Chat is out of the world. But the dosas are way too heavy (cooked with too much butter or oil), I've tried it twice and so have my friends and they agree. Come for the Chat, but skip the dosas..",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zL56yRvDyniWu1CHMbcHcA"
  },
  "LJV58RgiSmZOvheQ6syaag": {
    "date": "8/20/2011",
    "text": "Dhosa-licious. Being American, I was not blessed growing up with an array of good curry/Indian food options. After a colleague recently took upon her self to verse me on proper Indian options, we ventured out to Sagar for their 4.95 lunch option.Talk about value for money: pappadoms with chutney, a dhosa that rivals my torso, a small channa masala, raitha, samba, curry rice and coconut chutney. Prepare your tastebuds to be impressed, your stomach to be full and your wallet to only be slighty lighter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7DFGdcqOvYpOLI7WcbC4vw"
  },
  "wc1A1iNCSasYFGqZdM__ig": {
    "date": "5/6/2013",
    "text": "I came here for dinner -- AMAZING. They had a full vegan menu, which was extensive and delicious. We had some delicious Indian beers and ordered several appetizers and entrees. Everything was great. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AW2cimP0kAlKiNs4iEwa7A"
  },
  "k2V_HDpqlv-zhrfXerGp6g": {
    "date": "1/1/2014",
    "text": "Fast and delicious vegetarian food. Would definitely go again if in the area. The lunch  was a bit on the small side, hence one star off the top rank.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9Cm-4BAKjm1MJzIrrKV7A"
  },
  "p4d2hmm3y8ioWGFKSftnAA": {
    "date": "8/7/2016",
    "text": "Although the dosa was quite crisp and flavorful, the filling of potatoes, onions, peas, and cheese was an overcooked mash that was like baby food. There were four small pieces of paneer in this paneer dosa and very little flavor. The sev puri as an appetizer was tasty--I love tamarind and raw onion--but not much of a standout otherwise. Service was quite slow and my server was a bit rude. Luckily the proprietor or manager came to bring me cutlery, the drink I'd ordered, etc. when my server could not be bothered. Overall, the dullest of the six or seven Indian meals I've had on the visit to London, and by far the least healthy--starches, starches, and barely a vegetable to be found. And this at a vegetarian restaurant. I would never go back. It's also an extremely loud small space so it was not pleasant, but that's not the fault of the restaurant but the result of loud, loud, somewhat drunken groups that were there the night I was.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WAbWmZFg2YL6RCtze7E87Q"
  },
  "dCFR1jlZ-hZT88OxRKRJKQ": {
    "date": "8/1/2015",
    "text": "Delicious vegetarian Indian restaurant. Quick and friendly. One of the best curries I had in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e06PsFkHPDI3UQ3Pa-Ep0Q"
  },
  "AHfwiEfznlgwPniy7NLfdQ": {
    "date": "4/5/2012",
    "text": "Packed on a thursday lunchtime which is promising. Service was swift and friendly. Menu doesn't have the wide variety of southern dishes that some other restaurants have, but this is because there are some general indian favourites such as samosa and bhaji. Starter was deep fried spicy potato, can't remember the name, but it was good. Gentle spices and complimented with a cool coconut sauce. The paratha is not as flaky as other places but the sambar was very tasty indeed. Overall, I'd recommend it.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "g7Pxv8mBa2-atbANAKjk1g",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g7Pxv8mBa2-atbANAKjk1g/o.jpg"
      },
      {
        "img_id": "R3SF39WiXva5qYmNjkH44Q",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R3SF39WiXva5qYmNjkH44Q/o.jpg"
      }
    ],
    "user_id": null
  },
  "M4YyzatVOP-L0j0gTdCv6Q": {
    "date": "5/12/2013",
    "text": "Excellent service and a pleasant atmosphere were both there in spades. The food was good, and well portioned. I went with a friend, and we split an appetizer, both had a main, I had dessert, and she had coffee. Came to GBP 24.05, which isn't bad at all. Only downside was neither of our water glasses were refilled over the course of the meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7vrWzOZ5wpa0AkCQdH-Hw"
  },
  "1dArR0WtH5jDI8Nlge_BUw": {
    "date": "9/6/2015",
    "text": "I've eaten here several times, and it's always very good. If you're looking for interesting vegetarian cuisine at a sit-down place in Central London, this is your place.The cuisine is Southern Indian (as opposed to the more typical Northern Indian in London), and all-vegetarian. It's a nice quiet ambiance and the waiters are informative. Recently I had the Rava Masala Dosa for lunch --- a delicious thin friend pancake filled with potato and vegetable, served with two sauces. It was plenty for one person, and at £7.50 I thought it was a great deal. I've also gone with groups and gotten various things to share, which also works well.The food is good and the waiters don't pressure you. It's not overly formal or fancy, so keep looking if that's what you have in mind, but for the price Sagar is excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ep1FC0pbAqLyLCij3cS_uw"
  },
  "uVVlfuHYCHFHW1uAOPDFWw": {
    "date": "6/30/2016",
    "text": "What an utter disappointment. My very first experience with Indian food was in London more than 12 years ago, and ever since then I have prized the city's special wealth of Indian flavor. After talking up the Indian scene in London to my partner for years, I finally had the chance to take him out for some. Imagine my disappointment to find that the dishes in this place were absolutely flavorless. Everything tasted like tomato sauce. For 45 pounds we had 4 plates of what I can only characterize as British-ized bland rubbish and 2 glasses of wine. Do not recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BA9tWqYOBSBsjm3me5Blhw"
  },
  "YDmYj6KIera3wMB8Y_BiGg": {
    "date": "3/12/2016",
    "text": "Having come here before we returned for a late post-show lunch.  Staff were miserable and efficient if not polite.  Asked for a jug of water but was brought 2 glasses of water so I again asked for a jug of water.  The surly waiter went away but no jug of water ! Every indian restaurant I've been to provides water unasked.  If they don't have jugs, why wasn't I told that?  The meal was mediocre and we won't be going back there!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xD7QBCyB35FuH1RTvBU6w"
  },
  "vmpLJIC9_qQ_fJJQLeuGdw": {
    "date": "11/7/2015",
    "text": "I really liked the food and service  here. I had a stuffed Myvari (sp) Dosa. Delicious! My waiter was attentive and even offered his phone for me to search Yelp to see what dishes others had tried  (there's no wifi) In a city with limited vegetarian restaraunts, I'm already planning my next trip back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FnPCdniRlq2DNxNokS82Fg"
  },
  "t01VAMGs2y5LdMm38m1d2w": {
    "date": "7/12/2015",
    "text": "Fresh tasty food, impeccable service, authentic vegetarian, prime location and affordable. Could I ask for anything more. I was staying at the nearby Strand palace hotel, and once I found out about this wonderful little nook...I couldn't resist the lure and came daily.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rhrnfmXmHJ3kxtrm5jecFw",
        "caption": "Photo of Sagar - London, United Kingdom. Sagar Thali...tasty and sumptuous!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rhrnfmXmHJ3kxtrm5jecFw/o.jpg"
      }
    ],
    "user_id": "arKrfnTMBT96fcZzjHJhSg"
  },
  "wpc6PlXgvi9xCiZptFtVkw": {
    "date": "7/7/2015",
    "text": "The food was great and the service was even better! We ordered a masala dosa and lentil doughnuts in yoghurt sauce to share. They were both delicious and came really quickly. I would have been happy with the meal even if it costed more than just £12.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DtG8Ww-x-IJZvsj5tuGD-Q",
        "caption": "Photo of Sagar - London, United Kingdom. Masala dosa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DtG8Ww-x-IJZvsj5tuGD-Q/o.jpg"
      }
    ],
    "user_id": "t6YxLAZUBxdIuVvugvnBrA"
  },
  "DeAfY3Jm_CN7p8KxOaZnLw": {
    "date": "2/22/2015",
    "text": "I went here with my cousins after a very long travel day and it was just the nourishment we needed. Unfortunately we had to end up taking the food to go as on of my cousins wasn't feeling well at all, but our server was extremely nice and understanding about the situation. We enjoyed out curry naan, and lentils at our flat and it was just as good as it would have been in the restaurant! A great little (it's tiny!) place tucked in Covent Garden, a very busy! Try and make a reservation if you can.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RORrWniaUl8nseq47oLOyg"
  },
  "VKEu7v7x1__E72DrHWzT_A": {
    "date": "9/20/2015",
    "text": "First review on yelp! MUST try their yogurt rice! I was a bit uncertain when I ordered it, but it turns out to be a surprise! I love it's special orient scent and the sour taste of the sauce that came with it. Gotta love this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F68mA-Pn53xQ2vw1-U2O4Q",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F68mA-Pn53xQ2vw1-U2O4Q/o.jpg"
      }
    ],
    "user_id": "MhFtIWC3tT1T_4ks0alM1w"
  },
  "Ol6Lpg-WLBzVSw2LpNohzQ": {
    "date": "7/23/2016",
    "text": "Impeccable service and great food. Truly traditional Indian dishes served with a London flair. Worth a try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbVdqBJ5_prVAdklSD_FRQ"
  },
  "UR1XUp55dzvtb4doU_V4tA": {
    "date": "12/19/2014",
    "text": "Sagar offers wonderful comfort vegetarian food for great prices. I've been here a few times now for takeaway, their lunch special, dinner, sit-down lunch. The dosas are especially crispy and tasty, as are their lentil pizzas. Though I'm not a huge fan of their samosas, the lentil doughnuts are delicious and probably unlike anything you've ever eaten, so definitely give those a try!If you're around Covent Garden/Holborn/The Strand, get their takeaway lunch special. SERIOUSLY. It's a great, quick lunch option and cheaper than a small soup and bread from Pret. A STEAL. I'm not complaining at all about my workplace's proximity to this cosy little restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yclQAOoXgrozfwP7Y5NkQ"
  },
  "Htmp63ESks3HLidoq4mTMw": {
    "date": "1/4/2016",
    "text": "Food was okay-ish and the price was a little higher than expected. But probably one of the few good south Indian places in the west London.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GbXFTs4xUgp9IwA5MfZKsg"
  },
  "MC8X14T9vDf50BPv8kc1qA": {
    "date": "6/10/2015",
    "text": "I was very excited to find this South Indian restaurant! Most Indian restaurants serve only North Indian, and few places include South Indian dishes. The restaurant is open for most of the day, and I popped in for a lunch/dinner. I had the idli, rasa vada and pappadam. I think the flavours were toned down due to localisation, and the rasam was not as tangy as I would like. The idli was a bit softer than I'm used to (no one in the restaurant was eating with their hands, so no issue there...), but tasted good! I would visit again and try the uttapam. The thali looks very good too but looks like a lot of food...perhaps for a party of three or more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjlLxH1AYpwZTLmi6hpMvA"
  },
  "7kuHOTTBtenG1vhnMVy9HA": {
    "date": "1/14/2015",
    "text": "Really good food - quick service too. Definitely coming back. Impressively they're not only vegetarian, but they also have a wheat free menu, a plus by any standard. Lots of choice.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YV-EnVxd8KPYYW_DwKD7GQ"
  },
  "RjfPKmT0Zww-Wn3weppGxQ": {
    "date": "6/10/2016",
    "text": "Nice vegetarian meal in Central London. From the medu vada, in particular, you can tell the food is authentic South Indian.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJlHVHA0ueNZZ2CLlfX31w"
  },
  "fbBqy0T0XyYyLr_hYApctw": {
    "date": "4/8/2015",
    "text": "If you want vegetarian indian food, and you're near Covent Garden, this is the place to go. It's bigger than it looks, with a whole first floor dining room in addition to the ground floor.The menu is South Indian, which means dosas (pancake-like breads rolled with vegetables inside). Of course there's more to it than that, but those are the classic South Indian dishes. I've eaten at their Hammersmith location, too, which is also good.The prices are quite reasonable--given the area, the staff were prompt, and the food was good. I definitely recommend it to my friends who come to the area looking for Indian.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UpjdWjg7Uxv8rK9IebPdA"
  },
  "f8__sC-oANtNf4TQiabAAQ": {
    "date": "4/24/2013",
    "text": "Man - did my brother and I order A TON of food here for lunch. We spend $$$$ money here for sure.It was apparent that it is our first time and I ordered a tons of stuff. I wish the waiter would have told us that the TWO SOUPS we ordered is actually in our main entree as well - I would have saved some seriously dough if he told me that. I know they want to make money, but still - would be nice to let your customer know that they would be getting it TWICE.Also, I've noticed they recycle a lot of this one curry throughout the entire meal. I seriously got it 3 times on 3 different entrees / selection. It's not just a side that it comes with, but it is seriously part of the dish. Very interesting.Anyways, what I do like is that it has a \"onion and garlic free\" menu. Pretty nice. I haven't seen that at any Indian restaurants before, so I will give it \"thumbs up\" for having that. I might come back, but I feel like I'd probably want to try out other restaurants, or stay with ones that really whoa me in London when I visit again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gGAbeX0s-aueUStJmMZt_w"
  },
  "NByw_XyyS97ecEFRIE4ZHQ": {
    "date": "10/15/2014",
    "text": "This was a great find thanks to yelp. Really important!: This place is vegetarian - not all vegan! Make sure to ask whether items are vegan before ordering if you are vegan. I didn't realize this until this morning when I looked on the website. Yikes!!I was on a trip to London and didn't know the area really well. A friend and I were in the middle of Covent Garden and didn't know where to go. I'm vegan, so most places is off limits for me. I pulled up my yelp app, typed in vegan, Sagar showed up - friend said Indian is fine. And off we go! It was only 5 mins from where we were. A decently-sized Indian restaurant. I ordered the Aloo Ghobi and I asked to do it less spicy, which they accommodated. The food was really good and reasonably priced.The Aloo Ghobi I ordered is vegan (thank God!), but I had some bread, too, and I'm not sure they are vegan and I have forgotten the name already. Looking at some of the descriptions on the web menu, the bread I ate was probably not vegan :( .  Lesson learned, always confirm whether something is vegan even if I think it is. No more assumptions. I hate making mistakes like this.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M63PPmdetjgwx2F7wA_hJw"
  },
  "YXcYf4c5g1IhTeLiBWa_Sw": {
    "date": "6/29/2015",
    "text": "I don't often Yelp but when I do... This place is great even for non-vegetarians. It was really good value, the service was very quick and the food was some of the best Indian I've had. The Dosa's were particularly good. The area is also very nice and walked around the corner for a Gelato and to watch the street performers at covent garden afterwards.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSVdTK7mLhLVmVinVv7fVQ"
  },
  "hZ5txFSWT3jHefkte_vvnQ": {
    "date": "11/3/2013",
    "text": "Really delicious vegetarian Indian food that's also really reasonable for the area it's in! They do takeaway boxes for £3.50 which I hear are amazingly good, but we just went for a sit-down dinner. We were seated immediately on a Saturday night which was pretty surprising, though if you're bigger than a group of 4 you might have to wait.The service was prompt, if impersonal, and the food came out incredibly quickly! I appreciate that they don't faff around, though I can see that the food most likely isn't made fresh to order. That's not at all a complaint either, just an observation! It makes things quick if you're in a rush.The onion bhaji's were not the best I've had but still tasty. All the curries we tried were super tasty and portioned perfectly. The mango lassi was also super good, and in a huge glass so is definitely worth the £3.45 price tag. In all I would definitely come again, and bring my vegetarian and vegan friends.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU8n9Is1dbbasCTd5kKMWw"
  },
  "F0Q2pycLw8n-cZ0ZTHWRkQ": {
    "date": "9/29/2016",
    "text": "Fantastic! Great service and super accommodating with our toddlers stroller. The food is excellent and the service is great!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4c2F7kbQorMhilnbPJ7Vg"
  },
  "KXfQIZUYtPB5PR-CeWhghg": {
    "date": "10/10/2016",
    "text": "I went to the Covent Garden's one for take out.First the service: REALLY BAD!!! Seriously, when I ordered over the phone, the guy I was talking with was really fast and sounded like I was annoying him.When I arrived at the restaurant to take my order, I realized something was missing (of course because the guy was talking so fast and not taking the time to explain it...) One of my friends ordered Sambar but didn't notice you needed to add any side dish (like rice or chappati for example). I had to wait the time to have additional chappati.Honestly, I may have met the worst waiter of the restaurant ! No smiling, talking fast which made him difficult to understand and not taking the time to explain the food they serve (even if you looked lost or confused)Except that, the food was DELICIOUS! Really good and cheap, which is perfect when you're craving for spicy indian food and not ready to pay a lot.I will go back for sure but I'm really hoping I won't face that waiter again...",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oj8RHeu2_I9hMmme8IbU4A"
  },
  "G2om8UCyHNuVuEo6Y5aZ3Q": {
    "date": "12/10/2016",
    "text": "Food is ok and expensive - which isn't surprising given it's location in heart of the city. I didn't appreciate that 12.5% gratuity was automatically added to your bill, which wasn't mentioned in the menu or was brought to our attention so add that cost to your bill.I judge a restaurant by how well their bathrooms are kept. It was smelly and filthy, seemed like they haven't been cleaned in months. This speaks a lot about their focus on cleanliness and hygiene and makes me wonder how the kitchen would be.I hope they consider this feedback constructively and rectify it. There is a lot of potential in this place and we need some good south Indian restaurants in London. For now, I might stay away from it unless I just crave for some unhygienic south indian cuisi",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "izspdOSjJ4pPnm-HE4CqOQ",
        "caption": "Photo of Sagar - London, United Kingdom. Filthy bathroom, wonder how the kitchen would be",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/izspdOSjJ4pPnm-HE4CqOQ/o.jpg"
      },
      {
        "img_id": "qCHXOHnGHLbIxinqXOMcPg",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qCHXOHnGHLbIxinqXOMcPg/o.jpg"
      }
    ],
    "user_id": "vL2xX96QZilQpJAMZ65WNQ"
  },
  "4gzdneFhfq_8zOVgoJG3sw": {
    "date": "3/10/2018",
    "text": "Excellent dosa (I got paneer), excellent curry. It's a little cramped, but I I like the more casual atmosphere - not another Indian place with white tablecloths. Food came out surprisingly quickly given how crowded it was. Good spot for food before your west end show.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_13F9Xb0NZC01QGgyPoW2Q"
  },
  "E9A_TbrM3ywAvxOvicNvUQ": {
    "date": "3/4/2018",
    "text": "Food is good here especially South Indian dishes but it's pure vegetarian so no options for meat eaters. Service and ambience is ok. I would come again if I am craving some good Dosa.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIzz-oQ2mrgEXxBg-xKOmw"
  },
  "Li9TRH_G0geuavOEqzYa1g": {
    "date": "5/9/2017",
    "text": "Fried dal was very salty but chana masala was very good. I have a cashew and dairy allergy and like how the menu explicably says whether or not the dishes contain those ingredients.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cLM7FeQRD97nhmIbOO1dRQ",
        "caption": "Photo of Sagar - London, United Kingdom. Fried dal, chana masala. Fried dal was too salty but the other dish was very good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cLM7FeQRD97nhmIbOO1dRQ/o.jpg"
      }
    ],
    "user_id": "lFfW0QggerebrC8jyLzvzw"
  },
  "10AuqeypDvasWzUiCuBelQ": {
    "date": "5/15/2017",
    "text": "Went here for a late lunch, and we didn't pick well on the food. It ended up being a starch-fest from the steamed rice cakes, white rice and potato dish with a side of flat bread. I'm sure their other dishes are impressive, but we picked wrong.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3a3yOG7J3DaTMGer6xJ6DQ"
  },
  "1-0MCtxGAhlERmYfiabHfQ": {
    "date": "2/23/2016",
    "text": "Simpel Indian Restaurant with very good food and nice prices.I had Aloo Ghobi and my partner Mysore Masala Dosa. Since I am a vegan I had to ask about some ingredients, I've never heard about before and the staff was very helpful. They even mentioned, that the meal of my partner is not vegan. Just in case we didn't see it. I like this kind of proactive service. The food looked good and tasted good. I liked, that they had their own dinnerware with their logo on it. It was not too fancy, but I liked exactly this. This restaurant is maybe not the right place to go out for a fancy or romantic dinner, but it is simpel and has very good food. And they have a very big variation in their menu for vegetarians and vegans.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "98RByvLSiIF20RwxqVtjdQ",
        "caption": "Photo of Sagar - London, United Kingdom. the restaurant from the inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/98RByvLSiIF20RwxqVtjdQ/o.jpg"
      },
      {
        "img_id": "lfDeu28q63Qr4zIJANnseQ",
        "caption": "Photo of Sagar - London, United Kingdom. Aloo Ghobi for me and Mysore Masala Dosa on the other side of the table",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lfDeu28q63Qr4zIJANnseQ/o.jpg"
      }
    ],
    "user_id": "HHUfVCCFaYmowhh21zTzcQ"
  },
  "SNoeWyIZjVUNFLJCbgUzuQ": {
    "date": "10/28/2017",
    "text": "Good food, fast service and excellent value. The eggplant dish and paneer were excellent.  Spices as in India!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xcl5ZLbb_n0VZqtw7bWt7g"
  },
  "kecyOFRoIAu03LP6qAlbSA": {
    "date": "12/6/2015",
    "text": "Kuddos for an excellent vegan and vegetarian menu. I was delighted by the menu and the food is tasty. I have had better indian food, but given the fact that's in the middle of the touristy part of town - i kind of knew what i was walking into. Staff is very attentive, but....here are my two reasons for -2 stars:1) a gentleman who was my server would not smile, he seemed grumpy and to some of my questions he wouldn't even answer, he would just offer a pointing finger as an answer in complete silence. 2) the little clique of 3 guys (owner's son is possibly one of them, if my stereotype recognition mechanisms are correct) that was hanging out in kitchen was...just a little silly, with observing the guests in a rather small and cramped space and pointing fingers to the dining hall, clearly discussing the guests amongst each other. A bit unprofessional.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "LKuGvqZfJ0ye-F8QcdREHw"
  },
  "qj2ExOfZxKLl8UKmjtxdew": {
    "date": "12/4/2014",
    "text": "Nice ambience with interiors tastefully done with Hindu idols and pictures, Good honest food. Tasty and can even taste the quality ingredients! £5.95 for a small lunch time Thali is a bargain. The Menu is exhaustive and based on what I tasted in the Thali appears to be authentic South Indian.Recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zk9u8rXkSO3VaNpzZJuo3w",
        "caption": "Photo of Sagar - London, United Kingdom. Lunch Time Thali",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zk9u8rXkSO3VaNpzZJuo3w/o.jpg"
      }
    ],
    "user_id": "y6O5bQKJNMlNyBdflaklCw"
  },
  "l0Bdnh6LOoGMyf0D3LSosw": {
    "date": "3/9/2017",
    "text": "Living in waterloo area, this is one the best choice for indian vegetarian food. I always order Rajasthani thali and it doesnt disappoint. Portion is good size. Will try out more individual items.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nM5IAZ_e7FlTDgyVJ-iUGA",
        "caption": "Photo of Sagar - London, United Kingdom. Rajasthani thali",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nM5IAZ_e7FlTDgyVJ-iUGA/o.jpg"
      }
    ],
    "user_id": "eV1ox_DFjghD82s1AYhBeg"
  },
  "Xkbvguyf5Sg5zB4qZj7U-w": {
    "date": "3/7/2017",
    "text": "Eating their pani puri and dahi vada. Frankly very disappointing. The vada is stale and so is the puri. I went by google and trip advisor reviews and this has been very disappointing. Their onion chili uttapam is equally disappointing. Not impressed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y2vUSDgceDEhNGyhqxTPvA",
        "caption": "Photo of Sagar - London, United Kingdom. The vada is stale and so is the puri. I went by google and trip advisor and this has been very disappointing. Next  onion chili uttapam",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y2vUSDgceDEhNGyhqxTPvA/o.jpg"
      },
      {
        "img_id": "E_rkf-93djrR7bBfAQ7ZSQ",
        "caption": "Photo of Sagar - London, United Kingdom. Disappointing Pani Puri and Dahi Vada",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E_rkf-93djrR7bBfAQ7ZSQ/o.jpg"
      }
    ],
    "user_id": "bj5Of0rKo_ql4prIy6WuSg"
  },
  "9amqS519J8TmuSwn2IaT8Q": {
    "date": "7/17/2017",
    "text": "I went in with a group of friends expecting something very different from what we received. The food is so average and tastes are not at all 'South Indian'. (I am Indian). They're pandering to a wider crowd by having all the chat/Chana type of dishes which are not South Indian.The portions are small and the service is plain bad, kept forgetting our order. They added an automatic service charge of 12.5% for this 'wonderful' experience.Just one word: Avoid.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9jptXDA_a2HsoIaQyJTVTQ"
  },
  "ouEKzvw7wjs9tNo9_FkVMA": {
    "date": "10/10/2015",
    "text": "For my first review of this place, I'm giving it lower star ratings because ... I got a bit sick from it!Have actually been back since, ordered the same thing and felt just fine, so could have just been a fluke, but for now I'll call it at least inconsistent.  Approach this place a bit warily.Besides that, food actually tasted really good.  My go to dish for South Indian places is Mysore Masala Dosa, and they do it quite well here.  Only gripe is that they use carrot in their masala!  Totally a British addition which is a bit weird for me.  Also have had their coconut uttapam - wasn't the best I've had, (came out a bit dry), but it hit the spot if you like coconut.The sambar and green (coriander?) coconut chutney are quite well done.  Coconut chutney is basically the reason I love south indian food, and they didn't disappoint here. Sambar was nicely spicy - I could taste the spice so might even be too hot for non-spice lovers.Some nice uncles as waiters.  Not overly friendly but quick service.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gxKFQeEsDhnT2Lggaenwmg",
        "caption": "Photo of Sagar - London, United Kingdom. vegetable kootu (yay!)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gxKFQeEsDhnT2Lggaenwmg/o.jpg"
      },
      {
        "img_id": "wS0pJ8p8zZflQEKu8ztz0A",
        "caption": "Photo of Sagar - London, United Kingdom. brinjal bhajee (great sauce, meh aubergine)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wS0pJ8p8zZflQEKu8ztz0A/o.jpg"
      },
      {
        "img_id": "y8GjwjBJX50b7FGTU2MXFQ",
        "caption": "Photo of Sagar - London, United Kingdom. lemon rice (yum!)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y8GjwjBJX50b7FGTU2MXFQ/o.jpg"
      }
    ],
    "user_id": "qxzEjPRlffffbL_D874iGA"
  },
  "mZHTrdX9KHT1cfeHhVtvEA": {
    "date": "2/24/2016",
    "text": "My friend chose this place based on the reviews and the fact that the menu matched a lot of what she'd eaten in India, so it was nice to know we were going to be eating authentic Indian food.Unfortunately, a lot of what I ordered - idli and a lentil pancake - was either bland or just OK and I was still hungry at the end of it. Having said that, my friend ordered a thali dish which was both delicious AND filling - I know this because I ended up polishing off her dish too! Another good point is that it was very well priced - our food bill was under £15 per person.Service was OK, they were friendly, but a bit slow and not overly helpful when it came to suggesting dishes. Overall, this is quite a nice place if you choose the right dish and it's great for veggies and vegans too.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zpnbBQKYFuuduMWf2B_yRQ"
  },
  "HfKd5o9UgJH5ow14s6Js7A": {
    "date": "2/24/2016",
    "text": "What I liked about this place is that they serve dishes that I actually ate whilst I was working in Mumbai for 5 weeks! The idli, Masala Dosa, Uttapam - all dishes I ate regularly whilst out there, and which I've yet to find in British Indian restaurants here in London. It really took me back! Flavours are authentic - although maybe not quite as spicy.It's true what others say about the service - I can't say the waiters were at all friendly or welcoming. But they did their job and service was pretty quick overall. We didn't feel rushed to leave after we finished eating which was great, and the restaurant remained consistently busy throughout the evening. For a vegetarian option I definitely recommend this very affordable little spot hidden just behind Covent Garden Piazza.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Ge372SNSBFGvwo0Uld2bA"
  },
  "eOvB_IM7TYGJ0-iQnvn9Kw": {
    "date": "12/28/2016",
    "text": "The food was very well prepared and delicious.  The service was friendly and smart.  They helped me to not 'over order' but rather guided me to order two worthwhile dishes.  I had never had Dosa before.  Now I crave it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LGl727K-OEacErvC-SZamQ"
  },
  "fdFgCYYqIZLQHhXQRndyWw": {
    "date": "11/27/2015",
    "text": "Quick glance:+ so much choice!+ good wine selection+ attentive staffFull review:I was with a Norwegian friend in Covent Garden searching for Indian food and stumbled across Sagar. The carnivore inside me was a little disappointed about the vegetarian nature of the restaurant, but as the rain started to pour we decided to give Sagar a try. And what a good choice!I was delighted by the variety on offer in both the food and the wine menu, and even learned there is such a thing as vegetarian wine (although I still can't say I fully understand it...). The food is fantastic; being a vegetarian wouldn't be so hard if I could make vegetables taste so sumptuous. The staff was very friendly and warm, and the setting intimate in the small venue. It's easy to forget the hustle and bustle of Covent Garden when you tuck into a tasty serving of tarka dal, washed down with a Spanish Albarino. And for its central location close to somany tourist attractions, the price isn't exorbitant. I am looking forward to my return visit to try the lentil pizza.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "j6kIW0CaAQbQHss093FzZg": {
    "date": "4/8/2017",
    "text": "The service was atrocious. Sry that springs to mind first. The food was good. The ambience was gloomy.  Sometimes £ restaurants make you feel you paid too much,  well that is how I felt.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "csu3zSipTzajG2ShbtVwSg"
  },
  "JOMP0NU9ckigBEKHn0K4mw": {
    "date": "10/9/2016",
    "text": "Pros = Location, Food was ok, Decor was ok.Cons = Service was terrible, booking lost, needed to hassle staff to accommodate us and open the upstairs part, portion sizes are tiny, They got our orders wrong, Multiple common items (e.g. samsosa's) unavailable, long delay serving food, Service charge (12.5%) automatically included (Possibly to offset the high likelihood of lack of tips).Verdict = I would not eat here again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BpYjQJItLKUg1Xj96ti3Vg"
  },
  "kP8WTRfONFC1MB9ND7Hj0g": {
    "date": "7/11/2018",
    "text": "Everything was awesomeIf you wanna have south Indian than you must visit this restaurantDon't order rasam that's it, rest all dosas and idlis were lip smacking, do order mulgapudi powder on the side",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LXCsUhsrZqPp-lxIpjiNjA"
  },
  "KxpFcAC1ZkkrF41VYLKruw": {
    "date": "9/1/2018",
    "text": "We were so excited to try a vegetarian Indian restaurant in London because we thought we were guaranteed to eat good curry. But sadly that was not the case. I ordered the vegan thali and it was so bland and tasteless.The lemon rice did not taste of lemon, the curries were not good at all, even the dhal (super easy to make) was not good.The food was watered down, didn't taste like it had curry in it and was all a disappointment. My husband had the aloo ghobi and did not enjoy it.I would never go back to this restaurant. What a shame.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AI3_c5tbvwRI9JQJqt00tw"
  },
  "HUMNKLKdFT7dbcRng97C6g": {
    "date": "6/29/2018",
    "text": "I've been here twice. The first time was mid week during the non tourist season and the place was quite empty. That day the service wasn't bad and the food was slightly better than average.We returned here last weekend and it was quite bad. The waiter kept messing up our order. The dosa was undercooked, the potato bhaji was very runny. Definitely not something I would expect from the sagar chain",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKM1IGrc4nCuvfv968NigA"
  },
  "TRAMSeGRfoKVhGqIt8U_dg": {
    "date": "9/19/2018",
    "text": "I saw the musical 42nd street and looked over the outdoor balcony at intermission (off the dress circle) and turned to yelp for restaurants nearby.  This great little vegetarian Indian restaurant fit the bill perfectly. Kitchen is open until 11pm so I had plenty of time for a filing satisfying lentil \"pizza\" with onions and spicy peppers. The accompanying sauces were also nice.  My dish plus a nice Glass of South African white wine was just under 14 quid including service fee.  A great little spot near the waldorf Hilton where I am staying.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Co14TmbD_g_gN6FKcQTp6A",
        "caption": "Photo of Sagar - London, United Kingdom. Very satisfying meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Co14TmbD_g_gN6FKcQTp6A/o.jpg"
      }
    ],
    "user_id": "8Me0QYZ6Jm2-JqtwsWmhYQ"
  },
  "_PYIEFf6M9PbwxZYZnXcPg": {
    "date": "8/12/2018",
    "text": "Authentic Indian food and an amazingly friendly staff. Came here having never tried Indian food before. Our waiter took care of us and surprised us with some of the most popular dishes. Everything was great and fresh! Highly recommend if you want to try something different.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I-4NNb_a2kPt6MWFmpmSwA",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I-4NNb_a2kPt6MWFmpmSwA/o.jpg"
      },
      {
        "img_id": "P28ccEVzJSUOP-TnsCqeQA",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P28ccEVzJSUOP-TnsCqeQA/o.jpg"
      }
    ],
    "user_id": "4LXagQ_VYDEjq4C0UXXmNg"
  },
  "s7MCXnftHUkH8VYYwluPdg": {
    "date": "9/13/2018",
    "text": "If you are looking for rich and creamy curries, this may not be your best choice, but if you want to try some delicious dosas, you probably can't do much better than Sagar. The dosa itself was wonderful, both crispy around the edges and  with enough starch to hold up to the fillings. I've never been willing to pass up on a rava masala dosa when I see one, and I'm glad I didn't here. The filling always reminds me of the filling from a samosa; although the flavors aren't the same, it's a similarly delicious potato-based filling. All in all a nice alternative to the more common creamy curry if you're looking for Indian food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "see8qtWHzrOOK2lrl8W2TQ"
  },
  "HbXueNY-F4mVnYRGFu6-ig": {
    "date": "10/4/2018",
    "text": "It was because of the yelp reviews that I ate at Sagar. I ordered the Mysore Masala Dosa (which is very much like a light and crispy crepe) per host's recommendation. Really delicious vegan meal accompanied by a Kingfisher beer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bIPGeT8rObafQuHIErG_Q"
  },
  "P6QZscLbG-o6t3RA8GvkIQ": {
    "date": "3/4/2018",
    "text": "I think this is my favorite restaurant in the world. The menu shows the allergen ingredients very clearly. A ton of gluten-free vegan bread options including dosa, dumplings, donuts, papardum, and pizzas. The curries are vegan and they have vegan rice too. Everything tastes amazing. Perfectly seasoned and the breads are light and soft. I highly recommend the idli vada, masala dosa, saag alloo and if you have room, the mango sorbet.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "elMeniutKhK2W1llSqJTeQ",
        "caption": "Photo of Sagar - London, United Kingdom. Donuts.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/elMeniutKhK2W1llSqJTeQ/o.jpg"
      },
      {
        "img_id": "COmkmCCGuEW7idk806hjug",
        "caption": "Photo of Sagar - London, United Kingdom. Mango sorbet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/COmkmCCGuEW7idk806hjug/o.jpg"
      },
      {
        "img_id": "rpL3ra3CvBVhGOVWJb4SMg",
        "caption": "Photo of Sagar - London, United Kingdom. Masala Dosa, vegetable rice, saag aloo, and brinjal bhajee. All great.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rpL3ra3CvBVhGOVWJb4SMg/o.jpg"
      }
    ],
    "user_id": "QpcT6K3Yu6lnooscnLwMWA"
  },
  "eW_3h30fkLXjtS_cMTWJ2w": {
    "date": "11/1/2018",
    "text": "Amazing South Indian food in London. Authentic and very tasty. I am a South Indian with high standards. Definitely reccomend this place",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxVF-Ede1zqUQ4rsj-et1Q"
  },
  "EgxxZuRrv4TPSQCJXxf-MQ": {
    "date": "6/29/2017",
    "text": "Craving vegan Indian food? This is the place to be! We came here for dinner one evening while in London (March 2017) and it was a great decision. We ordered:- dosa = light and good- eggplant curry = full of spices!- battura = so friggin finger lickin' good- chickpeas = goodI loved every dish; packed with potent flavors, and left you wanting to eat more. It was so close to our hotel too which was great. I think a lot of folks who watch broadway shows in the area -- all come here either before or after the show.Highly recommend and affordable too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZktMUU7VAPKLS7pP_pSbEw",
        "caption": "Photo of Sagar - London, United Kingdom. Chickpeas, eggplant, battura, dosa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZktMUU7VAPKLS7pP_pSbEw/o.jpg"
      }
    ],
    "user_id": "5yGgNgkkNvsv6dYiA_whFw"
  },
  "5Cbwk-aBSjMa9Iox4HV6Yg": {
    "date": "9/15/2017",
    "text": "You  know what? No... No I don't need to go to this location again, it's pretty bad in many ways.1. The service is completely awful, I say that after visiting a few Sagar locations. This one is consistently bad. I waited forever for them to take my order and finally had to go to the waiter stand to place my order instead, same when it came time to paying my bill. The servers are always like this here, or they are just unfriendly overall. Unacceptable.2. I asked for extra spicy and I'm pretty sure there wasn't a single spice in my food. WTH???3. The dal was really awful, don't get it.Try one of the other locations instead.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4iOc4Fo-h6gZ-2zAJEM78g"
  },
  "igPbhYkYo0rF7DXGP8B9UA": {
    "date": "8/4/2018",
    "text": "Amazing dosa in London for a reasonable price! I would recommend getting the Mysore masala dosa, but it looks like you can't go wrong with most things on the menu. Great and speedy service, and a good spot for a nice quiet lunch",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMMRsLoYYxKRsv6ok1iqRA"
  },
  "en3lBy2jwZy40jNudwH7gg": {
    "date": "8/19/2017",
    "text": "We ordered a sample plate (Tali), very good gave us a flavor of different things. Would come back great location, in convent garden. All vegetarian",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "itdiQ3Y2v9-yzeDVu_qRUw",
        "caption": "Photo of Sagar - London, United Kingdom. Tali, great variety option",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/itdiQ3Y2v9-yzeDVu_qRUw/o.jpg"
      }
    ],
    "user_id": "ZGQySk3uq7vIS0ft0jIF3w"
  },
  "SxETMMNZ15L_sWfDW1FKbg": {
    "date": "6/27/2018",
    "text": "Excellent and authentic South Indian veg cuisine. The ultimate test for me with any restaurant is how well the food digests. This stuff melts into happiness!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AYclPq5YsiApPapadJQmmg"
  },
  "cWP4ClnYdpI3hhh-vc-O8A": {
    "date": "8/8/2016",
    "text": "We really enjoyed Sagar's Indian food a few weeks ago, and were delightfully surprised by the short wait, even on a Friday evening, and mains portions.I recommend the huge paper masala dosa in particular, though be prepared to have other customers potentially glancing your way as it's brought out!The appetizer samosas were a little small for the price (£5.25), so I likely would not recommend these unless you have a particularly affinity for them. (They're good, but not the best value.)The service was generally fast and efficient, though occasionally a little slow on refilling our water. (Not always good if ordering something spicy!)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "C4LTMymla0JQ5-VuFLTbcw",
        "caption": "Photo of Sagar - London, United Kingdom. Samosa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C4LTMymla0JQ5-VuFLTbcw/o.jpg"
      },
      {
        "img_id": "VgsVo-3Ax9R2aKai2UQQfA",
        "caption": "Photo of Sagar - London, United Kingdom. Paper masala dosa's accompaniments",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VgsVo-3Ax9R2aKai2UQQfA/o.jpg"
      },
      {
        "img_id": "KUstN-3NUA_eXHXjxkw4vg",
        "caption": "Photo of Sagar - London, United Kingdom. Paper Masala Dosa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KUstN-3NUA_eXHXjxkw4vg/o.jpg"
      }
    ],
    "user_id": "44faC3qch9dPNOucJI4ccQ"
  },
  "WFy_Q3YANV_r9Mf0JfFWaQ": {
    "date": "1/1/2017",
    "text": "Had lunch at Sagar last week and we were overall quite pleased.Food is excellent. I highly recommend the masala dosa and the tadka dal. Husband had a poori, paratha, and gol guppas as well (he was on a carb binge). Gol guppas were old and stale  and hard as a rock, but the rest of the items were well received by him.Service is disorganized, hence the 4 star rating. Waiters were unfriendly and we had to wait for the check after asking several times. Food came out quickly though.Location is great, ambiance is nice enough for a casual Indian restaurant, and prices are quite reasonable.We'll return for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GYv8xJeLdN0aQq8dZqIH4w"
  },
  "gRM2jZDS10VknOgvukzAog": {
    "date": "6/26/2017",
    "text": "The whole experience was ruined by the staff. We were there, celebrating a special occasion, and were literally rushed from beginning to end. The waiter came by 3 times to see if my friend was done eating, and she literally had to shove the food into her mouth so that he could clear up the table (we were a table of 3 and they were wanting to seat a larger group that was waiting outside). We had been there maybe 30 minutes, and we were already being ushered out. When another waiter came, he asked us if we wanted to see the dessert menu. When I said yes, he immediately said \"well, can you be fast since we have other people waiting for your table?\" Why would you offer the menu if you didn't want us ordering from it in the first place? I literally shut the menu and said never mind, and they immediately came back with the bill. As we were standing up, our chairs and table were being pulled away to accommodate the larger group. Word of advice: don't make your customers feel unimportant and rushed. Such rude staff, I don't recommend - I'm definitely not going back.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QEJVxSfh8ZQLeHnnhcOprw"
  },
  "yPmdOuweOs_aA4dyGq4lIA": {
    "date": "8/9/2018",
    "text": "Delicious authentic south indian food (the only one I tried). Dosas, idlis, oothappam, Bhajias with excellent chutneys. I am a foodie and very critical of bad food but Sagar serves excellent, delicious food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wKkuUna4qt7Aatj39usTGA"
  },
  "0jJt8UKtd_DlksblKHz-kg": {
    "date": "11/5/2015",
    "text": "After leaving the British Museum, mum wanted to eat South Indian food, and so checked on Yelp, and this place came up with pretty good ratings. So headed here and lucked out as it wasn't too busy with the pre-theatre dinner crowd and their upstairs tables were all free when we got there around 7pm, but by the time we left, were filling up. The host was very kind and originally had given us a seat near the front door, but when mum said it would give her a head cold, he moved us to the upstairs dining area.The food is all South Indian and we ordered for drinks a sweet lassi and a falooda (both fantastic) and then split an entree of Upma (a bit bland, but accompanied by killer tomato and chilli chutney, that spiced it up) and then a paper masala dosa, (really crisp) and a onion rava masala dosa (great taste!). The total was just under £30 so not a bad deal. Pretty good food, responsive service and cost not too expensive makes this a winner for the area.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EpkX6uEw9DAkeI4MJ1G0Qg",
        "caption": "Photo of Sagar - London, United Kingdom. Onion Rava Masala Dosa and Masala Dosa on one shot",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EpkX6uEw9DAkeI4MJ1G0Qg/o.jpg"
      },
      {
        "img_id": "INlFLQaQVUeMhde85Gwa6A",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/INlFLQaQVUeMhde85Gwa6A/o.jpg"
      },
      {
        "img_id": "wYHZVZ_3oNMBj8TwDv1SyA",
        "caption": "Photo of Sagar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wYHZVZ_3oNMBj8TwDv1SyA/o.jpg"
      }
    ],
    "user_id": "Fd3GvZTer-2_EwMzL3ptAg"
  },
  "Iq7Ju4fFQ_7D8lqVjlNHfA": {
    "date": "7/30/2018",
    "text": "Service & food were decent but it was a bit shocking that they seated all their white patrons downstairs but all the Indians were seated upstairs. No explanations and the contrast was very stark, even my 13-yo commented on it. The restaurant wasn't very neat either. As I said, food was ok. You can try it in a pinch, if you have a sudden craving for South Indian vegetarian food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urg_0g6dAyDU2sWKYfOYBw"
  }
}