{
  "xUxd_aLksM47KDxhZkHPDA": {
    "date": "6/12/2012",
    "text": "This isn't so much a full service restaurant as a room which happens to have a lady (or dude) to bring you cheap food.I love bibimbap, and tend to order it every time I eat Korean, no matter if I get 14 other dishes, or simply savour it on its own.  Theirs is fantastic; like any simple dish, the skill lies in the balance of ingredients and skill of preparation. They use excellent rice (traditional korean rice rather than californian grown japanese rice), and a medley of vegetables (including the essential obscure Korean ones) with a bit of meat thrown in for flavour and texture.  I never order other dishes here (aside from an occasional noodle soup which uses instant noodles in a hot beef broth) and wouldn't bother -- this is a canteen and they excel on the low-end of the spectrum.Don't come here for BBQ or with friends for a big night out.  It's somewhere for lunch, and a bloody good one if you like bibimbap.  The service is great, and when I used to work nearby they would start my bibimbap as soon as they saw me walking towards the restaurant -- its that kind of spot.I used to go there sometimes after work for beers because I kind of like that korean lager Hite and once one of the dudes there and I got so drunk he spoke to me in Korean. Only in Korean, despite me not understanding any korean.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "NVEWezavVyI2vqBPTy9ZKw": {
    "date": "11/11/2014",
    "text": "I dragged my parents with me to Naru restaurant since I love korean food so much and miss eating it. Overall the food tastes pretty good!We ordered Dak gan jung which is a deep fried chicken with a sauce, Jap chae which is stir fried potato noodles with vegetables, Kal bu gi (beef short ribs), Dol sor bibimbab and Kimchi jji gae (kimchi soup). The best dish there has to be the deep fried chicken where the chicken is so tender inside but crispy on the outside. The only downside was that there's a little bit too much batter (where there's no meat) but I personally love eating those so it was fine for me. My mum's favourite dish has to be the stirred friend potato noodles and I agree with her that it tastes really good as well. The beef short rib was ok but we thought that it was slightly overcooked and not ask tender as it should be. The bibimbap is delicious too but I would prefer to have more korean spicy sauce with it. The kimchi soup was nice as well and I really like the (wholegrain?) rice served with it. The cost of the meal was around £57 and we thought it was worth it since there were lots of food for 3 people (we were really full and satisfied).It was a good experience and we will definitely go back soon!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QwRuP9_jMSO_NQY1HK8Duw"
  },
  "cg0SHF2TZuZtlVmwnX8zFg": {
    "date": "5/30/2014",
    "text": "Value for money and good food! Not fancy nor exquisite bit its great for lunch with quick service and friendly prices. The menu is varied and the bibimbap is good. Locations is also quite convenient and it has a lot if seating so its an ideal plan b if you didn't plan lunch ahead. It's also quite consistent - i've been coming here for iver 3 years - never disappointed!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SSgjs_UKGUKn1WQ3mueCMw"
  },
  "xHBdDm_T2zLXJkQN-opjIQ": {
    "date": "8/18/2013",
    "text": "Love the atmosphere, the Korean pancakes are mind blowing as well as the plum wine, but the raw beef Korean tartar was not my thing, I dislike raw meat",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IIkMQYNgsxr2jHl00iaPlA",
        "caption": "Photo of Naru - London, United Kingdom. Some caramel and banana desert, very loveable. And the green matcha tea ice cream is my new addiction.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IIkMQYNgsxr2jHl00iaPlA/o.jpg"
      },
      {
        "img_id": "mgYdBsxXwKhZQbwixJhFyg",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mgYdBsxXwKhZQbwixJhFyg/o.jpg"
      }
    ],
    "user_id": "43W9j_BfHyLxymoIw6Cn9A"
  },
  "X5wX6LxTpe8btHwNj7GfZA": {
    "date": "9/8/2011",
    "text": "I walked into this place for an early pre-Prince Charles Cinema dinner and it was completely empty save one older gentleman.  \"Not a good sign,\" I thought.  I told the waitress that I hadn't eaten Korean food (crazy, I know) and followed her recommendations of Pa Jeon (a crispy pancake filled with seafood) and Bibim Bap.  Both were amazing.  Apparently the empty dining room was not at all a reflection of the quality of the food.  Oddly enough, when my friend ordered DoenJang Jji Gae, which the menu describes as \"Korean Soybean paste, tofu and vegetable stew with steamed rice,\" the waitress warned him, saying that most people do not like the smell or taste of any of the traditional Korean stews on the menu.  He went for it anyway.  When it arrived, (it was more like a soup than a stew) we all had a taste, wondering what would provoke such a warning.   It smelled delicious.  The taste was rich without any notes that could be considered offensive.  I have no idea whether the kitchen toned it down for a non-Korean patron, or if Naru just has a fair share of picky eaters walk through their doors.  It's a tasty little place that I've walked by numerous times without ever noticing.  I'm glad someone finally introduced me to it because I'll definitely return.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "xcknS4c6CdcGa6aPq-huOg": {
    "date": "6/23/2011",
    "text": "I came here for a friend's birthday and on arrival, the staff are very friendly. Unlike other Korean restaurant, it is small and cosy. There aren't an BBQ stove on the table so all food are cooked in the kitchen.We had Jap Chae for starter... which is transparent noodles with finely sliced veg and seaseme seeds sprinkled on top. It was mouth watering... as we were very hungry, we wanted it to be a bigger portion!! The bimbimbap was amazing too! We all got one each and were happy that we didn't have to share it. The table next to ours requested to meet the chef as they enjoyed it so much! He was SO young... early 20s! We were all very surprised that a young chef like him can cook such brilliant food.When we were due to pay, we asked the waitress about this young chef. She told us that he's not the main chef as the main chef is on holiday, and vowed that the main chef is 10x better than him... I was shocked as the meal was very very good! I would highly recommend this place but if you're looking for traditional BBQ at your table... this is not the place to go. Otherwise the food & services are thumbs up!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aWwYZLBuOOWpH-wGqN9q6Q"
  },
  "pUJNqZc3878FtI2Mcj52iw": {
    "date": "7/9/2011",
    "text": "Had to come back to this review because I just realized I did this place a disservice by not elaborating in my review. My girlfriend and I love this place.  Have been twice now and the food is excellent.  We both got the Dolsot Bibim Bap based on a recommendation from the staff last time were were there. The service is always on-point.I can't say enough good things about this restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmVpxJO-V0oGWTthJHBrCw"
  },
  "KEKenz08jwNUo2bHw6J0pw": {
    "date": "5/31/2014",
    "text": "Wow. I've eaten at a few of the Korean places in London and this is by far the best. Cinnamon punch, sweet and sour chicken, seafood pancake... everything was outstanding. Will most definitely visit again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cdaGDgGOcXIjan1BKjrtLw"
  },
  "It_POk5T4oH8X7rdcYXsZQ": {
    "date": "2/21/2011",
    "text": "Took sister here for dinner as she had been deprived of Korean food for a while. Straddles line between traditional and contemporary in decor and food. Our order consisted of:Bulgogi - thin slices of beef marinated in a soy sauce baseSoondubu - seafood and tofu in a spicy brothMackerel with citrus sauce - exactly as describedKimchi - spicy pickled napa cabbage (still sad that this requires ordering in London and isn't a given at the table)Kimchi was all right. Bulgogi was standard fare, served on a bed of onions that had been cooked with the meat. Satisfied the craving. Soondubu was unexpectedly rich (I had had low expectations) in flavor, which was great. Not bland, and not too spicy. Just enough kick to complement the meat. Mackerel was a little different from how it's usually prepared. The ingredients were traditional, but they're not usually used together. Sauce was a little strong. Liked it better after scraping some of the sauce off.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dlyC6M7q2afbaxV7MHQstg"
  },
  "ssk4rAtEA1t60i1laZbRTA": {
    "date": "2/27/2011",
    "text": "We had dinner here last week - Naru is just outside Covent Garden, but seems very tucked away.  I love the decor, especially the paper lanterns on the walls.  We had some sweet and sour chicken, a hot pot dish and a duck dish to share.  All the food was hot and tasted really good (although, I wasn't that keen on the duck).  It was very pleasant and quiet inside.  It's definitely worth checking out; I'm sure we'll be back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bof36DzRtPknHxP_CNTJ2A"
  },
  "pXpRzSPCfLOMOQxtCDB6ng": {
    "date": "7/16/2011",
    "text": "Back in Auckland, we enjoyed walking to the top of Queen St and having a  tasty meal at one of the Korean restaurants there.  We are keen to find a similar restaurant here that we can bank on when we want a good Korean meal.This restaurant was a good find.  The food and atmosphere were more upmarket than I'm used to and I enjoyed it.  It is an intimate setting and looks like it would hold around 30 or so customers.The meals were delicious - we had two starters (the glass noodles and a kimchi pancake), two mains (the special sam kyeop sal and the bibimbap) and a couple of hite beers.  The pancake was crispy, but not as spicy as I had expected.  The sam kyeop sal has very tender pieces of pork belly and it was delicious.  I could have easily eaten much more of each dish.  I am keen to go back there and try some of the other dishes - I am confident that they would be as good as the ones that we have tried already.The only draw-back for me was the price.  It was just over 40 pounds for both of us, which would make me hesitant about going there too often.  But, nonetheless, it's a good treat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "q8NaGXsvGENG6q-VFWZkZg": {
    "date": "5/28/2015",
    "text": "I arrived 10 minutes after the opening time for dinner and they were still getting ready. One of my party members asked the staff if they were open and she mumbled something, went back to setting tables and said 5 minutes without acknowledging us. This is unfortunate as they began greeting customers in Korean whilst giving us the horrid treatment. It took all four of us to get their attention for 10 minutes to order. Drinks came in really slowly despite being one of two tables. When our food was finally served, a waitress spilt a glass of water all over my possessions and cracked my phone screen. She slowly proceeded to clean up and unapologetically apologised. However, the food was good but no amazing, korean pancakes were better than the average and the spicy pork was perfect. Spicy pork with calamari was kinda op considering it was 4 pieces of calamari and way less pork than ordering just spicy pork. To my surprise, paying was not a nightmare. Overall, they would have received a 3, maybe 4 but the service was so poor, so poor.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zvaKvoKVDpgTtKK6Mc1SKw"
  },
  "UKZOXbFqSQcmRQforvVcBQ": {
    "date": "9/8/2012",
    "text": "This was my first time having Korean food and I thought it was great! I'm not an authority on how these dishes compared to the 'average', but I can say with confidence that all the dishes we got at my table (there were 4 of us) were delicious. Unfortunately the service here was very poor. Our server wasn't rude, but he did double charge us for certain items including the tap water we were served. For these reasons I'd give the place a 3 1/2 star rating irrespective of the food quality.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yFtXeU4z-bdV3czVt4pD8A"
  },
  "k31xrJ9Bf709Tkv20UZ0_w": {
    "date": "11/8/2010",
    "text": "We were craving Korean food so we decided to hit this place up on Friday Night.  I suppose Korean cuisine is relatively new to London however this place did not disappoint.  Hard to classify what kind of restaurant this is but I did like the variety.  We had duk-boki for appetizer and split a soon-doo-bu & Kalbi for mains.  The duk-boki was great, the tofu was above average, and the kalbi was served in a sizzling bowl which kept the meat hot (quite good).  What I noticed was that they had Jahm-Bong (spicy noodles with seafood) on the menu which you would typically find in a chinese restaurant here in the US.  While this is not a bad thing especially if you are looking for variety.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "axQ0fT0gbQHYdE6Nppm4KA"
  },
  "mVjesUlawn0Ys8LU_Ra6uQ": {
    "date": "5/10/2011",
    "text": "Very tasty food, nice location, lovely staff. Seems like a real Korean restaurant instead of the usual (in my experience) Japanese with some Korean on the side. Pretty good menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLIx7XjystTcID6SVCWZ9Q"
  },
  "ibu_2T25IOmDUrZqOkOu3w": {
    "date": "1/31/2010",
    "text": "Cute, cozy little Korean restaurant well-located walking distance from some of the major tourist attractions, including Covent Garden and the British Musuem, but without the crowds! The dishes are authentic, well-presented and pretty affordable - about £6-10 per entree. The staff was attentive and the food was served promptly. I would definitely recommend Naru for those who need a change from the regular Italian or Chinese restaurants nearby.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "mwJEd2Pp9bFfNGo1rZ9NvA"
  },
  "wV6szaFn2CsK0DRMm98Ohw": {
    "date": "5/8/2010",
    "text": "Thoroughly recommend this Korean. Excellent food, good prices, attentive staff and even very nice presentation of the food which is always a bonus",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttrfh9Yznq87BjTmcoYqbg"
  },
  "BV2bGSMu-juLszCvcS1Exw": {
    "date": "4/7/2009",
    "text": "It was a total \"WOW\" experience!!Tastes good, looks fantastic, and service is great!!I signed up just to write this!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "dxllmaESpFN0lH1Z7hpoUQ"
  },
  "eOvKZfyfG3gLNkoAJwD3Hg": {
    "date": "4/5/2009",
    "text": "Best presented Korean food I've ever seen. The service was top notch as well. Perfect for a date...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KFbDeTaMRZ96n2HqRngdcw"
  },
  "wIrWwxcjV5aoNyxHZnQcLQ": {
    "date": "12/28/2016",
    "text": "Never saw the food. Had about one hour for lunch, so went to this restaurant at noon. There was one table occupied at the time. After ordering, waited until 1 pm, and we asked if the food was coming out soon. The lady who received our order said the kitchen forgot to make our food. We left the restaurant without lunch.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZWlk8WkyHmU9bGcLAiccw"
  },
  "ZMlCoLR2BFmzMgNkg28-Uw": {
    "date": "8/9/2016",
    "text": "Been there twice. Superb food. Nice and friendly staff. Highly recommended. Especially the Mixed Seafood Fried Noodles! The soup pots and BBQs are very good too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "c2V43zzLqA1Aq14djz9NuA"
  },
  "UfzfQtkDKwVjwkh0t4orLQ": {
    "date": "11/2/2012",
    "text": "Korean food is one of my favorite cuisines when it comes to Asian and I've been on the hunt for a restaurant that does Korean fairly well. I've been to Naru a couple of times and I've got to say that it's pretty good. They need to improve on a few things for me to give them a 5th star though.For one, Korean restaurants typically give you complimentary side dishes with your meal. Maybe I'm spoiled from California where I'm used to this, but when I stopped by Korea, they seemed to do the same thing. Naru gives you nada! Secondly, they seem to be a little skimpy on the portions. I ordered this ramen street dish with rice cakes and stuff in it, although it was delicious, I still was hungry afterwards...Other than those reasons, Naru does Korean really well. Everything I've tried is pretty good, I just wish I got more of it. Service isn't horrible, but it does get busy in there.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "6WmWe6xVY5np9vMlR2tCgw",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6WmWe6xVY5np9vMlR2tCgw/o.jpg"
      },
      {
        "img_id": "9X2rBAf_ks_Xv23NMVIiHQ",
        "caption": "Photo of Naru - London, United Kingdom. Naru Fried Noodle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9X2rBAf_ks_Xv23NMVIiHQ/o.jpg"
      },
      {
        "img_id": "Q6fIfn7eX0L2tTbDfrdHXg",
        "caption": "Photo of Naru - London, United Kingdom. Prawn Spring Rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q6fIfn7eX0L2tTbDfrdHXg/o.jpg"
      }
    ],
    "user_id": "3jjiY5D7oIlKeiCIZGHQew"
  },
  "8Rxf5GXAJ_oz5dFXvWazyQ": {
    "date": "2/19/2016",
    "text": "Super tasty food however, portions are pretty small for the price. I definitely recommend the bimbimbap and the pancake! But if you're looking for some Korean food in Central London, you should definitely come here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3_qWpTSAaSkvNdNKN6DLA"
  },
  "SQkUFRP3kKdTNnoYzhu-fw": {
    "date": "3/2/2015",
    "text": "A little sad that I first discovered Naru with a friend who is allergic to eggs, and at the time wasn't overly hungry so I didn't get to do my usual deal of ordering way too much food and caring little for the fattening consequences until I was heaving my food baby to catch the bus home. The things one does for friendship. On the whole, the meal was really yummy. To start we ordered a side of Kimchi and Ttuk San Juk - Skewers of beef, rice cake and veggies. Heavenly, delectable little bites, perfect in number for 2 people to share.When we first arrived I had thought it would be a great idea to order a bottle of Soju. Realised after a single shot, that I In fact, do not like Soju. Thankfully had level-minded friend present to not let me go crazy on the menu. Back to the food - Next I had the O Jing a Bokkum, which consisted of Calamari (no tentacles, unfortunately which are obviously the best bit) and this delicious, albeit spicy sauce. Only downside that I can think of was that they served it with courgettes which I abhor. The calamari was cooked really nicely, and with the sauce in tow made for a fabulous midnight snack. Did I mention they really don't skimp on the portions? My friend has the braised pork (Naru Bo Ssam) which was too sweet for me, but cooked to perfection nevertheless. All of the above came to about 40 quid, which considering London prices was really not too awful. Would love to come here again, perhaps with slightly hungrier friend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WX3FdA5dhdq-8jKuJBbd2Q"
  },
  "ujWUmoGR4enRP3-B9l-h6g": {
    "date": "10/27/2015",
    "text": "Dol sat bibimbap is solid, yet not in a stone pot. Mandu were greasy, but tasty. Would have given four stars but the service was way too slow.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OFr2CY57Qzgbs_Wip7WpWg"
  },
  "43W-vnv3BgZXpSvVczyOKg": {
    "date": "9/11/2011",
    "text": "I really liked this restaurant. The staff was super friendly and conscientious. Is it weird that I felt they were highly organized and exact in their technique. Haha It was just the overall vibe I got.The food here was amazing! Best seafood pan cake I have ever had! Better than all the Korean places I've eaten at in new york and new jersey back in the states! How do they do it? Maybe it's because I prefer it slightly crispy as most other places make it soggy. That or, you really do value your food more when the portions are smaller than what I'm uesd to.We also got the bibimbap and a pork with calamari. Very delicious and on point. The lady mixed our Bibimbap for us and took extra care to get it perfect. Great Korean dining experience for sure and I can't wait to come back for the other yummies on their menu.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bseCFS1JXAMrI2P_CM4sgw",
        "caption": "Photo of Naru - London, United Kingdom. Bibimbap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bseCFS1JXAMrI2P_CM4sgw/o.jpg"
      },
      {
        "img_id": "y1TgSY69pLqrnvG9jxScPw",
        "caption": "Photo of Naru - London, United Kingdom. Pork and calamari",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1TgSY69pLqrnvG9jxScPw/o.jpg"
      },
      {
        "img_id": "Pf6bGhjVoTcvwjllp-inPg",
        "caption": "Photo of Naru - London, United Kingdom. Seafood pancake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Pf6bGhjVoTcvwjllp-inPg/o.jpg"
      }
    ],
    "user_id": "ANVsYjL6J6irvp5qZZb9rg"
  },
  "hyVeP5TsMQVhMtY6rxE-NA": {
    "date": "7/16/2014",
    "text": "I am not exactly a stranger when it comes to Korean food so I can tell a thing or two about Naru. It really is quite unique by itself and offers a wide array of meals for both the newbies and experienced in the Korean food. The Bibimbap is amazing here - so full of taste and dense in flavour. I think that everyone should at leaest once in their life try Korean beef and BBQ in general. There is no other culture that prepares the meat this well - it's uniquely tasty.I can make a small remark regarding the staff. The place seemed to be a bit short of people as we waited for some time for our orders and check respectively. However, that did not ruin our dinner at all; and what could actually, with such food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OX5X6i_oOy4DKMhYV-gVnQ"
  },
  "vH9xPBP9De-mssLNQKCiCQ": {
    "date": "7/29/2015",
    "text": "This is a terrific, affordable little Korean place right in the heart of London.  The Bi Bim Bap is delicious, as is the Korean BBQ beef.  All the dishes are seasoned well, and served by a friendly staff.  There is also a nice, laid-back vibe about the place, which makes it a far cry from the many food-mills or over-themed, overpriced, underwhelming restaurants in the area.  I've eaten Korean cuisine in a lot of cities, and outside of the NA West Coast, NYC, Toronto, and Asia itself, you're going to have a hard time finding better quality at this price.  Grab your metal chopsticks and dig in!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooK0iJAhXqPkVYBnNK0sTA"
  },
  "ZPAyBQI5jcGYoqAIrrGk7w": {
    "date": "11/26/2011",
    "text": "Had a nice lunch at Naru today.  I went with my staple, kim chi jigae, a kim chi stew (pork and tofu) served with rice.  While it satiated my craving it could have had more of a kick to it.  I found the stew was a tad too sweet for my taste.  The seaweed soup hit the spot though.  And the service staff was very nice.I will come back to try their other dishes but will be heading to Bi Won, across the street, for the jigae.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wHEzzFI8qD_0Dluq3UCQew",
        "caption": "Photo of Naru - London, United Kingdom. Kimchi jigae, steamed rice and seaweed soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wHEzzFI8qD_0Dluq3UCQew/o.jpg"
      }
    ],
    "user_id": "GsLImIUTGXxiW_Vt1JZuAw"
  },
  "ch9KQZJANSuwZu7wN6gsLg": {
    "date": "3/19/2014",
    "text": "This is my third attempt to Korean food and compared with the other places i have been i would say its an ok place.Food wise it was delicious although again i can pronounce most of the things we ate. The place though was a bit small and it was lacking the atmosphere. We wanted to have wine but we found that the ones offered were not that special and bit over priced",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhilOVO7_Th1IsQQk0xcBA"
  },
  "oOTVHSFKR60wzE-XHbFbmA": {
    "date": "10/16/2015",
    "text": "I highly recommend Naru to anyone looking for good quality, moderately priced Korean food in central London! There's always space, the staff are friendly and the food is brilliant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zn5Sua4u7iU5ToMEY7HWdA"
  },
  "CgHnUl6bsNmv2A7WcDCOlQ": {
    "date": "5/6/2013",
    "text": "I've been on the quest to find the best Korean restaurant in London and I'll have to settle with Naru. It isn't outstanding, but if you want a solid Korean meal, attentive service, a quiet and warm atmosphere, and good prices, this is your joint. They accept my dietary substitutions/requests on the soon doo boo (extra spicy, no seafood, sub kimchi) with no qualms (unlike Asadal), which makes me very happy! But sadly, just like every other Korean restaurant in London*, they charge for banchan. As an LA girl, this is a joke to me. I will never understand it. *Exception: Tohbang on Clerkenwell doesn't charge for the first round of banchan!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "POwF9wTx5zxvPkte43IAhw"
  },
  "OrHMTrtUjnprYz2bz7W2kQ": {
    "date": "12/21/2013",
    "text": "Bi Bim Bap Boom.  The Bi Bim Bap was so awesome that I have thought about it regularly since we ate there.  The traditional pancake and kimchi as starters--excellent.  How about a little squid and pork Korean BBQ?  Bring it on--it was really good.I am not a Korean food expert but I was just loving the well-executed food.  Simple, authentic, affordable, well-done.Service wasn't the best and no special atmosphere....it is all about affordable and tasty Korean food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "1mz44sy2XRPsFZ4FVfto4Q": {
    "date": "8/29/2015",
    "text": "We came here for a friend's birthday. I had the bibimbap which was the nicest thing I ate there- the rice was toasted round the edges but could have done with a bit more chilli sauce! I also ordered the tobboki (rice cakes) which was a disappointing portion. At almost £8 a portion, there were about 5 rice cakes and the (already small) plate was bulked up with vegetables. The Pae jeon (seafood pancake) was also disappointing. The pancake wasn't crispy, and was really thick and tasted like uncooked batter in the middle. To top it all off, they charged us £1 a head for cake service- on top of service charge- which I think is a really mean spirited thing to do. Towards 10.30 they started hurrying us to settle the bill and leave. Unacceptable. The bibimbap was good, although I don't think it's enough to make me want to come back..",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlxoNe0NXY9VDDjh077Cfg"
  },
  "wka8-yV4r7xBeJFSMUV2QA": {
    "date": "9/8/2012",
    "text": "Our restaurant experience was kind of like the original Star Wars trilogy.A New Hope: When we arrived, I glanced at the menu and was excited. They had Makulay! My fav. drink! (Although way overpriced...it's only about 2.50 a bottle in seoul and it was 8 pounds here..) Anyways, we ordered our food and appetizer, and I received my Makulay in a cute carafe. Darth Vader reared his ugly head as our waiter brought us tiny glasses of water.Empire Strikes Back: Holy shit was the ttokboki (i'm not spell checking that. go to h) amazing. It compared to or surpassed the street vendors in Seoul. We started to receive our meals. My dining mates' dishes were exceptional, and galaxy saving was in full swing, but then Boba Fett was eaten by the Sarlacc. In other words, I was a bit annoyed because my Mackeral was completely unappealing and average compared to these other dishes. Also our waiter had no idea what we ordered and tried giving me bi bim bap that I didn't order. Return of the Jedi: So we're finishing our meals and overall enjoying everything, but then the ewoks showed up and made me scratch my head. 2 pounds for extra rice? It was at this point I realized that this was THE ONLY KOREAN RESTAURANT I HAVE EVER BEEN AT THAT DID NOT COME WITH COMPLEMENTARY KIMCHI.Let me repeat that.THE ONLY KOREAN RESTAURANT I HAVE EVER BEEN AT THAT DID NOT COME WITH COMPLEMENTARY KIMCHI.Kimchi was on the menu for 3 pounds. Wut. Get the hell out of here dude. The fact that meals that obviously should have been served with rice then didn't come with kimchi is a nail in the coffin.Then we received our bill. This was like George Lucas adding Hayden Xtianson as Anakin's ghost. Nah dog.1.) We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.We were charged 3.50 for still water for the table.2.) They charged us for rice we didn't receive or order.I'm mad at these last two points. Like rrrrlllll mad.I'd like to come back but based on the abysmal service and being penced and half penced by any ala carte item, I don't think I'll be coming back.",
    "rating": 2.0,
    "rated": {
      "useful": 6,
      "funny": 13,
      "cool": 2
    },
    "photos": [],
    "user_id": "RsgcXHipYKv5QVjSpAy2-A"
  },
  "bmR-jS2zliZeNgxvonACKQ": {
    "date": "2/26/2014",
    "text": "I'm not very experienced in Korean food, but I went with a food who loves it, and we both loved Naru! The only reason for the non-5 start review was service. We had to repeatedly ask for refills on water and other stuff. But the food was fantastic! I had the crispy chicken appetizer, my friend had a pancake type appetizer, and I had the poached pork main. The pork was fantastic!The portions are large for the price. I couldn't even finished my food! Considering the location, the prices are really reasonable and you will definitely leave satisfied!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "In46Vl71LOiXa0Pwj0UHAA"
  },
  "X5mWqbt7qW7eh1ngS2Djvw": {
    "date": "5/17/2015",
    "text": "Decent, but underwhelming. There's better food to be had in the area, and certainly better in London. I'd go again, but wouldn't make a special trip.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZA5083KSwQe0DJ2buWxO1Q"
  },
  "y-wAQQ3P1zi5DeLFc-6qyQ": {
    "date": "2/4/2013",
    "text": "I looked up a ton of restaurants when I found out I was going to London for 5 days.  I always like trying the local foods, but I also love trying Korean whenever I can find it.  It always just reminds me of being home, even when I'm far away (even if it just a measly 5 days).  Naru had some great reviews, so I made sure my friend and I would eat here.It's a small restaurant, but the ambiance is nice.  Seating is limited (thank goodness for top table), but, wasn't very busy when we walked in.  It became quite busy during and as we were leaving.  The bathroom is really small and awkward.As for the food - we ordered the pa jeon as our app.  Basically it's a Korean pancake with spring onions and octopus.  It was delicious.  Crispy along the edges.  And then we both got the dohl soht bibimbap.  Rice and veggies and meat in a hot stone pot.  Pretty good, I'll have to say.  Being Korean and being around so much Korean food, I had my doubts, but overall the food is very good,  The service, I'll have to say is a bit lacking.  When we were there, it was only a one woman show (until halfway through our dinner, another server arrived).  The only downfall to this place is that they don't serve banchan with the meals.  You can order kimchee and the banchans separately.  Every other Korean restaurant that I've been to (including to the one I've been to in Madrid) brought out banchan.  Price wise - it's a little more than I'm used to paying for for Korean (when you convert it to US, but I would say it's reasonable in pounds).  If I'm ever back in London, I'll still probably go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h59iX3YOfP1laPF000BV0Q"
  },
  "dVCCGCUXgQ_Rq5q9J2tgFw": {
    "date": "2/28/2013",
    "text": "Difficult to call on the accuracy of the cooking, I'm not a regular eater of Korean, which, considering the delicious menu I'm faced with, surprises me. I think that there's a trick missed in my dining life. A selection of stews, fried dishes, noodle dishes and the phrase I'm looking for, dolsot bibimbap, a (relatively) healthy dish served in a roasting hot stone bowl that I'm relying on to take away my Monday evening blues. Authentic or not, there's little else I recognise on the menu, often one of the best benchmarks for authenticity. A larger than expected portion of 'Crunch Chicken' sweetly and oddly tastes just like a gourmet version of a McDonald's Chicken McNugget. Noticeably sugared flesh beneath a light battered coating, it's surprising and not at all unpleasant, in a guilty pleasure sort of way. There's definitely a food dude marketing angle in this, it'd sell like, well hot chicken, in an East End foodie market. Come to think of it, I might try and get in there before anyone else notices! The obligatory side of kimchi, fermented and chilli infused cabbage, is a welcome contrast (if a little cold) cutting through the chicken and giving a needed contrast in texture.The main event, that dolsot bibimbap, is enough to make me kick myself for not having it more often. It's a superb piece of simple cooking with some wonderful flavour and texture contrasts. Small piles of steamed and fragrant veggies are placed adjacent to each other for contrast, alongside a healthy portion of beef slivers, atop a bed of plain rice. The stone bowl, boiling hot from the oven, has been coated with sesame oil before being filled and the smell is outstanding. An egg yolk completes the dish, stirred into the browning, crispening rice and coating the meat and vegetables, cooking as it does to give the whole dish a light yellow sesame scented sheen. Cut through with more of that kimchi, this is truly a heartening and hearty winter dish. The FoH team are friendly and unobtrusive, the decor is inoffensively pale, a mid range fairly generic Asian restaurant that could be anywhere or serving anything. It's not overly designed, but is functional and very comforting, like the food. Just round the back of the Shaftesbury Theatre, you're not going to find it on any glitzy hit lists, but that won't stop me going back and shouldn't stop you going, assuming you haven't already been.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "yLyc6vJv178lgDTm_qPacg": {
    "date": "5/6/2018",
    "text": "A good traditional Korean restaurant. We went on a Friday evening at 7 and were seated immediately. Menu items are plenty. Had the seafood pancake, the squid stir fry and the pork kimchi casserole. Plenty of food for 3 people. What's weird is that they don't give the pan chans here. But overall a good experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHRHn3OGYwexbBDnXBpLvA"
  },
  "sB8bpRm4lTVBWftOJHcCPA": {
    "date": "11/11/2017",
    "text": "Naru is a small and simple restaurant serving up some homey and classic Korean dishes.My friend and I made a reservation for a Friday night at 6:30PM. By 7PM, the restaurant was packed. The menu has a great selection of appetizers, meats, soups, rice and noodles etc., which all feature some homey and familiar Korean dishes.My friend and I got the japchae, teokbokki, seafood pancake and the bibimbab. The seafood pancake was pretty big. There were three portions and I liked that it was hot and crispy on the edges when it was brought to our table. The bibimbab was pretty flavorful but I wished there was more beef in it. The teokbokki was delicious! It's perfectly spiced and tasted like it was homemade. I loved the cabbage that went with this dish too because it had soaked up all the flavors from the sauce. The japchae was probably my favorite out of everything. It was so delicious with some earthy flavors, colorful vegetables and shredded egg whites on top. The noodles had a new chew to it too!For beverages, my friend and I both got some Asahi. You can't go wrong with beer and Korean food! The total bill came out to be ~£50 for everything, which is definitely more pricey than what I'm used to. I wouldn't say the portions were particularly large either. Overall, Naru isn't the cheapest place for Korean food but it's a great place for some tasty, homey and well prepared Korean food. I'll be back!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qqOHV-Kls6fCPNbavQw3yw",
        "caption": "Photo of Naru - London, United Kingdom. Japchae",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qqOHV-Kls6fCPNbavQw3yw/o.jpg"
      },
      {
        "img_id": "QVto61Pz0-mLn6fjC9BmSA",
        "caption": "Photo of Naru - London, United Kingdom. Tteokbokki",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QVto61Pz0-mLn6fjC9BmSA/o.jpg"
      },
      {
        "img_id": "GX-Bd4poOJ5u-Mw4ilY3pg",
        "caption": "Photo of Naru - London, United Kingdom. Bibimbap",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GX-Bd4poOJ5u-Mw4ilY3pg/o.jpg"
      }
    ],
    "user_id": "vGn4kW2dWSagcy52pM5_pQ"
  },
  "Hyd__ogBoEl1_PpLO6EOoA": {
    "date": "5/3/2018",
    "text": "As a Korean this restaurant goes against standard Korean expectations.  If this is your first time going to one don't go here. 1. No standard ban Chan set comes with your food.  I didn't find this out until our entrees came.  You have to order it ala carte and their options are limited.  The Korean cucumber kim chi was bland on top of that.  2.  I ordered kalbi jjim (braised beef short rib) it doesn't come with at least one bowl of rice.  Who the hell orders kalbi jjim and doesn't eat rice w it?  That's sodium overload. That's like ordering noodle soup and not getting noodles with it.  Ok fine, I didn't get rice... then shouldn't the waitress ask me if I want to order it??   Also, it came with 3 pieces and a few meager veggie pieces.  For 15.6 pounds, that's such a rip off.  And the meat was chewy. 3.  Service:  since the ban Chan was ala carte and I ordered it after our entrees showed up, I waited for it.  Wrong move, it took 7 mins for it to show up as my food got cold. While the owner and waitress sat at the front counter eating fried chicken during their shift.  Last time I checked ban Chan is fermented and sits readily available to be scooped out, not sure why either of them couldn't grab it.  4.  Napkins-  it was clear we needed napkins since we are using our fingers to hold the bones.  I ask for some napkins for my friend and myself.  She brings me just one. Long story short.  If you want a real Korean food experience and not sure what to expect don't go here.   The owners should just build the ban Chan price into the other dishes and teach the waitresses how to anticipate basic things such as people needing rice.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3kqTH79uh-NrAuXgsMbbAw"
  },
  "DVbNwbXprxD2tncbOEo1Wg": {
    "date": "12/17/2016",
    "text": "It's a quiet little Korean restaurant that seems to be empty most nights. I've never been here for lunch, and mostly end up here for dinner or a late night supper after a few drinks at the bar. They serve ala cart menus but you should go for the BBQ. The meat is very fresh and they also have someone to cook them in front of you. Here's what we ordered:1) Pork Belly 2) Marinated Beef Bulgogi 3) Kimchi Jjiggae (comes with a bowl of rice) 4) Kimchi pancake 5) 2 bowls of rice6) 1 hite beerTotal bill came up to: £62.80 for 3pax, I wouldn't say it's the cheapest place to indulge in Korean food but it's definitely a good place to come and enjoy a decent quiet meal.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Pqc4LhQUq6QLj6mUc4P_XQ",
        "caption": "Photo of Naru - London, United Kingdom. Pork belly!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pqc4LhQUq6QLj6mUc4P_XQ/o.jpg"
      }
    ],
    "user_id": "v5XZL6DY0aWq6LEM-vVIOw"
  },
  "BqjX97MVHjImWpqnl5CPhg": {
    "date": "10/6/2017",
    "text": "Busy restaurant on a Friday night.  Simple well prepared food.  No Banchan was served unlike most Korean restaurants we patronize in the US.I had the Bulgogi with Spicy Pork.  We prepared and delicious.  I tried each ingredient individually at first - each ingredient had good flavor.  Combined they were great.Service was fast.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iIFd85tRUPWI4FQlnJQMUA",
        "caption": "Photo of Naru - London, United Kingdom. Seafood Noodle Soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iIFd85tRUPWI4FQlnJQMUA/o.jpg"
      },
      {
        "img_id": "MusmYQTj2ry76UeIMqMyzQ",
        "caption": "Photo of Naru - London, United Kingdom. Bulgogi with Spicy Pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MusmYQTj2ry76UeIMqMyzQ/o.jpg"
      }
    ],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "Rwr2_uLuimH9B-WuRrmEQA": {
    "date": "3/15/2018",
    "text": "Lovely little no frills hole in the wall.  Food was solid but not perfect -  I had the dol sot bibimbap vegetables only and felt they could have pumped up the vegetables when I opted for no protein.  The kimchi tasted packaged not kitchen made, but that is often the case... But the flavors were good, the service was quick and friendly enough.  Great spot for quick lunch break.   I will likely return during my stay in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYufTeETQRg5OHBRzubD8A"
  },
  "6H9fVJoglbxuLGJuUpDjQg": {
    "date": "2/4/2017",
    "text": "Greatly enjoyed the budae-jiggae, kimchi dumpling soup, and samgyeopsal here! The owner was so kind and really got to enjoy our time here!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ia18J3NmeCfUxRS97EaUSA",
        "caption": "Photo of Naru - London, United Kingdom. Samgyeopsal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ia18J3NmeCfUxRS97EaUSA/o.jpg"
      },
      {
        "img_id": "ZNouAoaFkva5YxyiEgHOGA",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZNouAoaFkva5YxyiEgHOGA/o.jpg"
      },
      {
        "img_id": "l1ko_0AP6Px2xu-aoBcADw",
        "caption": "Photo of Naru - London, United Kingdom. Budaejigge",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l1ko_0AP6Px2xu-aoBcADw/o.jpg"
      }
    ],
    "user_id": "7jmAvbN-jAuFDJNhyX0qxQ"
  },
  "-JCHalKui1cSpOzupG_kaA": {
    "date": "1/2/2017",
    "text": "We stayed in London for 3 nights, and we spent 2 dinners at this place 'cause it's so yummy!We had following dishes with family of four (2 adults and 2 teens). ALL VERY GOOD!#26 Bulgogi ... Slices of beef was soft and very tasty with sweet soy source.  #27 Yangnyeom Chicken ... This is the BEST one, crispy fried chicken dipped in a sweet spicy source. It's MUST item if you are chicken lover!#28 Sundubu jjigae ... We like Sundubu and had several ones in the past, but this one was the BEST one for our liking. Soup was not too spicy but has a lot of umami taste in it, and small squids are really good! It also comes with steamed rice (it's good also).#41 Haemul bookeum udong ... We asked to make it \"non-spicy\" as we don't like too hot dishes. It has a lot of seafood (Mussels, Oysters, Squids, Shrimps etc.) and very tasty stir-fried noodle. You'd better considering to order couple of dishes as a starter to be shared, as all dishes are relatively in smaller size (compared with US one). Also you need to take enough time into account as it takes time to be cooked (probably by one chef?). BTW, typical Korean restaurant in California comes with multiple small dishes as an appetizer (Namuru, Kimuchi etc.), but you need to order them here.Anyway, all dishes are soo good and atmosphere was very nice for small family like us to talk and enjoy tasty dishes without being bothered by a loud noisy music or too much crowded environment in a busy touristic area. There is no stress here so you can relax and enjoy time with family!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wHqYJ0k9rEMVrQS_5shd1g",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wHqYJ0k9rEMVrQS_5shd1g/o.jpg"
      },
      {
        "img_id": "hz95jM6EYDvw56PMYCN-vg",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hz95jM6EYDvw56PMYCN-vg/o.jpg"
      },
      {
        "img_id": "JFKyG4G9v1w5O5VA-DoOZA",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JFKyG4G9v1w5O5VA-DoOZA/o.jpg"
      }
    ],
    "user_id": "V1_l7iqYD0YB9EUv8sYHVg"
  },
  "aniI-7IpBPdFuGwoK75nPQ": {
    "date": "2/10/2017",
    "text": "The food is fresh, though lacks some flavour. Portions are on the small size for the price. Dishes were served very quickly. On the night we visited there was a large birthday group that took up half the restaurant and were extremely rowdy and disruptive which prevented us to leisurely enjoy the food. The acoustics are just not conducive to loud noise. Waiter forgot our water and to be reminded.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgjYZRMkFNBJIuSh5oR82Q"
  },
  "kOlkhciRnIyROAcj7LFiAA": {
    "date": "1/9/2017",
    "text": "Was pleasantly surprised by how tasty the food was at Naru. Naru is located a few blocks away from the British Museum and open late in a lively area. Stop by for drinks and appetizers or order a plate or two for dinner. Portions aren't very big and will not fill up someone with a hearty appetite.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CLAyVgPcfLqIHzzqlFxZ8Q",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CLAyVgPcfLqIHzzqlFxZ8Q/o.jpg"
      },
      {
        "img_id": "gFkToVYWGLecZSuRsfbNyw",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gFkToVYWGLecZSuRsfbNyw/o.jpg"
      },
      {
        "img_id": "SgRbgJSFeWCzfdHX3O1htw",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SgRbgJSFeWCzfdHX3O1htw/o.jpg"
      }
    ],
    "user_id": "BvmQlN2khHCcowR8cUWtBQ"
  },
  "3z6LLMe0kKHBdrjBVrOhvQ": {
    "date": "7/1/2017",
    "text": "Okay. Ddokboki was flavorful but lacked in quantity. The kalbi was lacking flavor and soups didn't have the best ingredients in terms of seafood. Explore other Korean places but this place is fine if you want a traditional meal that is somewhat commonplace.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6Ovhm9vHlFI_WYXttaBww"
  },
  "sTsMtPceqCkuM-Rf2TBimA": {
    "date": "7/24/2016",
    "text": "Naru is a small Korean restaurant located near to Tottenham Court Road station. Fortunately it is not located on the same road as what use to be known as London mini Korean street, so it hasn't been affected by the centre point and crossrail regeneration.When you come to Naru I recommend their soup pot which is served with steamed rice. But unusual that it was multigrain rice or what is known as black and white rice on their menu.A favourite soup pot of mine is Kimchi jjigae (£8.50) which consist of spicy kimchi, sliced pork and tofu. It is one of the traditional Korean soup pot that goes well with rice and this spicy soup which is suited for the colder season.Naru's Kimchi jig was good as the soup was not too watery and more like a stew. There was a good amount of thinly sliced pork and tofu. The portion size was just right for one person.There is a small selection of casserole which are larger version of the soup pot and is serving for 2-3 people. These do not include rice but for additional charge you can add rice, ramen noodle or potato glass noodle to go with the casserole.The kimchi, sliced pork and dumpling stew is one of the casserole which can be served for 1 person (£13). The only thing missing from this was tofu otherwise it would had truly satisfy for my tofu loving friend.If you not a fan of having a soup pot then there are a lot of other traditional Korean dishes inlcuding Dolsot bibimbap and par jeon which are not bad. But it would not be my first choice at Naru.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gQJp6mwCMRCBLXDsF_cGAQ"
  },
  "Or8f_wy1IKleqgYONGdpyA": {
    "date": "7/1/2015",
    "text": "Great lunch spot. We were looking for a place to eat lunch before a matinee play. We were looking for a place that was air conditioned. Finally, we found Naru. Air conditioned and they serve beer. We had 2 beef lunch specials. Both were good. We also shared a Seafood Pancake - this was very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5roCqYi5HaB8vufBSUUpoQ"
  },
  "UAqdmUjSV-xUDWVEfc5BJw": {
    "date": "7/14/2015",
    "text": "I stopped by here for lunch because it was super close to my residence, and I'm happy I did! The location isn't all that great since it's on a corner and doesn't get the best publicity, which might explain why it wasn't that crowded when I visited.I ordered the tofu bibimbap (no egg) and ended up really liking it. The tofu tasted great and had a good texture, and I enjoyed the vegetables/rice (mixed grain) as well. The vegetables did seem a bit oily, though, hence the minus one star. But overall, a solid meal, and for a reasonable price too - I believe I paid around 7 pounds for the bibimbap, which was more than enough for lunch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d0B_dvPTqgn8cGiaVBWXTw",
        "caption": "Photo of Naru - London, United Kingdom. Tofu Bibimbap (no egg)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d0B_dvPTqgn8cGiaVBWXTw/o.jpg"
      }
    ],
    "user_id": "_8MgkXoMQqwGIyMgYBnNBQ"
  },
  "Q83eqNY7M9uRYAxK1ogjUA": {
    "date": "5/3/2015",
    "text": "We had a delicious meal at Naru, despite difficulties using their incredibly slippery metal chopsticks!  We started with the ke sal gu jeoul pan which was supposed to be soft shelled crab with veg served with mini pancakes.  Firstly, a completely incorrect menu description as it wasn't soft shelled crab at all but imitation crab meat!  Very disappointing and by far the least inspired item we ordered. We also had the pa jeon kim chi pancake which was good.  Crispy on the outside with a nice golden colour. The BBQ dishes went down a treat. We had the Bul go gi and the spicy pork.   Both were really tasty. The bi bim bap was ok. It wasn't as flavoursome as I had hoped and it tasted a bit bland. The two best things we ordered were the yang nyum dak fried chicken and the kim-chi, sliced pork & dumpling stew. The fried chicken pieces were perfectly crispy and tossed in a sweet and sour sauce. Everyone kept referring to this as Korean popcorn chicken. Delicious! And the stew came with a burner to keep it bubbling away in the table. Loads of veg in a spicy broth. The dumplings were yummy. Overall a great meal at Naru. Really enjoyed the food and atmosphere and it was great value. We gorged ourselves and it came out at only £25 per person.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "Ay4NES83jHe-0fXQABaUNA": {
    "date": "2/17/2017",
    "text": "Maybe a 3+. Food was good, but we had a long wait for it and then no one followed up to refill waters or see if we needed anything else - and we were the table closest to the register! Luckily, I saw a water dispenser right on the front counter and could refill water myself, twice. We had the veggie egg rolls with seaweed and glass noodles and the spicy shrimp as appetizers and they were very tasty. I got the roasted chicken in a sweet sauce, my spouse got the pork belly and squid and veggies in a sizzling hot pot. Also, good. Prices were okay.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hKAelF9K5XSL9bjQO7PpIw"
  },
  "bO6QNWWeerT9kaWIyhxgaQ": {
    "date": "3/6/2012",
    "text": "I am a picky eater when it comes to Korean food.  So picky I make trips out to New Malden because I find that the restaurants in central London tend to disappoint.  Not Naru!  If you're planning to go with a group of people, I think it works out better to order the dishes separately rather than getting the set menu.  It'll give you a better variety of dishes.  StartersKimchee pancake - Almost everyone's fave!Seafood pancake - where's the seafood?  Should've gotten 2 kimchee onesJap chae - Pretty good - everyone's 2nd fave.  Spicy pork with tofu - This was good but left me just mildly unsatisfiedMainsBulgogi - YUM!  I have to admit it is nice to not have to BBQ my foodKalbi jjim (Stewed short ribs) - Yum!  I want more!Tobboki - This is like dukbokki + instant noodles + fish cakes - This was delightfulSeafood udon - It was good but definitely not the highlight.  Service was pretty good.  I'm definitely coming back.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "lVI34cj4M6DECXFfVQTI5g": {
    "date": "10/27/2015",
    "text": "To be honest, i would give out no star if I could. I have been to Korea twice, and i can tell the food is not authentic at all, at least the ones i ordered, which are the deep fried chicken starter and a beef rib stew as main. The chicken tastes like junk food, like you got in a fast food place for 3 dollars. The crisp is not what they usually use in Korea. The beef rib is huge, can they just cut it in smaller piece? The plate for the stew is so shabby, a plain, white ceramic plate, which is not what they use for a stew. And this stew, goes without rice, charged 14 pounds. But the most ridiculous thing of this \" restaurant\" is that they have 12% service charge. Com'on, all they did is adding tap water one time. And 12%? Excuse me? Am i  eating at a fancy reataurant or am i in the States now? Three of us, spend 42 pounds, eating Korean fast food. Sorry i don't get it. And no thank you, never again.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BEnA_fxHrfAgDzwKaCDROQ"
  },
  "aP_XSHeVoAZ1VWR4sYxC0w": {
    "date": "11/8/2014",
    "text": "Whenever I am homesick there is nothing like Korean food to bring me the comfort. Since the Korean population in London seems fairly low, I was afraid of what my options looked like. After scouring a number of reviews my eyes fell upon which seemed to have relatively good reviews. I had the bibimbap in a stone bowl which was really quite delicious! The stone was hot enough to create some really crispy pieces of rice. The taste of sesame oil and red pepper paste flooded my mouth with joy. Aside from being a bit stunned that kimchi and namul had to be paid for (they are complimentary in Korean restaurants in Korea, Canada and the States), the portions were good for these and they tasted fresh and delicious.Finally I also had the kalbi which had a bit of an unusual appearance it was like they took the tong kalbi (the traditional cut) and sliced it into a long strip which they cut up into pieces and served in a heated marinade pool. I wish it was truly grilled as the charcoal flavour was missed. It wasn't my favourite version of the dish but hit the spot. Afterall who would turn down kalbi?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y0yAbuywJBj2ii929ymYhQ",
        "caption": "Photo of Naru - London, United Kingdom. Na Mool",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y0yAbuywJBj2ii929ymYhQ/o.jpg"
      },
      {
        "img_id": "84HF4KijRF5AU6ce1klFPA",
        "caption": "Photo of Naru - London, United Kingdom. Kalbi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/84HF4KijRF5AU6ce1klFPA/o.jpg"
      },
      {
        "img_id": "JXQe7pdMbg0RCUn05jjscw",
        "caption": "Photo of Naru - London, United Kingdom. Dol Sot bibimbap",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JXQe7pdMbg0RCUn05jjscw/o.jpg"
      }
    ],
    "user_id": "6dxupLAsjUzQzH1VLzfkeQ"
  },
  "NTBqLbQmS0LE7yOL7BE6iA": {
    "date": "10/16/2013",
    "text": "I am not an expert in Korean food and I'm grateful to visiting San Franciscan Yelper Rachel Z for organising this Korean food outingFollowing some advice from local Yelp foodies, she led an intrepid group of hungry Yelpers to Naru on the outskirts of Covent Garden. Most of us had a little experience of Korean food but were keen for moreWe did the time-honoured group ordering system of shouting out dishes that we liked the look of and once again, we came up trumps! Haha, must be natural ordering skill. Naru lived up to the recommendations we had been given and we were treated to some tasty dishesI'm afraid my poor memory and lack of familiarity with Korean food means that I can't summarise all rhe dishes that we enjoyed. However, I can remember that my favourite dishes were the beef tartare, sweet yet fragrant than sesame and perfectly paired with pear, and the japchae, sweet potato noodlesI haven't been overly enamoured by Korean food in the past but Naru has inspired me to explore this cuisine more in the future",
    "rating": 4.0,
    "rated": {
      "useful": 10,
      "funny": 7,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "ImvxZ1-U9GhGJOYhZmoh-A",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ImvxZ1-U9GhGJOYhZmoh-A/o.jpg"
      },
      {
        "img_id": "Io-kQcXEwAeWei0UbvSmRA",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Io-kQcXEwAeWei0UbvSmRA/o.jpg"
      },
      {
        "img_id": "42-eBNHsPqO-MjLujc_TrA",
        "caption": "Photo of Naru - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/42-eBNHsPqO-MjLujc_TrA/o.jpg"
      }
    ],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  }
}