{
  "9140gPDbnmOUONCBgQyv8w": {
    "date": "8/24/2008",
    "text": "The curiously named Bugis Street Brasserie is a Cantonese Singaporean bistro and is part of the Millennium Gloucester Hotel with the entrance on the corner of the building opposite the Holiday Inn Kensington Forum. The interior is OK, with a slightly odd mixture of modern and old: empty gilded bird-cages hang over the bar, the tables are marble, the floor is tiled and the chairs are old-fashioned and wooden. The service was disappointing: I was met and seated quickly, but it was then ages before they took my order for food or drink. The menu is a mixture of Chinese (Cantonese) and Singaporean food and sounded nice. I ordered Salt & Pepper ribs (£5.25), followed by crispy duck. Curiously rather than arriving in that order, and separately, they arrived in the opposite order and separated by about one minute. The ribs were small, and very strongly flavoured. Lots of garlic, both crushed and thinly sliced, plus crushed and sliced chillies dominated the flavour of the dish, perhaps too strongly for some but I did enjoy it. I was glad that I was on my own that evening because I suspect my breath could probably have stopped traffic at 50 yards! The crispy duck (£9.50) was very good: there is something about the theatre of making up the pancake, sauce, duck, cucumber and spring onion mixture that I always enjoy. For the main meal I went for fried noodle with chicken (£6.50) and sizzling beef (£9.50). Once again the food was highly flavoured, but could perhaps benefit from being more subtle. I washed it down with a couple of bottles of Chinese Tsingtao beer (£3.60). Overall I enjoyed my meal but the service was disappointing, and the food somehow seemed over spiced, which is odd for a Chinese meal. I will go back again sometime, and it will be interesting to see if my opinion of it changes.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Bpnce1e9SJgk2KH92kqQQ"
  },
  "sTepAE6bqxm1qjSJ-_Y-zQ": {
    "date": "3/27/2011",
    "text": "The Singapore Laksa and nasi lemak are my favourites.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HabZBpDkqEqw5hFhGoVZpQ"
  },
  "x-TMa1flobAGzipzDVWI1A": {
    "date": "12/24/2012",
    "text": "Good taste of home! My friends and I are Malaysians. We had the seafood ho fun, nasi lemak and Penang char keoy teow. Not the best I've had, but definitely two thumbs up for a good fix!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkHtfkDi8CTJ6QrJWA4vMA"
  },
  "UyUJSYoLGod7KgUjd6bSRQ": {
    "date": "9/30/2014",
    "text": "Good South East Asian food! Love the hot and sour soup, always get this when it's on the menu. The one here is just the right amount of hot and sour! Me likeyThen had the Malaysian curry chicken, which was nice, creamy and spicy. Taiwanese chicken hot pot which is their chef recommendation was nice, but didn't taste very special. The white cabbage vegetable dish was simple but very yummy. A very satisfying lunch, and portions are a good size too. Definitely be back here if I'm in the area",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uN9LQnQopBZ_g2uGKAuFhQ",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Dishes, chicken curry, white cabbage and Taiwanese chicken hot pot",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uN9LQnQopBZ_g2uGKAuFhQ/o.jpg"
      },
      {
        "img_id": "ykZf26xDXYupCOxKqDKCFA",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Hot and sour soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ykZf26xDXYupCOxKqDKCFA/o.jpg"
      }
    ],
    "user_id": "1ciHglMQVa6pRA5uXUoglg"
  },
  "JXOtQ9BeKXFnyW3X-GB20A": {
    "date": "5/29/2016",
    "text": "I have to say, it is far more better than what I expect. If you are looking for southeast asian food, this place won't disappoint you. The Hainanese chicken rice here is awesome. The environment is pretty enjoyable too. I will certainly come back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZYs8R7pLoxgVGOIzp9lTNg",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Hainanese Chicken Rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZYs8R7pLoxgVGOIzp9lTNg/o.jpg"
      }
    ],
    "user_id": "ryljrA9c9WEqT70Ljf2itA"
  },
  "OJQj_y2ZhjxVifqDM4M7dQ": {
    "date": "8/26/2015",
    "text": "Came here at 8pm mid-week for dinner and we were seated right away. Our waiters were both patient and accommodating while we decided on our orders. Eventually, we decided on sweet and sour chicken, stir fried beef with ginger, and egg fried rice. All were delicious, but the chicken was phenomenal! My father thoroughly enjoyed his sake and my mom and I loved our jasmine tea! Highly recommend, especially if you're staying at a nearby hotel. It's a little off the beaten path of Cromwell and Gloucester Road (part of the Millenium Hotel), but my oh my was it worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sdsIXiUptEO6gdVFGsxHwQ"
  },
  "78kQ4VjVhAelrW7NheDM6A": {
    "date": "11/9/2013",
    "text": "Authentic Singaporean/Malaysian food, and its a bit of a hidden gem in South Kensington! Surprisingly very good for a hotel restaurant, and very reasonable prices too.Go to for the nasi lemak or curry laksa - both great choices!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "7B3rXRGqvU6HySIC3r6Q-g": {
    "date": "2/26/2017",
    "text": "Really good Chinese and Singaporean dining, fairly casual in this chi chi part of London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hT9bPFXoMHKnRC0og1nCSw"
  },
  "UOHb2WqJMUKO-8I69W6tMg": {
    "date": "12/1/2015",
    "text": "The best Singaporean restaurant I have tried in London by far. The price was very reasonable and cheaper than anticipated considering it is part of the Millenium Copthorne Hotel. The decor will take you back to old Singapore (30-40) years back, but it still feels modern. I only wish it was as cheap as the hawker centres and food halls in Singapore.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "KycAozhafYR9VGW0OSvtEQ"
  },
  "QgNE6_aD5d-iTihp8ZC-JQ": {
    "date": "6/8/2014",
    "text": "Authentic food that is absolutely delicious. This little restaurant is tucked away in a corner and could easily be overlooked but it's worth a visit. There's not much ambiance to speak of but the food more than makes up for it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6hrSZHLaMhSbGQ30tr5TRg",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Delicious sea bass",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6hrSZHLaMhSbGQ30tr5TRg/o.jpg"
      }
    ],
    "user_id": "ylXfwcnVPMjQ0BVR7DPmCQ"
  },
  "pun-EzpjZgF60G0slWod8A": {
    "date": "10/21/2015",
    "text": "Great restaurant and have been a regular customer here for the last 5 years or more. I have had most of the Singaporean/Malaysian dishes excluding those that contain pork and not once have I been disappointed with the food. Personal favorites are Nasi Lemak (love the deep fried anchovies and the curry chicken is sumptuous), great Mee Goreng, Chicken Kung Po and just love the Laksi soup to keep me warm on a cold day! It's great that they provide Adobo type nuts as a complimentary during the dinner menu. Finally for those with a sweet tooth the Gula Melaka Sago Pudding makes for a great ending. Very nice. Prices are reasonable and makes value for money. Great service most of the time. Go check it out!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjiUXeILqOV-sXwCyiQLyw"
  },
  "etqAxojM-Z9OYCvmd2ghWA": {
    "date": "7/18/2014",
    "text": "Came into town and hit a gem. I personally like fried rice and they offer a few varieties. I tried the chicken fried rice and it was very good. Could of been a little stickier to use with chop sticks. The roast duck was tasty, great taste and very moist. Loved it. Sweet and sour pork was also tasty with a variety of veggies. Stir fry duck also was good. I particularly liked the mushroom and chicken with bamboo shoots. The sauce was light in flavour and the chicken again was moist. I would recommend this to anyone. Most meals are £7-£13. None of the meals come with rice. This is added on if you want it. £3 for white rice and up to £7 for fried varieties.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TvkoKEw7rhyQsmWULZq6Lw"
  },
  "k6vm7nB-G6ROQW-p5XgfHQ": {
    "date": "6/8/2016",
    "text": "Myself and 3 friends went there for an early dinner and were greeted by a waiter. We were sat immediately. There was one other person in the restaurant, with every other table empty. We went to sit at a round table and were told that was a table for six. So we moved to a table for 4 and proceeded to wait for 20 minutes for the waiter to come back. We went to order drinks and were told that he couldn't make drinks that he was the only waiter on duty. Now I get serving 2 tables, 5 people is a lot of work. But with a full bar sitting there it didn't make sense. The food was good to okay, nothing special. I would never eat there again!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWsUNXsKUk7b_w_iqpuzOw"
  },
  "qciTCdKL1ZcOKLjPTb-IXQ": {
    "date": "12/23/2011",
    "text": "Actually writing a review for the Kensington High Street restaurant - didn't realize it was a chain until Yelping it!Just around the corner from the Kensington High Street Tube station and tucked away in the Copthorne Tara Hotel.  Even though it's off the beaten path it's frequented by many Malaysian and Singaporean locals, including flight attendants from Malaysia Airlines and Singapore Airlines who stay at the hotel.  The interior of the restaurant is nothing special but the staff are generally friendly and courteous.  Food can be hit or miss.  I tend to stay away from the food that you can get at all the chinese restaurants e.g. Kung Po Chicken, Beef in Black Bean Sauce and go for the Malaysian and Singaporean favorites instead.Favorite Eats Include- Beef Ho Fun and Seafood Ho Fun (flat rice noodles).  Ask for the light gravy (egg drop sauce) instead of the black bean sauce.- Singapore Laksa (spicy)- Crispy Aromatic Duck (cheaper version of Peking Duck)- Salt and Pepper Spare Ribs",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Uwi5E3FUYoablYck44Cp8w"
  },
  "WWp9AH_q8UO2ezKBWWXq0A": {
    "date": "9/6/2011",
    "text": "Ummm, this is  more like a 2.5* but i'm feeling generous today. I'm Sporean....but i have low expectations in the Western world. The laksa was ok. Not very tasty. weird noodlesThe chicken rice...chicken was quite tasty. the rice was all wrong. not flavorful enough. bahSalt & pepper squid...pass",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCmvpQfFpdxhbWVM59eUCg"
  },
  "O5uVF_UOCpKrV8Uzon5XZQ": {
    "date": "6/5/2011",
    "text": "Didn't expect to find a Singaporean restaurant embedded into a multinational hotel chain in London, but it seems that plenty of Singaporeans have, as Bugis Street was nearly full on Friday lunch and lots of people were ending their sentences with '...la.'However, I'm torn as to whether the large numbers of SINs at Bugis is to do with the quality of the food or the great value of the lunch menus - because it's not both as the two seemed to be mutually exclusive from what I saw and tasted.My Hainanese Chicken Rice was a 4 out of 5 for one the dishes of world cuisine that I REALLY love, but this great bit of lunch was not on the super-cheap lunch deal menu which instead was dominated by turgid dishes like sichuan beef in glossy gravy on clumpy white rice.A neighbour did have an awesome looking bowl of spicy soup though.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "IZGfnAx1vJtFqKTtH0H_mw": {
    "date": "11/10/2013",
    "text": "I've never had Singaporean food before so I didn't know what to expect. I was delighted at the friendly and fast service. The food was fantastic. I ordered a spicy noodle with seafood and some Chinese tea. I was surprised by the portion of the tea for one, as normally I have to order 2 pots for myself, but this was a sufficient portion for me. A very nice restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDIlAnSMoqqjctxirETsig"
  },
  "dgFGbYOtAytHZIjJkUY3ag": {
    "date": "8/23/2011",
    "text": "This is a fairly decent representation of the food in Singapore. They have you regular favourites like Laksa, mee Goreng, Sambal Prawns (that is a Malay dish of course) and coupled with Chinese dishes.We were a larger group so we ordered a combo of dishes most of the Singapore/Malay dishes were decent. The Chinese dishes not so much. I had the Singapore Sling but it was not what I expected. For a group of 7 we ended up almost 20-25 quids per person and we had a lot of left over food. They do you have a buffet brunch on the weekend and I would like to try that out on the next visit.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwIqbXEXijQNgdESVc07hg"
  },
  "W8wpty36Pc2mt0eKCXdZCA": {
    "date": "9/21/2013",
    "text": "Looking for authentic good singaporean cuisine in London? Look no further than Bugis Street! Tucked away in a hotel in Gloucester Road, you will find it full of Singaporeans, which can only be a good thing! Chicken Rice and the peking duck is amazing! Hokkien rice was only so-so. Tastecard gives 50% off. I will definitely come back as I'm craving some Nasi Lemak!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "snR6jXPWFUmqNLH4GuwrPg"
  },
  "qNRtaxqhNKkcu7C7Na9Njw": {
    "date": "9/2/2012",
    "text": "After three days in the British capital of many French style sandwiches and fish n chips I was really craving for a full sit down meal with lots of veggies and rice.  I've been walking around this neighborhood for a few days now but never saw this Singapore style restaurant.  I found it on Yelp and I am glad I gave it a try.  The restaurant is tucked away from most of the restaurants of the area on the ground floor of a hotel.  Service was very good, I have never been so un-rushed in and Asian restaurant before.  The person that took my order I think was the manager and my food was brought out by a server.  I ordered stir fried beef with gingers, scallions and snow peas.  Stir fried mix veggie and a side of steam rice.  The dishes were very good and very tasty.  If you are traveling to London and is staying in this area of South Kensington and are looking for an Asian flare, I highly recommend this restaurant.  My dinner came out to about £23 including jasmine hot tea, but I did ordered enough food for two person.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iQKS9vHVy6y2mPvd5vu6pA",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Stir fried beef with ginger, scallion and snow peas.  Stir fried mix veggies.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iQKS9vHVy6y2mPvd5vu6pA/o.jpg"
      }
    ],
    "user_id": "9od86oWzre1AFdSUxMfB_g"
  },
  "BuSii1HzgC29YCIO6-YzQA": {
    "date": "4/25/2009",
    "text": "Bugis Street is located in the Millennium Gloucester Hotel, just around the corner from Gloucester Road Tube station. It's described as a Singaporean bistro - hmmm, why do they feel the need to use a French dining experience to describe Singaporean food?Bugis Street is a famous tourist area in Singapore, which boasts a lot of open-air restaurants.The menu promises much to a south east Asian like me, with dishes like ho jien (oyster omelette) and hokkien mee (braised thick egg noodles with seafood pork & vegetables) reminding me of the many open air hawker (street vendor) eating venues back home.Unfortunately, in its translation to London, the spicing has lost some of its kick and definition, perhaps to cater for the more international mix of clientele staying at the hotel.However, what pulls it up to 4 star status is a great value lunch buffet available everyday of the week.Not as good as the original Bugis Street but worth a visit",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "HP8lf-ysuZk0zEhEjYDLOg": {
    "date": "1/17/2009",
    "text": "Bugis Street is named after a well-known, formaly-infamous, now-touristy street in Singapore. On my first trip to London with my parents, we saw a poster advertising the restaurant in the lift of a Tube station (probably Kensington). We're originally from Singapore but haven't lived there for many years. One common refrain you'll here from people in our situation is how much we miss the food. so any chance we get to try a Singaporean/Malaysian restaurant, we pounce on it.The dishes we ordered were good, and authentic. There were some not-so-authentic-looking dishes on the menu, so you kind of have to know what to order. We tried one of two other Singaporean places that trip, and this was the best. The experience was a little more refined due to being in a hotel, and he prices were marked up accordingly. If you're in the area, I say this is a good place to go for a Singaporean food fix, and even to go back to. If London is your oyster, there are other places that give you better value for money (C&R for the Singaporean/Malaysian/other Asian mix; Satay House for strictly Malaysian cuisine). After all, Singaporean food is street food and hawker centers, not haute couture.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cD2te7Lsf85xYYYrsijs6Q"
  },
  "AA0Or25j6nlzJm1ma17LdA": {
    "date": "11/17/2008",
    "text": "Although this is a Chinese restaurant it takes its inspiration from Singapore which introduces some interesting Malay influences, resulting in some more spicy dishes than your usual Chinese place. The decor is a little on the functional side (echoing the Singaporean hawker stalls) and the atmosphere makes this restaurant a good place to get a good quality meal fairly fast, rather than a place where you might pass a few hours. The food is prepared to a high standard and served in good-sized portions with a varied menu that includes most chinese restaurant favourites with a few more exotic Malay dishes. Having been here quite a few times I have found the service can vary from friendly and welcoming to slightly surly, although that would not put me off going back as the food has never disappointed. Note that there are good value weekday lunches, and an excellent Sunday lunch buffet that was about £8 per person last time I went. Also, take-away orders get a 10% discount (and don't have to take a gamble with the service!).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DVW1qf6iCl-eKwiYuqjZxw": {
    "date": "10/21/2018",
    "text": "This is my our Fourth (4) time here this week! The food is: YUMMY, Consistent, Fairly Priced, & Well Portioned!The Service is very attentive and ready to answer questions about their menu, which is very helpful.Side Note: On Saturday 20/10/18 Jacky was our waiter, actually he was the only waiter at 4pm, he had a full house (7 Tables) and attended them all VERY WELL! He did not skip a beat, and made sure everyone's food was to the clients satisfaction. Great Job Jacky! When in LONDON, UK, make sure you make some time to visit this Delicious (Asian Cuisine) Restaurant! Bugis Street!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VYgNYJ9MlR4OSH4dDiCRg"
  },
  "uWrKfCiBO04bnf8Lbtw8lQ": {
    "date": "8/24/2018",
    "text": "The place to go when you are staying at South Kensington and craving for Asian food. It's legit Singaporean here. Food is authentic, tasty and simple. If I'm not visiting, I will eat here everyday and will snob British food. I had the laksa (it's my favourite Southeast Asian noodle soup) and salt & pepper calamari. Both were so good and delicious. Now I'm planning to have my last London meal here and have Hainanese chicken and rice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1uY6LhssuUPH3X-CLs1dwA",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Laksa and Salt & Pepper Squid",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1uY6LhssuUPH3X-CLs1dwA/o.jpg"
      }
    ],
    "user_id": "_NF6MAas4oXf-V6lseUT7w"
  },
  "Kt-SiweGYYKMABbrVg3nug": {
    "date": "6/10/2018",
    "text": "This is the place to visit when you are carving for Chinese food. Great in taste and customer oriented. Quick service and complimentary roasted peanuts. Must visit and enjoy all any dish from their large variety of food/dishes on Thier menu. Loved it. Just opposite to Holiday inn Kensington forum and nearest tube station- Gloucester Road.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5s4436Lay21ayoidoxTXsA",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5s4436Lay21ayoidoxTXsA/o.jpg"
      },
      {
        "img_id": "Hw4TF5m59zrV6kqUagvuKg",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hw4TF5m59zrV6kqUagvuKg/o.jpg"
      },
      {
        "img_id": "aoAWl2EtZAwlNrImNmvm9g",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aoAWl2EtZAwlNrImNmvm9g/o.jpg"
      }
    ],
    "user_id": "YtcIE7NMpw2tN8JO2rr8Gw"
  },
  "F_d4mbsYPJz6JEfwk-KauA": {
    "date": "11/5/2018",
    "text": "Had the prawn fried rice which was served piping hot with beansprouts. The food was v. good. A casual restaurant with very nice and helpful staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qLuaoF2Ree2qf9XzpQLBZQ",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qLuaoF2Ree2qf9XzpQLBZQ/o.jpg"
      }
    ],
    "user_id": "JShkzu84yaKgD6Av9AlKzg"
  },
  "PdE4xJjTtgcWPNVirAvg1Q": {
    "date": "10/25/2018",
    "text": "Excellent food and great value for money if you are looking at a good Singaporean/Chinese cuisine option in the Kensington area. We tried sweet corn soup, prawn and chive dimsums, chicken fried rice and chicken in schezwan sauce. Food was fresh, adequately spiced and delicious. Would highly recommend for a repeat visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2c2lBiqJ16HHkxu3QmshGA"
  },
  "D0iBRjRfLHEZoI4xnYJbeA": {
    "date": "8/13/2018",
    "text": "Excellent restaurant! We have this restaurant in front of our hotel and what a great discovery! We had the duck and fried rice.  We'll come back",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4gAUJbNvX1v9cx-05Y4nGA",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4gAUJbNvX1v9cx-05Y4nGA/o.jpg"
      },
      {
        "img_id": "hfcYQa3AJpSQ0s_CpNt03A",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hfcYQa3AJpSQ0s_CpNt03A/o.jpg"
      }
    ],
    "user_id": "40Av6gCcga6oc47ecSxzJQ"
  },
  "6TbTJoj9lacbFEXlQr0KvA": {
    "date": "4/21/2018",
    "text": "Found this restaurant while hunting for Singapore food in London on Yelp. This restaurant is at the corner of the Millennium and Copthorne hotel and about 5 minutes walk from Gloucester Station. The restaurant is fairly spacious and seats about 50 persons. In the restaurant, there are large pictures of historic Bugis Street hawker stalls and there were a number of round marble-topped ('kopitiam') tables which gave the restaurant a feeling of authenticity.I ordered the Singapore laksa, chicken rice and grass jelly drink. The laksa was particularly wonderful - the noodles were the correct 'thick vermicelli' noodle from Singapore, there was the appropriate sliced fish cake, dried tofu and shrimp and the gravy had the right quantity of coconut milk and spice. It was as authentic a Nonya/Katong Laksa as I have tasted outside of Singapore. The chicken rice was not bad - chicken was tender, rice was flavorful and soup tasted authentic but the version at C&R in London's Chinatown is better at a lower price. Finally, the grass jelly drink was beautiful - 1 sip and I was transported back to when I was drinking this drink in a Singapore hawker center when I was growing up. All in all - well worth a visit, especially for the Singapore Laksa!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dJSMTX0kt_nJPM98j7RapQ",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Real Singapore food in London",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dJSMTX0kt_nJPM98j7RapQ/o.jpg"
      }
    ],
    "user_id": "CRNLxbmm5iV0xgtGzhrOTg"
  },
  "JmWrrMgMOZvfgr2Un2l3DA": {
    "date": "9/17/2018",
    "text": "Had the dim sum, which was pretty basic, and should have been more adventurous on this menu. No doubt there are great options here. Go exotic!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjUTK-_nVJplo-JFUj6ULA"
  },
  "GTqaDU8haKfLAucyAS2aSg": {
    "date": "12/8/2017",
    "text": "Food was all excellent. Prepared well and seasoned perfectly.Got the crispy duck which was excellentHainanese chicken was also cooked perfectly and seasoned exactly right.Only problem is that it took 90 minutes to complete this meal. Hard to get someone to come over to the table. The wait staff isn't particularly nice. Food takes forever to get.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rCwqtaaTX-pR6-tvQtHpkw",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rCwqtaaTX-pR6-tvQtHpkw/o.jpg"
      }
    ],
    "user_id": "vgjkuOpjqEloSNUl6VFFcQ"
  },
  "uhX3tmFnD3u4zGq8IKKRLw": {
    "date": "4/20/2018",
    "text": "As once a proud resident of Singapore I rarely find good Singaporean food on my travels and especially at home in the States.After being stuck in the immigration line at Heathrow for an hour... I killed time researching food that I would eat when I finally get to my hotel. I zeroed in on Bugis Street. Frankly, it is the best decision I made today. The hot and sour soup is spot on and the Nasi Goreng is the real deal. I'm just upset that I'm too full to eat the Chicken and rice on their menu. Will definitely try to come back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKYT7Ky07-3MEh8NtC37eQ"
  },
  "sZaFak4UmbiCXmYtmnM-Tg": {
    "date": "8/7/2017",
    "text": "Found this restaurant on yelp and gave it a try as it was near the tube stop we needed. Great Chinese food at a reasonable price!! Loved their Jasmine tea and the spicy prawn dish (w okra) - I can't remember the name. Also enjoyed the fish in Thai sauce and the mixed vegetables.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NlMOJtUPvTx7eCNcLFyZuQ",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Vegetable fried rice w egg",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NlMOJtUPvTx7eCNcLFyZuQ/o.jpg"
      },
      {
        "img_id": "USbl1wNRpcpyz5OGUhB1iQ",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Chinese broccoli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/USbl1wNRpcpyz5OGUhB1iQ/o.jpg"
      },
      {
        "img_id": "AKCuJMNXEdWx_KUUdc2R0w",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Mixed vegetables",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AKCuJMNXEdWx_KUUdc2R0w/o.jpg"
      }
    ],
    "user_id": "AeiwVofjT08y0OXwqo1tzw"
  },
  "Ju6Aqw8b_Cef6eXlVXZM2g": {
    "date": "4/19/2018",
    "text": "I was so looking forward to having some good classic chicken rice. However what I got was soggy rice and messy chopped up dark meat chicken. It was accompanied by an overly sweet chilli sauce, some dark soy sauce and minced ginger and garlic sauce. So utterly dissapointed! Service not overly friendly but quick!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4urXmuGFQPB17aHD4Pbvg"
  },
  "QHKz2gY6kUfaHfUtCQq11g": {
    "date": "6/3/2017",
    "text": "This was our first meal in London.The service was pretty good. The place is clean as well. It was decently packed and our food came out very quickly.We ordered fried rice and beef noodles and both were delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "KeFxmdP26zyE3CXsQbSH0w",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KeFxmdP26zyE3CXsQbSH0w/o.jpg"
      }
    ],
    "user_id": "baIs9OsD3IHluIfzJ9JvPA"
  },
  "aWDnyvChIsT0O548k1zYBA": {
    "date": "4/1/2018",
    "text": "Omg, our last meal in London and it was fantastic. It was a block away from our hotel and we were here for 5 days and just found it via Yelp. Our family had the appetizers of satay, duck with plum sauce, cucumbers and wraps and oyster omelette along with the famous chicken rice, Singapore laksa, beef stir fry noodles and wonton soup. Very authentic and reminds me of family. The service was great and the restaurant cozy and easy to find. Well-recommended and a must try.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W7sKNCW-riE1d-eLSsWmxw"
  },
  "bK7ij2ZWIht9qtwr2-LD9w": {
    "date": "3/16/2018",
    "text": "We wished that we found this place sooner. Authentic Chinese food at a good price. We probably would have gone back if we didn't discover Bugis Street on our way out. I had spicy beef noodles and my daughter had spicy seafood noodle soup. The shrimp spring rolls were super fresh.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7ujRU9AyIkVA0Onv_jyxg"
  },
  "i_JMwelav9FItEaSaW1tqQ": {
    "date": "8/19/2015",
    "text": "Bugis Street drums up traditional Singaporean fare like it's namesake - a popular shopping street in Singapore. We stopped in for dinner on a weeknight and were not disappointed. The Fish Sambal and Veggie Fried rice were spot on. The Sambal was made with Tilapia and had the right amount of spices to make it flavorful without being too fiery. The husband also got a small portion of the Crispy duck that was served with cucumber, spring onions, pancakes & hoi-sin sauce. He found the duck to be a little chewy and dry, but liked the pancakes. The prices are very reasonable, between 9-13 GBP for each dish and portions are generous. The service was quick and efficient.**Update:We went back again for a quick lunch and the Ah-sam prawns were unbelievably good. A fiery red curry it tasted amazing with plain white rice. We also got a side of schwezan okras and they were crunch and tasty. Over all a stellar meal.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Oq4q0BUW0q4X89is8w7r_g",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Ah-sam prawns &  schwezan okras = YUMMY!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Oq4q0BUW0q4X89is8w7r_g/o.jpg"
      },
      {
        "img_id": "peLnG3bPSzMBUr2iVctmRQ",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Crispy duck",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/peLnG3bPSzMBUr2iVctmRQ/o.jpg"
      },
      {
        "img_id": "AOUeMUGsXxoKxgRlhbPKFw",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Veg egg fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AOUeMUGsXxoKxgRlhbPKFw/o.jpg"
      }
    ],
    "user_id": "3pmKsT46qo91FL4A7NVShQ"
  },
  "8gfvEyO15W395me49-EEgQ": {
    "date": "4/25/2017",
    "text": "Came here at 4pm after a long business meeting and for greeted with a warm welcome by Eva.She proposed the express lunch formula which is priced at £8,90. Good value for the price.I was served quickly a soup of the day, very tasty.Then my main dish arrived quickly too. It was sweet and sour pork with fried egg rice. It was delicious and satisfied my hunger.Eva was very nice and served me with a smile and politeness.I asked for the wifi which was free of access and password-free and fast, which is super convenient !The atmosphere was calm and relaxed. I appreciate the venue and the laid-back impression I had.I finished my meal with a simple vanilla ice-cream.I am pleased by my visit and the quality of the service as well as the food.I thus strongly recommend this place!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aF-P5J5lhI52GC4B6vV1LA"
  },
  "GprVPqVcOxCIa_Ck4Ib3Tw": {
    "date": "10/16/2017",
    "text": "Authentic Singaporean food! I was so excited to find his place online before our London trip- my mother is Singaporean and I've spent my entire life visiting the country and of course, eating the food. Having dinner here was like being transported back to the local hawker center- the only exception was the price (12 pounds de for chicken rice vs 3 dollars in Singapore....but that's London for you). Get the chicken rice and the crispy duck and I'm going back again tomorrow so I'll have more recommendations then!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0RWDoWVw9CyrauBOjwvYug"
  },
  "epzdkKUXQUuwIuuGaibM1Q": {
    "date": "12/6/2014",
    "text": "Boo me, I caught a cold the day prior to coming to London. My taste buds are too numb to enjoy British cuisine, so I sought out the spiciest broth near my hotel. BSB delivered on the spice-level its Spicy Laksa! The first spoonful was spicy enough to induce a cough. But the spiciness was somehow balanced out by the coconut base that I couldn't stop eating. The dish just got better with each spoonful, which says a lot considering the inability to taste anything due to the cold.Service was attentive and quick. I looked around and saw many tantalizing dishes, so I would definitely return.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IduYzlLZoHLQQZ_CRSs7Rw",
        "caption": "Photo of Bugis Street Brasserie - London, United Kingdom. Singapore Laksa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IduYzlLZoHLQQZ_CRSs7Rw/o.jpg"
      }
    ],
    "user_id": "JoJY7SZNUUmTa5t-OG1pfA"
  },
  "hFmKfNW1X4K_0VDZtIbAmA": {
    "date": "1/3/2016",
    "text": "We went and got take out.  The Singapore Laksa opened my stuffy nose, egg fried rice was amazingly full of wok flavor.  Beef with ginger and scallions and special monk vegetables were both very flavorful.  Loved every single dish!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4uQC0dvny22lPEvAG2gZA"
  }
}