{
  "9p6Nys4V1GCJsnSelfOoig": {
    "date": "6/29/2011",
    "text": "I genuinely love the sandwiches from this place, but if you go in at lunch time the service and organisation by the staff is appalling. I've been there several times and watched people who come in after me get their food before me and leave, prompting me to ask where my food is and met with 'what did you order?'. I know i'm not alone in this either as i've seen several people get very angry because of the same situation. If they want to keep doing a storming business they need to sort out their system quickly.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCu2x687lVdI2Wq9WF1UOg"
  },
  "x4Q9-QwUTWgr-Kf_1x6G5g": {
    "date": "4/24/2015",
    "text": "Great banh mi the duck with hoi sin sauce is my favourite and they do a great Vietnamese coffee, 4 stars as they charge you 50p to pay by card under £10 which all the food there is especially for take away.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IIn8jIqe6uDaKm9zOQpkQ"
  },
  "DjbLoyKRmzMjvYE3KAlpcg": {
    "date": "6/20/2011",
    "text": "This place has great and quite indulgent sandwiches with loads of spice. I'm convinced that each sandwich has a full red chilli in it... seeds and all. But for me, that's not necessarily a bad thing. The BBQ mackerel and BBQ pork sandwiches are my favourites. They are hearty meals that will leave you full for hours. Not bad for a fiver. I would have given 4 stars, but a few of the sandwiches are full of fat - in particular the duck and pork belly are 70% fat and 30% meat. I know they tend to be fattier meats, but their ratio is just a joke. If like me you're not a fan of the fatty taste and texture stick with the BBQ sandwich varieties.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "rO91mq7YrMbsz73Ufjt3tg"
  },
  "xGi13Mrve8r-kz7zKk1Y0g": {
    "date": "10/1/2012",
    "text": "I'm bang-on with Lizzie. It's nice. The bread is really nice, and some of the bits are, but for my money bahn mi should be small and fast and packed with flavour while these are big and slow and a bit... underwhelming. The baguette is really nice, though. And the condiments. I suspect that in upsizing the sandwich to justify the £5.50 average price, they've got the balance wrong.Which is a shame. If you're in the hood, hid them up.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "1kGoDje5NBQBSLPkTUQdVA": {
    "date": "9/22/2012",
    "text": "Sort of underwhelming. On the expensive side. Good amount of chilli heat in the Banh Mi, but the balance of flavours in the slightly undersized sandwich felt a little off - a little too hammy and not quite herbal enough with unexpected vegetables seemed mainly to be there to add bulk. That said, the bite of my friend's Kimchi Banh Mi that I had tasted amazing (even if not significantly hotter, despite what the little chilli icons on the menu promised). I like anything with Kimchi, though, so I am not a reliable source.The iced green tea is a nice addition, and very good - but, considering the price and the relative cost of doubling the serving, they could have doubled the serving.So: it's OK and the decor is pleasant but I wouldn't make another detour to get to it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1JdgUuTQPVUygbaBDbPCZA"
  },
  "b8jK86sKGnOmCAcjYUSZxA": {
    "date": "12/12/2011",
    "text": "The classic Banh Mi comprises of a baguette with spiced belly of pork, ham terrine and chicken liver pate. Add in some herbs and sliced chilies, cucumber to add a refreshing balance and you are set! The pate was smooth and creamy and each meat portion were beautifully balanced yet definable. The baguette itself though apparently not exactly the same you get from vietnam according to my Viet friend but was still good enough for me. We were both happy eating away.Pork meatballs and mushroom on rice £5.5We just couldn't resist ordering this too and the meatballs tasted very home made with a tender and soft texture. The duck rolls and prawn salad were satisfying snacks/side",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAVIGAjScXWJ9ViXeJZW6Q"
  },
  "TE-1kLJw5MRFrvYuDSLnJw": {
    "date": "3/13/2013",
    "text": "Very good Bahn Mi. I ordered the Duck option and being a huge Peking Duck obsessor, this protein for me was a gamble in England. The duck meat though was moist, not dry, and flavorful enough for my sandwich. The baguette was nicely toasted and the experience itself was affordable and a nice casual option from a lot of the other restaurants in the area. True to many Vietnamese bahn mi spots in America, the atmosphere was super relaxed for a quick eat, but inviting enough for a sit down to merit a heavier fare. I saw someone eating a grilled fish dish which looked super legit and had me eating with my eyes on the way out. The only drawback is during the busy hours, possibly avoid sitting by the counter because people will bump you as you eat. Bummer.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4M0sVKEh60Gzjb_Jv2n-Ug"
  },
  "BEmrxeWEh2D9WODKDrqwGQ": {
    "date": "3/7/2014",
    "text": "Crispy pork belly sandwich was yummy. Quick and cheap food before u go party to Shoreditch! Very nice staff and interior!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUJFxC-M2R0y81mvM1vumg"
  },
  "--1v8K6GNdiEgR52MoRRPg": {
    "date": "5/23/2013",
    "text": "Amazing BBQ Pork Banh Mi - Lemongrass infused Pork Loin with Daikon and Coriander. Perfectly cooked pork within a perfectly crisped bread (that won't tear your mouth apart). Reasonably priced - remember you are in London and it is a big city, you're not getting the $3 amazing Banh Mi you find in a smaller city somewhere else in the world.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_cYc9EJN1fzV7zwzc6MkA"
  },
  "mz09HnPkjW4Pui7DIYFI7Q": {
    "date": "4/26/2011",
    "text": "From the same group that brought you Cay Tre and Viet Grill, Keu is a most welcome addition to the Vietnamese hotpot that is Old Street. The banh mi classic I had here was amazing with just the right amount of tasty tasty pate. I found the baguette nice and crunchy, in spite of my being there in the evening, when you'd expect bread would have been much harder by then. I tend to find Vietnamese coffee incredibly sweet, even when I've opted for the iced option (which has the effect of diluting the coffee as it melts), but, this wasn't too sweet at all, and, in fact, tasted pretty good. Staff were nice and smiley, and there was a fair amount of seats, as well as assorted copies of The Times for your reading pleasure. I'm definitely coming back. I loved the banh mi and I think it's the best that I've eaten so far (though I haven't been to Vietnam yet, I'll admit).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vt_lIJ3gqZ_Vm4p2fAqMGA"
  },
  "VyTlamXlmt9Ju2fkgbZ__A": {
    "date": "12/12/2011",
    "text": "Pics@Chopstix2Steakniveschopstix2steaknives.blog…The classic Banh Mi comprises of a baguette with spiced belly of pork, ham terrine and chicken liver pate. Add in some herbs and sliced chilies, cucumber to add a refreshing balance and you are set! The pate was smooth and creamy and each meat portion were beautifully balanced yet definable. The baguette itself though apparently not exactly the same you get from vietnam according to my Viet friend but was still good enough for me. We were both happy eating away.Pork meatballs and mushroom on rice £5.5We just couldn't resist ordering this too and the meatballs tasted very home made with a tender and soft texture. The duck rolls and prawn salad were satisfying snacks/sides.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8QKjm8zR5bgu3ruzpDsdgg": {
    "date": "2/20/2012",
    "text": "I have to say, baguettes have ground me down to the point of absolute indifference.  Other than the Steak Americain (baguette stuffed steak hache and chips.  Maybe some token salad too), I find baguettes to be wholly unfulfilling and quite often bland.  However, after recently discovering banh mi (yeah yeah, I'm slow), they're coming back into favour.Keu are in the same stable as Cay Tre and Viet Grill, specialising in these crusty sticks of yum.  In the window of the small shop, next to the stacks of baguettes, hangs a glazed slab of roast pork, something which my eyes just can't help but be fixated by, like cats staring at a pendulum, or Ganondorf at a fishing rod.  The interior of the cafe is cute and modern (basically the opposite of Mien Tay) with a bar-stool type seating.  The menu is concise and simple - I went for the lemongrass BBQ pork.  The baguettes are a decent size and nicely presented, packed full of herbs, cucumber and some potent raw chilli slices.  The banh mi are full of flavour and crunch, and the baguettes are just right - nice and crusty on the outside, soft on the inside but not soggy at all.  My pork was nicely flavoured with a distinct flavour that reminds me of satay marinade.  We also had some cold duck rolls which were fairly big with a generous helping of duck.  I thought the wrapping was a bit on the thick side, but yummy nonetheless.  Only two gripes: one was that one of the servers was a bit rude towards my friend when she ordered a Vietnamese coffee.  Secondly, that although the place opens at 9am, they don't start serving banh mi until lunchtime.  Ok, I'm among a minority who'd eat this sort of thing for breakfast, but at the same time I'd quite like to take one to work with me - I guess they cook the meat in the morning.  They're also closed on Sundays.I'm quite happy to shell out £5 for a banh mi and I am seriously conflicted: if they had one in South Ken, I'd get one for lunch most days.  On the other hand, that'd deplete my bank account in record time.  In any case, these days I'm just a little bit sadder when I sit down to lunch with my soggy, limp, bland, £2.01 Imperial College baguette.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "j7_FGnfY_rI4A2PFLZbkgw"
  },
  "wpCVoX4gkoztDTQIY4JdSg": {
    "date": "6/23/2011",
    "text": "3.5*If your seriously having an itch for Asian Vietnamese food, and some how want to try a Vietnamese sandwich this place ain't so bad...The sandwiches is probably as authentic as it comes in the U.K. I tried they banh mi which had all the flavors of a Vietnamese sandwich, the pork (a little fatty), cilantro, carrots, white daikon, and pate.. A modern look to the place in the hip Hoxton neighborhood.8 pounds for a sandwich.. it is a little pricey for my taste for a Vietnamese sandwich.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mb-LDBHBVIS1k8nsQJsOvA"
  },
  "MjIrwiPlbv3ji0aVlohvcQ": {
    "date": "9/15/2011",
    "text": "Cheap and cheerful lunch but not the food highlight I had hoped for especially after reading the previous reviews. It's definitely a nice addition to East End's Vietnam Town with its contemporary, slick interior but my BBQ chicken banh mi didn't convince me. Maybe I should have tried the mackerel one instead.maybe next time.",
    "rating": 3.0,
    "rated": {},
    "photos": [
      {
        "img_id": "8Wlxs1FlA5VmeTpaa1lpww",
        "caption": "Photo of Keu! - London, United Kingdom. BBQ Chicken Banh Mi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8Wlxs1FlA5VmeTpaa1lpww/o.jpg"
      }
    ],
    "user_id": null
  },
  "a-8cEbt6kY4ZLsQeOO9WRw": {
    "date": "4/18/2011",
    "text": "Like Cay Tre (or London-style Vietnamese food in general) but strapped for time at lunch? Cross Old Street and visit the latest venture from Hugh Trung Bui (of Cye Tre and Viet Grill fame) - Kêu Banh Mi Deli! Specialising in banh mi (Vietnamese baguette sandwiches), Kêu offers a delicious variety of moreish sandwiches and Southeast Asian street food options for a quick dine in or takeaway. I LOVED the Kêu Sandwich (classic): the bread was actually gorgeous (good enough to rave about on its own) and the filling of spiced pork belly, ham terrine and chicken liver pate, fresh herbs and mayo will have me queuing up again to drop a very reasonable £4.50 to get stuffed again. There's a good range of drinks, lunch boxes, salads and soups. The setting is simple but attractive and comfortable enough. Solid, affordable, delicious lunch (so, yeah, expect to wait behind other folks with the same cravings if you go round lunchtime)  this place is a winner and a very welcome addition to the Shoreditch Vietnamese restaurant scene.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "zAFq7FpDkJWDLnS8phIznw": {
    "date": "11/19/2012",
    "text": "This first time I had bahn mi at Keu was the first time I'd had bahn mi ever, and I thought it was amazing. Unfortunately, on my two return trips to Keu I was never quite satisfied the way I was originally. For the record the sandwiches are quite small for how expensive they are. I've tried both the orignal and the duck bahn mi. I'm not a fan of coriander/cilantro though, so maybe bahn mi and I were just not meant to be.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lK_32lYJ-p_fjc01G-DPLw"
  },
  "__FvloOOmaOrYMv8VmkiuA": {
    "date": "9/23/2011",
    "text": "Tried the BBQ mackerel lunch box. Delicious fish - looked like it had been marinated in something quite tasty. Not bone-free, but mackerel bones aren't too hard to deal with. If getting a lunch box to take away, I'd recommend bringing a plastic bag - the juices from the non-rice portion will leak out and eventually cause the bottom of the supplied paper bag to go soggy and eventually break off. Be warned that they're a bit more expensive than advertised on the website or on the printed menu (seems to be an extra 50p on everything). Staff aren't particularly friendly or polite, but are efficient and professional.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rGh9qla05uWguZpB-stUSQ"
  },
  "XrmeeLcaV-6FQSTRgld0Pw": {
    "date": "9/6/2011",
    "text": "Honestly the best sandwich I've had in London (so far....) and far and away the best classic Bahn Mi. Crisp, fresh bread with the classic fatty, spicy, fragrant bahn mi ingredient mix. I was shocked how much I liked it. I'm a bit confused with some of the reviews claiming it to be £8 a sandwich, I paid £5 only a month or so ago. Annoying 50p card charge.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oOZ2iyQD78fjmAhgAgx4aA"
  },
  "fQjPmlZ_yPjH8AEmbRHyGA": {
    "date": "10/27/2011",
    "text": "Delicious, fantastic bread and pate. Good for when you don't want or have time for a meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "7uq7p9U--uFWXzOORNLMlA": {
    "date": "9/14/2011",
    "text": "Possibly my new favourite place for lunch, a sort of Asian fast food place - I am hoping that by not going there too much I won't get too sick of the food as I really do like it. The queues can look daunting but don't last for too long.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "64jGuqiwXwqZrucBkRZGaw"
  },
  "FOEPMLv0iLnHnkgyVU0c9Q": {
    "date": "6/26/2011",
    "text": "I know Banh Mi and that was pretty damn good! I'm just waiting to get hungry again and I'll be out my door.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PhsLvUn-bmnenPzbbtqLpw": {
    "date": "8/24/2013",
    "text": "Everyone comes here for the lovely Bahn Mi, but what they're really good at too is the Mixed Roast with Rice. Takeaway nets you more lovely Roast Duck, Pork Belly and Barbecue Pork with Pak Choi and rice. For some reason, eating in I always seemed to get a smaller portion. The chilli oil and Hoi Sin sauce are given in little pots and I always make the effort to ask for more which the staff are usually happy to oblige.The Bahn Mi is very good. Crispy baguette, lots of tasty salad and your choice of mackerel, pork belly, barbecue pork, duck and more. Finally the hot vietnamese coffee is served nicely in a special pot and tastes divine. There are many Vietnamese restaurants in Shoreditch and Keu is actually owned by the same people that run Cay Tre and Viet Grill, but it's testament to the diversity of each business that each offers something unique and Keu is no exception.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ozWtskydOMDOdk_g4-hOpg",
        "caption": "Photo of Keu! - London, United Kingdom. Mixed Roast w/ Rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ozWtskydOMDOdk_g4-hOpg/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "xe03csG7_3TIGQlXYtM84A": {
    "date": "2/28/2015",
    "text": "Only tried the roasted spicy duck bahn mi from here but seeing as it's the first bahn mi iv ever tried it was really tasty! Spicy though! And I can usually handle my spice.Not too £ at £6 either. My girlfriend had the roast spicy duck with hoisin gravy on rice and has been raving about it since.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9kSt9w85DtOnG8lKa_pWw"
  },
  "7137S8hu69rkewPruvqFHQ": {
    "date": "10/9/2014",
    "text": "I've been to most of the bánh mì places in the area, and this is definitely my favourite. The bread is crisp and the fillings are very tasty.  My favourite sandwich they do is the classic, which contains three types of pork.Keu! can get fairly busy at lunchtime, so be prepared to queue.  There also isn't a lot of room to sit down, but I'm fine with that, as I prefer to eat sandwiches on the move anyway.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "jkD0eejAIYjqiAbWw8BzMA"
  },
  "t9McVEuyCzY1cJHF-RM42Q": {
    "date": "8/24/2015",
    "text": "I'm spoiled here because I can get super good Vietnamese food at half the price of this place.  However, for London, this place is pretty good.  Most items are under 10 pounds.  I find it overpriced for Vietnamese food, but for London, I guess you take what you can get.  I had a pork belly sandwich, which was very tasty and highly recommended.  I just wish it was bigger.",
    "rating": 4.0,
    "rated": {
      "useful": 14,
      "funny": 10,
      "cool": 14
    },
    "photos": [],
    "user_id": "rBBQbHErcvNH916VHw0gZA"
  },
  "_Na_dS3Oijv-Dw06z8nL3Q": {
    "date": "5/20/2015",
    "text": "Cute cafe that serves fresh and tasty banh mi. The crisp fresh roll and the soft fresh ingredients work perfectly together.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "THHCq7klVhYwN4hmk7odhA",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/THHCq7klVhYwN4hmk7odhA/o.jpg"
      },
      {
        "img_id": "05i1V6WSGoLCGbteMis38g",
        "caption": "Photo of Keu! - London, United Kingdom. Keu Classic. 6",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/05i1V6WSGoLCGbteMis38g/o.jpg"
      }
    ],
    "user_id": "QEkKx-WuA7SwecFZWYxfGw"
  },
  "LM4uxAWjxkQSih_bLsuzqQ": {
    "date": "7/9/2014",
    "text": "Come here if you want delicious Viet banh mi with fillings like:Kimchi BBQ PorkXiu Mai MeatballsCrispy Pork BellySpicy Roast DuckBaguettes are £5.95Box (With Jasmine Rice) £7.50The waitstaff are slightly... stroppy... But the food is delicious and cheap.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hZvqiJAlWH9i1W1MUUpw1w"
  },
  "RHCgwnNXYgyby4WVSgBq_g": {
    "date": "8/7/2015",
    "text": "Stop of here to grab a takeaway baguette that all your colleagues back in the office will be jealous of. Quick service, warmed baguettes, great toppings to chose from and to top it all of when you take your first bite you realise how fresh the flavours are. Just be warned if you go for the ones with the chilli sign you will get chopped whole chillies which can be a bit of a shock if you're not expecting it. (Visit - 18/06/2015 Takeaway)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3QkozspSmuLnqHf6ZyFsg"
  },
  "ivL6uOKlCxjwYAN-lL39JA": {
    "date": "3/10/2014",
    "text": "I went there with a friend for a quick lunch, hoping to find a really nice place. We found a couple of good seats in the front of the restaurant. We took a look at the menu written on the board and we were ready to order. We wanted to try a couple of mains and duck rolls to share. Well, what can I say when we tried to place my order? the waitress was in another world. She made a mistake with the order twice, she forgot to order the rolls (and she didn't do anything about that later, not even apologize). So we had to order again. I never had this kind of experience with a waiter/waitress before (and I had been myself waitress for a couple of years!). It was unbelievable.We got our food (finally). The duck rolls were OK, a little bit salty, but tasty enough. I ordered 'Chicken Katsu with new potatoes and lemongrass'. Not a big deal really. I had it better, but I was really hungry so I didn't complain. My friend ordered 'Roast Meats' (served with roast duck, crispy pork belly and char siu roast pork with seasonal steamed greens on rice). Apparently, it was better than mine (she was really happy with it!). Maybe I should have tried the famous 'Banh Mi' (Vietnamese baguette), but I'm not really sure if it will be a next time.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DGoywFBFTa0QK35X4plszQ"
  },
  "WxnLle9RuKpjvU9uT2maxg": {
    "date": "7/18/2015",
    "text": "Terrible service, was not patient and order took very long , price is average and portions are very tiny, would not recommend",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LTa9hbtIj5ExVK2VaQcIRg"
  },
  "QTFerfpiIgYHGCPI2LDRoQ": {
    "date": "5/5/2015",
    "text": "All of the dishes are amazing. So fresh and a huge range. I have had a number of their dishes and will always be a customer. The sandwiches are by far the best - the kinchee pork is probably one of the best sandwiches I have ever had.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GTAD8FkDuGsSesTwFTzDQA"
  },
  "riVipi49i5kndhIn3svhpg": {
    "date": "5/19/2011",
    "text": "Cute shop! They sell a variety of Vietnamese dry goods as well, such as ramen and viet mayo and such.I had a Char Siu bahn mi... it was really good. The pork was sweet, salty and just enough fatty (I don't like too much fat). The hot peppers had a LOT of kick, so I took one out, then it was perfect! Crusty, but not too hard baguette, crunchy daikon and cucumber, succulent meat, some chilli heat, and corriander = a really tasty bahn mi! If you work or live in the area, definitely check this place out. There have some seats, but this place is mostly take-away. Cash only!!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "98mfriiONVfcA4OgjWsjww",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/98mfriiONVfcA4OgjWsjww/o.jpg"
      }
    ],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "n8XIhRs5YWTN2b3KXpPIdg": {
    "date": "5/12/2013",
    "text": "A lot of the reviews here were pretty circumspect but I actually thought the sandwich was pretty good. The bread in particular was crisp and fresh. I got the pork/kimchi combo and although bbq and kimchi isn't a perfect taste combination I did enjoy their separate deliciousness, although what is kimchi doing in a Vietnamese sandwich in the first place?. My friend had her first Vietnamese sandwich experience here, she was somewhat dubious but was back for more within a week so I'm glad to have secured another convert!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "ktftKuS0OzM96SHSFemUMw": {
    "date": "2/4/2015",
    "text": "This is my place for when I need duck in my belly.  Both the duck banh mi and lunch box are good - the lunch box will fill you up and the baguettes are wonderful.  But their claim to a \"spicy\" duck is laughable as I needed to add Sriracha sauce to turn up the heat.  I guess \"spicy\" means adding a few bits of red chili (not good enough).  Their spring rolls are decent and the steamed pork bun filling could be better (looked like a bit of sausage mixed with some veg on the inside).  Apart from the slight negatives, it is still a good place to eat and they have some friendly staff.  Give it a go if you're in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gi7oIXPo35sjj0R_ssL_Hg"
  },
  "nWFY-ZWjP3NCL2AcL7uinw": {
    "date": "5/24/2011",
    "text": "I've never been to Vietnam, but in London it's still possible to consume a lot of bahn mi and Viet iced coffee. So for London, I think I'm quite the expert. I liked Kêu! Their shop is so sleek and cute with a great seating area and a very colourful menu. The service can't be faulted but... and this is a big BUT, when it comes to their food I've had better.The pork bahn mi (the classic I always try to go for first) was really fatty and lacking in real chilli. I loved their pickled veg and the bread was nice but seemed less fresh than other places I've had. Also, they weren't very generous with the coriander. Never a good start. Saying that, I did enjoy it and as the surroundings are so lovely I'll probably will be back. They also have a really extensive menu so I really want to try the other yummies on the menu.They dod breakfast sarnies which I can't wait to go back and try and I think they'd be a lovely quick dinner spot in the area. It was a little pricey, but now that bahn mi is all the rage, I suppose that's expected, £7+ for a sarnie and coffee.As for the coffee, I asked for it in a certain way, 'strong and sweet' - this means it should have a lovely mocha colour with ice cubes bobbing in the top. Here it was a little to dairy for me, more like my skin on a beach in Malta, whitey-beige. Still nice and refreshing but I've had a lot better in London. Keep up the good work Kêu! you're getting there.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Wi9t3BsIgWSDdCgzoBPEUg",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wi9t3BsIgWSDdCgzoBPEUg/o.jpg"
      },
      {
        "img_id": "sjOhwBiztrTXjVqIHcmQZw",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sjOhwBiztrTXjVqIHcmQZw/o.jpg"
      },
      {
        "img_id": "gmntvyjUm4szeDnPtngUqQ",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gmntvyjUm4szeDnPtngUqQ/o.jpg"
      }
    ],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "RudMNgLYVX4I--WI1xGaUg": {
    "date": "6/21/2015",
    "text": "A new Banh Mi to the Shoredtich scene this is a good stop off to enjoy some Vietnamese. Nice bread which is essential for this type of food; Crispy yet soft. I would definitely go back for a quick bite, if I'm passing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "ChICcG1uM3Cdsjwz7PothA": {
    "date": "3/29/2011",
    "text": "Just got back from lunch here and am wanting to go back!  The Banh Mi sandwiches are so freakin' tasty!  The baguette squishes seductively in your mouth and is full of luscious meat, coriander, peppers, and yum all over.  The smoothies are also awesome, spring rolls are nice n big, and duck on rice came with plenty of foul, veg and rice.  Fantastic flavors, friendly staff, cheap prices, quick service and sitting areas if you want to eat in.  Sitting by the large front window for people watching is always great in Shoreditch, and they have some newspapers if you feel like educating yourself during lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wD3hIUG8NUbHM11QaY7eAA",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wD3hIUG8NUbHM11QaY7eAA/o.jpg"
      },
      {
        "img_id": "0TgsNAd210Z-HquqWSpKFg",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0TgsNAd210Z-HquqWSpKFg/o.jpg"
      },
      {
        "img_id": "UFmo1INyld70pTp_eIgPoA",
        "caption": "Photo of Keu! - London, United Kingdom. avocado smoothie, prawn spring roll, duck banh mi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UFmo1INyld70pTp_eIgPoA/o.jpg"
      }
    ],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "YWEgfGR5Lx6ICVzm5OBDNg": {
    "date": "12/16/2013",
    "text": "Got the classic Keu. The bread and the ingredients in the sandwich were high quality-  I could tell that the meat, herbs and veg were all decent.Like other people noted, the Bahn Mi is under-seasoned. I like sandwiches with big flavours that push umami and saltiness to the edge. So to armchair chef (cuz it's Yelp), I think the vegetables need to be pickled slightly longer and I'd up the amount of fish sauce or nuoc mam sprinkled on the sandwich. I'll will likely go back since I want to try a few other menu items. Most likely in the the long run I'll stick to making my own bahn mi when I can (try the Momufuku cookbook recipe for a good one). I will however copy the bread used by Keu! as I thought it worked really well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "answ6V84iLiZSHxTlv87Hg"
  },
  "sGqtwETPu7I3WXDtToof_Q": {
    "date": "4/20/2015",
    "text": "My boss and several coworkers head to this deli for takeaway several times a week, and rave about the deliciousness of their meal every time so I finally caved and bought myself a Roasted Spicy Duck Bahn Mi for lunch. I've personally been weary about trying Bahn Mi in the past; the Chicken Liver pâté in the classic version putting me off entirely. It was nice to see that there was variety of the menu at this location. The sandwich itself was tasty, although I don't understand the obsession or the reasoning behind the queue going out the door at lunch hour. kêu! can definitely take credit for delicious small baguettes that are crispy on the outside and soft on the inside - I had no issue biting into mine and not coming away with a mouth full of cuts because of the hard texture. The filling though, it wasn't anything to write home about. I am a fan of duck, and it is normally a delicious addition to any sandwich, and it did blend well with the pickled veg and chilli included (don't worry, the fattiness of the meat and other vegetables, as well as the heartiness of the bread made the heat completely bearable for even someone who normally avoids chilli like myself), but it's really just a nice sandwich when it comes down to it. Better than your average mayo filled alternative from Tesco any day, but not as special as the many other asian-inspired dishes in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FlesiwNEKeZT-e4Q_ekMRA"
  },
  "mfONLGNW22Q_qntqIiaxKw": {
    "date": "7/16/2016",
    "text": "I would give Keu! 2.5 stars. I had the banh mi spicy duck and it was good, but nowhere near as good as ones I've had in Canada or Vietnam. Based on other people's reviews on yelp, I think my expectations were too high. The iced Vietnamese coffee tasted blah, like they made it from powder. The coffee came out pretty fast so maybe since they were closing(?) they served me old coffee, but when I pay 3.50 for a coffee I expected more. Disappointing. The staff were pleasant enough however.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUhSJ0xsxqXfgC7uxD7GRw"
  },
  "msN7X61Hm9DMjD1j4aotgQ": {
    "date": "6/23/2011",
    "text": "Frou frou vietnamese sandwich place. It's modernly designed so I guess you pay the price for it. It's prolly 8 pounds for a sandwich. Yikes! I love my Banh Mis so this was a great find even tho it was kinda pricey.Bonus points for letting me add an egg to my Banh Mi. haha",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I15P2Qb7ijw7g3Eim1OCdQ",
        "caption": "Photo of Keu! - London, United Kingdom. Classic with egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I15P2Qb7ijw7g3Eim1OCdQ/o.jpg"
      },
      {
        "img_id": "EKw_iUq0qZZDzHsT12mCdQ",
        "caption": "Photo of Keu! - London, United Kingdom. Summer rolls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EKw_iUq0qZZDzHsT12mCdQ/o.jpg"
      },
      {
        "img_id": "rodF4Y4jcknevTssIyc2PA",
        "caption": "Photo of Keu! - London, United Kingdom. Banh mi special",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rodF4Y4jcknevTssIyc2PA/o.jpg"
      }
    ],
    "user_id": "fiAtggeGGinY6UnHI75NcQ"
  },
  "sDPoywuAgs6xgvX6xmqUvA": {
    "date": "11/10/2018",
    "text": "If you're looking for an upscale street food place, look no further... this is it! Easily located and just five mins walk from Old Street Station. I ordered their lemongrass curry chicken rice yesterday for lunch. The serve a rather generous bowl and best of all, the sauce on the rice was generous. Ideal for a wet drilly day! The food came piping hot and the chicken came in huge soft chunks. It's order at the till. Don't be surprize that you don't get a smile but a straight face. The person I ordered from was indifferent but hey... I was looking for fast easy and hot piping food. I found it here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d_1y__VcSCUGtdoi7I5Htw",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d_1y__VcSCUGtdoi7I5Htw/o.jpg"
      }
    ],
    "user_id": "HUZJUBf45tCTTFn3BGn6fw"
  },
  "9sU8il3S_9fuhye41s9HHQ": {
    "date": "8/4/2018",
    "text": "The veggie banh mi with aubergine and tofu is the bomb. Note that the website prices are not up to date.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "yn8V5dSJfyFFRq-QALpbdg": {
    "date": "9/4/2017",
    "text": "One of my favorites in London and now I know why they got great reviews. I came here for lunch because I read some of reviews. It's just across from Holiday Inn. The moment I walked in the smell of the food was so tempting (I think thy tried to hurt me lol!). It's a small place, mostly take outs but you can also sit by the window facing the street. What you do is You order at the counter and wait. I ordered chicken curry over rice. I was quite concern about my allergies so I wanted to make sure no almond. The girl who took my order was so sweet. She wanted to make sure I could eat the dish so she and I agreed to have very little gravy on my rice. I almost fainted after trying my dish. So surreal because it was so damn good. Order this if you like chicken and curry. The chicken is the tender. The gravy is to die for! I liked!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tkm5W_U8jif9rMhalxqVxw",
        "caption": "Photo of Keu! - London, United Kingdom. By the window",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tkm5W_U8jif9rMhalxqVxw/o.jpg"
      },
      {
        "img_id": "i-o89DOIGOo-bYYnwWIJRA",
        "caption": "Photo of Keu! - London, United Kingdom. Sauces and spices corner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i-o89DOIGOo-bYYnwWIJRA/o.jpg"
      },
      {
        "img_id": "zrcCjyMT-4H6T-FRraltSw",
        "caption": "Photo of Keu! - London, United Kingdom. Order here",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zrcCjyMT-4H6T-FRraltSw/o.jpg"
      }
    ],
    "user_id": "0SpK7eVn5TrpyQKPaohVBw"
  },
  "vfBkyJoU2JqQmyemroJ9Rg": {
    "date": "10/23/2016",
    "text": "Been here a couple of times for takeaway (the placr has limited seating), once for the lemongrass chicken curry bowl, and a second for the roast pork belly rice box and pork bun. Curry was ok, roast pork was good, but nothing super special, comes with plain white rice and a few bits of green. A little underwhelming, not too sure what the fuss is about? Nice friendly staff though, always a huge line at lunch but you get your food quick.. Which is also a little on the off side for me.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QNgx5WZkXoJ3AhvBSg_YJA",
        "caption": "Photo of Keu! - London, United Kingdom. Lemongrass chicken curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QNgx5WZkXoJ3AhvBSg_YJA/o.jpg"
      }
    ],
    "user_id": "Rhkv-27rPZHQzK_ZYhd3rQ"
  },
  "Lze9FuLuaXEsrIjBUpX8sw": {
    "date": "10/3/2016",
    "text": "The Classic Sandwich is the bomb diggity.So good that I've already had it twice during my 2 week visit here, and will probably grab another one for my plane ride home!To help establish some street (yelp) cred for reviewing Vietnamese food, I am Vietnamese from California, living very close to Little Saigon in Orange County. The baguette is different from the type of bread I am used to, but this bread was really good anyway. I was also a little skeptical about the Japanese mayo used, but it served as a very good substitute for the typical homemade Vietnamese mayo for Banh Mi's. Overall, it had some slight modifications from traditional ingredients but it worked out beautifully.Would definitely recommend for everyone to try the Classic if you're into it.(Also had Iced Vietnamese Coffee and the Chicken Ginseng Soup. Both were good, but not mind blowing.)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IbWOZxOZaUeqPRMA4Uha1g",
        "caption": "Photo of Keu! - London, United Kingdom. Classic Sandwich, this picture doesn't do it justice.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IbWOZxOZaUeqPRMA4Uha1g/o.jpg"
      }
    ],
    "user_id": "UrytaMBBEOu8a-FH-M0dTA"
  },
  "6gFdtj-7LdV9jbnpa91AlA": {
    "date": "3/1/2017",
    "text": "I always come here when I'm in uni because its just around the corner. There is always a queue within work days around lunch time. Its great for some quick takeaway for lunch if you want some warm food. I always the Roast Mix + Jasmine rice lunchbox. The rice here is actually really good. My friend told me the beef one is also great. I would doubt it if you say it is a  Vieanames restaurant tho because the roast mix is definitely cantonese. But for the price I think its pretty great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y1dqCblQiZCyGpuDZboteg"
  },
  "wdkF2PuaCPoSBzKVaRVStg": {
    "date": "2/20/2015",
    "text": "I have to admit that this wasn't my first choice, but Cay Tre across the road was packed with 15 minutes waiting times and the place next to it just looked too noisy.  In that sense Keu was perfect as it was nice and quiet to give my voice a bit of a rest - it was possible to have a chat in a hoarse whisper.It's positioned at the fast food end of the scale and you order at the bar from a menu of sandwiches, salads and soups.  My friend and I both opted for the Ginseng Chicken soup which was nice and warm but unexciting.Keu is probably more of a winner at lunchtime, the sandwiches actually sounded quite good.  We were the last to leave but happy not to be rushed despite having placed this very small order only.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AaB9EcQUI4KUDZB8-gdbqg",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AaB9EcQUI4KUDZB8-gdbqg/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "eBfmWCdBcVWkEyNAQOQCSA": {
    "date": "8/9/2015",
    "text": "Solid banh mi dac biet!Definitely my favorite banh mi in London. Crisp, light baguette with delicious meaty fillings. I've tried the roast pork belly and the classic, and the classic is the clear winner. They ask you if you want chilis on your sandwich, but beware as these chilis are spicy! Classic banh mi, vietnamese iced coffee, and bottles of ORIGINAL Huy Fong sriracha on the table. Only thing that would make me happier is if 1) they extended their delivery range on Deliveroo, and 2) wrapped my banh mi in wax paper with a rubber band for nostalgia.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fq9zByPqq-qWY2PB2Gp9xw",
        "caption": "Photo of Keu! - London, United Kingdom. Banh Mi Classic",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fq9zByPqq-qWY2PB2Gp9xw/o.jpg"
      }
    ],
    "user_id": "6hXxFDDcIVrYUWKkYpOnUw"
  },
  "MxjpGloXHpMfU0dFc2V8yA": {
    "date": "6/20/2016",
    "text": "Solid yes! The beef brisket banh mi is tasty stuff indeed, friends. My partner's duck banh mi wasn't quite the standout, so it's clearly hit-or-miss based on personal preferences.A single sandwich is enough to leave you satisfied, but not quite stuffed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ctrp5IoEKHkixDSIyYHDpw"
  },
  "xFgKP123IZDGAmBfTtQzdQ": {
    "date": "4/20/2013",
    "text": "It does not surprise me that Keu & Cay Tre are the same institution. Why? Because they are both kinda 3-stars. Super average, tough totally AOK. All of the right elements (service, hot food, clean, fast), but are lacking that extra little sumpin' sumpin'.So, no 4th, or even 5th star. Why? The flavor. Everything I've had at Cay Tre is pretty bland (separate review to follow, of course). I thought Keu might be a bit different (bahn mi -- so easy! so fresh! so much flavor!), so last night we popped in for a few sandwiches, a steamed pork bun and some duck summer rolls, ginger beer and a VIet Iced Coffee. The Iced Coffee was the best out of the bunch! First, 1.50 for the Steamed Pork Bun is am abomination. It was falling apart, really small, and really boring. 50p max for the quality, max. The duck summer rolls were AOK. Nothing special, but the dipping sauce good. No issues there. I had the kimchi BBQ pork bahn mi, and he had the Roast Duck. Mine was annoying in that the meat in a banh mi sandwich should be shredded so it doesn't all fall out while you are chewing through the baguette. Mistake 1. Mistake 2: between the strong flavor of kimchi and BBQ pork, it somehow resulted in zero flavor. I'm not even sure how this is possible, but it is. My pal-husband-friend agreed on his. All in all, filling -- but not overly exciting or something where I'd be rushing back. Almost felt like fast food or something... So there you have it. Will try to check out Banh Mi 11 next time we've got a craving and see how that goes, but I'll probably be ending my lukewarm love affair with Cay Tre/Keu after last night. Just so blah. Except for a Viet coffee...except for that. Yum.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "DvnIJApYK9SdHV1oSiHweg",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DvnIJApYK9SdHV1oSiHweg/o.jpg"
      },
      {
        "img_id": "3JWO0vSS1RWdB8-k5X3z3w",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3JWO0vSS1RWdB8-k5X3z3w/o.jpg"
      }
    ],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "ofVRlTEY84AEDPz-uQnrxg": {
    "date": "2/8/2015",
    "text": "Best Banh Mi in London! The classic and roast duck Banh Mi are simply divine and they serve a great Vietnamese coffee to boot, also.Been here a few times and always leave satisfied. Would definitely recommend if you're in the area. A+",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "aDLOzw1kUSvoH1HKposC9g",
        "caption": "Photo of Keu! - London, United Kingdom. Roast Duck Bahn Mi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aDLOzw1kUSvoH1HKposC9g/o.jpg"
      }
    ],
    "user_id": "d-9A0tSj28QIeEodB8tu3A"
  },
  "roYnhMf0EeRqUdLw6c4Wgw": {
    "date": "3/12/2013",
    "text": "Really great crispy fresh bread and tasty fillings. A bit overpriced for me as I am used to giant banh mi's 2-3 dollars back in the states but overall a decent sandwich if you are in the area. BBQ PorkLemongrass infused Pork Loin with Daikon and Coriander",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KMMPRGY0Igo769aSShbxxA",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KMMPRGY0Igo769aSShbxxA/o.jpg"
      }
    ],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "z4f8BKLxGfwl2SzergHIYQ": {
    "date": "7/14/2015",
    "text": "Kêu is THE place for lunch in Old St. I go here way more than I care to admit, but I simply can't resist the sweet sweet smell of banh mi. The fillings are well considered, bursting with flavour, and very generous portions! I'm a particular fan of the Kimchi BBQ pork, which has a fantastic sweet&sour spicy kick, but every single baguette I've eaten here has been mouthwateringly delicious. The salad, buns and summer rolls are also a delight. The staff are so sweet and smiley, and super quick. The only slight negatives; the salads could do with being a little big bigger, and some gluten free baguettes would be a real bonus. Otherwise, YUM!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "W41-ZkAIjOTx_ftYMdUAUw"
  },
  "GLQFdDPbO_J27clilst9eQ": {
    "date": "2/3/2016",
    "text": "I really enjoyed eating here. A lovely eatery with a great menu choice. My first banh mhi - I had the spicy roast duck which was soo good. I struggled to finish it but had to eat it it was that good. The staff were a little miserable. I also took back some shrimp summer rolls - I don't like mint so didn't enjoy them  I also tried the pork bun which was yum. Love trying new foods. Would return to try something else.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OJ3Ano_cH_daKat08KAoOw",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OJ3Ano_cH_daKat08KAoOw/o.jpg"
      },
      {
        "img_id": "ta3B2IjTiUMCe604i1jGPQ",
        "caption": "Photo of Keu! - London, United Kingdom. Spicy Roast Duck Bahn Mhi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ta3B2IjTiUMCe604i1jGPQ/o.jpg"
      },
      {
        "img_id": "A3otZkc--DkuM1DrZkQuag",
        "caption": "Photo of Keu! - London, United Kingdom. Shrimp summer roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A3otZkc--DkuM1DrZkQuag/o.jpg"
      }
    ],
    "user_id": "Ntw9EXjF8TAZNtqBbDp4aw"
  },
  "Ms25ZDEvDToMPwkxVYvg8g": {
    "date": "12/18/2015",
    "text": "Love Banh Mi here so much. The only difference between here and Vietnam is the price! About 10 times haha. Anyway, banh mi is excellent, Hu tieu My Tho is decent! 5 for food and 2 stars for service. Not very welcome staff well I guess that what it's like in most Chinese and Vietnamese restaurants",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wIG0ohXERM3FNEeYYangug",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wIG0ohXERM3FNEeYYangug/o.jpg"
      },
      {
        "img_id": "NvkEg-iiJ1PITV3zOpDZhw",
        "caption": "Photo of Keu! - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NvkEg-iiJ1PITV3zOpDZhw/o.jpg"
      }
    ],
    "user_id": "xZJ8yCEqm4xdjWks3SPtsw"
  },
  "zhRfgmimlhIOQr4d4wQBMA": {
    "date": "7/30/2015",
    "text": "This part of Shoreditch is full of cool hipster coffee shops and unusual ethnic food. This is more of a café than a restaurant with a day time crowd and decent WiFi.The first time I came here they had run out of the veggie banh mi. The second time I had more luck.For £5.95 I got a smokey aubergine and tofu bang mi. The bread was French rather than. Vietnamese, small as you would expect from London offerings, but definitely too small given the price. Call it a baguette and you charge £2-3. Once it becomes a banh mi it can almost double in price. Sounds like some good business strategy right there. It was tasty but I did leave feeling somewhat hungry still and slightly poorer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "MeyfCYCJaF17odVBtMtl3A": {
    "date": "11/3/2011",
    "text": "I have a thing for Vietnamese food. Something about the contrast in flavors.Great Banh Mi, the bread was really crisp, almost too crisp for me but the radishes and carrots that offset the duck was great.  No mayo needed.Coffee was a little weak for Vietnamese coffee standards.  Small, hip deli, sold japanese mayo and these things yelp.co.uk/biz_photos/5k….  They have them in itty bitty containers on the counter for 1.50 but really why bother.  Get the whole bag for 3.50. It's totally worth it!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P317L9erBYWSaBC__evA8w",
        "caption": "Photo of Keu! - London, United Kingdom. Must try",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P317L9erBYWSaBC__evA8w/o.jpg"
      },
      {
        "img_id": "x6izePBPlBY_L2ABn8oD2g",
        "caption": "Photo of Keu! - London, United Kingdom. Spicy Duck Banh Mi and Iced Coffee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x6izePBPlBY_L2ABn8oD2g/o.jpg"
      }
    ],
    "user_id": "dsu43n2DOR_pB07P1sOOZg"
  },
  "JMLvRQ_h4qwpOvBG-SYqBA": {
    "date": "8/25/2015",
    "text": "I'm not expert on banh mi but this one is definitely worth a go. I went for the chicken curry option which packed a bit of a kick but was tasty enough to work my way through. One word of warning is that they love coriander in here so if you like me, you aren't it's biggest fan maybe ask them to go easy.The biggest downside was the value for money. I don't know how well it compares to the rest of the Vietnamese around Old St\\Shoreditch but I was left wanting a little bit more for my money as I was still hungry afterwards. Could be that I'm greedy but just be aware!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfM4mH3T3xJspJfOGbJIsQ"
  },
  "XcQbQAl0clmf44fvYPGPIQ": {
    "date": "7/5/2015",
    "text": "Keu is the only bahn mi I trust in London....the classic sandwich is hands down one of the best sandwiches I've ever had - and I'm from the States. The flavours in all of their sandwiches tie together so perfectly, and they are careful not to overdo any one taste. 4 stars because I personally like my baguettes just a little bit softer. There are tables with a sharp looking decor, but no table service. Perfect spot for a quick and cheap lunch if you're making your way around Shoreditch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YgGitxw83IQLfrI-CwIaw"
  },
  "70yJz-t55BUUDWhNXDGT6w": {
    "date": "1/8/2016",
    "text": "Delicious Bahn Mi (I had the classic one) and friendly service. Will definitely come back for more!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6hVGwtNetpgdMSgOgv8PWQ"
  }
}