{
  "2j3t13d59Gynj5mDzHdH4g": {
    "date": "7/5/2010",
    "text": "i love the macaroni cheese, i had a rather nice bacon cheese burger with fries. I was not however impressed with the kids meal, the burgers were tinythey get 2 burgers and chips but the patty was the size of a 50p piece so if your child is over 4 this would not be enough to fill them. It was rather bust the day we went so waited nearly 30 mins for our meal which made for unhappy hungry kids",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mM07xgAXjHnaj-TAvEZybA": {
    "date": "8/6/2012",
    "text": "Excellent burgers, service and value and possibly the best olives in town",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KwHh_wo6Wv4f3tinnEygUQ"
  },
  "3K0Ce6pWixX86_L2mCeDUw": {
    "date": "2/15/2010",
    "text": "After reading all these glowing reviews, I felt like I had to try out Byron when in need of a Soho based dinner last week. As it happens I ended up going twice in a week! First time round I had a cheese burger, chips and an oreo milkshake (hello my diet!). The shake was amazing - just like an Ed's oreo shake and served in a metal pourer in a similar style. I think it was even bigger though. When the burger arrived I was a little disappointed at it's size, but it more than filled me up. It just looks a little small in comparison to other burger joints that have sprung up around the last couple of years. It was tasty, but not mindblowing. Then I returned and tried the chicken burger. This is a whole new level. Marinated and freshly grilled this is probably the best chicken burger I've had in a very long time. It even felt quite healthy and was juicy and well cooked. We coupled it with the courgette fries which were a novelty but a bit pointless. Pretty expensive but probably my burger joint of choice in town for now! Chicken beats beef though. Who would have ever thought that.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bq6LLB03i6rgFZidsioDog": {
    "date": "2/4/2010",
    "text": "I was lucky enough to attend the soft opening of their newest location in Soho with my two brothers, all of us burger experts. To be honest, I wasn't sure what expect. I had heard good things about their other locations, and was hoping it wasn't going to be like a GBK. which I find extremely over rated. Byron's decor was sleek and comfortable. The booths were a very nice touch. Burgers always taste better in booths....it's science. The menu is small, but not lacking. You don't need more than about 5 kinds of burgers. And the beer selection was excellent, including some regional American classics such as Brooklyn lager. The burgers themselves were high quality and very tasty. However there are one or two niggles that I'd like to vent. Firstly the fries were awesome, but don't serve them in a seperate ramican, it looks pretenious, it creates more washing and the burgers look lost on the plates by themselves. My second point is, even if your default is to cook the meat med-rare, still ask the customer. It wad a soft opening, and we were looked after vey well, but I hope they listen to their suggestion cards as it has the potential to be somewhere great",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "K1RHFz71pEl6GqAwB0NQJg": {
    "date": "1/27/2010",
    "text": "Utterly essential Soho burger joint that puts all of its local and wider competition to shame. So far I'm averaging one visit per week and it's fast replacing Bodean's as my go-to comfort food W1 evening jolly. Their Byron burger is the closest thing you can get to a west coast In'n'Out style experience. It's soft, its meat:bun:condiment:sauce ratio is perfect. They have root beer and macaroni cheese as sides. My only minor improvement would be if the buns themselves were slightly glazed, but that's a niggly detail. The service can be patchy. My last visit I had to specifically ask for the Big D instead of it being offered as a special. Most times though it's been absolutely fine. They have a wonderful video projection on the south wall playing a collage of burger-related ads, most of them clips from Carl's Jr spots from the US. I adore Byron, and applaud their attention to detail and flawless execution of their product. There's nowhere else on Wardour Street I'd visit instead now. So go.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8vuZ_WmHagwCBKGiVXLiQ"
  },
  "6WsSooov5aqmnavMbtwK5g": {
    "date": "1/4/2010",
    "text": "It's a chain! Well, I didn't know that before I came to Qype to review it, but, it's still going to get 5 stars from me. I'm not a big burger-eater, but these aren't your average burger, nor even your 'gourmet', but a cut above the rest. I should really upload a half eaten shot so you can see just how rare these things are. Delicious, and you can wash it all down with a pint of London Pride. Should I mention the girls that work here? No, no I won't...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lgpboEC9JLX9bkiAQvzvTQ": {
    "date": "10/28/2010",
    "text": "Very disappointing! The meat itself was very good but the roll wasn't that special. The gherkin on the plate reminds me of hostel food in Czechoslovakia and the piles of massive tin barrels of them stocked up on the stairs to the bathroom didn't help. The only original thing about this place is the screen showing old cartoons (mostly related to sausages I noticed).My suggestion would be this: Make your own burger, it will cost you a third of what you'd pay in Byron's.I'd much preferred it being the Intrepid Fox back in the day",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jwj7BL-nWawqvaWkoPpDVA": {
    "date": "2/19/2010",
    "text": "I didn't know about Byron Burger until my colleagues took me there yesterday. I was excited because they told me so many good things, and we don't have this typical restaurant in France just fast food like McDonald's. I have to confess that I wasn't disappointing. I took the Byron Burger with Bacon, Salad, Steak and its delicious and probably the best burger that I have eaten in a long time. To prove it, nobody spoke during the lunch just focus on eating :) The burger is big like in the film when you see an actor eating one in US. I took also french fries and there are quite good. I have to return it. My only complaint is that it's not easy to find it if you don't know so much London.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aN1fWqslAk9IL6upzuMmxg": {
    "date": "3/8/2010",
    "text": "Byron Burger, Soho. Opened in November and it has taken me this long to get my butt down there, my sincerest apologies to all of the no-one who really cares. But here I am, nestled amongst the don't-give-a-fuck trendiness that is so very Soho, under a lampshade that is a little bit too spidery for arachnophobic me, beside a Christmas tree sticker which if you look really closely, you'll notice is topped with a little cow. This is Byron being cool, without being cool. The order was s.i.m.p.l.e. this time ~ a Byron burger (dry cure bacon, mature cheddar, Byron sauce) for Panu, and a gruyère cheeseburger for me. Oh and my quintessential A&W root beer float. I dig Byron's burgers. It's a bit hard to explain but the best way to describe it is that it tastes like a good clean burger. I still love Ultimate Burger's BBQ beef burger, the generous dollop of BBQ sauce and sweet onion relish oozing between my fingers and lips, but this is completely different. After consuming a whole burger, one (namely me) doesn't feel heavy or sickeningly full. I was also particularly impressed with the meat this time, something which I didn't notice last time, but the patties were cooked a perfect medium, if a little on the rare side. Slightly pink-ish, deliciously juicy. In fact I pointed it out to Panu a few times like do you see this meat? Do you see how good it's cooked?! til he swatted me away. Quite literally. So Byron Burger gains another two thumbs up from me. But check this out, Panu, who claimed LA's Umami Burger was the best burger he'd ever had, pits Byron up against Umami and the verdict? As told on twitterverse Byron is numero uno in LondontownVideo link: youtube.com/watch?v=BTKP…",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "u6IoQE3yNC1hzwtTOBieSA": {
    "date": "12/10/2009",
    "text": "Byron - Pics at The London Foodie(thelondonfoodie.co.uk ) I love burgers. They are up there amongst my top three comfort foods. Recently I felt I should venture out in search of burger heaven. Following the footsteps of my London bible Time Out, I decided to go on my own personal quest to find the BEST burger in London, or at least have a pretty good go at it After an evening showing of A Christmas Carol at the IMAX Cinema (fantastic 3-D feature!), a bunch of friends and I decided to go to Byron's newly opened branch in Soho's Wardour St. It was after 10pm when we arrived, and we were lucky to find a couple of tables to accommodate our large group of ten. We were soon greeted by a delightful Australian chap called Kristian (with a K!), who looked after us throughout the evening. He was one of the friendliest guys I have ever met - brimming with positive energy and enthusiasm (well past 10 in the evening!), Kristian was faultless and made our meal at Byron memorable. My first impressions were excellent  in addition to the excellent service, I loved the industrial look of the place, the exposed bricks painted white, the open plan kitchen, the video playing against the white wall, and the understated elegance of the decor. The simplicity of their menu was also rather reassuring. All hamburgers are cooked medium and are served with lettuce, tomato, red onion, pickle and mayo only. Burger options are Classic 6oz hamburger £6.25, Cheeseburger (choice of Cheddar/Monterey Jack/Blue Cheese/Gruyere) £7.25, Byron (dry cured bacon, mature cheddar, Byron sauce) £8.50, Skinny (bun-free with salad only) £7, Chicken £8.25 or Veggie (grilled Portobello mushroom, roast red pepper, goat's cheese, aioli, and baby spinach) £7.50. And that is it. Dr G ordered the Cheeseburger with Gruyere while I went for the Byron burger, as most of my friends. Byron's burger size is just about right  I love grabbing my burger with both hands, never really getting my head round using a knife and fork as in GBK (I love GBK too though). As I bit through my burger I found it to be perfectly cooked and deliciously charred, the meat was flavoursome, fresh and still pink in the middle, and the bun just right, showing some lovely griddle marks. My feelings were echoed across the table, my fellow diners were ecstatic with their own choices, and having dragged them all the way from Waterloo, I was also very happy and relieved! We also ordered various portions of French Fries £2.75, Proper Olives £2.75 (the greenest I have ever seen), Homemade Skin on Chips £3, and their sensational Courgette Fries £3, the best of them all and a must on any visits to Byron. Wines are categorised into Good, Better, Great and Best, and prices range from £13.50 (Good) to £21 (Best). We ordered their Good white (a South African Chenin Blanc) £13.50 and also their Best red (a Californian Pinot Noir) £21. They were both excellent, and I would happily have them again. Tap water was provided unprompted in beautiful French style carafes and was constantly topped up. This is rare in West End restaurants and is highly commendable. Verdict  my newly favourite burger joint in London (sorry GBK!), serving no fuss but perfectly executed burgers, delicious courgette fries and chips at average prices. Excellent and personable service, beautiful decor and central location make Byron one of the best quality & value restaurants in Soho.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uDLOovejw2NiJ2DUScjyyw": {
    "date": "7/22/2012",
    "text": "The food was fantastic! Great service and really friendly staff! Will definitely eat here again!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5RBDg1huzBkRfn2ggVXUDw": {
    "date": "11/27/2011",
    "text": "Does what it says: decent burgers and fries at non-tourist prices. Remarkable how many places can get this simple combination horribly wrong, e.g. Frankie and Benny's faux-American Diner chain. Pleasant and helpful service. Gets my vote.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tMxX_7f9f833v8O9sK0Qgg": {
    "date": "8/26/2011",
    "text": "I would have really liked this place, the staff were friendly but not overly attentive, loved the decor, the menu was great  not ridiculously complicated but still a nice choice, howevermy burger was basically raw. They say it comes medium rare, but mine was several shades pinker than my foodie companions. I have never sent anything back in a restaurant but I just couldn't eat it when it looked and tasted so undercooked. They manager pointed out their medium rare policy but ordered me a new one without argument so plus points for Byron there. Just be aware that if you don't like your meat still 'mooing' it might be safer to ask for it medium.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "D2OnmIGuJOORIJfzJ2ArmQ": {
    "date": "2/10/2011",
    "text": "Great traditonal burgers at reasonable price !",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xggHaS4PUNPOD2d17oAYcQ": {
    "date": "6/18/2011",
    "text": "Went their last Friday with office collegues. Its nice burgers and yeah the rootbear with icecream was cool. But I think the price is bit too much for a burger. We all had a burger,drink and a side, and the bill came to about 17 quids per person.Apart from the price, everything else gets a A. Good food,nice staff",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3Xa2eHPrPrGwLKcP6hbh6w": {
    "date": "3/23/2011",
    "text": "Not sure why this is as busy as it is. The burger was nothing special for a place that is meant to be specialist. The \"skin on chips\" were so bland, I only ate 3. The service was average, though the food did arrive promptly. The interior is nice enough, but felt pretty crammed in. Wont rush back.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "t84Fq-4_M5jgJP_SN4-gZg": {
    "date": "12/4/2010",
    "text": "Gorgeous burgers and chips, set in a funky environment in the heart of soho! Reccommended!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "n6sgX10pFFJXeWVrKkiK_w": {
    "date": "6/13/2010",
    "text": "Goodburger.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FWkK_Vmz6sg_NEa6lzp5dA": {
    "date": "1/6/2010",
    "text": "Quite simply the best burger I've had in London for a very very long time. Apparently they follow the Ginger Pig type ethos and raise their own beef which works beautifully. I loved the simplicity of the menu and the Byron burger was unctuous, soft, full of flavour. Almost the best thing is the fact that you can get legendary macaroni cheese as a side dish. Do it...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "h3UgTHV7WdKjJ4eBsFDnMA": {
    "date": "7/14/2010",
    "text": "Best burgers around, love it. Also, unusually for a burger place, their other food is really great too - the caesar salad is excellent with big homemade croutons and massive shavings of parmesan, and their zucchini fritti are brilliant too. To top it off they have proper good beers including the scrumptious Brooklyn lager. Can't go wrong!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q72iS3puOWoGt5fLRhW7xA": {
    "date": "6/12/2011",
    "text": "Normally I wouldn't bother writing a review for a chain restaurant, let alone a burger chain restaurant. Byron's \"ultimate\" burgers are the exception. It beats all other burger chains which offer burgers that are certainly not ultimate and in my opinion each and every one of them could close now that Byron is becoming more and more widespread.Byron's burgers are really good for a reasonable price, something that is quite unique. I say reasonable because it certainly isn't cheap but I think it doesn't need to be in central London where paying up to 15 pounds for a hamburger has become the norm. I do value quality though and that's what Byron offers. A Byron burger (take it with their own sauce) is a safe choice but there are options to top it up with all kinds of ingredients too. Good chips finish it.Byron clearly instructs its staff well which leads to quite a rehearsed sales pitch at times. This is a letdown for me as the place doesn't need this over the top handling and in fact makes it feel more like a chain restaurant but I can deal with that. I come for the burgers and those are good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KfA8QdOHapZL_Ak1uzlz-w"
  },
  "P_RGFvHwp89q_8C4y4Xt5A": {
    "date": "10/18/2015",
    "text": "Great food and fantastic customer service. The waiter really made me feel welcome and was very helpful.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8vDAVMXlovrS0DqiENfNQ"
  },
  "lJ8NVGjBKLxSDGfypSBWcg": {
    "date": "11/10/2013",
    "text": "I love Byron. I think they make great burgers and the value is very decent. This outpost is in a great location. As with all outposts, the staff is friendly and efficient. A great place to get your burger fix.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "06UVdPjpvHR2gtu8m5_OCA": {
    "date": "9/5/2011",
    "text": "My favourite burger chain. Finally a burger that I do not have to dislodge my jaw to eat. The right type of bun, no ciabatta here. Skinny french fries.Do have to wait often for a table and food, due to its popularity.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "oyHGYtm18VdBjUsABGd1wg": {
    "date": "10/30/2011",
    "text": "Stumbled in here on a wet wednesday night recently with a friend.It was OK but my cheeseburger wasn't that fantastic and the (massive) onion rings gave me heartburn all night!I was the only one eating of the two of us, we had a beer each and it cost over £30.However the staff were efficient, the place had a nice buzz but I dont think I will come back",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3KFl4DzvOB8MjWgmkvSwbw": {
    "date": "12/9/2011",
    "text": "When my friend suggested Byron for lunch I prepared myself for yet another disappointing 'American' English diner where they'd serve a burger and have quirky things on the walls and assume nobody present would be able to tell the difference from the real thing. Sure, I told my friend. Why not just kick me in the shins, I thought.Then I looked at the menu online. Are you kidding me? This place serves A&W CREAM SODA? (If this review were an action movie, this is the part where the camera zooms in on the hero - me - as she growls 'Things...just got serious.')This place makes my immigrant heart beat big pumps of nostalgic home love. This chain was obviously made out of genuine affection for the way my people do diners. Since there are so many good overviews here, I'm just going to focus on the little things. These are the important details that show Byron know what they're doing:1. A&W CREAM SODA. (Really, it merits a repeat mention.) They also serve A&W Root Beer. And serve floats. You might as well be singing the Star Spangled Banner and looking through photographs from my childhood.2. Great quality dill pickle spears served with your burger. So often ignored here, but so very important.3. The fries are definitely fries, not chunky English chips.4. Do you know how many times some well-meaning someone directs me to 'an amazing new shake place' that is really just someone putting a straw into some weak soft serve? Step back. At Byron, you get real ice cream, real milk, blended and served in a real metal shake tumbler. I think the only thing that could make Byron feel more like home is if they added grilled cheese sandwiches to the menu. And gave me a hug.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DN9JwDFI6wrQuzHEFeF2RQ"
  },
  "dviqJjKqFxZdCrkMtXkh6Q": {
    "date": "12/17/2011",
    "text": "So we were walking around Soho, feeling like a decent burger and found Byron through Yelp. Good reviews all around, so decided to check it out... and let me tell you, the reviews are spot on!The Soho Byron location has everything you'd look for in a restaurant:- Nice decor (not too bright, not too dark, funky lighting, attention to detail, etc)- Atmosphere (music just at the right volume, old boxing matches projected on a wall)- Great service (quick, friendly, accommodating)- Good food (burgers were awesome, onion rights, fries, even the wine was good)There is nothing bad I can say about this place. I will be back and will tell friends to check it out as well!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JV0jYxGEkij9GtGa1YU8UQ"
  },
  "KsKWoHu1a_VTjK5GXpIO_g": {
    "date": "10/12/2013",
    "text": "We found Byron's while walking by, and happy we stumbled upon this place!  Food was great, and staff was on point.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "89-fZpTSc7twSAhLrFZUsQ",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/89-fZpTSc7twSAhLrFZUsQ/o.jpg"
      }
    ],
    "user_id": "9nw8cctrXuU84ShFHtw8Cg"
  },
  "zndy26Ezqzg9IQv7PbHGZA": {
    "date": "1/31/2011",
    "text": "Honestly the nicest burgers I've had in London. I would have included a photo with this review, but the time between arrival and face was too short. The menu choice is simple, and what they do they do well. The burgers are really cooked medium (tending to medium-rare, so beware if you don't like your meat pink). And then there are the milkshakes! You know the 'five dollar shake' from Pulp Fiction? This could be it. One of those lovely frothy ice-creamy milkshakes with real chunks of fruit in it - yum yum! And on top of all the fabulousness mentioned above, I have never had anything but exemplary service. Yay!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97JTwCnKnyTHpr6fp-sNdA"
  },
  "OQjKexl1JjCtLqpPIqMTzw": {
    "date": "2/24/2010",
    "text": "It's pretty much like all the other Byron locations: these people know their hamburgers. I read a review that asked \"How many upscale designer Hamburger chains does the UK need?\" My answer as a hamburger lover would be: just one, as long as it does hamburgers right. And, until now, that small criterion to justify the existence of a chain had yet to be fulfilled: all the chains I have tried seemed to think a hamburger was about serving two balls of ground meat, set on fire until fully turned to coal, in a sourdough bun with a slice of pickle and a slice of tomato falling out from just bringing it to the table, and I am not exaggerating here. I have had to stop myself more than once from throwing some unbalanced stack of bone-dry inedibility back into a kitchen while screaming \"You call this a hamburger?\", and I am only slightly exaggerating there.Not at Byron. The meat patty is big, thick, round, and _flat,_ people, flat, so it will actually stay on the bun. The bun is soft fluffy bread that soaks up the juices from the tender meat. The meat will be served medium rare, which means it will actually be pink in the middle. And it will taste like real meat on real bread and be delicious. There are proper milkshakes to be had, thick and cold and creamy, oddly served in the metallic mixing beaker instead of in a tall glass with leftover in the beaker next to it, as is traditional in the US.It is spendy, though. The simple burger is simple, and adding tasty accessories to it racks up a bill fast. But it is a nice meal.One thing Byron gets totally wrong from a similar US experience: the chips aren't soggy, or under-, or over-done, like they would be in the US, where finding good chips merits perma-skywriting an arrow to the point of purchase. The chips are nice. As they should be.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "i7-9PzjvO_lrzQvVxHAibQ"
  },
  "djU7_r32d37UjzH473XoLw": {
    "date": "4/29/2014",
    "text": "Decent burgers. Decent pricing. Nothing special, really. A few minor improvements would have made this a much more enjoyable meal; Fresh vegetables are absolutely essential to a proper burger...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mxv-KKMTvJFL433d9NgoNA"
  },
  "A0iP1yTKKliW-9TKrlXTsw": {
    "date": "10/11/2010",
    "text": "Wow, you can't even tell this used to be the Intrepid Fox, can you? That actually makes me a bit sad, I loved that pub. But, I really like Byron burgers too. Even though I didn't actually have a burger. I've been meaning to come here for ages (seriously, how have I not had a Bryon Burger yet?) I popped here with Miss Alex because they kindly gave me a voucher for milkshakes. They were packed when we arrived (and the little gaggle of people at the door got very annoying, and rude, after a while). But the staff were polite despite being rushed off their feet and off we went with our milkshakes. I'm something of a milkshake expert (and pride myself on such a silly thing to be expert in) and I don't remember the last time I had one as good. Oreo was my favourite of the two (I think they forgot to put malt in the vanilla one, if they didn't, their malt isn't very good). I like the place, I want to have food there, I want more milkshakes. That they can get four stars when we didn't stay, and only had milkshakes, is impressive. I'm looking forward to going back and trying their food. It's about time, isn't it?",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "c3BsTAWjc0e4L_oRNSsW4w": {
    "date": "5/21/2013",
    "text": "Considering the options available for burgers in London this place is not good. Average burgers. Tasteless fries. Very oily onion rings. Tasteless chocolate brownie! How is that even possible?!Do not waste your money or valuable calories here!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPrEHeYY-Q1rMQ6LxmlzEQ"
  },
  "D6wimLT_LOhXW-c-P1UecQ": {
    "date": "3/26/2012",
    "text": "Delicious medium rare patties of beef. I can't seem to tear myself away from the blue cheese option.... but that's ok it's a good one. Definitely some of the best fast food/ reasonable price burgers in London. I take mine with courgette fries and a large milkshake!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8lhOc2ALAqKdmidG7DLFDQ"
  },
  "qwrWG1yfnAjz8p2pSNanuQ": {
    "date": "6/14/2013",
    "text": "I'm a huge fan of burger and I think this place is perfect to be idolize.The Byron Hamburgers are extremely perfect for me.Why? because they have the best and delicious burger I've ever taste before.I really like to spend my money for this burger here in Byron.And for me this place is a highly recommended to all.Love it! and Like it!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kqcOPbwAd_-kvBWwIlNJmg": {
    "date": "5/22/2013",
    "text": "An awesome treat from my friends was unforgettable.They the best and juicy burger at Byron Hamburgers.The patty was so yummy and they really put a kick on there burgers that no one can have.This burger is perfect for any people who suffer hunger for there work.the services also are cool.They can have a delivery in a cheaper price.So! nice",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qPgyi7AFd7ThF3sDnup__A": {
    "date": "6/27/2011",
    "text": "\"Proper Hamburgers\" is how Byron describes their burgers, but I didn't find them to be anything all that amazing.  But maybe a burger is something that I'll never be blown away by.Well, that's not entirely true.  I am a sucker for the burgers and fries prepared by Five Guys, an American fast casual burger chain.Anyway.  I ordered the Byron, which comes with bacon, cheddar, and \"Byron sauce,\" which is basically their version of Big Mac special sauce, which is basically McDonalds' version of Thousand Island salad dressing.And I was not particularly wowed.  Sure, it was decent, but I've felt that I've had better burgers at the aforementioned Five Guys -- which I've given four stars in a previous Yelp review.  And thus, a place that's still good and yet inferior to Five Guys should probably earn three stars.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "A5yvVRCKWJ40KQG0JPbLWw"
  },
  "n6liUveHJADbUY4CDwgIMQ": {
    "date": "7/4/2010",
    "text": "Some nice burgers at Byron. It is a bit of a walk from my office but it's worth it. Housed in the old Intrepid Fox pub the interior is airy and light, on the wall a projector is playing various short animations. I wish I could say better about the burger, it is definitely one of the better ones in London but it is not the best. I was going to give the place 3 stars but I added one on for the interior, the friendly staff and for the care they show their food, making sure to use the best produce. Don't get me wrong, it is a very good burger and they will cook it to perfection based on how you ask them to. I just expected... more I guess. The danger of having high expectations maybe. Good handmade meat patty, soft buns, just the right amount of lettuce. I will definitely go back to get a second opinion and after reading the reviews here I am curious about the chicken burger (I am normally not much for chicken on a burger but the description made me want to try it - thanks talia)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MmHnLSpWzKCIn78DvvYHVg": {
    "date": "11/22/2012",
    "text": "First time in.....The hamburger itself was good, but the bun was stone cold an so the plate where it was served... not good at all, I hate cold plates.I had chips and courgettes, too oily guys!!!Good looking waitresses thought!!!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GPlZhcnEcfXn_wCBwRm_yQ"
  },
  "IaDZw5oNbzFsH-ublWMZAQ": {
    "date": "9/18/2013",
    "text": "Fast and friendly service. The Byron burger was very tasty as was the Oreo milkshake. My only complaint is the onion rings which were a bit greasy. I would definitely go again if I'm looking for a good burger,",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aYWyW-JEOxZuv-GZu2EHig"
  },
  "vbAnmEhiLQO0XiziFTFKbQ": {
    "date": "5/24/2013",
    "text": "From their limited menu of hamburgers, I ordered a 'Cheese Burger with blue cheese' .  From the very first bite, I was overwhelmed with disappointment. The burger reflect the ambiance of the restaurant which is tasteless, cold and dry. It just wasn't juicy  enough and it lacked a certain punch that would make you want to go there for more. And with the price that they charge for the burgers, I just cant justify the lack of quality. The first place I compare Byrons burger is with Meat Liquor which is in the same vicinity. Those burgers are tasty, they deliver more than what is expected and are similarly priced as Byron. The only decent thing about the place was its service, the staff working there were attentive and helpful.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "odlqNcJNvyo72z-PLoVpyw"
  },
  "mS9MlUUylNLpq3Q_-dTi2g": {
    "date": "4/22/2015",
    "text": "this Byron has a great atmosphere. Loves the  burger specials and the courgette fries are to die for.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhquOZB4_3O72v_jAjoHPQ"
  },
  "Rq3quJPR8P7WVn7rzboghg": {
    "date": "4/8/2014",
    "text": "Byron knows how to make a proper hamburger and that is nothing new, the fine quality meat it uses as well as the simple and fresh garnish results in some of the finest burgers you can get in London. What I really love is they always come up with some amazing monthly special to keep the burger fans interested.he B Rex was a real beast and perhaps one of the tallest burgers I have encountered. It had a giant onion ring, good number of slice, wonderfully smoked crispy bacon with some fine American cheese. Not much of a fan of Jalapeños peppers normally, but when its served with BBQ sauce and mayonnaise, it reduced the intensive spices level and worked really well with the beef patty....l",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "4Cc3idwhezNVNiCc7AKXFw": {
    "date": "1/7/2015",
    "text": "I LOVE BYRONs Burgers!!  The service is AWESOME!!  We always go after our train ride to London!!   I order biggest burger onthe menu and wash it down with the biggest Byron Ale!!!  They have amazing onion rings too!!  They are always busy at this location so, you may wait a bit, but, not too long!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NAqUTsPTMyIO4-gilRVVoQ"
  },
  "z1Yhe1Q4cp4lD2Q6AaDTAA": {
    "date": "9/13/2011",
    "text": "I think this place deserves a 5 star because it's absolutely the best food of its type you could get for the price. Sure it's just a burger, sure it's got a limited menu of a few sides, a few burger options, salads, and desserts, it does it well (although not mind blowing, but I think I have given up on the search for \"mind-blowing\" food in London seeing that I'm a student and no longer willing to shell out the £££s). Service was friendly. A full house of patrons when we came here on a Tuesday evening, although they said it's usually not this way. Has a good selection of craft beers. And the prices!!! Honestly this place serves up solid burger for only £6.50 and it's 10000x better than a £10 one somewhere else! The decor's interesting. I don't think I know how to describe it, but they have a huge white wall space where they project old black and white movies - sound off. Kitschy in a cool way?Mayo haters beware: they slather on some of it as the standard on the classic burger. Yuck =P (I'm no friend of mayo!) Other than that, Byron - you have worked your magic on me!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sey_l7Pldpw85EfeJslJEw",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sey_l7Pldpw85EfeJslJEw/o.jpg"
      },
      {
        "img_id": "SoIUCUzkz8lgJK9zMFMYIQ",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SoIUCUzkz8lgJK9zMFMYIQ/o.jpg"
      }
    ],
    "user_id": "ANVsYjL6J6irvp5qZZb9rg"
  },
  "mQr80yWVijbT-w8jnyOAwA": {
    "date": "5/5/2014",
    "text": "As American Expats, we tend to try restaurants that make a claim to serving American Burgers. We love everything from the West Coast CHAIN restaurants like IN-N-OUT, Five Guys, Dicks Seattle, Tommy's, Red Robin, Sonics, Thunderbird Diner, Bob's Burgers, Mother Fuddruckers, etc. As a reference point, Red Robin tends to be a 3 star (average) for us. As for Byron, we were very pleased with the quality, taste and service. The facility itself is very simplistic and meets basic needs.  Tables were packed tightly to accommodate maximum seating. Decor was simplistic and nothing to rave about; however, the burgers were very good... and let's face it, we cared more about the actual food than the restaurant decor. Menu was simple... No major theme burgers at all.  I had the cheeseburger with blue cheese with bacon... and it was quite tasty and satisfying!!! I also ordered a side orders of onion rings, fries, and zucchini fries to share with our family of 5... The onion rings were great... Similar to onion rings at a County Fair.  Let's say that my entire family were very happy with their food. They felt that it was a \"taste of America\", which is high praise considering we have been living in England for 17 months and have been disappointed many times at many pubs! The slam dunk for my kids was the A&W root beer and creme soda, which is usually not sold in UK  stores; hence its higher pricing, but I was glad to pay it for the satisfying grins on my kids' faces.  Service was \"service with a smile\"! We will definitely visit Byron again next time we're in London!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzfpUvHMWwzW8JV7KiWPSQ"
  },
  "cqaH9SQMiIThd2wZHbc8Pg": {
    "date": "2/18/2013",
    "text": "Very tasty burgers. I was a bit unsure about byron as it is a chain but I heard good things and gave it a try. I ordered the Byron burger with blue cheese and skin on fries and was very pleased. The meat was perfectly pink in the middle, just the way I like it! The bun was durable and tasty and the cheese was nicely balanced with the meat. A few more chips would have been nice but I'm just greedy! I often return to Byron whenever I am in the mood for a quick burger and can honestly say I have never had a bad one at any of the locations. Not quite on the same level as your Meat Liquors or Honest Burgers but very good for a chain restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loBW3BWuNfJGwPeBOCuBBg"
  },
  "F2fKwJHgSdi7cxEs7o-3sA": {
    "date": "9/24/2012",
    "text": "As someone who hails from the states, I always love myself a nice burger in Europe. The main reason for this is that I've found the majority of burgers to be overcooked and I really like mine rare or medium-rare, not well-done. I ordered the Byron burger, and it was pretty decent with bacon, cheddar and the special Byron sauce. While I enjoyed the burger, it was surprisingly average. I didn't love it or hate it. For a restaurant which specializes in burgers, I was slightly disappointed. In terms of other things, I found the service to be pretty good. Be warned that it can be slightly slow during the insanity of lunch hour. The ambience here is also really nice and makes the whole experience enjoyable. A-OK, and my current go to if I am in the mood to eat FLESH in London!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k1pEVOCNUaklSh01l04aiw"
  },
  "1O7s3-ROvz-yIwom9SuaDg": {
    "date": "3/11/2015",
    "text": "Love their sauce! Also have healthy options like their butternut squash and feta salad. Burgers are obviously the best and the milkshakes are heart attack in a glass. If you are cheating...This is the place to do it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrogCakYomNjd7rPLbeQqA"
  },
  "iWzxe7ecIooymskaqzUlFA": {
    "date": "3/11/2015",
    "text": "Byron burgers are up there in my top 10 list! I had the bacon and cheese burger (not too adventurous) but it was sublime! It was massive and came with chips which were just the right out to fill you to the brim. However, after noticing the oreo milkshake I couldn't not have one so finished with this and it was AMAZING! I would suggest getting there early for dinner as it gets quite busy but sooooo worth a visit :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFrGH3MIvxzbAfi_wf4hVg"
  },
  "T1H0Ahv2QvoGjIr7XMKIQw": {
    "date": "8/21/2013",
    "text": "I like the taste of the burgers here in Byron, burgers arehad plenty of toppings to suit everyone. Sad to read the other yelp reviewer here, they said that the burger here istasteless. Maybe they had a different taste and appetite. J I love the classic burger w/ bacon here as they are huge andreally worth the price. Overall, I'm totally contented here in Byron for many reasonsthat I can't put in details one by one.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Plo3SX6j2E76GWj556O5uA": {
    "date": "8/3/2014",
    "text": "I've been to Byron probably 5 times, this location once but mostly in Hoxton square. I have no idea how they've managed to proliferate all over the city. This chain is just plain meh. The patties are not hand-formed, the meat is gristly and dry and hard, not tender and falling apart with each bite. It's \"juicy\" but not because the meat itself is juicy- only because they cook it in some gross grease. The pickles are sweet-ish and come on the side, not on the burger. Pickles are a major \"tell\" when having faux american food abroad- they never get the pickle right, it would be dill in the US. Decent decor, friendly staff, but you expect an actual good burger from a burger restaurant. This is a pass.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6x2fVHgUEd41gqOIt2EhQ"
  },
  "2vZwTJCsSqc_7zXsJIN1jQ": {
    "date": "11/7/2011",
    "text": "Bryron burger won't let you down - tasty patties, excellent sides and some lovely beers on the drinks menu (helllooo Brooklyn Lager).Great spot this too, right in the middle of Soho, no fussy decor. I've been spoilt somewhat by living so close to Honest Burgers in Brixton. I can't find a burger to match it, anywhere, including Byron's efforts. I think the main difference is in the bun. The glazed brioche bun you'll find at Honest makes the difference.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "XF5bQ78Yta3ipExSWGulsw": {
    "date": "12/22/2013",
    "text": "I have realized that Scottish beef is terrible. This place be it the onion rings or cheese burger is defiantly not worth the trip far better places plus the price is definitely not worth it Byron definite pass.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ok2enORZm5JzXl2i7MSK5A"
  },
  "7oY_Cgzqb-HSHNi524RFKQ": {
    "date": "5/1/2012",
    "text": "My one and only experience at Byron was very poor...so bad in fact that I haven't really bothered to give any of the other locations a try (despite hearing great things from bloggers/friends).I mostly decided to try it out because of the \"American\" burger - they made a big fuss about how they sourced the buns from the States, used American cheddar and the gherkins and mustard etc were just like what an \"American\" burger should be like. I grew up eating American-style burgers, and this was before Meatliquor existed (thank goodness they opened) so I was very excited to try this special. We waited for 20-25 minutes, and I ordered my burger medium rare. For starters, the bun was cold, and there was not char on the bun. Apparently an American-style burger bun equates to a supermarket-quality hot dog bun back home - the same quality/texture as a hot dog bun. The cheese was barely melted, and the burger wasn't even hot. Fries were okay. Nothing more to be said though. Not to mention my burger was overcooked.Gross burger, slow food, bad lunch experience.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TE0WdwJscofrN73gdA2rew"
  },
  "06mjrGGfpKpe35AffSLf8A": {
    "date": "2/10/2010",
    "text": "I couldn't believe my eyes when I spotted a bright burger joint at this address. The only reference now left to its past life is a subtle mention of \"The Intrepid Fox\" above the windows. But it doesn't even look like the original lettering.Oh well, what used to be a famous rock'n'roll / punk hangout closed its doors quite a while ago and was boarded up for ages.I am really showing my age here, but I quite liked the old Soho with its fair share of seediness. No matter how good the burgers at Byron's may be I prefer to remember the blacked out windows and dodgy toilets of yesteryear.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "LjW1zFSHjB7VwuKIAutrww": {
    "date": "3/19/2012",
    "text": "Byron's ambiance is really nice. This is the first thing I've noticed about various locations, and particularly like the industrial feel of the Soho branch. I had heard good things and was looking forward to trying one of their burgers. It was...good. But it was also pretty forgettable. It wasn't BAD, it just wasn't really notable. The chips were alright. Everything was pretty average. Byron nails it with the craft beer list (and the Byron Pale Ale, made specially for them by Camden Town Brewery, is particularly tasty), but they're small portions for the £4-5 you'll pay for them. I wanted the burger to be better so that I could come here again when I just want a quick and yummy burger, but I'd probably skip it in the future. Of course, there's one now opening next door to my work, so I'll probably eat my words and many more burgers.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "3bEU_kHzr-2xz4ba-K71Jw": {
    "date": "9/3/2011",
    "text": "Byron's Soho branch has a mixture of an exposed brick interior and Byron's customary US diner-style booths. The food is dependable as ever: I went for my favourite combination of the delicious 'veggie', Portobello mushroom & goats cheese-based burger and Oreo milkshake with Malt.Being the Soho branch, it's perhaps unsurprisingly the busiest Byron I've been to, with steady streams of new customers entering the branch. Unfortunately this translated into somewhat overattentive servers: so often were they coming round to our table asking if we wanted anything (like, no doubt, the bill), I almost felt like asking them if they wanted to join us. Thus, though the food was as good as ever, this branch loses a star next to its sister branches.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "3CVuUxD2A9Rj9IwvGZQGKQ": {
    "date": "8/2/2013",
    "text": "Been here a couple of times. The vanilla milkshakes really are overwhelmingly good. The skinny burger (without a bun) is solo good! Really a rather great place...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "6MrnMEVXxDSeSBAQWiivSA": {
    "date": "10/16/2011",
    "text": "if you know me at all, youve probably discovered that some of my favorite things in life is good beer and a good burger. this place has both and even tops it off with amazing fries and byron sauce :)i could be biased since i AM american but this was by far my favorite restaurant in london. aside from the food, has a very hip decor and fun staff. its a small place so be prepared to wait if its prime eating time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dvFGnnfiOvgz50HkF0l5Mw"
  },
  "OpKqQ2x3UiPhuYeCeSahZg": {
    "date": "8/19/2015",
    "text": "So I've been here about 4 times in just as many weeks, so I feel like I can gauge the quality pretty well based on that. First of all, the decor is lovely. I am a big fan of the interior here. Secondly, the staff is always unfailingly helpful (this seems to be a constant at every Byron location). Now, the food and drink. The quality of the burgers is consistently excellent. Meat is always tasty and cooked as requested (medium rare is how you want it). Adding bacon is never an issue and the sides are all chuffing excellent as well (I'm particularly fond of the onion rings and courgette fries). During one of my recent visits there was an error with the check (we were charged for a beer we didn't have). The staff made no fuss and promptly took it off  and presented us with the correct check. Which leads me to drinks: Byron's house lager is rather excellent. It's nice and refreshing. Similarly, the banoffee milkshake, while very rich is really really good. All in all, for a chain restaurant, they have managed to keep the quality up, despite having a lot of branches. That alone is pretty impressive.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5qTrcegdgGFSni5x9A-slQ"
  },
  "vDFkTYuirdFK6mjRTcGVWA": {
    "date": "5/2/2017",
    "text": "Byron proper burgers might be the best burger I ever eaten in my life. Mostly importantly Zuza was an amazing waitress! She was so attentive and very friendly and very good at her job. The burgers we had were outstanding. My son had the spicy wings and they were fantastic. The chocolate milkshake was fantastic as well. This restaurant is in the Piccadilly area of London for a high-end retail shopping here was just down an alleyway or small street. Apparently the owner is Korean and was inspired by the fantastic New York burgers. Definitely six stars on a five star rating!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XT4u3pWxvraCMCb9nF_hCA"
  },
  "UQQXk7w3EEBIon0tvsw0TA": {
    "date": "4/25/2011",
    "text": "Picky eaters. Where can you take them? \"I don't eat fish.\" \"I don't like curries.\" \"Umm, I can't eat a pie.\" \"No spicy food, please.\" After you beat them senseless, you realize... burgers. Simple, American food that practically everyone enjoys. Well, anyone who eats meat.Byron's has a simple enough menu of burgers with assorted cheeses, as well chicken and veggie options. Humorously, they offer a \"Royal with Cheese\" as well. Everything's cooked medium unless you ask, but when you do they'll cheerfully take it off the grill early or leave it on longer, depending on how you want your meat.Speaking of grill, the kitchen is open. I like that. I like being able to see what's going on with the food I'm about to consume. It was nice and clean.Salads too, though my Yorkshire friend would say \"Salad is what the food eats.\" Do have the skin-on chips, which are cut into random sized bits that go well with a splotch of ketchup.Decent price. Two burgers, two sides of fries, two beers, £30.If you're looking to add some sugar to all that grease and protein, try the \"Knickerbocker Glory\". Our neighboring table had one of these ice cream monstrosities. No, he didn't share. He. Ate. It. By. Himself.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nBstlekXV36WeE4GRvtY6w",
        "caption": "Photo of Byron - London, United Kingdom. Burger. (I took the top off so you could see.)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nBstlekXV36WeE4GRvtY6w/o.jpg"
      },
      {
        "img_id": "L5ZTkBYEYrzzCaS_f7DyZg",
        "caption": "Photo of Byron - London, United Kingdom. Kitchen area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L5ZTkBYEYrzzCaS_f7DyZg/o.jpg"
      },
      {
        "img_id": "ulEclF8w78m5EytUUBH2fA",
        "caption": "Photo of Byron - London, United Kingdom. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ulEclF8w78m5EytUUBH2fA/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "MjLRDvpbUj-o_0aYNAoYVg": {
    "date": "4/10/2015",
    "text": "Worst restaurant experience I have had in a long time!!After the waiter took my order, he neglected to put my order in the system, so people who came after me had already finished their meals and I still hadn't received mine.After I brought this to the attention of the management, they finally realized it was because the waiter hadn't put my order in the system. The manager was kind and offered to comp my meal, so I waited. However, when my burger came out it was rare, and not medium as I had asked. I didn't even want to wait for them to recook it, so I left. What should have been a 20 minute meal turned into a 45 minute annoyance.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCiSTIp6VeWb4VpVPfsf6A"
  },
  "koDpBX2TrHHUYwuWcFVG-Q": {
    "date": "11/17/2015",
    "text": "Good burger.  But not great. I had the Byron Burger and it was nice, a little messy but good.  I was hoping to a better unique experience but it just wasn't there.  The staff was friendly, professional and appropriately attentive.  The food was good, but I wanted it to be great.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kf_eU0vK6pHTnsb8uStz4A",
        "caption": "Photo of Byron - London, United Kingdom. The kitchen.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Kf_eU0vK6pHTnsb8uStz4A/o.jpg"
      }
    ],
    "user_id": "yFOg7zFu58ouDr_6uy0_Wg"
  },
  "MZQ7uVae8FL8whqOprmftQ": {
    "date": "12/31/2014",
    "text": "Very good burgers! I've been meaning to go for a while, and I was finally able to go while visiting home for Christmas. The burgers are cooked medium rare which means the burgers melt in your mouth. Delicious!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1XPmY3MWhLR3vbRj4TIDwg",
        "caption": "Photo of Byron - London, United Kingdom. Cheese Burger (blue cheese)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1XPmY3MWhLR3vbRj4TIDwg/o.jpg"
      }
    ],
    "user_id": "0QzkeRz51kamAgpbaFY8ZQ"
  },
  "YQK6JfRxqvaDnFmrF8FiwA": {
    "date": "6/18/2013",
    "text": "When it comes to burgers in London, there are surprisingly a lot of options to choose from.  I feel like I saw burger restaurants on practically every street, but Byron was the only one I got to try.  While it sure wasn't an American burger, I liked the feel of this restaurant, and their burger options were a nice change from what I'm used to!A friend and I ended up at Byron one night after looking around desperately trying to find something other than the Italian food we'd been eating for lunch and dinner for nearly a week.  Byron seemed to have options that were gluten free (for me) and lactose free (for her).  The inside was cute and retro, with pastel colors painted in blocks on the wall and diner-style table and chairs.  And while the actual menu was limited, the burgers were all very different -- from burgers that were bunless with a side salad to burgers topped with unique cheeses and garnishes. Unfortunately, I ended up getting sick, even after the waitress assured me that she had a friend who was gluten free and ate there all the time.I won't be back, but if you don't have any food allergies and you're looking for a burger place with a fun atmosphere, I'd recommend checking it out!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ogL-6zZ0Gf1Q-DKu8D19PA"
  },
  "2QKP3Nx64MxlD1XpW9E0EQ": {
    "date": "8/17/2014",
    "text": "Hmmm. I don't get it. Maybe burgers aren't a thing in London. I don't know. The Byron Burger was just the most average, mediocre, under seasoned and under salted sorta dry burger. I've had a thousand of them in the U.S. too. So I guess if you can't find burgers in London, maybe this would be considered good. I didn't really want to come here. I didn't fly to London to eat burgers but a friend seemed very passionate about it. I will say their fries were super good, well salted and crispy. I had a can of Camden Halls at our waitresses recommendation. It was OK. I'm not a beer aficionado. I think it's probably a bit watery/flavorless for people who enjoy hoppy beer. For me it was good enough and I enjoy trying local beer. This was a good spot to grab late night eats in a fun and happening part of London. The waitress was very cool and I had great conversation with an old friend but thats it. This cannot be the best burger in London and not worth a stop for an American. You're up to your ears in burgers in the U.S. Go eat some Fish and Chips, I wish I had.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "C_F1NFhKbAE9SmfHOsXgRw"
  },
  "gcT_n4KDNJmb24Q1qCmiIw": {
    "date": "12/13/2014",
    "text": "Good service, nice burgers good value.  Easy to get a seat but very busy.  Staff seem to be having fun and a nice crowd as customers.  Onion rings are massive so don't go to mad,  the shakes are very thick so remember you need a good suck or a spoon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tq6Pf5nZUiOVFC_AdT9MEA",
        "caption": "Photo of Byron - London, United Kingdom. Onion rings and shake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tq6Pf5nZUiOVFC_AdT9MEA/o.jpg"
      }
    ],
    "user_id": "ocbo9C2TMd0maFWYxz4cGg"
  },
  "PbKQ9Q_W5aohnhiQGQpViw": {
    "date": "7/4/2016",
    "text": "It was good just that they forgot about my dads beer and they took 30 minutes to make our food",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CkNR_0YlC_HzMDzjjTdXww"
  },
  "AFGKJyZlxpwdvyD4ctqA4w": {
    "date": "11/20/2014",
    "text": "Had been meaning to try Byron just because I've heard about its unique style of decorating its stores. Came to this one right off of Oxford Circus during dinner time on a weekday. To be honest, I wasn't impressed. The meat was a little dry in my opinion, and the sauce was just ok. Overall, wasn't a big fan of this restaurant. :(",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ASQv7VhUZE6zJgyTXx75Q"
  },
  "WbsS62luM5qMCCjC5ZW0RA": {
    "date": "6/1/2016",
    "text": "Hamburgers were good but the banana milkshake was a discovery, so so tasty!!! Service staff were super friendly, will absolutely come back. I loved the spicy Byron sauce, an absolute must!!! Just wanted to steal the bottle!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6PpTTK3YfIK8KNZ9yc6hqA"
  },
  "GMbTUjiK2fzPospUHPdu9A": {
    "date": "3/14/2014",
    "text": "Byron wasn't out first choice for an impromptu Tuesday night dinner. Initially we were headed to Honest Burger (one of my favourites for veggie burgers) but the wait was at least an hour so we immediately turned around and opted for Byron. And that's what's great about Byron - it's reliable. It's never empty but there always seems to be one last table free, just when you need it. The food is also pretty good, so you know you can't go wrong. Their veggie burger is consistently good, across all chains and as far as I remember from my carnivorous days, the blue cheese burger was lush. We were served by a very nice and friendly waiter and the drinks were great, too. I had a lemonade (gotta love a restaurant that does decent lemonade) and the boyfriend had a can of pale ale that even I enjoyed. The only reason it's not 5 stars is because Byron's veggie burgers aren't my favourite, but it doesn't mean that they're not delicious. So when you don't know where to head for a dinner in a busy part of London - check out Byron.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "adM7hulS_uQnMAkGj8XkCA"
  },
  "DycPe8cXQNN_BPtGwoMzDw": {
    "date": "3/14/2017",
    "text": "Burgers were good, as was service and the place looks cool. Avoid the veggie bean burger though. Bought in as opposed to made there and tastes terrible. I did complain and the server took it off the bill without hesitation.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJVNASzgGiR-xJrONLJNZg"
  },
  "hunMm9toIhxsxBz1Qf06kg": {
    "date": "3/27/2016",
    "text": "Good burgers. A lot of seating. We ended up downstairs and it was ok but very loud. Would opt for table upstairs for environment. Loved their Pale Ale and great options for kids.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SauopFNHJBs6r6pVh98Cw"
  },
  "f6LOhiOVgvbPcmto0rZNIQ": {
    "date": "10/3/2015",
    "text": "Burgers are burgers, its not ... big ass portion, it is just burger. but really like the oreo milkshake. Super rich and it came in a big cup. Sweet potato fries are also very nice. So me and my friend ordered two burgers and the fries, and I have a milk shake . it came to 25 quid total . I guess it is okay.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MKgjzsiFjlOELz3K0Fa_tg"
  },
  "a7wcak_86K_Pp8BC2pic8Q": {
    "date": "4/15/2014",
    "text": "Ahh .. Byron .. One of the only burgers in London I'm willing to pay £10 for. Byron is my typical lunch spot. Not that I visit every week; but the only times I have been so far, were every time for lunch during workdays (mostly Fridays of course).And every time I go I can't resist but to play save and go for their Byron Burger. It's that special sauce that really does it for me and gives the entire burger and the tender meat that special balanced kind of flavour. The bun is always perfect in texture, bacon is always really crispy and the thin fries you order along with it never disappoint as well.Byron is a save, bit premium but great lunch choice. So roll up those shirt sleeves and have yourself one!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JLoTy6jS2eXz8vg9VceXSg"
  },
  "aBRNnUxwzVbKzQkBOumClw": {
    "date": "11/2/2015",
    "text": "I really really like the milkshakes at Byron. If you haven't ever tried, you are kinda missing out. Oh and the burgers are decent too. :P",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8-EnrU5E_F_MddvlzY_uw"
  },
  "ef3FMsd2KuAanmBKYf4TPg": {
    "date": "12/22/2015",
    "text": "We visited here at opening on Saturday morning. Staff were friendly. My girlfriend really enjoyed the courgette fries here. Good burgers, not the best in London: we were spoiled by Honest Burger, really. Nonetheless, these were nice enough.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw-BR0gP2lAGnGy1e5asWA"
  },
  "083Sn3fq5dRGN3uuVW1onw": {
    "date": "1/15/2012",
    "text": "Definitely up there as a good, juicy bit of beef patty!  I was tempted to give it a 4* as the wait was pretty long, but then I remembered it was a Saturday night in the middle of Soho!I got the Classic burger with bacon done medium, and my goshes, the first bite was heavenly.  The patty didn't feel like it left my mouth with a thick layer of grease and the smokiness off the bacon was so good.  The onion rings were delicious, the herb in the batter added a little depth to the flavour.  I did, however find a bit of melted cheese on my patty near the end, which annoyed me slightly and had to take my lactase tablets just in case I'd eaten any.  The reason this hasn't affected my rating is because they serve A&W Root Beer (in my opinion THE best root beer ever and it should be on general sale in the UK!)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RLHz5xueQjErqdPVzI5p9A",
        "caption": "Photo of Byron - London, United Kingdom. Classic burger with bacon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RLHz5xueQjErqdPVzI5p9A/o.jpg"
      }
    ],
    "user_id": "WfeMikdf7D3xRgPC5Qw5ZQ"
  },
  "8OiESeoWUNqcP_O0kZ_n-Q": {
    "date": "7/22/2018",
    "text": "Has a chain restaurant feel despite being in soho, but the food and service were good if you want a fast/casual option. I opted for the avocado chicken sandwich and sweet potato fries. The Byron sauce, which was described as ketchup, mayo and pickles, I got on the side. Prices are good. Would recommend if in the area and want something less busy and touristy than what's available off Piccadilly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rORPA-C2JxnByRUjCaqmcA"
  },
  "3ct3-Lsmhqz6rqeb1KNJAQ": {
    "date": "11/15/2017",
    "text": "Great casual burger place in London! A former London native took us here, because it was one of his favorite casual eateries in London!The burgers were of a good size and very delicious!They also had a good selection of local beers and ciders!Burgers come a la carte so make sure to order a side!I got the Smoky Burger and Cheese Fries and was very happy with my selection! The Courgette Fries and Onion Rings also looked really good!This place reminded me a lot of Johnny Rockets, if you've ever been there in the United States! It has kind of a 1950's diner feel!I would come back here again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AF_tC2_gj6At9myUSCmI4A",
        "caption": "Photo of Byron - London, United Kingdom. Smoky Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AF_tC2_gj6At9myUSCmI4A/o.jpg"
      },
      {
        "img_id": "hb7Q6aaE73g65V4wd7WyCg",
        "caption": "Photo of Byron - London, United Kingdom. Cheese fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hb7Q6aaE73g65V4wd7WyCg/o.jpg"
      },
      {
        "img_id": "A0uWHYlt1LKnUhiZxvBsJQ",
        "caption": "Photo of Byron - London, United Kingdom. Onion rings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A0uWHYlt1LKnUhiZxvBsJQ/o.jpg"
      }
    ],
    "user_id": "SGcZtIe5S0DsvhRDXkd3BQ"
  },
  "IS-VxvPnswbzpwhzFAsEUA": {
    "date": "3/12/2018",
    "text": "To preface, my partner and I come from Los Angeles, CA where burger competition is fierce.  While on vacation, we saw this establishment while waiting for Flat Iron right across the street.  We were curious on how Londoners like their burgers so we decided to try it out.It was decently busy on a Sunday night but no wait so we were grateful.  Service was great and location is stellar.We ordered the Old Smokey, Clucky, and the Halloumi fries..£10 (13.8 USD) Old Smokey Burger: Bland. Very bland. Almost as if the cook left the salt out entirely.  The buns were toasted but the quality of bread tasted pretty cheap.  The meat itself was greasy and tasteless because of the total lack of salt.  No amount of sauce could save the lack of seasoning on this burger.  For £10 I expected a gourmet burger but overall it couldn't even compare to a Five Guys/Shake Shack burger (fast casual burger chains with ~£6 burgers).  It is an absolute sin not to season your burger, especially for one that costs as much as this.  Shame.£5 (7 USD) Halloumi Fries:The fried cheese sticks came out crispy and hot.  Good.£10.50 (14.50 USD) Clucky: Seeing a trend here.  The fried batter was unseasoned, and the chicken was tasteless and dry.  I don't think they brined the chicken prior to frying so the chicken was DRY and bland.  However, the guacamole was surprisingly decent.  Again for £10.50 sandwich, I expected much much more.Total for dinner including service: £40 (55.5 USD) for burgers and cheese friesThis is really disappointing to write since I really wanted to like the place.  From the outside, the kitchen looked professional and the atmosphere felt welcoming.  After my disappointing dinner I looked up this restaurant and apparently they are undergoing some financial problems.  I am not writing this review to attack Byron, I just want this place to learn and improve.  The manager and head chef should taste their food now and then to ensure quality (unless they think what they are currently outputting is fine, then that is a whole different issue).  I bet Byron has a hard time retaining customers.  Pay attention to the food!  It is the most crucial element of a restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qS3BX_lxmKIh5Ak286L3_A"
  },
  "dzFx_kX3WrOsxweXTGsNmA": {
    "date": "9/17/2017",
    "text": "as an American in London, there are times when I want a proper (not fast food) burger and Byron fits the bill. there are quite a few of them scattered about London, but that's a good thingsuper friendly service, good beer selection and they advertise a boilermaker on the menu, which I'm not sure is a good thing hahaI'll be back for sure",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "jj7qARHi2gfTZY87v2RQsw"
  },
  "OeljcJ3urJy-wZ3jJyyzTg": {
    "date": "2/15/2017",
    "text": "I'm not really a fan for burger meal until I tried BYRON. I always ate the classic chicken burger top up with the sweet potato fries...oh...it taste so good...it is my second times I visited Bryon. Chicken wings taste nice if you don't mind too spicy. Not to forget to mentioned here is I love the milkshake...it is one of the main reason I came here. 4 scoops of ice cream in it..what can you complaint of? But it is.best to know your diabetes status first before you try it...it is very sweet..and you can the ice cream slowly melt down and frozen  your stomach.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vJNKWAShaa7QrwU2YLvvYg",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vJNKWAShaa7QrwU2YLvvYg/o.jpg"
      },
      {
        "img_id": "MZ5vkuK0mVP4VtF-7Qa9Tw",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MZ5vkuK0mVP4VtF-7Qa9Tw/o.jpg"
      },
      {
        "img_id": "IXPrfWo980qu7_pLLHqomQ",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IXPrfWo980qu7_pLLHqomQ/o.jpg"
      }
    ],
    "user_id": "9mS7Wz2-qdgmHFumqTBs4w"
  },
  "QSSOHUy9YSOBvfvN6ksMjg": {
    "date": "12/15/2015",
    "text": "Old same byron burgers that never disappointed me but trying out this location on the vibrant Soho neighborhood. The size is a bit smaller than the other ones I have been too but I have to say that the staff is excellent and very friendly. Will be back again",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X8EdIZQWzwYy44ChoHJxAg",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X8EdIZQWzwYy44ChoHJxAg/o.jpg"
      },
      {
        "img_id": "cId-et-KHEdySdI0-_xOdg",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cId-et-KHEdySdI0-_xOdg/o.jpg"
      }
    ],
    "user_id": "GU5qqkyskXWKxpbksHVIdQ"
  },
  "qHBuJeakdp6xC1DleSFdSg": {
    "date": "9/12/2017",
    "text": "Great spot. Grabbed a bite with colleagues around 3, so crowd and wait were not an issue. Awesome location. Great fast service. Can't go wrong here.  It's all good. Sampled the zucchini fries and the sweet fries. Both quite good. The chicken sandwich looked yummy too. But I stuck to the Byron burger and fries. And a Byron beer of course.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mYuEYG9t5RxRpxNR4tHZvQ",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mYuEYG9t5RxRpxNR4tHZvQ/o.jpg"
      },
      {
        "img_id": "8zkFtGKnnm85TlJI3FENhA",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8zkFtGKnnm85TlJI3FENhA/o.jpg"
      },
      {
        "img_id": "Ea0CizJsoJISlK-MOZiYFA",
        "caption": "Photo of Byron - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ea0CizJsoJISlK-MOZiYFA/o.jpg"
      }
    ],
    "user_id": "5nVEsoRiuqW5dioO54vfqw"
  },
  "u6XUkK8D78cOXZ2NzdkhfA": {
    "date": "7/13/2017",
    "text": "All we got here is shakes but we were not let down. The shakes were amazing and the service was great. Definitely go for a sweet treat!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mxyzKmpVXMJv6X3RiSQIMg"
  },
  "aYKB4Nb34GJkc3By9heToA": {
    "date": "4/29/2016",
    "text": "We went there around 11:30 PM. We did not wait and sat immediately. I tasted the Byron burger and the cheese one. They were good and juicy. We had sweet potato fries on the side and they are recommended.Don't miss the place if you are a burger lover! :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "__Skk0s1AJeuqd-zgah9iQ"
  },
  "7xcCMFaE9LJSmmuG_ypTDw": {
    "date": "5/10/2017",
    "text": "The milk shakes here are sooooo good! We had salted caramel, banana and Oreo cookie milk shakes and all the three were outstanding.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "QHYltRu7Uh9Fxk3zAvZJDg"
  },
  "peeilxuh1fQFX8w7yYa3sQ": {
    "date": "6/25/2016",
    "text": "I tend to go to Byron every now and then, although the long wait and queues are sometimes a put off.The hamburgers are quite alright but by far the best is how they cook the chips, particularly the French fries.Definitely worth trying although it would not be my favourite place in London for hamburgers in terms of the quality of the food.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "tyrltF8VKIIC7JvKs4TMTw"
  },
  "K8WFVfoovHDve7seh45pag": {
    "date": "7/20/2016",
    "text": "While wondering through London, me and some friends were getting hungry and stumbled across this place.  Luckily we got in just before the rush.  This place is quite small and clearly gets very busy around lunch time but we were fortunate.  Shortly after we arrived there was a bit of a queue starting to form, but like I said, I think we timed it just right.There were five of us and we all had to fit around a table that was clearly meant for four, so on one side of the table it was a little bit of a squeeze, but because we were hungry we really didn't mind.  Also as the place was quite small and in a fairly busy area, it was a little bit loud but when you're talking to your friends, you soon overlook it.We were served more or less straight away and we didn't have to wait too long for our food.  I think it was about 15-20 minutes which given the amount of people they had in, I didn't think was that bad.  There was a good selection of food to choose from but most of us when for burgers.I must admit I'm not a big food person, and usually go for more plain foods, but I have to say that the burger I had here was by far, the best burger I've ever had.  It was amazing!  In fact just sitting here thinking about it makes me want to go back there right this second to get another one.  I don't think I can say much more about it.  None of us had been here before and everyone was saying more or less the same.  The chips that we had with it were ok, but the burger just stole the show.  Most people will read this and probably say, 'you don't know what you're talking about, there are much better burgers out there!', and they may be right, but for someone like me who just likes a nice, juicy, tasty, plain burger; this place ticks all the boxes.And on top of that, the price was really reasonable so I can't complain there. I think the only thing that let the place down a little was the building/facilities, but its London, so theres not much you can do there.  But overall, really happy we stopped here for lunch.  Will defiantly go back again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "46_yz2liH8l-XC_Xy368zg"
  },
  "3EFJyDgo9MGEM_nzygZh3Q": {
    "date": "7/5/2015",
    "text": "Independence Day in enemy territory, and we needed to get something American. My friend, who is British but married to an American, suggested that we go here for a good ol' burger. He didn't disappoint!The place was packed on a Saturday evening at 8:30, but the establishment has plenty of space with a downstairs dining area in addition to the ground level. I ordered the Byron burger with french fries, and a Byron pale ale. The burger was what you expect from a burger joint - juicy and thick patty, crispy bacon, melted cheese, and soft buns. The fries are in between thick cut and string fries, which I loved as I felt it an appropriate balance between fry and potatoes. I also judge a burger joint by how heavy I feel after, and I felt great throughout the rest of the evening, which speaks to the quality of Byron as well. I also ordered the BBQ sauce - keeping in theme with Independence Day - and thought it was a notch too sweet and tangy. Nonetheless, great and prompt service and the food definitely merits the Byron 4 stars.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoJY7SZNUUmTa5t-OG1pfA"
  },
  "Oc8CZlD20p9GZCVrs8Jckg": {
    "date": "5/3/2017",
    "text": "You can't really go wrong with Byron. The burgers are famous across the UK and are always good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAN7j002JS-Y64huxQngzA"
  },
  "v6V2Wwsp6MLS3mLvI2RNeg": {
    "date": "2/19/2016",
    "text": "If you're into burgers and good chips - including courgette chips or sweet potato chips if you feel like \"living on the edge\" ;) - then this place can't really disappoint.My friend and I were in a rush when we went in and the waiters were really efficient in serving us quickly and being really friendly. My burger was delicious, my friend's one - which was the veggie option - was too. Everything on my plate was great and they serve a very generous portion of chips.This is one of the good chains.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zpnbBQKYFuuduMWf2B_yRQ"
  },
  "68spcSKSySMlKjt9pkJKNQ": {
    "date": "12/22/2016",
    "text": "Really really good burgers!!!My daughter ordered the Oreo milkshake with a shot of Bailey's... Super good!!!Bacon cheese fries were ok.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TCjRPsWgqeI8J12mac-BBQ"
  },
  "qqZq7je1NuTUcg2H0-EICg": {
    "date": "9/18/2014",
    "text": "\"Proper hamburgers?\" Really? I can't understand the fuss.  My burger was quite mediocre. I must be too American.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7sqBaOloWgYX64pekWOAw"
  },
  "zjtdjL41i-Wqu_HTsU02lA": {
    "date": "5/5/2017",
    "text": "It was a busy Friday night at 9pm still, and we were so excited to try out the infamous 'best burger in town'. The prices are decent with quite a lot of choices on sides other than burgers, but it was a disappointment that they ran out of all chicken wings! So we ordered two cheeseburgers, caesar salad, courgette fries and cheese fries. The wait was quite long, about half an hour to fourty minutes. The staff were nice but not very attentive probably because they were too busy serving up the dishes, so it took me about ten mins to ask for some mayo even though we sat in the middle of the restaurant... by that time both our fries were slightly cold, and the courgette fries had a pretty thick batter on which I can't help thinking they aren't very fresh due to the temperature and texture of the courgette. My burger patty wasn't particularly juicy and there is a lack of beef flavour in the meat, otherwise the bun and sauces are quite nice. The caesar salad was in a bit of a mess, with an uneven distribution of dressing, leaves chopped into different sizes and the vegetables were not fresh and soggy. The croutons were my favourite because they were made of cubed burger buns which I though was rather special with its original butter-baked flavour as well. My partner's burger was a lot juicier, so maybe there is an inconsistency in the production of these dishes.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Xd_sTBpHcql0_17QrnzAg"
  },
  "uOGgZQBnjWKGEgDmkIBqUQ": {
    "date": "12/23/2016",
    "text": "Came here for lunch. Staff was nice and attentive. We had the \"Cheesemas\" and \"Smokey\" burgers with French fries and onion rings. Both burgers were flavorful and juicy. The French fries were thin and crispy. The onion rings were bland and greasy. That's the only thing I wouldn't recommend. Service was quick. Place was spacious. They have a projector playing Christmas cartoons and music which was a nice touch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAHqiScy-hEIXJ8YGQbJrg"
  },
  "bd1n722heAsGeDG-P1q1EQ": {
    "date": "5/6/2016",
    "text": "I'm a big fan of the Byron Burger chain, but this particular locale didn't really live up to my expectations. Maybe I went at an off-hour but the atmosphere was really quiet and I would expect burger venues (and indeed other Byron's) to be more lively than this, and for milkshakes and sides to arrive much quicker when there are only a handful of guests. As for the burger itself, it was great as always so no complaints there. Their milkshake was also very good despite the wait.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJTi6bMeCHgPergMu0r34Q"
  },
  "SEgEEKA_2hdWEbp4PYj1Zg": {
    "date": "1/1/2010",
    "text": "Bare brick and grey paint, this was the site of a pub in Soho that closed it's doors when the brewery businesses in the West End decided to sell off its real-estate.Byron's food is of a very high standard and so is the service. I was in a rush and had a chicken burger, a coke and fries. It was very tasty and fresh. This will be a regular haunt of mine I am sure - I can't wait to go back there when I have more time.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dd-AnduRbWCO3T6XQDNgZg": {
    "date": "2/16/2010",
    "text": "Without a doubt the best burger in Soho. Great staff too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "78qV_d-tSuP5yh4sAkSpGw"
  },
  "knA569ryzZXMFMS3wjBoYw": {
    "date": "1/25/2011",
    "text": "Nothing special with their burgurs...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "v33dCgCexPm4lt80SppxLw": {
    "date": "7/9/2010",
    "text": "Excellent burgers at a reasonable price.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "62IlUYAivKJZb08MMWFpZw": {
    "date": "11/15/2010",
    "text": "Dont understand the hype about this place, the burgers werent anything special. Also we sat in a booth and seating space was very cramped and uncomfortable !",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wSqBaugX1R6eXC2JKlAshw": {
    "date": "5/24/2012",
    "text": "my sons loved the food, although I thought it was a little overpriced",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}