{
  "dubohyRp10_sK0Qe32DXwQ": {
    "date": "10/11/2008",
    "text": "Very convenient bar, since it's right outside the doors of Waterloo station. It's a bit trendster-y and pricey, and definitely more bar than pub, with lots of wines and cocktails and food. They're open every day from 9am for breakfast.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6zj4iaubawLUTUQ04Nd3hg": {
    "date": "11/19/2008",
    "text": "A converted fire station now serving refreshing beverages in Waterloo. Located less than a 2 minute walk away from Waterloo station. The bar is very trendy with modern decor but with some elements of the old fire station remaining inside. The fire station is sectioned into a bar area & restaurant area & there is seating outside for the smokers or people who just want to take in the sights of waterloo road.The only thing I dislike about this place is that there are a lot of people who can make a nuisance of themselves by asking you for money or ciggarettes. It's not really a problems with the pub per se, just a minor issue with the location.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KDohASurWD-ClpuQLJpCkA": {
    "date": "11/15/2008",
    "text": "This bar/restaurant is close to my office so we go quite a lot. The drinks arent too overpriced and there is ample seating in a warmly decorated venue. Ive eaten here too, and if you go for old faves such as burgers and chips, nachos, etc - servings are usually more than generous. Had the salmon salad here though once, and at £10 I did expect something more than 1 salmon fillet and the equivalent of one mini gem lettuce with some dressing. Bit nouveau cuisine and Im more an advocate for price reflecting what you get.......maybe Im just greedy! Cool venue for after works drinks and socialising. Good place to meet friends as well as it's right next to Waterloo Stn, so even if you dont know London that well, you cant miss it!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ahCywT0w7i1cPWT5Vm00WA": {
    "date": "12/2/2011",
    "text": "Time of year dictated it would be busy buy I was still amazed by the huge number of people in the bar  made for a good atmosphere and improved by good company. Food was fine  good value and helped by a great waitress  Christina, who was excellent",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3gLL2sRH_em1WDj_9y2Naw": {
    "date": "1/5/2010",
    "text": "I met up with 2 work colleagues for lunch here. It was freezing which (as the waiter explained) was due to the listed doors on the front of the building. We had to keep our coats on. When the food came, it got worse. The nachos had to be chiseled apart which made it nearly impossible to share and the vegetarian meze was tasteless. My colleague's burger was raw inside even though he ordered it well done. He sent it back and it came back blacker on the outside but just as raw inside. Avoid this place.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "reMwSByxJE_om6B5x9sYSg": {
    "date": "10/23/2007",
    "text": "The Firestation is located just outside Waterloo, in yes, as you might have guessed from the name - a fire station which gives the place character! It's a really convenient place to meet after work and is always busy. It does a good selection of bar food and has a separate restaurant area.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HlybveUNTkQG9RQju6dqJg": {
    "date": "11/15/2008",
    "text": "If you fall out of waterloo station in need of somewhere to go for a pint or two, then you could do worse than end up here at the Fire Station. As the name suggests, yep, it used to be a working firestation (which is pretty obvious from the outside). Every time I walk past this place when its coming up to the weekend it is packed. So clearly it's popular. I've been a few times, and it's okay. There never seems to be enough seats though. Service was fine. One gripe I do have about it is the price. Once I went for roast dinner, and whilst it was nice, it was pretty pricey. A bit over the top for what you got I felt. But if you dont mind that, then it's definately worth a visit.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cqIhv9UYPEyInkhgxF08CA": {
    "date": "12/10/2015",
    "text": "So nice place. We just drop by to drink some coffee,  but when we fall into that really comfortable armchair in the corner, we didn't want to leave. Little bit loudly, but it was not disturbing in that place. At all I really like it :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vldDT9_MRRAWP8SP0rZgDA",
        "caption": "Photo of Fire Station - London, United Kingdom. Esspresso na poziomie ;)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vldDT9_MRRAWP8SP0rZgDA/o.jpg"
      }
    ],
    "user_id": "HhDcDSvgKjQfSRvijZ4kpQ"
  },
  "-lFBI7bwmZ8pyrjcIHII_w": {
    "date": "9/18/2016",
    "text": "Absolute rubbish. Came here on vacation on a Sunday afternoon. The \"hostess\" was oddly crouching under her podium doing something and we had to call out to get her attention. It took forever for them to figure out what table to give us even though the place was half empty. It took another eternity for our server to come to our table. We had to ask for a drink menu. They didn't \"do\" what seemed like a third of the listed draughts. I ordered a Hackney Brew APA that the server suggested as a substitute for one of the missing draughts, which tasted like soap (Not sure if I can blame them for this). Long wait to get the beer, of course. While we waited, another server mistakenly tried to take our order. Our food was bland. Two different servers dropped and broke drinking glasses while we were there, I'm guessing from tripping over their own shoelaces since no one was near them when they stumbled. Come on! And to top it all off, our server helped herself to a tip by not bringing us our change back. Maybe this is standard practice in London? It was so terrible that it became comical. It was as if it was all of the employees' first day and they all seemed high. I'm never going back to this joint. Stay away!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KmkR67Ugb2ARHhTh_T3CgQ"
  },
  "dmwzLIURPaf9GhH4y6tH0g": {
    "date": "10/31/2016",
    "text": "Not great. Menu is uninspired to say the least. Food quality was okay. It noisy and crowded. We ended up after being turned away from Cubana, probably like most people dining here. Also let down by an over worked but friendly staff. Not really a standout choice but there is not much near Waterloo. You can do better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1XKE1pw1S8jE3tj_kONMFQ"
  },
  "tzcXeBmsKMiBsj6MjRVQxg": {
    "date": "7/15/2015",
    "text": "The Fire Station, Waterloo (Invited Review) (published 15th July 2015)The Fire Station, Waterloo - The Fire Station menu consists of burgers and pizzas. And your vegetarian friend will not be alienated with the mushroom burger as a possibility. Their pizzas had the thinnest crispiest base; not bulked with stodgy bread. A side of extra carbohydrates in the form of garlic or tomato bread are available, if you wish to fill up later. It was an easy choice to pick from the menu but if you decide to have the beef burgers they are served well-cooked; there is no option as to how you want the meat cooked. I was not impressed considering that the menu is similar to that of a fast food burger chain, The Fire Station, is more upmarket, serves booze and provided service - so I would have expected a little more attention to how my piece of meat is cooked. Like I said, it did not take us long to decide and the food too, was served quite immediately.With Ivy, Sharmin and Jeremy we were already tucking in to the first burger - buttermilk fried chicken with spicy mayo, spicy coleslaw and little gem £8.50. Forgotten the very much needed picture!glazed short rib 6 oz dry aged beef patty, balsamic glazed short rib, American mustard mayo, sliced beef tomato, little gem £10.95 - the short rib looked dry but was indeed quite moist and slighlty sweet. The bun however was not such a good choice for that price. black and gold 6 oz dry aged beef patty, black pudding, double cheese, american mustard mayo, sliced beef tomato, little gem £9.95 - the burger was very tasty, but given the choice, I would have preferred it medium-rare. Unfortunately, the black pudding was a bit overwhelmed by the other flavours but all round a pretty decent burger.smoked mackarel, king prawns, confit garlic butter base, marinated mozarella, mascarpone, rocket, soft boiled egg £12.50 - when I saw those lovely plump prawns, I am beginning to regret ordering a burger. It was possibly the thinnest pizza base I have ever seen. It was very crispy and was lovely with the different softer textures as the topping.The wine menu was small but had interesting selection of wine. Our bottle of French from Bordeaux had the Saint Emilion Grand Cru appellation. The Bordeaux is a French wine region which has enough sub-divisions of appellation that make my head spin, especially after a few glasses of wine! This wine was quite full bodied with deep crimson colour and was very easy to drink. Definitely a good French wine and at £45.00 per bottle, I thought, was quite well priced. The cocktails (from £8.25), beers, ales and cider menu (from £ 4.50) had more variety. Prosecco from £5.00 per glass to a bottle at £125.00.The building was so iconic, it did not need a front door number. Location was great and easy to find. You will definitely recognise it. Just in case you have not seen enough photos of it, here you go. Come out of Waterloo station turn right on to Waterloo Road and the building is on your right. I like the interior very much. Parts of the building were retained and put to good use. It gives a trendy and classy edge to the interior. Service was very friendly, and it was not just to us. The food was on the mediocre side but the front of house team made the evening so welcoming that I am marking The Fire Station as a possible place to meet friends in Central London for a quick catch up. If the music had been less upbeat and slightly quieter, I would have stayed longer for puddings and drinks. On Thursday evening, The Fire Station was packed. It was only just opened and was very humble to say that they were still trying things out. But I am sure they must have done this before because they handled the evening quite brilliantly. It was quite a rarity to find four people greeting you as you came in through the doors. Ushers were definitely quite handy for the sizable fire station.  What I thought would be better was if the history of The Fire Station was more augmented. I don't really know the history of the building is but I'm sure that there is an interesting story to tell.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XCnnosEifwNrN8BW1fKyJQ",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XCnnosEifwNrN8BW1fKyJQ/o.jpg"
      },
      {
        "img_id": "HYWJdzKL2-8kR8KVNpNbsw",
        "caption": "Photo of Fire Station - London, United Kingdom. coa thanger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HYWJdzKL2-8kR8KVNpNbsw/o.jpg"
      },
      {
        "img_id": "xJ-yt9m2fGcKJrjeVNjOfg",
        "caption": "Photo of Fire Station - London, United Kingdom. smoked mackarel with prawns pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xJ-yt9m2fGcKJrjeVNjOfg/o.jpg"
      }
    ],
    "user_id": "jcGVXn6N47OAH8dMqCmG2g"
  },
  "JG0oGYAOp7fGwfByQrOusA": {
    "date": "6/27/2016",
    "text": "Decent place inside, with a nice atmosphere - good choice of drinks! Food is nice, but basic. Only complaint is that the front beer garden doesn't look on to anything, except a busy road.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrYGAxvkhenAt5fpOPDmgQ"
  },
  "USk6YjrPLjJYhZUgZa3rpg": {
    "date": "9/17/2011",
    "text": "Found this place while exploring the Waterloo area on a business trip back in April.  Looked cool so I went in for some coffee and lunch.  Being new to visiting London, I ordered fish and chips looking for what I thought was the comfort food of London.  What I came away with was a memory of extremely slow service.  Slow for acknowledgement of my existence, slow to take an order, slow to bring the food and slow to bring the check.  Had to get up and ask a few times for someone to come by.  Food was just  average.  The restaurant is actually very nicely laid out and a good setting.This week I needed a place to meet someone near Waterloo rail station so I picked the Fire Station.  Didn't eat this time but I must say that they redeemed themselves as far as service attentiveness and promptness.  Good job.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gdQsk9I6nZ0g-LDsIbPWrQ"
  },
  "Isj2286kEDnM5r4BCnjspg": {
    "date": "10/3/2015",
    "text": "Great place to grab a drink and a light meal.  Are there twice while in London and was not disappointed either time. The veggie burger was fantastic. One of the best I've had. Garlic bread was also very good. Dessert menu while short was also very good",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NYc1wMSIzhj-M42okKNfbw"
  },
  "sI-ZX0LTaycQP2Sdoh6cKg": {
    "date": "1/24/2012",
    "text": "STAY AWAY, far far away. Honestly, I am not one to write a scathing review usually. My standards aren't insane and I don't expect a ton from a restaurant, but I have never had a worse restaurant experience in my life. If I could give zero stars I would.Here are the lowlights:1.) There was a mouse scurrying around the dining room floor - not kidding. We had to tell our waiter.2.) The food was terrible, and especially considering the price we paid. Starter of tempura soft shell crab - have never had tempura so greasy in my life. Main of sea bass - only flavor was the pesto they smeared all over the plate. Broccoli was overdone as was the 'lobster' they had with it. Terrine was at best grey and flavorless.3.) Brought the wrong wine.4.) Slow to take our order.5.) And on top of it all we paid £55 for it. I will never go back here and would advise anyone reading this review to do the same. Go to Bangalore Express across the street and save yourself the trouble.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "9Pk2VYE26RZBc_QMHohoxQ": {
    "date": "10/20/2012",
    "text": "The Fire Station is actually what my rating says, 'ok'The beer's fine, I've been here a couple of times because it's next to waterloo so an easy place to arrange to meet people, would I intend to stay here all evening, probably not it to me has an atmosphere very much of meeting point have a couple move on.the tables are a bit packed in so at times you feel a bit concious that you're in the way of other people.Not had the food so move swiftly past comment on that.It's neither top of my list nor bottom, it's just easy as a meet up point",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_wQYj5o-l9H-rq49_PRmA"
  },
  "J4qcE6ElBHbJZsekhufiDQ": {
    "date": "9/27/2011",
    "text": "The last time I was here, I spent most of the evening fending off a really odd guy whom lived in a hotel, was drinking with the security guard from the hotel and worked (I think) at the House of Lord doing something important. He had decided that I was the loveliest creature he had ever seen and the big surprise to him (and proceeded to tell me over and over again) was that he didn't 'fancy black women' but I was 'soooo beautiful.' Having consumed three bottles of cider, I found it all amusing. Anyway about the bar, the pear cider sold here is great! It's a sweeter one but not sickly at all. It's a good space and well lit but because of stones throw away location from Waterloo station, the bar is very busy most of the time. Fill with lots of city folk during the week but the weekend is the luck of the draw.Despite my fun interaction I have not been put off and will be popping in on my travels.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "Pyha-8xF-Bfx27lPT1yofA"
  },
  "2boqHfU8t4oPa3LdNQjNIA": {
    "date": "10/30/2011",
    "text": "I've been here a few times, usually as an after-pub pub type of place when I'm in the Waterloo area.    It's open til about 1 on the weekends, which is a nice touch.  It's spacious, the drinks are plentiful and not overpriced.    There's a smallish outside area in the front where you can place your beer as you roll a cigarette.If I can collect any more memories of my times there, as they float amidst rum and cokes, lagers and wine, I'll let you know.  For now, it's a safe bet to gather a group in the later hours.  I probably wouldn't come here to socialize with the random patrons, though, because from my foggy memories, it seemed to be a bunch of insular group (just like ours).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Oir9HrPWGs6-DAFBT9olQ"
  },
  "i415LIAz5VjfHb2V96LpsQ": {
    "date": "7/25/2012",
    "text": "Note: Reviewing as a bar, not for food...This place was fine for a post-work drink. Decent beer selection -- I had a Jogger's Tipple and a Hobgoblin...both pretty good. It was lively and busy, but not crowded, and there was space to spill outside onto the street (love this about evening drinking in London).Beware though, you will probably need to pack a rucksack, with a compass, a map, victuals for sustenance, and a miniature flashlight in order to find the Gents. It took me about 47 minutes to walk there from the bar, and I got lost 7 or 8 times along the way.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L2kxHqwacsKIJICy-vgvbQ"
  },
  "Mdp8eou7OqBQgzulpjRfeg": {
    "date": "7/31/2011",
    "text": "The Fire Station wasn't my first choice for lunch, but for some reason I haven't fathomed, the Waterloo Bar & Grill was shut on a Sunday afternoon. So we wound up here despite fully expecting it to be nothing more than adequate.It was slightly better than I was expecting. It's a nice bar. The gorgeous building and nice decor make for a better experience than you'd otherwise have (always the case with a pub near a train station). But yI can't give this place more than three stars  the food really couldn't be any more generic. It all sounds good, but it's dull and a bit flavourless. Luckily I had fabulous company. Lunch was more about chit-chatting than the food.So not massively offensive, but nowhere you'd come out of choice. And unlikely to be somewhere that you'll stay for more than one.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uculFHfciZCirB1hKYVUzw": {
    "date": "9/23/2010",
    "text": "Wow.I'd been here a few times before nights out or whatever, and remember it being a decent boozer with decent food.So when I was in the hood with 2 hours to kill before my 3PM appointment at St. Thomas', I figured, ah, what the heck. It's gotta be better than Pret-in-the-station.I wish I'd had that sandwich.Took me half an hour of staring at the waitron to get a menu. OK, it was lunchtime, but heck.3 ales on tap: Brakspear, Pride, and something else. OK, so that's fine. Dinky bathrooms, but that's all right too.£10 for fish and chips? Well, I guess I am in SW1.Pretty good chips (this is where the 2nd star comes from). Cold dyed mushy peas. Indifferent, slightly fishy-in-the-this-might-be-a-bit-old fsh, thick, flavourless batter. Had to ask for vinegar for chips. Twice.After I'd finished, I mentioned I was in a bit of a time crunch (had an hour, but was limping, so wanted to make sure I had loads of time), so could I get the bill with my coffee.20 minutes later, I'd paid my bill, including coffee (and a generous tip) but hadn't gotten the coffee.10 minutes later, I went to the bar and asked for the coffee that I'd ordered and was waiting for.10 minutes later, coffees were delivered to 3 tables around me and I asked that the coffees be refunded. The barmaid said \"she didn't know\". There are loads of nice places round here. This isn't, unfortunately, one of them. Probably the worst service I've experience in the UK. And this is the UK.Uck.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "EVjhQ7r6vcrC4zBu4biYLQ": {
    "date": "3/14/2011",
    "text": "I'm always a little dubious of bars within such easy reach of tourist/travel hubs - they often don't have to work for their custom and rest on their laurels as a result -the Fire Station seems to be a prime example of this. It's a large bar with high ceilings, plenty of seating and a dedicated restaurant area at the rear.We visited around 10pm on a Friday night - a time when you would expect any and every bar to be busy. It was actually half-empty, which we should have taken as a hint. It had a rather aggressive atmosphere - everyone in there was still intent on pushing through the sparse crowd. The bar staff were inattentive and slow. Barman decided to keep my 10p change of his own accord. Nice to see Sipsmiths gin behind the bar but it was then ruined in a warm glass with postmix tonic. Not overly impressed and I'll make an effort not to be visiting again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LcA7a0W8GHgWGhbaoP6HDg"
  },
  "yCj3Igmzuyll-dMrGt35TA": {
    "date": "3/15/2010",
    "text": "Not a destination in it's own right in my eyes, but perfectly ok for a few cheeky drinks after work or somewhere to meet at the start of the night.Big and spacious with plenty of tables and a seperate eating section at the back, what that place probably lacks is some actualy atmosphere or purpose.A real mix of people in here - mostly cheap suits about 7pm on a Friday - but the occasional table of party intended souls!Stayed for a few until it was time to head to the IMAX.... perfectly fine.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "2yoc9eQa04sIvHnOnUlnSw": {
    "date": "1/25/2010",
    "text": "Okay, I'll be honest here...this place reminded me a bit of a more posh All Bar One, just with higher prices. It was nice inside, decorated tastefully but didn't seem to have any personality, which I require in my pubs/bars/drinking establishments. I want to remember it for some reason and I just wouldn't remember this.I had wine, which was standard fare. My friends ordered snacks and easily spent upwards of £30 on ciabatta, parma ham and cheeses. It was convenient since it was right next to Waterloo, but next time I'm in a wine mood and near the Eye, I'm heading to Benugo's wine bar in the BFI where it's a bit more memorable, adorable, and the same price.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "u3gd1x9Y571xk3tWGqMo8g": {
    "date": "11/8/2009",
    "text": "I have been here twice recently on Sundays.  This is really the only night to come here.  If you come here on a Tuesday it takes until Wednesday to get served.    When it isn't busy, the place has enough volume to lose the sound of the chatter, when it is, every syllable ricochets off every wall and you need to shout so that yours will resonate more with the intended recipient than everyone else's.  Staffing should be doubled and the whole place should be lined with something soft to soak up the noise.  The drinks are overpriced by about 30%.  All in all, come here because it's close to Waterloo and you need to meet up.  It's better than a eurethral swab and worse than almost any real pub, with the possible exception of the Wellington.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "_ghMs7JwVVseZIecUt8_ag": {
    "date": "12/7/2008",
    "text": "Fire Station is a great place for you and your party brigade to chill out and grab a bite to eat.  The interior is lush and the food is quite good.  I came here with a bunch of my friends.  They ordered nachos as I was 'not that hungry' and declined to purchase food myself.  When the nachos arrived at our table, a sudden rush of hunger took over my body.  I devoured them.  I'm sure that I was foaming sour cream at the mouth.  They were ridiculously good.  So much for dieting.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M_EUVlNr5surpBuIJ7D5KA",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M_EUVlNr5surpBuIJ7D5KA/o.jpg"
      }
    ],
    "user_id": "w7b1W-KHo7UUsnkg8ASo5Q"
  },
  "WqG3_-mItFuV1XAeaqeaGQ": {
    "date": "5/22/2009",
    "text": "This converted fire station is a good meeting up place next to waterloo. The decor is trendy and well looked after but with a few of the buildings original features. There is a good selection of drinks and food from a lunch menu. The service a lunch time is very good and the food arrives very fast. There is also a small restaurant area at the back of the bar and a few tables out on the street. After five it can get very busy..",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HbPd49Pbp-NNDV9D0st36A": {
    "date": "6/19/2018",
    "text": "VERY delicious burger and fries. The waiter was very helpful with recommending me a good drink. Made my friend and I feel very welcome. Best burger I've had in London so far.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yzyk05mxugd5z5eFXCg8AQ",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yzyk05mxugd5z5eFXCg8AQ/o.jpg"
      }
    ],
    "user_id": "kK_kKMQyo4jKX54I53x9qA"
  },
  "UuHx49G37QfTFwaMOzubIQ": {
    "date": "11/11/2017",
    "text": "Cool spot! Old Firestation turned into a restaurant. Menu dedicated to burger and pizza, which was very American-like. Yet, there weren't your traditional \"burgers and pizzas\". I ordered a smacked salmon pizza, which was sooo yumski! This is a late post so I do not recall exactly what was on it. But the crust was thin and crispy and the salmon was smoked perfectly! Light and filling!! I also had a very yummy cocktail, which, of course I cannot recall the name. But it had elderflower and I believe gin and some berries of some sort. I remember it being SO amazing, I sent a picture of it to my BYF (Best Yelp Friend) back in the states. I've attached this picture to this review. I gave it  3 stars because the service was not that great.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w0JnkkajXIklc_sL2H3R6w",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w0JnkkajXIklc_sL2H3R6w/o.jpg"
      }
    ],
    "user_id": "fo4lQMea-NLSUe7pMniqBA"
  },
  "GaZNG-zEUaLT698cBSvPuA": {
    "date": "5/3/2016",
    "text": "This is a great pub right next to Waterloo Station. My friends and I came in for dinner on a Saturday night and even though the bar was crowded, it was quick and easy to get a table. Seems more like a drinking place than eating place but the food was overall pretty good. Chili and caramelized wings were a surprisingly great side. They were sweeter than I was expecting but they were great. They come in various sizes. I had the burger with bacon and it was decent as far as burgers go. Fries were good.Beer selection was pretty great as far as I saw in London. Service was also the best we had in the UK. Would come back here to eat and/or drink.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2nlJVl5HK1etBUgYhzXm9g",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2nlJVl5HK1etBUgYhzXm9g/o.jpg"
      },
      {
        "img_id": "aiIGwAdtd8Sl_CJwlCZFZg",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aiIGwAdtd8Sl_CJwlCZFZg/o.jpg"
      },
      {
        "img_id": "dF73OUyuALDscPJOiQbgBg",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dF73OUyuALDscPJOiQbgBg/o.jpg"
      }
    ],
    "user_id": "NWjOxPJuTuz7oWGBk-Q6ZA"
  },
  "DbupvtWQT2VnrjVoG51suw": {
    "date": "12/12/2016",
    "text": "Great place for a quick lunch between classes.  Came with a group of people all doing some classes for a week up the roads at King's College.  We were in and out and paid all with separate checks in well under 45 minutes.  Ordered a pizza with chicken and pineapple on it and it was delicious!More interested in heading back for breakfast at some point as it seems there menu is more extensive then.After 12pm they really just had 6 burgers, 6 pizzas and some sides.  Pretty limited and not worth a 2nd trip this vacation, but good stuff all around.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4_mUWwbwbYMyVgqVm6taFg"
  },
  "8StGPYeoW9BoxTvO4H875g": {
    "date": "6/30/2017",
    "text": "Classic English breakfast before we head out to Paris. Great food. Great service. The atmosphere is so cool being and old Firehouse restored. Bar looks cool too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wsP4kIQNw1ir0HHefg92ag",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wsP4kIQNw1ir0HHefg92ag/o.jpg"
      }
    ],
    "user_id": "jcg3kqIPKqfQ06NsASSUww"
  },
  "PrT67g9AO7LEm9pQ4gz0Jg": {
    "date": "9/12/2015",
    "text": "I was so hungry after walking through inner city London. I wanted something hearty and heavy.  They had what I was looking for: burger fries and a dark stout.I gave it a 3 because the food was ok and a bit pricey compared so other similar burger joints. I spent about £9 ( $13 burger).And £ 2  ($3) for regular cut fries. But I think they get a lot of business because it is right next to Waterloo station and the place is cool- a converted fire station. The fries were greasy and the burger was a bit sloppy. The place can be extremely loud too. But the service was excellent. The staff was fast and very welcoming. And they served my stout just perfect- chilled glass, with very little head. Nothing too fancy here but I'd go back if I was looking to satisfy my hunger.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KxLtKb2IU_2xCXlvvdXUBg",
        "caption": "Photo of Fire Station - London, United Kingdom. High table sitting and bar.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KxLtKb2IU_2xCXlvvdXUBg/o.jpg"
      }
    ],
    "user_id": "ioFFC6gtuY8wFvf9sRH2hA"
  },
  "ZDd6S2zUz6FGQk-LfQJI8g": {
    "date": "6/9/2016",
    "text": "I love that this is an old fire station! The outside of the building is stunning, the decor inside is minimalist although quirky with lights on the end of fire hoses etc, the staff are friendly and the food and drinks menu are good... AND did I mention it used to be a fire station?I met a friend after work for a drink and some food and I can 100% say I'd be back. The food menu is simple with a choice of burgers, pizza and chips. We shared a pizza with chips and salad (although changed our order after 5 minutes and they were very accommodating). The pizza was good with a crisp base and plenty of toppings, served with a huge salad and a mix of fries and sweet potato fries. Overall entirely satisfying but nothing out of this world. The cocktails are lovely - well presented and refreshing but at over £8 a pop with no happy hour it rapidly increases the bill!We were seating in the bar area, which had a nice buzz - busy for mid week but not too loud that you couldn't hear the other person. They also have a proper dining room which was much quieter. Overall simple yet effective!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y0t4zNlpZoWgpQvsJD1qvA",
        "caption": "Photo of Fire Station - London, United Kingdom. #colourblast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y0t4zNlpZoWgpQvsJD1qvA/o.jpg"
      },
      {
        "img_id": "hdosmbgs1D7ER31yoyIWLw",
        "caption": "Photo of Fire Station - London, United Kingdom. #colourblast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hdosmbgs1D7ER31yoyIWLw/o.jpg"
      },
      {
        "img_id": "bck-zGzwJN1XsBKrf1EbBg",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bck-zGzwJN1XsBKrf1EbBg/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "AbQhi8eM2gTQDbbUnZ-CZA": {
    "date": "3/16/2016",
    "text": "I met with a group of friends here before seeing a show at The Vaults. The front part, which is the pub, is incredibly crowded, not surprising for such a prime location. They still had a few tables in the restaurant in the back though. So, this place used to be a fire station, as the name suggests, and it's decorated with a lot of fire fighter related materials. For example the ceiling lights hang from old fire hoses!I really liked the atmosphere, though it's a bit on the noisy side.All of us ordered pizza, so that's the only food item I can review. It was really good, with a thin and crispy crust and fruity sweet tomato sauce. The toppings were a bit sparse, but very tasty. Would definitely return, though it may be hard to get a table at times.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HiY5E-vORIoCK61nTuqHxw"
  },
  "veAW7HV_NPtvIx6KqFcM4A": {
    "date": "12/1/2015",
    "text": "So we headed here tonight to check out the Christmas menu. I already loved the idea of the venue - an old renovated fire station - and I was very excited about going along to check it out.It's located perfectly by Waterloo Station and opposite The Old Vic. On arrival, the place was heaving and it continued to be so throughout the evening - a good sign.The venue itself is just brilliant and designed so well - they have taken care in its renovation to keep the structure of the station building and there are also a number of hidden beauties including an old mini gold fire hydrant. Also if you head into the restaurant area you'll find the lighting above, which is made from old fire hoses. A ingenious touch. Now to the food - boy did they fill us up. We started with their special starter - chilli and caramelised chicken wings. They were delightful. The sweet taste of caramel gelled so well with the tang of the chilli - I'd actually eat just a whole bowl of the sauce. It's safe to say manners went out of the window and licking the sauce off my fingers was the only way to go.Next the pizza, we actually tried the smoked mackerel and prawn pizza first - to say I'm not a big fan of mackerel would be an understatement but I sucked it up and gave the pizza try. It was delicious - both types of fish were more meaty then fishy and the flavours complimented each other perfectly. I would actually order this pizza if I went back which really says something! Then to the Christmas pizza - pure genius. It was topped with pork and sage stuffing balls, chestnuts, cranberry sauce and crispy parsnip swirls. Now I've had a lot of Christmas burgers in my time but never a Christmas pizza and I can honestly say this isn't a pizza to look over. If you can, get down there and try it. The base is crispy the combination of toppings just works and it's a taste sensation in your mouth! NOW, the burgers! Yes, I'm serious. We ate this much food! What can I say, I'm running out of positive descriptive words. We tried the black and gold burger and the Christmas burger and both were fully loaded and packed full of flavour. I actually preferred the black and gold as I'm a meaty person and the burger was cooked to perfection but I would also definitely recommend the Christmas burger.Lastly we had a bite of the warm chocolate brownie. It literally melted in your mouth and I have no doubt would taste great with ice cream. So after all the food all we could to was roll quietly out of the place but we had to make a pit stop at the bar and try a smoked cocktail. I went opted for the smoked cherry Manhattan - it was good, not great as it's not my usual beverage but I supped it up and went on my merry way (literally merry - it was very strong). The only real negative I have is that this is a very busy and loud place so I couldn't really hear or speak to people at the other end of the table which was a shame. But I'm not willing to drop a star on this as the food was just too good.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9a_KGGfDcsu1nRF4MpDRvQ",
        "caption": "Photo of Fire Station - London, United Kingdom. Black and gold burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9a_KGGfDcsu1nRF4MpDRvQ/o.jpg"
      },
      {
        "img_id": "gA7hye_veTJCwF6GJPlZuw",
        "caption": "Photo of Fire Station - London, United Kingdom. Christmas burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gA7hye_veTJCwF6GJPlZuw/o.jpg"
      },
      {
        "img_id": "VKFCoivdAA98v5hkPh-Tmw",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VKFCoivdAA98v5hkPh-Tmw/o.jpg"
      }
    ],
    "user_id": "Ry0REo4iHIAdZv42csbxWQ"
  },
  "CYVhTYNVTI4XjVbQnMZMcQ": {
    "date": "9/18/2017",
    "text": "Good friendly atmosphere. A little pricy but the food was pretty good and the staff was very friendly. Chill atmosphere to hangout grab a few drinks and eat. Fast service as well. We left happy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JcwZDzTds4lG4M70hzuUA"
  },
  "qBvXUdB2ph_JITOh-7L7ug": {
    "date": "8/30/2015",
    "text": "The fire station used to be somewhere everybody knew to try and avoid in the Waterloo area as it used to be very stale and boring and just full of tourists that knew no better. The recent refit has given this bar and restaurant a completely new lease of life. The decor inside is much classier and it's easy to imagine this place as the fire station it used to be. I tried one of the Pizza from the decent selection on offer and i was impressed both with the food and the service. The waiter serving was both very friendly and attentive. There was also a surprisingly good range of beers to choose from. Table service is on offer for both food and drinks which was a nice touch. I look forward to visiting again very soon and I would thoroughly recommend trying the spicy chilli chicken pizza.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_WfIao95LSFq8uftR8qcA"
  },
  "4lNVk08f6C-B_e00gida4g": {
    "date": "7/4/2017",
    "text": "Walked past on way to hotel and it looked pretty lively so went back for dinner. Busy, loud, fun place with a completely mixed crowd of tourists and after-work wind-downs. Limited menu of burgers and pizzas. Good selection of beers and enjoyed a very tasty pizza (with the world's thinnest base). Friendly waiter. Only down side was AWFUL coffee. Apparently they buy their own from South America and get it roasted locally. Waiter said some people like it but a lot don't and removed it from my bill. Would definitely go again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "StKAhM8XdGx6yanvjyPHqA"
  },
  "BFXempbLeVt4F--D-YYMTQ": {
    "date": "2/7/2017",
    "text": "We went here on Saturday night, family of 4 with 2 children (8 and 9 years old). It seemed like a family friendly restaurant with a kid's menu that even allowed them to draw their own pizza. However, they didn't provide and crayons or other pens to draw in the kids' menu. What place gives kids a menu that's meant for drawing and then doesn't offer crayons or pens or pencils???Ordered 2 kids meals and 2 burgers for the adults. Our son wanted a slice of tomato with his burger (which didn't come with anything). Waitress: \"I'm sorry that's not possible, the kids meals don't come with any tomatoes / lettuce\". Huge disappointment. They can't spare a slice of tomato??? I went into the kitchen myself where the cook was very happy to give me a slice of tomato.When the food was ready our waitress unfortunately was on a cigarette break. We saw the food on the counter, but decided not to get it ourselves. When she finally arrived (smelling like smoke which irritated the kids), the food was a bit cold.Quality of the burgers: Poor meat quality. lots of bits of gristle, fat, even a piece of bone, they should invest a few p in higher quality ground meat esp. given the price, the bun and dressing was fineValue for money: not great. The burger doesn't come with fries or anything else. I ordered 2 sides which were 6 pounds, so the burger with sides cost 14.50 - which is not great value.Summary, poor service, poor quality of the hamburger meat, nice decor - so 2 stars it is.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBhSDfeAVdffmZaLh3pszA"
  },
  "A-WTyKyCRF5Kws507VG42Q": {
    "date": "2/27/2016",
    "text": "Lovely place for a glass of wine, beer, spirit or some nibbles within a few steps of Waterloo! Very cool ambiance",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LG3-jjA7RIgAcoLiFuP9LA",
        "caption": "Photo of Fire Station - London, United Kingdom. View of the back",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LG3-jjA7RIgAcoLiFuP9LA/o.jpg"
      },
      {
        "img_id": "gIQubCTLQi4vPO3yfmDu2w",
        "caption": "Photo of Fire Station - London, United Kingdom. View from midway inside",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gIQubCTLQi4vPO3yfmDu2w/o.jpg"
      },
      {
        "img_id": "vSdyGaN05FLBP_TcLiLYUQ",
        "caption": "Photo of Fire Station - London, United Kingdom. The bar and a happy wine drinker!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vSdyGaN05FLBP_TcLiLYUQ/o.jpg"
      }
    ],
    "user_id": "9srxLs05ICl5F3FBDGvlNw"
  },
  "ImlyRwvxSuP3fF5b2lu0Fw": {
    "date": "7/17/2015",
    "text": "The Fire Station's had a classy revamp, and I approve. The cocktails are so more-ish that it's easy to blink and spend fifty odd quid. The pizzas were a bit too thin for my liking (tortilla-thin), but some really good flavours. I'll be back v soon to try a burger off the inventive menu, and the other half of the cocktail list",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kmWfh2fYSLE_snlP0wHMXw",
        "caption": "Photo of Fire Station - London, United Kingdom. Clover Club, spot on",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kmWfh2fYSLE_snlP0wHMXw/o.jpg"
      }
    ],
    "user_id": "ijIUc5Xb7GBZWZbr5uU25w"
  },
  "ZF2n6nSXN51IbyEHk2io-g": {
    "date": "7/15/2015",
    "text": "It's great to see that the Independent is digitalising their articles from the 90s, I found one whilst researching the Firestation following a meal there on Sunday afternoon to celebrate it reopening today after a major refurb. Myself and the girls went down having been invited for a family and friends day via a friend of Sarah's; Alex.In 1994, Daisy Waugh talks about the Firestation as being in one of the most depressing areas of London. I'm guessing it was much different back then (21years ago?!), as now Waterloo area and the South Bank are lively and busy no matter which time of the year you come. Despite travelling on the sweaty Northern Line tube every day in order to get there for work, I am very much proud and grateful to work in such a fun area. I visited this pub/bar during 2011 whilst working in London the first time around for drinks. There was a noisy atmosphere and I vaguely remember ordering a standard style pub platter with onion rings and the like, with a dipping pot of badly served soured cream. Since my second stint in London from 2013 to date, the Firestation hasn't been on my radar at all; not until Sunday. Since closing at some point in 2014, it's been refurbished and the menu drastically cut down to serve just burgers, pizza, cocktails, ales and ciders. In previous reviews, diners talked about the large airy room, due to it's fire station history causing your words to bounce all around. Waugh talks about no menus on tables, but the food lists only written on blackboards around the room; she actually ordered Mussels back in 1994. 21 years later I chose the Pear Fizz cocktail, which came in a tall glass, a combination of Absolut Pear Vodka, pear purée, lemon juice, sugar syrup and Prosecco - it was delicious. Other treats that arrived at our table were the Blackberry and Cucumber Smash, Blueberry Julep and East 8 Old Up.Next up came the burgers and pizza. Served in a similar style to those in today's popular burger bars; on a metal tray and wrapped in a paper. To be more specific I ordered: Maple Glazed Bacon - 6 oz dry aged beef patty, maple-glazed thick cut bacon, cheese, American mustard mayo, sliced beef tomato, little gem along with a side of mixed fries. LOVE being able to have both fries and the sweet potato ones too! The pizza was thin, with plenty of meaty toppings and a crispy, olive oily crust.I was surprised when looking at the menu that it was just pizza and burgers, however they did both very well. There was a range of table styles and the service was good. A big thanks to Alex to sorted us out there for the afternoon!This is definitely looking to be a place that sounds out for good food and drink, for meeting friends or colleagues with the convenience of the station just next door. A cracking burger, which I would definitely recommend to friends. See the full menu at thefirestationwaterloo.c…",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wMPNO54DV9gwhEIIcfsnUg",
        "caption": "Photo of Fire Station - London, United Kingdom. And pizzas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wMPNO54DV9gwhEIIcfsnUg/o.jpg"
      },
      {
        "img_id": "i3MWMXF4eAXKT5tg8JLhUw",
        "caption": "Photo of Fire Station - London, United Kingdom. Mmm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i3MWMXF4eAXKT5tg8JLhUw/o.jpg"
      },
      {
        "img_id": "0XXC5xHO6VnSo9gEdgj11Q",
        "caption": "Photo of Fire Station - London, United Kingdom. A little pear",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0XXC5xHO6VnSo9gEdgj11Q/o.jpg"
      }
    ],
    "user_id": "Ic8KgdZAUVCT87skN_T-XQ"
  },
  "owReg1vS33aA8kQ3h2G6wA": {
    "date": "1/18/2016",
    "text": "The waitress was good, the beer cold my food wonderful. The inside is huge and open feel, with a large bar as well. Minimum decorations inside, I was expecting more Fire Dept memorabilia. My Burger was delicious and drink suburb. The outside is beautiful and next to understand and over ground transportation. Would go again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y5J-fIOBlNSt8hG8Zq2JHQ",
        "caption": "Photo of Fire Station - London, United Kingdom. Waterloo rd",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y5J-fIOBlNSt8hG8Zq2JHQ/o.jpg"
      }
    ],
    "user_id": "8v-_2SiiRoviW5gyI_JIsQ"
  },
  "T2yzD0uMdwx140nAzRL34g": {
    "date": "1/3/2017",
    "text": "Been there twice in two days. Once for brunch and one for pizza. Both were great and I'll probably come back next time I'm in London! Nice atmosphere, great service and good food for a pretty fair price.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ASCuJUP1wLaVdaQZwOzTog"
  },
  "OOHWhN45fIczI7zdzDnWuw": {
    "date": "7/9/2016",
    "text": "Friendly staff. Interesting beer selection but nothing i personally would like to drink on tap. If you're into IPA's and random not known brands of beer this place is for you. No Guinness and no Budweiser. I got a Apple cider and it was yummy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cG5l8U9R8PPOL5Ktr9bg3Q"
  },
  "S4sSrsnumVA6cK_71_P11w": {
    "date": "11/4/2015",
    "text": "Excellent service and food for brunch - duck eggs, sourdough and smoked bacon. Very good coffee.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cD8XpJ_Whu3wyxuahYfePw",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cD8XpJ_Whu3wyxuahYfePw/o.jpg"
      },
      {
        "img_id": "qREuOi3o_cjUOhIvzjcYqg",
        "caption": "Photo of Fire Station - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qREuOi3o_cjUOhIvzjcYqg/o.jpg"
      }
    ],
    "user_id": "GBpbL3QJArHS81LiZ9xaPw"
  }
}