{
  "XRrFeucxY0Nxg0ovywdDxg": {
    "date": "7/16/2012",
    "text": "It's not traditional Japanese. I give four stars because of its creativity of the menu.It's a bit pricy.If you like Sake, try Zuma's cocktail with Sake. I think it's quiet unique.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IrwLjCt5g89Lz3zV86JCcA"
  },
  "eP0kNT2Uv6IvYW1-5CYfhA": {
    "date": "1/31/2011",
    "text": "Zuma is a hot and chic spot in Knightsbridge. It's definitely pricey but;- Great food and drinks- Sushi and sakes are great. They've 40 different sakes in the menu. - Service is excellent- Dress code is, 'dress to impress'I highly recommend trying the black cod!! It's a must. Also try unagi bo zushi!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GXHIVAW2swF320pEsEVWhQ"
  },
  "exv1TFcfHYMfmLjTXZfeVA": {
    "date": "11/26/2011",
    "text": "I REALLY wish I could give this place 5 stars. The sushi and sake are to die for. But, the only setback was how incredibly rude the hostess/ \"person that sits at the front desk\" was!So it was raining VERY hard the night that I came here. Our hotel was just a block away so we thought we could make it without getting too wet. We were wrong. So we came in with wet jackets and slightly wet hair. We didn't look gross, though. (God forbid we wreck their scene of \"hot' people) We just looked like we got caught in the rain.So as soon as we got in, the beautiful, blonde, hostess sneered at us sarcastically saying, \"May I help you?\". We had reservations, of course, so we told her our information and she reluctantly searched for our reservations. After about 3 minutes she found our reservations, looking annoyed that she even found them. She then said, \"You guys should get rid of those wet jackets...\" and paused. After 5 seconds of awkward silence she sighed and said, annoyed, \"I can take them...\".At that point I wanted to shout dramatically, \"Do you know who we are?!?\". I didn't, of course. I guess I came in with a sour attitude to start with because of the crazy weather, but still!Other than that small incident, our waiter was amazingly friendly  and the owner of the restaurant even stopped by our table to see if we were enjoying our sake.To make a long story short, I would definitely come here again, despite the bi*chy host. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i97Phc0tThjZWSJ3TCuCnQ"
  },
  "zZm9BJU83f7WuFAzSc411g": {
    "date": "5/2/2012",
    "text": "Oishi!  I was in London for fun, and this was a fun, super-hip place to eat.  The sushi was very good and the scene was great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gCM4uOiAMMDu4YTtt79z5A"
  },
  "gLnnN-nSAMlVhYgSakvWkw": {
    "date": "3/6/2010",
    "text": "I recently went out on a date to this restaurant. I'd heard of Zuma mainly through magazines where celebs had been spotted. On entry the interior is modern/plush and there is a bar section to the right, where apparently lots of hot women go to snag a wealthy man - you men are soo lucky :-) My date knew the owner as a friend, so he managed to get seats in the section where the cooks are opposite cooking. I wasn't too sure whether I would like the food, but boy was it amazing! I had crab and spinach for starters, steak (small pieces) and black cod (you have to try this), finished off with warm chocolate cake and icecream - heaven! The service was excellent as the woman who served us was very friendly/approachable. Zuma is probably the best place I've tried so far. It is expensive but a very fashionable/trendy place and definitely worth a visit...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Udi8xEcOY7CSmvC4pJVMRA": {
    "date": "3/22/2009",
    "text": "What an amazing place... the decor is stunning and the food is incredible.You do pay quite a lot- but it worth it. The only thing I did not find that great were the desserts.We sat in the bar area which seemed a little more casual then the rest of the restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t54GdWdoHiR3eZfx3jvVIA"
  },
  "1fZ3fP9QWAxKT3YEOD0PXg": {
    "date": "1/18/2009",
    "text": "Fantastic Japanese fusion restaurant in London.  It's won several awards and rightly so.  Great sushi and tempura, and then the black cod and wagyu beef are their specialties. The bar is excellent as well - recommend the Passion Bellini or Watermelon Martinis.Be sure to book at least 3 or 4 weeks in advance for a weekend, and beware that you'll get moved in and out of the restaurant pretty quickly - staying for longer than 2 hours is difficult.  You also pay for what you get, but well worth a viist.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "4wiDq3nNS8QJFlZ7_R7ofQ"
  },
  "Uc0qxERUAki_KAWQ9GzyfA": {
    "date": "2/16/2009",
    "text": "This place was recommended by my trusty concierge at the hotel. He was able to secure a table for us at the last minute. When we walked in and saw the decor and the kitchen area, I was a bit worried - it looked like a typical fusion place where they make anything from sushi to teppan-yaki, yaki-tori, with no specialization. But as soon as we got food, my fear disappeared. Wagyu beef plate we had was absolutely amazing - so tasty, juicy, and tender. Our server was a Japanese girl and she knew very well about what the restaurant offered. She was fantastic.  After a bunch of yummy dishes we had, I wanted to have some typical closing items in Japanese meal - steamed rice, pickled vegetables (tsukemono), and miso soup. Although the menu did not have pickled vegetable, our server managed to get some for us (was good, too). Along with hot green tea, I was a happy camper. After all, I would give them:Food: 5, Decor: 5, and Service: 5+",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "XsoKjYowvB4XEei-YRG7Yw"
  },
  "AVadJopC4v8cmIl67MotNw": {
    "date": "3/2/2014",
    "text": "Totally worth a visit. Food was delicious. The lobster was amazing! So was a sushi roll they were experimenting with. Don't remember the name but it was glash fried beef carpaccio or something. You need reservations. The place is crowded all night, every night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eM6ubkY4XTReLtJlmYfnhQ"
  },
  "J9-x3vqpFC6ZLOBCGFTGRg": {
    "date": "12/13/2011",
    "text": "After a bit of a random disorganised day, two friends and I hung our heads as Harrod's closed in front of us, withdrawing all hopes of a hot chocolate on a cold winter afternoon. Stocking up on some emergency supplies (caramelised popcorn for one, sausage roll for another) which we devoured, I brought up none other than the qype app on my iPhone (possibly one of the best things about the iToy!), to look for some emergency sustenance and prepare the foundations of plan B, since plan A (hot chocolate at Harrod's) had failed miserably. In the nearby listings, something crept up to the top. It had 5 stars. Out of 5. This was the average from 35 reviews. I figured Hey, this has got to be good! And proposed it to the boys. A few seconds of umms and errs quickly morphed to us all walking over round the small lancelot street to get to raphael street where Zuma hides. As we turned the corner, it looked like we might have gotten lost in an alley. Then we got to the doorway. Golden light streaked out, warming the stone that lined the walls. We walked into the warmth, spotting the beautiful hostesses who were welcoming despite our lack of reservation. We could be seated at 20:00, she said. It was 18:30. I turned to my friends and explained (in french) we'd have to wait for an hour and a half. We all shrugged. And raised eyebrows when the hostess continued our conversation in fluent French. A nice touch. We spent a very happy hour and a half at the rather crowded bar, where we watched lovely waiters handle bottles in ways you didn't think bottles could be handled, pouring double or triple beers one-handed, and generally shaking and stirring things up like nobody's business. I had a kiwi bellini. I think. Not that it matters. It was delicious, layered in flavours, and generally to be had again, and again, and again. Well, maybe one again short of that, given the £12 price tag At 20:00 sharp (I was very impressed with the timeliness) we were seated. Mesmerised by the sushi masters, it took us a while before we opened the menus and drooled over the contents. Ordering was quick and painless, the food arriving incredibly quickly. We shared all dishes, being mediterranean. And frankly it's the style of the place. Every single one of them was SO delicious! A complete symphony. The sweet, the tangy, the spicy, the crunchy, the smooth melt-in-your-mouth salmon teriyaki, crunchy spicy fresh and perfect calamari. So perfect, in fact, we ordered another later on and when the kitchen somehow lost track and made a third, our waiter brought it to us, laughing, saying he was sure we'd appreciate it more than anyone else. We did. We SO did! At the end, you had to roll us out from the food we ate. And we had wine. Given our bill came in at under £100 for each of us, with the wine, and we were quite stuffed with the most delicious food we had every had (well, the best seafood, that's for sure), we thought it was an absolute bargain! We'd all go again at the drop of a hat, should anyone find a good enough excuse. Or a poor one. Any excuse, really. I just want to have my eyes roll back and my mouth be stunned at the delicious melting softness of that salmon teriyaki. Truly. You have GOT to eat there. Even if all you can afford is one dish. It'll be the best thing you ever had. I promise.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tbOylo9amEE95kyeAXaigA",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tbOylo9amEE95kyeAXaigA/o.jpg"
      },
      {
        "img_id": "wOMvQfpNSqnBZ2oKFallBw",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wOMvQfpNSqnBZ2oKFallBw/o.jpg"
      }
    ],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "bfrz2OAVBr7Ae2UOSQv_3g": {
    "date": "2/6/2011",
    "text": "This place was a disaster!  I was looking forward to a posh sushi fusion lunch with friends celebrating a birthday.  The first server was aloof--it only took 20 minutes to get my drink ordered.  And from then on it was like trying to hail down a black cab at rush hour in the City on a rainy day--waving them down to take our food order because we only had the table for a limited time, hailing them to refill empty wine and water glasses--it was exhausting.  When the food did come out they plopped it down wherever they pleased and people had ordered specific dishes so we were passing plates to and fro.  Not to mention when they did bother to place a soup with the right person that they basically reached in front of someone to set it down.  But it wasn't just a problem with the service--it was a problem with the kitchen too.  I ordered a salad with asparagus.  Well, it came without the asparagus--so again had to hail them down and with my chopsticks toss my salad to show them there was no asparagus!  My friend who had been there many times complained to the front of the house and we had a free dessert.  The food was good--the aubergine was quite memorable, but the experience was so bad it left a sour taste in our mouths.  Oh, and not to mention they put an extra pound on the bill to give to the charity of their choosing.  WTF?It was also weird how many young kids were there on a Sunday, which also was a mega buzz kill.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "ILVJ-ssfIdJlCtOwE9-Xfw": {
    "date": "1/19/2009",
    "text": "This place is absolutely amazing. I've been a total of four times and never been disappointed. I could go on all day about what to eat, but I've never really had anything bad there. A few winners, however, are the Black Cod, which is absolutely incredible as well as the Wagyu Beef, which is also perfectly seasoned and so juicy. The massive tropical fruit dish at the end is also a winner for dessert and is a perfect way to cleanse the pallet. The decor is awesome and the waiters and chefs have always been fantastic to me when I've been there. I've heard getting a table here is a bit hard. I've been lucky enough to always go with footballers, which means instant service and great treatment. If it means anything and shows how much they care, Cesc Fabregas, Philippe Senderos, and I all went in one day for an unplanned lunch and, despite the restaurant being completely full, managed to put a table together for us. Service with a smile...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "8k4y8CvcC5oL-rKFMxHb0g"
  },
  "3wnqSvfs53My0msIA0YM6Q": {
    "date": "5/11/2011",
    "text": "Absolutely fantastic.  Really, some of the best food I've ever had.  We tried a range of things on the menu and everything was amazing (even the mysterious looking fresh tofu), but the showstopper of the night was the marinated black cod.  Also, all of the beef dishes were incredible.  Too bad the service was poor and the hostess a little rude (this was partially our fault, as we were late for our reservation - even so, the scolding we received was a poor start to the evening).  Despite the mediocre service and the escalating cost (those small plates really do add up!), I hope they open a New York location soon!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Kb_FT1ni64SBuOqVl6tVcw"
  },
  "FauFcgFBzXgcCfhgz6VpGQ": {
    "date": "2/6/2012",
    "text": "Zuma=the best sushi in London. This is a quality Japanese restaurant,that I save for special evenings and special people :) A Japanese dining experience only to those who can truly appreciate the delicate flavours, the scents, the taste that lingers on your tongue, and the beautiful presentation of it as well! the restaurant is very stylish and beautiful, the staff are so kind and knowledgeable, and the food.oh the food.organic, delicious, authentic Japanese dishes  I'm transferred to Japan the minute I set my foot in there, amazing!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QSQ25xoU3_GIpCsMf7Tzhg": {
    "date": "6/5/2009",
    "text": "Go early, drink wine and feast on freshly cooked food. It's more of an experience than a meal. Take it all in and make sure you order some champagne, you will see why as your drinking it.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZBXVX-Wn4Ej01o_976gpYA": {
    "date": "4/17/2011",
    "text": "as a visitor to london, i was impressed and highly recommend itgreat decor, atmosphere, and food (both sushi and robata grill). service could be better. the restaurant and bar were full on a wed night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wLQgNfOvJtJWFkYNHdFoxw"
  },
  "8-6ql3WpI21mnRsTdBiCow": {
    "date": "12/17/2011",
    "text": "I have eaten in zuma more times than i care to remember. This restaurant is a definite hit and miss. The standards have slipped, it used to get it spot on each and every time,unfortunately those days are gone.The sheer amount of waiting staff is amazing especially when you find it a struggle to get any attention from anyone during the meal!In my experience the weekends are terrible for the food as it becomes a total mess. You can also come across attitude from the door reception which is shocking considering the sushi bar has a no reservations policy.Very expensive to take the gamble especially considering the higher standard of  london restaurants for the same price (and indeed much cheaper).A see and be seen restaurant rather than a culinary revelation.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPrEHeYY-Q1rMQ6LxmlzEQ"
  },
  "HET-ZH1cc2VgWWZth9uS1A": {
    "date": "6/6/2011",
    "text": "5.30 I arrive from work. Sitting at the bar with a girlfriend, drinking the amazing rhubabu (rhubarb, passionfruit, sake cocktail) Over the next 2hrs, a steady stream of 'working girls', clearly of eastern european origin, arrive and leech onto the first sad soul who will give them the time of day (and a drink) They're easy to spot- usually two come in together, buy one glass of sauvignon blanc to share, and then find a man. Usually old and fat, or young rich and socially inept. Possibly the most amusing place for pre-dinner drinks anywhere in London. Dinner is best at the grill bar- often a little too hot for comfort, but way better atmosphere, and cosier, than the dining tables. The salmon and tuna tartares are divine, as is miso black cod. Actually pretty much everything i have ever had here is lovely... As you would expect being in the heart of knightsbridge, it is not cheap, but I think money well spent.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "x0NkK9qmkL6hAUpJXAwFMw": {
    "date": "11/1/2011",
    "text": "This is our first visit. Having chatted to friends and reading through the critiques we had been stop hopeful for dining here. The service was pretty superior. Very attentive. The atmosphere was satisfied yet inviting.They go the other distance to confirm their guests are happy.This became the most beautiful snack That I have ever had!I recommend this restaurant for anyone who loves cooking. Very accomodating staff members, and always there when you really need them.The sushi culinary chefs are fantastic simply serve the finest sea food. I've encouraged this eating house to quite a few, many folks and none of them happen to be unhappy!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "H0ssLfdHmIszDs5ABRwO_g": {
    "date": "5/27/2008",
    "text": "A very smart Japanese restaurant ,with popular bar.Top end prices, but bar and restaurant have that buzz.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DQ3uWRhIzZdrj3dG1K_twQ": {
    "date": "7/6/2011",
    "text": "More photos and stuff herehungryinlondon.com/2011/…  Zuma is a restaurant for special occasions. It is part of a small world wide chain with subsidiaries in Hong kong, Istanbul, Miami and Dubai. You might be able to get away with a semi-affordable bill when ordering carefully, but in the end you will want to splash out. Zuma invites to decadence and gluttony, and at this night, for my birthday, I was part of it. In London, Zuma is located in a very ugly building not far from Knightsbridge tube station and doesn't look like much from the outside. When you enter it however, you feel like you have stepped into a night club or into one of these bars I never go to because I refuse to pay 15 pounds for a cocktail and I usually don't confirm with the dress code. Surrounded by the young, rich and stylish I was glad I had dressed up for this special occasion feeling like a real Chelsea girl, wearing something rather short together with very high heels in the form of my almost virgin golden Sergio Rossi stilettos. Sipping my Saffron and Poppy Seed Martini (10.50) I was waiting to be spoiled. I really liked Zuma, in fact I liked it about 1 million times more than the only other posh Japanese restaurant I have been to in London, Nobu Berkley Square. LIKE 1. Lovely staff: Even though we didn't have a reservation the lovely people at the counter found us a place at the sushi bar within 10 minutes. Friendly and forthcoming they had nothing in common with the pretentious waiters at Nobu.2. The menu: I liked the fact that in addition to some astronomically priced dishes they do have a good selection of dishes costing less than 10 pounds.3. The wine: There are also quite some wines for under 20 pounds, which allows you to maybe order a couple of dishes more4. The food (see below) was sublime. I loved the fresh and exquisite ingredients, the exotic and well-balanced sauces and the inventive take on Japanese food without losing the traditional touch. DISLIKE 1. I really wanted some cold sake to go with my Japanese delicacies, but they were out of the two cheapest sakes! (19£ and 29£ respectively for 300 ml). We did not go with the next expensive one (40£) but had wine instead. Wanted sake though! 2. The Sushi Counter: the person who designed this should lose his/her licence really. The broad stone surface gives you plenty of space for all your plates but underneath  this is a completely different story. Even I with my 5.3 ft had no idea what to do with my legs. Not only was there absolutely no space, the inside surface of the counter was ragged, which not only destroys stockings but also hurts! This reminded me of the story that I once heard about McDonalds, where they intentionally use tilted chairs so that the customer does not feel to comfortable and doesn't want to linger. I wonder if similar incentives were in the mind also of the people behind the Zuma interior design?3. Why don't they put prices on their website? I really don't like this, people should know what they are in for. And while I'm at it, did I mention that I HATE websites with music? Anyway, the most important thing is the food, here we go: Suzuki no osashimi (12.60)  thinly sliced seabass with yuzu, salmon roe and truffle oil  one of my favourite dishes Tokodai wafu asperagasu (5.80)  beautiful fresh and with delicious wafu sauce and sesame on top. Shitaki Mushrooms (4.80)  tender and garlicky this was a rather generous portion for not quite 5 pounds. Chicken Yakitori (5.80) Yellow Tail sashimi (8.00)  boring compared to the other dishes. Unagi Nigri (8.80) however, was all the better. Aubergine (8.60) something Inaniwa Langustine Noodles (14.80)  this was one of the specials, the chilled noodles with the sweet langoustine and the ripe mango were very pleasant indeed. Wagyu Beef Sushi with Black Truffle (27.50)  loved the raw beef melting in my mouth together with the subtle truffle flavour. Expensive but worth it :) Banana and Green Tea Cake with Peanut Toffee Sauce and coconut ice cream (8.80)  weird combination but worked somehow. While I didn't pick up the green tea flavour, the soft and juice banana cake was all the better with the sweet and salty peanuts.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Lu_fcu11J62ZPyk4_OXS2g": {
    "date": "8/31/2011",
    "text": "One of my top 5 restaurants in London. The food, atmosphere and people are perfectly aligned.  It's the only place I have been in London that has it's own sake sommelier, who on each visit has recommended something uniquely outstanding.The food is excellent and the calamari is the one dish on this planet I would travel across oceans for.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rH3PyJs18U4hi201Yt_SuA"
  },
  "hVB-eKVC_nkTpgAAlJQ1Eg": {
    "date": "5/12/2010",
    "text": "WOW! Killer amazing scrumptious food and perfect mixed drinks. Sit and be entertained by the chefs, relish in the ambiance, glance around at the beautiful people...only downside is when the check comes. Doh!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "0B3WbaM1hnn3Xut1bitSyw"
  },
  "SJzTe6RQbpOM4pnLaOjZOQ": {
    "date": "7/15/2010",
    "text": "Zuma is not a place for a casual meal.Zuma is not your average sushi-carousel lunch joint.Zuma is a lean, mean, dining machine.And you know all this because Zuma's still there after many years of business.  Although I used to not fully understand why sushi has to be so expensive, Zuma changed all that (along with Gari in NYC) by showing me that eating sushi is an experience.  Try the unique, off-the-wall items and soak in the atmosphere.  Last time I was there, the service was pleasant and efficient even though it was a busy night (even with reservations, we had to wait for our table -- of course, this may be because we were late...we may or may not have gotten lost) but relax.  They take good care of you.  So come, eat lots of amazing food, and walk away happy.I cannot wait to try Zuma again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rfGeOOIHw0wcX3ibAzTqTA"
  },
  "7FD2XO9nYw5lkIGzsWBkEA": {
    "date": "5/27/2010",
    "text": "Amazing sake selection - if you're into that sort of thing. Stopped by here after a show, and I was a bit taken aback from how trendy/cool this place is. Felt a bit under dressed compared to the scantily clad women prancing around in sequins. Super crowded and it's def a place to go if you have money to buy all the expensive drinks or if you're a gold digger. =)",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "lxvVnNWEqR4bV5ZGuQiRkw"
  },
  "LodBLvuYFMFt8Gh4RnsfBg": {
    "date": "6/2/2013",
    "text": "Zuma is one of my all time favorite upscale sushi chains. With a presence in most major international cities its a go to when traveling and craving sushi in a upscale setting. I prefer Zuma over Nobu, Bond St, and Blue Ribbon three of the other most recognized upscale sushi chains. This location is very busy so make sure you make a booking in advance, we went on a tuesday night and were able to squeeze into a couple bar seats after ordering a few items and bottles of saki while standing. The service is great as expected from a restaurant of this caliber. 4.5 for the food and 5 stars for the scene. Many celebrities frequent this place so you never know who you will run into. Great fresh sushi, the lobster was also fantastic and the saki list was impressive. If they have butterfish available that is a must try!  Zuma deserts are also always a must!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r7--B7MG4TGBATfo1USoqQ"
  },
  "Fcw8yLh5epiw2spxIDeNdw": {
    "date": "4/19/2010",
    "text": "Without a doubt, pretty amazing.  You walk and and you just want to hate the place - it looks too trendy for it's own good and you'd often find yourself tripping over a Ferrari or two parked out in front.     But the food revives it and begs you to come back for more.You need to get a few things out of the way first:  It's going to be so loud that you'll struggle hearing people at your table.  It's going to be so busy that you're going to fight to walk to the loo and you probably won't get seated on a Tuesday without a booking.  The portions are not going to be big.  And you're going to pay.   But it's worth it.To die for:  Spicy Lobster, Wagyu Beef and the lamb chops.  Probably the best prawn tempura sushi roll I've ever had.  Anything from the robata grill is cooked perfectly and simply flavorful.Hint:  Escape a bit from the massive crowds and book a private room in the back, which is slightly separated with perforated wooden blocks.  But you'll have to take your shoes off before you sit...",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "9TYpecJwv-HtNJtadramWQ"
  },
  "Vy3pS7l9ZF5E4OjhGyJUTA": {
    "date": "2/26/2012",
    "text": "I think I've made my view on sushi in London clear.  You can't get good sushi without going to one of the fancy places: Nobu, Nozomi, Roka.  Add Zuma to that list.  Finally made it to Zuma after living in London for year.  Don't have any \"pull\" so had to book a few weeks in advance.  8pm on a Wednesday and was very busy, with not even a place around to bar to stand.  Wasn't seated til around 8:20 which didn't bother me but it's something to note.  I'll start with the meal: I was craving sushi rolls so ordered a dynamite spider roll and a spicy tuna roll. Both were exactly what I wanted and were far above average for sushi rolls.  Next we ordered sweet potato with teriyaki but wouldn't order it again.  Next up was beef tenderloin with sesame and it was excellent. Can't remember the rest of my order but I was very happy with the food and would go back for it.Now I'll get to the clientele of this restaurant.  It was a mix of businessmen, and old men with young women.  Basically, don't go to this restaurant with anyone ultra-conservative (although I wouldn't really expect them to want to go anyway). The ambience was quite nice though, dimly lit and not too too loud to chat (although I suspect the noise level would increase on the weekend)So all in all, I wouldn't say that Zuma stands out as any better than the other high end sushi places.  But if you've gotta pay a certain price for good sushi, you might as well as this to the list.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1E2BjIbh6bJV-acj8TcMRQ"
  },
  "SXNwmo7PqWTdpLJsgZmQHA": {
    "date": "2/27/2011",
    "text": "This place is Knightsbridge at its best!The food is delicious and unique. Yes, it's expensive, but you totally get what you pay for here. I've been here for lunch with a group (we dined in one of the back private rooms, which was a great, personalized experience) and for a date (we dined in the main restaurant, which is louder and busier but has a great vibe). Go for sushi and lots of it - don't bother with much of anything else because the sushi is just that good!The bar is also awesome. I've been here for just drinks and it's a great time. The barmaids are attentive and make excellent cocktails. Plus, there is a good selection of wines by the glass. A few notes:- You generally need a reservation here, so make one!- The bar closes pretty early (before midnight if I remember correctly) so get there early and head out afterwards- Get a private room if you are 6 people or more - totally worth it!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORwNL8m2a_iKY44eTcE5ZA"
  },
  "uHcqwFtjeTAkoBZleZZCQg": {
    "date": "10/7/2012",
    "text": "Decided to visit Zuma on a Friday night without any reservations. It took about 2 hours to get a seat at the table, but you can sit and the bar and people watch. The crowd alone is interesting to attract an audience. If sitting at the bar please try their take on popcorn made of tempura and sweet corn (it was wonderful). We had the tasting menu and it was amazing. A bit too much food but the sushi was incredible and every dish was interest. I would place this place above Nobu in NY when Nobu was at its height. It is expensive so be prepared to spend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "snuZEFZV0wHLHCZ08EtnbQ"
  },
  "ZEizakcpX1ELlsTLZzko8A": {
    "date": "11/14/2012",
    "text": "went here many years ago for a birthday celebration. having amazing sushi, wagyu and cocktails was a gimme at these prices. that being said the service was great and the surroundings immaculate. recently returned for a drink and late night bite, arrived around 1030pm and with a little bit of persuading (said we'd be less than an hour) was sat at a table for 2. stuck to the nigiri ~ toro, salmon, mackerel, kingfish. expensive as shit but was beautiful, like butter. traditionally made. jiro would be proud. peace.ps. great people watching. yourself included.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "gyFA0viikEVkmB9y7rWrtQ": {
    "date": "6/8/2012",
    "text": "This place was amazing! One of the tops restaurant I've ever been to for sushi in London..  Atmosphere was great.  Waiter/waitress are very friendly and knowledgeable of the menu and will offer their opinion.  I like that ^_-.  Beats going to some restaurant where  when asked what's good here will say \"everything\"? or \" I don't know\" and they always have this stupid look on their face when doing so.  Sake was good.  I especially liked the Edamame.  Edamame was seasoned with this special sauce that just was so good!I give this place 5 Stars! and I would definitely go back again.  In fact i'm planning on returning sometime later this week. but this time with reservations!  you should make reservations in advance or you might have to wait for at least half an hour and will be seated at the grill area.   Which can be a bit hotter.  If you prefer to be in a  warmer environment then fine but if your body temperature is normally hot maybe booking reservations in advance is the way to go or you will get seated at the grill area-Just a heads up**",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyyXISpOlSDIfmYIa4NCdQ"
  },
  "AqM_Q5C5J_I_oUXl9BevXA": {
    "date": "3/5/2015",
    "text": "Best fish in London!! I really enjoyed it. I think they could upgrade the style of furniture. If you look for clebrities, that's the place to go. Pricey but worth it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SjQaXrFaFeotne8rxeSb-w"
  },
  "2W8bONCzAQko3zKSzEu39w": {
    "date": "8/13/2013",
    "text": "FABULOUS sushi and Japanese fushion food. I came here with 5 other friends for lunch and had a fabulous meal. We all had some cocktails, which were delicious, then ordered a lot of food to share. The sushi was to die for, some of the best I've ever had in London or New York. I also enjoyed the variety of interesting dishes on the menu. The popped corn was not to be missed - it's basically corn kernels tempuraed and served with salt. The service was wonderful, as to be expected in a restaurant of this calibre. Lots of ladies who lunch and well dressed international business types. Quite pricey, as to be expected. Lunch (with a few drinks each) set each of us back about £100.I'm a fan.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bM_NzncMfTCwS9TJYvyTNA"
  },
  "-xMgCQQPcXRv_mdqmQ5ktQ": {
    "date": "9/29/2009",
    "text": "I love Zuma.  I have been there a few times and I have loved every dish and every cocktail I've tried.  I don't love the prices so much, nor the 19-year old prostitutes who hang out at the bar, or for that matter the man receiving a blow job in the ladies bathroom last night, but all-in-all, gotta love Zuma.The Saffron and Poppy Cocktail is to die for, as is the Rubabu which is rhubarb-infused sake with vodka and passion fruit.  The cocktail with Johnny Walker is also fab.  I would go there just for the salmon and tuna tartar and the drinks, but order as you wish!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "AZELL74VBNkYP8Z3G5DAHw": {
    "date": "4/12/2013",
    "text": "The Japanese cuisine is kind of a new passion for me. I'm keen on exploring the new exciting and appealing taste of the meals. You should forget about the high prices and simply enjoy the delicious main courses and desserts. I find really good the Yuzu lime pie and the California Maki with crab and rich flavour of avocado.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lLWJu6dsLt4V0aVe7X1k3Q": {
    "date": "12/8/2012",
    "text": "Food served was average and the service was also not up to the mark. The sushi served was good.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lwszK16RgndAauu0ZAdkMQ": {
    "date": "5/22/2010",
    "text": "Zuma amazes the palate from start to finish and was one of my all-time favourite lunch and dinner spots during my time in London.  I feel very confident in recommending any dish on menu but particularly like the pork belly and agedashi tofu.Go.  Enjoy.  Bravo!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDofmxUbwB2ap0rfVxS4dg"
  },
  "kzc9Ie7kuk3vFDszOqBnPQ": {
    "date": "10/6/2012",
    "text": "Zuma is a very, repeat very nice place for an enjoyable eveningPlace is crowded when we got there around 9pm and despite having a reservation need to wait a little while.Bar / lounge scene is worth it just for that.  Definitely a see and be seen scene.  Great decor, music.  More on this later.But first we had a private dining room, which was very nice.  Great service.  Our waiter made some great recommendations and generally helped us out.  We got the sake sommelier to hook us up with some nice sake.We started with some sushi, fresh and very nice.We had a number of the grilled items for sharing: seabass, squid, several beef dishes, chicken, tofu, vegetables, etc.  All were spectacular.  I especially liked the chicken - very tasty, although done a little rare as is common with Japanese places.We split the chocolate desert and the banana cake.  Both were outstanding.So after dinner we met some friends in the bar/lounge area and just hung for awhile.  Lots of fun, nice place.  Too bad they close up a little early.All in all I add Zuma as a must go to place in London.  I love Japanese food and this place has a great take on modern Japanese in a fun atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJRCosXXCBs5S5HNggS_Mw"
  },
  "_cYncdNT8XdeCIM-uV6XHQ": {
    "date": "9/7/2014",
    "text": "Very creative sushi dishes, and of course a not-to-be-missed \"scene\". ;-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCiAn7esOAh9LRsSM65SSg"
  },
  "AT3Kif4ZSRwQIcE1cJJQeA": {
    "date": "12/16/2013",
    "text": "The food here is really, really, stupidly good.  There was basically nothing we ordered that wasn't absolutely top-qaulity in presentation and taste:  the black cod was as good as everyone says, I am still thinking about the steak tartare (seriously, I'll be back just for that), the fish was all top-quality, and even the dessert (green tea banana cake) was special.  Next time I'm in London, I'll be back.So why only four stars?  Because the service was worse than awful.  I've been there twice at the sushi bar, and both times (different) servers seemed really irritated to have to bring people food, take orders, get drinks, etc.  Both nights (with different people) we were forgotten about for stretches of time, and both nights there were really odd pacing issues with the meal that didn't seem attributable to the pace of food from the kitchen.So, while this place is worth a trip--the food is that good--the service keeps it from being among the very best of the best.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjKG1aPrQ1-ykyl7uThzLw"
  },
  "m4q-VDewLCUZ2yEUtC0TAA": {
    "date": "11/2/2015",
    "text": "My absolutely favourite! I love love Zuma. The atmosphere, the flavours everything about deserves 5 stars!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7zGrvg3CjukNXS4CZRvmQg"
  },
  "ZyR4LMDCgUMmWnJ-wbZvUw": {
    "date": "4/11/2013",
    "text": "We were a party of 10 people, it was a Wednesday, and the joint was packed and in full swing. Our group didn't have to wait much to be seated (reserved for 7pm), and once we were there the army of attentive staff just kept it all coming with impressive efficiency.Zuma is all about the 'family style' arrangement of food, and the host of our particular group did just that as he proceeded to order a large selection of dishes for everyone. Once the first platter arrived, it seemed to never end as we were brought plate after plate of beautifully presented and masterfully crafted seafood, fish, and meats. My glass never stayed more than half empty either which was comforting, as the sake (they have many to choose from) was a delight.Since I didn't actually do the ordering I have no idea what the dishes are called but there were a few notable things you should look to try when you go.-Chopped scallops with a wasabi dressing of some sort-Black Cod (i'd heard of this in other reviews, and my god is it good)-sweet corn tempura dish kind of looks like popcorn and is highly addictive.-The sashimi is also top notchThe only thing that was slightly unpleasant was that we were effectively asked to make way for the next reservation toward the end. As far as I'm aware they give you some sort of warning beforehand about this, but after an enjoyable night with a hefty tab mounting it's not so nice to have to go stand at the crowded bar again when all you want to do is sit back a bit and carry on the conversation.However, all that aside, Zuma was an experience I highly recommend and the food was really quite excellent. Go check it out.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8yzxyr2fLeeDOhmmtS2kA"
  },
  "bOnAlsZjYyFvAUYS-EnGXQ": {
    "date": "5/18/2011",
    "text": "I know a lot of fellow Journalists love this place because of the diversity of food and - as the Lords who run my Journalistic Manor are kind when it comes to my expense account - I have eaten here on a number of occasions, but mainly because it appeals to the victim I have chosen to eat out with and pump for information. Therefore, working on the basis that the snitch is always right, until they spew out the goodies, I have been accommodating.Would I choose to eat here by myself or with a friend? No!Why? Well, to be very frank, the cuisine is not always constant. Whether the owners have a dose of 'Change the Chef often before he get's lazy' or whether that character is fickle, I have no idea. I haven't attempted to grill him to find out. I only take the bright lights to put in politicians eyes, besides, Chefs are usually already conditioned to heat.I am presuming that the restaurant was named after Zuma Beach in Malibu, California and the owners have spent time there watching the Beach Babes and not enough time watching the staff - or perhaps too much time watching the staff nick the silver, because every time I have been there, I see new faces, but same type of menu. Which I should mention always looks superb on paper: asparagus tempura, crispy fried squid with green chilli, wagyu beef, black cod with miso, and sushi etc.I am prepared to say, in defence of the place that anything that hasn't been well cooked is not usually my cup of Twinings, therefore, perhaps my comments could easily be put down to seeing too many people eat Sushi. Then again, being a person who likes consistency and good service, I do try to be objective. In that department I must say they really never came up to my standards. But, as I could say the same about Horror Films with giant crabs in them, you can swallow all my criticism with a light grain of salt.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1A48Yf55jHOM5dolYqlO0Q"
  },
  "NKe-GagXqMu10B_2C-eCWw": {
    "date": "4/11/2015",
    "text": "Honestly the food was better at Nobu. The king crab legs, one of my favorites, were lackluster. That said, the scene is better here. The cocktails were awesome though. The Hentou (sp?) Sour was amazing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lFt24ItwS0O4Qo8OHKeO8g"
  },
  "PTi6kOWpbtRSJxfP11qr6w": {
    "date": "5/5/2012",
    "text": "Consider this half of a review. I didn't eat at Zuma so I can't tell you about the food or food service. But as a lounge it has a swank decor, plenty of space, low lighting and an upscale crowd. This is the kind of place where you dress to be seen and while you're at it, take a look around yourself. It's definitely a good place to go for a pre- or post-dinner drink, especially if you want a sophisticated feel and large beverage choice. Not for the weak-in-the-wallet types.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "ShGlFRtJiieW3r1kScprbg"
  },
  "5mVjjlMjZR2abeGBd3dDLA": {
    "date": "2/23/2013",
    "text": "AMAZING SUSHI!! I was beginning to give up on sushi in London and this has redeemed my faith.  The sashimi small plates are INSANELY DELICIOUS!! The seaweed salad is some of the best I have ever had and even the tempura (which I only ordered because my friend wanted it) was unique and delicious! Our service was incredible, very helpful and great recommendations. I was there for lunch and can't wait to go back for dinner. A MUST try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7naik8VS6sPsfI0E_fEKg"
  },
  "hGjBq91deCLcsXQ1hCAzvg": {
    "date": "8/26/2015",
    "text": "I came at the \"wrong\" time on a Tuesday, I wanted to see the place while packed but I was shopping and decided to pop in for a quick glass of wine. I was still very pleasantly impressed. The doormen were also helpful while I looked for places during my monthly Knightsbridge visit. I will report back again on my second visit when I have time to experience the full ambiance.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KshWVHzbrGI4vg3jaURKw"
  },
  "-mHvWURAR0IjA7oPjyS5gw": {
    "date": "5/26/2015",
    "text": "Love this restaurant. The idea of it is pretty cool but as a first timer it was quite confusing that all the food comes at different times. The concept is that everything is shared which is very unique. The desserts are AMAZING. The chocolate fondue is the best i have ever had.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ww-u1o1MoXwO985MlSlzuA"
  },
  "0KW3-AmXtFEzQsWI5cUfew": {
    "date": "6/27/2012",
    "text": "Zuma opened in Knightsbridge in 2002. I was young(er) back then, but I knew amazing food when I tasted it. My opinion of Zuma has changed only slightly in the past decade, swayed by occasional visits here and there. Either the food has become even better, or my adult senses have developed more attuned receptors.The restaurant bills itself as serving 'contemporary Japanese cuisine', but for some odd reason the place itself always reminds me of Africa. A weirdly jolting contrast to make, but for me that's a positive. The tables and chairs are all chunky light-coloured wood, the walls bear matching panels, there are green potted plants peppering the dining area and the base of the bar is formed from uncut stone, like an organic boulder of granite that grew naturally at the heart of Raphael Street. These rustic elements are juxtaposed with a lot of glass and the suave cosmopolitan clientele. It is hard to find a table here in the evenings, booking is definitely recommended, while at lunch time you may be asked to wait on busy days.This was the case the other day, but we made it back to find the largest table in the place ready for the three of us. We weren't positioned in the main dining area, but from my seat I had a clear view of the kitchen, aromas and all.We ordered the Crispy Fried Squid with Green Chili and Salt - hands down the best crispy fried squid I've ever had. Not only in taste and texture, but also in its consistent excellence (I always order it). The batter is light enough to taste the squid underneath and fine enough to form an irresistible crunch. The seasoning is sublime. It tasted so good but I was unsure about exactly which ingredient was doing all the flavoursome work. Upon asking the waiter, I was told that the fried squid is tossed with shichimi pepper, a Japanese mix of anything from red chilli pepper, Sichuan pepper, ground ginger, black and white sesame seeds and even roasted orange or Yuzu peel. A juicy squeeze of lime and I'm telling you it's perfect (we ordered a second round).We also ordered the Yellowtail Sashimi in Ponzu Sauce with Crispy Garlic. The fish is soft and supple, while the flavours are strong and refreshing.The Thinly Sliced Seabass with Yuzu, Truffle Oil and Salmon Roe was equally fantastic, with that distinctly appetising scent of truffle emanating from the plate as soon as it arrives to your table. Again, the fish is of the highest quality and so each piece melts in your mouth. Each slice is so delicate and dainty but altogether the dishes accumulate to ensure you are full in the nicest of ways.An absolute favourite of mine is the Aubergine with Miso Paste, which probably pips Chutney Mary to the crown for best aubergine small dish in London. I will also definitely be re-ordering the new-ish Mackerel Roll wrapped in thin slices of cucumber for the delicacy and freshness of its ingredients. It's a roll without rice, which makes it lighter and more refined to taste, so that you really enjoy the soft mackerel meat and the contrasting crunch of the cucumber. It is served marinating in a dish of pickle juice, which adds a subtle tangy flavour. Such a fine and enjoyable dish.Two other delicious rolls are the Dynamite Spider Roll and the Salmon and Avacado inside out roll. The former comes stuffed with tempura soft-shell crab and a dab of chilli mayonnaise on top, adding a luxury hint of creamy spice to the crispy interior - another must-have dish.I haven't really come across a non must-have here, and I look forward to returning again and again over the next decade to sample even more of their dishes and try something from the Robata grill. Presentation, service, decor, food - it's all crème de la crème. Zuma is the place to go to for exquisite food and a buzzing ambiance. Expect to have to book, to pay the price for the quality, the name and the location - then nothing can disappoint you. Just enjoy.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtB006CJuBEK_z2gseshyQ"
  },
  "qXHkSByNi-gCPyCJn-jzdw": {
    "date": "2/22/2014",
    "text": "This place is a bit pretentious and overpriced for the quality of food.  I remember being thoroughly disappointed by the food.  The place is great for the atmosphere and people watching.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "quWM01mFPqrA9OBI9YcjGA"
  },
  "vnvLD8IOV5_Z4ES6wF1M5g": {
    "date": "9/6/2011",
    "text": "Dear London: if this is the best Japanese you have to offer, New York totally owns you in this category (as well as some joints in California as well). That's not to say that the food wasn't good here - it was definitely above average - but given the exorbitant cost of food here in the UK, you have to live up to some pretty high standards to make the cut...and I've been to places in NYC that cost less than half of what I paid tonight that was a better overall epicurean experience than this was.We did the omakase because...well, you figure you're going to get the best the restaurant has to offer. Courses often came out two at a time, which was nice because it meant we weren't waiting for the food to come out. The first two courses were very delicious - tuna tartare on a rice cracker and the sea bass in truffle oil. The former is something that is very simple but works well, as most of the tuna tartare I have had is plain. This was lightly seasoned and had very thin cuts of scallion with it, adding a nice little twist. The truffle oil on the sea bass was a revelation (it's not something I've had anywhere else); the mushroom-infused marinade worked very well on the sea bass, and the side of ikura worked well to add a touch of saltiness to the platter. The other fantastic dish was the tempura-style langoustine with a vinegar-based dipping sauce. Regular tempura is akin to beer battered fried food, but this was done very lightly instead, with the crispiness looking more like fuzzy threads coming off of it...but it works because it doesn't dominate the dish and allows for the langoustine's flavor to come through. The black cod wrapped in banana leaves (or was it lotus?) was done well for a fairly standard Asian dish; I liked the accompanying citrus dip that took the edge off the heavily baked-in miso marinade.That said, I took issue with a couple of the main dishes that were served: the wagyu beef and (very unfortunately, since this is crucial to a good restaurant) the sushi/sashimi combo. I've had amazing beef at shabu-shabu and cooked over a stone, and that is delicious. This beef was clearly cooked as a full filet and then subsequently cut up...as such, instead of all of the pieces being a tender medium-rare, a quarter of them (towards the ends, and even some in the middle) were closer to medium-well and well-done - definitely not the aspired result. The accompanying sauces were banal - a standard sesame-soy dipping sauce and a mayo-based dipping sauce that didn't have that needed kick. The sushi was disappointing because we got all of 2(!) pieces, and one of them (the yellowtail) was probably the worst quality I've had at a high-end Japanese shop. The other (a piece of aburi sushi) was absolutely delicious, which makes me wonder why there's so much inconsistency. The sashimi was equally inconsistent: the semi-fatty tuna was very good, and the mackarel was on the better end of what I usually get in this fish, but the rest was unmemorable: the sea bass was way too chewy, the salmon didn't have that fresh buttery taste or deep flavor you get from the truly fresh stuff, and the grouper (with some kind of vinegar jam on top) was bland. Bland ain't grand; it's forgettable.Dessert was a bit on the large side (six dishes served in a huge bowl of ice; Zuma does like serving lots of its dishes on ice) and was a microcosm of the inconsistency of the main course. The best was the chocolate lava cake filled with chocolate caramel; this was absolutely delicious, with the caramel adding a nice layer of flavor to a dish that is usually chocolate on top of (and inside of chocolate). The banana cake with regular caramel was also quite tasty, although it tasted a little too much like banana bread with caramel syrup added to it. The coconut pudding with fresh fruit was tasty, but the problem here is that the consistency of the pudding was different: it was quite thin (almost liquid-like) at the top, but quite a bit more viscous at the bottom. As for the ice creams served, the vanilla was bland (I think someone forgot to add sugar or anything that would make it sweet), the green tea was green tea (i.e. unexciting without being paired with anything else, like red beans), and the coconut was the best, but the flavor of the fruit was muted (probably the same deal as with the vanilla).Service was pretty decent, but for 96 pounds a person + 20%(!) tax + 15% 'optional' gratuity (why is it called optional when every place I've been to adds it automatically?) + 4 pounds for edamame (the most expensive edamame I've had, and not noticeably different at all) + 4.50 pounds for flat water(!!!), I could've spent the money better elsewhere. The food was alright, but if I did come back, I would save money by picking individual dishes instead of going with the tasting menu. Pick the dishes that are good, and not only will you not be disappointed, your wallet will feel better as well. That's what I call a win-win.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CJmtS1Uk1KSsY2MWol_E7g"
  },
  "icePfWGgRRHpR5cEIIQaJw": {
    "date": "5/22/2014",
    "text": "This is one of London's most well-known restaurants and a favourite for work dinners, nestled off the main street of Knightsbridge and buzzing with a trendy bar and delicious modern Japanese plates meant for sharing. We ordered a selection of plates for 5 people, but didn't get sushi except for a sashimi platter and instead went heavy on the cooked meat. Some takeaways: the spicy edamame much better than plain edamame (wasn't too spicy, but very good flavour), the aubergine dish was quite nice, but the creamed spinach was missable. As for the seafood, the crispy fried squid was good but nothing spectacular, and same for prawn tempura, whilst the sashimi selection was very enjoyable and well presented.  And the meat was the highlight, especially the grilled pork skewer and the seared steak. The chicken wings were tasty but had very little meat, and a pain to eat because it's nearly impossible to eat with chopsticks. I also had a watermelon martini that they are famous for, and I highly recommend it. The service was mediocre, as we had to ask a number of times to get forks, initial drinks, and drink refills. But overall a great experience and I completely understand its continued popularity.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "7EzSBuBEQsfmsU4utAbX5w": {
    "date": "4/10/2011",
    "text": "Oh my word. So, a little bit of context. We were in town for a few days and, being Japanese and having lived in the Middle East for far too long, I really wanted good Japanese food. We scoured Yelp reviews, TripAdvisor reviews, Time Out reviews for hours until I saw a couple of Asian reviews for Zuma and figured ok, let's give this one a shot (I'm sorry, white folks, I love you but you don't know sh*t about Japanese food). In fact, we vetted Zuma for so long that we timed ourselves right out of a reservation! Our concierge mentioned that we might be able to get a seat at the sushi bar if we went at around 7 pm, so what did we do? We waltzed in at 9 pm on a Saturday night. Well, long story short, although they told us we could get a seat at 10:45 (at which point we had a brief and intense discussion about how badly we wanted this food; conclusion: pretty badly), we went for drinks, came back, and got seats promptly at 10. Not bad. We had a hilarious waiter, who was not shy about telling us exactly what we should order. In most cases, we took his suggestion, and were not sorry that we did. In our normal ridiculous fashion, we ordered a ton of food:Thinly sliced hamachi (like carpaccio) with green chili and garlicSeared tuna with chili daikon and ponzuSea bream, chu toro (semi-fatty tuna), salmon sashimiWagyu sushi (let me just take a moment to add that my boyfriend was talking to me as I put the first bite in my mouth, and had to stop for a full two minutes because I was definitely no longer paying attention--this is easily one of the best things I've ever had)Unagi nigiriLobster sashimi (oh lord, so good)Grilled jumbo tiger prawns (when this came to the table, it was so large I thought it was the lobster)Roast lobster (this was actually a mistake; the waiter heard roast and we meant raw, but we took it anyway. Very good but a tiny bit too heavily spiced)And then, when I thought I could take no more, they came with a plate of chicken yakitori on the house--I actually begged them not to give it to us because I was so full, but they put it in front of me and of course I ate it. After, the waiter blessedly came by with some green tea, winked at me, and said, \"Good for digestion.\" Good thing he did, because I might not have been able to walk out of there.No, it's not Japan. The fish, while incredibly, unbelievably fresh, is still not as good as what you can get in Japan. But that's like saying that you don't like your Riedel wine glass because it's not the holy grail. Next time, I'd like to try the tempura, which looked slightly too heavy on the batter but otherwise good and some of the other grill dishes. We will definitely be going back. Oh, and one other thing: they have fresh wasabi. That's an automatic win in my book.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a1KPLYdziQ_t4iywrYcfKQ"
  },
  "M5KnO126zKQdhHZVK6vgVQ": {
    "date": "5/31/2012",
    "text": "I love places with a clean kitchen and clean bathrooms! If you dont want to spend money shopping in Knightsbridge, go to Zuma and some some money there.... I think Roka (sister restaurant) is a bit sexier, plus it has that posh bar downstairs. The food is definantly a bit better at Zuma though. Love the small plats place where you can eat a bit of everything, especially when everything is yummy. I didn't have any think I didn't like, great ingredients, cooked well, enjoyable.... Sushi is one of the best in London. Service is good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c19uPydfSPSThD30W3cO9Q"
  },
  "Agl9JSrMjfBm2J18y2ONvg": {
    "date": "3/3/2014",
    "text": "I love Zuma but the London branch, which was the first one I've ever been to, is a bit too dark and crowded with old men and professionals (if you know what I mean) at the bar...nothing against them, I don't mean to judge anyone. but not really my cup of tea to hang around these people...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUzICKsFPed4uZjXry2O7g"
  },
  "icq_uQtaQpjaEdOt_nEdlA": {
    "date": "8/6/2009",
    "text": "Ok, so I came back two times already. With the grill finally working, I must say, I absolutely loved the grill! You can watch the chef  grill skewers as you eat, so it's a posh, fun atmosphere.Even if you don't like grilled foods - you can count on the fresh sushi and if not that, then guzzle their brilliant \"Zuma\" cocktails or plethora of sake.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qurv1eJZswxUZaZqN53Meg"
  },
  "lNeJnXr00OPj5cZip8Mbcw": {
    "date": "10/23/2013",
    "text": "London isn't known for their food... but this restaurant is stellar. The service is attentive and a little pushy to order from each of the three kitchens, but we had such a fabulous time. The food was delicious and really special. The tuna tataki was one of my favourite dishes! Also, the spicy (you can handle it) garlic edamame is so amazing. I'm craving it as I type this! It's a definite must when you visit london. Make sure to make a reservation! We sat in the lounge area and it was quite comfortable, I actually enjoyed it more than I think I would have at a normal table or at the bar. xx",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_EaJpuxSj8WCLb65TXDcA"
  },
  "BCMwKt5dLjGvEftfAMoJ-g": {
    "date": "12/15/2008",
    "text": "This place is absolutely sensational, no doubt about it Zuma is one of the best Japanese Restaurants in London. If you are looking for Japanese Cuisine and you are close to Hyde Park you have to come here.First you will be blown away by the Japanese decor which transports you to another world and many moons from busy London, so relaxing.I ordered the tori no tabasaki which is basically chicken wings but flavoured with lime - delicious. I followed this with wagyu no sumibiyaki (elegantly presented flavoured beef). I washed this down with my usual warm Saki, I always end up drinking too much of this stuff.I really fancied the banana cake but was full from my main. Next time I will definitely save space for cake.Zuma is highly, highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6zmbR7pmUnpzSawnlDk6bg",
        "caption": "Photo of Zuma - London, United Kingdom. the bar at Zuma",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6zmbR7pmUnpzSawnlDk6bg/o.jpg"
      },
      {
        "img_id": "WEyLgLJISkAS_z0w_K_TqA",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WEyLgLJISkAS_z0w_K_TqA/o.jpg"
      }
    ],
    "user_id": "vSFYKIibFakwFFsEeH-WiQ"
  },
  "di2E705j8o9E3Rh-E3j9SA": {
    "date": "2/24/2014",
    "text": "Great food, great crowd. Somewhat expensive but worth it. Do not miss the softshell crab! You need to reserve a table a long time before you plan to go there.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sSYkP9mNXkWX5oPoDKjSYg"
  },
  "ddyi_fzZ5JZMRMRxqfUF7A": {
    "date": "7/18/2015",
    "text": "For a sushi lover like me, I expect extremely good sushi if I know they're known for their sushi. The sushi at Zuma is good although my favourite at this place is their amazing popcorn! Don't know they prepare it, but I haven't tasted anything similar before! It's perfect as a little appetiser snack!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "REKv-kXTQgFu6912tIIR3A",
        "caption": "Photo of Zuma - London, United Kingdom. Salmon sashimi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/REKv-kXTQgFu6912tIIR3A/o.jpg"
      },
      {
        "img_id": "rj9Lyf-mwmrqXmgZJxGvMQ",
        "caption": "Photo of Zuma - London, United Kingdom. Highly recommend their popcorn",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rj9Lyf-mwmrqXmgZJxGvMQ/o.jpg"
      }
    ],
    "user_id": "t9QjRpsScUuFbvdN4h4Ogg"
  },
  "d57XYYSAOpgQcDIqJdufSg": {
    "date": "6/22/2015",
    "text": "This was my second visit to the acclaimed Japanese restaurant in Knightsbridge. There is a lot of energy to absorb, whether sitting at the tables or at the sushi bar, watching the art and science of the chefs, or being warmed by the robata. grill. I was by myself and was lucky enough to get a seat without to much of a wait, maybe because it was a Sunday eveningOf course you would expect excellent sushi and sashimi and you will not be disappointed.It is fresh and delicious as it is beautful to look at. I had the seared black cod wrapped in a leaf for my main and it was melt in your mouth wonderful. This is one place were you can really just take one slow bite at a time to savor the flavor. The other interesting thing here is the vast selections of sake, served warm or cold. The sake sommelier will help you match the right sake to your meal.Finally, I will warn you this place in not inexpensive. While the atmosphere is casual and the dress is informal (but well heeled), the meal will soon add up. Also note that this is a favorite for athletes and celebrities, on my first visit the paparazzi were camped out front waiting for some footballers to leave.tripadvisor.co.uk/ShowUs…",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "l0uYRCD7vwPD-EXPMPTISg"
  },
  "OZjbkvUbrwEzTFN1zwvBww": {
    "date": "9/12/2016",
    "text": "The food is delicious and so is the service, but there is something missing, I don't really know what. Maybe a cozier atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gEz00LZfBRcRAPYh2JOkOg"
  },
  "gPEQnsUsn_lWEDsdajNuRg": {
    "date": "7/12/2015",
    "text": "Brilliant Japanese cuisine with a great atmosphere and a fun bar with little need for reservation. Alternatively you can book to a private room where you get the amazing food complemented by a secluded room ideal for the family or a celebration of some sort.Expensive food as to be expected in Knightsbridge area but the cost is met with brilliant tasting food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EH3NT883vZQwr8O_C7eW1g"
  },
  "s3sPI_UxGc_aIa3FCg73pQ": {
    "date": "8/19/2016",
    "text": "Good food. Good drinks. But if you prefer vegetarian options, skip this place. The Dubai Zuma has way better options.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohGSJMtYC_C6-8vPOmw4yg"
  },
  "PRt3Rb9CsE3HgrSPVfZX2A": {
    "date": "11/3/2013",
    "text": "It is not easy to get a reservation (by telephone only), so, don't give up. Also, I found it a little hard to find at first, located nearby Harrods, tucked away in a mostly residential city block. This is another brilliant restaurant space designed by Japanese interior designer, Takashi Sugimoto (a.k.a., 'Super Potato'). Brilliant gastronomy, service, and design equals Zen, and then some at Zuma. Without question, my favourite Japanese restaurant in London.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6fa3C5dgQfqsGbckzzxBDA",
        "caption": "Photo of Zuma - London, United Kingdom. To die for: seared tuna with subtle dressing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6fa3C5dgQfqsGbckzzxBDA/o.jpg"
      },
      {
        "img_id": "sCnu7JwbeiJa3PtwAC3_NA",
        "caption": "Photo of Zuma - London, United Kingdom. Pickles are good, too.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sCnu7JwbeiJa3PtwAC3_NA/o.jpg"
      },
      {
        "img_id": "DPFpXClEY8vg0dibpnzWyw",
        "caption": "Photo of Zuma - London, United Kingdom. Marvelous maki rolls.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DPFpXClEY8vg0dibpnzWyw/o.jpg"
      }
    ],
    "user_id": "si2sWKVb7wU8MW07ds4Lsw"
  },
  "HhX4JF148rvYbQvaaMp_RQ": {
    "date": "12/14/2015",
    "text": "So yummy! The lobster sashimi was amazing! Atmosphere was really nice as well as some excellent service. Will recommend to everyone!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aWwbfeEF6QeNae-2fbe3Jg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aWwbfeEF6QeNae-2fbe3Jg/o.jpg"
      },
      {
        "img_id": "AhRFg1CwiZv54PglKqnUOA",
        "caption": "Photo of Zuma - London, United Kingdom. Tuna and salmon tartare w/ caviar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AhRFg1CwiZv54PglKqnUOA/o.jpg"
      },
      {
        "img_id": "kAeS3JB2LGJYRLrdjGreHA",
        "caption": "Photo of Zuma - London, United Kingdom. Lobster and scallop sashimi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kAeS3JB2LGJYRLrdjGreHA/o.jpg"
      }
    ],
    "user_id": "V9bry-7t5KEdLzp3bI-QwQ"
  },
  "9A79jUtFVJbU2Sqppx9mFg": {
    "date": "6/10/2016",
    "text": "Simple enough: just a social place. You pay great price but get just above average food in return. Not worth it, if u want have good Japanese food, don't go here. I spent 90£ on 3 crapy dishes (lobster miso soup, Wagyu beef dumpling, fried squid) and 1 dessert(flourless chocolate cake with pear and ice cream). The sashimi was the only thing actually taste ok here. Also, the service is not good at all (especially those girls at the entrance, do they know how to smile and welcome guest?)",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_8Z8WfgvIQAboMv5ejChw"
  },
  "O98mn3-Gtr-1OMPjoP_uEg": {
    "date": "11/11/2015",
    "text": "Amazing Asian food.  Drinks are amazing, great vegetarian hot dishes and sushi. Also, a very fun place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8dSvn02oo1JKRklEG4B7pA",
        "caption": "Photo of Zuma - London, United Kingdom. Fried tofu with Avocado",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8dSvn02oo1JKRklEG4B7pA/o.jpg"
      },
      {
        "img_id": "actdx_lI3Y3axRjEPUz-nw",
        "caption": "Photo of Zuma - London, United Kingdom. Espresso Martini and Edamame",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/actdx_lI3Y3axRjEPUz-nw/o.jpg"
      }
    ],
    "user_id": "lpaNy-FJJeq6in6-rShFsA"
  },
  "62JfHWBpRgJ2ZS7BPM7iLw": {
    "date": "5/3/2016",
    "text": "Was super excited to try out this place on my visit to London. However, I was a bit disappointed when I got there. We were seated towards the very back facing a wall with an emergency exit. We asked if we can switch tables since there were 3 available tables in the front of the restaurant. Our waitress told us she would call the supervisor, but that never happened. She came back to us less than a minute later telling us that the tables have been taken up already, when clearly they were not. We did not get to enjoy the atmosphere of the place at all.. Also another thing that threw me off was that our waitress was speaking over our open bottle of water that we had ordered. She had stopped at another table before approaching ours and began speaking into the bottle as the cap was in her other hand. I honestly expected more from this place.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjeqmWyTYQsRrwFYPMKO7g"
  },
  "F4bIVV24T4SJn60BKkMdlw": {
    "date": "8/24/2015",
    "text": "Wow! This place is hip and positively up beat! We got there at 10p on. Monday and the place is packed. Definitely make a reservation. We got in nevertheless but it was nail biting. We had the the skewers, some sashimi, some sea bass, seaweed salad, and off the menu dessert. All fantabulous! Great service from Ronan. Overall A+. We will definitely be back when we are in London. Our receptionist was accommodating ... I wanna give her a drink :-)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ROJAmTJT8wiJEF_-MUN0eg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ROJAmTJT8wiJEF_-MUN0eg/o.jpg"
      },
      {
        "img_id": "p1IbJuze-TOu-FWopUv_Ng",
        "caption": "Photo of Zuma - London, United Kingdom. Off the Seasonal menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p1IbJuze-TOu-FWopUv_Ng/o.jpg"
      },
      {
        "img_id": "-1AmX3cFI3G7aNs46j1yng",
        "caption": "Photo of Zuma - London, United Kingdom. Seaweeds salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-1AmX3cFI3G7aNs46j1yng/o.jpg"
      }
    ],
    "user_id": "4Crwnd7-4C930K6hr9o56Q"
  },
  "6k3C9kWDtfaj3AJdykTDiw": {
    "date": "1/25/2015",
    "text": "This review is for the sushi and service at Zuma.  From reading other reviews, it's clear I should have ordered from the Robata grill.  Though, the service still leaves an incredible amount to be desired, considering the price point.Let's start with the sushi.  At best, it's \"not bad.\"  Typically, the sushi rice should be about room temperature to warm -- mine was cold, as if it had been in the fridge.  The fish should be chilled to cool, but mine was room temperature, as if it had been taken in and out of a cold area too many times in the evening that it was no longer cool or firm.  The botan ebi was mushy.  The toro was not marbled at all, and I'm confident at most places, they would simply call it tuna.  The sake (salmon) was ribbed and stringy. I also ordered soft shell crab.  It was good. Honestly, probably the best part of the meal, but the bar here is low. If you've had one fried softshell crab with a wasabi mayo, you've had them all.  They did not mess this up, and it was good. Now let's switch to the service -- three complaints -- 1) The sushi bar was not full, is claimed to be first-come, first-serve, but they refused to seat me without making me wait for 30 minutes.  When they did seat me, they put us in two seats that had been empty the entire time I was at the cocktail bar.  I have no idea who they were saving them for since again, it's first-come, first-serve at the sushi bar. 2) The waitress was very nice and took my order promptly, and the food came promptly, but it took multiple requests and a lot of waiting to get a bottle of still water. We were mostly through our softshell crab by the time a bottle of water finally arrived. I stopped short of going up to the cocktail bar to order my own.3) At the end, the waitress brought the check, and had tacked on a ton of food and drinks I didn't order.  It was our check, but like it had been merged with someone else's.  When I pointed this out, she basically made me review my own check again, instead of realizing I hadn't ordered half the things on the bill.In the end, go to Nobu if you want sushi. It's cheaper and the service and quality are substantially better, across repeat visits. I should come back and try the robata grill.  For the price (which is very expensive) and reputation of this place, none of the above should have happened or been tolerated.  One star.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FwMxIzT18SxD-XeVVhLBdw"
  },
  "4D5scq3eXjWqpzorYddUCA": {
    "date": "7/20/2014",
    "text": "Every time we attend Zuma, it's an amazing experience. We love the sesame and pepper steak, the sushi- you cannot go wrong, and the watermelon martini is the best in London. Make your reservation early, it's almost impossible to get a table without one. The ambiance is noisy on a weekend so when you make reservations for a romantic date, ask to be away from the and chefs area.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xVZJ0Xgdc7Hg9GC7Hp840Q",
        "caption": "Photo of Zuma - London, United Kingdom. Delicious dessert of mango and chocolate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xVZJ0Xgdc7Hg9GC7Hp840Q/o.jpg"
      }
    ],
    "user_id": "MDwwhbWL5DZUuSH0ii6oMQ"
  },
  "VjUNpH5AxyOaQZfxTZX6og": {
    "date": "8/3/2014",
    "text": "Zuma is somewhat hidden, but it's reputation clearly makes up for it's out of the way location. The place was packed at 6pm!I like the atmosphere and the food is delicious and aesthetically pleasing. I ordered the Asian Cooler Cocktail, by recommendation of the bartender, l and absolutely loved it. My only issue was my order of sweet potatoes. They were undercooked and didn't have much teriyaki sauce at all. But I tired my friend's beef and it was to die for so maybe one of the chefs was just having an off day in the kitchen.I would recommend Zuma to anyone looking for delicious food in Knightsbridge.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0EVe37HLD20WZIm-NGcSA"
  },
  "Q-K8xjCVGCJM3e9XU_7g1g": {
    "date": "11/8/2015",
    "text": "One of the best Japanese restaurants in London by far. Staff is amazing, food to die for, menu is innovative and classy, good wine list, good cocktails, great atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eof5BdqbG0dSVTWRyLj_2g"
  },
  "fsZE08Jw_5jssqKzLLvPGw": {
    "date": "8/12/2015",
    "text": "We just went for a drink and bar food but food was wonderful and service was outstanding! It's non-alcohol but a drink called Bishonen was delightful!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fL7K8AfLt3P4P4nuadBagQ"
  },
  "mBHqofxZvAFNITen0QviXQ": {
    "date": "2/16/2016",
    "text": "Somebody needs to say it, this sushi is way too expensive!!! The place is clean and beautiful, however the food is not that great compared to the price.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kYNw6R2K920OWupwNy8Fjg"
  },
  "Sjlx9P_zqVMZWAoogl32Pw": {
    "date": "1/11/2014",
    "text": "An unforgettable night was had here for a friend's \"hen do\". With her wedding approaching, we took her out for a girl's-only night of fun.The food, service, drinks, everything  was absolutely incredible and impeccable. We were there for about 3.5 hours on a Wednesday night, and though the place was packed to the gills with people, not once did we feel rushed. We were allowed to sit and enjoy as long as we pleased, and were constantly looked after. No glass was left unfilled, no drink left empty, no dirty plates left to linger on the table. Every bite was a piece of heaven!Absolutely wonderful. I highly recommend for a special night out or just to meet up with friends.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "32HQqHGHqcDnNteK835C-Q"
  },
  "4brn5ZO-Y9X99kLTzmlRDw": {
    "date": "11/29/2013",
    "text": "One of my top 5 japanese restaurants in London.  It's expensive, but you totally get what you pay for. Generally need a reservation to eat here, they have private rooms (need 6 people to get one)  you feel like you have stepped into a fashion night club, quite noisy, low lighting, stunning decor and an upscale crowd.The service was wonderful, pleasant and efficient even though it was a busy night, amazing wine & sake selection, the food was more than great,  chopped scallops with a wasabi dressing, the famous (Nobu's) Black Cod was excellent, Wagyu beef plate we had was absolutely tasty, juicy and most important, tender, the sashimi moriawase was standard + and the presentation totally top notch. Highly recommended",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TYNVOr0QC1ZVYflOIdkCYA"
  },
  "66iRhbpgler7ozzZjbj_fg": {
    "date": "12/23/2013",
    "text": "This a bit out of the way place has just amazing Japanese food. The outside of the building was quite unappealing, but once you get into the restaurant you will see they did a nice job of decorating.The food is fresh and everything tastes delicate and decadent at the same time. I have never have had a bad experience here in terms of food quality or service. I have only eaten in the main dining area - I have never eaten at the bar.Favorite Food:-Wagyu Beef-Rock Shrimp-Black Cod (this and Nobu's are my favorites)-Edamame (they don't overcook or undercook it - just the right amount of crispiness)-Sushi and maki - All of it. Seriously the freshest sushi I have ever had in London I would also recommend having someone make a reservation a little a head of time.  Now that I think about it, I like this branch over the Zuma's in Istanbul and Dubai. The staff doesn't have the attitude I saw more of in the other branches. Ex: The Dubai branch charged us a ton for ordering chili sauce and chilli pepper flakes because, as they put it, anything else you put on the food would ruin the quality of it. I totally get and understand the concept, but they should have told us they would charge us a hefty amount... eh, to each their own I guess.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHpUm1YYG1ENFsfI-knm6w"
  },
  "hd1ojDvhTBsZZr1wNg6HkA": {
    "date": "9/30/2018",
    "text": "We were back this July and made a point of returning to Zuma. The food was still great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Tn4df2wjnGI45qepH9bRg"
  },
  "4xgl_PGVW9V3OejEy5HwUA": {
    "date": "9/2/2018",
    "text": "Zuma has maintained it's consistency in food quality through the years. It's delightful to be back, to witness the robata grill being fired to its full glory! Seafood and meats galore, grilled to perfection in a wonderfully delicate and exquisite taste! We had the black cod, amazing Chilean bass, baby chicken, king prawn, skewered meats, maki rolls and the juicy Iberico pork- everyone is just happy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ok-aHMYqRpMq3HM5Ka32pA",
        "caption": "Photo of Zuma - London, United Kingdom. It's fabulous to be back at Zuma!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ok-aHMYqRpMq3HM5Ka32pA/o.jpg"
      },
      {
        "img_id": "4KlM21D3MSrtomi4f11LvA",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4KlM21D3MSrtomi4f11LvA/o.jpg"
      }
    ],
    "user_id": "0E1W_8KjUR45nV0mHQLxvA"
  },
  "p7co_gib6ZWZNnuE_z2tpQ": {
    "date": "6/17/2018",
    "text": "The sushi and dishes here are spectacular. Black cod is a must and the soft shell crab sushi was amazing. Every sushi I ordered was just so deliciously and beautifully presented. One star down however - this was because I called in and asked if I can wear trainers. The staff on the phone suggested I do not wear them (so I switched to heels). Upon entering the restaurant, I saw a couple of men eating near the bar wearing trainers themselves!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "incjITMxmggvnrEMsRHB3w",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/incjITMxmggvnrEMsRHB3w/o.jpg"
      }
    ],
    "user_id": "6ydUukNBHs9GO5HWBIT1FA"
  },
  "YSrx8drmIVUiurLnGRbD5g": {
    "date": "2/17/2018",
    "text": "In short, over-rated.I apologize if I'm gong to be brutal here. So I have been told, that Zuma is amazing. Likewise, the way Zuma treats their customers, you'd think they have something to give.  So,  I was totally excited to dine.afterall I'm such a Japanese food freak, I was all set for this dinner! My husband and I arrived first,  he said that Zuma finally got our reservation in and they had us booked in a private room. That was really cool.  But since the rest of the party didn't get in yet, we decided to hang out at the bar. The place looked like any other modern Japanese Fusion restaurant you'd find in Vegas & New York, w/ an open kitchen concept to the diners the tables were set lower but it's inter-mingled with the bar.. making it look packed. To me, its more a mess.Others may perceive it as cozy, & bustling. To me,  its just crowded & a total cluster! If you're claustrophobic,  avoid the place at peak hours. I got myself a non - alcoholic cocktail drink called Norisan, made of fresh mint, passion fruit,  pineapple, shaken w/ orange. But honestly, it's just orange juice w/ some crushed ice mixed w/ some crushed mint leaves. Lol. That's how it tasted to me. A couple of photo shoots here & there, our friends started arriving. The bars main focal point was the impressive display of different saki bottles.  You'd think that was the only alcoholic drink they serve. Lol.When everybody finally assembled together,  we asked our host if our table was ready. They told us they'd check on it. 5mins passed, nothing.  15mins.nothing. So my husband decided to ask again.Now we are all thinking maybe they made a mistake in giving away our room to someone else. 2 minutes after the second time my husband checked, we were lead to our private room. It had a nice wooden table. They handed each of us our own menus & we all decided to order & share it w/ everyone. We got Edamame, Miso Soup, Wagyu Beef, a Sashimi, Sushi & Maki Roll assortment, soft shelled crabs, eggplant salad, etc. Photos attached.To me, the edamame, salad & miso soup should've been served first as they seem to be a first course dish & the rest would've been best served all at once.  But instead, they served them one at a time. With a crowd of 6, it was a bit awkward. Not for nothing,  it would've been ok if their servings were enough for 6, but when a dish comes out good for 1 or 2 people,  a restaurant should be thoughtful enough to think ahead.  But not Zuma I guess. The plates went from one side of the table back & forth. All of you can request them to do that next time you dine to avoid this. They offer you two types of water, still or gas.  We got both. My preference was still.The server was in a rush to kick us out towards the end of our meal that he poured seltzer into my glass which totally ruined my water. Extremely a huge faux pax!My miso soup was ok. It tasted like a regular. Nothing exceptional.The Edamame were just medium sized. We get plumper Edamames in the US. The Wagyu Beef, I was excited to try,  but they were tasteless.  I'm wondering if they didn't season them for a reason except drizzled peppers on top of them? So not impressive.  I'm very particular w/ my steak. The only steak so far that impressed me the most came from Ruth's Chris & John Howies. Other than that, I make my own & my kids rather eat the steak I make than to eat outside at a restaurant. This steak was a fail. As for the Sushis & Makis, we are from the Pacific Northwest & we've traveled to far & wide where Sushis almost a staple.. conveyor belts of Sushis graze airports & restaurants like a fast food joint. I've tasted the best sushis in Washington & Japan. This one was just mediocre. But I can say the seafood they used was of exceptional quality.  That is commendable. But that does not say much of its flavors. Likewise, the eggplant salad, it was ok, but nothing memorable. It didn't leave anything in my palate wanting for more.  You have to put a zinger!But there is one dish Zuma did right & tasted wonderful! That's the Soft shelled crab! It was perfectly fried, cut, soft, crusted & seasoned,  perfectly presented w/a side of lemon as it should be for every seafood, & a dipping sauce.  It reminded me of the flavors of the ocean w/ a hint of garlic & a touch of citrus,  totally satisfying in every bite. I would totally get just 2 orders of that & a bowl of rice & I'd be happy at Zuma. For what could've been $100 worth of a dinner in the US or at any Sushi place, we spent €350 w/c is equivalent to $485. So be prepared if you want to spend that much. If it is just to scratch off a bucket list, think twice.. I'd say totally NOT worth it. Explore the world,  there's better places to get better food out there,  you just have to discover it yourself.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qzm2qmFNt32OAa7DvFz_Nw",
        "caption": "Photo of Zuma - London, United Kingdom. Bat with their overhead display of Sakis.lol.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qzm2qmFNt32OAa7DvFz_Nw/o.jpg"
      },
      {
        "img_id": "T5k83E-8PCUao80kyc0XdA",
        "caption": "Photo of Zuma - London, United Kingdom. Norisan Cocktail",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T5k83E-8PCUao80kyc0XdA/o.jpg"
      },
      {
        "img_id": "lTMAO7tbABfrvgie6WqWIQ",
        "caption": "Photo of Zuma - London, United Kingdom. Wagyu Beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lTMAO7tbABfrvgie6WqWIQ/o.jpg"
      }
    ],
    "user_id": "YulI5sMWMriBEvvjEM123Q"
  },
  "1iKV60QlRptdqfm5937IFA": {
    "date": "6/1/2018",
    "text": "Cool / fancy place to have some great japanese food! Everything we ordered was delicious. Kinda pricy but worth it. Make a reservation.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0AjE33i9XtG02una_ygcxA",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0AjE33i9XtG02una_ygcxA/o.jpg"
      },
      {
        "img_id": "HumVE9u-Jt_uppocHJApjg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HumVE9u-Jt_uppocHJApjg/o.jpg"
      },
      {
        "img_id": "bA1q9xzQl9sHIGvomhSBhQ",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bA1q9xzQl9sHIGvomhSBhQ/o.jpg"
      }
    ],
    "user_id": "vkuUpAN5_v8l7_4Is5NTDA"
  },
  "1Ravo23IXPJjbstTqUUhbg": {
    "date": "7/26/2018",
    "text": "Excellent service, lovely ambiance and very lively. The quality of food is great. Love the outdoor sitting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpBn8F7VqOu8fTuuc78yFw"
  },
  "D69MvNGsHx25acPa_Xw3fA": {
    "date": "6/20/2018",
    "text": "This remains one of my fave restaurants ever and every time I come to London, I'm there. The service is top notch and the food is interesting and fresh. Whenever I'm in a city with Zuma, I'm happy but nothing is like the original experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-OAJbMC9dL1t_Hl3DAXbA"
  },
  "F5diJdxh2oU0Z1vu-M-23w": {
    "date": "8/6/2017",
    "text": "London is not exactly known for having great Japanese food (sushi especially), but Zuma really defies that idea. The atmosphere is sleek and stylish, with an open kitchen and contemporary decor. The employees cater to you as soon as you enter, with the welcoming hostesses quickly checking our many shopping bags. The great service only escalated as our waiter led us through the menu. We absolutely loved our meal! Each dish was innovative and delicious, with such unique flavors. The fish was so fresh and we found ourselves wondering how anyone could possibly think that London lacks a quality food scene. One of our personal favorite parts of the meal was the tempura popcorn- you've never had anything like it! Our experience at Zuma was truly memorable, and made for a wonderful first dinner in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LwgxRzbMlvXVRkunRdv7Iw",
        "caption": "Photo of Zuma - London, United Kingdom. Spicy Tuna Maki (tuna, chili miso, yuzu tobiko)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LwgxRzbMlvXVRkunRdv7Iw/o.jpg"
      },
      {
        "img_id": "iczxqzmlx-f1EmlSn8QsMQ",
        "caption": "Photo of Zuma - London, United Kingdom. Yaki-Imo No Teriyaki Gake (sweet potato with teriyaki and sesame)- almost like a dessert, delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iczxqzmlx-f1EmlSn8QsMQ/o.jpg"
      },
      {
        "img_id": "buGOdsxqGRxji1x3nvlGfw",
        "caption": "Photo of Zuma - London, United Kingdom. Gin-Dara No Saikyo Yaki (black cod wrapped in hoba leaf)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/buGOdsxqGRxji1x3nvlGfw/o.jpg"
      }
    ],
    "user_id": "reEQeRpsx_F_Z3pw9k5oHA"
  },
  "9YMiQ9V4oYO8lccE3773jQ": {
    "date": "3/7/2017",
    "text": "Strictly on food, our favourite meal of the trip. Stunning surroundings, too. It's tucked away behind a hotel. We enjoyed everything that we had but that didn't stop us from looking longingly at the plates moving passed us. Seating options include the cocktail bar, the grill bar and tables. Reservations are a must.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A0kENtCCoVT3m7T35zb2Vg"
  },
  "-AUB4fg4BULNadgnD1frnA": {
    "date": "4/3/2016",
    "text": "We tried our luck and came in without a reservation, we didn't book in advance but you know how it's,it's all about contacts, it's annoying but that's how it works be with the right people and you will get a table anywhere!As usual service was great, delicious food, best restaurant in London!Black cod, yellow tail the stars of the night, softshellcrab roll superb , great cocktails, Zuma always leaves you with that je ne sais quoi, always leaves you wanting more I'm coming back soon very soon ha :)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kg3vKaAKOD44azdgz-CYLA",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kg3vKaAKOD44azdgz-CYLA/o.jpg"
      },
      {
        "img_id": "CJw-zg70IOw0KQ8oL85_gA",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CJw-zg70IOw0KQ8oL85_gA/o.jpg"
      },
      {
        "img_id": "CZSQpK2xrQfY_LdT2qDs5g",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CZSQpK2xrQfY_LdT2qDs5g/o.jpg"
      }
    ],
    "user_id": "8MscC6razp5uKYQL4p0erQ"
  },
  "ySF0GATTEivz0xS9XXefnA": {
    "date": "2/19/2016",
    "text": "Everyone about Zuma is 5 stars. Food is incredible. All of it. Recipes you never thought would be great (spinach and peanut butter) are amazing. Staff, service, location and atmosphere are just 5 stars. Amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bfiyQOSzgbrTnuJz9IOX5Q",
        "caption": "Photo of Zuma - London, United Kingdom. Tuna!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bfiyQOSzgbrTnuJz9IOX5Q/o.jpg"
      },
      {
        "img_id": "NlEH_AgmcLyO3WoDKlyaWw",
        "caption": "Photo of Zuma - London, United Kingdom. Dessert!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NlEH_AgmcLyO3WoDKlyaWw/o.jpg"
      }
    ],
    "user_id": "hy2vPpM2E6GudvIHcBSqGA"
  },
  "x0h66UFR1n7KWsEXvHyj_w": {
    "date": "12/30/2016",
    "text": "Finally came here after a university friend had recommended this restaurant to me about 2 years ago. As I just found out Zuma is a sister restaurant of Roka, which is also really good - it is no surprise that they have quite high standards. As much as I love the food here I have to admit that the taste of tuna has changed over the years.. this might be an environmental problem but the fatty tuna here just does not taste like the one I have had in Japan. Either way, it was a very pleasant experience as I popped in during the holiday season without a reservation and still was able to get seated rightaway. I had the seared beef which I could highly recommend and the yellow tail sashimi which also was a delight! The lobster as a main, what else could a person ask for, the most satisfying low carb meal I have had in a very long time - happy new year folks!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_ArHjFfpU54uRIgosqhoTg",
        "caption": "Photo of Zuma - London, United Kingdom. Lobster",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_ArHjFfpU54uRIgosqhoTg/o.jpg"
      },
      {
        "img_id": "gKaU_egU1OTSl_sjT2o6Sw",
        "caption": "Photo of Zuma - London, United Kingdom. What carb free living looks like",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gKaU_egU1OTSl_sjT2o6Sw/o.jpg"
      }
    ],
    "user_id": "_YYSx_zGOSltv3VXZ6PLWw"
  },
  "aUAN_lrb6ZEMRBFHRvSuCg": {
    "date": "7/14/2017",
    "text": "Fun, expensive. Fresh and well executed fish, pricey. Loud, boisterous, casual, and quality but high prices! A snack for two can set you back almost $200. But nice location.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wWyR5AdkPNwxEBZhYCGiFA"
  },
  "qyIKRxEMI8FtPo0AgN_l3g": {
    "date": "12/8/2014",
    "text": "I rarely give 5-star reviews. If there were 6 to give on Yelp, I'd give them that. It's that good.We last Sunday night, & although we had tried to book a few weeks ago it was already full. I understand why now. The Hostess was lovely & accommodating, & offered to try to seat us at the sushi counter 45 mins later, & would come find us at the bar. That 'can do' & friendly attention to service permeated our evening: the bartenders were attentive, friendly, and so efficient that the replaced half-empty bowl of edamame was like a sleight of hand. And the bar was packed!While waiting to be seated, I was perusing the insanely good collection of wines in their glass wall case, & as I was about to take a picture of some very rare Petrus, one of the staff came rushing up saying \"No, no sir!\", & then with a smile, opened the case & said \"you'll get a much better picture up close!\". Nice!Five minutes later (after about 20 waiting), the hostess found us and sat us.  The Sommelier came over to talk to us (a charming young American with an excellent pairing knowledge), and helped us make a great choice (sadly, not the Petrus). Then, the food.  I can literally blather on for hours with food porn descriptions, so let me just say: if you just stick with the specialities (although its ALL unbelievable), you cannot go wrong. Get it all.Zuma was a terrific experience! If you love great food & wine & want to be wowed by some, while being treated like royalty..go to Zuma.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "47-7oz2mabsX6LAArVyl_g",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/47-7oz2mabsX6LAArVyl_g/o.jpg"
      },
      {
        "img_id": "QkDyp03SSL0OnOmRA6yZJQ",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QkDyp03SSL0OnOmRA6yZJQ/o.jpg"
      },
      {
        "img_id": "80TsXdP46LP-ACcWBMPXFg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/80TsXdP46LP-ACcWBMPXFg/o.jpg"
      }
    ],
    "user_id": "TQ5zDew8_MGVTMQ3HEUaFg"
  },
  "E3hhvRSy-vP6Tc_5Bb6miQ": {
    "date": "8/31/2017",
    "text": "I love this restaurant very much! This is one of my top places I go to in London. The food here is absolutely amazing and really do enjoy it with family!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o1POKUwx_16-j4QP5e25wA"
  },
  "b-oe1OgEN_lG6l4PZ5A2LQ": {
    "date": "7/30/2016",
    "text": "Well for starters, this place has absolutely amazing food, an upbeat ambiance of total excitement, lots of patrons having a great time either dining, lounging at and around the bar area or waiting for a table, and an insane number of employees all working feverishly hard to keep everyone happy. The patron mix is varied, younger, older, European, Arab, visitors and locals alike all seem to love Zuma.     We've now been 4 nights in a row (without reservations) on our 5 night visit to London from Honolulu.  Got seated twice without a wait, but you'll want to make reservations. We ordered different dishes each night to see if it were just a few that were amazing.  All 15 dishes we tried had flavors that definitely rival the greatest restaurants around the world. You will not be disappointed. Sushi rivals Nobu & Morimoto even though the sushi portions seemed slightly smaller.  The fire grilled meat & seafood (Robata) are done perfectly every time.      If it's just two of you get a pair of the 15 seats that surround the grill and watch the cooks in action. You will be very impressed by the level of detail that goes into each dish. The menu is extensive, each dish is a unique creation of well paired flavors.  It was impressive watching the head chef check the temperature of each grilled entree and inspect every dish before releasing it. By far one of the best restaurants in London.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kZ5Tidh4TiUAfVz6l1F1Pg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kZ5Tidh4TiUAfVz6l1F1Pg/o.jpg"
      },
      {
        "img_id": "8jKJWp7nOA76_fYAq2YVkg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8jKJWp7nOA76_fYAq2YVkg/o.jpg"
      },
      {
        "img_id": "4nh7tAfxYcaL5jdgQ-vJaQ",
        "caption": "Photo of Zuma - London, United Kingdom. Salmon filet with teriyaki sauce and pickled cucumber",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4nh7tAfxYcaL5jdgQ-vJaQ/o.jpg"
      }
    ],
    "user_id": "5OWvDI3RsjHGm3RtnlLV7A"
  },
  "yOyc5lSfAyJ2aRFJYVk_Qw": {
    "date": "9/28/2015",
    "text": "Fantastic. It is hard to get a better restaurant than Zuma. Everything from start to finish was top notch, esp the service and the food. It certainly is an expensive dinner but worth it. The bar is also nice to have a few drinks at.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7QuSTleFEnUE-oEj1aLWQ"
  },
  "roeimxsAjqcM4EdZklEFew": {
    "date": "3/28/2017",
    "text": "Zuma is giving a good and reliable experience, prices are reasonable compared to other first class venues. We enjoyed the giant shrimp, the lamb and stakes, sushi and sashimi might be better.Ambiance is great but the service is not in the same level as the food and ambiance reception is not paying attention, waitress forgo to bring dishes and drinks ( apologized but no compensation. )In sum good but not excellent",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7dTa_t3VZRyzbIzMBAP3Sg",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7dTa_t3VZRyzbIzMBAP3Sg/o.jpg"
      },
      {
        "img_id": "BAt-bI6_Lbyidbf4rI0j4g",
        "caption": "Photo of Zuma - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BAt-bI6_Lbyidbf4rI0j4g/o.jpg"
      }
    ],
    "user_id": "JMu9WqqKjzMgmnD83VdZLA"
  },
  "6bamvfcieMveMgSbdmDrmA": {
    "date": "12/27/2015",
    "text": "I'm japanese, so maybe my opinion is too hard. This restaurant is same like  FRIDAY EVERYDAY.Foods are good and atmosphere are good , however never better than like a restaurant Wagamama, or normal franchises restaurant.But if you want to eat Japanese dishes in huge cafeteria, here is the best place !",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rDhd5wm0sVOFhz5Zng14A"
  },
  "7uWVKfVQKzsd4BQsSQmiyA": {
    "date": "9/8/2015",
    "text": "The food was very good; the wait staff was excellent.  The restaurant manager made the whole experience disappointing and overall 1 star - perhaps even 0 stars.  To sum up the horrible experience - My wife and I stopped in about 6:45 PM on Tuesday with no reservation.  The receptionist indicated that they could seat us, but they needed the table back at 8:30 PM.  We indicated no problem.We told the waiter that we had a time limit, he assured us there would be no problem.  This was our first time at Zuma, and he wanted to make sure we enjoyed the meal and the service.  He also indicated we would have time for dessert.  This was all true.  We finished our meal by 8:00 PM and finished dessert well before 8:30 PM.  We asked for the bill, but then waited.  After about 20 minutes, one of the restaurant managers came to our table and indicated that their 8:30 reservation had arrived - politely expediting us.  What it did was infuriate us.  Why didn't she coordinate with the wait staff?  We had asked for our bill but were waiting for it.After paying for the meal, I requested to speak with the restaurant manager.  First the reception manager, Agnes Moravecz apologized.  She indicated that it was all a mistake.  She offered her business card and told us she would help us with any reservations in the future.  She handled it well.  I asked to speak with the restaurant manager.  The woman who expedited us came by and told us she was one of the managers.  She didn't offer her name or business card.  She didn't really listen to our complaint nor did she seem to care at all.  I told her that she really put us off and she seemed to become quite defensive and literally pushed us out the door.We will not be visiting this place again.  Further, we will spread the word about what rotten management they have.If you are looking for excellent Japanese food nearby, try Kurobuta or Nobu.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lN4wwYeWiXiMHh9DE1Je7A"
  },
  "N4pSp5qV-kFwINmrGLWKpQ": {
    "date": "2/13/2009",
    "text": "Zuma is the best Japanese restaurant where I have ever been I went there one time, it was full and I had to eat in the entry but the quality of the food and the busy atmosphere of this place are unforgettable. I hope I will go again, to test this modern and creative Japanese food and maybe to see this time a celebrityand I have also to test the bar and coktails.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "P98JQzBhmNLrXefZIMIV7w": {
    "date": "4/4/2011",
    "text": "My favourite restaurant in the world! Great lively atmosphere and amazing food! The sparkling sake is amazing and the lobster too!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "P0pVYFc_4pAGuDjPYcja5w": {
    "date": "2/24/2009",
    "text": "My boyfriend and I were lucky enough to be treated to a meal here by my generous boss. He eats here nearly every night of the week when he is in town so he ordered for us. The stuffed king prawn was absolutely mental, I still have dreams about it now and the wagyu steak is a MUST have - cant believe food can taste this good! We also had the pleasure of trying the sole and some other dishes I cant remember now but it was all amazing. Of course this place is really mega expensive and we didnt pay (our meal for 3 with wine was £400) but if you want to treat yourself you will not be disppointed and you will enjoy the ambiance the service and of course the incredible food.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9c2_1_cjzruPY0XHdtn0yA": {
    "date": "11/18/2008",
    "text": "A fantastic restaurant with a great buzzy atmosphere. The bar area isn't very separate though so when you're sat down you can still see people stood around drinking. Maybe the area is a bit more separate when the place isn't quite so busy. It's not really a problem though and you may get a table right at the other side. The food was gorgeous, though my favourite Japanese dish - black cod - was no where to be seen back when I visited. (They do have it on the menu now though.) The salads are gorgeous - a real taste explosion in the mouth. You can also have more of an informal meal and sit round the grill. Service was good.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "y6MUWQMnQTMrD2mcatoejA": {
    "date": "11/23/2008",
    "text": "I love this restaurant. The quality of food is excellent, and the price is fairly reasonable for it's quality. We had shasimi, sushi, and also tepanyaki. It's a night to remember.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EcCQ15h4gh3ieLRF9Cietg": {
    "date": "10/24/2010",
    "text": "this restaurant really is a reason to go to london. nice food and good cocktails, but VERY expensivesuper daumen hoch:)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KlmwvJ4uONPfzOLeU0cEFw": {
    "date": "8/2/2007",
    "text": "Zuma is where we go for our extra-special-sod-the-wallet celebrations. Ayako, my wife loves it for the truly excellent modern Japanese food (generously overlooking the fact that the chef is German) while our daughter loves it for its high-class buzz and celebrity pulling-power (Russell Crowe et al). Service is exemplary; the waiters are brilliant at explaining the frankly rather complicated menu and recommending dishes - so that you end up with a smooth and seemingly endless feast that has to include: asparagus tempura, crispy fried squid with green chilli, mouthwatering wagyu beef, black cod with miso, superb sushi and sashimi (very unusual in London) and anything with wasabi mayonnaise. Everything should be shared and is, except, unfortunately, the bill. The wine list is long on spicy or smoky wines that go well with Japanese food, like the Franz Haas Traminer from Alto Adige. The sofa seating behind the bar is a good place to chose to eat and watch the parade of London's fashionable young things",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fEE3xEhaRhC2qWnip4Aqw"
  },
  "exYyJik7-FWHnfTcD6PLXw": {
    "date": "7/20/2011",
    "text": "i love this place it is amazzzinnnnnggggg",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GDNuQEYQWbkSznfZaOW42g": {
    "date": "2/18/2009",
    "text": "Great Vibe, brilliant cocktails and mouth watering food. Need I say more? For sushi aficionado's who enjoy eating with other people who appreciate the quality as much as you. The open kitchen is also a nice touch.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0jvIkyUHZYi4NbCLYHKMBg": {
    "date": "2/7/2009",
    "text": "The quality of food at this fashionable and very popular high class Japanese restaurant is indeed brilliant. Zuma offers traditional Japanese dishes with a modern take on them like various sushi, sashimi and tempura, as well as some exclusive specialties such as black cod, wagye beef and foie gras, all prepared to an exceptional standard. Judging by the food, it's certainly one of the best Japanese restaurants in London. The only drawback is that it's very noisy. There are lots of people crowded around the bar in the evening and, needless to say, the lounge and the dining hall are always full. Overall, this place has a club-like atmosphere. There were six of us at the table and I could barely hear the person next to me, not to mention those on the other side. It's probably a great place to start a big night out, but if you're looking for something calmer, Miyama or Shogun, or even Nobu and Matsuri, are perhaps better choices.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "W7mgtFCGCOJSKXgPzu4B0Q": {
    "date": "7/23/2012",
    "text": "When my friend told me we were unable to get a reservation at Zuma, I was crushed. But here's the catch, there's sushi bar/counter seating! It was Thursday night, fairly packed (with the pretty people), but getting late for a London restaurant, probably around 9pm. We gave our names for the sushi bar and they said it could be up to a half hour wait. We decided to give it a shot and hung out at the bar. We immediately noticed three or four empty counter seats, but didn't say anything. Sure enough, within ten minutes, we were sat. Weird, right? I'm still not sure what the hell went on there. The counter was beautiful and had a great view of the grill. Our waiter was super friendly but I think partly because he was gay, and within minutes figured out my friend was as well and proceeded to flirt with him. The service still wasn't amazing. It became too personal and forgetting my drink isn't okay just because you're too busy batting your eyelashes at my bestie. The food was small and overpriced, but delicious. We only ordered apps/small plates. What stood out was the hamachi sashimi, pork skewers, soft shell crab and the giant grilled prawn. The sauces which come with the grilled pork and soft shell crab were amazing. The grilled prawn was just good, but cool because it was so big! For dessert we had a delicious green tea and banana cake. Very yummy! Next time I'm in London, i'd love to go back and try more!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jPFot6yBO7CoGm1ecM_1Og"
  },
  "gj_p2ynpWzNr-2jsxTj7GQ": {
    "date": "2/22/2009",
    "text": "Been there 2 times, one of those London's fancy-fusion style places. Food i good, prices high, quite noisy. Good place for a friend's dinner. Good location, very close to Harrods and nice interior as well.Would go there again why not, food very tasty good service though high prices.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XmeU-uF8Mr-MO3CKkndZZQ": {
    "date": "9/4/2007",
    "text": "Great bar scene, fantastic food and amazingly fresh & tasty sushi. Some dishes can be overpowered by overly salty sauces, but on the whole amazing. The best dishes are the sea bass sashimi with truffle oil, the crispy squid (which is usually light and not oily, but recently has been inconsistent) and the cubed beef tenderloin in spicy soy sauce (ask them to put the sauce on the side as they put too much on). Fantastic drinks, and good desserts too. Always a good scene.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_l8tGOYtEAs_Va8SrDfbOA": {
    "date": "6/5/2008",
    "text": "Fantastic in every way. Great bar, good cocktails and the restaurant has an extensive menu. Quality is consistently high. It's a party atmosphere but tables are sufficiently far apart to allow privacy. Good for corporate entertainment, celebrating with friends/family and for dates. Always makes me feel good.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4fAPOGu0EzCBv12KCEHvvw": {
    "date": "3/15/2011",
    "text": "Oh dear, I'm going to get shouted at by all the other reviewers who have given Zuma such rave reviews. I think this place is awful - but I don't want to score them lower than 3 stars as there's no reason why someone like me (not a professional food critic) should affect their overall rating. And after all, not all the other people can be wrong about Zuma, I perhaps just had a one-off, awful experience.... So, in my opinion: Where Roka is fun, buzzy and serves incredible food and good portions, Zuma is a too-packed, too-noisy, too-huge hanger of a restaurant serving tiny portions of (imho) sometimes quite poor food. The sommelier is one of the most patronising I've met, who clearly thought 2 women were incapable of choosing their own wine. Don't get me wrong, I like to be helped and guided, but I don't like to be told 'Sauvignon blanc is awful, I'll give you something you'll like' as he snatched the menu away from us and flew off to patronise the 300 other diners packed like sardines alongside us. And as for the loos....not sure how to write about those, but anyone else got any comments on the 'clientele' and goings-on in the loos?! I really wanted to love Zuma, but I didn't. But I've been back to Roka twice now, so this moany old bag will shut up about Zuma and spend my pennies at Roka instead.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WBt-1IlTnOJp7xiXgqBg2g": {
    "date": "8/7/2008",
    "text": "Japanese restaurant that's the place to be at the moment, close to the City and Harrod's. I meet up with my friend Marco here when he can break free from the office for the occasion. The black cod is to die for!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NxaHqLpyR9sK2B4i7AM6kQ": {
    "date": "9/27/2011",
    "text": "There are probably 50 restaurants in LA that have food at least as good as here.  Big fish in a small pond.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_LBYI6b40_U_jZBG53zSPg"
  },
  "WlJQjuiiRndHbQWMPLaFgw": {
    "date": "9/25/2009",
    "text": "Seems to be a very trendy place.  We came on a Wednesday night, and it was totally packed!  The quality of sushi fish was excellent, and the special \"tapas\" style dishes were an interesting take on Asian fusion foods.  Out of the dishes we ordered, the black cod was (imo) the most unique in terms of taste.  I don't know if I would give a place like this two Michelin stars (I was told it had two) because while the dishes were interesting & the presentation very well done, no dishes really stood out to me besides the black cod.  Honestly, my old neighborhood sushi place in SF had more choices of fish (and amazing quality as well).  Maybe one Michelin :D ? I guess it also matters that the sommelier was quite awesome.  5 stars for the sommelier and the service!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUimuuObOODnXe614ViuAw"
  },
  "LySyBziFmXyspIh1hmGnag": {
    "date": "7/5/2011",
    "text": "I had a good time at Zuma. Food is not as great as you would expect from this caliber place but service and atmosphere were great. I would recommend if you like Asian food and have a fun, hip night out in London.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWUt-JZO-4N8NkoXrbAEDw"
  },
  "LlMUcl2XgiGC8cxdLifpVA": {
    "date": "7/18/2009",
    "text": "We came here twice in 4 days...definitely a fan! Can't remember the name, but the eggplant dish on the first page of the menu (I think it's a feature item) is absolutely amazing. Awesome spicy tuna rolls too, and fantastic drinks - we tried the watermelon martini and the lychee one. For such a busy place, we were amazed at how fast all our food came. Knowledgeable and friendly wait staff. Great experience - food wise, Ozumo in SF could learn a thing or too from this place!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xmji1-h4Q-eyOGHn02H5lA"
  },
  "djZDr5l6FKg2b0D0xSb3cg": {
    "date": "3/5/2009",
    "text": "What a wonderful restaurant!  The staff are friendly, the space is soothing on the eyes, and the food is incredible.  They bill themselves as contemporary Japanese, which made me a bit worried that everything would be a little too fancy-pants.  But the dishes were creative and simple and very tasty.  I can't wait to go back and try a few more things.  This is a great place to go with freinds, family, and co workers.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "77orrALxKhy6zamnstuMVQ"
  },
  "0abIp_9B0hcQqwJUa7oK5A": {
    "date": "4/15/2012",
    "text": "beautiful. great place to go to when in london. the food is spectacular, the concept exciting. slightly pricey but worth it.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-NBnytc7m8uL8owOI2KDzQ": {
    "date": "3/27/2009",
    "text": "Decor is awe inspiring.  This is what an upscale restaurant should look  like.  Who said food in London is garbage?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TumJNxwabACJsY2GkgV8Yw"
  },
  "rery5-XP7iVwPR7_uoeHmQ": {
    "date": "11/12/2009",
    "text": "Where to start? I walked in and expected to not get seated because the front bar area was packed; however, a very nice hostess checked the sushi bar for me and I was seated immediately. It was mesmerizing to watch the sushi chefs and I was fortunate to be seated right in front of the head sushi chef.  There was also a woman working behind the sushi bar, and that was really cool to see. It was fun to watch this chef, because he had such a precise rhythm to his work and you could tell that he was really into it.  It's so hard to say - which was better - the food, or the service?  The waitress that worked the sushi bar was so great!  She was extremely kind and very knowledgable about all of the items on the menu.  She helped me with my choices and told me that I made excellent decisions - one of which was the Wagyu Beef Tataki. It came somewhat covered/sprinkled with scallions, which I hate, but I simply pushed them aside. I was informed by another server that they made the cooks re-do the dish because it wasn't done properly the first time.I got a 6-piece chef's choice sushi. The head chef prepared it and I must say, it was delicious.  This was the first time I noticed a distinct \"flavour\" to the sushi, where usually you just know that there is raw fish and seasoned rice. But this was different - the fish *tasted* really good and the rice was done really well, which is very important, in my book.I think you will just have to go there yourself to experience it - it's quite hard to explain!I highly recommend this place. For all of the right reasons - the food is superb and worth every penny.  The service was wonderful, warm and genuine. I can't wait to go back again another night!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQ-FOjs7OtLVENt1Ul5GqA"
  },
  "37L1tmkhOe6RPapL1zpIwg": {
    "date": "5/26/2012",
    "text": "Great local sushi bar. Great atmosphere and people. But not cheap",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mJ0vvmS1PYq1r1tYTVGKpQ": {
    "date": "1/4/2010",
    "text": "This is the place for people who have got expansive taste in food and women... If you know what i mean",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6ebv578-ZGhBKdh8oTMseQ": {
    "date": "5/12/2009",
    "text": "I've been there few timesthere is a very good atmosphere, I think it's one of the best restaurant in London",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0x-S779s4qIlWQFOXGLWWA": {
    "date": "10/3/2009",
    "text": "I recently had the opportunity to lunch at this beautiful establishment. The experience was nothing less than perfect in every way: food, service, ambience and the total dining gestalt. WOW- this was the best spent money for the most outrageously delicious meal that indulged every taste bud and visual experience. I highly recommend making a reservation as quickly as possible for the luxurious and elegantly beautiful. The service was perfect, the choices for each of the courses were magnificent. My meal at ZUMA definitely takes a top billing in my many gistatory experiences.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LYUVxkHnJacPbdv4v-zMog": {
    "date": "10/21/2008",
    "text": "I headed to Zuma on Friday night and thought it was fabulous. It does have quite a nightclub atmosphere (this may be different during the day) with heaps of people clustered around the bar, but the food was all brilliantly executed and the cocktails were fabulous which scores them big points in my books. If I went again I would try and get a seat in front of the Robata Grill as it was fascinating to watch all the chefs at work.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}