{
  "n5VS4e_BhTlbyFbRWDe0Og": {
    "date": "11/15/2008",
    "text": "When I used to work in the area, I think I visited this place far too many times for my own good. It's nice to see the owner expand his stall to the larger caravan sized stall that they operate out of. For about £6, I used to order a huge burrito that you can get with chicken, pork or beef. I preferred the chicken because it had that slightly charring that added a level of smokiness the other meats never used to have. It's fairly simple where you follow the line and they ask if you want other fillings and how hot you want it (mine - always the very spicy with extra chillis). It's great as a lunch and one of the more flavoursome burritos I've had around town.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BogjEKcxVZm30EUGxSmInQ": {
    "date": "10/4/2010",
    "text": "The best burritos in town, no doubt. On a sunny day you can't beat lunch at the daddy of the donkeys.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KC9bTn1-rVQk72D6s7NZKw": {
    "date": "7/26/2010",
    "text": "After making my rounds to some of the new Mexican joints popping up throughout London, I thought I would give Daddy Donkey a try based on reviews. I honestly don't understand why this place has such high marks. The beans and rice was as bland as could be; the salsa tasted canned and the overall flavour was just OK. The tortilla chips were decent (and salted like I like them), but everything else was a bit of a let down. I was trying to decide between 2 or 3 stars, but because this place it basically a cart...it gets 2 stars. Sorry to say, but this place is all hype!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTfKv1Yi7vSINV95-tpUVw"
  },
  "Rv4q5KprSPya8RSeTUak9w": {
    "date": "11/15/2010",
    "text": "Every day I walk past the people in the queue and I can see the looks on their faces. The anxiety, the anticipation... they fear the donkey. Me? No. I respect the donkey. I value the donkey. We are one, together. Only when you have experienced the donkey will you learn to respect and appreciate its power.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Dd4HVOkBx5Mr98ErxgZtIg": {
    "date": "10/11/2007",
    "text": "Deeeeeeeeelicious! I could almost end the review there, but I won't. This place has been going for a couple of years now and has grown from a little hut to a massive fast-food trailer. But don't be put off by the fast food label  it's fast because they're efficient. They have a factory-like assembly line thing going on which means your order just breezes through. The food it's self is delicious  Mexican burritos (Spanish for little donkey, apparently) in various flavours - the chicken is my favourite. Once ordered it goes along the assembly line until you get to the sauces. At this point you can choose how hot you want it to be. Then it's all wrapped up and presented in a nice little package for you to enjoy! Ooh, make sure you have something to catch the drips  they're very juicy!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WScwFq4vDDuuL7wVnOV9ZA": {
    "date": "9/5/2010",
    "text": "Everyone has a different reaction when they hear the name of this place but if you put the name aside it's actually a pretty decent burrito stand.  While working in London this helped me satisfy my Chipotle cravings since the two are very similar.  It has the same assembly line style and the price isn't too bad.  A burrito with no extras will run you about £5.50 which right now is about $8.50. I would definitely recommend this place to anyone looking for a hilariously named burrito place around lunch time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bEaa3iV1PGmD27ZHBmO6CQ"
  },
  "51pJ40y-XF2IOA7PsMc7fA": {
    "date": "4/6/2011",
    "text": "easy peasey no fuss burrito (bowl).  the lucha libres are what make the stand.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HsS8xgyW_rjflrQnhI9Fdg"
  },
  "Kl8MT1WJHxCHE_TtPyPchw": {
    "date": "1/11/2010",
    "text": "stopped on the off chance as i was passing by,loved the food!!!! will definatly be stopping again.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Qn_V3YpWpBN4R3BpqMk08g": {
    "date": "3/30/2012",
    "text": "Very impressed, will be coming back",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LXvuRniFO-kHN09JLXG6Jg": {
    "date": "3/5/2009",
    "text": "Mexican food is still something of novelty in London, but there's an increasing number of market stalls selling burritos. The mother of these is Daddy Donkey. It follows the North American chain approach of a burrito the size of your head, but rather than stuffing it with rice and filler it's loaded with meat and peppers, perfectly seasoned, finished with cheese and sour cream. Service is impressively quick for the queues that form. You will be hard pressed to find a better place.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yo4UZ_pERj7SNhsKIiaMHg": {
    "date": "11/27/2008",
    "text": "Um wait, I haven't reviewed Daddy D yet? Hmm  well, it's the best. The bestest of the best. One of my favourite things about living and working in Clerkenwell is knowing I can grab one of their massive burritos for lunch during the week. My expat American friends agree: Daddy Donkey's the real deal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "fflgLv6IxXDIaNtpt6NoMg": {
    "date": "5/21/2011",
    "text": "A wonderful informal buzzy atmosphere that will suit everyone. quick and clean service!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "u1hiEZ6Bfs3KOK3SXodgfw": {
    "date": "8/29/2008",
    "text": "Divine. A must for a Friday lunch pick me up. Nothing more to be said.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ytOsIb6qk2G_8k5TFf8QMg": {
    "date": "8/30/2012",
    "text": "nice food will come back",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZyNco9JPOVEfYFIpQvFirQ": {
    "date": "6/27/2011",
    "text": "awesome spanish restaurant with tasty food",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lIv2p87HUsBh_yJKrvuTvQ": {
    "date": "2/2/2011",
    "text": "I've been wanting to try Daddy Donkey for a good number of months now, and I finally dragged a friend here today! From what I could tell he had never really had a burrito before (I'm a burrito fanatic), but we both got fajita burritos, mine veggie and his steak. The one downside to mine was that they forgot to put in the guacamole, or maybe I'm just supposed to tell them, I guess since guacamole might be foreign and weird to some? No matter, it was still very tasty. However I did make the mistake of going for the hottest salsa and couldn't finish my burrito because my eyes were tearing up so badly! My friend fared much better and seemed to really like his burrito, saying he was pleasantly surprised. Knowing and loving Chipotle, I'm not sure which is better, taste-wise. They're about at the same level, although I believe Chipotle in England doesn't offer fajita burritos (they do in America) so it's a bummer. Considering, however, that Daddy D is about £1 less than those at Chipotle, next time I'm craving one of them beauties if it's lunch time I'm going for Daddy D :D",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU8n9Is1dbbasCTd5kKMWw"
  },
  "3gN4cx0VvTXZoZTPjEMyzw": {
    "date": "9/9/2010",
    "text": "Cracking choice for lunchtime eats - and as fine an example of Mexican food as you'll find in London, outside the kitchens of Mexican expats. But, dear God, couldn't they do something about the queue ? It's huge !Or at least seems so , when you're waiting for some of their delicious output.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GUUH2FU7r36h1KxEhZFXQ"
  },
  "E-3TEjljgXG_CIh9zbgNJw": {
    "date": "3/24/2010",
    "text": "I love mexican food and Daddy Donkey offers a selection of above par burrito's at a decent price. I've been working in Farringdon for the last couple of weeks and a friend said I should check out Daddy's while I'm in the area. Now, it may have been bad timing on my part, but I ended up waiting 35 minutes in the queue to get my Burrito when I went on a Friday lunchtime.I got the Naked Chicken Burrito (hot) and it was awesome, but worth waiting 35 minutes for, possibly not.There's another less busy Burrito stand in Exmouth Market (round the corner) where you get practically the same thing for the same price and don't have to wait.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "zJ8UTyzbwQhbB4_1kmFSBw"
  },
  "W_zodu0MD3xR1CVu5k4dZA": {
    "date": "11/2/2010",
    "text": "I used to think Daddy Donkey were the top of the line Rolls Royce of Burritos. Sadly though the quality has dipped of late, and I now find them merely mediocre. I am not sure whether this is because of their expansion into Brick Lane, or because a lot of top quality competition is now available but whatever the reason, Daddy Donkey is no longer the Daddy in my opinion. Last time I went there, My burrito was assembled inconsistently. I was first met by bland rice, followed by a face full of sour cream and cheese, followed by some meat, and finally by a sludge of beans and chilli sauce. It was rather unpleasant, but if they can fix their assembly line problems they are in with a chance to regain their former crown as my number 1 burrito in London. The ingredients were fine, it's just that it seemed to be rolled the wrong way. The 3 stars are temporary until I can go back there and give them a chance to redeem themselves.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cue1uXN_0nIQGX-4J7b_BQ"
  },
  "7EB2X1sNmNyefJQcHIC-mA": {
    "date": "3/13/2010",
    "text": "I'm really um-ing and urr-ing between 3 and 4 stars on this one. I thought the burritos were pretty average, the rice was plain not flavoured, the salsa was quite watery and it seemed a bit smaller than ones I've had elsewhere. Saying that it was still ruddy delicious, burritos aren't as hard as they used to be to get hold of in London so with this new competition I think I'm going to plum for 3 stars.The staff were friendly and the tortilla chips were tastier than they are in Chilango but the steak I had was quite chewy and the guy on the till was very abrupt with me and got me a Coke when I asked for a Sprite. There's only two benches to sit down on and they're outside. I think I should make that quite clear to Yelp that this is a stall on the market, I went here based on Yelp reviews and didn't quite pick that up and was kind of expecting to sit inside, still there's nothing wrong with that as long as you realise.So yes 3 stars because it's good food but it could be a lot better.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hoSCXSbL1oZyX7mZeibXiA"
  },
  "8XMt1BSRp2yVi292b1Pq2A": {
    "date": "3/27/2013",
    "text": "Hands down the best burrito I've had in London. Cannot recommend them enough!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rqpykxQVEAvBDHrtln04cQ": {
    "date": "11/3/2011",
    "text": "I've made this place my regular since I moved office to Farringdon, and it's a lot better than I initially gave it credit for. It's become my favorite burrito in the area, in fact. It's difficult to not go there every day. This place is damn good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tCt_tHrfCc8Vu4qRgxpuQg"
  },
  "stvZ1x1UpA3BaNKFkVAHeQ": {
    "date": "11/28/2011",
    "text": "Friendly staff, food is good but they changed the quackamole and now is not as tasty as before. Can get really busy at some point, but the wait is not that long and worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KvN3PtXBwe3w5ndEQCXYCA"
  },
  "40mAy5tRS9ad64Kg5PNI-g": {
    "date": "4/3/2013",
    "text": "Thubms up for the yummy burritoWill come back and bring some friends over",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "myPGCS1ymZkYWOIAsStkPg": {
    "date": "12/7/2012",
    "text": "I was in hurry and starving. Thankfully i dropped in at Daddy Donkey for the food there was fantastic.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aqeUMuoRJNAlazNNvawV5w": {
    "date": "7/17/2010",
    "text": "I used to work near Leather Lane and this was my favourite lunch place. Now I am working in another part of London and even though I am close to Benitos Hat it is not the same. In short, Daddy Donkey is the best burrito I've had in London - the lime rice, the beans and the strong chargrilled flavour of the nicely marinated chicken mixed with the spicy sauce, all coming together in harmony for a perfect burrito. I wish it was closer to my current office. I'm having a bit of a craving now....",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "toMl0gDknv5i9ZLcND1Umg": {
    "date": "10/26/2009",
    "text": "I struggled 20 minutes through the rain on my lunchbreak to come to this special little place, having seen all the positive reviews on QYPE. The burrito I had was really really nice. Its just a shame I had to eat it stood outside on the street in the rain..seasoning my already wet coat with some hot sauce! I normally don't like buying food from these kinds of mobile snack servers. You tend to worry about cleanliness and such, but they look like they take that kind of thing seriously here. Choose your type of burrito, choose your meat then choose your sauce as you walk along the van. Best burrito I've had in London so far!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "CxsAAEcD0O-U6EJYMj3c4A": {
    "date": "11/5/2011",
    "text": "That was a pretty damned good burrito for London. I was worried about it being bland after reading reviews. Mine wasnt. Of course I asked them to make to put on \"hot\" salsa and then afterword asked for some extra hot salsa additional. No blandness problems there!I'm veggie, so can't comment on dry meat etc. But that was damned good for me.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R8RYReI51kfNtBHB3eS3vA"
  },
  "yrqNz6okgPoiCUK6ARSOVA": {
    "date": "11/8/2008",
    "text": "Daddy Donkey dropkicks your taste buds.  The beans, the rice, the meat, the cheese; this little cart in the heart of Leather Lane in Holborn has the recipe for burrito perfection.  For a fiver this savoury feast is a quick-meal champion.  This is Friday lunch, the type of food that you celebrate the end of the week with, but lucky lunch-goers in the City can enjoy a burrito slam-down any weekday.  Joel, the owner, and his compadres greet you with a smile and super swift service, making the whole experience that much more delectable.  Authentic, funky and delicious, this \"kick-ass Mexican grill\" won't leave you sore until you finish your burrito, wishing you had enough room in your tummy to eat six more.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DRaDUrAKi7xsGS8oLw3Gvw",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom. The Daddy Donkey Posse",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DRaDUrAKi7xsGS8oLw3Gvw/o.jpg"
      }
    ],
    "user_id": "w7b1W-KHo7UUsnkg8ASo5Q"
  },
  "mzPu2te_-O_SmNobFWwevw": {
    "date": "7/5/2010",
    "text": "No... red... onions. What's red onions doing in this burrito when I told you: no red onions EVAAARRRR? I work and work 'til I'm half-dead, and I hear people saying, \"She's getting old.\" And what do I get? A burrito cart... who cares as much about the pounds and pennies I give it... as it cares about me. What's red onions doing in this burrito? Answer me. I give you pounds and pennies, and you treat them like they were for some onion salad. You do. Five-hundred penny burrito filled with red onion. We'll see how many you've got if they're hidden somewhere. We'll see... we'll see. Get out of that cart. All of this is coming out. Out. Out. Out. Out. Out. Out. You've got any more? We're gonna see how many red onions you've got in your cart. Red onions, why? Why?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "UtPd1DuyEhRf1rwnLIpUvg": {
    "date": "9/16/2012",
    "text": "I loved this place. I was in London for a few months and it was hard to find Mexican food out there, coming from California that was really important to me. Daddy Donkey have really good food that is filling and hits the spot. If you go during lunch time be prepared to run into a long line. Don't worry though because the food is worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "evIDh2JAilaerDZERlZ-KQ"
  },
  "K_87gjvW7_Wsr0li88L49w": {
    "date": "10/11/2009",
    "text": "After hearing a lot about Daddy Donkey my burrito buddies and I decided to trek down and check it out for #burritofriday. Happy to say I am not disappointed as a lot of market stalls can be hit and miss especially after the lunchtime rush. I went for the Tomatillo beef burrito. Tasted fresh and was well wrapped. Beef was shredded, full of flavour and plentiful. Will try the Steak next time. Only downsides were that I was rushed through the ordering process so fast (still in lunch rush mode I think) that I couldn't hear or make out what the staff were saying. Also I felt that the price was a little too high for a market stall burrito with no seating. Remember to pick up a napkin, they didnt put one in the bag. Overall a really good burrito that reminded me of something you would get served in San Fran. If this were in an area I travel too more frequently it would become a regular food stop.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vt57IpMIJ5RgPS0YavzJBQ": {
    "date": "8/12/2011",
    "text": "The food is extraordinary in both its presentation but also the sensation it leaves in your mouth.You must eat here if in London.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "YN9cv6uxJMuoWV6Q6Xwlzg": {
    "date": "8/6/2013",
    "text": "One of the best burritos I had, though customer service could have been better",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FCjqWQoZGwjjZmTmCdmCMA": {
    "date": "3/24/2010",
    "text": "muy delicioso! if i close my eyes and take a bite I can pretend I am home, and it was a HUGE steak burrito bowl for a fiver! It was way better than the other burrito places like chilango or tortilla, but unfortunately they are just a cart set up at the leather lane street market. I wish it were a full blown restaurant and I wish it were near my house. but I would def go there again. Also I can't vouch for the tortillas, b/c in an attempt to be healthy I had a burrito bowl, but they looked passable!I highly suggest giving papa burro a chance.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "zfOBqgjgIufVdmwQ9Te1tA": {
    "date": "3/15/2012",
    "text": "After my first couple of lunch burritos, I had nearly given up on Daddy Donkey. These things were flavourless, the coriander rice was indistinguishable from plain rice, and worst of all, even the 'spicy' sauce makes you question if there are chillis in it.Then, one morning I was struck by the compulsion to have a proper breakfast out before heading to the office, so I struck out for Le Regal, my go-to Full English destination... only to discover it had closed. Shock and horror! On my way back toward the office, I stumbled across DD's sign promoting their breakfast burrito and thought to myself, 'Self, you might as well give them one last chance, right?' Why not?I requested such an item, with black beans, please. A blob of microwaved(?) egg-y substance plopped out of a plastic jug onto the chopping board along with a massive sausage. Both were diced into chunks through the use a near-mezzaluna-sized blade and handily transported to my burrito on the knife's flat. A few dollops of salsa and a sprinkling of grated cheese later, I was off on my merry way with breakfast burrito in tow.How did it stack up? Considering the options for breakfast burritos in the city number in the single digits (as far as I'm aware... do correct me if I'm wrong), it's a wonder that there's an outlet within walking distance of my flat. Compared to the real thing? It's still a dim shadow.If they threw in some proper spicy chorizo, a couple of seasoned home fries, and some honest-to-goodness scrambled eggs, we'd be getting closer. As it stands, I'm just grateful to have a mediocre stand-in. And it's easy enough to doctor up with enough Cholula...",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "RmXIjppHNtVveguN10iO1g"
  },
  "Cbi8zBU5X0QFWLq6KVqOYg": {
    "date": "12/15/2014",
    "text": "I stood in a line....er, um, queue to get in and was promptly taken care of.  Food was good but not fantastic.  I think I was more annoyed that the reviews had talked up this place big time and I didn't see it. I had the shredded beef salad/no tortilla thing.  Good if you feel like having Mexican....quite adequate.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyD2ZjU87FpgHUXxeNcXeQ"
  },
  "X3My6xdQfTA7_USvMzkuCA": {
    "date": "3/9/2012",
    "text": "The best burrito that I have had in London. I had the Daddy D with tomatillo and habanero sauce. The serving are great. I have searched far and wide in this town for a good burrito. This is as close as I am gonna get to \"L.A.\" good.The only minuses are pico de gallo,  flour tortillas for the tacos, they charged extra for jalapenos,  and it is in the city.  I would love another location outside of the souless money laundering city. But I will be back.  It is worth the trip. Even if it made me homesick.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4k4lsXAtgDXwuyIeNOnotg"
  },
  "TtlqkrFpsbUhYtjEl22izw": {
    "date": "3/18/2015",
    "text": "The steak burrito is massive and packed with flavour, very similar to the ones I've had in America which is a great thing. I purchased the meal deal for £8 which is quite expensive but it comes with a drink and nachos (lightly salted) and a dip of your choice. I picked the mild fresh salsa which is very watery and not great for dipping your nachos in but it tasted great. Overall a great burrito!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7FvIZ508CxZvNJ71fFFRw"
  },
  "QryCJa1IVBCE4DLGaBNdwA": {
    "date": "3/11/2015",
    "text": "Definitely the best of the \"fast\" Mex food in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fNHw13iskLRdspu3ROwvA"
  },
  "gjgojNn7ZC8VqqII3NWHWA": {
    "date": "11/3/2011",
    "text": "Sorry dudes, you're so close to my work, and our office loves you. But I've tried your burritos thrice, and I won't come back. There's nothing wrong per se, I just find it a bit bland!",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "P27bQcSOCsiRsv5wKwO3uw"
  },
  "mxLGc290fUmH4vevceoAiw": {
    "date": "5/30/2012",
    "text": "On the day of our visit, they had a problem with their grill, so slow-cooked beef was gone by the time we got there.  We both ordered grilled pork burrito as chicken looked too dry.  The tortilla was moist and the burrito wasn't soggy.  However the rice was way too dry and flavourless, beans flavourless (I don't know why they don't serve refried pinto beans), hot salsa was too vinegary, and pork gave us a weird aftertaste.  Overall they were light but bland.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMbGqg5EovIcFnfIxUw7hQ"
  },
  "58yMhPp060UXqEv6ipFTcw": {
    "date": "10/19/2010",
    "text": "After months of hearing epic tales of Daddy Donkey from my closest network of burrito fanciers, my visit there today was completely by accident after walking to another nearby burrito vendor and finding it closed. My colleague's eyes lit up, and he said in an excited low whisper, \"We could always go to Daddy Donkey...\". Approaching the van  I was surprised to see that it was a self-contained van, rather than the more \"cart\" arrangement at Freebird  the popularity of the place became apparent, by way of the blue Tensabarriers erected for crowd control, and also the apologetic notice that due to Friday popularity they could only now accept orders of up to 5 burritos per customer. They were getting through the orders fairly swiftly though, and so it wasn't long before I'd negotiated the gauntlet of smiley burrito assembly line workers and was hooking with gusto into my first ever Picadillo burrito - a sort of spicy ground beef arrangement. Maybe the problem was the constant hyperbole, however my burrito verdict on this occasion was \"Good\". Even if you factored in the atmospheric component of sitting at the scattered handful of rickety furniture (which my colleague assured me was \"very mexican\"), there was no denying that what I had was a very tasty yet poorly constructed burrito... almost as if they'd rolled it sideways, such that with each bite you got a mouthful of a successive ingredient. And nobody wants a mid-lunchtime mouthful of cold sour cream. My burrito companion looked at me with deflated shoulders and confessed that he'd just chomped into a complete mouthful of rice, and that by comparison to usual it was all a bit bland. To its credit, my final bite appeared to contain most of the salsa sauce, and as I wandered up and down Leather Lane waiting for my colleague to finish I noted that the flavour persisted and was incredibly tasty. But that doesn't catapult a burrito vendor into the coveted 5-star category. There was absolutely no question as to the quality of the ingredients - however you've got to know how to assemble them right too, and on this occasion the donkey daddy made an ass of itself.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "PE7VcTeX71hPy1r2kBN7LQ",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PE7VcTeX71hPy1r2kBN7LQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "pw-6CUHm0MwQOKpZiv8ciQ": {
    "date": "8/31/2011",
    "text": "I have read the reviews of my excellent fellow yelpers but have my own views of Daddy Donkey that I'd like to share.A Coworker of mine asked me if I wanted to try a new place for lunch, of course I said yes, one can only eat in the canteen so many times before it gets a bit dull. When I asked where we were going his eyes kind of glazed over and he whispered...\"Daddy Donkey!\" Now I don't know if it was his Greek accent or the far off look in his eyes, but the way he said \"Daddy Donkey\" I walked out of the office wondering if we were going for food or to some kind of male stripper lunch spot...ooooo Daddy Donkey. We walked through a maze of various stalls and I'm looking from side to side, expecting to see a dark door or some secret passages leading to this mystical place. After walking, what felt like miles, we arrived at a food stand with a very long queue and I start to get excited as I realise that Daddy Donkey sells burritos! Finally...has this American girl found her burrito salvation! Come on...you can totally understand my excitement, with a name like Daddy Donkey I'm expecting a donkey of a burrito, whatever that means, but for the sake of argument let's just say it means a damn good burrito.I'm almost giddy with excitement as I order my burrito and practically run back to the office, taste buds salivating! Unwrapping the burrito is bliss as I feel its weight and smell the chicken and cheese...yummy. I take a big bite and as the flavor bursts across my tongue I'm left.... well... a bit disappointed. Maybe I had too many expectations but there is no ecstasy...no joy...no VA VA Voom! The burrito was underwhelming! It lacked the punch I'm accustomed to from truly superb burritos and on top of that it needed salt. So sadly, my quest continues for an amazing burrito in London and I'll have to continue getting my burrito fix in America....oh the memories of shrimp burritos in Cali......hmmmm.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JdgnOJAlrfl8AiSRpeYmYQ"
  },
  "XUrw8p5sWN50Jf_jVe8h0Q": {
    "date": "9/20/2014",
    "text": "Was craving a burrito so badly one day I had to find a good one. My friend and I went to Daddy Donkey and got our burritos. They make them in front of you (like Chipotle) and they tasted okay. They weren't like the wonderful burritos in California but they cured my craving!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYYA1fGrQ3d1WFVvBS8rmg"
  },
  "Ul016AnmgTlTkv7q8FMGzA": {
    "date": "3/13/2011",
    "text": "If Mary had ridden into town on a Daddy Donkey the world would be a different place. Proper fast food burritos on Leather Lane that beat all the local competition by a mile.Is the food 100% authentic? Probably not.Is the food 100% tasty? Definitely.You'll have glorious meat juice running down your face and you'll revel in every second of it. The perfect lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "tV2ZQSVYo-AiKSrUaLXTIg"
  },
  "4NZjonS_siG5ckUdSqroVA": {
    "date": "1/11/2012",
    "text": "I dropped by here for lunch today and was pleasantly surprised with the burritos at Daddy Donkey. For £5.95 i received a Fajita D Burrito stuffed with grilled chicken, peppers, onions, salsa and sour cream. While not the best burrito I've had, you can certainly do worse in London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DHSBtASy42mWzoloGag8qQ",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom. Burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DHSBtASy42mWzoloGag8qQ/o.jpg"
      },
      {
        "img_id": "jSfAJ6kRL6mPRCzMgD_XQQ",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom. Stand",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jSfAJ6kRL6mPRCzMgD_XQQ/o.jpg"
      }
    ],
    "user_id": "fRTby8Cl5r440v0XoiZuag"
  },
  "jFjhVZ8ohIkkZII7fLucHw": {
    "date": "8/29/2010",
    "text": "If we put the very easy to descend into 'oo er missus' aspect of the name to the side, Daddy Donkey is very much the father ass figure it proclaims to be when it comes to burrito type noshery.Fresh grub, stupid sized portions and very reasonable prices make this place a go to lunch spot for those in the area. Just don't expect to pull off any suave, cool dude looks as you chow down on your donkey delight....oo er missus!",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "YCojkf140pN7s3R2kVM9VQ"
  },
  "BPXK27FMyqCmHKfr-yzmcg": {
    "date": "8/19/2010",
    "text": "I'm siding with Miriam and the North Americans on the hilarious British pronunciation of Mexican bites. The best one I've heard so far has to be \"fadge-eye-tahs\". I mean that just sounds wrong... in SO many ways. Anyroad, despite the fact that on this side of the pond we seem to be sadly lacking in good Mexican food (yelp.co.uk/topic/manches… - come on, you know you want to sound off), here is a four-legged hoofed beast of a problem solver. One cart, several efficient staff, and if you're anything like me don't get all distracted by the fact that the tall, dark and somewhat good-looking one can speak fluent Spanish as these guys work fast and you'll get severely bumped as you move along in line. This is London, remember. T'up North we might stand there chin-stroking and debating mild versus medium salsa, but you try any of that nonsense in The Big Smoke and you'll get a short sharp shock.I have to say, this was the best attempt I've experienced thus far. A deliciously soft wrap, fresh ingredients and plenty of each... no wonder I was searching for matchsticks to prop open my eyes that afternoon, I needed a big burrito bobos. There are plenty of choices too, you can grab veggies, chicken, pork, beef, and you can even forsake the wrap for a 'naked burrito'. All in all this was great value and it certainly did the job for a Mexican-deprived Brit like me. I'm just once again apologising for the extreme red onion breath I had for the rest of the day, sheesh, they don't scrimp on those bad boys!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "S90cznhfdL29yMSEZ_EnJQ"
  },
  "WLMFxQrI8JDjWmwN70t6Nw": {
    "date": "9/13/2013",
    "text": "Not exactly competitive with my fave spots in Northern Cali, but Daddy Donkey's veggie burrito will more than suffice during my years in London, and thank God for that!  I only wish that Daddy Donkey were open on the weekends, and that it had more locations or, perhaps, a traveling food truck.  I also wish that I could open a special drawer in my kitchen and just have one of its veggie burritos sitting there for me at all times, but hey, I guess that I can't have everything.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxDibCWRASQqg6JHXs8foA"
  },
  "b3D6D59_AaZAnKqVsxPUcQ": {
    "date": "7/27/2010",
    "text": "I just popped my Daddy Donkey cherry. Now if you didn't know that DD was a burrito truck then you could be forgiven for thinking that I'm suddenly into zoophilia. (ps. NEVER google 'sex with animals' on a work computer!!!)So after taking a lunch time wander down to Leather Lane I stumble upon the ever so famous burrito champions of London and I have to say, it was nice but... it really didn't blow me away. Yes the staff are efficient, but not friendly, the chicken was tasty but personally I felt it was a little dry. I'm not by any means saying don't go, this is a decent, tasty filling lunch. I just don't think I'll be raving about it like everyone else it. Okay, maybe it was all the hype that spoilt it for me. Damn you all!",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "IgA2KJ86g8DfJMW_CZLFZw": {
    "date": "11/5/2011",
    "text": "I don't think I can quite bring myself to give a street vendor a 5 star review, but yes  the burritos here are super.If, like me, you were hoping for a sit-down restaurant and perhaps didn't read the reviews on Qype properly, then you are in for a disappointment. Daddy Donkey (I should have known by the name!) is a street vendor, and your burritos are served from a van.Also you should probably know that the hours are limited; it trades only at the same time as the rest of the market on Leather Lane. I'm only mentioning this because I came one evening having heard about it only to find there was no such restaurant. That's because the van had packed up and gone home many hours beforeIt's great during the day, though, and you should go and take your burrito to a nearby square and sit and eat it!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PoukeoEW1jYK_4M3gRqQ2g": {
    "date": "6/22/2011",
    "text": "Love me some taco trucks.  DD has a streamlined menu, which is a good sign.  Burritos and soft tacos are lovely.Pay 50p extra for the toasted pumpkin seeds, and defo get the hot salsa.  They pile on just the right amount of beans, salsa, meat, cheese, gauc, etc.  Yum!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7TRexhGfCJtpSOHBHfrRvg"
  },
  "O9LjXt543lcixeVgxHl6Rw": {
    "date": "7/14/2010",
    "text": "¡Arriba! ¡Arriba!I like donkeys. I like little donkeys. I like medium sized donkeys. But daddy donkeys? They truly are the best of all donkeys - diminutive suffixes and all. What I'm saying is Daddy Donkey = delicioso grande burros. My papa burro was as action packed as Daddy Donkey's van at Leather Lane, buzzing with ass-kicking style, fresh veg, rice, salsa, black beans, and some of the friendliest amigos in town. Anyone that gets to wear a Mexican mustache and sombrero and make as many \"big-ass\" name puns on a daily basis is living the dulce vida. The fact that they also wrap up fresh-mex ingredients into the glory that is an authentic tortillas? Dios te bendiga.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "0pQKFCIBdD7dvfpEjRATnA": {
    "date": "2/3/2011",
    "text": "Whenever I get to London this is a must-do! Burritos can be ordered in different degrees of spicyness up to something you would consider to be a biological weapon. :-) For less than 10 Pounds you can have a delicious lunch including soft drinks and tip. I miss a place like this here in Düsseldorf. :-(",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kh606fulJSBImdlsc7fOnQ"
  },
  "ABvijS6LKJpIKbRvBv6j3A": {
    "date": "11/2/2012",
    "text": "Found this as #1 on the top five burritos of London, so I just had to give it try!The line, for some, seems quite overwhelming during lunch time, but that is what is so fantastic about this food stand -- they provide fast, efficient, and great service, you just have to be prepared with your request as they go quickly!I went with the fajita burrito which has peppers and onions instead of the black beans. My choice of meat was chicken, and I added sour cream, guacamole, and cheese to accompany the coriander-lime rice and veggies already included.  In my opinion, first the meat has got to be delicious, and the chicken was fantastic. But, what sets burritos apart are the veggies and optional additions -- daddy donkey has fab veggies -- cooked and prepared to the T.All in all a fantastic spot for lunch, and place to satisfy your burrito craving! Will definitely be going back!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GtFps6ipUxY9AEszEoZfvw"
  },
  "dCjcW8ghChI3IyIkU03n5g": {
    "date": "9/20/2018",
    "text": "Kinda like a knockoff Chipotle. It was in the Leather district. It was good. I would still go to chipotle. But it was nevertheless really good. I had the shredded beef burrito. I wish the beef was little more flavorful. And there was a steak option.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OVNoznqGEro2epQsLDH0UA"
  },
  "4aOxDZRQLAwGayVRy-MO-w": {
    "date": "12/21/2016",
    "text": "This...might be the best burrito in London. Wow that's sad.The good side - the meat appears to be high quality and the staff are really great. Went there and was impressed by their attitudes and general 'can do' spirit that, frankly, almost no restaurants in London have. However...the downsides are numerous. Basically its kind of a tie between this place and chipotle and you should probably then come here to support the local business but you're going to essentially get a bad burrito. Again starting with the positives - the tortilla was good and the chicken tasted good. The guacamole...was sh*t. I have no idea how you create bad guacamole, especially because, against all intuition, avocados in London are excellent. The lettuce looked old to me - I don't know how old - probably not a full day but old enough to look wilted and sad. Again, its lettuce we are referring to here - super easy to get right.On the 'harder to get right' front - the rice. Just wrong across the board - wrong type of rice, wrongly cooked with the wrong spices. Oy. They also only had a choice of black beans and I know its hard to get pinto beans in London but you should just do that anyway. Enteros or refried are key if you are a burrito joint. And just have onions and cilantro - they simply have to be there. It can be optional but its got to be there...Someone in London, some time, did some seriously bad sh*t to someone from Mexican American heritage (note: burritos are NOT Mexican) and they put a curse on this city saying that no one will ever be served a good burrito here. Or hopefully it was just a length of time because this is getting ridiculous. Normally when I eat a burrito from a truly good (and simple and cheap btw) place in the States, I'm baffled as to how they have made it so good. Here I was baffled how they could get it so wrong.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQjpwJs7CtoX4RF86TWAFw"
  },
  "sWBP2NKh4sPbbqVEqSA3Aw": {
    "date": "11/7/2015",
    "text": "One of my favourite Burritos in London...and luckily only a 10 minute walk form my office! That's made me a bit of a regular and I have not had a disappointing Burrito from these guys!My favourite is the Fajita Burrito, with Chicken. Then you get the usual extras-Lettuce, Cheese, Peppers, Salsa (Mix it up-I like some mild and hot together). Add some Guacamole if you are a fan and you are good to go! All the ingredients are fresh, and the portions are big! The service is amazing and compared to some other places on Leather Lane that you can wait in line quite a while for, these guys speed people through the door, and yet don't compromise on quality.Top 3 tips for this place-1.Go big-Get all the sides and mix up on the salsa-taste sensations!2.Be prepared to queue, but it won't take more than 5-10 mins as this guys are quick!3.Chicken is my favourite, but the steak is pretty good as well!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aipSBuPGQcbaXlzxKE-lwA",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom. Daddy Donkey-Leather Lane",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aipSBuPGQcbaXlzxKE-lwA/o.jpg"
      }
    ],
    "user_id": "_Lsr-xnqpISLMriK6bup4w"
  },
  "_KqvVFp7hXtt3hR9VS9s9A": {
    "date": "6/8/2016",
    "text": "Had 2 Burritos in a day, Daddy Donkey & Benito's Hat. It was like heaven & hell. Daddy Donkey is cheaper and taste way better, they have more variety of meat and sauce compared to Benito's Hat.I ordered the Fajita Burrito with chicken and habanero sauce and it tasted like bomb.The fiery spicy taste kicks in when the burrito's finished, definitely would come back for more...",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "n8O32rCZIl2wrkGwRsb2nQ",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom. Fajita Burrito with Chicken & Habanero Sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n8O32rCZIl2wrkGwRsb2nQ/o.jpg"
      }
    ],
    "user_id": "r-ywKY3O6fqnsuhQZatKcA"
  },
  "GKMn6Ktwwvyf1eyrqWuQsw": {
    "date": "2/21/2015",
    "text": "I've been visiting the Daddy on and off for a while, but this was the first time for a while, and the first time since they moved from the van to a proper shop. Thankfully they haven't moved far.I always go for a naked burrito in a box because it helps to try to keep it from going down my shirt. Sometimes it works, sometimes not so much. On this occasion I went for the shredded beef with peppers and rice (no beans), with the tomatillo salsa, lettiuce and cheese and of course paid extra for the guacamole.Credit where credit is due, nothing overpowered anything else. You could taste the seasoning on the beef separately from the salsa, even when they were in the same bite. Great salsa by the way, I'd eat a flip flop dunked in that stuff.It's a bit of a squeeze in the ship. But they have outside seating do I just sat there and are it up - while hungry members of the queue stared on jealously.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBqJ32j3nsyugAhuh0h2bw"
  },
  "X8XGg-ERk2SxA2CHu65PQw": {
    "date": "10/12/2015",
    "text": "I got the vegetarian burrito which was a big eat!  It came with black beans, rice, peppers, salsa, guac, sour cream and cheese. It could have used more cheese but it was otherwise, a tasty treat.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "n2fGmKCk7qYk2U8fH8Qy_Q": {
    "date": "10/3/2014",
    "text": "I used to really like Daddy Donkey's truck on Leather Lane, and had it fairly regularly when I worked within walking distance. Now I'm a bit further afield but had to be in the area for something else so excitedly sought out the new-to-me location. And I was considerably underwhelmed. I always get the Daddy D in a box, which is rice and black beans with the normal burrito toppings on top. Gone was the ground beef I favoured. The rice was dry. The beans were under seasoned and claggy. The shredded beef I got had no flavour and reminded me of leftovers from a bad roast. The guacamole was over puréed avocado with too much tomato. A let down overall, and at £7.50, not even good value. The burrito search continues.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IiojkDLHYdkfTJlINzUv-Q"
  },
  "xBevlYpp_s6MKKy9glMj_Q": {
    "date": "10/26/2013",
    "text": "The decor inside was pretty funny, but the service was a bit slow for the long queue that was waiting to order and get in. The food was excellent and the burrito bowl was super tasty! For the amount of food you get for the pound was great.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_WIWAivTecO722Mc_dCNxg",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_WIWAivTecO722Mc_dCNxg/o.jpg"
      },
      {
        "img_id": "Zv8exeNEIGRUm1pA-cflCQ",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Zv8exeNEIGRUm1pA-cflCQ/o.jpg"
      }
    ],
    "user_id": "5zedlY3ie4YFTD5uGZXPsg"
  },
  "I2Wf_1vBMWlaEU3mdqWA3w": {
    "date": "1/13/2015",
    "text": "Let's face it, we all love them, Burritos are an excellent feed but in my opinion they can be done very well and very badly. I'm more than happy to announce (because it's close to my office) that Daddy Donkey have their Burrito game on point! DD is a small Mexican spot on Leather Lane that puts the quality of the food at the centre of everything, the way it should be. The normal highlights like tacos and standard burritos grace the menu, but where they really stick out is their \"Kick-Ass\" and \"Daddy-D\" burritos. Basically they both cram as much of the insanely flavourful fillings in one wrap as psychically possible, it's a skill just to behold! All the meats and various fillings are as fresh as they come, you can see the staff in the background constantly churning these out and the smell that hits you from that freshly grilled steak is enough to make you take a few steps back. I went for the steak Daddy-D and it was almost a challenge to take down. An absolute feed, be sure you're going with an empty stomach. Went for the hot spice level and was nice to see that hot actually means hot. I like a good kick and this sufficiently made eyes and noses run. The guacamole is also excellent, I feel this is a good mark of a mexican spot and like most of the food, they've nailed it. I'd actually recommend getting the guac and chips on the side as the taste is so good, you don't want to risk loosing it amongst the hugeness of the burrito.Nice drink selection and free water is a nice touch to ease those spice pains. Prices are too severe too, had a very decent lunch and a drink for about £11, excellent work.One slight issue would be the size of the line at lunchtime (especially Friday's). Leather Lane is a food-hub and from about 11-2 every day it is very busy. The line to DD normally extends out the door and mildly down the street. I waited for about 8-10 minutes but honestly, take it in, it's more than worth it. Excellent work DD, get down there...why?..because you Mexi-\"CAN\". Oh, god, i'm sorry.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FYqdClyfBa5mzh2kotOCwg"
  },
  "uzDmDEjGrCWmhjOEmsAs0Q": {
    "date": "6/4/2012",
    "text": "For the longest, I thought burritos were really hard to come by in London until I stumbled upon Daddy Donkey on Leather Lane.  This is definitely one of the busier food stalls on the street - and they even have limits to how many you can order during lunch!  I usually go for the steak burrito.  Be warned, the spicy salsa is REALLY spicy.  It is much safer to go with Medium.  It's definitely one of the best burritos I've had in London so far.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "FMiNqIyAcgHZCnjXajm_PA": {
    "date": "12/23/2015",
    "text": "Amazingly fresh and delicious ingredients combined with fast and friendly staff made my meal wonderful. The chicken in my Daddy D burrito was so flavorful and tender. I could eat here every day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8W51WfdSQ--C8jp-yWwGOw"
  },
  "PYby6RoUctGVtMoHrNYvqg": {
    "date": "9/9/2011",
    "text": "Great burrito place! On a very competitive stretch of street food vendors (Leather Lane), Daddy Donkey ALWAYS has long queues during Friday lunchtimes. Having tried several other burrito places in London, this comes a close second to my favourite, Chilango.The London Insiderlondon-insider.co.uk",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "YP10uCLwqM7cHoe6jJAafA": {
    "date": "3/5/2014",
    "text": "Considering I am from So-Cal (Southern California) this is the closest I'm gonna get to an authentic burrito that i can get off a taco truck on La Brea after a long night.The best part is i can get a nice hot sauce (habanero).  Got the steak like usual. Great!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfGpxuO5EVPHrMEuDixpmA"
  },
  "iGuQNaqvGSYqeJpp7Ii0_Q": {
    "date": "6/2/2013",
    "text": "Ah, sweet Leather Lane. So many options. I am a huge fan of any food truck/trailer, so Daddy Donkey has been on my radar since first arriving in London. It took until a few weeks ago to get there though, and when I did, I proceeded to make myself sick on a pretty darn amazing burrito.I'm not really a burrito person, but they do a nice job of offering the ingredients that make it a simple, tasty experience. The burritos are huge, definitely satisfying, and a good price.I do wish they had other options, but the burritos are kind of the main option. At least they're good burritos though!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "HGRsww1_JKIBUejjbdbGog": {
    "date": "9/3/2010",
    "text": "My virgin visit to Daddy Donkey, which sounds far more rude than it actually is, was a delightfully happy lunchtime affair. When I saw the queue my legs wobbled - I was afraid, I was petrified, that I would never get to the counter before fainting. But, fear not, the tide of the Daddy Donkey lunchtime ride is swift and calmly envelopes you toward your goal, giving you enough time to choose amongst the variations and actually get excited about putting food in your mouth.I went for a fajita burrito, chicken, no jalapenos, extra guacamole and mild strength. My palate is of a delicate temperament and I didn't want to fill up on water over food - the resulting burrito? Beautiful. Flavoursome, stout, fat and proudly wrapped in foil. Watch the drippage, it's a messy and cumbersome toil but well worth it for the satisfaction. If you are a lucky camper you can even rest your feet post queue on their diddy donkey tables and pass the time by staring at the various amusing comic figures adorned on their van. A definite must for a hunk of fulsome fodder of a lunch-time period. Win!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "itw5t-iHS_gB-LjmHwx1MQ"
  },
  "F7gmeTtLF0bt7PMBDv0mfA": {
    "date": "6/16/2010",
    "text": "You won't find refried beans or sour cream that reminds you of homemade Mexican crema here (theirs is a bit more like yogurt.)But if you're lucky, you'll have a laugh with a fellow North American regarding the British pronunciation of fajita, taco and nacho while in line waiting for your burrito.The rice is white but I can forgive it because the burritos are wrapped somewhat properly and the picadillo is tasty. I will soon be back to Leather Lane for more of what Daddy Donkey dishes out!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 9
    },
    "photos": [],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "v-FMFfJKD2y5B4R_3YGBxg": {
    "date": "5/24/2012",
    "text": "My library mates got really annoyed with me talking about the peppers.  They didn't understand what I was saying and frankly could care less about peppers in any capacity.  For me, though, the peppers are the reason this is the best burrito place in the area.  They are perfectly cooked every time, and you get a hearty portion of them.  I know, it's just peppers... ... but it's also just a burrito, and in a vegetarian burrito, those veggies matter.Guac is good and lime-y. Medium hot sauce is a perfect amount of kick for me. They're very liberal with their portions and the line moves super quickly.Win.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "gf1UQyDGfNI_xfoxqItpmw"
  },
  "-vK7vjZ8R_Fx7Df_FViGYQ": {
    "date": "2/12/2013",
    "text": "I promise you, I have eaten more burritos here than in [redacted] years of living in the US. I just was never really that into Mexican food. But when you work in the area, you get to know and get bored of all the lunch places, and you come here with coworkers who worship the Donkey, and it's actually not half bad. And for a non-burrito lover (don't hate me), that's saying something.They have the most efficient assembly line ever. I always get the veggie, which gets guac free, unlike the meat versions. One time, I was convinced that they forgot my guac; however, on unwrapping back at my office, I discovered I was mistaken. They are just that fast.Prices are high, though. I can get the same amount of food for less at the Thai cart, or at KIN, both within walking distance. I think the prices have gone up twice in the last year, though they have finally introduced a loyalty program to mitigate.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cD2te7Lsf85xYYYrsijs6Q"
  },
  "Z3JIb30w1MUozFVmTSe2qA": {
    "date": "7/20/2012",
    "text": "This gets five stars for being one of the only decent places to get a burrito in London. As a California resident, I have high standards for mexican food, but Daddy Donkey hit the spot. Super fresh ingredients and awesome taste. Not to mention decently priced for the amount of food. I am very much a fan!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QLxSG5m_bnf12TGzE9nOlw",
        "caption": "Photo of Daddy Donkey Mexican Grill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QLxSG5m_bnf12TGzE9nOlw/o.jpg"
      }
    ],
    "user_id": "49aCB1D8ga70-57ZR7KhjA"
  }
}