{
  "a0RuGcHtCrE8Sbt3E8kKQA": {
    "date": "8/15/2008",
    "text": "I have been to Maroush a few times with friends, I am a very fussy eater and do tend to stick to 'traditional english' food, as i am not great trying new things. (I didnt eat chinese until last year! And still havent worked up to Indian yet lol) But this was a lovely meal. The waiters are so helpful, they even chucked in free drinks and other dishes etc because we had spent so much, and my friend was a regular. The food was very nice, although i was a bit scared to try it, it all tasted gorgeous and definatly worth going back, I was expecting the price to be very OTT as the restaurant was very well presented and in a great location in London, but i was so shocked by how cheap it was! A great night out, would definatly recommend.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zVjrLdBOg84BC-TAISbqEQ": {
    "date": "11/16/2009",
    "text": "This was our first stop in London....so worth it. The plate of raw veggies they gave us right when we sat down was the best. The lamb...the lamb the lamb. Set a really good tone for our trip!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vzwz-CP9B-8hVjxAYgc1Kw"
  },
  "odk9JkhpVx5CqfK8RfYz5w": {
    "date": "3/20/2009",
    "text": "Seriously yummy Lebanese. I don't know how they make the food so flavorful... maybe I don't want to know. I don't think I care since the food is so damn good. Hommos, Maroush Salad, Shish Taoukj and Kastaleta Lamb - all utterly fabulous orders.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZwYoYT-Z8R2tHDMT1bGbA"
  },
  "4dWctY2uii0jsnahSvSu0Q": {
    "date": "12/5/2009",
    "text": "This is a really nice outlet of the popular Maroush restaurant. Diners can sit by the high dining tables observing the chefs grilling and cooking in style or can sit on the 1st floor (cover charge applies) or on the ground floor for a more relaxed environment. Prices are very reasonable for the surrounding Knightsbridge/South Kensington area and the grilled meat is simply brilliant. Try the Lahem Mashwi (grilled lamb) or chicken livers for a rather unusual set of dishes.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bXIKjvWGq9CXslakCwB5BA": {
    "date": "4/2/2008",
    "text": "Im a regular to Maroush restaurants round the Edgware Road area, but we wanted a change for a special occasion, so went to this one instead, its smaller than the largest one in W2, but there is an upstairs, we ordered some small dishes, and there were soo many we were full! The food is exquisite, as was the service, but this place is also reasonably price, definitely one of my favourites.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pa7oj24_GZ5Q6LIPxCRC6g": {
    "date": "12/14/2010",
    "text": "5 stars for the DELICIOUS chicken or lamb shawarma ..perfect amount of garlic and pickled cucumber.  The complimentary baklava is wonderful as well. Very casual, hole in the wall type of place ..late-night hours and prime location = perfect spot to grab excellent post-bar grub as well. You can sit down or have the shawarma made to-go in little take-away pockets. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBxxE2oLmht1buVp9xjlBg"
  },
  "REP1x6R9RKUT370aEUvPkA": {
    "date": "1/10/2009",
    "text": "Delicious Lebanese staples. Ate myself sick here, must try the fish and mezzas.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2UwLvWmAi3-rWZxqQQN_Q"
  },
  "WX6vmsRUILR39e5HY33XyA": {
    "date": "8/18/2008",
    "text": "This used to be a regular eating joint during our university days/nights and I have fond memories of going for a middle eastern fix comprising of the melt in your mouth chicken taouk, moutabbal(Baba Ganoush), houmous with meat and washed down with fresh jalab juice(which I cannot seem to find anymore).When we felt a bit more adventerous then it had to be a juicy lamb/fresh salad/chicken shawarma with lots of garlic and special chef sauce(like a spicy salsa sauce)and not to forget the special pickles!!yummmyyyyy",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CC2e3dIF3IU8OqoP6seQHg": {
    "date": "5/11/2015",
    "text": "Quick update, still excellent after many visits over a period of time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBjuWMpbf6egqpQhwoG1oQ"
  },
  "IPy-BI6gqekv2x96MAKg1g": {
    "date": "2/11/2013",
    "text": "The food is really good here. Always fresh and extremely tasty. I usually go for the hot and cold starters tapas-style and skip the main course. I have a lot of favourites, but the falafel and the humous beiruti is really good. They also do a mean melon juice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tcTTATDVkNccRFVLZbdykQ"
  },
  "BS_kwFkbEzDLZIZMQ5P9VQ": {
    "date": "1/25/2011",
    "text": "I had no idea humus or baba ganush could taste so delightful! And the Shawarma? Out of this world. The interior could a bit cleaner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vh_F9lAQzztdRRu4WQNMiQ"
  },
  "yYz9ZRmNbfT6EWArZhpdfQ": {
    "date": "11/22/2009",
    "text": "Black Cab to Beauchamp Place: £5Three Chicken Shawarmas: £12Hot Lebanese food in Belgravia on Sunday night at 11:55pm? Priceless.Maybe it was the *hiccup* influence we were under, but with fresh homemade hummus, chili sauce and a bit of onion, pickle and tomato, this was the best kebab (ok fine, shawarma) I've ever had. (Should I be concerned that a 4 minute taxi ride cost more than my meal? Maybe tomorrow...)",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "Ttx5J8d9tuTTzZ54tYtCwQ": {
    "date": "5/22/2010",
    "text": "Every so often I have a massive craving for their lamb shwarma. Nothing else will do until I have it. The best in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PAFlpDtI9gwR8gyt1kB5jA"
  },
  "8cz3XncHoPoT8rqTM3dQGQ": {
    "date": "12/27/2010",
    "text": "This place has the most amazing hummus EVER.  They charge £2 for sitting in vs take-out, which as far as I know is unique to this location & the Maroush Gardens on Edgware Rd, but it's totally worth it.  The food is reasonably priced & my friends & I generally get a bunch of hot/cold mezze to share (usually Spicy Lebanese Salad, Tabouleh, Hummus Shwarma, & falafel.  I've made an exception to this a few times & gotten their shish taouk - so SO good. Also, I love that at the end of the meal you get a fruit platter & seriously the best baklava I've had in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmsC7nkfSV5BwSbjiTGDJQ"
  },
  "BlXipRqBa4-zAi_sXAjkGw": {
    "date": "7/14/2011",
    "text": "Im a regular to Maroush restaurants, Beirut Express, Ranoushall !! :) They are all the same network and i can said i love their wraps, hummusbut my favourite is Maroush Express in EdwardRoad, they use diferent kind of bread, ;) another good branch is the Ranoush in High Street Kensington. In general, the food is good like the service, and is also reasonably price, is one of my favourites when i'm with hurry and i want something real good ;)Another day i tried the RANDA, from the same company, the same quality but more sofisticate.FV",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sr5Q-SkTTDWc1punLpJzAQ": {
    "date": "7/12/2009",
    "text": "This is the only Maroush i have been to, and given its location (basically its proximity to Harrods), i was initially quite apprehensive of the cost. That however turned out to be a pleasant surprise.We were seated upstairs. We followed the waiter into almost the kitchen before we realized their is a small passage beyond the takeaway counter that leads to an extensive dining area.The food is very good, and they have an extensive selection of starters and main courses from several middle eastern countries. I would strongly recommend the kalawi (lamb kidneys) and the standard meat kebab dishes.  The service was good, and we received generous help in selecting our dishes.-1 star for the service time. It seemed to us that they took an inordinately long time to get the food, the bill and everything. What they got after the delay was great though :)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "o_FCONg2kJfpzAJIVHFlxQ": {
    "date": "5/3/2010",
    "text": "I came here with a friend and we had the menu for two. I cannot say I was so overwhelmed that I would queue to get in again and recommend this place to all my friends, but at least the amount of food was very copious indeed. The humous was also quite good, though I was not too fond of the overcooked sujuk (lamb sausage). We ate in the covered terrace, which looks and feels like a cheap suburban converted greenhouse so the ambience was not too wonderful. Service was quite OK, though they hit us for cover charges of £8 (for no reason that I can think of). The Middle Eastern music was competing with some bar disco noise thumping up from downstairs or next door, so it wasn't the most harmonious of evenings. Still, if one wants to be thoroughly fed, then this place fits the bill, especially with the menu for two.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rt-_fc9ScucMdiVWcsRdGw"
  },
  "oEkIqZ_NrjYsVkaKdSiD4A": {
    "date": "12/6/2008",
    "text": "One of *the* post-clubbing dining staples in the West End.  I've been here countless countless times - gratefully noshing away at 4am.  Oh my dear Maroush - what would I do without you??You see, even in a slightly inebriated state, I'm still one to turn up my nose at fast food and those questionable kebab outlets, so the best part about Maroush is that, not only is it open late, it's really *good.* Good enough that I come here on lazy Sunday afternoons when I'm absolutely sober and can't get the thought of their hommos or their moussaka or their fresh and tangy salads out of my mind.  Good enough that I practically proselytize about their baklava (which comes complimentary at the end of every meal).  And good enough that some dude who once tagged along with my friends and me here after a night out, had the *nerve* to text me only once again - at 3am on a Saturday night - to inquire where in the world \"that really great Lebanese place we went to\" was.Ha... I didn't bother telling him, but I'm telling you.  Go forth!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "_7WdbmNVYcxns-2r3NcJhA"
  },
  "D-VkBMQXCNYtaWazw85rXw": {
    "date": "5/30/2014",
    "text": "Great food and excellent service.  Went with my wife and three year old son.  We really liked the food.  The waiters were very accommodating when my son started to 'kick-off' and helped settle him down with a free fresh fruit juice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NSTUYXfuBgg6N-SWoVFHQ"
  },
  "vKBdmFEvH04zpc3-i_JM4w": {
    "date": "12/20/2008",
    "text": "The best Lebanese food in London. This restaurant has the most amazing range of typical Lebanese staples. All of their ingredients are super fresh and the quality of the food is outstanding. If when you go you are in a rush or just don't want to sit and pay, go directly to de deli and get a kebab to go, its pricy but you won't regret it. Otherwise if you have time and a little more money to spend, have a sit and enjoy the glorious food. I recommend you get the lunch box for two. It has approximately seven courses, including dessert and the sweets here are fantastic.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kysFTgr6_kxpA94XSYHZxg",
        "caption": "Photo of Maroush II - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kysFTgr6_kxpA94XSYHZxg/o.jpg"
      }
    ],
    "user_id": "eN7dzEJM0yL0NgvAbCYbkQ"
  },
  "6ue33sy--zrvbQJqHVddHw": {
    "date": "1/25/2010",
    "text": "A few simple words should do it    Amazing lebanese  kebabs  actually a lot more than that spicy leb sausages humous chefs spicy salad chicken livers awsome ,,great place to see and be seen",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4QB-Je2NeRDU7hr1B5Spg"
  },
  "h53e6MLuZ97KGWHNDOQ8rw": {
    "date": "5/30/2011",
    "text": "I had the pleasure of going to Maroush for lunch the other day and enjoyed it immensely.  Quality Lebanese located on a posh street in Chelsea and still incredibly affordable!  The hummus was very good and the Tabouleh salad was very fresh and delicious as well.  I also enjoyed a lamb shawarma.  The main floor seems to be more casual eating - shawarma's off the lunch menu - while the upper floors look to be relegated to upscale dining (tablecloths and such).  Service was good, food was delicious!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f47N37WU1_PsQKxvZdaTwA"
  },
  "2Y_vfadMzJkApNDPDujcWw": {
    "date": "1/29/2009",
    "text": "Yum. Lebanese food has my name all over it. Had a wonderful dinner here several years ago. Love all the hot and cold mezza - hommos, foul medames, lebneh, kibbeh, you get the idea. Since I kind of OD on these appetizers, I'm pretty full by the time the main course arrives. My husband loves raw kafta so we had that as well as fattoush salad (one of my favorite things). Next time we have to try to the lahem pizza! As I am not a fan of rosewater, the baklawa was delicious but I do want to try the ossmallieh next time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Xi2i_i1RzKkoJ41_1JHig"
  },
  "4hOvH3Dpc3b3gG1So6T2Kg": {
    "date": "12/16/2008",
    "text": "Beauchamp Place is terribly posh. The people are posh and the prices are posh. Maroush is a restaurant on Beauchamp Place that cooks Lebanese food. Kebabs to you and I. So of course the kebabs have to be posh. I'm somewhat of an East End London boy so I don't really belong in West London and it may be the reason I don't like it.Maroush is a Lebanese restaurant that has an excellent reputation with the locals, but not with me. It is very expensive to eat in the restaurant, so I don't. I've bought lamb and chicken shawarma's that are nice but small, and for £4 just not enough. A shawarma is a fancy try at a kebab wrap.The service is aloof and smiles tend to be reserved for friends of staff members.I do not doubt the food as it is tasty, but the attitude really puts me off.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "GO4H2V2xccWTvoBPte7r8g": {
    "date": "4/16/2010",
    "text": "I LOVE MAROUSH!!! All of them! Maroush Ranoush, Maroush II, V... this is my latest brand that I'm fully backing because 1) The food is amazing! Baba Ganoush, their garlic yogurt, spicy sauce, spicy lebanese salad, shish tawouks, omg (again why am I writing myself into a food frenzy  at 7:30am when everything's closed)2) Healthy and fresh! You can order a huge plateful of fresh veggies (this is sad and wrong how hard a simple thing like unaltered veggies can be to find)3) Complimentary baklava (GOOD baklava) at the end (and sometimes complimentary fruit and veggies - not sure how this works, but I've got it sometimes other times not)4) Affordable prices5) They are everywhere!!!Maroush and I just seem to get along really well. Kind of like the relationship I had with Starbucks for so many years (the familiar comfort of knowing what you're getting. Except here you are obviously not getting your venti triple short skinny)Mmmmmmmmmmmmmmaroush!!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "xmji1-h4Q-eyOGHn02H5lA"
  },
  "IQFrOdidD3NaCjQDtkcM2A": {
    "date": "8/6/2009",
    "text": "The two on edgeware road and the Ranoush on Kensington high street used to be top notch. I remember many a nice evening in those places, although the atmosphere and service are still there I just think the food is missing the passion it had before. Last time I went in I had the Lamb Shawarma, which although was spiced correctly was very fatty and this gets worse if you allow it cool down. The mezes are a bit commercial also, you pay a bit over the odds to eat here and yet it's not the best anymore. There are other tastier and cheaper alternatives on edgeware road, as anybody who goes there knows it's full of lebanese and middle eastern resturants so there is a lot of choice. I just think they might end down sizing in the number of outlets they have in the near future because in this market and with the knock on effect of the credit crunch only the best places will survive in the short to medium term.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Iaj276iaORMN5rluCPp_uQ": {
    "date": "8/17/2008",
    "text": "Probably one of the best value options for food around Knightbridge. Excellent Lebanese food and great restaurant, both to eat there and for take-away. I no longer go there as much as I used to but this is a perfect late night dinner place as they are open until around 2am I think, which is really rare in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S4CkWNbetktE_D3AL4k9Ng",
        "caption": "Photo of Maroush II - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S4CkWNbetktE_D3AL4k9Ng/o.jpg"
      }
    ],
    "user_id": "HMe7MW1M-4A1iEhySt4wpA"
  },
  "Nhle3qcYnRGarBQeBUPohA": {
    "date": "11/19/2009",
    "text": "I only get take away, so I don't know what it's like to sit down and eat, but the quality is good and the turnover high. There are a lot of spin-offs and sister restaurants of this place (I swear that Ranoush Juice must put crack in their shwarma's after 2am, because they work you up into a frenzy) but I think this location is one of the best. True, it always tastes great late at night and there's usually something amusing going on the later it gets - although, last time, I saw a couple of lads on a bender who had one of their mates suffer a heart-attack while waiting for their midnight special... so, be forewarned.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wtQ6CEe8i1OtxKZBft7kiQ"
  },
  "iwcLcYiqhmMuPp8dXdHEBg": {
    "date": "11/3/2014",
    "text": "A little piece of Lebanon in London.My Lebanese partner takes me here as he swears it's the best Lebanese food in London. His claim is supported as most of the clientele are Arabic. It's busy weekend evenings and I'd strongly recommend booking, during the week and lunchtimes the place is pretty quiet and you can just walk in. I would choose this place over anywhere on Edgeware road.We go with a selection of hot and cold mezze and the portions are large so be careful! I've yet to find a lamb dish here I didn't find juicy and delicious. They have a good selection of red wines and I recommend their chateauneuf du pape. Upstairs is a formal restaurant and downstairs has more of a relaxed cafe vibe.The service is efficient and the waiters are very patient when I attempt to talk to them in Arabic.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYGHZdoL32wUKz5kJfjP5A"
  },
  "DMJyk3_3JkjReeUowAIs1g": {
    "date": "8/3/2014",
    "text": "If Lebanese food has a spirit.... Then it's name should be  Maroush.... Excellent Shawarma.. beiruti  Hommos and Maroush salad  will form an excellent choice for a mid day meal...  Outside seating are excellent and the area is quite and not as busy as nights bridge...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4_UtpwxfpkoInfjeTtOkUw",
        "caption": "Photo of Maroush II - London, United Kingdom. The entrance to the restaurant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4_UtpwxfpkoInfjeTtOkUw/o.jpg"
      }
    ],
    "user_id": "5dOJ5IAzDGYpPMf7cH8l6w"
  },
  "i9wiTQnk5l93P9tU70Q91g": {
    "date": "11/22/2013",
    "text": "We ate upstairs. This was a lovely dinner. The vegetarian choices were plentiful and delicious. My friend loved the lamb. The service was attentive but not cloying. We both loved the food. At the end of the meal we were given a large plate of fruit and some small sweet breads. We thought that was a great touch to a fabulous dinner. SURPRISE! There was a 2£ cover charge for each of us. We didn't notice if this was announced anywhere before but if so, we hadn't noticed it. We just deducted it from the tip and in all fairness, the fruit and desert would probably have cost that much. The dining area is spacious and we had a nice seat by the window where we could see the street.There is a dining room downstairs that serves the same food with no cover charge.... And perhaps they don't give you the little extra at the end either. I'm going to try to get back and find out, the food is great!There is also a nice looking bakery attached.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mM5WfjfBOjuiw0eELmpbA"
  },
  "azzwYgBgebjIT2FZLDW_-w": {
    "date": "8/29/2013",
    "text": "Topnotch food and service.  We walked in without a booking and were promptly seated upstairs in the \"greenhouse\" with a glass ceiling.  The three of us shared an assortment of starters and just one main course and it was plenty of food.  The waiter was helpful in guiding us (I guess he's pretty familiar with what tourists will order) and we had just the right amount of food.  Everything was delicious.  The place was full of diners speaking Arabic--always a good sign.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-atxx_G9W1sXZ1RYDqUSVg"
  },
  "cfU1m4h9kic1U3v6YCsuAw": {
    "date": "8/16/2016",
    "text": "We had a craving for grilled halloumi cheese and came across this place right down the street! And we were very much satisfied. The waitresses also brought us toasted pinenuts fresh from the kitchen! And then fresh fruit and baklava to top off a wonderful meal and we were sold!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YlG5Zmx4PUxc6PzZCxsi8g"
  },
  "A5BbcF8CFxcg7881-LB6HA": {
    "date": "6/28/2014",
    "text": "If you like middle-eastern food, this is the place for you.  Main dishes are good, but I recommend ordering several small dishes instead, its so much more fun.  The selection of both hot and cold mezza (small dishes) is enormous.  Feast on dishes such as Moutabel Baba Ghanouj (Baba Ghanoul witth grilled eggplant pureed in), Tabouleh (that faboulous salad with a parsley base), Hommos & Bazenjan Al-Rahib (Eggplant with tomato, onion, mint & parsley).  All on the cold Mezza menu and all around £5.  And/or go for the hot Mezza with wonderful grilled Halloumi, Falafel, Batata Harra (fried potatos & vegetables), Jawaneh (grilled wings with the most incredible Med garlic aoli) and Soujok (a spicy sausage).  Each dish between  £6-7.  Then there is the \"Lebanese Pastry\" selection, from £4-6, with the most incredible Lebanese \"pies\": spinach & onion, lamb & pine nuts, Halloumi, etc.  Shawarmas are £5-6.  Vegetarians and non alike will be in heaven. The fresh juices are great too.  Everything is incredibly fresh and delicious, service is relaxed and friendly and the room is serene and beautiful.Enjoy.See my pictures at somacheapeatslondon.word…",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ktLaX6zz0SUNlr4Z0otmqg"
  },
  "08WRwsLuW4dDpL25HE1dNg": {
    "date": "5/29/2016",
    "text": "The best Lebanese restaurant in London in my opinion. Great food, like if you were in Lebanon, great service, maitres D Shadi and Tony embody the true Lebanese hospitality. The prices offer great value for what you get. Jim Z",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGL6wd1rU72XmB3eAuoqbw"
  },
  "OtNlppdGbaRviZDXgIiCSA": {
    "date": "11/8/2010",
    "text": "You are in London, and want to get something to eat at 2 am? Where to go? Maroush II is where you go. Call a taxi and head over here. It is a buzz on the first floor where people are eating at the bar, or if you want to relax and talk head upstairs for dining. This is a great place for heading out for amazing food in the wee hours of the night. I think we were there at 2 am and had fresh, well prepared food upstairs in the dining room. That they are still on the ball at 2 or 3 am is amazing considering that most of the clients at this point have had a few too many cocktails. We had the hummus, two lamb plates (schwarma and cubed lamb) and we hung out talking after that for quite a bit of time drinking spring water. It was the perfect place to sober up before walking around the block. Great night spot for simple fresh Mediterranean food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RkWYdiLCzKXM0EcQjAySfA"
  },
  "Ws4ShNuWdftMfCrLGBAwYA": {
    "date": "4/20/2012",
    "text": "We chose to come here on a Friday after work, because it reviewed well on Yelp! and we felt like trying somewhere new.  Perhaps it was too early, but we were the only ones there at first, in what seemed like a large space.We studied the menu and saw a wide selection of hot and cold starters, pastries and main courses. We wanted to enjoy a variety of flavours, so we chose 6 of the starters to share as our entire meal.  The food was ok, but not great.  It had a sameness to it all.  I probably would not come back here: there are bound to be other better Lebanese restaurants to try.The service was similar: ok, but not great.  When we got the bill, we noticed the £2 per person cover charge. Restaurants with cover charges annoy me, and I decided I would give it one less star as a result!",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "vy8_9TWRj58b3gGYtF6yLQ": {
    "date": "3/31/2012",
    "text": "Needed a quick fix of a hearty shawarma sandwich before hitting up Sheesha.  This place was located near all the sheesha lounges, and had a good variety of items to select from.  I think it went really well overall, definately a festive/lively place to hit up on the weekend.  I was there alone, so I did not stay too long...just had my sandwich and a drink and left.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ORwjDj54rMl2M_h0FmMEaQ"
  },
  "NOCVMseThzUh_SwzrZUysg": {
    "date": "12/27/2014",
    "text": "Best Lebanese food in London. Hands down. Falafel is terrific.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWvDUP3DY9e4idDi0DPq4w"
  },
  "hzBuo2eOAfsSIaHFhL7dwQ": {
    "date": "9/17/2014",
    "text": "The food here is absolutely fabulous. Everything you'll take is good. We took fatoush salad, Kibbeh, Shawarma plate, Hummous and more - and it was all AAA+. 5 Stars. The service was also great. The only problem is that this branch is (much) more expensive than the same branch on Edgware Road and has much less selection. It is an upmarket branch with the same food, nicer decor and much more expensive prices. 14 pounds for a (relatively small) shawarma plate is pretty steep, I would say.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z00ps9eHhSDSXxKh2bFKLA"
  },
  "9tBPJPqvtYuejpwW07sf0Q": {
    "date": "4/13/2012",
    "text": "FALAFELWhen I think of a good falafel, it's all about texture. You have a moist center with a crunchy crust. Simple enough right? Not necessarily so. I've been to way too many Middle Eastern restaurants that get it wrong (overly mushy, borderline wet). Maroush gets it done right.TABBOULEHThey use flat leaf instead of curly leaf parsley, which makes a big difference as flat leaf has a stronger flavor profile.LAMB SHAWARMASometimes I find lamb to be a bit too gamey for my taste. I'm not sure what they do here, but I found their lamb to be fantastic. Just thinking about it makes me want to hop on a train and head over there right now!ADDED TOUCHAt the end of the meal, they give you a small complimentary plate of sweets. If my boyfriend and I weren't running out of time, I would have ordered a full serving.OVERALLThis place will not disappoint.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3BHfRnJ7oDtYG_HOIIaznA",
        "caption": "Photo of Maroush II - London, United Kingdom. Desserts - complimentary",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3BHfRnJ7oDtYG_HOIIaznA/o.jpg"
      },
      {
        "img_id": "ovXT9uTiyr87agwTkU57Ow",
        "caption": "Photo of Maroush II - London, United Kingdom. Hummus Lamb Shawarma.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ovXT9uTiyr87agwTkU57Ow/o.jpg"
      },
      {
        "img_id": "R2FRz-vUcVkJw6-C-Hvlew",
        "caption": "Photo of Maroush II - London, United Kingdom. Falafel. Best I've had.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R2FRz-vUcVkJw6-C-Hvlew/o.jpg"
      }
    ],
    "user_id": "KbMrC4qZZuOQQxmmuLl-wQ"
  },
  "AKLZf1O0oLNelU2fuBCRug": {
    "date": "7/11/2009",
    "text": "Lebanese food. It doesn't come to mind as one of my favorite places to eat but now I may have to rethink that after a visit to Maroush. It was late to eat in London (11pm) and most of the places around my hotel were no longer serving food. A bartender at a nearby pub suggested Maroush which we grabbed at. We walked in and were directed to the restaurant side of the place (one side is for counter service and take out) where we were seated immediately.We began to peruse the menu. Now having never had Lebanese food- and with my colleague a bit of a picky eater (it was all I could do to get her to sit and stay for the meal) I knew I was going to have to be smart in my choices as she deferred the ordering to me.  We started with hummus and some type of grilled cheese served with tomatoes and cucumbers.  Our server also brought us a couple of Lebanese beers which were quite good. I began to see a smile on my colleague's face. So far so good. Then on to the entrees. I went with the lamb and chicken combo (sort of like shish kabobs) seasoned with some great (but unknown) spices and served with what I think was yogurt and some kind of spicy sauce, while she had grilled chicken. We also had a side of the rice. Quite good all the way around. The food came up quickly and was devoured just as quickly. Our server was very helpful- pointing out things on the menu that she liked and showing us how we might want to put the various sauces and foods together. She also brought out some complimentary Lebanese desserts which were the perfect, sweet way to end our evening. The manager told me that this place does most of it's business between 11pm and 3am as it is one of the places that stays open for when the clubs in the area close down . Reasonable prices too! I knew the evening meal had been a success when I heard my colleague praising it to others the next day. A good night for a couple of Lebanese food newbies!",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 3,
      "cool": 6
    },
    "photos": [],
    "user_id": "ZYZNcugF3xUEGyLOVGiZ0Q"
  },
  "ueuBX6o4EiEVS-qDS5OK1A": {
    "date": "7/23/2011",
    "text": "Shockingly good!We don't find ourselves in Knightsbridge often, but after an event at the Austrian Cultural Foundation the other night, we needed a quick dinner, and resorted to the interwebs for some suggestions.In keeping with our \"Don't Eat British\" policy (because really, why would you?), we found this place on yelp, chowhound, and various other boards, and thought we'd give it a shot.Thank god we did. Amazing. Delicious hummus, fantastic kibbe nayeh (raw lamb with onions and herbs), and good chicken shawarma (an extra tomato or two could lift that to a higher level). Hummus was balanced, flavorful, just the right amount of spice to make it interesting, and the right amount of oil to make it oh so good. The kibbe nayeh was a new experience, and definitely worth it. Up there with the best steak tartare, this was finely chopped, almost purreed, and nearly melted in your mouth, tasting nothing like the lamb I had ever had before. Delicately spiced, and with an incredibly unique taste that's hard to pin down after only one try.Nothing very fancy about it, just a really wonderful little sit down place, surrounded by fascinating Middle Eastern families discussing their weddings, truant sons, and princess daughters. Quick service, excellent food, and yes, a rolls Royce or two waiting outside. But for us, our bicycles.We will absolutely be back, even if it means braving the night-time hordes that turn Brompton Street into little Dubai.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x6Blr6-hVZ6zsgkZdVcivw"
  },
  "4b8YDXycu0wbDhhtM5O_yA": {
    "date": "11/6/2014",
    "text": "Wonderful Lebanese food, great service and reasonable prices. Highly recommended for lunch if around the Knightsbridge area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "46NIxj_-9M0szmq4lptjMA"
  },
  "OkpBwi2nzIK-Dcm7azHrKg": {
    "date": "7/4/2011",
    "text": "A bit crestfallen after our first Mediterranean choice at Harrod's fell through, we decided to lunch at Maroush instead. At first glance, the decor seemed too minimalist and the atmosphere lacked the festivity of a restaurant withing walking distance of a major shopping Mecca. However, after we happily tucked in our sprawling lunch spread, we rather enjoyed Maroush. We ordered hummus and salad to start. It was easily one of the most perfect bowls of hummus I have ever had in my life. Then we ordered chicken shawarma, lamb cubes (though \"cubes\" certainly don't sound enticing) in curry, and falafel. The chicken shawarma was tasty, but the lamb cubes and falafel were definitely more remarkable. The lamb had the ideal tenderness, tearing apart perfectly and playing well with its tomatoey curry. The falafel, toasty with a nice tinge of spice, was excellent. Also, we all had their fresh lemonade with everything, which I highly recommend as well.I would definitely recommend Maroush if you're craving a little meaty, tangy Mediterranean goodness mid-shopping session!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQN7vrY7PMgfQp2Gwn6Iew"
  },
  "8XTch_aNaD8rkTX8De0iGQ": {
    "date": "2/12/2014",
    "text": "The food is amazing (considering you like Lebanese food)! Place is very informal, so perfect for a casual meal. I had the Kafta yoghurtlieh, which was great! Hummus and Labneh are also good as starters.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHsJVqSnWeDQdJAaQFZv6A"
  },
  "-87uACWLzgd_3IIiGf_ZyA": {
    "date": "4/7/2011",
    "text": "So good. I looked up this place on Yelp and thought why not. Where else can you walk down a street to eat at a restaurant as modest as this place while passing by Rolls Royces parked at the curb.I got the lunch special mixed grill. Let me tell ya', I was super stuff and all of this food for around 10 pounds. They started with bread with an assortment of dips (hummus, baba-ganush, etc.). Then, they giv eyou the assortment of grilled meats. YUMMY! And just when you think you're done having an excellent meal, they bring out a plate of baklava!I highly recommend this place. You can't go wrong with eating at this establishment. Go during lunch so that you can take advantage of their lunch specials.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_APo4b5Y2lDlP681zvROA"
  },
  "m6a9LVXABnRvzmWc22ZfaQ": {
    "date": "7/15/2012",
    "text": "The hommos and baba ghanouj were excellent.  Lamb shawarma and kafta khush-khash were packed with flavor and there was plenty of it.  Complimentary dessert of fruit and staple pastries.  Could hardly walk out, but can only blame that on myself.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MmVpxJO-V0oGWTthJHBrCw"
  },
  "3Kgxn_tvuQqncdoTbY9mdA": {
    "date": "1/3/2016",
    "text": "We were craving lebanese food. We based our decision on both Yelp and Tripadvisor reviews. While our entire experience wasn't the best because of a large family that came into dine, we made the best of it. Given some of the issues trying to put a family in a room that we were dining in, the servers realized the issue, put us in a different room and made our experience more than anything we would have ever asked for due to the issues. We just wanted to sit in a different room because of the obnoxious family. There was about 15 of them, so I'll let you think of what we went through.The staff is amazing from start to finish. Very friendly individuals, all of them. The location is very convenient being close to Harrods and in a very boutiquey shopping area. I ordered Shish Tawok and it was supurb. The flavor was incredible. My partner ordered the Chicken Shawerma and was also very impressed with the flavor. We both expected that our orders would be over a bed of rice, but it didn't matter. It was delicious. Given the mixup with the family the staff went out of their way to make sure we were happy. They brought us a fruit tray, which normally I don't eat fruit, but this was definitely the best fruit we've ever tasted. Very fresh. It was almost like it wasn't real because of how fresh and delicious it was. They then brought us out ice cream, which was also some of the best homemade ice cream we've ever had. Lastly, to cap it off they brought us mint tea. I have to say, for staff trying to ensure the rest of our experience was perfect, they didn't an amazing job. They went way out of their way. Because of this, we will be back soon. What a great place. I highly recommend it to those who love middle eastern food.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dcuvwkMkInvSOmXsz80N8g"
  },
  "MXPLK4oH49LUjv3qLp0fuQ": {
    "date": "2/11/2016",
    "text": "I come here once a month and I believe they have the best lambs shawarma in London! I make them put extra sauce on it with pickles and tomatoes and sweet peppers. Today I managed to eat three but my record is for four:) are usually have it with mint tea tea which is very fitting! At the end of the meal you will be served some fruit and some sweet cakes which I find wonderful. I have also eaten other things here which are also nice but the lambs schwarma is definitively the best!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IBzsH-6yrOxpzM9LZLvkUg",
        "caption": "Photo of Maroush II - London, United Kingdom. A very happy customer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IBzsH-6yrOxpzM9LZLvkUg/o.jpg"
      },
      {
        "img_id": "NvDn7WokIpV3Uo9hzgFzww",
        "caption": "Photo of Maroush II - London, United Kingdom. After the feast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NvDn7WokIpV3Uo9hzgFzww/o.jpg"
      }
    ],
    "user_id": "FXZWoLk0cG20HeJJhNn_iQ"
  },
  "N73lcfEaMUp2FyXFofLsqQ": {
    "date": "2/13/2015",
    "text": "After a late night partying in London, this is where people end up for some late night food.You can order all the usual shawarma wraps and they have good hummus.Avoid the cabs they recommend outside, just catch a black cap its cheaper",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YJRhX3dL8QdS2w326bG5QA"
  },
  "YBRlKCpALhHJqhOKApd4rQ": {
    "date": "10/6/2015",
    "text": "Great place in a perfect location just behind Harrods.Lots of choice for veggies and vegans and surprisingly cheap, especially given the location.Would definitely go back.",
    "rating": 5.0,
    "rated": {
      "useful": 11,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7flI6wBYRgV6izzxMf3xKg"
  },
  "eODx_a0uWKUh7F28qnWtMQ": {
    "date": "6/24/2015",
    "text": "We walked in as I was familiar with this place. We were fresh off the plane and in need of good quality london dining in contrary to the worst airplane food experience in my lifetime on my favorite carrier - Delta. Was a little worried about our choice as we chose the dining room and not the bar casual area. The wait was long but only one server greeter and bartender all rolled in one. But the food came and we were pleased. We had chicken wings for my son, mixed grill to share, hummus and falafel appetizers. See the pictures.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FTvaPmEp6ysHSKFxuq2BPA",
        "caption": "Photo of Maroush II - London, United Kingdom. Loving the vegetables",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FTvaPmEp6ysHSKFxuq2BPA/o.jpg"
      },
      {
        "img_id": "jP4jidQg7JSl6TFLJ_UxOw",
        "caption": "Photo of Maroush II - London, United Kingdom. Mixed grill to share. Half eaten",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jP4jidQg7JSl6TFLJ_UxOw/o.jpg"
      },
      {
        "img_id": "_sN8EftYJk12GxBlOhL6LQ",
        "caption": "Photo of Maroush II - London, United Kingdom. Fresh pita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_sN8EftYJk12GxBlOhL6LQ/o.jpg"
      }
    ],
    "user_id": "kddFMjZTWulkLsHCKo3lzw"
  },
  "DRtcceZ2zNSK7_Uxz6k85A": {
    "date": "11/21/2015",
    "text": "Found this place on my way to Notting Hills. Did not expect much as it was at 1:00 am, but the food was of superb, gourmet-level quality. A must try and worth it to visit during the day also.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ri6UDezXTXYTqOSosUz6NQ"
  },
  "7_f_RG2TKJohyLOTXonXZw": {
    "date": "9/14/2016",
    "text": "Awesome food, great ambiance if you sit outside. The fresh mango juice is to die for as is the garlic sauce, not as good as the garlic sauce as Zankou in Los Angeles but it comes quite close to it. Chicken was really good and moist , pita was warm fresh & fluffy like the pictures others have uploaded. My only criticism would be the potatoes, these could've been a bit spicier & tangier but that's no fault of the restaurant as my palate is a bit skewed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jcU6XpcYHvgV1cBRSOWJDg"
  },
  "z5YW7s7NmhvDKtDlPfHcMg": {
    "date": "7/13/2015",
    "text": "Get the check, a 4pound \"service charge\" for each person. I ask what this is for and I'm told \"for the seats\". I'm sorry it's a service charge to sit down? The food here is delicious if you know what to order. Staff won't help, they just bark \"what do you want?\" And will leave you alone until you ask for a check. No water, no offer of coffee or anything else.Giant bowl of un-cut raw vegetables? Including whole tomatoes. Sure why not.Enough fruit for 6 people after the meal? Ok. Just so confusing. Felt like they wanted us to leave, yet we sat there for 20 minutes after eating and no one said anything. but hey the food is good so enjoy.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dezdHPLWdkfRf4Mh17upXA"
  },
  "qXKcoQPAvGC3yxdT3Mlflw": {
    "date": "5/5/2016",
    "text": "I took some visitors here based on all the great Yelp reviews, and we were not disappointed! There are certainly some bizarre aspects to this restaurant, such as the giant bowl of uncut veggies sitting on the table when you arrive, but we saw other people digging in so we did the same! We tried a little bit of almost everything on the menu, but the Hommos Shawarma, Kibbeh, Fattet Hommos B'laban, and Mixed Grill were table favorites. The pita bread was also very fresh and toasty, and the waiters kept our bread plates full. After the meal we were served a corresponding plate of uncut fresh fruit and some little pastries, which were delightful. A must try if you are in the area and craving good Lebanese food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "BpHoMr3yBlv-bhB-_dZarA"
  },
  "r-0sZ1mv3RmZbDHbSegNWg": {
    "date": "9/13/2013",
    "text": "Boy, this place has some really, really good food.  Coming from a Lebanese family with many great cooks, I am pretty picky when it comes to Middle Eastern fare.  I can confidently say that aside from home, this is the best Middle Eastern/Lebanese food I have ever had the pleasure of enjoying.  Service is amazingly attentive.  Prices are reasonable.  Food is outstanding. Definitely order: - hummus (or hommos)  - the spicy Lebanese salad (or Marroush salad if you don't like spicy) - shish taouk - amazingly tender chicken skewers served with garlic sauce  - lamb shawarma - enough said - kafta khosh-khash - minced lamb skewers with amazing sauce and onionsI wish I had more room to try more because I'm sure you can't go wrong with anything on the menu.  They also give you a plate of complimentary fruit and dessert when you finish. Tip:  definitely order dishes to share (family style)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G2TGxiL8oqlwZQ3imoL--g",
        "caption": "Photo of Maroush II - London, United Kingdom. Mezes and arak to drink",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G2TGxiL8oqlwZQ3imoL--g/o.jpg"
      },
      {
        "img_id": "LgvasWgx6T2yCWmYIHtm1w",
        "caption": "Photo of Maroush II - London, United Kingdom. Complimentary fruit plate and baklava",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LgvasWgx6T2yCWmYIHtm1w/o.jpg"
      },
      {
        "img_id": "XJyaynalzEHRi6AQ8EyS_g",
        "caption": "Photo of Maroush II - London, United Kingdom. Salad, hommos, and arak to drink!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XJyaynalzEHRi6AQ8EyS_g/o.jpg"
      }
    ],
    "user_id": "IjoMFDpWKoj2lMO65xN9YA"
  },
  "hWdhMWZJnPi91zxZ3collg": {
    "date": "11/28/2014",
    "text": "Great food.  Wonderful staff.  Reasonable prices.  Open til very late.  I went there on my first night in London...  Woke up at 2:00am with jet lag...  Got there around 2:30 and it was packed...  The food was amazing and the staff were awesome.... By the time I left there to go back to my hotel it was around 3:30am and more customers kept coming. Bottom line: Strongly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TqvrsnDyJpMi2QNXl6e91A",
        "caption": "Photo of Maroush II - London, United Kingdom. Mix Grill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TqvrsnDyJpMi2QNXl6e91A/o.jpg"
      }
    ],
    "user_id": "qJ36OvDqZGip9QAvlch1hg"
  },
  "5WQ4FuCUmKKQ58mzdaSTSg": {
    "date": "5/10/2016",
    "text": "There are so many Maroush restaurants in the area! Food was good, although slightly overpriced. Decent experience overall.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OwLCNsoBGelghBfSI5ly5A"
  },
  "qTufpW2y3Lg1rxfKzQpc6g": {
    "date": "8/2/2016",
    "text": "The best Lebanese I've had! I sat at the bar chatting with a girl whose name I forgot, but said she is from Slovakia or Slovenia, grew up in Colorado or Utah. Anyway, I had the most delicious chicken liver EVER. I would definitely go back here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MOOkWK-DQG_oM09GHke_Kg"
  },
  "yzphl3U402yoMY2Hbm_9Pg": {
    "date": "2/21/2015",
    "text": "Best meal we've had in London, which has a reputation for terrible food. The food here, however, was exceptional. Amazing flavour, and okay on price. The service was quick and polite. We had the Business Sampler Plate between the 2 of us and it was a nice amount of food for a light dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OuSJE0Hr4q_E-hEWF5YT0Q"
  },
  "FiN9ps_b_2AcE1pK8l5Q-w": {
    "date": "2/12/2016",
    "text": "Maroush is the closest to home cooked food, which is the best compliment I can bestow. The ambience is great and the staff are extremely friendly. It may not be cheap, but the quality is simply the best for Lebanese food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gqsYVbONSDxg_N0WWsD-ig"
  },
  "s70jSNb4MH57O_X0YUj2Iw": {
    "date": "5/16/2016",
    "text": "Fatoush salad, eggplant dip, house-made pita bread, chicken shwerma, falafel and complimentary baklava with fruit delighted us.  The pomegranate seeds sprinkled on the dip and salad added a special fresh flavor.  I would love to eat here again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMj-mU8JEh7IgjxiFofgww"
  },
  "TZpCaGWXS5gNe0VS_6f9mA": {
    "date": "6/11/2015",
    "text": "This place has too many doors to enter through causing confusion about who to ask for a table.  We were seated at what appeared to be the last table which was the least desirable because the two seats were not across from each other (it was stuffed in a corner) and which otherwise would have blocked the main aisle.  We later saw there were more tables in an adjacent room which were not offered to us.The waitstaff seemed impatient and almost annoyed at our non-local presence, however the ordering process went smoothly and our meal came out quickly.  We were never again visited by our waiter but were able to flag down one of the food runners to have our bill settled at the appropriate time.Overall I would say the quality was about average for a middle eastern restaurant compared to those back in the States, especially considering the prices.Grilled cheese app - a bit dry but tastyGreen salad - Very colorful and tasty.  We were led to believe the salad portions were large but in our case it was barely enough for two to taste.  Babaganoush - best part of the meal - you gotta order thisFresh pita bread - they were dryer than I hoped for - if they were indeed fresh as opposed to just reheated.  Passable.Lamb shwarma wrap - heavily flavored which was helpful in taming the gaminess of the lamb, but I wasn't expecting the serious amount of cinnamon.   Live and learn.Chicken breast wrap - tasty although it didn't appear to be 100% chicken breastLebanese Coffee - I have never had this before but assumed it would be similar to Turkish or Greek coffee and I wasn't disappointed.  Definitely an acquired taste.Plate of mini backlava and a plate of fruit - gratis and a nice unexpected treat, however our jaws dropped when we saw the much nicer fruit plate given to a nearby table.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tdklMiQwQSR7nKTtctr_6g"
  },
  "A_R1F2zuwKtm0Q4sPiZjRQ": {
    "date": "4/15/2015",
    "text": "My chicken shawerma was phenomenally good. I almost ordered a second just to taste it. Wasn't even hungry anymore. While I was sitting there eating mine, the next 3 or 4 people ordered it. I guess it's a specialty. I'm not surprised. Babaganoush was very good. I liked the vibe. Owners and crew were warm, energetic, busy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iEIT-Y6iAotdL12NPXHkFA",
        "caption": "Photo of Maroush II - London, United Kingdom. Chicken shawerma, babaganoush, fresh melon juice. A treat at 1am.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iEIT-Y6iAotdL12NPXHkFA/o.jpg"
      }
    ],
    "user_id": "zEJks4mOBA6IwQFLkQGwNw"
  },
  "GL--cBDx-lnKjp1U7NwKEg": {
    "date": "2/14/2015",
    "text": "I came here after reading about it on Yelp, and wow was Yelp right!! This is some of the best Lebanese food I've ever tasted, every bite was absolutely bursting with flavor!I had the baba ganoush and the mixed grill, both exceeded my expectations. I also had a beer with my meal, a Lebanese brand, and it was really good.I'll definitely be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o2sxvNI6ZKKixwF-cINyIA"
  },
  "10vZjFOG-CfC1_d3Yj7ESw": {
    "date": "7/8/2014",
    "text": "i went with ma friends and we had rice woth bamya, kuba bel laban, humus, dolma, taboula and other starters and main corses. The food was very good and the coffee is well prepared too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECbEWgpeMGV-0ltNAjtMIw"
  },
  "X0LMMAzB466lPbBj7GjcRw": {
    "date": "8/4/2018",
    "text": "Best Lebanese food I ever had. This place is amazing. The food and service was amazing. We ordered a bunch of small items and enjoyed every one of them. They really know how to prepare the food the right way. I was longing for authentic Lebanese as we don't have many options in Los Angeles so this visit was very much anticipated by me.I am definitely going back here on our next trip to London!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "W_eg_ZGCzsGegktTjb2TgA",
        "caption": "Photo of Maroush II - London, United Kingdom. Baba G",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W_eg_ZGCzsGegktTjb2TgA/o.jpg"
      },
      {
        "img_id": "BJu-LOQgylQRsURtQcG7BA",
        "caption": "Photo of Maroush II - London, United Kingdom. Hummus",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BJu-LOQgylQRsURtQcG7BA/o.jpg"
      },
      {
        "img_id": "tKUw1uWNl0SCLS1Bb-YDfg",
        "caption": "Photo of Maroush II - London, United Kingdom. Falafel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tKUw1uWNl0SCLS1Bb-YDfg/o.jpg"
      }
    ],
    "user_id": "Y6XH1iNsuuGAcO5nODI6rg"
  },
  "WYC3i_hANZnAoUdQJixP9w": {
    "date": "9/20/2018",
    "text": "Fiancé's coworker recommended this place and we decided to go for a late dinner after shopping at Harrod's (just less than 2 blocks away). This place opens till 4:30am! We got the hummus with lamb and the chicken liver wrap to start. The hummus came with sliced grilled lamb on top and was delicious. The chicken liver was wrapped in bread with a yogurt sauce, tomatoes and pickles. It was cooked to a great texture. The main dish we ordered was the lamb roast with a side of haluomi cheese. The lamb roast is a good portion lamb leg with heavily spiced rice, topped with roasted pine nuts. The cheese was grilled so it had an interesting texture. It was served with tomato slices and cucumber slices. This was our first time having Lebanese food and I've got to say Maroush's got us hooked! The service was great as well, even though there were only three waitresses they managed to take care of the entire restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ofXMLAfC3u-P1MbLRjsMiw",
        "caption": "Photo of Maroush II - London, United Kingdom. Haluomi cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ofXMLAfC3u-P1MbLRjsMiw/o.jpg"
      },
      {
        "img_id": "ZzXayfAespAqEeKxBU1W8w",
        "caption": "Photo of Maroush II - London, United Kingdom. Hummus with lamb",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZzXayfAespAqEeKxBU1W8w/o.jpg"
      },
      {
        "img_id": "LBeIempeP79ccY5Z_BLATQ",
        "caption": "Photo of Maroush II - London, United Kingdom. Lamb roast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LBeIempeP79ccY5Z_BLATQ/o.jpg"
      }
    ],
    "user_id": "CkgUJiLC0uSSxiUstRwhSQ"
  },
  "O6T3CMGzccO82HfCrMeVRA": {
    "date": "10/20/2018",
    "text": "I've been living in London for about a month now, and I've ordered Maroush to my home about twice. I like the grilled chicken wrap. It's actually very tasty. The wrap is filled with tomato, pickle and garlic sauce! It's very filling too. I also ordered their French fries which were good! My favorite thing is their mango juice! It's literally amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Av8IcFkz8KwH_ePEweWSXQ"
  },
  "JuX4ZEHJa1DwJ6LHp57tNg": {
    "date": "7/10/2018",
    "text": "Great food and great people! Come and check it out!  Locals also come here for take outs really early for dinner.  Busy kitchen and busy staff!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bVGyT4Q87ClY-0LfibRyBg",
        "caption": "Photo of Maroush II - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bVGyT4Q87ClY-0LfibRyBg/o.jpg"
      }
    ],
    "user_id": "vccUKgG7o3Q32hw4utaWNg"
  },
  "TtZIK5YjI9VN8Me6gTCOjQ": {
    "date": "9/30/2018",
    "text": "Quality of food is not as standard. Service very slow and will be lucky if some one stop by. They will take the order bring the food and disappear till you leave.I was not happy from quality of food and presentation. When restaurants charge this much for food, they must pay attention to quality and presentation of food.Sorry I don't usually leave negative comments, but I felt that I have to share my experience so hopefully the management will act.Will never come back",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bun86PGU6_rc0od0fNY87g"
  },
  "EqFOdlOtj-wwJVxn1gyuuA": {
    "date": "1/31/2017",
    "text": "We were craving Middle Eastern food and happened to be window shopping at Harrods. This is an easy walk.Upon arrival we were met with a very confusing multi level setup - I'm pretty sure this used to be an old house that was converted. It was very unclear where to go and what food was served in each location. We went upstairs to the restaurant - but then got sent downstairs to wait with the take out section. There wasn't really anywhere to wait other than right by the kitchen where there were dirty plates and food leftovers. Eventually we were led back up to the restaurant level and sat in what appeared to be an old conservatory. The service was very lacking. That being said, the food was pretty decent.Lamb Soujok - Spicy sausage served in an acidic sauce. Very niceBammieh B'zeit - Cold Okra in tomato sauce. Very Good!Spicy hummus and pita - No complaints. The waitress brought a second round of pita while we were eating.Falafel - Very moist and flavorful. This was a highlight of the meal. I've had many Falafel that was overcooked and not moist.Lebanese Beirut beer - Thumbs up!! Go for the food - not the service.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MJhPbEhWKpILjL6onmG41g",
        "caption": "Photo of Maroush II - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MJhPbEhWKpILjL6onmG41g/o.jpg"
      },
      {
        "img_id": "ZuG4kdpS89tYUAlzK2gP6w",
        "caption": "Photo of Maroush II - London, United Kingdom. Bammieh B'zeit (okra served cold). Very good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZuG4kdpS89tYUAlzK2gP6w/o.jpg"
      },
      {
        "img_id": "S_JpbPHsn8yUGQAL-cEylg",
        "caption": "Photo of Maroush II - London, United Kingdom. Falafel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S_JpbPHsn8yUGQAL-cEylg/o.jpg"
      }
    ],
    "user_id": "N4Nu4txLSGmT8pU1XPwlLA"
  },
  "YXSjwZF8aRrdWQyZxPlnEA": {
    "date": "7/13/2018",
    "text": "Hands down, the best Mediterranean/Middle Eastern food I've ever had and I've been to countless number of them. I give it five star for food, not service.  In my American mind and expectations, it was absolutely ridiculous to ask three different waiters for a glass of water and get nothing until the fourth one brought some.  BUT, that's the case pretty much everywhere we've eaten in London. So, it might be a cultural difference between the UK and US to offer water/drink as soon as the customers sit down and offer refills.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvWPAzdbYMuWUzXZnH82zw"
  },
  "MfyF_N0Lqd4sZkLmcTY4xA": {
    "date": "3/13/2017",
    "text": "We were starving after a long day of touristing. This place was a godsend.  The food was beyond good.  It's not easy to make hummus and tabouleh memorable, but theirs was so tasty we want to come back again.  And this is in London, where by rights we should try more places!!!The green beans and lamb daily special was perfectly seasoned and textured.  The dessert was \"just\" a fruit plate and baklava.  It was \"just\" perfectly ripe apples, pears, oranges, grapes, and honeydew melon.  As a baklava fan, I can swear this is some of the best I've ever ever eaten.  Without a doubt, hands down, the best Lebanese food I have ever had the joy of eating.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "XS5B_wOqKh8fZuaUSNyF0g",
        "caption": "Photo of Maroush II - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XS5B_wOqKh8fZuaUSNyF0g/o.jpg"
      }
    ],
    "user_id": "lbhltWMA5D8BO24KWedgnA"
  },
  "2j-eszqv-L9DqfQNMr3Obg": {
    "date": "3/30/2018",
    "text": "Amazing food! Amazing ambiance! Amazing customer service. I would especially like to give a shout out to Sergio, the best waiter I have ever seen at any restaurant :) we keep returning bc of how good it is.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CzbZpOr9WxWEbXO__1z5iw"
  },
  "kfFA4zGRsb9aIw33PI4sgg": {
    "date": "7/22/2018",
    "text": "The food was very good. We ordered Baba Ghanouj, Shish Taouk, Lahem Meshwi (chicken and lamb kababs), Lebanese Vermicelli Rice. The portions were quite generous. The kababs were tender and tasty. Service for the most part was sadly lacking. But one of the wait staff made up for it by being very friendly, actually smiling and asking us about our food. The unexpected complimentary dessert (baklava and fresh fruit) was a pleasant surprise. We asked for the leftovers to be packed and they packed fresh pita bread. Recommended for the food not the service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FrpW_XUt5KCkau_F0z2afg"
  },
  "LcKNd0Ex257AXhcEAODweA": {
    "date": "6/17/2017",
    "text": "The quality is as good as always. Really nice touch that they give you complimentary baclava and fruit with your bill.As far as location goes, this is not one of my favourite. The interior feels very dated. I often wonder if the make most of their money from delivery?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vN740jaTqpOOZd47PqkkSA"
  },
  "n2-BK4MuBUNaWFG_E_VuNg": {
    "date": "12/1/2017",
    "text": "Fully enjoyed the set menu for 2 (hommos, moutabal, tabbouleh, falafel, soujok, batata harra, jawaneh, skewers of minced lamb, cubed lamb, cubed chicken, fruit plate and tasting of various sweets) plus added an order of kibbeh. There was enough food for a second full meal! Authentic, quality Lebanese food. Loved the mint pudding with rose water and crushed pistachios. I'll dream of that pudding for years to come.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tnl5tW9JOv0KJLqhJUkhMQ"
  },
  "pLOI06j-Zha68njSbKtevg": {
    "date": "5/1/2017",
    "text": "Delicious delicious ...had the hommous shawarma, Roast Lamb, and King Prawns ...all were tasty, full of flavor, and just right portions. They also have fresh squeezed mango juice ...yay!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WjQhnfnL7J61vpsvtXGzMw",
        "caption": "Photo of Maroush II - London, United Kingdom. King Prawns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WjQhnfnL7J61vpsvtXGzMw/o.jpg"
      },
      {
        "img_id": "eGWRq0EeoBncDiZGhMilqg",
        "caption": "Photo of Maroush II - London, United Kingdom. Roast Lamb",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eGWRq0EeoBncDiZGhMilqg/o.jpg"
      },
      {
        "img_id": "RZC1n-lCQ73VoER9ARQqSg",
        "caption": "Photo of Maroush II - London, United Kingdom. Hommous shawarma",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RZC1n-lCQ73VoER9ARQqSg/o.jpg"
      }
    ],
    "user_id": "n77a8pr9OK4uBxyKulF2zw"
  },
  "mdKbT8Gdf_mTeReRg8dDCw": {
    "date": "3/3/2017",
    "text": "I had a very nice lunch after shopping at Harrod's. All the staff were very nice and helpful, and their good mood was contagious. There's not much room for groups, but sitting at the counter and watching the cooks prepare the food was fun. The falafel was very tasty, and it's great to switch your regular pizza for a Lebanese one every one in a while - it won't lose at taste.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "n3woG_YsXaq7Ja3IU-tlqw",
        "caption": "Photo of Maroush II - London, United Kingdom. Lebanese pizza with minced meat, tomatoes and peppers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n3woG_YsXaq7Ja3IU-tlqw/o.jpg"
      },
      {
        "img_id": "jz328UFGIyBYLqtT2qW5AQ",
        "caption": "Photo of Maroush II - London, United Kingdom. Falafel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jz328UFGIyBYLqtT2qW5AQ/o.jpg"
      }
    ],
    "user_id": "W3hbqixPAJvWE5djapEVXg"
  },
  "koGyIHbso6YuE3Ca_t48ig": {
    "date": "5/9/2018",
    "text": "Great food, fast service. Surprise complimentary desert! I enjoyed everything - the best babaganush and humus ever.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6LxLK2aGxkNMiMAMxJVQw"
  },
  "5bWMDR5Me1x0xN1EQeDC6g": {
    "date": "7/16/2017",
    "text": "I give this place four stars because the food is great. I had the Lahm Meshwi wrap which was really good: tasty meat, vegetables, delicate hummus and the wrap is good. However, the service is almost absent and disinterested. The kitchen is open and seems very cleaned. Great food at reasonable prices but I am not sure I would go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TgnXgGh9723toSGBG674Tw"
  },
  "AsAvyA_CCVdAirlghaZ9sg": {
    "date": "7/6/2017",
    "text": "Really terrible service and dreadful management.The food is good and always has been, but the service is seriously complacent and doesn't care st all for the customer.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H9ZgSIlbleUyVqd7iSNxxg"
  },
  "7mezxt8a1q1GXAFiqQO4Fg": {
    "date": "9/30/2016",
    "text": "Good Lebanese after a late night out I eat Lebanese food so I'mSuper picky But if you go here , get a wrap like most do and u will be happy I asked for a normal salad and beef on it Fat posh Schwama and the girl had no clue Asked for sumac and Zatar spice and once again A dumbfounded look Most Lebanese restaurants give u zatar and oil when you site down and pita bread This one gave u pita bread, made no sense",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wi7gOg7R_f111rcQsW7QkQ"
  },
  "04Z7iVr0eisAu3B__pbIPQ": {
    "date": "9/17/2016",
    "text": "Late night eats for Americans with Jet Lag! Great atmosphere- well dressed staff. Food was delish ordered lamb shawarma, hummus, chicken soup and falafel for 28 pounds for two! Must go again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D75zBguaBD3NgK4mnrRwaw",
        "caption": "Photo of Maroush II - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D75zBguaBD3NgK4mnrRwaw/o.jpg"
      }
    ],
    "user_id": "yNeYATGhykZhyQ6bDq_TjA"
  },
  "nKGAPuBN6Ftx1nX3lPiZYw": {
    "date": "6/3/2017",
    "text": "Amazing food, amazing service. Extensive and well rounded menu. Fresh ingredients and well prepared, some of the best middle eastern food I have eaten outside of the Middle East",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9O4i_aEQeBQkmTkxnqjXcg"
  }
}