{
  "V0SmWF5yR--EOE0hVcaTjQ": {
    "date": "10/12/2010",
    "text": "We were looking for a steak place in the City and thought we should try Black and Blue. What a disappointment. The service was nice and prompt, but the steaks a let down. Tried the Ribeye and fillet, both came medium and still managed to be very dry and rather bland. Not exactly cheap either. £80 for a shared starter, 2 glasses of wine, 2 main courses and shared pudding. Won't be going there again.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "SKIZL-HuPnOVahHThoTm2w": {
    "date": "2/13/2011",
    "text": "A quick dinner with a mate in Borough Market.  I've not long started eating beef, so I'm not really in a position to say if it was good/great or poor - just whether I enjoyed it.The food:  Beef fillet. Rare. béarnaise sauceRating 4/5 - cooked well and tasted good. The wine: Shiraz, Stonedale, South Africa - very nice and good value at around £17 a bottle.The service: Friendly but had to search around for the waiting staff to get more veg, chips and wine.Overall 4/5 - Simple and fast. Busy with city types on the Friday night we were there which made for a good atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SH08S4_b_PHsuw7nTie3qg"
  },
  "aJWfbHO0q6O0tW6QWYvjiQ": {
    "date": "11/11/2012",
    "text": "Great ambiance, great menu and food preparation.  Loved the people watching from the table in the window.  One of the most charming restaurants as an American tourist in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4chJ1b2Km20NTzulmFTzbA"
  },
  "_8TITzw2hmUCjTyVAQkWOg": {
    "date": "7/30/2011",
    "text": "Best steak I've had over here so far (2 weeks in only).  The prawn appetizer was out of this world good and the filet was cooked nicely.  Had a lovely italian waitress that put up with the comings on of some of the groups more rowdy bunch.  It may have been the 7 bottles of wine that we went through (group of 10) but I enjoyed my experience here.  We had to make a reservation for such a large group, looked like there were some couples getting seated pretty quickly.  Would recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P3FhlkiHcCkwdArIkSPCEg"
  },
  "FG7PPgKp1YMiMz-fQUmZEA": {
    "date": "9/11/2010",
    "text": "I often work in London and this restaurant is a convenient stones throw from one of the offices I work from. Steak & chips is definitely the best choice on the menu & the wines are of decent quality. The venue itself is pleasant to sit in and staff attentive. All in all a decent bet if you're in the area, but probably not worth going out of your way to visit.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gdnPg4-DBhHaDWXoeuBcxw": {
    "date": "1/18/2009",
    "text": "It's a rare restaurant indeed that actually knows what rare means.  I wish their grill was just a bit hotter to get a more proper sear on the outside, but overall a quite respectable offering.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TIDJrencZmDRwKFKixtiNA"
  },
  "wTMea10yfkfpNShH50Dw2w": {
    "date": "5/4/2009",
    "text": "The black and blue is tucked behind borough market, the closest tube is london bridge. This a great little place, lovely to sit outside and enjoy a glass of wine, they have only a small selection of wine however every one is lovely. The resurant is very good, the dishes are mainly meat and fish but all very tasty and reasonably priced for central london. The service is great very prompt and friendly. Inside the walls are exposed brick and table in the bar are large slabs of marble its a great space to share a meal with friends and a fantastic atmonsphere.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "L936Ezyu-ibgabQoZmZ8gA": {
    "date": "9/29/2008",
    "text": "Went here on Sunday late afternoon because its one of the only restaurants in the area still open once the market shits (and Roast was closed as well from 3.30pm). I fancied a steak, so I ordered the large Sirloin steakhighly disappointing. Very cheap tasting meat. My dinner/late lunch companion ordered the filet steak which was nicer, but not up to the standards you expect for a good steak restaurant, and at £20 each steak, we expected a lot more. The prawn in garlic butter starter was not bad, but this I would recommend avoiding this place. Its a chain at its worst",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xVt5qumiOUhyc5XeKOLpCA": {
    "date": "10/12/2012",
    "text": "The worst steak I've ever eaten in my life - it tasted of nothing and was completely full of gristle. Every bite could have been chewed for an eternity and never have broken down to a comfortable, swallowable size. I got halfway through the 200g steak and considered just giving up since it didn't even taste good.I did find the English wines from the Jurassic coast to be novel - particularly the \"Tyrannosaurus Red\".",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "TBrqCAhhHyfXbh73GZxeDw": {
    "date": "4/27/2014",
    "text": "First up...I love the name, Very bold!! Second up, the design if the place is beautiful!! I only came for a coffee with a friend and we sat in the glorious sunshine and chatted for ages. Will have to come back for dinner sometime.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "lujtX7TB1uB2Yu66_Mt_BQ": {
    "date": "5/15/2010",
    "text": "Bare brick walls domed under the railway arches, glass and steel abound. Slimmed down menu focussing on the expected staples. We skipped the starter and headed straight for the Cote De Boeuf. There was much to recommend the meal; the house Shiraz was a perfectly balanced South African with a good spice and berry kick, the (free and unadvertised) house salad was a welcome addition (albeit served with an incongruous grated cheddar) and the service was warm and friendly.Sadly though, the chips seemed very much pre-prepared and the disc of foie served (for a £3 supplement) alongside came fridge cold. Worse still, the steak was flavourless. Well marbled and well prepared, a good Cote de Boeuf should be really packing, but this one packed up early and didn't give us anything.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aWpe0ukPx6IcsS7tfPB3fA",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aWpe0ukPx6IcsS7tfPB3fA/o.jpg"
      }
    ],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "L_1rQMLivQy9WgmKzpSR0g": {
    "date": "11/3/2012",
    "text": "4 stars for the service, valuing speediness of response, food delivery and flexibility (waitresses aren't restricted to stations).2.5 stars for the food.  Ordered the ribeye, rare, and no sauce to muddy it up.  The menu claims that each steak had undergone a dry aging process.  It certainly didn't taste like it.  The slab was thin, full of edge fat and sinew - not characteristics of proper dry aging nor worthy of price paid.  I did not detect any dry marination that would have afforded the beef a deeper, fuller flavor - such a wasted opportunity.I'm fully convinced that Brits have no idea what a fine steak looks or tastes like.  At least I can count on the French on this front.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCOwZztY3w6KbmlETuHm4A"
  },
  "YP7OFkKv2Z4HHjQoksHxjg": {
    "date": "8/26/2011",
    "text": "Perhaps we've been spoilt. Maybe our expectations are now a notch above. Afterall, we've been to some of the finest steakhouses in London.Sadly, we didn't like Black and Blue. Service was incredibly average from the outset - not once asked how we were and how the food was. Coats and bags were piled on our seats. We were actually wanting them to ask, because we were that disappointed with the steak that we had some ammunition.The Cote de Beouf was big and juicy but just,.. well... tasteless. It was eating meat for eating meat's sake.The sides, except for the mushrooms, were limp and overcooked, including the chips.The saving grace was the relatively cheap Portuguese wine we opted for (no recommendations given) - it was really rather good.Won't be coming back here. I'd be interested to see, perhaps at the expense of someone else, if the other B&B restaurants are better in comparison. I suspect being in a touristy and popular gathering spot like Borough Market has bred a sense of complacency. They're going to be busy no matter what.Shame.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "FArkxGjNNwMNeO24ZdY3SA": {
    "date": "8/4/2011",
    "text": "Steak and Gossip !There's nothing like a girlie gossip to put the world to rights and it's been way too long since Ms P and I did just that.We met at London Bridge and having decided against Spanish and Indian, we ended up at the Black and Blue Steakhouse, at the back of Borough Market. We started  with the tempura prawns. Their light breadcrumb coating, didn't distract from some well cooked prawns and a not too sweet chilli dipping sauce.The main event was burger and chips. Hardly lifechanging, but when last can you say you had a really good version of it?The burgers arrived a little late, but with earnest apologies from our super cheery waitress; well done for Ms P and cremated for me, in slightly over toasted buns, with a side order of chunky chips and three sauce options. The burgers were top notch, which was lucky as the fries were disappointingly tasteless and  way overcooked. Fortunately, our dessert made up for things. A a chocolate brownie  always does !!   That  gooey square of chocolate heaven, decorated with raspberries and a side scoop of ice cream was lush and big enough for both of us to share. I'd never been to Blue and Black before, but I would recommend it .  Just one bug bear, in the push to seat as many customers as possible, the reality of diners actually being able to get in and out of the tables was definitely forgotten about.  Something the restaurant manager needs to address sharpish methinks !",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mQ2QfkQ334E9hd1ph8MzsQ"
  },
  "qC7k8ejdtQs-X7t4V4tGpw": {
    "date": "8/14/2010",
    "text": "Aaaaaagh! Note to restaurateurs willing to learn from B&B's grievous errors: - Chips are best served hot and crispy, not tough and lukewarm. If I had wanted oven chips I would have bought them myself, although heaven knows where you would purchase such an atrocity - Bearnaise sauce is NOT the same as tarragon mayonnaise - If you really must drag watercress kicking and screaming from the 70s, best not to serve it in industrial-lawnmower-clipping quantities    The rib-eye steak was an excellent cut of beef, perfectly cooked, but this is a steakhouse after all. Perfect steak should be the foundation for success, not the limit of their ambitions. Surrounding the star of the show with a load of mediocre crap worked well enough for Maggie Thatcher but it didn't do much for my dinner. Plus marks for friendly, informed and attentive service, and more for stocking Black Sheep ale and a wine list that was varied without being overwhelmingly long.I'd go back as it's a fun place and the steak is genuinely awesome. But sad chips are a sorry sight indeed. Sort it out, chaps.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "2mclkRG8DYLLs3T1NXY42w"
  },
  "pDF35hy3BXAFxiT6eOKskw": {
    "date": "11/16/2010",
    "text": "Been here twice now.What they do well? Beef. Cooked excellently. With salad and chips. The chips can be a little indifferent. The meat, however, is top-quality and cooked to perfection.They do have some sort of strange portion sizes-- four steaks coming in sizes like 185g, 260g, etc. I can heartily recommend the côte de bouf. And the wine. All a little more costly than it should be, but it's a poshy posh place in Borough Market. What'd you expect? Beef. Everything else is going to appear a bit blah.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "LL4hwMXJeVdMXlvs4vF5IQ": {
    "date": "12/19/2008",
    "text": "Black and blue is a modern looking American restaurant, which specialises in Steaks and Burgers, and being a great lover of steak, I couldn't wait to go.I had a Rib eye steak which was fantastic, not many places do a steak like that, and my girlfriend had another delicious meal, prawns in garlic butter, which came a little small, but I still managed to have come. We also had a few starters, which were mediocre and definitely over priced at six pounds each, because they were just too small, something you don't tend to think about American restaurants, usually you struggle to finish. But overall, I think it was good value for money, my steak was around £20 and the prawns cost about £15 if I recall correctly.You cant miss this place, there is a black bull outside, almost accurate in size, with steak printed across it. It is really nice inside, it has separate rooms and some brick work with nice lighting, is great. The service is top notch, I asked for a bottle of recommendation on a bottle of wine and it went perfectly with my steak, the bottle cost £17,and went down like a treat, I had to have the whole bottle too as the girlfriend wasn't feeling up for it, no complaints there! I will definitely be going again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KANbPQ_NJ87Dj_E5ApjK2Q",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KANbPQ_NJ87Dj_E5ApjK2Q/o.jpg"
      },
      {
        "img_id": "u6v_E2z0uHoPS4ZwDFszPw",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u6v_E2z0uHoPS4ZwDFszPw/o.jpg"
      },
      {
        "img_id": "-som8uTrsnthCJwEnJ4caQ",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-som8uTrsnthCJwEnJ4caQ/o.jpg"
      }
    ],
    "user_id": "A3tbiT99rP4J2J4RPbYBUQ"
  },
  "xW_fN5UBW8vVwgqbo0ldjw": {
    "date": "1/28/2011",
    "text": "Ok, I said I wouldn't come back running but... Got wined and dined and the place was the only one on offer, so not me paying, what to do? I reluctantly walked in through the doors to this place at thought, hey at least its for free. Now, I had the sirloin this time as hopefully they can't make such a mess of it as they did with the rib-eye last time. I asked for medium done, and hey, when it arrived it was medium as you expect (not the American way where 'medium' means 'well done'). Got mushroom and spinach on the side.The only complain (well it has to be something, right!) is that the staff, even that they were a sweet and really good looking bunch of girls both had problems with the language and also didn't know what the items on the menu contained or was any good. So when asking if the mushrooms had garlic, the answer was \"don't know\" and \"do you like garlic with your mushrooms\"... there were a couple of more of these from the second girl and you quickly realised that they have never even tried any of the food on the menu...Though, after last experience, well, this place is actually ok but perhaps before I give to too much credit, I might want to go a 3rd time and see if the first one was a one off or if the second one is one...   Anyway, nice meat well cooked (not as last time) and a bit poor knowledge of the staff.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GQ-vgLUJro9GoTie-9vh1g"
  },
  "7oOJQ3bZFclTJQB62uzTdg": {
    "date": "1/18/2008",
    "text": "This is the second Black & Blue I've been too. This particular one is located right next to the magnificent Borough Market. The restaurant itself is really well designed - very cool blue \"approach\" lights, cool automatic sliding glass doors, etc. I ordered the rack of lamb (see attached photo) and it came quickly and was beautifully presented on a chopping board with grilled peppers and a light salad. It was very well prepared and very tasty. My wife was equally impressed with her burger. The food came promptly, the drinks were good, the service was prompt and friendly and the prices were reasonable. Couple this with the location and you've got a pretty good experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T5gxRcPwAvz7baZj_FG20Q",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T5gxRcPwAvz7baZj_FG20Q/o.jpg"
      }
    ],
    "user_id": "_gA_eNBoCPhbYZ79F-_HuA"
  },
  "l72dQa_5mC22SXSTXlZ_iw": {
    "date": "7/27/2009",
    "text": "Steak, yeehaw! Sometime you just have a craving and seek long and hard to achieve that little slice of heaven. In desperate need of some red meat, I rounded up my cowpokes and herded on down to Borough Market and into Black & Blue. Once the waitress mozied on over and took our orders, within a very short time, I had myself a beer and a lovely piece of juicy, bloody ribeye steak in front of me. After taking in the aroma of my sizzling piece of meat, I dug in. Let me tell ya'll, it was darn tooting tasty! Maybe not the best this old longhorn has ever tasted, but it was definitely worth coming back to.One of my ranch hands actually ordered the Black & Blue steak. For all you city slickers who don't know what that is, it is when they flash fry the steak so it is cooked thoroughly on the outside and somewhere between raw and tar-tar on the inside. Interesting side note: They have three or four different sauces for the steaks; gravy, garlic & butter and Bearnaise. Oddly, the gravy was much better tasting, although I did not dare put it on my steak. That would be a big no-no for this Cowboy. Giddy up!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GhPsVqtRtf1t-H9OIa1jMg"
  },
  "yao_5VNMAVqfRp6diHOQOg": {
    "date": "5/31/2010",
    "text": "A good place for a drink, I've often met a friend here for after-work bevvies and it's a buzzy atmosphere mid-week. Drinks can be a little pricey, but there's a fairly extensive wine list and a decent bar-food menu. We last had lovely pate on mini toasts, chill prawns and a selection of dips with pita breads. The restaurant always seems to be popular with the local suits and specialises in meaty options like steak and burgers as well as basic fish dishes.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "k4GVxwlUANCaYXHtdioqbQ": {
    "date": "3/12/2009",
    "text": "Oops, I didn't try the steak. I did, however, have a lovely plate of lamb chops and roasted red peppers. YUM. Their portions are HUGE. I asked to have extra salad instead of chips (trying to be healthy...) and instead of a few extra pieces of lettuce and sprouts (as were already on the plate) they brought along a HUGE bowl of caesar salad! I couldn't even eat any of it -- it was entirely unnecessary!Anyway, a wonderful place for lunch to take a break from Borough Market wandering.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "XGaMoQ6sg0B5hSzC5aRmdw"
  },
  "kdybpCbp2QT39czdKT98wA": {
    "date": "3/24/2009",
    "text": "Excuse me while I unbutton my pants! We ate at Black and Blue last night and I'm still full! You might think a steakhouse a funny place for a vegetarian to frequent, but I also eat fish and Black and Blue serve a mean chargrilled yellow fin tuna steak. They serve all their steaks, meat and fish, with thick chunky chips and a side of Caesar salad. What to eat first, where to start - I was lost in food! I can also report that they really know how to cook a real steak and correctly interpreted my companion's direction of 'medium rare, well rarey medium really, cooked but with lots of pink... you know!' They did know and it looked fierce!  If you want to find foodie nirvana, try the chargrilled prawns with garlic butter - plump, succulent and with an authentic BBQ taste. Can I also say for an American restaurant, they do a great Irish coffee!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "SKsU1loi4emmC3jW8VDYDw": {
    "date": "1/27/2010",
    "text": "Very disappointed with Black and Blue. When your restaurant is a stone's throw from the Ginger Pig, you should be able to conjure up a decent hunk of meat. Sadly the two ribeyes I've had here have been bland, underseasoned, small and overpriced. It borders on torture when you can SEE a better butcher out the window. They do a reasonably good burger, probably the best in Borough, but since steak is their speciality, it really should be a great deal better than this. The service is also icy cold. There are better places to go in Borough.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8vuZ_WmHagwCBKGiVXLiQ"
  },
  "3az0cULFlPCmJQKPOKO1cg": {
    "date": "12/19/2009",
    "text": "After winding up in London Bridge as a compromise in the freezing cold (I wasn't willing to go any further into town from my cosy Greenwich house) we wound up here hungry and ready for steak. Initially told there was a 30-40 minute wait (Friday before Christmas and all) we decided a glass of wine in the bar was the way to go. The wine isn't cheap, they serve it in large glasses without asking which is a really pet hate. But, it meant we didn't have to order drinks over dinner. My rose wine however, wasn't good. In fact, we both realised that it tasted of nothing. I've never had wine that tastes of nothing before. But, I asked if I could change it for a different glass, not only were they happy to give me a more expensive glass, they agreed it wasn't a great wine (which begs the question why is it still on the menu?) Our table was ready pretty quickly, and whilst starters were average (the chicken wings really aren't worth the £6) it was time for steak. Mine was perfectly rare and tasted really great actually. I'm powerless before a rib-eye and it was a good choice. Pepper sauce came with, which is a nice touch. So was the salad on the side. Although why every single dish we ordered came with cress I'm not sure. Cress does not go with everything. We didn't stick around for dessert as nothing grabbed our attention (an £8 cheeseboard with three uninspiring cheeses on it? sort it out B&B) so instead we decided to find another pub before last orders. Of course then we had to wait while they faffed around not taking our money. Hate it when restaurants do that. This chain could be brilliant, but it falls short for me. The steak is good, and the waitresses are lovely, but the rest just isn't up to scratch. When your dinner is around £30 a head with a glass of wine, I expect more.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PydLTwSRmLEzpqGhHOZXIA": {
    "date": "9/13/2009",
    "text": "We went here on a bank holiday Monday after discovering most places in the area were closed. We live nearby and always thought that it looked like a good restaurant. It was very quiet when we arrived, however so was the rest of the area, anyone sensible had left London for the weekend! The decor is modern but a big area and seems a little stale. There was no background music so it felt very quiet. Steak is the main choice on the menu, I had a fillet and my partner a T-Bone. It was ok, but not up to the standards of the cost. The price is not far off the Gaucho and the Gaucho quality is much higher. You could only have chips with the steak (no option of baked potatoe or mashed potatoe for example) and the chips were like oven chips. There was also a lack of side order options such as veg. Overall, not impressed, an ok steak restaurant but should be priced a lot lower given the quality. Helen",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "W8Qs15T_PBe_Ln5TICxsxg": {
    "date": "9/28/2009",
    "text": "Pottering around the spangly new Bankside commercial development in search of vittles, it quickly became clear that as Tsuru Sushi was closed and neither Leon, nor any of the local gastro-pub-ified glass boxes (nor any of the menus displayed therein) exhibited the necessary gravitas for a Saturday night's gastronomics, we'd have to potter straight back to Borough Market in search of something more substantial - if ideally less financially crippling on this occasion than the nearby Brindisa. Eschewing oysters and friends, given the neighbourhood (and my obsession with steaks), we settled swiftly upon Black & Blue, a Bankside-standard chrome-and-glass enclosure of brick caverns and bright lights promising decent cuts of beef with less-than stellar price tags. Though the welcome was cordial, I was a bit put off by our placement right in the corner of the restaurant, even though I expressed a clear preference for other obviously free tables in the centre of the room. The hostess explained that they liked to keep those free for pushing together in case larger groups came in, and though I didn't particularly like it, it seemed reasonable from their point of view, so I wearily submitted. As the menu was standard steakhouse fayre, I summarily ignored all but the \"steaks\" section and, foregoing the indulgence of a côte du boeuf all to myself on the grounds of common decency, plumped happily for the ribeye. By contrast somewhat more mysterious than its carnivorous counterpart, the wine list only stated years for a couple of its members, notably 2001 vintages with big numbers next to the pound signs. The waitress provided years for a select few we asked about, and one particular '2005' response made the associated St. Emilion Grand Cru an inevitable - and, as it turned out, impeccable - choice. Smooth, round and yet grand, with distinct blackcurrant overtones. Winner. Onto the food, from the outer edge in. The walnut and cheese side salad was definitely dressed, despite my asking twice for it to be naked, but it wasn't an overpowering vestment, so no particular fuss was needed. Good chips, crisp and light; good, if unexpectedly fiery, pepper sauce, light on the cream and heavy on the spice. Unusually, perhaps in an access of intuition, I'd asked for the ribeye rare rather than blue, and given the graininess of the bone-side meat, this was an inspired choice. The extremely solid steak knife felt a little like it was tearing rather than cutting, and the chewing consistency seemed a tad bitty. Not the most mature piece of beef I've had; there was certainly flavour there, but it was somewhat overpowered by the peppercorns, and the overall impression of the course was, well, \"that was fine\". Which is a bit of a shame for a steakhouse. Onto the home straight and a cheese selection (stilton, cheddar, white Lancashire) sat very well indeed with a berry jam and cress, and also with a perfectly reasonable tawny port whose provenance I forget entirely, but which was the only port on the list. To conclude. Definitely a steakhouse, and part of (an admittedly small) chain; not super-cheap, but not outrageous (£56 a head including a £36 bottle of red); reasonable food, and friendly service. In fact the service is perhaps one of the main points to note here; the management clearly have a policy of employing only the most smiley, co-operative and attractive staff possible, lending a sufficiently smooth air that in conjunction with an extremely good Grand Cru, even customarily critical - not to say curmudgeonly - customers such as myself leave feeling well served. We arrived at around 7.30 on a Saturday night, and though the service felt attentive and timely, we were also left enough to our own devices that with only 2 courses we still pottered off at just gone 10, and at no point felt rushed. On reflection the food wasn't quite as good as it seemed in the warm after-glow of such careful handling - hence the three-star rating - but it was a decent meal and a good evening. I'd go there again, if not expecting to be blown away.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HgQed9VABafbEg-Il7DJnw"
  },
  "e2l_6kmYlYJfZplMTscpJg": {
    "date": "4/7/2010",
    "text": "This Sunday i went about exploring a part of the city i had rarely been to before ... the south bank between the Globe and London Bridge. Everybody knows that a lot of travelling make people like me hungry, and so i decided to try this place which had been in my radar for some time.But it wasn't easy getting there, lost as i was in the maze of streets around Vinopolis. I called them up and they were very patient in giving me precise directions from the imprecise location that i provided them. One extra star for that :)Black and Blue seems to be a bit out of place in the area where its located ... with a modern decor (they have a glass lift in the interior) in an area of old buildings. But all these things remained far from my mind as i went in and ordered. They don't leave anything to your imagination regarding what food they specialize in ... you see pictures of cows all around. So i have a feeling that they might not be very popular among veggies.I ordered my steak well-done, with bearnaise sauce (which was yummy). They served it with a side of chips and salad which was very thoughtfully brought to me in a separate bowl, so that i could ignore it completely and concentrate on the meat ;)The steak was good ... and at £18 for a 10 ounce piece, probably slightly cheaper than the average. This makes it a very good value-for-money place if you are craving for your pound of flesh.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "NWr9vaBxuwpCNYza_wmyIQ": {
    "date": "4/5/2015",
    "text": "We had breakfast and afternoon tea at our hotel at the Shard and really needed to find a place for a change. Unfortunately, many restaurants in the neighborhood with decent Yelp reviews were closed on the Easter Sunday evening.  We stumbled across Black & Blue by the Borough Market and were not expecting much due to the mediocre reviews but were too tired to venture further. We were pleasantly surprised. The space was comfortable and airy, the service was good. The menu was simple and did not have too many choices. But the filet, rack of lamb, king prawns and chicken wings were all well cooked and tasty. The meats were flavorful and perfectly cooked to our specifications. The Malbec by the glass was quite good. We were satisfied and happy as we strolled back to our hotel.   Nothing spectacular but everything was well executed. Would not mind going back again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjGKVFhvKqoDSth3ri5X-A"
  },
  "3H0b5Rwn2e0ikkPOH8XJEQ": {
    "date": "6/11/2018",
    "text": "The definition of mediocre. It started with ordering drinks. My husband asked about a particular beer; the waitress giggled and said it was like *the name of the beer.* No offering of style or similarities to other beers. Then the mains came out. My husband's steak was tough and my burger was undercooked. Especially given the neighborhood, you can do better. You might get lucky and have a server that knows the beer menu.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AziNadjRaJdHe40y7bU8tA"
  },
  "wRPUTSiD7YSfg3BH1OfcSw": {
    "date": "7/28/2017",
    "text": "When you bring that rude French-like service to your restaurant, you better damn well bring great food. They have dishes with fancy names and fancy ingredients. We had the crayfish, prawn, and guacamole salad with crème fraîche starter. I had their \"classic\" burger with bacon and stilton cheese. My wife had the ribeye steak. We shared the chocolate brownie with vanilla ice cream. It was all mediocre. When you pay what you pay at Black & Blue, you expect a lot better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-qRwEyX28j7Go7LTxJohXg",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-qRwEyX28j7Go7LTxJohXg/o.jpg"
      }
    ],
    "user_id": "InInjzaZxzQ8_suxZEAP5g"
  },
  "XNoeRqXVyCsUAUknnT3ddQ": {
    "date": "7/7/2017",
    "text": "Read update at the end: it was a 5 star...I have no idea why this restaurant got a 3.0.  I've dined out at a lot of places all over the world and rate a place in respect to the type of restaurant. The service was quick, drinks, starters and mains were all ordered and delivered in good time. We had the Satay Chicken Skewers as a starter and they tasted great. I had the lamb cutlets as a main with the mint sauce and they were amazing. Everyone else at the table had a great time and very tasty meal.Update:  we had dessert and then waited 30 minutes for the final bill. They then added the \"optional\" service charge when they shouldn't have have had a tip at all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mp60ouoVdk88sWapmUePbw",
        "caption": "Photo of Black & Blue - London, United Kingdom. Lamb Cutlets were amazing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mp60ouoVdk88sWapmUePbw/o.jpg"
      }
    ],
    "user_id": "QDzMM2YcB0LDLJVHDqrz3g"
  },
  "wRXPZlkXlQJl9yObmJbHtQ": {
    "date": "11/27/2017",
    "text": "Like steak? This is your spot.Came here with some friends to enjoy dinner and we all ordered steak. I opted for the steak frites which was good, nothing out of the ordinary.  They have rib eye, flat iron, fillet, steak frites, and burgers. They also served a side salad which was good.Definitely a place to go if you like beef. Desserts was good too, we opted for one of the chocolate desserts which was good.Service was fine and prices were decent. Good place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9orBUbC8xTSqVIIxvZRjw"
  },
  "7Z6lA8a4lZwSwsK9lMxCXA": {
    "date": "9/1/2016",
    "text": "My meal here was completely adequate, though I was disappointed in the quality-price ratio.  I had a very dry arugula (rocket) and parmesan salad which came without any dressing (\"May I have some oil and vinegar, please?\") and two meagre slivers of cheese that were hardly pulling their weight as an ingredient.  It's as if the chef thought it was just an arugula salad and threw in the Parmesan by coincidence because he was feeling generous. (£5)The steak frites contained a small, thick cut of filet (not a skirt/bar steak) to match thick fries (not shoestrings), and an extremely stingy dollop of béarnaise, which was admittedly pretty tasty and well tarragon-ed.The waitress gave me a generous pour of a glass of Provençal rosé, followed by a glass of Crozes Hermitage which was meaty and savory and paired well with the steak.This restaurant doesn't stand out for any particular reason (well, there was free wifi and it worked...) and I'd recommend you look elsewhere.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEgBQZ_UakfJa31NWLODvA"
  },
  "Jx6xEzvLTznA5a02vdlqag": {
    "date": "7/30/2018",
    "text": "Stopped in because hamburgers are on the menu and the two grandchildren were attracted. We were promptly seated in an otherwise empty interior. A few diners were on the patio. That was the last of the prompt.  It was probably ten minutes before a waitress broke away from a conversation with co-workers, came to our table and provided us with a menu.  We ordered. The food was ok but, I feel, expensive for the portions and quality. Again, there was nil attention during the meal. No \"how is the food?\", \"can I get you anything?\" When she picked up the signed credit card slip there was no acknowledgment or eye contact.  She simply picked it up and walked away. I have had much better service at truck stops and diners.  Can't understand why this employee was employed. I can understand why they include the service charge.  It's really not optional but certainly higher than this particular experience deserved.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cqx2gme5bICC84BWSdUW1g"
  },
  "f9IwP8yw3hnhgcE8ikaUgQ": {
    "date": "9/26/2016",
    "text": "Black & Blue features perfectly adequate food and happens to be the only place open in the area on a Sunday night.The wine and ciders my friends and I ordered were good value, which was actually quite surprising.My friends both ordered steak-frites. The cut of meat was rather small, but I will say that at least they were cooked to order (medium and medium-rare), which one would expect from a proper steakhouse. I had the chicken with bacon, mozzarella, and pesto. The chicken was an incredibly thin and meager portion, with the bacon rather dry. The mozz was tasty but there just wasn't enough of it. The side salad was just depressingly portioned.For dessert, we shared the chocolate fondant, chocolate brownie, and the pecan pie. The fondant was small (a theme it seems at Black & Blue) but delicious, the brownie was room temperature and a bit hard and not-at-all appetizing after one bite, and the pecan pie was passable at best. Each came with a scoop of vanilla ice cream.All in all, if you come only for wine and steak, you're probably fine, but don't expect much more. If you're starving on a Sunday night, well you have very few other choices. Otherwise, nothing is likely to bring me back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAXQIEF6flNV8aJX47AXMg"
  },
  "GdiM3JAYBvSNZJ4C4p2imA": {
    "date": "3/7/2015",
    "text": "Is this place trendy? Nope. Is it hip? Nope. Is the food excellent? Yes indeed.Went here after walking through the rain to find somewhere that wasn't packed to the rafters on a Sunday evening. Every pub was brimming with people, and I was really pleased to remember this gem tucked behind Borough Market. The wine list has a lot of good options, and they do have helpful recommendations for pairings. I had a nice glass of Merlot to go with my sirloin steak. It was a really nice wine for the price.The steak itself was excellent. Perfectly cooked to medium rare and tender, with a lovely peppercorn sauce. They're very flexible about allowing you to choose your potato (I didn't fancy fries, so swapped for new potatoes, which were also tender and flavourful), which is a huge bonus. The side salad had a great mix of crisp, flavourful greens (more than your usual iceberg and rocket!) with a tangy dressing. My husband said his burger was also fantastic - cooked perfectly to a medium, and delicious. If you'd like tasty meat cooked perfectly to order in an accessible (oh yeah, there's a lift to the toilets and the entrance is wheelchair accessible) and unpretentious steakhouse - this is your best bet. Craft ales, good wines, great steaks, and at very reasonable prices. We paid around £60 for two meals, a glass of wine, and two London Meantime ales.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FaMPYkKaKu6g8uvR5Sqq8A",
        "caption": "Photo of Black & Blue - London, United Kingdom. Bold English Rose cocktail and a London Meantime Brew.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FaMPYkKaKu6g8uvR5Sqq8A/o.jpg"
      }
    ],
    "user_id": "NGz-IM5lOk5-5-tv4Nu4ZQ"
  },
  "OrxDsm_rH_JzI9L2MhRrKQ": {
    "date": "2/17/2017",
    "text": "The service here is horrible and the food was mediocre at best.  The staff here just doesn't care about its patrons.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "95SZp115VJJ6CiggSL9ywQ"
  },
  "_XayE3nQwNuFfmvz3StfOA": {
    "date": "8/23/2015",
    "text": "This place sure does a good steak.It's a modern and spacious restaurant built into the railway arches of Borough Market. Large monotone portraits hang on the walls, some quite moody looking, and on the upper level there was a cow statue. The booths were separates by panes of glass, much to the bemusement of my party and the diners to the side of us. At best it felt like we were dining with them, at worst felt like we were on prison visitation. Honestly though, the setting was generally alright, just a bit contemporary for my tastes.You go here for the food though. For starters half the party had chicken wings (which were more like tiny drumsticks but did taste very good), the rest of the party had butterfly prawns in breadcrumbs which were a bit bland but had perfect breadcrumb coating.The steaks were far superior to the starter. Steaks always come with fries and choice of sauce. I chose the fillet steak with peppercorn. It was perfectly cooked; juicy on the inside but with the sweet charred outside. Satisfied grunts from around the table confirmed everybody else was enjoying their food just as much, with rave reviews of the T-bone steak and also the steak with Thai green curry.The service was especially good here. We had a lovely waitress who ensured we had enough to drink and laughed out bad jokes from the table.It's not a cheap night out. With other steak restaurants like Flat Iron serving steak for £10, I struggle to see value in a place whose steaks start at £23. It's easy to spend £50pp and for that you can get a lot more in London. It's for this reason I don't mark it higher.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4hIg10gcNGMM6UF29x6NJg"
  },
  "MTmAzA2Q_9je6OY1omlMKQ": {
    "date": "4/2/2015",
    "text": "Black and Blue was a random find on a cold, windy day in London. My boyfriend and I wanted some pub grub with a glass of wine or two and we stumbled upon here after sightseeing.The place was very busy but we were seated quite quickly and given a great table for 2 in the centre of the restaurant.The first thing in that surprised me about the menu was the price- many of the items were cheaper than I thought they would be. I immediately regretted the decision to eat here as I thought the prices might reflect the quality. How wrong I was!I chose from the set lunch menu and had prawns with a chilli dip to start followed by the steak frites with peppercorn butter. Oh my word- both courses were tasty and warming. The prawns were small but well cooked and came with a delicious spicy dip. The main event was the highlight though! My delicious steak was cooked perfectly (medium) and the peppercorn butter melted slowly onto the meat creating this beautiful glaze.To drink, I had 2 glasses of the house white and we were then pleasantly surprised by a glass of champagne each on the house!Overall we paid about £20 each for a 2 course lunch and drinks- worth every penny and I would definitely stop in here for lunch again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dhFmP3xSJef1Q0Wlr8pcRA",
        "caption": "Photo of Black & Blue - London, United Kingdom. Main courses- steak and ribs. Absolutely delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dhFmP3xSJef1Q0Wlr8pcRA/o.jpg"
      }
    ],
    "user_id": "k_HjSKn2LF607Afg5zF0Rw"
  },
  "R_5gbWLHu-YNIdjE5qHO5g": {
    "date": "8/22/2015",
    "text": "The food here was good, not amazing but good. The steak was tender but slightly under seasoned. The wine was delectable and the atmosphere was great. Loud music and bass. Nice bar and scenery. The waitress was nice and patient. Would recommend this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V0LjjuQGrqpOnjweHx1oPg",
        "caption": "Photo of Black & Blue - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V0LjjuQGrqpOnjweHx1oPg/o.jpg"
      }
    ],
    "user_id": "ZJPF94FIjjjZhIX_xc9VNg"
  },
  "iMU33w7cHc5EfeomYnp2-Q": {
    "date": "8/29/2014",
    "text": "Great steak which is the reason for going to this restaurant. I would have posted a picture of my steak but was too busy eating it. It is quite expensive but worth every penny. Unlike other steak places you get more than a lump of meat as part of the cost of your meal (salad and fries).Friendly attentive staff quick service. We had a bottle of malbec from the south of France.It is busy so is worth booking if you don't want to wait.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WDjCtRTqD9Xfzv0c32DGWg"
  },
  "mFLiT9GlY4uYQO7ncVqvIQ": {
    "date": "8/27/2014",
    "text": "Black and Blue, a steak lover's franchise.  This one near London Bridge is set under some railway arches, and yet quite roomy.  Beautiful design with the exposed brickwork and big windows.  There's outdoor seating too.So, that's what I like about this place.  So here's what makes it forgettable.  Service is...adequate - just.  And it's really overpriced - £21 for garlic prawns - seriously?  ...For those of you not in the know I'm Pesky-tarian, hence the seafood.  In their the defence, the wine is not bad.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zSwwRATdcNBDDz8dF4oJpg"
  },
  "lLmon5_y9yDtWu8X8aVfLA": {
    "date": "10/9/2014",
    "text": "I walked in with my SO last Tuesday evening around 6:30pm and we were ushered towards one of a number of small tables crammed into spaces clearly designed to be spaces.  The interior itself has a modern airy and actually rather cool feel marred only by some awful prints on the walls and the insertion of the tiny tables.I ordered a medium-rare ribeye.  It arrived perfectly cooked, it was just an awful piece of meat.  Flat, stringy, gristly, just depressing. For a similar experience soak a small facecloth in bovril, stuff it into a condom, hit it with a hammer and serve with fries and lambs lettuce.  In what is a part of London full of restaurants able to hand cut, twice and thrice fry your fries it is literally gobsmacking to find a restaurant serving what taste like barely once cooked economy supermarket frozen chips. The chips served in the kebab shop arch by London Bridge station are leagues ahead.  It came with a green salad, that at least spiritually was entirely beige.  The Albariño was acceptable, but couldn't mask what really was a thoroughly depressing gastronomic experience.A good desert can often save a dining event,  I just couldn't be bothered to order one.  We left about £80 lighter, hungry and in search of cake.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "AoXoIrUYNKlWl5aupQ4uNA": {
    "date": "6/4/2016",
    "text": "We walked by this restaurant which is across from Waterloo station looking for somewhere to eat dinner.  We were seated upstairs and service was efficient.  We tried appetizers which were nicely prepared and our party of 4 enjoyed the kale/quinoa salad, soup, chicken, burger and rib-eye.  We were very pleased with this find.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nugwTBlY0dXjZV_Px-EeCA"
  },
  "4_OnHA2r3PftbUVNENPEcg": {
    "date": "11/6/2016",
    "text": "They don't deserve one star, but Yelp doesn't have the option for zero stars. Service is non-existent and the food is unremarkable. You' be better off at a fast food restaurant. Eat somewhere else.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uNpU6tHwhw-UsJJszt7Qhg"
  },
  "TCIBSGXVaYkIcdvanVF0zQ": {
    "date": "9/21/2015",
    "text": "Food was great service was great. My husband and I happened upon this jewel in the cut! Great food, great scenery, and great wine selection.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5kFsFh6_59iy6-c_PuKQA"
  },
  "RXbiVezpHuG8Uzn83klSZQ": {
    "date": "9/12/2015",
    "text": "Atmosphere was great, enjoyed the sunny environment and overall food was flavoursome.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lB8-lyRGiPO8ebtOkyJfIg"
  }
}