{
  "36l_RIlSKxjo6bp5BWw39w": {
    "date": "8/29/2009",
    "text": "Stopped last night for some snacks drinks and shisha. Expensive but fun. Sat outside as the sun was out and that was a great atmos. Food was adaquate, staff, very friendly, so give it a go.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "U_2_q8EAk6oBJKHiGlrJ5A": {
    "date": "12/7/2008",
    "text": "Don't go to Momo's if you are in a rush. I used to work opposite the restaurant on Heddon Street and regularly went there for lunches and after-work drinks, so can say with strong conviction that it is impossible to get served and eat one course in under an hour. Even getting a drink can cause problems as none of the waiting staff seem to want to serve you.I love the atmosphere and decor of the restaurant and its adjoining cafe/bar but i always leave extremely aggravated and late. They do an absolutely amazing lunch deal for £6.95 where you can choose from a selection of main courses (the hummous, chicken and roasted pepper wraps are amazing) salad, soft drink and mint tea. It is very good value but because it is made fresh (and because they don't take your order for twenty minutes) it takes a good 75 minutes to finish.They do a mean mojito and if you are lucky enough to get a table outside in the Summer, it is a perfect place to people watch on Heddon Street.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AuZkeiKZ8bio3Q6UItNwQ"
  },
  "xWIb8yXGqdkw84xrclRAAQ": {
    "date": "2/4/2009",
    "text": "This is a restaurant and bar/club. I haven't eaten here but I have danced the night away in the club many times. It is a small intimate venue, very dark with a moroccan theme; lots of low tables and cushions. The music changes dependant on the evening and the time of the evening so it may be best to check before you decide to give this place I go. I prefer to go when there is a house DJ on the decks (Simon Lawrence and Kosmetiq often play here) but I know there is a great mix of other music throughout the week. The club is supposed to be for members only but if you go before 11pm I am sure you will be admitted. They are very fussy who they allow in so make sure you look the part! A great place to start the evenig off.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "behKGATKN20piFP-2NOcLg": {
    "date": "7/12/2013",
    "text": "Excellent restaurant in London that comes with a very cool ambiance and environment to boot. The service is friendly, the food spectacular, and if you feel like partying after dinner there is a nice lounge downstairs. It is not cheap in dollar terms once the exchange rate is considered but totally worth the splurge if you're in town!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0bZmlNsp8i6qWlNyO2hnw"
  },
  "LVu6g1bfgp78h4fw62xhZA": {
    "date": "2/26/2007",
    "text": "The bar downstairs is probably one of the late night hang outs in London in terms of music, ambiance, people. Any evening seems to be really buzzing with people who are not (just) posing but having fun. The restaurant is ok, as long as you like couscous and tagine of course and don't mind the unavoidable end with people dancing on the table... Avoid it during the weekend, not so cool then.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMe7MW1M-4A1iEhySt4wpA"
  },
  "xG2QjuNox_htR_Bp54d_Ag": {
    "date": "10/15/2008",
    "text": "This place is cool. It was the restaurant to be seen a few years ago with celebrities falling out of it nearly every night, and it's still a great place for people watching. The vegetable tagine was very good and hit the spot - perfect balance of spices and cinnamon mmmm. Yummy moijitos and occasionally they have belly dancers - always worth a visit for this! I think Momo's may have been the place I started to fall in love with a special someone.. so it holds fond memories :)",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "pYlJ6vFIhLaVaaFSofLjVQ",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pYlJ6vFIhLaVaaFSofLjVQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "EKlwxm5_sqzSreUElPhxwA": {
    "date": "5/21/2007",
    "text": "Fun, lively and cool Moroccan restaurant just off Regent Street; the decor is great and the food excellent (but avoid starters and stick to the couscous and tagines). Loud music, funky atmosphere, relaxed but efficient staff make it a popular place during the week and at weekends (you need to book). Not the place if you like quiet conversation, or like to linger (they have a pretty quick turnaround and you are normally given a 2 hour window when you book). Expect to pay about £50 per person for 2 courses and a bottle of wine.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_k_Ht9OmtfZxtnYXAYY7ow": {
    "date": "11/28/2008",
    "text": "This place is great!We stumbled upon this late on a Friday night and afterwards realised how lucky we had been to get a table! We didn't really know what to expect, so had a great time - as the food was good ( we love Moroccan), the waiters were great fun and the music and dancing kept the atmosphere going well into the night!Would highly recommend",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HgQcHxBLCHFJu_RAPeMqjA": {
    "date": "2/7/2013",
    "text": "Very very bad service and the managers they so rude and nasty !!!",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ogJZo8xAHyk5c0cuKSEICw": {
    "date": "5/31/2009",
    "text": "ah man this place wins hands down for atmosphere the music load but in own worthy right accepted as the staff danced to and from the tables. Hypnotic escapism. and the food did not matter as i now due to the hypnosis do not remember it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Ab6t3mmUauabPJwW0LZow"
  },
  "iAHD7RPBiQH2UQ38zbL6qw": {
    "date": "8/3/2012",
    "text": "The food here is delicious. I had the vegetable tagine  really just fantastic. Not too expensive either!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "d3W54niHgPNJYXNONvzJUw": {
    "date": "4/30/2011",
    "text": "Okay food. Overpriced. Horrible staff. One staff member was belligerent and seemed on the verge of physically assaulting one of my friends. He seemed to be experiencing steroid-driven aggression. The manager clearly had no interest in hearing anything negative, and clearly does not care if he gets any repeat business. Maybe this was once a good restaurant, but I would discourage anyone from going there now.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1LiWac7W55R7od79iiFvJg"
  },
  "W1_MdwFr4K3qY2j8_R_RGw": {
    "date": "11/17/2008",
    "text": "Momo is perfect if you're craving a night out but are not quite up to hitting the clubs in lieu of a proper dinner.The only minor complaint I must reluctantly offer is that while the food is consistently top-notch (a starter plate of grilled vegetables and a chicken tagine may look quite basic on paper but turn out wonderfully executed), it can be difficult to fully appreciate it given your environs.  It's just a shade too dark and people are usually packed in like sardines, nearly shouting at each other over the music, other nearly shouting people and occasional outbursts by the staff singing and dancing birthday wishes to an accompanying Arabic beat.  That said, the above is exactly why you feel like you're getting a night out.  The cocktails are also superb and the cool lounge-y bar downstairs is a great spot for table waiting or for continuing your night post-dinner (if you so choose of course...)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "fTtQ-PR_OU1Ui1skcyCAjQ": {
    "date": "3/6/2009",
    "text": "Beautiful room, albeit a tad dark. Very good Moroccan food and super Mojitos. It's fun to cap off dinner with some apple shisha on one of those huge nargiles.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3mNq5Ck5s1JoAhGyL5EQg"
  },
  "hsHeOskjUev0lYl3OSlyQA": {
    "date": "11/13/2010",
    "text": "place was very cool! on an off night in the dead of winter, during the largest snow storm london had seen in 50 years, my wife, friends, and I owned the club--literally. they were supposed to close by 1 am, but kept it open for us well into the 4 o'clock hour! great drinks!!!   The dj was the best!!! It was especially cool when he played some very very rare Dilla, which I had never even heard in the states.  he was all over the place. very eclectic and soulful.  understand all the stars, but mostly Madonna has made this place very popular over the years. very, very cool and cozy!! good for a date or just to vibe out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUoT_ixOdsLUzaUYMIvzow"
  },
  "yQH0wtidEXLyK_4m-h3RfQ": {
    "date": "10/9/2008",
    "text": "I really enjoyed my trip to this restaurant last year. It was a little more than i'd normally pay, but the quality of the food and atmosphere made it certainly worthwhile. My sister also went there recently for her hen party and apparently it was suitable to her (ageing and not so wild) rabble too! I stuck to the tried-and-tested Tagine and wasn't disappointed. Of the restaurants in this area of London, it is certainly my favourite.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "G2b1-7XGrGsOMUNd-0RiyA": {
    "date": "1/16/2008",
    "text": "well, defenately beautiful. u ll find everything u would expect, friendly society, good service, exellent cocktails, perfect atmosphere for a romantic nite, or even a messy one with friends.there is also a tea room next door, part of the same company, in case u arrive too early and want to get a drink while waiting. book in advance otherwise u ll stay out!not very cheap, but, wot is cheap in london?? :-)))",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_lHjsDVrJPIzIVpXAND70A": {
    "date": "6/29/2008",
    "text": "A really funky and classy moroccan restaurant in a great area of London. Perfect to impress on a first date, or for a fun night out with a great group of friends - the atmosphere is lively and fun, and the food never disappoints.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tCMzXDg1UD6KyI2muoMLwQ": {
    "date": "11/15/2008",
    "text": "What a disappointment. I've always wanted to try here, already owning his book & having travelled extensively in North Africa. It's a pretty & atmospheric place, both inside & outside on the climber-screened terrace area, & the staff were fine, but the food (from the all-day 'tapas'-style menu as we were there mid-afternoon) was less than mediocre. Portions were really tiny, & food was dried-out & under-seasoned. Carrot & orange salad is possibly my favourite Moroccan salad dish but this fell short of all other versions I've had in the past. The little cheese briouats were pleasant, but I expected more. What is meant to be a pioneering restaurant serves food of inferior quality to a bog-standard roadside cafe in Morocco!",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9EfY1jsz9xp4SyNmmN-VqA": {
    "date": "1/31/2008",
    "text": "If you are looking for a Moroccan first date restaurant then look no further! This is the ideal first date place as the ambience is very relaxed and romantically lit. The décor is very authentic and chilled out. The music isn't too loud so you can talk. The food is very good too. The only down size is that it si very expensive but that's not too bad if you want to impress your date ;-)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "m5gbz_oNcuhMurH8yWJxUg": {
    "date": "2/7/2010",
    "text": "LOVE, LOVE, LOVE!Atmosphere is AMAZING and the food is just as good. Delicious flavor.I reccommend the Wood Pigeon Pastilla, Harira soup, and this INCREDIBLE eggplant dish that was OUT of this world.Wish I could have taken this place in my carry on back to the states : (",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JlLfZ0bdNBM0dOsjL7rIBg"
  },
  "MOznkvhFmgnm2XBkj0Byqw": {
    "date": "3/17/2010",
    "text": "Momo is a great place to go either with a group of friends, or on a date, as the overall experience is the full package in terms of food and atmosphere.  It is also in a super central location, but for some reason whenever I'm on Heddon Street I feel like I'm somewhere in a romantic European town on holiday....The restaurant is huge, with both indoor and outdoor seating and the decor is pretty special (imagine plush cushions, candles and elaborate Moroccan windows and ornate furnishings).So I have to admit, I was not overly impressed with the starters at this place, so I will cut to the chase: Oh my god the Lamb Tajine with prunes and almond and the Chicken Tajine with green olives & preserved lemon.  DELICIOUS!  Momo also has a fantastic and very comprehensive website, which provides the recipes for many of their dishes, which is pretty cool, should you want to turn your house into a magical den for the night and serve up some Momo-style culinary delights.  This could be a good option if you are on a budget, as Momo is a little on the pricey side.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9PFPTlnblQf32OvyjJEaw"
  },
  "USs9ULlFmDOknpsIZdaiDg": {
    "date": "9/24/2010",
    "text": "I love Momo's. When my friends and I are stuck for ideas we always end up here as the hospitality is very gracious and the fresh tea just turns an average meal into a treat.I had the duck and fresh dates skewers, I should have asked for the recipe as it tasted so delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTUbajPBghvj-4ebP2D8-Q"
  },
  "yFO6bmjE-xA-bpLdhmh4DQ": {
    "date": "7/4/2014",
    "text": "Amazing!! First time I've tried Moroccan food and what an experience.  If you're a fan of lamb you need to get the lamb wrap.  I also tried the chicken grilled skewers which was quite good.  The most amazing part was the mint green tea.  I definitely recommend Momo!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iaDhA0BVtrVCaw5XXBisVQ"
  },
  "0M9N3HftU0fOE5fotJdzbA": {
    "date": "9/9/2009",
    "text": "One of my old favourite spots in London, fantastic atmosphere, great busy vibe and perfect for people watching. They do amazing mezes - and if you are lucky with the great barman ( they do change a lot) the best Mojitos! I also love their shots and Momo's specials! Its similar to Mojito but with vodka and lots of ice. Try the olives, and bread, and of course, cant resist the little tea room with beautiful deco and friendly staff ( most of the time - exceptions do happen)It is perfect if you have people visiting London - it has special atmosphere!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XOHt6k0WiQoWcxzc6-ZEbg"
  },
  "zQkbYni9GlPEzR43ric5HQ": {
    "date": "7/19/2011",
    "text": "AMAZING! i ordered the fish tagine and the flavor was perfect! my colleagues ordered lamb and chicken tagine and they loved it as well. we all got moroccan mint tea after dinner that was fabulous. i am so stuffed!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VwWYIBvVgx9PVoOoD_Vb_w"
  },
  "7c3YcZqs2FJCgwYyYDw8iQ": {
    "date": "11/26/2014",
    "text": "Had both a fantastic brunch with a friend from out of town (you can sit outside on a nice day) and a wonderful dinner with friends here on a special occasion.  Everyone loved it.  The food is superb, the atmosphere is great and the service is excellent.  Looking forward to going again sometime.  It's not cheap but it feels well worth it.  One of the best restaurants I've dined in in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bN7WdoNPjUQzra4FMOocFg"
  },
  "1mrK_EstB41LGRtWE1j1ZA": {
    "date": "6/5/2010",
    "text": "Momo in the Regent Street food quarter operate three distinctly different areas - an informal restaurant/cafe/tea room, a restaurant and a bar/club area. I've been to the informal/cafe/tea room on many occasions and had a great time. Our most recent visit to Momo Restaurant was appalling. The good bits were the decor/atmosphere and the clientele. The greeter and seater was very good so we were expecting a fab evening. Alas, though ripe with promise, this was not to be. Waiting staff were snooty and quite obnoxious. Food (whilst tasty) was very expensive for what you got. Main dishes (starting at £17 for vegetarian couscous) are served without any couscous (or potatoes for the tagine option). Couscous or potatoes will set you back a further £4 so at more than £20 for your main dish ..... Sorry guys, but I'm voting with my feet and my wallet on this one.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NqEv-StLE3vPAz-XaeLHKA": {
    "date": "11/18/2009",
    "text": "Momo should get four stars. But for their terrible service, they get docked one star. We came here to meet up with some friends for drinks after dinner. They have a sizable cocktail menu, and all of the drinks were pretty and tasted good. I thought their lounge would be a bit more... lounge-y but the music was so loud that we could barely hear. We ordered a appetizers and asked for utensils and plates so that we could share, but the waitress told us they were meant to be eaten by our hands. When we tried to order a second round of drinks she only took an order from one person and then walked away. When we tried to get her attention she would look in our direction and nod, and then walk the opposite direction. What the heck?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDkX3Vmm8wYcFDDxc9uWwg"
  },
  "KhSbc5tKcr9XpTcynb4lYA": {
    "date": "12/23/2009",
    "text": "Perhaps the quality of food isn't justified in the near 20 pound price tag for main courses, however in terms of ambiance and twilight lit décor, this is an excellent date place! You'll be greeted here by an amiable staff member, with a setting not far removed from the depths of Marrakesh...think stucco walls, a wood-and-stone floor, patterned wood window shades, burning candles, and banquettes. I would heartily recommend all the tagines (either chicken or meat), the portions are gargantuan in comparison to the autumnal squash risotto option. Perhaps nip to the adjacent Ice Bar for a splash of liquor to round off a romantic evening in this plush part of town.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "ooHopqQF24Ne6jkhGdz7Yg",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ooHopqQF24Ne6jkhGdz7Yg/o.jpg"
      }
    ],
    "user_id": null
  },
  "WmvLOIHAHI5lpP7PzG4b_Q": {
    "date": "6/8/2009",
    "text": "Great drinks (no tequila, but lots of wonderful minty things)!Great food!  Amazing atmosphere -- definitely want to come back for a birthday party!Very kind helpful staff.And after they pointed us to their new African dance club, and we had even more fun there.  Even the location is perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IjfxKR1ut1htmg5OUHvRnQ"
  },
  "yYI10047_kYsfBNVslbUtQ": {
    "date": "10/17/2012",
    "text": "The provision of a professional, front of house security company comes with a number of benefits these include; the safety of your staff and customers, the ability to safely remove unwanted patrons, refusing entry for highly intoxicated people or big groups of young males/females which you may not want in your venue, without security it may prove a challenge to resolve these problems in an effective manner. Phase One Security provide professional, smart and experienced door supervisors (phaseonesecurity.co.uk/#…) to the licensed leisure industry. The mature and professional door supervisors supplied will set the tone for the evening by politely greeting your customers on arrival, maintaining search polices, checking ID and providing positive information to patron's about the venue. Depending on the clients specific requirements will determine the services provided.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-sWyL792M5KOmfeMiHKSHA": {
    "date": "8/25/2012",
    "text": "This restaurant was recommended by our concierge at the hotel and we made the trip after a long day of sight seeing. The restaurant is so beautiful and the service and food were excellent. It is in this trendy area with a bunch of other places where the beautiful congregate for drinks after work. But we loved the food! The prices were high but worth it. From the manager to the many servers at the restaurant we felt well taken care of! I would definitely go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPlAiUkm3Sd7IFwDLvFTjw"
  },
  "m1T8ZdwMpzfz513axg_f1w": {
    "date": "5/10/2011",
    "text": "Went to London (first time) and part of our prep for the trip was to scope out some cool places for dinner.  We went to dinner at Momo and we were both delighted with our experience.  Gorgeous decor, exceptional service + drink and delicious food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXYvn72tcWbrbWKlzgAZXg"
  },
  "aWXuCfZG6Sq20_jhaaxgnA": {
    "date": "12/2/2008",
    "text": "For some reason I always end up here for large birthday parties.  Maybe because it's not the *most suitable* place for a nice dinner... but the fun atmosphere make it ideal for a group to enjoy exotic food - be loud - and sip strong cocktails.  Plus, the long tables and attentive service mean the place is very accommodating for a large party that wants to wine and dine.I would definitely say that the food is pricey for what it is... there is probably better Moroccan to be had (and I've heard the men at some of the parties, who were inevitably going to be footing the bill, complain as much)... but again, food is not the central feature of this place - it's much more about the crowd and the atmosphere... come here for the party... sit back amongst the cushions... be mesmerized by the tinny foreign music with its rhythmic beat... and have a good time!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_7WdbmNVYcxns-2r3NcJhA"
  },
  "HqH6dIzar4_t3PPHeZow-w": {
    "date": "1/9/2012",
    "text": "Amazing! Had the taster menu and was pleased to see and try a massive amount of food with starter cocktail included! Although the restaurant can be very busy at times and you end up sitting on top of each other I found it to be a very unique experience.Was an easy please on me as I am a fan of charcoal lamb (or any meat for that matters)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jLdWrHLJA71ScgDxZdUnVw"
  },
  "wu_mcOULhe0smRXXL8MNFA": {
    "date": "11/24/2008",
    "text": "Filled with North African furnishing, the interior is very appealing,  and as soon as you enter you feel like you've been transported away from the busy streets of London and into a souk in Morocco. The food is good, I had a lamb tagine with couscous which was very tasty, but I couldn't justify its cost knowing that it can be made much cheaper, and probably tastier in Morocco. Also, in the evenings, after a certain point the music is cranked up fully and you can barely hear what the person next to you has to say.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3Tee9JlBcFBxRmpI6QPe1g"
  },
  "-RdJoOtdNAt7i8z_2wbvbA": {
    "date": "5/13/2009",
    "text": "I have friends working there and I spent my best sunny saturdays afternoon in this barThey have a large selection of cocktails and shishas for the smokers.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HxANGdPj1bJ_U8P8UoE7og": {
    "date": "8/5/2009",
    "text": "You might expect nothing less, but a tourist hell hole sitting right next to Regent Street in this nice, but soulless refurbished space, but momo is actually quite good. We went there to meet with a former colleague on a sunny afternoon. We sat on the low tables outside which has nice atmosphere (beware: we only got the table after committing to eat something). There are a lot of moroccan tapas to choose from and with a 3 tapas/5 tapas offer with free of choice it doesn't set you back too much. The food was without exception good and perfect to accompany the afternoon beer/ wine. As always if the company is nice, you tend to see all other things a bit more mellow. I would say beer and wine are average. The staff is generally very friendly and didn't start an argument when they brought the wrong tapas :)",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Wr-XoX9lIcEMCxQyfeOt2A": {
    "date": "3/26/2011",
    "text": "One of my favorite spots off of Regent St.  I've been to Marrakech and the lamb tagine in Momo is as dynamite, if not better, than the real thing.  Momo could sometimes be loud but being around beautiful people seated on the sofa more than make up for the noise level.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaK1daIwjVDavae73eNPrQ"
  },
  "4ilshN1248IWD6lzF9H3Qg": {
    "date": "4/11/2015",
    "text": "Cozy, tasty and amazing music. Fun to just site back and look at all the interesting lanterns on the ceiling. Well worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBYg1XVHWJGWFK7EhVFZuQ"
  },
  "Vcbmj54US5X03FlVuhlhZw": {
    "date": "7/30/2012",
    "text": "I really (really!) wanted to love this place and give it 5 stars. The food was absolutely delicious - unique flavors, well executed - and the setting is beautiful.  They really did think of everything - from the outside patio seating area to the restrooms. The place is gorgeous! Unfortunately, our late afternoon lunch was ruined by some of the worse (SLOW, inattentive, etc.) service I've had in a very long time. So disappointing too because it impacted our overall experience and over-shadowed their fantastic food. 5 stars for food (aubergine and briouats appetizers / chicken couscous and lamb meatball tangien entrees) and 1 star (really, 0 stars) for the service. Too bad!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OQCsJHe9Owl81dCV7PlbRg",
        "caption": "Photo of Momo - London, United Kingdom. Downstairs restroom area - really a beautiful space.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OQCsJHe9Owl81dCV7PlbRg/o.jpg"
      },
      {
        "img_id": "72oMUyOEaoxl_mepI3mXZw",
        "caption": "Photo of Momo - London, United Kingdom. Chicken couscous - so good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/72oMUyOEaoxl_mepI3mXZw/o.jpg"
      },
      {
        "img_id": "ZNjb3YIkkjQ6PvDfdaV7IQ",
        "caption": "Photo of Momo - London, United Kingdom. Lamb meatballs - delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZNjb3YIkkjQ6PvDfdaV7IQ/o.jpg"
      }
    ],
    "user_id": "SHEziY_V4G60mVyLNvjLSQ"
  },
  "LWoWoj2KeOfsPYKJydM_Bg": {
    "date": "3/22/2015",
    "text": "I came here for the afternoon tea which was fantastic and great value!You get unlimited mint tea which is delicious! My highlight of the tea was the really delicious cheese briouts.Also got a nice surprise at the end of meal with a collection of biscuits to take away for free!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcVeWS0tk8K-GXRKtatNsg"
  },
  "sg8-DuWNRj_qhedUCV5dhw": {
    "date": "5/3/2015",
    "text": "Not worth the hefty pricetag. The atmosphere is not romantic; despite my request for a quiet table, we were initially seated at a communal table by the door. When I requested a table change, we were seated right next to where the silverware was kept, so that there was a constant and annoying clinking of the cutlery. There were too many big groups that spoke loudly, and the food was ok, nothing mind-blowing. I will definitely not come back and I don't recommend it for a date dinner",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cAHCxdwrypapMH5xM-2q9w"
  },
  "Am6iXY6aa3AOL7_Dakfvgw": {
    "date": "2/15/2014",
    "text": "We booked late on a Saturday evening and were told 10.30pm was the earliest we could dine there.  As it happens we arrived a little earlier and the hosts kindly found us a place to be seated. The place had a great ambience with attentive staff. The food was also  great, I had the pigeon pastilla followed by lamb tagine, the remaining three people all ordered chicken tagine. The food was great as expected and we had a great evening overall followed by morrocan tea. Will definitely be going again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_J_uKrM-pHiBVkdbRfL2EQ"
  },
  "-kEe0_bNCzzj3tunvcpdTA": {
    "date": "6/1/2014",
    "text": "Lovely atmosphere and waiter but the food was average at best. The starters were amazing though so 3 stars.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nHpy_nizWF38flNL5bACg"
  },
  "1UoUKqar0bCDmC19Dy-QLQ": {
    "date": "11/1/2014",
    "text": "Great atmosphere and amazing staff.  I got the Momo grill which was a little better the okay.  Our friend got the tagine which was outstanding.  The hummus A+, the cheese briouat was sooo yummy,  The place has a great vibe, you feel fab there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UISbAHBPXnvzhBc-t4_6qg"
  },
  "fkCMSrzo4lpsDhXW1BNapg": {
    "date": "4/18/2012",
    "text": "Momo was recommended by local friends during our recent visit to London.We met them at the restaurant, which is tucked away off Regent Street, about 4 or 5 blocks north of the Piccadilly tube station.We had arranged an early reservation, which was good since the restaurant filled up while we were there.We asked our friends to order since they had frequented the restaurant.What came to our table was a truly impressive selection of Moroccan dishes that left everyone satisfied.Roasted lamb, chicken, sausages, couscous, bread, olives, sauces and so on and so on..Truly impressive was that everything came to our table at once.  We had ordered a significant variety of food and it was all prepared and presented perfectly.I recommend making reservations for Momo.  A line was forming when we showed up, even before they opened for dinner.My only complaint was our waiter/server was less than engaged with our table.  It was difficult to get his attention and he would wander offer for quite a while to retrieve whatever we had asked for.That said, the other serving staff that helped load our table with the unbelievable bounty of food was superb.I highly recommend Momo!Next time we're in London, I'm sure we'll be making another visit.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZzKS-UOJCP4AMYiLIq3MA"
  },
  "4G3eP-jUQ0i0Ac9iXKKCzQ": {
    "date": "11/10/2011",
    "text": "Went there on a double date and it was so much fun! We waited about 20 minutes and it was worth the wait.  The food is delicious - WOW!  Decor is amazing, you really feel like you are in morocco.  We practically ordered everything and couldn't find anything wrong with it.  Make sure to order their succulent duck bourek, momo grill (quail, lamb, chicken), lamb tagine (NOW I AM HUNGRY!)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "a0w-Md40ZFPsWIupx5UT5g"
  },
  "wteDeQiN9gFs0jHvwm1iOQ": {
    "date": "1/6/2015",
    "text": "Really easy to book and management and staff are excellent. The only issue I had was that I was informed of a corkage fee by email of £15 per bottle then on arrival this was changed to £25 which I found a little annoying. However ambience and decor is authentic and lively and acoustics are good to have a group and still hear a conversation. Food was excellent and portions of the main meals was more than double what I could have. I had a lively group with me and they handled us with great experience and I would recommend this restaurant to all. Without drinks I would say expect on average £40-£60 per head. Especially good for client entertaining and for special occasions.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5ucpG5YxKQeJoHCr0Phtg"
  },
  "3zv4BXoJ3btojF3DLMzIzQ": {
    "date": "9/4/2014",
    "text": "This restaurant is beautifully decorated and the ambiance is great. We really enjoyed our meal here. The chicken tagjbe and the lamb momo were highlights. The only disappointment was the bread that came with the hummus, which was dry and had little flavor. Our waitress was excellent and the food came out quickly. The prices were reasonable for the quality, especially considering portions were on the large side. This is a good option in the Piccadilly Square area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AkPkijB6Pv9YH1pDxeU98g"
  },
  "jsbGnBEYD2rrhi5TkfHQsw": {
    "date": "1/30/2014",
    "text": "We went there on a saturday night, it was quite crowded so you should make a reservation in order to be able to get in. Worst thing about that place is you should finish your plate and leave the table in 2 hrs cause they two sessions, other than that everything was wonderful including the foods",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y8Vsh3XhWSxwTOUZySu0Hw"
  },
  "VPeIw3m3f9VpXqIv7UcEoA": {
    "date": "3/29/2013",
    "text": "WOW - you must go to this restaurant!!  Delicious Moroccan food, awesome ambiance, servers that dance around you, hookah outside, really neat place.  Think \"Spice Market\" vibe but smaller and darker and with much better cocktails.  Only downside is you have to go outside to get to the bathroom and in the coldest March in 50 years, that was not ideal.  They couldn't find our booking in their system but seated us right away and the service was great.  The sweet mint tea to end your meal is a must.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rw8VcGgVxJavNc1LePlDgQ"
  },
  "9Wovd-KFcMZupNaNvAK5og": {
    "date": "10/15/2012",
    "text": "MoCafe is next door to the popular Momo restaurant. It's a great place with a groovy north african vibe to go for tea. A good choice of tea; Hammam ('Turkish, fruity green tea w.rose petals and orange flower water'), Oriental flowers, Fakirs tea (spicy with cardamom), and of course fresh mint tea. My Five o'clock tea; a 'light blend of whole leaves from Darjeeling and highlands of Ceylon', was excellent, a wonderful accompaniment to the scones with fig and strawberry jam. They also offer afternoon tea, which i didn't try , but sounds delicious, so will be back.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "hDhP9Y46ajyqU4-8wCCliQ",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hDhP9Y46ajyqU4-8wCCliQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "rTSP_zP10UWRQg3kw8U2yg": {
    "date": "9/1/2014",
    "text": "It was alright. I would say that the service and food were OK. Nice atmosphere though!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ncQIfrzdTziEhTAOX8ztXQ"
  },
  "3NAeXNGquBDqFKpFqmaeGg": {
    "date": "6/26/2010",
    "text": "Oh my momo!  The food here is divine.....I love the high-end Moroccan decor.  It truly feels like you have left London once you setlle in.  The tiger prawn appetizers were fantastic, as were the pigeon pastilla and the generous portion of scallops.  Tangines are their specialty and the lamb was melt in your mouth.The service was spotty, but again, this is London.  If you can't afford a vacation in Marrakesh, then this is second best.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "fILQSUkDXTTkH7s3Hdwcsw": {
    "date": "11/12/2014",
    "text": "Went here for my 20th birthday, and was taken exceptionally well care of! Great food and great service make for a happy birthday girl. I had the vegetable tagine, which was amazing, and couscous and pitta on the side. The table also shared some mecouia, hummus and baby aubergines to start, which I can definitely recommend! Be sure to order their pitta bread, which we all (minus the gluten free ones) raved about all night.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bStis1DJupPykwBU6lwQPQ"
  },
  "IsmzEbjUIM_ckKGuZHh0Ww": {
    "date": "1/10/2009",
    "text": "Hands down one of the most amazing places I have ever eaten. The decor, the service, and the food were all amazing and I will for sure be back the next time I make it to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1D5EQITb4hOzPMZT8gDPQQ"
  },
  "xECe4ybaVaZ4hUhqMWGU8Q": {
    "date": "11/23/2014",
    "text": "The atmosphere in Momo's is fantastic - you really feel like you've entered a hidden grotto in the middle of Picadilly Circus. The food was relatively nice (although hot to the point of burning the tongue!), however the service we received was disappointing. A waitress repeatedly tried to take my starter away despite me telling her (very politely) that I hadn't finished. She even seemed annoyed that I hadn't eaten quickly enough! A number of the sides we ordered didn't arrive until mid-way through the main course, and we were eventually asked to move outside to enjoy the cocktails we had already ordered to free up the table, which would have been fine had we not been rained on through the canopy. Given the pricing this poor service did detract somewhat from the experience, and I wouldn't return in a hurry. However, if you do visit I thoroughly recommend informing the waiting staff of any upcoming birthdays in your group - without giving away too much, the \"celebration\" experience is rather spectacular!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bRhsEMuHR8OPUudJZkFQsA"
  },
  "m_ISqqrEQxJKMbG8fauMNA": {
    "date": "8/4/2010",
    "text": "Perfect Moroccan decor and good service all round. Decent nibbles & snacks to share. Good choice of cocktails and wines. Tea served traditionally and you can also have a go at smoking chicha...Great atmosphere overall. Personally, I always stop there after a meal in the area for a mint tea & a dessert. I fall every single time for their lemon tart...Must-try! Note you can't go just for a tea before 10pm, you'll have to have something to eat as well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Fn4SKI89bingbcfWAY0HA"
  },
  "6V4U86HcC_MVdnKafZkUxg": {
    "date": "12/22/2013",
    "text": "My girlfriend and I stopped here at random after a full day of walking and Xmas shopping.  And we are glad we did!  It felt like a calm oasis from the madness of Regent Street.  You really feel like you are stepping into a cafe in Marrakech.  Unfortunately including the Moroccan pop music.   I had the lamb wrap and harira soup.  Both were excellent and seemed quite authentic.   I also had a gin martini and it was really clean and well prepared.   The service wasn't great as there was a little order mix up but nothing serious.  Free falafel in the end!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b-fP5XcqMMI4dhp4bAxRrA"
  },
  "h8PwWQxquokGKyWeXlVJaA": {
    "date": "1/10/2016",
    "text": "We went there  6:30 pm just after it open. The restaurant was more quiet that the coffee shop that open all day. The atmosphere was great, classy. We just order starter ( since we are on a diet). Everything was delicious . They gave us a basket of bread, and when we ask for more they gave another. We end it with Morocco tea that was free refill.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qgVJHh_89a0qp1888fayzA",
        "caption": "Photo of Momo - London, United Kingdom. Zagiul or something like that. It's eggplant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qgVJHh_89a0qp1888fayzA/o.jpg"
      },
      {
        "img_id": "PH-IBkeiXxasNCzRHTZHhw",
        "caption": "Photo of Momo - London, United Kingdom. 4 delicious starters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PH-IBkeiXxasNCzRHTZHhw/o.jpg"
      },
      {
        "img_id": "GdjtwgJFzJCeayYl33Yp0g",
        "caption": "Photo of Momo - London, United Kingdom. Free refill Morocco tra",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GdjtwgJFzJCeayYl33Yp0g/o.jpg"
      }
    ],
    "user_id": "83dQT1vPMJqAsqlnXxaiOA"
  },
  "BbmKGR27JNF9d6nUYivrpg": {
    "date": "4/14/2016",
    "text": "What a restaurant, I had the Couscous Momo, the lamb was beautiful it melted in my mouth, the couscous was amazingly fine. The drinks were great... Sadly some of my friends didn't have the same experience, but if you order well the food is amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mVJM41IkAwki-WT4C6FVmA"
  },
  "nrvIjz99xLCrNiwVxL6hbQ": {
    "date": "10/8/2013",
    "text": "I hadn't had Moroccan food before and my was it was delicious.Food: 4, Atmosphere: 4, Service: 3Cost to worth it rating: 3Eve award: turned me onto tanginesReturn worthiness: yesHighlights:- Tangine: I got the chicken and it was packed with lemony herby flavors and so moist. Loved it!- Assorted appetizers: we were with a group but I enjoyed the variety of fried crispy items and others- Tea service: impressive pouring the mint sugary tea from high above- Atmosphere: very cool with dark lighting and colorful pillows. Midlights:- Wine: but doubt this is why you come here. I did adore the glassware however with the thick stems and bell-like shape up top- Cakes: way too sweet for me but nice presentation with the 4 tiers of small platesLowlights:- Seating for taller individuals: they weren't too comfortable as there wasn't much space for their legs - Restroom walk: down dark, windy stairsHad a really fun night here and would be happy to go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aD-rsDe2S0e7jTkYD6ULaQ"
  },
  "wkfV8yJVYsnzzejQT-bS2g": {
    "date": "2/23/2015",
    "text": "Short Review: Beautiful restaurant & café area, stunning decor with good service. Go for brunch/lunch over dinner; book a week in advance for brunch (its popular). Order anything (recommend 'London to Marrakesh') and enjoy yourselves! Food is great, dessert is delicious. Wine dramatically overpriced, grab a cocktail. Mint tea over coffee, and if you are after shisha save yourself £10-15 and walk to Edgware Road. Great for a weekend day-time date.Longer Review: + Café: Really cool spot.  The afternoon lunch is great value for £22pp to be honest, as the food and pastries are top notch (can see the menu on their website). Great spot for meeting friends or a casual weekend date.+ Lunch (in restaurant area): Great value for money at £19pp for 3 courses, and nearly the same as the dinner menu. Portions are good size, restaurant is bright and bustling, and you can really see the beauty of the decor. Outside is great in summer.+ Brunch: I come regularly for the brunch, and for good reason- its amazing. You could have everything off the menu and want to try even more. I think their 'London to Marrakesh' set menu is a winner, and a nice way to start a fushion boozy brunch. Again, a GREAT choice for a weekend date if you want to impress. Dinner: Mixed bag for me, and did this last night (22/02/2015). Found the experience very relaxing, though the lighting a bit too dark on the outer ring of tables, my partner and I had to put the menus under the table lamp (no, we don't wear glasses :) ). + Houmous and Crispy Gambas (Prawns) to start; both utterly delicious to start with, and the bread with the houmous was mixed varieties of fresh warm yumminess. Also, I hate prawns, but I loved these. On the servers recommendation (whom may I say, are excellent) we had the Cous Cous Mechoui for two; slow charcoal roasted whole lamb was delicious and tender; cous cous was light and fluffy; but I wasn't blown away by the vegetable broth. Portion was MASSIVE, we thought we'd need to be wheeled away. It serves 2 extremely hungry 6ft+ men, or 3 normal people :D That said, I'm not sure it was worth £31 each (£62).+ Refills of mint tea was great (fragrant and sweet), but the coffee should be better quality for £2.75 in a high-end establishment, or ideally 'authentic' Maghrebian coffee, given the focus everywhere else on the menu for high-end authentic food. Whats wrong with doing a spiced Moroccan coffee?- I found the wine selection EXTREMELY overpriced, and really that is my only true complaint. I like wine, I don't mind paying for it, but the Marius Chapoutier (a blend) is on the menu at £29 a bottle, whereas I can buy it in any wine store for approx £7 including sales tax. Similarly, my 'go-to' grape variety of Getwurtztraminer (which is an excellent pairing for the heavier and spicier food), is down as an Italian varietal for £37 ( I can't understand not going with a true Alsace grape personally), whereas the same bottle is £10 in wine stores. I understand the wine markup model, my family are restaurant owners, but even I think this is a bit extreme, and lends to a feeling that its all a bit overpriced. The entire bill for 2people came to £128-£25 'Family' promo = £103.Credit to Momo's they do regular promos of £25 off dinner, and it helps. But they excel in the day, and I think they know. :)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6e3PuTV4CB_f5ugrxkfiZw"
  },
  "Vl05VOZVmCkG33pNyDt4Cw": {
    "date": "4/11/2015",
    "text": "Horrible, horrible service. To the point the waitress chased us down for only paying half of the \"included\" service charge. Avoid during busy times and spend your money somewhere else. This was the worst dinner out I've ever had. Plus my stomach is feeling horrible now.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0F7txmhUJko0gEzCq0BWFA"
  },
  "caYobtzCSdY4_B0ITBPbTw": {
    "date": "10/20/2014",
    "text": "I was really disappointed by Momo's as I'd heard good things about it.The food and drinks were ok, the shisha was good and the deco was fabulous. Unfortunately what should have been a lovely evening was ruined by terrible service. The waiting staff were slow, forgot to place our order, got our order wrong and gave us another tables order. They were quite rude about it all despite the fact we remained polite throughout the evening.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYGHZdoL32wUKz5kJfjP5A"
  },
  "YRCieTXn5drMcb7zjoSFCw": {
    "date": "3/12/2013",
    "text": "Momo is as cute as its name suggests and is definitely one of the prettiest dining experiences I have had. I went for dinner and enjoyed the ambiance of the eastern style lighting and decor. Momo is about atmosphere and feeling good to be there. I recommend a reservation because it can be very crowded on weekends and you may not get a seating otherwise. Even though we had reservations when we went, they had lost it and could not find our names anywhere. They decided that since it was their fault they would try to find us a table and in perhaps ten minutes we were seated.The Moroccan food at Momo is well-cooked and good quality. I enjoyed it but unlike the rest of my table who were loving it, I felt something was missing. Everything was certainly made with a skilled hand and my lamb couscous was tender and perfectly falling off the bone, yet I felt it could have had more flavour, more something that would make me love it. It was good but not great; so close!The appetisers were had were the cheese briouat with mint, which was good and the chicken bourek which was forgettable. The best was the zaalouk which was a lightly spiced aubergine dip which went really well with Momo's yummy bread, I'd recommend that. I think Momo is more about ambiance, feeling exclusive and being in a nice environment than the food and it lives up to that. The food was fine and I did feel that I was having a special night out, so if you want atmosphere, it's a good place to go.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PWOk9EXCeuwHAayusD8oXQ"
  },
  "HMNVDmHps273bWYP15ymXQ": {
    "date": "12/30/2016",
    "text": "FANTASTIC restaurant! The food was incredible, the atmosphere was gorgeous, and the service was impeccable. I had a chicken tagine for lunch and it was bursting with flavor! I would highly recommend this restaurant as it's some of the best Moroccan food I've ever had  (p.s. get the mint tea)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JfR9NTsOwfp93T6wtB2JtA"
  },
  "Ev3tUsXrrGY9asXzVlP5cw": {
    "date": "2/12/2016",
    "text": "Good Food and a fun place. Service was slow.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "awcEE_YG4oNPYl6DKF9uYw"
  },
  "vYD9mHmOSoQI1P32XDiF2w": {
    "date": "12/1/2014",
    "text": "Found the momo Restaurant by accident on thursday evening and asked for a table on friday. They were very nice and arranged a table for me.Gotta say the interior design is just magical. The morrocan/arabic theme is pefectly executed. And the staff was very nice. The receptionist even spoke german which was nice for us!The hummus starter was good. As a main we had morrocon chicken for two. The size was large so we had enough to eat but i gotta say it was nothing that special. The chicken was grilled very good but something was missing. Maybe a little spice, some more vegetables, idk. It was still good, but not 5*.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U-UsDjarFliIiT9LyilPhw"
  },
  "wYerJjXpi08Tc0Iv1gOVQA": {
    "date": "5/27/2013",
    "text": "Very nice Moroccan restaurant just off Regent Street. I loved the atmosphere, really Moroccan with the decoration and the lights. The food is really good, we had some starters and few main courses to share, among others you need to try the gambas in the starters menu and the chicken cous cous. Service is a bit slow, so it is the right place for a relaxed dinner, not really a dinner on the go. All the waiters have a lovely French accent and are very polite though. We were four eating, with 3 starters, 3 mains, some desserts and wine we paid c.£40 each, a fair price for me.Downstairs at night it becomes a Moroccan night club!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "jRAnL4nPczO2JvNvsTE8wg"
  },
  "DnPE-bpeVKZ6_rfUqlTCyg": {
    "date": "2/18/2013",
    "text": "I have read on Yelp and Tripadvisor that the food was perfect and the service terrible... Well... I had the dinner tonight there and everything was perfect, also the staff. I am a native French speaker and the staff is 80% also French speaking. So easy :-) ...I took some small morrocan starters, followed by a lamb tagine, then morrocan pastries. All was marvelous! It's a bit pricy (around 70£ per person), but worth it.I recommend to book and go soon, because as late you go, as crowded and noisy the place is.Seb Delcampe delcampe.net",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wiRPQHp5F15fosFfVbF6XQ",
        "caption": "Photo of Momo - London, United Kingdom. Me at Momo restaurant :-)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wiRPQHp5F15fosFfVbF6XQ/o.jpg"
      }
    ],
    "user_id": "ZuX0SujhMfbBKNCJBLP7yg"
  },
  "XN3Nma6ieX_x-QOYTFiCFQ": {
    "date": "12/3/2011",
    "text": "After the Royal Academy, I always bring friends here.This unknown gem is hidden behind thehustle & bustle of Piccadilly & is a sliceof Morocco in London. The wonderful,real mint tea, which they top up over & over,you can sit with for a long time & chill.The mother ship is the restaurant next door,which is more expensive, but a dream togo to as well in the evening.Apres visiter l'Academie Royale je m'enportemes amis ici. Celui ci est un bijou inconnu etcache derrriere bouscouler du Piccadilly etc'est une tranche de Maroc a Londres. Lethe a la menthe,rempli a volonte vous pouvezrester la longtemps tres calme.La mere est voisine prochaine, plus chere maisune reve a visiter dans la soiree.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GE-oEwtG1AcLOJwy999LKA",
        "caption": "Photo of Momo - London, United Kingdom. ... & in summer,outdoors too",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GE-oEwtG1AcLOJwy999LKA/o.jpg"
      },
      {
        "img_id": "OjfOd-DA5ZkSGENqgTtuqg",
        "caption": "Photo of Momo - London, United Kingdom. part of the lovely  interior: the lamps are for sale!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OjfOd-DA5ZkSGENqgTtuqg/o.jpg"
      }
    ],
    "user_id": "5yuHp8kydkGAu9WctLlCBQ"
  },
  "LVYk3A_fIT7QV4YREIjtcw": {
    "date": "9/14/2011",
    "text": "Momo isn't just a restaurant... it is an experience!  When restaurants take on a theme, sometimes it just becomes tacky, but if done right, it can be a wonderful addition to the food and gives you another dimension to the experience.  At Momo, it is not tacky at all.  Book ahead is my tip as it is quite popular, but make sure all the people you book for show up or you may suffer the wrath of one of the hosts.  The other host was understanding and very gracious...  the other, well let's just say it was enough for me to only give four stars instead of five...  make sure that if you are going to complain about customers, that you do it somewhere where they can't hear you.  Apparently he's never been stuck in traffic or been poorly...Anyway, the rest of the staff were very friendly and accommodating.  Always seemed to be in a rush, but were attentive when needed.  It is rather dark in the restaurant, had a bit of trouble reading the menu and seeing my food, but it did set a nice intimate tone.  It is also very loud inside, so if you are thinking about having serious, deep conversations, you may want to save that for another time.We started with the Briouats and the scallops.  I have to say the Briouats, especially the chickpea one was my favourite bit of the starters.  It was delicious.  Everything I wanted in one bite.  I ordered the Lamb Tagine.  While I don't actually know everything that was in it, I do know that it was delicious and so very filling.  The lamb was tender, the only thing I felt like it was missing was maybe some couscous...  there was a lot of sauce and I thought it a shame to let it go to waste.  One of my friends had the lamb couscous and the lamb... again it was cooked perfectly and was delicious.  I loved how they brought the food to the table and it was served almost family style.It was quite a long meal, but then again it is an entire experience, so if you are in a hurry, you may want to try lunch there, not dinner.  And there was a birthday celebration there that night...  the lights went off, a different kind of music came on louder than the other music before, and the staff started dancing.  They danced out with desserts with candles for the birthday girl.  It was wonderful and I felt like I was a part of the party =).It is on the pricey side... by the time we finished, we had spent about £40-45 per person.  If you book for more than 8 people, you will be asked to go to a set menu at £45 per person and they send you a booking form to fill out.  I will definitely be back again, although I would really like to try their Moroccan Afternoon Tea this time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIjIJxRZs5cCjwW9iJFzMg"
  },
  "-at1BSgeX9vvoY6fkMJFBA": {
    "date": "2/10/2014",
    "text": "I had the chance to have dinner here around 3-4 years ago and I can't wait to come back. Drop dead gorgeous restaurant - you feel like you've been transported to Morocco. Food is great, service is amazing. I love their virgin cocktail drinks!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgsOyGzjfZBT5xptutK5ew"
  },
  "MBfhdBzzcbOBimIfis2gWw": {
    "date": "10/4/2016",
    "text": "I am a big fan of Moroccan food. Momo is definitely one of the best Moroccan restaurants I have been to. Loved everything we ordered. Wished I could eat more. The restaurant is beautiful. The service was warm and friendly. The good reputation means the restaurant could be very busy, which made it a bit noisy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLClt3ly_SR9AZIgyJ7YYA"
  },
  "zmsQSLWR2OXJhxtzMNY_uQ": {
    "date": "9/1/2013",
    "text": "When I rate a place 5 stars its usually not just because of the food - it's the overall experience. I'll start with the decor and atmosphere as this is the real reason to go to this place and the reason why you should get a reservation before you go. As you walk in you are transported to a chic Moroccan oasis in the centre of London. Try to get seating on the sides with the couch seating as you might otherwise be seating on small Moroccan chairs which are interesting but not as comfy as the couch :)The food is interesting and flavorful. Both the apps and the tagines we got were terrific. Overall, must go! This is an experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KX5fGdXQ4B0vSfraPre9ag"
  },
  "lBOf_u5aPgbA0h6HNBiJUA": {
    "date": "10/3/2014",
    "text": "Momo is great. Seriously...what's not to love? The food is great ( I tried the halloumi and falafels) the cocktails were awesome (they even made me a white Russian even though it wasn't on the menu) and they do shisha!! And you feel like you're in Morocco.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "mirXMM4jklfi0KidOQ4QJA": {
    "date": "12/18/2013",
    "text": "I really liked this place~ the food is cheap and the hookah is good~ the Patio is GREAT! they have heaters for the winter time~ Tried the pigeon pastille and hummus~ it was my first time having pigeon and it was actually really good~ they did a good job making them into little pasties that masked any sense that you might be eating one of those birds you see on the streets~ I had the cardamon coffee~~ which was not as good as i thought it'd be~ but the mint tea was really good! with refills~~ Definitely would go back if in the area~ what i liked: 1. ambiance (outside patio) 2. mint tea 3. food",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7Z9pXB_KB9a3jUjtKln_A"
  },
  "-L0cNeuMdG4jaTq9XG3-cA": {
    "date": "6/30/2018",
    "text": "Very impressive, and I rarely give five stars. Wonderful atmosphere, sweet and happy folks providing us service.  Someone had a birthday celebration and one of the waitresses came out dancing Arabic to find music and minutes the entire place was clapping laughing and jiggling, having a great time. Our kids were photobombing the table next to us snapping selfies which was funny for both.  Waiter was patient and happy to take pics of our entire group.  The food was amazing: I had tangine (goat and pear maybe); we shared appetizers & wine.  Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlKsTielSltR5A-F9_T6MQ"
  },
  "eJnb0m2X6kl7z7o4AmMnhw": {
    "date": "10/21/2018",
    "text": "The absolute worst experience during our trip to London this week! My fiancé and I were sat next to a very large group of people who had obviously been drinking heavily but from the moment we sat down continued to get extremely loud and obnoxious. The restaurant was full and due to the fact of an issue with the tube that night and having to push out our reservation we really just wanted to eat and get out of there. My fiancé didn't even want to go there but after having a great meal and experience here about 15 years ago I thought after being in Italy for the past week it would be fun to have a different experience...Well we're were sat down next to an extremely loud group of about 12 women having a Birthday celebration whom were extremely loud which we just ignored because they were so drunk but than the restaurant turns up to the music extremely loud and the wait staff started dancing and singing at the table bringing a birthday cake to this table and this one woman who was clearly trashed started dancing right up against our table and just about knocked over a bottle on our table ....I raised my arm up to block her from hitting our table...we never complained as it was late and we just got wanted to finish our meal and get out of there. This extremely drunk woman starts taking our picture a few times (not sure why) but than makes a whole scene saying that my boyfriend has elbowed her or something...I think it was the manager for the night actually came up to our table to check and see if we were OK... Again at this point we just wanted to get our meal over with and get out of there. Thankfully the gentleman at the table next to us who were from the area just kept trying to keep us distracted and apologizing for the table of strangers as they were also in awe of the behavior and that the restaurant was allowing it. To top of the night the meal itself was horrible, neither one of us even finished our meal and the restaurant had the nerve to give us our $200 bill without even comping a drink for all of that chaos. The quality of this place is not what it used to be, although the woman who I believe was the manager for the night came over to check on us it didn't make up for such a horrible experience. I guess the other party must have been spending a lot of money so there experience was more important than the rest of the guests.I did receive a note when checking out of my hotel that the manager did call the next day to apologize but it was 6 am 2 days later and we were on our way back to NY.If you enjoy good food and a great dining experience do yourself a favor and do not eat here!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tqE2KJ8h9zOpdXtQ4WY0qA"
  },
  "6PsX6QAkvVNDwCle5sodlg": {
    "date": "6/11/2018",
    "text": "Such an amazing discovery in London!We were looking with my friends for a place to seat and have a tea/coffee. We were around Regent street and we found Momo cafe by walking through small streets. Quiet area with a nice terrace and not crowded at all!I ordered the mint tea with some orange blossom flavor, delicious! Good price for a nice tea!I have to go again to try the food now",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oj8RHeu2_I9hMmme8IbU4A"
  },
  "3XX7xVj2Ijvle_CHBgpEsw": {
    "date": "6/28/2017",
    "text": "Visited the cafe part of momo and I enjoyed the ambience and the drinks so much! The interior is like no other 'cafes' I've been to. Had the rose mint tea and it's like sweetened mint tea with some rose scent added to it. Very aromatic and warming. Also had their pudding-like dessert which was also quite good.",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mnnjttJ83VDogt9tXszbAg",
        "caption": "Photo of Momo - London, United Kingdom. The lights",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mnnjttJ83VDogt9tXszbAg/o.jpg"
      }
    ],
    "user_id": "7jmAvbN-jAuFDJNhyX0qxQ"
  },
  "ZKpqUl12p9_4e9RjyMT_IQ": {
    "date": "6/3/2017",
    "text": "We went for a friend's birthday dinner and had a good time. The food was pretty solid overall. We had the tasting menu, which came with a number of taster starters and mains, including chickens, sausages, beef and vegetable dishes. Their couscous was phenomenal, which went nicely with all the dishes. I'm not a big fan of African food, but I enjoyed the experience this evening. Service was good, though not the best. Whilst the servers were prompt in bringing out our dishes and drinks, there was some confusion with the restaurant manager regarding payment, which was a bit annoying. Ambience was very nice -- authentic and spacious. A good way to introduce friends to the cuisine.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "IqQOTVq4og6VhUJepDa36Q": {
    "date": "4/8/2017",
    "text": "I liked this place. We had a reservation for four people at 6:30pm and we got there a bit early so they let us in and told us we had the table for two hours, which was no problem.The drinks were good, food was excellent, and the service was just fine - very nice indeed. Also I liked the ambiance and it wasn't very noisy for a London restaurant - our group could talk freely and hear each other just fine! Also, the restaurant wasn't kidding about the two hours for the table. At ~8:25pm they came by and politely kicked us out (they really were nice about it!).I don't know that I would come back here unless I was in the area but overall I did enjoy the experience here. Try the Lamb Tagine - it's really good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5P3asDGDKc-rFPZSjTt5Eg"
  },
  "87Z1ZfHNG-BMMe88R5d_Ag": {
    "date": "4/2/2018",
    "text": "A real fun and different place to eat on a cool side street off of Regent Street shopping area.  The lamb was to die for and we loved the mint tea and sorbet as a compliment to our meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WthJPwm4XIpfqnnfXTSAEw"
  },
  "ABisdzYgjadSLwp6NrYk8g": {
    "date": "7/7/2017",
    "text": "Last night we celebrated my daughter's 15th birthday. We had a good variety of tasty Morrocan dishes. The food was absolutely delicious, the environment could not be better. A glamorous morrocan dance show was performed by one the staff members who brought the pre-ordered cake (£36) in her hands while dancing to the fascinating morrocan rhythms. They didn't have a list of single malt scotches. Waiter had to ask the bar tender but that's ok.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHRcfZKQvzsyGl13y2wx8w"
  },
  "yDiMruelOyKjGLxkZa7xNg": {
    "date": "6/21/2016",
    "text": "An authentic Moroccon restaurant, in heart of London, just hidden in a small road behing Regent Street. Excellent environment, music, style, atmoshere, interiors that make you feel that you are no longer in London. The food was really good, properly sized, with strong aromas like genuine Moroccan food. A bit over-priced but totally recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J2ZA3mUmNWMljZ5hyznLuA",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J2ZA3mUmNWMljZ5hyznLuA/o.jpg"
      }
    ],
    "user_id": "FnD5qaHuQjkzz6g-gtL2SA"
  },
  "7ijyekns6KpW3MsDZar9Lw": {
    "date": "8/25/2017",
    "text": "Had Moroccan chicken- perfectly seasoned and made. Highly recommend this place. Great ambience and service. Should also try Moroccan tea!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RV8UkRfufn9N9MrUEVFA2g"
  },
  "0eWSiO-RU1cAveVqHy-NwA": {
    "date": "4/22/2017",
    "text": "I have been to Momo three times now. Admittedly, this was many years ago. I love the atmosphere of the restaurant and would often take my girl friend their on her birthday. The most disappointing thing for me was I would buy the cake which would cost about twenty pounds. The music would go louder and the staff do a bit of a dance and go to your table be serve you the slice of birthday cake. Nothing particular unique but I like it. On both occasions though I had walked out with out them giving me the renaming slices of cake.  When I approached the staff about this the last time and walked back in the response was you have to ask for it which instantly put me off this place and I never returned after that. What made the situation worse is the name on the top of the cake slice was another name so they mixed my cake with another table and my girl friend noticed. When I'm paying about twenty pounds for a cake, Apart from that the food is excellent. I also recommended my sister to go but she did not like service and thought it was rushed and was with a group and had to rush their deserts to free up seats. She has never been back either. She Told me she was impressed with the good and atmosphere though. Same opinion as me but I wNted her to try it out because the restaurant has a lot still going for it if service could be improved.  They also had a nice tea place next door and on top of that a nice room to wait. Generally, what did it for me is the atmosphere of the place. It is just special and is different to most places in London and believe me when I say I like eating out and visiting nice restaurants. I plan to go back soon because I'd like to test the service a little more and see if they have changed. For this reason, this is not a fair review because I have not been their for many years but I wanted to share my views all the same. 3 stars but 2.5 more accurate",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqIKAQJZJWpiFvHcKyArRw"
  },
  "xDumGOPRlsQ7ZrAczA9hRg": {
    "date": "6/16/2017",
    "text": "The dining environment is pretty nice. The decorations made us feel like we were in Morocco. The wood pigeon pastilla is pretty good even though you can't really tell whether the meat inside is pigeon or chicken. The fish tagine is really really good. The fish is really fresh and the sauce tastes good. The portion of children couscous is huge. Momo cooler tastes good. It's like flavored virgin mojito. The service is pretty good but it's a bit pricey.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zCmJFijr8QWDN95rcCV17Q",
        "caption": "Photo of Momo - London, United Kingdom. Chicken couscous",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zCmJFijr8QWDN95rcCV17Q/o.jpg"
      },
      {
        "img_id": "AzD8fJz2UAAwOUk2wbA3HQ",
        "caption": "Photo of Momo - London, United Kingdom. Fish tagine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AzD8fJz2UAAwOUk2wbA3HQ/o.jpg"
      },
      {
        "img_id": "-jMIPIT6i-AZxjgfqTe5Qw",
        "caption": "Photo of Momo - London, United Kingdom. Fish tagine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-jMIPIT6i-AZxjgfqTe5Qw/o.jpg"
      }
    ],
    "user_id": "PW-FPm_fZ7spmknmvfriyw"
  },
  "vWypjAs6NTNXGOK5G1oWoQ": {
    "date": "4/2/2017",
    "text": "This is the worst place on Earth, very bad services, very rude waiters and waitress ! I could not even stay longer than 15 minutes!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-OsZ9tQU0WP3kcYyDXskjQ"
  },
  "9CEF6ZucQqQ4dVDliTAAqw": {
    "date": "3/14/2016",
    "text": "I came here with a group of my asian girls for lunch, it looks like a nice place and have always wanted to try it. I love Morrocan cuisine, and the ambience of this place felt somewhat plesant too.They refused to sit us inside, so had to make do with a cold outside, and also they refused to switch the heating on! You cannot sit outside to eat in Winter and not provide warmth, how ridiculous!! It took the waiter 5 attempts being told to bring the menu and another 30 minutes for him to come over and take our food order.Once the food did arrive, it all looked nice but tasted awful!!! It was just so bland, there was abolsute no flavour in anything!!! Also its very overpriced too. Once i complained the waiter or the manager did not care, they just completely ignored us because it was an all girl group. Complained about them being sexist towards us, other people got served a lot quicker than we did, and the way they spoke to us was very unplesant. We stayed for shisha, what a mistake that was, again took 45 minutes for him to come over, bearing in mind this place is practically empty for lunch, then another 15 minutes for them to change the coal, definitely not worth the hassle!! Go to Tibits instead which is opposite. After not receiving the bill, after telling him a million and one times, we went inside and paid and left with a mouthful to the manager who again just blinked twice and didn't acknowledge what had just happened.The staff in this place are rude, the food is 0/10, they hate all female groups, sexist and also found them a bit racist too, to be honestSpend your money elsewhere!!",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Im4q9ajz36xpu4nF0g3xlA"
  },
  "WiZ_cizaqzKbOa-_R7dw6w": {
    "date": "4/25/2017",
    "text": "Outstanding Moroccan food and atmosphere. I got the Momo grill which I highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdOIm6KssdRtfB-Gbo0sTA"
  },
  "NJ6dWV05DRUGWLfAnmSfvg": {
    "date": "7/3/2015",
    "text": "Tries this different kind of brunch - Moroccan brunch! Wouldnt recommend for those looking for a proper brunch experience, its much more of a Moroccan restaurant for lunch!! Food is good, yes definitly good, but not extraordinary nothing that blew my mind and i am a big fan of moroccan food. Honestly a little dissapointed considering i had very high expectations from Chef Momo, famous moroccan chef in france, even had a cooking class with him in Marrakesh.Very beautiful restaurant. Cannot deny that. We manage tk seat outside, they had the heaters on, little oasis of Morocco just off Regents street. Have had shisha once there before - as the decor is ideallic it does make for a great shisha place, but wasnt able to just order mint tea and shisha, had to get a glass of alcohol. Its fine if thats what you want to do but again i wish i could have just had mint tea.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pn5vbgkUkDXsdI44JjMLTg",
        "caption": "Photo of Momo - London, United Kingdom. My final course : berber pancake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pn5vbgkUkDXsdI44JjMLTg/o.jpg"
      },
      {
        "img_id": "4h3AM7GiNRGvH_BKL1FkQg",
        "caption": "Photo of Momo - London, United Kingdom. The boyfriend had the 1st  class to Casablanca menu, heres his second course : chicken tagine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4h3AM7GiNRGvH_BKL1FkQg/o.jpg"
      },
      {
        "img_id": "BnxHmIbkftJ_yOKDJm10ww",
        "caption": "Photo of Momo - London, United Kingdom. Second course : full moroccan breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BnxHmIbkftJ_yOKDJm10ww/o.jpg"
      }
    ],
    "user_id": "vqLOXI3OMXGswm09ijyt1g"
  },
  "zSEz872gMpve3QvqQsfMGA": {
    "date": "9/1/2016",
    "text": "really great food.  was a little apprehentious going in based on some reviews about staff, but our server was outstanding.  The hummus, gambas, and Hariri were all superb. upscale neighborhood, very nice atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bs38pX7muy_AP0UocLxkTw",
        "caption": "Photo of Momo - London, United Kingdom. chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bs38pX7muy_AP0UocLxkTw/o.jpg"
      }
    ],
    "user_id": "pSaH8TTmuT1EeH8-bhx3GA"
  },
  "lnYf4pn9xSbihsPZghB_gA": {
    "date": "8/21/2015",
    "text": "Great location. Very nice place. OK food. Pretty disappointing service. Not sure I would go again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cfQnlINTyNgKnRJlWi7jfg",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cfQnlINTyNgKnRJlWi7jfg/o.jpg"
      },
      {
        "img_id": "p9wUYjG-V2fuS7ZPE6cv5w",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p9wUYjG-V2fuS7ZPE6cv5w/o.jpg"
      }
    ],
    "user_id": "sx8x2Uwm1O1xDjwh_Ne1pg"
  },
  "TFBXivtUy8LTHX_Vcfe7wg": {
    "date": "11/30/2015",
    "text": "I went to Chez Momo with 6 French friends to celebrate a friend's birthday. We tried to spend a nice evening despite the date (13th of November when the 11th arrondissement of Paris and the Stade de France were attacked by terrorists). We shared a few starters between us. All of them were ok.As a main a few of us had the couscous mechoui which was a slow charcoal whole roasted lamb shoulder with authentic spices and ras el hanout spiced figs. The rest of us had the traditional chicken with preserved lemons, olives, onion compote and saffron. Both dishes were alright but not amazing. We didn't think we had enough sauce or couscous for the price we paid.Overall I didn't enjoy my experience at Momo. Maybe the condition were not the best but also the wine and food was overpriced. We had quite an expensive bill for something not that amazing.I didn't like the service either as our waiter was way too intrusive. Two of my friends liked that, but for the rest of us we were a bit annoyed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MqXPXgQPAMXGGo9FmZ6RqQ",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MqXPXgQPAMXGGo9FmZ6RqQ/o.jpg"
      },
      {
        "img_id": "6eRaudCN8Q5cRThcLiuACQ",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6eRaudCN8Q5cRThcLiuACQ/o.jpg"
      },
      {
        "img_id": "5s6-2-9tmS4pwEWHL-4Fsg",
        "caption": "Photo of Momo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5s6-2-9tmS4pwEWHL-4Fsg/o.jpg"
      }
    ],
    "user_id": "4HlLujEovUqZ2HVxRAZsHg"
  },
  "TFnXWQjXo8ektJTPHVlGHg": {
    "date": "8/17/2017",
    "text": "We chose to come to this morocon  restaurant and it turned out to be one of the best Morocon  cuisines we had in a while. We had the Bastille and harera  soup to start then the chicken tagine and  couscous for the main course. The traditional sweets were also exceptional. Definitely recommend this place. The service was good also",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eN-Vy37aJfP92yiDC6JEtg"
  },
  "9VK_jXBW1oMgyUgdNTwTHQ": {
    "date": "2/12/2010",
    "text": "Good food, lively atmosphere. A tad too noisy at times. The couscous was great.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JDcpFtUJPvlP-PunYDRuMA": {
    "date": "11/16/2008",
    "text": "stopped by for a late night apple shisha, and it was buzzing and friendly. didn't eat here so can't comment on food yet, but I've seen enough to go back and dip in. i do like the location though, close to Regent Street action and yet quiet.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_m9kmAO1w6XLdOf0EN2ow"
  },
  "V3AZRvfUK9XBUpXJjLLaIQ": {
    "date": "11/20/2008",
    "text": "Nice informal place away from the chaos of Regent Street to get a quiet mint tea of coffee to recover from shopping",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}