{
  "Eiw-G9uw7aKrJrol5zK7HA": {
    "date": "11/14/2010",
    "text": "I give it 3 stars because of the decor - for everyone who wants to test sit some fine chairs - and the cocktails - when they finally arrive on your table. The staff is clearly clueless and no one really feels responsible. In which bar or restaurant, do you have to ask the staff again and again if you could order something?Well we'll see what happens once the staff is working as a team and the owner starts taking care of the food...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwFJYsjHxuWtIOAUTQ4oCQ"
  },
  "7PCVvKw-e42ehqHrRn9h7g": {
    "date": "11/8/2010",
    "text": "I was lucky enough to be invited to their opening and from the 'udner construction' website had expected this to be a teeny tiny little place filled with flora and fauna, instead, to my delighted surprise, it was HUGE and heaving. Utter delicious carnage. Greeted with a glass of champagne that was regularly filled (naughty!), I perused the delights of the deli upstairs then mooched down to the kitchen for hefty canapes such as freshly battered fish and chunky chips, chicken satay, sausages with a piquant sauce, and focaccia burgers! Super tasty and exactly what I needed. Especially after one of their spiced apple rum punches with earl grey tea foam - it's fresh taste certainly belied it's kick! The space itself is HUGE (did I mention that already?) and there's plenty of benches and tables upstairs and a very long bar so your hopes of getting served at speed by their friendly and very attractive bar staff are very high! I like. I like even more the more cosy space downstairs, replete with high backed comfy chairs with round tables for a good old natter over cocktails with friends. But more than that, they have great (quality and quantity) ladies toilets. Perfect, they smelled divine as I walked in and the walls were a soft velvet. For a lady, there is really nothing better than a good quality, spacious, CLEAN, fresh smelling toilet - the dives i've been too with wet floors and queues to rival your filthiest festival would curdle your milk! The Folly is a misnomer to say the least, this is certainly no foolish or \"costly ornamental building with no practical purpose\". it's the perfect lunchtime/after work meeting place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "28nT7NJfaMupHwYOgCmZ7Q": {
    "date": "6/24/2011",
    "text": "The Folly is brilliant at the weekends when it's not heaving with city boys. Seriously, you can't move or hear yourself think if you go there on a week night. But at the weekend it is a wonderful place for brunch, lunch, dinner or just drinks. Very spacious with great decor and a lovely ambience. The food is extremely well priced and generous helpings. There's even a little deli shop inside. Love it!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ys1NuGZhVT6Qbunk8V_JrA"
  },
  "PZ5mmubc0hYlrySqQYh-9g": {
    "date": "1/27/2012",
    "text": "Oh The Folly. I absolutely LOVE the atmosphere and setting, the little plant pots, wooden boards and benches. It's like a piece of heaven nestled in the city- picture warehouse meets oasis.The food is good and the drinks are amazing. I always end up having a bread or cheese board and the Bouillabaisse.. yuuuuum! They've also got this cute little lounge area and a flower shop! My only issue is that every time I go I feel like they are understaffed, it takes ages to get seated and even longer to get servedbut I still keep going back, hmmm.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wViW41WyAL14lMPm81UeVg": {
    "date": "12/22/2011",
    "text": "I love this place, its so calm and relaxing. The interior is so cool, different to any other bar. I loved the food, such an amazing place. Excellent service, I would definetly be going back.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_ixxK_Shn1vTJMj4_kKAiQ": {
    "date": "5/6/2013",
    "text": "We stumbled on this place on a rainy Sunday morning when I didn't think we'd find anywhere open in the City for brunch. Love the decor. The staff were lovely and the brunch was just amazing! We both went for the Californian kick start and whoever decided to put all those things together on a plate deserves a round of applause! So tasty, so fresh. Just exactly what we needed after a long day the day before! Do brunch here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsEoivelRQcmbUsroDfoGg"
  },
  "zwnL8NwikFGcfln4XPZhfw": {
    "date": "12/27/2010",
    "text": "this place is great but it is absolutely heaving, it took me about 20 mins to get served standing in the crush at the bar. I would probably brave it again as my berry espresso martini was absolutely delish (fairly priced at £7) and made with real care and attention by the bartender despite the 50 billion people jostling for his attention behind me but not on a friday night before xmas and certainly not without booking a table first.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "S_BQvL2nLrey1jGcAnjerQ": {
    "date": "2/27/2013",
    "text": "creative menu and fun setting. a little pricey but the quality of the food and dining experience is high. i went for a sunday lunch and would recommend this venue for this meal.i really want to go back for a brunch!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rNwWsPFSVSG6nAS0Tk8VqA"
  },
  "rUWR0Vf1khRO9UiHzT87oQ": {
    "date": "9/16/2012",
    "text": "Great ambience with good tapas and fab cocktails, but more after work meat market than  restaurant.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xMTQnJwUzw33mOgAXyUNGQ"
  },
  "lVVBldWq3zOz_fgzGon6Sg": {
    "date": "1/30/2012",
    "text": "I agree with comments below regarding the decor and atmosphere of this bar, however the service on the weekends leaves a lot to be desired. 7 of us were seated together for lunch and set up 3 separate tabs, somehow this led to major confusion in the kitchen with meals on separate tabs coming out more than 20 minutes late. We had the service charge removed from our bill but service didn't improve with single drink orders taking another 15-20 minutes when there was noone at the bar (plus service charge). I would recommend The Folly for drinks at the bar rather than table service.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2S7qf77N2LBTjl2nHYkoVg": {
    "date": "9/13/2013",
    "text": "Extremely Disappointed. Booked Folly for whole office celebration drink as recommended by friends. The reception lady booked the area right to the entrance on ground floor as I requested (my 1st preference was semi-private room on the right but it was already booked). We pre-ordered food and drinks days before. But on the day at arrival, we were told our preferred area wasn't booked as they never locate a specific area at time of booking (clearly self-contradictory vs semi-private room booking) and the only available area was the very inside corner downstairs. It is a dark hot and very noisy (next to speaker) / worst corner! What's more, we were told our pre-order wasn't received and we will have to wait for 1 hour for the new order served. All these totally spoiled the celebration spirit and some colleagues have to leave hungrily as they cannot stay long. It is extremely disappointed esp. considering we have been looking forward to this celebration drink for whole week's hard work! Will never ever come here again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQ7ZbAAUDBDZCTllQG2uqA"
  },
  "SmLnG3L4a8Bfh6zOl0ElvA": {
    "date": "2/15/2011",
    "text": "The pictures of the Folly look really nice, so I imagine it'd be a great place to have dinner on a weeknight or lunch on a weekend. Comfortable. Spacious. Contemporary.But I came on a Friday night at 10pm, having already got drunk at a pub in Canary Wharf and not really realising or caring what I was going to be in for once my colleagues steered me toward a bar in the City.It was dire. And I couldn't even see the decor amidst the crowd.Think alcohol-fuelled sexual desperation of miscellaneous City colleagues playing out all around you. Think awkward impromptu pockets of dance parties around handbags. Think expensive and unimpressive drinks.But you'd get this at any City bar at 10pm on a Friday night, so I'd be unfair in giving it two stars. The toilets were like a tree house. I'll give an extra star for that.And there you go. That was my experience.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "w8UrqLax2XbTX12rPACkVQ": {
    "date": "1/24/2011",
    "text": "This bar is giving me a case of split personality reviewing. On one hand, this looks like a cute foodie outpost of an Anthropolgie (and likely a sister restaurant to the Anthologist) with a Sunday roast that could feed an army for a reasonable price but on the other it has service that rivals molasses that's been in a freezer next to Han Solo after that carbonite incident. If you've got a lot of time on your hands though, the food is worth the wait and is served with a bit of flair to match the surroundings. The roasts are served family-style, so you'll need to bring a friend to take advantage of the big roasting pans filled with veggies and meat. To be fair, I'll still probably recommend the place but some elements shine brighter than others.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "hucJ_UgXh1w4ihwK8u58xg": {
    "date": "4/23/2014",
    "text": "Had the california salmon salad which was quite good. Not a very fancy/sophisticated restaurant, but decent food and an extensive wine selection. Pretty full at lunchtime, could be even livelier after work and on weekends.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTrAqc836rxTS3NBwrk-rQ"
  },
  "-_j6ISG_1UH5w2WQ7llolg": {
    "date": "9/10/2014",
    "text": "We went for a work lunch. The place looks amazing and a good location! The staff is really helpful and nice. However....the food was sadly less than what it promised 'fresh, seasonal, British'. My linguini were over cooked and a colleague had to send back his steak, the Thai curry didn't have enough sauce. All in all a nice place but too much money for what it is!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iHAX_HhxZwAeo1eDCh9erQ"
  },
  "mQq0tK_rIueulHtmcPONTQ": {
    "date": "11/14/2010",
    "text": "This could be such an amazing place! The decor is wonderful, and thought through with a lot of taste. Beautiful design furniture, NYC-esque volumes & industrial touch. You feel cozy at the Folly. There's a little boutique in the corner that is very cute. So there's clearly some magic in the air, but it quickly fades away once the very poor service and average food kicks in. Very sad.I wouldn't recommend for a meal. We tried it for a sunday lunch, and we had mixed feelings. The service was hectic, slow and kinda random despite very few customers there for lunch.Food is similarly disappointing. The burger is served on a tiny wooden board, between 2 very (very) thick pieces of chewy bread. The parmesan/rosemary chips were super greasy and the strawberry cheesecake is a cocktail but listed in the dessert section. To be fair, some of my friends likes their meal. The linguine and the chicken/pasta salad seemed nice - except for the presentation: why would you serve the salad in a take away box?The cocktails were great. The barman is clearly a clever guy.All in all, a little disappointed. Mixed feelings about the whole thing. I'll probably go back and give it a second try. Maybe I was just unlucky and it would be better suited for a relaxed dinner evening :)",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "_dCc-tKxHrXd54oYqmQhng"
  },
  "zC9VCAhy3yOk7y4AUgsNGg": {
    "date": "11/5/2010",
    "text": "This is a vast, very cool new bar-restaurant-club in the Drake & Morgan chain.  It has a very modern open layout and they have tried to create a city garden inside and out of the rain.  There are two floors each of which has multiple levels and little nooks where you can enjoy a glass of wine, a beer or something from their extensive menu.  The cellar has more of a city-club vibe to it and the whole place just feels right.  The location is very convenient being opposite Monument tube and very close to both London Bridge and Liverpool Street stations.I'm going out on a limb here by giving this four stars as I was lucky enough to be on the guest list for the opening party yesterday and so we'll have to see how it develops over the next few weeks, but it's distinctly possible there will be another star going on this review with an update.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "TNwuL7ZrcRtfTP5I14yXtg": {
    "date": "11/27/2013",
    "text": "I walked past Folly several times always wanted to go in to eat or have a drink, because looking from outside, it is such a lovely space. High ceilings, fun decor and casual communal table with benches. I was finally there for a goodbye drink last night. And I was duly disappointed, no so much of the place or the drink but of the services. I waited literally for over 15 minutes just to get a drink and the bar wasn't that busy. There were quite a few barmen behind, but for some reason, they won't take my order and I had to wait for the guy who was taking forever to make two cocktails. The drinks are relatively cheap here if you can get someone to pour one for you. I am not going back for sure.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6Yh_hwYzqnt4EzSiCqJDQ"
  },
  "1VxmKu71ZVsBOaI7EG1Tgg": {
    "date": "1/30/2011",
    "text": "The Folly offers five star atmosphere. Thomas A. had it right: if Anthropologie had a restaurant it would surely look like The Folly. With flower pots as light fixtures and gorgeous colorful prints throughout this place is stellar. And the bathroom? Amazing. Seriously. Check it out if you go.We came here for the Sunday roast after it was recommended to us. We were warned that the service was slow so be prepared to wait. So I figured I would book a table for noon, the time they started serving roast. We arrived a bit early but we were quickly seated with a smile. When the server came over he was really timid and almost intimidated by us and it kind of made the whole exchange awkward. He didn't know when the roast would start being served and after finding out when he failed to give us the menu so we could at least put in our orders. Oh well. I did order a coffee and a pastry to snack until it was time to order lunch. When my coffee arrived it was lukewarm. I'll forgive you a lot of things but not shitty coffee. After we had our snack I got the server's attention and we got to order our lunch. They serve the food family style and a minimum of 2 people have to order one of three choices. We went with the roasted chicken. Our food came out fast (was it because we were there early? was it because the place was better staffed? who knows but I say 'yay!') and we dug in fast. Sadly the chicken was dry but thankfully we had gravy so that saved it. But the roasted potatoes and leeks were FIVE star. Seriously. Best roasted potatoes I've had in a long time. And the leeks were cooked in butter. And we all know butter is good for you, right?We left with very full bellies. My husband was only disappointed with the dry chicken and I was still cranky about my warm coffee. A second visit is necessary before I can give it the 4 stars I think it's sooo close to deserving.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M3jx1i97WRVMK8x4JiKt6A"
  },
  "7gHNpgoMvS4Yux6iLExpuw": {
    "date": "6/12/2013",
    "text": "Steak and fries were good. Peroni on tap. The place has ambiance. Comfy seats downstairs, background music is just that something humming away in the background and the service polite, unobtrusive yet attentive and pleasing. I've no complaints and would certainly revisit for a luncheon with colleagues or, if I get lucky, a lunch date.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0qfFi8DGE4K4JlCbBcYPQ"
  },
  "fVbJOhIksLZJbCLXuyL9Qw": {
    "date": "1/23/2011",
    "text": "Heading here for a Sunday roast with four friends, I was starved. I needed food NOW! Unfortunately, I perhps came to the wrong place for food to arrive in ANY sort of appropriate time.The decor was very nice, something like Anthropologie would design. The cocktails looked fab, and any place that allows me to calorie count while still sipping some amazing looking cocktails is clearly my friend. The food, when it FINALLY did arrive, was very very good. I had the pork belly roast and stuffed myself past the point of full. At £12.95, it was slightly less than the average roast and had a LOAD of food. I heard the beef roast was also good, but the fish and chips quite oily.Really, If I had loads of time, I may come back here for a roast, but seriously the waitstaff are a bit scaterbrained and distracted; It took nearly 20 minutes to get a green tea...What, did you go all the way to China for it?So...yeah. Decent, nice but not for those in a hurry or exceptionally hungry!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "Jg9xoqw-S7cVk2_SmKD88w": {
    "date": "2/15/2011",
    "text": "A colleague took me here for lunch when I was visiting London.  It's a big, interesting, space... multiple levels... very whimsical.  Overall, a cool place.  I don't have much to say about the food b/c I only had the fish finger sandwich... very simple- 3 skinny, fried fish pieces, lettuce, tomato, on sour dough bread with a side of tarter sauce.  I didn't enjoy it that much but I also wasn't feeling well.  And the service was slow... we had to flag down our waiter to ask for the bill... as did the table next to us.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pRoVwbziQXCrGj3LWTq3Sg"
  },
  "vdA0W8nst3An4uSXQP035A": {
    "date": "5/25/2015",
    "text": "Wish we could have actually tried eating there.  The sign outside says for Saturday and Sunday - \"open late\".  We tried for Sunday - used their online reservation form to make a reservation for 6:30 PM.  First issue is that the reservation system is a fake wanna-be reservation system - all it ends up doing is sending an email to the establishment.  Second - they dont bother to respond.  We decided to take our chances and walk over anyways to find out that for them \"late\" means 7PM.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGn3VNoW9AQVHOrNgoeYMw"
  },
  "XpE75S6ofPhf75mRHAdgag": {
    "date": "2/18/2013",
    "text": "Agree with other reviewers about the ambiance and service. The food is ok but nothing to write home about. Really love the decor though!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cue1uXN_0nIQGX-4J7b_BQ"
  },
  "O_Iu__3acI4qmsf6mprK9w": {
    "date": "8/17/2011",
    "text": "This place is absolutely amazing! Went back there on several occasions always a great service and such a fantastic environment! As everyone else mentioned the size is spectacular and the interior is just stunning, food is lovely, maybe a little dissapointing on the desserts side But really really worth a visit! I never been here on a weekday, I do imagine it gets extremely busy, so if you are not a fan  visit on a weekend, due to its location it is very quiet and relaxing place to visit on Saturday/Sunday!",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "L4O7CxD7dg1DN9SGHbFfeQ",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L4O7CxD7dg1DN9SGHbFfeQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "YFDtfhkkxa9GPvZaBTehgQ": {
    "date": "4/3/2012",
    "text": "Been here twice with colleagues and think the food is a bit overpriced for the quality you get.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5u8TVJ6UH1WM-BP1gd3rYw"
  },
  "LLYPrPqRrjdhz3UzR-ihMQ": {
    "date": "9/4/2013",
    "text": "Great atmosphere, some chit-chat could be heard here and there and lots of interesting decorations around. Food is definitely above average and the service is as good as it gets. Maybe that's the best aspect of the place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7ZgGrDpD41_4cneDqgisyw": {
    "date": "11/6/2010",
    "text": "Open for breakfast, brunch, dinner and with a late license until 1am on Thursdays and Fridays, a mixology table, a flower shop, a deli, a secret garden, an evolving pop-up shop providing guests with something current, seasonal and fun to explore time and time again and more: there's a lot going on to suck the cash from City Workers here at the newly opened Folly. It's a huge and attractive space and will be an interesting one to watch to see if it succeeds or is indeed an actual folly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "heN7OZBr3IngQu0nUMtQHQ": {
    "date": "11/12/2011",
    "text": "One of the most unique, casual decors in London. It offers delicious light fare from local and organic sources.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MXjXtnu-4PfzqpuAR6KubQ"
  },
  "SQqe66eFTys7mX5z3yRnoQ": {
    "date": "11/17/2010",
    "text": "Been meaning to visit here ever since I saw the building work going on a few months back. Finally got the chance last night when I met a friend in the Bank area and we needed a bar that did food. First impression is a 'wow' at the size of it - it has a couple of floors and tons of space for drinking and eating. The decor is 'fresh' lots of wood and green colours def. has a garden feel about it. We headed for the basement bar as the tables with big comfy chairs looked cosy enough to stay all night in. Once in the bar we spotted a large private dining room (didn't get a chance to ask if there is a fee/minimum spend for using), but one to keep in view!. We ordered food from the bar (I believe it's table service upstairs). I had a crispy duck salad, which was superb - a generous amout of duck and tasty sauce, great value at £8.50. My friend went for the fish pie which she said had loads of good quality fish in it. My friend also commented that the ladies toilets were really nice, when I went in there I agreed, lots of cubicles, space for make up and nice soaps/hand creams. I met another lady in there who claimed 'these toilets are fabulous!' how many times do people say that?! We did have a little hiccup though, when a waiter cleared our plates he knock over our bottle of wine. Despite losing most of the bottle, and it covering one of my trouser legs and my new coat, when I asked for replacement wine he refused. I kept asking (eventually asking to see a manager) but didn't get anywhere. It was an accident but still, that was £15 worth of wine!. I eventually caught a manager walking past and explained what happened. He offered to pay for the dry cleaning on my coat (but I wasn't too worried about it) I asked him to replace our wine and he immediately brought over another bottle so we were more than happy with that. I think the poor waiter was worried he would get in trouble but accidents do happen. Overall we had a really great evening. We could hear a DJ playing upstairs so I think we will be back for dance! One last thing, my friend was reading 'Stylist' magazine in the bar and they actually had a half page review of the Folly bar in there, so if its good enough for them... Recommended for dates, groups of friends and work events.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Y2AHAsHbdASYYAoQDwat7A": {
    "date": "1/30/2011",
    "text": "I read a review abou this bar and was keen to try it however the website made it look quite small and cold so when a couple of weeks later i happened to stroll passed it enroute to Liverpool St I had to go inside. It is an amazing bar, you feel a million miles away from the hustle and bustle outside, the huge windows allow a huge view and open feeling.The decor is very modern and chic its very well done, everything flows and works well. The stye is spot-on and the atmosphere is friendly and lively without being too cool. The crowd is mostly young.The drinks list is very good with skinny cocktails so perfect for a guilt free drink or two. The food menu is nice too more for nibbles than a posh meal.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9MylHfnO-OnYhY19hf_tQg": {
    "date": "5/14/2014",
    "text": "The Folly won me over with their website. It promises fresh, delicious food in a nature-themed setting. Sadly, there's too much The Folly got wrong. For starters, it's the bookings. I called twice and The Folly messed up my booking twice. We ended up sitting in the waiting area, which is lovely for waiting (comfy seats) but horrible for eating (low tables). The food was very 'meh'. The ambiance was also 'meh'. It feels too spacious and oddly arranged, so you never really feel comfortable at The Folly. A friend of mine went to The Folly for drinks and liked it, so maybe that's what it's good for...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "adM7hulS_uQnMAkGj8XkCA"
  },
  "HEg0LddLaSn5qvEdZ9PM7w": {
    "date": "8/16/2015",
    "text": "When we went it was pretty busy. So the staff did pay that much attention. They forgot to bring my friends mimosa. They didn't charge her for it, but it was still disappointing, because they remembered everyone else's drinks. The good was really good but over priced. Normally j wouldn't mind the extra cost because I'm paying for the service and the atmosphere, however they were short staffed and only came over twice, on top of forgetting the drink. There was one saving grace, the amazing bathrooms. I could live in those bathrooms.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mhCTxyE2OPkIyEdo6liHAQ"
  },
  "DUXOO1gQMPoEp9tDQhGHHQ": {
    "date": "6/8/2015",
    "text": "Went for a Sunday roast a couple of weeks later and was so disappointed! The food was very mediocre and some lukewarm with hot vegetables. After wanting to experience a roast here for a long time, I was so unimpressed!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S771b84rRUVnRRFy1fIBcw"
  },
  "g9GyaHY0DSMsfEDE4ObIkg": {
    "date": "11/20/2013",
    "text": "Massive, dark, modern venue. Restaurant and a few different bars upstairs. Bars and lounge/booth seating downstairs. So, you know, EVERYONE WHO WORKS IN THE CITY OF LONDON WAS THERE. Crowded and noisy, I was supposed to be there for an alumni event but couldn't find anyone and couldn't hear my conversation with the people I did go with. Sort of a middle-aged crowd. If you're not dressed to match the Suits, you might feel underdressed. Just a fair warning.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nAuQZcGovK7e11oELfITDw"
  },
  "vPr9wCAqbTxHBiCAaqqj_g": {
    "date": "3/20/2013",
    "text": "Mixed feelings... Very slow staff and poor service, chewy steak sandwich and draft-y table.But super sweet potato wedges, great atmosphere and cold beer....Felt that it was a little over priced for what we had, but will try again as the next tables flat breads looked more tempting...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "85ZAzjury7SQOa1vTz669g"
  },
  "PfdICgk8wDXiZFj4V-qNxg": {
    "date": "2/22/2015",
    "text": "Went to The Folly for a few drinks on a Friday night. It was nice and busy, spacious, and had a good friendly atmosphere, making for a good time meeting people and having a lively chat with friends. Downstairs is very crowded and had an overly crowded club sort of feel. Drinks seemed pretty expensive too (even for central London), but we did at least get some nice glasses with our gin and tonics.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EHcSx68_1nekwmsuQnYELg"
  },
  "SlomXdB1ryOAsa5ijtogUQ": {
    "date": "2/3/2013",
    "text": "Gaa! Expensive drinks! But it makes up for it with a lovely environment. I liked the songs that played there and the crowd that hung around there as well. There was almost a fight - but they talked it over and it was fine. Love it when that happens. The music is a bit on the loud side but if you find yourself a cubby hole slightly away from the speakers you can hear yourself think.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kwmToyRa85G49WxbsYB1Aw"
  },
  "g5f9Gz9IX5cxBhmVzy9Yhw": {
    "date": "8/1/2013",
    "text": "Truly disappointing. The place is crowded, but I don't know why. The busy waiter was really charming and did his best, but the place was not worth his efforts. We had some fun looking cocktails and some bubbly. All acceptable, but not outstanding. Another niggle: The bread did not come with enough oil and balsamic vinegar. The \"Roman\" chips where meant to have Parmesan and truffle oil on it ... Both were only visible if you bring a microscope. In top if that my burger was basically burnt to a crisp ... And that's from someone who normally likes a medium burger. My friend was complaining that her flatbread was as try as shortbread. For that amount of money it was rather disappointing.Also the music was so loud we had to shout  at each other the whole time. Not going back anytime soon.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWAOEhPe-us-ScMTSF6nSg"
  },
  "2KIU-5TGIZ5DQri_Hc9M7w": {
    "date": "7/10/2013",
    "text": "Big restaurant / pub on two floors next to house of fraser. The atmosphere is really nice, it is garden inspired (but it is an indoor restaurant)...I have been here for a team lunch and we ordered some really interesting food...I had a plate with hummus and other \"Mediterranean\" stuff, but my colleagues ordered cheeseburgers, steaks and filled flatbreads...the food comes in a nicely presented way, with wood trays. Service is not superquick, but not disappointing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRAnL4nPczO2JvNvsTE8wg"
  },
  "KNqRaXE7ZhLQQnere07DZw": {
    "date": "4/26/2013",
    "text": "I know what people say about having mixed feelings because I went here twice thus far and my first experience was great.  We threw a party there for a goign away for a friend and it was great-we had our own bartender which was awesome.The decor is funky and cool and on a Thursday night this is the place to be--music, people,and fun times.  We found a quiet area which was great since we wanted to chat and have the flourless choc cake with ice cream and champagne/scotch.  If this place was a bit more reasonably priced I think i would be more down to come by more often but for a change and a whole party scene, I would come back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "RAg_-bJXWT38axS9l6y1Qg": {
    "date": "9/28/2012",
    "text": "I love the folly - the decor, the food, and the place.I'd been once for after-work drinks and nibbles , and breakfast.But came here for lunch today. Bit of a mixed bag really.Bad Points:Came to join my friends at their pre-booked table, and was told they werent here yet. So I was sent to their table to wait for them. Meanwhile they were upstairs at a different table and HAD arrived. I was told they had come in a different entrance. Not really a good excuse when its my lunchour and I'm wasting time.The food was cold-ish. Nothing was piping hot and it seemed like it had been sitting around. Poor.The sauces took ages to come/never came, and were served in mincule saucers. they need bottles, badly.The lunch food didnt taste great. Quite bland even.The evening niblles I had whilst have after work drinks were better - very hot, and much more tasty.Serving sizes were small, considering the prices.Good Points:Everything looks amazing, from the decor, to the presentation of the food, even the staff were presentable and bright eyed.the pop-up boutique is so cool, and the florist is stylish too.Its going to be a drinks only venue from now on I think....But I'll still come here because it is local and very beautiful.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rP9_0g3ciAFN-LW5eZKihg"
  },
  "_WdCvAIrEheYVMt4dgQqew": {
    "date": "8/16/2014",
    "text": "Stepping into The Folly is almost like being in Meatpacking District in New York, with the large space and high ceelings. If you are looking for a place with a bar, restaurant and also somewhere you can dance later then this is the spot for you. Although during a weekend night you can not be sensitive to really loud volume from both the music and the crowds of people when you are eating. A cosy dinner for two - forget it. But to start the evening with some friends, then it´s a cool place. I like the different areas in the restaurant - one part looking like a kitchen, another like an outdoor garden with lamps in the trees and the third larger part is in an open space. Downstairs is almost the same area with a bar and tables, dance-friendly on a Friday night. (speak-friendly ... well, if you don´t mind shouting). :) When it comes to the food it´s hard to review as I \"only\" had the Salad Nicoise, but it was really great and I just loved the mustard sauce to it. Never had that combination before and the strong mustard was so great to the tuna. The tuna pices were perfect as well, medium fried (not to dry). The only thing I would have wished for was Champagne on the glass. Now they only had cava on glass and Champagne on a bottle. In Sweden (where I come from) and also in New York all restaurants offer a glass of champagne.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBQCzIli7GSa7wCfNfjMZQ"
  },
  "yDsYfboHzNKtWRc4MNRPuQ": {
    "date": "9/26/2011",
    "text": "Ok, the 2 stars is for the cocktails...of which it took us a loooooong time to get.In fact, everything was slooooow in this place & I was ready to eat my own foot by the time my food came.Shame because the decor and ambience is adorable and cosy but the service here is not for those who want to eat on the same day as the food is ordered.",
    "rating": 2.0,
    "rated": {
      "useful": 8,
      "funny": 9,
      "cool": 8
    },
    "photos": [],
    "user_id": "_V2BZA6ZKxSM6J9wTBszkw"
  },
  "d06ltZf9vo-PPKHO8ctDnA": {
    "date": "12/21/2011",
    "text": "If you work in the City, then you'll love this place - it's quirky and different enough from the vast array of identikit bars and pubs in the Square Mile.If you don't work in the City, you'll like the decor and layout, maybe you'll like the food if you do eat here, but you'll have to refrain from straight up punching some of the arrogant City shits in the face. It gets so busy in here. And with the wrong type of people for me.Maybe it's worth coming at the weekend when it'll be quieter. And less full of twats.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "2g6K1NsSLDG_j8TNojFaNw": {
    "date": "9/20/2012",
    "text": "I came here for lunch with a friend  on a gloomy Tuesday, and we sat downstairs. It was fairly empty down there when we arrived, and we got a nice table with arm chairs - the chairs and table were just the right height and it was surprisingly comfy to eat in them. The decor is right up my alley (so to speak), quite eclectic and playful. There are lots of different styles, but all work really well together. My favourite bit was the girls' bathroom. It was vast! It had a huge amount of cubicles, an interesting trough-like wash basin and even trees growing in there! The wallpaper is velvet and so tactile (Although I wonder who else has been touching in in the loo!) and there is plenty of room for mirror and gossip time. We did have lunch there, and it was perfectly decent. My friend had the fish pie and I had the duck salad. Both were very generous portions and neither of us left in any way hungry! The service was lovely, but sporadic because it seemed they were short-staffed. We had to flag down waiters and waitresses who were really running about and not wearing a discernible uniform (embarrassingly this meant we accidentally flagged down a random customer instead, twice!) They hunted about and found us a blackberry phone charger, but took about 10 minutes to bring tabasco sauce. I would definitely go back here again, and I suspect that it may be even better on a Thursday night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kwz6LPHSIlHxN1SaNjiEIw"
  },
  "_HZPUMXyMtz8SIbpOKaMjw": {
    "date": "9/29/2014",
    "text": "Aesthetics at The Folly are top notch - from the beautiful high ceilings and quirky dining area to the presentation of the fish and chips this place looks stylish. unfortunately as far as the food was concerned looks are very much all it had. The starters of prawn skewers and chicken satay we bland and tasted barley warmed if even microwaved served on cold plates. Not a great start. The friendly service however encouraged me into a false sense of security that perhaps he mains would be better. Wrong. The fish and chips (as I said before) looks fantastic - however the heavy/under cooked batter masked any taste of fish. There was no seasoning used on any dish which left me with an unpleasant heavy oil slicked mouth and light wallet for the pleasure. We were genuinely disappointed. Go for a drink to enjoy the venue but give the food a miss.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMJZspNXtNpcArkFy8WNRg"
  },
  "GdIG7F3WwLDplPPayLzoyg": {
    "date": "7/20/2012",
    "text": "Food is nothing special. Drinks are ok. No happy hour though. We had the worst experience here for Christmas Dinner. The food was terrible; the meats were overcooked and dry, the cheese plate was stale and the veggies were soggy. Not to mention they brought the veggies out after we finished our main course. The service was just as bad. I've never had a good experience at The Folly with food. The wine is good but that's probably because they don't make it themselves...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Wlh8B7EbUB3lQXQOGa0KA"
  },
  "bAt-eSXCNyI0CRNtnLRNQw": {
    "date": "7/17/2014",
    "text": "Beautiful aesthetics abundant at this fab restaurant/cafe/bar.  Subtle colours with touches of luxury, very try's chic.  If your in the area a fab place to go and just have a coffee as it beats the chain coffee shops in it's lusciousness of decor.  The staff are super friendly and efficient.  Chic down to the last detail even in the ladies loo's, lol.  I made a special visit just to go to this place and I was not disappointed, oh yeah I'd make the trip again. Xoxo",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "23BfvNiCUERIKFu3w7ljUg"
  },
  "xKpoxPLY1hqckLX_oBj-xw": {
    "date": "12/15/2011",
    "text": "Stop #11 - Monument I've been to the Folly many a time, not the least because its quite literally the only place open on a Saturday in the area. With B@1 now open I hope it gives some variety but I'm not sure when it opens on a Saturday and its even less like a crawl location than the Folly. Not too much more to say here. It's a bar, you get drinks, the bathrooms are downstairs, and the food is good if wannabe gourmet. I will say DO NOT get the steak sandwich. It's literally a piece of tasteless gristly meat between cold tough bread.Drink of choice: Sambuca shot. Just cause they serve black sambuca.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "kA9qbqAzzNJpJBYzHkKp9w": {
    "date": "7/31/2011",
    "text": "I can imagine that on a weekday The Folly is my worst nightmare. It's the kind of bar that could just be completely overrun by bankers. Thankfully o a weekend they are nowhere to be seen.Cocktails are adventurous and well executed here. The bar staff are friendly and on a Saturday night it isn't too busy. There is room to move around and breathe. It's really quite a cool chilled bar.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tV2ZQSVYo-AiKSrUaLXTIg"
  },
  "8GCkw76FO33U2gd7-Muu5w": {
    "date": "12/29/2013",
    "text": "Why is Sunday Roast not a thing in the US??? Best meal I had in London. Hands down.Went here for Sunday Roast per a friend's recommendation, and I'm so glad I did. The service was fabulous (even walked away with some suggestions for other great places), the clientele was cool (chatted with a few locals), and the ambiance was just what I like. Modern and open but still somehow cozy.I ordered the pork belly roast, which came with au jus, stewed carrots and red cabbage, also a small side of lemony dessert, which was delicious. This was also my first time having Yorkshire Pudding, which was flaky and delicious and I sopped up a lot of the juices with it. Also had one of the special cocktails (something with spiced rum, spices, coffee, and kahlua), and it blew my mind. Super spicy and super tasty. I ate everything they set in front of me, even the big knicker-bocker glory that this Harry Potter fan was simply unable to pass up (remember Dudley having one at the zoo?). Prices were appropriate.When I go back to London, I will definitely be having Sunday Roast at The Folly, and I recommend that you go too.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XF9JAMOHYvaIrNTXZZeBuA",
        "caption": "Photo of The Folly - London, United Kingdom. Knicker Bocker Glory. Wanted one ever since Dudley Dursley had one in Harry Potter and the Sorcerer's Stone.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XF9JAMOHYvaIrNTXZZeBuA/o.jpg"
      },
      {
        "img_id": "5jbk0xwjeoHkwAtNsIqXMQ",
        "caption": "Photo of The Folly - London, United Kingdom. Sunday Roast!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5jbk0xwjeoHkwAtNsIqXMQ/o.jpg"
      }
    ],
    "user_id": "FzMhWsLqyQbNq-7d--o4sw"
  },
  "Au9qEnCCuBXLoMSfVB4xwA": {
    "date": "11/10/2016",
    "text": "Beyond crap. So elitist, tried to sit us downstairs and then at the worst table. Pathetic. Don't do it to yourself, very passive aggressive.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ssnc-d7-ZV1-KUqFC27Nw"
  },
  "l--2gkPkTY84ygVAVzjVow": {
    "date": "5/14/2015",
    "text": "After my third visit here (and fifth to one of these chains) I figured it was time to write a review. I've had brunch, lunch and drinks+snacks here so have covered all my bases...Food is generally okay - I think the brunch fared the best of the food I've eaten here. They have a bizarre habit of not cutting up foods that go on salads - friends have received both lobster salad and tuna salad in this way. More weird on the former but an odd choice on both. The cocktails are always good and a bottle of wine is reasonably priced.I love the decor in here and, if you ignore the fact that every branch of this place looks the same, it can almost feel original...The Folly is enormous. Like, you go downstairs and are shocked enormous. That said, I'd still recommend booking for brunch or an evening - it's gets incredibly busy!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2pVhSx2MExlL1ggNNWpo7Q"
  },
  "5DPrm7GPQtYSoGxBk8rvcg": {
    "date": "3/8/2016",
    "text": "The food was not great and the service was even worse. Had the chicken sandwich and it was the driest chicken I have ever had. The broccoli side was over cooked and had no flavor. Won't be come back here.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BEEU3rS7e6axYy-mtRUNiA"
  },
  "bSQg0fC9SjDdGLhY-dqcsQ": {
    "date": "1/9/2015",
    "text": "This was a lovely place to eat, especially after some horrible arrive we had at Sushi Samba. The food here was excellent. I also loved the way the waiters and chefs worked together. They have a very nice system going. The reason I give the folly 5 full stars on because our waiter was such a nice guy. Though he was absolutely swamped, he was still very friendly and cared about what we thought of our food. The food itself was also extremely good. Though I don't usually go to bars, I would definitely come here after work with some friends to unwind. Well done!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b-zLTmSbHq8aOUNv3ZDmRQ"
  },
  "rXb1v94CYuS0-KQn6fwATA": {
    "date": "12/9/2014",
    "text": "I like The Folly comparatively to your other choices in the city. It's got great eclectic decor, and a decent cocktail list (big fan of the skinny mango mojito). It's almost always absolutely rammed in the evenings - and downstairs can get pretty rowdy. With large crowds of suited men prowling the landscape for ladies (yes, it's a total meat market), it sometimes can smell pretty unfresh down there. But don't let that deter you, this place is fun. I've eaten here a couple of times (you should call and make a reservation, as it's very busy Thursdays and Friday especially). The food is a-ok, the Christmas meal I had here was lacklustre, but the other time with the main menu was decent enough - good burgers and sweet potato fries in particular. Oh, and surprisingly decent bread. Overall, i prefer The Folly's sister bar, The Anthologist (at Bank) - it's the original and the best. However, The Folly is a great place to kick back in the city of London and have some after work drinks in a busy spot.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1kYDWInS_Yraeb3Ui1OetQ"
  },
  "x-0KcgJ9BSzLJFWsX02XLg": {
    "date": "3/24/2015",
    "text": "It's an ok place. Lively, spacious, friendly service, good food...it would have been 4-star if it wasn't for the smell of urine in the dining room. It's hard to get over that detail...so your experience will probably be better than mine.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKuGvqZfJ0ye-F8QcdREHw"
  },
  "kK1nYUj6Mu_XUA-dySn7LQ": {
    "date": "4/22/2015",
    "text": "On the pro side, the decor is great and this looks like a good spot to have a business lunch in Bank.Had the burger here for lunch. When you order a burger, and they don't ask you how you like it cooked, just change your order to something else. The burger here looks good with its tall stature and brioche bun but, upon closer inspection, the meat patties have that preformed frozen from the factory look. You know, that machine formed hockey puck like hard edge (not ground or hand formed on prem). And it tastes like it. They cooked the thing well done and it was dry and tasteless. The fries that come with the burger were underdone and not crispy enough around the edges. When you have thick steak fries, there is little chance of the center drying out, so why not cook it a bit longer?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1ccV5ednpSJSL5NKibCOw"
  },
  "fn0PoczfYNIC4OLCUByp3w": {
    "date": "9/28/2012",
    "text": "Well, I gave Folly food another chance and they totally blew it. I took a visiting friend here because the decor and space is just so damned great, very rustic cottage chic (pretty much an anthropologie show room).We ordered from the apps-to-share portion of the menu, which range from 5.95 to 7.95 a dish. We got the \"prawn lollipops\" (which is a cringe-worthy name, just call em fried prawn skewers, cause that's what they were). and those were fairly tasty and fresh. My issue was with the duck pancake which were served in deplorably, obviously been sitting out a while state.The pancakes had hard edges and were cold, the shredded duck meat was greasy/filmy, room temp and getting it's own layer of crust. the hoisin was way too thick and forming a skin like old gravy. seriously? taking into account my previous review (and another reviewer's same issue with their steak), they clearly have an issue with expediting/running food in as its ready. i'm not going to keep coming back to pay out the nose for food that gets served in that state.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "5wBr5joAdT0TkL4FLHEWGw": {
    "date": "3/7/2011",
    "text": "I went here soon after The Folly first opened and I must admit I was shocked by its sheer size. The decor implies a personal touch but seems a bit formulaic on this scale. Unfortunately, I have lost the notes I made on the night. Due to its location it is obviously targeted at wealthy after-work diners. We greatly enjoyed our shared platter of vegetarian antipasto.I would go again but was a lot less excited than I had anticipated.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m3P8XzZ5LoVEdiWRYER2lQ",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m3P8XzZ5LoVEdiWRYER2lQ/o.jpg"
      },
      {
        "img_id": "LZ3HqPMtZ9yu8VfuFnnXNg",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LZ3HqPMtZ9yu8VfuFnnXNg/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "hznd9HBNrYaYzngRBaCYyQ": {
    "date": "11/17/2014",
    "text": "Nice big place with plenty of seating options, a nice selection of food and drinks. Came with a big group for a birthday and plenty of nice options for healthies, veggies and meat eaters. The entire downstairs was being used for a wedding reception but didn't affect service speed which was nice. It is a buzzing place so not ideal for a quiet chat but fun for groups.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4EwnfYTlvagLI3WVVmyu3Q",
        "caption": "Photo of The Folly - London, United Kingdom. Surf and turf",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4EwnfYTlvagLI3WVVmyu3Q/o.jpg"
      },
      {
        "img_id": "mp_svRzudQJHRN7DXi_QKg",
        "caption": "Photo of The Folly - London, United Kingdom. Flatbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mp_svRzudQJHRN7DXi_QKg/o.jpg"
      }
    ],
    "user_id": "K0aCfKbD0w_HQN1Wokq5uQ"
  },
  "zmKxGg8H7o7rNjyIPsmjUQ": {
    "date": "11/10/2014",
    "text": "Ducking in out of the torrential rain on Saturday the initial impressions of this place are good. It's a big space but broken up well into smaller areas, and that's before you realise how big it is downstairs. We had a couple of drinks, ventured out to see the fireworks for the Lord Mayors parade then, as we don't know the area well and it was still raining hard, headed back to get something to eat.The staff are friendly and the menu interesting. They have a good range of drinks as well so on that front it's all good.We both ordered the Fish & Scampi main course, and it arrived pretty promptly. I was hungry so tentatively forked a couple of chips, blew on them and shoved them in my gob! It was then I realised they weren't all that hot. The food wasn't cold but it didn't seem to be all that fresh either.My guess is the chips were under a heater, and the fish/scampi was re-deep fried at the last minute.That said, it was a nice combo, scampi, chunks of haddock and salmon, with a sauce that wasn't tartare but... well I'm not sure what it was (chive and onion?) but it was tasty enough.Not somewhere I'd choose to visit again I don't think. And whilst it was very loud, down to both the music and the number of people all shouting to make themselves heard, it did seem to be quieter than it seemed, clever acoustics?All in all a pretty standard pub that happened to be en route. Next time we'll look further afield (depending on the rain...)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_lCUJN3MObQvNDxIiE2kA"
  },
  "5LHEAXqAC0li69MaXxgmhw": {
    "date": "4/15/2014",
    "text": "Went there for a friend's birthday. I had a duck flatbread as a main, but found it quite disappointing to be honest. Simply a bit tasteless. The service is good though. They have a cutest sweetest little waiter from Bulgaria that danced all around, a true hunty! If there's any reason why this place is always so crowded, with this kinda quality of food, I'd say it's totally because of their cute waiters. The cocktails were okay. We had mojitos and Zombieland. The taste was great, but, there simply was tooooo much ice!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OBNdAnwnZqJipi00QNJ4Ow"
  },
  "e-fzboKX18AvGvX0hVp_YQ": {
    "date": "4/27/2014",
    "text": "Had I reviewed The Folly after the first time I'd visited, I would have given it at least four stars.It was my friend's 30th birthday party on a Saturday night and she'd hired out a private room down stairs. The bar was up market and cool without being pretentious and the people were friendly and upbeat.I came again on a Thursday night. The bar was so packed it was impossible to move. The bar staff were rude. The security staff moved us every time we settled somewhere. Also, as it's in the middle of the city, it was full of bankers. Cockney rhyming slang as well as literal bankers.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZqFItgRf8HQs7Qm46UegSg"
  },
  "unL7bwRigRUu2jEmQ65Fjw": {
    "date": "10/1/2014",
    "text": "My experience here has massively varied on the 2 times I've visited so it very much depends on what you are after. I can wholeheartedly recommend coming here for a drink. There's a really good selection of beers, the wine is fairly priced and the cocktail menu is ever changing. It's also a really cool space with lots of little nooks and crannies and it's great for people watching.Sadly it seems to be all about style over substance when it comes to the food. While everything looked good the taste was very much lacking. I was served easily the worst chicken satay I've ever had and the fish and chips was lacking in seasoning and the batter was undercooked and very greasy. If you can avoid eating here you'll probably enjoy your visit",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfM4mH3T3xJspJfOGbJIsQ"
  },
  "59DcOU5rv-mIr04FfzNymQ": {
    "date": "9/14/2013",
    "text": "Great service and a detailed décor does not save this place from getting two stars.I visited The Folly for a birthday dinner and had the Beef & Reef for main course since it was promoted as a special £15 deal. It included half a lobster, steak & chips and a glass of bubbly (or another drink). Not bad a premise but that's where the compliments end: the half a lobster should actually be called \"two bites and you are done\" and the same can be said about the steak. Furthermore, the meat was tasteless, hard and charred. Even the chips were a disappointment; they were either waiting for a while before being brought to the table or, worse, they were cooked beforehand and simply heated. How can you go wrong with chips? I suppose that if something sounds to good to be true...The crème burlee was equally disappointing and for a meal that came just short of £25 I would have expected much better.Despite the great decoration that aims to recreate a \"secret garden\" environment (the bathrooms are actually quite cool) and retains some interesting pieces of décor (the feather chandelier to name one) , I don't agree with some reviews mentioning it has great \"ambiance\". It doesn't. It's ironic that their website promises a \"calm place\" and yet the volume of the music is loud to the point that you can hardly hear the person next to you. I would never host a client dinner here.5 stars to the service though. Polite, fast and took the initiative of bringing a crème burlee with a candle to the table so that we could sing happy birthday to our friend. A nice little touch indeed...Food was a disappointment and it's clearly overpriced. I won't come back for more.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMEWEhMMtG90t8my48f7jg"
  },
  "3SkmmEttXxR3uWXS2iFWdw": {
    "date": "4/18/2012",
    "text": "If I could give a review on ambiance alone...this place would receive 5 stars. I loved the decor. Very funky and cool. Candlesticks burning away during the day. Terra cotta pots as lamp shades and herb plants on every table. It is a huge place with two floors and has a great lounge feel.Food was okay for me. I ordered the salmon salad and thought it was a bit overdressed. Macaroni and cheese was decent as was the burger.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "KTbGntjKBek7z_XPwL-vHg": {
    "date": "12/17/2011",
    "text": "The Folly is like a tardis, the outside really hides the cavernous inside well but overall I wasn't that impressed.The bar was super busy but I spent most of my time sampling the Christmas menu over on the far side away from the worst excesses of the bar. The food portions were incredibly small for the Christmas menu so that a three course meal didn't really fill me up.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "unV05KrzxsUQoyUF50Q_TQ"
  },
  "J4_ADMqD588ldnmFntZ-wQ": {
    "date": "1/20/2014",
    "text": "Watering hole for suited city-types.  Huge and crazy busy of a weekday evening.  Respectable collection of rums that the staff can discuss with confidence - that I like.  I can't see it having any other defining or redeeming characteristics.     That's not to say the place is a nasty, dive.  It's not.  It just doesn't offer anything more.No doubt part of it's popularity is based on it's location in the City of London.  So it doesn't have to try any harder, it's got a reliable business from the office workers in the area!So, yes good for after work drinks or starting an evening there but nothing special.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSwwRATdcNBDDz8dF4oJpg"
  },
  "gpo8f7G-fKgwQGLINCboSg": {
    "date": "9/30/2015",
    "text": "Nice place with lovely music! I liked the style and decoration and the overall impression is of place to have fun. The staff is kind but the barman a bit slow with the coktails. However, they tasted really good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QTT9EeAt590PTnKWuw2muA"
  },
  "soghU6dLM4AqCSIr6WGxMg": {
    "date": "7/6/2018",
    "text": "Great service. Delicious food and drinks. Laura from Romania is amazing!  So sweet and bubbly. Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c24KqNBpTaTqQzo_ZnMMyg"
  },
  "YQOXTnHOPSn15vX8NtEWlg": {
    "date": "9/24/2018",
    "text": "Walked by this place looked cozy and hip and dropped in for dinner no wait place was like very large 2 levels staff was so so friendly as I recall food was average had the Roasted cauliflower pesto fettuccine it was good okay portion  and the Hot smoked salmon salad with soft boiled eggNot so hot salmon as the name suggest more like  cold salad but was tasty I give this place a solid 3",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T32O1wZePQbgCJyCmGtjOA",
        "caption": "Photo of The Folly - London, United Kingdom. Roasted cauliflower pesto fettuccine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T32O1wZePQbgCJyCmGtjOA/o.jpg"
      },
      {
        "img_id": "PpD_QEK6SsQssCvoHD5cRg",
        "caption": "Photo of The Folly - London, United Kingdom. Hot smoked salmon salad with soft boiled egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PpD_QEK6SsQssCvoHD5cRg/o.jpg"
      }
    ],
    "user_id": "z0zlvlrYJSAvjsNAfSQpGQ"
  },
  "qBRzE6dTtTxPxGMGi8L3qQ": {
    "date": "10/23/2018",
    "text": "AWFUL service and food is not what it describes.   Very poor!!!  Would NEVER recommend or go back.   Different staff serve you.  Waited 30 mins for coffee and they brought tea.  Ordered afternoon tea and they ran out of scones at 3pm (tea time).  Asked what we would like, we asked what the choice was, they said JUST crumpets.  NEVER EVER again!    Awful place, awful food and awful service!   Good luck to you all!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qYHMS0Mzi3krIqfGBTwjdg"
  },
  "M-aIZ3RbeA_2kE-ZQ6KOlA": {
    "date": "8/13/2017",
    "text": "Quite the smart-looking restaurant both inside and out, you enter into a reception area overlooking the main dining floor below, which features lots of communal bench seating with views of the open kitchen. There's yet another level downstairs that's more intimate and appears to be more drink-oriented.As for the food and drink, the offerings are reasonably portioned and attractively presented. Not necessarily mind-blowing stuff from a culinary perspective, but nevertheless upscale-looking contemporary bistro fare, whether Belgian mussels, Thai coconut curry, or a savory, delightfully juicy Wagyu beef burger. Service is friendly and professional, and the ambience manages to be both social and intimate. Folks didn't hold back from being intimate while on dates, despite the communal seating. Quite an interesting place that adds a lot of character and adds to the expanding range of nighttime options in the City, which until recently was rather quiet during work hours.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0d4BEg0XoxeX2coIIi1Iog",
        "caption": "Photo of The Folly - London, United Kingdom. open kitchen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0d4BEg0XoxeX2coIIi1Iog/o.jpg"
      }
    ],
    "user_id": "bQCHF5rn5lMI9c5kEwCaNA"
  },
  "4Jo_Q7QcoWcCYiImkvOKEg": {
    "date": "10/10/2018",
    "text": "Dining at the Folly have been a very mixed experience. The restaurant itself is lovely. beautiful interior, cozy atmosphere and very clean. On the other hand, the food and staff is a whole other talk.**The restaurant**Getting to the restaurant is very easy, just a few minutes walk from Bank st. The inside of the restaurant is absolutely stunning, with plants hanging from the ceiling, and the dimmed lights create a very cozy and relaxed atmosphere. Some people have mentioned that the music is too loud and while I personally didn't mind, I understand that some people might find the volume too high, which might make it very difficult to have a conversation with someone.**The food**There's a lot of different dishes on the menu, which accommodates most people. There's a problem, though, when it comes to special dietary requirements and allergies. One of my guests is vegan and celiac, so we both tried to contact the restaurant in advance to make sure she could actually eat something. We never heard back from them even though we called them, filled out the form on their website(which says they'll get back to you within 48 hours), emailed them and sent them a message on messenger(which they saw but for some reason chose not to reply to). I did also specify this when making the reservation, but it didn't seem like they even read the message. Based on what me and my guests ordered, I would say the restaurant is more suitable for omnivores. Although, the people who ordered the vegan risotto said it was very good. My vegetarian dish was very tasty, but it's not very enjoyable to eat jerusalem artichokes when some parts still aren't fully cooked and the roots still are left.**The staff**From my experience before and during the dinner, it seems like the staff doesn't really want to have anything to do with things that might make the cooking and service complicated. I really don't believe it's a coincidence that we never heard back from them after trying to get in contact with them for almost 3 weeks, and if it isn't then it's absolutely impossible to get in contact with the restaurant whatsoever.When my guest asked the waiter if the glutenfree bread was vegan(most glutenfree bread contains eggs) he simple replied with \"madame! I can asure you it's glutenfree\", even though she phrased the question in multiple ways.If we just kept our mouths shut the waiter was very nice, but if we was being just a tying bit difficult he would start to get annoyed.I would definitely recommend dining at the Folly if you don't have any allergens or dietary requirements, but if you and you don't find the menu clear enough, I wouldn't bother coming for dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jI1nfWGNxh8N-Avxkzf50w"
  },
  "i6MVRqnbQ3A2rVxnchA36g": {
    "date": "7/6/2017",
    "text": "Lovely decor and lively buzzing atmosphere. We ordered the same drink - homemade lemonade - but one tasted very watery and the other had a dark unidentifiable object floating about.   The first was replaced, tasting less watery but with another floating object, and was replaced for a second time. I had the salmon special. It arrived quickly and  was beautifully presented but pretty tasteless (I felt the need to add salt to flavour, but resisted). The cheeseburger was also very good, and onion rings tasted great. Be careful ordering drinks. Twice arrived with floating objects and staff made us feel uncomfortable for  mentioning any issues.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XcvnNauhHPzCxtNwD41gSg",
        "caption": "Photo of The Folly - London, United Kingdom. Homemade lemonade",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XcvnNauhHPzCxtNwD41gSg/o.jpg"
      },
      {
        "img_id": "d4OE16UsIHZMM-Y4A8WSEg",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d4OE16UsIHZMM-Y4A8WSEg/o.jpg"
      }
    ],
    "user_id": "3yVA0JzmKA_zQEN8auIsOg"
  },
  "PF8RQHD14aWwkcakWIFl3g": {
    "date": "10/30/2017",
    "text": "Very good location, nice atmosphere and good tasting food.It is suitable for large groups and they are good organized to make your experience great.I loved all the food i tasted and the drinks where also good.Clean and fast",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eOyaLNco9ditPG6i2mnvfw",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eOyaLNco9ditPG6i2mnvfw/o.jpg"
      },
      {
        "img_id": "4G9ybj-TXMEBPQeIMBHaTQ",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4G9ybj-TXMEBPQeIMBHaTQ/o.jpg"
      }
    ],
    "user_id": "-7wuqdaJ9rXMSHshETzuxg"
  },
  "PEyjwTKmdm8-CeAN5GyifA": {
    "date": "9/22/2018",
    "text": "Very trendy atmosphere will an ample and scrumptious menu selection.  Wide selection of evening cocktails makes for a great setting with a loved one, friends or family.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-koaKDZ5b_ovJXS27f09g"
  },
  "L7zigZ73cbuZZRSWor5ebw": {
    "date": "7/1/2017",
    "text": "Shame really, the place looks awesome, has a great atmosphere, but the service and the food sucked. Well that's a bit harsh, some of the food sucked. It took ages for anyone to come over and take our order. In fact, we had to ask a guy to come take our order. There was 3 of us, we got a duck flatbread to share to start. The duck was nice but the rest wasn't really. The bread wasn't quite right and the vegetables had no flavour. For mains, the boys both got a steak with peppercorn sauce & chips. I got fish and chips. The boys were both satisfied with their meals, and I was too but the batter could have used a little longer in the fryer. It was a little doughy in the middle. The fish itself was great though. With 4 beers and 2 virgin cocktails it all came to about £100.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "i-y2-MbdJebSaTKmY1QxHw"
  },
  "rMv-uxuB1k1pJlOL0vW88A": {
    "date": "10/22/2017",
    "text": "Well we went inside to get some wine at 1830 and they turned us away saying they're closed for the night but yet their sign states they are open late. Maybe they should fix that.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ALxOIJ1Dgl0cGuTYBbo-g",
        "caption": "Photo of The Folly - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3ALxOIJ1Dgl0cGuTYBbo-g/o.jpg"
      }
    ],
    "user_id": "Oqkq_eVTrIWRHqBmY-jvJQ"
  },
  "BhwC8Lz6y98lOy7VcehOLw": {
    "date": "8/4/2016",
    "text": "I was recently in London on vacation and decided to stop in and visit some English colleagues of mine who work nearby. They picked the Folly because it is one of their usual lunch spots. When you walk in you'll notice that the decor is pretty rustic and fresh which was very cool. We had stepped out pretty early for lunch so when we arrived there wasn't much of a wait. We were led to a communal high top table and our server came by right away. We ordered waters, cokes, etc. and had a chance to look at the menu. Everything sounded very good and I wasn't shocked by the prices at all. Having spent quite a bit of time in London before I was anticipating some higher prices right in the heart of the business district but that wasn't the case at all. You would find similar prices in most big cities at sit down restaurants. I settled on the Chicken BLT sandwich with chips.The food arrived quickly and it looked good. The chicken was well cooked and just the right amount of food for lunch. Coming from the US I often see enormous lunch time portions so it was refreshing to see a proper proportion of food. I'll be honest though...the chips were my favorite part. I love English chips! My colleagues told me that The Folly was a popular wine bar after work and after looking at the wine menu I'm sure I would agree. Would I return? Yes, for sure! The food was good, the location is good, the ambiance is good. An all round good experience! I just wish I hadn't worn jeans to meet up my colleagues as they were all dressed in suits. Part of the insurance crowd.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aCptbfrrIwaoJbc478XBRg"
  },
  "lDzE43QgSFQHhgFVzKEDFQ": {
    "date": "6/1/2016",
    "text": "Brunch at The Folly close to Monument Station, eating Eggs Royale and drinking fresh orange juice. Yummy! This is the perfect brunch for a sunny Sunday. Love the interior and vibrant atmosphere at this restaurant, very reasonably priced food too. I do recommend making a booking at The Sky Garden if you're going to dine at The Folly, because they are so close to each other! It really makes for a perfect day.More reviews on my instagram: mattzard",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C6V3lzFdkJF2lahi2MISaA",
        "caption": "Photo of The Folly - London, United Kingdom. Eggs Royale",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C6V3lzFdkJF2lahi2MISaA/o.jpg"
      }
    ],
    "user_id": "o3BuHnrHntmH1AnFoPYmaQ"
  },
  "a5fnN0C3__YmoTAcHfoeUg": {
    "date": "2/23/2016",
    "text": "Our hotel concierge recommended Folly as an easy brunch spot. At first glance the place is gorgeous, large, charming with lots of mixed electric decor. There were several baby carriages on the top seating area, which seemed a great spot for parents, however the whole restaurant smelled like dirty baby diapers..We rolled up around 12:00/12:30? and brunch was just about to end. We had to order fast, and I didn't really have a chance to see the full selection. I ended up with one piece of avocado toast, with a tiny egg on top, and chili flakes. I was starving and expected a lot more food - a couple eggs with toast, and avocado smothered in chili.. Cultural differences lesson #1, you are not in Brooklyn anymore smaller proportions. Chili on a British menu might equal chili flakes. I also had a very blah mango smoothie. The whole thing made me feel sick.My fiancé got a full English breakfast and it made him ill to the point he had to run back to the hotel halfway there :(. I felt ill as well. Maybe it was because we were delirious from our overnight flight? Sadly service was not great either - our bill needed fixing twice. I would give it another go though, certainly has potential perhaps at a different time of day.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GNXl7dZbnh7Sd_9vBR3egQ",
        "caption": "Photo of The Folly - London, United Kingdom. Mango smoothie, and darling fresh flowers at the table.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GNXl7dZbnh7Sd_9vBR3egQ/o.jpg"
      },
      {
        "img_id": "Iv6Ull7xCoJ9uy9OqZUgZA",
        "caption": "Photo of The Folly - London, United Kingdom. From downstairs by the kitchen looking out",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Iv6Ull7xCoJ9uy9OqZUgZA/o.jpg"
      }
    ],
    "user_id": "K1lyP0eGLAy6800sXZKsVQ"
  },
  "U26hD9HcsOWAHZ5eAxcKbw": {
    "date": "9/20/2015",
    "text": "Mixed feelings about The Folly.  Located close to our office building, we had a team dinner while several of us were visiting London from the US.  It's got a great vibe, and we were seated immediately when we arrived on time for our reservation.  We were seated at a long picnic table with long benches.  Three of us had to pull the bench out and then find a way to gracefully get ourselves seated on this bench while wearing dresses.  We ordered drinks and it took a while for them to arrive.  We had a mix up with one of my co-workers, every type of wine she ordered was not available.  Finally they found one she was happy with and then left the whole bottle even though she only wanted a glass.  It took 10 minutes before someone came back and we could get the error corrected.We ordered main dishes and sides and everything was delicious.  I ordered fish and chips and a beetroot salad (I don't like mushy peas).  Fish and chips were great and the beetroot salad was amazing.  A few of us ordered desserts and we had an issue with the apple tarts.  Three of us ordered the same thing.  Only one came out properly cooked, the second was slightly burnt and the third was inedible.  It was a production finding our server and getting it taken away.  I really could not believe they served them that way.  Before we had finished desserts, a man came over and informed us that we would have to leave immediately, as they needed our table for someone else.  He said we should have been told when we arrived that we had a time limit (we were not told that).  We had not even been given the bill yet, but he stared at us uncomfortably from across the room as though we were disobeying his order.  Our bill finally came and it was wrong.  They made an attempt to correct it and it was still wrong.  A replacement dessert was brought for the burnt apple tart but then we had to ask for it for take away as we were not being allowed to stay at the table.  The server did not seem to understand that which led to more confusion and more time.  On the third attempt the bill was finally correct and we were able to pay, but my co-worker who was paying said she wanted the service charge to be removed.  That led to a series of questions, but she finally agreed to remove the charge.The food was good and the company was wonderful, but the experience overall was tainted by the service and the attitudes of the staff.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C1PJryRHhgNcEYovkLCJgw",
        "caption": "Photo of The Folly - London, United Kingdom. Apple tart with salted caramel ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C1PJryRHhgNcEYovkLCJgw/o.jpg"
      },
      {
        "img_id": "tm2mfgoFhJiHiMuARaOy-g",
        "caption": "Photo of The Folly - London, United Kingdom. Beetroot salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tm2mfgoFhJiHiMuARaOy-g/o.jpg"
      },
      {
        "img_id": "sLSCCnT9g8p7oJiVnxoedw",
        "caption": "Photo of The Folly - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sLSCCnT9g8p7oJiVnxoedw/o.jpg"
      }
    ],
    "user_id": "dzXeeCDAZIrF0uVH4cSiSw"
  },
  "0KK6ngwRpObkGWTnSE3hVw": {
    "date": "3/23/2016",
    "text": "Nope. Nope nope nope nope nope nope nope. The plot: Friday night. 6:30pm.  Meeting up with a group of friends. The scene: a mid-range circle from Dante's Inferno. Hot. Loud. Crammed in like sardines.  Full of the type of people I usually want to slap across the face.There is little redeeming about this place. It was so loud that even once our group did find each other, the shouting to a person a shoulder's width away left most of us with gravelly voices the next day.  My ears were ringing the next morning as if I'd been at some sort of great music gig.  Except it was just 2 hours in a horrible City bar.  I was drinking soft drinks.  Each round seemed to come in a smaller glass than the last.  Never the same shape or size.  Yet, when a member of our party ordered a Jack & Coke, it came in a pint glass. What sort of logic is that?The handful of guys who were picking up glasses were like vultures, constantly circling and pushing through groups and conversations.  Any time I sat my glass on the countertop, a glass collector was there.  Of course, only rarely was the glass emptied.  Some people do just like to use a table or counter to rest their glass as they speak. Add to this that the vulture-like glass guys were incredibly rude. It was just one more thing to make this place pretty much the worst London bar I've been in.  And that's saying something. Trying to push your way through the crowds to the restrooms was hilarious.  Drunk, dancing, barely clothed girls falling over besuited City dude bros and blocking the way through the downstairs was at least something vaguely entertaining to see.  At least the bathrooms were clean.  And quiet. A few minutes' respite was appreciated as I probably washed my hands well enough to go into surgery. Danger, Will Robinson. Just save yourself sticky shoes and a headache and go anywhere else.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2NjjrFtg4ZMsoDXtDBqjA"
  },
  "oZBR55Xf4qrczhUOLbNaDA": {
    "date": "5/6/2017",
    "text": "Food taste good, good location just a min walk from subway station, price are acceptable but not too many choice for the menu",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0I2PiMjeqZPvzTAqTyHxHQ"
  },
  "EEPKbcxfqmH-BnQs78IRSw": {
    "date": "1/18/2016",
    "text": "Had a colleague's leaving drinks held here. Reserved an area for 15 which was quite small, but the guests didn't complain. :)This place is massive. Love the bathrooms, very spacious. Bartenders and front reception was very nice and helpful. Would come back again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "9_aZ6AFCEtFX5Uu2LZuwHg"
  },
  "ZaS44Nv8Y7eJ0RYPsddBGw": {
    "date": "3/22/2016",
    "text": "You will struggle to pay me enough to ever visit this place again. Possibly the least fun bar experience I've had in years, anywhere.Someone in our group of friends had the bright idea to meet up here; and without any experience I had no reason to disagree. Now I do. We were expecting 10 or so of us throughout the evening; but we'd be lucky if you could fit 3 of us next to each other for any kind of conversation at any point. Yes, it was a Friday night, but the place is absolutely huge both upstairs and downstairs and yet is inexplicably the most popular place in the City, by the look of things.I said you could fit 3 in a tight circle for a conversation, but that's not entirely true: there's little hope of being able to have a conversation. The music (an, obnoxious, repetitive, utterly pointless dance/club interpretation of the subject) was surrounding both floors with a multitude of speakers all turned up to \"maximum ear pain\". We couldn't hear anything but the music. Except maybe for other, larger groups of greasy suited city workers, shouting to hear their own conversations. I do not understand what makes a bar turn the music up to the point that the patrons can't talk to one another. Is that not what a bar is meant for? Atmosphere can be achieved through background music (if at all) and the general buzz of a busy bar.Elsewhere, such as on the way to the bar, or on the way to the bathroom, people were trying to dance to this music. There was no room to do so, so it was just obnoxious drink-swinging, spilling stuff all over the place, or awkward rubbing up against strangers just trying to get by. If you want people to dance, make a dance floor (NOT in the bathroom hallway) and put the music up there only.If you find yourself in here, you have to ask what you want from the evening. Do you want to talk? It's too loud. Do you want to dance? It's too busy. Do you want to eat? Well, I don't know how good the restaurant section is, but the food must be insanely amazing for the diners to put up with not being able to hear their date/friends. Do you want a fine selection of beers and spirits? Well, they have, erm, Peroni, if you ever make it to the bar...Really, there is very little to do in here except stand in a crush with the post-work crowd and watch each other drink lager or pinot.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p0tGE0tPVnMj_jVh91STvw"
  },
  "ab-QoeZatoHjD5ApWXDPFQ": {
    "date": "7/12/2015",
    "text": "Staying in the Monument area and looking for somewhere close to eat on a Sunday led me here. Options were truly slim, so I'm grateful this place was open. It's nice enough inside. Menu is a little limited but the food I ordered (a roasted chicken/streaky bacon/avocado salad) was very fresh and well prepared. Servers were all friendly. And, for the business travelers out there, they accept Amex.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8v-rGXv1RD1qstTW6zeKTw"
  },
  "sjhYBWikVxy0fp-1MCQ_WA": {
    "date": "4/25/2015",
    "text": "This place is MAHOOSIVE. Its got drinks. Dining, downstairs bar and private dining. It just spans a large area and that's a good thing considering the sheer amount of city-workers on a Friday night. It was rammed.We came here after be at one for a few more drinks and it was great, if a little too loud and also it's a mission to get a drinks perch/ space to chat. But if you're up for mingling with city boys, this is the place! The drinks were good, I like the bar staff more- they were really cute! :)",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  }
}