{
  "TQjVzVWh5s_VYc7i5ckdcg": {
    "date": "11/14/2011",
    "text": "Excellent meal. Good service. Total vegetarian.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOZNkPyyKTkxI36vXLA4qA"
  },
  "c_eXFB4gJ31mg-zTUcS0GQ": {
    "date": "8/4/2011",
    "text": "A south Indian vegetarian restaurant serving excellent dosas. Also a good lunch buffet. Prices very reasonable.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rtPI17-mtfb1Lk4x4_UrdQ": {
    "date": "2/8/2011",
    "text": "This is a really excellent Indian vegetarian restaurant. The daily specials are particularly good. You must try the Shrikand (a dessert of thick yoghurt beaten with sugar, pistachio nuts, saffron and other spices), which is exquisite. This is northern Indian food as it should be: spicy enough, with the requisite amounts of oil and ghee to make the dishes rich but never cloying.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGNIEiBST5QShozpASJjng"
  },
  "3P46CtOqQiPwjRq2s3Fk8A": {
    "date": "4/24/2008",
    "text": "I used to come here regularly before I discovered the nearby Chutney's (also reviewed), but I am still very fond of this restaurant for its lunchtime buffet and especially its syrup sponge balls. The Ravi Shankar is spacious, with wooden tables and benches, but still pretty packed so get there early. The food is of course wonderful, and all vegetarian. If not having the buffet, there is a wide choice of dosas, which here seem thicker and more filling than at neighbouring restaurants. The only downside to this restaurant is that there is segregated seating at lunchtime, so that non-buffet eaters are not allowed to sit with buffet customers - so that if one of your party doesn't want the buffet you have to split up. But the buffet is pretty special and it would be silly not to try it.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0UJz9tdlV8nt4V8lxgDAFw": {
    "date": "1/2/2011",
    "text": "Great place to get delicious Indian food for a really good price. We enjoyed our evening! Taste it!!! :-)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6FzsSuNJA0cfJowAyW27WA": {
    "date": "8/30/2010",
    "text": "A deservedly popular vegetarian Indian restaurant, practically a legend among North Londonites. My companions had the day's special but I settled for a Masala Dosa which is indeed a lovely thing. Does a buffet at lunchtime. There are several restaurants along Drummond Street but this one has a special place in many hearts.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "R4crRIF_ZUrcIWPB2ZlS8A": {
    "date": "2/20/2013",
    "text": "This is the best vegetarian indian buffet I've ever had before!  There are so many selections, I was blown away! The whole restaurant was really clean and the staff was extremely helpful and courteous. Especially compared to some of the other indian buffets in the area... There were at least 20 different selections, I was drooling right when I walked in.   I love all the different flavors that are offered, and all the creative ways they use chickpeas.  Also, their spinach dish with mushrooms was AMAZING.  I am in love with this place, and it is only 6.95 pounds, and only a 5 minutes walk from Euston station.  My boyfriend even loved this indian buffet and he usually hates vegetarian food.  They also have a pretty decent desert selection!I will DEFINITELY be coming back on my hungry days, and it's cushy on the wallet as well!  This is better than any indian buffet i've had in Los Angeles as well!  I am definitely coming back here as much as I can!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "UE66GxGVc0xjmT6Uprr_fw"
  },
  "lCWlbNqvLjnmr58gFj_xRA": {
    "date": "6/18/2016",
    "text": "Menu has errors...what you order is not what you will get.Husband ordered an onion rava  dosa that was supposed to come filled with potatoes-- so it stated on the menu.  It's a dish that can be served (traditionally) with or without potatoes.  When it came, it had no potatoes, just some onions in it.  Compared to all the other dosas at the restaurant, my husband's looked tiny... a pathetic meal at over 7 pounds.  But since it was our first visit, we assumed that we imagined reading that it came with potatoes...that's how we get it at our local restaurants.  However, when we looked at the menu for desserts, we realized we were not crazy, the dosa was supposed to be potato-filled.  We pointed out the error to two staff persons, and were told that the menu is new and customers have been pointing out it is full of errors.  Even though it clearly said it was potato-filled, the staff stated that it does not come with potatoes.  They offered a free mint tea for the error, *how generous* (we declined).They did not offer to bring the missing potatoes, nor to take it off the bill.  We should have realized the error sooner....but they should not present a menu that misrepresents their meals.  Order at your own risk...! The staff was attentive throughout the meal.  The cheese naan had only a few crumbles of paneer, but it was good.  The eggplant dish was homestyle and a nice change from creamy curries often served in the states.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7Y3VgyHzRsBfY0MqHuIQQ"
  },
  "GIDrvWlULQp_Nt-c6egh4g": {
    "date": "12/10/2015",
    "text": "Making fool. No where close to Indian food. Just came back from this restaurant and these people are making fool to whole London by saying it is Indian food. Taste is pathetic, i ordered Mysore Masala Dosa and this person did not know what is he serving to me. When i asked him which dosa is it he was confused, and said it is masala dosa. Then i reminded him that I ordered Mysore Masala dosa this idiot said yes that's what it is. I am just coming from India and he thinks he can make me fool by saying anything. I trusted this waiter and took the plate and it turned out to be Just masala dosa and taste was horrible. I ate the dosa alone by leaving the potatoes as is, Sambhar was cold and stale, may be made in the morning. What I noticed also that people who are running this restaurant are no where close to India, forget about the south india where dosa originally come from, so that says it all that they are confused and making others fool on the name of Indian food. There are much better places out there. Never going there again.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzJ0PqZAXtBUUU9XY6ygxQ"
  },
  "UgPwGH_ioT0PVPAV_FtFng": {
    "date": "10/11/2014",
    "text": "Had been here for lunch with my wife. It was excellent food. Highly recommended. We tried every single dish and it was all fantastic and fresh. And 7 Pound per person is way too cheap for that quality.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "84Y0MT8umZd7TCxdZ8_RsA"
  },
  "iDsQ1diBn9wbffB7ZEiFcg": {
    "date": "12/9/2012",
    "text": "Read some of the reviews of great Chaat food and came all the way from Oxford Circus for some early dinner. I was disappointed that the Chaats were few in number and took up only the starters of the menu. The rest of the menu is pretty standard fare for a decent Indian restaurant in London. Was disappointed with the choice of food and the fact that they expected us to order mains. We ordered 4 startes instead and I will go ahead and look for other Chaat options in future.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kwmToyRa85G49WxbsYB1Aw"
  },
  "KfGrqk26TD-1JZzZbOobLQ": {
    "date": "7/15/2011",
    "text": "5 stars for the lunch buffet here. Excellent Indian vegetarian food with a huge array of salads, crispy pakoras, breads, Dosas, hot dishes which are different every time, and yum deserts.Every dish I have tried here has been excellent and I have to restrain myself not to over eat here.Finally, it's great value at £6.95.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "zBptsqWvBHOVOSfHjARZyA": {
    "date": "9/4/2015",
    "text": "So much better than the boring one I have been to for years.  Highly recommended for vegans.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CpC803j9fYa38Y5YwLa8g"
  },
  "Jutdu-NmgFbEpTYT1d0VrA": {
    "date": "8/31/2010",
    "text": "Not the fastest service but its a buffet for lunch for about 7 quid so its not really a huge complaint. Excellent Indian vegetarian food with a wide range of dishes including daal, pulses, salads and even dessert.Its out of the way and less hectic than brick lane. A good way to eat without the hussle and bustle.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGYsPKoNGf8kqAO-Ma-8TQ"
  },
  "tm1vgxWhqcmSBCJXie1qDQ": {
    "date": "8/2/2012",
    "text": "My wife and I make it a point to go here when we're in London.  Great food, and affordable.  Within walking distance of the British Library.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wtkCUJAcA6n1-IRwDzG8_w"
  },
  "JMjnEc2JY3csTm1M-lQA8A": {
    "date": "9/19/2014",
    "text": "the owner/manager was waiting tables the night i went to eat, two weeks ago.i was with two female friends - and we have all vowed never to return.imagine, gettin bad looks across the restaurant from staff, because you're not eating quick enough?! imagine the waiting staff lookin miserable, annoyed, grumpy and snapping at you because you're not ordering your food even though you've explained you're not ready?! imagine a world were the staff are so rude, they present u with the bill after mains, but u were about to order a dessert?! this place has a good rep, but, under current management/ownership - please think twice.you would have a better experience eating in a South London chip-shop.MEMO; staff - i want u to go on NVC training and remember, the customer is always right. This dining experience, isn't about YOU - its about the customer! Aggression and looking vex is not becoming if you work with the public. come on - what would Ravi say if he knew how you were treating people?PS - the food taste like the staff attitude; miserable and mediocre.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n5CKFZcqFUTKeryXtSKgMw"
  },
  "HPtDjY6PM6CRA2R2Fe3daw": {
    "date": "3/16/2012",
    "text": "Extremely yummy food, just not the fastest service. Even non-vegetarians think it's delicious! Reasonably priced, as well. Two can eat dinner here for less than £20. I also really like the daily specials - a set meal for £6.50! Also, the mutter paneer is super good.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BHg8vBiAGS5eMqejydHsKg"
  },
  "Ox5Zx4r-dv0Y0vsUiWHroQ": {
    "date": "3/20/2012",
    "text": "Fantastic! Good service, good variety. You never know what you will stumble in to when taking a chance on a place--we loved this one.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2rp_JYq8SHDFa5Iy577EMQ"
  },
  "CmS7JIhMhGKuLOyUUx6tQA": {
    "date": "2/22/2010",
    "text": "The menu of this all-vegetarian Indian restaurant seemed exciting, with lots of south Indian specialities. From said menu I chose the Shankar thali as I was were there in a big group and it's easy to order. I generally like the variety that a thali has to offer (it's a high-sided metal tray with 5 or so metal dishes inside, each with a different curry, and a large metal dish of rice). I've eaten quite a few thalis here and there, and this one was, well, it was OK. A bit greasy, not much variation in flavour or appearance, but on the whole edible. The gulab jamun was nice, however, but there was only one in my dish! If I had to I'd go back (i.e. another post-conference dinner), but I wouldn't choose to go there again. If I did maybe I'd try a dosa, as a previous reviewer recommended.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "n9Tcm0m43EZjFL1p4OxhSQ": {
    "date": "12/3/2008",
    "text": "One of many vegetarian Indian restaurants on the lovely Drummond Street, near Euston. Popular with local hippies and intellectuals, this is the best of the establishments on this road. I adore Indian food, basically because they offer such wonderful variety for vegetarians, so the menu in this restaurant is a dream come true. It's not flashy or particularly luxurious, the decor is sparse and plain, but the food is very good. They offer a great buffet for one, or two, with delicious breads, stewed pulses and rice. You'll be charged around £6 for the pleasure, which is very cheap, especially considering the area. They also offer a wide selection of fresh juices, and specialist Indian health drinks. Highly recommended if you're in the area, it's a beautiful setting that harks back to Bloomsbury of yore, and very pleasurable to wander.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "9srxtlcTPJ3XxmW5W6r0Qg": {
    "date": "9/25/2009",
    "text": "I've come here several times at the behest of friends, most recently this week. Ravi Shankar is happily consistent in the excellence of its food and sadly consistent in the inadequacy of its service. The curries are good, but the dosas are the highlight of the menu for me. I would absolutely love this place if it weren't so difficult to get the correct food order. Dishes go missing, only to reappear on the bill... It does get corrected, but it's a fuss every time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQsLfwViCUKGmDw8ZTv6uQ"
  },
  "Nkts0c5jwz65d6GvnZP4oQ": {
    "date": "7/6/2013",
    "text": "Really good and spicey indean food. We discovered while staying for a conference the whole group was really fond the different tali meals. For us germans the idea of tali was need but this is really a great treat.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sZSsm3byOIBqFYc1HL_6tg": {
    "date": "4/11/2011",
    "text": "Amazing Indian food.  I wish we has something like this in Boston.  Something like 60 items on the buffet, really great service.  Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dusf4Ix67-c2BN57hFwqFg"
  },
  "RlYwZuHA1hmORG9MMHbPwQ": {
    "date": "2/13/2013",
    "text": "The food is not as good as advertised here on Yelp. It is good, solid authentic Indian fare. Great? Certainly not. But the value for money is outstanding. Very inexpensive, with good flavours throughout. Was disappointed with the buffet options. After walking the buffet and putting very little on my plate I ended up ordering an entree, which I surely enjoyed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jLNz1cVIPXYAr6KrGoe5A"
  },
  "GyTC9VA0SI9-_FlZNs5mAg": {
    "date": "9/23/2011",
    "text": "After reading the reviews here, I went for the lunch buffet.  It was fine.  I tried small portions of 10 or 12 dishes to get a sense of the available range.  They were mildly spiced, without a lot of striking variety.  The selections relied heavily on potatoes, breadings, and batters--the inexpensive starches that keep buffet costs down--and I didn't find those to be done especially well.  The sweets were the usual Indian buffet selections and a little on the bland side.  I will say that this is a good choice for someone who doesn't want a lot of spice and expects certain standard dishes to be part of any Indian buffet.  For a wider range of flavors and dishes, and more inventive choices, I prefer Diwana on the same block.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IAg1ZySFdZ196-2Vtf7HWA"
  },
  "ajOd5iW3AdzKYTNvMe96VQ": {
    "date": "4/17/2012",
    "text": "I went here because of its good ratings and location in fabled Drummond Street. I took the set menu consisting of starter, main course and dessert for a fixed price. The starters were uniformly dry and brittle (somosas, etc), the main course liquid and lacking in substance (for example an aubergine curry consisted of a single slice of aubergine in a pool of yellow sauce). Next time I'll go to the more reliable Diwana Bhel Poori House down the road.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Fyq5AJMBp6n6Oov5Mg_6yQ": {
    "date": "5/28/2018",
    "text": "We needed a quick lunch near Euston before it was time for our cab ride to Heathrow. Yelp led us here. My wife is very much into Indian veg cuisine. So this made her very happy. Me, I tend to like more North Indian cuisine. But I found enough here on the buffet to make me happy. But what really made me happy was the price. It was most definitely the most reasonable meal I've ever had in London. I saw many locals here making numerous trips to the buffet. I imagine this is the type of place where people who live in the neighborhood know is a good place to load up for your money. One big lunch here and you're good for the day. If I lived here, that's what I'd do.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ppsm8EDKjA1fp1yTCP3RrQ"
  },
  "mwxTcxkWrOIhbaVp1y1Ftw": {
    "date": "8/14/2017",
    "text": "I wish I knew more Indian food than some.of the basic paneer and curries I'd be able to explain all the flavors, textures, and complexities of the meal we had. My cousin did most the ordering as she had been to India and it was simply amazing. Everything well plated, generously served and distinct style. I've had Indian at more than a few restaurants in the US and this blows them all away.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZnuGFDOpGnSZYmNhZrDuRw",
        "caption": "Photo of Ravi Shankar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZnuGFDOpGnSZYmNhZrDuRw/o.jpg"
      },
      {
        "img_id": "1CNFQG7F8bxjpygOZ7ZclA",
        "caption": "Photo of Ravi Shankar - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1CNFQG7F8bxjpygOZ7ZclA/o.jpg"
      }
    ],
    "user_id": "1NFVMsLPQib0JQgRbaVtEA"
  },
  "EHHM5km_L-UsmTBVAY6Xng": {
    "date": "12/17/2017",
    "text": "Legitimately good Indian vegetarian food, more reflective of south Indian cuisine. Delicious bhel poori, and great mysore masala thosai as well. Not too spicy. A little on the pricey side, I thought.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "EGQPGGpX8Ut4S8aOXIPZww": {
    "date": "1/21/2016",
    "text": "Ravi Shankar is one of the many cheap, yummy Indian restaurants on Drummond street. I used to come here back when I was a student...but I don't think I have returned for more than 10 years (Eep!) I don't have a particular reason for not coming back. I just didn't consider it until I found myself in this area, with a vegetarian friend.Although most of the reviews are about the bargainous lunch time buffet, in the evening they serve lovely thali as well as a whole range of dishes from around India, including dosa. I looove dosa, and there aren't that many places that offer it in the UK, so I ordered a spinach and paneer dosa for £7ish.  Noms:- We ordered some onion bhaji and samosas which were both really good.- My dosa was really tasty, and huuuge! It was cut into three sections, but two were enough for me, so I had plenty left for lunch the next day.- The staff are friendly and speedy.The only bad things are: - The wine is expensive (£5.90 for a small glass) and not particularly nice.- The décor has not changed for 10 years, and it looked pretty run down back then! Ah well...You can eat in scruffy surroundings if you get such nice, cheap food!!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "X52uLfAc05Sxrzbhdnrzpw",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. Huuuge Thali (I saved half for lunch and I am still full!)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X52uLfAc05Sxrzbhdnrzpw/o.jpg"
      },
      {
        "img_id": "BXG4sfX6ZhnjSFJ1yE5tGQ",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. Spinach and paneer dosa (Om nom nom)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BXG4sfX6ZhnjSFJ1yE5tGQ/o.jpg"
      }
    ],
    "user_id": "93vyTaJgzQRQO4Zs9Cg_pw"
  },
  "2Seqcw6AGs4RxKrKO6yyIg": {
    "date": "12/4/2016",
    "text": "DISCLAIMZ, PEEPZ:I've only been here for the buffet. No a la carte for me, nosiree.For just under a sevenner (if tenner is a thing, why can't this be the term for 7GBP?) you get full access to the buffet which consists of hot dishes and cold dishes (savoury), and a range of desserts. Don't miss the condiments though! I can't tell you what they are, but hot red and cooling white, and green and coconutty and and...ALL THE CONDIMENTS!\"Endless combinations\" --- overheard from another table. FACT.The hot dishes include dosas, chick pea curry, saucy paneer, fried pakoras, dhal, and deliciously fluffy naan to name a few. Don't miss the aloo palak, Indian potatoes with spinach! Cold dishes feature aubergine, various salads including my favourite with preserved lemon, and, well...some \"mystery\" things that I don't really know WHAT they are precisely, but they are worth some testing out. The basic premise is: you get a metal plate, canteen-style, walk up, fill to heart's content, repeat as needed.Indian/Pakistani desserts are not my usual go-to as I find them overly sweet, but I appreciate that there is fresh fruit as an option here, as well as a loose rice pudding-ish option (YES) and the standard - wait because this is not the actual term - donut holes soaked in sugar-syrup. Even if not to your taste, worth doing a little culinary adventuring. Someone else commented that the drinks are not the most competitively priced; both the wine and the lassis, for instance, I'd happily give a hard pass to. Instead, ask for a pint of tap water which appears at the table in a Cobra beer glass. Yelp note: just to be clear, my carnivorous friends...this is vegetarian. Vegetarian!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CkqmyV3UWUd70oM3F-PahQ"
  },
  "hch0jT82-4jXzh-ChkQo3Q": {
    "date": "5/21/2016",
    "text": "Top Notch Indian Vegetarian!I am not a vegetarian having always wanted meat on my plate. However if the vegetarian food was as good.. ahem.. well maybe not the main \"I\" chose... I would be a vegetarian every day. Ravi Shakar was a famous traditional Indian musician so it is a bit sad that there is no music here but maybe that would make it too cheesy. The starters are just amazing and most have yoghurt and tamarind and have a sweet and sour taste with a mixture of crunchiness. They are not spicy at all and I think we could have eaten each one and been happy without a main. It reminded me of the street food that Rick Stein had on his visit to India. We ordered three, the Bhel poori, the Paani Pooris and the Potato Poori. For some reason the staff gave us four dishes and when asked admitted to making the mistake with a smile and gave the fourth for free :-) Wow, that's the first time I can remember being treated so generously in a restaurant. If you are going here try the Dosa's such as the Mysore Masala Dosa and the Spinach and Paneer Dosa. South Indian food to me is all about Dosa and not curry. The Dosas  filled with spiced potatoes or with indian cheese (paneer) and spinach and are very generous. The Rava onion Dosa, which was my choice, I would not recommend as its full of what I thought was plain boiled Onions with no spices at all. Luckily for me my wife and our friend were willing to share :-). Sadly we could not indulge in the exotic Indian desserts as we were too full so will have to go there again soon.The price is just amazing as the total between us was £12 each and we walked away with some leftovers for breakfast. Of course this did not include drinks which we brought with us as they do not sell alcohol. The service in Ravi Shankar was excellent as they were quick,  they were friendly and happy to crack a joke. Well worth another visit.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WHDH8uhe3UORPnKbb0vWLQ",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. The main menu. Best to try the starters and the dosa which is true south Indian food.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WHDH8uhe3UORPnKbb0vWLQ/o.jpg"
      },
      {
        "img_id": "z-Be831hFZa6VmYherhxcg",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. The drinks and dessert.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z-Be831hFZa6VmYherhxcg/o.jpg"
      },
      {
        "img_id": "DSvYXpWnN8zrtCIP_7Kf9Q",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. Starters again... the bhel poori was just amazing.. sweat, sour, crunchy and soft all in one.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DSvYXpWnN8zrtCIP_7Kf9Q/o.jpg"
      }
    ],
    "user_id": "m09MljHKKXotjyXR02CEiA"
  },
  "YXUfZikFx_0gI8cku2FRLQ": {
    "date": "12/13/2017",
    "text": "I am very particular about Indian food, esp. vegetarian food -and I admit to being particularly worried about a place with a name like \"Ravi Shankar,\" however, the place we were aiming for was full, and this was nearby with a good rating so we decided to give it a try.  Very glad we did! Two of us had a couple of the thalis, letting us try numerous things.  I was stunned at the daal, not one of my favorites, but here spiced very well, just a slight bite that augmented the lentils really well.  Everything else was good, my wife, who isn't big on hot foods could eat everything, and I found it spicy enough that I didn't need to ask for something hot on the side like I usually do. All of the dishes were prepared well, nice mix, and extremely satisfying meal The chai after was also very nicely spiced  Recommend it highly - almost as good as going to Bangalore, and a lot closer",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n3AfTDppXYAd4lQtnEJtoQ"
  },
  "uphlCuJaNNEi5AB4DF8A6w": {
    "date": "9/12/2017",
    "text": "Great little Pakistani vegetarian. Food was delicious and even better the next day from the doggy bag :)The shabby interior only adds to its charm and the attentive staff are happy to explain about the dishes.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ucLx1OEC9quL9eo9K2UkQ"
  },
  "yvf_9dAAvt0kC5ikAYky_g": {
    "date": "2/3/2018",
    "text": "I'd never seen paneer kofta on a menu before, so I tried it.  It was fabulous; the sauce was out of this world.  Not much as far as decor or gracious service, but wonderful, reasonably priced food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7tW68RmEdcofqynUCXz2cQ"
  },
  "5-h5rlk-c54oDkPUiBXxKw": {
    "date": "2/4/2016",
    "text": "Very bad food. No flavor at all in the curries. Sad to see owners selling this under name of Indian food. Onion bhajji was completely burnt and over fried. Samosas and dahi papri was okay.Curries ordered: Kadahi paneer, daal, paneer kofta. All made from same gravy so had same taste and no flavor. Chapati and naans served were actually either frozen stale stuff or tortillas :(Very disappointed, staff didn't care to remove dirty plates from table.When asked for receipt, said that it is not possible to provide it. Very rude arrogant staff, said that's the way it works there.Try Dhishoom or Punjab restaurants way better in both service and food.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NeAicTddMnzpnUwNNCH2Lg"
  },
  "88oHkRuhjTvSUdo51pb0Mw": {
    "date": "11/27/2016",
    "text": "I think about this lunch buffet when I'm not eating it. I crave it and my mouth salivates in anticipation of the next time I'll eat it. Lots of variety, everything tastes great! New favorite Indian restaurant on Drummond Street :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ndKz9_BcWrJ54aZhcHhFxQ"
  },
  "VilxtewN1gddMSGv0Nps9g": {
    "date": "11/15/2014",
    "text": "+ Indian vegetarian buffet restaurant near Euston + Great value for money  Ravi Shankar is an Indian vegetarian restaurants on Drummond St. just off Euston. The restaurant is situated on a street with at least four other vegetarian Indian buffet restaurants. I have no idea if they are in any way related to one another. In any case, for under £7, its buffet is exceptionally good value for the money. The décor is basic but service is friendly and efficient.  In addition to all the usual currys and naans, it offers a variety of warm dishes. It is delightful to see so many different ways to cook vegetables. Anyone who believes vegetarian food is just bland and tasteless would find a nice surprise at Ravi Shankar, and perhaps any one of its fellow establishments on Drummond St.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fE_c3gDus7bjXa9WBjUOvg",
        "caption": "Photo of Ravi Shankar - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fE_c3gDus7bjXa9WBjUOvg/o.jpg"
      },
      {
        "img_id": "jg0AMhHMBsBSBhbnU2RZxQ",
        "caption": "Photo of Ravi Shankar - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jg0AMhHMBsBSBhbnU2RZxQ/o.jpg"
      },
      {
        "img_id": "VE-hSFnub-9gYjvYM95PXg",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. Inside therestaurant",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VE-hSFnub-9gYjvYM95PXg/o.jpg"
      }
    ],
    "user_id": "kBcnyWp2LIv2q0Q8WkFkJA"
  },
  "QnjeIJonW3WwOEvUxIaKMg": {
    "date": "9/25/2015",
    "text": "In my quest to try all the vegetarian Indian buffets on Drummond St, my friend and I headed to Ravi Shakar for lunch on a Friday. After a few minutes of waiting, they got us a table (in a VERY busy restaurant), and we hit up the buffet.So as a plus, this buffet has dosas! So that's always a yummy yummy bonus. However, I feel like the selection at this place was subpar compared to others nearby. They also seemed to be out of a lot of food, and nothing was really getting replenished. And for a buffet, that's not ever a good sign.Since we were seated upstairs, the service was pretty poor as well. We ended up having to get up and head downstairs to pay, as we barely saw a server.I mean for £7, I don't expect a whole lot, so I'm sure I'll be back if someone wanted to, but for me, this is probably my least favorite buffet on the street so far.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "higMLJL9PBOCbQi-qkT6NA": {
    "date": "10/31/2015",
    "text": "Never taste Indian food,it was a fresh experience ,but Too salty and sweet.the stuff were kind.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ihW-ENvFy_JPSCp6FQ2RQ",
        "caption": "Photo of Ravi Shankar - London, United Kingdom. Too salty to me",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0ihW-ENvFy_JPSCp6FQ2RQ/o.jpg"
      }
    ],
    "user_id": "687mK13aI4cFU2r64sXFnA"
  },
  "Jf68X3hfEu4YjBvORQsF6g": {
    "date": "1/23/2016",
    "text": "Despite being a result for a \"vegan\" search, they only have one dish that is dairy free.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sug1lEdUTbIWo9XIzy_sNA"
  },
  "KikMS71RSLT_i5QpcKIXHA": {
    "date": "12/11/2014",
    "text": "The weekend buffet isn't your typical Indian buffet.  The food looks like it came out of Grandma's oven.  Everything has a style and panache that set this restaurant above and beyond that of so many others.Whenever I fly across the pond I make sure to stop and grab my favourite weekend meal!In an effort to keep an open internet I've decided to sign my name to all my reviews.Best,Adam Koppekin, Attorney at Law, Encino",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "1YYXDWvr14ZZTn1ioo_9SQ"
  },
  "BZolmJQyLUuyCz1PV_JZSw": {
    "date": "12/3/2012",
    "text": "The Ravi Shankar is just one of many Indian restaurants in that street, but I really recommend it as it has very nice food and a fast service.We went in after an evening in the Welcome Collection around the corner. The waiters were really fast ... maybe a bit too fast ... as the menu is extensive and had some unknown food on it. I needed time to study, but we had someone pop by our table on a regularly 2 min interval. It's not really a place to linger and have a slow meal with a long discussions about the existence or non-existence of the human conciseness in a Descartes universe. Not that I ever have these discussions in a restaurant ... that's only for posh wine bars.I also agree with the review before: The tables are tiny. Even without a computer we had problems placing all our food and drinks on it.On the other hand the food was fast, hot and very yummy! Really a place I would like to go back to.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "12LqnX6x89WG3PugbIJDhw",
        "caption": "Photo of Ravi Shankar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/12LqnX6x89WG3PugbIJDhw/o.jpg"
      }
    ],
    "user_id": "pWAOEhPe-us-ScMTSF6nSg"
  },
  "3NfpeuDAvYJMc6nKfy90Ew": {
    "date": "8/12/2015",
    "text": "Excellent vegetarian Indian cuisine and good service. Walking distance from Euston train station, and very central in location. It is very close to The ibis hotel on Drummond street. Excellent food and good value for money.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NdIZBuXQaQ6JpIXmYV-YLA"
  },
  "pCeswGFFYM8OrJX9dcM-Iw": {
    "date": "8/28/2014",
    "text": "When I'm around Euston there are a few places I frequent for lunch and given I hadn't been to Ravi Shankars for several years I thought I'd pop in to sample their buffet lunch. It's one of those 'all you can eat' offers that proliferates around Drummond Street with most costing around £7, including a desert or two. It was pretty packed but I found a table for me and my shadow. The guy who greeted me was a bit miserable and clearly wanted to be somewhere else, maybe in a Bollywood movie crooning some maiden. He was elsewhere for sure ... but I know the routine and didn't need 'service', so just get outta the way dude!You grab a large metal plate and then have the tricky job of deciding what you want to major on. It's all veggie here so I'm happy. You really won't be stuck for choice. There is maybe every South Indian veg option ever invented available! The rice is good quality, the curries tick all boxes taste and looks wise and there's nans, popas, dosas to dunk.It's one of those places where you sample lots of little portions rather than slop on just one or two. All are tasty and 'home style'. I had a sweet lassi, which was Ok, par for the course, and a few bits from a somewhat average tasting but decently wide dessert selection.All in, I spend less than £10 including tip and enjoyed it. I kinda wish my was stomach was bigger 'cause I could have gone back for seconds easily. So, it's maybe no great shakes on the service or decor side of things, but top marks on value.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Nf2q1i-fUYy0OlYtPAJzw"
  },
  "8eUpmzyr6P31X3iYvJDBRA": {
    "date": "10/15/2015",
    "text": "This is a well established Indian veggie restaurant with a great reputation which is well deserved. Near Euston station,or Warren Street. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_51GbQMYHrq3EeLOeIA5dA"
  }
}