{
  "JlVQPcD1jMVmwHOgg2jsxA": {
    "date": "10/2/2012",
    "text": "Top notch! The best temaki I've had here. Simple. Easy. Delicious.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "i1esQQaWKnrs-x7ECgU6tQ": {
    "date": "8/24/2015",
    "text": "Tasty sushi. They specialize in hand rolls and don't have a crazy large menu but we tried three varieties and all of them were great. No alot of space to sit, so better if you can take out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0P2cSl3qtbo0VEh5FElyEA",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0P2cSl3qtbo0VEh5FElyEA/o.jpg"
      },
      {
        "img_id": "ktWMo_4gZg1PZI4YtquCLg",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ktWMo_4gZg1PZI4YtquCLg/o.jpg"
      }
    ],
    "user_id": "asQKc9i0VDkaz_9iBCwhvg"
  },
  "ZPjyG_ogjQNucZxk7WnG8w": {
    "date": "11/20/2013",
    "text": "This is a great place for lunch if you're working in Soho and want some good quality sushi and want to splurge a little.It's famous for it's hand-rolls, but I really enjoyed everything they have since their ingredients are very fresh. But beware my male colleagues had to get seconds because it's really not enough to get full, so it might be too expensive if you have a big appetite. I also commend their decor: modern, stylish and minimalistic, it's a great place to bring down-to-earth clients who appreciate good quality food and design. Can't wait to come back here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M1Lt6xzFriw1p2fzbGIVgg"
  },
  "VAsL_u5Uel2sBLRqvdE8Nw": {
    "date": "10/31/2013",
    "text": "D-licious! Yoobi makes their sushi (hand roll- temaki or cut roll- maki plus sell some sashimi) fresh upon your order and so all of the ingredients are fresh.  For a \"take away\"/casual dining spot I have to say the fish is the freshest I've tasted for this genre (easily blows Yo sushi and the like out of the water).  Whenever I'm in the neighborhood I always find myself heading in for a snack or two or three. ;) The only downside and why I don't give it 5 stars as they tend to load their temaki with mayonnaise (or some derivative \"sauce\"), I like my sushi fresh and healthy and could do without so much (sometimes would prefer none at all).  Next time I go in I'll see if they amenable to special orders regarding lightening the sauce and will report back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bk8vptdyN5iH9pM8_SB1cw"
  },
  "4-VV_FBILGxfqhocaIWY6A": {
    "date": "8/15/2015",
    "text": "Very good food, decent pricing, unique atmosphere. Service was a little slow but this was a solid stop.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1J87dFZT5VspbEZm5SWHAQ"
  },
  "xI21Lmi89TyEGUENsM8sKw": {
    "date": "7/18/2015",
    "text": "The freshest and most flavorful sushi I've found in London to date, and for a great price. The fish was incredibly fresh, the sauces perfect, and combination of flavor awesome. Cool ambiance, great place to take anyone",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MDFhmJyAV5_IwNX3JQ1nw"
  },
  "p_AGUFetr6PUtVzaHmQ8QQ": {
    "date": "5/9/2013",
    "text": "I really wish I could bring this place back with me to NYC.  Their 20 hour cured salmon hand roll is really delicious.  It was a decent amount and only 4 pounds.  I haven't come across any other sushi that has asian pear in it for that price.  I'm not a big fan of salmon in sushi either but this place really works it.  The hand roll is what they're really trying to sell.  Though it can be difficult at times especially when you put wasabi on it and it smears onto your nose as you try to eat it.  However, their flavors are worth the trouble and it could be a little fun actually.  They do serve it as typical pieces of sushi as well for a 1.5 pound more (they put more rice and stuff - 8 pieces).  The atmosphere and interior design is really cool and modern as well.  Would definitely go back to try their other flavors.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPtdGu1WStBmXB2sxIPc5w"
  },
  "ebp5P8AbdmymOcoDF-N7Ug": {
    "date": "11/18/2012",
    "text": "I was sort of hoping this would be more of a restaurant, and less of a takeaway lunch place. While they do have a decent amount of seating, they certainly cater to the Itusu/Wasabi/Abokado lunch crowd (though admittedly more interesting and tastier). And quite frankly, the food is more suited to a lunch crowd-- even if you're eating in, you pick your beverages/salads/sides from a refrigerated case, then order from the counter then sit down.Can you tell I came here for dinner and was left a bit wanting?It was really good. I wish it were near where I work because it would be an ideal lunch: flavourful, light, healthy, quick.For dinner, however, I would have had to spend quite a bit of money to be sated, and at that point, I might want a proper sit down sushi restaurant. 4-stars for lunch, 3/2 for dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "_46qCU3dKSMp4nNuJ4pKMg": {
    "date": "12/6/2012",
    "text": "The interior design of this place is spot on - geometric patterns and wood everywhere lend the place a strangely Scandinavian feel that, weirdly, doesn't conflict with the Japanese (ish) food they're serving. I love it!The hand rolls are massive and just about justify their price. The citrus salmon one is definitely the highlight here, and while I'm not a huge fan of the way they finely chop the meat I must admit that it gives the ingredients in the roll a decent distribution.But! £2.60 for jasmine tea? Really!? That, my friends, is so far past beyond the realms of reasonableness that I'm not entirely sure how to respond.  If you go here, stick to the free water!So yeah, It's good, but don't get the tea. Whatever you do.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kO86Mqo5zhlFg88tX09-CA"
  },
  "HSP_5Wm-5FsGMJJBSlSL_g": {
    "date": "8/5/2014",
    "text": "Don't get fooled by the low prices. The sushi is amazing. Oh, what am I saying, everything is delicious at Yoobi - rich, vibrant food that is presented quite interestingly. Temakis are especially good if eaten on almost empty, late from the presentation, starved stomach. The spot is calm and cozy and fills you up right.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hrYQQEO2M-mrzU_QTEqq4Q"
  },
  "3tTf9f0UjsD2b7fdDoaSrw": {
    "date": "9/8/2014",
    "text": "A great little place for some good sushi. Staff and service is outstanding. Order was correct and the amount of rice vs sashimi was just right. If your looking for a nice little place to enjoy some sushi, I susget you try this place. Make sure you come hungry. Cheers, George",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gn0ctjr4bcEi6oTrrMpLxg"
  },
  "_Jo9JgYMEvWaJKeIeZwBXQ": {
    "date": "4/8/2013",
    "text": "I always find myself critically analyzing the meals justto make sure they meet my stands of excellence. On this occasion the food wasexcellently simply the best!I will definitely be comingback!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NF0qRJEOFBmuRPDaTHeXRA": {
    "date": "8/29/2014",
    "text": "Unique Brazilian-style sushi cones - great for lunch or a quick, casual dinner where you want to go somewhere cool but don't want to spend a ton. Nice modern decor.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zP53rcqQXGfhr0IVk-4jYQ"
  },
  "DF5YgbKUPPy7sPjlhjfYaA": {
    "date": "9/4/2014",
    "text": "As a temaki fan I had been anxiously waiting for a proper temaki place in London. I always wondered why I couldn't find one. Fortunately, one day, I came across Yoobi and I call tell you: These are proper temakis! I have had them in Rio, São Paulo, Lisbon and Milan. Places where the temaki culture is huge or rapidly growing. So if you are interested in trying these amazing sushi cones, I would definitely recommend Yoobi. Great atmosphere, excellent and fresh ingredients and a very nice temaki menu. A menu that goes from simple to deluxe options and that shows that they thought about it and tried to take it a step further with their temaki creations. What can I say more? Elaborate and delicious temakis!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjDUUhVhVVlWCNnes7oZdQ"
  },
  "0sgMNyTWMbq5KdHZCbpA-w": {
    "date": "10/23/2014",
    "text": "More of a fast food sushi place.  Positives: Fish was fresh. Staff is nice Prices are lowNegatives:Small selectionMiso soup was cold, had to have staff reheat the entire pot but got the soup complimentary as a result.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8H5C7Ge8s7WwlbdqLecGA"
  },
  "bo83pH4xMlYGohqlvFPSrw": {
    "date": "7/13/2013",
    "text": "Yoobi is a rare find - it encompasses value, quality and style.  Situated on a quiet corner of Soho, near standbys such as a Fernandez and Wells and Andrew Edmunds, Yoobi serves up the freshest temaki and sushi you can find anywhere.  The food is not traditional Japanese - it is a very modern and different twist on the Brazilian temaki concept - for instance crunch is a concept typically not seen in sushi, but here it is commonplace.  Also, the use of spicy sauces as well.  My favorites are the black tiger prawn temaki and the crab.  I'm also waiting for a return of the unagi!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kE-0CmhkXRnpD1NZDawBfQ"
  },
  "SnOiWrrfXpq5AjgNhY2qQg": {
    "date": "8/12/2014",
    "text": "Excellent sushi, no doubt about that, and the place is col and always plays good music, BUT the service in the evening set is not very good and has been much better. 5 star for sushi, 2 for evening service",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3AlRpUZq6sRFAAX6kkJqWg"
  },
  "SRX1iQPidXREfE5NlGNnLQ": {
    "date": "7/28/2015",
    "text": "Good service and good food. Problem was the lack of tuna, salmon, or crab leaving almost no options. As long as they supply food it's a go to!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTfRHOstvC46lhHdAkkqhA"
  },
  "dYf9bici8Y01wU1Kv86M7Q": {
    "date": "4/26/2012",
    "text": "Yoobi were in their soft opening phase when I dropped by. As the card machine hadn't yet been installed I was forced to rummage for pocket change and had just enough to try a spicy tuna temaki which was delicious. Eight varieties of freshly made temaki are available, fresh wasabi tuna, and 20 hour cured salmon also looked good to me. What's more the temaki is only £2.50 during the soft opening week. Apparently this will rise to £3.60 next week! So drop by for a bargain before its too late!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fRTby8Cl5r440v0XoiZuag"
  },
  "o-D-ELRjeWWEGAmg65FtYg": {
    "date": "3/8/2015",
    "text": "Amazing sushi for takeaway and eat in. The menu is a bit on the short side but it makes up with the quality and taste.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "po-GMj92N59WmZ10mvNPKg"
  },
  "n_uGnu3cYtLeQOULvqYumQ": {
    "date": "4/25/2013",
    "text": "I recently visited Yoobi and I was impressed by the Tamaki's and Sushi's that were perfectly fresh. When I first visited the concept was Temaki coupled with Sushi seaweed cones which I thought was very inventive especially when considering the flavours. This left me desiring even more. To say the least the food was excellent and simply the best. Definitely one should check it out.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "l2Ml7Ir8R_VnPDXpqWuy3Q": {
    "date": "8/9/2013",
    "text": "I am beaming with gladness to have found Yoobi to satiate my sushi cravings. Since my first visit I seem to find an excuse to go back or have my husband pick up  some takeaway. Their menu is not extensive but a good variety. The food is simple, fresh, delicious and made to order. My personal favorites so far are the Citrus Salmon and the Crunchy Prawn temakis. I enjoy the tangy taste and crunch combination of Citrus Salmon but I also find the spicy kick on the Prawn temaki irresistible.Aside from the food, I am also a fan of the business setting: modern, minimalistic, simple and practical decor. Having the wash sink in the dining vicinity to wash your hands before devouring the mouth watering temakis is a brilliant idea.Cant wait to go back for more sushi goodness.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "EVMw1XqELLm2Mg-rj2uhww"
  },
  "umkSpLvxqzhXWiON7wv-LA": {
    "date": "9/21/2016",
    "text": "This place has good food, the service isn't the best though. I had to ask for things I ordered, they didn't hear my order. I mean they're accommodating but it's annoying and almost embarrassing for me. Other wise the service being a miss and hit at times, the food is amazing. I would highly recommend for take out!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYHau3shShFmvTAXYHqYpQ"
  },
  "09k23EW2XOGAb_DvfnSn5w": {
    "date": "2/15/2015",
    "text": "Yoobi yoobi yoobi!!I came Friday to satisfy a rather serious sushi craving that I had. Hadnt heard of Yoobi before but reviews were pretty good so figured it could only be a good experience :)Yoobi's thing is their Temaki, which I had had (and made :-D) before but never a lot of. The flavours were good, and as you may know, i looooove myself some sushi on any night ending in a '-y'. I kinda preferred the maki which all their temaki comes alternatively in because you can share it, but everything was still really good.My only bugbear was that perhaps the rice was overcooked(?) because it was a little too \"squidgy\",but heir Miso was wonderful and I can see myself coming back :)Staff were friendly and I loved the presentation of everything. As Kryten says, the first bite is with the eye.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8JeTyxMflxvCvKlvWQIb9g"
  },
  "dEHY6YYtDqww2nPwAxopaA": {
    "date": "10/18/2016",
    "text": "I ordered the sun-kissed tomato maki and edamame. It's been over half an hour and still no sign of my maki roll. And there's literally 3 customers in the restaurant right now. They served my food after reminding the waitress that it's been half an hour, only to find a hair in the roll. Really disappointed. :/",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7IWBU2Wcr5M9RMdZCXJTg"
  },
  "xDDkGk-fCQI0oHCeziLzzQ": {
    "date": "3/17/2013",
    "text": "Ok, so since first trying this place nearly 6 months ago, I've been back quite a few more times and I just love it. It's definitely the best place to get something quick and yummy. Lately I've been in the area a lot - shopping nearby in Covent Garden or Oxford St, milling around Leicester Sq or waiting to watch a show in the West End, and I keep telling myself to go somewhere else, try something new, but I always end up at Yoobi.My fave is the citrus salmon temaki, which has a bit of a crunch to it. I've also had the 20-hour cured salmon and some of the specials - the Philadelphia and the King Crab - all good choices. And now, they also have mochi ice cream dessert! They list about 20 different flavours, and when we were there, they were sadly out of most of them, but the toasted sesame and frozen yogurt ones that I did have were delicious. A bit small for what you pay for, but good nonetheless.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4uzsO9I7U6sihbazbA6kmQ",
        "caption": "Photo of Yoobi - London, United Kingdom. Citrus Salmon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4uzsO9I7U6sihbazbA6kmQ/o.jpg"
      },
      {
        "img_id": "vapQqTgk22tUnq2Cc2Opow",
        "caption": "Photo of Yoobi - London, United Kingdom. Mochi ice cream - frozen yogurt, toasted sesame and mango chili",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vapQqTgk22tUnq2Cc2Opow/o.jpg"
      }
    ],
    "user_id": "nOQlGpgqq2MBCuEzxLMm4g"
  },
  "Hg9yP6Lvp-WVUKklro9b_A": {
    "date": "3/25/2015",
    "text": "The food was awesome but the service was very disappointing! Our waiter gave our sushi to the people who has just ordered sitting next to us (by accident). Once we asked him and told him we'd been waiting for a long time, he just tried to cover it up. If he admitted to it and said sorry, it would have been fine, but instead he ignores us and never even filled up our water glasses! I'm not sure if this restaurant even has specific waiters for each table- maybe if it was a bit more organised it would run a bit smoother...We felt very discouraged to go back here, which is a bummer since the food is good!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGKkBKs-K4SH4xsgiprYIA"
  },
  "7YCzAF1IJ8RlrHc4NdzbRg": {
    "date": "2/22/2015",
    "text": "This place was fabulous! I absolutely loved the set up of the menu where you have the option of having your sushi in a cone or in a roll, then pick the kind of fish you want depending on seasonal sets.  I ordered a spicy vegetable miso soup which was great to start off with.  Then I went on to order a sun dried tomato and cream cheese sushi cone, then a smoked salmon rice cone.  Both of them were incredibly fresh and were made to order.  I would definitely return to this place as it was quick, cheap, and delicious.  They also deliver which is dangerous because I am always going to be tempted to order sushi!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TV-4Wx6yDG6IniESsayeOQ"
  },
  "oAWy-HWc02LIlPGF9EcU_g": {
    "date": "5/11/2015",
    "text": "Great food for a good price. Worth it!Very cozy space not a tourist place. The service is great. Nothing to complain.A gem right in the midlle of London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xKRsgV4_oZRuZSS1MtTgYA"
  },
  "NHqcx_xxUil7eoMhfX8r_g": {
    "date": "6/4/2016",
    "text": "A bit expensive as the portions are not really big. Taste is modern, not traditional recipes at all.Was good but not exceptional. Service was fast as we arrived before the crowd",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFtgT_JnJitGt3fD8BMexQ"
  },
  "hy9kanegu2tj2C_eNjlpsA": {
    "date": "2/21/2014",
    "text": "The freshest darn Sushi in town!!Of course the independent sushi bars always trump the chains..Stand alone Yoobi specialises in Temaki- hand rolls which have been inspired by the large Japanese population in Brazil oddly enough! The sushi cones are surprisingly filling and very reasonably priced (£3.20 for a simple hand-roll). I would probably have two for lunch and be pretty stuffed!The staff here are always so accommodating and make you feel part of the Yoobi family. Almost makes you not want to leave :)The service here is incredibly speedy, perfect when you are on a tight lunch break and not to mention on a diet and want to avoid the dreaded fast food chains..I would recommend the spicy tuna and tuna tartare Temaki and finish off with the epic ice cream Mochi!Definitely pop in if you want a quick, delicious lunch that won't leave you feeling sluggish to power through the rest of the day..girlyvsfood.tumblr.com",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hvBlr077IAv63SEENhCRyw",
        "caption": "Photo of Yoobi - London, United Kingdom. Tuna Tartare and Crispy Salmon skin Temaki!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hvBlr077IAv63SEENhCRyw/o.jpg"
      }
    ],
    "user_id": "NjT5S1XcmmEWTjxCthhW9Q"
  },
  "KZ1OIOQXwdJvO4oSkS4UbA": {
    "date": "9/5/2014",
    "text": "Yoobi is one of those places that I am always tempted to pop in and get something quick whenever I find myself down lexington st, usually to turn a corner onto Beak street for a Fernandez & Wells coffee, or is it Soho Grind these days? I can't decide.Yesterday was exactly one of those days. Decided to have a pre-dinner meal, as you do. I ordered the fresh wasabi tuna, citrus salmon, tuna tartare and salmon sashimi. All were A-OK, it wasn't phenomenal by any stretch, but it eased the craving, even if just a little and their flavours do work together very well. Their ingredients are fresh, from what I can tell. No complaints.Except one. There's always a complaint. Haha. The soya sauce, I don't know why and how people source this soya sauce, but it's the same one that they serve in your M&S sushi or any wretched sushi, it's a heavy soya sauce which is too salty and leaves a slight bitter taste. Stop it, please. It kills anything and everything good. The temaki is sufficiently flavoured and so I don't use it for that, but it ruined the sashimi for me. =(",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DC2dBX8vPcIGlKVm9VuidA"
  },
  "dP9jnhsazhl0e3LxO6whGA": {
    "date": "5/26/2015",
    "text": "the sushi is amazing here and the seasonal miso soup is super yummy!the staff is very polite and helpful.Really nice place with a great atmosphere!would recommend to EVERYONE! :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ktQx8STPq87mRwC2PObNA"
  },
  "6jJqTQdruhYdRCykSd8IAg": {
    "date": "2/7/2015",
    "text": "Food of LOVE. Had the citrus salmon temaki and special El Smoky Chipotle (tuna) both with rice. Excellent taste. Service is very good, interesting this is the most European group of sushi chefs I've ever seen. Music and atmosphere is quite relaxing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dx95sHpZu8nTtZqtFm4Ufg",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dx95sHpZu8nTtZqtFm4Ufg/o.jpg"
      }
    ],
    "user_id": "y04wxOLtPNcKiCErRBvqiQ"
  },
  "uL0xdjA6AduJg56sWy1lMw": {
    "date": "4/15/2014",
    "text": "I really love Yoobi. Don't expect sushi rolls or nigiri in the traditional sense though, the attraction of Yoobi is their speciality: Brazilian-influenced hand rolls.Done up in seaweed cones full of rice and awesomeness, each temaki I have tried has been perfect. Spicy tuna has a great level of heat. Citrus salmon is my favourite, with a wonderfully zingy mayo blending with the fresh fish and crunch from croutons and green-as-can-be salad. I've also tried the 20-hour cured salmon, which includes some asian pear to really add some freshness and texture, making it quite distinctive from the other dishes. You can get the same menu in roll-form if you so please, but I prefer to leave that style for the traditional Japanese delicacies; besides the temaki feels a bit different.Yoobi also does sashimi boxes as well as simple desserts, sides, and soups; though I am yet to sample any of these. They have Brazilian \"Guarana Antarctica\" in cans if you feel the need for a caffeine hit whilst you're in there; otherwise the usual drinks are available on top of a help-yourself water station.With 3 categories of temaki each containing varying levels of complexity, it's easy to pick out the items you want. Service is friendly and food comes quick, and in a handy container if you order take-out. If you're sitting in, the restaurant has a lovely light feel to it; given the casual nature of the food and the service, it really fits. Yoobi is a little out of my price-range for lunch, as I tend to be hungry enough for 3 rolls, which will cost you around £10 depending on your order. Still, it is good value, tasty, and different, which can only be applauded!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "p0tGE0tPVnMj_jVh91STvw"
  },
  "-z6nJBIQTtJ5gx_BJj6UPw": {
    "date": "9/16/2015",
    "text": "Great quick sushi place for lunch.  Service wasn't the best,  but the sushi rolls were great. For the location and price I'll for sure be back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  },
  "9k1rqeYMlTSMSDA54s1A9g": {
    "date": "8/15/2013",
    "text": "Always busy and bustling, but well worth the wait. The temaki rolls are made fresh when you order, so they don't have the plastic-ky softness that pre-wrapped ones do - even the places where they're wrapped in the morning I find the rice tends to soak into the seaweed wrap.Fantastic miso as well. Great for a short, sharp stop-off with great quality sushi to boot.  I go for the Scottish Salmon every time as I like clean flavours, but there's lots to choose from on their small but perfectly formed menu.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "P27bQcSOCsiRsv5wKwO3uw"
  },
  "PcHVOawj_vXtpTk9lCZ3Mw": {
    "date": "7/10/2014",
    "text": "Placed a lunch order online. Partner went to pick it up. They never received the order. Yes, I placed it. Yes, it went through. Turns out only one manager had access to the e-mail address that receives orders. That manager was out, and therefore nobody was picking up orders. What even is that.Partner ended up waiting for everything to be made which defeated the whole purpose of ordering in advance.Salmon was good, but not great. Tuna was forgettable. Yes, the temaki are big--but they're stuffed with more rice than filling, to a huge degree, as are the rolls. It makes for an unbalanced mouthful.Up side, their rice was of good quality, but I felt like the price and flavour didn't actually meet in the middle.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y8Fc_lP3Lgzns-0XXaLSEQ"
  },
  "89ziviV-zucmD-E-2OEeYw": {
    "date": "7/7/2014",
    "text": "Cozy little place on Lexington Street - escape the rush from Oxford and Regent Street. Nice music and a nice atmosphere that makes you forget about all the people outside! A perfect place for lunch. There speciality most be hand rolls go there and you'll see why! There tuna tartare is amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Se46UdWgBEhXJgRGphQTug"
  },
  "tO7-wwz0bulJ6j4maW-MoA": {
    "date": "9/10/2014",
    "text": "This place is very cool ! Love the way the place is decorated and the design of the menu.In terms of food, they have very original Temaki recipes, you can also chose to have same ingredients in a Maki with a little supplement.The staff is really nice and careful !Music can be a bit loud there and in the spring/summer you can eat outside !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vx-FqwJxqdHgNDAjTO6Evw"
  },
  "3Szc3eOcaeMoBUaQy7zwnw": {
    "date": "6/10/2014",
    "text": "First of all, this place is a great value.  Decent temakis (hand rolls) + cheap prices are always a good thing.  The fish tasted fresh and I went in during a weekend so I even had wait service!I liked this place because they only had three types of sushi: salmon, tuna, and veggie.  All their temakis (or maki if you prefer) and sashimi contains those things.  Two temaki rolls should fill you up but even if you have three (or ten), the price isn't too bad.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U49OIE3UVYO2ihYRCeO19A"
  },
  "iD06XSQVSn84DRe1mA8jNQ": {
    "date": "5/7/2018",
    "text": "Simple straight forward menu. Hand rolls are their speciality. The restaurant was clean. The fish was fresh and the service was good. Left thirsty cause we never got our water. In a city full of options, too I is good but doesn't stand out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EY8YJowKnFJONE5mGacBCQ"
  },
  "amyAbMqY9cWaYqMvawOZTA": {
    "date": "7/9/2018",
    "text": "Lovely enough quickie sushi, but guys, you need to use fresh wasabi and ginger. Any resemblance of freshness is lost there. imho",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YiebHQyl14ea6HN3YDOIVw"
  },
  "21Ug96Ykt2WH7i3ogQL-lw": {
    "date": "2/1/2017",
    "text": "Yoobi has become one of my favorite takeout places in London. I've had quite a few of their cones recently, as Deliveroo has had a free delivery deal going on with Yoobi for the last few weeks.It's definitely non-traditional temaki, with inclusions like croutons, lemon, and lettuce into their sushi cones, but the flavours come together very nicely! The Citrus Salmon and the Spicy Tuna temakis have been my favorites thus far, although the Scottish Salmon is really tasty as well. It's also nice to see that the fish they use is all sustainably sourced!Will continue to order from Yoobi in the future.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FWHcXc9fBi2J69BIEnKO2w",
        "caption": "Photo of Yoobi - London, United Kingdom. Scottish Salmon, Spicy Tuna, and Citrus Salmon.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FWHcXc9fBi2J69BIEnKO2w/o.jpg"
      }
    ],
    "user_id": "pq6FpYSndrrXdK6jLTb0pg"
  },
  "qqstx4cxcMgb5T1WPq5sHg": {
    "date": "5/11/2018",
    "text": "Picture a dystopian nightmare invented by a 16-bit AI and you've got Yoobi: garish marketing, soulless and expensive food and strange mixtures of things that don't combine. Avoid completely.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxxXu9W_U9W7viow0NDJ-A"
  },
  "2bDw4UjYmr_qrLypJ_tTrw": {
    "date": "9/30/2017",
    "text": "If, like me, you think that tips should go to the people that earn them, i.e. the staff, then please do not eat at this restaurant. It is a disgrace that restaurants add 15% for service and simply take the money as a way to improve sales.I feel bad for the staff who clearly are embarrassed to answer the question \"does the service go to you and your colleagues\" given the answer is no.The only way that restaurateurs will learn that this is a highly unethical practice is when customers boycott their restaurants until they change. Quite a few large chains have stopped stealing tips as a result. If they don't change, they deserve to go out of business as customers stop spending their money at places who rip off the customer and rip off their employees.Please do not eat at this restaurant until the owners publicly state they have changed their policy and staff will get the service charge that is added to the bill. The owners should also apologise and back pay their employees.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTirIhp6uCa5M1_fWtYH4w"
  },
  "cFi8PtNCpXBxMkM0OcUP7w": {
    "date": "11/27/2017",
    "text": "Used to go here all the time when I was staying nearby.  Came back for a quick, early dinner and was pretty excited even though there were only two other people there (sitting together).  Walked up to the counter to order, and they told me to have a seat.  5-10 minutes later after watching the 5 staff members ignore me, I gave up and left.  Super disappointing.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjKG1aPrQ1-ykyl7uThzLw"
  },
  "jURMSp8KQ2A5BO9HqyX09A": {
    "date": "1/27/2016",
    "text": "Went to Yoobi for after work dinner and it was pretty good but not amazing.Yoobi serves typical western style sushi with combinations such as spicy tuna and crab california. You can choose to have them as either hand rolls or as sushi rolls (which will cost ~£1.50 more).Surprisingly the hand rolls are much nicer than the typical sushi rolls. Another surprise was that the fish served on the sushi was freezing! I know sushi should be served cold.. But not thaaat cold! The mochi ice cream balls we had for dessert were also frozen solid.Other than that there weren't that many other faults (although service could be quicker and friendlier).Although I wouldn't rave about it I would probably go back because the flavours are there and it isn't crazy expensive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ADpNMJ7giEgNJcWyTWTqQ",
        "caption": "Photo of Yoobi - London, United Kingdom. Salted caramel and matcha mochi balls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ADpNMJ7giEgNJcWyTWTqQ/o.jpg"
      },
      {
        "img_id": "CMhJ1CJS9K4aR8FDu-Gn-A",
        "caption": "Photo of Yoobi - London, United Kingdom. Tuna tartar and yellow fin hand rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CMhJ1CJS9K4aR8FDu-Gn-A/o.jpg"
      },
      {
        "img_id": "YtAuhuXiw90iDlUVN5qyhw",
        "caption": "Photo of Yoobi - London, United Kingdom. Tuna and prawn avocado sushi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YtAuhuXiw90iDlUVN5qyhw/o.jpg"
      }
    ],
    "user_id": "lmbtRXRVjtsLCIAP8yAzIQ"
  },
  "pgJiE995-nn45BdMiBslQg": {
    "date": "9/29/2015",
    "text": "If you're walking around in the Soho area and are feeling peckish, this place is great for a snack.  Handrolls really hit the spot and they've got some nice creative combos.  A couple handrolls can make you more hungry and they'll add up in price so beware - you might as well go for a proper meal if you have more than a couple.Service is good as the server was really attentive.  Nice ambiance and great location right in the heart of Soho.  4 stars instead of 5 as the handrolls could be cheaper.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YeBpdPCL85AXizUdPmpYyQ",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YeBpdPCL85AXizUdPmpYyQ/o.jpg"
      },
      {
        "img_id": "-WgizuBEWgijECdKmTmlaw",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-WgizuBEWgijECdKmTmlaw/o.jpg"
      },
      {
        "img_id": "QCX-GxRZ4-lmpmBxCyYFow",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QCX-GxRZ4-lmpmBxCyYFow/o.jpg"
      }
    ],
    "user_id": "jU7oGy4C6rMIO9EeRCGqZg"
  },
  "kkDpAKWVdWO0GUaxgUPp_A": {
    "date": "9/14/2016",
    "text": "The experience has left me pretty sure I won't be back. Mainly it's down to very poor service, forgetful and absent minded. That is very surprising as the place was rather empty and the staff were not busy at all. We ordered two hand rolls and sashimi. The two hand rolls were brought over with no napkins, wasabi etc. These are small portions and go down quickly. After waiting a while we asked where the sashimi was. A little later, we were served with food that we didn't order. That was then taken away. Finally about 40 minutes after initially ordering (food that requires no cooking), we got the sashimi and the two hand rolls (again!!!). The wasabi and dipping bowls came later, in a reverse of the regular order of the universe. After complaining to the manager he apologised and discounted the bill so I'm giving it two stars for trying to correct their errors. Still I would rather they train their staff to pay attention to orders. The food is fresh but expensive for the small quantity you get.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZgjYZRMkFNBJIuSh5oR82Q"
  },
  "yXRuWaHwMYOSJCxIhiIGMw": {
    "date": "2/20/2017",
    "text": "It's a nice gimmick overall, the fish is of good quality. The nori could be fresher, but for this cheap you really can't complain. It's also nice to hang around after you're done, which is more than can be said for other cheap sushis in London.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "ypkpEFyS_c5D2KkGtn_fow"
  },
  "uZ4zu9y6JEWExRbZEELMuw": {
    "date": "5/28/2015",
    "text": "Tried today for the first time, and have to say this is *the* perfect lunch spot in soho. Tucked away in a tiny alley, we went at 12 so it was fairly empty still, though a few tables were occupied. It has a modern, fresh and colourful décor and tiny tables. It's quiet, in a nice way. They specialise in temaki rolls, but you can chose your base option (3 types of salmon, tuna, veggie options, etc.) and then pick between temaki or maki rolls, if sushi-cones aren't your thing. I've ordered a citrus salmon temaki (delicious, also topped with tiny croutons), a seasonal miso soup and a set of salmon sashimi. The temaki and the miso soup were the best I've had in a long time, though the sashimi was fridge-cold which is really the only fault I could think of about this place. Paid just over £10 for everything. Definitely will be coming back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JhdclFbqz9WHZa84uV4EWA",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JhdclFbqz9WHZa84uV4EWA/o.jpg"
      },
      {
        "img_id": "jBK_TsrmhSLA3zZSU6y-Ww",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jBK_TsrmhSLA3zZSU6y-Ww/o.jpg"
      }
    ],
    "user_id": "CPQpUUUJPEEa0SWuOqB13w"
  },
  "vG98w2xrrdEgndeQFjwHwA": {
    "date": "4/6/2016",
    "text": "Well, it is an ok place, not mind blowing but good in a healthy way. Spicy tuna cone with seasonal veggies and citrus salmon were my favorites. Crunchy tiger prawns are not fried but interestingly fresh crunchy. Service pretty good and fast. I think I need fancier sushi than this.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IFx-WHDIBwkfc6CjXLu-Yw",
        "caption": "Photo of Yoobi - London, United Kingdom. Green tea and mango moshi with lemon cream pancakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IFx-WHDIBwkfc6CjXLu-Yw/o.jpg"
      },
      {
        "img_id": "qnxwSK0Y8UWhCV4vXi1-eg",
        "caption": "Photo of Yoobi - London, United Kingdom. Spicy tuna cone, crunchy tiger prawn roll and citrus salmon roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qnxwSK0Y8UWhCV4vXi1-eg/o.jpg"
      },
      {
        "img_id": "6qr8jmuLwJs0YPd37ieEcQ",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6qr8jmuLwJs0YPd37ieEcQ/o.jpg"
      }
    ],
    "user_id": "a1igdZ2t25jOJo7Iw9PJ-g"
  },
  "emxe10PclVCbe686xKtlMw": {
    "date": "5/14/2015",
    "text": "Simple yet satisfying, Yoobi is the type of eaterie that I wish I worked next to; for their signature Temaki rolls are a good value and charismatic treat that I could easily gobble up. Food is served quick, clean, appealing to look at and super easy to consume. I had the spicy tuna Temaki roll as was specifically recommended by a friend. The seaweed roll was noticeably crispy and fresh in taste and texture and it is well balanced with the quantity of its sticky rice and tuna contents. There is a spicy sauce that gives the roll it's 'kick' (thankfully not wasabi). I also tried the Tiger Prawns and Yellowtail Maki rolls, which were beautifully put together with chilli flakes or black seeds evenly sprinkled around each roll. With these I found the filling itself to be a bit lacking in flavour and substance but they were still pleasant bites, especially alongside the traditional soy sauce and wasabi combination with a small side of pickled ginger. The drinks were uniquely authentic too, as the Aloe Vera with honey drink is from a Taiwanese bottle and is refreshing with a the usual aloe vera bits but no unnecessary addition of sugar whilst the Guava juice seems freshly bottled with a subtle guava pulp.In short Yoobi is more simple than plain and more noteworthy than forgettable; a decent place to visit for a quick Japanese pit-stop. I do wish it had a bit more variety on the menu but what it does offer is commendable. I would rate it 3.5 stars if I could.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1iMLIKJ4xWv2O5MMOwikBA",
        "caption": "Photo of Yoobi - London, United Kingdom. Maki rolls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1iMLIKJ4xWv2O5MMOwikBA/o.jpg"
      },
      {
        "img_id": "HjfewKRoYQ3wesbKiBndVQ",
        "caption": "Photo of Yoobi - London, United Kingdom. Food menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HjfewKRoYQ3wesbKiBndVQ/o.jpg"
      },
      {
        "img_id": "_TN-q0mvezvqDr4XXSUkIQ",
        "caption": "Photo of Yoobi - London, United Kingdom. Spicy tuna Temaki roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_TN-q0mvezvqDr4XXSUkIQ/o.jpg"
      }
    ],
    "user_id": "gFxXMw3jn_gc-D-aY6mrMg"
  },
  "MKdbnZoDWTKMHmzzjcHssw": {
    "date": "8/17/2016",
    "text": "Have you just traveled from Paris where you ate endless amounts of baguettes and fromage?  Of course you did.  And now your life will be saved by delicious, gluten-free, dairy-free sushi.  That's not culinary obnoxiousness - that's the reality that most of us truly feel better when not in a bread coma.  Simple menu but plenty of great options.  Well-priced, quick service and most importantly, fresh fish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Nb5zhKx55mIhKj7wYyUdA"
  },
  "3rLaCOpBeWvq_Ko0ccY5LQ": {
    "date": "1/28/2016",
    "text": "A western style sushi place good for casual lunch or dinner. The space is huge but menu is quite limited and they don't serve alcohol (major let down!) Between the two of us we ordered two sets of makis and three temakis with mochi dessert at the end and it came to £45. If you're looking for real sushi this isn't the place but it's good for casual meal.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RuYE2X9aD5fZsAgBfYFXfw",
        "caption": "Photo of Yoobi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RuYE2X9aD5fZsAgBfYFXfw/o.jpg"
      }
    ],
    "user_id": "UQpYD8Zu2u5CliKzclwwkA"
  },
  "-7Ou7TNF8ZroE1rjKgHWwA": {
    "date": "12/9/2015",
    "text": "I can imagine it'd be good for lunch but we went for dinner and it didn't really fit the bill.The sushi on offer is pretty good (but also pretty expensive) with a range of adventureness depending on how niche you like your sushi.The lack of alcohol and the cafe ambience does make it feel a little odd in the evening and there are places with better sushi (and less novelty) in Soho for lunch so I'm not sure if I'd go back again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CSktYH4EoCszdgOASVf5mw"
  },
  "UZe6m1isBuPoc4HYMkukDw": {
    "date": "8/8/2014",
    "text": "A year on and my review needs an update!I come here as often as I can. This is not as often as I would like to. If I could eat here a couple times a week, I would. Yoobi is my favorite!They've started offering table service in the evening which is sometimes a bit awkward, but generally pretty good. The food remains, as ever, delicious. 20 hour cured salmon with the pear slices = delightful. My standard order is some variation including the spicy tuna (which, depending on who mixed up the spicy sauce on that day can be warmly spicy or blow your head off awesome) and the citrus salmon. Citrus salmon is decidedly my favorite temaki offering. It's bright and fresh and light and just delicious. I have once had the special king crab California roll temaki, and it was super yummy, but that one is just a touch pricey for my wallet to be eating on regular basis when I am perfectly happy with the amazing salmon options.Giant handrolls, friendly service, and it's easy to fill up a stamp card if you come even sort-of often! So so good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3y5JV35b8Qkkbw7hyP048Q",
        "caption": "Photo of Yoobi - London, United Kingdom. Allofthehandrolls!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3y5JV35b8Qkkbw7hyP048Q/o.jpg"
      }
    ],
    "user_id": "u2NjjrFtg4ZMsoDXtDBqjA"
  },
  "lgwf2lgUKqIsTdxVKANIUQ": {
    "date": "6/24/2015",
    "text": "Sometimes, you just go to a place and instantly fall in love. I fell in love with Yoobi, and I still think about it today.In the middle of Soho, I walked past this strange place a few times. Hand rolled sushi? Why?Being a sushi-vore, my friend Martina and I decided it was definitely worth giving it a go.The place is cosy and clean, and most of the dishes are prepared in front of you at the work station.Their speciality is hand rolled sushi. You chose the filling, you chose the format, and you enjoy. They recommend 2 rolls if you're hungry, 3 if you're starving. I went for 2.I stayed relatively traditional: one with tuna and avocado, another one with salmon. And some Green Tea Mochi for desert. It did not disappoint.The fish was super fresh, and the recipe just worked. The rice was not crunchy, and perfectly seasoned.Om. Nom. Nom.Perfect lunch. When can we go back?",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "vcSC9l4Bn0MVSVw9qQuFaw"
  },
  "0-FCVNzHlQIVWRRRAetOtw": {
    "date": "3/19/2014",
    "text": "Came for a dinner within a group of 4 at 7:30. No reso, NO problem. The place is empty, not sure if thats a good thing or bad sign but oh well. Its a hand roll place, so if you want regular sushi bites you can have that too but its a little bit more expensive. £9.00 (regular sushi bites) vs. £6 (hand roll). I had the spicy yellow tail and it rocked my world so I had to have 2. Yes 2. Don't judge me. I was hungry. Plus the Unagi special roll. Yum town. I tried someones veggie soup and i gotta say, holy crap that was good. Miso soup but with a lot of veggies and tofu. It was really lovely. They have a lovely lemongrass and ginger infusion tea concoction that was really nice. Great service, plenty of space, great for last minute plans for a group. The food was really lovely.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "Pw_sld1mUVJEWDEOuO-uIA": {
    "date": "9/28/2015",
    "text": "Very OK sushi. Would not be my first choice but the quality of fish wasn't bad. The menu and way of ordering felt a little too \"fast food\" for being a sit down restaurant. First off, they put broccoli in the miso soup. Huh? Very weird and somewhat off putting. Don't get me wrong, I love broccoli, but in miso soup? Not the right taste/texture combination. The edamame had so much salt on it that I had almost a full plate of salt left over after shaking off all the edamame beans onto it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sj16cDAbhNNwEPsJj4ujQQ"
  }
}