{
  "Is6NuZwjVf25O3B-_e_Fzw": {
    "date": "10/17/2014",
    "text": "I went here twice on my last trip to London. My two British, three French, and several American companions all thought it was great. The food was spectacular and the ambiance was perfect. It gives British food a good name!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mle2BQEUQChnywZ2vGjQ7Q"
  },
  "uiImcbosYOofHTXeUuHFXA": {
    "date": "11/5/2013",
    "text": "Long wait for our food... the two different pies we tried were bland and mediocre. The butternut pie was missing any flavor or trace of pine nut and red onion that were promised in the menu. We had high hopes, but were disappointed, I hate to say.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yqbxYiVYwWqwC0UEebJ1pg"
  },
  "qJEqts6cd7oJLrc_A2MG3Q": {
    "date": "7/27/2015",
    "text": "Our favorite place of all the restaurants we visited in London. The fish & chips were excellent here as well as the appetizers. We enjoyed pleasant outdoor seating on a summer night.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvo7MCoC37ZQ-D72IagAzA"
  },
  "UlwXAA0SPU2yClOfveKi5g": {
    "date": "10/4/2013",
    "text": "Excellent restaurant. I had the chicken pie and it was outstanding. Great beers on tap too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwBT3nzbjm14XJYqAD5Xnw"
  },
  "p_bcM8Z3-VUCB4s6dKYZFQ": {
    "date": "11/18/2013",
    "text": "Four stars because the decor, service staff, and wine were awesome.The food was pretty good, but not four stars worth.I had the steak salad, which has cold steak slices kind of medium cooked, on oily salad that lacked any real vinegary dressing. The two diners who ordered the fish dishes were over the moon, though. And the spinach cream side was amazing too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DziRL6vBVeZEcayZYffGbg"
  },
  "jY2V201xFoX6BNYUqOoF6A": {
    "date": "6/30/2015",
    "text": "Excellent service and very good fish of the day! This restaurant was a good way to experience a London gastropub!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6BT0rYXKhsv66uMrK7HeUA"
  },
  "7Dl_PmlgLPt52km6q6srtw": {
    "date": "1/28/2011",
    "text": "Five stars for atmosphere, service and menu.  3 stars for wine list (only one \"new world\" wine on the list, ahem).  3.5 stars for main menu items and....TEN stars for the banana caramel peanut whatever whatever cheesecake.More specifics:Had dinner with three others while in London this week.  The bar downstairs is, indeed, like an upscale pub.  Not too loud,  pretty.  Fairly unimpressive beer selections however my cosmo was quite good.The upstairs (dining room) is very warm and friendly, not stuffy at all, and the service - YAY JORDAN - was really really good.  Just the right amount of attention.To the food.I had two starters for my meal - a beet and goats cheese salad and then a seared tuna with artichokes, fennel and greens salad.  Both were made with very fresh ingredients, nicely presented, and good portions.  I also tasted the chili lime calamari, which was very very tasty. The reason I give the mains only 3.5 stars is that the salads both had fairly bland dressings and needed something tangier to finish them.  I found myself adding more salt and pepper than I normally would, to bring out more flavor.The bottle of Languedoc red was very good.Dessert - I was glad for my decision to have two salads and save room for dessert!  I actually ordered poached pears with ginger ice cream.  They were delicious and the ice cream was just right.  Since we were sharing a bit, I asked for a bite of my companions cheesecake.  OK, if you like bananas, caramel and peanut flavors together, this is a genuine mouth orgasm-producing dessert.  So very very yummy.  I would go back just for this (And thank you Fred for letting me have two extra bites).Will definitely return on another trip across the pond.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5MLUwvXySihGBApKRokSpg"
  },
  "3CJBuxImYkkVyI9FF-l-IQ": {
    "date": "9/30/2013",
    "text": "Haddock with citrus mashed potatoes and green beans in a lemon butter sauce. A couple of nicely-poured glasses of Guinness.  Great meal.  The decor reminds me of a farmhouse.  Rustic wood tables. Wood floors. Tall wood bar. A very attractive dining room overall.Unfortunately, the waitstaff just isn't coordinated.  In a half-empty dining room, I waited 15 minutes to place my order; not great, especially as I was eating alone and I'm not good at entertaining myself while waiting for my food.  The staff was pleasant but they were very slow.  If you're not in a hurry, The Grazing Goat is a good choice.  Perhaps I just caught them on a bad night.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uo9Ayh46T08UAIGnsedgyA"
  },
  "Zf6qV-I74AHWDAbzVjl2sg": {
    "date": "12/13/2010",
    "text": "I've been walking past this construction site for a few months now.  Finally, the hubs and I passed by on Saturday morning on our way to Hyde Park, and lo and behold, it was open.  After a couple hours of wandering Knightsbridge/Kensington/Notting Hill, we hopped the Central line back to Marble Arch and hit this place up for lunch.The inside is interesting.  They've obviously spent some major poundage on the decor:  leaded glass windows, beautifully reclaimed wood floors, sumptuous leather armchairs around the fireplace with an oh-so cool, pre-war industrial-style, assembly trolley on rail wheels.  The fireplace wasn't lit, so I'm not sure if it works or not.  I really hope so, though!The tap selection wasn't amazing.  The only cider was Alsap and no mulled wine or cider, which made me a little sad.  We ate the steak and mushroom pie, which was a bit dry, but tasty.  The chicken was very well done.  There is an option of a sauce with any of the meat main dishes, but there didn't seem to be one that paired with the chicken well.  So, we opted for the citrus beurre blanc and hoped for the best.  It actually went better with the chips than the chicken. Overall, the place has potential.  It's a touch Sloaney, so I hope that gets toned down with time.  Otherwise, the food was definitely the redeeming factor, albeit a little overpriced.  They're debuting Sunday roast and breakfast in January.  I pray the breakfast is decent, and that the fireplace works.  I could definitely make this a neighborhood standard.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7lSiBklNNdbu-QE3B96fA"
  },
  "nGnFtltFSSMYeaqtCdBRuw": {
    "date": "4/2/2014",
    "text": "This was, hands down, my favorite meal during our trip to London. Atmosphere was great, with what looks like an old feel with what looks like new wooden bar and weathered tables, as well as my favorite old-school Edison lighting. We went for Sunday roast, and the roast was delicious! The cocktails were superb, expertly recommended by an attentive staff, who were not in your business the entire meal, but right on top of it if you needed another drink. We got the chili squid which was perfectly cooked; my pork chop was amazing, and my husband's roast beef was a good portion with veggies and Yorkshire pudding. I would've gone back again and again if we had stayed in town longer. We went on a Sunday evening without reservations and were ale to be seated without issue. Highly recommended!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dFBpwpzYjsKyY2DzbHylaQ"
  },
  "PytL-qAI69aPxqmPmHikFg": {
    "date": "3/30/2014",
    "text": "Was in England a couple months ago some of the best fish and chips I have ever had. If you are in England and love fish and chips go here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UTYcbpTW1e3zuxD0nG0KQ"
  },
  "qoAMKeyGJmPXAp2dDeC1WA": {
    "date": "3/28/2014",
    "text": "The Grazing Goat was recommended to me by the concierge at my hotel during a recent visit to London. My family and I had a great time. The food and service was really good and we loved the atmosphere.  We will definitely be eating there again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JDttSLSn2EwzE1ieQZuO_g"
  },
  "LOimR7wobc8IOn7uIakqWw": {
    "date": "6/15/2013",
    "text": "Found this gem from \"around me\" app. Also had good yelp reviews. It was great. Went in on a Saturday night without reservation, seated immediately. My wife had questions about the wines & got a great recommendation. 2 of us had fish & chips tat we loved. Wife had chicken which was very good. Service, food & atmosphere were very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hxq67gnlOXTcWJwxwIdF9g"
  },
  "RvHo-zAmJn5zKxsaT6-Zlw": {
    "date": "4/29/2015",
    "text": "Loved the atmosphere. Food was good. Drinks were yummy. Service was good. We were not that hungry so we split the fish and chips and truffle fries. Fish was flaky on the inside and crunchy on the outside. Nice wine choices. Served beer from Florence brewery which the hubby approved.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9A3Jy9589fICHoSKv8nng"
  },
  "ZTR6pyUBvPB_0sJgDqz-ig": {
    "date": "9/25/2011",
    "text": "While in London last week, the Grazing Goat was recommended by the Renaissance Hotel staff around the corner. Over the 9 days in London, we ate there 3 times - once for breakfast, lunch and dinner each. The staff was always courteous and accommodating. The food is higher end pub food. The burger is great, pork chop tender and the chips tasty.Definitely recommend for an after work drink with friends or dinner with family.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t5wQ0wcFXMcDEU9E7wgUeg"
  },
  "tZvQojkowTkn_ExWUcdmNg": {
    "date": "3/24/2011",
    "text": "Recently sat down here for dinner and a drink while on a short visit to London. Absolutely loved it! I thought the design and decor of the pub was gorgeous - just my style and the atmosphere was great. It was very quiet when we walked in about 5:30, but by 6:30, it was packed with every single table full and a lot of people standing at the bar. Obviously a very hip after work spot for Londoners.I had the lamb and it was one of the best dinners I have ever had. Perfectly cooked and extremely tender.  My mom had the fish with citrus mashed potatoes and loved it. Service was nice and attentive. I will absolutely go back next time I am in town!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALxQcE0Zvd38Hf2hGK7ubA"
  },
  "JT77s9jqzKQmQDhVHaaxGQ": {
    "date": "5/13/2015",
    "text": "We were there for drinks after a dinner, but the staff was very helpful with our drinks, even though they didn't seem to have full knowledge of their different kinds of whiskey.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "br6sFuJ5BOAP6NBh4g6HEw"
  },
  "wLsi8oMhQ9QJW-HHCxKJsw": {
    "date": "1/30/2014",
    "text": "We used to have every meeting at the Grazing Goat whilst we were between offices and we all loved it. The food is really good, atmosphere relaxed and the staff are friendly. They also take dogs which is great!Perhaps the menu needs updating a bit more regularly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UW8BPAfOYBHGQTxp4Aln5w"
  },
  "_FJhKKERX_UT8bxMLT6YBA": {
    "date": "4/24/2012",
    "text": "Had a great meal here with a friend on Sunday night. I had the fish of the day which came with new potatoes and broccoli and she had the vegetable pie which I have to say I had food envy of even though mine was very good.  Roughly the same menu offerings as the Orange which is also owned by the Cubitt group. And the blackberry mule from the cocktail menu was to die for!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "nYwBi0-L659Ks34yV_G1Vg": {
    "date": "8/30/2011",
    "text": "I think it's the sign of a good restaurant when it's among your first choices to take visiting houseguests; you're not quite sure what they \"feel like\" eating yet. This is a place that seems to serve all manner of people equally well (be they families, couples, or groups of friends) with very nice food and a smile, so it's a good introduction and a peaceful night out.I was at The Grazing Goat most recently last night, and started with a very flavourful Chilean Pinot Noir. I originally considered getting the Rioja, and the waitress gave me a bit to try, which I thought very generous. They also have a variety of beers on tap and behind the bar, as the happy hour crowds can attest to. For eats, I had a really great plate of fish and chips with mushy peas. Perhaps it's not an original, but it was very well-executed. Actually, the same can be said for the entire restaurant. Good, solid, tasty food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z45iO8JfcR4BFybcAu_UHw"
  },
  "fj1XjDGJNSi1QVesJ4LfiQ": {
    "date": "12/16/2014",
    "text": "A comfortable restaurant, with two floors and outdoor seating in a very touristy area! A nice little saving grace that's not crowded, and on a quiet street. The food was amazing, and the interior and ambiance was so cozy, couldn't help but smile :)Try the truffle mash, and their Sunday roasts!!!! Very filling :9",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yaU1sgUe8oe1SfET5Zk1yg"
  },
  "dFA-O6ssx_0NaqXm5gmsJg": {
    "date": "6/20/2014",
    "text": "So happy I stumbled upon this spot for lunch during a shopping break! (Near Selfridges)Great lunch spot - would love to come back and try more dishes. The fish and chips were ok. I liked the pot pie with broccolini! Cute decor. Enjoy!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y27AqPiohVYCyrlptYr9YA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y27AqPiohVYCyrlptYr9YA/o.jpg"
      }
    ],
    "user_id": "USaee7wnRAPrEQT5E2s6LQ"
  },
  "zvqnEEk-Dmb_lMSGWWiWmg": {
    "date": "11/24/2016",
    "text": "Came for lunch, options seemed to lean towards dinner in terms of heaviness and price. I had the quinoa burger, good except for the random sweet beat slaw I don't remember on the menu. My husband had the cheeseburger. It looked good and he ate the whole thing. Cool vibe, decent food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8XJzuYaEKWfzqRSj7EcTQw"
  },
  "jzylVMSiLxSKRm5hplcrKA": {
    "date": "10/20/2015",
    "text": "Great food and a nice English atmosphere.  They do have Wifi!Allowed dogs which is very cool,  however the waitress should wash her hands after petting the dog.  This would be a four star if she washed after touching the dog.  Daily specials are awesome!  I had the pork pie and was very happy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3R6ZV7NCvYvbfxPcmXUYaA"
  },
  "zsHOppsBwDieO0mnSDAmLw": {
    "date": "10/2/2015",
    "text": "We are very happy to have discovered Grazing Goat on our last evening in London. From the country-chic charming ambience to friendly and attentive wait staff, it completely changed my mind about English cuisine.We had a beetroot starter, cured scallop dish, crayfish salad and fish & chips. Everything was fresh and delicately prepared- seasoned and dressed perfectly with layers of textures. Fish and chips were excellent- they were a posh version of the classic, served with a lemon wedge, tartar sauce and mashed green peas- might be the best we've had in London. The cocktails (pilco sour, G&T) were unique, also made with fresh ingredients and not with mixers. We'll definitely come back on our next visit to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7laLe2N6SPuApb6niVSNZQ"
  },
  "52bVP-0A5Id4xC0pPNsfGQ": {
    "date": "9/7/2015",
    "text": "I took the full English breakfast at £12.5. This dish does not include a hot drink and an orange juice. The breakfast was really good, fine food for sure, but I did not like at all the attitude of waiters. They were arrogant and not helpful. One of them hardly thanked and smiled when I told him that the food was really good. Finally on Sunday morning, they put glass bottles into their bins outside and it makes a very unpleasant noise into the restaurant. Food was good but I won't go there again!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YIyKYXuJJI7i-pU24XBzGA"
  },
  "knrEqaEnkWZT_og_QRGm3A": {
    "date": "6/24/2015",
    "text": "The fish and chips was excellent and I enjoyed a Meantime beer. The short rib and applewood cheddar pie was exceptional as well!  Small wait so come with patience. Only about 15 min on a Wednesday night.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JRIYyJ6iK9je4Aews1NZMg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Fish & chips, Shepard pie with beef & applewood cheddar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JRIYyJ6iK9je4Aews1NZMg/o.jpg"
      }
    ],
    "user_id": "3ipul01rTAlAOOfS1k8JXw"
  },
  "zMD4HbF0Nx1SoQeA2LtrDw": {
    "date": "3/31/2014",
    "text": "I love the atmosphere of this place with the rustic wooden furniture, antler light fixtures and old school light bulbs. Not to mention the cozy fireplace. This place is very spacious with dinning tables & bars located upstairs and down. The menu has a delicious farm to table menu. I highly recommend the charcuterie plate for an appetizer and the Suffolk Chicken for dinner. The sauces that accompany the dishes have remarkable flavor. I am torn between the classic gravy and the red wine reduction sauces as my favorite.   They also have a great selection of cocktails, wine, beer, and whiskey. My recommendations are the mint julep or the mojito if your seeking something fresh. Also, let's be honest one can't go wrong with a good bourbon or rum cocktail. I recommend making reservations in advance. They get packed quickly in the evening between 6-8pm. Of the two meals I have had there, I am yet to have room for dessert so stay tuned for an update. Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "31cVV2p-nwlNZHWvidNAmw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Pork chop with red wine au jus and mash",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/31cVV2p-nwlNZHWvidNAmw/o.jpg"
      }
    ],
    "user_id": "ZHN2XeRomVAtSkwDVeTofA"
  },
  "8zaxTMi-2rPhlKVLQNP5_Q": {
    "date": "11/13/2016",
    "text": "Gastropub. Extraordinaire!!  I had such a fabulous meal in this wonderful welcoming pub.  The food was amazing and the staff could not have been nicer.  The cod was so well prepared and the french fries just about the best.   I would highly recommend this establishment to anyone visiting Londo",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UIuTyvwt6cVIRK_U5UmcrA"
  },
  "E6yM8azbz40LRzseVpUofQ": {
    "date": "7/22/2015",
    "text": "Really fresh fish. Fresh fish in the \"fish-n-chips\" and the \"market fish\", which was plaice. Very trendy location filled with a lot of business people having an after work drink with their chips. ;-)Seriously, a very nice but slightly pricey dinner, worth at least $$$ rating.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLTVI96UNOSvR_aDdtBp2w"
  },
  "B4Wy-Li5rwQn2BBBH544GA": {
    "date": "5/20/2016",
    "text": "WARNING - BEWARE, I would avoid at all costs!!  I dined and stayed at their hotel.  I'd give this place zero stars if I could.  To sum it up, I got violently ill after dining here and the process and the final resolution was absolutely appalling.  Arriving at Heathrow in the evening and starving, we came directly to the hotel to check-in.  To keep things simple, we decided to dine in the restaurant as well.  The food was ok, not great, but I was too hungry to care, it was just sustenance at this point.  I did however, feel the rabbit dish was a bit off; the rhubarb and the rabbit loin - seemed off (went bad kind of off) and texture as well, so much so that I stopped eating it.  And to note, if you are wondering, I did not drink one drop of alcohol.  Before even finishing our dessert, I was feeling a bit unwell soon after the last course and left to go upstairs to the room as my husband handled the check.  I attributed it to just being tired from having a super early morning and a long flight from New York, but now in reflection, I think it was an immediate reaction to the food.I cleaned up, felt off, but forced myself to bed.  I woke an hour or so later in a cold sweat and felt extremely nauseated.  I could feel my stomach rolling as if an alien being had invaded my body, but wanting to get out.  I was moaning and having a hard time breathing; I felt so ill, at one point if I didn't feel better soon, I was going to ask my husband to take me to the ER; I felt like I was going to die.  Then suddenly and violently, my body shot straight up from a lying position and I involuntarily let out a giant dry heave.  I promptly got up and I was in the bathroom throwing up for 4 to 5 times, with periods in between dry heaving and crying in pain as my body was trying to get rid of whatever toxic thing I ingested.  This went on for several hours, then came a point where I finally felt some relief as if I went through an exorcism and stumbled back to bed.   My husband was also sick from the food, but did not go through anything compared to what happened to me.  This was how my first day of our two week vacation began in Europe.  Days after, I was still nauseated and could only eat bland food (i.e. crackers/bread) and only a nibble here and there.  It was hard to even put down water.  It wasn't how I expected our vacation to begin.  My husband discussed what happened to the person that assisted us during check out, and as a starting point, mentioned that the rabbit dish seemed a bit off and possibly the culprit.  He seemed ambivalent and answered,\"we will investigate and email you.\"  Two days later, we get another email from the manager stating that he was away the past two days and he will also \"investigate and email later.\"  A week from the incident, the response was merely evidence to defend that the rabbit was cooked properly, stating the date of arrival of the rabbit, the method of cooking and the different temperatures it was cooked at.  So, basically, sorry not sorry.  We mentioned the rabbit dish as a starting point for them to look into the matter, but that was their only focus.  There is more to what temperature the rabbit is cooked at that can cause issues; poor handling, a dirty plate/utensil/cup, poorly washed vegetables (we had several salads and vegetable sides as well - people have gotten sick from spinach, lettuce, I could go on), dirty hands from cooks, servers etc., e. coli and other nasty bacteria, you name it - if things are not handled well or there are issues with the produce/meat vendors - people can get sick and violently sick. The consolation prize, he wanted to offer a bottle of champagne upon our return.  WTF?!  You think I would come back after this happened to me, no f'ing way.  We had a two night stay here after our return from France and I cancelled it right after that night.  There was no way I would EVER EVER EVER return to this establishment.From their slow and clearly lack of concern and accountability on how someone that dined at their establishment got violently ill, I'd recommend avoiding this place.  Since they didn't really \"investigate,\" this could happen again.  Whatever is going on is still going on and inevitably someone else will get sick.  As for their hotel, it looks cute from first glance, but it's all show and doesn't deliver.1. We found brown stained sheets on the bed with bits of brown debris, which at first we thought were bugs - gross. 2. Noisy - thin walls/floors/windows plus construction across the street at the time we were there.3. Lumpy bed and pillows.4. Toothpaste splatter all over the wood walls in the bathroom.5. No AC (ceiling fan and plug-in fan to keep the room cool) - I can't imagine staying here during the summer.6. Tiny sink - when you wash your hands or try washing your face, water gets all over the floor.7. Safe didn't work - it was broken, locked up and we were given a physical key to lock and unlock it.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5gxSTruo_3igbGgENZ38UQ"
  },
  "nvhdtxl8lnh1OPkU_NzpDg": {
    "date": "10/13/2015",
    "text": "Of course, had to try the fish-n-chips, and they were great! I felt like such a tourist ordering them, but that's another story. The downstairs bar area was packed with the after work crowd so we sat upstairs in the main restaurant area and it was very nice. I had a G&T with cherry tomatoes and basil in it which was a first, but I was pleasantly surprised.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MqXlJzN0TkqdXfz-_G_2kw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Cozy upstairs. Not as happening as downstairs and patio but still really nice.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MqXlJzN0TkqdXfz-_G_2kw/o.jpg"
      }
    ],
    "user_id": "SIrOl-3bBrPOWBhzqr8ipw"
  },
  "aSQs0fdJnZypmqGnR2-Kbw": {
    "date": "7/17/2017",
    "text": "Everything you want in a gastropub. Good food. Bartenders live to make the perfect drink. We had great food made with care. I had lamb that was fork tender and perfectly seasoned. The pollack was moist and flavorful. Baby chicken was butterflied and seasoned delicately. Lots of beer choice. Good ambience and sound level decent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GGi1FAhIsaYWk7rH5VhnSw"
  },
  "Ar1-99_-vIdyrFC8Gm44gg": {
    "date": "9/21/2015",
    "text": "Good casual place.Nice atmosphere.Don't usually need booking or to get dressed up.A range of options for kids and adults and a range from healthy to fish and chips for different appetites.More of an eating place than a space to imbibe.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J57eAxnlR6YA37kHYYWqgg"
  },
  "RzJUp-TArHDzl2pZ--zbwQ": {
    "date": "9/15/2016",
    "text": "Totally cute, relaxed place for catching up with friends. The short rib starter was awesome. It got my hopes way high but the tomato aubergine terrine was mostly bland. The sweet potato fries were fresh and crispy on the outside. The lamb main was good but the meat was a bit chewy, also really hard to cut into with regular knives (steak knife would have been the way to go). Good and friendly service.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTbHjK5yvjaediJwEnaO7Q"
  },
  "yJmn64XjAqAO5WQL_IPs2Q": {
    "date": "12/13/2016",
    "text": "Great food and good service. There was some confusion with the time when the sides should have been brought out. But the restaurant handled it really friendly. Nothing bad to say. And the food was really good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAIX3VmF5_V4mYEnVzke7w"
  },
  "_JZZndRzrCd8ZAH5H_W-NQ": {
    "date": "3/3/2015",
    "text": "Our first night in town, jet lagged and trying our hardest to stay awake, we managed to find this adorable gastropub. We had previously made reservations online, so we were slightly dismayed when we were taken away from the hustle and bustle of the first floor bar and taken to the more sedate upstairs. Regardless, the atmosphere was cozy and welcoming. Rustic decor (think antler chandeliers) and great smells emanated throughout the restaurant.Our server was a small, sassy man who seemed initially friendly, but when he found out I wouldn't be drinking due to pregnancy, he was distinctly brusque towards me for the remainder of our dinner.  He literally tried to upsell us on an additional course or drink every time he came to our table, though he didn't refill my water very often. Loved my drinking husband, though!We started with a half-dozen colchester oysters for my husband and the salt and pepper squid for me. Both were absolutely delicious. The aioli that came with the squid was flavorful and the citrus on the squid was noticeable. For mains, I had the chicken and Jerusalem artichoke salad while my husband had the pork chop off the grill. We also split the Brussel sprouts for a side - these were the star of the dinner. Everything was exactly what we wanted - I did think it was strange that the soft-boiled egg on my salad was cold, but it all worked perfectly. The sprouts actually put us into the \"massively full\" range, so no need for dessert.The food was fun, tasty, and trendy. We would eat at The Grazing Goat again in a heartbeat, though I would ask to sit in a different server's section - more food, less snark!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2uUQQULlfiETuF0nkMQDQ"
  },
  "oc2pBM6g6bH7zusXy8wkcA": {
    "date": "3/13/2016",
    "text": "I always enjoy my experience at The Grazing Goat. The pancakes are delicious and I love the service I receive there. Good tea and food. Nice bathrooms. Always decent people. I have recommended this place to several friends for breakfast. Overall a cute place to grab some breakfast!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4JuByAp5HX5Smk8sR2dVVw"
  },
  "Gmy3jvho0WGyQIsLUOIbXA": {
    "date": "7/20/2015",
    "text": "Best foods I have had in London. Started with the beet app which was very well done. The prime rib Sunday special was amazing and the coconut cake was perfect to close the evening.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BHTfWi8aPrUzu_-JcBEsDg"
  },
  "cZVypHRpY3Nowff924czmQ": {
    "date": "4/15/2015",
    "text": "THE AMAZING GOAT!Came to London for a few drinks with my friends, found this bar through the help of yelp as it has such good reviews. Was very impressed with the great atmosphere, the menu looked delicious, so we decided we would eat, I had the pork loin it was scrumptious the cider caramels was especially good. Will definitely would return and recommend to anyone!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rbitb_oNoqxMcuPaEs-BmQ"
  },
  "PiIGBiC0ER5NtbIfoYy40w": {
    "date": "6/30/2017",
    "text": "We really liked this place! My husband and I aren't really into pub food, so this was our singular experience with it. We're so glad we went. I'd describe it as elevated pub fare. The servers are nice, but they're spread pretty thin with the amount of tables they cover! It was a bit pricey for what it was, but we were happy with the meal and our drinks. It is quite noisy here, but we expected that and actually really liked it - it was a jovial atmosphere. If you're wary of pub food, but want a nice experience, try this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "myilZqTE0ZhEBXGl5HjHKA"
  },
  "zbHwMOgaIidSEBu1l-bCuA": {
    "date": "3/29/2017",
    "text": "What a perfect Full English breakfast to have with colleagues or friends in a very professional setting.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ql72tD7sCRUdBBp5oeIU4A"
  },
  "qA_fB5aCDzxnC8Nt6L4XGQ": {
    "date": "8/29/2015",
    "text": "Very nice restaurant with great ambiance, service and food. I ordered the beet root appetizer, beef rump main and coconut cake for dessert. All were good, especially the beef rump. I wouldn't get the beet root again, though. With one ale it came out to about £50 for me.They ran out of lamb chops right before we ordered or else I would have gotten that!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sQPmqFDMn8ciDE53jA97rQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Beef rump main",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sQPmqFDMn8ciDE53jA97rQ/o.jpg"
      }
    ],
    "user_id": "985ZbeiVXyMiWKFn9LWtmA"
  },
  "4dAqFvk6-uyP-jtaDGX0fQ": {
    "date": "7/10/2017",
    "text": "What a excellent restaurant.  They are busy,  so make sure to make a reservation,  but if you wait depending on the time I went at 8pm and we only had to wait 5 minutes for a table of 2. I got the charcuterie plate which changes day to day since they make it on the premise.  I have to say it was so delicious,  And the different combinations you can make was all superb.  I had 2 types of meat,  olives, feta,  bread, peach chutney, and tomato relish. It was a nice size portion if you want to share it,  or you can have it as your main dish.  The aged hamburger was very filling and the parmesan truffle fries are a must! Our server was friendly,  and the guy who watches over the tables sprung into action when ever he saw the servers needed help.  Was a great place to dine and they close later than most of the places in the neighborhood so that was a plus! Would definitely go back to this exquisite restaurant!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gAjQSRegvs3ZPF33o3aBTg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gAjQSRegvs3ZPF33o3aBTg/o.jpg"
      },
      {
        "img_id": "-169zj32lmtP8d6ymcuIQw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. charcuterie plate for two",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-169zj32lmtP8d6ymcuIQw/o.jpg"
      },
      {
        "img_id": "xEpdJc3FOr9YftL4YAEX0Q",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Hamburger with truffle parmesan fries was all very good and filing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xEpdJc3FOr9YftL4YAEX0Q/o.jpg"
      }
    ],
    "user_id": "VyqKqNRrEBSvkE7qnpui9w"
  },
  "Jw8-ib_NyDEoNmh4Tj56gQ": {
    "date": "3/11/2017",
    "text": "Staying at a hotel nearby I went her with a small group of friends during the week. We arrived before 6 pm since we knew that it gets crazy busy once the work crowd comes in since it is such a popular place. We heard the menu offered something for everyone and learned this was the absolute truth. Our waitress Leila was truly one of the best. We had questions and she \"patiently\" answered all of our queries with a smile. I ordered the market fish with a side salad and a glass of wine. Total was 28.50 British pounds + 10% service charge automatically added on.  Everything was delicious except my meal could have been hotter (I think it may have sat too long before being brought to our table; like I said....we got there before the crowd and put our order in, but by the time we made our final decision on dinner the happy work people had begun to fill up the place). Atmosphere was very nice.....and yes it does get noisy as the evening goes on. Guess that proved that EVERYONE was happy!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "coCSmcKj6fdk7EbLgTXOJg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Grilled Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/coCSmcKj6fdk7EbLgTXOJg/o.jpg"
      },
      {
        "img_id": "_H2jw4CZHFUrc9oZQACWeQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Market Fish*** This was my order and it was absolutely delicious.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_H2jw4CZHFUrc9oZQACWeQ/o.jpg"
      },
      {
        "img_id": "kR4wxfrrHypOhZPNToIHtA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Fish and Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kR4wxfrrHypOhZPNToIHtA/o.jpg"
      }
    ],
    "user_id": "kApT1tmOKsRw4xJhnQtcZg"
  },
  "IjoZ14-yjh221_AYUPMS9Q": {
    "date": "3/4/2017",
    "text": "We had an amazing meal here. Our waiter was great!  Tucked away on a nice quiet street near our hotel. We had the Sunday Roast and cocktails. A lot of fun.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JsHHEQ8Sch_gjx1xjymuIw"
  },
  "tFvZgg3MmDm-Zt3V7lPhcg": {
    "date": "4/24/2016",
    "text": "The food was just like all other Michelin star restaurant! The visual of the food was amazing, the taste was all very balanced and the protein was so perfectly cooked to mid-rare. The salads and dressings are a great highlight to the finishing.But, just a bit too loud in there... :)Highly recommend",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xKHVDMpx5dmU1vpSxsqXzA"
  },
  "OgSQtCGO80J-GiHwja1eGQ": {
    "date": "4/5/2016",
    "text": "Not over-awed by what is a Marylebone staple gastro pub. The service was ok, but nothing more and the food pretty average despite being not being averagely priced. The welsh rarebit burger is a novel idea but the pulled pork is unnecessary. Also why put chips in a little pot? So we don't have to give you many that's why!! They're bloody potatoes so why be cheap? £12.50 for a glass of pinot noir, which had clearly been open for a while, is a joke. The only thing that seemed ok was the fish and chips.Wouldn't go back, maybe I caught them at the wrong time or chose the wrong dishes.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "5umtYkL_whT3ExGseU3SjA": {
    "date": "12/24/2017",
    "text": "Great atmosphere. Excellent menu with many lovely choices. Wife had the Quinoa burger and I had the beef burger. Both cooked to perfection. Waiter was very nice and his suggestion of the apple pie was delicious. Will definitely eat there again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pgUfo_yWKkaa1Rhp34cfwQ"
  },
  "0p-6W93ZTDYw1ir0a01kvw": {
    "date": "11/26/2017",
    "text": "This is my second time dining at the Grazing Goat, my first was 3 years ago during a Spring visit to London.  Even though I arrived at 6pm, Sunday Roast was still being served - lucky me! This British Sunday staple - roast beef, potatoes, mashed turnips, carrots and Yorkshire pudding, drizzled with gravy - was superb! I've seen other reviews complaining about slow service. If you are from the US, it may seem slow, but it's not. Slow down, and enjoy a drink and good company, make new friends, and your meal will be served before you know it. My servers were attentive and very friendly.  The Goat is located in the are just north of Marble Arch, very near the western end of the Oxford Street shopping area. The atmosphere here, however, is quieter and more low key. Surrounded by boutique shops and upscale homes, this is a hidden gem. But to keep it \"hidden\", please completely disregard my 5-stars and don't come here... :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qw9gKApDhT76jFC6_MKZbA"
  },
  "W4fdhD3F-PFqi3_XvdAgJw": {
    "date": "5/24/2017",
    "text": "I'd give it 3.5 stars if I were able to. It is a fun place and the burger qas good, but not exceptional. The other 8 people that are with me would probably rate it higher and ordered more off the beaten path items. Parmesan fries are tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chvew2cwvmNmp52vRlowUQ"
  },
  "KaUJt5mfw3rezTi4AhxB9g": {
    "date": "5/31/2017",
    "text": "We love the place very nice and great food we are from USA  LOS ANGELESI do recommend to all, thanks",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqVq_AuNs_-NPmzaR33Mqg"
  },
  "R7ITIRGEetU7htVK0kKi5A": {
    "date": "10/13/2017",
    "text": "Great food, service and atmosphere. Highly recommended. Definitely done upstairs if you are looking for a quieter experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH6tEvK7kCYMrcDz06vvqw"
  },
  "NdcUyfLv57GU7-qUroCmfQ": {
    "date": "2/2/2017",
    "text": "Great food and atmosphere! The steak was amazing and the service was good. However you need to make reservations since this place is always packed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jr1IKRDnKtZ-VY1knfCdJg"
  },
  "POA7YnTccb8_oW1xSTPqEg": {
    "date": "5/21/2016",
    "text": "Stopped by for a couple of pints and the Sunday Roast, which they did in fact serve in the afternoon.  Many places seem to stop serving the roasts after lunch, but they had a wonderful roast lamb with veg that was appropriately priced and delicious.Off the pudding menu, I had a chocolate tart which turned out to be a bit too much chocolate for me, but I wouldn't hold it against them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUjc6_wq3Nqsb7809Fr6bg"
  },
  "p7hx-NzIslJpbe15d3He5A": {
    "date": "8/1/2016",
    "text": "Really wish I could give 4.5 stars. Excellent little restaurant. Quaint country casual atmosphere. Food was excellent. Service was great. We had the house cured meat and chili squid for starters. The meat board was outstanding. The squid was good not great. For dinner we had the pork tenderloin and the salmon. GET THE PORK TENDERLOIN. Absolutely perfect.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8rru5Z_1HjjYTgAfjqhaQ"
  },
  "4xMd_361oMoi_B_vqR5M9w": {
    "date": "10/6/2017",
    "text": "Excellent food and service. Had grouse and hubby had pork tomahawk. Very good. Limited beer selection, but extensive wine choices. Acoustics an issue, couldn't hear waitress or partner well. Overall though would definitely return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYwjMfYn-UlAo414Ll3VOA"
  },
  "pr_srpQtfAQoN6374Y00ng": {
    "date": "10/18/2014",
    "text": "I was looking for a place that was 1) kid friendly, 2) dog friendly, 3) open early for Saturday brunch and 4) located in Marylebone - The Grazing Goat checked all of the boxes.Food: We ordered the English breakfast, egg and soldiers, two ham omelettes and the pancakes for the table.  The English breakfast was pretty traditional, the ham omelettes were delicious, the pancakes were yummy, but rich.  The only dish that wasn't ideal were the egg and soldiers.  The eggs weren't cooked correctly (they were hard boiled) and the soldiers were soggy.Drinks: We ordered two coffees, one diet coke and a melon/lime/mint juice.Price: 57.93 GBP for four people.Ambiance: The restaurant is very cozy and warm.Service: The service was good.Would I go back?  Yes, because it's a comfortable spot, food is decent and is reasonably priced.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UR6guAvsmsMX27bfFJ_Kzg"
  },
  "XprhNnq68lZT5F9Xbpx-zw": {
    "date": "11/22/2014",
    "text": "I am very conflicted about this pub. Been for drinks a few times. Good cider, suspect lager. Popped in for breakfast a few weeks ago and what couldgo wrong, did. (Sloooooooow service - 35mins for coffee is never ok people!)There aren't too many pubs in this area so if you're looking for a pint  around that way I'd pop in. Wouldn't go out of my way for food there though.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eyuoFZHgcBC93XxEXbY39Q",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eyuoFZHgcBC93XxEXbY39Q/o.jpg"
      }
    ],
    "user_id": "6ysU6q9uBHE4F6k1C6_LEA"
  },
  "ywSNfAx8RWWdUfRj0wNieQ": {
    "date": "4/10/2016",
    "text": "2nd time here.  Love the atmosphere and food. We had the English Breakfast, pancakes and tea.  Lovely!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vzlU8s_v7kHtkJQYPFxpZg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Seating area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vzlU8s_v7kHtkJQYPFxpZg/o.jpg"
      },
      {
        "img_id": "Q8j7m5pJpggk96CmnYzFrg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q8j7m5pJpggk96CmnYzFrg/o.jpg"
      }
    ],
    "user_id": "VW22hGjaz4TLcag9DzlqdQ"
  },
  "G_8ShCmO7wn04L5OoWXNAw": {
    "date": "1/18/2013",
    "text": "The starters are a bit weird and had some paste like thing and some bread. The main course - they forgot to ask how they wanted our steak and gave us medium rare which was OK. The dessert was amazing. We were a group of 20 out for a company dinner. I liked the atmosphere - like an old house with narrow staircases and the works. But the food could have been more in quantity and the starters could have been better explained.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kwmToyRa85G49WxbsYB1Aw"
  },
  "Kwuu45fLhPyUMM4-XoP_Lw": {
    "date": "10/16/2014",
    "text": "Great decor, great food, good selection of beers. Went twice on my last trip to London. The Sunday Roast is really good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6D1Ap9ZWn9lQWAPZL24NlQ"
  },
  "MyMVq3ywmeDDr-hlXrlxJQ": {
    "date": "1/30/2016",
    "text": "The place was a nice place inside and a good place to get a pint.  The food was so-so although it looked promising at first.  The chicken was bland and the veg with it wasn't very well prepared.  Again, it's a nice place for a pint but the food was not very good.  I liked the interior of the place as it seemed an upgrade from many pubs.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hMS9P4tEPMwS6iwxqMK3w"
  },
  "6dfb11vGtdN9pbwlbmRofQ": {
    "date": "3/13/2016",
    "text": "Excellent fish and chips - go for the mushy peas!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bVuLpP3PUq3OfY81wzLDug"
  },
  "YEdXUOfxIadXy8U_3K2rNw": {
    "date": "1/7/2012",
    "text": "Food here is more or less standard gastro pub fare, executed to a fairly good level.I've been a few times and tried a number of dishes including roast pork, steak and ale pie, and fish and chips. All perfectly fine. Portions are very generous so you won't leave hungry and would be fine with one or two courses. Not a great fan of the desserts. The coffee creme brûlée did not come with the requisite crispy, sugary lid although the accompanying shortbread biscuits and honeycomb ice-cream were good (example of how generous the portions are!). The caramelised apple tart is oddly deconstructed: a small, caramelised apple sitting atop a disc of pastry. Jury's out on whether it classifies as a 'tart'Service seems to be more friendly downstairs in the pub area -- where tables are available to eat at, same menu -- then upstairs in the restaurant area.I prefer the food at the Thomas Cubbitt, sister pub in Belgravia.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A0x1bkKr058NHXTPMA4-qA"
  },
  "oafqWDxYCBA6928BXedaiQ": {
    "date": "10/19/2014",
    "text": "Came here with a friend while in London on work. He is British and he thought it was good :) I had the hamburger and he had the lamb pie (which he said was excellent).  The burger was really good and had some beet spread on the bottom which was really yummy and added a sweet flavor to the burger.  I had the grazing zombie drink/cocktail and it was good also ;) dessert was a chocolate banana cake option and was really good as well.  Good atmosphere and pretty crowded on a rainy Monday.  I would definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "heZzZANhMHeEz12ovn1P4Q"
  },
  "9ByX4O0_Lkad7Wn3gs23yA": {
    "date": "1/15/2015",
    "text": "The service is super friendly and I had the pork chop with  truffled mash. Pork chop was cooked perfectly. The people watching is also stellar making it an all around great experience,",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7INfwltj9bveAu9_XkH6w"
  },
  "a4Y_IfotoioqVY4n0b75Dg": {
    "date": "1/6/2014",
    "text": "I LOVE this restaurant. My parents, boyfriend and I went here for Christmas Eve dinner and everything was great. The atmosphere, food and service were superb. I will definitely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8qogb7zTm_dihaN6UwtPgg"
  },
  "1mhMGAzqnrI3qx0OX_LIfA": {
    "date": "1/12/2015",
    "text": "Food was delicious and servers were very friendly.  We had the pork chop and the 1/2 chicken.  Both were excellent.  We will definitely be back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQYYRhDmT_IkXGUAX8Ktsw"
  },
  "smrm7tAi8_zFX5BUEUuf7A": {
    "date": "3/11/2016",
    "text": "A moderate price place for traditional English food.  The fried salted squid was very good, juicy and tender.  The fish - hake was OK.  The ribeye was better.  This place is most famous for their Sunday roasts which are only served on Sunday's.  We will have to return here on a Sunday next time we visit London to see if it detested more than 3 stars.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "alWPuezg_0x1VmWHk_-AJw"
  },
  "8gZh_1Y2qwXS3x4M5-38uw": {
    "date": "3/7/2015",
    "text": "After my first visit, I would have given the Grazing Goat five stars.  It is a cute little gastropub tucked away near Portman Square and Marble Arch, with 8 hotel rooms upstairs.After my second visit, I'm giving them four instead of five, but still def a go to place in central London.The food is a nice mix of trad English pub fare, but with a decidedly modern twist.  I live near San Francisco, the home of locavore all fresh all the time food - and the Goat makes me feel a bit like I'm home, but with a nice English flavor (they do traditional roast on Sunday, for example).Good food, friendly service, decent prices, what more can you ask?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GsOJtdZmaOvtNvusRnc57Q"
  },
  "wBfnhncJeS0o8w9coqXO_w": {
    "date": "1/3/2015",
    "text": "Pork Pie is wonderful, with an amazing Mash. Peaceful ambient, with music but not too loud. Very attentive and with good eye for nice details. Definitely recommend it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kma-THVCI2ez2tgd5F2QQA"
  },
  "V_uyJTYYD-FCCRYV0hQyuQ": {
    "date": "4/26/2012",
    "text": "After the first two visits, I would have given this place one star, based solely on the service.  While both times we did just show up without a reservation...it is a gastropub after all.  The hostess upstairs, even though there were numerous open tables (not one or two but a good percentage of tables empty), was very rude and refused to seat us.  The first visit, I pushed her to seat us in the open tables and finally the manager came over to intervene and we were seated immediately.  The second visit, she again refused...and I just left claiming I would never come back.Well, since it was close to our hotel, I did return a couple other times and was always fortunate to sit on the ground floor dining room.  Seems like basic gastropub food but I think that it is well done.  Really enjoyed the potted duck as a first course.  The wine list is quite complete with a variety from around the world.  The ambiance is quite relaxing, although the busy dining room can get quite loud and busy.  The staff is on the casual side and always open to making recommendations.I am not sure I would go out of my way to eat here again on my next trip to London, but if in the neighborhood, I would certainly go back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xwwHsj4Be2feoS5KPEnOA"
  },
  "j62c3g7L_OxtIp0rfpfDBQ": {
    "date": "5/24/2014",
    "text": "Very good food, cool atmosphere but would have preferred a more extensive beer list.  As a gastropub, the food part was outstanding. Fish and chips were excellent quality and amount was enough to share. I had the chicken, leek and mushroom pie which was outstanding. They only had 4 draft beers(?) which is why I only gave this 4 stars. The pub part was lacking. Excellent desserts and service...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2yzOEu1DknVD1SGedrPYRA"
  },
  "NEPRejT_Z1DJDfQQUjtA7A": {
    "date": "5/9/2014",
    "text": "My parents were visting from the States and we wanted to take them someplace traditionally British (since we were off to Portugal the next day) and near their hotel, the Grazing Goat fit the bill.  Our meal was really good.  I had the pork chop and it was really delicious. My husband enjoyed the fish and chips although I think he had order envy. I hope to make it back here for another meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOYWGnNL9UPmRiwUXRV-_Q"
  },
  "ildIUBSjfQ-DN4NMfn5W6Q": {
    "date": "7/21/2014",
    "text": "Had the market fish and blackberry sage martini. AMAZING! Best meal I've had in London! Great atmosphere and staff as well!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_dSb6ctRQVJfjlmb1LEbDg"
  },
  "HGroGZTJ_nYzpiyEcPl9Ew": {
    "date": "7/9/2014",
    "text": "Had a great dinner, food was very refined but straight to the point. LIked the atmosphere and the service was impecable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZimAv-Vsl4PVJ8KydEl3A"
  },
  "gFSmZvi7au8C5FFS_roAEA": {
    "date": "10/1/2014",
    "text": "This place has become my go-to and absolutely must have meal(s) when I am in London.  The food is very well done, service is perfect, accommodating and genuine.  I am working my way through the menu and they are actually batting 1000 with me.  Yes I am a Yank.I can't recommend enough, and locals I have brought here always say \"this place is fabulous!  How did you find it?\"  By accident of course!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0WVm_yiltTKuvcmuiOotNQ"
  },
  "BTbBJ3Bgvg5JqI4fVnv-Pw": {
    "date": "10/30/2013",
    "text": "I am going to go with five stars instead of four because of the appetizer and the dessert. We ordered the goat curd with walnuts and honey. Outstanding! I can't believe how smooth and creamy the goat curd was. The combination of flavors was so nice. I ordered the pork chop with mashed potatoes which was just good. The apple sauce was like chutney and the crackling (?) was first for me. It seemed really hard, thin bacon. Me mates had two different pies . The vegetarian was okay, but the chicken pie was really good. That was my first choice but I decided to go with the pork chop to compare with Great Queen Street. For dessert we had the cake with pears, caramel and ice cream. So tiny yet so delicious. All four are served separate on the same plate. But if you take a bit of each at once, it can be oh so heavenly. We got the board of cheeses as well. Really, really small with some grapes, apple slices, crackers, fig, and apple jelly. I can't remember what wine we had it with, but it was nice. We closed down the place at 11:40 PM. Last meal order is at 10:00, last dessert order at 10:30 PM, and last drink order at 10:45 PM. At least on Tuesday night.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0AyZxS5C--WySnbW_Q8yQ"
  },
  "CDMB5euCifo-QZjJ6eLEyQ": {
    "date": "12/6/2011",
    "text": "I was really impressed with this great little English gastropub - it's a pub, restaurant and a small hotel all in one.  I was torn between fish and chips and their grilled fish of the day and was glad that I got the latter.  My friend ordered the chicken, which was deliciously grilled and filled with all kinds of great accoutrements.The ambience and the noise level was really exactly what I wanted.  I could have kept going back to this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FMPqPWPj9Es4bxCcqwR-yg"
  },
  "B-b5opLL76awJqLCUeo8xA": {
    "date": "7/25/2016",
    "text": "Without a doubt, 5 stars. This is the definition of a \"Gastro Pub\" - the atmosphere was lively, the décor was rustic but modern, and the food was amazing. Not to mention, a very cool name, totally fits the ambiance! We started with the battered squid served with sweet chili sauce. Now this is a classic you can get at a million different places a million different ways, but let me tell you, this one blew my mind. the squid was tender, the batter was perfect and not greasy, seasoned lightly, and the sweet chili sauce was absolutely on point. But the fun doesn't stop there! I got the saddle of rabbit as my main course, and holy smokes, what a treat. Not only was the plate beautiful, with a perfect balance of sauce, meat, veggies, and garnish, but the flavours and textures were incredible. The meat was juicy and tender, served as a bacon wrapped saddle and also as a \"leg meat croquette\", with a delicious squash? based sauce and fresh vegetables. In fact it was so delicious I don't even remember what my friend had (well, I do, it was fish and chips, but I that's boring so I won't talk about it). To wrap things up we shared a cheese platter, which was absolutely on point with variety and flavor profile. While this meal was certainly expensive, the food stood for itself and in comparison to the rest of London, it fits appropriately. I would definitely come here again!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFSek24a9vAOy1VQpvZhYw"
  },
  "bZX5UrUmBtAPWfHjzm3FUQ": {
    "date": "9/30/2015",
    "text": "This was my first stop in London and ended up being the best fish-n-chips I had. I loved the atmosphere and décor, it was trendy and rustic. The waiters were very nice and attentive. If you are into whiskey or scout they have a good selection. By my surprise the made a decent margarita. Just one tip: margaritas belong in a tall glass. Let's talk fish-n-chips: The fish was cooked and battered perfectly. Not soggy at all and a good batter to fish ratio. The chips were a little thinker than I would like but with ketchup they are fine. I like this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hZQhiKz7Ekzkb48rXDVvLg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Fish-n-chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hZQhiKz7Ekzkb48rXDVvLg/o.jpg"
      }
    ],
    "user_id": "5eIaMYhMP5APRnYKTafmsw"
  },
  "wA_bT0K5-6N3g-OxDzt3qg": {
    "date": "5/8/2015",
    "text": "4 1/2 stars. I was recommended to dine here from the concierge at the Marriott hotel we stayed. It was minutes from Oxford street and it seemed like many locals dined here.We started off with dinner-a dozen of Dungarvan oysters which were delish. We then shared an entrée of fish and chips and a dried rubbed ribeye, mushy peas, rosemary mashed potatoes and a bone marrow a jus. Everything was tasty and the bone marrow a jus was outstanding. I enjoyed my English meal with a pint of Guinness which was surprisingly good. For dessert, we indulged in the Sticky ginger pudding, pears and ice cream which was awesome!Service from our waitress who was from Spain was friendly and I really enjoyed her English accent! I would certainly return here again or recommend the Grazing Goat which also has hotel rooms upstairs to rent by the night!",
    "rating": 4.0,
    "rated": {
      "useful": 13,
      "funny": 8,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "svOXw7Isv5siZyLw7Gg0mg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Sticky ginger pudding, pears and ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/svOXw7Isv5siZyLw7Gg0mg/o.jpg"
      },
      {
        "img_id": "_QuChBWzSfRzE5vp8qyaxw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Beer battered fish & chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_QuChBWzSfRzE5vp8qyaxw/o.jpg"
      },
      {
        "img_id": "xI3fZM9R7B1dqoEe4ppP9A",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Dry rubbed rib eye, rosemary mash, crushed peas and bone marrow jus",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xI3fZM9R7B1dqoEe4ppP9A/o.jpg"
      }
    ],
    "user_id": "o4tYl3Hz0oDfpNn4k02DCw"
  },
  "Q8bU13pvB7XyYfASJi5jWA": {
    "date": "3/30/2017",
    "text": "On my most recent visit to the U.K. I spent night in the Kensington section of London and found this hidden gem. Just a few blocks from the Marble Gate it offers both indoor and outdoor seating while inside offered on modern take on the traditional pub, with traditional pub fare on the menu. I ordered the locally sourced ribeye and twice cooked chips and it did not disappoint. Being intimate in size it can get kind of loud but with good selection of drafts or wine, it is the perfect place for pints with your mates or dinner with your wife.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J1KPysKCsZe8BI-557xbLw"
  },
  "o-0s41uoVy1DvUqUOJ8U7Q": {
    "date": "1/27/2017",
    "text": "My waiter help me create a custom version of the full English Breakfast for pescatarian... we swapped smoked salmon and avocado for the normal bacon and sausage and it was amazing!!!  Tea was also very delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tC724VQlf3Voai-7cahPIQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. My custom English Breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tC724VQlf3Voai-7cahPIQ/o.jpg"
      }
    ],
    "user_id": "FHJIXEeJmdmdHgscJ3DZDw"
  },
  "ZMq5L-_ALjTj_pnXsbZV8Q": {
    "date": "4/30/2015",
    "text": "My Mom and I came to the Grazing Goat on a Friday morning for breakfast around 9:30am. The yelp reviews and the proximity to our hotel made it a great choice. I enjoyed scrambled eggs with bacon and toast, while my mom had the 2 poached eggs, with bubbles and squeak (had to Google that), and toast. We also each had tea, green and English breakfast. The prices were right, the food was tasty, the service was good, and I absolutely loved the decor!I was asked if I wanted butter for my toast, I said yes and then was charged an extra 1.50. Not a huge deal, but kind of strange to offer then to charge without notice.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QplvbvpXoY41NG4rlxTVXQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Scrambled eggs with bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QplvbvpXoY41NG4rlxTVXQ/o.jpg"
      },
      {
        "img_id": "EHn4IocYWwQloPbC-Xev4w",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Poached eggs and bubbles and squeak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EHn4IocYWwQloPbC-Xev4w/o.jpg"
      }
    ],
    "user_id": "UYU71DRx-UDAee-eFOFfWw"
  },
  "08qIw2kIWN7WkwFlh1vidQ": {
    "date": "11/26/2017",
    "text": "Wonderful atmosphere - so warm and cozy. Candles in the windows. Excellent selection of beer and wine. We both had the Sunday roast. ( I am a sucker for Yorkshire pudding). The pudding and the carrots were great. The meat could do with a bit more seasoning. Hard when comparing to my Grandmother's roast. Plan to return in future.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEJ84OBc4hI5zJmHFYVVcQ"
  },
  "aGN9Gnox36JN0IP-SS-97g": {
    "date": "4/17/2017",
    "text": "Good food. Fun atmosphere. I had the Fish and Chips. Perfectly prepared. For dessert I had the Toffee Bread Pudding that was simply incredible!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XAcoKILyJkq0ne7tdqjr9w",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Toffee Pudding Cake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XAcoKILyJkq0ne7tdqjr9w/o.jpg"
      },
      {
        "img_id": "NRqvmSoOhsd-edJWmjLHxA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Outside sign",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NRqvmSoOhsd-edJWmjLHxA/o.jpg"
      }
    ],
    "user_id": "971VtsZEGF1L0L8pEr2Drw"
  },
  "JobcQcD_wbM5SZcrHuqG1Q": {
    "date": "7/2/2016",
    "text": "The Grazing Goat is a popular and overcrowded place for drinks. A gastro pub, this place does a fine job of carrying a decent but underwhelming selection of ales, beers, ciders, wines and spirits. The menu isn't for everyone but if the mains don't inspire you, starters like salted squid and French fries might do the trick. The place is clean and doesn't smell like a traditional pub, which is of course because it isn't one. I can recommend it for meeting up with friends but it can get a bit loud as they fit a lot of tables in a tight space. Last comment, this is an expensive place for what you get. A pint and a bowl of nuts will run you almost £8.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TaZU9xjsaCpKYirpriUYzg"
  },
  "gIxDYRVnmcoZREEjl2bVsQ": {
    "date": "3/1/2016",
    "text": "A very pleasant setting but food doesn't live up to what it should be. The salt squid was very good in terms of seasoning but the scallops as a starter was a bit disappointing, only 2 tiny scallops, bit of a rip off.Ordered the large ribeye with triple cooked chips and peppercorn sauce. The steak was actually cooked well but it was served with some BBQ sauce. When the right sauce finally came, there was no more steak. And the chips; triple cooked? More like 1/2 cooked.For dessert, the baked Alaska, good attempt at the dessert but the ratio of meringue to ice cream was slightly off, so you had plenty of super sweet meringue.All in all it was a pleasant experience but I can't say I'll be rushing back for the food anytime soon.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "f7QuSTleFEnUE-oEj1aLWQ"
  },
  "6lFyOgYp2FPJTLGz1wv5tg": {
    "date": "12/6/2016",
    "text": "Food selection seems Ok & it's a nice venue but the service was terrible. Waited 5 mins for a table (as there's a sign requesting customers wait to be seated) then finally a guy wanders over and asks if I want something. I got a table but gave up waiting for anyone to come take my order, despite the place being half empty. I seldom walk out for slow service but Christmas was looking like coming sooner than any wait staff....  Seems from other reviews that poor service is common. Even for London, this was shabby & I notice they add an automatic service charge...",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-32WtapJvTQrG59p6hgVyg"
  },
  "tjJnH0XZ1AewRam_XJuNtw": {
    "date": "3/17/2016",
    "text": "Nicely designed pub/restaurant with proper food (not only simple greasy pub food - although nothing wrong with that either). Besides beer and other drinks they also serve fresh squeezed juices. I had the pheasant with mashed potatoes and it was very good. You can also try fish and chips here. Overall the atmosphere was quite nice, a bit loud though as I guess can be expected from a pub. Service was friendly and quite quick. I guess the reason i'm only giving three stars is that it was nice but not amazing - probably also depends on the type of place you are into.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i0vO9qJXTXiKF8yzoJYasw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Pheasant with mashed potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i0vO9qJXTXiKF8yzoJYasw/o.jpg"
      }
    ],
    "user_id": "61HPdjVqc8YQjWJuHg2RzQ"
  },
  "Rh3acqx93mWaD0DeXb3EZQ": {
    "date": "12/6/2015",
    "text": "We needed somewhere serving breakfast not too far from Paddington at 9am on a Sunday, and ideally somewhere big enough that any of the group wouldn't have to stand outside in the cold if they arrived early. The Grazing Goat fit the bill perfectly. It's probably the first time I've been in a pub at 9am, but this was definitely on the gastro side of pubs, so didn't feel weird. There were plenty of other people at 9am, but it wasn't so rammed that we had any trouble finding a seat. The menu is pretty typical London breakfast at the minute-- fancy granola, avocado on toast, English breakfast. Didn't have a listing for a veggie version of English breakfast, or I'd have been tempted. I got the yogurt and granola, another person got the smoked salmon on rye toast. In terms of value, I think I won, with a huge portion of really thick yogurt and tasty granola, where he had a pretty small piece of toast with some salmon. Food was decent, service was OK, if you're in the area and need a breakfast option, this is solid.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "znzqNyW2pJ0Q9wlqvu4YGw"
  },
  "loJBoyFrx1oRmvQZHA5J2A": {
    "date": "1/20/2017",
    "text": "Came for a work meal and really enjoyed the tomahawk pork steak off the grill. Amazing standard of food and size. Paired it with red wine jus. Highly recommend this. Will be back for more",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3TBdchOgZapHTyzgqj4DjA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Pork Tomahawk, very good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3TBdchOgZapHTyzgqj4DjA/o.jpg"
      }
    ],
    "user_id": "smDtorp9syJm-p6szCd8WA"
  },
  "MEfbKfZg41uf3yVe05m-IA": {
    "date": "1/18/2016",
    "text": "Ate here 2 nights in a row because it was so good.The pork chop and the dry aged beef fillet were amazing. The pork chop was easily one of the best I have had anywhere in the world.The beer was the house lager and very good.The clementine cake was the best I have ever had.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yQVoXTe252KyVpMqfxaTpA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. The best clementine cake I have ever had.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yQVoXTe252KyVpMqfxaTpA/o.jpg"
      },
      {
        "img_id": "uSeaiTs9xtYhtHEFN4kjXg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. The place to stay or at the very least eat at.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uSeaiTs9xtYhtHEFN4kjXg/o.jpg"
      },
      {
        "img_id": "tWahnVoqdnNLKVU4e1Q8EQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Amazing pork chop and a clementine cake that is a must eat before you die.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tWahnVoqdnNLKVU4e1Q8EQ/o.jpg"
      }
    ],
    "user_id": "qRcEIi7zqJfb4mMGwzH2Yg"
  },
  "xXFPRoANPQKuKp5A1Aq4_A": {
    "date": "6/21/2017",
    "text": "The atmosphere is upbeat and friendly. The service was some of the best I've ever experienced. And the food was just amazing. If you visit London without eating here, you've missed out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bv327Ftvjo_3e4fWD_VDcA"
  },
  "tguYyAMEoz4T53MsTy7oVA": {
    "date": "6/8/2017",
    "text": "I must have liked it because I ate there two nights in a row.  The service was friendly and efficient and the food was superb.  If I lived in London, it would be one of my go-to restaurants. My wife and I had grilled sea bream, pea & feta salad, Macallan12 for drinks and the next night the best fish and chips that I've ever had.  It's a gem, and I wish them the best.  I'll be back if I get to London again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4mCJCDaJGSodiLrWbm1KgA"
  },
  "wO8tEYyPd9H4GPGG97RiZg": {
    "date": "10/23/2016",
    "text": "Booked a table upstairs on a Thursday night - glad I did, the place was very busy and it might have been difficult to get served as a walk-in. I had been recommended this venue by some colleagues and the name sounded really light-hearted and fun, so thought I'd give it a go.We opted for mains and deserts. I had the butternut dumplings which I thought would be a rustic take on gnocchi but looked wonderfully elegant and was delicately flavoured. I'd definitely order this again. My friend's burger was presented on a wooden board (how very gastro-pub!) and tasted good too. You can't really go wrong with a cheeseburger and chunky fries.The crumble, which is the desert I really wanted, was apparently also very yummy, but due to being allergic to most of the deserts menu, I had to settle for the Eton mess myself. However, it wasn't messy at all - the fruit was hidden under one perfectly shaped dome of meringue and it was a very high-class take on a British classic. I was pleasantly surprised by how much I enjoyed it. Beautifully presented and absolutely delicious. Photographs are probably necessary to convey how great the food was but we couldn't wait to tuck in.The bill (including service) came to £68 for two people for two courses and a glass of wine each. You could have a similar meal elsewhere for cheaper, but each course was absolutely lovely and I was very happy to pay at those price points for what we received. A star comes off for the slow service (the waiters were lovely when we caught their attention, but it was difficult to do so) and the limited desert options for nut allergy sufferers. Taste-wise it was perfect though.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QBS9mj_CXl0Z-1gBhifB7A"
  },
  "2eGCTYAoaI1pkUKsYAGOVA": {
    "date": "11/20/2015",
    "text": "First gastropub in London, on our first night with friends. Amazing. We sat at a table near the window which had a great view of the street and all the people in the area. The atmosphere is upscale, friendly and welcoming. They aren't chasing you out of the place because it is crowded and people are waiting. Great place to sit and catch up with friends.The staff are nice, friendly and great with suggestions on wine and food. I ordered the lamb and was not disappointed. Notice the five stars, it was wonderful. Usually I bring home left overs, even when traveling and all the food here went at one sitting. It was great.I would recommend coming here with friends and to people watch. Again it is upscale so if your from America, do not expect glutenous dive pub food. This is upscale similar to our bistro wine bars in the States. Loved it here, I took they're card and wanted to go back. I was vetoed but that's ok. When in London to go graze here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ux8oH7TvcbSUGdrbC5c8tA"
  },
  "5ghdY5IJOG9NHw3sOZOrpA": {
    "date": "10/26/2016",
    "text": "Loved the atmosphere, service, drinks, food. Fish  and chips (terrific...heavily battered so be warned...) amazing beetroot soup. Beer on tap, nice assortment of wines by the glass, full bar. Ate upstairs. Fun place to sit and talk I would definitely eat here again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yE8JLvqwuLMxRGVc9FXDAA"
  },
  "xgNcJbOklNN4trKB2eEpqQ": {
    "date": "1/6/2018",
    "text": "This is a hidden gem; this quaint restaurant is walking distance from Marylebone station. The food is good and is a great place to meet a friend for a pint or a nice glass of wine.  Please try you will not be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E9Y4i-llHYom8H4ihtyHpQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Late lunch; very tasty starter.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E9Y4i-llHYom8H4ihtyHpQ/o.jpg"
      }
    ],
    "user_id": "4W8Ia94XsxI6mwy1LjsnxA"
  },
  "55FBWTtEEX1VO7rWjciWyQ": {
    "date": "6/11/2016",
    "text": "This easily would have been a 5 star review except for the service once I sat down. I was dining alone and had made a reservation for one. As I arrived, I was confused what the downstairs vs. upstairs was. It seemed like it was the same restaurant, same menu, just different atmosphere. I was tired at the time, so I thoroughly enjoyed being sat upstairs. If you're into the party social scene, definitely sit downstairs.The food was incredible, and the beer list seemed legit. I think the reason for the service mishap was the fact that I was alone, and there was another party who was unhappy with their meal, and then more tables were sat with bigger parties. I think my waiter may have been overwhelmed at the situation and maybe figured I was easy and a low priority.If I lived in London, I would definitely go back. I think the service thing may have been a weird fluke. Hopefully I have the chance to revisit.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "66ScUXWNjeADWezxBmThzw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Window seat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/66ScUXWNjeADWezxBmThzw/o.jpg"
      },
      {
        "img_id": "ibna5SMa6iNZKGenBQMd3g",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Entree and beer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ibna5SMa6iNZKGenBQMd3g/o.jpg"
      }
    ],
    "user_id": "8_Hs9Bh5tgFdc_1ycxHChg"
  },
  "zz1uvMQkhqqzm8nw5gF2gw": {
    "date": "2/21/2017",
    "text": "This is a modern British style pub. Apparently we were lucky to get in for dinner without a reservation. Great selection of food to drinks, quality food and excellent service. It is quite loud. But after a long work day and out with a colleague it was also nice to feel and hear London's vibrant after work crowd. Reminds me of a British - Parisian Gastro Pub.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5e9dglbkbR1KnSQKvkHxPA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. White Park beef & Cubitt House ale pie, Cheddar, truffle neeps. Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5e9dglbkbR1KnSQKvkHxPA/o.jpg"
      }
    ],
    "user_id": "nxOOo7tHLtZfESxA8De_Aw"
  },
  "muKnYpJWW9v_9FMZuBdKeg": {
    "date": "9/15/2018",
    "text": "Beautifully cooked everything! Just what was needed after a long day traveling. Great atmosphere, friendly and amazing staff, and most of all- the food is perfection!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRpr9HNfT2U4KSmvjFsR7g"
  },
  "_xoSTZiz7hPlYTFIgS3vTQ": {
    "date": "6/22/2018",
    "text": "It's a great public house and hotel! It has a wide range of creative cocktails and a good selection of food at a reasonable price. This public house has very friendly staff that helped me make a choice explaining the menu. Here you can find a very pleasant and friendly atmosphere, it is a perfect place for a small break. The menu is very rich and varied in dishes, so any gourmet can find something good and tasty. At the bar, we served soup, fish potatoes and ham, all were delicious and very tasty. My friends and I were very pleased with this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hMNUIGLr6H8-KKVNGYJNQ"
  },
  "3T9YvAa0rm-5uJCJMFpdnw": {
    "date": "9/9/2017",
    "text": "Total gem. We discovered this place via Yelp and still can't believe our good luck! As former London residents, we can say that this is one of the best meals we've had in the city full stop. There is an inordinate amount of attention paid to flavors and quality of food, and the meals are creative and interesting without being pretentious or inaccessible. We had the buratta to start, which was lovely and complex. From there, my husband had the burger (a solid A-), and I had the chicken and bacon pie, which was a total showstopper. I'm generally not even really a fan of meat pies, but decided to take a gamble on this one and it paid off. Eating it was basically a religious experience. Paired with a glass of chianti, it was a perfect meal. Absolutely on our list when the next time we're here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-hstLS818_DNJ932PThHw"
  },
  "vXSmwGLLHz7FC5JYrFpb0Q": {
    "date": "4/28/2018",
    "text": "Wonderful atmosphere, delightful staff, superb cocktails and beers, pup food good but not stellar.  Would definitely go back but would try something other than the rib eye. This chewy cut of meat distracted from this overall great restaurant. Truffle Mac and cheese is a must and my husband enjoyed his burger. Would like to see a few more lighter salad or vegetable options.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Amurub1J-JnZn5I6SHx0RA"
  },
  "EXDMKDSzGdPEePGclvxQ6w": {
    "date": "3/7/2016",
    "text": "I ordered the pulled pork and beef burger, and told them I had a dairy intolerance. The waitress said she would remove the cheese. Great.About 20 minutes later, a bunless burger comes out. The brioche bun had milk in it, and so it had been removed, along with the cheese.It would have been nice to be told this before the food came out - I would have probably picked something else.I was offered some rye toast on the side instead, which I accepted. The waiter then asked if I wanted any butter on it...The burger itself was nothing special. There was 2 or 3 large bits of gristle which actually felt like I was crunching on bone. Cue the graceful removal from my mouth to the side of my plate.In all, not the best experience, especially for anyone with a food intolerance! It also took about ten minutes after I'd finished eating to grab the attention of a waiter for the bill, despite there being only about 8 people dining.Finally, the Yelp two ££'s made me think this place was cheaper than it actually was. In all with tip it came to £20 for a burger and a Coke which is pretty pricey for a simple lunch which isn't too special!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lzAfOULgZj8dPQ4aUGyXMg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. My bunless burger... 15",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lzAfOULgZj8dPQ4aUGyXMg/o.jpg"
      }
    ],
    "user_id": "7Ro3UwVc4m264CckiwZLgA"
  },
  "irbP-SQbDJCJBTu3y84xgw": {
    "date": "7/30/2017",
    "text": "Amazing place for breakfast my order was corn bread with avocado it was the best I ever had I would defiantly come again and recommend it , service was amazing too",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4gidRPJ4Dp2wTJdPnEX4ng",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4gidRPJ4Dp2wTJdPnEX4ng/o.jpg"
      }
    ],
    "user_id": "kYTm4WGkjODQTRyjAs_vRg"
  },
  "3iOzGUdqUD1P6XA93kNyuA": {
    "date": "6/24/2017",
    "text": "Ambience is spot on.  Food and service sub par.   Over priced and not worth the experience.Save yourself the regret and go step down and enjoy something somewhere else.Had the special beef dish.  It was not special in a good way more gristle than meat.  The other dishes were no better than any fast food fish and chips.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-I6sUeC2_y23LL9r2KCg9w"
  },
  "A3Yv4av_gkdO-DOfiqVGRQ": {
    "date": "4/1/2018",
    "text": "Nice service , very classic and location is just mystic location.Service is nice, portions are just good and prices are above average , so factor that in your plan.Nice service and great presentation",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbhGiGsIHIDYaIT9PdvQCg"
  },
  "C38U1zQ7Hxbo4OsTvop8tA": {
    "date": "12/9/2017",
    "text": "A very genuine English Gastropub that serves an excellent breakfast.  Lots of British charm, and this place is very dog friendly.  Some of the tables had their dogs in their own chairs.  Very different from America.  A wonderful walk from our hotel.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ebBjySIq_FFdXeb13Ax9cQ"
  },
  "fZPhULCniJzKvbcD8PHFoQ": {
    "date": "9/18/2017",
    "text": "The food is above average, but the selling point here I think is the atmosphere. It's a great place to eat, but it seems like a better place to drink with a friend or two. Either way it's pretty good here so check it out",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gyf6We0W0NQJEjUmUpJZHg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Umm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gyf6We0W0NQJEjUmUpJZHg/o.jpg"
      },
      {
        "img_id": "nvgxojo-qhCRZgx5YY9M7Q",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. The burger is pretty good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nvgxojo-qhCRZgx5YY9M7Q/o.jpg"
      },
      {
        "img_id": "o3dQ_IE3QDNuOOtcsVlakg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Pig cheeks are good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o3dQ_IE3QDNuOOtcsVlakg/o.jpg"
      }
    ],
    "user_id": "zAgS9yEyETNwGz2YSI1ZrA"
  },
  "Xi_1w_sz4M2NLPrMm03lgQ": {
    "date": "9/8/2017",
    "text": "Best restaurant I ever had fish &chips the staff very friendly I like the environment sure I'll come again with my friends",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QjIzpvNilqcgqMGlkZOv_g",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QjIzpvNilqcgqMGlkZOv_g/o.jpg"
      },
      {
        "img_id": "vcGZsl8iv74byWj2pbBbQQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vcGZsl8iv74byWj2pbBbQQ/o.jpg"
      }
    ],
    "user_id": "tETCeJCt42ytV54MD3MOzg"
  },
  "KotFzBsgEd7eB2okGghkGQ": {
    "date": "6/13/2017",
    "text": "This is a solid choice for a modern pub atmosphere - Some good beers and a nice selection on the food side. The pan fried Cod was delicious,  the fish and chips was good but small in size. The spicy Calamari and other apps were all ok but very small for the price. The help is slow, you will be raising your hand to get another drink or whatever - An empty glass simply isnt seen in here. Ill go back because the beers are good and the food is tasty - but its not a great value and the service is consistently slow.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3CclpcVIjYw54J0eXollMQ"
  },
  "sTYJM8y3wOWfOsN9mIkrwg": {
    "date": "11/26/2016",
    "text": "Horrible noise humming through wall, second floor corner table. Very annoying.Service was slow. I never received my salad. Pork-chop was tasty as was the spicy chicken.Nice dining-room but who added the tacky rubber plants every where?  Very out of place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K_m00yAbaOgcGQQjMH10lw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K_m00yAbaOgcGQQjMH10lw/o.jpg"
      },
      {
        "img_id": "ra88hssKckpEcMlPPIohaA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ra88hssKckpEcMlPPIohaA/o.jpg"
      }
    ],
    "user_id": "Vq73g5hdDBdxdBOfkEYqyw"
  },
  "JAqH-0uNO5bQL3YZN43iiw": {
    "date": "7/14/2018",
    "text": "Decided to give this place a try as it was close to our hotel. It was quite loud, but it is a pub and so really can't complain; just had a hard time hearing what our server said and had to have her repeat things. I ordered their specials of the day: stater of eggplant/zucchini croquet and a chicken mushroom pie and both were delightfully tasty. Hubby ordered off the menu: starter of scotch egg and fish and chips and he was satisfied, but not wowed, the same response was given by my daughter who had the burrata and the rib eye.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cBInxCyxc-TzJu_YQkrnhw"
  },
  "SmcPyqUVJd0xOKVunBJCaQ": {
    "date": "7/3/2017",
    "text": "Fish and chips with smashed peas. Yum. Just like I pictured it, all the way. Sat outdoors on a lovey street with hip, cute shops up and down. An easy walk from my hotel (Churchill).  Highly recommend.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qoytLE7rDOQMkZrv0Eoj1Q",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qoytLE7rDOQMkZrv0Eoj1Q/o.jpg"
      }
    ],
    "user_id": "PHPW39mqg6jMsFeBZZzpqg"
  },
  "1wASOlkGCtN0XHsFNc_3uw": {
    "date": "7/5/2018",
    "text": "Nice place and very close to Oxford Street shopping. We came here on our last night in Europe (from the US) and the food was pretty good. The fish and chips were good (not the best we've had).  The quinoa burger was good and is able to be made vegan. The beef burger was interesting. The meat had a weird texture, but maybe that's just us. A little slow getting drinks and the bill but, very close to our hotel!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGxAOk_5KnlUsfSqVUkeiA"
  },
  "XanNqWuwkusNp5pqVRge5Q": {
    "date": "3/11/2017",
    "text": "3 1/2 stars because The Grazing Goat lies somewhere on the rating spectrum between A-OK but not quite Yay! I'm a fan. The cave bathrooms are downstairs and very cool! Staff were rude. The fish and Chips weren't quite cooked all the way through. Mushy peas were on point. Good fries and great bitter beer. Nice interior. Prices a little expensive for what you get.",
    "rating": 3.0,
    "rated": {
      "useful": 8,
      "funny": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "dfgPj43FVRnKIfxjLclqTQ"
  },
  "Zr-TIbN8ZcbypYLjGQM7dw": {
    "date": "10/18/2018",
    "text": "Quick stop in London on way back from Paris to Sydney. Looked for a nice meal near Paddington station before getting Heathrow express. Found this fantastic little pub. Absolutely amazing roast lamb with potatoes and greens! Caramelised with gravy and mint. Yum!! Everyone's else's was great too. Quick service, fun vibe and fantastic wine list by the glass. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSyqqe8u47LpkDiCctIBLw"
  },
  "LjNN3ZeK5yJRZFReJwdc7g": {
    "date": "8/9/2018",
    "text": "We were in London for three nights this summer and stayed around the corner from this restaurant. Keep in mind this review is coming from someone who was visiting Britain for the first time... so... FOOD- All I wanted was something comforting. I think I was chanting those words over and over as we walked to this spot. After 5 weeks abroad eating strange foods, I just wanted something simple and delicious and comforting. AND I GOT IT. Ahhhh man. The food here was perfect. I had the meat pie and it was perfect for me. I also had a pea and ham soup that brought tears to my eyes. The apple pie dessert felt like I was close to my mother's house and anyway, yeah. Maybe it's cause I was in Italy for 5 weeks and so fed up with pasta, but this place hit the spot. We came twice in three nights and ordered the same items both times.DRINKS- The cocktails were pretty good. I wouldn't write home about any except the London Cup which was refreshing and pleasant. The rest were worth what we paid and we left satisfied and boozed up.SERVICE- A bit hit or miss, but never too bad. We came once at 8PM and service was flawless. Then we came once at 6PM and it was rushed and not very attentive but we didn't worry about it too much.AMBIANCE- Look, I don't know what other London pubs are like, but this place was nice. Our \"british pubs\" where I live are divey as hell. This was upper scale but comfy.We will come back and definitely make a stop here. Absolutely loved it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U-StmVkhKNwucfWkuwTDdw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Pie of the day",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U-StmVkhKNwucfWkuwTDdw/o.jpg"
      },
      {
        "img_id": "zEP_cNujGHsBWHtGO2H_RQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Ham and pea soup (it's SO good)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zEP_cNujGHsBWHtGO2H_RQ/o.jpg"
      },
      {
        "img_id": "s_jWXYs-Qch_Evqx22_odg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Inventive and delicious cocktails",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s_jWXYs-Qch_Evqx22_odg/o.jpg"
      }
    ],
    "user_id": "HHB1ZUmORfSoGOCTif9Dsw"
  },
  "WaQfd3mm6ya1lp8A1dD7zA": {
    "date": "7/24/2018",
    "text": "After careful research, we decided to take a chance on getting dinner at this location. Even though we know London is a big place with plenty of options, we found this particular restaurant appealing to us. Especially because of their Sunday roasts.When we arrived, the hostess asked us if we had a reservation. We didn't, but she was kind enough to get us a table rather quickly. Once we were seated we got menus immediately. Notably, it took a while for our server to make first contact (which he acknowledged and apologized for).With a recommendation on which Sunday roast is best we placed our orders. The first thing we got pretty quickly was our cocktails (the Posh Goat). The cocktails were very good!Maybe 10 minutes after, we got our appetizer of Cornish mussels. Those were good, although a few didn't open. Then, maybe 10 minutes after that, we got both our order of rib beef and pork Sunday roast main dishes. The pork, with the apple sauce, was delicious, but the pork skin was very tough to chew (I had to leave most of it). The rib beef sauce was great, but the beef itself was a bit dry. We ordered a dessert, the Bramely apple pie that was very delicious.Overall, great service and cocktails. Just good enough on the Sunday roast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "13j86dLXocJJiCZJtfiK7Q",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Cornish mussels",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/13j86dLXocJJiCZJtfiK7Q/o.jpg"
      },
      {
        "img_id": "nOpp6E0CebIKuXpJB6NQ6w",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. The Sunday roast (pork)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nOpp6E0CebIKuXpJB6NQ6w/o.jpg"
      },
      {
        "img_id": "hG8DFIHN1-PSpnnJOuCxdw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. The Sunday roast (beef rib)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hG8DFIHN1-PSpnnJOuCxdw/o.jpg"
      }
    ],
    "user_id": "wbTxpKUoh1m5wII80VtCmg"
  },
  "lIqBwSQADOZn9OG7P-W2sw": {
    "date": "10/25/2018",
    "text": "Went here with four colleagues.  We went on a Sunday and they fit us in even though we had no reservations.  We ordered the rabbit, the calamari, and the mushroom appetizer.  We only ordered so many apps as the waitress told us the portions were small.  Small indeed   The rabbit was literally two meatball size chunks of blended meat.  The mushroom app was what seemed not even one mushroom cap worth. The flavors were good but the price was exorbitant to me  We each got a version of the Sunday Roast. I got the beef version. The portion was reasonable and with the veggies and Yorkshire pudding, a reasonable meal.  Probably about right at 22 pounds each. The service was friendly and loved the atmosphere despite it being a bit warm. Would recommend the place but it is spendy for what you get.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G9IZo2JhN1BnA_br4P3Lhg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G9IZo2JhN1BnA_br4P3Lhg/o.jpg"
      },
      {
        "img_id": "7Af_ssFNSMKltqLKf-Fleg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Af_ssFNSMKltqLKf-Fleg/o.jpg"
      },
      {
        "img_id": "wCXwUWNXGQjAzBzlUKlUug",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wCXwUWNXGQjAzBzlUKlUug/o.jpg"
      }
    ],
    "user_id": "I75WqXtbA3FmZKoieo7YSw"
  },
  "f9MCpMJYCBfaRPHhYyAYKA": {
    "date": "11/25/2018",
    "text": "The Grazing Goat's food is fine, but incredibly overpriced. If going for dinner, get either the chicken or the fish. If you're craving a burger/steak, there's better restaurants in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70T-6kHIj3DiJQna_4yQDQ"
  },
  "cKi2YOWiNsJIhnMAFui9qA": {
    "date": "5/18/2018",
    "text": "I was just hungry and stumbled upon here. The servers were very nice, and our food was good. I had the specials of the day, which was a meat pie and it came with a side salad. It was pretty good. I'm not sure what my boyfriend had but he said it's good. Good for a quick bite in the less crowded area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "srcz-GCD72YmycIMVzK-tg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/srcz-GCD72YmycIMVzK-tg/o.jpg"
      },
      {
        "img_id": "2QmXyji-GqpJfVPlt3bXZQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2QmXyji-GqpJfVPlt3bXZQ/o.jpg"
      }
    ],
    "user_id": "y9lcBunpsB6t3k5bBBDwEQ"
  },
  "occV-2rDRCl9rcE-xTNzKg": {
    "date": "9/9/2018",
    "text": "I found this place by accident. But I gotta say what a nice surprise. We arrive around 6:20 pm on a Sunday and it wasn't busy , but 30 mins later oh my it got super busy. So make a reservation if you can.The food was delicious. My only complaint was the service a little slow.. a little too slow ! Good thing we were not in a rush.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NjAhOaNs2SU9wpLDTuZq0g",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NjAhOaNs2SU9wpLDTuZq0g/o.jpg"
      },
      {
        "img_id": "LkMxpLWKh6ArgOdwQarFKA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Bread with salty butter and fried squid",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LkMxpLWKh6ArgOdwQarFKA/o.jpg"
      },
      {
        "img_id": "BhBs1tl1vHoZ7kUN4siBZw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BhBs1tl1vHoZ7kUN4siBZw/o.jpg"
      }
    ],
    "user_id": "-k7hcTV7Kq_LvDr5W3O5OA"
  },
  "Z-XHCExAR6c_yA2X2vrhRg": {
    "date": "10/9/2018",
    "text": "My wife and I stopped here for dinner and I had the best fish and chips I've had here. The fish was perfect and I'm not a fan of thick cut fries but these are the best I've had. Everything else i saw here look amazing also. Service was great too!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7G-YUPAot7L-j8afhVavAw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Best fish and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7G-YUPAot7L-j8afhVavAw/o.jpg"
      }
    ],
    "user_id": "gJRd0khkx072NHK9jSsweQ"
  },
  "pCbrwpZoVHWTPSsPRKlMbQ": {
    "date": "10/15/2018",
    "text": "Was looking for lunch near our hotel in Marble Arch. We stumbled upon The Grazing Goat. It was a great place for lunch. The food was very good and the service was great. The ambiance was great. Very light, bright and inviting inside.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P5b8HYYl-1ufAfYNHWI8vQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Service was great!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P5b8HYYl-1ufAfYNHWI8vQ/o.jpg"
      },
      {
        "img_id": "ITlbGhtb5NwWEHw7OogAqA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Great beer!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ITlbGhtb5NwWEHw7OogAqA/o.jpg"
      },
      {
        "img_id": "UrAbz815tb9A1LI7O4OnOg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Nice ambiance. Light and bright!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UrAbz815tb9A1LI7O4OnOg/o.jpg"
      }
    ],
    "user_id": "rF8IcN3P2TXghrbXj7q9oQ"
  },
  "cTpnYZzx7aMQjO_J4vaeVg": {
    "date": "12/29/2017",
    "text": "An excellent pub.  I was looking for someplace where I could bring my two daughters for a pint and some vegetarian food that was close to Oxford Street shopping. The Grazing Goat deliverers.  It had a very good selection of beers for me and a decent selection of food.  It also satisfied my daughters desire for vegetarian food (one had the veggie burger, the other had the butternut squash salad) while serving me an excellent burger cooked (as requested) to medium rare. I would definitely go back.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bO4Ax5l15SQedtA3rVU3Fg"
  },
  "9iCv0kEaBfI-WRhEbhDDAA": {
    "date": "11/26/2017",
    "text": "Fantastic food. Came here randomly after shopping. Staff was gracious. Had the chicken and mushroom pie. Truffle fries and spicy kale. Wife had the steak and fries. Both dishes were amazing and cooked to perfection. Would come here again and again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-LrNYBDRiFKyrWv1wrLg-A",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Chicken and mushroom pie with truffle-parmesan fries and spicy kale salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-LrNYBDRiFKyrWv1wrLg-A/o.jpg"
      }
    ],
    "user_id": "Ch94P9Uw9aelYmXybyMNZQ"
  },
  "kpYxtN3IoQh17aUBZF2f3w": {
    "date": "4/8/2017",
    "text": "I had the \"Maple cured gammon, potato hash,\npoached duck egg, & salsa verde\" and my friend tried the \"Chilli cornbread, smashed avocado, lemon, & herb soft cheese.\" Both dishes were delicious! The gammon is a type of cured meat and it had a light sweet maple flavor, paired with the richness of the poached egg, savoriness of the potato, and the salsa verde brought all the flavors together. My friends avocado dish was also really good and executed well for the minimal ingredients it had. I would definitely recommend coming here for breakfast/brunch!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9bzBo3TN2IhfCsdOeE4kVA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Maple cured gammon, potato hash, poached duck egg, salsa verde",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9bzBo3TN2IhfCsdOeE4kVA/o.jpg"
      },
      {
        "img_id": "baRuTaDqVRDTMnco9--NaQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Chilli cornbread, smashed avocado, lemon, herb soft cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/baRuTaDqVRDTMnco9--NaQ/o.jpg"
      }
    ],
    "user_id": "kQb8JluRLv5IAGdrMGh3Cg"
  },
  "aak4zQ7RsGQLRF5UhV4zxw": {
    "date": "8/12/2018",
    "text": "Been twice and was very good both times. Had the fish and chips and a chicken pie. Decent beer selection. Staff was friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5OsrSyyF0ZFC41_Js7ho1g"
  },
  "JuBKIRaf3ZJbnY-C-MUKsw": {
    "date": "10/27/2018",
    "text": "Recommended by our Consierge at the Marriott.  Good beer and wine selection, with a nice cocktail menu too.  Small food menu with a surprising variety including several vegetarian and fish dishes in addition to a creative carnivore selection.  The butternut soup and lamb pie (today's special) were fabulous!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3OttGJIaxkzVPpDv_hIFg"
  },
  "TetJUjZn3XiCtBt030RSAw": {
    "date": "6/15/2017",
    "text": "I'm not sure why my experience deviated so much from these other reviews, but my meal was lacking in almost every categoryI was a single so wanted to eat at the bar, but no bar stools. I guess I was lucky to be seated at a small table because it was crowded. I sat and eventually a waiter came over. I had been there so long at this point I had already decided on everything I wanted to eat, although I was still without any service. I ordered a beer with my meal. 23 minutes later (for real) my soup came, but still no beer. I could see my beer on the bar for at least 10 minutes with the waiter just walking back and forth, ignoring me, but taking the time to flirt repeatedly with a table of young women. when the soup came, brought by the host (owner?) I said I was still waiting for my beer and he found it on the bar and brought itthe soup was okay. potato leek with fish and bacon. a little bland, I added a lot of pepper. for the main I ordered the chicken and ham hock pie which was okay. just okay.I couldn't wait to leave since, at this point, I had been there over an hour. prices were  reasonable.oh, and there are 8 or so outdoor tables, which are nice. but, the windows to the dining room were large and opened, so all the cigarette smoke from the people outside blew into the restaurant. I was seated by the window and there was a guy sitting at the table directly outside smoking. he might have well been inside sitting next to me. it would have been the same experience.so...never going back",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "jj7qARHi2gfTZY87v2RQsw"
  },
  "E420KUX6iYvosmDQQ47jeg": {
    "date": "2/22/2018",
    "text": "Fantastic find! The highlight of my meal was the apple pie. It was more like a fine apple pastry, warmed in a mini cast iron pan and topped with cold vanilla ice cream, salted caramel, and candied nuts. I also highly recommend the Shetland mussels as an appetizer. The pan roasted Hake was well prepared, but just could not outshine the dessert and appetizer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n74hEQ2VXNpQnHwPKrzPoA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n74hEQ2VXNpQnHwPKrzPoA/o.jpg"
      },
      {
        "img_id": "1m_4BunKi1zGsq9CKjCofQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1m_4BunKi1zGsq9CKjCofQ/o.jpg"
      }
    ],
    "user_id": "_z2UQBUd2H8e-UQFhYxwuQ"
  },
  "GTYumlaXHsOEFsvbcKi1ng": {
    "date": "1/7/2018",
    "text": "This spot is perfect for drinks and/or dinner. Staff is super friendly too. Had the mackerel salad for my meal. Mackerel typically has a pungent smell, but I liked how this one didn't. And the salad itself was flavorful and nicely seasoned. Had a side of truffle fries and they were perfectly fried-crispy on the outside. I had to stop myself from eating all of them at once. My friend had the quinoa burger and she loved it! Hope to head back for Sunday roast!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWkFoDUEz58PPrtIqeFiqQ"
  },
  "Rx1xUj7OWMrINHIJFIIqBw": {
    "date": "3/9/2018",
    "text": "Great Pub! Great Food! We had salmon , was fabulous, we had leak-potato soup- outstanding,quinoa burger - super tasty with sweet potatoes fries ! Staff - friendly , accommodating and helpful with explaining about the menu!Yes to Grazing Goat every time we come to London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZqnkr9Qm_z0d_n3h6jksA"
  },
  "pmX7HyIwk0myfTrM2qRp_Q": {
    "date": "3/16/2018",
    "text": "We love this restaurant! Breakfast and dinner are both amazing. Next time we are in London I hope to stay at this B&B",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3dhnFOz1whfW03SEWZHLNg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3dhnFOz1whfW03SEWZHLNg/o.jpg"
      },
      {
        "img_id": "eSu07pPz1IL6xvlE3soRfA",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eSu07pPz1IL6xvlE3soRfA/o.jpg"
      },
      {
        "img_id": "tBNK_FU1CFEvmxYKhBF4Lw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tBNK_FU1CFEvmxYKhBF4Lw/o.jpg"
      }
    ],
    "user_id": "zRpLFFno0apI7oKnwFeHzA"
  },
  "gSwWH_RvABxqONKDA9dKSg": {
    "date": "9/24/2018",
    "text": "Great atmosphere and surprisingly good cocktails. Menu was a good balance of options. My steak frites was perfectly cooked and the cheese plate ravishing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "meBVvOoNnqvL0_sUUX4Hng"
  },
  "cL3X_Uph_cuSbJ_Pt4cQdg": {
    "date": "5/15/2015",
    "text": "Very good, upscale English Breakfast. Not pretentious. Feels like breakfast at a Country Inn, but it is just on a rare quiet street in busy London. Service is a bit laid back, but good food does not require overly-attentive service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0q_I6xP1leO37ALMI7kaQ"
  },
  "7qrqkoFN7K9q3TVDscSbkg": {
    "date": "2/22/2013",
    "text": "We made reservations not knowing they had an open pub area below the restaurant with the same menu. The downstairs was much more 'happenin' and better for people watching/getting the local experience. We ate upstairs where our reservation was and enjoyed our food however it was much quieter and felt like we could have been eating anywhere rather than an English pub. Recommend but arrive around 6p so you can get a spot downstairs in the pub. It gets crowded shortly thereafter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCNW_q1ONFOv05FJtyaRfg"
  },
  "NSWv3jCTsX09MNV00FHffw": {
    "date": "4/2/2015",
    "text": "Best restaurant in our 2 1/2 week visit to London and out of all our prior trips too.  We have returned a couple times and can't seem to get enough of their dishes.  A great selection for 3 adults and 2 kids. A bit loud but the food and service is well worth the noise after a long day of touring.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Nef5sd4VgVJ2ofBf3RZAw"
  },
  "HSiIaByzsAIhQprr5x3atw": {
    "date": "1/3/2015",
    "text": "Don't miss. The GG serves traditional food with a little surprise. We went because we wanted a traditional Sunday roast. I had that and it was phenomenal.  It was served with seasonal veggies, Yorkshire pudding and gravy you'd  push your mother down to get. ; } Everything cooked to perfection and delicious. My husband got the roast pork, which made my scrumptious dish seem only fair.  It was served with veggies,  a fabulous apple garnish ( And I don't like fruit with meat!!), and a pork cracklin like you've never tasted before. We were so thrilled with our dinner we went back to The GG the night before we flew home to make sure we had a yummy last night in London. We both had fish and chips with beer. The fish was smoking hot and juicy, the chips also smoking hot and perfectly cooked. Local beer/ale is on tap.  Enjoyed night 2 completely. They have a full bar, great service, and a bustling restaurant filled with locals All I can advise is GO!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqOPM_C44E0ep2gf5jBLJQ"
  },
  "A64GakZ9V8-5DJgGLnuwRQ": {
    "date": "10/9/2014",
    "text": "This is a great place to eat. My wife found it and frankly it was one of the highlights of our trip to London. Call for a reservation. Food will amaze you as will the ambience away from the craziness of Oxford Street.  Medium priced for London. A foodies delight.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KlcYbQ--IUvfBDt9sILhgg"
  },
  "kuXMhYnvgeQ18WVxsT-Gdg": {
    "date": "7/1/2012",
    "text": "Went here w a group from work. Loved the food and ambience. Fun place. Would def go again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSazQPhtHRtGdnViNN4AOg"
  },
  "1bHr37RVeehxCqvV-biFnQ": {
    "date": "5/11/2014",
    "text": "What I got is not what I expected.  I came here for dinner my first night in town.  When you arrive, you walk into a normal looking pub.  However, the food more closely resembles a fine dining experience.  Since my employer was footing the bill, I decided to splurge.  After Siri informed me that 200 grams is equivalent to 7 ounces, I decided to order the 35 day dry aged Ashbridge Farms beef fillet with the herb and spring truffle mash and classic gravy, and a side of broccoli.  I ordered the beef medium, but it was served medium rare.  That's cool.  It was still amazing.  My knife sliced through the beef like a hot knife through butter.  The mash was flavorful and the gravy was the perfect finish.  And I actually ate all of my vegetables!  My only complaint would be the small portion size for the price.  My food cost 32 pounds, and sadly, I was hungry later on that night.  However, I will surely return the next time I'm in town.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LyS0PyRDC1NkUzyX6te0gw"
  },
  "SHB3z7OAWLhsgw9YNsafJA": {
    "date": "4/28/2011",
    "text": "We ate here twice this week on business (for lunch).  It has a very cool, hip but warm atmosphere.  That's it strong suit.  That, and a fair number of attractive young professionals.  The food is good.  But not great.  The service is good, but not great.  But it's just a cool looking place with ok food.  I wouldn't go again with so many other options, but it was a good enough lunch.  One lunch, I had the chicken and mushroom pie -- pretty good (again, not great).  And the other time I had the cod with artichokes (again, ok).  The decor (which looks a lot like Restoration Hardware with bleached/natural woods, bronze fixtures, and neutral tones) is the highlight.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2RHLKhpHLF6GtkuVs8Dyw"
  },
  "khWTKo_jl8BVfy1BWUsneQ": {
    "date": "7/15/2014",
    "text": "3 of us just had dinner here and it was the best meal of our trip to London so far. Two of us both ordered the 1/2 roast chicken with wild mushroom gravy (you have a choice of 4 or 5 gravies), bacon and sage stuffing, and sour cream/chive mashed potatoes. The chicken was great all by itself - crispy skin, tender juicy meat, great flavor.  With the addition of the wild mushroom gravy, heaven!! The mashed potatoes had great flavor and texture, but the highlight may have been the stuffing. Rather than just a lump of soggy bread, these were formed into small pancakes and pan sauteed until crisp on the outside and tender in the middle.Our third diner chose the veal served with polenta, spinach, and artichokes. Beautifully presented, the veal was melt-in-your-mouth tender and full of flavor. All of the sides were equally good. We highly recommend both of these dishes.Everyone's favorite dessert was the plum and almond cake. A wonderful little almond cake topped with a plum sauce, served with some vanilla custard and a small scoop of chocolate sorbet. Again, a beautiful presentation that tasted every bit as good as it looked.I was so focused on the food that I nearly forgot to mention the excellent service, friendly staff, and attractive dining room.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-gaYfkG80iHNpxY31RAooA"
  },
  "glJJHukpsanxfRymVf5kYQ": {
    "date": "4/8/2013",
    "text": "The food is prepared to a good standard and it comes out of the kitchen reasonably fast.  Service is friendly and the premises are clean (although those seat cushions are filthy).  The Grazing Goat is a good option if you should happen to find yourself near Oxford Street/Marble Arch and you'd like to grab a bite to eat at a pub.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R-c5M0iJkMxxTxIqTQQZ8w"
  },
  "zW0atRZKRWXpm6bcSM39Lw": {
    "date": "8/3/2011",
    "text": "Hidden gem near marble arch. Great modern interior, open front to the street. Felt like I was on the continent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrrWpW_WbMKseLP0LJfcZA"
  },
  "svC5JrnYs3z1QnOgaOZylg": {
    "date": "8/7/2013",
    "text": "Love the Grazing Goat. The Concierge from our hotel sent us there for the fish and chips - no joke. It was awesome, as we're the desserts. Great pub & bar on the ground floor and an updated but charming dining room upstairs. You'll love it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FgyjchdqI2aO5sWn25r9ew"
  },
  "PmL_n5tB9NueafjQc-0Qvg": {
    "date": "6/26/2012",
    "text": "Was here on an early Saturday evening after going to the zoo (yes yes I know- am I 5? We had family from outta town visiting ok!). Heard the name rattled about at work a few times so thought I'd try given I was sort of nearby. The place was fairly quiet when we arrived, but it filled up pretty quickly. Started out just as drinks but ended up staying for dinner.. Had the chilli squid for starter and the seared beef salad as a main. Partner had the burger, friends had the fish n chips, scallops and mackerel salad. All pretty standard fare, although my friend thought the scallops were fab. Overall, it was ok...but just ok. Think if I'd stumbled upon it randomly, I might be more inclined to be more favorable, but it being called a gastopub is a bit generous I thought. It was just a nice pub to me.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybpiz7hZFsfGlXTzUulnSg"
  },
  "H3yNhzel8KuyF4tLXxep_w": {
    "date": "10/4/2013",
    "text": "Had dinner at the Goat last night. Our server Nikolas was excellent. He recommended some French champagne that was reasonably priced and very smooth. The venison was as good as most filet mignon I have eaten in the USA. Reasonable prices, great food and excellent service, what more can you ask for!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DvAPs_5JwM1_kubonJtPA"
  },
  "hGwJBDJToccPETFPCTNJnA": {
    "date": "3/26/2011",
    "text": "Very pleased with my meal at the Grazing Goat. The cozy ambiance, original wood floors, and bomb shelter reminiscent bathrooms makes the restaurant feel quaint, historical and homey. My boyfriend and I ate here, we both enjoyed our food; I had the burger and he had the pie of the day. The chips were crispy and chef serves the food on wooden boards. I loved it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgCaXXrDm7E26BWbeU99uw"
  },
  "QXULqPxd-Kj7-f6i0P0PXQ": {
    "date": "7/11/2013",
    "text": "Very nice pub a couple blocks from the tourist zone.  Food and service were very good.  We enjoyed getting traditional pub fare with some refinement.  My chicken was slightly dry and I somehow ended up with two salads.  The strawberries-and-cream and passion fruit desserts were excellent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsfKS24TMmjaF93vSL9xmA"
  },
  "GibavqjPkzk0_8q05qofzg": {
    "date": "8/12/2011",
    "text": "Great indoor/outdoor pub. Love the service, the decor and the clean toilets. They serve cold drinks in a classic shabby chic atmosphere. What more could you want in a gastropub? Food, you say? I will update to 3 or 5 stars after eating here. Until then, all 4 stars are well earned.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0nGCGPwT013igdsMz8dbA"
  },
  "WlhUjMqVj7R7clWnWp3lkg": {
    "date": "11/23/2012",
    "text": "Excellent food, definitely not Pub food.  Service was spot on, we ate upstairs with 3 children and everyone had an awesome time!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FmPOCn_1RtoHJ1bqIR1zQ"
  },
  "FlLi8nfmto4OeuD1lnuEoQ": {
    "date": "5/10/2014",
    "text": "Love this place! Great food, service & atmosphere.  So glad we stumbled upon The Grazing Goat while visiting London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FfTv2-l81opu6KiyXhsEew",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Chicken & leek pie with broccoli and Suffolk Chicken with mash. So delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FfTv2-l81opu6KiyXhsEew/o.jpg"
      }
    ],
    "user_id": "l_p9lksr_Y0m_-oLsgRwYQ"
  },
  "-o46L6NeKD6daSO6qGHuMA": {
    "date": "8/4/2014",
    "text": "Good food and great atmosphere; the wait staff was also very friendly.  A general all-around good fun.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAb47uEcSjK3uQcylhkhPw"
  },
  "EfL_u_1QqqUaQTEN3J8mTg": {
    "date": "5/1/2016",
    "text": "I normally find British food  insipid but, this local Restaurant was excellent; with a Mediterranean flair. My fish was delicious and the staff was very friendly. I recommend the green asparagus as a side order.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efA5vsbIfL8tPVwiBleDdA"
  },
  "BmhsTDzV0EYUBuGsmi8HoQ": {
    "date": "4/24/2015",
    "text": "The food here was lovely, truffle and parmesan fries deserve a special mention! And prices not bad either, portions were quite good and the quality was high.The service was super quick and friendly throughout and when we arrived an hour early for our reservation expecting just to have drinks on the bar they managed to fit us in at a table instead which was great for us. Nice selection of drinks, plenty of choices for food for all tastes and hidden enough out of the way to not be too busy. We only went here because it was close to the hotel where my dad was staying while here on buisness, but we would definitely recommend it and would visit again if we were in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2NPwLGdq4gZ825NRD17XA"
  },
  "fIB122dXPGuiPtii4sDMkg": {
    "date": "7/17/2012",
    "text": "Great little pub/bar/hotel tucked away near Marble arch.We ate breakfast here several times and really enjoyed the choices for breakfast, for me the favourite was the Pancakes.One night while in London, we ate dinner there, as it's a kind of Gastro-Pub, the food looked fancy on the menu and we weren't let down by its appearance, the taste was great too.I'll go back when I'm next in London, great service food and atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a5TPdAT8MhWQHMwlF95YGw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Pork with crackling, mmmmmm!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a5TPdAT8MhWQHMwlF95YGw/o.jpg"
      }
    ],
    "user_id": "15Vv8Qu-s88jdo4bOCqcow"
  },
  "oIONwjxQ5SL_8ZVG9dQBHw": {
    "date": "6/16/2015",
    "text": "Two American business men discovered this charming restaurant around the the corner from the Cumberland hotel.  Great character, service, beverages, and food. We returned the next night, and will visit many more times.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MArW2uzZTXDDqnhi36kVaA"
  },
  "RWUJg2b9iwV1CAICVpkGiw": {
    "date": "8/31/2015",
    "text": "Excellent food (short rib pie), terrific service, nice ambience, and a trendy crowd.  What more could one ask?  Only downside - enjoyed myself so much I felt compelled to have a second pint...and perhaps a third before I leave!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGfQuZ8YLGGfImo3tYlLCQ"
  },
  "hsgY9dNN4fTid4JYXV7M5A": {
    "date": "11/5/2013",
    "text": "This is one of the faux-rustic themed restaurants in the same family as The Thomas Cubitt and The Orange.  We have had good experiences at those restaurants, so we decided to try this one.  It is just a short walk from the Marble Arch tube station.We were seated in the upstairs dining room and the friendly waitress handed us the menus to peruse, already opened to the drinks page.  We ordered a glass of wine each and both opted for the beef rib Sunday Roast.  The celeriac gratin caught our attention, so we ordered this as a side to share.When my meal arrived, my first feeling was disappointment: the yorkshire pudding was very small and ended up being more crunchy shell than substance.  The yorkshire makes the Sunday roast, for me.  Having said that, the meal as a whole was fine.  The plate came with a mini pot of gravy which you could pour out yourself, thus controlling the gravy distribution.  I poured mine all over the roast potatoes, yorkshire and beef.The beef was alright.  There were two slices and the meal came with a generous pot of horseradish sauce on the side.  The roast potatoes had a crispy exterior, but not crunchy.  This was all fine, but sometimes I enjoy getting the occasional small one which is mostly crunch.  It gives some extra texture to the otherwise sameness of the roast potatoes.The vegetables were simply blanched and for that reason tasted a bit bland.  Then again, it is better to have the vegetables slightly too raw rather than cooked until there is no flavour left at all.I was full and content by the end of the meal, and that is the most important criterion for a Sunday roast lunch.  The service from the main waitress was good, but the lady whom I assume was the manager appeared to have her mind on other things. It took a while for us to get our bill and we felt a bit taken for granted.  Overall passable, but there are other Sunday roasts in London which we prefer.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "6IIY7pjkfpgaBMz36fL0Iw": {
    "date": "10/26/2015",
    "text": "Excellent restaurant! Oysters, fish and chips, kid goat, pints ! Great ambiance as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdWUUtdTyBI0koxG-J_L4g"
  },
  "xrX_QicC_e3urcYe0vPpwg": {
    "date": "11/14/2013",
    "text": "Been in London two days and went to this gastropub twice for dinner.  Both nights were fantastic.  The craft cocktail was well-balanced and refreshing.  The charcuterie plate was delicious, consisting of toasted hunks of bread, a spicy tomato sauce, cooked cherries, and absolutely tasty cuts of meat.  The chicken & bacon pie along with its roasted root veg was delightful.  The thick chips were cooked well.  I ate myself into a dizzyness!After all that gastronomy, I ventured to the Grazing Goat the next night, this time with a co-worker.  This time, I made sure not to get a starter since I knew the mains would be more than enough.  They had a fish special that sounded delicious -- pan roasted sea bream on a bed of sauteed kale, creamed jerusalem artichokes, and a potato and bacon croquette.  I also got the truffled mashed potatoes that were great!  I'm glad I chose the off-menu special!Both nights, I found the service to be great, and so did my co-worker the second night.  The servers were working hard to make sure I/we was/were taken care of.Overall, the Grazing Goat is a fantastic place.  Great service, great beers on tap, great craft drinks, and dynamite food options.  It's good for a small gathering of friends, and just as good for an intimate evening for two.  So get over to the Grazing Goat...you won't regret it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5DwxyuZNlV8zwvjFVzFvwA"
  },
  "NZIJBeCAOJJ1AyV7KwiwGA": {
    "date": "6/3/2011",
    "text": "On New Quebec Street, tucked behind some big Oxford Street hotels, lies the relatively new Grazing Goat restaurant, bar and public house.  It is a rustic cozy little place spread across 2 floors of a townhouse.  We met up with some friends for drinks that had dinner there.  They absolutely loved their dinners.  Our server was pleasant and very casual.  Our drinks were served quickly and they seemed to have all different kinds of beer and cider available.  We were well taken care of and it is too bad I went there on my last night in town as I would have liked to come for dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DRT-FcIa-ls1AqCX9e5Nvg"
  },
  "SvcFdOKzm0R5bnuZgqlnPw": {
    "date": "3/15/2015",
    "text": "This is a Thomas Cubitt pub. One of the better gastropubs in London. If you are a tourist, wondering what a gastropub is, you won't go wrong eating at this place. Also, really charming location in Marylebone.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hd4NVW-FOxvfSC7Yv4iYXg"
  },
  "Mf4AKvSbkKG-MOLjtrmzCA": {
    "date": "11/3/2014",
    "text": "Time for some authentic Fish and Chips.A few blocks from our hotel, we found this wonderful English pub. The staff was helpful and courteous.The food was great. I had Fish and Chip while others in my party tried the chicken and beef entrees. We enjoyed a nice atmosphere of fellow pub goers.The prices were reasonable for Europe.Should I find myself in the  Marble Arch area of London again, I will go back to the Grazing Goat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3N760VZTXfl0xjM-c6x2OQ"
  },
  "nEa-A7RpYm-5rD_YIhSqcA": {
    "date": "8/4/2015",
    "text": "Great dinner, beautiful restaurant, creative menu. They were conscientious of our children. Nice wine selection, the menu was creative and offered lots of choices.  We ordered market fish, which was said to be trout, but to these Alaskan fishermen, but it was certainly salmon.  Regardless, it was fantastic!!  The roasted peach dessert was spot on, delicate and flavorful.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HllJd6fwRJdGSF1qqnFaRg"
  },
  "_oQxkqL5-_2-rXI-6DI2lA": {
    "date": "12/6/2013",
    "text": "Ahh, there is nothing better than the London gastropub.  And this one is a corker. My first night in London and I couldn't have found a better option.  Warm, welcoming, great traditional menu it's some tweaky touches and one of the best espresso martinis I've had made for a very triumphant return to London. I highly recommend the calamari starter and the salmon main course.  Also try the white wine from Kent which is surprisingly good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jMnq-LOfDFpiBiTdKsQYQ"
  },
  "WKAu1Qb1lYaCrl0BLImNcg": {
    "date": "6/7/2015",
    "text": "We came here on our first night in London to start our trip with a good Brit pub.  The Goat was a pleasant surprise . . . it had the usual menu items we were expecting, but in an atmosphere that was updated and more pleasant than the usual, dark pub.  Everyone was super friendly and the service was just right -- attentive but not rushing us.  As for the food, we didn't stray far from the standards -- Sunday roast (AKA prime rib) and fish & chips.  Both were excellent! We didn't have room or dessert, so we'll need to save that for next time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfoKPg1OExAbyAMie1ahmQ"
  },
  "mAY69d6XsYiPnekOR3wTBg": {
    "date": "7/19/2014",
    "text": "I am a huge fan of the Orange. The atmosphere, the food, the lazy brunches in the winter, the bustling evenings,... So when BFF told me they had a sister venue in Marble Arch, I was all ears (and stomach...). It was one of those chillax Saturdays, the weather was great, we were looking for a nice terrace to rest our feet, get healthy food and a glass of wine. The placed aced all of the requirements... Unfortunately, we arrived too late for breakfast (and that's a thing that could probably be improved, as 11.30 remains quite early to stop serving breakfast on a Saturday...) so we decided to go for a salad (prawn for her, chicken for me), yummy yummy! We had a lovely Cote de Provence (in the sun, what else??) to go with it and service was as impeccable as friendly... My heart stays with the Orange, but little sister is on a very good way!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LNJQHgdEdhYGwTT8c152Zg"
  },
  "8LmnS2CpN4XhtM_nBebyMw": {
    "date": "5/12/2016",
    "text": "Back our 3rd time for dinner. Once again just great. The food is always so tasty and nicely presented.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hl_fX_g8FKSDM5YPu4drxQ"
  },
  "_HV-cfceSGSw0A732_Ah9Q": {
    "date": "6/3/2015",
    "text": "From our room at the Hyatt we could see the lamps glowing in the windows in the back of this well kept building.  In the morning we read the Grazing Goat sign above the door and decided to try it for lunch after seeing 4 stars on yelp.   It was a great pick.  The dining room is paneled in a warm and inviting pine.  The staff was friendly.  The food was great and the wine selection was ample.   Perfect for a lazy afternoon.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9Nu1xUEMPqOJQDjiP2rCQ"
  },
  "MVTg4Dq9sbIFCyNnPFwh6Q": {
    "date": "2/25/2013",
    "text": "Love the atmosphere here!  On a nice quiet street too.The food was quite good, and would have been 4 stars but my chips were not as hot as I would have liked.  I got the half chicken with classic gravy on the side.  And chips.  The chicken was cooked perfectly and very nice flavor.  Classic gravy, I loved it!  Bit salty, but very rich taste.  Dessert, I got the rhubarb trifle, and it was a bit too sweet for my taste.  All in all, certainly would come back for some casual dining.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hItpsR745FhItUXOrklVhw"
  },
  "psm72mFD-QalgU1RyO45Eg": {
    "date": "9/14/2015",
    "text": "I am very impressed with the Grazing Goat. From the moment I walked in I was engaged by an energetic staff who all work together to engage and serve with great attention and efficiency. Soon I enjoyed a delicious meal of  spare rib pie with gravy salad and cheese cauliflower that was all cooked and served just as one would hope for.! Oh and delicious with Mortimer cider. I will be back with my friends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-qaemU7IbbT9Fc9qcWGRng",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. it was delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-qaemU7IbbT9Fc9qcWGRng/o.jpg"
      },
      {
        "img_id": "nIxWL-ffYyzPj-c_jgyqHg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Great Cider on tap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nIxWL-ffYyzPj-c_jgyqHg/o.jpg"
      }
    ],
    "user_id": "WEr8brLWtO9q26uxbk7gOg"
  },
  "D_H-DJtjBcFICLLdTtiqtA": {
    "date": "10/14/2013",
    "text": "After a long flight from SF and staying at the Marriott Marble Arch, we wanted something fairly close by and pub type food.Grazing Goat Public House, 6 New Quebec St. fit the bill perfectly. Walked in at 7:30 and were warmly greeted and seated. Shared the Potted duck & boar, spiced nectarine relish, potato sourdough toast which easily was enough for two. DW had the Half Suffolk chicken, bacon & sage stuffing and I had the Grilled Old Spot pork chop, apple sauce & crackling. Both were excellent and large portions. Also had a side of Tenderstem broccoli, onions & bacon, also very good.Full but we shared Banana rum cheesecake, caramelized banana, rum raisin ice cream which proved to be as good as it sounds.A couple of beers finished off a very good meal and a nice start to our trip.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFxqr9efDQttfMKJGWuo7Q"
  },
  "eRwaYt66Ig_YEiiJn1TiPg": {
    "date": "5/23/2017",
    "text": "Fish and chips and gin & tonic, and more fish and chips and gin & tonic.  I could eat fish and chips every day at the Grazing Goat.  My husband had the chicken and ham pie.  Also delicious, but I'll stick with the fish and chips.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MTMeldDpOv6FeeWi5Z-DNA"
  },
  "b15XCsRaXuwUzBd3bHCfUg": {
    "date": "3/16/2013",
    "text": "Good food, good service and good atmosphere. The Grazing Goat wasn't too far from our hotel which was great because we got to enjoy the neighborhood and the London \"air\" while walking to the restaurant. The first time I came here I ordered their fish & chips. It wasn't good. Unfortunately, I didn't try another restaurant to compare but I wasn't a fan. But everything else was good. We had the Grilled Old Spot pork chop, apple sauce & crackling; 28 day dry aged Rose County Farm rib eye, and their chargrilled British burger. When I come back to London, I'll be back at The Grazing Goat. And this time will try their brunch menu.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iTilkflhVfuXA-lMgyXbZQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Chargrilled British beef burger w/ cheese, bacon and chunky chips.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iTilkflhVfuXA-lMgyXbZQ/o.jpg"
      },
      {
        "img_id": "b0__pQ51rnElj9LjEpZGqg",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Grilled Old Spot pork chop, apple sauce & crackling 260g",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b0__pQ51rnElj9LjEpZGqg/o.jpg"
      },
      {
        "img_id": "BcmQrLLPnhxMrxjByjXGkQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Fish & chips. Doesn't look appetizing and tastes ok. Not worth the money",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BcmQrLLPnhxMrxjByjXGkQ/o.jpg"
      }
    ],
    "user_id": "SZUgjPqRH3ra6q6jHINZ4w"
  },
  "W7qHLoKb7vCIF7QNC5LvrQ": {
    "date": "6/15/2016",
    "text": "A solid cafe in lovely neighborhood in London. I really enjoyed the squash soup.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOtOI72wHUKYaOuf_3V8GA"
  },
  "qLB-Y8zxFqWjVLHqubbEsg": {
    "date": "1/19/2015",
    "text": "There is a lovely warm atmosphere as you come into this traditional English pub.  The decor is comforting and cozy and there is something very welcoming as you leave the icy cold of a winter's night in London behind.The staff were friendly and attentive.  The menu is varied and there is something there for everyone.  I was very excited and my expectations were high that this was going to be a meal to remember.  It was a good start - oysters on a bed of ice.  I am wary of oysters having suffered the effects of a bad one more than once before but these were perfect.   The main course was beautiful but too big.Overall this is a lovely place but there was something lacking which I can't put my finger on.  My friends love this place though so no doubt I will be back",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IqBqV2IUsupilRyofrNcGA"
  },
  "vACR3sUKuWIZo2tqTs5wxQ": {
    "date": "5/24/2015",
    "text": "On a surprise trip to London in February, we found this amazing gem of a restaurant. We actually are here twice, because it was such an amazing experience. There wasn't anything that we didn't love, but the guinea fowl was the most amazing entree that we had out of four. And the pork belly was the best app. I am already dying for another trip across the pond and we hope to stay at the adjoining hotel in order to be even closer to the best food in town. You can not go wrong at this restaurant and the service was great, even on super busy nights! I highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aX0tJJT2t-whAqKGWXr53Q",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aX0tJJT2t-whAqKGWXr53Q/o.jpg"
      },
      {
        "img_id": "B8aUZa8yXynbv_3aRY35VQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B8aUZa8yXynbv_3aRY35VQ/o.jpg"
      },
      {
        "img_id": "GAL7tlI6Hejd09RdEF_ALw",
        "caption": "Photo of The Grazing Goat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GAL7tlI6Hejd09RdEF_ALw/o.jpg"
      }
    ],
    "user_id": "EdAr5eGzcpU_0cexWEDnhg"
  },
  "yx4DVEXl84sl37nwyb2AYg": {
    "date": "7/31/2014",
    "text": "A charming small pub. Nice chair, nice tables, attractive bar, and outside seating. The menu was varied and locally sourced. There are draft and bottled beers, good wines and imaginative cocktails.But iit is the atmosphere created by the professional yet friendly staff that make this place so special.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KEs1w7S32O6S10VAwCjihA"
  },
  "PFeLkFFWNzOj2tIUGjQQWA": {
    "date": "3/7/2013",
    "text": "Hidden Gem in Central London - You will struggle to find a better all rounder in this part of L-Town.Hiding away from the hustle and bustle is always a challenge when you are trawling Oxford Street, but thanks to Yelp I found this diamond! It's a pleasant warming décor, and the staff are generally very nice. I had a very late Sunday Lunch here and Breakfast the next day.First experience was very positive; we booked a table about an hour before hand and went to dump our stuff at the nearby residence. When we returned they remembered and welcomed us with a smile. Downstairs area is first come first served, and they only take reservations for upstairs - it was a Sunday, but we didn't want to take the risk so we booked.The menu is half gastro pub half brasserie, but we couldn't see past the Sunday Roast - Two Roast Beef please! We were served by the supervisor who was knowledgeable about his wines and the property and we enjoyed talking to him about the company. Part of a small group of 4 properties, they seem to have got the formula spot on!We had a bottle of Bordeaux, which was lighter than we would have hoped for, but still a nice drop. And the food came quickly, nice and pink in the middle - Yorkies had obviously been cooked some time ago as they were dry and hard, but otherwise the food was good. Coffee and Chocolate Cake to share and we were complete! I should add that the service throughout was very attentive and non obtrusive.Breakfast was fine, I had 2 eggs benny, a double espresso and freshly squeezed OJ, came to around £15.  Service was prompt, but the guy was another one of those great London waiters who can't do eye contact - I think these guys must all have very dark histories... Though it was a beautiful day and it was a very good start to another day full of adventure!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tsn9u04d3uk4AI4NZamqRQ",
        "caption": "Photo of The Grazing Goat - London, United Kingdom. Artwork at my table",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tsn9u04d3uk4AI4NZamqRQ/o.jpg"
      }
    ],
    "user_id": "lOZKlSyQa-jSv4HZ66okGg"
  },
  "EUT_Ibl4MX5Q_io3eU0eeQ": {
    "date": "3/18/2017",
    "text": "I love food in this place, food is super amazing and the atmosphere just so cozy although service could be improved a bit but all on all great place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xnsF3t9BZuHPJe-XXzKrsw"
  },
  "hz_P33gLRVcJjXH7O9yGog": {
    "date": "1/28/2013",
    "text": "Stumbled across this place by complete accident, and am so glad we did. I have walked past the top end of this street numerous times and often thought 'oh, there are cute looking things down there' but never even bothered to cross the road and take a look. Last week I made that giant leap and found the Grazing Goat.Got there for lunch just after 12 and we were seated downstairs in the pub area. Beautiful place, oldy worldy with a touch of modernism (yes, that is the technical interior decorators term for it) and boy did that room fill up quickly.Quick tip: Book or turn up early in order to get a table!The food is a little on the pricey side for a working lunch, around £16 a main, but the quality is well worth it. Had a fantastic corn fed chicken, absolutely delicious. Really wanted to try the Pork Chop...no idea why I didn't....I'll go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7X08OrpWTjSuUJvPCBJPJQ"
  },
  "HPfdhmW-lxrbXH-lj2CFHA": {
    "date": "3/29/2016",
    "text": "We were away from home Easter weekend so my daughter a friend of hers and I went to church and then came here for the Sunday roast.   Love the atmosphere of the place.  Like an upscale, but not snooty pub.  It has areal neighborhood and family feel.  I had a well prepared leg of lamb with the trimmings. Mint jelly, popover, gravy, veggies. A nice bottle of wine. Service was very friendly.  Recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LghHcDB42fkYx43rVq-O9w"
  },
  "G2jWSrhbDVpaUWDwIVbGSw": {
    "date": "5/1/2016",
    "text": "Loved the drinks, the food was superb and the staff/service could not be faulted... would definitely go back...  just very surprised at how quiet it was... :-P",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RmMbDOMp_BFS_kllQbRNxg"
  },
  "PIau8WnQeGirk-2RuUuhqQ": {
    "date": "3/16/2016",
    "text": "I loved this place!  I went there two mornings in a row for breakfast.  The omelets were wonderful (how do they dice the butternut squash into such small cubes?).  Service was friendly, and the English Breakfast tea was a great start to the morning.  I also had fresh squeezed juice (apple, carrot and ginger), which was very refreshing after an evening at the pub.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmURIsxgnz1I7WycSCVP4w"
  },
  "m0J8jA1ItU5qPH19ExPeXg": {
    "date": "3/1/2017",
    "text": "Excellent food!  We ate here on December 23, 2016.  It was an incredible night.  The restaurant is cozy and the service was great.  And the food...ahhh it was so good.  I got the beef sirloin and short rib which were just superb.  I went with my parents, two little siblings and my grandmother.  Everyone left happier than when we came in.  Very family friendly restaurant, temperature is fine, noise level is not too bad.  Overall, I highly recommend this place.  I will definitely be recommending it to anyone who will listen!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YH507xo0ASi-N_jOUcDUMQ"
  },
  "aRqoFS0Bnjg_mE_QziB12g": {
    "date": "12/9/2014",
    "text": "I had a terrible experience here. I picked this place after reading all the wonderful reviews here on Yelp. When I arrived shortly before 5pm the place looked decently filled but not packed. A polite waitress greeted me and took me over to a table for one. Then, suddenly, all of London descended upon this place! There was barely any standing room. My table was surrounded and I felt very uncomfortable. The guests were looking at me wondering out loud why I was eating fish and chips here. That made me feel very self conscious and more uncomfortable. I was wrapping up my meal and the waitress could not understand that I was asking to pay for my meal so I can leave as quickly as possible. Eventually everything worked out and I left. If it wasn't so crowded and stiffling and if the waitress could understand when I told her I want to pay and leave I would have given a 4 star review. The food was actually very nice.Definitely not a place for me. Definitely not coming back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQb7UbjuNRwL1bCJKl7sEA"
  },
  "QWI2wgpQ-nxNcbpg69oQRw": {
    "date": "10/27/2014",
    "text": "Downstairs is a great atmosphere, loud and bustling with a cute little outdoor area - upstairs is really nice - good vibe! The food was good but pretty forgettable - delicious steak and very tasty side salad but that's about all. Fun for a night with a few friends.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7naik8VS6sPsfI0E_fEKg"
  },
  "8SOc8fGS7FIFgmmbsMCezQ": {
    "date": "7/5/2015",
    "text": "Wonderful restaurant! Just enjoyed a fantastic Sunday roast, very reasonably priced for the area and quality of food. Friendly staff and very charming ambience. I highly recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e2g8qeK-wr6pJOVY3CNXoQ"
  },
  "sYGVuQ67kPgnKcA5KwJPEw": {
    "date": "10/18/2014",
    "text": "The staff here are incompetent! It took over 20 mins to get our hot drinks! People who had arrived after us had their food before we even had a drink. The manager apparently sent our drink order to the kitchen then blamed his staff for the error although they weren't much better. We asked where our drinks were twice and were told ' the bar is slammed at the moment' but not once did she actually check to see what was wrong.The food when it arrived was nice and they did give us our drinks on the house but it was a begrudged act. I will not be rushing back in there any time soon!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvgVPn7xyDS2T8kJf0F7PA"
  },
  "06mO2g5gOW1S4WwxSpbQxQ": {
    "date": "2/4/2016",
    "text": "The fish and chips were so delicious. A great filling portion and cooked perfectly.  I even liked the peas which were mashed. Friendly staff. Would definitely eat here again and try something else.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvjqOu-oDLeuPFLpJ47VVw"
  }
}