{
  "JMyRrB4C2lC8FL1zUKV2Qg": {
    "date": "5/2/2012",
    "text": "As a Peruvian and a big fan of Peruvian gastronomy, I had anticipated more.My criticism can be parallel to other yelpers.The food is not for sharing because there is not enough food in a plate to share. The Don Ceviche and the Corazon were well made however, part of peruvian cuisine is the essence of being able to share a plate. The Chicha Morada was delicious, however I was dissapointed by the lack of Inka Cola in the menu (the most Peruvian drink you can get)Basically, you do not get enough food for your money.However, the inside atmosphere was quite nice. I felt it was a bit clustered plus there seemed to be too much staff running around. Definitely something that will be polished with time.The Lucuma ice cream was extraordinary though so I did not feel too cheated as I walked away from a ridiculously high bill at the end of the meal.If anyone wants more Peruvian food for less money, Tito's Peruvian Restaurant is classic. Better than Tierra Peru in my opinion. Either that, or make Ceviche at home which is the typical Peruvian strategy. Any food made at a restaurant can easily be duplicated at home with the right instruction and ingredients.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jMBHxLInzkts2K6l_kXTCQ"
  },
  "HBunJV1tiL77_mj_5uJD0w": {
    "date": "8/20/2013",
    "text": "Creative, beautiful, and freshly-made ceviche (and other Peruvian dishes).  Friendly and attentive staff.  Will return.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCiAn7esOAh9LRsSM65SSg"
  },
  "OlgLzOFqnLmENqpm83Dlbw": {
    "date": "3/15/2012",
    "text": "I haven't had enough ceviche in my life, having only had it once before (home-made) some years ago; recently,  I was watching an Anthony Bourdain episode on Peru in which he talked at length about the delicious heaps of lime-red onion-chilli marinated fish, leaving me drowning in a small puddle of saliva (I usually avoid raw red onions at all costs, even removing them from burgers.  They usually leave me with a tempestuous stomach, something akin to the plight of Lord Jabu-Jabu.  However, if anything will tempt me to abandon reason for madness, it's raw fish.  Bring it ON.).  Fortunately, Ceviche opened a couple of months later, and I'm glad that it has as this is one thing London needs more of, and I very much hope that it starts a trend.When we went, Ceviche was, simply put, a total madhouse.  The front of the restaurant contains a bar area (the walkway to the main dining room is barely wide enough for single file), whilst the back manages to seat an impressive number of people for such a small room - you'll need to tuck your elbows in.  If it were quieter, it'd be a pretty relaxing setting, very much a bistro-style restaurant with plenty of South American photos and posters adorning the walls.  However, it was absolutely heaving, and you're close enough to the adjacent tables (2 feet) that people notice when you're having a staring contest with their food.The menu declares that \"our dishes are designed for sharing\", aka \"our dishes are approximately the same size as a baby quail\".  Boo.  After some tasty fried cassava nibbles (dense-but-tasty, nicely cooked and not greasy), we tried 4 plates of ceviche: Don Ceviche (seabass/chilli lime marinade/red onions); Aliaznza Lima (fish of the day/prawns/squid/octopus/choclo corn); Sakura Maru (salmon/satsuma-mirin-soy-chilli); Barranco I Love You (seabass/lime/cancha corn).  I was really impressed by all of them - the fish is fresh (definitely not been sitting around), the octopus wasn't chewy(!), great flavours and the textures are nicely balanced between the softness of the fish and the crunch of the garnishes.  Oh, and the roasted corn is SO MORE-ISH. Yum.  The sakura maru and its orange marinade are particularly good - it's a bit sweeter which contrasts well with the sourer lime-based ones.Following this, we had quinoa salad, grilled steak skewers, and confit duck on rice.  The quinoa salad was a nice accompaniment to the ceviche, refreshing dressing and ripe avocado bits.  The steak skewers had those yummy charred bits on the outside (which kind of reminds me of, sigh, Nando's.  In a good way), but I would've preferred mine to be on the rare side as they were a little dry - they didn't ask me how I wanted them.  The duck confit on rice was enjoyable, but I had some gripes - the skin was crispy but, like the beef, the inside was a little dry.  It was also not heated through evenly, one end being warm, the other cold.  The rice underneath is really flavourful (duck fat makes the world a better place), but may be a little on the salty side for some people.  Overall, I couldn't help but think that the dish needed something to wet it a bit.Service was friendly throughout, although needs some polish.  Given that it's just opened, I'm willing to give them a pass for the odd mistakes here and there.  The bill came to just shy of £58 for two, sans alcohol (1 nibble, 4 ceviche, 1 salad, 1 skewer, 1 main dish).  It's pricey, especially considering that I wasn't particularly full when I left.  Whilst it is on par with a decent sushi restaurant, it's still a lot.Overall, I'm conflicted as to what rating I should give.  I'd give the ceviche 5* straight off, but I found that the other dishes weren't quite there (although that may change when the place is slightly less rammed) which is a bit disappointing considering the price.  On top of that, whilst I do love the interior, it does have that sardine-tin feel to it.  However, it is one of the few examples of its kind in London, and it does do very good ceviche.  So, if you like raw fish, or just good, refreshing food, go try and spread the word!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j7_FGnfY_rI4A2PFLZbkgw"
  },
  "k1w-pm0jGElq3ypfyR6DLQ": {
    "date": "4/28/2012",
    "text": "We weren't too successful the first time we attempted Ceviche. A 60 minute wait for our reservation went seemingly unacknowledged in the tiny, packed galley bar at the front of the restaurant and we ate elsewhere, grumpily and late. I've got to say though, upon being told of the extent of the delay and the effect it'd had on a long anticipated night out with friends, über amiable host Martin rolled out the red carpet, inviting us back for a return visit on him. True to his word, from welcome to the goodbye we were thoroughly wined, dined and damn near 69'ed. I do love the VIP touch, though it's a shame to only get it when you kick up a stink. The food thankfully, after the hype and the wait, broadly lived up to our heightened expectations.. 3 to 4 dishes per person, tapas style, is the recommendation. On that basis you could just get out on about £30 a head without booze. Not bad value for the quality and quantity, but it's not a cheap night out either. The food arrives as it's cooked, in fits, spurts and starts. Such wanton disregard to timing is expected when you're sharing, but it's definitely an experience that's best enjoyed with close friends. You'll need to be close to hear over the din too, it's dark, close and shouty in here. We took advice on the menu, pulling a selection from each section. Ceviche, the house hit, is a bit of a one note wonder to me. Slivers of seabass swim in a feisty lime and chilli marinade, silken in texture and fresh as hell. As well as this, we go for a mixed seafood plate, sadly this one is a little too similar and I think we'd had our fill by the time it turned up. It was certainly slower than the first to disappear. The other major food group here is the selection of anticuchos or grilled skewers of varying sorts. Not recognising most of the things they've been marinaded or basted with, we chanced a selection. Beef rump and heart came doused in aji panca chilli sauce, which turned out to be a mild tingling piquancy rather than anything too robust. The best of these served big chunks of salmon, in rocoto sauce. For those uninitiated into the world of the chilli, the rocoto goes by the amusing name of Capsicum Pubescens, a hairy leaved little heatbomb from the west coast of South America. Botany lesson aside, it gave the blackened fish a wonderful smoothly smokey flavour.The killer dish for me was a Lomo Saltado, wokfried striploin of beef served with onion and pepper. Sweet and moreishly powerful, you could have told me halfway through that I was eating slow cooked child and I'd have still carried on. Unlike last time, half the group were steering clear of the booze for reasons transportational and so only Dr Vole and I were able to enjoy Pisco Sours so moreish they had more than a touch of the Columbian about them.In an ideal world, Ceviche would be a perfect spot for a post work cocktail, washing down a plate of cold fresh seabass and a skewer or two at the bar. Sadly, and subjectively, it's way too busy for that to feel like an option yet, but it delivers further compelling evidence that the independent start up restaurant scene in London continues to thrive.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "36rahMtVT_litEvDPJ2iRQ": {
    "date": "9/8/2013",
    "text": "Yucca Frita with Huancaina sauce was super good.!Ceviche was delicious.!Causa was to die for.!And Arroz con Pato was amazing.!Their Pisco sour was super good and they have a Pisco drink with lavender that was just wow.!I will come back to this restaurant .!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clmA24DcDffqkod2rzpeYA"
  },
  "ATjpAh8k7MFytwF5H4eP5Q": {
    "date": "3/4/2013",
    "text": "I've never tried Peruvian cuisine before so I'm intrigued as to what Ceviche has to offer.Ambiance: Busy for Sunday lunch but was seated immediately.Services: Good customer servicesFood: It was interesting and I'm glad I tried it. Unsure whether I ordered the right dishes as I was slightly confused with their menuPrice: A little bit too pricey for the size. I think everyone should still give it a go to try the dishes. I'm glad I went for a meal there but I'm unsure whether I will return again.I went past another Peruvian restaurant near Charlotte street and they offer a completely different menu. Their menu looks more appealing than Ceviche",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aWwYZLBuOOWpH-wGqN9q6Q"
  },
  "KJQagFfI36GjlJpx1ZkMGQ": {
    "date": "2/7/2015",
    "text": "I have to add a star because the only negative thing about this place is that it's often a long wait to get in. Every dish I've ordered is full of flavor and beautifully presented. I've taken different friends here and they've always enjoyed the Pisco sours and the ceviche as well as everything else we've ordered. The bartenders are knowledgeable, quick, and friendly. I'm gonna miss this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H8_CqhrIwP9ncDk-zN4HHQ"
  },
  "54neOnS4rH5AcYN7WnAW6Q": {
    "date": "12/20/2012",
    "text": "I had a great time here! My boyfriend and I ended up here after had a rude experience at El Camion. Every time I've walked past Ceviche it was paaaacked, but we were in luck and were seated immediately! It was about 2pm on Saturday but it was a fairly full house. We were a little grumpy coming in, but our waitress was so friendly it cheered us up, as did the pisco sours which were delightful. I have only tried them once before so I'm no expert, but there was a nice egg white froth on top and just enough sour. Our waitress gave us some guidance on ordering, as far as sizes and types of dishes. The first dish was quinoa salad, it was the best quinoa I have ever had - topped with chopped tomatoes and onions on top of avocado it tasted like it was marinated with sugar and lime. I don't know how you make something so bland taste so good! And it's healthy!We also had the corn cake, duck with potatoes, pork belly and Don Ceviche. They were all really good, the duck and pork were fairly hearty for tapas style. The corn cake was good, nice and moist. I haven't seen many corn bread dishes in London and was happy to have it. The sea bass was thinly sliced (8 slices maybe) with a little chili and topped with onions, it had a little kick. The pork belly was served kind of mole style, which isn't my favorite, but my boyfriend loved it. The duck was fairly big, but nice and crispy skin with tender meat, we had a hard time finishing everything!The service throughout was great and we even received a Peruvian coin to bring back next time for a free pisco sour. I would love to go back but I think reservations are a good bet if you plan on going.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vC9JnZm-yd0QrEEO3wScA"
  },
  "lywUHsU8izoUFZBSlk-npg": {
    "date": "5/12/2012",
    "text": "First of all, the atmosphere is great.  I just loved the happening vibe at the bar, the spacious restaurant in the back, the music, the feel.  This place is what modern small plates dining at 10:30 pm on a Friday should feel like.I love Peruvian food and have had a fair share of it from living in Chile, traveling in Peru, and living in San Francisco.  Here they take an inventive twist on it, and sometimes they slightly miss the mark.  For instance, I LOVE causa, but the causa was a bit salty.  I love aji de gallina, but they don't serve it.  The ceviche was very good and the beef on the lomo saltado was divine--seasoned to perfection and precisely cooked.  It is great that they have so many authentic things here which will put Peruvian food on the map.  Service was fine although not great.  I think it is so close to being a perfect 5 stars, but just missing the mark ever so slightly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "LcXJWmGUxRt_25uDX0Y9Hw": {
    "date": "11/4/2014",
    "text": "Small place, not a lot of tables so best to book. If you just show up there may be a waiting list. They'll take your phone number and call you when it's your turn. Compared to other ceviche/Peruvian places that may be a little fancy, it's rather street food here, with a lively casual, warm and festive ambience. Music was on the loud side but nothing unbearable - the acoustics aren't too bad. Service was pretty quick and friendly. Its one of these little soho places where you can have a nice meal in good atmosphere. Good and tasty food. Not to keen on the salads standing on potato mash. But the skewers, beef filet (amazing) and the seafood ceviche's were yummy. Overall great experience, recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHDTAu08RM9yxSd_5yTtRw"
  },
  "l1uZI5D6mK67MOWmB6X-tQ": {
    "date": "2/1/2014",
    "text": "Ended up here last night after a comedy show around the Leicester Square area. I'd heard of it from coworkers before but to be honest we just wandered in after a few other bars in Soho turned out to be too busy or were closing down around 11 PM. Ceviche had a policy of asking you to order food along with your drinks after a certain hour, but they had an ample selection of appetizers and desserts to whet the appetite. We sat at the bar and ordered the Chicken Saltado Taquenos, which came as 4 wonton-wrapped packages about the size of your finger. They didn't give us any utensils so it was more finger food, I guess. It also just happened to be National Pisco Sour Day, so I get the pink pisco sour special, which was much stronger than I expected (but still very good!) A good break from the overly sweet juice cocktails that you get far too often. A strong sour is something to be enjoyed slowly, but the perfect way to end the night.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "tX8csL8Yoj1-1qhJBwyZIg": {
    "date": "5/17/2012",
    "text": "Great looking bar/restaurant specializing in freshly made ceviche.  The place isn't half as good as Desnuda in NYC.  I was a bit let down.  Anyway, it's worth a trip.Try the Pisco Sour if you've never experienced one.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vgnxCeEh7M8SXHnm4yKC1Q"
  },
  "jLyJ0tIk423IpuNGIiorDw": {
    "date": "8/29/2014",
    "text": "Modern style. It's been awhile so I can't really recall the details except I left very impressed and happy :) I do remember it being slightly upmarket.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zP53rcqQXGfhr0IVk-4jYQ"
  },
  "eMvZ_FE6l3s3vFkGPkf4aA": {
    "date": "9/1/2013",
    "text": "Lunch @ Ceviche today after a Soho Curzon film. Pisco lovely. Ceviche and pulpo + chorizo skewers really good. Crab, guac, and potato solid. Can't remember ordering little egg roll like dish, but pleasant. Espresso a marvel. Very pleased that LatAm finally coming to LDN in a big way.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-U9T-gHO_P5vs0lZiR1gzQ"
  },
  "fv4pz6RjCAnqwvJf8-8DNg": {
    "date": "9/20/2014",
    "text": "Can not love this place more! One night around 8pm I picked up the phone to make a reservation for 9:30pm for a second dinner reservation just because I was craving ti so much! One week I came to this place 6 times! Just can not get enough of this restaurant!It's not a huge restaurant, having the fact it's located in Soho hence it's always busy from 6pm till late, Lunch time is much easier to get a table but I wouldn't recommend you to chance it.The signature dish Ceviche is a must must MUST! actually all their ceviche dishes are out of this world, the Causa is another must try, anticuchos dishes can be quite filling but with amazing flavors!The atmosphere is very buzzy and up lifting, the services are great and friendly considering from the London standards, the owner also has another Peruvian restaurant in Spitalfield called Andina, another great place and a lot closer to where we live. If you haven't tried Ceviche, you are missing out, big time!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bdtlFWY2mpOfisbp-KYWQ"
  },
  "XNSvGP4mUg0bp4Q8J6hYmQ": {
    "date": "5/13/2014",
    "text": "I went with a couple of colleagues to the Ceviche for leaving drinks.I didn't much about Peruvian food, but boy was I positively surprised! What a great place!!The food was great and the Pisco sours were delicious.It's a perfect restaurant for sharing, so we all had different dishes and could try pretty much everything on the menu.There was not a single dish that I wouldn't recommend. Brilliant flavours, really tender meats, everything the way it should be.It's a fairly small place, the decor is not to everyone's taste, so it can get a little crowded and very noisy - so not the place if you want to catch up with a long-lost friend!The staff were really friendly and accommodating.We were a group of 8 or so and ended up sitting on stools on a very tall table. This was not the most comfortable way to spend an evening, so make sure you get a proper table when you go there.If you want to try a variety of starters and mains, and have a couple of pisco sours like we had, then a visit to Ceviche can get expensive. But for a great evening out, it's a really good place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MNBT1cJuer86gl9irb5kLQ"
  },
  "sTWbMbIvm5Ui7RiLX8LxKQ": {
    "date": "5/10/2013",
    "text": "i liked this place, yes the portions are a little small and its by no means cheap. however the fish is very fresh, the dishes varied and interesting and the service excellent. cool setting and decent location in Soho. we popped in around 4pm which is probably why we got straight in. I think sitting up at the bar would be a good choice. i think if you went all out and had a lot of food then your wallet would curse you, but I think its worth a look. i'd go back. peace.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "qNeUQDuFvYxyaiVpzGNY2w": {
    "date": "7/25/2013",
    "text": "Super place.  Great ambiance, cocktails, and food.  I like everything about Ceviche - from the cool look through to friendly but not intrusive service - everything is done to a perfect level.  And the wonderful food and cocktails.  The portions are on the smallish  side that require 3-4 dishes per person and it's all sharing style so best to go with a couple of people so you can try everything.  And those pisco sours... I could drink those pisco sours all day.... I could use with one now.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "jZM4y0zBNPE9aIINl6BGdQ": {
    "date": "7/18/2012",
    "text": "The service was mega slow... but i was touched that the GM called us after we had eaten there to apologise for this.  The food is pretty good, but I wasn't blown away and the atmosphere seemed not nearly as cool as I'd thought it would be given all the hype about this place - if anything it seemed a bit like a chain restaurant (people packed in, cheap feel to the furnishing). Though it's not expensive, so maybe 'casual' was what they were going for.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqnj3tF6Pe-9Ss4ahO3tug"
  },
  "CASpgpGyNtJsL-U1JEkFhA": {
    "date": "6/13/2014",
    "text": "Came here last night. It's a madly busy, loud and cramped place where you are compelled to sit far too cosily next to strangers. However a couple of the excellent pisco sours will help to put you at your ease. Our waiter, Daniel, was very helpful and efficient. I quite like the fact that the food comes when it's ready; anticipation is not a bad thing. We had the Don Ceviche, salmon in tiger milk and the razor clams from the starter menu. There wasn't much flavour to the razor clams but I loved the depth of flavour, kick and meatiness of the don ceviche. The salmon was much milder and the texture was amazing. We then had the chicken thigh skewers which were good, but not fantastic. What was absolutely top, and made the evening were the Choclo corn cake and the beef fillet (Lomo Saltado) from the main courses. They were amazing. The moist texture of the corn cake and its piquancy was perfectly matched by the sauce it came with, and the beef was incredibly well flavoured and yet cooked perfectly to medium rare standards. We had a mix of puddings to finish, the Trio Barranco. I would go somewhere else if you want something sweet. Loved this place. I will definitely be back. Other reviewers have talked about having to wait for a table for your reservation. My advice would be to make an early booking. I booked for 6.30pm when the restaurant was half full. It did become jammed very quickly afterwards. You can always go on somewhere after.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DwgoefLg51quf7saVqcTHg"
  },
  "R-JgNCkyezP3ZSScScg8Ow": {
    "date": "8/10/2012",
    "text": "This place is buzzing, packed with people from quite early on, and has a lovely atmosphere.  The staff are charming, the ambiance is great.  Others have commented on the difficulty of getting a table so we booked, which was just as well as it was indeed busy.  The food is divine.  Small dishes (you need 3 or 4 per person) of fresh, zesty, deliciousness.  I had a cornbread with feta baked into it which was the best cornbread I have ever eaten (and I'm a fan of cornbread, AND I've had the Ottolenghi version which is jolly good - but this beat it hands down).  Also a ceviche style fish salad which was fresh and succulent and light, and a salad of palm hearts, lettuce, broad beans etc which was perfect.  My husband had octopus and another ceviche fish dish and some good rice with beans and pronounced himself very well satisfied.  We couldn't help envying our neighbours' kebabs which looked great, so we'll have to go back to try them. Perfect for pre/post theatre eating, and for sharing dishes with friends.  It's not cheap (£4-£8 per dish) but it is very, very nice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgEJ0a6fxqUiFuXC9fMf9A"
  },
  "BCj6bTUlt_xZI4HvK_z-5g": {
    "date": "6/30/2014",
    "text": "Lovely place. It has a great atmosphere and very good service. The food is delicious and is served in my favourite format: many small plates to share. I highly recommend the Don Ceviche and Lenguas, and of course you can't leave without having had a Pisco sour.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P1HD5H3-i_NagvqBme0Kpw"
  },
  "g_vBv0F8q3f9qaGjKsoU7A": {
    "date": "8/22/2014",
    "text": "I went here in December, so my memory is a little fuzzy now, but here's what I remember:Really, really delicious fish tapas. It's all raw and marinated in spices, citrus juices, and olive oil. We got the sea bass. It was probably the best raw fish I've had in London. We also had some octopus, which was cooked just right. None of that rubbery nonsense. And the corn bread! We LOVED the corn bread. It was so, so good and the perfect compliment to the tons of seafood we were wolfing down.The plate sizes here are small. Everything is fresh and meticulously seasoned and prepared. You probably won't leave here feeling full. It's also quite pricy, but for its location, it's par for the course.I want to give it somewhere between 3 and 4 stars.. guess I'll round up :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMXfcEK9S4BVLYEGhyEsbQ"
  },
  "h3fTU4ml8eKNv7--ZvKYdQ": {
    "date": "12/3/2015",
    "text": "Well, Yelpers, we have done it. The place has been \"discovered,\" which means long waits, mediocre service, and a good dose of attitude. When we put our name down for a table, they said there would be one free in thirty minutes. Thirty minutes turned into an hour, and the promised table turned into a couple of bar stools at the counter, because tables were part of another (secret?) list. Upon request, after an hour of waiting on the counter list, they offered to add us to the end of the \"table\" list. No apology. No offer to go to the front of the list. Nothing. I've been a hostess before, so I know the job sucks, but at least I was always honest and up-front with my customers and I recognized when I'd messed someone around.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKVNoNdgV625MQSOfzrfaw"
  },
  "8dSr3f1vb3qpLpkB8CZ1cw": {
    "date": "5/14/2015",
    "text": "Restaurant was really loud when we went at lunchtime. The service was ok. Food is very good but pricey. Would recommend the yuccas chips and the octopus & chorizo were great.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOESgZuIppPxSN_6kSFgsA"
  },
  "GmMeDeNnelJKyzxdGNP9Dw": {
    "date": "5/12/2012",
    "text": "I was lucky enough to get a table as a walk-in for late lunch. Personally, I'm not too familiar with Peruvian food beyond ceviche, so I was really excited to give this place a try after hearing all about it.That being said, I don't think I would go back. The dining room is quite crammed and you literally have to squeeze yourself through to get in and out. There's not much lighting in the restaurant itself (I went at 230pm, and the dining room was DARK). Maybe they're trying to create \"ambience\" by using candles and no lighting...doesn't work for me!We went for the Don Ceviche and the Alianza Lima, arroz con pato, and the Peruvian \"corn cake\". First off, I get it's \"small plates\" and all, but the portions are rather small for the price! It was just enough food for the two of us, but we weren't hungry.The ceviches were okay - I prefer the Alianza Lima, where you get a mix of fish, prawn and octopus. They tasted very similar though, which shouldn't be the case. The corn cake wasn't to our taste - it's mixed with feta cheese and all I could taste was crumbly cheese and a hint of corn. Not very good.Knock-out dish that saved the meal for me was the duck rice - we devoured this. The confit duck was SO good, and the green rice (cooked with beer apparently, or maybe duck fat) was addictive. I could've easily eaten it all on my own...portion sizes are not very 'sharing friendly'!There's too many other restaurants in Soho for better value, and subjectively speaking, better food. It's unfair to compare Ceviche to other cuisines, but it's not going to be a regular haunt for me!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ApLkN0iabCPG-uojINAWag",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ApLkN0iabCPG-uojINAWag/o.jpg"
      },
      {
        "img_id": "gJgYbJc5hXKnrYHklmzncA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gJgYbJc5hXKnrYHklmzncA/o.jpg"
      },
      {
        "img_id": "XcwGVSmqjTyFPUGgppkPtA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XcwGVSmqjTyFPUGgppkPtA/o.jpg"
      }
    ],
    "user_id": "TE0WdwJscofrN73gdA2rew"
  },
  "Kfdz97j44BT9yP7v-0M8og": {
    "date": "5/29/2014",
    "text": "I wasn't even aware of the buzz around Ceviche when I went last night - we just needed somewhere to go quickly, and luckily were early enough to be sat outside to have a couple of dishes.First things first, the service is great - the host was friendly, helpful and personable. He kept an eye on us (when you're sitting outside, this is a huge plus) and chased up the dishes to make sure we got all of them as swiftly as possible. When it started to rain, he moved us inside for dessert, and the service at the bar was also excellent and attentive. Full marks.We had two glasses of the Malbec - I wish I'd known how infamous the Pisco Sours are! That said, the wine was wonderful, and I had to stop my companion from pilfering the very stylish glasses.To start, we shared the Cheese & Chard Tequenos. I've never had anything like them - very moreish, although quite rich so two each was enough, but I'd definitely recommend trying them.I had the Panza & Higo (Pork Belly) skewer and unfortunately, it was just alright. Quite tasteless and not particularly appetising. For me, the confit fig wasn't quite right with the pork, but I think that's just personal taste. It is worth mentioning however that I still ate it all!The dessert was the highlight - Chocolate Tart with sea salt, and pecan ice cream. I've recently discovered the delights of a good choco-salt combination (I know, I'm late to the party), so my expectations were high. This tart more than met them - beautifully rich, perfect portion size, right amount of salt. Wonderful.The restaurant is quite cramped, but that could be said of most of them in Soho. It wouldn't stop me going back for more (and I do really need to try that Pisco Sour).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7Y9Xb-jq4t7fbGBFwxqew"
  },
  "C31tzYSOmwc1VzBVqlDr2w": {
    "date": "2/22/2014",
    "text": "Nope. Words cannot describe how underwhelming my experience at Ceviche. - As this is a review I guess I'll have to try. Ugg. How boring. How nothing. It's your typical over hyped soho mistake. I went there with a group of 6, booked a table in advance and was looking forward to a nice relaxed catch up and trying something a bit difference. The restaurant tries to be quirky - pictures of news readers in grey-scale on the bathrooms and nic-nacs over the walls. In reality, there's nothing new or particularly interesting about the decore. The restaurant itself is incredibly cramped. Considering you'll be ordering quite a few dishes they decided to ignore that practical point in order to fit a few more punters in. The waitress knocked over an entire bottle of beer over my table, food and phone. While I sympathize with her having to move in these cramped conditions - we didn't get a replacement drink or plate. The food - very expensive for what it is. The menu suggests you get 3-4 dishes per person. At £8 each - the average price of a standard meal - it's a pricey option. But on a night out with friends, treating yourself you could get over that. Well you could - but the food was possibly the blandest experience I've ever had. I did expect with such small dishes to be getting some big flavors. Alas no. The corn cake - bland and dry. The scallops were ruined with a sauce that just wasn't right. The textures didn't connect in any way. The salmon skewers were nice enough - but how wrong can you go with salmon on a stick? Nothing even seemed that fresh. Not to say it was processed but - bland. I did however enjoy a lovely lavender and blueberry cocktail which was the most interesting and tasty part of my experience. And for £8 that was pretty reasonable. I just - can't recommend this place. I had such a rubbish night - we all did. So bland, overpriced and boring.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9s6xe93UEyFvV28URWRrtA"
  },
  "jNsKxa7wfBN8qRu1eVm7IQ": {
    "date": "1/4/2015",
    "text": "Had lunch here based off a recommendation from a friend. And also I was looking for some fish after all the pork knuckle I've been having in Germany.It's namesake, the ceviche, was very good and refreshing! Just the right amount of sour and the fish tasted fresh. The other dishes such as the beef pan was just alright. So I'd go here just for the fish and skip the meat next time. A fun place",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzHZujAcqW-GEbPuk-zKLw"
  },
  "3zmc9MfkYfrT1HlC3FdmQA": {
    "date": "8/16/2014",
    "text": "We always wanted to try out Ceviche since it's opened, and finally we did and the meal was pretty damn good! Although there were reviews about the service being under par, ours wasn't too bad so the experience wasn't ruined. Food wise, we had the raw sea bass, salmon and the kingfish. We were very impressed with the unique flavour of each ceviche dish! Those cucamelons were so interesting! They tasted a cross between cucumber and watermelon. For the hot dishes, we had the beef fillet and the grilled red mullet skewers and both dishes were banging! We had 4 cocktails: pisco sour (good), sol luz (good), an orange marmalade one (too bitter, not good) and a passion fruit one (good).Overall we like the whole meal and will definitely come back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRG85ChGn-U71rmVWz-U6Q"
  },
  "KdBKqs7m1fjb0UoGLZV9XA": {
    "date": "1/3/2014",
    "text": "Seeing so much great reviews, I really got excited to go.. All I should say: 'What a disappointment!'I mean, Ceviche is not the cheapest, most comfortable place to dine.. Yet, I have not mentioned the food... Blandness over blandness, weird mushy textures. I liked only their Ceviche but since there is very little that can go wrong with this dish, it should go without saying...Their wine was nice, but not amazing either... Desserts skipped after the main dinner experience, we asked for the bill immediately and left to more fun places.One star goes to the staff. The waitress was great!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-DLyf0EB5WYbt8lRR0vCKQ"
  },
  "AYJKXRLSo6zdZ6rCEiD5dg": {
    "date": "6/22/2013",
    "text": "omg best corn cake EVER. Seriously it was so good I would go back for just the corncake... and all of their ceviche (mostly the scallop one). I can seriously just sit there and eat all day. The skewers weren't that impressive.. the chicken was way over seasoned. The Salmon was good, though. I really like the food there but it's a bit too claustrophobic for me. I think next time I'm gonna ask for the high table so my back won't get brushed by the waiter's butt every 2 minutes. And I'm not 3 inches away from the neighboring table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LphHVE8Alp4P-irzg2Rang"
  },
  "fNmU3UkqozOAmC0QCbvKYQ": {
    "date": "6/26/2014",
    "text": "Had lunch here. Ambiance was very good, waiter was very polite and we got seated quickly.The Tequeños de Ají de Gallina are very good.The Cheese and Chard Tequeños were ok.The sauce that came with it was super good.We also had the Lemo Saltado, apparently the most favorite dish on the menu, and I understand. Amazing taste and the meat was incredibly tender. This you must definitely eat if you are here.The Hot Ceviche was not more than average. The fish was definitely fresh, but it didn't get me excited.Coffee was not too good, so I would skip that next time. The deserts looked amazing, but I have to watch my weight ;)Total cost for lunch for 2, only water, and 2 espresso was a little under £50,- so not a cheap place.I will go back and would recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nheku6W16WNVpGoUU7nJWA"
  },
  "U_xzzGwY8Y4Yjgp2YMs-HA": {
    "date": "9/6/2014",
    "text": "I echo some of the other reviews. You need to book. We sat at the bar and still got the 12.5% service charge. Tapas-size portions - reasonable quality. Very loud - exacerbated by suits shouting next to us alas! Very friendly service. Not so good for catching up with a friend as so loud.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kl8Kx7eN47PxQh8vV7tmQ"
  },
  "qTDZfP2h720sN6sUS1mdOg": {
    "date": "1/7/2015",
    "text": "Ceviche was absolutely delicious Peruvian food!!  The menu is huge with great drinks as well!!  Prices are good too!  The dishes are small and made for sharing, so, I would say, order at least 6 per 2 persons! Also, if you are looking for a quite environment, do not go here, the noise level is pretty high, being a smal,l busy restaurant! I had just one drink and the noise was nothing to me!! hahaha! We will be going back soon!!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NAqUTsPTMyIO4-gilRVVoQ"
  },
  "NYhAFlc7CUZ2ixmZh5MSkQ": {
    "date": "2/21/2014",
    "text": "I've recently moved to London and was looking forward to new culinary adventures and exploring the London restaurant scene. From my time in Miami the one cuisine that I was truly missing was peruvian and specifically ceviche.Perhaps my expectations were too high, after all in the southern florida city by the city, ceviche is the ambrosia of the residents and there are a bevy of restaurants that offer a fantastic variety of ceviche cuisine. Unfortunately my experience at Ceviche was disappointing. I ordered the Don Ceviche, which is fresh sea bass in a tiger milk base. The first thing I noticed was that the plate was missing some key ingredients that I am used too in ceviche: choclo (corn), sweet potatoes or yams and lime juice. It also had WAY TOO MUCH spice caused by the chopped red chiles that was overwhelmingly scattered among the fish.Moreover, there was not really a wide selection of other ceviche platters, There were other peruvian dishes on the menu, but not much proper ceviche.To be fair, the quality of the sea bass was very good. Also, I ordered a side of  fried yuca which was great.  The staff and service was excellent as well.However, if you are going to name your restaurant Ceviche, then I assume that to be your star platter.Alas, my search for good ceviche in London continues, in the mean time if you have no clue about what ceviche is all about then I am sure you will find  this venue acceptably adequate.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7EHAfWCL5bVYrRZWbxq90w"
  },
  "ugW306nOgVZ9jM8pN_0ryg": {
    "date": "8/28/2013",
    "text": "Um, amazing! It's been so long since I had good Peruvian food, plus a delicious pisco sour. This was a wonderful first date I had, despite how swelteringly warm it was outside, and inside, the restaurant.We tucked into several of the dishes, the Don Ceviche and the octopus & chorizo, as well as a few others. It was the perfect amount of food, too, not too much or too little despite our ordering just a few dishes.The pisco sours (yes, I had two! don't judge!) were great, as good as any I've had at various Peruvian events.It was very cramped, and quite cozy among tables, but we were still comfortable and able to get good service from our corner.I would love to go back and enjoy another meal when it wasn't so hot, because it seemed like such a cool place. The retro posters and bright colors, the lively patrons and friendly servers... all around, a nice place for dinner in Soho.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "caLOe8Kb9UZmjIGcJY5whA": {
    "date": "9/13/2012",
    "text": "I love a good ceviche. So I figured, what better place to try it than a place called Ceviche? And since my failed attempt with Tracy L a month earlier (although it wasn't a complete fail as the Soho Food Crawl came about a result), I've been looking for an opportunity to give it a go.I went with two of my friends and we were seated immediately (it pays to book in advance - otherwise expect 30-45 min waits at least). Our gorgeous waitress was quick to suggest some pisco drinks based on our likes and dislikes and I must say she had good taste. I opted for the Soho which is a chilli infused Pisco drink with elderflower and cucumber. The Soho had a nice mix of sensations with a  fiery bite and a cooling aftertaste and definitely a drink I'd recommend. My companions opted for a traditional Pisco Sour (perfectly made but nothing exciting) and the Pasión de Ceviche (a ginger infused Pisco with passion fruit puree and lime). All in all, it's easy to see why Ceviche is a favoured Peruvian drinking spot although and expensive one at £8 per small cocktail.Our starters consisted of both the vegetable (chard) and chicken relleños (think deep fried balls of batter, meat, and chillies) and a Causa Mar (prawn and avocado on a Peruvian potato cake). The chicken relleños were excellent with a sharp bite, tender meat, and soft fluffy batter. The chard ones were also tasty but lacking that zing from the spicy marinade on the meat. The Causa Mar doesn't stick out in my mind as anything I'd care for again. There was nothing particularly wrong, it was just meh.Naturally, we had to order some ceviche and opted for the Don Ceviche (seabass), the Alianza Lima (a mixed ceviche with seabass, prawns, and octopus), and the Drunk Scallops. The seabass ceviche was what you expect when you think of ceviche with tender slivers of white fish lightly cured in chilli and lime. Excellent taste and texture so top points for that. The Alianza Lima seemed to have lost its way with the octopus being too rubbery and the prawns failing to cure sufficiently. Minus points for not bringing the dish together there, Ceviche. Finally, the Drunk Scallops were just thinly sliced scallops. While the quality was tops, I expected them to do something more although I do have to give props for the large portion for a very reasonable price.We rounded out the meal with a Peruvian Corn Cake (absolutely spiffing but quite rich in comparison to everything else), Arroz con Pato (confit duck with rice that was tasty but again nothing special), and the Lomo Saltado (suggested by our waitress again). The Lomo Saltado was the highlight of the meal with incredibly juice slices of seared fillet in a delicious smoky and slightly spicy sauce. I'd eat that over and over again without complaint (and with a few cheers!).My Chocolate Physalis Volador for dessert (basically deep fried dough coated in cinnamon sugar and placed on a chocolate mousse) was tasty but very messy to eat. I think a different presentation would have been in order given that I managed to stay clean for the meal up to that point.Overall, a nice place and a good option for Peruvian food but a tad expensive for the quality and quantity. And I'd definitely recommend asking for help from the staff as everything our waitress suggested was golden!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "iQ0Asn5T25xS_oti5gBAfQ": {
    "date": "12/4/2012",
    "text": "Good grief!  I had to get a reservation a month in advance to come here - and I was really looking forward to it, given that ceviche is one of my favourite foods.  It was all I ate when I was in Peru!When we got there, the place was rammed - to a level of significant discomfort, and we were ushered to our (very squishy) tables.  The ceviche was in fact, very tasty, and so were some of the veggie dishes.  I cannot say the same thing about the scallop ceviche, however, which was soaked in pisco.  The scallops seemed as though they were teetering on the edge of going bad.  In addition, the wait staff were so rude!  I had ordered a dish, and they had misheard the name of it, and they came to our table with a cocktail.  We told them we didn't order it, and then they kept returning to the  table with the same cocktail, each time with a different waiter.  IF WE SAID WE DIDN'T ORDER IT, WE DIDN'T ORDER IT!!  The rest of the evening, the wait staff proceeded to be particularly rude to us, and we felt rushed to get out of there (by that time, we had only been there for 40 minutes, tops.)  By that time, we did not feel as though we wanted to be there anymore!In any case, if you need to get your ceviche fix, I would come here.  Otherwise, not worth it!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KgJdBWS3ReP6TVhYWJRKmg"
  },
  "tDZpvlnQmtZEH2K8q2UZeQ": {
    "date": "4/16/2015",
    "text": "One of my favourite dishes is Ceviche, so you can imagine how excited I was to hear that this restaurant was opening. However I was really disappointed with the tiny portions, over-priced dishes and average food. I make better Ceviche at home for half the price.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8i88aes8vg0rDvE-kAgxQ"
  },
  "OtsWiSWonlf2CO6eLSTvSw": {
    "date": "6/15/2012",
    "text": "I was almost denied the opportunity to taste the food from this exciting place. So many times I was denied entry either by reservation or by the door patrol. I almost gave up because I find it tedious to practically beg to get a table somewhere. It shouldn't be too hard, especially if we are talking early dinner on a weekday. Nor do I wait in lines to get into places like I was being asked to do when I went by as a 'walk in' in hoped of scoring a table or seat at the bar. There's a girl at the door holding a clip board like a club bouncer to check if you're on 'the list' and if you're not well a complete body block by said lady bouncer to stop you from even stepping through the door. And forget going to the bar for cocktails as people are sitting there to eat. So not a great place to meet friends for drinks which is a shame as they have an exciting cocktail list including a Passion fruit pisco martini and a selection of infused Piscos. But when you do finally get in... IF you ever get in... the food is delicious! The menu is varied, dived into types of dishes, all around tapas size so you can order a variety and try different flavours. A must is one of their ceviches a variety of fresh fish and/or seafood dishes prepared in a selection of sauces. I highly recommend the Don Ceviche which is probably the most classic. While they are known for their ceviche, the dish that blew me away was the Duck with Rice, a sort of crispy duck confit with a lightly spicy rice. Exceptional. They have made the most out of the limited small space making it simple and bright, though a very noisy place so don't come here for heart to corazon conversations. The Peruvian posters on the wall give a sort of reserved kitsch feel which seems to have become a cliche when it comes to Latin American decor. The service was friendly and helpful though food did take a while to be served. It is wonderful to see London, a city known for its diverse cultural cuisine finally embrace Latin American food. As until recently finding anything close to authentic Latin American food stopped at Tex-Mex and even that isn't all that grand. Yet slowly it is finding its way across the pond to us and a very good example is Ceviche.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PAFlpDtI9gwR8gyt1kB5jA"
  },
  "kL5wo5bPfggAxGiHRTDrPQ": {
    "date": "3/4/2012",
    "text": "I had been expecting this opening for some time and was lucky enough to snag a table the Saturday it opened. I will add the disclaimer that I am a huge fan of ceviche and have been on an endless, and as of last night unsuccessful, search for the kick in the UK. Finally it's here, and better than ever.First it was Mexican food, then fro' yo', and now, ceviche has reached London. It make take a while for the Brits to book a table at this small, vibrant new place in the heart of SoHo, but there is no doubt that it will be packed every night, both in the pisco bar and the 12-15-some tables in the back dining area. Although only a soft opening, the food was absolutely spot on, each and every dish done with careful thought, not too bland or over done. We took the tapas style approach sharing about 10 very reasonably priced dishes. The menu consists of 7 ceviche dishes with various mixtures of sea bass, octopus, prawns and peruvian spices. There is also a variety of anticuchos - skewered grilled meats - and salads and sides.Personally the Don Ceviche (£6.75) stole the show with seabass ceviche in ají amarillo chilli tiger's milk. Nothing gets this fresh, and the chillis add enough tang to the seabass without overpowering the fish so you still can taste how fresh it is. The Pulpo al Olivo (£7.50) and the Top rump marinated in ají panca chilli anticucho sauce (£8.00) were also favorites. Being a huge salad lover myself I am on a mission to replicate their quinoa salad (£3.70, seriously) which may seem a simple task, but the dressing needs to be just right, and they've mastered it.On top of all that, the various pisco drinks seem endless and it's just too easy to order one more drink, you know, to try a new flavor.All in all, this is a casual restaurant with hip decor and excellent, well-priced food. If only it weren't in SoHo I would probably vist a lot more frequently.  It reminds me of New York, and I think London is making great strides in bringing over more 'exotic' cuisines. Keep it coming.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "sADF3lzyS9OZs4uVOawPUg": {
    "date": "6/7/2013",
    "text": "Ceviche is a Peruvian restaurant and bar in Soho that as you would expect specialises in various ceviches. My friends and I ordered a large selection of dishes, most are tapas sized and perfect for sharing. The standout included the Don Ceviche which was seabass in Tiger's milk---don't worry this isn't actually milk from a tiger but a peruvian mixture of citrus juices and spices. We also ordered the seared grilled Salmon Rasado skewers which were so great we ordered an extra one. Plates are small at ceviche so we add to order more dishes than expected. On the other hand the drunk scallops (sashimi style sliced scallops) were rather bland and I wouldn't order them again.It was a bit comical when one of my friends swore that she would not eat raw fish.... little did she know that ceviche is all raw fish. When the dishes arrived, she was so impressed with the look of the fish (especially the salmon sakura maru) that she tried and actually really liked the food! Ceviche you have another convert!Being a Peruvian restaurant, Ceviche also specialises in Pisco Sours---the Peruvian take on a cocktail that is a mix between a margarita and a sour (it has foamy egg whites in it). Best if you book: we arrived without reservations on a Sunday evening and the place was packed, but luckily there were 3 seats at the end of the bar. Service at the bar was a bit slow...but the food and copious amounts of pisco sours made up for that.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fdRVfJllhtXAkbBIan0MAQ",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fdRVfJllhtXAkbBIan0MAQ/o.jpg"
      },
      {
        "img_id": "vJU4XZuoS43QuGw3DDq7Rw",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vJU4XZuoS43QuGw3DDq7Rw/o.jpg"
      },
      {
        "img_id": "JkdOHoLXla1rz96aB2jknw",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JkdOHoLXla1rz96aB2jknw/o.jpg"
      }
    ],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "u_PLDwxgL6Ev6RNT2EM2Mw": {
    "date": "2/10/2016",
    "text": "Probably the best Peruvian restaurant in London. Get the Lomo Saltado (its an umami bomb) and the Jalea Steamed Buns. Needless to say all the ceviche's are good - and don't forget the pisco",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hd4NVW-FOxvfSC7Yv4iYXg"
  },
  "WRWWQr1QYB_jP3qCLJtT3A": {
    "date": "12/9/2013",
    "text": "I thought it was nice but the flavours were lacking and ultimately thats why i gave it such a low star rating. The house red I had was really nice so that was a good start. The Yuca to start with Ahi Amaraillo dipping sauce was super good. But i'm a huge Yuca fan already and of Ahi Amarillo. So versatile a sauce. A staple in my home!Don Ceviche was traditional and really well done. Brava!AVOID: the Causa Lolo Fernandez. Its salmon tar tar with avocado and its just plain boring and mushy. The salmon was good, the avocado was nice.... together in a mound without salt, pepper, lemon, chiliflakes, anything, its just dull and a waste to me. The cow heart was not good at all. Its typical in peruvian street food to have an anticucho and this was super thin slices with a thin but tasty sauce over top which didn't do a good job of covering the taste of charcoal and burned bits from the grill. No bueno. MUST ORDER: Arroz con Pato. Its green rice with duck and its effing amazing. Seriously So good. So in the end, some good, some bad and some super!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "l2SMylFAR-__nbCZPUXTbg": {
    "date": "3/19/2015",
    "text": "I love ceviche so much. It's one of my faves in London and we all know it's not that easy to find consistently good relatively inexpensive food here.I've tried almost everything on the menu and its excellent. Do not come here too hungry because the portions are really small. The winners for me here are Don Ceviche,Drunk Scallops and the Lomo Saltado. The drinks are excellent my fave is the pisco sour.You should make reservations if you can but Ive come many times without but have had to wait or not had a great seat. The service is good but slow at times as they are busy. Once they charged us for things that we ordered but never received. Despite that I still really love this place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bHnLN6cMgizkzOXNVrG4vQ"
  },
  "OExiJQQ5BPAn3A3mWYTcsg": {
    "date": "1/21/2013",
    "text": "Shopping in the West End just before Christmas was surprisingly quiet this year, which was a pleasant surprise. An added bonus is that restaurants which are usually jam packed at the weekends were quietCeviche has been a trendy hotspot this year with its take on Peruvian food introducing one of the lesser known cuisines to the London dining sceneI grabbed a seat at the bar, enabling me to watch the chefs prepare their mise en place for the day and prepare some of my food. Some poor guy was squeezing about a thousand limes - I guess that their eponymous ceviches must be a bestseller as well as their pisco soursDespite their most famous citizen having arrived at Paddington station, I was unable to find marmalade sandwiches on the menu! The menu is built around small plates, which probably makes it best for a group as you'll be able to try more dishesI did however get good guidance from my server who told me his favourite ceviche from the ceviche bar was the Alianza Lima, which gives a variety of seafood as well as a chilli kick. Being Chinese means that I have pork belly hardwired into my tastebuds and I opted for one of their Christmas specials - Chicharroncito con ensalada roja, slow cooked pork belly served with beetroot & raisin saladI was intrigued by some of their soft drinks like chicha morada (purple maize refresher) and makaha cooler, which contained guanabana but at £3 to £4.50, my Chinese Thrift Gene wouldn't allow me to spend that much money on a soft drink I may not enjoyI was able to watch the chefs creating my ceviche from my seat and both dishes were very visually appealing with great colours and smellsThe Alianza Lima contained a mixture of seabass, mussels, prawns & octopus in rocoto chilli tiger's milk with sweet potato and choclo corn. A good mix of fresh seafood with nice contrast from the sweet potato and the chilli kick. However, for my palate, I probably wanted a little more sweetness in the overall balance of the ceviche but it was still niceThe Chicharroncito con ensalada roja was a fantastic surprise. With its description of slow cooked pork belly, I was expecting a stew with meltingly tender pork. However, what arrived was deep fried crunchy pork belly, my favourite. Imagine good pork crackling but with the meat fried to a crispy finish as well. The sweet beetroot & raisin salad served well to cut through the richness of the porkA nice touch was that they gave me a little Christmas present - a matchbox with a token for a free drink with any meal in JanuaryIt was nice to experience a new cuisine though I suspect this place will survive as much on its trendiness and drinks as much for the food itself. A solid 4 stars",
    "rating": 4.0,
    "rated": {
      "useful": 21,
      "funny": 13,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "iM583WuDTd2Bpm-2Ln5lEA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iM583WuDTd2Bpm-2Ln5lEA/o.jpg"
      },
      {
        "img_id": "h3haPPXRDYUDUAAdNU7wHw",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Chicharroncito con ensalada roja - slow cooked pork belly with raisin & beetroot salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h3haPPXRDYUDUAAdNU7wHw/o.jpg"
      },
      {
        "img_id": "JIunp6XV2Ob6wmMWO6HYVg",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Alianza Lima - mixed seafood ceviche",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JIunp6XV2Ob6wmMWO6HYVg/o.jpg"
      }
    ],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "xgb4uIPsOXP44T3X0lzoyg": {
    "date": "9/21/2013",
    "text": "Food - 5 starsAbsolutely amazing Peruvian food. The sea bass ceviche was fresh with a great marinade. The grilled skewers and the hot dishes were equally good - definitely go for the beef. Seared outside and still rare inside, it was juicy beyond belief. The triple cooked chips were executed perfectly as well. On the skewer, try the chorizo and octopus one.So you might ask why 4 stars instead of 5 overall?The first reason is that it is really really noisy inside. The music is pumping out as though it a club, and the place is just enclosed and echo- ey. Not a place to go for a relaxing quiet meal.The second is that the tables are crammed to maximise revenue, so you're literally elbow to elbow with your fellow diners.The third is that they tack on a \"discretionary\" 12.5% service charge, which I am against in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "9UGLOXCGLYfsnproouK_MQ": {
    "date": "10/14/2015",
    "text": "A favourite of many in London which now includes myself.For the quality of the food you get and the lack of good Peruvian restaurants in London it is most definitely worth the price.I went with some friends and we ordered a fair few plates all trying a bit of eachothers (not sure if this was the right etiquette but whatever). All the dishes I tried were extremely tasty I'd like to point out the octopus as my favourite.Lot's of variety on the menu so there's bound to be something you'd like to try.As others have said if you have an empty stomach this may be quite an expensive experience for you. The plates are small so I feel this place is more suited as a light lunch. (Me being a pig I \"fueled up\" with some 4 o'clock dessert later on in the day..)Service is fast but you don't feel rushed (A common flaw in \"bar style\" restaurants nowadays).Didn't order a cocktail but one of my friends did, seemed perfectly nice.I give it four stars because for the price and the experience there aren't many places in London where you can go to get \"small plates\" to such a high standard!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bjxBr5E9MBmdFyH7oqP5Sw"
  },
  "2tLAjunzvbiKmaIWSZ_CLQ": {
    "date": "4/4/2015",
    "text": "Mediocre, borderline bland tasting ceviche.  Good drinks and service.Delicious yucas. Lomo saltado was okay, but I was hoping for more of a plate-full of fries/steak rather than chunky potatoes and some thick pieces of meat (I prefer to mix it all up). The lomo saltado also wasn't served with rice. I don't think the aim was to be authentic, but a more dressed up version. Wish I had known this before. I won't come here again, it didn't quite hit the spot because of the lacking ceviche flavours, and the overall twist on Peruvian. I am still looking for a London spot to satiate my Peruvian cravings.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4oJUXOQPQ_G52VkJyf3oOQ"
  },
  "YKuuyu0KjDAVFA0-mx5AnA": {
    "date": "4/25/2016",
    "text": "Yummmmy! Pisco sours are on point, ceviche is fantastic & the wait staff and ambience are incredible!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8CPAs2KwbwLyS7CjvPegjA"
  },
  "-pzlerlJdruvYGwCyDpyYg": {
    "date": "8/14/2014",
    "text": "I had a craving for ceviche last night, so what better place to try than one named after the dish I so desired? We couldn't get a table (reservations highly suggested!), but sat at the bar and were still offered the full menu. Thankfully, not a lot of people were eating at the bar, so we had a seat between us and another party. As it was, it felt a bit tight. The food started by coming out one dish at a time, but at one point we had three plates with us and it would have been impossible to manage had we not had the empty seat buffer. They suggest 3-4 dishes per person, which makes sense depending on your hunger. 2.5-3 is fine for me. We ended up getting 5 dishes for the 2 of us and left comfortably fully. We started with Tequenos de Aji de Gallina - essentially, egg rolls filled with a creamy chili chicken and some sort of sauce on the side (the sauce doesn't taste spicy at first, but when the aftertaste hits you...). The wonton wrapper wasn't greasy, and it was light and crispy. Absolutely delicious. Next to our table was Don Ceviche. Fresh chunks of seabass with red onions, radishes, diced sweet potato... and spice. A lot of spice. It was delicious but also slightly too much for me. I absolutely loved it, don't get me wrong, but it was the sort of heat where, the more I ate, the less I tasted. I will say that I tend to be moderately sensitive to heat, so YMMV. But it was fresh tasting and the flavours (what I got before the heat hit me) melded very well together. We also had two orders of Pollo en Paca - chicken thigh marinated in a smoked chili with orange zest, served with a sweet pepper jam. Absolutely delicious. Relatively mild heat combined well with the sweetness of the jam. Definitely one to come back for. Finally, we also had a corn cake - picture a more delicious version of corn bread, but with feta in it, topped with avocado and a fresh salsa-type topping. My first few bites had no feta and were absolutely incredible, but when I reached the feta, my rating of the dish dropped a few stars. The feta was far too overpowering and became the only thing I could taste. Aside from that (which I realise is a main ingredient in this), it was incredible. The waitstaff was very nice and never made us feel in the way (though by sitting at the bar you're almost by definition in the way, with the layout of the restaurant). However, the music was so loud that, even sat elbow to elbow, I could barely hear my partner. I think if (when) I come back, I'll choose a day I can sit outside to avoid the music - or maybe it's quieter if you're sitting in the main dining room? It's a shame, because it effectively killed all conversation while we were eating. Between dishes, we rearranged ourselves so we could speak directly into each others' ears. Not nearly as romantic as you'd think. But overall, definitely a place I'd look to revisit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zaKl7vvQ8w2GU2IZ30Nkg"
  },
  "hdp_h_hv8UByOj_x5e9dKw": {
    "date": "12/16/2014",
    "text": "Peruvian food!! well, having heard many good things about Senor Ceviche and having glanced through chefs cook book recently I was delighted to have a chance to go in and try the food with two friends.In a similar way to tapas the dishes are small and they recommend 3 dishes per person for an evening meal. With two hungry friends we took some time to contemplate the meal ahead. While we did we ordered some of their fine cocktails, all reasonably priced. I have several pisco sours, each one as good as the last.The menu is broken into different options, broadly ceviche dishes (funnily enough), grilled dishes, fingers foods and sides. I ordered the sea-bass ceviche, steak cooked rare, the fries with tomato sauce and fondu cheese and the chicken wings (I LOVE chicken wings). My friends ordered an array of other dishes and we patiently waited.As per some tapas and actually some sushi places ive been to, they serve the food as its ready, dish by dish not waiting for everything to be ready. This has plus points and negatives. Personally I like all my food to be there but from a kitchen perspective this is certainly easier. The irritation for me was that for example my fries came a long time after the rest......just a bit annoying and to be honest that's where for me they lose a star, its just a little confused.Sea-bass - stunning! Light, fresh flavours, some spice..sour..sweetness!! ahh gorgeous!Steak, with a parsley/garlic sauce you would expect to adorn some escargot....just magic!!All of the food is beautiful, the staff are friendly, welcoming an fun to chat to! This place is doing a lot right! which is why is comes highly Jd Recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "tiLKxHvdtSd2SxEfd9FKhQ": {
    "date": "3/27/2015",
    "text": "As you'd expect there are plenty of Ceviche options on the menu. Six in total, ranging from the traditional Don Ceviche (£8) of fresh sea bass in amarillo chilli tiger's milk, limo chilli and red onions to Asian inspired versions like Sakura Maru (£7) made up of tiradito of thinly sliced salmon in Nikkei tiger's milk made with satsumas, mirin, soy sauce and limo chilli. We had both and can highly recommend them! Light, fresh, zingy, delicious.The Chicken Tequenos (£4.50) - wanton fritters filled with Chifa style chicken and vegetables, which were full of flavour and nice and crispy. We also ordered a couple of dishes from the grilled skewers (anticuchos) section of the menu - Pulpo y Chorizo (Octopus and Chorizo) Skewers (£11), which was probably my favourite dish of the evening. Flame grilled chorizo, which is surely one of the tastiest things in the world and beautifully cooked, generously sized pieces of marinated and braised octopus. Stunning. The Alas eu Pauca (chicken wings) Skewers (£7) were very nice as well but I'm keen to try the Corazon Mio (beef heart) next time.We also had a couple of bigger dishes. Lomo Saltado (£13) Beef fillet, sliced flame cooked with red onions, tomatoes and chips and Amazonian Fish Patarascha (£12). The beef was as tender as you'd expect and the dish had a nice balance with the veg and crispy chips in a rich, smokey sauce. The fish was my least favourite dish, not because of the flavours but it felt a bit heavier and stodgier than the other dishes we ordered.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZ_3l6kV2vrwilDkd15WKQ"
  },
  "Go5Dfj8GhPJddkK_QPAvVQ": {
    "date": "1/5/2015",
    "text": "Ceviche has long been on our list of restaurants in London to try, and this year's birthday dinner seemed like the perfect opportunity for it.We ordered the sea bass, seafood (octopus, mussels, prawns, etc), scallops, white quinoa salad, the chicken with mash, and sides of plantain chips. The sea bass, plantain chips, and the white quinoa were standouts for me, and husband really liked his chicken pie-ish dish as well. The scallops weren't as amazing as I'd hope (having it with the pomegranate seeds makes a huge difference), but it was fun trying something different.As for drinks, we didn't choose any of their famed cocktails since neither of us are huge fans of cocktails. Instead we opted for white wine from a limited selection, which paired all right with our mostly seafood meal.I love refreshing, spicy, citrus flavours, so I enjoyed all of my dishes, but I would probably scale back on the seafood next time since it was a bit TOO citrusy as a whole meal. Go with their suggestion of sharing each dish and getting some from each section of the menu. And if you're really up for dessert, maybe be more conservative when you choose your dishes to make sure you have room. We were too stuffed to consider dessert! And anyway, if you're still hungry, they let you know that you can order more as you go along.As other people have mentioned, the interior is quite tight, which makes it quite cosy, but also made me glad it was just my husband and me in the party. The music and chatter can get loud, as other reviewers have also said, and we were resorting to raised voices/shouting by the end of it after some wine. But you are still sitting quite close to each other so it's not so bad.I would definitely come back. It's not perfect, but we still enjoyed the meal and are curious for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yclQAOoXgrozfwP7Y5NkQ"
  },
  "6TVhNYvx-8lRVjS_RILx-w": {
    "date": "12/4/2014",
    "text": "Sat at the bar and told the bartender to make me a tasting menu with drinks.  The establishment delivered.  I got the roasted corn as a snack, immediately followed up by the Don Ceviche.  The ceviche was fresh, plump, sour and delicious.  It was followed by the pork chifa tequenos, which are essentially a generous helping of fried pork dumplings with a chili sauce.  The main course was the Limo Saltado, which had tender cubes of beef marinating in a simple salty reduction with onions and chips.The desert was outstanding.  Usually I avoid deserts like the plague, but I dove into the Rocoto Panna Cotta.  There is a hint of chili in the cotta  and the desert is deliciously subtle.Definitely returning.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bgqSB8u4f206HAYJgndHEw"
  },
  "oWsM-D8OtNWwZTiJXdP_Cg": {
    "date": "1/29/2014",
    "text": "We were debating on where to take our clients, who incidentally are pretty cool and fun so decided on Ceviche based on the recommendation of our PA.  The place is a tiny, trendy restaurant but we were able to secure a table for eight, which was amazing.  We started off with pisco sours all around, and let me tell you, this was one of the best ones i've had in a LONG time.  We then ordered some ceviche, which were fresh, light and super tasty.We also ordered the quinoa salad, peruvian corn cake, and arroz con pollo.  It was all super delicious and I was very happy with all my food (especialy since I was on my second pisco).I didnt have dessert, so cant comment on that but i removed one star because the staff seemed a little inattentive at times. All in all, a great find and cant wait to go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "SakWnCTfbAGRxxRvIemQyQ": {
    "date": "6/27/2014",
    "text": "Ceviche is a lovely and lively restaurant near by Soho square. Our party of 4 sat at the bar since there were no other tables, which was just as good. Service was great, food excellent and great pisco sours. I'd recommend starting with a pisco sour and taking your time to choose among the many tasty dishes. Everything is delicious and the flavours really are authentic.Atmosphere is really important to me and I loved the vibrant feeling in here. Great place to kick off the weekend on a Friday night to continues later on to one of the many pubs in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LDx41zwBaiPFrDhjws0Usw"
  },
  "afYrmOIBzrcGfjDa6q7AQA": {
    "date": "3/13/2014",
    "text": "To date, this is my second favourite restaurant in London, (just behind the mighty Hawksmoor).  The food in Ceviche consists of great ingredients, perfectly cooked, and well-presented.  The place has a warm casual feel to it, and the service is friendly and attentive.We ordered the salmon tartare with avocado on a base of sweet potato mash, a spinach, queso & pear salad, grilled cubes of beef, octopus & chorizo skewers and sea bass ceviche.As well as the name of the restaurant, ceviche is a traditional Peruvian dish.  It's essentially raw fish in a dressing with freshly squeezed lemon or lime with a couple of other ingredients including a little chilli.  I'm not a huge seafood fan, but this was delicious.  Very light and fresh, possibly better than sushi.I'm currently on a mission to eat round the world in London, and one of the criteria is that I must be well fed for £15 or less.  You can't really do that at Ceviche.  It's a tapas style set-up, but you need to spend about £25 a head to be well fed.  But well worth it.The drinks are good too.  The Pisco sours is especially well known, and most enjoyable.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "28PphqJdrLZZnFIl-li2JA"
  },
  "GxFy2IuUN4nMTjgHZdPlvA": {
    "date": "3/21/2012",
    "text": "I love ceviche. No, I've never been to Peru, hiked down the Andes to the shore, speared (captured?) fish with my bare hands, plucked citrus fruit from a nearby tree, and made my own from a hollowed-out coconut shell... but I do come from a very knowledgeable seafood-y background, and I certainly know what I am talking about. I, like other early yelpers, was anticipating this restaurant's opening. They have had a significantly visible social media presence, and that, these days, means that they are at least on top of their marketing game. Of course, that says nothing about the food, but it is still a good sign, I think.At any rate, the hype worked, because it was packed. And overall, we had a good dining experience there, though it certainly cost more than a teacher like me would usually spend for a weeknight dinner. The ceviches we had were, for the most part, well thought out and very fresh tasting. I especially liked the Sakura Maru (a common Asian fusion-y twist), even though I'd not a huge salmon fan. The two complaints I have are, I think, things that should be ironed out with maturity. 1) the water glasses were too small. Think of all the time your servers must waste pouring water when they could be doing other things, especially at dinner rush (plus, our water forgot my drink... forgivable, of course, but would not please some patrons). 2) The inside of the duck was cold. Like, refrigerator cold. Like, 'we cooked this a while ago, then just crisp the skin and heat it up to order cold'. Fine, I've been in in the restaurant biz my whole life and know these tricks are both common and necessary. But you don't want people to know this. The rice under the duck, however, was both filling and delicious. I'd recommend this one if you need a little more food in the belly for your £. If you've never had ceviche, but love sushi (like most of London does), then you MUST come here and expand your culinary horizons.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "b22YhS9zSbEns4D0K9WP3Q",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Overexposed, but it's dark in here!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b22YhS9zSbEns4D0K9WP3Q/o.jpg"
      }
    ],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "0os0X7-rXBPkQWg2EroGzQ": {
    "date": "12/16/2016",
    "text": "Their scallop ceviche is the perfect balance of sour, tangy and spicy. Its a bit pricey, but sooo worth it. Their raw seabass is always amazing, but their deep fried sea bass in a bun is surprisingly good! We sat at the bar and still got amazing service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CdduMeFFQ5DYzcxvO98rQw"
  },
  "rLC90HMt2UeSIiyb96hSzw": {
    "date": "9/22/2015",
    "text": "I've never been to Peru, so I have to just trust the restaurant to at least get close to authentic Peruvian dishes. This place is great to go to with a group of friends, the more the merrier but make sure to always book a table in advance as the buss on this place still hasn't died down and is always pretty busy.   Everything I've eaten here has been delicious and made with lovely fresh ingredients, the portions are fair for the price and the cocktails are delicious. Go with an empty stomach, because there's a lot to chose from and you'll probably end up ordering the whole menu to share.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUjCjl-h44JjtMZfdO7LWg"
  },
  "NWoXSzfrfZMEb7PKkeCvOQ": {
    "date": "10/15/2018",
    "text": "Ceviche for Vegetarians? I was just as skeptical as you all, but the menu promised many liberal takes for the vegetarians on what is predominantly a fish based cuisine, so I had to try. Plus, it's in Soho - one of the most enchanting neighborhoods in London, so it is always worth the trip (provided you have reservations, otherwise plan to stand out in the cold for hours on end as your limbs suffer from frostbite). Once you have made it to a table in this tiny restaurant that is jam packed, reward yourself with the best pisco sour in London. Then, if you are vegetarian, like myself, proceed to order every vegetarian dish from the menu- its tapas size, so it will not go to waste (plus they are usually so tasty that your non-vegetarians, will want a taste to see how vegetarian \"ceviche\" could ever be considered amazing - and just like you, they will be a believer, too).  Only reason it is a 4 star instead of 5 star, the last time I went, I didn't like the seasonal menu as much as the previous times I have been...otherwise it is a rock solid place in the heart of London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGFdYYpF6a_PViv7aclt-A"
  },
  "zp3Nhcjk0UABJOvxe9iNTg": {
    "date": "5/27/2018",
    "text": "This place is definitely cozy, meaning that it's a little bit loud, crowded and the seats aren't all that comfortable. We ordered a couple of the ceviche dishes, which both had incredibly different flavors. We also ordered yuca fries, the aubergine steak, and the corn cake. The yuca fries were a bit chewier than I've had before, I usually prefer a crispy and thin outside with a very soft inside. The corn cake is about a cross between polenta and cornbread. I'd recommend booking a table in advance. We were here on a Thursday and were lucky enough to score a table at prime dinner time, with the caveat of having to be out within an hour and a half (we kept to our end of the deal). Service was decent but this place is rather pricy for the portions of food that you get. I enjoyed my time here but would probably opt for trying other places out before I come back to this one.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2Mg99PhKztYgYufaewbng"
  },
  "hUXQbGkPCsjMnRRQtyhpvw": {
    "date": "12/4/2017",
    "text": "Short Review: Considered one of the Top 10 restaurants in London. Highly recommend if you like Peruvian food. Friendly staff. Good drinks - all cocktails Pisco-based. They have no other liquors. Long Review:I was craving fish, so it was either sushi or ceviche. Can you guess which one I picked? And boy did I pick right! Considered a Top 10 restaurant in London, I decided to check it out. I was able to get a seat at the bar without a reservation.  The bartender was gracious enough to explain the cuisine, and help me make the best choice of my cocktail. They only serve Pisco drinks, so don't think you're going to come here and get your usual brown liquor or fruity fru fru drink. The menu was pretty self-explanatory so I decided to go with a ceviche appetizer and and the beef fillet. Both were excellent choices, and though a little on the filling side for one person(all plates are made to share), I ate it all anyway... It was all that good! Highly recommend you give it a try. Though I didn't have more, all the people eating around me had really good-smelling apps and tapas. The staff is pretty friendly too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y7CLmouRfbw37SUYQYpp_g",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. All done!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y7CLmouRfbw37SUYQYpp_g/o.jpg"
      },
      {
        "img_id": "44dSM6d36IMckZJlddjPoA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Beef Fillet Rio Negro",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/44dSM6d36IMckZJlddjPoA/o.jpg"
      }
    ],
    "user_id": "yEHW8Hwy4MaKQ1Do0uzn2g"
  },
  "e1F0tLT66jsiaWs1vtMWAw": {
    "date": "10/22/2016",
    "text": "We chose this place based on good online feedback. We were looking for a nice place on this weekend that also allows dogs.This one has a few outside tables, which worked fine for our doggy and us. Can't make reservations for these tables though, just walk in and wait. We had to wait about 20-30mins. But it was surely worth it.The food is peruvian, but more a modern version of it. There are lots of interesting items on the menu, all pretty fair priced for this location in Central London / Soho.Service was friendly and also quite fast. We ordered some Croquettes, Fried Yucca, Pork Wonton, Quinoa and Seabass Ceviche (and some more croquettes). Beer, Pisco Sour and White Wine for drinks.Food was really really good. Lots of new and interesting (in a good way) flavours for us. The Ceviche is of course raw fish, marinated only in lemon juice....but very good and tender! Other items were very nice too, the croquetas probably the best of them. Only the Pork Wontons were a bit basic, lacking some oomph. But besides that it was a great evening with wonderful food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xJddoDMJ8Ykc5GfA3RL4mA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Pork Wonton",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xJddoDMJ8Ykc5GfA3RL4mA/o.jpg"
      },
      {
        "img_id": "BlhcTjFnOnqLUXxeCwShaQ",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Quinoa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BlhcTjFnOnqLUXxeCwShaQ/o.jpg"
      },
      {
        "img_id": "OjLckapkmFYX7JxxLfMF8g",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Ceviche",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OjLckapkmFYX7JxxLfMF8g/o.jpg"
      }
    ],
    "user_id": "6JFeuGA54G2ELNSKTZmzoQ"
  },
  "lty6F-ut8bXL1VmZWMVtSQ": {
    "date": "3/10/2017",
    "text": "My first modern Peruvian experience and I am in love! (apart from the price but YOLO right?). Peruvian cuisine are usually colourful, creatively presented in small tapas plates. They are perfect for sharing.We have ordered 2 ceviche (salmon and sea bass). They were fresh, delicate, well presented and well seasoned. The portion could be bigger, but I was happy with what we got. The salmon chifa, pulpazo and lomo saltado are must try items. They were wonderfully cooked (!), flavours were well balanced, amazing in texture and fresh. Even the side, parsnip glazeado, had me hooked! The dessert (chocobanana) was good (7/10). Intrigued to try the melodo de higos next time.Although there is a price to pay for all these yumminess, I will definitely return to explore other dishes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8bae62jlpL5zlyv4HXyl8g",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8bae62jlpL5zlyv4HXyl8g/o.jpg"
      },
      {
        "img_id": "OG8qXRvQf56ltASo-mMztw",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OG8qXRvQf56ltASo-mMztw/o.jpg"
      },
      {
        "img_id": "b1GG7Z67eyDm3JDmtxLevA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b1GG7Z67eyDm3JDmtxLevA/o.jpg"
      }
    ],
    "user_id": "GdFWtowYnCuUFMBgfSTK2w"
  },
  "UO1n-nFmk2BVpFNoyQ2m1g": {
    "date": "3/22/2016",
    "text": "I love Ceviche (both the food and the place).It was nice to eat something light and fresh during my food marathon (I'm trying all the mac&cheese in town, my stomach needed some fresh fish).Here you chose around 3 tapas each to share: skewers, ceviche (of course, that's the name of the place), buns, vegetables and cheesy puffs balls (a must have).We were sitting at the bar and it was really cool to see the chefs cook in front of you. Cocktails are worth a try as well, especially the virgin one. Writing this review actually makes me want to go back now.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rk27sv737RFJUItCmvHTNA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom. Bum with fried red mullet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rk27sv737RFJUItCmvHTNA/o.jpg"
      },
      {
        "img_id": "Nn_UT9T6AvXwXc_ctFJ7OA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Nn_UT9T6AvXwXc_ctFJ7OA/o.jpg"
      },
      {
        "img_id": "G9IzVke534OFGBVaRc4Isw",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G9IzVke534OFGBVaRc4Isw/o.jpg"
      }
    ],
    "user_id": "4Ggaq_5gjSj7FYMBmXKx0g"
  },
  "eA1ZBnPlyAGrvb-6Qni0MA": {
    "date": "12/1/2017",
    "text": "Execellemt cozy restaurant in soho ,warm ambience,friendly staff and prettyGood food ,well priced,all in all a great experience ,would recommend and would return",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7r9M2iSAgrTQglcSfsyzhw"
  },
  "-Nt2Iljgj3BKok_FIZTeRQ": {
    "date": "1/7/2016",
    "text": "Grilled octopus and chorizo? Pork ribs in tangy sauce and pineapple salsa? Chicken smothered in the most delicious spiced sauce? Are you drooling yet? My friend had been wanting to try Ceviche  Soho for awhile and me visiting London finally gave her a reason to go. I was more than happy to tag along. We arrived around 3, and my friend was surprised there was no line. The interior looked rather small, but everything was very cute. We sat at the bar counter and gorged ourselves on amazing Peruvian fusion food. We began with fried cheese balls and an ahi tar tar like sushi thing that had sweet potato purée instead of rice. Then we had chicken, pork ribs and octopus/chorizo kebabs. We finished with the fig and cream dessert and the chocolate mousse dessert. We left full and happy. The service was great; the bartender/server was friendly and later showed us every dish he would recommend in the future. We now have to go back to try all he other things that he recommended!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "eiP5FFKAl8gT4y39Z9s7_Q",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eiP5FFKAl8gT4y39Z9s7_Q/o.jpg"
      },
      {
        "img_id": "lMxqxpFlq0WXXTq9WyPxrA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lMxqxpFlq0WXXTq9WyPxrA/o.jpg"
      },
      {
        "img_id": "Sd9Y-IyYtnoLy_O9VObg1Q",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sd9Y-IyYtnoLy_O9VObg1Q/o.jpg"
      }
    ],
    "user_id": "Dfu-NuG1YWB96jjBLIlsrA"
  },
  "n4sleqGG7M71w8eytyLtWA": {
    "date": "11/5/2017",
    "text": "This was a very tasty experience.  I can't claim to be well versed in Peruvian food because I inevitably end up ordering the same thing no matter where I go and that's Lomo Saltado (or Saltado de pollo for those places that offer it). Ceviche was no different but I also had Chifa wings, which were also just the right level of spicy. The Lomo saltado was excellent and I devoured every bit of it. The only thing I don't like about this place is the tapas-sized portions. I have a thing against tapas-style restaurants. I find the idea of shared plates to be a rip-off and ultimately annoying for those of us with food allergies or specific tastes. Had I known it was tapas style I would've passed on it. Good thing I didn't know. But if that's your thing (or even if you can put up with it), this place is a home run.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Drt3zHhD0umoYASDbilXHw"
  },
  "2SVIIuBXWwaL35oSbVukMQ": {
    "date": "3/3/2016",
    "text": "Deep fried porky wontons (which sound so authentically Peruvian) were yummy! That and the beef hearts were the highlights.  Corn cakes were sweet and tasty; steamed buns were good although the flavours could have stood out more. The other dishes we ordered were also good but definitely not standouts in comparison.  Their signature ceviche was slightly dull and didn't have the bright vibrancy I was hoping for. Their veggie ceviche was just bizarre.  Lots of crispy, colourful veg but I'm not sure what made is a ceviche. Ceviche also did the annoying thing that seems to be all the rage these days: dimming the lights so low that people have to get out their phones to read the menu. Ambient lighting is one thing but don't make it too dim!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "CcTvCeKY1Bc3XnYhZtQZ2w": {
    "date": "5/3/2016",
    "text": "3.5 star, but I'm not a local. Very cozy nook with good drinks & small plates. I sat outside watching the crowd but the place got packed quick. I ordered the typical ceviche, pisco sour & anticuchos. The service was friendly",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nh8xHcqaPv02byODGhAW4Q"
  },
  "bki3TtpT3WzLy9hbeKrzeQ": {
    "date": "6/1/2015",
    "text": "Unexpected good find. Almost didn't want to give it such a high review as koya and barrafina are super packed due to good reviews. This place is equally as good but much emptier. We loved the Don ceviche, razor clams and tuna. But the beef heart and octopus are superb as well. (The beef filet was probably the weakest dish but maybe because we are full). As for drinks, we loved the passion de ceviche. Will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sGnzGgIb1Of7vkHWf8jdMQ"
  },
  "4sE9ZZjyjfvOBKFGqqfQLQ": {
    "date": "4/13/2016",
    "text": "My favourite restaurant in London. So many flavours. Great fun to share as a group. Some say it's over priced, maybe...but I've been to standard prices places and not had as much fun as I've had here. I even bought the vinyl they sell.Pisco sours are the new Caipirinha.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MjE-1lwwmtO3g0sOoug_ZQ"
  },
  "EZFZljGV_AdI3LCMzglYvQ": {
    "date": "12/4/2013",
    "text": "amazing pisco sour as recommended by everyone. Right, and the rest of the drink menu, is pretty amazing as well (Pasion de Ceviche, and Sarita for dessert)the seafood seems pretty fresh to me, nibbles are fun, would def recommend their sea bass with wasabi sauce, grilled marinated salmon should also not be missed. The Amazon Fish Patarascea is slightly weird to my distaste... Steamed in banana leaf, yes, does taste quite good, but thought the match with the plantain was a bit off.. PS GET THE KING SCALLOPS! and BOOK A TABLE",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9TMi7JhRN47qbg21wuF38w",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9TMi7JhRN47qbg21wuF38w/o.jpg"
      }
    ],
    "user_id": "wUglOGOHWulhp8Wo9bb7Sw"
  },
  "FL_OXeumOYTsU3qb7TwiaA": {
    "date": "2/22/2017",
    "text": "Fantastic food. Fantastic Pisco Sour. I had never really had ceviche/Peruvian food before and I can't imagine a better introduction to it. The only reason I knock a star off is for the price point. It's true that you need to pay for good food, but for the price I'd hope for slightly bigger portions. It's always annoying to drop £90 on 2 people and still feel the need to go to McDonald's afterwards just to fill your stomach",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4S07gT19FtZF6Z0Fqye_4g"
  },
  "BJfp6hWx6LTHyOshWkqtUw": {
    "date": "2/23/2017",
    "text": "Walked past and decided to give this place a shot. So glad we did! The scallop and avocado ceviche were excellent and so well balanced. The rotisserie chicken with Peruvian salsa was another hit as was the duck breast! Portions were slightly small but I suspect it is meant to be more of a tapas place. Great atmosphere and polite staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9D_piZ1bbxziYw_18VWtDw"
  },
  "_LlqJEES5QG9SMc8_1BU0w": {
    "date": "4/6/2015",
    "text": "Overall a good experience. The place felt really authentic - although the service was a little slow it made more that up for it in the quality and taste of the food. Had the Don Ceviche, Pork Trequeños and Squid/Chorizo skewers - delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4zFHNtNi5mUBzqTaothldA",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4zFHNtNi5mUBzqTaothldA/o.jpg"
      },
      {
        "img_id": "8z2XyEp-hkK8UyM67bokuQ",
        "caption": "Photo of Ceviche Soho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8z2XyEp-hkK8UyM67bokuQ/o.jpg"
      }
    ],
    "user_id": "ZJo2Zv2QPfBN0U_R1sCdSw"
  },
  "VM019groAqCkDmCaZs8fww": {
    "date": "11/3/2016",
    "text": "I really liked this place. the atmosphere is very friendly and still manages to be cool. Most of the plates that I had were excellent and they make an incredible Pisco Sour.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "faXCDT-AxFCSHpMOYgkYLg"
  },
  "-2sNjja1wy5ovFVi3UFABw": {
    "date": "4/8/2015",
    "text": "Yea, it's that good.  Wifey and I split 7 items, not a dud in the bunch.  Only downside - noisy, like wanted some earplugs noisy....",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fDfVp5kbYBEGcZJn8MMZBw"
  },
  "mEjvijPK1YMpz7wb0eMoLg": {
    "date": "1/23/2016",
    "text": "I have been to the restaurant twice. Both time had excellent experience. The restaurant was small but very well decorated. Good choice if music too.Dish potion is smalk. It's more like a tapas type of dish. We had don ceviche, pork ribs and steak beef. All of them are very well seasoned!Good place to hang out with friends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9QUCAjVTGnuG-4g78jk3g"
  }
}