{
  "_Ld5hESNvNtzXP7jKozOzg": {
    "date": "10/24/2011",
    "text": "The food here is excellent. As a huge fan of a good steak, but also a fan of tofu, I feel highly qualified to review this restaurant. While you wait by the bar, they have a selection of interesting juices to choose from. And I learned a new fact - you can't drink straight beet juice because it won't agree with your insides. Who knew? Glad they had the facts.I really enjoyed my sweet potato and cashew curry. Yum, yum. Very filling and comfort-food-esque. I also enjoyed their big chocolately dessert. Gluten-free notes: This place goes out of their way to help non-vegetarian people with food restrictions. They identify wheat-free and gluten-free items on the menu, and there's plenty for you to choose from.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "zI3LcEKd1bnN1qwxrj21_Q": {
    "date": "5/28/2010",
    "text": "I've had some varying experiences here. I've been eating vegetarian food for decades, and been veggie myself for over 10 years, now, so Mildred's really ought to do it for me. Maybe I have been unlucky, but what I've ordered has never quite lived up to expectations: perfectly edible, but nothing more exciting than I could have made myself at home. (And I don't regard myself as an exceptional cook). But the main downer - as others have mentioned - is the service. It has varied from quite good to the downright awful. There is simply no excuse for waitresses being uppity with customers. It feels like they are so successful, they don't have to try too hard, which is a real pity.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_pYTNf90AKN0MoxPFXc4Q"
  },
  "-x9cvLUiOWBSWJEjgHYK6Q": {
    "date": "11/9/2012",
    "text": "After eating out at a few vegetarian, vegan, and raw places when I was in New York, I developed an appreciation for good, vegetarian food. Which is exactly what Mildred's does.Tasty, inventive vegetarian dishes at what for London is a very reasonable price point - you can get out of there for less than £15 if you skip the drinks and dessert.Only downside is that everyone else in London knows how good it is, too. When I went (at 6:30pm on a Thursday night) there was a 40 minute wait for a table.Highly recommended nonetheless.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFOL7SzuPBcpyWFDKSKS_Q"
  },
  "YRjXuhlshBzp-G6wHitn_Q": {
    "date": "1/23/2016",
    "text": "I was expecting a lot walking into Mildreds. I ended up ordering a burger, guacamole and the sweet potato fries. The beetroot burger was exceptional, especially the sauce, the guacamole had too much onion and was not freshly made, quite cold and obviously refrigerated, not the Mexican way. Its not difficult to mash some avocados to order and the dish ends up so much better. The sweet potato fries were also mildly warm and not crispy, again indicating that they had been sitting around for a while. I'll give Mildreds another go, but the first visit was not impressive compared to many vegan restaurants I have become acquainted with.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XhGOUv9W0oUZ2VD_6mDIsQ"
  },
  "cBw4BrMBcTHi0nMdiY4Fog": {
    "date": "8/12/2014",
    "text": "Went here with a friend for dinner. We both had the organic detox salad, one with tofu and one with goat cheese. We were both really impressed and the salad was so fresh. Yummy vinaigrette. The place was really loud and the service wasn't the quickest, but I'd definitely go again. Great vegetarian, vegan and gluten free options.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7m_3lE09TbEIX936h1GNg"
  },
  "VdAT57-RkPR_hL1R4WFt0Q": {
    "date": "10/27/2011",
    "text": "Yummmmmm :)Highly rated from a non-vege. On a Saturday evening around 7 we came and was luckily seated within 30-40 minutes. The place was very very popular.The food was delicious. Lots of varieties from sweet potato and cashew nut curry to aubergine chickpeas tagine with couscous and harissa sauce, to an awesome towering burger and stir fry asian vegetables. Sweet potato chips? Mmm :) Definitely an interesting menu .. short and sweet.Desserts did not disappoint as well. We settled on tofu cheesecake (vegan) and pistachio and white chocolate cheesecake. Recommend the tofu cheesecake.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h0WtY-wfWtFiuOl1go_xFA"
  },
  "5mbWpzTqZRgYTgakIlyLOg": {
    "date": "8/7/2014",
    "text": "Casual vegetarian dining. Crowded and quirky structure (up and down stairs). Food excellent - great veggieburgers, and good selection of other things.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kUdYyppM03agX9EBB-nAzg"
  },
  "1HtEaBMSqj2pisbn9GK5vA": {
    "date": "1/3/2016",
    "text": "Stopped by for a late lunch - had the dumplings, samosas, and burger - all three were reasonably priced and just fantastic tasting!  What a bright spot for a vegan in London!  Will return for sure.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OhtB9bn5hEPJJhdDJyW7UQ"
  },
  "KvzUL2PSbiWcaUIXgOX0Cw": {
    "date": "12/31/2015",
    "text": "Awesome restaurant!  Was in town with the family and went there on New Year's eve.   Tastey vegetarian comfort food.  Mostly vegan with a touch of dairy.  We enjoyed it.  The Poland beet-veggie burger was awesome - crispy with fresh ingredients. Samosas were yummy as well. Recommend the pudding for dessert.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0Al7NnHcooGL6M74dzzbA"
  },
  "ps_qMqYdtk1CbIKBwezFxA": {
    "date": "12/4/2009",
    "text": "Tasty. I read about this place on Yelp and added it to my bookmarks, and then i heard Jason Schwartzman saying in an interview that he loves Mildreds and has to stop by whenever he's in London to have their sweet potato wedges! So i made it my mission!I liked it. I really did.Ordered some of the sweet potato wedges as a side (amazing), and for main got \"sunblushed tomato and buffalo mozzarella risotto cake served with wilted spinach, green beans and grape mustard cream sauce\". Delicious!It seems like it is always manic in there. We got there at 6pm and it was nearly full. I thought the twelve and a half percent service was cheeky, but i what can you do?Thanks Mildred!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ao9k-PyWGvjUO1dN59mlMQ",
        "caption": "Photo of Mildreds - London, United Kingdom. sunblushed tomato and buffalo mozzarella risotto cake & sweet potato wedges.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ao9k-PyWGvjUO1dN59mlMQ/o.jpg"
      }
    ],
    "user_id": "obKR9ZN1DQcJjiuje7zVfg"
  },
  "9O-F8DV4S-wDmWHK1gf3Cw": {
    "date": "11/13/2014",
    "text": "Such a fabulous restaurant. Always heaving which is indicative of how well thought of it is. Some of the best vegetarian cuisine I've ever had the pleasure to enjoy. Prices are a little on the steep side hence the lack of 5 star rating. I'll certainly be returning but at an off peak time!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLkHVykmYbnHz-TF9O0mkA"
  },
  "ud9cvTGZaWmz9VbyP7U38g": {
    "date": "8/21/2014",
    "text": "Nice food, vegi and some vegan + gluten free, slow and unattendive service makes this vegi jewel just \"ok\"",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_J0slvknFhYc4kudh-4vg"
  },
  "1EDanUHqvLOTzuJwDTU0zQ": {
    "date": "7/31/2013",
    "text": "This was such a fun treat! I didn't know where to grab a quick bite to eat but my friend had just the spot for us. Vegetarian was the theme but you wouldn't have known there wasn't any meat on the menu with how great the menu was! We sat outside and I actually didn't make it inside at all. Outside was cute and the service was excellent. I ordered the detox salad and beet juice :) Happy happy. I heard they do great dinners, and I will be sure to stop by here again when I'm back in town!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5R9HVs4N3TOoXPZD6IzUA"
  },
  "c784eVyzk7lZLmffaHNgzw": {
    "date": "8/13/2013",
    "text": "The food here was lovely. The service left a lot to be desired.We tried quite a few dishes and each one was a delight. The space is quite small and the place smelled of the cigarettes from outside ( not the restaurants fault, but still very annoying).If you want a vegetarian meal then Mildreds is a good bet.They also have gluten free and vegan options.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZPrEHeYY-Q1rMQ6LxmlzEQ"
  },
  "9FyqGr1hqmPUrBuiIPul1w": {
    "date": "5/25/2011",
    "text": "When you've had a long morning of shopping with the crowds on Oxford street, your feet are aching, your shopping bags are weighing you down and your purse is feeling considerably lighter, there's nothing like a pick-me-up Mildred's lunch to get you back on track!My sister first introduced me to this place as she used to go there with her work friends and it has literally revolutionised my shopping life.  I now look forward to lunch more than my purchases!  This great vegetarian place always has friendly staff and amazing food, although they don't always have a table so it is best to go for lunch either early or late to avoid disappointment.  The sweet potato and cashew nut curry is to die for, especially when washed down with their delicious wild elderflower bubbly! It often leaves me too full for a proper dinner so definitely worth the pennies!  All in all, Mildred's is definitely worth a visit - even if you're a meat lover, the food is substantial enough to fulfill any appetite!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "tKHGbkrhIqSmbYS-ExGL5Q"
  },
  "xj75kiVjSK7jqiB4yEm67Q": {
    "date": "3/31/2009",
    "text": "Having a wheat intolerance, this restaurant is a safe heaven for myself, offering more than a handful of (vegetarian) dishes which are wheat free, gluten free or in some cases both - that also includes starters and dessert !It is one of my favourite haunts when I am in London so I do try and go every time I'm there and it is pretty much guaranteed that the place is busy no matter what time of the day. So seeing as they don't take reservations, be prepared to wait for a while - though it is definitely worth it.The quality of food is good. While not excellent, the general price of the menu balances it out bumping my rating from 3 stars to 4 stars.My favourite dish is the creamy sweet potato and plum tomato curry with pea basmati and lime pickle, but be wary of the lime pickle as it can be very sour to those unsuspecting taste buds. The dessert menu is equally as good as the main, which makes it good for those sweet toothed out there. My personal recommendation is the vanilla rice pudding with golden plum compote and honeycomb - even if it is just for the melt in your mouth honeycomb pieces.The service on the whole is satisfactory, probably due to how constantly busy they are. However, my only gripe is that they add on the 12.5% service charge to your bill. I'm no Scrooge, but I do like to be my own judge of how much tip I give on any given day. So for that reason, Mildreds is 1 star shy of the full 5.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GJigKcsvx-4Km2MhpMZdvw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GJigKcsvx-4Km2MhpMZdvw/o.jpg"
      },
      {
        "img_id": "9e4A7IHVhTPRdYT2PTjNKA",
        "caption": "Photo of Mildreds - London, United Kingdom. Creamy sweet potato and plum tomato curry with pea basmati and lime pickle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9e4A7IHVhTPRdYT2PTjNKA/o.jpg"
      },
      {
        "img_id": "NlWmVXbfYyjdFkoT57TnOA",
        "caption": "Photo of Mildreds - London, United Kingdom. Vanilla rice pudding with golden plum compote and honeycomb.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NlWmVXbfYyjdFkoT57TnOA/o.jpg"
      }
    ],
    "user_id": "sk55U9XQF811y8xLGtQijQ"
  },
  "3m9HInRC46P5X3-diBcGPg": {
    "date": "8/11/2011",
    "text": "I've been coming to Mildred's for years, although I'm not a fully fledged veggie, I do enjoy dining out at vegetarian restaurants (I just can't give up drunken late night burgers and bacon hangover sandwiches).Mildred's is always packed, it's small and has a buzzy Soho vibe - you can't make reservations, so if I'm coming for dinner at the weekend, I'll get here early.  They also have a couple of  tables outside, which is nice for lunch in the summer - a great spot for people watching.They have daily specials, and the menu always has the option of salads, a curry dish, pasta dish, burrito, tagine, and my fave, a veggie burger (they have different types that change daily), always to be accompanied by a side of sweet potato fries - stodgy and delicious.If you're looking for a place to have a birthday dinner, ask about the private dining room that they have upstairs - I've used it before for a birthday, it's free to hire and you can bring an ipod and play your own music.I've dined at Mildred's with many non vegetarians, and everyone always agrees that the food is great and good value for money.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nRs6BZgjoyURYbP4NPYu7w"
  },
  "8sn7tWycWIJfvyk-hC1ouw": {
    "date": "11/10/2015",
    "text": "Absolutely loved the flavours in the food and versatility of the menu. Been here twice and enjoyed he food however the table service was a bit poor. On both occasions the waiters forgot a main meals and side plates. Once was ok but the second time was just a bit average.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0GFQ7wawIKDNzqLIBEdyOw"
  },
  "jAxcfnibPq2eNof50m-FaA": {
    "date": "8/2/2014",
    "text": "If you are in London you have to go to Mildred's. The food is incredible and the waiters are hot. It's a must for any vegan/vegetarian.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eG6mA88_FW7dkwefkJrjig"
  },
  "rvIwaUPzkTIk6TZs7HSc7A": {
    "date": "3/10/2013",
    "text": "The food is great, very tasty. The service was very bad. They ordered different plates and forgot drinks and ignored us many times. Later I heard that is quite common for places in London to have bad service... Order the icecream for dessert!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QDoFhX8thfR2A6PFwUMn6A"
  },
  "1fbS_dwwZIEyR8sI_h_0XQ": {
    "date": "3/12/2016",
    "text": "Absolutely Wonderful! Great service! Incredible food!! Vegan Ice Cream! Better than and I have had!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MDeaYK2_9l-p1Yy2F0Ge1Q",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MDeaYK2_9l-p1Yy2F0Ge1Q/o.jpg"
      }
    ],
    "user_id": "S1BCJ7EiaLUtPzgdx3LTEQ"
  },
  "ayzoFk9G8HpeqbqjzRCTcg": {
    "date": "2/18/2016",
    "text": "This place makes choosy vegetarians happy. Yes, that's it.It's small, so be ready to wait or just go as soon as it opens on weekdays.You are welcome.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "swj8SUy37m8GHUhLVRiegA"
  },
  "VDpmIWvf0DPlbqjGYNH86g": {
    "date": "11/26/2015",
    "text": "Great ambiance - fun people - great food.We had 2 large dishes - the Sri Lankan dish was amazingThey have organic juice too and that tasted good.Great pice.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4Um08nfuUhsuKftXyqftg"
  },
  "05rSwRlsfc6JCCUxdyyk2A": {
    "date": "1/3/2015",
    "text": "Let's be honest: the thought of a vegetarian restaurant didn't get the taste buds tingling....but boy was I wrong! Unlike many places, they don't try and make things like their may based counterparts. The food is wholesome and good. Not too much on the menu. They also have lots of vegan and gluten free options. A definite place I'll be revisiting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XKx1GKD_8Wf81kD4SsDoOQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Gluten free chocolate and Peanut Butter brownie with vanilla ice cream.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XKx1GKD_8Wf81kD4SsDoOQ/o.jpg"
      }
    ],
    "user_id": "YV-EnVxd8KPYYW_DwKD7GQ"
  },
  "qgPptlHA_pHhPk6qEIEjZQ": {
    "date": "8/10/2017",
    "text": "Although it was very crowded, the food was worth the wait! The salads are spectacular with different flavors and textures. If I lived in London, I would go here all the time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zko8Ww924vu-e4Q9oSCdRQ"
  },
  "KE94QtPB1AiJGyCR1Mm1CA": {
    "date": "3/6/2014",
    "text": "Are you Veggie-head? Vegan? Annoyingly gluten free? Well then, we have a place for YOU and all your friends to enjoy a meal out without it getting weird or awkward with a barrage of questions like \"is this organic?\" or \"Is there palm oil in this?\" I had the sri lankan curry and it was MASSIIIIIIIVE. Just huge and awesome. It was a ton of carbs, rice, and lots of sweet potato, which ended up in feeling like a belly bomber, but over all the food coming out of the kitchen looked great and there were a ton of different types of food. Ranging from salads, to some meats, to mexican to pretty much anything under the sun.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "BScHlfxGYI6acBU7n5u7BQ": {
    "date": "4/15/2014",
    "text": "Heaven is a bowl of sweet potato fries from Mildred's. With the basil mayo. Just the right amount of crispy edge and squishy centre. Now if you don't read any further at least I've told you that ;)This is a v popular veggie place in Soho with the omnivore seal of approval. Whatever your x-free diet you'll still have decent choice, and they're v happy to tweak things (ask for the vegan version of the aforementioned mayo if needed!).Last week we skipped starters - personally looked a little pricey to me (over £6 for 4 gyozas?). Mains are around the £10 mark and nicely varied; we had a mix at the table with bean burritos and sausage+mash disappearing rapidly around me. I had the burger of the day (a tasty kidney bean and tofu creation) with the sweet potato marvels, washed down with organic cider. Having not been for a while I'd forgotten that the portions are massive so it felt pretty heavy. May have been my own fault for snacking whilst waiting for the table, woops.Speaking of which, you can't book ahead nor sit down until everyone's arrived, and there's always a ton of people waiting. Leave your name with the guy avec ipad at the door. Personal highlight of the evening was his classic 'brown guys all look the same' mistake, after he took details from one of my mates, went to check availability, then came back and replied to a different guy! *facepalm*We had a good giggle about that during our 45min wait. For the sake of your blood pressure I recommend escaping the sardines can of the bar area and heading for a drink elsewhere (or they have outdoor ping pong in nearby Golden Square atm!). Make sure you head back on time though.We sat downstairs this time and boy it was loud, as each closely-packed table seemed to be trying to outdo its neighbours - unless you fancy reverting to hand signals, be prepared to join in! Our server was v friendly and chatty, and helped my mate choose a dish in a way that felt very genuine, before joking at the end that he should've just pushed the priciest dish - nice that he didn't.Empty plates and (over)full tummies all round at the end (once I'd hoovered up everyone else's remaining sweet potato fries). The only thing we regretfully left was half a mate's elderflower martini which he'd seemed surprised to find was mostly gin... hmm yeah not sure what he was expecting!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "ay4qtKwTLFO0lZIE1IyQeQ": {
    "date": "11/7/2015",
    "text": "I was excited to visit this popular vegetarian/vegan restaurant for a long time. Twice I had tried my luck with getting a table in the evening but then didn't want to wait that long. The third time I went there for a weekday lunch and had to wait for only about ten minutes. Unfortunately I was quite disillusioned the moment I stepped into the narrow dining room. The photographs on the website make the place look much nicer than it is.It's nice to have a menu full of veggie choices but the menu isn't really exciting or special. I ordered a Mushroom Ale Pie with Chips and Mushy Peas - bad idea! The chips and peas are not worth mentioning but the pie was really not enjoyable at all. It had a weird bitter taste.I don't think I'll go again. I'd rather accept a more resticted choice of veggie dishes but at least have a more exciting and tasteful experience.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPutIn3JgUQyVBLOeilXEA"
  },
  "Qxq5isbjNlXovi-Y2Q332g": {
    "date": "8/25/2015",
    "text": "Managed to get a table at this popular spot straight away early on a Thursday evening. We were sat upstairs, which didn't have the buzz and feel of the main downstairs dining area but was nice nonetheless with open sash windows letting Soho in. You can get a drink at the bar while you wait for a table, if you like.We shared an antipasti starter for two between the five of us and all enjoyed the selection on it - great mozzarella, tomatoes, courgette strips and more. For my main I had the wild mushroom pie which came with a good portion of chips and peas. All of us were happy with our meals, veggies and non veggies alike, and between us we only made it through about half the wide ranging menu! I left very happy and very stuffed. Some of the best veggie food I've had in a long time. I'll be back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OFTCxBe_6k7q1smLpqtMw"
  },
  "j5EFAvEL5DJoNPMRVMIFtA": {
    "date": "9/17/2014",
    "text": "When I went here with my sister, we couldn't believe how busy this place was for a vegetarian restaurant! But after our experience here, we realized it's because this restaurant serves delicious food that appeals to vegetarians and meat eaters alike.We split the pan-fried halloumi, with cherry tomato and wilted spinach with balsamic glaze to start. It was extremely flavourful, and the balsamic glaze was the perfect accent.For my entree I had the detox salad, which was a huge portion of grated beets, carrots, sprouts, and seeds. I also added tofu, which disappointingly was not marinated or cooked. My salad itself was good, but I think I would have preferred a smaller portion as a starter rather than my entree. The flavours got pretty boring after a while.My sister's sunblushed tomato, mozzarella and basil risotto cake with wilted spinach, green beans and grape mustard cream sauce was incredible though! The richness of this meal is extremely satisfying and makes you forget it doesn't even have meat in it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zSjwD9n8OU1i4hmCxP0jNA",
        "caption": "Photo of Mildreds - London, United Kingdom. sunblushed tomato, mozzarella and basil risotto cake with wilted spinach, green beans and grape mustard cream sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zSjwD9n8OU1i4hmCxP0jNA/o.jpg"
      },
      {
        "img_id": "Rl2oelx3ch-TW5tWwesIeA",
        "caption": "Photo of Mildreds - London, United Kingdom. organic detox salad with beets, carrots, fennel, sprouting beans, sultanas, coriander and toasted seeds with apple",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Rl2oelx3ch-TW5tWwesIeA/o.jpg"
      },
      {
        "img_id": "FPjuTxnDBJG-m8EoppxLSA",
        "caption": "Photo of Mildreds - London, United Kingdom. panfried halloumi, cherry tomato and wilted spinach with balsamic glaze",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FPjuTxnDBJG-m8EoppxLSA/o.jpg"
      }
    ],
    "user_id": "XDq_Yyg_d8tMZfxL409dVw"
  },
  "P48ZnWCkwHn482C9fY2-dQ": {
    "date": "12/30/2016",
    "text": "This place isn't bad, but I want to balance out the superlatives a little bit. We had to wait for one hour and twenty minutes while we were told to wait for 45. Once we were seated, the interior was cozy but cramped. I had the classic burger with a side of sweet potato fries. The fries were great, but the burger's not all it's cracked up to be. It was okay. I avoid meat whenever I can, but almost every veggie burger pales in comparison to the original. Mildred's burger was nice, but plain, as is often the case. Although I have had some great veggie burgers, Mildred's sadly wasn't among them.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBqXctI6nLJJEvSKdQqjlQ"
  },
  "MTurODju-UCbTiDKs0WiZA": {
    "date": "5/27/2014",
    "text": "I have to admit that I wasn't thrilled to go to a vegetarian restaurant, but one of our friends had requested Mildreds and so we went with it.  To my surprise, Mildreds was really good!Food: We ordered the Mexican platter and panfried halloumi to share for appetisers.  For entrees we ordered the detox salad with goat cheese, the burrito and two jack burgers with fries.  I ordered the burrito which was super delicious and I highly recommend it! Drinks: We ordered four bellinis and two fresh juices.Price: For four people we paid 102.77 GBP. Ambiance: The restaurant is busy on the weekends so be ready to wait.  It's loud and the seating is tight.  Note: The bar doesn't serve anything but bread and olives so you can't order apps while waiting.  The restaurant seems popular with younger people.  There was a large group of young people next to us who were incredibly loud and obnoxious. Even though we were only a group of four it was very hard to hear what we were saying even though we were sitting next to each other.   Service: The service was ok.  The hostess and the server weren't the most friendly.   Would I go back?  Yes, but I would go early to have a pleasant dinner and not have to deal with the noise level because the food is actually very good and is the saving grace of this restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UR6guAvsmsMX27bfFJ_Kzg"
  },
  "fU5FV3z0KgDGfyF-lWD9gQ": {
    "date": "3/11/2015",
    "text": "Words can't describe how delicious this place is! I went here with my sister who was visiting from California and this was by far her favorite place we ate!We started with the soup of the day which was carrot ginger and it was delicious! The waitress was so friendly and nice and the food came quickly. My main was the highlight. I got the ricotta and pumpkin stuffed ravioli with mushroom cream sauce and omg... best pasta dish I have EVER had in my life! SO INCREDIBLE! My sister got the curry which she also throughly enjoyed however after she tried my dish, she ordered one for herself too! Been back a number of times and the service is always great. Definitely my favorite vegetarian place in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e2F6s0EuYZMbKRjFAd5wnQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Pumpkin and ricotta stuffed ravioli with mushroom cream sauce. So good my friend got it as well!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e2F6s0EuYZMbKRjFAd5wnQ/o.jpg"
      }
    ],
    "user_id": "lgVY8_s34nfN9oUOVfUfYw"
  },
  "3R_YgODCt1LoZ_JdJraUOQ": {
    "date": "12/26/2016",
    "text": "Just go here. Best vegitarian restaurant around. Love the food. Love the venue. Dive in, a welcome retreat from the crowds and commercialization of Oxford St, Regent St and well London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJ68ojSCehjK_v44ku81Kg"
  },
  "QbTepBywkrrb0ODsaigXfw": {
    "date": "5/15/2015",
    "text": "The place is packed, even on an early weekday evening.Foodwise, I have to downgrade to 3 stars. We had 4 in our group. Everyone thought the food was just OK but nothing special. Halloumi starter was good but main course of mushroom and leek pie with mash and kale was a bit boring and bland. My dessert of banoffee creme brulee, salted caramel bananas and choc chip shortbread sounded better than what I ate. We sat upstairs, the air became really stuffy and ventilation was severely lacking. The noise of a group of boisterous people in the next room was annoying so at the end of the meal I was relieved to get outside again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "c3Tp_dBECEUPg9xVhSZNHA": {
    "date": "11/19/2013",
    "text": "As the Yelp stars suggest: this place is a-ok.And I feel like a jerkball (technical term) because so many respected Yelp-voices seem to love Mildred's.  So let's agree that I need to give it a second chance, ok?  Maybe I made a fatal mistake by not going for the much-celebrated risotto cake.First off: love the space.  Love that it cozily overflows at lunch time, and yet doesn't super-shoo me through my plates.  Also - as Kat F. keenly observed - it's a 'cool'/'non-weird' (ha) veggie/vegan-friendly place.  I'm a veggie lover, and my lunch buddy is borderline vegan, and we were happy as (soy protein based) clams.  Fresh beet and orange juice: LIKE DRINKING STRAIGHT DELICIOUS VITAMINS.I had the gyoza to start because I'm a sucker for a dumpling.  They were...not great, especially at the price of roughly a pound/each.  They were really small and the skins weren't sealed so it was impossible to dip them into the (delicious, note) chili sauce without all the innards falling out.  Dumpling architecture was off.We also had some guacamole and chips, which was totally fine.  Really lime-y (which I like!) and smooth (which I don't!).  Fair portion, I guess, but it was just...chips and gauc.As a main I was trying to keep my careening-towards-holiday-excesses promise to myself and had the detox salad.  Beet and carrot and seeds and fennel and some leaves all tossed together in a lime vinaigrette.  A lot of crunching; it was a nice, clean salad.  Energising.  Nice pile of crunch.I think what derailed the mood a little was one server who seemed to roll their eyes at any/everything.  It was kindof funny, but I don't know what set it off: stressful service? The rolling was in high gear when three separate tables requested tables different from the ones they were given (can fully sympathise that this would be frustrating within a small restaurant, but an obvious huffy eye-roll doesn't help, either).Yelp note: the neighbouring table had the burger of the day with massive wedged sweet potato fries.  Their plates looked BOMBDOTCOM.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CkqmyV3UWUd70oM3F-PahQ"
  },
  "SV5zzjJGl-k6fvLwefJyGg": {
    "date": "7/10/2014",
    "text": "Mildreds is a cozy restaurant, located on Lexington street. I didn't have to queue and sat at a spacious table. The waitress was polite and gave me plenty of time to order. I ordered stir fried asian vegetables. Not amazing but not bad. I have nothing dazzling to say about Mildreds but nothing horrible either. I'll probably come back and order a special.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GEalOrwYKKlRXOhEqKHM4g",
        "caption": "Photo of Mildreds - London, United Kingdom. Stir fried Asian vegetables with organic brown rice and tofu, topped with cashew nuts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GEalOrwYKKlRXOhEqKHM4g/o.jpg"
      }
    ],
    "user_id": "9Z1dYT1uzpGJ_XDARah5TQ"
  },
  "zD8IdsnurC24ab_foQoDEQ": {
    "date": "11/15/2015",
    "text": "Disappointing food, environment, and service.Mushrooms were pretty tough, the pie they were in left a lot to be desired. Portions fairly small, especially the ravioli. Restaurant fairly loud and crowded, but that might be standard for the neighborhood.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LOjoz5hWTp9du0Bp-RHpg"
  },
  "2AOFBzFJUCDwyuP5dPELWw": {
    "date": "9/13/2015",
    "text": "Having read reviews about the long waits and small dining area I had my apprehensions about dining at Mildred's, fortunately the overwhelming compliments towards the food was enough to spark my curiosity and subside the lack of patience of my hunger. There was only a thirty minute wait and we probably did not even wait for that long, however I don't doubt that queues line up out of the door for a seat.Mildred's Its self is a little cramped (you may find yourself sharing a table with other diners) and at present seems to have some renovations happening but the atmosphere is brilliant, you can see everyone's food arriving at their tables which gives you a bad case of food envy, but that only makes the arrival of your food more enjoyable (or making time to pay up and leave more difficult) and speaking of food it was some of the best vegetarian food I've ever had, the prices are more than reasonable for the quality and quantity, I want to go back and try everything, you'll experience the same.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zH0bU3WFsuzAifTY8sH8gQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Mildred's Buffalo tofu, crumbed and fried with Buffalo sauce, crudites and blue cheese dip.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zH0bU3WFsuzAifTY8sH8gQ/o.jpg"
      },
      {
        "img_id": "Bz5GGMF4Q46Oq6iSiMKSHg",
        "caption": "Photo of Mildreds - London, United Kingdom. Mildred's Portobello, Wild Mushroom and Ale pie with minted Peas and (phenomenal) fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Bz5GGMF4Q46Oq6iSiMKSHg/o.jpg"
      }
    ],
    "user_id": "LkaYrwY1fWghglTVxT1dFw"
  },
  "DILCcJDbDaJRI7R9Zb039A": {
    "date": "5/15/2013",
    "text": "So delicious and so many things to like about this place. For one, it's vegetarian. Two, constantly busy, but we managed to get seated relatively quickly.  Three, we were never rushed. Four, did I already mention delicious?I went with the smoked tofu, apple and bean sausages, essentially their version of bangers and mash. The sausages held together nicely, mashed potato was fantastic, and so was the kale. Washed it down with a banana, honey and soya milk smoothie. I also ate a big part of my friend's dessert: coconut black rice pudding with mango compote and coconut flakes. Heavenly, and not super sweet, which I appreciated even more.Probably my favorite meal in London. Dishoom was a very close second. Thank goodness this was recommended in my guidebook!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2247iVcSL6CBUItgheD3w"
  },
  "HQBBSIizReW5WSzSKnCntg": {
    "date": "6/12/2007",
    "text": "Even non-veggies will love the food here - simply wonderful. Get there early as they don't take bookings and it can get busy. Well worth the wait, and can highly recommend the burgers, and the smoothies are yummy. Watch out though, as they don't take credit cards (they do accept Maestro and Connect). mildreds.co.uk",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cg78OVnYZPVgIIUG6jkEsg": {
    "date": "9/7/2009",
    "text": "Popped in on Saturday afternoon - fab food and very laid back - would thoroughly recommend. I had the burger but the best thing was the fries - big, crisp on the outside and fluffy inside - mmmmm, delish!!!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "270QmULUK3xedOn3r6NyRg": {
    "date": "11/18/2008",
    "text": "what is it about veggie restaurants being far too small? this lot have moved a few times to a (seems to be) smaller venue but within the Soho area. the small venue puts pressure on the diner, get there early to get a table - 5pm on most days - , you cant book a table, you cant be seated until the rest of your party arrives and then you get the bill before you've finished eating your desert as the queue is out the door. having said that, the food is amazing and varied and has been a long time favourite of mine - 12 years - so go for the experience. Wagamama's is across the road if you cant be bothered to wait",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lfJ-V08sasQfT9j_38tuhQ": {
    "date": "10/16/2015",
    "text": "Oh WOW! I wanna start by the inside of it, it's just a super nice, cozy and cute space great for go for a date or with your family. The staff is super friendly and they make you feel so welcome.They have a good food variety on the menu, it goes to burgers to dim sum to curry to sir fry ... it all sounds so delicious! I got the Sir fry which as WOW! really good and my boyfriend got the burger also amazing! They have a lot of vegan options there and plates that can me easily be turned into vegan by request. I wish that by in the end of the meal I had space for dessert which sounded great but guess I'll need to go back ;)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zMPde0ebCYf4PI6QcI8vww",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zMPde0ebCYf4PI6QcI8vww/o.jpg"
      },
      {
        "img_id": "oBJCGqzX92jzGsX3EowRxA",
        "caption": "Photo of Mildreds - London, United Kingdom. Sir fry and burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oBJCGqzX92jzGsX3EowRxA/o.jpg"
      }
    ],
    "user_id": "0IRO2SEY24WVqmvocLTOgA"
  },
  "ufpbu96TbLW9NhchMYPrfg": {
    "date": "10/21/2015",
    "text": "As a vegetarian, Mildreds has been on my radar for quite some time. The few times I have tried to get a table have been Friday/Saturday nights, and I was put off by the hour-long queue.I finally managed to go to Mildred's outside of the restaurant's peak hours at 4pm on a Friday, there were several tables available but the place was still busy.With regards to ambiance, there is very little. Mildred's is quite noisy and has no windows, I really like natural light unless the restaurant can compensate with cosy candles etc.I had already consulted the menu and knew that I was going to go for the vegan mushroom and ale pie with chips and mushy peas. The butternut squash curry that my partner opted for looked really good but I wanted to stick with my original choice, as vegetarian pies are harder to come by.When the pie arrived, I felt an initial disappointment. It was not a pot pie but rather some very watery gravy topped with some puff pastry-it didn't even seem homemade. The chips were good but too fried. My partner's curry was good once you added the coconut chilli, but nothing extraordinary. For £11, the meal was quite disappointing in all honesty. Pie minster or Clives pies offerings are better than what I had here, and much cheaper. I looked at the pudding menu but didn't feel particularly inspired by the brownie and cheesecake offerings. I won't be back in a hurry.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0nDin2VLTBbLdDc2IHLKYw",
        "caption": "Photo of Mildreds - London, United Kingdom. Mushroom and ale pie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0nDin2VLTBbLdDc2IHLKYw/o.jpg"
      }
    ],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "QoH2qrB5O7hwzDC6Gz93-Q": {
    "date": "11/22/2015",
    "text": "Delicious, delicious food but dinking one star because it is served lukewarm and our waitress was bitchy. I got the pumpkin, ricotta and sage tortelloni with wild mushroom marsala cream sauce as a starter- again, wonderful flavour but it was also small even for a starter portion. The chargrilled cauliflower with tahini lemon dressing and pomegranate seeds- same. My friend and I shared a special dessert: a pecan pud with a scoop of ice cream that was so yum. However, we were charged twice for it and while the manager gladly took it off, he also said, \"Oh I wouldn't even have noticed!\" Uhhhhh that doesn't make me feel any better =/I would love to try many other options on the menu and will probably return just will keep my expectations lower. Also, keep in mind the place is TINY and it is LOUD so it's not the most relaxing experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "fU8UBb8x0bsoQe1mShoRYg": {
    "date": "6/10/2017",
    "text": "I've been to Mildred's a few times - the first being 6 years ago - and it is still the best vegan food in London. It's gotten hugely more popular (and crowded), but for good reason. You can't make reservations so if you show up on a weekend night expect to wait at least an hour. You can have a drink at the bar while you wait; my aperol spritz was refreshing after a full day of sight-seeing. I ordered the mushroom and ale pie with chips and mushy peas. As an American, I just can't understand mushy peas. But if one must eat them, these are a fine representation. The chips were perfect and the pie was very good. It's not the best dish I've had at Mildred's, but very good nonetheless. Dessert stole the show. It was a mixed berry polenta crumble. It tasted nothing like the polenta I know, and complemented the berries wonderfully. The creme anglaise served in a tiny pitcher to be poured in was a slight miss. It didn't have the richness of a traditional creme anglaise, and it being vegan is no excuse. There are plenty of rich dairy substitutes; the recipe just needs to be tweaked. I'm really splitting hairs, though, as this is still the best vegan restaurant in London despite several new additions to the vegan scene. Hopefully they take it as an opportunity to up their game and make just a few minor tweaks to make this restaurant a solid 10/10.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "psxMv3-Dc5k7r8zqVLg-mw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/psxMv3-Dc5k7r8zqVLg-mw/o.jpg"
      },
      {
        "img_id": "WNZYPzn1Od62__qKaGM8pw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WNZYPzn1Od62__qKaGM8pw/o.jpg"
      }
    ],
    "user_id": "WcnwW-_xRk9PxOlCtn_CKw"
  },
  "4pP5KtN6KjMhDbYckToGfg": {
    "date": "10/27/2015",
    "text": "Very nice atmosphere!! the food is just amazing, even for meat lovers like the friend I went with. We had 2 appetizers (halloumi is delicious!!) and one main each (burrito and stir vegetables and brown rice!)overall a full 5!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FZ_qxoyFge6k4lk4Uc0plA"
  },
  "vxkOjGWR3OTKfjP3xnoc8g": {
    "date": "10/17/2015",
    "text": "I went here a while back with a vegan friend of mine, and it was so good!! I'm not vegan or vegetarian myself and was hoping that most of the food wasn't going to be RAW THIS and ROUGHAGE THAT, as most vegan places seem to be, at least in my opinion. This was far from it!! I had the bean burrito dish and it was SO GOOD. It was incredibly filling too!! Absolutely packed with beans and cheese and tasty goodness. Deffo worth it for non-veggies/vegans if you're looking to feel a bit healthier about what you're eating. :p",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lQM1L6yHIRvA8PeURKY57g",
        "caption": "Photo of Mildreds - London, United Kingdom. My dish: Bean burrito  Hers: Veggie burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lQM1L6yHIRvA8PeURKY57g/o.jpg"
      }
    ],
    "user_id": "BYhuZMo5N2EgnMqRL8VeHg"
  },
  "WqruiMufEy6KYXI0loQpEA": {
    "date": "3/24/2017",
    "text": "Had a great meal here with cousins while in London.   Great atmosphere and original vegetarian good.   Great place to check out if visiting London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mvA5sZAD6nNO_nPT38Ioxw"
  },
  "3SoICYlI1V55AuDMk_-odA": {
    "date": "6/14/2016",
    "text": "Nice veggie/vegan restaurant for lunch. Space is small but beautiful with the skylight. Service was very friendly and fast.The only thing that was a bit disappointing was the food. Side of sweet potato chips were very good. My friend and I had the risotto cake (basically deep-fried risotto) and the burrito. The filling of my burrito was good, maybe a bit on the dry side. Wrap was undercooked on the bottom and the whole thing was smothered in cheese, just a bit too much. Guac that came with it was ok but nothing special and iceberg salad as a side was just disappointing for a vegetarian restaurant. Overall decent food but lacking in imagination.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HzVt0jXoYUB4OLHgOMtR0Q"
  },
  "y8zunyAKv1zLq0iPRU7b2g": {
    "date": "6/22/2017",
    "text": "Best Vegan food experienced in London!  First time eating at Mildred's and highly recommend for vegans and non vegans. Atmosphere noisy and friendly. Full of energy and worth the wait. Service was great and the food was mouth watering!  I ate the sweet potato curry dish after a customer recommended.  Will return before leaving London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DHniSOGTBE2OHwjhyWoYCg"
  },
  "6WJy37zYiqWLotbuL1QWig": {
    "date": "8/12/2015",
    "text": "Recently I have tried to eat less meat and more vegetarian when eating out or cooking at home. Halloumi, paneer, cereals & quorn substitutes are the new ingredients in my cupboard and fridge. With good vegetables and sauces I realised that meat free dishes can be as good and tasty as meat dishes.To embrace my new found interest in veggie food, I went out for dinner at Mildred's with two friends. Opened since 1988, Mildred's serves only vegetarian food. It was my first time at Mildred's, while my vegetarian friend is a regular there. I really liked my dinner at Mildred's I didn't miss meat at all. All options sounded great, It took a bit of time to choose what we wanted qnd it was a really good value. We were all too full to get a dessert. We saw some cake on the table next to us that looked delicious, maybe next time I won't eat too much from the starter to leave some place for dessert.Service was good, not special but they were at least attentive to details which is a good thing considering they were extremely busy (apparently it is like that every day).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bMKNlSRbPsKnAIjyxjZzZw",
        "caption": "Photo of Mildreds - London, United Kingdom. Fresh tortellini filled with pumpkin and ricotta, with chestnut mushroom, white wine cream sauce, drizzled with truffle oil",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bMKNlSRbPsKnAIjyxjZzZw/o.jpg"
      },
      {
        "img_id": "Ui4ZY2W4WvCyhfzmYgx0rg",
        "caption": "Photo of Mildreds - London, United Kingdom. Mixed mushroom, porcini and ale pie with mushy peas and fries or mash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ui4ZY2W4WvCyhfzmYgx0rg/o.jpg"
      },
      {
        "img_id": "1IFj5iXgf_0sZYltF_UL3g",
        "caption": "Photo of Mildreds - London, United Kingdom. Fresh tagliatelle with creamy basil and goat's cheese sauce with butternut squash and sweet potato",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1IFj5iXgf_0sZYltF_UL3g/o.jpg"
      }
    ],
    "user_id": "4HlLujEovUqZ2HVxRAZsHg"
  },
  "xljG8hhzXveGry8diqkQgg": {
    "date": "4/15/2016",
    "text": "Great vegan friendly food that's tasty, well presented and lively atmosphere. Traveling here solo, I enjoyed a delicious cashew curry with sweet potatoes and spicy sauce on the side. The tofu buffalo was bland and the ranch side was dull- maybe that's what ranch dressing does. Drinks are very reasonably priced and wait wasn't long. Their scheme of giving you a card to use at bar and then transfer to table is smart. I'll be back!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IQRwwL5p5YJ8tUp5Lnamg"
  },
  "cj5Sihg3lixW1EnusswgNg": {
    "date": "2/9/2015",
    "text": "Wow is this place popular! We arrived just as it opened last Saturday and within half an hour, it was heaving. After tasting the food, I could see what all the hype was about. The halloumi burger was absolutely delicious, crispy and full of flavour and the sweet potato fries were insane. Sweet chunky slabs of potato, sprinkled with salt. Delicious. The dessert was also incredible, I went for a peanut butter brownie with chocolate sauce. Not gonna lie, I was a bit skeptical because it was gluten free and wheat free and previous experiences haven't been that good with similar products, but I definitely had nothing to worry about. The brownie was rich and melted in your mouth, with the chunks of peanut butter to add the finishing touch. The vanilla ice cream on the side was fresh and tasted like it had come straight from a vanilla pod.Not the cheapest place, but an ideal place to go for lunch, if you vegetarian and its that good, meat eaters will happy to come along for the ride.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "eGJ7iWDA_zgNt7tVHBm_4Q",
        "caption": "Photo of Mildreds - London, United Kingdom. Halloumi burger and sweet potato fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eGJ7iWDA_zgNt7tVHBm_4Q/o.jpg"
      },
      {
        "img_id": "OdF4u2A1fxtdvH_c2eDgww",
        "caption": "Photo of Mildreds - London, United Kingdom. Chocolate and peanut butter brownie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OdF4u2A1fxtdvH_c2eDgww/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "bCfb4iPoJoq51tuC2LTJYA": {
    "date": "10/28/2013",
    "text": "Mildred's offers a variety of dishes with international influences and with the options of vegan, gluten-free and wheat-free meals. They do not take reservations and the wait sometimes could be long, but it is well worth it. While waiting you can take advantage of their bar from wine to beer and specialty created cocktails.One of their main dishes I recommend is the Sri Lankan sweet potato and cashew nut curry. The dish is nicely presented with big sweet chunks of sweet potatoes with yellow basmati rice with green peas topped with cilantro and chopped cashews in a cashew nut curry. The flavor of the curry was complex with flavors of coconut, cardamom, turmeric and curry leaves with the chopped sweet cashews. The thick tomato sambal on the side had tomato, cilantro and a hint of coconut that provides freshness to the dish.As for dessert, I had their sticky toffee pudding. Their take on the sticky toffee pudding is presented like a slice of cake as oppose to most of the other versions of the pudding which were served as a circular shape drenched in sauce. It had a cake-like texture rather than a soaked pudding. The rich and sweet sauce was lightened by the sweet cream served on the side.Good food and a great staff. A true gem to dine at. I would definitely return to Mildreds next time I am back in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bm3R2pfOkqpMm_fOqaS4ww",
        "caption": "Photo of Mildreds - London, United Kingdom. Sticky Toffee Pudding",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Bm3R2pfOkqpMm_fOqaS4ww/o.jpg"
      },
      {
        "img_id": "9wFTetRLRJZTzqzDDM7pNg",
        "caption": "Photo of Mildreds - London, United Kingdom. Sri Lankan Sweet Potato and Cashew Nut Curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9wFTetRLRJZTzqzDDM7pNg/o.jpg"
      }
    ],
    "user_id": "KmUy2GX3OpGkS1LXOJ8tNg"
  },
  "Mt3PVVo1j_BteR8_mHPjbw": {
    "date": "9/25/2017",
    "text": "Great vegetarian food in a great location. Definitely a pick-me-up from the normal British food we'd been experiencing on our trip. It was really busy, even mid-week, but worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbLyAgl89UtoUFNPkRn29g"
  },
  "eVR3r54nkSh96AhuMsrIcw": {
    "date": "1/20/2015",
    "text": "I had one of my best all time favourite meals at this Mildreds. I met a friend here she thought I would like it as there are many gluten free options, and its food made with love. I got a fresh kale, mint, cucumber and apple juice which was nice and light. For food I had the thai tofu fritters with melon and coconut sauce and my friend had the dumplings. The fritters were delightful. Soft, light, fluffy and very tasty, they don't taste like tofu at all it was surprising, the melon and coconut sauce balanced it out perfectly. Next we had the asian vegetable stir fry with brown rice. This too was very tasty, vegetables were crispy.Mildreds also has a great salad bar which is good for a cheap and healthy take away lunch. The staff are busy, there is limited seating at lunch time because its so popular!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-XgYco15P0GxJagafEBsvA",
        "caption": "Photo of Mildreds - London, United Kingdom. Sweet potato frites",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-XgYco15P0GxJagafEBsvA/o.jpg"
      },
      {
        "img_id": "1WfqWml0gh09fV2WfXFZ5Q",
        "caption": "Photo of Mildreds - London, United Kingdom. Dumplings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1WfqWml0gh09fV2WfXFZ5Q/o.jpg"
      },
      {
        "img_id": "pa2zPIBSS-Pf-WxrIXa6gQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Asian vegetable stir fry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pa2zPIBSS-Pf-WxrIXa6gQ/o.jpg"
      }
    ],
    "user_id": "thmDYinSBv4ddroiNkqbiw"
  },
  "RIeFJ2n4d6SFLwUNt9HI9A": {
    "date": "7/19/2015",
    "text": "Pros: great service, great food, no wait for 2 when we arrived at 5:45Cons: tight seating!Evidently they have improved their service because we really enjoyed our servers. We ordered the antipasto plate and the portobello pie, and both exceeded our expectations. Overall great experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JudIWd_s5MXH8zVa8Qj8gg",
        "caption": "Photo of Mildreds - London, United Kingdom. Portobello pie and sweet potato fries...mushy peas were best ever!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JudIWd_s5MXH8zVa8Qj8gg/o.jpg"
      }
    ],
    "user_id": "S7RxzW7jf-I-d7EKrpsslA"
  },
  "vsjsqDCOJkWbKoDQksnt4Q": {
    "date": "6/3/2015",
    "text": "FOOD & DRINKSI had the sri lankan sweet potato and cashew nut curry. It was a good curry. Fresh and healthy.SERVICEThe service staff was attentive, friendly and nice. Nothing to complain at all.ATMOSPHEREYou can sit at the bar and have some finger food and drinks or go to the back end and sit down and have some veggie meal. We went here to have some nice dinner. The place is quite small and the noise level high but it still is nice and chilly. If you intend to have a romantic dinner I'd rather recommend some place else.RATINGI recommend this place to get a nice veggie meal and some drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TyCY5bBjOhaz8Wgg1K0IgQ",
        "caption": "Photo of Mildreds - London, United Kingdom. sri lankan sweet potato and cashew nut curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TyCY5bBjOhaz8Wgg1K0IgQ/o.jpg"
      }
    ],
    "user_id": "uL44XVREBctl1pbzZ5aCGA"
  },
  "RC_jWNkwh7VRNFQGKdb-6Q": {
    "date": "2/22/2015",
    "text": "Vegetarians, rejoice! Here's a restaurant to take your meat-loving, comfort-food craving friends!Well, that is, unless your friends are addicted to meat, in which case they might still have some withdrawal symptoms. But you'll be in Soho, so it's not like you'll be without post-meal options if they're desperate.Mildreds may be vegetarian, but it has plenty of dishes that are hearty, filling, and sizeably portioned. I love and definitely recommend the risotto cake, burrito, and some of the pasta specials they've offered. Hubby loves the Sri Lankan curry. Desserts are amaaaaazing, so do leave room for those! (we've had cheesecakes and creme brulees and they were yummy!) The one dish I was disappointed by was the sweet potato fries, which were more like wedges. But others seem to really like them, so it's up to you!The space is tight and it can get quite noisy, but it's a friendly atmosphere with attentive and helpful staff. You can't make reservations, so expect to wait 45 minutes to an hour for your table. If you have a bigger group, come early or come at a quieter hour to get seated more quickly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P7opUYIPAoETPoO0DmN3zg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P7opUYIPAoETPoO0DmN3zg/o.jpg"
      },
      {
        "img_id": "kiS1Wfs6MgC-gfuP_5YgwQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Sri Lankan curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kiS1Wfs6MgC-gfuP_5YgwQ/o.jpg"
      },
      {
        "img_id": "PuptHXun6x_2PhSilmJ44g",
        "caption": "Photo of Mildreds - London, United Kingdom. Risotto cake deliciousness!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PuptHXun6x_2PhSilmJ44g/o.jpg"
      }
    ],
    "user_id": "4yclQAOoXgrozfwP7Y5NkQ"
  },
  "7Fl7MrCDr8xkpnkBNZ6_4A": {
    "date": "2/21/2017",
    "text": "Pretty good vegan option! Cool crowd. Very crowded in the evening so better to arrive early.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCnp-aeH3oz5Ql3wq2rQHg"
  },
  "vQZTkc_V1-pLBUWbNxBqHg": {
    "date": "3/18/2016",
    "text": "Great restaurant. Great staff. Charming space!Came in close to closing and was still received pleasantly. Really enjoyed the halloumi appetizer-- highly recommend this!! They also prepare amazing pasta here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fq1lBxnbQroUrGZFRBKe-g"
  },
  "uSOR57bYZhBaljMeONwedw": {
    "date": "9/1/2015",
    "text": "Came here with a friend whilst out for the night in London , neither of us are veggie but had heard great things . Was very busy which we took for a great sign and was very grateful for the plugs there to get a quick charge ! Was shown to our seats by very pleasant staff and took in the nice layout overlooked by a picture of the queen . Ordered a black bean and tomatillo burrito , was really nice and a huge portion I couldn't finish . Once I got over a few of the veggie and vegan replacements the food was really good and had a pleasant evening . Also as a plus was pleasantly surprised when I checked the bill !!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-y1QEEagUuZSH8Ys2-oUA"
  },
  "KY6RFKJi0ulteFTZ48YlDA": {
    "date": "7/21/2015",
    "text": "Great restaurant! I went for the first time in 2011 and then came back in 2013, longing for the tasty food and friendly staff!! You'll never be disppointed! I recommend the hamburguers (OMG, halloumi cheese is so good) and the stir fried veggies (asian style).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wsckQTyNUYElOlzUYyCtRA"
  },
  "r285sxI4PRBQ_FOMez9dGA": {
    "date": "8/20/2015",
    "text": "I came here a couple of weeks ago with a friend after adopting a vegan diet (we decided to try out a few vegan places together to see which were good!).After quite a wait (midday on one of the weekend days if I remember correctly) they noticed we were standing (after 10 mins or so) and seated us. The whole restaurant is very narrow and cramped, you sit in canteen-y rows, which I didn't like. The atmosphere was very dry and the place was stuffed with irritating people (the kind who are trying desperately to make their conversations as audible to as many outsiders as possible). There actually weren't too many vegan options to be honest - I settled on a sweet potato curry. The sweet potato curry was perfectly balanced in terms of seasoning but the chef had obviously decided that it would be a good idea to use an entire can of coconut cream as its base. The result was a very fatty and overly rich sauce with chunks of sweet potato in it (the person next to me ordered the same dish and they too only managed to get through half of it).My friend had a burrito which was a very uninspiring wrap stuffed with kidney beans - she also detested the food / place.The staff were distracted and bored. Overall I was disappointed with every aspect of it. Definitely won't be back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TM7D3jsZ3_0XCLx6z3-gpw"
  },
  "QkjPerLVJ8E-5z1m2Pz05g": {
    "date": "8/22/2012",
    "text": "Mildred's offers proper comforting, hearty 'like your momma use to make if she had accepted your vegetarianism and knew a world away from turkey drumsticks' food. I go to Mildred's a lot because its yummy. My most recent visit was at a friends *cough*44th*cough* and she'd booked out the private room upstairs. It was nice, clean, away from the hustle and bustle of what is normally the mega busy and cramped downstairs. There is a min spend, but we all covered that no problem. The food smells divine, looks scrummy, good portion sizes and is just Moorish. Trying to avoid naughty carbs (with my usual choice being the ale and mushroom pie which I really recommend) I had a Tagine with cous cous. Spicy sauce on the side and a bit of flat bread it was just perfect. I couldn't handle the desert, but they looked nice and from the orgasmic sounds everyone else was making, its a good sign.It's got a good organic wine list, nice selection of beers and cocktails. The waiter may have accidentally mistaken my partner as my mother, but ... that's just plain funny.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9s6xe93UEyFvV28URWRrtA"
  },
  "WhijRWyW5BV3Nz6XmKjT8A": {
    "date": "10/28/2012",
    "text": "Loved Mildred's! As a quasi-vegan from San Francisco, I've been on the hunt for solid vegetarian food in London (preferably something other than Indian). So, I was delighted to find Mildred's. We went on a Friday night and it was jam-packed. But the service was excellent -- we were able to get a drink while we waited and the wait staff took extra good care of us. My friend tried the mushroom pie with mushy peas. The dish was a little on the salty side, but very good. We LOVED the sweet potato fries as a starter... and I tried the vegan special version of bangers and mash. Oh, and save room for pudding! It will be hard, but you won't regret it when you bite into the fruit crumble and vegan ice cream.Thank goodness for you, Mildred... and your vegetarian ways. I'll be back soon.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIgO4Or9l9J-yTDO-Em8BQ"
  },
  "RXPtSU7WV3Qne48VD_tH-g": {
    "date": "6/24/2013",
    "text": "I've had a variety of great and terrible experiences here. And that does seem to be the norm these days. The food is overall really nice, it's the service that can be lacking.Last year was the worst. At lunch we waited longer for food than everyone around who ordered after us, was brought the wrong food, the correct food was cold and with hair in it. Not even a \"sorry\" from the staff, just bitterness. And that's why I haven't been back in a year.Last week I took a gaggle of out-of-towners for dinner here because it has something for everyone and it was DELIGHTFUL! Excellent and attentive service, great ambiance, didn't wait very long, the food was superb- wowing the sceptical omnivores to the jaded vegans! It has absolutely renewed my faith in them and I will definitely be bringing friends here for the dinner service!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "LgccOQC-Ubk8yzCZYfNYcg": {
    "date": "8/3/2013",
    "text": "While visiting London, my friend brought us to Mildred's.  So good.  I really liked the food.  The sweet potato fries were yummy - it looked like everyone had ordered some to share.  The restaurant is a little small, and it was packed full of people.  It wasn't too uncomfortable, though.  The service was fine.  Not what most Americans would call attentive, but good according to London standards.  My husband and I decided that if we lived in London, we would visit Mildred's quite often.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xnL1G_7L6fk5UXWUSyKsww",
        "caption": "Photo of Mildreds - London, United Kingdom. Yummy curry!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xnL1G_7L6fk5UXWUSyKsww/o.jpg"
      }
    ],
    "user_id": "YiSs4HiAZl2kWrsCfnHEEg"
  },
  "qBSXgiWc4XfgJEtWQzYOGw": {
    "date": "12/15/2012",
    "text": "This was my second meeting with an all vegetarian restaurant and like the last encounter this was like my rating, A-OK!!We had a two starters to share, the special cheese fondue and a grilled halloumi salad! don't get me wrong I love my cheese however the cheese fondue was very strong the the cheese was very grainy! its very hard to get a grilled halloumi wrong and thank god they didn' t, the dressing was fantastic it really brought the whole dish together, the saltiness of the halloumi with the sweetness of the tomato and the balsamic dressing.For the main I had the burrito filled with spicy black turtle beans, corn, red pepper and green tomatillo rice,  topped with spicy sauce and cheddar served with iceberg, sour cream, guacamole and pico de gallo. However the food was very bland and tasteless!Having dinner with a group of girls and we of course had dessert, we had the raspberry and dark chocolate truffle and salted caramel, hazelnut and chocolate cheesecake. The truffle was ordinary, the dusting of chocolate left a weird taste in your mouth. But the cheesecake was fantastic! the salted caramel was great!I would definitely recommend this restaurant on the following conditions, 1. catching up with friends2. if you have vegetarian friends The service was slow but the staff was great fun!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dxZ8MBfEpWvcKtQ4Oyl1Kg"
  },
  "NTU4zqVEMAxqc_Uw93bNUw": {
    "date": "5/27/2015",
    "text": "We had a great meal here at this cute, fun restaurant in Soho! Started with Med Platter which was great then got the detox salad and sweet potato curry. The curry was really delicious and rich and the salad was light and flavorful. We even bought their new cookbook to try and recreate some of these dishes back home. Must try for all veggies!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "om32wRHrhyRCQyzjKeyytA"
  },
  "iUml7E6Ta2CPRRcIcZSv2Q": {
    "date": "11/18/2014",
    "text": "Awesome place for Vegetarian food. Wide range on the menu. The tortellini was fantastic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-YHwWwBKkV90QHYV-gNWtA"
  },
  "Hwj1MSql1gFxkfBGE7OwKw": {
    "date": "3/26/2016",
    "text": "Delightful find Stumbled upon this quaint restaurant walking through Soho.  Delicious, pumpkin stuffed tortellini was to die for...detox salad - fresh, crunchy and my husband's curry, sweet and spicy.  Highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "00Ro2olYHzZAN3DaipAnbA"
  },
  "A3mKHgVhWiXJuaAF9MRoNg": {
    "date": "3/23/2014",
    "text": "See this is why I hate going to the same place more than once. Its like a drug or something, its never going to be good as your first hit. The queue was horrendous because there's no where to chill as its so cramped...the staff were all very friendly and efficient though so made it more bearable. I feel I just made the wrong choices tonight which annoyed me a bit because I was really hungry and had been looking forward to it all day. I had the detox salad which was nothing special or exactly the most exciting dish on the menu and sweet potato fries as a side dish and gotta be honest....don't get why everyone is gassing them up so much! Plain to me. The pornstar Martini was good to be fair.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "QcadLkTgOC76QLQqRt2rmw": {
    "date": "11/12/2012",
    "text": "Probably my favourite restaurant in London. The staff who've served me have always been great (especially the Brazilian guy who gave me free sweet potato fries - lovely man!), the food is always delicious and the atmosphere is great, but I prefer to sit at the window at the front rather than being seated amongst all the other diners in the main room. Some of the dishes are a little overpriced but generally the prices are good. They make a mean burger, and wicked fries.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfnVnWOcs2EvkiJpf1kb_A"
  },
  "cMPsv068qYUjLlbHPKNafw": {
    "date": "3/30/2015",
    "text": "I absolutely loved this place.  There was something for everyone.  Very quaint cute place.  Even my picky kid found a dish she liked with a protein so I was happy.  They have a great veggie burger.  Thick steak cut fries (or chips!), and tasty apps, soups, pasta, sandwiches, cakes, etc.  Came back twice on our trip to the city.  It was priced appropriately.  I would visit again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_ZY1PIIFOnA4ji8tFv23A"
  },
  "qLw8pf8sTuDd3_JnixMRZQ": {
    "date": "10/4/2014",
    "text": "Delicious food with friendly service. The one downside is how popular this place is. It was packed on a Tuesday night. I had the veggie burger with sweet potato fries. The burger was magnificent and really satisfied my craving. The sweet potato fries were good, but not crispy like in the US. I can't wait to go back here and try more of their tasty offer!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4eDMRCuJhSb8oQT3V4N0A"
  },
  "3oGNXYkYKPLbxLI81REDdw": {
    "date": "5/20/2012",
    "text": "Mildred's never ceases to amaze me. I'm not a veggie, but I have quite a few friends who are. I've been here on a number of occasions now and I'd have to say that there's never been a time that I've been disappointed. Sadly, though, I can't rate it 5* because it is pretty simple fare. Tasty, but simple.Anyway, the food is definitely delightful, and the last time I went, I had brought my college best friend who was visiting from LA and a recently turned veggie. We had chatted about this place, mainly because there aren't enough LA veggie restaurants and I was proud to show off the local homage to veggie dining.  Friend has never been stumped for choice since turning veggie and loved the fact that he couldn't quite come to a choice. He settled on the sweet potato curry (which is very good - and a staple on the menu) and I went with the chick pea burger. All in all, Mildred's is a good place to go even if you are an omnivore because the atmosphere is great, the food's good and the wine list decent. 4*s! Will definitely return. And certainly worth the trip.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5pQIxCTGyjd89bqgUonNg"
  },
  "WlqxHkhJ7tLWuA8KoShe7Q": {
    "date": "10/7/2012",
    "text": "Stellar dinner here. Came on a Saturday night sans reservation and seated within 15 minutes at a shared table (they have non-shared tables too). We had a bottle of wine - an organic Malbec that rang in at just over 20 quid, which was very good value, I thought, as it was a pretty tasty wine (they had sub-20 quid bottles, too). Sweet rather than dry, but that's sometimes nice. We each had a starter, a main and we split a dessert. Starters were dumplings for her and a salad of rocket, blue cheese, figs and walnuts for me; both were great. Mains were the burger with sweet potato fries, and the 'detox' salad, which was lots of carrots and other assorted veggies. For dessert we had the dark chocolate and raspberry truffle, which was delicious and went well with the wine (n.b. I usually think pairing food and wine is a dubious endeavor, but in this case it worked well - good work, us). The whole meal came to a little under 70 quid, which while isn't cheap isn't bad either for a multi-course meal and full bottle of wine. I would definitely return to this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "cSc47n61ffbkQM-j9_Y0sw": {
    "date": "4/17/2015",
    "text": "I'm not a vegetarian or a vegan, but I really enjoyed the meal I had.  I'd recommend to anyone, but it's very popular so expect a wait.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JkHewIFVbvMmkm7C41-dg"
  },
  "zhC9m8bvNtH0izYxovo3Jw": {
    "date": "1/28/2012",
    "text": "So I just moved to London temporarily and I've had a tough transition with finding non-greasy proper vegetarian food. Then I stumbled upon Mildreds and I never want to go back to New York City ever again (ok not really I'll be happy to go back there, but wow this place is amazing). I should also say I've hardly been in London for a month and I've already been here twice. First time I had the detox salad and the mint tea. The salad was huge by London portion standards and was very tasty. My only complaint was too many shredded carrots not enough other veggies. The mint was very good as well.But, my second meal was what my me need to write a review. I had the veggie burger of the day with fries that came with basil mayo. Now I don't like mayo, in fact it really grosses me out. But instead of seeing mayo I saw basil goodness. and boy was it basil goodness. The burger was also really good but it was the basil mayo that pulled everything together. I also had a raspberry vanilla lemonade the was crazy good. I don't drink so I'm always happy to find something non-alcholic to drink on the menu that isn't your standard coke, sprite etc. Then I had the passion fruit panna cotta like dessert. Now I should say that panna cotta and all related cream desserts are my favorite. But that being said I'm also incredibly picking about my panna cotta. This passion fruit amazingness at Mildreds was one of the top ones I've had anywhere. It was sosososo good I could really just go back to eat that.Anyways if you are veggie or like veggie friendly food and you are in London you would really be missing out if you didn't hit this place up.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "18jz0lXA4oXuxjTbSC2xWQ"
  },
  "HXd_kcFQ5WhhThfFwuUcrw": {
    "date": "11/28/2015",
    "text": "Sat at a shared table at 5 pm and felt lucky to get in as we were heading to a show at 730 pm. Place was packed. The food was fantastic so not a surprise. I had the mushroom pie, very rich. Enjoyed the mushy peas on the side. My wife got a very tasy pasta dish, bread, and a small salad. All wonderful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aeiXHpGE1Li4RZvKuGVGHQ"
  },
  "2eR6pj_qr_PYJwPw76vH3w": {
    "date": "2/1/2018",
    "text": "Incredible food, best meal when I visited. Vegan",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKc-XdchXUGyz2l3mFLOeg"
  },
  "KEF58NOkN7RznOfiMAOL1A": {
    "date": "5/29/2017",
    "text": "In March I had finally touched down in London for the first time in my life. My friend and her roommate are vegan and were showing me around town. We all have pretty hefty appetites so this was our first stop. At first we were told that the wait would be 20 minutes, but we were seated upstairs within 7. The first level has a greenhouse roof, which allows natural light to seep in and was rather lovely, but we didn't mind heading upstairs.The restaurant is blends rustic, old fashioned, and modern decor and the vibe was very refreshing. We sat down and were given a bottle of spring water in minutes. Since I don't have any restrictions while I'm on vacation, I was open to eating anything. We ordered one of the salads as an appetizer for the table - everything in the menu will make your mouth water. Both the waitress and my friends recommended that I try the wood roasted mushroom and ale pie with minted mushy peas and fries, so I did. It reminded me of home because in my culture we use puff pastry for a number of dishes and this one was filled with a mushroom soup/porridge. The seasoning was on point and I just devoured that portion. The minty mashed peas cooled down thw heat from the mushroom mix and added it's own flare to the serving. I think that was my favorite part of the dish. The fries made me feel guilty, but c'mon...who doesn't like fries? My reason for giving it 4 stars is because I want to return and try their other items. I didn't have enough to fully rate this restaurant, but I'm sure it can be deserving of 5. The service was great as we were checked on every few minutes. Vegan or not, you will leave Mildreds stuffed and with a big smile on your face, especially because it's not detrimental to your bank account! :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qUtVzIKwMEqgjZCBMPTixA",
        "caption": "Photo of Mildreds - London, United Kingdom. Wood roasted mushroom and ale pie with minted mushy peas and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qUtVzIKwMEqgjZCBMPTixA/o.jpg"
      }
    ],
    "user_id": "ASLpsoJedm40EWb0oTtjeA"
  },
  "LZs2GazVYx7fjcnjYbrE9A": {
    "date": "7/2/2017",
    "text": "DinnerAre you a sweet potato lover? Then you'll love their curry.Early dinner with my friend who teaches yoga and loves good fresh food and making effort to cut down sugars.It's a convenient place to take friends who is vegetarian or vegan, so every now and then I take friends who are not big fun of meat. Not sure what diet my friend follows but I sensed that she will love this venue. She isn't big fund of meat and loves yoga, fresh juice, loves Asian food then I thought about this place. Both of us had SriLankan sweet potatoes curry. That was divine. Roasted cashew nuts were just the perfect one to be in curry. Portion is giant so we were so right skipping small plates. We were digging in the plate as soon as served on the table. We didn't wait for long. Since it's small place you are hardly neglected. We were so full and couldn't taste desserts afterwards. It's high carb so suggested for someone who works out. I burnt 600kcal in the gym that day. It'll be ideal if it's low fat... (HCLF?)I'm dreaming this curry for days and days.I just NEED to go back and have the same one again.Limited number of the table hence 4 stars.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BK13y0Ns5Ka2c_e5ajEaEw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BK13y0Ns5Ka2c_e5ajEaEw/o.jpg"
      },
      {
        "img_id": "PyzY3vNi9-Hh5yjeK5Ul8A",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PyzY3vNi9-Hh5yjeK5Ul8A/o.jpg"
      }
    ],
    "user_id": "IrwLjCt5g89Lz3zV86JCcA"
  },
  "CPuuXw8ChkD9c18ZILgb3A": {
    "date": "10/29/2016",
    "text": "Tasty food and great service. Ordered : negroni , Flying fig, guacamole and gyoza dumplings   Bonus: people watching",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Pb_15L8BCSZvSrMnywQdBA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pb_15L8BCSZvSrMnywQdBA/o.jpg"
      },
      {
        "img_id": "O5yu3T084J3AzW_faoXX2g",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O5yu3T084J3AzW_faoXX2g/o.jpg"
      }
    ],
    "user_id": "XDn7S40bv7vHa3QUdQ-eEQ"
  },
  "us1iDiZPnIjtJgBcInvzmQ": {
    "date": "1/27/2018",
    "text": "We came on a Saturday and had to wait over an hour, but the cocktails at the bar were delicious, and the wait passed quickly. This is one of the few places I can go as a vegetarian and find too many menu options to choose from. I ate until I was stuffed, and everything was wonderful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ot1BDJbSUIt1vbCUuRdEjg"
  },
  "qVl77xMQXX3mI-E-lrwDRQ": {
    "date": "3/11/2017",
    "text": "Loved everything about this place!!! Cute and intimate atmosphere, reasonable prices, and AMAZING food! Can't wait to go back!!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tMNJplCnU-SeQ01-O2CfKA",
        "caption": "Photo of Mildreds - London, United Kingdom. Gyoza!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tMNJplCnU-SeQ01-O2CfKA/o.jpg"
      },
      {
        "img_id": "yV7Wo9uokIzFk0_UFxIZUg",
        "caption": "Photo of Mildreds - London, United Kingdom. Seoul bowl salad!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yV7Wo9uokIzFk0_UFxIZUg/o.jpg"
      },
      {
        "img_id": "oHa4bw3KVgzOHm6tdlbRzw",
        "caption": "Photo of Mildreds - London, United Kingdom. Thought I ordered the classic burger but it looked like the beetroot burger so I'm not sure which one it was  either way it was amazing!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oHa4bw3KVgzOHm6tdlbRzw/o.jpg"
      }
    ],
    "user_id": "EUTJJuvz4-2fl5Q5x12Rnw"
  },
  "6EhDE6V7aRMzViID-CaQjw": {
    "date": "4/22/2015",
    "text": "I came here for my birthday meal with my friend, I wasn't fond of the no booking policy, but the cocktail menu was fab, we drank Turkish roses while we waited, and nibbled on the olives which were lovely.We were sat down after a reasonable wait, and found it hard to pick from the lovely menu. The tables were fairly close together, *insert celebrity name drop here* knocked a karafe of water over with his bum- but, if there were less tables, it would take even longer to get one! I ate the halloumi burger with sweet potato fries whilst sipping on an elderflower martini (you might have figured I like gin and floral flavours by now!) it was beautiful, and the Harissa added a nice kick. We had a particularly lovely lady server, who was fab. After that we had puddings, pecan pie and the polenta cake, the polenta cake in particular, was a ruddy dream, and we recommended this to *celebrity name drop*, and he agreed. The reason I haven't given them 5* is due to the little downer at the end- the added 12.5?% (I think, it might have been 15%) gratuity, with a note saying you can ask for it to be removed OF COURSE WE ARENT GOING TO ASK, WE'RE AWKWARD AND BRITISH!!! This is one step on pet hates behind handing the man the bill, especially when I'm paying- we genuinely would have tipped more than that- but I'm like a petulant child when it comes to showing my appreciation, I don't want to be told I have to do anything!!!!!!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UCdnzOqPssTK5_ysYKDMyQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Turkish roses!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UCdnzOqPssTK5_ysYKDMyQ/o.jpg"
      }
    ],
    "user_id": "PIqgaeMSEh7i0AmFgtCYOA"
  },
  "KvqH8VcgclCRz3gnB5lCFg": {
    "date": "3/26/2016",
    "text": "Possibly the best vegan restaurant I've ever tried. I had the mixed stir fry vegetables with brown rice. The dish was absolutely mouth watering with the perfect mixture of my favourite veggies and the most flavourful seasoning. My other friends had burgers and a curry, all of which they seemed to enjoy. The aperol was also good, though slightly more alcoholic than other ones that I've tried. Ambience was small and cozy. Not the most spacious of venues, but it added to the atmosphere and personality.Lastly, service was good. Not the most attentive with regular check-in's or anything, but they knew when to come take our orders, serve the food, bring the desserts menu and bring the bill. I would absolutely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "6et3zcInFwX_-HmwaExgRg": {
    "date": "6/20/2016",
    "text": "I'm not a veggie, but happily open to the concept. The reality at Mildred's is fantastic. OK, the space is a little cramped and you can't make a reservation unless you're a large party. But the menu options are numerous and delicious. I had a tough time deciding but eventually chose the veggie stir fry. My portion was enormous and I loved the contrasting textures of crunchy greens and cashews with the soy-soaked tofu and brown rice. My companions also hoovered up their veggie burrito and risotto. Alas, we were all too stuffed for dessert. Although truth be told, they didn't look that exciting. Sugar-free choc torte - say whaat?The bill came to £64 for three mains and four drinks. Not great value when you consider there's no meat involved but then the quality was outstanding. I'd definitely be up for visiting Mildred's again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A9T7Rx9DyVOdxi852dLmIg",
        "caption": "Photo of Mildreds - London, United Kingdom. The glorious veggie stir-fry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A9T7Rx9DyVOdxi852dLmIg/o.jpg"
      }
    ],
    "user_id": "wVXje5_qclPCKXlJcy-ysQ"
  },
  "zGm97ImG9Ir-9x7kKudMbA": {
    "date": "10/17/2017",
    "text": "What a great vegan spot! Lots of salad options as well as comfort foods. The must get here is the polish beetroot burger. Sounds strange, but this thing packs a flavor punch. We got it with Vegan cheese and the sweet potato fries. This place does get quite crowded, so be there early or make a reservation. I would not say it's a great place for large groups.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPnySfbK_xExSMsBybV9ew"
  },
  "xvuYjcA85KZXhXwp0_FZ_A": {
    "date": "11/10/2017",
    "text": "Im not a vegan but the food was amazing. It was my first experience eating vegan. A friend and I went at 6pm it was quite busy. We waited for 15 mins although they said it would be 30. We ordered the dumplings and avocado and the curry as a main dish. Oh wow! They were good. Quite cramped inside and little space left to move around.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jiS_kxPKKX7GyTHAlhWaHg"
  },
  "dQb9lU45hXu9-2-VpaY9YA": {
    "date": "5/23/2018",
    "text": "I'm not vegan or vegetarian but would happily eat here again and again. Shared two starters and two mains and all were excellent. Hummus well made, soul bowl would have again, and burrito was great too. Services very good. Able to get a table at lunch time though was busy with good turnover. Happy with food, service, and cost. Would recommend",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0X3eSC-EQA5ZBQiPunYQjA"
  },
  "gjsC1Abr-Rpo0o7PJftNuw": {
    "date": "4/3/2018",
    "text": "Food is good. But the restaurant is very noisy and crowded. Far too many people crowded into a small, narrow space. The bar selection had some good organic spirits but was extremely limited. The wait staff was pleasant but at the end we waited a lot time for our bill. As a long time vegan who has visited many good vegan restaurants in lots of cities I would not recommend Mildred's.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCobl2RdDhd1p7IG8IGifQ"
  },
  "M1KGpZv0eq8FHC9A3-PAPg": {
    "date": "5/4/2015",
    "text": "Having waited 30mins for a table, Mildreds had much to answer for. Turns out the decor is wooden, simple and rustic and the service was a little sparse at times. Unfortunately they were not able to serve any fresh juices on the day I visited. Nevertheless the food itself was genuinely very agreeable. To a meat-eater, an indicator of good vegetarian food is when you don't even feel that there is anything missing from the meal i.e. there is no void left from having not consumed meat.The Mexican platter was an array of delights; everything from the soft warm black beans, the crunchy corn chips, the delightfully sour cream dip, and the chunky guacamole to the mango, brie and jalapeño quesadilla seemed fresh, appetising and prepared with a touch of pride. The variety of mains on the menu is equally impressive with an abundance of creative recipes giving you the age-old dilemma of what to choose. I eventually opted for the stir fried Asian vegetables (in shitake mushroom sauce with garlic, ginger, fresh chilli and coriander, served with organic brown rice, tofu and toasted cashews). This was a masterful creation; the abundance of ingredients work very well together to produce a mixture of flavours and textures and a very filling as well as balanced dish. In short all the food was attractive, served in pristine fashion and thoroughly satisfying. To be honest I can't quite put my finger on what it is missing that places it just shy from perfection in my mind, but I sense that in totality the restaurant could do with some refinement in interior design, staffing, its booking system (or lack thereof), and its choice of china and cutlery as well as a little bit of originality; little things that can make a difference but often go unnoticed. But have no doubt, Mildreds is a treasure trove of a vegetarian restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "syKoOykvHn1l51i0vvnCNg",
        "caption": "Photo of Mildreds - London, United Kingdom. Sunblushed tomato, mozzarella and basil risotto cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/syKoOykvHn1l51i0vvnCNg/o.jpg"
      },
      {
        "img_id": "ePxgRfILOeExWFdhgI0y1A",
        "caption": "Photo of Mildreds - London, United Kingdom. The Specials pasta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ePxgRfILOeExWFdhgI0y1A/o.jpg"
      },
      {
        "img_id": "Hn4I9V8Hm1tHfHQsslOsJQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Sri Lankan sweet potato and cashew nut curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hn4I9V8Hm1tHfHQsslOsJQ/o.jpg"
      }
    ],
    "user_id": "gFxXMw3jn_gc-D-aY6mrMg"
  },
  "2ejjl_u1KVZYOzCJmxf5Mg": {
    "date": "11/16/2014",
    "text": "I had my list of vegan restaurants to visit while I London. Mildred's was at the top of my list. This place was super crowded. I waited about 15 minutes just to sit at the counter. I wouldn't let the line detract you from entering; the food is totally worth it. The menu listed vegan and gluten free options. I went all out and ordered a 3 course meal. The summer rolls were amazing light and flavorful. The curry had a lovely presentation and the flavors of the sweet potato blended well coconut milk and cashews. The brownie with ice cream was like chocolate heaven. This place seemed like a great spot for a date or small dinner party. They had a creative cocktail list which also makes it nice for drinks. The atmosphere was trendy: lots of solo diners with cool playlist in the background.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "oMK2TK5q7bEpeIeIy435yg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oMK2TK5q7bEpeIeIy435yg/o.jpg"
      },
      {
        "img_id": "d0XQuyGnavWUbBArnGaBUg",
        "caption": "Photo of Mildreds - London, United Kingdom. Sweet potato cashew curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d0XQuyGnavWUbBArnGaBUg/o.jpg"
      },
      {
        "img_id": "w_4n-ZqH3WtE3TlTrGCXBA",
        "caption": "Photo of Mildreds - London, United Kingdom. Summer rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w_4n-ZqH3WtE3TlTrGCXBA/o.jpg"
      }
    ],
    "user_id": "YyoImCTN8jbwJPoMg6VIMg"
  },
  "Qx-KIEukAuFTSqcFbR_7LQ": {
    "date": "7/1/2017",
    "text": "Love this Vegan/VG restaurant!! The food and service was exceptional!! We would definitely recommend this spot to ALL of our friends!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQHNfIqAHNkVZsKMOMb6XQ"
  },
  "Hv_6nVHqg62xW_TDoPexDA": {
    "date": "6/28/2017",
    "text": "LOVE this place!!! As a vegan, it is so refreshing and... relaxing to be able to walk into a restaurant and not have to worry about having to completely customize a meal to my lifestyle. The menu is quite lengthy, with lots of options for everyone. However, the wait time is typically pretty long no matter what time of day it is, so make sure you bring your patience, as it is quite a tight space to be in as well. Overall, I wish I could eat here every day.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zMz-dQDoWW5ZQa95Tr-y_A"
  },
  "YDL7z9K4eYZDmtYc0lGvuA": {
    "date": "8/19/2017",
    "text": "Friend from London recommended this place.Good food, drinks and vibe!The place was packed when we got there (Friday night).We had to wait for a bit, about 30 mins. Totally worth it, you can wait at the bar having 5* cocktails or other non-alcoholic drinks.The food is awesome with pretty reasonable price.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqkGOSiGl3d-XoCelqEsag"
  },
  "kqLlgof6TzPcLDUvu_kUnw": {
    "date": "9/29/2015",
    "text": "Had a really nice meal here. It was pretty packed so had to share a table but that's OK. Liked the atmosphere. Food was great for the most part. Really good Gyoza appetizer and awesome fried Haloumi cheese. The veggie burger however was a bit disappointing and my bf's burrito was inordinately spicy. Also loved the drinks. They serve alcohol and I had the Porn Star which was fantastic. The elderberry soda (non-alcoholic) was really delicious as well!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "10Xfhcdi9PZiYUoNbHn3jg"
  },
  "P-H-bWGYlivmuimiVGuBcw": {
    "date": "2/22/2017",
    "text": "Happenstance diner stop recommended by hotel Ham Yard. Have now been three times on a single visit to their different locations. Obviously loving  the food and the atmosphere... and drinks. Family of three vegetarians. Plenty of gluten free options too. Fresh and delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZY_mmm_zqr7k1l23y_kghg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZY_mmm_zqr7k1l23y_kghg/o.jpg"
      }
    ],
    "user_id": "TPMajZSqTFlEC_6qLEPxSw"
  },
  "kQn-FhQE2pd5peItR0a8Ug": {
    "date": "11/28/2008",
    "text": "The first couple of times I ate here with my best friend who is vegetarian, the food would have got 4 stars. I had a very tasty sweet potato curry. I agree with all the other reviewers about the lack of space and the wait for a table. My opinion of Mildred's dropped slightly when the same friend had her Birthday party in the upstairs dining room. I loved the room and the tittilating photographs (no-one else amongst the party seemed to really notice these - what does that say about me?) but I was underwhelmed by my meal on this occasion. Perhaps the kitchen struggled to cope with such a large party?",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "z-sxZ_1njuq7BJonjj8Jtg": {
    "date": "1/17/2009",
    "text": "As mildreds is just around the corner from my work,I've been loads and it never disapoints! ,all my veggie friends demand on going whenever they come to visit.and I never feel outdone by not having any meat on my plate!  it's small and always busy but don't let that put you off, you can wait at the bar and have a organic ginger beer,if your not veggie this is still a great place to try, it's not all beans and pulses,.. they also cater for 'wheat free' and everything is explained on the menu,its not overpriced and the portions are really genorous but make sure you leave room for the cheescake!  They also do take away and in the day time also have a cafe 2 doors down. what you waiting for :)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5LZ6BlXpRExRu5hEVKDyRw": {
    "date": "8/13/2010",
    "text": "please also seehungryinlondon.com/2010/…  Mildreds is my favourite (cheap) vegetarian restaurant in London. I once in the while go there on weekends, after I had maybe a couple of drinks too many and loads of heavy food the day (the week?) before, for some small detoxing/feeling better about my body food (it's by far better than sports :) ). What I also like about it is, that it is not one of those annoying 'into your face vegetarian all meat eaters are bad' places but just happens to serve vegetarian food. so what. At my last visit I had delicious hummous and babaganoush (5.75) served with flat bread. The hummous perfectly creamy, the babaganoush very nicely seasoned with the distinct flavour of smoked aubergine and the flat bread crispy and fresh. There was no fault at all with this dish. Then the all important detoxing with the organic energising detox salad (7.00). I love this salad, I must have had it 10 times already: a full plate of crunchy carrots, fennel, different sprouts, fresh coriander, sultanas and pumpkin seeds with a lime-ginger dressing (I usually like to add some chilli sauce, then it's even more perfect). It tastes so fresh and moreish while being so healthy, sometimes this kind of food just hits the spot. Mildreds has daily changing specials, usually some soup, some vegetarian burger and a pasta dish and dessert. Regarding the desserts: even though I have never eaten any of them myself (I told you  detoxing!), they look absolutely amazing (and the people eating them look very happy). The staff is young, pleasant and nice to chat to and even though I have never been there for dinner, I would rather regard it as a lunch place, maybe not quite romantic date material (unless you want to impress a vegetarian of course!)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tveflwiSH8XAbfgzsdm73A": {
    "date": "7/27/2007",
    "text": "Great location, nice atmosphere, too much salt! This restaurant/cafe is in a great central location to meet a friend and have a quick and cheap veggie bite to eat. I thought the staff were friendly enough but lacked charm. I was a little dissapointed in the food as it was overpoweringly salty and the flavours were competing to heavily with each other.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wN_LeKENzMOIR4cBjKzfuw": {
    "date": "4/9/2008",
    "text": "Mildreds is a small, independent veggie restaraunt deep in the heart of Soho, but a rarity in central London as they have a private dining room available upstairs to hire, with no surcharge. The dining room is kitted out with sensual, smutty artwork which makes a delicous change! Food is above average vegetarian fare - highly recommended is the deep fried camembert, if your arteries can cope with it. Delicious artichoke salads and deserts. Wine and liquor is all organic, ensuring less hangovers! Delicious, and good for group bookings.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "T9oha-_MI9OlkeyI00nUTw": {
    "date": "10/4/2008",
    "text": "One of my girlfriend's favourite restaurants in London, that manages to make interesting vegetarian food that appeals to meat-eaters and veggies alike. Our best experience there is still Valentines two years ago, when we had the most incredible mushroom and pancake gateau! Normally, you can't book, and you just have to hope for the best. But have a drink while you wait, and the food definitely justifies it.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "A8K6CnQpxbGuIYtIrASzrA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A8K6CnQpxbGuIYtIrASzrA/o.jpg"
      }
    ],
    "user_id": null
  },
  "E9kmJLHL3OVPSJmUEnCANg": {
    "date": "11/19/2008",
    "text": "Where do you take a vegan to eat when the very notion of 'no meat', 'no cheese', 'is it cooked in butter?', 'soy milk please' rules out most of the restaurants in Soho? Mildreds offers fresh and tasty, and reasonably priced (£80 for four, with drinks and entrees - no wine mind you) vegetarian and vegan fare in a relaxed atmosphere. The food is varied and tasty enough to convert even the most die hard carnivore.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1v_1VJ21QFwCcKRj9ZfX3g": {
    "date": "4/7/2010",
    "text": "I love Mildred's, if it was a bigger that would be great as it is always so busy when I go.  The food is fantastic and great variety (Not just burgers) Service is ok, and the seating isn't the best but when you get such great food you can't really complain.  This is definitely a restaurant I regularly attend and would highly suggest going to.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YexiwImohHNGPYUKYVaPHw"
  },
  "D9jQAE1ONIlrSuMNZtoadw": {
    "date": "10/28/2010",
    "text": "Nothing special. Totally overrated!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GzZps_Vzc7uzjUqZ4ljgJw": {
    "date": "6/5/2012",
    "text": "Sweet potato fries were good.  Cocktails were well-made.  Good atmosphere, but you'll wait to find a table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLbJ043pHzsWhKug4MNrnQ"
  },
  "GNrAZEf1K2YqoWZRd7Q2mw": {
    "date": "11/18/2009",
    "text": "i'm still thinking about the green curry i had to leave in my friend's fridge because we had to come back to the states.  mmm...sure would love to finish it now!  this adorable little place was something a dear friend of ours mentioned often during our stay in london, so it was fitting that our last meal was here.  lucky enough they were open until 11, or we wouldn't have been able to make it.  the menu was plentiful and i had a difficult time deciding, everything looked great.  we got a bottle of wine and we all enjoyed our dishes.  i got the dessert to go because it was past closing time.  we never felt rushed though.  i can't remember what i ordered for dessert, but when we got it back to our friend's place and opened up another bottle of wine, i dove into it.  some sort of chocolate shell with soft chocolate inside...amazing!  vegan!london is cool and i have always liked it, but the food options just may inspire us to figure out a way to live there!  mildred's is definitely on that list.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnYL1PLsSOwG3i6M2ecSVg"
  },
  "Ffzzjo2wTfX9Mu7HyV8rwQ": {
    "date": "5/31/2011",
    "text": "This place was packed on a Friday night! We took a recommendation we read to come after 9pm, and still waited 30-40 minutes for a seat. Was fine though. We just stood at the bar and had a drink. The tables are close together, so it's not somewhere you want to go for an intimate date, but it's not uncomfortable. We ordered some delicious hummus and baba ganoush as a starter, and for the mains we had the bangers and mash and the Ethiopian stew. As dessert the chocolate red currant brownie. We didn't leave raving about the food, but it was definitely good. What I liked about it was that they serve vegetarian versions of \"real food\". Contrary to other reviews we'd read, the service was friendly enough and quick with our orders.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iXXKDges_o_-uu_jgPYjg"
  },
  "7N4KjSjnOFNAwWUtbCyZKg": {
    "date": "2/4/2009",
    "text": "Very tasty, interesting vegetarian food. I went at 3 PM, and the place was empty. No waiting equals a happy me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PITzfcnHTY9uPtdVpO_aSA"
  },
  "umOtKJGGoRdh9wpC6xPXQA": {
    "date": "7/7/2011",
    "text": "This restaurant is a real gem in London for vegans/vegetarians. The food here is really good, and has multiple options for vegans, gluten free, wheat free, or just regular vegetarians. The veggie burger was killer, and the sweet potato fries were the best I've ever had.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TrvMQOtLV8pxu9VT5OInZA"
  },
  "i_mqTnen77ca4ITdlTOVDg": {
    "date": "3/24/2009",
    "text": "Yet another review of Mildred's is surely testament to it's popularity. Heaving most days of the week and so frustrating that you can't book. Time it right in your arrival you must otherwise it's 'a half hour to 45 minute wait' and left to stand with drinks in hand in the bar/entrance that doubles as the holding pen you will be. Lucky little me I know three of the staff that work here so I'm often through the door to take the weight off my feet and have a cup of coffee mid afternoon when things aren't quite as crazy: between services. So biased I may be but I do think this is a great little place. The atmosphere is friendly and energetic while still allowing for a relaxing meal, the restaurant area is flooded with light during daylight hours from the glazed panels in the roof and the food never takes long to arrive. And and and, thank goodness they understand about decent sized portions for your bucks. Long gone are the days of worthy vegetarian restaurants where the menu was uninspiring and limited to nutroast or nutroast. Mildred's menu has dishes inspired from all corners of the globe but best in my opinion is still the mushroom and porchini pie. Where's the gravy? Inside. It's good.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "vr6y7IQ2Kp0mRhchj4vl3w",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vr6y7IQ2Kp0mRhchj4vl3w/o.jpg"
      }
    ],
    "user_id": null
  },
  "KW8d-ZYIDkhGk6wRnqPQyQ": {
    "date": "12/8/2011",
    "text": "I've visited several times and the food is usually reasonably good. Service is not its strong point and can be lacking and even unfriendly. Which makes its 12.5% 'optional' service charge hard to stomach. A pity.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Fmxz5oDPmkwvv6tvpOdSkw": {
    "date": "12/13/2008",
    "text": "I'm definitely not a vegetarian, but I had to try out Mildred's after hearing so much good stuff about it (plus, they do takeaway and I used to live 'round the block).  I was very pleasantly surprised.  First, it's got a great, buzzing atmosphere due to its popularity (be prepared to wait).  Secondly, the menu is extensive and includes interesting dishes that would appeal to veggies and meaties alike (risotto cake? chickpea tagine? sweet potato curry? yes, please).  Third, I really liked my burger - and never even tried to compare it to a beef burger because it's just a different food altogether (it was creative, crunchy and fresh).  Finally, feeling virtuous, I happily enjoyed many glasses of organic white wine.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "SPJqewE2Lt42LmGzzv1kGA": {
    "date": "1/15/2009",
    "text": "I love the atmosphere at Mildred's. It's warm, busy, hip and very inviting. The food is very good as well.  The menu has a great selection of original vegetarian dishes, moderately priced. We waited about 45 minutes to an hour for a table and  were not disappointed.  Having the option of drinks at the bar while waiting is a big plus.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mfumm_AB7dKAjP71Omga_A"
  },
  "Gdb5erFWMZuN5r5Ry9h3HA": {
    "date": "8/21/2008",
    "text": "The food was wonderfull, the atmosphere was great and the staff are good looking and quirky!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dJeqsTN0UItXblszo0mbyA": {
    "date": "12/23/2008",
    "text": "Really tasty veggie food that would definitely appeal to non-veggies. It gets really, really busy (which is always a good sign) but as they don't take bookings you have to get there early for a seat. I had a really good burrito but my definite fave was the sweet potato fries which I kept pinching from my friends plate, yum.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nKbhsQ6JkLWaH1gbjRpM-w": {
    "date": "7/6/2014",
    "text": "Came in during busy hour, but the wait wasn't long at all. Had great wine in lively fun bar while we waited. Service was really nice and all options well marked vegan. Excellent appetizers, entrees, desserts. Excellent meal with local but vegetarian favorites from start to finish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7QbDx6zSNM5JY4IufQUHg"
  },
  "BQiYhsbS6DtxjpBac5caQA": {
    "date": "3/30/2009",
    "text": "Having recently visited the West Coast of the US and having a huge selection of vegetarian restaurants with expansive menus, I was a little disappointed in the small selection of items.However, the price was right and my food was very, very good, with some items bordering on amazing. We had two starters - beets with feta that was so-so in flavor but high marks for presentation and freshness. The other starter was a ricotta mushroom ravioli with a porcini sauce (ther was a sage butter option for these ravioli as well, but I was SOO happy with the delectable porcini sauce!)I had the mushroom-ale pie with minty peas and some substantial thick-cut fried potato wedges. The mushroom pie was smoky, woodsy, rich, meaty - in a superb and delicate flaky crust akin to phyllo - also with a very nice presentation...really the highlight of my meal. The peas definitely on this side of yum. The fries a bit soggy, but certainly ranked above edible (it's hard to make good fries). Service was prompt and friendly, although not super attentive (they forgot to replace our forks and it took a while to get someone's attention - a forgivable mistake though not terribly high level). I'd recommend Mildreds for any vegetarians (or part-time vegetarians such as myself) as a solid and reliable dinner spot with interesting and flavorful dishes.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaDyWmtMbZG6FsSOOcXj5Q"
  },
  "PHRLjgEDOajJ-P7vaUijIw": {
    "date": "1/24/2011",
    "text": "I am kind of torn between 3 and 4 stars here - on the one hand, I quite liked the busy and laid-back diner-style atmosphere, and I certainly left the place feeling very satisfied (if not to say stuffed). Yet, although the food was quite good, it didn't quite make the cut for saying \"I'm a fan\". I think I liked my appetizer best (artichoke crostini with vegan mayonaise), but the main (burger of the day) was rather average, and the sweet potato fries that I thought I had to try given that everyone seems to love them were good, but not outstanding. The dessert (chocolate truffle) was delicious again, but ultimately I was just a wee bit disappointed by the food (the main in particular). I also think that the service could definitely be better - our waiter was charming enough, but at the same time seemed distracted and not really interested in his job. The lacklustre service notwithstanding, they do make a point of adding an \"optional\" service charge of 12.5% to the bill (are we approaching American conditions here now?), which I definitely think is not cool.So all in all we had a pleasant evening, and the food was good, but it wasn't to fall in love with, and with the service being what it was I can't give more than 3 stars.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "UnLIvR1AyM9JD2RgQfY5Lg"
  },
  "T0c6wvEdo3Vs3_1CA3Isjw": {
    "date": "8/16/2012",
    "text": "It's in Soho so it's obviously going to be more expensive than some, but the food is tasty and plentiful, the staff are friendly (if a bit rushed) and they have a modest cocktail menu. A bit slapdash in an endearing way, and great for an evening out with friends  the choice and variety of food was so good we were eating off each others' plates all night!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-FrIHAokLVBeuhNvwhXlSg": {
    "date": "11/10/2009",
    "text": "I've visited twice, once for lunch and another time for dinner. For lunch my girlfriend and I had the stir-fry with tofu and the duck wrap with a ginger chocolate \"pudding\" as dessert.The dinner meal included the dishes of the day: creamed legume soup, mushroom veggie pasta, and apple/rhubarb crumble. The soup blew my mind. The pasta had too much pasta and not enough veggies. The crumble was worth the 9-day wait I had to endure between visits to taste it. YUM.Girlfriend LOVED the place. Cha-ching!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwFzJWJTDV-VlI00DSYtYQ"
  },
  "QedNMKBrSM_Y4sVnpp9n2g": {
    "date": "6/8/2011",
    "text": "Bustling and cute atmosphere. Service is friendly but not so quick or attentive. The food menu is extensive and creative, but it didn't quite do it for me. Perhaps we just chose the wrong things but the sausage and mash was just ok, and the Ethiopian stew was alright. I did enjoy the homemade bread and olives (hard to go wrong there!). I feel like they could do the food better, with more flavor.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "ev_4Z0uURI0zQgjSMxWWnw": {
    "date": "8/15/2009",
    "text": "Oh Mildred, what can I say that hasn't already been said? Your Sweet Potato fries are worth the journey alone and you actually make your veggie burgers rather than buying frozen soy patties. The risotto cakes, your soups, the sage butternut squash ravioli, in fact I would gladly eat anything on your menu. Well except for that green Thai curry dish. Let's be honest, you kind of mailed it in on that one... and I do have to say I was pouty when you replaced the raspberries in your flourless dark chocolate cake with oranges. Am I the *only* person who things dark chocolate and orange is a bad idea?Still, you are easily one of my London favorites. At a similar price point to Eat and Two Veg, frankly Mildred, it isn't even close. I've taken a number of non veggie guests to you and everybody loves it. In fact, my parents are coming to visit again in October, guess where they want to eat again? My mom even remembered your name; Mildred, *that* is saying something.You do get busy for dinner most nights and always on the weekend evenings, which sometimes lead to slow service. I hate to wait, but for you, I will. And what is this whole waiter attitude thing I'm reading about, because you always treat me right. Mildred, you can tell me, am I your favorite? (Ah, I knew it!)Even if some other Yelpers haven't been showing you the love here recently, I'm here to let you know that you are 6 stars in my book.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3P_b7jCVMRuBprj51qUH7A"
  },
  "UtK5acXSSIqkR4zTrA9vzA": {
    "date": "6/18/2012",
    "text": "I have been eating in Mildred's for years and even had the first date with my wife in there. I am not vegetarian but I love the food and the service. Always worth a visit if you are in Soho.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LdNhZGgewWQ_amWOb7VyRQ": {
    "date": "5/29/2012",
    "text": "The food here was very good. I had the stir fry which when it arrived looked to be mostly broccoli, and as a meat eater I was doubtful it would fill me up. However, on starting I discovered a mountain of tofu and other good stuff and struggled to finish the whole thing (because of the volume, I really wanted to eat it all as it was great!)When we went it was really busy so we had to wait a while for our table, then our order to be taken and then the food, but it was worth it in the end. I wouldn't go here on a date though, the tables were really close together and it felt crowded.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sibUwa54QlJBPPzNoIyvHA": {
    "date": "6/19/2010",
    "text": "Love, love, LOVE Mildred's! I can't speak highly enough about the place! My flatmate and I (both vegetarians) make it our go-to spot for girl nights and are never disappointed. The food is delicious and the service is stellar. The sweet potato fries are a staple -- heavenly! Definitely a great place to hit up in Soho for vegetarians and non-vegetarians alike!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zqttuCEWI4-l4ZBCbfGk6A"
  },
  "IVvtW-4naPuW7QcFYeDPsA": {
    "date": "8/9/2009",
    "text": "Decent veggie place. I was not too impressed by the waiters, with impatient slightly snobbish attitudes. On top of which they automatically add 12.5% tip to your bill. I you can get past all that, the food is quite good. I am a fan of their appetizer dumplings. I can go for a second round of those dumplings right now! The main course is average, but the nice decor makes this restaurant a decent place to visit.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vZNUmkxxUzGnQ337uXn9Dw": {
    "date": "1/20/2009",
    "text": "I should love this place.  I'm a vegetarian and this should be my mecca.  Right in the heart of Soho is this cool, stylish vegetarian eatery with food that is usually very good.  The sweet potato fries with sour cream are great to share... and the burrito is one of the best I've had in London.  However, there's a drawback here for me, and it's a biggie.  Mildred's doesn't take reservations.  So many times I've showed up here with mates and we've had to wait for what feels like an eternity.  The staff let you squeeze into the seats in the front with a glass of wine to sip, but it's crowded and noisy and so unattractive.  Plus seeing the food whiz by to the seated patrons can be tortuous when you're there on an empty stomach.  Grrr, I should have never written this review.  Can't get those sweet potato fries out of my head.  Any chance you'd wait in queue for me if I share my fries?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7UGAhFL26kyuhJ9I21AVTA"
  },
  "KqjpufXgVHMui2jzObxIdg": {
    "date": "10/16/2011",
    "text": "Always good to find a vegetarian restaurant as it's so nice to have more than two dishes to choose between on the menu. The food we ordered was good but expensive for what it was. The waiting list system is annoying. You can't book a table and having been told we would have to wait 45 mins for a table we were not allowed to go elsewhere for a drink. This wouldn't be a problem if there was somewhere to sit while you wait but there's only a tiny amount of standing room, which was already packed with other people on the waiting list. Service was fine and friendly, but the other factors bring it down to 3 stars. There are better veggie places in Brighton and they manage to cope if you leave and come back when your table is ready.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JtWR-1aCOaz7EalVMOxGkg": {
    "date": "2/5/2009",
    "text": "I dragged my other half here as part of my 'detox' vegan-esqe diet. I knew when he was happy it was obviously a good place. The food is all sold to you in an appealing way, unlike many other vegetarian/vegan places which try to make there food into something it is not. I went for the 'sausages' and celeriac mash, although there was less mash and more cabbage to my liking, and my partner had mushroom and ale pie (he even forgot there was no meat in it). The chocolate & raspberry torte was to die for, it says it was a vegan, but tasted so much like the real thing it was had to believe. This place does get packed quickly, and as you can not book you can make use of the bar (which is fully stocked with organic wines and beers as well as smoothies). At around 7-8 quid per main it was not a bad price. Would definetely return, even if i wasn't 'being vegan'.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "E_cELiu3hjlfivCP-Vt4lQ": {
    "date": "2/10/2011",
    "text": "Vegetarian food, tasty and fresh with daily specials. Nice wine. Casual and relaxed. Yes, staff can be a little brusque but mainly because it gets so busy. I lunch here regularly and thoroughly recommend it for vegetarians and non vegetarians (if you can persuade them to cross the threshold!).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3QgYWsUdyf9r7zK8fm8nA"
  },
  "xTpo7g3k4hYPiVlngiuMcQ": {
    "date": "11/24/2008",
    "text": "Vegetarian hamburgers are a challenge. Face it, a portobello mushroom slapped in between a sesame bun will just never compete. Mildred's does a good, wholesome burger with fresh chunky fries. The haloumi was nothing to sing and dance about.Sometimes I find the crowd here slightly pretentious - a bit like I am superior because I don't eat meat. Well yes what am I doing at Mildreds then? Okay all is forgiven. When feeling loving and compassionate toward the world, I can forgive the waiters' brusque impatience as the restaurant can get packed. It's always encouraging to see people moving towards a healthier way of life.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwW0B3I_1QkbzQhaLFOqrQ"
  },
  "kMzY6IOLIeiRBhEkBlN1PA": {
    "date": "12/26/2008",
    "text": "On my numerous visits to Mildreds over the past few years I've enjoyed the tasty food, the wine, the extensive vegan options and even the notoriously offish waiting staff. I used to smile and tell funny tales about being served by sulky waitresses, pointing out to friends that as long as the food stayed good and came in a reasonable time I didn't care what mood the staff were in. It saves on tipping, right? Last time I went, however, the shine had dulled on my Mildreds experience . A group of six of us headed there for my birthday meal, arriving one by one over the space of about 20 minutes. There was plenty of space and I was assured we could definitely have a table, but that we'd have to wait until we had all arrived before we could sit down. This had happened to me before at Mildreds so I wasn't surprised, but as two of us, then three of us, then four, then five ended up standing in the crowded bar area at the front of the restaurant in full view of our empty, ready and waiting table I got more and more annoyed about the policy. Eventually I lied and said the last person couldn't make it just so we were allowed to sit down and look at the menuwhen she showed up 10 minutes later a waitress huffily brought her cutlery back. I'm not a silly teenager and don't really expect special treatment on my birthday from complete strangers, but let's just say the moody Mildreds staff failed to amuse me that night. However you feel about your customers, having a certain degree of respect for the fact that they are paying for the privilege of sitting and eating in your restaurant is surely a standard requirement, and appreciating that there are plenty of other places to choose to go to for friendlier, less uppity service on special occasions might make them try a bit harder to keep customers coming back. The one thing they have is the nice food, but it's not amazing enough for me to forget the rest. I've probably been to Mildreds about seven times over the past two years, but the way I feel about the place right now I couldn't tell you when or if I will be back. The churlish service compounded with recent information that their famed veggie burgers were made with Sosmix - a soya protein mix you can get in shops for about £2 - has really put me off. With so many other good places to eat in the vicinity I think I'm going to be giving miserable Mildreds a miss for a while at least.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yTqN0Zz9a-W6cyuGPhxEgw": {
    "date": "12/21/2008",
    "text": "As most people have said Mildred's is the sort of veggie restaurant that you'd be happy to take non veggies to. The vegetable stir fries are very filling by themselves but can be made even more so by adding Tofu. The last time I went I had a very satisfying mushroom and ale pie with mushy peas and chips. It made a great healthier veggie option to a steak and ale pie. Desserts, if you can fit them in, are fantastic. There's always a good fruity crumble with cream or custard and if you go when the meringue is on the menu, it's wonderful.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ynBefkiyWM7X_8omFNO6Vw": {
    "date": "3/1/2008",
    "text": "As a non-vegetarian, I can happily confirm that even non-veggies will love the food here. They do. I do. It is busy and it is small and it does feel kind of cramped and there's a very haughty waitressbutthe quality of the food makes up for all of that. Also of note is the private dining room, which you can book free of charge and is an elegant upstairs room decorated with some fine examples of Victorian pornography. Which is certainly a talking point. This room is perfect for a special occasion and I've never had a problem booking it.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rJIYb_a8e3xG0SG_bYHbfw": {
    "date": "6/24/2013",
    "text": "Seating is a bit cramped, but food is amazing! The burger and chips with basil mayo is yummy. We have been here thrice and have not yet had a bad service (touch wood).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LFhm1f8npSExERnXzdH8PQ": {
    "date": "8/17/2018",
    "text": "My husband and I had two great meals at Mildred's, after a good hour wait.  The food was very good, love not having to worry about the broth being meat.  Drinks good as well.  My problem with Mildred's is that the tables are really close together, and it was super noisy.  This was a Monday night!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fC-3FKfcQ-TA4Ac8hbMmog"
  },
  "idBq8hJ_e8uqSvI-JrZnhQ": {
    "date": "8/19/2017",
    "text": "Always love a bit of Mildreds. They have a no booking policy though (unless you have 10ppl + then they have a private dining area), so be prepared to wait.. 40mins to and hour+. Standard. Don't be fooled by the mirror at the far end of the restaurant, it doesn't actually have that many seats! So generally you have to wait at the bar after putting your name down with the maitre d. It can be very busy on a Friday night, we went on a Friday recently and there was already an hour long wait at 6pm with more people queueing. It can be pretty frantic and confusing if you've never been before though so be prepared, it's quite a narrow space and if you walk in you're kind of stuck in limbo between people trying to get a drink and getting to the MD to find out what's going on. I saw a poor American tourist that was trying to figure out how long the wait was so he did the natural thing and asked the closest staff member behind the bar, she rolled her eyes and very curtly told him she was bar staff and that he had to try and fight through to ask someone else. We thought the way she spoke was pretty rude. The food is pretty good for vegetarian though. Service can def be a bit better... even trying to order once sat, and trying to pay was a little bit of a mission. Plenty of staff on too so not sure what happened. Would give more stars but just thought the service was below par and ambience was too stressful. It's a shame because it used to be much better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DnoHIyBJldK5huCnTOBYbw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DnoHIyBJldK5huCnTOBYbw/o.jpg"
      },
      {
        "img_id": "7zqs1o_mSAUaH-nmaF8TfQ",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7zqs1o_mSAUaH-nmaF8TfQ/o.jpg"
      },
      {
        "img_id": "d7uTpXBx2xdZg6QLKVw4lA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d7uTpXBx2xdZg6QLKVw4lA/o.jpg"
      }
    ],
    "user_id": "Rhkv-27rPZHQzK_ZYhd3rQ"
  },
  "nTIqo1SP9i6eoZFfaIdTxg": {
    "date": "4/23/2018",
    "text": "Singapore Curry: (5 stars) perfect in every wayMushroom & Ale Pie: (3.5 stars) excellent veg version of hearty ale pie although mushy peas and chips were not the bestNOTE: It is significantly cheaper to take away and there is a lovely park around the corner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kP2hprkQGhMWvjzkl__FYg"
  },
  "xaszrT9X19hUgEAreX_JHA": {
    "date": "7/28/2017",
    "text": "I loved it, and even my non-vegetarian husband loved it.We went at about 6:20 on a Friday and had to wait 45-50 minutes outside, but it was worth it.The seating inside is a little tight, so you are less than a foot from the person next to you. We actually had a shares table, so my two person group shared a four person table with another two person group. It worked out totally fine since they were super nice (new friends!) but it could be close quarters for others.We had the dumplings appetizer. It was a little smaller than anticipated. But the flavour (especially sauce) was great. For mains, both the Sri Lankan bowl and Halloumi Burger had great flavour and were very decent sized portions for London. My favorite thing was the sweet potato fries, though. They were huge and perfect. Just perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "44faC3qch9dPNOucJI4ccQ"
  },
  "20RBdYnqfgQ_Ei8M2XhAEg": {
    "date": "7/16/2018",
    "text": "What a delicious meal we had at Mildreds. Found this place via Yelp as I am always in the quest for a good vegan restaurant. We did a day trip to London on our own while visiting my niece who is serving in the USAF stationed in England. For my husband's sake and to his pleasure the portions were very pleasing.  We started with a bowl of the sweet potato soup which was delicious. We each chose a different dish, but everything was perfectly seasoned and cooked!!  Small place so be prepared to rub shoulders with the next table but service was good and food came quickly.  The mushroom and ale pie was hearty and flavorful and my husband loved it. My daughter chose the black bean and red rice burrito, which stood up to any burrito from back home \"across the pond\". I had the Sri Lankan curry which we all agreed was tasty. Sorry no pics to share because the visual was equally appealing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mn3t-aG4nnvXvpF1TWG9mw"
  },
  "AqrLo1nKEVHuXARm8SSoDA": {
    "date": "10/16/2016",
    "text": "A vegetarian/vegan restaurant? Most people would scoff and be none too pleased to be brought here (that's if you could get in as the queues and wait list is quite hefty). You've got to suck it up and acknowledge there'll be no meat but it will be one of the tastiest meals ever. This is the most impressed I've been with a restaurant in a while! And although this isn't 5* food, as in Michelin */posh nosh, it certainly is 5* for what it is - amazing tasting, full of flavours, nice decor and vibe, friendly service and huge portions - really proving that meat isn't everything! Mildred's doesn't take bookings and as a walk in establishment you are guaranteed a wait. We (2 of us) arrived shortly after 5.30 on a Friday and popped our names on the waitlist with an estimated sit down time of 6. You have to wait at the restaurant so can't go anywhere else for a drink but they have a bar and places to perch (with only a few chairs outside). We found somewhere to lean and ordered two cocktails for the wait. At £7 they are reasonably priced. I got the rose and gin cocktail - very refreshing and would definitely order it again. Perching quite close to where the food was coming out meant we got to drool over that while perusing the menu ready for when we were seated (we were on a tight schedule as going to the theatre after). We were seated pretty much bang on 6 in the back of the restaurant - a lovely open, high, glass ceilinged spaced. It is very bright, modern and spacious throughout although some of the tables looked a bit squished together - we were lucky enough to have plennnnty of space as we had a few bags of shopping as well. There is also a downstairs however I have no idea what it is like! After ogling the burgers for 30 minutes, both my friend and I got their famous vegan burgers with the addition of Monterey Jack cheese (making them only veggie). They kindly brought out the vegan cheese for us to try as I was curious - cold it was grossss. I can see that once melted in the burger it would be a good alternative.  We also ordered sweet potato chips and corn chips with avocado as sides. The food came after about 15 minutes, which was reasonable but I was soooo hungry I barely managed a photo before I devoured it. Both burgers were so good, full of flavour, with a yummy brioche bun and a huge slice of tomato and crisp lettuce. The sweet potato chips were nice (a bit soggy which I love) and were served with an amazing chipotle ketchup and basil mayo. The corn chips were ok, nothing special but the guacamole was gooood (quite garlicky). One thing to note is the portions are huge! Each burger was £8 and sides about £4/5 but it is well worth it - I was so so full and satisfied. While we were finishing our mains a couple next to us were sharing the most decadent chocolate brownie I've ever seen. We were seriously tight for time and super full however after finding out the peanut brownie and ice cream was all vegan, and spotting some tasty sounding dessert cocktails, we asked if the waitress could rush our order through and also bring the bill. This she did with no problem and kept checking up on our drinks order for us - such good service. As promised we were out of there in time to catch our show (just!) but not before enjoying the tastiest brownie. The ice cream tasted so good that the lady next to us was demanding that it couldn't possibly be dairy free! The cocktails were also good especially the bourbon bomb however we didn't quite have the time to appreciate them. In total the bill came to just under £70 with service charge which although isn't cheap is brilliant for the amount of food, quality of food and service. This is why they deserve their 5*.I can't wait to come back (showing it off to other friends) to try the rest of menu - as well as the burgers they have a whole host of meals like curry, risotto cakes and stir fry that looked and smelled delish as well as other desserts like choco cake and orange cake.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7CsWTwyTZJE4Te2FFt7a9Q",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7CsWTwyTZJE4Te2FFt7a9Q/o.jpg"
      },
      {
        "img_id": "U2ZIThhfDfL0Lrv1Oz_TvA",
        "caption": "Photo of Mildreds - London, United Kingdom. Vegan peanut butter brownie and ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U2ZIThhfDfL0Lrv1Oz_TvA/o.jpg"
      },
      {
        "img_id": "8ZBIU_L8z0Rpg6jhWbeM8g",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8ZBIU_L8z0Rpg6jhWbeM8g/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "ge0WJztwhkjZfy53Rby4Tg": {
    "date": "11/24/2016",
    "text": "I came here at 6:45p on a Wed night and there was an hr wait. They don't take reservations for 2 so that's the downside - however, it really is worth the wait. You can have a drink at the bar but the front area is bustling so there's not much room to hang out. My husband and I are vegan (and I'm GF) and there was an abundance of options. Everything is clearly labeled on the menu, the hardest thing will be deciding what to get. Service was good, every table was full and staff was really friendly. Food was truly excellent! From the apps to the large plates to dessert, we enjoyed every dish and left nothing behind. It was all really filling so come hungry. If we lived in London we'd be regulars but we'll be sure to tell all our friends to go, vegan or not!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1UX9bRTxDQo2uQLVK6Vudg",
        "caption": "Photo of Mildreds - London, United Kingdom. Vanilla bean soy ice cream with a salted caramel espresso sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1UX9bRTxDQo2uQLVK6Vudg/o.jpg"
      },
      {
        "img_id": "YMcnTF3TemBVD6wlbuZwlQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Sweet potato and rice curry with spiced cashews - Vegan GF",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YMcnTF3TemBVD6wlbuZwlQ/o.jpg"
      },
      {
        "img_id": "ZcLwWOhm1fm9PKdDkKdjMw",
        "caption": "Photo of Mildreds - London, United Kingdom. Vegan sausage and mash - AMAZING take on a traditional English dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZcLwWOhm1fm9PKdDkKdjMw/o.jpg"
      }
    ],
    "user_id": "Y6Y77MtWRIp2EqU75T1tHA"
  },
  "sYER0F5LO_NFnJqvybFkqA": {
    "date": "2/20/2017",
    "text": "I cannot wait to go back to London to revisit Mildreds. I had the Sri Lankan curry and the beet salad. If it ain't broke don't fix it so I'm looking forward to having the same exact meal again. Everything about this dish was absolutely delicious. I have been back time and time again and i am NEVER disappointed. They have taken out the amazing beet salad so i have tried other appetizers and they are all delicious.I recently went to the Camden location, same great taste minus the line up!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "S0s3ZHZfuc0nKYw0d1x3Yg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S0s3ZHZfuc0nKYw0d1x3Yg/o.jpg"
      },
      {
        "img_id": "aI5VcRpeM472m2XVCU5N2w",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aI5VcRpeM472m2XVCU5N2w/o.jpg"
      },
      {
        "img_id": "_c4ADp7rMi7YL13HNw4O7A",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_c4ADp7rMi7YL13HNw4O7A/o.jpg"
      }
    ],
    "user_id": "vADS6TNFpCWxnpLY7hOZlg"
  },
  "AdTXqjpMbNygyQrVpzQV1g": {
    "date": "9/22/2017",
    "text": "The food is really good but nothing amazing. Certainly not worth over an hour wait. Some of the people who work here are really snooty as are a bunch of the people hanging around the bar and entrance. My particular waitress was nice though. I would rather go to a salad or Asian place with vegan options than here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L66BABtCg_iS6XMYdeUOEg"
  },
  "kICGFNKbZbj-9GwNUEuFDA": {
    "date": "9/10/2017",
    "text": "Luncha nd dinner are both excellent, but as this place has gotten popular lately, expect a wait. As others have said, the seating is \"intimate\".  The gyoza are great, the halloumi burger is excellent, and desserts are always fabulous so save room.  Even my meat-easting friends love it here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3UfaNU33lD86wnyAIwyhzA"
  },
  "7YLwC1dyWHCWW4uiRdrtAg": {
    "date": "3/10/2017",
    "text": "We got to Mildreds just in time to be seated without a wait. Started with the grilled halloumi which I had never tasted before but will be sure to look for in the States. The Polish burger was just right especially after I asked the waitress to substitute raw spinach for the iceburg lettuce. (Why eat white lettuce?) The accompanying fries were fine but not the best I've had (or seen). Great vegetarian place though and a long line of people waiting to eat by the time we left to go to theatre (6:30ish).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "36ZWFt8z-j_jKCkPKHj8Yw",
        "caption": "Photo of Mildreds - London, United Kingdom. Burger - Polish: Beetroot, white bean and dill in focaccia bun with iceburg lettuce, red onion, mayonnaise, pickled cabbage and gherkin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/36ZWFt8z-j_jKCkPKHj8Yw/o.jpg"
      },
      {
        "img_id": "9PBmwwdVMZofpiysJt752A",
        "caption": "Photo of Mildreds - London, United Kingdom. Starter - panfried halloumi, spinach and cherry tomato with balsamic glaze",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9PBmwwdVMZofpiysJt752A/o.jpg"
      }
    ],
    "user_id": "2gcJ0RxWNfSKUPkeB-Y99A"
  },
  "lDmqKC81zPeb_In0OqzlHQ": {
    "date": "8/10/2017",
    "text": "Nice food overall and good prices, but the staff.......Attitude, not nice, kind of rude to be honest, not helpful, bad jokes with attitude and fake smiles. Some work needs to be there.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gb3SzQR3yW-WQ84C8ezsig"
  },
  "ukvF5glzks1L0DvKYDcOPA": {
    "date": "7/27/2017",
    "text": "From the friendly host to the spectacular chips, Mildred's stole my heart from the get-go. New to London, it's splendor, and it's vegan scene,Mildred's immediately popped up when I searched vegan options in the area. Getting there was a mission, as my friend and I hopped on a bicycle-cart (don't know the name of this transportation mode off the top off my head) , and directed the rider using Yelp/Google Maps/my minimal common sense in getting about the area. After some missed turns and slight freak outs caused by the weather (us L.A folks don't do well in rain) and a tight schedule (fifteen hour layover in London for a first timer), we made it to Mildred's an hour short of closing.Greeted by a extremely outgoing and Chatty-Cathy host, we were told the wait would be about fifteen minutes. We didn't mind and made our way to the bar to charge our nearly deceased phones. I had already scoped the menu, so I had some options in mind, and the expo window, close to the bar, allowed me to see up close what my options looked like. Initially, I was sold on the Ale Pie with fries and mushy peas (there are hundred of reviews highlighting this dish, just scroll down), but after taking a look at the tofu-lentil burger with fries that were being delivered to tables, I went into contemplation. Once we were seated (the wait ended up being shorter than expected), the contemplation became a full-blown debate. The options! Only one night in London! The foodie in me was about to have a melt down! So I went with my gut (quite literally) and ordered the burger because the dipping sauce and fries paired it in a way that made it irresistible to ignore. My friend ordered a stir fry (he never does this--ever--I was shocked).The wait wasn't long at all (maybe ten minutes) and people watching for a newbie was a fun at its best during my wait. Our food arrives, we proceed to dig in (because the clock is ticking and London is waiting for us). The food was marvelous. Every--single--bite. The fries were everything London is known for if not more, the burger was so fresh tasting, the tofu and lentils perfectly balanced and creating a soft patty, and the sauce (an aioli or blue cheese of a sort) was divine. The same for the dipping sauce the fries were paired with. I was just way too happy with my selection. I tried a bite of my friend's dish and it was Asian-fusion at its finest. As I finish this review, I can't help but feel nostalgic and sad that I won't be back to Mildred's for what might be years. Oh well, at least I got to try it and it's amazing, vegan cuisine while in the U.K. This place is a gem that if in the states, I would be an avid regular of. A well earned five stars. Did I mention the host is awesome?",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M9fk4W07NLsZ43X_-DWO4A",
        "caption": "Photo of Mildreds - London, United Kingdom. The tofu-lentil burger with fries and an amazing dipping sauce. Loved it!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M9fk4W07NLsZ43X_-DWO4A/o.jpg"
      }
    ],
    "user_id": "sG_QJc8xThP3qXFg7sG2Ww"
  },
  "K14W70bYTV_tMH_heB7iIA": {
    "date": "1/29/2016",
    "text": "So one of my friends is on this new diet, and I had to find a place specific for her tastes - lo and behold Mildred's. It was one of the top searches when you look for vegetarian in London.I get there at around 7pm, they don't do reservations, and the place is heaving. I mean I had very little room to walk amongst others in the queue awaiting a table. Everyone's chatting, people are looking happy, the bar staff and the waiters are on the go constantly. Fortunately a half hour later we got a table (minus one star) and it was a shared table upstairs. The menu is straight forward - they have about 5 mains to select from, so you don't have to over think on decisions, I went for the tomato bean sausages with the mash and spinach, and it was delicious!!! They put these herbs in - I don't know what but it something similar to a wasabi kick! Also had cauliflower and sweet potato on the side - definitely recommend. My two other friends were loving it and we all agreed we would definitely come back. Unexpectedly - awesome. I love surprises.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bYmgZH7H3D6KsRVQ97Xa_g",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bYmgZH7H3D6KsRVQ97Xa_g/o.jpg"
      },
      {
        "img_id": "gZDzIN0CS-djdt1Mx4lXAw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gZDzIN0CS-djdt1Mx4lXAw/o.jpg"
      },
      {
        "img_id": "pmzh4D_7lt0-W059_eI1vw",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pmzh4D_7lt0-W059_eI1vw/o.jpg"
      }
    ],
    "user_id": "wIMmumGUqiK5g3tjOdC2ig"
  },
  "YHDgCCpsszoR9cGTJQsFaA": {
    "date": "7/6/2017",
    "text": "Wow! Started with an incredibly nice & professional server named Angelica. I asked what is most popular, she answered all my questions and helped direct my scattered hungry brain.. I had the Grilled artichokes with cashew cream and grilled lemon. Holy smokes this is my new favorite thing! For my main I got the polish burger, it is a beet root and bean base which is a decently firm burger compared to many vegan patties. The herb mayo is really nice as well. I would definitely recommend this place without a doubt. Lastly, I ended with the chocolate hazelnut brownie w/ice cream. Very nice. Crumbly but not dry. A bit sweet but you expect that from this type of dessert. I will absolutely come back every time I'm in the area. And they do have some non vegan options for the picky eater!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fB451C1wPjiK1n7LfMcaFg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fB451C1wPjiK1n7LfMcaFg/o.jpg"
      },
      {
        "img_id": "kpBrOP2BYmgCCeFIpKqzDg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kpBrOP2BYmgCCeFIpKqzDg/o.jpg"
      },
      {
        "img_id": "l4jUrJ2Nvznyys5EBmvK0A",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l4jUrJ2Nvznyys5EBmvK0A/o.jpg"
      }
    ],
    "user_id": "qUc2ZofjUGW8NUhTAba4Og"
  },
  "u6R8qoRBVhnZ2vWM5CJN5g": {
    "date": "8/5/2017",
    "text": "Simply amazing and delicious.  A must to visit for vegan food.  Highly recommend the mushroom tart and aubergine.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6GuflYAPmRCSeHFdaBiRNQ",
        "caption": "Photo of Mildreds - London, United Kingdom. Vegan hazelnut brownie with salted caramel sauce and ice cream.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6GuflYAPmRCSeHFdaBiRNQ/o.jpg"
      }
    ],
    "user_id": "FOLeUSzkcD2us1iz6kEuhw"
  },
  "5e4x1pk-CJbWh5ftKv_Nnw": {
    "date": "2/15/2018",
    "text": "I can see why this place gets so many good reviews. It was divine. I had a trio of small plates, the artichokes and grilled bread, the gyoza and the manchego cheese. All were superb in their own right. I would come again in a heartbeat. Excellent service, all dishes recommended by the server. And at 3 pm on a Thursday afternoon it was packed, so you know it's good when it's packed at an odd time like that. Keep it up, Mildreds! Love that you are giving vegetarians and vegans so many delicious options.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PO_2SN1Ic-rERqlTS8YrdQ"
  },
  "dDnj7GxWYyp7EoNB8Ffzlg": {
    "date": "3/6/2018",
    "text": "Honestly skip it... veggie pret across the street has better options. Slow service, cramped tables/seating, exorbitant prices... and the veggie burger wasn't even good!! First and last time at this place :/",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4jqlk3iGoJNdSbBTbYqhIQ"
  },
  "XDdbvjvco6wtmALJh5bACg": {
    "date": "7/6/2018",
    "text": "One of my favorite restaurants until today. Waited for 25 minutes or so and nobody even took a drink order. When we asked the manager one came to table rude and pushy. We left for fear of what they would do with our food. Looks like bad management is taking down on of what used to be a great and reliable spot for good food. Sadness.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ywfqgPF-rmM5a65_VINDA"
  },
  "XKHthu-0Mg1UYMXO4fyMVQ": {
    "date": "12/7/2016",
    "text": "Mildred's is a decent veggie restaurant that offers a global selection of dishes. The dishes we got were good but I'd focus on the cuisines that have a heritage of vegetarian or vegan fare. Gyoza was surprisingly tasty. I really enjoyed this and they were better than some of the Asian restaurants I've been too. The filling had a bit of texture unlike some veggie dumplings which can be quite mushy. Side of Asian broccoli (which was actually tenderstem  broccolini and not gai lan) was well cooked with a nice sweet soy sauce dressing. Nothing special but well prepared. I had the sausage and mash with cabbage as main. This didn't fare so well. Mash and cabbage were comparable to what you'd probably make at home but the sausages tasted too strongly of fennel seeds. One bite could be quite bland but another could fill your mouth with a liquorice taste. Slightly off putting. Overall, the meal was fine. The atmosphere is quite modern which is a nice change from the hippy dippy places that normally make up veggie restaurants.  The dishes seem slightly hit or miss but I'd be open to coming back and trying more.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "pMuSokniVL61JElcYf5itw": {
    "date": "12/2/2010",
    "text": "I probably did not come here when I study in London due to that I broke and rarely ate out.  But recently I traveled back to Europe and when I met up with some friends in London they said \"Vegetarian...let's got to Mildred's!\"Definitely wish I ate here more.  We all got the mozzarella risotto cakes which normally I wouldn't have allowed myself to order the same thing as everyone else at the table, but it was in fact excellent!  VERY filling!  I shared a hummus and babaganoush dish as an appetizer that was also very tasty. The service was excellent, and our waiter was pretty cute as well ;) I see that a lot of people here think that it was loud but I didn't find it too loud, we were able to have our conversations and not have to yell or hear others.  And the servers were not bothered that we stayed there for a LONG time either!We also popped into the bakery next door which is owned by Mildred's, and I had a yummy cupcacke!Sidenote, both places are have very good options for people with ciliac's,",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "szRPF1AYwj3cVk_MG5ZWSA"
  },
  "MFIXFevFTvaApOykyJrZew": {
    "date": "11/24/2008",
    "text": "This is a Soho classic. It's been around for ever and serves up really good quality vegetarian food for a mixed crowd. I used to be a vegetarian and both then and now it always guaranteed a really good meal. The menu is pretty balanced, they've got the usual burgers, risottos, salads and chips plus a few more creative, vegan and intolerances tolerant options.The atmosphere is nice too, cosy and light and the staff are really helpful and pretty knowledgeable about the food. Whether you like your animals dead or alive this is a class choice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VcUHBiq-GBEthO6G5VSVZA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VcUHBiq-GBEthO6G5VSVZA/o.jpg"
      }
    ],
    "user_id": "DzUYvmEoPKcVjNcCJin3kg"
  },
  "JEv8geGBVnpqKY0DIioUdA": {
    "date": "2/10/2011",
    "text": "This is my favourite restaurant in London. Mainly because the food is great. Also like the casualness of the setup, the service is decent, while not in-your-face and theres a great selection for veges like me. Each dish is well priced, looks amazing - and elicits jealousy as I see plates for others being carried to others' tables. Last time I was there, we sat in for the long haul, ordered several bottles of wine and desserts - and in the end, we felt like we'd had a bargain. Love it and can't wait to return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jjPwnk5KFHkwMs8TdWrs1w"
  },
  "CSl4hOtsfRpxvm8XpgKdYQ": {
    "date": "2/9/2011",
    "text": "We tried to get into Mildred's a weeknight at around 7:30 but decided not to as the wait was rather long. I decided to back for lunch instead which was much easier. We got there at 12:45 and there was no wait, although the place did fill up closer to 1:15The menu looked very interesting and I had a hard time settling on what to order. A friend had recommended the starters (butternut squash pie and panfried halloumi), but as we were rushed for time I only had a main course. I had the borlotti bean and sunblushed tomato sausages, really good. My friend had the detox sallad with which she was also very happy.The service was average, but the food and venue makes the experience excellent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zi8ZFPhV8trNX88fI5eYIQ"
  },
  "ZpliBCer7Hfg3ovcnGwk0g": {
    "date": "4/22/2010",
    "text": "This is advertised as vegetarian restaurant but its just great food regardless of your dietary preference. Can't help feeling that its gone a bit more upmarket in the last couple of years and a bit more expensive than before. Its a popular place and can't help feeling that the staff are rushed off their feet hence the service doesn't feel 100% there, but its still good enough.The dishes I tried were in general very tasty (green curry, burger). Dessert was above par too.A great place to take your vegetarian friends and keeping them happy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EGYsPKoNGf8kqAO-Ma-8TQ"
  },
  "97enhao-zyQWYGDjIG_FPw": {
    "date": "12/22/2011",
    "text": "this is a great place for veg and non-veg eaters alike.  they serve accessible vegetarian food w/o too many meat substitutes, rather using whole ingredients to make the veg food appealing.on a thurs night, this place was hopping, and we had to wait for about 45 minutes at the bar.  i already had too much to drink before i got here, so i just had a beet, carrot, ginger juice to cleanse my palette.  the music in the bar was quite entertaining while we waited, too.  i felt like i was in a late 80s, early 90s r&b club w/ prince, dreamgirls, and tina turner playing in the background.we started w/ the artichoke crostini, gyoza, and fig and blue cheese salad.  i think my fave was the salad.  the gyoza tasted like something i could buy in the trader joes freezer asle.  for my entree, however, i had the burger of the day w/ a side of salad rather than fries.  delish and completely filling!  i could only imagine how stuffed i would be w/ fries.  one friend got the risotto cakes, and the other friend got the nut roast, which was the special of the day.  everything was yummy.  if i could eat like this everyday, i suppose i could be a vegetarian.by then, we were too stuffed to have dessert, altho the sticky toffee pudding would have probably hit the spot.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rx7DNBmPPShVjlcQidGuTw"
  },
  "t7JbfhHaGOQ7CD9TMhAZPA": {
    "date": "9/18/2009",
    "text": "Vegetarian food that fills you up FTW!You guys, Mildred knows her stuff, and her busy little restaurant is worth the inevitable wait. Our party of 5 (awww scott wolf) had to be seated in the special upstairs room, usually reserved for private parties, and adorned with vintage (and may i say explicit?) porn on the walls.After sharing some delectable hummous and babaganoush for a starter, I tucked into the daily special -- an apple, fennel, and beetroot stew with \"giant\" couscous. I think the \"giant\" part sucked me in. Unfortunately, the stew was a bit heavy on the beetroot, and I was sorry I didn't order something that came with those delectable sweet potato fries. What is it about those tasty little fellas?Dessert: a fruit crumble (the fruit in it changes daily, mine was apple) sans cream that was absolutely scrumtrulescent. Piping hot apples beneath the sugary crumbly crumble. Yum. (Dessert has become a standard when dining out during Sober September for obvious reasons.)Everything else at the table looked immense and I heard nothing but \"mmmmms\" all around me.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "XGaMoQ6sg0B5hSzC5aRmdw"
  },
  "9mabPGvrfDVfDmkYLPoK2w": {
    "date": "7/22/2013",
    "text": "As a vegetarian, I would definitely recommend this place. A great selection of food and great portions.It's not a posh restaurant considering the prices but definitely worth going at least once.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MPWv6-TegWig0xyK7DCoCA": {
    "date": "9/22/2010",
    "text": "Mildred's is affordable, as opposed to places like Saf in London. However, the atmosphere is at an all time L.O.U.D. and it's hard to enjoy the meal when you're screaming. Secondly, the line out the door would indicate that what's inside is extremely special. I had the starter and main of the day and left wondering why I put up with so much waiting and screaming. I suppose the food is fine, but - for my taste - not worth the wait.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIFbo8WaP6SCuOFnj_v9kA"
  },
  "hPCzZs4e7NB1FThS8OddlQ": {
    "date": "7/4/2013",
    "text": "Food is ok. Only tried one dish so I can't say too much about it. Seating is cramped. Waiters tend to clear of the table pretty fast after you are done (tool away my glass with still liquid in it)Overall 2 stars. I wasn't to impressed.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XQ50L1eDwzJWg59ADTrRzg": {
    "date": "8/18/2009",
    "text": "OK, so we had a bit of a wait to get a table, but the wait was kind of funny because while the waitstaff wait for their orders, they apparently take time out to whip their hair around in front of a fan.  No, for real.. I'm sure we just happened to be in on a cheeky shift so I can't promise any future performances.  The food is all vegetarian and while I am not, I do like a well-done vegetarian meal, they are easy to do wrong and turn out bland..  but Mildred's was very worth the wait.  Food was amazing, I had a pasta of the day: pesto with fennel and my friends had the burger of the day (bean, looked good), some other tofu things, etc.  I was told that the sweet potato fries were a MUST so we ordered a couple of bowls for starters, and they were indeed quite good.  We finished with an (apparently) soy cheesecake which I would have eaten more of but the portions for mains were so big that we were all well stuffed.  Well worth the trip!  I never really feel like I do enough dining out in that part of town so it's always nice to find little gem restaurants like this.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "WXWB1G3k5WjwC0uZw-H5bw": {
    "date": "8/9/2009",
    "text": "Decent veggie place.I was not too impressed by the waiters, with impatient slightly snobbish attitudes. On top of which they automatically add 12.5% tip to your bill. I you can get past all that, the food is quite good. I am a fan of their appetizer dumplings. I can  go for a second round of those dumplings right now! The main course is average, but the nice decor makes this restaurant a decent place to visit.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wnrOqHy50Z2dN9Rn3umKvA"
  },
  "ke-vnTRFIqiwPoM04EzUAQ": {
    "date": "11/15/2009",
    "text": "Staff- mixed, which I rarely mention first for a restaurant.  One was nice and the other was an a**.  The food was quite heavy for a veg restaurant, mine was nice but my wife's was dreadful, not at all what was described between the chalkboard (special) and the clueless, a** waiter we were stuck with.Also, this place is incredibly cramped (even for London) and very loud.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sZapGYtCKcomo3oYc8ychg"
  },
  "XE40CKml_EMlHYHsligpmg": {
    "date": "1/21/2015",
    "text": "Very good vegetarian/vegan place and also affordable. I had the halloumi burger and I share a gluten free brownie for just 20£",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xIgA0AA9j6uWjKv29UOBg"
  },
  "wVX0JcKtxRh2j0PfDwk-hg": {
    "date": "4/29/2013",
    "text": "Do not say: I will have the bean burger but instead of bean I would like cow.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "9TNeXaR5i4Mm9ZxpJEY9OA"
  },
  "oFy8DFo_bJnDSD8OxD7HCg": {
    "date": "3/24/2009",
    "text": "Caution: fickle veggie alert! From reading past Yelper reviews of Mildred's in Soho, I know this place is very popular so I feel naughty posting a not so nice review. As far as queuing goes, we waltzed right in and got a table immediately. Our waiter gave me the smug look of superiority as I dared to order a Diet Coke. No corporate companies here, all organic juices and freedom beer - fair play to them! With a bit of lunchtime rush I went for the soup of the day - Pumpkin and Carrot. It arrived in a brilliant dash of yellow flecked with parsley. Wow I was salivating already; this was quickly followed by disappointment. The distinct taste of the pumpkin was robbed by the overpowering flavour of chilli, making it quite spicy to my shy tastebuds. Never one for liking hot, spicy food I left most of it in the bowl. I can't understand why they would add this to the soup; no pumpkin/squash soup recipes I have ever seen incorporate chilli. But once I tasted the accompanying bread I sussed. The focaccia was soft, a touch salty and also chock full of spices, same for the rustic brown bread. After a couple of bites of everything, it felt like I had swallowed a spice rack. Vegetarian food is often accused of being bland, boring and tasteless. Mildred's seems to be ensuring that no-one dismiss its food this way by totally overcompensating on the spices. While I won't be running back there any time soon, I would like to try the burgers, burritos and salads I saw whizzing by.",
    "rating": 2.0,
    "rated": {
      "useful": 6,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "IR1fRi0fC_Xk0WPFPBgRoQ": {
    "date": "3/22/2012",
    "text": "Delightful restaurant in the heart of Soho.  Great menu with rotatingspecials, excellent service staff.  The free wifi is a nice bonus.Always one of my favorites in London.  The restaurant can get a bitcrowded, cramped, and noisy, but hey, you're in Soho![Note: this place is fully vegetarian with several vegan offerings.]",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T0JSQjSRCKWEL0ekiwl0lg"
  },
  "px0aaDCX4LrbXQooouMh0w": {
    "date": "8/29/2012",
    "text": "The food is OK, the atmosphere is better. I had a pesto pasta which I enjoyed but it was swimming in oil. The menu needs more creative low-fat options to choose from. I actually thought the service was pretty friendly. Prices are a bit steep for what you get.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xSNh367shonkguxTN-1GBg": {
    "date": "9/28/2009",
    "text": "Whenever I'm in London, dinner at Mildred's is a must. For a San Francisco guy it's really nice to be able to go to an amazing vegetarian restaurant in London. The Brits have gone a long way to eliminate the stereotypes usually associated with English cooking, but to me, Mildred's is the reason I will never ever make fun of British food again.I dare say they actually out-do some of my favorite San Francisco vegetarian places.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KyNlp_L4Db7XdFTd8sXXyg"
  },
  "WwIUjH8NG_B_NzFzlDFADQ": {
    "date": "1/27/2009",
    "text": "Yum yummy yum yum good for my tum tum.I went here with my sister a few months back and was really impressed. Both of us have been veggie since we were kids and our mum has spoilt us with great home cooked vegetarian dishes all our lives so it takes a lot to get us excited about veggie food. The place is quite small and does get busy quick so I'd book or go early. This is the only reason why the place hasn't got 5 stars. But saying that, if it was any bigger I think it would lose some of it's friendly and warm atmosphere.They have great sweet potato chips and the menu has a huge selection of tasty dishes. I thought is was well priced for what you were getting and overall it was a great meal out.Also, for you celeb spotters out there, Keria Knightly is often in here so keep a eye out in case she pinches a chip off your plate!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "harZYNwGkUagKPRqlT-PdQ": {
    "date": "11/18/2018",
    "text": "Went to Mildred's Soho in between the Harry Potter shows so we got there about 5.30 on a Wednesday - so no wait.  It soon filled up and was buzzy and lively.  The service was all very friendly and slick.The food was just incredible - every course.  The crispy Seitan is probably the best veggie food I have tasted in a long while.  The wine was so good too.  Wish I could cook like that - how about some cookery courses Mildred's??Planning to go back very soon!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfzuXcF33uNf1mmJuAL-Lg"
  },
  "cruSNQVN5tSAm8RsuvkL0A": {
    "date": "10/20/2018",
    "text": "When in Rome, do as the Romans - Mildreds seems to be frequented by locals and visitors alike but I'm not sure it lives up to the hype.  We went on a Saturday and for a party of two, managed to only wait 36 minutes when we checked in shortly after 5.  The restaurant was insanely busy throughout the night, with the queue never quite abating.  Despite every employee seemingly going full tilt, service wasn't the most prompt.  The food was fine, but it was served lukewarm.  The mushroom pie's filling was not hot and that was just a real disappointment, especially since the kitchen wasn't slow in putting out the food after our orders were placed - that makes no sense.  Neither the pie nor the vegan bangers and mash were really stand out dishes.  I've had better vegan dishes elsewhere.  I probably wouldn't come again unless it was convenient and the wait was short.  I'd feel guilty about writing this review but I highly doubt my words will have any impact on their popularity.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Kp54XWcYCUu_SkXoV-FLfw",
        "caption": "Photo of Mildreds - London, United Kingdom. Mushroom pie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kp54XWcYCUu_SkXoV-FLfw/o.jpg"
      },
      {
        "img_id": "NJ6tfTpidpDx9DPD8jFmGg",
        "caption": "Photo of Mildreds - London, United Kingdom. Vegan bangers and mash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NJ6tfTpidpDx9DPD8jFmGg/o.jpg"
      },
      {
        "img_id": "CAGrDATWwG-W6U7JR_Qehg",
        "caption": "Photo of Mildreds - London, United Kingdom. Brownie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CAGrDATWwG-W6U7JR_Qehg/o.jpg"
      }
    ],
    "user_id": "1Ap_OW4nUq5njHTCFJxspg"
  },
  "A2rsAZ8Ns2ksZdtGRfYy4A": {
    "date": "9/5/2018",
    "text": "I went here for the first time about a month ago. Funny story though, my group and I had tried going to this location two years ago when we took a trip to London then, but the wait was over an hour and we didn't want to wait that long, so we went somewhere else. Now, flash forward to this year, we tried going here the first night of our trip, and the same thing happened again, and we left to go eat somewhere else. But then, we tried going the next night (the night this review is about) again a little earlier, and we didn't have to wait. So long story short: book ahead of time or get there before 6pm.LOCATION: This location is in Soho, and it's pretty near Oxford and Regent Streets, as well as Piccadilly Circus. It's a fairly nice area. 4/5ATMOSPHERE: The atmosphere is alright. We were sat in an upstairs area and it was kind of bland and stuffy, but the downstairs area looked a bit nicer. 3/5SELECTION: It's all vegetarian, and they label which items are vegan or can be made vegan. They serve a nice variety of different cuisines too. 3/5WHAT I GOT: I got the Soul Bowl, which includes carrot, beetroot, quinoa, cherry tomato, dates, parsley, mint, kale, avocado, shiitake mushrooms, cashew cheese (I got it on the side), mixed sprouts, seeds, and sesame dressing. It was okay, but nothing worthwhile. It didn't taste as fresh as it could and the flavors of the vegetables weren't that vibrant. I liked the variety of ingredients though. I would still go back and try something else though. 3/5SERVICE: The service was okay. The employees were nice, but it was just pretty standard service -- nothing stood out -- so that's why I just put an average rating. 3/5",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lcuHRwVPC4JtUhZOK8LNxw",
        "caption": "Photo of Mildreds - London, United Kingdom. Soul Bowl (12): carrot, beetroot, quinoa, tomato, dates, parsley, mint, kale, avo, mushrooms, cheese (on side), sprouts, seeds, & dressing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lcuHRwVPC4JtUhZOK8LNxw/o.jpg"
      }
    ],
    "user_id": "UaZEyRmwLTsAbCRylWJvtA"
  },
  "GIfi1WhNEjHoioCoNjMrqg": {
    "date": "7/15/2018",
    "text": "For starters we had:Salt and pepper tofuSpicy aubergineExcellent starters to get you wanting more.For mains we tried:Stir fried vegetables! This comes with rice too.And it was very tasty. You wouldn't tell it was vegan or vegetarian. It had rich flavours and the portions are very decent. For dessert:Apple and pear crumble with a creamy topping!!. That was a scrumptious meal and we couldn't afford to have any more. This is an extremely busy place. Only just realized that there are so many around who appreciate vegetarian food in London. There can be a good 15 to 20 minutes of waiting time, but the bar is always good to entertain you. They have a whole load of vegan/vegetarian drinks. So feel free to sip something while waiting to be seated. I would strongly recommend this place to anyone.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EdwNLIIqFOP_5nzazdWQhg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EdwNLIIqFOP_5nzazdWQhg/o.jpg"
      },
      {
        "img_id": "3tO7I9umlO0hbSp29-q7wA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3tO7I9umlO0hbSp29-q7wA/o.jpg"
      },
      {
        "img_id": "E00xVgzt3-bVBOGRsFU-xg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E00xVgzt3-bVBOGRsFU-xg/o.jpg"
      }
    ],
    "user_id": "3srPnKmmrWcdX-ZRrXEuRw"
  },
  "Ek0rCzKIcb6VJoe0LjpdCg": {
    "date": "9/1/2018",
    "text": "I visited this location for dinner with a friend and we went there early to avoid the crowds. We were served pretty fast and the menu was pretty clear about the vegan options (which are in the majority)My dish was the carribean jerk tofu which was delicious, and we also ordered a side of fries, which I really enjoyed as they were thick cut.We managed to find room for dessert and had the raw raspberry mousse cake (not to be missed) and the hibiscus wanna cotta which was also great.While we were there, we did not feel rushed to leave and the service was good. Not amazing, but it did the trick.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AI3_c5tbvwRI9JQJqt00tw"
  },
  "u2ow7kHPRaRGPS0jZdJsZQ": {
    "date": "9/14/2017",
    "text": "I used to really like Mildreds but I'm removing a few stars because I just really don't like their food anymore. I probably won't eat here again. The vegan options were boring and tasted equally as boring too. I had the soul bowl this time and wasn't impressed. The kale included in the dish was marinated in a sauce with odd flavor too, it was almost like they just dumped soy sauce on it. I also ordered the fries with the vegan basil mayo--seemed like they used the vegan mayo recipes from the early 2000's and not today, total waste of calories.All in all, not my favorite. Plus, the waiter was a snot to us the whole time. This is something that's happened to me before while dining at Mildreds. No thanks!",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8hDEUpRsqXzFnWbJglTV_A",
        "caption": "Photo of Mildreds - London, United Kingdom. Vegan Soul Bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8hDEUpRsqXzFnWbJglTV_A/o.jpg"
      }
    ],
    "user_id": "4iOc4Fo-h6gZ-2zAJEM78g"
  },
  "0ZosxTKWN6MlUWwCemrI5Q": {
    "date": "4/5/2018",
    "text": "Mildreds is a very popular restaurant and therefore me and my mother had to wait half an hour to be seated which was a bit annoying but the staff was friendly and apologetic about the wait.We were quickly being served and I ordered the fake chicken burger with fries. I must say that it was not to my liking, the burger, since there was too much vegan aioli and not much else as filling except a few sad leaves of lettuce. The burger reminded me too much of a McChicken from McDonalds, but of course if that's what you like, then you'll love it. The fries were really good though. My mum had an indian style type dish that she enjoyed.I am not sure we will choose this place again, the noise in there was incredibly loud as well, making it difficult to have a conversation.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6QWQX-hNDSOM6vx9pKZbXw",
        "caption": "Photo of Mildreds - London, United Kingdom. \"Chicken\"-burger with vegan aioli and fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6QWQX-hNDSOM6vx9pKZbXw/o.jpg"
      }
    ],
    "user_id": "eD30xKVLSpcrCjFqkSMgNw"
  },
  "djpCAWUf9NS10DyU6cGbgg": {
    "date": "3/2/2018",
    "text": "So, it took an hour queuing to get a table, so we sent one of the girls ahead to take on the task!!We went here for a friends birthday, two vegetarians the rest more than happy with veggie food and have had quite a bit before.Firstly the drinks menu is a bit random and limited, we requested drinks and they did take a bit of time to get the drinks to us.  Although the server herself was very smiley and happy to help.We ordered some starters, which were distinctly average.  The grilled Manouri cheese was okay, the guacamole was quite tasty to be fair, however really don't know what was going on with the hummus and bread, that really wasn't that great at all.We ordered more drinks and they came back a bit of a while later and two were wrong, but save messing about we said it was fine, leave it as is.The mains were really not worth waiting an hour in a queue for.  The burrito was bland and I've honestly done better at home when in a rush, just a heap of black beans and rice with little flavour and lacking fresh ingredients.The panko mock chicken was rather the disappointment, it was way over cooked and one of the girls had to make a concentrated effort to get her fork in!  Chocolate brownie and ice cream for pudding was nice.I by the end of the meal was sweating my bottom off as they sat me centimetres from the fire, and was left feeling a bit deflated that this was what we got.As an average place it would be fine, but the rave OMG reviews just didn't ring true at all with this place.  I won't be returning  at all as it's not worth the faff and shoulder sagging food you get served.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-QDul2DubJgo8UxRO_SiAQ",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-QDul2DubJgo8UxRO_SiAQ/o.jpg"
      },
      {
        "img_id": "gynq7aZqAsrliS4P4OQhUg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gynq7aZqAsrliS4P4OQhUg/o.jpg"
      },
      {
        "img_id": "IAk-aiOKIg6pC_RztUoeSg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IAk-aiOKIg6pC_RztUoeSg/o.jpg"
      }
    ],
    "user_id": "tEtGghKHbFs8acm9SIyXUg"
  },
  "SCaNUR-wUKwoowdd7GX2Yw": {
    "date": "8/9/2018",
    "text": "Tiny, delicious, not overtly hipster veg spot.Whatever you get, just get a side of fries. You won't regret it. Nice ambiance and good sized portions.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RmxuIIpYDy0AI_Mch4VqjQ"
  },
  "O95Cer9UCp1w3gyqb5qCTw": {
    "date": "11/12/2018",
    "text": "Mildred's never disappoints. The only thing is having to queue for a table due to its ever increasing popularity. The food is fantastic, the menu varied and imaginative, and the people who work there are always friendly. All four branches are great, especially the original one in Soho and the one near Kings Cross.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4aP_8kbVQ7oyZ8lJGGqy0A"
  },
  "dj04CbNKzvs28k-0t7oCag": {
    "date": "2/17/2018",
    "text": "The burger with chips and peas was the best!! And the meat pie was so realistic, I love this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mCWrightgMbTJsjYFL1wrg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mCWrightgMbTJsjYFL1wrg/o.jpg"
      },
      {
        "img_id": "pEMtwLL7-zxs1MpFshqlUg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pEMtwLL7-zxs1MpFshqlUg/o.jpg"
      }
    ],
    "user_id": "jpJulOgacADiaStHDtu6pg"
  },
  "3TxIxb6UZ7KsYet8Jp7irA": {
    "date": "6/26/2018",
    "text": "Good vegan food, but I've had better. Excellent cocktail selection. Little to no beer selection. The service is good. Noisy for dinner! Don't go if you want to have good conversation. Limited space and most tables are shared.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ19tvbCD3SEKPi3-klPMQ"
  },
  "I_Q2qQKGMGvo5LIL8lm_vQ": {
    "date": "5/18/2018",
    "text": "Came here for dinner earlier this week, and while the food was good, the service was a bit weird. We stood around for a few minutes without being greeted once. Not by the bartender or anyone who was awkwardly staring at us, as we looked for a host. We were asked if we were okay with a communal table, as a 2 top wouldn't be available for 20-30 minutes. We said that was fine and sat down at an empty 4 top. I was facing the restaurant, and within 5 minutes of being seated, two 2 tops were vacated. Okay then. We were served promptly and the food was good, although days later, I cannot for the life of me remember what I ordered, besides the dumplings as an appetizer. We were headed to the theater after our meal, so when our plates were cleared and we were asked if we wanted dessert, I declined and asked for the check. Instead of the check, a different waiter brought dessert menus. Okayyyyy. Once he came back (he literally dropped them and then scooted away), I asked for the check again, paid and left. All in all, if randomness is your thing, you'd probably like this place. It was also super loud, as the restaurant itself is very small.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1h3z7QnZx_Eoyvhbucevlg"
  },
  "5wgTpmChpPRBght9NF82Eg": {
    "date": "5/22/2018",
    "text": "I have been stalking Mildreds and planning my order since we booked our flights ten months prior to our trip. My husband and I went to the UK to celebrate our 10 year anniversary, timing our stay so that our actual anniversary day was spent in London proper with an upscale dinner at Mildred's in Soho. The thing about Mildred's is that there is often a very long wait, as they don't take reservations, and there is hardly any room to stand and gawk at the outcoming dishes. I'm here to tell you, it was worth every waiting minute.We began our meal with the Grilled Artichoke Crostini, perfectly cooked artichoke hearts drizzled with lemon over chargrilled rustic bread. However, the star of the show was the labneh, a yogurt-based cheese that they have veganized. It was so creamy and fresh I nearly licked the plate! That and that alone would have been worth it!For our entree's, I choose a Katsu Curry Chick'n, served with forbidden rice and sensible green vegetables. My husband enjoyed the burger, along with a sizeable serving of sweet potato fries. While we waited, I was so excited and eager to be there that I chatted up the hostess after she kindly remarked on my sequined dress. Though Mildred's is upscale casual, that wasn't going to stop me from glamming up for our anniversary night! I told the hostess how much I had been looking forward to our dining there, and that it was our anniversary, and after we sat she brought us two glasses of bubbly as a bit of an anniversary gift! It was so very sweet of her! Mildred's absolutely lives up to the hype. They are worth every bit of the street cred they get from vegans and carnie's alike, and my only complaint is that they are not in Las Vegas where we live. It was a life-changing dining experience!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G4-0IiHDfhsuCM4x1XIh5g"
  },
  "sT9rqEkVZ9VgrfqIGlW9lg": {
    "date": "9/26/2017",
    "text": "I really wish I can bring this place to New York.Although I am not vegan, I love vegan food - just to feel less guilty from consuming calories, haha, but this place was amazing. We straightly went to this restaurant right after we arrived in London; most of other places were closed too. Although it was quite late, the place was still crowded. I had japanese eggplant dish when my friend had mixed thai noodle. Both dishes were great. We saw other tables having desserts and wished we had room for them too. Next time, I am definitely getting their desserts!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2qlwfs7lbOU6fTUwdDMTA"
  },
  "N1F87UZq1xSkuc1ETGCLLw": {
    "date": "10/24/2017",
    "text": "I dined at Mildred's on a Saturday and it was seriously bustling. They don't take reservations and there is a good queue of people waiting when you arrive. We were told that we would have to wait 1.5 hours until we could be seated and that we would have to wait either by the bar or next door. We choose the bar which turned out to be a great decision as the cocktails were amazing! I highly recommend the bourbon splash and old fashioned something-or-another. They were also really reasonably priced (only £7.5 for a cocktail in central London). I guess the make up for it by always being busy and requiring patrons to wait by the bar.I really enjoyed the food too. I had some tofu and white bean sausage with mashed potatoes and other veg (basically a vegan bangers and mash). I really enjoyed it and the atmosphere was great. The only downside was the service, but even so, it wasn't thaaat bad (still 5 star worthy). The waiters didn't pour the wine or let us try it before hand (it wasn't a screw cap!) but luckily it was fine. We also had to wait a while for the bill etc. If they sort this out they'll really be a spectacular vegan restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hy2vPpM2E6GudvIHcBSqGA"
  },
  "CVn_FavwuyTkNnJJpjJXfQ": {
    "date": "4/8/2018",
    "text": "Saturday lunch you need to book. Packed out on all floors. We had booking. I was sceptical about a wholly vegetarian resturant but this is excellent. The menu is not huge which is a good sign. The food was top class in taste and presentation. Excellent wine selection too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YuxY5_UlePjWI6y7zy7Qvg"
  },
  "IiPShoF1lVJahMn2AuppaQ": {
    "date": "6/25/2017",
    "text": "Bring your appetite and patience because the food here is excellent with large portions and it's a bit of a wait for seating. We waited about 45 minutes for two seats and ended up sharing a table with another couple. We ended up ordering the following items:APPETIZER:Chargrilled roman style artichoke with crostini and lemon aioli - (4 star) £6.00. It was definitely not skimpy on the aioli. I would have liked more crostini.  Maybe if they allow ask for extra. Very flavorful. ENTREE:Sri Lanka Curry - (5 star) £12.00. MUST ORDER!! This dish contained flavored basmati rice, curry sauce, green beans, butternut squash with roasted peanuts. Doesn't that make your mouth water?!?! It was so good, I didn't want to share with the hubby. Packed with flavor. Mushroom and Ale Pie - (3 star) £12.00. This was my hubby's dish. I tried one bite of it and did not want another. Although this is a traditional English dish. It is one that I would pass. The flavor of the mushroom with sauce left a bad taste in my mouth. Since I'm not a fan of phyllo dough. It was a double fail. Don't get me wrong my husband liked the dish. It's an acquired taste. You'll either like it or not. DESSERTChocolate hazelnut brownie with salted caramel sauce and ice cream - (5 star) £6.00. MUST ORDER!!! This is truly a decadent treat, but worth the calories. Overall it was a great dining experience. I would have preferred to have our own table. The other negative item I would say is how close the table are to each other. I understand you want to get more seating, but seriously it's a little ridiculous. People if you need to squeeze between 2 tables please place your behind towards your table. I don't need your rear end all up on my food area!!! As for noise level. Not an intimate place. Especially when you can hear a guy telling his date that he is more than willing to sue his family in court and be loud and proud about it. This is more of a hang out, drink up and eat place.",
    "rating": 5.0,
    "rated": {
      "useful": 14,
      "funny": 10,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "jnfJ0UHZ-NxM1sHIx2Vajw",
        "caption": "Photo of Mildreds - London, United Kingdom. Chocolate & hazelnut brownie with salted caramel sauce and ice cream (MUST ORDER)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jnfJ0UHZ-NxM1sHIx2Vajw/o.jpg"
      },
      {
        "img_id": "R75ZXa0T6MYiPNUIEpc_uw",
        "caption": "Photo of Mildreds - London, United Kingdom. Mushroom and Ale Pie (***)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R75ZXa0T6MYiPNUIEpc_uw/o.jpg"
      },
      {
        "img_id": "6pZchrIklgc9kznBKvYJlg",
        "caption": "Photo of Mildreds - London, United Kingdom. Sri Lanka Bowl (MUST ORDER)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6pZchrIklgc9kznBKvYJlg/o.jpg"
      }
    ],
    "user_id": "zjtQJ8eYWVedJpWB2sFB2g"
  },
  "stTsAHdF76W4b9dKOs_tjw": {
    "date": "9/30/2017",
    "text": "Bustling Vegan Restaurant.  I am not Vegan but I tend to try Vegan/Vegetarian restaurants when the opportunity arises - We were traveling with our daughter who is currently Vegetarian.I had the Vietnamese Bowl.  Essentially a high fidelity Vegan rendition of a Vietnamese Beef Rice Noodle Bowl.  The \"Beef\" was flavoured  just like it would in a Vietnamese restaurant, great texture and flavor.  The Vegetables were very fresh and the Noodles were well done.My daughter had the Chicken Bowl.  I had a piece of the fried \"Chicken\" and the Almond Cream that accompanied the dish- it was good.  The \"Chicken\" did not get as close to the fidelity achieved on the \"Beef\" but it was satisfying.The Soul Bowl was on the sweet side - for a main course.  The Smoked Tofu burger was accompanied by Sweet Potato Fries that were cut a tad too big.Overall good Vegan meal experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hr-xuYeZZ3dFZvYPGcqbKA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hr-xuYeZZ3dFZvYPGcqbKA/o.jpg"
      },
      {
        "img_id": "gFr0oQXdI_m8SIHJvZlmbg",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gFr0oQXdI_m8SIHJvZlmbg/o.jpg"
      },
      {
        "img_id": "DiNFk1bdi9MWiYT5DScIzA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DiNFk1bdi9MWiYT5DScIzA/o.jpg"
      }
    ],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "ZQAbaTn3-GJp_CHt9E_g_w": {
    "date": "6/13/2017",
    "text": "Our first meal in London did not disappoint. I was ecstatic to see a vegetarian restaurant doing so well, there was approx an hour wait when we arrived that Sat night and it was packed all night. It's a great place to bring a date or hang with a group of friends. Although it can get very loud, which is to be expected. Even though it was busy, it felt like our meal wasn't rushed. The atmosphere at their Soho location was much more fun and pleasant than the other spot. Since it is a veg restaurant you need to be mindful of some of their dishes, since it contains eggs or dairy. I loved their beet burger and ceaser lettuce cups the most :)Oh and the chips, can't forget about that!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "1KMt6fdKcEAdStjeJqk6iA"
  },
  "rhy8o0QdkYFww-LpfXQNgw": {
    "date": "8/29/2011",
    "text": "My cousin was in town visiting and since she's a vegetarian, I wanted to take her to a vegetarian restaurant. Mildred's had good reviews, so we decided to give it a go. I was worried we might have to wait a while since it was 7pm on Friday night, but they were able to seat us right away.We started with the artichoke crostini and spinach ravioli. My cousin and her friend seemed to enjoy the burrito and stir-friend asian vegetables that they got for their main courses, but I thought I was the winner with the risotto cake. The mint was a really nice and unusual touch. The highlight though had to be the desserts. We split the pavlova and the chocolate truffle cake. I think we pretty much licked out plates clean.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gXT_DczvlqDVqJCx4QEa9Q"
  },
  "rBj2o3QoYz5nbrYyd5wM-g": {
    "date": "4/20/2013",
    "text": "Cramped and  not very tasty- the  burger was decent but this is basically a  pricey trendy soho restaurant with a  friendly host - bettter off at the SUBWAY",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9U4ItWl_1UuP1yGqSnoy3w"
  },
  "ilToP9Eh35mAh8Rp2VL7PQ": {
    "date": "5/5/2011",
    "text": "My party of three walked around Soho for a while, looking for places for dinner that would satisfy each of our tastes. It was close to 8 by the time we ended up at Mildred's, so we figured, might as well make a stop here.Our food was great - our table had a mix of the risotto cakes, the Ethiopian stew and the veggie burger of the day, plus a side of their sundried tomato cornbread. Can't say I was very impressed with the sweet potato chips - they weren't bad, of course... I just don't get the hype. Overall though everything was quite tasty.Agree with other Yelpers who say that the service isn't so good. Staff are very brusque, which makes them seem snobbish. And a single smile every once in a while would be nice. Also the place was packed (it is a tiny little space, after all) and REALLY loud (the key to making yourself heard is NOT to talk louder than everyone around you, folks - stop perpetuating the problem) but certainly cosy, I guess.Expect to climb over your neighbours, their food and their tables in order to reach yours. DON'T expect to have any sort of private chat, as your partner probably won't be able to hear a word you're saying unless you yell it across the table, thereby including your surrounding diners in the conversation by default.(Collateral damage or a blessing for the eavesdropper in all of us? Well, you'll just have to come to Mildred's and decide for yourself.)P.S. Mildred's offers free WiFi, but you need to have a password, which I think may be listed on a sign somewhere on a wall. Might want to investigate that one.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "I_h3x_bAFjEgtBPbBMLg4w"
  },
  "VD8yPtE1TpSbmerRycNBjQ": {
    "date": "12/21/2010",
    "text": "I don't know how Mildred's manages to make vegetarian/vegan food so tasty, but I absolutely adore their selection of fresh and meat-free dishes. The menu changes all the time to keep up with seasonal food trends. The wine is fantastic. My favorite dish was the butternut squash ravioli that I had one time. It's a teeny tiny place near Soho/Piccadilly and it's highly recommended!!!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dGND9DDQe5L6Lli2TolF1A"
  },
  "Zg-XcZyQiOtTB-n4ukd83Q": {
    "date": "4/26/2009",
    "text": "What a wonderful, bustling and classy restaurant in the heart of Soho! When we arrived, the place was overflowing with people busily mowing down on fragrant foods but that didn't stop us from taking our spot in line and waiting our turn to have a seat. The wait was nowhere near as long as I had anticipated given how busy the restaurant was.It was Fall when I visited and I couldn't tear myself away from Mildred's seasonal specials board. I ordered the Pumpkin Coconut Curry Soup (see pics) and Pumpkin Ravioli with Sage & Brown Sugar Butter. My stomach is rumbling just remembering that meal - it was that good. Great portion size and speedy service considering how many people were there. Would return in an instant - I wish we had straight up 'cool'/non-weirdo veg restaurants like this in Toronto!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1AvW6fbyvr527KmKnPCV9w",
        "caption": "Photo of Mildreds - London, United Kingdom. Pumpkin Ravioli w/ Sage & Brown Butter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1AvW6fbyvr527KmKnPCV9w/o.jpg"
      },
      {
        "img_id": "_CmVmOzllaWIq2lDY1xobw",
        "caption": "Photo of Mildreds - London, United Kingdom. Mildred's at night",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_CmVmOzllaWIq2lDY1xobw/o.jpg"
      },
      {
        "img_id": "7vfFHrOgfmvBv7CpR6lLGg",
        "caption": "Photo of Mildreds - London, United Kingdom. Pumpkin Coconut Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7vfFHrOgfmvBv7CpR6lLGg/o.jpg"
      }
    ],
    "user_id": "JnPIjvC0cmooNDfsa9BmXg"
  },
  "iumbgT4SZrB_5N-y98LBMg": {
    "date": "11/22/2008",
    "text": "Mildreds is an institution among vegetarians, and food lovers alike. It's sat in the same spot in Soho for 17 years and is incredibly popular. When i used to think of specifically veggie restaurants I'd imagine skinny women picking at salads, or smug hippies feasting on beans. OK, well you do get some of that, but in the least offensive way. The downside to Mildred's is that you can't book a table and it gets VERY busy, but you can sit/perch in the bar area and wait for a table to become available. Once seated you are presented with an impressive menu, that gives vegetarian and vegan options, and a daily changing specials board. I always have the full three courses when i go, my recommendation being the warm beetroot salad (£5.25) to start, the sweet potato and tomato curry (£8.50) and for desert the profiteroles (£4.75) are the most amazing i have ever tasted. You can sip on a nice organic cider, or they have a vast selection of juices and smoothies. Prices are seriously reasonable, about £20 a head, as although you may leave full up to bursting point, you really feel like you've eaten good food and feel satisfied. They also offer a take away service that is incredibly popular at lunchtimes. Recommended for vegetarians and food lovers.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3lplguliIcubzEjUIEi-ew",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3lplguliIcubzEjUIEi-ew/o.jpg"
      }
    ],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "0pevdHeFDt9OOjv7oxyvsA": {
    "date": "2/22/2011",
    "text": "While I wasn't a fan of the building itself or the decor (this place was tiiiiny, yo), I really really enjoyed the food. I had one of their daily veggie burgers and sweet potato fries. I have an absolute undeniable 24/7 craving for sweet potato fries and THESE were amazing. The food was so filling, which was good because I was starving. So much so that when the waitress asked 'do you want to know what the vegetarian burger special is?' I said nope, just bring it out....THAT hungry. Mildred's did well, considering I'm usually a 'where's the meat' type of girl.I left, £10 lighter, feeling 5 lbs. heavier and vowing to come back and investigate some more of their food. Maybe not on a Saturday at lunchtime though, a little space would be great :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "aC4Ir9ABzIOrpGN622QriQ": {
    "date": "3/6/2011",
    "text": "I have been a couple of times and feel disappointed. I say this as everything I have eaten in there I know I could have made a lot better myself or know of other people that can cook it a lot better. Vegetarian food needn't be boring, I am not someone who has to eat meat at every sitting either but when I pay for food no matter what is in it I want good food. Mildred's is a place I feel was once somewhere wonderful but now is severely lacking on many levels when it comes to the food. I shared some homemade chips and basil mayo. They were ok, but not incredible. I followed this with a teriyaki vegetable and tofu stirfry which was rubbish. I had one singular leaf of pak choi amongst big chunks of onion, leek and broccoli all sat on some brown rice. There needs to be more chinese greeens in here and not just leeks in every mouthful. The tofu was so so, the sauce not punchy enough so the tofu just tasted like lightly soy flavored mush. My beloved had a detox salad with goats cheese which was pleasant but overpriced at 9.00. We decided to share a crumble and custard and I was severely disappointed in this. The custard was soy based but was thin and tasted like ricey dishwater. There was a distinct lack of vanilla. The crumble fruit tasted lovely but it was cold! By the time my meal was over I was enjoying the company of a friend as it was her birthday but inside I felt slightly sad that she hadn't experienced better food especially as it was a birthday meal and she doesn't eat out all the time. But I feel more irritated that a place like Mildred's had such rubbish choices on the menu and meals that could have been a lot better and didn't leave diners feeling they could have made something better themselves. My beloved was especially excited about Mildred's and has been raving about it and she too felt as disappointed with the food as I was. She has now resumed her growling about the fact I went to Viajante too. Seriously if I don't take her soon I am going to have a bitten off ear or will be forced to eat in Mildreds again. Yes the food really is that naff in there right now.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qpizN4qm6h5-NATSmIYW4Q": {
    "date": "1/9/2014",
    "text": "One of my London vacation highlights. I had my birthday dinner here and it is a lovely place. Great food, great atmosphere, awesome service and most importantly great food! I highly recommend stopping by if you're in the area. Delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4WFaNqRbq0LzTCI_iuWVQ"
  },
  "G5CWOB-3dqawIEhBfTAhHA": {
    "date": "6/11/2015",
    "text": "Great food. Crappy service. The hostess was very short and dismissive. I got turned away for a table because I only wanted to have dessert and was told repeatedly that once I have received the dessert, I have to leave the establishment. Zero tact. Uncomfortable experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8fpaf0R5Fz5NIkbGW4TYA"
  },
  "gNWc8lzifOFGlXxTbPLxJg": {
    "date": "6/22/2010",
    "text": "Right just to get this clear i'm no veggie hippy, the closest i get is going to glast and sitting pissed in the stone circle.I thought oh what a nice place to go with a veggie having heard loads of good things about this place.  The fact that you can't book and it's always busy also i thought a good sign.so...was impressed with the menu, i didn't realise just how many things you could do with a carrot?I ordered the asian vegetable stirfry which was ok but really just consisted of spring onions and a bit of brocolli.  The fake sausages look alot better and i had slight food envy over them :(the service was pretty shit we had to wait ages for our meals and i felt a little scared by the waitress!  Clearly no time for niceness!Erm....take me to bodeans QUICK!!",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "HCuX6SdkheJ-mqbkaLQP5A"
  },
  "LbHOcHonvZ1bHoyWGKRqtQ": {
    "date": "6/26/2010",
    "text": "This place is has an understated facade, which is a good thing, its like its trying to keep a good thing under wraps. So i felt even better for arriving. Straight over to the bar while waiting for friends. Its quite cramped at the front where the bar is but i think that added to the atmosphere. There are some lovely tables that look out of the window on to the street filled with pedestrians mainly, the scale of the street is quite intimate which gives it a specific sense of place.Pushing past the bar the space opens up to the restaurant which has a huge sky-light that makes it look ten time larger. You have to queue for a table but once youre seated just one look of the menu and you know youre in for a goodun. The service, highly attentive and pally type friendly in tune with the relaxed decor too. Food arrived in good time, well presented and clearly put together with great care.thinking back on the experience im changing this review from four as i write to five - there is simply nothing to complain of.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "1Ab6t3mmUauabPJwW0LZow"
  },
  "wDMFetK-ETJll7g-CAHstQ": {
    "date": "9/26/2012",
    "text": "Delish veggie/vegan food with generous portions. Everything we ate was so flavorful and savory, meat never crossed our minds. The staff were SUPER fun, attentive, and did a very cheery \"happy birthday\" song for my friend whose birthday we were celebrating. There is a wait even for weekdays so get there early!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6ps_81rqwpgRnj2DCf7xcA"
  },
  "HAfTUkAR_7TIHeVz_kyLuA": {
    "date": "10/12/2013",
    "text": "A real find! Lots of choice, generous portions and lovely food. The sweet potato and cashew curry is brilliant!The staff are friendly and attentive without being over the top.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6MQJG4o_QHLYuKaffCAHw"
  },
  "XkoWd88XUnHUudTEWoFlzw": {
    "date": "6/1/2010",
    "text": "The food is fantastic.  Typically I'm very picky about veggie burgers but the aubergine and leek burger sounded too good to pass up and boy it was tasty! Too bad it isn't a permanent fixture on their menu.  My friends had the stir-fry and pumpkin filled ravioli and both said they really enjoyed their dinner.     My only gripe is the seriously lack of bar/ waiting space.  We waited about 15 minutes for table and we were constantly moving to avoid being in the way of other patrons and wait staff.  The service is fine, the price is right and the sweet potato fries are amazing!  Mildred's is a must for any vegetarian and meat eaters alike.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "IhtATC36WJSuOXRXQbhQ1w"
  },
  "wLv4K77QRWHxadWmEtb59A": {
    "date": "10/10/2012",
    "text": "Absolutely amazing vegetarian food.  I have been searching for a place like this!  I personally hate all the fake meat dishes that seem to becoming so popular in vegetarian food. Mildred's focuses on bold flavors through its sauces and spices and doesn't feel the need to include the fake meat, because its vegetables and pastas can stand alone. DELICIOUS. I wish there were one in NYC or LA....",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDrtcseOagsZ4xbWF2lD7w"
  },
  "frYdpQZoR1r1LFRIOj7h1g": {
    "date": "10/17/2012",
    "text": "Was rather impressed with this place! Been hearing loads about it and went for the first time just last week. I had the tostada and ravioli to start and then we shared a veggie burger with top sweet potato fries. I also had a yummy soy/maple syrup shake which hit the spot!  Slight improvement points could be made for the burger (slightly bland) esp considering how pricey it is, but that's a small niggle. Happily would return x",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qSQ0nB8GdTIl1c4B1GG8YA"
  },
  "TaFc-vMA61WA7Nmx1FAIUg": {
    "date": "9/27/2010",
    "text": "Great place with a fab (though loud) atmosphere. Thumbs up for serving real food, the tagine was flavoursome, the burger was great and filling, and the ale pie won over both my veggie boy and a meat loving friend. Only wish that I had had room for pudding!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fMGxW5wUbYvvrZOaiLJeeA"
  },
  "rsKHGbjzwKits9u_mN7fnw": {
    "date": "6/23/2010",
    "text": "It's been said before but it's worth repeating...it's crowded and they pack you inif you're here for lunch past 1.10pm you won't get a tableit's all very worthy and non-corporate (perhaps a tad holier than thou)And yet I, the worshiper of being able to get a seat to eat my bacon sandwich at, am giving Mildreds 5 stars. because they do what they do well, becuase the staff although occasionally more laid back than me are never less than polite and because i could live on their sweet potato fries for the rest of my life.And becuase i have too many veggie friends to ignore the fact that mildreds prove that veggie food can be tasty inventive and bad for you.Yum",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XI0z6SrZTFpYjk0AStCoNA"
  },
  "sD3MwU9i23BHn2xT07rcQg": {
    "date": "9/14/2013",
    "text": "Have you ever been stoked for a restaurant from all the hype but then realize that it is nowhere near your expectations? Mildreds is your \"let-downer\". I really want to like this place but it's way too crowded and somehow completely failing on the flavors. It's mediocre at best and the staff are quite in a hurry. Don't believe the hype!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y6PB-9rYHuSG0L0ONmzNQQ"
  },
  "2XNLaP35zt0WPoSRE5GK3w": {
    "date": "1/26/2016",
    "text": "Was here in December 2015. Burger was delicious, great juices. Small cosy place. Def will come back when im in london!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AjheqlPzneC7_lI5Wa_wqg"
  },
  "LWieMQqOLsd_uu5XbUkXGA": {
    "date": "3/6/2015",
    "text": "Last night I tried Mildreds for the first time after a couple of friends recommended it and It was pretty good. I brought a couple of omnivore friends with me and they were pretty impressed too. We had to wait for our table for a bit and ended up in a corner table that wasn't the most comfortable, but the food and the organic wine made up for it!We had the Thai tofu as a shared starter, and each one of us had the halloumi burger, the mushroom pie and the tagine: everything beautifully presented and yummy. The portions are pretty big, so we didn't have space for dessert! The only downside was that they took quite a long time to serve the food, but other than that, I would highly recommend this place!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4lQeJ3n86rGBKuahS3Q6xw"
  },
  "-xwSGRbs5ZNgRK6aLqZihw": {
    "date": "12/12/2013",
    "text": "Mildred's is the perfect place to convince a meat eater that veggie and vegan food can satisfy.Speaking to the veggies: we all have those pesky carnivores in our life, right? The ones that say such annoying things as \"A meal isn't complete without meat\" or \"If we didn't eat them, they would eat us\". Take them to Mildred's and watch them quickly change their tune. With dishes such as bangers and mash, the food will feel familiar to even the most seasoned meat eater. The wonderful taste will do the rest of the job of winning them over.Speaking to the meat eaters: Y U no stop eating meat?Other bits and pieces: the restaurant can be extremely busy and you can have to wait for a table. They do not take bookings. Don't expect to have an intimate moment with a date. The table are about an inch apart.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-UKxnBJGfCfnTcq1eaTu0g"
  },
  "90k_ZIFBHBktHhpd9T1w-g": {
    "date": "4/22/2014",
    "text": "Mildred's is one of those establishments my DH and I had been dying to cross off our list. After deciding to cancel our plans (due to weather, boo!) to go to the Southbank World Street Food Festival, we headed there in hopes we'd get a table.Eureka! There was no wait time and we were seated immediately. But boy...was it cramped! Mildred's is tiiiiiiiiiiiiny, catering to a lot of people at once. I didn't mind because there seemed to be no rush to get up and leave - enjoy your meal at peace, patrons of Mildreds. Have a few drinks and relax.We ordered our drinks. I had a Bellini and my husband had the Daas Blond beer. Our starters were the Mediterranean platter and the chinese fried dumplings. Let me say, it irks me when starters arrive before drinks. That's a basic - it shouldn't be done wrong. I'd like to quench my thirst after a day of shopping, thank you very much.Our starters arrived and I'd have to say, they were a mixed bag. Absolutely skip the Mediterranean platter, which our server said was marginally better than the Mexican platter. The yogurt and beetrot dip was the only savior of the mixture. Everything else seemed like it came off the shelf at Tesco express. Sorry Mildreds - I've seen better. The chinese fried dumplings, however, were FANTASTIC. Served with an amazing sauce and kimchi, we ate it down to the last crumb. If we could have had ten more of those, I'd have been in heaven. Please, please for the love of God, order these if you want to lose your ever-loving mind on a brief trip to flavour town...Mains were an easy choice. I ordered the tomato and basil risotto cake while my husband opted for the burrito (without the guacamole, please). Both came fast and the portions were MASSIVE. Everything was fabulous so I cannot complain there. We said we wouldn't bother with dessert but ordered the chocolate and peanut butter brownie, served warm with ice cream. Oh my. That was a treat. I know brownies are played out but I couldn't help myself, reader. I needed it. There is no better marriage of ingredients than chocolate and peanut butter and this union did it justice.I don't quite get what people are saying about the service being piss-poor. Our server was friendly, helpful and sharp. Our only complaints were the tiny sizes of the tables and the cramped seating. The bill was also a little ridiculous. Over 70 pounds for a few drinks, some starters and mains? Come on! Any restaurant with a burrito as a main course has no right to charge such astronomical prices, in my opinion. The menu changes every so often to go with the season so we will be back! Great meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "25D2Dcv4njPbbO13gPOGnw"
  },
  "aLk5-T-GNETMqzKAmIUoBw": {
    "date": "11/11/2011",
    "text": "My husband and I were underwhelmed by our meal here.  He ordered the mushroom ale pie served with french fries and mushy peas, and I had the sweet potato cashew curry with basmati rice.  We also ordered a Bellini cocktail each. I did not think my food was bad, but it was something I could have easily made at home, and the accompanying tomato sambal had no heat whatsoever and was too sweet to eat.  My husband's fries and peas were fine, but we both agreed his mushroom ale pie tasted odd.  Our drinks were disappointing.  I've had many well-made Bellini cocktails throughout my life, and this was not one of them.  The sparkling wine that they used was harsh - lots of bite to it.  And the peach puree seemed to be lacking entirely, although the beverage did have a slight muddiness to it, which suggests they did add something, I just could not taste it.  Service was pleasant enough, but given how busy it was, it was a bit hard to grab anyone's attention.  The space itself was cute, and I enjoyed the artwork displayed on the walls. If in the area, I might give Mildred's another go, but I'd be just as likely to try out another vegetarian place instead.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NknWFPAxaGxx_OJIEYVXWA",
        "caption": "Photo of Mildreds - London, United Kingdom. sweet potato cashew curry with basmati rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NknWFPAxaGxx_OJIEYVXWA/o.jpg"
      }
    ],
    "user_id": "D3Os7pZg5YzCgtck0qv5hg"
  },
  "lwLD6Fiv-JQnIZSm8hUsgg": {
    "date": "11/6/2015",
    "text": "So unbelievably delicious. Best of the best for veggie food in London. Drinks are good too and atmosphere is nice. It gets mad busy so prepare to wait, but it's worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hi_tBwh_2yv6T1b0-KSJeg"
  },
  "QKvMP8w1dFoUl4lxakWFkA": {
    "date": "6/10/2015",
    "text": "strongly recommend panfried halloumi",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g6DjRG5GgH_ox1HnVvL8tg"
  },
  "uP62ydhlVZ6nYMR-hYSoug": {
    "date": "4/29/2013",
    "text": "Surprisingly bad service. From forgotten drinks, to wrong entrees being served, to a double charge on beer, to servers who couldn't seem to care, dining at Mildred's was chaos. We asked for 3 small plates to share starters, the waiter gave us 2, saying 3 was a waste. In general, the waitstaff were stressed, forgetful, and rude. One even walked away when I tried to order ice cream. When we asked again, she said the kitchen was closed. Seriously? You can't scoop ice cream?!?! Our food was ok, I've been a vegetarian for nearly 20 years, and found their food lacking; it was ok, but not worth the 30 minute wait. My risotto cake, suggested by the waiter, was in this awful horseradish cream sauce. I love horseradish, but this was tangy in all the wrong ways.Nearing the end of our meal, we were practically forced out as they were closing so early. (Returned to edit this back in--looks like it was removed by Yelp) I'm not sure why my comment in this post was deleted, but, we were the only multi-ethnic table there at Mildred's and they were rude. Seating people in front of us, good served to us well after people who'd ordered after us. In general, I only felt welcome when I (white person) came in by myself. When my friends joined me, Mildred's turned off the charm.Don't waste your time and money with this place.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_EXWOXFku5rCGD9QmG7YbQ"
  },
  "AHLZAFv328ssxWq3C7D6aQ": {
    "date": "1/7/2013",
    "text": "(For my 200th review, I was lucky to have a backlog of reviews to choose from, and am proud to recognize this excellent experience with a five star review!)Ah Mildred's. What a lovely place to have dinner, despite the bittersweet circumstances. It was former-London Yelp Elite (now San Francisco Yelp Elite) Eliza D's going-away dinner, and she chose Mildred's. A small group of friends, many of which were Yelpers, found ourselves cozied into this cheery restaurant to try our hands at the vegetarian thing.It ended up by complete coincidence that we all ordered something different. I wanted to try everyone's, but didn't, because I didn't want to have to share my burrito, which was hands down the best vegetarian burrito I've ever had, and one of the best Mexican meals I've had in the city. Prices are totally standard for London (I think we ended up splitting it out to £18 each, and we bought a bottle of wine in there), and quite good for the Soho/Picadilly area.I'd highly recommend calling for reservations, even for a small group. We were lucky enough to get in without one for an early Saturday night dinner, but I won't leave it to chance next time.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 0,
      "cool": 5
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "-uyAOw46l2iY7hlaJqptUQ": {
    "date": "7/7/2014",
    "text": "Upon entering the establishment I was pleasantly surprised with the natural light and cozy feel. There was enough seating to not feel too cramped and the menu looked great.I ordered the main course salad(there's only one) of which I have already forgotten the name of. Namely because it was terrible. For an extra 2 pounds they will give you four pieces of tofu - oh gee thanks! The salad consisted of 85% shredded carrot, 10% shredded beet, 2.5% nuts and seeds, 2.5% lettuce. Literally I could count the pieces of lettuce due to green not exactly blending in with all the orange. The dressing had a good taste albeit a bit too oily. I could not finish the meal having grown sick of carrot after the 20th bite. For a place rated this well I really expected more.Pick up your game Mildred's- a $16 salad needs to leave you completely satisfied- not disgruntled enough to leave a review. 3 stars because the other food items might actually be awesome.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9dhlLtQyb-dSVqQ17S0Ww"
  },
  "hCKUs_eo5EYUj-PpHFVqWw": {
    "date": "3/6/2016",
    "text": "Excellent food! Satisfies vegetarians and meat eaters alike. I had a creamy mushroom pasta with sweet potato chips and they were both really yummy.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5FjW18MKuRyaJY9SaR-f8g"
  },
  "YpONuSgLsShQbxQa0b0mgg": {
    "date": "10/15/2016",
    "text": "Great restaurant! I am a meat eater but their veggie sausage was awesome! We were traveling with a baby and they were super accommodating. I will definitely be going back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TtwX5srGZcnrKGmrtLw8yg"
  },
  "eIYt9hg7aDijYCiry4PD-Q": {
    "date": "10/15/2016",
    "text": "Lovely restaurant and staff. There was a long line when we arrived with a baby in a pram and the lovely hostess seated us immediately at a shared table in a lovely private dining room. The haloumi starter was incredible as were the tofu sausages and mushroom-and-ale pie and plum cheesecake. It was such a pleasant dining experience and the food (also the glazed beets with labneh!) was wonderful. Highly recommend!! The wait staff was just lovely and attentive and helped us carry the pram up and down. Excellent experience! Thank you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwBCNiaDvF9eh_uK6VVQ9g"
  },
  "xHmhsL8X5MCTfT2pTV4aSg": {
    "date": "10/6/2015",
    "text": "If you go to London, you have to try Mildred's! The food is wonderful, the place is lovely!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X4GdDHSdwgIE_APDErZKIg"
  },
  "nOV2iwbsNhiR6Yxph8ix3w": {
    "date": "4/3/2013",
    "text": "So... as a veggie, you kinda feel obliged to LIKE vegetarian restaurants.  So I did try, I really did try.But, the service was grudging; the noise level was unpleasantly high; the food was barely passable (standard wholefood mush); and the price way exceeded that of a \"normal\" good restaurant in this area (e.g. Cafe Gourmand next door but two).I did my best ..",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NeyRAM6UUStgvIhNUbBH9Q"
  },
  "zMx0o4izNlyh3OzmMKh5-Q": {
    "date": "1/16/2011",
    "text": "I was really excited to try this place after reading so many great reviews.  Unfortunately, for me Mildreds gets high marks for style but less for the substance.There is a buzz about the place and it is stylish.  The food looks incredible.  But alas, the staff were brusque and snobbish and my partner and I both found that our divine looking food was bland.  Mine actually gave me tummy ache because it was too rich.  Deep fried, breadcrumbed risotto cake does not pair well with a heavy cream sauce.Mildred's falls into the category of places that I don't want to write off on the basis of one disappointing visit, and would try again; but I am in no hurry to because there are so many new places to be tried first.  Such a shame.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZoN2Rv3PvrfN7fz76w0gmA",
        "caption": "Photo of Mildreds - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZoN2Rv3PvrfN7fz76w0gmA/o.jpg"
      }
    ],
    "user_id": "-LDyNtk9BsfCq15lrijISA"
  },
  "k88IhWxI__zWtkJw-ZGXHg": {
    "date": "5/21/2015",
    "text": "My favourite vegetarian restaurant in London. I've only been a couple times but it's so good. Tough to get in. The sweet potato fries and dip is delicious",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3v29bKfC3dkPZrRfGu1wQ"
  },
  "X-C61DBv0z7ERomB-YFVMw": {
    "date": "10/15/2012",
    "text": "I took my wife here for lunch last Saturday, although I was late and by the time I had arrived, she had filled up on Starters.This is mainly becuase the portions here are a pretty decent size; I had the ravioli, and my wife a Tostada.The tostada was really good and so we ended up swapping plates, but the ravioli was also fantastic, with the sauce being the right combination of flavours.The veggie burger here was also really good, and kept me going for about 6 hours afterwards! (though the sweet potato fries may have had something to do with that).In conclusion I would definitely go again.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8JeTyxMflxvCvKlvWQIb9g"
  },
  "vEk2bzD3uum1sl2MGFRGQA": {
    "date": "11/25/2012",
    "text": "I think Mildred's may be my new favorite restaurant in London, and that's saying a lot. The building and atmosphere are lovely, with a very cozy feel. The food was incredible! We shared two dishes, the pumpkin ravioli and the basil risotto cakes. Both were delicious. Mildred's reminds me a lot of another vegetarian institution, Greens's, in San Francisco. I would recommend getting to Mildred's by 5:45 in order to be seated before the dinner rush. tldr: a London must.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lK_32lYJ-p_fjc01G-DPLw"
  },
  "g_FSOA3zFR4peaF20Lx8CQ": {
    "date": "4/12/2013",
    "text": "So, after reading raving reviews about this little veggie gem I finally made it a priority to go last night. And I was not disappointed. We arrived around 7pm to a packed room so we started off sitting outside indulging in cava (they were out of prosecco) and chatting. Really nice way to start off.After 30-40 minutes, we were seated. And I have to say, I just love looking at a menu and wanting to eat every single dish. It all sounded so delicious! Not being able to make up our minds, my friend and I decided for 3 starters (!) and two mains. All together we had the beetroot salad, the grilled halloumi and the dumplings for starters, while for mains we decided for the sweet potato curry and Asian stir fry.Everything was great - really good. I have wheat allergies and didn't taste the dumplings, but from what I understood they were divine. The beetroot salad was also quite good, however, the grilled halloumi was out of this world. Yum!I have to admit that we were so stuffed after starters, that we didn't really have the appetite to seriously dig into our mains. Such a shame as they were gorgeous. Another friend joined us later and had some chocolate cake with his cava - and told us it was just OK. We took his word for it, no room left for tasting.I would go back any day! :-D",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tcTTATDVkNccRFVLZbdykQ"
  },
  "ZtA2J3LXZn_3Q6Pw8E-gpw": {
    "date": "9/14/2015",
    "text": "Loved the food!! Even though the restaurant is slightly hidden it was good to come here and try the vegan plates!!! Have to rate the desserts as they were so yumm!! Already booked my table for my next trip ;)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZDuIP2UJTt6YZt9MzDOpw"
  },
  "GpvxN5CSstEDTzrXuP12xA": {
    "date": "10/21/2015",
    "text": "Love this place, the food is excellent and comforting. I've had the pumpkin tortelinni in a wild mushroom sauce, and the risotto cake which were both full of flavours.  The place itself is very nice, but tends to be noisy in the evenings.the lkunch quiches and salad are great for take away if you work in the area!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qG5MX1moc1YvNHwDLV73OA"
  },
  "2iT9ArLZXXTg_vIiVF91-w": {
    "date": "9/28/2016",
    "text": "Cocktails were really good especially the drink called southside. The wait was long but the wait wasn't bad at all since the bar was open to people waiting. Food was really fresh and all the vegetarian options were amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vb7fSexgKKMW1g7fR-MPEA"
  },
  "rsdtwSXOOnUHQlD5u0WHPw": {
    "date": "10/28/2012",
    "text": "Veggie paradise! At the tail end of a VERY long week, no groceries, a veggie pal in town...we needed a late lunch (ooops, we didn't even wake up until noon!) for shopping sustenance. We were greeted warmly, ushered in from the never-ending rain (seriously, they are not lying about the rain over here), situated at a two-top near the quaint back area and equipped with water...and a bloody mary for me. It went down like a champ. I figured it was like a smoothie that might take the edge off. It was! I had the middle eastern meze with beetroot yoghurt dip, chilli feta dip, tabouleh, pepper stuffed baby aubergine, rice and mint filled vine leaf and flat bread. It was absolutely incredible. Super fresh, so filling, bright, beautiful veggies. Service got a bit hit or miss as the meal wore on, but nothing to worry over. Just took a lot longer than we had anticipated, but they did get very busy. They are in a prime location. London isn't the easiest place to be a vegan/veggie, eh? Have no fear, make a stop over to Mildreds. I'm dreaming of the beetroot yoghurt dip as I type this. OMG. Get it.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "vWEGXOYx0AUDb_jqSZamXg": {
    "date": "2/3/2016",
    "text": "Vegetarian or non vegetarian...you will love this place. They offer vast selection of dishes that will make everyone happy. And vast majority of them is glutten free.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EikFPn5ONsNY8RnIJqzVsg"
  },
  "qTl5kz1oiSx1geqyyMhF5A": {
    "date": "3/31/2017",
    "text": "Real good food, low prices, friendly staff, vegan options and clean bathrooms. It was packed the day we went so service was a little slow but we didn't mind, the food made up for it , specially the dessert!!! . My friend was feeling under the weather so they made her a fresh orange smoothie with ginger, definitely helped her.   Don't skip dessert!!! Or the mocktails!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7iQYNqOh1iSPm0_JSR6nXA"
  },
  "YLY48ok1a7Q8vPajAvcxTw": {
    "date": "6/2/2015",
    "text": "What an interesting experience... The place is very quant, love the atmosphere but we had to share the table which was a bit weird plus it was s girls night soooooo... Some topics of convo were not family friendly Anyway, for the food-it was nice, interesting menu but didn't blow me away. I really wanted to have loved it. Sorry",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iO5Zw1aBaPyxO4JaIZwIzw"
  },
  "DHAFzSdAgcyeQRJj8ELDsg": {
    "date": "8/29/2016",
    "text": "Absolutely amazing food & service! Such a variety on the menu, great atmosphere!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTv6ah7Bvqp3OPmiFxgyJg"
  },
  "ypBldOML8Wz7rD17ibGlKA": {
    "date": "7/19/2010",
    "text": "Looking for a nice dinner spot before a Play & Mildred's fit the bill perfectly. Luckily I needed an early dinner to make my show so I got there right before the huge dinner rush - the place was slammed by the time I left Drinky included the best elderflower sparklie drink that was so incredibly yummy - add a bit of vodka & we're talking YUM! I had read a lot of great things about their veggie burger but when I asked the server what she thought was better, she couldn't answer....so I went w/ a more traditional / only-in-London kind of dish instead Mushroom & Ale Pie w/ Chips & Mushy Peas - there was a strong rosemary undertone (or some other herb I can't really say) that gave this an interesting flavor, mixed w/ the Ale. The \"pie\" part was a nice phyllo-esque. Chips were somewhat dry but mixed nicely w/ the peas & \"gravy\" from the pie I was advised before ordering that I'd better like mushrooms b/c this had a lot & let's just say this thing was a *fungal overload* ( in a very good way! ) Huge variety of different mushrooms that added so much flavor complexity due to each soaking up the herbs & gravy in such a different way - amazing Sticky Toffee Pudding for dessert was super-delish! Nice & caramely w/ a strong toffee flavor - adding ice cream (or rice cream) would have put this over the top but was still a decadent treat indeed! Lots of other yummy sounding dishes to try & I'll def be back!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "sEBZ0Dk92woGqfEypnzLbg",
        "caption": "Photo of Mildreds - London, United Kingdom. Mushroom & Ale Pie w/ Chips & Mushy Peas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sEBZ0Dk92woGqfEypnzLbg/o.jpg"
      }
    ],
    "user_id": "37HswRimgBEf7_US-c3CDA"
  },
  "-LMALmbeB6aofZqdmh6bEw": {
    "date": "9/12/2016",
    "text": "Good food, a little noisy, good service. Nothing special but nothing bad.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gEz00LZfBRcRAPYh2JOkOg"
  },
  "u9OajvBazpNy_yMnOxbduQ": {
    "date": "3/7/2016",
    "text": "I had really high hopes for Mildreds because everyone raves about how good the place is. Unfortunately, that was not my experience. I order the classic burger and brownie. The burger is okay, the best but not the worst, but the brownie was delicious. I'd come back just for the brownie. I am giving it four stars because of the brownie and awesome staff/ customer service at the place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hDObhdIlGBfIH-IdH-d6fQ"
  },
  "eal5DFuxmKNH2VfLnv1arQ": {
    "date": "3/12/2016",
    "text": "Some of the best and most tasteful vegetarian food I have had, but the place is crowded, noisy and people are cramped together. We had to wait quite a bit for our table, but had a (free) drink in the bar while waiting. Great food, did I mention that?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GXcNVJUo8g3dv0SE4NsB_g"
  },
  "Mr8BDPHW2apDPROYC6X65Q": {
    "date": "5/16/2015",
    "text": "This restaurant is by far the very best veggie/vegan food I've tasted in London! The queue outside is a good indicator of what goes on inside! The staff are always nice and super knowledgeable about the food and drinks available. There are always daily specials and your favourites. The starter I always have is the chargrilled artichoke, I'm salivating just thinking about it! My choice of main dish varies as I like to try new things. My only thumbs down for this place is that they changed their chocolate bombe dessert which was an insanely decadent indulgent 4x chocolate feast of the tastebuds by replacing one of the chocolates with a raspberry coulis. I haven't been able to enjoy any chocolate / rasperry combination since.. But that's me, everyone else seems to really enjoy the raspberry dessert. And it's still by far my all time favourite restaurant in London. So you should visit. Today. And tomorrow. And so on.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RjyScSm8KqSnDe7A9s_sg"
  },
  "KVTQ76Je8jaxJi3Nmp--1Q": {
    "date": "7/15/2014",
    "text": "I love meat, and being Chinese, I eat a lot of meat. But sometimes, a girl misses veggies and clean eating. I had always seen a horde of people waiting at Mildred's, and couldn't understand why anyone would wait so long for vegetarian food.LET ME TELL YOU.  I now know why.  The sweet potato fries with its salty, crispy exterior.  And the detox salad with freshly grated beets and carrots.  And the grilled halloumi with its slightly sweet sauce.  And the Mediterranean platter with beautifully tangy beetroot dip and feta dip.  Everything tasted like real, non-processed food and made us appreciate each flavor and combination.  Even my friend wondered if the carrots tasted more ethereal here.I don't know, but I'll give up meat if vegetarian food tasted like this all the time.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "AmyylXFmv3HhfLbzkEwEyg": {
    "date": "3/15/2015",
    "text": "Wonderful veggie place.We hired the upstairs room for a party and even the non vegetarians loved it!Have tried most of the dishes and they are always deliciousIt does get very busy, but for good reason!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwGeii_Owvl0CYiJtdBPwQ"
  },
  "HtEYWzGzcSE9G8jfGQayFA": {
    "date": "5/15/2015",
    "text": "So lovely to go to a restaurant with an all-vegetarian menu!There's no booking policy, so you have to wait for your table at the bar, however the food makes up for this inconvenience. I had the truffle tortellini, which was life-unchangingly good.  My friend had the veggie burger which was also delicious. Definitely worth a visit for vegetarians and non-vegetarians alike.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOIo1Lz1cknN-kWobz2Cqw"
  },
  "aawSkkhFFvhHG1aQOIB5Aw": {
    "date": "4/4/2016",
    "text": "The place was packed when we arrived, but three different staff members assured us we would be seated as soon as possible.  After a ten minute wait, we were indeed seated.  The atmosphere is very casual and the staff is very friendly.  All the dishes we had were delicious, but the risotto dish and the sausage dish really stand out.  Sadly, they were out of the chocolate peanut butter brownie, but the puddings we ordered were all top notch.  The crumble of the day was especially good.All in all, a very good late dinner!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xOHbR3oVjpc64tVR3dD81g"
  },
  "qz0C3H5WwkXQ9tlxEaJ1Aw": {
    "date": "12/25/2013",
    "text": "Mildred Pierce This Ain't Baby ! Tucked away discreetly on Lexington Street, I've walked past this restaurant several times, without ever being troubled with the urge to visit it.  But for it being the birthday pick of my BFF Charlie I honestly, would have kept on walking. When I mentioned to my Pop that I was going to a vegetarian restaurant for a friend's birthday, he smiled and reminded me that if there wasn't any meat on my plate for dinner when I was a kid, I would get down from the table and go off and sulk somewhere.I smiled when he said it, but only realised the significance of his story, when I ran my eyes down Mildreds menu. I plumbed for the stir fried Asian vegetables cooked in sesame oil and plum sauce with garlic and ginger. Favoursome yes...but....not enough to make me forget how I much I love meat. For me vegetables represent side dishes to enhance the main event and if I'm brutally honest, vegetarian cooking has to be pretty darned amazing to thrill a die- hard carnivore like myself. If you're a veggie, I'm sure this place will be right up your alley, but for me it was a valiant effort to convince my taste buds, that vegetables as a main meal can rock. Unfortunately, it failed for me. Add to that bland interiors - a pop of warm colour would have raised the tone so easily. The queue - we went on a Friday night and waited so long, so close to the front door, that popped open so often, I didn't manage to get warm during the whole duration of our stay. Even when we were eventually seated at the back of the restaurant. Will I be going back, sorry to say not anytime soon.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "mQ2QfkQ334E9hd1ph8MzsQ"
  },
  "eEKO1kyWCJ6PlB6pYEjjiw": {
    "date": "3/30/2015",
    "text": "After finally trying out Mildred's for a dinner with family and friends I understand why it is so popular!The service is great and attentive, in spite of being always very busy, their organic Spanish red wine is delicious and the choice of dishes, all vegetarian, is excellent.The quality of the dishes is very good, I would definitely recommend it and go back to try out something new each time...No booking required, just show up and wait to be seated, but expect a good half an hour waiting time in the evening after 8:00pm, any day of the week.It's a Paradise for vegetarians!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDDsSSyFQijrhuIyTAGvQA"
  },
  "umFm4glkromJmTql8yh-Sw": {
    "date": "3/12/2015",
    "text": "Never have I been so excited to eat salad! Everythign they serve up is perfection and even got my vegetable hating boyfriend to eat some.The staff are so lovely and make you feel at home and welcome without being overbearing.I cannot get enough of this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPf_H17tWMtRnrjB8IrXkQ"
  }
}