{
  "bNYMww2WAsNvFhIGSeoAEw": {
    "date": "11/7/2010",
    "text": "Went here for lunch with clients on Friday. The clients were a bit late so it was all a bit rushed and we only had time for main courses. I had brill, with mash and mushrooms. I had doubts when ordering it on the basis that it might be a bit boring, but it was excellent, really tasty, there wasn't any fancy sauce but it didn't need it as the various component parts had been cooked so well. Everyone I was with really enjoyed their meals, particularly the three people who had lobster linguine. The staff were really friendly as helpful as well. In terms of negative points, it was interesting reading Wolfie's post below as the music was too loud and was an odd sort of jazzy lift music which got irritating at times. But as soon as the conversation was flowing properly you couldn't really hear it anymore, so its only a minor criticism",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tSTns9ZJOqTvAMUm4JJ3Vw": {
    "date": "7/22/2009",
    "text": "\"There is no charge for awesomeness...or attractiveness.\"  -- Kung Fu PandaWise words indeed Mr Panda, but unfortunately neither applies to Zafferano.  I went to this place a few months ago to simultaneously celebrate:1.) My arrival in London2.) A large cash infusion into my bank account (a necessary prerequisite for any trip to Zafferano).3.) The fact I had a date.  This only occurs when Jupiter and Saturn are in alignment and Venus is in ascension, so it needed to be celebrated properly.This restaurant is awesomeness on a plate, but despite the maxim above, there is a price.  I got out of here for about £200 between 2 people, but it was worth every penny.  In particular, the tiramisu was unbelievable.  I've never quite experienced anything like it.  Unfortunately my date didn't order the tiramisu and so I had to give half of it to her...woe is me.The vibe was definitely that everyone in there had way more money than me.  There was a particularly amusing couple next to us who looked like they came out of Home and Gardens or an advertisement for Patek Phillippe watches (come to think of it I think the guy was wearing one of these).  They spent the entire evening drinking their expensive decanted wine and eating their expensive truffle-laden meal, while managing to completely avoid eye contact with each other or even say a word.  That's the kind of marriage I want to have one day.Thanks to the credit crunch I had no trouble reserving a table a few days in advance, for a Saturday night at 7:30.  Apparently this used to be quite a feat so take advantage of the slowdown while you can!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "5gCA9ZSQn7ihFRIDlBj8NQ"
  },
  "2CRcii6sw_oYF4-SQmr5BA": {
    "date": "2/6/2010",
    "text": "I have been visiting Zafferano on pretty much a monthly basis since it opened. Giorgio Locatelli cooked here before branching out on his own, and head chef Andrew Needham has been a safe pair pf hands in the kitchen for years. Zafferano has long been established as one of the top handful of Italian restaurants in London, one of just four with a Michelin star. In my experience the best dishes are the salads and the pasta. Most UK restaurants take little care with sourcing their ingredients, but here many of the salad ingredients are imported directly from the markets of Italy, and it really shows in the taste that arrive on the plate. Pasta is very carefully made, and risotto is properly cooked from scratch, taking 20 minutes. The menu changes seasonally, and there is hardly ever a slip in either main courses or desserts. Service under maitre d' Enzo Cassini is carefully drilled and manages to be both efficient and genuinely friendly. The price of success is that prices have risen inexorably, with the wine list in particular having quite high mark-ups.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "k36f7e6zwd1H_FdTIJ909Q": {
    "date": "6/28/2012",
    "text": "I wanted to try Zafferanos at least two times before writing a review, and I must say they passed with flying colours. The food on both occasions was excellent and wine recommendation was reasonably priced and perfectly complimented the food. Prices are very reasonable for 2 courses and the more exotic dishes do come with a supplement, but well worth the extra. Can highly recommend the octopus, baratta, lobster pasta and fresh pasta with morels. Lovely place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUyAuDklB8z0FqH0ZFmeXA"
  },
  "jTvZLQ0dK-uVUkZ2BKGSNQ": {
    "date": "5/22/2009",
    "text": "yumYUmyuM!!! - 4.5I forgot how real italian food tasted like.Though it may be expensive, the restaurant is amazingly authentic: brings me back to when i visited Italy.   The restaurants menu is simple, and the food is . . .think light not loaded with excess amounts of fuss, amazingly tasty, and appeasing to the eyes - fresh ingredients and fit for the season.  I believe they change their menu/specials based on seasonality.  Wine list is vast = + . . . Though the restaurant has a Michelin star, the stuffiness that would be expected from a great restaurant like this isn't there.  It is dressy yet, casual (think smart casual).  Once you walk in, there is a buzz about the place.  There is a little cafe area on the other side of the restaurant, where you can grab a drink after work or hang out with co-workers/friends.Reservations are a MUST - especially if you want to go in at like 7/8ish. . the place fills up fast during dinner time -  SOMETIMES they allow walk-ins, but you have to get there early (6PM)The only thing that is a negative is the service . .  they could use a little work on that.Definitely a must try.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eL0ZTTGZrpifuB6CosRTUQ"
  },
  "sfs7boVJ4qRo6lKvATzUyQ": {
    "date": "7/17/2011",
    "text": "Don't go out of your way to try this restaurant.  The food was good, service was very slow and inattentive.  Atmosphere is a tad stuffy.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B8jMM7vimBE-PlZkxqonfw"
  },
  "oL5pRTcmhpXyari2UoLoUA": {
    "date": "2/5/2009",
    "text": "This isn't the place to go for a bowl of spaghetti and meatballs. The setting is rather rustic but the food and prices definitely are upscale, not surprising for a Michelin star restaurant in a posh neighborhood.From the four-course dinner menu, priced at £54.50, I ordered a warm salad of veal and braised artichokes; tortellini stuffed with ricotta cheese, radicchio, and hazelnuts; grilled halibut with a sauce of fennel, olives, and sun-dried tomatoes; and tiramisù. Every morsel was a burst of exquisite flavors and textures.If you are in search of a wonderful dining experience for a special occasion, you will be very happy you came here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3x7Zrwu8ugUjCpU6AbJDEw"
  },
  "EIr0TuW6H41-tVm79cwu3Q": {
    "date": "3/27/2012",
    "text": "Zafferano offers excellent Italian food, high quality, fresh mouth watering ingredients that create winning dishes that never fail to impress me.Great service and passion for Italian food make this restaurant one of my top favourites!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PBoh4i7NOqIh8d6M9lOuIQ": {
    "date": "12/9/2008",
    "text": "The thing about Italian food is that it can be great eaten in a little café in a Verona back street for $5 or when you're a student and you discover the aubergine for first time. The point is, cheap and simple Italian food is so good, so understanding of flavour and balance that it almost seems unnecessary to have to shell out for really expensive stuff. Having said that, places like Zafferano's and these sorts of upmarket Italian joints are pretty exceptional. This is a Michelin star restaurant that uses the best of the best ingredients to build on traditional and honest Italian classics to create something a bit more modern and inventive. They do some set price lunch menus which make the meal a whole lot more reasonable although with anywhere like this, watch the wine. It's brilliant and the list is extensive, but it's expensive and is like letting a rabbit burrow in your wallet for a full calendar month.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzUYvmEoPKcVjNcCJin3kg"
  },
  "U2hRykTVtuFBvv1FJAlpsg": {
    "date": "4/16/2010",
    "text": "Culminating a weekend of indulgences with my fab cousin from SF, we booked into Zefferano's in Knightsbridge. Beautiful decor, abounding with fresh lilies (I remember this because a) I love lilies and b) she is allergice so we sat in numerous spots until we found the optimal lily-free zone). We started with a beautiful bottle of white and delicious salads, followed by two equally exquisite pasta dishes. Impeccable service throughout in a very calming and intimate setting. A great Sunday evening destination. Only complaint...the tiramisu. A goopy, confusing consistency we could not figure out, and not of the standard one would expect from a Michelin-starred establishment. So give that a miss, but definitely pay Zefferano a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xmji1-h4Q-eyOGHn02H5lA"
  },
  "HsksVzh9EYQwaSaAwKWVcw": {
    "date": "2/22/2011",
    "text": "A Michelin starred restaurant and this surprises me. The decor is weird, staff cold, food ok. It is also very expensive for what it is but it's location I suppose this is what you would expect. The pastas are tasty and starters interesting.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FmY3aaCTL7dsUZpn1bhPZw": {
    "date": "9/10/2010",
    "text": "Very capable, but not my favourite. Service has been extremely good the few times I've been here, and I do like the ambience of the dining room itself, but sometimes I feel it lacks a little something. I'll definitely return, but there are other starred places in London that I prefer.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "SviRLxr5rZQuwPFREYs7Hg": {
    "date": "1/11/2009",
    "text": "Some of the best Italian food outside of Italy. Incredible ambiance, exceptional wine list, and the pastas are ethereal. We celebrated my father's birthday here and it was a really memorable evening.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Xi2i_i1RzKkoJ41_1JHig"
  },
  "pAedaqsjdEVg4-omzvmJiA": {
    "date": "1/30/2010",
    "text": "This is one of the best restaurants I've ever been to, and it's because of the impeccably invisible service, and the ethereal food. I had very simple sea bass that was this cloud-texture I had never experienced before. And then there was the BURRATA, which nearly changed my life. It was tangy. It was creamy. It was sex. The prices are steep here, but it's totally worth it. I can't wait to go back .",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6U-gZXBkUNfkYLMp99TY0Q"
  },
  "ClZ3SZR75msY4Zwyt842RA": {
    "date": "1/5/2012",
    "text": "hungryinlondon.com/2011/… Entering Zafferano feels like stepping into the dining hall of an up-market old people's home. Not only are the majority of customers far past retirement age but also the atmosphere is pleasantly subdued and old-fashioned with white table clothes and humongous flower arrangements. In short,you wouldn't go to Zafferano for people watching or to meet men. Unless you want to catch a millionaire in his eighties of courseZafferano is not only in one the poshest parts of town,namely in the border between Knightsbridge and Belgravia,but it is also just next to a Louboutin shoe shop. Just the right think to wet your appetite,girls Because let me tell you,food was,if not very experimental,solidly outstanding. Already the bread was superb all for different varieties and the grissini were so tasty that we had to hold back not to finish the entire bread basket. The menu costs 34.50 for 2 courses,44.50 for three and 49.50 for four courses. As a starter we tried the Burata which came with rucola,cherry tomatoes and aubergine. The cheese was heavenly creamy and ripe and tasted ever so slightly salty. It was beautiful by itself,but even better with the aromatic tomatoes. Forget about the aubergine though,this was undercooked and without any merit. The Branzino Carpaccio was again lovely the fish fresh and melting in my mouth and the pieces of sweet water melon providing an interesting contrast. However,the rucola was too strong a taste and was overpowering the fish. Maybe one should send a notification out to all Italian restaurant in London that we still like them,even if they don't put rucola into absolutely everything Faultless were the 2 main courses. I was hesitant at first to order the monk fish as I had too many dried out monk fish pieces recently. The Zafferano version however was divine:succulent and cooked to perfection,the monk fish came in a light,Asian-inspired sauce with crunchy pieces of lightly grilled zucchini. I am usually not the biggest veal fan,but I was glad that I gave it a try at Zafferano's. The meat was pink and soft and was immersed in the most beautiful and light gravy with good helping of very flavoursome chanterelles. No,the food is not experimental and it doesn't push any boundaries,but gosh! it's so comforting once in a while,instead of chasing after unusual flavour combinations,rare and exotic herbs and weird ways of preparing things,to just lean back and savour exceptionally well prepared familiar flavours. And,judging by the number of centenarians at Zafferano,it also seems their food makes you live long! The service was very annoying though. I mean hugely annoying. I have never seen a restaurant where your full (FULL!!) wine glasses get topped up every 20 seconds. It was impossible to have a conversation because you always had to get rid off terribly keen waiters that were humming around you like flies. When we told them that they please should stop doing this,they were miffed and didn't fill our wine glasses at all anymore,not even when they were empty. (Dear Zafferano team,this is the point when you actually SHOULD fill up a wine glass. Easy:empty = fill!).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zTLaqKOT6uocSR-mk9NVLg": {
    "date": "8/29/2009",
    "text": "Fantastic Restaurant, best Italian I've been too. Well worth a visit and the expense",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b0vCGJm7cHcJzquk7kGnEQ"
  },
  "jD7BPKQhFMtNXbirBArUkQ": {
    "date": "3/10/2008",
    "text": "Zafferano is a reliable high-class Italian which does its job well, but lacks a bit of pizazz, particularly at lunchtime. On a recent visit I had some competent squid and a rather heavy truffle risotto, but nothing to get excited about. We also had to ask the maitre 'd to turn the loud and inappropriate jazz down (it was turned off completely when the place filled up). On the other hand we chose a superb wine - a Planeta Chardonnay from Sicily - which made the whole meal worthwhile.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fEE3xEhaRhC2qWnip4Aqw"
  },
  "T6v0Yj9FbyB2XCbDK14VvA": {
    "date": "1/13/2008",
    "text": "I was fortunate enough to be on our company's exclusive invitation list to dine at Zafferano, a Michelin star restaurant, in their private dining area. The Private dining area is downstairs in the cellar & the big oak table seating at least 16 people the low lighting adds to the rustic feel of the room. I believe that during the week this room hosts sophisticated dinner parties. Starters were platters of decadent cured meats, buffalo mozzerella with cherry tomatoes, seared tuna, selection of medittaranean vegetables with cuttlefish amongst the dishes. I do not eat seafood or fish as a rule but was tempted to try the tuna and it was wonderful so perhaps I am cured of my fear of fish. Next we enjoyed 2 types of pasta, a ravioli and a rissotto both equally good. Main course I had to select the veal which was cooked to medium perfection. Dessert had to be the classic Tiramisu which was different to how I have had it before but surely this is how Tiramisu should taste absolutely heavenly. The staff are attentive, the wine list extensive and all in all I feel we had an excellent night which was also good value.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cd6GLzfseIqYGxLBdkBfDA": {
    "date": "7/8/2009",
    "text": "One of the best Italian restaurants in London - but fill up on bread and breadsticks - I do have an issue with portion sizes - we had a 4-course meal and all of us came back totally impressed by the taste but could have eated amother 3/4 similar courses without a problem - really are tasting menu sizes. Given the price I think portions could be improved.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AUYMw3Iift9BmvankjLnPg": {
    "date": "8/7/2008",
    "text": "Fantastic service and fabulous food. Almost better than a trip to Italy.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8mHtk96TAgPqjva4GBWUdg": {
    "date": "7/29/2018",
    "text": "We had a family dinner here a few weeks ago and while my daughter was not super impressed, my wife and I had another excellent meal.We started with a glass of prosecco and bellini for my wife.  Then moved to the beef tartare, vitello tonnato and truffle risotto.  I loved my beef and my wife was very happy with her truffle risotto.  I had the tagliolini with my daughter for a main while my wife switched over to the milanese since the risotto had black truffles.  This is one of my favorite dishes at Zafferano and I will be sad if they take it off the menu.We had the cheese for dessert and a bottle of the Korem 2014 throughout the meal which is a very solid red; well-balanced and reasonably priced!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZGmjA3NrrmcHVX3SoAWaZw"
  },
  "WDR9NmzbuGi2x3rPd0euew": {
    "date": "10/21/2018",
    "text": "Really great Italian restaurant in the center of Knightsbridge on London. What stood out was the excellent, doting service throughout the meal. Since I went for lunch with a colleague, I kept it light and had the tuna steak which was really very well prepared. The breads served with the meal were baked fresh and I finished my meal with a great coffee and was offered a plate of complimentary sweet treats.  Although don't eat sweets, my colleague was able to take them home with her which was quite a nice touch. Overall, Zafferano is definitely  worth a visit if looking for a higher-end Italian restaurant in Knightsbridge for a business lunch/dinner or proper Italian meal...and I would certainly return.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "upvr-wLJomLQn82pbnYy7A",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/upvr-wLJomLQn82pbnYy7A/o.jpg"
      }
    ],
    "user_id": "X9LT66H7NosO9MOSm_qt8A"
  },
  "3kLsDKoLUbIZB1eZMXrm_Q": {
    "date": "6/19/2018",
    "text": "We've been going to this restaurant for years, so obviously I enjoy it. ORDER: Rocket and parmesan salad (ask for cherry tomatoes with it); saffron risotto (their classic dish); Veal Milanese; Tortino al cioccolato con gelato alla vaniglia; Sfera al cioccolato bianco con gelato alla fragolaAVOID: eating too much bread before dinner ;) undercooked risotto; arriving without a reservation I generally order the same items every time I come here because I love it! I order the rocket and parmesan with cherry tomatoes for an appetizer. Make sure to ask for their balsamic vinegar with the salad - its amazing! For an entree, you must get the saffron risotto! They aren't skimpy with the saffron, so it does have amazing flavor, BUT the past three times I went here, their risotto was VERY undercooked. Being a risotto lover, I order it somewhere probably once every other week, so I know a good risotto - when they cooked it for another two minutes, it was perfect! There needs to be a nice shaving of parmesan cheese on the risotto. The  tortino al cioccolato con gelato alla vaniglia is amazing, but it takes about 12 minutes to come out - so either order it ahead of time or be ok with waiting (ITS WORTH IT).I will say that recently I haven't been hungry at dinner and neither has my family, so we tended to order less than we normally do and didn't order wine - to be honest, I felt when we ordered less (and therefore spent less), they tended to be a bit more cool to us and were not nearly as attentive. But nonetheless, I still love this restaurant and their food, hopefully next time I go they will cook the risotto a bit more.Will definitely go again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9HDcePTfUCZCOGwsFDdc_Q"
  },
  "jm5QyzEUbiYrn_JTekSlTg": {
    "date": "11/12/2018",
    "text": "Not a good experience. Would not recommend. Priced as high end dining experience but missed the mark.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xxwhdzi3FlskupWuD9im9w"
  },
  "OaYF9Cm3WUY6NilKQIhiag": {
    "date": "7/19/2017",
    "text": "Status:-Service: good but slow(Italian standard)-Food: good and very Italian Pricing:-- Appetizers: around 10 pounds-- Entree: ranges from 15 to 50 pounds-Best Dish: saffron risotto-Atmosphere: more modern version of an Italian restaurant",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4dFBS6o__6FqmAH3YVMfaw",
        "caption": "Photo of Zafferano - London, United Kingdom. Menu page 4",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4dFBS6o__6FqmAH3YVMfaw/o.jpg"
      },
      {
        "img_id": "jWQsiU8yyvgBnbRfD0YytQ",
        "caption": "Photo of Zafferano - London, United Kingdom. Menu page 3",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jWQsiU8yyvgBnbRfD0YytQ/o.jpg"
      },
      {
        "img_id": "YLJB8UHLTO0ZWcnoWvqy4g",
        "caption": "Photo of Zafferano - London, United Kingdom. Menu page 2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YLJB8UHLTO0ZWcnoWvqy4g/o.jpg"
      }
    ],
    "user_id": "L83pOfTvDLzQN28EYzTtKg"
  },
  "fuOQmZAhp8h_dee5k5iFGA": {
    "date": "7/12/2017",
    "text": "Zafferano's is an upscale Italian restaurant in the Belgravia area of London. I preferred the Rocket (arugula) salad with Parmesan cheese, followed by saffron risotto. The Parmesan salad was delightful and fresh. The addition of Monchiamatemiaceto Aceto Balsamico di Modena vinegar was superb (be sure to ask for it). The saffron risotto is wonderful and cooked to perfection. You can see the strand of saffron in the ochre colored dish. My companion had the summer truffle tagliononi and she thought it was delightful.  The truffle is shaved over the taglionini table side. The risotto is a large serving and can be split if followed by a meat dish. We were at the restaurant during a heat wave in Europe and the air conditioning was lacking. No ice is added to the drinks unless one requests it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Qrpy-7OTrPMuYAM0np6SeQ",
        "caption": "Photo of Zafferano - London, United Kingdom. The bar is a nice place to get a drink before dinner",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qrpy-7OTrPMuYAM0np6SeQ/o.jpg"
      },
      {
        "img_id": "GDfasZeL8lc77P7CEF01hg",
        "caption": "Photo of Zafferano - London, United Kingdom. The restaurant has a front room that is conducive for conversations and then they have a back room for more intimate gatherings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GDfasZeL8lc77P7CEF01hg/o.jpg"
      }
    ],
    "user_id": "KPmJ2fWqrLtx8VvlKGqUdA"
  },
  "nXaAaGRTFUvx5vIIvCzzpw": {
    "date": "12/26/2016",
    "text": "If you come to London and want a true Italian meal that's the place for!Zafferano is pricy but it worth to come!We had the amazing white truffle spaghetti and the linguine alle astice!Both flawless with the right tip from the sommelier for a wine not too pricy (considering UK standards) and amazing for special date for a romantic holiday!Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mYxNM0bAXA39qzjTdTZOfQ",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mYxNM0bAXA39qzjTdTZOfQ/o.jpg"
      },
      {
        "img_id": "okLZFUCYS8rKv9flhojirQ",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/okLZFUCYS8rKv9flhojirQ/o.jpg"
      },
      {
        "img_id": "UgiQrSCvQ5gkvOQzkgXqmA",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UgiQrSCvQ5gkvOQzkgXqmA/o.jpg"
      }
    ],
    "user_id": "A51zOBYfQkeBEP43TIOGNQ"
  },
  "U0UnmhmJYeo9Yc4II1_5Og": {
    "date": "4/4/2018",
    "text": "Zafferano is a neighborhood classic! I can always count on a warm greeting even when I show up without reservation. The atmosphere is inviting, perfect for a date, friends, or business. The food is always good quality, and they offer an extensive wine list. Recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9kD9ednSiHPv5CuGk0uUw"
  },
  "CefCu9IT-pjs57UYx7Ifng": {
    "date": "7/19/2017",
    "text": "In my professional informal food critic opinion, this place goes above and beyond with its service. Yelper or not, they seem to want to please you. Zafferano, as it may give away with its name, is known for its saffron risotto (my family are all personal fans of it themselves). This is an authentic Italian restaurant in that most of the staff seem to be Italian.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bJujRHabuHasLRQ5OUycgQ"
  },
  "96bP7ybMge2_NTXBrC9-Ow": {
    "date": "7/14/2017",
    "text": "Italian in the heart of Knightsbridge.  Simple one of the best meals I've ever had...why?  Delicate flavors.  Good prices.  Romantic.  Met a very interesting couple, who were, hmm...\"friends?\"  \"Business partners?\" They were a blast. Had a fantastic salad with wonderfully fresh combination of beetroot, raisins, eggplants, tomato, and Puglia cheese: burrata.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wWyR5AdkPNwxEBZhYCGiFA"
  },
  "HpWadtbzLeNUcPXEy8NZTg": {
    "date": "9/17/2015",
    "text": "Excellent place for lunch! Very tasty Italian food with very professional service. Superb location close to Sloan Street and Knightsbridge. Love this place!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bjzw7ql1EgoRu9TYD925_A"
  },
  "oIg4BjqAPRUEDlI1nv43Tg": {
    "date": "4/2/2014",
    "text": "Comment dites-vous fantastique en Italien?!**Insert Clap Clap Clap emojis here**Best Italian food I have had in a very long time!! All of the food is outstanding...Enough for me to go twice in a 3 day visit. Ha.(By no means am I partial to Italian either. My heart solely lies with Mexican food FACT)My first visit was as heavenly as all of the food we had ordered.*Kisses my scrunched finger tips and spreading joy*Food Report:Burrata w/artichokes |A|- Anything cheese, especially burrata is divine and mouthwatering.Minestrone Misto |B-|- Again the battle with the English flavoring...Could use a bit of seasoningCrab Salad w/lemon & pesto dressing |A+|- So delectable I felt selfish for not sharing. Pan-Fried Seabass w/califlower cream |A+|- If my name were Precious, I would have ordered 3 in one seating.Merluzzo arrosto con ceci |A|- A roasted cod that had a hint of a honey flavor and cooked to perfection.All of this topped off with an espresso that was dulcet in every way imaginable....While dining here may cost a pretty pound...Just remember the saying..\"Love dont cost a thang..\"Molte grazie a ottimo ristorante e fare il mio cuore e lo stomaco pieno allo stesso tempo!!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 8,
      "cool": 9
    },
    "photos": [],
    "user_id": "5RCcFwMRghhw1wMhnZY5RA"
  },
  "VMRVslClCSzqYSEsdcXrVw": {
    "date": "12/22/2011",
    "text": "Convenient location in a nice area that's a street away from a plethora of higher end stores. Large space, efficient waitstaff, and a good selection for menu and wine list. The outer room we were seated in was about half full for our Sunday night 9:30 reservation.As we had just come from high tea about two hours earlier, we really did not have much of an appetite and decided to go with the prix fixe two-course meal (as opposed to three or four courses). You're allowed to pick two from any of the four categories (starter, pasta, main, dessert). I had the winter salad starter and chanterelle mushroom pasta. Both were really good, and I thought they were rather nonconventional. Dining partner had the ravioli pasta and the veal main, which he said was quite good as well. Honestly had no room for dessert...lame, I know.A solid choice for a good meal.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5nlC6HEHxATSvxOZFayMQ"
  },
  "neevqvlEuwT8Dtda_ewthg": {
    "date": "12/15/2013",
    "text": "Went here with a friend when we were here for business.  We had thought they still had a Michelin Star (plainly, it wasn't all that important to us), and when I mentioned to him the next day that they had lost their star, he looked at me and said \"yeah, that sounds about right.\"In other words, this place is good, but it is *not* the very top echelon by any means.  Most critically, the food was uneven.  So, my buddy's mullet was super bland (contrast: the burrata was awesome), and my crab salad tasted less than fresh (basically: either they saved it from the day before or the crab had been sitting out for a few hours that night.  either way, super disappointing in what should have been a great dish based on everything else that was in it.)It was also very, very, very loud.  I like louder restaurants, but this was nuts.  Part of the problem is that we were next to a loud table of drunk 50-somethings, and everyone else seemed happy when they left.  But here's the thing--this is now the type of establishment that attracts drunk 50-somethings.  That's unfortunate.Next, while the hostess was great, the service at the table was mediocre at best.  Not bad, exactly, but not good either--for example, when we had questions about the menu, the descriptions we received din't really help much, and I'm still bummed that the waiter recommended the \"off\" crab salad...Bottom line, you could do worse if you happen to be in the neighborhood, but this is not the restaurant it seems to have once been.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjKG1aPrQ1-ykyl7uThzLw"
  },
  "2QYfcbDX131rF7-_WPN7zQ": {
    "date": "6/4/2013",
    "text": "Attractive restaurant on a classic London Street. Service excellent, but I was very irritated by the wine steward having takena large class of wine from my bottle to taste without asking. I know wine and don't need that. Food was ok not great. Given the prices, I would expect to be more impressed. The English may not demand better, but a New Yorker does.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n7NUHPPY_I3fG396q-u5gg"
  },
  "jG4EpITmjqrEpmKOKjZH-w": {
    "date": "2/8/2012",
    "text": "Zafferano truly deserves its Michelin star. The food is fantastic and the service is attentive. The ambiance in the restaurant is not too snobbish or uptight, and the prices, while high, are not ridiculous. Two courses for £36.50, three courses for £46.50 and four courses for £51.50. It is truly worth the price.We opted for two courses each. For starters, my dining partner ordered the winter salad, which she said was delicious, and just right. I didn't order a starter, however was brought a plate with focaccia, salami and some parmesan, to munch on. As a main course, I got the pappardelle with braised beef cheeks, while she got the veal cutlet with potato puree and artichokes.I've never tried pasta with beef cheeks before and was nervous that I wouldn't like it. However it was truly delicious, the beef was tender and perfectly complimented the al dente pasta. The sauce was delicious, and I was told by the waiters, takes 3 days to make. The veal was incredibly good and tender, the kind that melts in your mouth. The potato puree was delicious too. For dessert I got apple pie with vanilla ice cream- again, a truly perfect dish.I'm sure that every dish on the menu is truly exceptional, and portions aren't too big (but not tiny either, as is so common in expensive restaurants), meaning that you could comfortably have three or four courses.I strongly recommend this restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "SWNkgZL1cJTek7odyJYkOg"
  },
  "HhrAW4FURTi5Ynmw_1YvbQ": {
    "date": "12/20/2013",
    "text": "Good place, generous portions. Tiramisu was really good. Yelp won't let me close this review window on my homepage so I'm forced to write this review.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqVXP6hqD6UL1kG_oCxqGg"
  },
  "8VOrgVJZhmEJLMHNcDtSIg": {
    "date": "1/28/2014",
    "text": "Easy Zone 1 spot with very solid food and subtle atmosphere. The wine offerings were strong and the pasta was a highlight. Prices aren't cheap, even for London, but overall it is a good destination.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hs72YBmIARm8eBSY0Mf1jw"
  },
  "i7Ij5znRZZPhdeHQCmcWVw": {
    "date": "4/20/2014",
    "text": "I recently went back to zafferano and was disappointed by the staff and food I walked in and was coldly greeted by the inattentive staff the last time i was their we were put in a big spacious room this time in a cramped small area then the food took over 25 mins to come and when it did it was nothing was special  not worth the huge price",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ebe6_2jgdum7jNCJPgYN9g",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ebe6_2jgdum7jNCJPgYN9g/o.jpg"
      },
      {
        "img_id": "FoMqUqVaLIZVsZJilYxrmQ",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FoMqUqVaLIZVsZJilYxrmQ/o.jpg"
      },
      {
        "img_id": "BvG9BxK4V5MAkW6nqpz5xg",
        "caption": "Photo of Zafferano - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BvG9BxK4V5MAkW6nqpz5xg/o.jpg"
      }
    ],
    "user_id": "tiQ5qIApVm5sjsIcbxyudQ"
  },
  "o1tFoC6l0voI1N0M0lvyqA": {
    "date": "7/10/2012",
    "text": "Solid food and service. I had a two course meal of prosciutto and pasta for dinner.  Both were very good.  One of the people in our group is vegetarian and they were very good about it. Service by the waitstaff was 5 star.  The restaurant itself is nice and upscale, but not overly stuffy either (by London standards). I would give this place a 4.5 star if I could and would go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bgDbOtWgJyESXK0m0YLfaA"
  }
}