{
  "aPB_l4k82jeo8IRdU3AHlg": {
    "date": "12/3/2008",
    "text": "For months I walked past The Owl and the Pussycat, never going in because it looked ratty and boring. Finally, however, I ventured in with a mate. And I've pretty much never left.With worn decor that makes you feel instantly at home and a great mix of old East-London geezers and cute young men, it really is a little gem.Fabulously charming in a non-pretentious, anti-Shoreditchian way, The Owl and the Pussycat is the kind of pub you meet a friend with for a 'quiet drink' after work, and end up rolling out of at closing time.  Or maybe that's just me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WzurMIIijS0QN9PdXKJ3g"
  },
  "CdS07NhHnC4u7PmmWiXV3w": {
    "date": "7/7/2009",
    "text": "So an owl and a pussycat walk into a bar. They have some sort of sticky, sweet substance, and a shed load of moolah. They've been on a long journey in a vessel the colour of a legume. How happy they must have been to stumble into this establishment, with its lovely outside seating area and cheap drinks. Happy, that is, until the owners shot them and pinned them to the wall, along with the other owl and pussycat themed paraphernalia which adorns every surface of this Shoreditch hotspot. Yes, the Owl and the Pussycat is another of those old school, traditional pubs which has become the boozer of choice for the cool kids. But don't let that put you off; this place is much less overbearingly hip than many similar establishments in the area, and still maintains the feeling of a quirky local filled with quirky locals. The prices are very reasonable, that beer garden really is lovely and sedate- although if you're looking for a more dangerous al fresco drinking experience you can sit in the street outside and try playing chicken with the infrequent passing traffic- and the bar staff are older than the Edward Lear poem that gives this pub its name, giving it some extra charm. Minus points have to be given for the slightly fragrant toilets, but overall this is a perfect location for a few quiet drinks or a spot of pre-club lubrication, provided you aren't of the feline or avian persuasion.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "t4TlhBum4JCNHpZz4DgBYg": {
    "date": "12/30/2008",
    "text": "This traditional pub, once the cherished watering hole of real old east end geezers, has become the adopted hangout of new meeja blokes who treat it as the 'genuine article' among the plethora of stylish new bars that now dominate shoreditch. However, this doesn't seem to have gone to the Owl's head at all. It still has a blackboard full of indigestible pub grub which show no pretensions to 'gastropub' status. No, it's doorstep white bread sandwiches or lasagne and chips type fare here. The tiny kitchen can struggle to serve the whole pub when it's packed out on a summer's day, so you can find yourself waiting and waiting. Better to just go for a drink and pick up a sandwich on the way back to work (more digestible too). The pub garden out the back provides welcome seating and fresh air when the sun's out, but it can get very full. Screens for football matches have also been introduced inside to please the masses.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VBd-F_DNAxMKOVTg51Vc7Q": {
    "date": "6/21/2008",
    "text": "Traditional old fashioned and unchanged pub in amongst the home of skinny jeans & awkward angular hair types that is Shoreditch. Before reviewing I think it's important to mention that this is another pub that is likely to not be here in about 6 months. There is a big development going on in the area and I think this pub is going to go in that development, which for me is a real shame. (I'm not 100% on this..maybe someone else knows on here?) It's really just a traditional English pub, with a garden out the back and a decent sized room upstairs. It's about as good an example of an English pub as you could get and yes the landlord may look like a sourpuss, but he is friendly enough in a gruff way and service gets the job done well in my view. Also has a billiard table and TV. Good atmosphere from my experiences there - well worth a visit if you fancy something traditional in the land of all things skinny and angular. Oh and finally - great name for a pub!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XPO7cJqOjcjb89eIOQo1ng": {
    "date": "11/13/2007",
    "text": "A recent night out prompted me to adopt a new running order: first drink, secondly eat, finally dance. As the drinking leg of the tour, this establishment served its purpose well. Tucked down a side street, this is a great East London boozer. On my visit the barmaid looked like Amy Winehouse, locals stagnated at the bar (moving only, and reluctantly, to smoke), coats were piled high on the billiards table and advertising types discussed whether or not they knew how to play. Conclusion: they didn't. This pub made for good post work times. It was busy - but the wait for a drink was never too long, and as the staff were cheery and looked busy, I could quite happily wait a few moments longer. This pub ain't big and it ain't clever, but it's full of people and laughter and made the perfect springboard to the rest of my night.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WF7kEarMFsVN94g-zArFWA": {
    "date": "2/23/2009",
    "text": "Love this place. It's been my Sunday five-a-side footy team's post-game drinking joint for over a year. Obviously everyone will have a different opinion I suppose, but I must admit I relish its old school and slightly tattered charms (although the gents toilet could use a deodorizer or something). The landlord is a friendly enough fellow, and even chatted with my Dad and I for a bit about country music and opera. Gruff yes, but not unfriendly and also not without a good sense of humor. Importantly, I have never had a bad or questionable pint poured from the taps.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MZ0GZkpq_wTyNIPb9hDvBA": {
    "date": "6/17/2008",
    "text": "If you're after friendly, chirpy service from flirty ex-models with a fondness for wearing insufficient fabric, there are plenty of other places in the area to go to. This is a pub. Just a pub. It serves good beer. You can sometimes find a place to sit. The carpet sticks reassuringly to the soles of your shoes. And on a good day the barman will acknowledge your existence with a surly grunt. Perfect! It's got a beer garden full of smokers. In the old days they used to sit inside creating a collective smog of asthmatic-repellent. There's a piano in the corner that I've never had the nerve to open the lid of and a wonderfully old-fashioned bar billiards table. But it's the atmosphere that makes this place special. These other (s)wanky bars in the area might have helped a posh interior designer buy yet another Bentley - but they can't buy a vibe like this.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aovxkWl7m26Nk4M0gBVizg": {
    "date": "6/19/2008",
    "text": "Nice little 'genuine English pub' complete with musty smell, sticky carpet and aloof barman. But it's also quite cosy. More of a 'get in out of that weather and av a pint by the fire' sort of winter pub. Too dark for summer. But then again it's London. Saying that, there is a nice little beer garden out the back for the occassional summer day beer. Also, it tends to be a post-private view haunt for arty people in the area. These motley crues tend to pile in here on Thursday evenings around 9. You have been warned.Otherwise, yea, you can't go wrong for a good honest pint.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TSUdolRiqKKqsjwUB-z9vg": {
    "date": "8/28/2008",
    "text": "If you want a proper pub with an even more proper sunday dinner then go to The Owl and The Pussycat. In an age when gastropub meals are all fancy schmancy schlop, you cant beat a rare treat on a sunday. The plate is fit to burst with seasonal veg and the meat is great. Sometimes a buffet and sometimes served by a busty blonde, you cant beat this for a sunday hangover day, with a pint of 'hair of the dog' to reenergise. Why go anywhere else for a real taste of britishness?",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PEv6L961nsETW27aagpJ9Q": {
    "date": "11/7/2008",
    "text": "Old school pub. And the best Sunday roast I have had. This place is frequented by the arty types who live in the area and the regulars who I would assume have been coming to this pub for decades. Though the atmosphere could use some updating, I love this place. A good spot to stop for a pint during a pub crawl. If you come for the roast be prepared. Your plate arrives overflowing with steaming food. You will leave in a food coma and most likely head straight to bed for a nap. Not a bad way to spend a Sunday.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Uo0f6HVG3K34L8Aa8f4VVQ"
  },
  "ao8xPQLI8vOlm5-upI73hA": {
    "date": "11/27/2008",
    "text": "I remember the first time I walked by this pub and barely paid any attention to it, it looks like a very traditional pub you know, but when I noticed the name I thought it is just wrong. There must be something special with that place, and soon it became my local.During the weekdays the place is mostly crowded by the advertise companies located in the Tea House next door, but I don't mind. The staff is slow, the place is a bit worn down and it is hard to find a seat. I still love it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfEv9dd3pf3Diog86rus7A"
  },
  "w5E1JmYFBgjG1GNQY-eTPg": {
    "date": "1/31/2008",
    "text": "Gratitude is a strange thing. You'd think that this pub's inimitable location, genuine east end pub furnishings and proximity to what is only going to grow as a big spending area that the publican of this building would manage to raise the odd smile. Instead, on every occasion Pandyman has visited this place (i'll call it it a pub through gritted teeth if you insist) the landlord has been the most miserly scrooge one could image. He seems almost bitter that his pub is regularly packed out, albeit with the media types that Pandyman despises so much, despite living in their social and economical epicentre (I'm just around the corner) Such is life, but, Squire, please have the heart to recognise a man who likes an ale and a table with equal distaste for all that is the la de da of media darlings grouped around their oversized wine glasses and far too tight trousers (how do they piss? Answers on a post card.) Instead I am far too often treated to the grimace he serves these types with and against all the force of my charming, overpowering, nay, indestructible socially levelling banter. Such is life. So it goes. Pandyman verdict: if you must come here, and, as my proper local, I occasionaly must, then do so with the following caveats. Your service will be terrible, you will wait for some time and receive no quarter or apology for lack of speediness. You may, as I have, receive aggressive attitude from the locals, or be forced to talk about digital platforms with a man who designs purple suits with far too many pockets. Suh is life, so it goes. On the other hand, you'll get a pint, there's a TV and an outside smoking area. Bogs are so- so (access to the ladies for the purposes of this review has proved troublesome despite repeated entry attempts by the Pandyman) This may cause you to leave and never return, casting oaths into the night's sky to join the general accord of vomiting oiks, lost locals looking remarkably like disappearing amazonian tribes in a sea of mediocre unformity all encompassed by the gentle wash of police sirens heading for trouble in places with a real heart and soul, with all the attendant problems therein. So it goes.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "exwk3qVjEQoJ8p55bNpmuw": {
    "date": "10/19/2010",
    "text": "Really pleased with the new Owl & Pussycat - especially as I heard an awful rumour it was getting turned into a wine bar. All the things that were good about the old Owl and Pussy cat remain in tact - good vibe, eclectic mix of east enders and INCREDIBLE GARDEN!!!, while the bad is gone - crabby barstaff, filthy loos, warm beer, crabby barstaff etc. They've added an upstairs bar and dining room which I haven't had a chance to eat in but the menu looks great. Hooray for the return of The Owl!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kN47ZYJv6xfGxlJXGZZ1EQ": {
    "date": "10/13/2014",
    "text": "Nice, social pub. Decent food served and a pub quiz on a Tuesday. Good selection of beers on tap and in the bottle as well as spirits. Gets quite busy with the after work crowd and on weekend but its a good bustle and there is also a beer garden and upstairs bar also. Prices are standard for the area - good quick service. Well worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMJZspNXtNpcArkFy8WNRg"
  },
  "LzLCZiiaq54FGahvHDX-fw": {
    "date": "4/11/2012",
    "text": "The Owl and the Pussycat is a really nice pub in Shoreditch, I went there for Sunday Dinner on a lovely sunny Sunday.inside its informal yet pleasant and I understand there is a restaurant upstairs as well, but we didnt see that. Outside the pub is a sign that boasts it has the best Sunday roast in london bar none. Now that's a big claim and I can see why they would say this. The meat was perfectly cooked and the veg and yorkshire were excellent.Unfortunately due to a mix up our dinners arrived a bit late and were not the hotest. They were ok to start with but quickly cooled. However I imagine if it had been piping hot at the start I might very well have agreed with them as it was excellent.Apart from that worth a visit! The portions are massive as well!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1mzaZ4kE4Ev94sLsBqzo_w"
  },
  "nUuKgLjLWF2071zeYLeH0w": {
    "date": "12/30/2014",
    "text": "Been a regular for the past 5 years. Ordered a shandy today: £4.20.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKipbjV_nOYk5p0n1-ds6g"
  },
  "qdLYb5FbhzNq8HnN8MLODA": {
    "date": "3/30/2011",
    "text": "I'd started drafting this review quite a while ago.  (I hadn't been there in about six months).  What I was going to say was:  \"Nothing precious about it - but boy have I had some fun, beer-soaked evenings in here!!\"  We stopped by last weekend...Sadly, it's all changed.  On the surface, it looks like a change for the better. Gone is the chaotic feel of the place, like the piled up beer glasses towards the end of the night on a corner of the bar, the slightly unkempt interior, the ancient billiards table.  It's now dark, slick, 'professional.'  But also gone is the sense of crazy fun.  There used to be a boombox on the bar, and the owner and bartenders would blast whatever they wanted, and a party would ensue.  I always remember lots of laughter and genuine fun being had.  I hate to sound like a snob, but a new vibe has blown in from the west.  Yes, it's on the circuit now, it's more crowded, the lighting is darker, and overall it looks more 'successful.' But something is definitely gone from the Owl & Pussycat.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "5XsVXyHr95m8A07IVrqG7Q"
  },
  "iQiAYWzpNOZXf8A-Jjwp4g": {
    "date": "4/1/2011",
    "text": "I love cats, I love owls... I was never going to hate this place. It's a standard boozer during the week, with a nice outside patio area that always seem to be filled with smokers. Inside you'll find a selection of tables and chairs, sofas and stools. More than enough room for everyone to make themselves comfortable.Added bonus is that they have a decent cider on tap and you'll wait at the bar but not for too long. Really there is nothing wrong with this place. I should love it. But I don't, I like it. It's perfect for an after work pint near Liverpool Street, a mix of suits and creatives, I can imagine it becomes quite busy on the weekends with drunken office revelers.They have a dining room upstairs which I want to go back and try...I had no idea that this pub was run by the group that owns The Keston Lodge. I love The Keston Lodge, and I like The Owl & Pussycat.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "tkXMD1zDCelqCsKzX-mKDw": {
    "date": "8/5/2011",
    "text": "There is a sundeck on the back! Beers are good and cheap, and people seem nice!Moreover the place is rated and NFT!f.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4PPKnPPgUrN_gb3da5f2A"
  },
  "6zzNUwFRAjPKewPPL73tcQ": {
    "date": "11/26/2008",
    "text": "I am a greedy pig, and pride myself on the fact that i can out-eat most people i know. So when i was challenged to an eating competition in here on a Sunday, i jumped at the chance thinking victory was mine. Oh how wrong i was! This place is astonishingly good for Sunday Roasts, that you eat upstairs in the comfy boozer and come overflowing with food. Overflowing. It's really really great and a pleasant way to spend a Sunday. Eating yourself unconscious aside, i really like this place. Ok, so it takes about an hour to be served, and you have to fight to get a table, but if you do then that's when the fun begins! I've had many a drunken night in here, i once broke my nose dancing on a table and bashing my nose on the low beamed ceiling. I know, i shouldn't be allowed out. A great pit stop for a local crawl, and you MUST go sample the roasts.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "EdV01iz7dyY5kzybZD-71w",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EdV01iz7dyY5kzybZD-71w/o.jpg"
      }
    ],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "73C0tZ3vs8SRd_b7wsNYPA": {
    "date": "2/7/2011",
    "text": "Great Venue, nice people however....Not very organized at the moment. Waited 1/2 hour to get table after asking specifically  about meals. Once we got a table they said you cannot order because the kitchen was over loaded???(2 pm.) At least we got a drink refund, so kudos for that but otherwise it's a bit lackluster which is a pity because the food looked good and the decor was great. Hope you have better luck.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LxLyqKGFhD7t_4Ydo9H3CA"
  },
  "zbiV1WqJaEvwA3plWLdvIw": {
    "date": "3/6/2014",
    "text": "The perfect blend of British Pub and hipster vibe. Good pint of Oxford Gold is always a positive way to end a day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9qkGxd39w-rriyFblhBhLA"
  },
  "lPq6_kFrMQavEhWmrzW08g": {
    "date": "8/7/2011",
    "text": "Owl and Pussycat was just lovely. Fantastic service. Great cocktails, Delicious food and nice atmosphere. Highly highly recommend!-Gin mojito is amazing, has cracked black pepper in it. -Rabbit salad was super tasty-Lemon sole melted in your mouthPie is one of best I've ever had-Lavender creme was lovely (burnt top part was a bit over-burnt though).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "r54LOO5dq4Ab3bX7gpmdAw": {
    "date": "2/19/2012",
    "text": "This is a good pub- fun- though can get very busy. Upstairs they have a restaurant- which serves up a good roast- though the last time we went they ran out of yorkies :( Go check it out though- great location and good atmosphere",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fN9JJudVPYcSOCKEXj_kfw"
  },
  "2OXnmOUKgUADid9zzZ1rvA": {
    "date": "3/2/2013",
    "text": "Total hipster hangout....a little gritty, but cool vibe.  Has a patio with a bunch of heat lamps and standard cocktails.  It was pretty packed, but didnt take too long to get drinks.  I would go back with a big group of friends and take over a section.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqOSpuFXffTisC1ahPbaWg"
  },
  "bl2Zcpl7DJZ-emD0D9XL1w": {
    "date": "10/2/2011",
    "text": "Delicious Sunday Roast! Wild Rock Oyster w/ Shallot Vinaigrette & glass of Nyetimber classic cuvee , red wine poached pear, goats cheese rucola salad, pork loin roast with veg and roast potatoes seemingly made with my own personal happiness in mind. Also had a nice What's up Pussycat? as well to wash it all down (Jack Daniels and Chambord doing a little dance in a frosty glass number).Liked it!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "eqZDCEtDXqVD5bBj93z58g": {
    "date": "12/5/2012",
    "text": "The name alone deserves a star! This is the kind of pub I like. Busy with cool people, great music, fast and cheerful bar staff. A place you drop in for a quick pint and then find yourself chatting away for hours and hours. Thumbs up!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0s7O1QC6l6Lswj_CtPaz5g"
  },
  "zD3o8X0eelxQhVxV1j_ptA": {
    "date": "9/8/2011",
    "text": "I like The Owl & Pussycat for the people watching.  If it's a nice day, this where I buy a beer and take it outside.  I walk across the street, sit on the pavement, lean against a brick building and take in the show.  An added bonus is the snippets of conversation to be overheard.  Classic stuff like, \"and that's what's so frustrating about being so creative.\"",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "lDjH33gdqnj6vqQgdKQk2g": {
    "date": "11/7/2010",
    "text": "Really nice Shoreditch watering hole - I can't believe I've never been here before! Full of local Shoreditch creative types but in a really unpretentious way. Lit how pubs should be lit (all warm and cosy) with a fair few corners to snuggle up in with a pint and a good book. They also do a tasty Sunday roast, although I still recommend Lock Tavern in Camden as the number one for Sunday pub roasts. Friendly staff, nice atmosphere, drinks that aren't too overpriced - all round winner!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "d1stW7Ut81mhCb160Jdkmw": {
    "date": "2/21/2012",
    "text": "A good pub considering where it is, a very Shoreditch clientelle, young, affluent and cosmopolitan.  An old pub interior that isnt trying to be a mockery of Victorian opulence, nice beer garden, good beer, if I lived closer, this would be a regular haunt and recommendations don't come better than that.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "xzXGf0_1zmh6Ae3H3oDmLw": {
    "date": "3/30/2012",
    "text": "It's probably good, but it was so full (queues for the blokes toilets) that it was difficult to tell. It's certainly popular. If you go here you'll probably end up drinking in the road outside, avoiding taxis, until you're asked to go inside at 10pm. At the back is a decent sized beer garden. Despite how busy it was, the wait for drinks was never too bad.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tG5F6llr3VBI7uxvo009Qg"
  },
  "7N-5kkO4bhij-HrUV-sNXg": {
    "date": "11/7/2008",
    "text": "Dirty? Check. Derelict? Check. Inexplicably full come Friday of expensively disheveled Shoreditch types that look mightily like that weird British jazz outfit, Polar Bear? Check, check. It really shouldn't work but it does.The Owl & Pussycat is my local, a pub located just a few doors down from the baroque Lounge Lover bar and the kind of haunt that Shoreditch is famed for. There's nothing particularly outstanding about this unprepossessing little East End boozer except the fact that it is, quite literally, more than the sum of its sub-par parts.With a cute beer garden and just a handful of tables, The Owl & the Pussycat is inclined to become so busy that you might wish to crowd surf out of it. Invariably there is one member of bar staff on which means that it can take a long, loooooong time to get served but somehow it's worth it.The Owl and the Pussycat may be a bit of a dive but it's my local dive and I love it.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "j8fZ1NtpZ4ISiNl7xL6rjg"
  },
  "-NCoVxiYUrgCR2cuYFRsIA": {
    "date": "2/1/2010",
    "text": "This sweet little pub on Redchurch Street is so old fashioned it's reminiscent of an old irish watering hole. I came here recently for a sunday roast which is served upstairs in a quaint room full of tables dressed with red and white checkered table cloths and green carpet. The was delicious but I have to say a little pricy for my liking for a huge plate of lamb, all the veg and roast potatoes you like it costs £15. Compared to other pubs who only charge £10. They have a beer garden out the back which is cool during the summer months.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-eeZvfN-v-MvLIxQ0AHLQg": {
    "date": "1/22/2017",
    "text": "The Sunday Roast options here were definitely better than the versions I've had at pub chains such as Wetherspoons. I ordered the chicken and the beef roasts and liked both, although I'd recommend the chicken since the meat was cooked to a much more tender and juicy state.Both dishes arrived with parsnips, carrots, kale, potatoes and a large Yorkshire pudding, all drizzled in a tasty gravy sauce and the chicken option also came with a bread sauce. I left that alone though, much preferring the signature brown gravy sauce. I don't think a pub can get more British than this - the name \"The Owl and the Pussycat\" itself screams quirky English. I had an enjoyable dining experience overall.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GVN8yz3qvD9t2em9DdBBkA",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom. Sunday Roast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GVN8yz3qvD9t2em9DdBBkA/o.jpg"
      },
      {
        "img_id": "PJb5dvxJ1ywC6RgJLlK8uQ",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom. Interior of pub",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PJb5dvxJ1ywC6RgJLlK8uQ/o.jpg"
      }
    ],
    "user_id": "7psPwLsFJfHyqZkn7ifbDg"
  },
  "w9ZElzxLqLb8sPTtGyigjQ": {
    "date": "11/25/2017",
    "text": "Nice traditional pub...great spot to grab a pint. In the winter they have a fireplace going inside and a lovely patio for sitting when it's warmer out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "17SdfPrR4W7v5RGr9HGGEw",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/17SdfPrR4W7v5RGr9HGGEw/o.jpg"
      }
    ],
    "user_id": "vOwB54Bn2fhtHgDz3BTOBw"
  },
  "ycRKjL7LC6sM3p5drEUCCQ": {
    "date": "10/6/2017",
    "text": "We came here for a pint after dinner. We had a great experience very friendly staff nice vibe. 30s-40s crowd, really nice patio in the back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccuJziXYstN2FfnIZeBwTw"
  },
  "p6i9qF5P82Xp-gAg4y3CKQ": {
    "date": "8/1/2015",
    "text": "Great place for the random pint and a nice snack.Very nice beer garden although a bit crowded sometimes. The.music is usually not to loud which makes it perfect for chatting with friends.Staff is very friendly and service is fast",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uC2kJI2I5o6MNooLd-c4cg",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom. Beer garden",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uC2kJI2I5o6MNooLd-c4cg/o.jpg"
      }
    ],
    "user_id": "k5Og49Q964NHdw9wZpBzOg"
  },
  "ljZygY6boK8S7VUT8AFLvw": {
    "date": "7/6/2015",
    "text": "A few words.It's the pub closest to the office. For this reason it makes my working week easier. Every-weekWthout fail.5 Stars.Done.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FYqdClyfBa5mzh2kotOCwg"
  },
  "E3A3hcgh3ss325yeFd_wCQ": {
    "date": "2/15/2016",
    "text": "Not a bad local boozer even if it has been taken over by Geronimo Inns. They have fixed upstairs so it's more comfortable. It even has a decent cocktail offering. Our favourite back 'garden' is still there which is great in the summer if you can stand the intensity of smoke fumes. A mixed crowd of local retail workers and office types frequent the space, get in early to grab a seat. Bar food is not the best, was mostly cold and felt like it was cooked from frozen, but a good selection of beers on tap and wine makes up for it.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSarwBVof9J8X8QaJr4_aA"
  },
  "HEBG56EoOlPt3A9dXZETkg": {
    "date": "2/28/2013",
    "text": "Imma fan of Owl and Kitty. Just the right amount of crowded for a post-work Wednesday drink, quick bar service, dive-y but lively atmosphere, outdoor space (with heaters for cold nights), fireplace and a seating mix of chunky wooden tables and armchairs.Nothing fancy, nothing amazing. Just a nice little pub.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "k0lSmDH4pQa5cRPjvyeHmg": {
    "date": "5/13/2015",
    "text": "Didn't try the food, but it's a great place for a drink. It's really cosy and warm in the winter with comfy chairs and fire places. In the summer there's a big lively courtyard at the back.The only downside is that you often have to wait for a seat, but being busy gives it a good atmosphere. Prices are average for the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YWwWLHjdS69wTKobZHVTzw"
  },
  "sKpQRdpo41-xBmDdpU_zKw": {
    "date": "11/12/2012",
    "text": "Lovely pub with an equally lovely atmosphere.Totally Shoreditch, this place is nicely quirky, rather rustic and suitably priced. Expect lovely old exposed beams, low ceilings, uneven walls and odd nooks and crannies.With it's own beer garden (for if you like the outdoors) and a great selection of beers.A really lovely place to have a relaxing pint, I just adore this old building and that they have left this in it's natural state.Although beware, it can get busy after work hours and on weekends in the evening.I haven't tried the food, so can't comment on this!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "UNhmYPQwVGVwFxR40sX6nQ": {
    "date": "5/24/2014",
    "text": "Big thumbs up to the service! But..... (yes, there is always a BUT!) the food is sadly distinctly average... in fact, I was wondering if the roast beef lunch I had on the Sunday was any better than the roast dinners I had back in primary school....So here I was, back in Shoreditch for another lazy Sunday roast. Not my first choice of venue, but since everywhere was packed and my friend was feeling poorly and restrained to Shoreditch by an invisible elastic band,  we made the decision to resort to Choice F on the list. If you have been to the Owl and the Pussycat before, you'll know that it's almost a Shoreditch institution on Redchurch Street. It's a great low-key drinking establishment, with the usual Shoreditch hipsters, but for food? It was a huge let down I'm afraid.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7w4rQlGWOXAscCjCaVSSw"
  },
  "6JfQ7Ifi9TNWefh7K6iKGg": {
    "date": "3/28/2012",
    "text": "I really liked the Owl & Pussycat. I hope I get to come back here again.The decor is old fashioned wood hipster. As are the staff, hipster central!The roast was really really good for a pub roast. It would have almost have been the best if the food was a little hotter and there was more gravy. You need more gravy for a yorkshire that size! And a damn good yorkshire it was too.Took a star away partly because of the roast, but mainly because at one stage all the staff behind the bar in a very animated conversation (I mean animated, arms were a flailing), when at least one of them was meant to be making two bloody marys for people in our group. The drinks were promptly brought over once the staff were finished their discussion. The report on the Bloody Mary? OK, too much spice particularly worcester sauce. So if you do order one, ask for half the spice. They do accommodate this.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oGq5iamXbsbIanMS2SXdWQ",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oGq5iamXbsbIanMS2SXdWQ/o.jpg"
      }
    ],
    "user_id": "OKb9efElW-pD0dsQvPErYA"
  },
  "OhUSLan32Or3XmqLIFPe5g": {
    "date": "10/1/2014",
    "text": "This was my first visit to The Owl & Pussycat and I wasn't disappointed. I've walked past the pub a few times and it always seems to be busy and this was no exception. There is a good sized downstairs bar, a slightly smaller area upstairs and quite a large beer garden and all were busy. Even so, there wasn't an issue with getting a drink and the service was good.Price wise it is fairly competitive and even though I didn't eat I did see plenty of burgers coming out of the kitchen and these looked really tasty and seemed to provide value for money.Even better is the quiz night on a Tuesday. Get yourself along and I might see you there!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfM4mH3T3xJspJfOGbJIsQ"
  },
  "mTOBCC7LiqmGPBEfqx9ACw": {
    "date": "11/13/2013",
    "text": "It was a gorgeous night.....But from the beginning...:)Friends and Family visited me in London last weekend, so I thought for the first evening(and a friday) the best thing to do would be a pub.I knew the \"The Bowl and Pussycat \" just from the outside, cause it is next to an art gallery, but seemed to be popular.We went there at about 9pm and it was FULL of people, but lucky we...we got a table (five persons)loud music, dimmed light and a lot of drunk and happy people...and in shoreditch, what I like most, always some special people with fantastic stiles.So a typical english pub. ;)But it seemed to become a bad evening...Cause we were very hungry and when we ordered, a waiter came after 5 minutes and told us that there is no cheese and chicken anymore....the menu isn't very long and we all ordered something with chicken and cheese.But after I told them, that its my families first day in London and that we don't want to be upset he tried everything possible to get us satisfied.To sum upwe had three beef burgers with fries and two salads with the last and only chicken breast, a lot of vegetables and nice dressing. And all of us got a drink of our choice for free!Everything tasted very good....the burger was awesome !And the atmosphere was best...good music and nice drinks.So it was a bit difficult start but in the end we had a lot of fun.Prices were ok....typical London.I will definitely come back ! ;)",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "82OnjxFeTuI5QWbXh9q2cw"
  },
  "FtEFGRZ3hWqTQBXlhTnVEA": {
    "date": "10/27/2013",
    "text": "In my opinion, this pub has a charisma of some sort. It is a pub in a fairly quiet street which is very unlikely you'd bump into unless local or you know about it. Still it gets super busy super early with nice crowd of dudes of all sorts. Big plus is a beer garden, which almost grows to be a big mash up actually - So busy!Great place to socialise!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-DLyf0EB5WYbt8lRR0vCKQ"
  },
  "2hB1QN7vE57as6EO1xNpBA": {
    "date": "3/27/2011",
    "text": "I've downgraded my previous 4 star rating to a 2-starnot sure what's being going on with the Sunday Roasts in the past 2 months. Have been here 3 times during that timespan and my husband's beef roast was poor every time, today's serving being the most hideous (I've uploaded a photo for reference). That said, the veg roast was absolutely fine  note in the meat photo all the vegetables were gone as they were nicely done. But £15.50 for a cheap cut of meat which was difficult to cut, fatty & chewy, along with some veg, is not on. Despite the questionable quality on the beef we've returned since we like the place..but won't be any longer. Please guys sort it out!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iuIuTO0t6AxBhQgIfnNKkw"
  },
  "p9KUSz-vwqxbko9iXR6RGw": {
    "date": "11/23/2014",
    "text": "Nice place for a beer on a friday! Lively crowd and friendley atmosphere. Didn't try the food thou...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dlP1tJUGaesNarGtiLvU6A"
  },
  "McTX78TNiTSAxMii9vTAtA": {
    "date": "8/1/2015",
    "text": "Really enjoyed the afternoon in the beer garden! Expect to pay a fiver for a pint but then it's Shoreditch... Overall a good place for drinks with friends!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t0SYOGvPiKlxFfEW1GzZ2w"
  },
  "LmG94kRnYZZ0tBE_xqsUMw": {
    "date": "11/28/2010",
    "text": "If you don't look for it, you'll never find it. My friend excitedly led me down different Shoreditch alleyways after I had requested that we dine somewhere cozy in the middle of the day. He assured me that I would love the food and that I would trust his opinion much more after eating here, which I do.Owl & Pussycat is dark, barely considered even dimly lit. We grabbed a small table that held a bucket of condiments and a pink flower in the front room, but it seems that there are larger rooms in the back (and quite possibly even outside). The front room had small tables right by the bar, and I could see that another room consisted of booths and sofas for those who choose to lounge and get a little closer. After settling down, we decided to order a lamb dish, mussels, and duck fat chips. Everything arrived at our table simple and beautifully prepared. Without even tasting the lamb, we both knew that it would melt as soon as it hit our mouths. The scent of it carried and people walking in peeked over our shoulders and headed to the bar, pointing over at us, mouthing the words \"i want that.\" The mussels came out in a large steaming bowl, drenched in a butter, garlic, and white wine sauce that I doubt anyone but the chef could perfect. I savored each little mussel and even tried to drink the soup (sauce) before my friend stopped me and told me that it was \"weird\". The Duck Fat Chips were a side dish, and I am glad we had ordered them. Before these babies, I had always thought chips were chips, whichever way you cooked them or seasoned them. Wrong - there is a difference. We left completely satisfied and agreed that it was a hit, not a miss. The menu, I think, changes from time to time. This doesn't matter, though, as I am confident that everything is delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZTKf0aocPqNjfZRNiJsNag",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom. Done and done.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZTKf0aocPqNjfZRNiJsNag/o.jpg"
      },
      {
        "img_id": "6RjxpOoCR8pCK9TImGyZ4w",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom. Mussels",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6RjxpOoCR8pCK9TImGyZ4w/o.jpg"
      },
      {
        "img_id": "MltUeAldFOXdl8OYV1NWMg",
        "caption": "Photo of The Owl & Pussycat - London, United Kingdom. Lamb",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MltUeAldFOXdl8OYV1NWMg/o.jpg"
      }
    ],
    "user_id": "TZ1NNJeGd6CQksIDmlgpNg"
  },
  "B3upMXpkujZSIohgVnNvCw": {
    "date": "8/21/2014",
    "text": "A fun pub with two levels and outdoor seating.  Bartenders are friendly and provide excellent service.  A fun atmosphere on a trendy street.  Easy to get to from the Shoreditch High Street.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gfmf4kQjVT4Ds2eNZCuHMQ"
  },
  "Uxmhipztio57Ll6w6A6Cpg": {
    "date": "5/2/2012",
    "text": "Oh I'm such a sucker for a nice pub. One with no frills, just good service, nice selection and a bit of  beer garden.  This one ticks all the boxes for me and I've had many an afterwork drink here. It gets rather crowded with teams from local offices towards the end of the week and people tend to spill out on to the street. To me, this just adds to the atmosphere, especially on a sunny evening. In winter, the open fire is the perfect spot for a glass of red wine. One of my favorite things would be my trips to the bathroom- the walls in the loos are covered in graffiti- from secrets to expressions of love, its hilarious and I always leave giggling. It seems to have a \"traditional\" menu, haven't tried it, but have admired from afar!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6CTsPvbkavrH-FZmKbS5pA"
  }
}