{
  "sgxDnc5JqxR_PFGYGt0H8A": {
    "date": "4/30/2012",
    "text": "This was absolutely my most favorite meal I have ever eaten anywhere! I have eaten at a lot of great restaurants in many countries and the food here was exceptional. I had a 7 course tasting, and each dish was rich and delicious, with new flavors I have never had before. This is an Anatolia style Turkish restaurant. I want to go back to London just to eat at this restaurant! Please go if you are ever in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTcouksb9jyzANKONPkojQ"
  },
  "ZFsdxD51Y0ThmZFKut28Jg": {
    "date": "5/20/2009",
    "text": "My favorite place to eat in London. Everytime i visit London I have to make a visit to this fantastic place. The food is excellent  esp the Baklava. They have a lot of veggie options but I usually have the Moussaka (Shredded Lamb) or the Tavuklu (chicken)The ambience of Tas Pide is wonderful and relaxing. After a long day at work, it nice to relax at such a peaceful place. And offcourse once you are done you can go for a lovely stroll on the Thames. Enjoy...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tamdZeemMa-cogpjnmomhw"
  },
  "W4O1GaWbePOLnOBbUkxjIA": {
    "date": "8/5/2008",
    "text": "what a shame the previous reviewer had such a bad experience. I have only ever been pleasantly surprised, both by the food and the staff. this is definitely the best in the TAS chain of restaurants, if indeed it is part of the chain  the others are rather restrained and minimal while this is beautifully decorated.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "4U7A8YihfDpWjr4VtF5maA": {
    "date": "9/7/2009",
    "text": "Great food, just what you'd actually excpect in Berlin or so. The Meze's are amazing (epepcially the veg ones) BUT don't try the wine (arghh) FOOD: 5+ starsWine: 0 stars All in all, I'd still give it a 4, as we did go for food rather than drinks",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "g5LQ7zz--g4jrppf6OK_1w": {
    "date": "9/20/2013",
    "text": "What a great day in London! Pouring with rain and ran into this place to escape. Delicious food, lovely decor and really fantastic service -- did I mention the delicious food?! I had the pide with artichokes and my companion had spinach and feta, both fantastic. You also get free bread,  dip and olives to start and pickled cabbage to go with the pide. We finished our meal with a piece of house made carrot cake and a Turkish coffee. Pide is between 7 and 8.50ish pounds. Yum!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ikHHk_fcFW9kw3laRNj3A"
  },
  "Ell9f7BHIyn2bU_eiBPkkA": {
    "date": "5/29/2008",
    "text": "I have to give this place four stars for food, but only two for service. I won't rhapsodise about the food, others have already done so. Suffice it to say, the food here is faultless. The service, especially front of house, is quite something else. We went with a group of friends having made a reservation for eight people at 8.30pm on a Saturday evening. We arrived at 8.35pm. The place was heaving and there was a party of four in the queue ahead of us who were given a suspiciously large table set for eight people (which was subsequently broken up to provide two tables for four people). Front of house staff then disappeared for a further 10 minutes. When we called for attention, a member of the front of house team arrived and was very off-hand. We stated that we had a reservation for 8.30pm and had been waiting a while already. We were told that the table had been given away because we were late by 15 minutes. Given that we had arrived at 8.35pm but not been acknowledged, and that the table had been given away within our sight at exactly that time - we sensed porky's being told. The member of staff in question was very belligerent, an experience quite outside my usual one when at this Tas branch (or any of the others for that matter). I can only assume we got them on a bad day. It was disappointing. We walked over to Ev instead (also owned by the Tas group - but no Pide) and had a nice meal there. It was sad to see an otherwise excellent restaurant, which displays extraordinarily high standards for it's medium price range, be so let down by such poor service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVMLxovuKxzxHfYr7ul7Ug"
  },
  "ZKE8iBaNvE7yXzD-PV7apw": {
    "date": "6/1/2013",
    "text": "We love this place. We dined here for the first time on May 24th with my husband and 2 other guests. The food is excellent, decent prices for the London, great service, our waiter Fabreizio was just adorable and very attentive.  We loved it so much we went back again the next  night.  Will definately go back when we next visit London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0SLAg-duMTFwvS7C0aAkWw"
  },
  "uUcdX_D63Iekpd6UtlExEg": {
    "date": "11/15/2008",
    "text": "Tas is very popular and I was very happy to visit this extension on the Southbank. We made a reservation to avoid disappointment.Like the other branches, seating is quite close together, but this restaurant has a different, more rustic feel about it. We had a pide and the food was absolutely delicious. Comparing it to other pide restaurants though, I think prices are a bit high. The wine list is similar at all Tas locations, and wines seem to start at 15 pounds per bottle. The staff was friendly and helpful.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "S15ZG_VTsI4irKqdgjHMDA": {
    "date": "2/7/2009",
    "text": "Was a very enjoyable visit and great to find some interesting and great quality cuisine in an otherwise very touristy track. We enjoyed a great selection of starters and a pide for my main. I actually left my bag in this place and the staff were very helpful in setting in aside for me to come back the next day. Good if you are in the area and fancy something a little different!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RTQ6k83yqvq_McLVWu_E0g": {
    "date": "9/14/2009",
    "text": "Good place if you're going to or coming from a performance at the Globe. Staff are unobtrusive and efficient. Food was a bit on the bland side but it's cheap and the puddings are excellent.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xIRaOWy-c5rY3dQKFqWl0A": {
    "date": "6/26/2011",
    "text": "I really liked the quirky interior of this restaurant. The atmosphere was good when we went on a Saturday evening. We went a bit later so I think most of the theatre goers had left and it was a little bit quieter than I would have expected but there was a band in the corner which made up for it. There is a wide variety of choice, both vegetarian and meat, which is especially good for me and my boyfriend who are vegetarians. We both went for a pide and found they were a little bland but it was nice to try something different. My parents went for meatier options and both enjoyed their food. The baklava was delicious, and the Turkish coffee pleasantly strong. The main drawback for us was the slow service, and it wasn't even very busy. My dad had to order his beer twice before he received it. They weren't short-staffed as there were a lot of waiters standing around. Overall, a pleasant evening, and good value. I would recommend this place to vegetarians especially just for the wide variety of options that they offer. (Sometimes difficult to find when going for a not-specifically veggie restaurant, with meat-eaters!)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ulnMUaQDYzDCZ-Bv1fPOUQ": {
    "date": "1/8/2016",
    "text": "Great atmosphere. Not so great service. Oh, and completely unable to accommodate a vegan.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_WZZefp-vdNlvVmGWm14Dg"
  },
  "TBQlKweBKw5x17gceWvyYQ": {
    "date": "6/5/2013",
    "text": "Wow, excellent food. I went here before seeing a show at the Globe as it is literally across the street. Fluffy bread was served with yogurt dip and marinated olives. I ordered the Sahan set meal for 9.45, which was well worth it - a feta salad and a pide, which is kind of like a Turkish pizza, I guess. You can also get a more calzone-like version.The feta salad: I was not expecting much, but it was actually rather incredible. A dressing of balsamic glaze and lemon with mint and dill made it outstanding. The pide: minced lamb and red pepper, perfectly spiced, in a baked? fried? crusty thing. It really hit the spot.My friend had some delicious dolma and a different pide, with lamb and cheese. There are a number of vegetarian options, but gluten-free might be a problem.The desserts looked delicious but we were too full from the pide!I'm deducting one point for waiter service. I wondered if we were actually in the Anatolian deserts as I could not get a glass of water for the life of me even when my friend received her drink; finally asked a different waiter and still took him five minutes. Still a great restaurant for food and atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks-RuwIQU_7oA5Sstor67g"
  },
  "jucSA0nR9I_4zre0UDGFBA": {
    "date": "11/4/2015",
    "text": "Nice and calm place (at least when I went) with good live music, not too loud. Well located just by the Tate Modern. The service is kind. Both the starter - I don't remember the name - and the pita were as good as to maybe come back. Unless you are really hungry, one pita is enough for two people.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbI5gLtui5o9A8L_KeenQw"
  },
  "a3Ol1-yAa-s9S5nfIQKbTA": {
    "date": "8/22/2013",
    "text": "Now I love Turkish food - meze, hummus and the whole atmosphere. So when I booked tickets for the Globe I thought to myself, 'right PERFECT chance to try Tas Pide.' Right by the theatre, looked quite busy but I had about 1 hr 15 mins so perfect to grab food before the performance.Lovely waiters, menu looked AMAZING and I wanted to sit there for about 6 hours and slowly eat all of it.. Before exploding from gluttony of course! But I restrained myself (casual pat on the back there, thank you very much) and ordered small. Nothing worse than feeling too full at a theatre performance, totally takes away from concentration. Now despite me ordering small, I received my food 15 minutes before the performance was due to start. That's about 45 minutes of waiting after I ordered. For not very much, mainly cold food. Super disappointing.I however will go back; the food was AMAZING. So tasty, shame I had to shovel it into my already big mouth and run.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xpNl1ieZjanC54qQT9Y9Tg"
  },
  "06qGsAjSJuGV2ahjC_0Rfg": {
    "date": "1/25/2014",
    "text": "Took some friends here for lunch on their suggestion and it was a great choice.In the street down beside the Globe Theatre, this is easily found by public transport.Being all vegetarian, we shared the haloumi style cheese and a wonderful broad bean and yoghurt starter. Then we had various vego Pides.There was complimentary bread and olives too.I recommend it as a stylish great place to eat that won't break the budget.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIpGqo5f4FZfrlkqVESjTQ"
  },
  "FuJnZ-U_CNX4JE_hjifw8g": {
    "date": "3/23/2013",
    "text": "Tas is such a find. We have visited a few branches in London and each meal has been delicious and each welcome has been warm. This time round we headed to tas pide by the Globe theatre after enjoying a Prosecco or two (or three...) and consequently I was rather overwhelmed by my delicious cheese and leek pide....my own fault! Our waitress was so upset that I hadnt finished my meal that she brought us a dessert to share plus two mint liqueurs!.Warm service, lovely house wine and bargain prices. What's not to like?",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Db5vZmOWhCsWsQZs5VQkzA"
  },
  "dq-gF1GPLJrHvKfXiDrb5Q": {
    "date": "6/11/2013",
    "text": "This is a spot right next to the Shakespeare's Globe.  The first time I came here, I had just a quick drink but the next time I came, the hubby and I were ready for a nice meal after a couple drinks at the Oyster Shed.  Service was pretty good compared to what I am used to (still not saying much), but better than expected.  This is proper Anatolian Turkish cuisine which is different than other Arab places but still super yummy.The stars were what we ordered.  We started with some homemade turkish bread with olive oil. We ordered a couple drinks: glass of champagne and a beer.  Then the mains: Iskender, which was lovely, flavorful and rich.  Also the mixed grill, which was a bunch of different meats which were equally delicious.  I am so ready to go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "Jnzhd_57VDhh5iy5lRVlPQ": {
    "date": "7/7/2012",
    "text": "I really love to go there after Vinopolis. But even sauber, it's great place to get some authentic Turkish food.Good quality, good value and friendly staff. Though the seating might not be ideal for a romantic date :-)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hKxGfO_Dsm0xrWJoQYeh3Q"
  },
  "_Vq5TQOqazUnqpCvvwyHIA": {
    "date": "5/26/2015",
    "text": "We went for a pre-theatre meal here, I thought overall it was excellent value. The mixed mezze to start was great and it arrived quickly (which was great as we were starved). I ordered the lamb kebab, full of flavour and delicious, not the biggest portions but that was fine. My boyfriend had one of the pide and that looked delicious, probably a lot more filling too if that's what you're after. We shared a delicious dessert that I can't remember the name of, but it was like shredded wheat soaked in honey, thoroughly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHbFWmylpET8oscqlx-rCw"
  },
  "esGA3nlQl_g-Yw9Go9zEgg": {
    "date": "11/9/2014",
    "text": "The food quality is not as good as the food quality in the Tas restaurants in Southwark or London Bridge... And it's more expensive...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwaaZ1cZiTGNhuPl97qPEw"
  },
  "HuJfXI0j-7LOy1P3LkG8pw": {
    "date": "7/7/2015",
    "text": "A delight, just near the Globe Theatre. A nicely diverse menu including plenty of veg options. a pide is like pita bread made into a small pizza. YUM!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8Mhmc5DbhmPSdpU0sebMg"
  },
  "z9M9HNB3R6MWL65hNzvyNA": {
    "date": "12/24/2008",
    "text": "Tas restaurants are a small chain of Turkish restaurants, mostly in South London. This restaurant, beside the Globe theatre, specializes in Pide, which are described as Turkish pizza. Unlike most London Italian pizza there is not much emphasis on the cheese and tomato base. Instead, they are lighter, spiced and herbed - with a variety of toppings. The set menus are really good value here. There are a couple of mezze, a vegetarian option and another which includes a starter and pide.The service is attentive and quick. The décor is inspired by traditional Turkish restaurants, with lots of richly woven fabrics.All the food I have had here has been good. I would particularly recommend the calamari, borek as well as all the pide dishes. Additionally, it is worth leaving room for desert. There are a few that look good, but the one that I usually go for is the sundried apricots stuffed with pistachio and cream. It may sound a little underwhelming but it is delicious and works perfectly with a cup of Turkish coffee as an end to your meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sC1maHXjpr3mv5In-pCupQ",
        "caption": "Photo of Tas Pide - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sC1maHXjpr3mv5In-pCupQ/o.jpg"
      },
      {
        "img_id": "dSy3SOGfUopB1G-1ipk3Qg",
        "caption": "Photo of Tas Pide - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dSy3SOGfUopB1G-1ipk3Qg/o.jpg"
      }
    ],
    "user_id": "lHjrUujYLS-cOu--fnXCJQ"
  },
  "vhohOCzcCUTya-5kg2DdNw": {
    "date": "5/17/2010",
    "text": "I've never heard of pide before, even though I've had some Turkish food. I got the Mantarli Ispanakli, which is one of the vegetarian pides. No, I'm not vegetarian but when there are veggie options available that look to have sufficient flavor, I'm open to trying those over the meat options.Fortunately, I was right -- the combination of spinach, mushrooms, garlic, and egg (even after asking for the cheese to be held out -- I'm lactose intolerant) packed plenty of deliciousness! I also tried the red lentil soup which was also very good.The restaurant was quite busy on the Saturday night, which I guess should be expected with it being so close to the Tate Modern and Shakespeare's Globe Theater, so make a reservation if you can.Prices are cheap for the quality of food you get.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkmypny5H5-kFJR2LfbRcw"
  },
  "tc35zsfo92b3UFbkZ4Pn6w": {
    "date": "11/10/2010",
    "text": "Nothing special about pide. It's like wannabe pizza. I had one of the lamb pides. Waitress said it was her favorite...ugh...waitress must not have a very good sense of taste. It was a little bland if you ask me. I also had the calamari to start. It was good - most calamari is. They didn't serve it with any sauces, though. I'm sure I could have asked, but it was quite a small serving, so I didn't see the need to bother. Some of the meat and seafood dishes sounded good though, so maybe I should go back and try those.Oh, and one plus is that they serve complimentary bread and soup that were pretty good. I love anything complimentary. ;)The place is charming as far as ambiance and decor, but if pide is their specialty, then they're definitely lacking in terms of tastiness.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "haxK-nxfmeLG0fA-nnLGJg"
  },
  "aEPfxLGUh-GVnlC6CPaVow": {
    "date": "8/14/2012",
    "text": "This place is a must.  Fresh aromatic Turkish food that is super fresh.  Nothing here comes out of a frozen bag.  The lamb is real and not some Spam-like version.  The pides are thin and crisp yet doughy inside.  The yogurt, olives, and red cabbage that come with your meal were amazing side dishes.  The restaurant is located across from the Shakespeare Globe Theatre; a perfect complement to a night-out watching a play.  The mineral water, yogurt drink, and desserts are also Mmm Mmm Mmm good.  Sit outside but be warned to smokers!  Servers  are from Turkey and so English seems to be their second-language.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FS6jc-r3WliJQy14cll7_A"
  },
  "C2qw0ynE93sW4L3LDWxEQA": {
    "date": "9/8/2013",
    "text": "A nice Turkish restaurant, it was certainly a pilgrimage though, the Northern Line south to Leicester Square, the 29 bus, 3 stops and then a long, but lovely walk. I had a sort of flat bread with Lamb, Eggs, Tomato, Aubergine and all sorts of summer vegetables. The one downside was that the restaurant was quite loud and dingy inside, not unlike a Turkish prison!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XmZqDvJ5MZ6uG1_GEdNzZA"
  },
  "6BW2FZaFBlY9qxlNPph9vg": {
    "date": "10/9/2009",
    "text": "Not that I do, but if you had a Turkish Grandma this is kind of place she would go... or run. Everything on the menu has some amazing turkish pronunciation that I am POSITIVE that I slaughtered, but by some miracle we actually got what we ordered, and it came really fast too. when we first got there we were just looking for some light food before the play at the old globe started. We got something that I thought was going to be similar to spanokopita, it was bad for us, but it was so yummy. It was basically fried spanokopita. yummm. The service was nice, but the host was a bit rude, but I am sure that was just because there was a rush of other people going to the Old Globe show too.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "rwsmB7F17PeaydY0k4T4bg": {
    "date": "12/30/2012",
    "text": "Great and fresh food, super service, reasonable prices,  I recommend it to anyone that wants an introduction to Turkish food and any middle east food lover.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0sysEQaKwOpV-Su4YARZw"
  },
  "_BPUa9iLiHDlMqHolJ63wg": {
    "date": "5/3/2012",
    "text": "Great food. There is little else to say about the food but the staff could have done with being friendlier. After taking payment for the bill the waiter did not say thank you! Also a fairly scary front of house lady who simply stands and watches people eating. But the food is great (did I say that already?)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkepO2v8ZvtbnEga8xtU5Q"
  },
  "JQWP0EQ-py1bjrDyVldMDg": {
    "date": "1/27/2009",
    "text": "Stumbled across this place as we were leaving the Tate Modern.  The specialty here is dish called a Pide which I fondly call a \"pizza boat\".  Basically it's a doughy crust - a little softer, tarter, thinner and less chewy than a pizza dough - shaped like an American football with the edges turned up.  On top is a variety of veggie or meat options.  On the menu there is probably a dozen variations.  There is not a sauce - or at least not a tomato sauce.  The cheese is rubbery/chewy (in a good way!) and diced - the pide has been cooked and served warm but this is not the kind of cheese that gets really melty.  Toppings vary but I had the one with dried apricots and it was delicious!Prices seemed very reasonable.  Service was okay.  The place is CRAMPED.  Tables are basically on top of each other.  Our table was separated from our neighbors by approximately a centimeter.  I felt we should have introduced ourselves!  This place was an unexpected find buy very tasty.  I wish I could find a place like this back home.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ds9kLHT1mPqzVcm_XRIXiw"
  },
  "EwX6er9H4_AJciMKXbErQA": {
    "date": "7/20/2018",
    "text": "First time eating Turkish food and had two in our group who have traveled to Turkey and attested to the authenticity of the dishes and the deliciousness of the food.This spot is super convenient for attending a show at Shakespeare's Globe as it is directly across the street (which we were doing) and was easy to jet over to the Globe before our play.Food was delicious and prepared beautifully!! I had the Globe Menu which allowed me to choose several dishes and a drink for only 20 pounds and was a great introduction and way to try several types of Turkish food.It was definitely a crowded spot, but everything was very clean; the service was prompt and attentive (we were a walk-in with no reservation and had very little wait); the food was amazing; and there was live music playing that was lovely. A definite recommendation for dinner before your Shakespeare Globe Theater play and delicious food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DayvTQ_pW5asY1gEKufK5Q"
  },
  "Ad6zpa3cY7Mx9IaBBX2csg": {
    "date": "9/17/2018",
    "text": "Great restaurant with helpful staff just around the corner from the Globe Theatre. They have a theatre menu and the restaurant was packed with people going to see plays     Each dish was beautifully seasoned and presented. I suggest you make a reservation or come early.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cswZPTfrQeh9-Q8V2VevVw"
  },
  "99tr09p-K94dpTSLB1AcJA": {
    "date": "6/6/2017",
    "text": "Was going to a production of Shakespeare's Twelfth Night at the Globe. Was looking for somewhere to escape the rain and find a bite to eat before the show. Tas Pide is right across the street. They have bright outdoor seating if you are lucky to have nice weather. Inside is a little dark and cozy. Tables and chairs are lower to then usual and close together. I went for a Turkish pide with feta, leek and tomato. It was kind of like a light, healthier pizza. It was nice, I agree with if other reviews that it lacks flavour. Service was efficient. Loved the live music.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8aS3eQLBQYYW-GH3yoWjsg",
        "caption": "Photo of Tas Pide - London, United Kingdom. Baklava",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8aS3eQLBQYYW-GH3yoWjsg/o.jpg"
      },
      {
        "img_id": "LG27osn3dnpn90MXBjFItQ",
        "caption": "Photo of Tas Pide - London, United Kingdom. Feta, tomato and leek pide",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LG27osn3dnpn90MXBjFItQ/o.jpg"
      },
      {
        "img_id": "izBcPf42lUy5a-MZeKDkXA",
        "caption": "Photo of Tas Pide - London, United Kingdom. Olives, bread and dip",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/izBcPf42lUy5a-MZeKDkXA/o.jpg"
      }
    ],
    "user_id": "yYLM95gl0mlNF53GBTApFA"
  },
  "4aGtU5T_HB6posM2xWIkNg": {
    "date": "8/17/2018",
    "text": "OMG, the food here is amazing.  Brick oven makes for some stunning bread bases for sandwiches!  Beer for the night, nice selection.  Onur Ediz was our waiter, he was really funny and helpful at all times, he really made the visit memorable.  Great spot near the Globe Theatre, don't miss it.  Fabulous fabulous food. Beautiful atmosphere, live Turkish music made the ambience lovely.  HIghly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fC-3FKfcQ-TA4Ac8hbMmog"
  },
  "mNZEY75KUKd3KUwnqG1PIQ": {
    "date": "2/27/2017",
    "text": "Nice spot for dinner on the south side of the Thames next to the Globe Theatre. I guess \"pides\" is a popular Turkish dish. I never had it before but it was lovely, flavourfuñ and prepared by wood fire. A gentleman was playing traditional Turkish music on a lute/sitar like instrument. Toilets were impressive with stone and nice floor tiles. You don't see such attention to bathroom detail in the States usually.  The chairs were a bit on the lowside. It was a bit of a challenge getting up. Watch out for 12.5% service charge on the bill. They don't exactly point it out to you but that might be custom in these unfamiliar parts.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "dfgPj43FVRnKIfxjLclqTQ"
  },
  "1E-gFyOSEAYmLWI74NwECg": {
    "date": "1/11/2017",
    "text": "After searching everywhere in the area for food around 10pm on a Tuesday evening, we were finally seated as Tas Pide by a very kind and enthusiastic host.Upon entering the warm and cozy dining area, we were quickly provided menus and bread/dips to start. Since the restaurant was known for its Pides, we both ordered the set menu of a pide and a soup. The lentil soup was very delicious and the pide was light but filling. Neither of us could finish our pides (one was the ground lamb with an egg on top and the other was the leek with cheese) and took them to go. Throughout the night, service was excellent, and the overall bill for two set menus and two glasses of wine was 40 pounds which was fine given the crazy prices in the city.We would definitely come back if not for anything but the warm and kind service we received.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3vGiPNH4yCAj88-kfdvbjw"
  },
  "4jPt7PgSWr-lXk7NIRv4mg": {
    "date": "8/12/2017",
    "text": "Yum! I have never had Pide before, and now I have no idea why! This place was delicious. The staff was all so friendly and helpful. I stopped by before our show of Twelfth Night at the Globe, and I am so glad we did! Their lunch special is very good. The portions were perfect. My personal favorite was the pistachio pastry dessert! YUM! Not too sweet and so nutty and delicious! I also ordered the vegetable stew. It was not my favorite. It was a bit bland. I should have ordered the Pide for myself instead of trying my family's. Oh well. Other than that, I loved everything here. I loved the vines that were growing and hanging from the ceiling.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGMu-P_AC0CL5EOlzWGDcA"
  },
  "tjlY2ZIYzIgGneY8E_ycQw": {
    "date": "5/26/2014",
    "text": "I guess Jamie W. and I landed on yet another chain in London. So much for being penny-pinching food snobs when we travel, but we ended up at Tas Pide because there was a dearth of lunchtime dining options around the Tate Modern, and Turkish food sounded pretty good since we were eating a lot of Italian during our London stopover. The decor did remind me a bit of Istanbul by way of HGTV with lots of rustic wood beams, cane-backed chairs and things you would have bargained to pilfer at the Grand Bazaar (photo: bit.ly/1imHxV7). At 2PM, the place was near-empty except for a group of young Eastern European women in heavy make-up and nearly-invisible shorts.I'm not presuming what they did for a living, but they did seem to text a lot. Ahem. Anyway, things looked bright right away as the young waiter brought us a basket of warm Turkish bread, a ramekin of hummus and another ramekin of marinated olives (photo: bit.ly/Rvlbta). They were still offering their £ 9.45 three-course lunch menu, so we took advantage (photo: bit.ly/1oCNyBY). I started with the Humus Kavurma which featured diced lamb, pine kernels and paprika (photo: bit.ly/1imHnwP). It was a bit oily but good, just what we wanted at that time of day. I just wish they provided pita wedges so we could scoop up more of it. Since I had not eaten a Turkish pizza in such a long time, I tried the Kiymali Pide, which was apparently one of their house specials.Quite doughy, it was shaped in the traditional eyelid shape with minced lamb (are you sensing a pattern here?), fresh tomatoes, onion, parsley, red pepper and a scrambled egg stuffed inside (photo: bit.ly/1imHoRw). While it sounded tasty, it was rather dry for all the effort, so i used the pickled red cabbage to lubricate it as much as I could. I guess I was expecting more of a kick given the plethora of ingredients. The meal ended with their only dessert option, the Kaymakli Kayisi, sauteed apricots in a house-made cream with chopped almonds and pistachios (photo: bit.ly/1jUHVOO). It was a bland little concoction hardly worth calling a course, but at least it gave us something sweet before our short walk back to our hotel. What we really needed was some Turkish delight.FOOD - 3 stars...pretty good Turkish fare though some shortcomings were evidentAMBIANCE - 4 stars...the decor felt right even if the chairs were a bit uncomfortableSERVICE - 3.5 stars...very quiet and attentive even with the lure of Eastern European, ummm...entrepreneursTOTAL - 3 stars...not quite a Turkish delight but if you need a hummus fix, here it is..",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Ha6aUWH6fYV4HrkBXV42Zg",
        "caption": "Photo of Tas Pide - London, United Kingdom. Kaymakli Kayisi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ha6aUWH6fYV4HrkBXV42Zg/o.jpg"
      },
      {
        "img_id": "7VLrerXwOiRVHBmrxBy8ug",
        "caption": "Photo of Tas Pide - London, United Kingdom. Kiymali Pide",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7VLrerXwOiRVHBmrxBy8ug/o.jpg"
      },
      {
        "img_id": "Fu3-7AGxHGNukOs8aaxDaA",
        "caption": "Photo of Tas Pide - London, United Kingdom. Humus Kavurma",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fu3-7AGxHGNukOs8aaxDaA/o.jpg"
      }
    ],
    "user_id": "m07sy7eLtOjVdZ8oN9JKag"
  },
  "UzBQ2kwXGP5ncpXMkxTYzA": {
    "date": "11/27/2016",
    "text": "The location is great, close the Thames path and across the Shakespeare's Globe Theater. Inside is spacious but the chairs are awkwardly low. The olives are great. You can also order olives as a side. We ordered two different pides. The taste was subpar. The lamb in the pide was not as tasteful. There were too much parsley added before serving which dominated the taste. The Turkish pastrami was over cooked. I don't know the other dishes but based on this experience it is hard to recommend the pides.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H_0b76k0hA6evfGs-tlI6w",
        "caption": "Photo of Tas Pide - London, United Kingdom. Kusbasili pide",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H_0b76k0hA6evfGs-tlI6w/o.jpg"
      },
      {
        "img_id": "TeXYEN8zQZPZvWYjKA8JnA",
        "caption": "Photo of Tas Pide - London, United Kingdom. Pastirmali pide",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TeXYEN8zQZPZvWYjKA8JnA/o.jpg"
      }
    ],
    "user_id": "8KZ_2EefDBKkYqHvHdxXKA"
  },
  "nWd788XYgQ6pYK1VKWfgLg": {
    "date": "6/18/2016",
    "text": "I don't know much about Turkish food apart from the well known kebab and the influence they left in Greece so I was delighted when Gemma M. proposed we'd have dinner at Tas Pide before our Gobsmacked event with Yelp.First of all, I was stricken by the ornamentation of the place. A lot of green plants adorning the walls and windowsills. The furniture was carefully chosen and placed across the big space occupied by the restaurant. They also have a little terrace ornamented with flowers and more plants for the summer days.We came quite early so we almost had the place to ourselves and service, if not warm, was quite swift. Our waitress seemed a little impatient when we seemed to take our time to carefully read all the menu (which is quite large) but oh well, it was a good day and I decided not to mind. Upon arrival, we were served warm homemade (I guess) bread with olives and a creamy dip. It was a good start worth mentioning because both the bread and the dip tasted amazing. I didn't try the olives. For drinks they offer a big enough selection of wines and I had a nice Chenin Blanc (white wine). For food I decided on the £12 something menu which allows a starter and a pide, their specialty I guess? It's ab eyed shaped dough bowl filled with whatever you chose.  The hummus was the best I've had in a while. I'm a very big fan of hummus and I was very happy. It was also served in a generous quantity. Then I had the minced lamb pide. It was good, the bread was warm and homemade in their traditional pit oven, and I do appreciate when a dish is appropriately seasoned. A very good experience in a nice environment !",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ejCrrY8_41Y4F36Acz4JMw",
        "caption": "Photo of Tas Pide - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ejCrrY8_41Y4F36Acz4JMw/o.jpg"
      },
      {
        "img_id": "hDQ-LvNCrTU1dkPQWq6-EA",
        "caption": "Photo of Tas Pide - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hDQ-LvNCrTU1dkPQWq6-EA/o.jpg"
      },
      {
        "img_id": "K1ruIGDpXa6BPjSmwKPIvg",
        "caption": "Photo of Tas Pide - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K1ruIGDpXa6BPjSmwKPIvg/o.jpg"
      }
    ],
    "user_id": "TcIXXqDfcrFu2m-cEV2OTQ"
  },
  "-Se2xUI99tq-53TRxswV1g": {
    "date": "11/30/2016",
    "text": "We were in town for a conference and needed a quick dinner before heading to the hotel. We happened on this place during a nice walk along the riverside and their location is quite superb. We starter with humus and some fried vegetables. It was not as tasty as I'm used to for hummus. Also the vegetables had no taste of their own, the sauce was nice that came with it though. This came with a side of Turkish bread which was stale and didn't taste nice at all. The Pide was absolutely wonderful. We had one with feta and leek, and it was really nice. We then had one more main dish each, the moussaka and one grilled vegetables with potatoes, something \"patatas\". They were both bland and not tasty at all. Overall I would recommend you eat here for the location but if you eat here stick to the Pide. I would not come again.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JLOrXu6R_2c4QGbox0W5Ww"
  },
  "QanAmnb9lZA8MMA4FZwaTA": {
    "date": "8/2/2016",
    "text": "We dropped in before going to a play at the globe. Very convenient and we were seated right away. Crowded, but service was good. The bread and olives were excellent to start. Hummus as an appetizer was very tasty. The rest of the food was good, but not special. Turkish delight on the way out was fantastic! Good choice for a place so near the Globe.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5etoH93OqkQUyqEjs_nsHg"
  },
  "n1d9uOXECLRG34PcGt-bVQ": {
    "date": "8/30/2015",
    "text": "We happened upon this place whilst walking the river walk in London. The food was fantastic. I had the lamb pide, which is best described as a Turkish pizza with ground lamb, mint, diced onion, peppers, and an egg on top.  They had my favorite cider (Rekorderlig, strawberry and lime).  Service was fantastic. Great ambiance.  A gentleman was playing music with a tiny guitar and wind instrument.  I didn't give it 5 stars because it was too hot in the restaurant. The door was open, but it was blazing hot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FWNW2us1adiXx_bpQgxQbg",
        "caption": "Photo of Tas Pide - London, United Kingdom. Pide with veggies and egg. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FWNW2us1adiXx_bpQgxQbg/o.jpg"
      }
    ],
    "user_id": "fcYHDIcQjX3vqb-BiENSXw"
  },
  "Y1xHXBVAjgdvcP64trUdtA": {
    "date": "8/2/2015",
    "text": "We also stumbled upon this restaurant by chance. Excellent humus. We had the lunch menu. Chicken and lamb.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLTVI96UNOSvR_aDdtBp2w"
  },
  "LEtNtGJKUQPY7Kq2iNBE-g": {
    "date": "3/3/2015",
    "text": "Want to eat near the Globe? Better, cheaper, larger than the \"Real Greek\" chain around the corner with very short chairs to boot. I find it better than most of the places in the area. The only thing is the music: you either want twee \"autentico\" music along with your food... or you don't. I don't. It's not too bad if you don't have the table right by them. There are always specials on and, as a bonus, it's open late. And the specials iwll give you more food than you can eat in a couple of sittings...Post-Globe specialty! (and Turkish Delight onthe door for all your rosey-soap flavoured pudding needs)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "E7sbbcrXJZ8SO1PqXU06GQ": {
    "date": "5/16/2015",
    "text": "This place would be bang on 2 and half stars if that existed in Yelp, but it doesn't so I have to settle for good ole 3.  The staff are really lovely. The food came fast - but we didn't come during the pre theatre rush, although it was a busy Friday night. The bread they give you whilst you wait was good. I loved my Rose Sherbert soda drink which is actually Tas is own brand.My mini starter lamb pide was a bit bland, I found it needed more seasoning. Really loved the pide dough though, very delicious and crisp.  I also had a reasonable but very unexciting fig salad which now I think about it I belatedly realise came with feta and not the goats cheese listed on the menuIt was all pleasant enough, but nothing special. But not bad considering the location right next to the Globe, where you would expect tourist rip off joints. It is reasonably priced with decent value set menu deals to be had. I won't be rushing here again, but a good fix if you are in the area and hungry. No Turkish delight shocker- the stockpile by the door as we left the restaurant was dry!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOH02K684lzDHKtNanaigg"
  },
  "Sffnm50pCGsYiZO-2gz98w": {
    "date": "1/2/2013",
    "text": "Tasty Turkish food served in a homely atmosphere, situated near The Globe Theatre on The Southbank.Try the Calamari, spicy sausage (sucuk) and hummus with lamb (Humus Kuvurma). The Lamb shank was to \"die for\"About £25 pp with the House white wine.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yla5BQrdBiW-6MqxQk_1NQ",
        "caption": "Photo of Tas Pide - London, United Kingdom. Tas Pide menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yla5BQrdBiW-6MqxQk_1NQ/o.jpg"
      },
      {
        "img_id": "TGvD6PWMm48ssOuVTjGjdw",
        "caption": "Photo of Tas Pide - London, United Kingdom. Tas Pide menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TGvD6PWMm48ssOuVTjGjdw/o.jpg"
      },
      {
        "img_id": "jT1-2olyYq340PprJiDKwQ",
        "caption": "Photo of Tas Pide - London, United Kingdom. Tas Pide",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jT1-2olyYq340PprJiDKwQ/o.jpg"
      }
    ],
    "user_id": "Li1HVGOQVAre8YgiTLra6w"
  },
  "DMw5Ao_R5Mva6jFdfXZhSA": {
    "date": "9/19/2015",
    "text": "The best available option near the Globe in my opinion. Nice decor. Wide menu. Good wine list and fair prices. We had Icli Kofte (lamb meatballs) and Ahtapoc Salatasi (octopus salad) and were ok but not great. Kusbasili Pidi (baked lamb) was good. Sondali Dana Kaburna (steak and vegetables) came without rice so we ordered a side of pilaf. Attention was top notch. Anatolia red wine was good. I give this place a 5 star rate because is the best option in that touristic area.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UKojwaw-MVeluH_FDoNCIg",
        "caption": "Photo of Tas Pide - London, United Kingdom. Not bad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UKojwaw-MVeluH_FDoNCIg/o.jpg"
      },
      {
        "img_id": "NIeQ55w86w83kKPlwm4yaw",
        "caption": "Photo of Tas Pide - London, United Kingdom. Baked lamb.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NIeQ55w86w83kKPlwm4yaw/o.jpg"
      },
      {
        "img_id": "C1haAEu0mpKNmAcWM0xTUw",
        "caption": "Photo of Tas Pide - London, United Kingdom. Octopus salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C1haAEu0mpKNmAcWM0xTUw/o.jpg"
      }
    ],
    "user_id": "8UAPJU3iZEqeC_vGCAud8w"
  },
  "KVuHtmPNf6C28vR_rQCUag": {
    "date": "2/19/2014",
    "text": "I may have made bad choices but I found my food a bit bland (dolma and a vegetarian pide with aubergine/tomato on it) though not unpleasant. There were some nice olives on the table. The nice waiter talked me into getting chocolate cake which was also nice - like a Sara Lee chocolate gateaux but nicer. All ok/nice.Minor downsides were that it is a bit of a squeeze - we were a group on a long thin table against the wall in the corner and if someone on the corner side needed to get out, the whole row of us had to completely leave the table! They were also pretty slow with tap water (an essential for me - water is genuinely my favourite drink and I don't see why I should pay for bottles of it when I like tap fine).This all said, I had a great time - the food was only ok for me, a couple of tiny annoyances - BUT this place has a lovely warm friendly feel, nice lighting/noise level/cosy decor so it was great for the group of us to laugh and chat and feel good and take our time.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDRkkuWzEbpBwo823eFqSg"
  },
  "N3c7a9yGFePEstR_C7PF3A": {
    "date": "12/30/2013",
    "text": "I cannot say enough about this place. First of all, walking into the restaurant is like stepping into your Grandmothers kitchen, comforting and warm. A great atmosphere for friends catching up or an informal dateAs for the food, order everything you can. The selection is incredible and the quality of the food itself is mouthwatering. I went with both veggies and meat eaters and everyone left happy and feeling like we were rolling down the street. I would happily order food, wine and sit here for a full 5 hours and enjoy my surroundings.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_b3lE0Xlu4snteeFaVcTlQ"
  }
}