{
  "6i-FsqRuB56-0V4fVgb7IQ": {
    "date": "1/30/2010",
    "text": "Good for a coffee and a muffin on a M-F when you can grab a seat and work or read. On the weekends it's painfully busy and loud, so not really worth the stop unless you're getting your stuff to go. They do offer a grill and outdoor seating, which is nice in good weather.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-4ixfHkPJ5B1KNXGMrkRuQ": {
    "date": "5/4/2009",
    "text": "This place has been around for AGES, and I always have a great time here.  I don't imagine that everything they make is BRILLIANT, but I'm not always there for the food, per se.  It's the OVERALL EXPERIENCE that I'm there for: a place to sit down & chill out, have a beer or a glass of wine, or maybe a coffee & a pastry.  And for those purposes, it is more than fine.  Great music, dancing/club scene at night & on the weekends, and great people-watching, too.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "odM7WqRsORcMsFymWEMiAw"
  },
  "asP8w5K9-SofwJJHwdoz-Q": {
    "date": "7/9/2012",
    "text": "great place to go if you like a house rave! grimey fun!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EjrUSn5gspQL5icVIrMhIg": {
    "date": "10/4/2009",
    "text": "i really love cafe 1001.love the layout, the lunch food is great serving salads and wraps inside and a amaze bbq outside. in the evenings this has great events on and if you're into art, especially new art then you should definitely take a look at Showcase London which is at cafe 1001 every 2 weeks on a wednesday. placed in the great Old Truman Brewery just off Brick Lane its got some outside seating and lots inside.++free wifi.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0zUerSAWl9jWYIKNsK52zQ": {
    "date": "11/24/2008",
    "text": "The benches outside Café 1001 are pretty iconic of Brick Lane, but the inside I am much less of a fan of.Thoughtlessly thrown together with badly chosen, loud music, I find it neither relaxing nor enjoyable.This is a huge shame as the food and salads served at the bar downstairs are excellent and I love the sociable atmosphere created by the BBQ outside. But go upstairs and 1001 instantly loses its credibility.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JY9GzXCZn4OVMqg07Wql2g"
  },
  "kUQGf1Q7vgWBYF8qWbi9wg": {
    "date": "11/5/2008",
    "text": "Café by day, club by night, Café 1001 is a great place to sit, eat and listen to (usually) decent music. There's a BBQ out the front and plenty of wooden benches so you can grab a burger and have a seat outside.  Or if you're feeling like something healthier, there's a good range of grilled food, fruit and vegetable salads, cookies, hand baked muffins, sandwiches, juices, and tea & coffee.  Most of the food is homemade and at least prepared from scratch on the premises.  The salad bar is great, cheap and good portion sizes you can choose how much and what you want. It's always busy, a buzzy atmosphere due to its location, right next to Spitalfields market and part of the Old Truman Brewery.  Upstairs there are two separate areas, and there are DJ's and live musicians playing every night.   There are often events at the Café, film screenings, yoga classes and I've even been to an exhibition opening with Gilbert & George as the star attraction!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2aNLypxAxXuj_PQTfjdT8g"
  },
  "o7esxgKR9liKVToz1WKp7A": {
    "date": "11/10/2008",
    "text": "After a long day shopping and milling around Brick Lane it is a joy to walk past the large outdoor BBQ in front of Cafe 1001 and smell what's cooking. Amazing in the summer months as they have large buckets of ice cold beer you can dip into, there are always some enjoyable people watching to be done here. When the night falls, the dirty beats come out and the upstairs is transformed into a filthy (in a good way) drum and bass pumping haven. Full of trendy ravers, this place is good for both day and night. They do amazing salad boxes aswell and the food is cheap (£4.50 for fresh burgers cooked in front of your eyes and a side of potato wedges) they also do great veggie varieties including some yummy grilled halloumi. Great in the summer, especially when the 'urban beach' is up and running round the corner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "5j5da8QdgOJEnkJRqm95xg": {
    "date": "11/14/2007",
    "text": "Cafe 1001 is one of the most charismatic places I've been to in London. It's based in Dray's Walk; part of the Old Truman Brewery complex and is always pretty heaving at the weekend. There's a fantastic BBQ right outside or a Jamaican jerk chicken stall a little further up, so there's not far to go for food! The entrance feels like a pretty normal cafe, but the moment you get upstairs the vibe kicks in. I guess it's a bit like a house party in a ridiculously big well decked out flat, with a separate dance room too. I've been to some wicked midweek sets here too - the atmosphere is brilliant. They've gone down the route of serving magical cans of Red Stripe, rather than draught beers - although they still come in at a premium. The only whine I have is that they close at that annoying time when you want to keep on partying but will miss the tube to get anywhere else.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8qeYhLDbkTOSRTsVh4zuBw": {
    "date": "1/17/2008",
    "text": "I absolutely love this place, whatever kind of mood you're in, it'll sort you right out. You can sit outside, take in the smell of the bbq and warm up by the heaters. If you fancy lounging around, then it's filled with sofa's, tables and tea lights. The price of food and drink is really reasonable, I shared a tuna salad for £3 which you get a whole baghette with and was really satisfied. Nothing is over-priced, even the beer. The decor is nice, the music is varied and right at the top, at the back is a mini-club with dj's playing all day. It's a great place to chill out.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hDOKcNc4qo7fmbEs50L9qw": {
    "date": "6/17/2008",
    "text": "Kind of like being in Glastonbury but in real life, but with worse beer. I can't give anymore than 3 stars to somewhere where you can only buy cans of red stripe but I must say, it is quite fun! Great place to chat to randoms due to shared sofas and always being packed",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "R2Ucax9QItkJGneGuYt_TQ": {
    "date": "1/15/2008",
    "text": "1001 is the kid of place that will make you fall in love head to heels. there;s nothing you cannot do in such a place.you can go for breakfat, you can relax and surf the web with your laptop, you can eat cake and drink tea, sit on the popular terrace, dance all the evening through, or go nuts in their 24 hours non stop parties that run once or twice a month.full of regulars, 1001 is a place that begs description beacuse is all about the magic dust puffing when you are there. the most original and authentic place in london, that is still for free,and still underground.once you have tried you will never left and will make 1001 your place for everything,",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "r7alCCPIOwIuB9SJwBrcDA": {
    "date": "9/20/2008",
    "text": "Not much during the day, but at night its great. A great place to bring a date after dinner. Even if you skipped dinner, there is plenty of places to eat just outside.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xfUsEuDyE4lbE7GMxAgSRg": {
    "date": "1/20/2008",
    "text": "The food and drink is all very good in this place, and they often set up a barbecue outside which is great because everyone likes a barbecue. And it's definitely worth a visit, if only for the delicious home made cakes. Sitting could be a bit comfier though, and the music is always too loud for my taste, but then i am a bit of a grandma...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wB_HlnuNyRgmIoJDe__v9w": {
    "date": "4/1/2008",
    "text": "For years I thought this was an innocent café bar  which it is until you walk to the back and are confronted with probably the messiest scene of your life. Has been known to make people sick. If you go don't mention it to your work mates unless you want your P45.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MOH2L5gzua1WLXapubYiIg": {
    "date": "6/17/2008",
    "text": "Slighly weird place. Cool in the way that there is always something going on, a gig, an orchestra, music, random people, a bbq etc. Wouldn't go there by myself or in a group smaller then 10 people but it can be fun. It is just really funky and slightly scary sometimes!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "a4jk4jNrabWeV13emRDwnQ": {
    "date": "6/17/2008",
    "text": "I love this place for lunch - the BBQ is pretty average but the salad bar is great value and the coffee and cakes are fresh. Come the evening it's a great place to just hang out: bustling, friendly, vibrant, etc.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lzVNvUSGsAehQKojo-qYUg": {
    "date": "8/18/2009",
    "text": "at first glance it may look like a shit-hole. but once you actually go in its really cool inside. its still dingy but the food is cheap and basically you can get whatever you please. one side has cold food and the other side has warm food. i would get a pasta salas for £3 and it came with a baguette. then the beer, fresh juice and any other libation you want will be there. what else can you ask for? cheap! it also has a burger stand in front, not the best but its good. in the night time this place turns into a happening place to start your evening. but what gets me is during summer, its a great little alley to just hang out. a cold beer and sitting outside on the wooden picnic benches to bask in the \"sun.\"",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ckd5cc6If-OiBHhG1T4T2g"
  },
  "mrxlC6PERHtar3LSym8Ffw": {
    "date": "1/20/2008",
    "text": "Always crowded in summer - everyone in Brick Lane seems to appreciate some barbecue along with a Red Stripe when it's sunny, right? It's nice inside too - go upstairs for big comfy sofas, cushions, candles, DJs and cool people. But avoid it on weekends, specially at night: the music is way too loud for anyone to be able to communicate or eat (without having bad digestion). And the room in the back sometimes smell like bleach.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5VZFJxSc2CeEZKLkcPNPtQ": {
    "date": "2/11/2010",
    "text": "grrrreat food!love the salads,the cakes..they even have a outdoor bbq where you order grilled kebabs and similar.in the back they have a place where bands and gigs perform.what a great venue.right at the heart of truman brewery.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OIIn2OxZ-EFDTJIFc403sQ": {
    "date": "11/15/2008",
    "text": "Superb place, eventhough the bouncers are stupid as f*. Good burgers outside, and really great prices!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NX3KfSyYDM-HEGo5M34LtQ": {
    "date": "4/12/2010",
    "text": "I love this venue, the food that is served during the day is amazing, with a large seating area outside, this is the perfect meeting place for an afternoon chat.At night, it's a totally different story, inside you have a rather large dance area with a mammoth sound system to compliment this extremely unique venue.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pdzyU2MaMa3hvlNczbKG9g": {
    "date": "4/2/2012",
    "text": "This is a great place to go for a rave up its a bit grimy but that just adds to the experience! The drinks are reasonably priced and the atmosphere is great as there has been no issues with clubbers every time I've been! The music is mixed they play a lot of dnb which I like so hence the ratings!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dzqqoPnsbu7YyqoctnPQWw": {
    "date": "11/7/2008",
    "text": "In many ways 1001 has become the spiritual home of a new generation of London fashionistas, men and women who go beyond the call of duty to dress (and often act) like escaped mental patients.  Don't be surprised, therefore, when upon entering you are greeted by a raucous mid-twenty-something wearing something akin to road kill and offering you a 'go on his whistle' (believe me it happened).  Once you get past the loud clothing and even louder egos, however, you will discover that 1001 is actually pretty damn good.  There is music to suit every taste, changing nightly between house, drum n bass, jazz, soul and good old fashioned rock n roll. Drinks are reasonably priced compared to many places in the area and their food, also reasonably priced, is fresh and tasty.  On summer nights one can sit outside and enjoy the general milieu of a Brick Lane night or venture indoors for its dirty but quirky décor.  Climbing the steps from the front door one finds themselves in the dimly lit first room littered all about with cushions and squishy looking chairs.  This is the room to sit in, chat and generally relax.  For those of a livelier disposition, the back room (shut during the day) offers the chance to let loose and dance like a complete plonker.  Here you will find those dirty, dirty beats and the genuine 1001 flavour.1001 is a great jumping-off point for anyone clubbing in Shoreditch or alternatively a nice place for a cup of tea at lunchtime.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XcGeGQQ8CigKEsmPfsIkww"
  },
  "q_SmiLhAOnqXkdGjzOh_vg": {
    "date": "6/21/2011",
    "text": "Few places in London you can feel comfortable spending lots of time alone. You can curl up upstairs on cushions or sofas with your laptop or book and no one gives you a second glance. Equally good for coffee and beer.. the food choices make for easy meals and the sweets are some of the most tempting in Shoreditch. Good starting point to meet friends or dates in the evening or for a morning coffee as right in the center of it all ... simple and cheap... but attracts a large attractive young crowd.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sN6Vui8DpOFNfuoDBI1Oxw"
  },
  "dXMLXhgsQAucOMZRpHWlqw": {
    "date": "12/24/2008",
    "text": "If Café 1001 didn't sell coffee I would be crashing on one of their couches.  This place is just chronically comfy.  If I worked around here I would never make it back to the office after lunch because I would get stuck in one of 1001's couches.  The upstairs lounge is covered with dim, red lights, plush places to rest your buns.  I saw a lot of people up there typing away on their laptops, but really, I don't know how they had the willpower to do anything but relax.  The atmosphere in here totally induces a state of meditation.  The only thing that kept me from reaching naptime nirvana was the delicious £2 mocha I was sipping.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2tiSdhF9jhnCk9bSnscANg",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2tiSdhF9jhnCk9bSnscANg/o.jpg"
      }
    ],
    "user_id": "w7b1W-KHo7UUsnkg8ASo5Q"
  },
  "cxsYiZYgHSsHfGnt7R8qNg": {
    "date": "12/20/2008",
    "text": "If you've ever been to Brick Lane you've witnessed Café 1001. It's the slightly obnoxious place at the corner of Brick Lane and the Old Truman Brewery, constantly splitting at the seams with patrons, and pumping out grilled comfort food at curbside. Most people, myself included, stick to the outside when they break down and choose to patronize it, even in the winter. The inside, you see, is a bit sleazy, as indicated by the presence of a doorman. What is outside a kind of charming beer garden becomes inside a kind of lounge. Not for me, thanks. And as for buying their £3 tins of Stella and Red Stripe, surely I'm not alone in packing my own from the off license. We are eating in an alleyway, after all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9_WKykdQg2UNoT0RtN4xMA",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9_WKykdQg2UNoT0RtN4xMA/o.jpg"
      }
    ],
    "user_id": "qEeyw1qNFVsw36Kj7FsCAg"
  },
  "JvmLO2fudQDx2CDowjf5Mw": {
    "date": "3/18/2010",
    "text": "A new little favourite, just around the corner from my office. The coffee is borderline in quality. Not bad, but not quite gourmet style coffee either. If I want a good coffee around here, I would definitely prefer Taylor Street Baristas or Market house. However, Cafe 1001 make up for this with a very good, vibrant atmosphere and home made quality cakes. The fact that they also have free wifi makes an excellent place to sit and work on your laptop.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Svwzh-9TNPIzSTjkpdKlRg"
  },
  "qPMwTquORiwioXYbyifgmg": {
    "date": "11/27/2008",
    "text": "Café 1001 has the whole \"shabby chic\" idea going on.  The whole back area is covered in old second-hand sofas of which most of them are losing their stuffing.  This is a rather odd place.  I have often come here a Sunday afternoon when there was some music blaring in the back rooms.  The rooms are very dark and there are often some people passed out on the couches who I am assuming are recovering from their previous nights out.Although I find the back rooms a bit strange, I do quite like the front café area and food.  I like to sit in the terrace area on a sunny day and enjoy a sandwich, burger, or salad.  I find day times a lot better here since I have never been crazy about the music at night and it all gets bit too much.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O3CZ6ePrFYCNKks3xCaaMQ"
  },
  "luHfaj8B6reGbV4CuHO2Lw": {
    "date": "11/23/2008",
    "text": "Cafe 1001 seems to serve an introduction to East London for a lot of people, myself included. It is a cafe/bar/club on Brick Lane. There is a bbq and seats outside, with a cafe in the first room inside, beyond which and up some stairs is a large, sprawling room with sofas, a larger bar and a small dance floor.I first went a couple of summers ago, it was a hot summer's evening the bbq was going, the street was packed and there was a wonderful atmosphere about the place. We drank outside for a while and then moved upstairs to the club where we stayed for the rest of the evening. There are a wonderful, friendly mix of people and the club feels equally as relaxed as the seats outside. I have since returned a lot and though it is definitely better during the summer, it remains a good place for a more relaxed night out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lHjrUujYLS-cOu--fnXCJQ"
  },
  "1cH4WEQcksY3HTJDiw6GZg": {
    "date": "11/6/2008",
    "text": "Cafe 1001 is awesome, I was so happy to discover it and did so by sniffing out the all day barbeque, which is, by the way, amazing value for money (about 4.50 for a good burger, your choice of toppings and potato wedges) and pure delight for the palate. Indoors there is a huge selection of healthy food, salads potatos and GODLY homebaked cheese cake, seriously you must try it.By night the venure hosts of variety of entertainments from bands to DJs, and is excellent for some true alternative nightlife, I went to a Brazlian night there once and it was crazy- a refreshing alternative to the endless indie clubs in London. Foreigners seem to congregate here so there is a nice mish mash of people hanging out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4IBcucqWoetv1A4Mzigvw"
  },
  "3IJNYNfaoK5C14Abs2bfvg": {
    "date": "11/10/2008",
    "text": "This is the one place on Brick Lane that I can continue to bring any guests to in search of reliably manic fun and frolics. Its a big place - and combines a cafe, club and bar in one. There is a barbecue outside on the street, with an inevitable queue, crates of iced beers and rows of picnic tables for revellers and picnic-ers alike. Inside, on ground level, there is a cafe and bar where delicious toasted croissants, smoothies and Turkish borek pastries can be had at all hours of the day and night. Up the steps above the cafe section is the first set of record decks, surrounded by deep couches and temptingly squishy cushions. This area is generally regaled by reggae, dubstep or some other laid-back beats.In through the corridor and you find yourself in the dark back room. There is a smallish dance floor and more decks, usually to be found pumping out techno or breakbeats of some description. There is also a full bar and couches in here.  The crowd in here depends on the time of day. During daytime the atmosphere is sedate, with a lunch crowd. As night time approaches, a rougher and generally European crowd fills the back room. 1001 regularly stays open until 6am.The bouncers can get slightly over-zealous in their searches, patrols and ejections. There are bag checks at the main door, and also at the entrance onto Brick Lane, and up and down Dray Walk. Having said that, 1001 is still, unbelievably, free to enter. That fact, combined with the area's nasty street element, means that extra security of some sort is probably called for. The cooked food from the barbecue leaves something to be desired - the over-priced, over-sauced freezer-burgers probably tastes a whole lot better at the end of the night with a skinful of alcohol, than at the sober beginning. If I'm looking for hot food, I generally avoid it and head next door to Story Deli for some organic pizza instead.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXU5C5DdmLEnYvvoLv7hSA"
  },
  "uP_KDyOaZdMhWteeJjqFhQ": {
    "date": "2/8/2008",
    "text": "Delve into one of Shoreditch's scabholes, as coined by Walter Stern who directed Bloc Party's epic 'The Prayer'. Not quite as skunked out and dark as pre-smoking ban, this Truman Brewery boozer is the magical part of the Brick Lane big 3 which also encompass the adjacent Big Chill Bar and opposite 93 Feet East. Packed full of some of the most colourful characters you will see anywhere in London, eat your chilli jerk chicken mid December and watch the skinny jeans tighten around mid August. The back room on Sunday, with luridly sticky red armchairs which are rarely used as the minimal sets are always electric. Crowds always enthused, comes, don't miss!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1d-HYgeAfyTCe2nPBtXvzg": {
    "date": "5/7/2009",
    "text": "Cafe 1001 has evolved from being a shady but charismatic place where many people rolled up joints inside giving it a smoky and chilled out drug den feel, to still being shady and charismatic minus the drugs! Music is eclectic, friday nights Drum and bass, but they do chill, electronic and raggae. Gets busy over the weekend period, they do cakes and burgers which are good. Its fast becoming trendy and hip which usually is a symbol of a great place's demisePretty soon i'll be sounding cool saying I use to go there before it got commercialised.. Go now before it loses its soul!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bjussNfl4-QyNGDQj0u0JA": {
    "date": "11/25/2007",
    "text": "You must love music to be here!!! This place is so lively that you won't get bored. Due to its fame, weekends are always rammed - try weekdays instead then, you won't miss anything anyway as they have good music too. Grab food and drink from downstairs first. BBQ outside is such a bargain but I'm not impressed with those canned lagers just because they are too warm. I tried cakes twice and still don't love them either. Apart from that, it's all about atmosphere that wakes you up and shakes your body. Cosy seats that make you feel like home rather than sitting in a bar. You might have to squeeze yourself with someone when it gets busy. I wih they could do better for the toilets too.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UC-NwRiRT6ftqqfux_kBVQ": {
    "date": "12/26/2010",
    "text": "It's pretty amazing here. I can walk in for a coffee or a beer and relax and listen to great music on the weekend. Mixed crowd, not bothered, just there to hang. Back room is usually good for some dancin too. Since I've been going it did get a facelift upstairs with a bookshelf and all... anyway, beware of the bathrooms.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HKIYO1uhNlROyXKO4c1wxg": {
    "date": "7/26/2009",
    "text": "This is a daytime review - as in, I don't vouch for it after 8 PM.  As someone who used to work down near Oxford Circus and would pay Crush for an overpriced and not so great salad or wrap, Cafe 1001 is a lunchtime godsend.  It's quick, it's cheap (3.50 will get you a big salad and a piece of bread) and it's reliable.  Typically they have 4 to 5 different salads to choose from (beans, couscous, parma ham, pasta, greek, corn, etc.), several wraps, as well as hot specials.  Sure the menu largely doesn't change, but that's why it's reliably good.  There's lots of outdoor seating and the free wifi is a great bonus.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "J4MNbfV-Ohi05U6zCT059Q"
  },
  "Aq8T7psdA9ut3ZmrlOsccQ": {
    "date": "9/15/2009",
    "text": "I really like this cafe. It has a very chilled, slightly disorganised feel about it....I exhibited at an Art Exhibition that happens every other Wednesday ( Showcase - see separate review!) and found the staff really helpful and smiley, the very cold magners a delight and the chocolate cake just scrumptious!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5j0QmE-ktdY2wfEYX2YStA"
  },
  "8HYdIM3dnPcCOPHz0en5IQ": {
    "date": "12/8/2007",
    "text": "This place is brilliant! There is a little cafe bit downstairs as suggested by the name where you can get cakes and sandwiches and salads. There is also a bar here, I know that a double JD and coke was £5 - not too bad for London prices. They have a bbq outside selling scrummy burgers with loads of different relishes which I loved. These were £3.50. There is LOADS of seating outside to chill out and have a cigarette. You can meet loads of people here which is quality. Upstairs they have a big chill out area with loads of comfy sofas and chairs. There are some toilets in this bit too. People are just generally standing about chatting. Then there is an amazing back room - I went on a friday and it was drum n bass music - loads of fit guys. There' s a big bar in there aswell. And more amazingly comfy seats. There is like a little hole in the wall where the DJ spins from and everyone was going mental on the dancefloor. It closed at 2am. The bouncers were really nice and the bar staff were funny. I love this place and spent New Years Day here as well - was brilliant!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rhZ8eoUOyS_-DJIfqwPL1w": {
    "date": "9/29/2008",
    "text": "this place is the sort of place you either love or you hate. It's rather grungy but very trendy. The inside feels rather run down rather than slick but most people tend to gather outside where the alley is heaving with people chatting and drinking the pints al fresco. Nowhere to sit out there though, be prepared to stand up all night squashed up against a whole load of other trend setters. They have a bbq stall set up outside where you can pick up a tasty snag to go with your pint.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CEJ6_jtWXL2UXq7D8r8FbQ": {
    "date": "6/20/2010",
    "text": "Right in the centre of bustling Brick lane, Café 1001 offers a huge variety of entertainment; from eyeing up the best street-fashion to comedy shows and from a chilled drinking-coffee-browsing-the-web environment to drinking wine on the pavement outsideits one of my favourite places in London to hang out. I can spend days on end there and never get bored. It also has a book-orphanage where you can come and swap your old books for new ones. Unfortunately, last time I looked the books weren't great but I think we should all pop down to 1001 with one good book and then there would be loads and then it would be perfect.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "C574pYg0FlNwbpfy8-VoRg": {
    "date": "8/5/2012",
    "text": "One of my favourite place in London, and for sure a crowd pleaser. Whether you want an afternoon spot to read your book with coffee and cake, or if you are up for a fresh tasty burger and a beer, followed by some bouncing around, this is the place. Laid back, full of weirdly dressed fashionistas next to your suited and booted city guys.Seating inside and outside make it a great place to go to regardless of the weather forecast, which in London can be temperamental.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsXZSZ-Zxqo2HIdvh7b4hw"
  },
  "H5LMuqG340jD5KQOoLIbKw": {
    "date": "2/3/2013",
    "text": "One of my favorite coffee shops in London that I visit every time I am in town.  Although I've had better coffee I love the vibe and the surrounding neighborhood.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFAtjSBQDA3kDExHwFz4Iw"
  },
  "0NwBhoAFB-fcNZL1DyCfrA": {
    "date": "5/18/2014",
    "text": "didn't know how to rate this place. Let's start with coffee or maybe I should not call it that way as it would be an offence to coffee itself. This thing in a cup was the most atrocious thing I had to drink and no, I did not finish it. Actually after 2 sips I left it all where it was. I don't know what it was but coffee that wasn't, I'm sure of that. more like poison. The cheesecake - much better, it was actually quite tasty and smooth. The ambience is cool, laid back, comfy sofas and lots of space. so yeah, maybe good for pint more than coffee lovers. And the toilets, oh-my-god, as soon as I saw it, I knew I would have to hold it until I got home.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7NjhulHlRubkqfudb6Btng"
  },
  "Vz-mhOPz13FZ5uo9An1kIA": {
    "date": "7/28/2011",
    "text": "Cafe 1001 isn't so much a cafe as it is a mini all year round street party. The casual vibes and delicious smells of the BBQ remind you of a festival (cue the iced cans of Red Stripe) and in the summer this place is packed to the rafters  and pavements  with Shoreditchians taking a break.Once the sun goes down, the party starts upstairs in what seems more like someone's flat than a cafe and the DJs are always on top form. If your stuck for somewhere to go Cafe 1001 is a dead cert!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_BT4t5M-bmyatHNwgpcaag": {
    "date": "10/7/2010",
    "text": "Located on a short street off a Brick Lane, this venue has great entertainment, food and atmosphere. Depending on the time of day, or your mood, 1001 has something for everyone. You can relax inside, drink coffee and browse the Internet (for free) on one of the many couches upstairs, enjoy the Brick Lane atmosphere outside while drinking at one of the picnic tables, or rock out in the backroom to live music with plenty of dancing space. Later in the night and on weekends, the entire street is absolutely packed, though the size of the venue is deceiving, as the upstairs bar is quite spacious and often has completely separate live music from the DJ. For those so inclined, there is also a book-orphanage where you can swap your old books for new ones.Who should you take here? Anyone. It is really just dependent on when you go. Perfect for a coffee and cake date, a study session and/or a fun night out.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zwVYz5sXfeaxdbRr7nXb7g"
  },
  "Xv7_rw0LUnZlI_07LUXNGw": {
    "date": "11/12/2008",
    "text": "On London's lively Brick Lane Café 1001 is at the centre of the buzzing atmosphere. This is one of my favourite hang-outs in London town for all of the following reasons: heavy music that no one can resist moving to, an amazing BBQ constantly cooking all day and night, a really cute café offering healthy salads and sandwiches alongside homemade muffins and cakes and there's always a great mix of people enjoying what the café/bar/club has to offer. This place has everything you could ever want under one roof and you can sit outside and fall in love with the sparkling atmosphere of Brick Lane. I cannot recommend this place enough!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Sr8f_dU7XfvwGhDZ7kmEtQ",
        "caption": "Photo of Cafe 1001 - London, United Kingdom. Outside Cafe 1001 on Brick Lane",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sr8f_dU7XfvwGhDZ7kmEtQ/o.jpg"
      }
    ],
    "user_id": "jOJxI-mx33rXFN1ET_W1Dg"
  },
  "bevbqv6-4DWAc0DYky2c-Q": {
    "date": "11/24/2008",
    "text": "The lounge in this place is amazing. Its full of beat up sofas and the space is amazing. Its full of young lackadaisical people lounging around surfing the web and hanging out drinking the strong coffee and nodding to the beats. Its one of the only places in London that is filled exclusively with young people. On Wednesday night, there is a free jazz night, which is really good even if the musicians get steadily inebriated through the night. Its quite an eye opener if you've never been down to East London before. It like a microcosm of the culture on the eclectic and alternative Brick Lane.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DxjOhaPsvHRvDhKP_hAWsA",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DxjOhaPsvHRvDhKP_hAWsA/o.jpg"
      }
    ],
    "user_id": "9BNZjcidByFi6Kaxg8pQow"
  },
  "QZp390it0axaKbe3MySvFA": {
    "date": "11/19/2008",
    "text": "The good bit: Cafe 1001 enjoys an unbeatable location on the Brick Lane side of the Truman Brewery, a spacious interior, plentiful outdoor seating and serves a mean mango juice. The bad bit: Cafe 1001's coffee and food leaves a lot to be desired.There is something distinctly European about 1001 and it's pretty much always buzzing. During the warmer months Cafe 1001 is great, if only because it has the most outdoor seating of any drinking hole within the Truman Brewery, making this cavernous cafe ideally located for a spot of people watching.That said, I've always been distinctly unimpressed by 1001's coffee. Which is a shame because 1001 is, an, um, cafe and if this aspect of this popular haunt's performance was improved it would be a shoo-in for a five star rating.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PhlnB0zS1fLGmsRVjLQt9Q",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PhlnB0zS1fLGmsRVjLQt9Q/o.jpg"
      }
    ],
    "user_id": "j8fZ1NtpZ4ISiNl7xL6rjg"
  },
  "w1AB6JXy70VEGMT__rsOBA": {
    "date": "11/6/2008",
    "text": "1001 became my home over the Summer. Living on Brick Lane, I was pretty much down at 1001 almost daily. Yes, I love it. Sure the drinks are in plastic if you want to go outside, staff never give enough ice in drinks, but my small gripes aside I still love it.   The infamous burger stand out the front seems to be a hit with everyone, but personally I think the burgers are horrific. The pattie is consistently cold, the bun dry-ish and just generally average. The sandwiches and salad range inside are gorgeous and fresh though. Cafe 1001 is great during the week, but on weekends it gets totally rammed.  Bouncers are very strict in checking bags and jackets on the weekends, and due to this there is usually a bit of a wait to get back inside. Upstairs in the back room is another bar and dancefloor, which turns into a full club at night. Fun times all round.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pJB-NkpXJ-8MhOkimzcHqw",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pJB-NkpXJ-8MhOkimzcHqw/o.jpg"
      }
    ],
    "user_id": "-WzurMIIijS0QN9PdXKJ3g"
  },
  "ZmDInl8zqnja6drhJIkoSg": {
    "date": "3/29/2011",
    "text": "Mind blowing veggie burgers, inside can be a bit cramped but its worth it for the food.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "W7GtrVCYmNaxpfaaJBK50A",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W7GtrVCYmNaxpfaaJBK50A/o.jpg"
      }
    ],
    "user_id": null
  },
  "GJskoq65sO3R2Krg3MG1Ow": {
    "date": "3/9/2010",
    "text": "Hi yelpers. \"Short & Sweet is London's ONLY weekly short film evening every Monday night at Brick Lane Cafe 1001\"They show a list of short films of music videos to documentaries.It is held a cafe 1001, doors open at 6:30pm and show starts at 7:30Do try to get there early as it does get busy and you want to make sure you get good seats (sofas!). I got there a teeny bit late and ended up sitting on the concrete floor =( However we did end up finding ourselves a nice big comfy sofas *yay*So sit back and relax with a beer or cola on one hand (yup they have a bar) and enjoy the films!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "sgnQLQ7dePY3iF_BPyMfNQ"
  },
  "6o4HfI_VUnH4PDmm3BVkRQ": {
    "date": "12/1/2010",
    "text": "I went last Sunday to see a dj friend perform (DJ Fabrizia, she's simply fabulous!). The venue is great but very dirty, but the upside is that security is very attentive so if there's any trouble they will know.Outdoor barbecue is more picturesque than tasty but on a chilly November evening it filled the gap and warmed the cockles really well (no Polish sausage baguette? Sold out at 6.30pm? tut tut!)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTUbajPBghvj-4ebP2D8-Q"
  },
  "yg3JwzY5-hDk83sYn4bT9w": {
    "date": "1/9/2012",
    "text": "When working on Brick Lane, I would come here on my lunch break from time to time. The food is just okay, nothing special and a bit overpriced for the quality. But I came for the big couches upstairs, the eclectic music and free wifi. It is a great place to hang out and I will surely miss this place!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "2h8wdBgud2n8hQbV0zN-XQ"
  },
  "XI5bNEOsJyFm8Yh2GoS6Fg": {
    "date": "5/7/2009",
    "text": "Dirty duff duff by night and comfy couches by day. It's just a shame their coffee is a bit like mud in a cup - or at least I was unfortunate to have the muddy cup that day.Although I winge I do like this place, it has free wifi very tasty fruit salad and expensive by filling veggie burgers grilling outside all year around. I have to admit no I haven't been to this place late at night but yes i did pop in to use the bogs once and was shocked at the gurning drunks that were on the dance floor at 8pm on a school night. Anyway, if you are in the area, its worth popping it, it definitely has the feel of an arty cafe/bar about it that is distinctive to this part of East London.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "rgI3fPJB3TZZ4UGDjGL7Tg": {
    "date": "6/8/2010",
    "text": "The café 1001 is an AMAZING place where you have to go one time in your life!You can even enjoy the very good burger and potatoes prepared on BBQ and serves outside, just off Bricklane... or chilling inside with a coffee and cake (that are always very good). Having a beer to start the nights out is pleasant also! All you want you can do!Music is good and smooth in the first room and become trash and crazy at night and during the days in the 2nd room!!At café 1001 you really feel the London East mood.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jA0-IllcUHQO9NjJSDDQcQ": {
    "date": "5/12/2009",
    "text": "I LOVE THIS PLACE its unique in every way, iam not going to say to much that other have said but i want to review this one night.Me and my friend wanted to watch a film (17agiain) i know quite sad, she wanted to watch it for Zac Efron i wanted to watch it because I really dont know. ANYWAY!  cinemas were not showing it plus the one that were, was too far and didnt want to spend eight pound. So we thought lets go to Brick Lane Iam sure will find something. Got into Cafe 1001 bought a drink and a muffin by the way if you buy the cholate chip one, it is lacking in mositure meaning its taste dddrrrrryyyyy.So on that night we discovered an event called Short & Sweet which shows short film every monday from 7:30pm in the back room  and guess what it is for FREE!  The place was packed so i do suggest get their earlier, we had to sit on floor, but thats what i love about it, its not normal. They showed some really good quality short film various types. During the break the presenter asked us to talk with the person next to us, which was really cool we met two lovely ladies.For more info check out the website shortandsweet.tv plus they have a facebook group too.Love the atmosphere, the comfy sofas, dim lights the bar everything.  I know ill be a regular one, on mondays now.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4pNYP4IyZwGINAKOQ6xI_g"
  },
  "lYRzqHaKu70GUmHpCONl9Q": {
    "date": "5/8/2009",
    "text": "Cafe 1001 is a true symbol of east London. It is gritty, urban and has a vampiric, industrial feel that I find seductive. I am clearly not the only one because the outside seating area is always full of your east end cool kids.Don't be fooled by the substandard BBQ grill outside Cafe 1001, the proper stuff is inside. The ever emerging vegetarian options are very tasty and can be finished off with gorgeous fruit salads, cakes or... well... Beer!What I love about this place the most is its unpretentious vibe that means everyone can feel comfortable here. Do not expect fabulous service as this isn't what 1001 is about. It is a great artsy place that opens up into a club in the back. The food is decent, it is a fantastic people watching place when the sun is out and it is just plain cool.Oh yeah... Free wi fi. Woo Hoo!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "ec-RX3wE0j_GBndx6hm3Dw": {
    "date": "7/31/2011",
    "text": "I have only been to Cafe 1001 on Sundays when strolling through Brick Lane and on a Sunday the cafe is packed, but perfect for people watching. They cook burgers outside and sell a bunch of food inside as well as all the  coffee shop stable eats and drinks. The place has free wifi and a DJ spinning on Sunday as well. The place is a bit grungy though, but with all the couches it gives the place a cool vibe and perfect for a little break. I have never been there in the evening, but I heard that it gets pretty packed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5M6l8SqwoZPSRcuMC47DQ"
  },
  "iaByBAlFn1sIhQL8y7rocw": {
    "date": "1/13/2009",
    "text": "The deliberate grime of Cafe 1001 won't be to everyone's tastes but because of the very laid back attitude they promote  here you can expect plenty of 'individuals'. For example, last time I visited the security had to wake up a man lying across one of the sofa's and dressed from head to toe in leather. Leather hat, leather arm cuffs, leather waistcoat, leather trousers and Doc Martins. That's real commitment. Unfortunately his leather fly was gaping open and offending a few people less into the look... I've only ever had tea and cake from 1001, mainly because the other food didn't look too appealing, but at these prices you can't really complain too much. The burgers cooked on the barbecue outside are always popular with the drunken mobs but I've never been tempted. However, the music scene here is pretty buzzing and I've known them to get some great unsigned bands to perform. If you're looking for something a bit different this place might be right up your street just don't set your expectations of cleanliness too high!",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "l3RL1BDjdCi8i17pHFRIpg": {
    "date": "9/17/2010",
    "text": "I'm a bit of a shisha fan, and this place fits the bill. Very efficient service, and well priced. Chilled out atmosphere, good for meeting with friends, or for a pre-party drink.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NaZkjQ4BEi5yC0zYNaQszw": {
    "date": "6/25/2018",
    "text": "Very good for hanging out if you're just trying to kill time or meeting someone or in need of wifi and a bathroom (which I almost always am!) It's super spacious so it's good if you're just trying to find somewhere to chill for a bit during the day. I'm not sure how it changes at night, but I went several times throughout the two weeks I was in London and it was never very crowded. Also once I went just to use the bathroom and nobody stopped me or made me buy something. So, that was awesome.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PWyLuWe5YUfwiu6SN42oPw"
  },
  "zWh-TZ2f5ySDg4bb3Ot6MA": {
    "date": "4/13/2018",
    "text": "Fun place to people watch midday. The outdoor area is lovely - there are beautiful hanging lights above the walkway and the vintage market was around the corner, many people wearing lots of fun things",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yt9Ab6VotrFximeSi_3t-w",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yt9Ab6VotrFximeSi_3t-w/o.jpg"
      }
    ],
    "user_id": "JdmNGfpHcGvp2oqLNtGy8Q"
  },
  "lpiqau_K8P39ydRCU3OFtQ": {
    "date": "8/13/2017",
    "text": "Hot beats in the evening. One of the few late night spots where you can get some work done, if you don't mind fairly loud music. Solid beers and coffee. Wifi took a few tries to connect, but otherwise it was perfect.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1ptpm8H6y6NjDT1n8ICbA"
  },
  "WkdnQi3Bi1SfQ9gO0P_-Kw": {
    "date": "4/8/2016",
    "text": "I come here for their short film movie nights. This place makes a great space for it as it's pretty big and full of couches and chair, although they are well warn. The staff here are friendly, and they have a decent bar with the full cafe out front. I haven't eaten here yet, but they do seem to have a good selection of items to choose from. Basic facility with good prices in a nice location.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8lNsj4DQ5vbF8RGc0Xximw",
        "caption": "Photo of Cafe 1001 - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8lNsj4DQ5vbF8RGc0Xximw/o.jpg"
      }
    ],
    "user_id": "9nap5IcBB4OecW3XgyIPHA"
  },
  "CFF_UQQ35n-nCi-1ZOnXtQ": {
    "date": "9/30/2015",
    "text": "On my last trip to London I was looking for a good place to get some work done and get some good food at the same time. This place was perfect for that. They serve great breakfast with various selections of eggs, veggies and pastries and there's plenty of table space and free wifi. The tables upstairs even have accessible plugs for charging your laptop. The atmosphere was laid back and quiet enough to think, and the music was uninterruptive. I ended up staying for hours, going from breakfast through lunch. The service was pleasant and efficient and I never once felt like I had to leave or buy more to be allowed to stay.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wfM0Eviihp3xrJIw_BEKwQ",
        "caption": "Photo of Cafe 1001 - London, United Kingdom. Princess of Babylon breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wfM0Eviihp3xrJIw_BEKwQ/o.jpg"
      }
    ],
    "user_id": "y4zb9pbZB8t-KcAp8AvEdg"
  },
  "XtznEdBzjPJcBuOqe57Nvg": {
    "date": "1/30/2015",
    "text": "I will forever nurture a fondness for this place but I have to say that it's not what it used to be. Back when I first came to London to visit friends at uni, this place was constantly heaving with too cool for school precursory hipsters, way back when we didn't even call them that. Now it seems in a sad state, only ever packed in the summer on market days. I feel sorry for the guy who mans the permanently installed grill parked outside. It's cheap enough and you can feel free to do whatever but now that Brick Lane's truly on the map, there are plenty of alternatives to 1001 and I wouldn't bother grabbing a bite here. Maybe just pay your £4 for a can of Red Stripe and hang out on the benches outside if you're feeling a bit nostalgic.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "llrwTkcI8u1hRADL-5Lj_g"
  },
  "g1y745XdmD9cbKYkCHn2hQ": {
    "date": "8/31/2015",
    "text": "Still in shock! Ordered scrambled eggs on toast. After waiting quite a while a woman brought my plate out (nice outdoor seating!), they were two fried eggs on toast. I said I ordered scrambled. Her reaction was an eyeroll, and said ' well no-one told me', and she proceeded to put it in front of me. I told her, I'd like  scrambled as I asked for scrambled! She huffed and puffed and took my plate away, then she shouted loudly from the door for everyone to hear: are you sure you ordered scrambled?!   I shouted back: yes, I'm sure .Two minutes later my scrambled eggs came out. It was obviously she had just proceeded to scramble the already fried eggs.Seriously....no words.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cy26nHxgRt7juYrtxV6iNg"
  },
  "5o9ru9Kydng9_wp8I_20yA": {
    "date": "1/27/2016",
    "text": "I give it 4 stars for endless internetting and lounging in leather couches and pillows without hassle to leave. I noticed both locals and travellers hang out at this spot, pribably because its cheap and has great coffee. Food is average, dirty hot breakfasts, sandwiches, soups but all affordable and as I mentioned a great internet spot. Not quiet for study but their groovy house  tunes may get you in the zone. Food trucks are also just around the corner :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YAKB2N3tB0k7BxDCajNcsw",
        "caption": "Photo of Cafe 1001 - London, United Kingdom. Upstairs lounge area.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YAKB2N3tB0k7BxDCajNcsw/o.jpg"
      }
    ],
    "user_id": "885YIgcras7Aw66_v6CqcA"
  },
  "Af1-aMB-0OKJrYVHMemSAQ": {
    "date": "9/30/2013",
    "text": "I like everything about this place.  Three rooms, three vibes- you could definitely spend the entire day here and if I lived i London I probably would.Front room- cafe, beer, coffee, cheap snacks, wifi.Mid room- lounge- drinks, get some nice house music going on in the evening.Back room- club atmosphere with lounge space in the back.  Decent sound system (not spectacular) but you get a good dance crowd going.  House, tech, trap.Like...why would you ever need to leave???",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "GERRIWMslcP4-O6mLErPSQ"
  },
  "kIJ5W9uNIUciWF0_qP087A": {
    "date": "9/21/2012",
    "text": "This place really confused me the first few times I walked past it. It seems ridiculous but I guess I just didn't understand it. Was the outside grill part of the inside café or were they two different businesses? Where do I order and where do I pay? Where can I sit? I'm not kidding -- I walked into and by this place probably 3 times to spy and observe. Finally I just took the plunge. I just went for it, cause I'm a cowboy like that.It's all one café, but with a separate til for outside fresh grill orders (beef burgers, veggie burgers, grilled haloumi and eggplant burgers) and another for inside coffee/pre-made sandwich/salad/bakery treats orders. The pasta and green salads always look fresh and healthy (not like the mayo and bacon-packed concoctions of grocery store standbys), are big enough for two meals and include a fresh baguette. The sandwiches come on fresh-baked bread and loaded with lovely things like chorizo, pesto, grilled chicken and avocado. (Sandwich eating has proven difficult for me to adjust to here in the UK, and it's a rare occasion when I can't pick a sandwich because they ALL sound good; usually it's because none of them do. So kudos to you, 1001.) Loads of indoor and outdoor seating and friendly enough staff. Decent prices that range from £4-£6 for a large sandwich. But don't get the wrong idea - this is no cute little boutique coffee house with sandwiches Come on, this is East London! It's gritty and unrefined; worn in and well loved.And, they take cards!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "uzzdZy6cgQiTUsZs3Nk2JQ": {
    "date": "3/3/2014",
    "text": "The place looks nice and the atmosphere is very relaxed but the lady behind the counter (inside) was unfriendly. It was raining and we sat inside where we had a coffee and a cappuccino and they were no better than McDonald's. Even though there weren't many people, the tables were not cleaned and there was some salad scattered on the floor.I will give this place another try when it's sunny and I can sit outside.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "apRZVmnNotuS5PCtdZE6ww"
  },
  "9Lp4wSsCq7Ju7nbCB9hFuA": {
    "date": "10/20/2013",
    "text": "I've been here only one time with some friends but I enjoyed the location and the ambient. Is a place to be back for sure!By the way, Nice coffee but not really good customer service by the waitress.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sSneyXF3DlsWz8RN-fVxCQ"
  },
  "SdQoRE_zgQvIYRzShhWJng": {
    "date": "11/25/2011",
    "text": "I love this place! It's a great place to go for lunch if you're around the area  the food is very reasonably priced (Less than £4 for a salad with bread and butter) and the food is well put together and very tasty.You can also get tasty burgers, wedges and other hot treats from the outside BBQ area.They also have a upper area and back room so there is usually space in the day. However it can get quite busy on the weekends and at night.The place always has a busy vibe and a raw 'trendy' feel.Definitely a good option for food and drinks, however I believe this place opens on the weekends as a bar/dance venue, and I'm not sure what it is like then.Downsides are that it is a raw venue, so can feel a little run down and grubby, also due to large front window's it can get chilly in winter (it's great in summer), additionally sometimes as it's very popular you'll struggle to get a seat!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "fIDoXlK1nq8QyLZcBSpIMw": {
    "date": "8/29/2012",
    "text": "Decent music (progressive/edm)Dancefloor and lounge areaFairly priced drinks",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHtxE4o-uziJaoOYEkvk3g"
  },
  "Oij6uMTVly3-GSaFUJbX9A": {
    "date": "4/5/2012",
    "text": "Came here to see The Switch on a Wednesday night and was pleasantly surprised by the venue! Outside it has a grubby looking burger stand and inside a hipster coffee shop.... but if you make it up the stairs and to the back room you find a big room with sofa's that suck you in and rocking music! Cost of a beer was average for Shoreditch. All the bands rocked the night away and the sound guy knew exactly what he was doing. Would defo stop by again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrGFc2IUccf2sKcvLc78LA"
  },
  "EKmN978jH5ql8P2JWUXC5w": {
    "date": "1/10/2016",
    "text": "Nice place, shame that the person behind the till intentionally overcharged me for the tea & cakes I ordered.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7TQ8o9GP_fSmEtxmHZFqzQ"
  },
  "VDubNssys1y0u6V3GLal4g": {
    "date": "5/2/2011",
    "text": "It fills a hole.A veggie-burger- and toilet-shaped hole.The enormous signs popped up all over the Brick Lane area advising punters to 'USE THE TOILETS PROVIDED' are always getting in the way of me urinating in public, so, not being a fan of port-a-loos, I begrudgingly elected to stop into Cafe 1001 when I needed to pee and was feeling a bit peckish. The BBQ outside looked welcoming (and cheap) enough, so it seemed a perfectly appropriate Shoreditch pitstop. The veggie burger patty was frozen, collected from a box filled with other veggie burger patties; I'm sure you'll be unsurprised to hear that it won't be winning any awards for its momentous achievement in the culinary arts. But the bap it came in was fresh and enjoyable, as were all the salad ingredients that went on top of it. The two gigantor potato wedges that accompanied it, while a welcome complimentary addition to the £5 lunch, were nothing particularly special.The couches and tables inside were lined with 20-somethings aglow behind their Macbooks, sapping Cafe 1001's free wifi. The vibe might be cool to some, twatty to others. The toilets rather bafflingly didn't have locks on the stall doors. So, in a way, I guess they ticked my public urination box after all.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "CFpIwFw7s34-m2KEtWKPng": {
    "date": "4/19/2013",
    "text": "I came here 3 years ago and can't wait for my next trip to London to go back. The atmosphere is fun yet relaxed, the people are nice and the drinks are good. This place has a trendy/hipster vibe (my personal favorite). Anytime I hear someone utter the words London I recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QGzuUi5_qTx47Odm3Nq7BA"
  },
  "uV0bXMX02LgF2AKO-oXLvQ": {
    "date": "2/24/2011",
    "text": "I have this weird, devoted love for Cafe 1001.I stumbled upon it my first week living in London, all sparkly eyed Erasmus student. Its cushy lounge area with the free albeit over-stretched wifi is home to many wonderful memories of myself feeling extraordinarily urban and happenin' and content digging into their food with my fellow co-students.I seriously adore the food. The Burgers from the bbq station out front are huge, the potato wedges that come along with them fit to knock a person out when thrown with enough force. My half-greek cousin once told me that the Moussaka we had there was one of the best she'd ever had, and that has to count for something. I also have an ongoing love affair with all their baked goods, as the display on the bar is simply too enticing to walk by when you're planning on an afternoon of cramming. Especially the carrot cake.So, why only 4 stars, then? The coffee. It's a sad state of affairs but, alas, the coffee is quite deplorable. Add to that the fact that it's desperately overstuffed on the weekends and pretty drafty in the winter due to its warehouse premises, I'll have to deduct a star.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KklPYtuFhVEgi5fLb958IA"
  },
  "eDXJe8O69RXXF_Hug64tjg": {
    "date": "10/10/2010",
    "text": "I love love 1001. But it does get crowded and their cappuccino was ok but cheap. Its a hot spot in brick lane and I feel a bit hip when I am here. I like to people watch and get some drinks. Upstairs lounge is pretty cool and I also occasionally bring my laptop and work at the tables. 1001 is great great great! Downside: PACKED.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "kYAdyq1HX5JMN-JfqLcYqA"
  }
}