{
  "_EEBd8xLhpEpIYwNHVDoHA": {
    "date": "7/23/2009",
    "text": "I don't often venture unto east London but Song Que's reputation drew me here out of curiosity as I had developed a real taste for pho on US trips.It must be good to stand out in an area with so many other Vietnamese restaurants. However, the tag of cafe is accurate and expect the bustly street food type atmosphere you would find in other 'oriental long table' experiences. However, service was efficient, necessary to turn the tables over with the speed that they do.OF course I had to try the famous pho and connoisseurs recommend the rare sliced steak with soup noodles. The portion was certainly generous. The steak was tender and the soup suitably meaty with depth of flavour, balanced out with basil and lime juice.The rice paper roll was suitably fresh with flavours bursting out in my mouth with the first bite.It was worth a foray into east London",
    "rating": 4.0,
    "rated": {
      "useful": 10,
      "funny": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "ErR0DuOPauZKQF4ZKMGGDg": {
    "date": "3/29/2010",
    "text": "I was hit by a gnawing pho craving this afternoon, so I did some research into the Vietnamese restaurants in London. Perhaps it's because I've been spoiled rotten by the abundance of good pho restaurants in Los Angeles, but I was seriously shocked by the lack of options. In the end, I chose Song Que after reading various gushing reviews.I made the long trek over from the Old Town tube station in the pouring rain, and the first thing the waiter did when I entered was toss my umbrella into a bin and steer me into a seat at the same table as a lovey dovey couple. That kind of threw me off -- I understand conserving space in a restaurant with the kind of layout they had, but it was 5:30 on a Monday afternoon and the place was only 1/4 full. I ordered the pho with steak, flank, and tripe. The good: decent-sized portion, well-cooked noodles. The bad: bland broth, very little meat. I'd say not bad for the price, but considering I can get outstanding pho in LA for $5, £6.30 for mediocre pho just doesn't cut it. Overall, Song Que was a bit of a let down. Next time I'll try another one of the restaurants on Kingsland, or maybe a different dish off the Song Que menu.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AIxwUiEaUrCEf2gUXi4pDw"
  },
  "cjL8VVLd7n3HC3cyOM8-CQ": {
    "date": "6/23/2009",
    "text": "Much bigger inside than i expected; and a quite relaxed attitude reservation times(suits me...It's a longish walk from Cambridge Heath!). It is so close to Liverpool St. that we had a nice touristy walk around the area after dinner- theres a Hawksmoor nearby for a start..(no; it's not a Pub(yet)..).What restaurant? Oh yeah, Son Que. Well, I got all adventurous again with the menu, and loved Everything! (Was the rice meant to be sticky? Who cares, i'm not fussy about rice). Tried the mussels, because i don't like them and dammit, that was great too. Everthing had quite complex and subtle flavours, and i will have to try the Pho next time... the bowls are so huge i would not have been able to eat anything else. I went with a Chef from New York; and she was also much pleased with this venue. 'Nuff said- I am gonna be late for Badminton club now- Gotta go!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "d_IBwZHQh9Oq4XNdZomzOg"
  },
  "EHGnuno9GNv7PTgd02iNKA": {
    "date": "3/29/2009",
    "text": "Why yes, I do say that this was some divinely slurptastic pho. But the real reason that Song Que blew me away and will keep me coming back for more was the feisty and quick witted service. Let me jump back: For years I planned to be a teacher. And wouldn't you know it, my dream was to teach middle-schoolers. (To translate, those are the painfully snotty children ages 11-14.) There's something about their innocent assholishness that I adore. Sarcastic as all get out, if you are able to gain their fleeting respect, you can probably rule the world. So long story short, I really enjoy spunk, mouthiness, and yes, a bit of a challenge from those around me. It keeps me on my game! So when our server threw back some playful attitude when I kept changing my mind on my appetizer, I knew we'd chosen the right place. When he teased us for \"living large\" and ordering an £11 bottle of wine, I knew that I was already a devoted fan. And when he told us with a straight face that a to-go box would be an additional £10 each, I knew I'd be back again and again.",
    "rating": 4.0,
    "rated": {
      "useful": 11,
      "funny": 12,
      "cool": 8
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "mjaWwJl1azZITV90MukWtg": {
    "date": "3/30/2009",
    "text": "Don't confuse Song Que with all the other Vietnamese eateries on this stretch of Kingsland... sure, you can sit down in a convivial setting, peruse a long menu of wonderful dishes and eat like King for just a few quid, but don't think you can just whip out your own bottle of wine and corkscrew and get chugging the booze back... Song Que is NOT a BYOB!Imagine our embarrassed faces when our poor little waiter ran over to wag his finger at us for getting started on our Chenin Blanc without first checking it was ok. Ooops... CRUSHING SHAME.... he big he big, we small.To be honest he was very nice about it and let us finish what we'd poured, which was the obvious lovely person thing to do. Lovely food, lovely people. It's no wonder Song Que is Vietnamese London's top dog.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 7
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "0Hd_k_2UFcJqVF6JSP9B7g": {
    "date": "8/1/2010",
    "text": "I had been here on two occassions. The first time was a good memory - had pho, vermicelli with grilled pork and vietnamese crispy pancake. From memory the pho was decent - quite good broth and well-cooked noodles. Vermicelli was ok and so was the pancake (could be more flavoursome, had better in a lot other places but this is the only place I've seen them in London). Also had the iced drink dessert (a bit too sweet). I liked how service was very friendly and quick. The second time was 6 months later and was a let-down. Ordered grilled pork with vermicelli. There was hardly any salad. The pork was a bit salty and nuoc nam was not tangy and sweet enough. Very disappointed. Will stick to Cafe East for vermicelli/grilled pork. Lots of people rate Song Que as one of the best Viet restaurants in London so probably just wasn't my day.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0WtY-wfWtFiuOl1go_xFA"
  },
  "i-RwbPB8vPTP1ifvpPBeCQ": {
    "date": "5/6/2009",
    "text": "Not much more than has already been said is really needed. Couldn't agree with the below reviews more; fun atmosphere, great reasonable food, speedy but efficient service. The chicken pancake is one of my favorites, along with summer rolls that were so fresh I felt like I had turned left on Kingsland Road into the Cotswolds. It puts most other Vietnamese restaurants in London to shame on the quality/price scale",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "kYB621WqfGk_bvauSR6MZQ"
  },
  "EGzSB7KVDKBNAWs86p3GHg": {
    "date": "3/4/2009",
    "text": "I've had my fair share of Pho, and I must commend Song Que on ranking top five pho experiences in my life.  At the end of pho mile, Song Que is a large, unpretentious space filled with hot soup and loud chatter.  The word has gotten out, so make a reservation to avoid the line.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "wAw9FHMiOZd9ROoc5x4DpQ"
  },
  "ColP-AXH20MQwkU-7icTyA": {
    "date": "2/19/2012",
    "text": "Got to say, I haven't been to all that many Vietnamese places in London yet. I keep going back to this one because it's that good. The food is fresh and authentic, and like any great hole in the wall Asian restaurant, inexpensive. I tend to go for the bun (cold noodles with grilled pork) or the pho. Also would recommend the soft shell crab starter, delish. This place is always really busy around dinner time though, so would recommend making a reservation. That said, the service is therefore very rushed so don't expect star treatment.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOQlGpgqq2MBCuEzxLMm4g"
  },
  "hfq3KONFk74LuwinK9zeSg": {
    "date": "8/14/2011",
    "text": "Very disappointing visit to this restaurant today. Have been many times before but this was first time with a baby. Our baby was sleeping in his stroller so we didnt want to park him away from our table. The staff refused to give us an empty table beside the space for strollers b/c it was a table for 6. There were at least 3 empty tables in the room. They insisted that we park our baby and eat at a table away from him.We sat down but were unhappy with the arrangement and cust service so we left without eating.This business does not care about their customers, only that they fill their tables at max to make money. And today this wasnt eve reasonable, since they had empty tables yet to fill.Prob will not go back again.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "69v1PBUU2ambh3FTqVoNRQ"
  },
  "GZAKuc6xZakyYo37ZatS-w": {
    "date": "3/6/2011",
    "text": "Yet another stop on my friend quest for good Pho in London.  This place is amazing.  Very flavorful Pho and their other dishes are just as delicious!  It's about the same price as Pho at any other place in London, around 7, which for anyone from America - this is very expensive for Pho.  Since you are going to pay this price anywhere in London - you might as well have good food!I would highly recommend this place!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_OwuaDy7quaKRHrton4G9Q"
  },
  "iE-ZPBWWfmp76fCfaYwn9w": {
    "date": "7/28/2011",
    "text": "Looking like it's been furnished in a B&Q spree, this ridiculously busy, more ridiculously cheap spot can fill you up and get you tipsy for as little as fifteen pounds per head. With table turnover faster than you can blink, the queue outside is worth the wait. Try the famous Vietnamese noodle soup (Oo Dong) or the vermicelli noodles, but to be honest you could shut your eyes and pick a number and anything you happenstance across would be good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "o8Yhb8kucsa6b3Sxr0TW9Q"
  },
  "_F0fON2LUIKye1oWTigjZA": {
    "date": "11/17/2009",
    "text": "I'll admit it... I've only been there once! It is quite a walk from my house, but I'm willing to try it again. I almost got Song Que mixed up with the other surrounding cafes since I was coming down the street from the other side. It's the largest restaurant on the block. Btw, prepare to get cozy with your neighbors when it's really busy. You'll be sitting semi-elbow to elbow with others. Luckily, my husband and I had the pleasure of sitting next to some lovely people. We had met new friends!Other than the company, the food wasn't bad, but I wasn't impressed. We shared the sampler and I had a simple bowl of pho. I was surprised it wasn't offered with two sizes, like at most places, but it wasn't hard to finish. The sampler was okay. And the pho was okay. Nothing to rave about. But of course I'm willing to come back and try lots of other menu options! We had lots of recommendations from our neighbors and their food did look tasty!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gA4MiXjhX9iZmqkIgMxWjw"
  },
  "dqFAP876iwOLgrGCB9qr5g": {
    "date": "9/20/2012",
    "text": "Waiters have terrible attitude. Weird table arrangement. Mediocre Pho",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXoFTn8i-6NN0gRNgaldAQ"
  },
  "7DVu9YQdTcba2VxcGaCoEg": {
    "date": "9/12/2011",
    "text": "THE vietnamese in london so far...the cran thing and the spicy beef noodle soup are excelent!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SSgjs_UKGUKn1WQ3mueCMw"
  },
  "bLed4pOfVnUcdcRpG_5VqQ": {
    "date": "7/24/2011",
    "text": "this place sure is popular and popping on a sunday night!  it's located on a street lined w/ vietnamese restaurants, and it was by far the most packed.  it was also recommended by a friend, so we thought we would check it out.  the restaurant is big and seats a ton of people, and turnover is fast, so you don't have to wait long.i got the seafood bun bo hue (which i've never seen before), and my friend got the pho tai.  her soup was on the greasier side and was light in flavor, while mine tasted pretty good and spicy.this isn't the best viet food i've ever had, but it will do the trick in a pinch.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rx7DNBmPPShVjlcQidGuTw"
  },
  "QH9kzk-XBV6ioACHgZzUzg": {
    "date": "12/24/2008",
    "text": "Often cited as one of the best Vietnamese restaurants of the many on Kingsland Road, but, as another reviewer mentioned, I think it really just looks the most inviting; the vibrant green sign with its gold lettering loudly announces Song Que's existence and looks professionally done - unlike some of the more homemade-looking banners hanging above some of the other surrounding establishments.  Song Que's glass doors are inviting: they've been plastered with reviews from Timeout and other respectable publications, plus give you a glimpse at its clean and spacious-looking interior, which is likely buzzing with people dining under economical fluorescent lighting.The visual appeal on offer here is all relative to the surroundings - so certainly don't think you're in for a polished dining experience.  It actually could be compared to a coarser version of Wagamama - the tables are long and communal, the service is snappity snap, and you've got to chase down your individual condiment cruets of soy and Sriracha sauce.I came here with my sister and we ordered spring rolls to share and I had both stir fried tofu and some garlicky vegetables.  I wasn't in love with what I had - it seemed just a touch greasier than then authentic Vietnamese food I've had elsewhere (both on Kingsland Road and, in ahem, Viet Nam), which leaves me with the impression that this isn't the best place to get Vietnamese veggie fare in the area.  However, my sister really enjoyed her pho, which is pronounced FUH (if you didn't already know) and is considered one of the highlights of Vietnamese cuisine - I can't personally savor this dish since they're all made with meat stock, but wish I could, since it's supposed to be divine and is just so FUHn to say...The best part of the meal, however, was the fact that our waiter was convinced that my sister (who is a rather statuesque blonde) was a movie star - which meant he treated us with the utmost consideration - and also insisted that I take his picture with her before we left.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "_7WdbmNVYcxns-2r3NcJhA"
  },
  "NT4F3iqOItiu0GfAfRCfxQ": {
    "date": "11/18/2008",
    "text": "Kingsland Road is known for the copious amounts of Vietnamese restaurants! They are all delicious; it is so hard to choose which one to go to! Some are Bring Your Own which is just perfect when in a big group no need to worry about who consumed what, you can just split the food bill! Talking about the bill, Vietnamese is extremely good quality for money. If you have a budget you can easily stick to it.Son Que is my favourite at the moment (it changes regularly) for starter's seaweed is a must and rice prawn rolls with chilli sauce! The main is always a little difficult, but the vermicelli prawn noodles and mango fish are the best. My other favourite is noodle soup - extremely tasty and filling due to the rice noodles. Great for couples, friends and parties! Just be aware food comes out randomly and they can rush you if you don't set a slow pace. Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "2jInz64Sp9DDb57nCV308w": {
    "date": "9/16/2010",
    "text": "The food is very good and I really like the layout of the place. It's not the most cosy atmosphere, but I enjoy the busy feel this place has. Prices are decent too. My only complaint is that the service can indeed be quite brisk - at not just on weekends, but even during relatively slow times during the week. Also, while the food tastes very good, portions could be bigger.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "UnLIvR1AyM9JD2RgQfY5Lg"
  },
  "eSILD9dtyDApgcL5Lwxu9Q": {
    "date": "8/16/2011",
    "text": "pretty solid bo' of pho' bo...not LA prices but tasty and the herb plate was proper.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XYqRpVb4eASRF1D--hE0w"
  },
  "YjzdxWJxuvgTnpAHWDFzzQ": {
    "date": "5/30/2013",
    "text": "On a cold, blustery evening in...May...my sister (visiting from the US) and I were craving a hot, flavourful bowl of pho. I live quite close to the Dalston/Kingsland Road neighbourhood, yet hadn't ever been in any of the Vietnamese restaurants on that strip of the road, so we decided to give it a try tonight. Being from the Los Angeles area, where quality (and vegetarian!) Vietnamese food is pretty ubiquitous, we've been accustomed to a certain standard of this cuisine (ie, a restaurant that carries mushroom/vegetable broth at all times, and is frequented by a certain Brad Pitt, like my favourite pho joint in LA....) that I unfortunately hadn't yet found in London (maybe my standards are a bit unrealistic at this point). As a result, we were a bit dubious when entering Song Que, but our worries were soon allayed. The foodie lowdown:-There was no tofu/veggie summer roll on the menu, but we asked if the chef could make us some and it was done. The  peanut/sriracha/hoisin/garlic dipping sauce that was served with the rolls was absolutely delicious, as well.-I had checked out the menu beforehand, and there seemed to be no vegetarian pho...only a 'tofu' one. When ordering it, I asked if the broth was veggie, too; it was a good thing I did, as the standard broth for that dish was chicken, and it had to be swapped out for a vegetable one. Pretty good, overall, but (as was somewhat expected), lacking in the flavour department -- as my sister correctly pointed out, our soup ended up being a shocking bright red colour, due to all of the sriracha and chili oil that we added to it. Still, the portions were generous, the tofu and noodles cooked well, and the garnishes fresh and plentiful.-Being big aubergine lovers (and only having discovered this love in the last 5 years of life), we ordered a side of pan-fried aubergine with garlic and spring onions. We opted not to get rice, because there were already a lot of noodles/carbs in the pho, but I kind of wish we had...there was quite a lot of stir-fry sauce that went to waste, because we didn't have anything to soak it up with. Had we gotten rice, though, I might have exploded...and not been able to write this review. Be thankful.-Though we didn't have dessert or drinks, the table next to us ordered coconut water/meat that they had to return two separate times because it seemed to taste funny/potentially have gone off. The waiter helping them was getting really defensive about it, too, insisting over and over again that nothing was wrong. Eh. Regardless of who was in the right this time around, be careful with that one...In the end, we left more than justifiably full for having spent just £18.80 -- what a deal. Not Brad Pitt, LA, good, but solid.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0KAjMIFLBBKEt-AYkoJckg"
  },
  "NB8DUnrvR8SG9P908H475g": {
    "date": "10/30/2015",
    "text": "It's really all about the pho here. The rice paper rolls always seem too heavy on the cheap lettuce stuffing for me, and the rice / stir fry dishes are good but not great. However, the pho broth is consistently amazing, deeply flavoured with good amounts of meat, noodles and leafy / spicy extras. Prices have gone up over the years as you'd expect from a restaurant that's been featured so heavily in Time Out etc, but it's still my go-to Kingsland Vietnamese place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nL_uVf1KFj5q1iyCFupK2A"
  },
  "b0lnC1eHAiREIK4E0BY3Vw": {
    "date": "9/1/2014",
    "text": "Hands-down amazing! this is what a real vietnamese restaurant should be! Slightly clean, Slightly dicey. The place looks like it could be a restored tropical hotel dining-room from the 50's in Thailand. Grinny half-toothless people yelling at each other from across the restaurant. Old, young, skinny, fat, Asian, White, Hipsters hiding in the corner trying to explain \"vegan\" to a Viet server. .. Perfect.    Whenever I come to a new Vietnamese restaurant Immediately discern if its a proper \"pho-joint\", Vietnamese cuisine, or a good combo of the two. Song Que is a perfect example of a great combination of the two! very nice pho but also great dishes and unique Vietnamese soul food items like \"pho bo ko \"(vietnamese beef stew).  When I see Bo Ko on the menu- i am instantly excited. Definitely one of my fav foods. It is generally served with noodles or bread. Noodles is my fav and makes it \"pho\" Bo Ko.    The stew was fantastic, accompanying herbs were fresh, aromatic, savory, rich broth. heaven.  This place my friends, is delightful!Anthony on pho!.. we are of the very same mind youtube.com/watch?v=dpU1…",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kjBW1ElwBmKuTpcKI3atA"
  },
  "XU_r_WtQ8joX0AMU04IhLg": {
    "date": "2/26/2012",
    "text": "I went to this place buoyed up by upbeat anecdotes from previous visitors, and emerged feeling distinctly underwhelmed.That's not to say there's anything seriously wrong, but my quibbles would be:- The prices are slightly higher than I'd expect for an less-than-luxuriously appointed venue in Hackney- The service was decidedly hit-and-miss, with (a) linguistic problems for the waiting staff understanding English-speaking patrons, (b) slow service, (c) omissions in the food delivered compared to that ordered and (d) a over-zealous desire to shovel customers out the door at the end of the mealLocation-wise, I guess technically its convenient for Hoxton Rail (London Overground) and bus services along Kingsland Road.  But as a West London person, anything north or east of Liverpool Street is a bit of an effort, so I really want only want to venture that far if there's a good reason.And nothing about this venue really counts as a good reason for me.Overall, and only in spirit of generosity, I'll give it 3* ...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zF4F20s3LFi_-bYnOTmwwA"
  },
  "Yf1u_thUKU9YmimUMTnpww": {
    "date": "1/10/2011",
    "text": "This locality has pho places a dime a dozen and most of them have quite the following, but I should be the president of the Song que fan club, as I belive it has the best vietnamese food on Kingsland Road. Now Song que is quite the institution, as it has been around for a while and I belive shall stick around because it is not only serves scrumptious food, but in these times of austerity is good value for money !!!The place has minimal decour as is what i would imagine a big canteen in a communist part of south east asia would look like !Ther service is good and quick and the waiters tend to remember you !Now my dear friends when you go to a restaurant that specializes in a certian type of food/cuisine I would advise you to stick to it !!!really guys when you go to a chinese restaurant you won't ask for a burger now will you !!So when you will go to Song que (and I know) you will go I advise you to order the vietnamese food !!The menu is quite dauting with its variety, but for starters stick to the spicy squid or the soft shell crab, the summer rolls are lovely and fresh, but a real Viet classic is pancake !! Get it all and share the love For the main course order the pho, which is a gorgeous soup (with an arromatic broth ) and hand made noodles and beef cuts of your choice(offal is part of that shoice)be adventerous and ask the waiter for viet specials and stay clear of their  chinese dishes, its not their food and they are not good at it !Now I must explain myself, the reason why I am harping on asking for advice and sticking to the viet dishes is because I visited a few days ago and four people sat on the table close to us and explained to their waiter that they had never had viet food and did not know anything, the waiter they got recomended afew viet specialities, but was running around. Being the good freindly samaritan that I am I gave them some recomendations and got some strange not very freindly looks, My dinner partner told me to leave them be (but i love talking and helping people, i would like others to do do that to me guys )alas that table order the chinese dishes which where oily and not nice and left miserable!!!So my dear friends what is the moral of the story ..... when in rome do as the romans and listen to kindly, freindly advise from smiling strangers !!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9uG--jD16Sgm8WvajE9b3w"
  },
  "gY7miKttOm1eElPVQ3hK8w": {
    "date": "7/9/2011",
    "text": "On a cool night after getting a headache from staring at spreadsheets for too long at the office, a great remedy is a noodle soup at a Vietnamese restaurant.  We have been to a nice Vietnamese in the Hoxton area before and we noticed a lot of other options - so we decided to try another one this time.This was the first one we saw after the short walk from the Hoxton overground.  It looked busy (which is a good sign) so we went inside and got a table for two close to the bar.  This place specialises in beef noodle soup (pho) so I got one with beef flank and tendon.  It was tasty and filling.  The beef was really tender and seemed to melt in my mouth.The staff were friendly and accommodating and they weren't phased by the busy-ness of the restaurant.  I would definitely come back here, but may try other Vietnamese restaurants in the area to build up my list.  If you are hungry for Vietnamese, this is definitely the area to go!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "mGQoj5ZuGcVwiDvst4qrTw": {
    "date": "12/6/2010",
    "text": "hmm, pho wasn't great. Coming from LA, where pho is super good and half the price, CMON 7 quid for mediocre pho, it was not nice.Although I think the other stuff was pretty good, my friend ordered the vermicelli with meat assortments and it was aiite. The plus thing is the prawn crackers FOR FREE, I think I just filled up on that. All in all it was ok .. meh.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kYAdyq1HX5JMN-JfqLcYqA"
  },
  "ry6vu3NQImLSipJu5Agljw": {
    "date": "5/17/2011",
    "text": "I went here based on the recommendation of a friend, who classed it 'the best place in London for Pho'. So, after getting slightly lost in some dogdy estate, we finally found Song Que. The decoration and furniture is basic and a little run down. We were shepherded to a table for four, which already had one person eating on it. I know communal eating is the new 'thing' but in a resturant only 1/3 full, this is ridiculous. Spilt for choice on the menu, we went for a beef Pho, a a vietnamese pancake with chicken & prawn and a prawn roll. This was my first time trying Vietnamese food. I've had Thai, Chinese, Malay etc, and liked them all, but this did not work for me. The pancake with chicken & prawn took up half a normal size dinner plate, but only had 3 prawns in it, and about 5 small bits of chicken. All the rest was padded out by beansprouts. Same with the prawn roll; 2 prawns and a crapload of vegatables to bulk it out. The pho was just odd to me. There was nothing wrong with it, I just didn't like the flavour, and that's my problem, not the resturants. My friend who loves pho thought this one was great, and ate it all. I would not go back here even if I liked the food, because I felt the price did not justify what you get, and the service is so poor.It's impossible to get waiters attention, they seem intent on ignoring customers at all costs. Try another Vietnamese place, and don't make the effort to come here, it's not worth it.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "YGL8fLKZrA_30J9LR0VCpw": {
    "date": "12/5/2008",
    "text": "I'd always wanted to try one of the Vietnamese restaurants on Kingsland Road but had never been sure which one to go for.  However, after asking around a little and getting advice from friends and family Song Que Cafe came out as a clear favourite.We knew that this was a popular place but trying to book a table turned out to be very difficult and our 8.30 preferred time slot was almost laughed at. In the end we arrived at 7 and were quickly shown to our table. I say quickly because the staff in here are almost obsessive about table turning and will rush you at every opportunity. Once you get used to this though the atmosphere in the place is actually friendly and although tables are squashed together and you may be sitting next to people you've never met before there is a general feeling of fun and excitement.Noodle soup is Song Que's delicious speciality and comes two sizes- a regular bowl for those who want to order a few things from across the menu and what can only be described as a troth for those who just can't get enough of that soupy goodness. There was something weirdly impressive watching people tackle this mammoth portion as the soup itself is incredibly filling. Though I would recommend it, I think it would be a shame to only try the soup and not get a taste for the rest of the menu. The soft shell crab and prawn rolls are other great dishes not to be missed out on. Great food and fun times that everyone can enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kpXV-8t0ihg4wUd7IYVP7Q",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kpXV-8t0ihg4wUd7IYVP7Q/o.jpg"
      }
    ],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "pc3YgRsR83IbwJRvT2e_Cg": {
    "date": "7/16/2009",
    "text": "My London friends had tried multiple Vietnamese restaurants and claimed that this is one of the better Vietnamese restaurants.  Thus, I had to try it.Upon walking into the restaurant, I knew that this place might be great for me.  The place was not pretentious looking at all and looked quite homey (similar to what I would see Vietnamese restaurants in Chinatown, New York City).  It was busy on a Saturday night, but we didn't wait long for a table.  The staff there was pretty efficient.Had the beef pho with different types of beef (beef balls, raw beef, etc).  It was nice comfort food for me.  Warm and tasty.  I had a great portion for the price I paid.  Truly enjoyed my meal there!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jw4OHr6HibJeEIMfAxc1_Q"
  },
  "zgpNi2zr7MtsTnYKRG3Trg": {
    "date": "9/5/2011",
    "text": "This used to be my favourite Vietnamese restaurant, until I went to Vietnam. Better than some, but still a long way short of the amazing street food I had on holiday.They have a huge menu, as do many other Vietnamese restaurants nearby. Perhaps this is part of the problem.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "Q5pveKDxF4l34FbqDNsqkA": {
    "date": "1/13/2014",
    "text": "The service was fast and friendly, but the food was just average. The bun bo hue was disappointing. It had different noodles than I'm used to and the flavor wasn't quite right (to me).",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "usvYcIyFMIH2SJ8YuXdFdg"
  },
  "XpYjVHauVd6tS2_fb389DQ": {
    "date": "4/23/2014",
    "text": "Someone once told me that competition is good for business and believe me, there's lots of competition down Kingsland Road when it comes to Vietnamese cuisine - you're almost too spoilt for choice and if you frequent this area at all, you'll know what I mean.If you don't, the temptation is to go where all the cool kids go - what's more authentic looking, what's been around the longest, which one has the most highly rated \"Time Out\" review?My advice? If you like this type of food, start at one and work your way down over time. Let's face it, as far as eating goes, it's cheap as noodles - especially if you bring your own booze, so why restrict yourself to one place?Fortunately, I have lived in the area for years (yes, before it was hip and trendy - previously resembling more of a recently demilitarised zone) and have had ample opportunity to try each of these places more times than I care to remember.So, back to the Song Que. is it any good? Well, it's better at some things than others. The reason I chose to review this establishment first is that I think it has the best Pho on the block - and if you're looking for the ultimate Vietnamese dish, that is literally it in a bowl - but the soft shell crab and spicy squid (my faves) are a bit meh in my opinion (try the Tay Do for these)The ambience, in my opinion, is better suited to a lunchtime set up as is quite loud and bright but that's just a personal view. Try it for yourself and then try another one...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HP1CZcCG9nygaDxDog3pig"
  },
  "JRx46F5ETnwsqhiTZjpf_A": {
    "date": "8/22/2013",
    "text": "I came here with high hopes, as I love most of the Kingland Road Vietnamese restaurants. Maybe we picked a bad night, but I was disappointed with the food - my monkfish was chewy and quite bland. My boyfriend had the pho, and also thought it didn't compete with the pho that we've had in other restaurants. The service was also very slow. With so much choice on Kingsland Road, I doubt I'll come back to Song Que.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uW6d7nGlY6yt171M_4TZhQ"
  },
  "OKMbKa7MC4WXb7Jt_RZRkQ": {
    "date": "5/18/2011",
    "text": "In our effort to eat pho in every city we visit, this is where we chose when we were in London for our honeymoon. Thanks yelp.First off, serving shrimp chips before the meal is awesome. I've never had that at a pho restaurant before. The pho here was good. At first the flavor was a little strange for us, just because we are accustomed to the pho on the other side of the world. But a few bites in and we really grew to like it. Good flavor and everything was in balance. We also had the spring rolls which were tasty.  Lastly, we ordered some Che Ba Mau which was probably our favorite thing from the night. We were craving it the whole rest of the trip!So, when in London, go to Song Que and get your pho fix. You won't be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ea51ypbqWoh6O9ZT4P8mVg"
  },
  "j46jBUXUMeLavviOP8WvGA": {
    "date": "12/15/2010",
    "text": "I've  been to a couple of the other places on Kingsland Road (and my apologies--I have just discovered that I didn't review one of the places I tried over the summer--the greatest of Yelp sins--please forgive me!).  Song Que seemed to be all the rage at some point and thus it was high on my list and I thought it would be the shining star on the Little Saigon strip.  It was definitely tasty--had summer rolls, a nice lotus salad and some noodles....no complaints at all.  The vibe was good too--definitely lots of people late at night enjoying good food.I felt that the menu lacked the creativity of Thang Loi (that's the one I forgot to review, dang it!) and some of the care in the cooking of Mien Tay.  But have no doubt about it--still all and all a very good Vietnamese restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "WinQFDaScfNy-gTPrrUYyA": {
    "date": "2/6/2010",
    "text": "Coming from a Vietnamese background and having been to Vietnam and growing up on Vietnamese food, I thought Song Que ranks as one of the better restaurants in London. I tried the following dishes and thought I'd give a review about them first. Vietnamese food should be simple and Song Que keeps it just that. I am a big fan of cold rolls (summer rolls) and am not really a big pho eater. I thought the cold rolls were very authentic (contained prawn, pork belly, vermicelli and lettuce). The dipping sauce was very nice and authentic too. I've tried cold rolls in most restaurants in London and I think this one comes closest to what my mum would make at home! The Vietnamese pancake was average. It was a medium portion but they forgot to bring out the lettuce that is used to wrap the pancake. I think they need to show people how to eat the pancake, otherwise no one would know what to do unless your someone who has had it before. It was tasty but they need to bring more lettuce on the side! Salt and pepper squid - very nicely deep fried, but not oily. It was very tasty and definitely looked authentic. Must try i say. Lemongrass beef vermicelli - I had this as my main and i think this dish was delicious! Good ratio of meat, salad and noodles. Some Vietnamese restaurants get this ratio incorrect, but Song Que got it right! So 5/5 for this dish! 3 coloured bean drink - yum! Aside from the decor not being very nice, the food is worth it and service is quick. But i think that's what you should expect from a Vietnamese restaurant. Well for me, it's all about the food! I",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "rcNJ8WK_JUfAAjpY2okU4A"
  },
  "LYvbA-LQ8GIh0kFHT4Cz8g": {
    "date": "4/6/2010",
    "text": "My husband and I are recent transplants from Arlington, VA, where we were lucky enough to live just a few blocks from Pho 75.  The restaurant is a stark white affair with cafeteria tables and you doctor and slurp your soup shoulder to shoulder with strangers.  As the name implies, it does one thing - pho - and does it well.  The only thing you have to decide is what meat to put in the bowl.  We had been missing our pho fix and Pho on St. John Street only scratched the itch, so we made the trek to Song Que and were greatly rewarded.  We started with the summer rolls and they were a light, delicious mouthful of prawns and mint.  The accompanying sauce already had a dollop of sriracha and we added a little more.  I had a glass of iced coffee with condensed milk and it was a little off the mark.  The coffee was pre-made and poured cold out of a plastic jug.  It just didn't have the same jolt as the thick Vietnamese coffee straight from the filter that melts the ice as it goes into the glass.  Plus, I think part of what makes Vietnamese coffee so good is that you have to wait for it to brew in the little metal contraption that sits on top of your glass.  Needing that bit of patience makes it that much sweeter.  Next up - the Pho.  It was done the right way with rare meat left to cook in the piping hot broth.  I had a bowl with eye of round and flank steak and my husband had the same with the addition of tripe.  I don't think any food begs to be customized more than pho and after we worked out magic our soups were completely different.  Mine made my nose run with copious amounts of sriracha, chili paste and raw chillies and was mellowed with some Thai basil, lime juice, bean sprouts and fish sauce.  My husband's had a little sriracha and a lot of lime juice.  He prefers to keep the bean sprouts and munch them cold after finishing his soup.  The bowls were enormous and I only made it through half of the soup.  We left and braved the rainy walk home with our bellies full of hot, spicy soup.  I can't wait to return.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "3tn38dZPetX0odA1qc0dKg": {
    "date": "9/7/2008",
    "text": "Featured on Time Out London's top 50 restaurants, reviewed by Fodor's - a top travel guide, and obtaining an overall user rating of 9.3 on London-Eating. Need I say more? Frankly, I'm embarrassed to say that this is the first time I have come across this place in my four years in London. This will be the one place that rolls off the tip of my tongue from now on if I'm asked for my recommendation of a good Vietnamese restaurant. And among other Asian restaurants that I frequent, this ranks near the top for its quality and value for money. After a nice lengthy stroll from Old Street Station to get the appetite up, the place initially disappoints on decor. Walking in there is certainly a homely feel, although the warmth doesn't seem to be there. The walls are plain, and the lighting is somewhat dim, giving off a very sterile impression. However, overall it is a clean place with ample space and fast service. The menu consists of mostly Vietnamese and some Chinese and other Asian food. Pho, the noodle broth dish, is clearly their speciality with over 20 different kinds. For the adventurous, there are the traditional ones with beef, tripe, and other cow parts. For the less adventurous, there is the standard rare steak (just thin strips of beef that are just cooked) or strips of chicken. As you can see in the picture above (credit to Tasty Treats @ Wordpress), the noodles come in massive bowls, with ample portions of rice noodles, beef, and beansprouts. And for £6ish you can't go wrong either! We ordered the fried spring rolls (£4) for the starter, which were very tasty. What impressed us most was that they also served homemade soya bean milk, which is the first time I've seen it in London. It is well worth the £1.30, as making fresh soya bean milk involves alot of energy and time, and even in South East Asian countries many restaurants have stopped making it as it is just not worth the effort. Extra kudos to Song Que! Although our experience was nice while we were at the restaurant, half an hour later after leaving both my friend and I started getting dry mouths, a symptom of MSG and other flavoring ingredients. To be honest if was one of the worst dry mouths I've had after a meal in London, with most restaurants very ethical about not using too much of it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "BqTMz9WZhtgsUNojMy_v3g": {
    "date": "9/12/2012",
    "text": "Asked around where can I get a good pho, my Londoner friend hyped up this place and brought me here.The first item I take on a road test at any Vietnamese restaurant is its pho, a main staple food. I give the pho here a passing grade, certainly not the best I've had, and not the worse I've had. I will pay for good food. I've asked for 2 pounds extra worth of pho, but I received what looked like a regular sized bowl of pho laced with children's portion of beef. This is, after they've attempted to give me someone else's order twice whilst nicely overcharging me 2 pounds more for an already overpriced for what you get bowl of pho. The broth was mediocre. Perhaps if my friend didn't hype it up, I wouldn't be as disappointed.Of course, people don't come here for the customer service (definitely lacking in the friendliness and promptness of delivery, but hey, this is a 'come here to eat good food and then leave asap' place), so don't complain. At the end of my meal, the server was taking away plates and bowls of soups over my head, to which I nicely asked him if he could do this not over my head as it was making me nervous of spillage, and I explained especially since I only had one jacket traveling in town and I was wearing it. He waved off my request in annoyance but did manage to find an alternative route to taking away additional plates... :-) Just remember one does not get \"the customer is right\" here... it is please sit, order asap, eat quickly and get out so we can get another paying customer in here immediately. If you can understand this mantra, you and this restaurant will get along fine. It's an ideal place to grab something quickly and not for a Friday night rendezvous. Oh and the decor... it's all green with a touch of shrimp symmetry. I know symmetry is good for decoration, but I'm really not sure about the two large symmetrical shrimps hanging over the bar.  Maybe if they added Little Mermaid, the crayfish and Nemo, we could really have a fun time there... ugh.I also ordered the shrimp rolls, it received okay marks.There has got to be a reason why people still flock here despite the lack of customer service and its desperate need of an interior designer. Please, don't tell me it's the pho! Since I sat next to other people, I scanned at what they ate. The people who sat on the left with me ordered some very interesting looking dishes and even chatted with me at the end - so there is friendliness here, just not from the wait staff! Their grilled beef wrapped in grape leaves looks/smells superb and is definitely good for sharing. My vegetarian friend swears by their pancake and happily gobbled his down without sharing (He's like Joey Tribbiani of Friends - don't like sharing food). If you come here to try something - feel free to ask friendly patrons sitting next to you or look around to see what others are having before you order... and be pho-warned, you know my take on the pho already.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nVrsQkDOFNiU4ol5Sk9JSw"
  },
  "5C6e7NBoC2qM78xVGv-OMA": {
    "date": "3/11/2015",
    "text": "It's hard to find good Asian food in London, and there's a lot of mediocre and overpriced Vietnamese places here served by non-Asian waiters. But this is the place to go for that!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSPfv1VqELN0-_m2bBXs4w"
  },
  "LA3Jt_LBijxsmVeB0F2ZMg": {
    "date": "3/24/2014",
    "text": "This is my second favourite Vietnamese restaurant on Kingsland Road, only losing to Viet Grill. The food is great, and not too expensive. The one dish it does beat the Viet Grill on is the pho, which I think is the best in the area, with a really meaty stock. My other usual is the BBQ pork and shredded pork vermicelli. The service can be a little erratic at times.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jkD0eejAIYjqiAbWw8BzMA"
  },
  "FG9yJ9C_9MD3Wv4HdvTeyQ": {
    "date": "1/10/2016",
    "text": "I'm a vietnamese from California so I know what vietnamese food should taste like, so far this restaurant serve the best authentic vietnamese food much better than all of the vn restaurant on kingsland road. Can't go wrong with their combo beef pho, summer rolls, calamari, and beef wrap in betal leaves.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2hq2_-1O4Vh4j3JIOUiMAw"
  },
  "lPO-lZPlACSYc1ilxl4aOg": {
    "date": "3/13/2014",
    "text": "The 4th meal here! We ordered beef stew which is quite different from pho but still get highly compliment ;the well cooked beef brisket n carrot pieces r just so tasty!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KdB7T5oadXVYmK2vtiQoWQ",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KdB7T5oadXVYmK2vtiQoWQ/o.jpg"
      },
      {
        "img_id": "1VfVRLk62tA6kCKQA3BBbA",
        "caption": "Photo of Song Que - London, United Kingdom. Beef stew!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1VfVRLk62tA6kCKQA3BBbA/o.jpg"
      }
    ],
    "user_id": "zxvDiRmCQmXNDi9KCBstOA"
  },
  "KErtNp4yY6ZhBXSP8x-dMA": {
    "date": "5/20/2013",
    "text": "Meh. That just about sums it up.  As some of you may know from my other reviews - I do a different Pho every month with two of my girlfriends here in London.  This one I actually did on my own, following a workout @Frame_Shoreditch and on my way home via Kingsland Road.  I tend to get easy distracted by stickers touting \"Yelp Loves us\" \"Timeout recommends\", etc. you know the drill - and Song Que has these plastered everywhere.  Additionally, the restaurant was pretty full so I figured this would be a good sign. I chose the pork and prawns Pho.Food: Meh - Lots of brown and noodles stuck together - 3 prawns and 3 things of pork. Not impressed. The food came out pretty quick - probably because they wanted the woman in a track suit eating alone with her International Herald Tribune to get moving! With all the other great choices along Kingsland road my only suggestion: look elsewhere.  Service: Like I said quick, but not friendly.  The younger servers were attentive enough, the older ones just grunted at me a bit when I asked which table I should seat myself at.  When it came time to pay, I asked for the bill and before I could lift my wallet from the table, they were already cleaning up the table and sending me out. Thanks.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zwVYz5sXfeaxdbRr7nXb7g"
  },
  "bSdBpQ21BU0tW9W6Q6c7Pg": {
    "date": "8/6/2014",
    "text": "Its simple: Yummy Reasonably Priced Authentic Vietnamese food!Definitely one of my top choices for vietnamese food.Closest station: Hoxton Overground station, 1 min walk away!Decoration needs a bit of updating - but not a biggy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i1GI5JF-gi01Ab9rgEgyyg"
  },
  "SBkxkU57vy5p6LbGrezs2A": {
    "date": "10/2/2012",
    "text": "This place fed me through my student years here in the UK, best Vietnamese joint in London, but then again it's the UK, so expectations have to be much lower. They would not be high on the list here in SoCal or the U.S. for that matter, but they are the spot for Vietnamese food in London. Solid food, decent service, tables are too close together but they're always pack so can you blame them?",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "1y8yJBrIn9kVdejzE6L6eg"
  },
  "GID8R0moatYF0HVYWsS-JQ": {
    "date": "2/1/2013",
    "text": "If you are searching for SE Asian cuisine in the neighborhood it's tough to choose from so many.Song Que's Vietnamese food is excellent.  The menu is humongous but the classics will not disappoint.  The Pho is a favorite.While the bright light interior fails to help a faulty complexion, the attentive staff make any desire for food or drink a reality in seconds.Three different Vietnamese beers to choose from and they are ice cold.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vgnxCeEh7M8SXHnm4yKC1Q"
  },
  "7frXegSbgtZK3u2-tKipVQ": {
    "date": "6/25/2015",
    "text": "It is hard to avoid the famous pho dish when you visit a Vietnamese restaurant and this time was no different. The rich broth was so powerful and savoury, cooked in beef bones and Asian spices such as star anise and ginger. The smooth and silky beef tendon and tripe benefited from the broth greatly and it was a bowl full of beef goodness. You can treat Song Que either as a quick grab or a proper dinner joint due to its extend long menu that suits both occasions, however it is a cafe at the end of day so don't expect any fancy services and it can get very busy in the evening with a no booking policy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "VsqXieZ4NFEfV-3YDZKdQQ": {
    "date": "1/25/2013",
    "text": "I came here expecting good Vietnamese cuisine following positive reviews. I have to say this was my most disappointing meal of the year considering the recommendations.I'm a fan of Mien Tay and am shocked that it is not frequented to the same level. The food is considerably better. Song Que left me with bland flavours, poor service and a feeling of hunger despite the several courses four of us devoured. That all preceded a bill of magnitude which I've never seen at a place in 'Little Hanoi'. Perhaps it was poor ordering, but I don't think I can recommend this at all. The daylight style evening lighting was shocking too. Thoroughly disappointed.Despite Mien Tay removing their BYOB policy, I would go there over Song Que. eurgh",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7lw6kGezBcjTxHMNJcASA"
  },
  "Ki4kjpBrv_YkULfiS-oKQw": {
    "date": "6/11/2013",
    "text": "Kingsland Rd is full of Vietnamese restaurants but Song Que is among the better ones. We tried the BBQ vermicelli rice bowl, bun bo hue, and some spring rolls. The BBQ pork was lean and tender and did not have as much grisly stuff as other places. The bun bo hue noodles were a bit peculiar compare to the noodles I normally have with this dish. They were not uniform and a bit challenging to eat.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "3G-nQ-ob6b3DEmU8wZQN2w": {
    "date": "7/23/2014",
    "text": "Absolutely terrible service and they've been down right rude. Completely over rated by loads of hipsters queuing thinking they're getting a good deal on a bowl of pho.  Just walk further down the street on Kingsland Road and find loads more shops, cheaper, and better service.  Don't be duped into going to this pho restaurant.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jU7oGy4C6rMIO9EeRCGqZg"
  },
  "v_ILYJ3TlY9NkREG1d74UA": {
    "date": "6/15/2011",
    "text": "The food is great here, delicious authentic Vietnamese food served in portions generous enough to make sure you leave feeling stuffed!Yes it is VERY busy so you may have to queue and then be prepared to be squeezed onto a table with other customers. All in all a fun if rather hectic dining experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5wo3OltTCRZjwweJ9-HD1Q",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5wo3OltTCRZjwweJ9-HD1Q/o.jpg"
      }
    ],
    "user_id": "JpBu7bsuFbLHxtdW0S8rqw"
  },
  "q6o20b64r5oFQa__Z3R-Kg": {
    "date": "6/6/2012",
    "text": "After being optimistic after reading so many good reviews, I was utterly disappointed in our meal. Both the crispy noodles and the bream were so very oily. Way too oily!!Then, the very worst, when the waiters came to take away our food, one said in Vietnamese to the other to keep the rice because they will use is again. Little did they know that my friend is Vietnamese and understood every word. Fools. I made a point to tell them what occurred and let them know it is unhygienic and unacceptable, and that we would never return.I will never go back here, despite the other good reviews.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSB2p1quN5zKlBwl3yxE-Q"
  },
  "6pr5lI55MinkhIohLRh6cA": {
    "date": "9/3/2012",
    "text": "As a lover of Vietnamese food, I've heard so much about Song Que and was really looking forward to the visit.  It may have been the hype but I'm afraid to say that it did not live up to expectations.  There are frankly better Vietnamese fare on Kingsland road.  I had the pho with a starter of summer rolls and Vietnamese lemonade.  Now the lemonade was over sweetened way way too much.  The summer rolls - first the positive, the sauce was lovely.  The rolls themselves were so bland.  The restaurant were complete stingy with the herb fillings not to mention the prawns.  There was 1.5 small prawns in the whole roll - which is just ridiculous for that size a roll.  Most of the roll was filled with plain rice noodles.But the pho was probably the most disappointing as this is what I had heard was so good.  The taste was so watered down and the richness of proper stock loaded with bones was clearly not there - which tried to compensate with an enormous amount of onions to disguise the flavours.  And they only brought out bean sprouts and lime as accompaniment.  When I asked if they had any sweet basil or vietnamese coriander, they said Vietnamese people don't eat those with pho.  It was only when my partner started speaking to the waiter in Vietnamese that they sheepishly acknowledged that they were out of the herbs!  My partner had the bun thit nuong and soft shell crab.  I had a taste of it and both dishes were  well seasoned and the fish sauce was good.I won't be rushing to go back though and definitely not for the pho.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "VBGFnfFzJy3zal5cAQ9zDw": {
    "date": "12/18/2011",
    "text": "This is the spot in all the guide books. The one filled with white people and American tourists. Usually that means it isn't as good. Not true with Song Que. Their Pho is quite tasty. Get the Rare Steak Pho (It is fully cooked by time it sits in the hot broth).Now... my big issue with this place is that it isn't the BEST on the street. It is on par with the other places on the road, particularly Hung Viet next door. If Song Que is too busy (as it frequently is), just go to Hung Viet next door. Just as good, and a smige more affordable.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "UT8hNDxr7f_cbR4B5KhHfw": {
    "date": "6/30/2012",
    "text": "To be honest I went there just to try the pho, as it seemed to be one of the best of London here.I took the pho with tripes, it wasn't bad but not great. For me the key to pho is the broth, it was here light colored, not perfumed enough.Tripes that lacked of taste.I didn't even finish it when i arrived starving...Anyone who can tell me where to find great tasty pho, let me know!!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wPAw78uUwQTJBRWOwwjCZA"
  },
  "63dwzkxPREC8jg2x2K8BAw": {
    "date": "2/9/2015",
    "text": "This place is very big with local hipsters, they will queue up for miles to dine here.  That's probably why the service is so bad, the restaurant owners must have realised by now that even if the patrons are treated like garbage, they will come back anyway because this is the place to be seen at.  It's a very loud place, the ceilings are very high and the floor size way larger than your average restaurant,  so that when the place is busy, which is always, the echoing voices from the 70 odd tables cramped together is nothing short of a conversation killer.  Unless you don't mind screaming your head off for the lenght of a dinner.The decor is interesting,  like a big Eastern food court, which I prefer to the tacky oriental themed Disneylands that some more pretentious restaurants end up being.And now to the food.  On our first visit, the beancurd pho was so outstanding that we promised ourselves we'd be back.  The herb bunches that came with the pho lush and plentiful, served on the side with lime and chilli, to be added to taste.  The broth rich yet zesty, heavenly flavours and just enough oil to be tasty without being greasy.  We also shared a beancurd and veg pancake which is pricey at £ 9 but comes up as big as a folded up pizza and was the crispiest, most delicious ever.  On our second visit we ordered the same food, as veg options are lacking, but waited half an hour before we were asked what we wished to order, and another half hour to actually get the food.  When it arrived, the pancake was soggy, as if the plate had been left hanging around waiting to be served for ages.  The waiter gultily apologised, which shocked us as he had been ignoring us so far.  The pho this time was bland, so I'm guessing it was the good chef's night off.  The people at the table next to us were screaming so loud that it was out of the question to hold a conversation,  the table we were sat at was right in the middle of a main waiters' causeway, so that we kept being banged into by waiters carrying food and patrons moving around on their way to and from the restrooms.   Dining there turned into a puzzling ordeal, comparable to being stuck at someone else's gypsy wedding, minus the fun.Waiters impossible to flag down: you will be ignored. Crowd annoying.  Hype impossible to understand.   Would be good for a takeaway.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5mm--V63mz-1Aa_oo7I2A"
  },
  "tudzB8QwQ7lxzezkO4an-g": {
    "date": "5/4/2009",
    "text": "the greatest challenge to dining at song que cafe is getting a parking space near the cafe and then beating the crowd to a table within!this should however be your default dining option when considering vietnamese cuisine.cheap and good indeed.jostling pass the crowd, amassed at the entrance, we felt privileged to be immediately joining our friend who arrived earlier and secured a table for us.he even took the initiative to order 3 appetisers, and it was not long after we were seated that the tasty treats arrived.we had the grilled beef rolled in betel leaves, traditional vietnamese pancakes and the prawn cupcakes.his choices were spot on and really whet our appetite.the prawn cupcake reminded me of half cup japanese tako yaki.the sweet taste of the well marinated beef was tempered with the slightly fragrant and bitter betel leaves.the pancake was really crispy with a generous portion of delicious filling which was a mixture of cooked bean sprouts, chicken breast slices and prawns.now for the main event,i had the bun, which is rice vermicelli tossed with vietnamese dipping sauce(nuoc cham), finely sliced herbs, ground peanuts and your choice of meat topping.i had a combination of grilled pork, sliced pork and cha gio(crispy spring rolls)this dish is described as a cold noodle on the menu but it is normally served at room temperature or luke warm most of the time.i love this dish.and of course, you must try their pho.the soup based vietnamese beef noodles is comforting and flavourful.the soup is tasty and clear, a sign of good pho.you need to add the condiments that comes on the side.follow your fellow diners if unsure of what to add.dont forget the hoisin and viet chilli sauce for the extra kick to your soup.my only complain is that the condiments were not fresh enough!you really need fresh herbs and bean sprouts, not wilting ones!!nonetheless, the whole experience was good.for those looking for a tipple, the vietnamese beer saigon export was surprisingly good.strong and full of flavour.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "7IhyHyKcj8Ss6Q3pgZv22g",
        "caption": "Photo of Song Que - London, United Kingdom. the crowd within",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7IhyHyKcj8Ss6Q3pgZv22g/o.jpg"
      },
      {
        "img_id": "t6up52wEiw0msXhau9yiaQ",
        "caption": "Photo of Song Que - London, United Kingdom. prawn cupcake appertiser",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t6up52wEiw0msXhau9yiaQ/o.jpg"
      },
      {
        "img_id": "W7ob6dh5ZVrvIJXeoC2lWQ",
        "caption": "Photo of Song Que - London, United Kingdom. opening hours",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W7ob6dh5ZVrvIJXeoC2lWQ/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "_53nU9m34ReVRqiSviEmiA": {
    "date": "3/1/2011",
    "text": "Oh god oh god oh god I came here last night and I've finally realised/remembered how mediocre all other pho is in London.This is the only place in London I've found where you can get tripe and other cuts of beef in the soup rather than just the usual steak. The service was fine, the waiters are quite jokey with the customers and very giggly! All I can comment about food wise is the pho, which was amazing, and huge! As far as pho goes, it's expensive... But it's worth it. I feel like I never want to try anywhere else ever again.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHDLnvulXX6JtkH2PgVE_Q"
  },
  "6UDl3XoiNN--VlKA3Pwtjw": {
    "date": "10/20/2014",
    "text": "I wish there were more restaurants like Song Que in London. It's close to a station (Hoxton Overground), and serves authentic food at an affordable price. This is a no frills, no fuss kind of eatery, and wouldn't look out of place if you plopped it in the middle of Southeast Asia. The walls are painted a horrific bright green and someone took things to the next level by gluing on giant ceramic lobsters, but that's what I love about Song Que. It's not trying to fit in and the food is pretty gosh darn good too.Song Que's pho is solid, but my favourite dish is their #60, which consists of grilled and shredded pork, and spring rolls on top of rice vermicelli. It's crispy, it's crunchy. It's salty and sweets. It's downright delicious. The best part? This big ol' bowl of food will set you back less than a tenner. If you come to Song Que expecting British-style service and fine dining, you're going to be disappointed. That's not what this restaurant is about. Come here for quick, cheap, and tasty Vietnamese food and you'll walk away satisfied.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v5dNicLOFRgsNs-Le03h3w",
        "caption": "Photo of Song Que - London, United Kingdom. Grilled and shredded pork and spring rolls on rice vermicelli.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v5dNicLOFRgsNs-Le03h3w/o.jpg"
      }
    ],
    "user_id": "VjOW1FOxrE4xyGnDUGsYIQ"
  },
  "8Zu2ziegL8z_dmWs2aHpaw": {
    "date": "3/30/2014",
    "text": "My favorite place to get a bowl of pho in London, mainly due to the lack of good options.Vietnamese food in general confuses me in London.  Since when does pho dac biet mean add shrimp, pork and chicken????  When I want dac biet, I want tendon, tripe, brisket and flank.  Song Que is the only place I've found so far that doesn't add random non-beef animals to their pho dac biet.  Order a large bowl and add beef balls for an extra quid.  While the soup doesn't match any of the offerings I've had in North America, at least they have Huy Fong sriracha!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iVqk2lY0XS3mxFVJHlVIpA",
        "caption": "Photo of Song Que - London, United Kingdom. pho dac biet",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iVqk2lY0XS3mxFVJHlVIpA/o.jpg"
      }
    ],
    "user_id": "6hXxFDDcIVrYUWKkYpOnUw"
  },
  "NYq6egwamdCBgApJq4PIQw": {
    "date": "10/18/2015",
    "text": "Pho and BYO. Good. Seriously great broths. They really nail the soups here. The starters are a little deep fry heavy and it's not quiet as fresh as I like viet foods to be but there is a serious amount of veg and herbs all through the menu. Really large serving sizes and two types of sriracha hot sauce for you to chose from on the table. The menu is huge so you have to decide if it's a sharing night or a solo soup night. The soups are comforting and filling and full of flavour. Highly recommended (unless celery isn't your thing) is the prawn veg sweet and sour broth. This will most probably cure any sort of ailment they you may be coming down with due to the chilli and garlic levels. Delicious.The pancake thing looks pretty great (again huge) but I'm yet to try. The viet spring rolls will solve any hangover problem. They do have a card machine (apparently) but it always seems to be down so to be on safe side bring some cash with you.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "onJgko2C3WB5XLqYHqD2MQ"
  },
  "zEJC1Tk64ikI0QVWld2Glw": {
    "date": "11/28/2015",
    "text": "A friend took us there and oh boy what a good idea !The menu is big, you'll find A LOT of choice. It's almost too hard to chose. I followed the advice of my vietnamese friend and went for the chicken bo bun and i did not regret it. I also took nems as a starter and jasmine tea. Everything was really good ans tasty. The portions were more than decent and i had some difficulties finishing.The place was packed but they managed to find us a table fast and the service was fast and friendly. The noise volume was not too much which i sincerely appreciate as i cannot eat in an extremely noisy environment. Their toilets were clean which i find important. I would definitely go back to try out more dishes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RVvLots4uL0thY8bZUHOsg",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RVvLots4uL0thY8bZUHOsg/o.jpg"
      },
      {
        "img_id": "n-ReQEG-7GEVaKxDg1XpHQ",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n-ReQEG-7GEVaKxDg1XpHQ/o.jpg"
      },
      {
        "img_id": "PLtH4J9xcExbxM9emJWK2w",
        "caption": "Photo of Song Que - London, United Kingdom. Nems",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PLtH4J9xcExbxM9emJWK2w/o.jpg"
      }
    ],
    "user_id": "TcIXXqDfcrFu2m-cEV2OTQ"
  },
  "kNrgJWtFsUhC1WyS0iWBJA": {
    "date": "12/21/2015",
    "text": "The food was delicious, the staff quick and helpful and the atmosphere fun. A friend and I shared the vegetable spring rolls (which I would highly recommend),  prawn paste on sugarcane, spicy soft shelled crab and a main of stewed fish in pot with boiled rice, all of which were very tasty (although beware the fish in pot if you don't like spicy food as there was lots of chilli in it). Our group was of 12 people and noone I spoke to had anything bad to say about the food. I would however suggest arriving early if possible as it was very popular - we arrived at noon just as they were opening and by 13.00 it was packed and there was a queue waiting to be seated.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ItWq0HHs-L3l99_muMke4Q"
  },
  "fV7a-tSL3XlCRxQ4tFooGA": {
    "date": "6/27/2014",
    "text": "Song Que is located on Kingsland Road, which is also home to a ton of other Vietnamese restaurants. It's a rather large space with tables right next to each other and a bright green interior. We started out with beers and the appetizer combination. It came with 5 different apps, which was a bit hit or miss (wasn't a fan of the shrimp toast or the ribs). For my entree I had the lemon grass chicken, at the recommendation of my waitress. It was okay, but nothing spectacular. Had a bit of spice to it though, which was welcome. Compared to the Viet food from the States, I thought Song Que was on par, but definitely not better. Perhaps not a fair comparison, but I was told London was known for its Southeast Asian cuisine.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJpvRrk04rb4rgWtMXaPUQ"
  },
  "ujyOFR0EpuEqneUpYzrF0g": {
    "date": "5/10/2016",
    "text": "Really quite impressed with Song Que. The food was fresh and reasonably priced. The salt n pepper squid was a little tough but the soft shell crab was perfectly cooked, crispy and juicey. The pork vermicelli dish I had was splendid and the spicy beef pho just as good. Basic service but quick and pleasant enough. BYO too. £70 for 4 of us. Would go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "ny3L0Z3LjXfw7EnLwkxygA": {
    "date": "11/20/2013",
    "text": "It's hard to find good Asian food in London, and there's a lot of mediocre and overpriced Vietnamese places here served by non-Asian waiters. So when I came here with a friend I was happy to see that it was a restaurant with Asian waiters, and full of customers of different ethnicities. It was super packed for a weekday evening, but we got seated pretty quickly and the food was also fast. I loved how the pho came in a huge bowl (the true way of serving pho) and brimming with soup and spring onions, and my friend who is a vegetarian was really happy with her fried rice and vegetables. Vietnamese anywhere else in the world is known to be inexpensive, so for the price we wish we got more but the food was good enough for us to be happy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SFwkTyiiVZT29UwWZpqG3w",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SFwkTyiiVZT29UwWZpqG3w/o.jpg"
      }
    ],
    "user_id": "M1Lt6xzFriw1p2fzbGIVgg"
  },
  "ePeUQOxEHjJaReqtQBiL5Q": {
    "date": "5/2/2016",
    "text": "I like the relaxed, down-to-earth feel at Song Que. It's not one of the hip, newer Viets on Kingsland but simple, spacious and welcoming. Our go-to dish are the vegetarian crispy fried noodles. I've tried other things which were also nice but I can't recall loving anything else in particular. This is not a place where I'd take someone for a special night out but it's perfect for an everyday lunch or dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPutIn3JgUQyVBLOeilXEA"
  },
  "nOBDYWZGfVE8ojiLE98hFg": {
    "date": "5/16/2015",
    "text": "I love it here! This is my favourite if the Vietnamese restaurants along the Kingsland Road strip and everyone knows where I mean by 'the big green place on the corner'.Firstly, the starters. The prawn toast is made using slices of baguette, it looks odd because it's something new, but you can tell it's home made and it tastes great! Then there's the cha gio - crispy, lovely, one-of-a-kind spring rolls served with a hoi sin style dip which makes me want to just eat these for my whole meal......So I do! My favourite thing to eat here is the pork vermicelli rice noodles (bun) with extra cha gio on the top! It's fragrant, fresh, good on a summer day when you don't want a steaming bowl of pho in front of you.But then there's always the pho for cooler days! Always excellently, freshly made, always tasty and a huge range of different toppings to try. Add as much or as little of the herbs and chilies which come with it (I say add everything) and they start to infuse the soup as you eat it.An authentic, delicious restaurant. It's great value for money to boot!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3jL0y0ah4uEy0XGFQLhYg"
  },
  "8x_-iw2Xb5o_VK25hidnBQ": {
    "date": "6/30/2016",
    "text": "First time here and I loved the food and service. Great hospitality and very prompt. If you are looking for a great place to eat Vietnamese food this is the place to be! I'm gonna miss this place when I head back to the States. The Vietnamese Crepes and vegetarian options are also awesome! Come here if you are looking for good hot meal at a good price. when I come back to London I'm definitely coming back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m-kovxQF1A9X8Dli6yhW5Q"
  },
  "YxvKLR_oUh5AxTkVwM6ZaQ": {
    "date": "6/10/2015",
    "text": "It used to be better.. Service is not as good as before and quality of food is going down... Still good, just not as good as before specially if you compare to the restaurants nearby :-) prices around 15pp including a drink.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eXuabPjkO7UcyiWzd0WsCQ",
        "caption": "Photo of Song Que - London, United Kingdom. Fried seafood noodles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eXuabPjkO7UcyiWzd0WsCQ/o.jpg"
      }
    ],
    "user_id": "AE7OTlqvA4-dO-EGEIuYaA"
  },
  "z5vgHg4xt8PODJaacr7r6w": {
    "date": "7/15/2016",
    "text": "This is one of the better Vietnamese restaurants. Coming from Southern California where there is a huge Vietnamese population and tons of amazing Vietnamese restaurants, I really enjoyed that they offered what I've grown accustomed too. They don't skimp on the herbs on the side plate for your pho and the broth of the pho was very flavorful. I would definitely recommend this place to other travelers.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPGxFQjgT9Plcp3egHzyJw"
  },
  "OTV-6MbR1YZZTtHURq0mcg": {
    "date": "11/18/2012",
    "text": "The first time I came here there were people waiting to be seated, so I decided to come back before the dinner rush another day.The layout is more communal than I am used to; most of the tables are side by side, so you sit pretty close to strangers. I was also placed at a table with most of the seats already taken rather than an empty.I ordered spring rolls for appetizer, and duck with mushrooms and bamboo stouts for dinner. The spring rolls were crisper than most that I've had. I also think the oil or the batter used was atypical as they had a peculiar flavor that I could not decipher. The duck was perfect. It was in a light colored sauce with scallions which was complemented by the mushrooms and bamboo stouts.No problems with service. The food was prepared extremely quickly. My appetizer came out in about three minutes, and my entree came out three or four minutes after the appetizer.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "uqj4XaL6rasECMz64zhC7Q": {
    "date": "2/29/2012",
    "text": "Where has the... crispy fried egg pancake stuffed with sprouts, chicken, and prawn, served with fresh mint and basil and fish sauce... been all my life?! Thanks to the magic of wikipedia, I believe the proper Vietnamese name for it is bánh xèo.Although I recall it being listed under the starters, it might as well have been a meal for two. P.S. If anyone has found a way to consume this dish gracefully, without dripping things all over your arms and onto the tablecloths, do let me know.Plus, for the decision-challenged yelpers of the world, you're in luck when it comes to the angelhair-esque bún. You needn't have to choose between spring rolls, grilled pork, or shredded pork with your noodles... you can have all of the above in one bowl! Sheer brilliance (where 'brilliance' is read 'gluttony').And bonus points for staying open late. Though their hours officially close at 2300 on a Monday night, we definitely witnessed a gent walk in and get seated around 2215. -That's- a promising situation, if I've ever seen one in this city.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "nrKJmQza_JraydT-5VsR8w",
        "caption": "Photo of Song Que - London, United Kingdom. Bun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nrKJmQza_JraydT-5VsR8w/o.jpg"
      },
      {
        "img_id": "UfKmX5bJL8SCmYfFwQ79ag",
        "caption": "Photo of Song Que - London, United Kingdom. Banh xeo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UfKmX5bJL8SCmYfFwQ79ag/o.jpg"
      }
    ],
    "user_id": "RmXIjppHNtVveguN10iO1g"
  },
  "Miw0rEt6mT69fzuT-FAdIw": {
    "date": "4/26/2014",
    "text": "I've been on a search for good pho in London for a while and so far, Song Que ranks high up there for me. Don't get me wrong, the search continues, but I'm always happy to come here. It's always busy, and don't be surprised if they seat you right next to another family or better yet, a couple on an awkward first date. This happened to me last night and it was very endearing basically sitting in on their date but also a bit awkward. All part of the experience!I opted for #135 which is the pho with rare beef, tendon and tripe. I most often get the \"special\" which at Song Que, I've determined this pho to be. The portion is generous, and cheaper than the green pho place across the road (can't remember its name!) The spring rolls are consistent and tasty. I haven't tried anything else, simply because these are my go-to Vietnamese items. I did go with a vegetarian once and she was in love with the bun noodles and found no issues with finding tasty things on the menu.If you are confused about which place to pick on Kingsland road for a good pho place, Song Que is a good bet!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "255UWFKMll3xfOtUj1E_ZQ"
  },
  "rUEiz82FtZKeNGjHPbpN7g": {
    "date": "4/23/2015",
    "text": "I've been coming here for almost a decade and love it.  It's very busy and the service is typically fast and furious, but on the plus side if you're in the queue it means the wait is usually not too bad.  The fragrant and crispy soft shell crab and fresh zingy green papaya salad are a must.  My personal favourite is the combo pho, rare beef, beef flank and tripe in a yummy noodle broth.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FsdqxOXPwOT01u8hzF5cLA"
  },
  "Wf9AIeAu0wUUx4mG2n_H8w": {
    "date": "5/29/2014",
    "text": "Started sharing the green papaya salad and fresh spring rolls with pork. I would have loved way more salad and maybe more herbs (mint, coriander, basil) in the spring rolls. They were too bland for my taste. I need to stop ordering things that I can easily make at home. They will always disappoint. Got the rare steak pho. It was tasty but there weren't enough \"bits on the side\" for me as per usual. And our front corner table for two didn't have any sauces on it, though I don't think they would have fit if we had asked for it. We got seated quickly, might have been there before the dinner rush, and we got served within a timely fashion.If it was busy and we had to wait and didn't get the corner seat with more elbow room I probably would have enjoyed it less. It was super packed in there already. Maaaybe go back again. Maybe. On a slow day. With a bag of herbs in my bag. :)",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aSVTAoYbpjQiP4OTUnp2vQ"
  },
  "2E5w4EeShfYqd0humBVfMA": {
    "date": "3/25/2015",
    "text": "A walk down Vietnamese St, (AKA Kingsland rd)Always raises the question which one is the best Vietnamese restaurant on the walk?After been living in East London for a few years I'll attempt to answer the question, after all I visited once or twice each place.Today I dined at the Song Que cafe, and it's the first time I'm expressing my views of the restaurant. Some say it is the best one on the street, but yet after another ordinary meal, I find it really hard to understand why it the \"best\" one. We ordered 5 starters and one main.The crown of the meal was the summer roll, full fresh flavour and chilli garlic sauce. The main was the grilled and shredded pork which was delicate, fresh and worked perfectly with all of the complex ingredients.Sadly this is were the good had finished! The chilli squid was chewy and the crab and sweet corn soup wasn't edible.The staff and service was good, and in all I  do recommend to visit the Song Que cafe, for a nice Vietnamese supper.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlN38OqbM5finlSMJCUjPA"
  },
  "r6JrPAegLYR1cGawy-590g": {
    "date": "11/4/2011",
    "text": "At less than 8 pounds for a bowl of pho, i'm down! While visiting the Geffyre Museum, i saw this street of pho restaurants... came home, and Yelped some pho places to see which is good and this came up so here I went with my friend on Thursday.I ordered the #140 which is like flank and rare meat or something pho and it was fine. They bring you these crisps at the beginning...I also got a coke and they give you a lime and a glass and then the can. My pho was good, it doens't beat boston, oh no..but it definitely better than places I've been. I guess i'm used to specific noodles and soup so I'm a bit biased..and a pho snob. But this is fine to grab a bite and I don't mind coming again. It's a bit out of the way because you need to take the OG..but whatever...it's SO close to the tube station! High ceilings, and lots of caucasians so i guess they know wassup in london lol. There were some asians so I was like \"okay, this should be okay..as it's the most famous\"*service is quick and they always clear away your plates! NICE!!! London needs more of these places",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CESIxRplQxxE0ruEXrrVSg"
  },
  "dw2zgcuj2Vw9Ati6J-eXkQ": {
    "date": "7/28/2018",
    "text": "We are from the USA. By our standarts its the best pho vietnamese we've ever had.Best vietnamese coffeeBest pho brothFreshest spring rolls.Not sure how this compares to other local Viet places but best in our experience!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TirSlxAzed_Azm99enHrpQ",
        "caption": "Photo of Song Que - London, United Kingdom. Spring rolls after I bit one...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TirSlxAzed_Azm99enHrpQ/o.jpg"
      }
    ],
    "user_id": "_tFquA65cSXC98QrQgOJug"
  },
  "syyGP4MZrsILH-MCczkMNA": {
    "date": "4/28/2018",
    "text": "Stopped for a late night but quick meal at Song Que Cafe after a show at Hoxton Hall They have a HUGE menu compared to most Vietnamese places in London, which makes it difficult to choose just a dish or two.I'd had soup for lunch and ramen the previous day, so I opted for the grilled & shredded pork with rice vermicelli. He wanted the fried crispy noodles with chicken and a side of egg fried rice. They served us prawn fried rice by mistake and were ready to change it. But since I wasn't having the rice, he said he'd have the one with prawns.For starters we had the crispy squid and since I didn't want coffee at 11pm, I eschewed my favourite Vietnamese drink and opted for the tender coconut in syrup which was fantastic!Amazing food. I need to go back to try the pho that they are so famous for.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IRbhYC6GY00Dm5BWNhYZ2Q",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IRbhYC6GY00Dm5BWNhYZ2Q/o.jpg"
      },
      {
        "img_id": "DpgK4RTsNPaX_4xc86Ocjw",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DpgK4RTsNPaX_4xc86Ocjw/o.jpg"
      },
      {
        "img_id": "SctYON6azDOP2b_Qr9Iijw",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SctYON6azDOP2b_Qr9Iijw/o.jpg"
      }
    ],
    "user_id": "kKM1IGrc4nCuvfv968NigA"
  },
  "Cm5A0SYGPLfDJnd3ze75lQ": {
    "date": "8/26/2017",
    "text": "Song Que was the first Vietnamese restaurant I was taken to years ago when I didn't know my way around Shoreditch and I was massively impressed.I have since tried most soup kitchens in the area but Song Que still beats them all. There's even something comforting in the garish decor and bright lights - this is how I remember China Town ... I like the fact that some of the dishes are pictured in the menu and one combining three different varieties of pork just did it for me - and didn't disappoint.Service is fast and friendly, food delicious, price affordable. I hope Song Que will be here for many years to come.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Y3nb7Q500glw5UgXKZ2Bw",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Y3nb7Q500glw5UgXKZ2Bw/o.jpg"
      },
      {
        "img_id": "WYlXTKhu1NEYeIkzFpxRoA",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WYlXTKhu1NEYeIkzFpxRoA/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "Dtt3X0-tSkIQ8uAchMnRSA": {
    "date": "8/20/2017",
    "text": "Tasty Bun Thit Nuyong for £9. The grilled pork chunks were quite large in my portion. Plenty of indoor seating on a Saturday mid-afternoon. Service was ok. Note that to pay with card, there is a £10 minimum (I just paid the extra £1 difference).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8Yyhjd58mlKeYJSTRc5VVQ",
        "caption": "Photo of Song Que - London, United Kingdom. Bun Thit Nuyong",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8Yyhjd58mlKeYJSTRc5VVQ/o.jpg"
      }
    ],
    "user_id": "ThjX_knyN8JFASeK9HJ8Og"
  },
  "6GfVt8VARXs6CztVRc_m4w": {
    "date": "4/22/2018",
    "text": "Hands down the best Vietnamese food I've ever had outside of Vietnam. The pho was phenomenal as was the nem noung and traditional Vietnamese seafood pancake. Not much for ambiance and there's usually a wait to get in but the food is to die for. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKh74sEpvtobrclCvYlmZg"
  },
  "gaBkm1vaRr6frZ_3R9CgDw": {
    "date": "8/5/2017",
    "text": "Super green restaurant and yummy pho. I come from a land of bad pho so this is great for me. I end up eating her cause every time I arrive in London my local friend is hungover and needing a soupy, brothy pick me up of which I don't mind since it's usually the beginning of a long non-Asian food work trip in Europe.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rbufOtPxXfzPZwqxC4W3Cw"
  },
  "SCDC_0uot9OSpmSIiL2Atw": {
    "date": "2/1/2016",
    "text": "I have to say that although I really do love Cafe East by Canada Water for their Bahn Cuon, I appreciate the better pho overall here at Song Que. Song Que does not have Bahn cuon, but it has a larger variety of food selection in general and has amazing fresh shrimp rolls and free tap water!The service here is pretty spotty and they did forget about our appetizer, but the food was so good that all is forgiven.The prices are no longer as cheap as they used to be (used to be around 7 quid for a bowl, now the rather large bowl is around 9). A bowl of pho, a bowl of bo bun, a spring roll, iced coffee and coke totalled to about 30 quid. I don't love the price point, but I do love the food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DPDSt37-BsZi-TNyhN7NpA",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DPDSt37-BsZi-TNyhN7NpA/o.jpg"
      },
      {
        "img_id": "HOIAe3s2BCPRWxIRUCA1_w",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HOIAe3s2BCPRWxIRUCA1_w/o.jpg"
      }
    ],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "vEk_91f5pB3hcEg0k0XMCw": {
    "date": "7/9/2017",
    "text": "The pork, shredded pork, & spring roll noodle salad was perfection. The grilled pork flavorful, the dressing complimentary. The crust on the spring rolls was a little tough, but could be forgiven for their crunch and flavor. I could have eaten 2.Less stellar, the Hot and Spicy soup was not spicy, but the broth was a mouth-party of lemongrass, spices and herbs. The noodles were too bland for the mild soup, so I drank all the broth before dressing the noodles up in hot sauce.Most of the tables were taken by Vietnamese families with adorable 6 yr-olds finishing their own huge bowls of Pho. Order by pointing at that kid's food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CVnZomk9V2HoW3ihJh_R8g"
  },
  "3RAM_EDg3zWrBpjvE7c5qA": {
    "date": "8/7/2016",
    "text": "Great Vietnamese restaurant in London. In a street plenty of Vietnamese this is the most popular and definitely very authentic. They have more than 20 types of Pho. The beef pho is the national dish of Vietnam and this is s great place to try it. Plenty of options for vegetarians too. The aubergine with tofu is my favourite. If you brave enough you can have a three colour milk, a drink made with coconut milk and whole beans. I found the drink very filling!!  The best of all, mains are less than 10 pounds each!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3rqtZlMcPieplyBj2OvyDw",
        "caption": "Photo of Song Que - London, United Kingdom. The three colours drink once stirred",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3rqtZlMcPieplyBj2OvyDw/o.jpg"
      }
    ],
    "user_id": "Pl7lKVLcfFC7KtJqGOcpjw"
  },
  "s7bdu7DDRjkbOcb_pCkXXw": {
    "date": "6/5/2016",
    "text": "Ok. I have been here many years ago. I bookmarked it specially to give it another go as a reminder of passing. I was passing. I was craving some type food. I was out voted by friends who voted in favour of Vietnamese rather than Japanese and Fried Chicken as we walked along this stretch. I was hoping for good things. I made sure I looked at reviews online and other sites as I can be OCD like that. I was sadly disappointed.I must say this review is for everything but the Pho. I really should have got the Pho because everyone was having it. The place was packed at 9.30pm but we managed to snare one last table for 3. A table too big for us so we separated out spaced. Service was good. All good English and accommodating without any hassle and helping us with questions. Tiger beer good too of course. Good buzz about place too with being overly mad or too intimate.Onto the meal though. Given that I haven't had much Pho in London. And I mean proper Pho. The best one I've ever had was in Paris. The broth there was so good I tipped it over my face and guzzled it down. You get that right and everything else follows. As I said, I didn't get the Pho. 1- because I didn't want anything too heavy/fatty after drinking most of day and 2- I don't want to stereotype but seeing so many westerners/English around me doesn't make me follow their lead. If they are locals or native tongues (you know when you see authentic Chinese in a Chinese that's a good Sign go sort of thing) then I usually do.The starter of pork summer rolls. The rice paper was much darker and not the usually light colour. Obviously partly due to a darker filling. In hindsight always go for prawn. Summer rolls are better refreshing, a teaser to the meal. These were just gritty and not clean tasting on pallet. I did not enjoy these and was a prelude that set the tone.We each had a main dish... meat (pork) with additional rice; a mango papaya salad and mine being a crispy noodle seafood dish.The pork my friend got only had two pieces. Lots of rice. Meh. Good tasting pork though. Just needed more value for portion I feel.The mango papaya wasn't the best I've ever tried but not bad. Jut needed more freshness and zing. Just more to do it. When you know, you know.My crispy noodle (they asked for soft or crispy). I wanted crispy and liked quite how crispy they made it. Not crunchy tasting more bite to it. It was a huge portion to be fair. That surprised me considering seeing the other two plates I had seen arrive first.The dish overall. Well, I have to admit I wanted, I craved soft shell crab and chicken satay initially. Regardless of the Pho-pas (get it? I'm here all week boom boom!) I wanted something meaty, protein no fattiness or heavy. Somehow I opted for noodle with seafood. So ok I got my seafood craving.It pictures well, plump whole prawns, scallops and squid, maybe octopus too. But the sauce that binded it all together was of best described gloop. Just nothing really. I actually hate stir frys. Although this wasn't as oily as most stir frys you make or order it just did nothing. Very disappointing.I pride myself on never really eating bad meals because I know where to go. I have a long hitlist,I know where I want to hit, but sometimes you do give places a chance. What I do realise is make sure you are at least trying what someone recommended. If esquire or yelpers are saying get the Pho, you damn well get the Pho (even if you don't want it). Of course food is subjective but I doubt I will go back here. If I ever do, and it will be on its last chance it will only be to try the Pho. But don't bother with anything else unless your tastebuds don't work.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9252_z3-aP4IAvDlfWZsVA",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9252_z3-aP4IAvDlfWZsVA/o.jpg"
      },
      {
        "img_id": "gj7-fnm4o2P4aSCKCtMohw",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gj7-fnm4o2P4aSCKCtMohw/o.jpg"
      }
    ],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "D0fXc171M-RwqNDqk3EUuw": {
    "date": "6/1/2016",
    "text": "This place has gone downhill at an alarming rate. Whatever you do do not get takeaway. I purchased some \"seafood noodles\" and paid well over the odds. Having been here years ago and having positive memories I didn't mind...However when I got home I opened what was a sticky clump of unseasoned rice noodles with one prawn and one scallop.Daylight. Robbery. I was so annoyed. But given the time of night and my location, I was unable to return the \"dish\".My recommendation would be to go elsewhere on kingsland road!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XvegvsXSyo34GqEdDG1N1A"
  },
  "hgdGLPM8-xFwysse3-qUkw": {
    "date": "8/14/2016",
    "text": "Mum always tell me that if a Vietnamese place is filled with locals then you know it's a good place for a good bowl of pho.. This is a family favourite considering this road has a Vietnamese restaurant at every other shopfront. I love their broth not too salty and the fresh herbs that they give you for the pho is great... I am not a great fan of raw beansprouts but if you dunk it in the soup as soon as it comes out.. Then it gives it a chance to cook in the steaming broth. Also orders the summer roll.. I've had better bit I do love the dip that comes with it.. Lots of others stuff to try.. So will be back for more of the menu..",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T2BoW5_WndZjkbLTAl_cXg",
        "caption": "Photo of Song Que - London, United Kingdom. Special combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T2BoW5_WndZjkbLTAl_cXg/o.jpg"
      },
      {
        "img_id": "9FCazMIRl5CFFHDhdUCoTQ",
        "caption": "Photo of Song Que - London, United Kingdom. Combo beef pho... Come to mamma",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9FCazMIRl5CFFHDhdUCoTQ/o.jpg"
      }
    ],
    "user_id": "ZpBMuzKnd9DLPK_2QBSHvg"
  },
  "5mrU1wrwWR4iElbZPgbylg": {
    "date": "6/8/2016",
    "text": "Always a pleasure to come back here, this time half hour before close, food is still delicious at ridiculous o'oclock.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k8pKyyMUuhfpusUNKe_n7w",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k8pKyyMUuhfpusUNKe_n7w/o.jpg"
      }
    ],
    "user_id": "Rhkv-27rPZHQzK_ZYhd3rQ"
  },
  "xniuWCUZHRVkrZF9D5CUYA": {
    "date": "9/16/2016",
    "text": "Having been to Vietnam recently and dining at numerous authentic vietnamese restaurants in Los Angeles, this restaurant did not meet my expectations. You can call me spoiled but i am used to mom and pop restaurants that are filled with locals. The decor was very tacky and the food was just okay. The only perk was the complimentary fried shrimp chips that they gave us to munch on while waiting for the food.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k5-nnHMKj-svrcLFxZIcDg"
  },
  "fM9LU4JVF4P-2sGIAL6Few": {
    "date": "5/24/2016",
    "text": "Why? Why that combination of apple green walls, golden plastic tablecloth and red chairs? This is a mystery. Tasteless when it comes to the decor, but oh my, all the taste is in the plates! Song Que has seduced us, from the first bite of our starters to the last drop of the beef phô. First that grilled beef in wild betel leaves, probably the single most tasty starter I've had in a while. Add on top of this the shrimp paste on lemongrass stick..what a treat! My shredded pork + spring rolls on rice noodles was a delish, and my wife's basic beef phô was exactly what she needed. Don't come here for a first romantic date, but this makes a perfect choice for a genuine Tuesday night bite if you don't feel like cooking ;)",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Qzu3MooyeO_vB-tNiQ1RQ"
  },
  "YLrEWuvSinHewHNE6_-S-Q": {
    "date": "6/2/2016",
    "text": "Yum! Authentic Vietnamese food. The restaurant was big and had plenty of seating, and is located conveniently near the overground station. The pho was hot and flavourful, and of course delicious when paired with the sriracha and hoisin sauce. Felt it was a bit pricey for pho, but I suppose it's the average prices for vietnamese food around London.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OZhbdyANnVKUgbrXAfnzTg"
  },
  "5PtWUaA0LLRv8-Cx73HrNg": {
    "date": "11/26/2016",
    "text": "One of the best pho places I've gone to since I moved to England. Authentic foods from back home.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hkpc2AGiy3MTyVIg6Pd8Og",
        "caption": "Photo of Song Que - London, United Kingdom. Fried green mussels with ginger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hkpc2AGiy3MTyVIg6Pd8Og/o.jpg"
      },
      {
        "img_id": "MtmGr6mvUkMgr4ws3rZjiQ",
        "caption": "Photo of Song Que - London, United Kingdom. Combo pho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MtmGr6mvUkMgr4ws3rZjiQ/o.jpg"
      }
    ],
    "user_id": "IX5MUviAqQaKdc9YTMbvLw"
  },
  "vNE_jzK-qtu9RZCF231OZA": {
    "date": "5/30/2015",
    "text": "I'd give it 3.5 stars but am rounding up. The pho was quite authentic -- good noodles and broth. I also liked the briskets, which were well-cooked. We also ordered summer rolls, which wasn't as impressive. Felt like the veggie contents inside weren't very harmonious. Vietnamese coffee was also good, though not as strong as some that I've had. Overall, a solid place that I'd return to -- but not perfection.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "heAb7CiADBJyfBz69zXN3g": {
    "date": "3/21/2015",
    "text": "Trying to get my pho fix in Europe...It's pretty decent but was hoping for something akin to Cali pho but got something closer to NYC pho.  The pros:  low MSG use (huge bonus points for that) in pho, quality meat cuts, good size, noodles were right on, a bit of oil/ fat in soup (yes you need some of that yummy fat), attentive service, and solid traditional Vietnamese menu The cons:  pho is bland -  I realized that there were no slice onions and it's lacking an herb but can't put my finger on which one, chao tom (shrimp paste on sugar cane) was tasty and cooked correctly but I wish they would have served it with fish sauce and not sweet chili sauce, and the iced coffee had a heavy caramel flavor - blah! Looking at the crowd there were very few Vietnamese people which should have been a sign.  And for those that saw other Asian people in there (per other reviews)... They were all Japanese! Nothing against them but I think they were tourists as well.  And listening to the kitchen, the chefs are all Chinese (from my village which is pretty funny).  So there it is...  It is Chinese pho and I need keep looking for that perfect bowl.  But I have high standards so I am giving them a 4 but in the world of pho they would have gotten a 3.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "avpLSBBI6Jb62pjbw9bIqQ",
        "caption": "Photo of Song Que - London, United Kingdom. Chao Tom -   Hate that it was served w/ chili sauce instead of fish sauce and pickled radish & noodles were so spot on!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/avpLSBBI6Jb62pjbw9bIqQ/o.jpg"
      },
      {
        "img_id": "uIan-Dj8VHbpovnzBN7tlg",
        "caption": "Photo of Song Que - London, United Kingdom. Pho tai - perfect glisten to the steaming hot soup!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uIan-Dj8VHbpovnzBN7tlg/o.jpg"
      }
    ],
    "user_id": "Qonq1okOfB7nGXvSVY95wg"
  },
  "p09vucMGU-1WbCKsC-GREg": {
    "date": "11/20/2015",
    "text": "The grand-daddy of the slew of Vietnamese places on Kingsland Road, they do a few things well, and we keep coming back.Song Que has strengths and weaknesses.  The pho, spring rolls, and bun cha are all excellent, and those are what keep us coming back.  Everything else we've had has been decent but forgettable.  Lemongrass chicken, summer rolls, various Chinese-style stir frys, all fine, but not excellent.  Stick to the Vietnamese classics and you won't go awry.The space varies from busy to raucous, with fairly abrupt service and zero romantic ambiance.  But it's a cheerful place, the food comes out quickly, the beer is authentic and not too expensive, and if you're getting pho, you have to get it in person; takeaway just isn't the same.  Overall, it's a quirky place, but the good stuff is so good that we come here probably once a week, so by the voting-with-our-feet measure, it comes out looking pretty good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pqzn0IbsW8EGlAAk3lmk1A"
  },
  "hn3SdXol7ttF-G-kqGSaOw": {
    "date": "6/16/2009",
    "text": "the noodles in the pho were perfectly cooked (vs. commonly overcooked)- that makes such a big difference.i also liked how i felt like i was in oz. the walls are grass-green and the waiters wore mint green.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ps_81rqwpgRnj2DCf7xcA"
  },
  "a-Lj3oGm399X2smztlyMQw": {
    "date": "7/3/2011",
    "text": "The food's good but not the best on this road. Service is unnecessarily snappy on many occasions but the bustling crowd negate this with lots of people watching opportunities.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mdQHGimGB7tscZ7-W-wdbg"
  },
  "x7sE_XNkSdhjYaTnzSm26A": {
    "date": "8/22/2011",
    "text": "People talk about the soup but I'm hooked on the beef salad. It's a fun place, even if the service is a little hectic. They'll make room for big groups, but be prepared to stand in line regardless.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "K38tgppQOe8pNDu5klbrOg": {
    "date": "8/22/2011",
    "text": "Song Que is my favourite vietnamese restaurant in London. The restaurant and service is very basic and simplistic, but everything on the menu is absolutely delicious and very authentic too, in particular the combo pho, sea bream with mango, beef and papaya salad and prawn rolls MMM. There is usually a queue so book in advance if you can. Definitely recommended!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hZtDt6jAiIw3yRgAQZzzjA": {
    "date": "4/30/2008",
    "text": "The best restaurant fro Vietnamese in London!!! Both thumbs up!!! Cheap and great taste! The grilled pork pho, Vietnamese spring roll, pancakes and mango fish all so delicious! Can't wait to go again! There is a huge and varied menu available. Rambutan drink is a must-try! Be sure to turn up early or expect to queue for a table! Expect to spend about £10 to £15 per person! It is quite stuffy inside though so you will smell of food after the dinner! But it's all worth it!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FoVV1hFW7cZ6i3wQvBFkOg": {
    "date": "5/25/2008",
    "text": "This is the second to last Vietnamese restaurant as you head north along Kingsland road but before you get to the Geffrye Museum. We stopped in randomly late on a Saturday night and the place was buzzing. We didn't have to wait too long for a table, just 5 minutes. Which gave us the chance to chat with the people also waiting. One girl, who could correctly pronouse pho, raved about the pho here, plus the pancake. We weren't starving, so I had the rare steak pho and D had the grilled pork bun. I wished I had ordered the pancake. The pho just didn't do it for me, as the soup wasn't really temperature hot enough. It couldn't par-cook my bean sprouts. The steak wasn't anything special. I would have preferred more broth and the noodles were really stuck together in a lump at the bottom of my bowl (which suggested they'd been sitting in the bowl for a while before the broth was added and they'd probably cooled the soup very quickly too). D devoured his bun, so it was probably quite tasty. Our vietnamese coffees were also good, though I'm not sure the coffee was the true ultra-slow dripped through the wee pot atop your glass variety, as they arrived pre-mixed. It looks like they take reservations and for groups. It was a young crowd of local hipsters on a Saturday evening at 10pm. I just didn't have the pho I was expecting given all the raves I'd heard about the place. But I am really picky about my pho.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3rhCH4OmxPf2ZqT6W_o08A": {
    "date": "8/30/2007",
    "text": "The bestest place for food in London!!! Just like a proper Asian canteen - and with something like 25 different varieties of Pho, you can't go wrong!!!!! And SOOOOOOO cheap!!! Amazing EVERYTHING!!! Try EVERYTHING if you go!!!! The staff are great, fast, and friendly.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5cRJ_Pun-0KORRRbFY_n_w": {
    "date": "1/18/2008",
    "text": "Wonderful selection of mainly vietnamese food, MASSIVELY over ordered, plus had 2 bottles of wine and it only came to £15 a head! bargain. Very authentic food, tasty Bang Xeo- but a little greasy, great fish, and veg sour soup. fair amount of veghetable dishes-alot of tofu so alright for vegetarians.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TdZR5FMYGHHYk4-9rRSP1Q": {
    "date": "12/16/2008",
    "text": "Out of a whole street of Vietnamese restaurants, Song Que appears to be the most inviting and serves extremely good authentic Vietnamese food. Its layout is simple, nothing special about it, and if it gets packed the tables become communal. We shared a portion of their Vietnamese spring rolls, a plate of fried noodles and a bowl of soup noodles. The beef soup noodles was excellent, and came in a large bowl filled with steaming hot broth and filled with a complimentary melange of spices. Such flavours as ginger, basil, mint are fused together to produce the most salivating flavours. Service is quick, and you don't have to wait long until the food arrives ready to be gobbled up. The complete unpretentiousness of the restaurant allows you to just get on with your food and enjoy it as messily as you want. The prices are extremely reasonable as well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3Tee9JlBcFBxRmpI6QPe1g"
  },
  "JJGfUag-TbAjfQzxS6Ftkg": {
    "date": "2/26/2011",
    "text": "Song Que is definitely the best Vietnamese restaurant on Kingsland road hands down. The food here is good but if this restaurant was to relocate to Vancouver it will have a hard time finding business. Of course you should rate it in comparison to whats around in London so I'd definitely say it is the place to be for some good Vietnamese food. What I love the most is their bun cha (I think) which is the cold vermicelli rice noodles with bbq pork, shredded pork and spring rolls. Soak it all with the fish sauce and you're good to go.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dXyxLgCDWL6qWng2yXew1g"
  },
  "tfeuymX6fMUIew41GbPYdw": {
    "date": "12/2/2012",
    "text": "Song Que is, in my mind, overhyped.  The food is generally good and I haven't had any issues with the service as others have had.  I had summer rolls, which you could tell had been prepared previously, and not specifically for our table.   They were pretty good nonetheless.  The vietnamese pancake with mixed seafood was very good.  The pho, however, disappointed.  The broth was good, but the meats were not very flavor and overall, the dish was rather bland.  I've had much better in Deptford.  I feel that Song Que has altered the dishes for the Western palate.  Nonetheless, this is a solid eatery for a good Vietnamese mix.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kE-0CmhkXRnpD1NZDawBfQ"
  },
  "tIcERF-trWXvvU5fraUx6w": {
    "date": "12/10/2008",
    "text": "I think this is my very favourite Vietnamese restaurant in a street full of very high quality ones. I came here the other night and both me and the person I was with bumped into a lot of people we knew, surely a good advert for a restaurant. The Pho, noodle soups, are great here as is the spicy squid. Don't expect to linger over your meal as there is a pretty constant queue in the evening and staff aren't ashamed to give you the pay quickly tactics. Still the upside of this is that food also arrives really quickly.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SgTAbzPo6rLvBIrUFzLq4A",
        "caption": "Photo of Song Que - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SgTAbzPo6rLvBIrUFzLq4A/o.jpg"
      }
    ],
    "user_id": "WhUdxlmwXdJhv8YMRfAuxQ"
  },
  "fzxx2A8qlf5y81MwxMz4pA": {
    "date": "1/22/2010",
    "text": "I couldn't resist kicking off with goi cuon (£3.60), The literal translation is salad rolls but they are also known as summer rolls. On Song Que's bilingual menu, they're called 'fresh roll prawn & herbs wrapped in rice paper'. These were freshly made as evidenced by the crunchy herby salad filling which complemented the rice vermicelli (bun) and the prawns well. To the uninitiated, pho is the famous beef and rice noodle soup of Vietnam served with accompaniments of beansprouts, herbs, chilli and lime. Noodle geeks might be interested to know that the word pho actually refers to the rice noodle but over the years it has become shorthand for the noodle soup itself. I'm pretty sure that Song Que has the largest selection of pho in London. There are no less than 24 choices on the menu with none costing more than £6.80. Most of these are beef based with the more extreme versions including tendon and tripe but there are also chicken, seafood and tofu options. I went for the pho tai nam (£6.30) which is a combo of rare sliced steak and well done beef flank. The beefy broth had hints of star anise and cloves and came further alive when the herbs and a squeeze of lime were added. I only threw in a couple of chopped chillies as I didn't want to overpower the broth. The rare steak slices were actually rare but even better was the well done flank which tasted really beefy (I know this is a crap sentence but I don't know how else to put it). The crunchy beansprouts also contrasted well with the slippery smooth rice noodles.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q4OYDQiOeIrXOQdBvjhL4Q": {
    "date": "12/24/2011",
    "text": "Can't make too much comment about this restaurant as I haven't tried many Vietnamese restaurants in London, but the beef pho is quite tasty. I'll make a more informed review when I try other restaurants.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7HRWHuAEGcqUqXScw1xFGw": {
    "date": "4/8/2011",
    "text": "My favourite vietnamese restaurant on kingsland rd; delicious pho and seafood!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6e9AqOHhkNH6KtMIG29ZQg"
  },
  "eHVrxSY6VAnTV4wnFN2gOg": {
    "date": "9/16/2009",
    "text": "Song Que Cafe - Pics @ The London Foodie(thelondonfoodie.co.uk ) I have been coming to Kingsland Road for my fix of Vietnamese food for the last 15 years, and have witnessed a few places coming and then quickly vanishing from sight. Sông Quê Café is one of the old timers, and I am pleased that it has managed to hang on as one of the most popular restaurants on the Kingsland strip. Time Out has been incredibly complimentary of Sông Quê Café over the years, and in its most recent Time Out Eating & Drinking Guide 2009, it awarded 5 stars to this Café, its maximum number. Having spent a couple of weeks in Vietnam sampling the most scrumptious food made me realise how good Sông Quê Café is. A lot of the dishes I tried in Vietnam were not as successful as the ones I had eaten at Sông Quê, while I can still count the few that were actually better. The décor isn't great (the huge plastic lobsters on their walls are actually scary!), and service can be rather grumpy at times. The food, however, more than makes up for these. My latest visit was no exception. As a group of four, we could share a variety of dishes from the menu. I find that their pho (beef soup with rice noodles), starters, salads and buns (vermicelli noodles with meats and salad) are by far their best dishes. We started with Fresh Rice Paper Rolls with Prawns and Herbs, Prawn Paste with Sugar Cane, Grilled Beef Wrapped in Betel Leaf, and Spicy Soft Shell Crab. I love the fresh rolls from Sông Quê, they are fresh and herby with just the right amount of rice vermicelli. This is one of the simplest dishes on any decent Vietnamese menu, and can be prepared well in advance. If prepared too early and not well stored, it can smell and taste of the refridgerator. This is not a problem I have experienced in Sông Quê. Fresh rolls are also great to be made at home and served as canapés if you can master the softening and wrapping of rice paper sheets. I would recommend practice well before your guests are due to arrive! I had never ordered the Prawn Paste with Sugar Cane before, but it was highly recommended by the lovely Clare, full time foodie and Senior Dietitian at a prominent London Hospital, who was dining with us that evening. The prawn paste was very flavoursome with hints of garlic and coriander root, a real discovery which I will be ordering again. The Grilled Beef Wrapped in Betel Leaf was also good. The charred and soft betel leaves were beautifully wrapped around the spiced minced beef, the flavours combining well together. Sông Quê's Soft Shell Crab is a real winner. I have tried to recreate this dish numerous times at home with varying degrees of success, but could never get anywhere near Sông Quê's. Despite being deep fried, it is deliciously light; the batter is always incredibly thin and the chilli and garlic seasoning does not overwhelm the delicate flavour of the crab. However, at nearly £7, I find their Soft Shell Crab portion slightly ungenerous. For mains, we had Traditional Crispy Pancake with Prawn and Chicken served with Salad and Herbs, Green Papaya Salad with Prawn and Pork, Stir Fried Beef with Lemongrass Bun and Spring Roll & Grilled Pork Bun. The pancake was again very good with a coconut flavour to its crispy batter that makes me order it over and over again. This seems to be one of Vietnam's staple street food dishes and I had it many times whilst there. I was slightly disappointed with my Green Papaya Salad this time round. The combination of flavours (sour, sweet, salty) was as good as ever but the thinly sliced pork did not taste as fresh as it could have done. Both buns were very good, but particularly the one with stir fried beef and lemon grass. I normally order the grilled pork & spring roll bun but was pleasantly surprised to taste the wok charred beef in lemongrass. The flavours were excellent and the lemongrass gave a real punch to the dish. Another dish that we did not manage to order this time but that I would highly recommend is the Crispy Sea Bream in Fish Sauce with Mango. As the name suggests, the entire fish is deep fried making it crispy, the shredded green mango is also a great and exotic addition. It is delicious! Verdict  Authentic and delicious Vietnamese food in the heart of London and as good as some of the best restaurants in Vietnam. Very affordable, our meal cost us £13 per person. Highly recommended.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ROqYW4WerMdToNAI1oLISw": {
    "date": "8/29/2011",
    "text": "A unique skill is needed to be a silver service waiter. The finesse comes with the ability to get plates of elegantly presented food to, and finished plates from, a customer in as organised a fashion as possible. The reveal adds to the art, plates delivered and removed with the bare minimum of fuss and if you ever watch an exponent of the art, he or she can clear your table effortlessly, any detritus at the end of the meal less than a hiccup in their perfect plan for your dining. The team at Song Que would, I suspect, laugh at this description of the role of a waiter. Here there really is only one aim, to get you through as quick as possible to make room for the next party already huddled round the entrance. No reservations taken and no quarter given. Get in, order, eat and get out...A large, high ceilinged space, clean, perfunctory and sparsely decorated with the sort of geometric, clashing, faux leather backed chairs you'd find in an Essex boys dining room in the 80's. There's a large painting on one wall, it might be of a village in Vietnam, local to the owner, it might equally be from nearby Broadway market, the design isn't the point here. There are nods to the 'proper' way to do a restaurant, an attempt at an unused back bar for example. A random bottle of Baileys sits on the shelf, disconsolately explaining to a neighbouring dusty Malibu that the vast majority of the punters will be going straight for one of the many different fresh juices, or the imported delights of Hue or Saigon, crisp Vietnamese lagers that cut through the spice to follow.With the service being so speedy, you'll be pleased to know the preparation is very much planned in advance. Of all the dishes Vietnamese cuisine is known for my favourite is the humblest, a bowl of Pho done well has few equals. Light beef stock simmered for hours with a blend of spices including fennel, coriander and star anise before the meats are dumped in at the last minute, bean sprouts and aromatics left to be added tableside. It's the speciality at Song Que, with nearly 30 variants, and after a selection of starters, a keenly priced bowl filled with noodles, that broth, melting thin sliced steak and a scattering of tripe and tendon (worth it, and so soft here) is enough for most people. There's such a depth of flavour in the stock that you're not going to want to season with the obligatory Sriracha hot sauce, but I tend to dip the strips of beef and tripe in to a side pot, but then I'm a chilli hound. Coming back to the starters, a few are worthwhile and interesting, though the Pho really is the thing. (If you want a selection of authentic and delicious Vietnamese starters to build a meal around then nearby Viet Grill is possibly a better option.) We went for their standout grilled beef in betel leaves, the soft and juicy little packages sweetly moreish, fried spring rolls, softshell crab and squid (the latter a little too batter coated for me, though it went swiftly enough). While it's not somewhere for a date, the sight of you licking Pho from your chin is enough to put off all but the most ardent admirers, it's one of the better places for a ribsticking pre or post session bite or a swift lunch along the Kingsland Road.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "3VbBmB3Yy0SC8EetN4qggA": {
    "date": "3/14/2009",
    "text": "This is quite a well-known Vietnamese restaurant on Kingsland Road, in an area that sports quite a few Vietnamese eateries. It's usually quite bustling inside, with a cosy hubbub of noise and chatter. And waiters flit busily around the tables. The house white wine was surprisingly palatable, and the steamed Sea Bass we had was very nice, accompanied by side orders of rice and vegetables. Song Que is quite a good place to combine with a trip to Columbia Road Flower market on Sunday, or a visit to the nearby Geffrye Museum. And it's within easy reach of Hoxton and Shoreditch.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rryG7QQJpvQ6fxquDRPr0Q": {
    "date": "12/31/2010",
    "text": "If you ask people to name a good Vietnamese restaurant in London, this is the one that will most likely be mentioned. Sad to say, but sometimes Mob Opinion is correct. The food here really is excellent, and I am hard pressed to decide who wins between Tay Do Cafe and Song Que (both seem equally good in my opinion). One problem with this place being so popular is that it's actually rather hard to just drop in and get a table. They always look at you and say \"reservation??\", and sadly shake their heads when I say \"no\".  I am then usually put on a probationary table and asked to leave by 8pm or something. So I should learn to plan ahead, but who does that?? The other niggle I have with this place is that while the prices of individual dishes are reasonable, the serving sizes are not, and so you end up compensating by buying more, and thereby ending up still spending a reasonable amount. The overall decor is bright and lively; the waiting staff friendly and attentive. Bottom-line: Arguably the best Vietnamese in town; Book ahead!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-KqJs1MDCT5eqbmgnEvRQ"
  },
  "P9yGx4HBIHTlcBVT3TRP9Q": {
    "date": "6/25/2009",
    "text": "Song Que is the Chinese version of the infamous Wong Kei, except it has better food! Food is cheap and portions are huge. The only warmth you should expect is from the food - service is brisk but brusque. That said, this is one of my favourite Vietnamese restaurants in London - the dishes are authentic, and they have a comprehensive menu. You can order a different dish each time you visit, altho I usually end up ordering my favourite Beef Pho for mains, but get adventurous with the starters. Try the lotus root salad - it is surprisingly good. The grilled fish/beef starters are excellent too. In fact, there is so much good food to recommend at Song Que, I'll just say go ahead, be inventive. If you're really stumped, look at what your neighbour is ordering, and follow suit! With prices kept between £5-7, you'd be tempted to over order I usually do. But bear in mind, you're not getting French portions here, so you'll end up wasting, if you order more than 1 starter & 1 main course per person. In fact, if you have an average appetite, you'd do better ordering a starter to share, and one main course each. I never spend more than £20 a head at Song Que. In fact, it's more like £12, inclusive of their wonderful Lemonade (homemade Lime Juice). Just don't expect to sit around to chit chat once you've finished your meal - like Wong Kei, they turn out their customers by slapping down your bill, expecting a pay up once you're done. Yes, the turnaround is THAT quick! If you don't want to be hurried off, just take your time with your meal.. but once you're done, they won't want you to tarry.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P813ITJbNvSayJwi7Tnnhw"
  },
  "64PiiaQkWX7UBsHhPbNBrg": {
    "date": "4/10/2011",
    "text": "This place is not bad.  Large open area usually not a long wait for a table.  Pho and Vermicelli are decent, but I think Mien Tay down the road is better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rZ2FhKqV3EHgVJWj36jaYg"
  },
  "OO9JkFJ6m9QFadc4gjX0OA": {
    "date": "3/15/2009",
    "text": "Excellent cheap cafe right on Kingsland Road and not far from nice pubs in Hoxton and Columbia Road. The speciality of this cafe/restuarant is Vietnamese noodle soup - however veggies be warned the stock is beef stock even if you order tofu or vegetable versions. I stuck to stir fried veg with sticky rice which was fantastic. The jasmine tea we ordered to accompany was a nice refreshing alternative to wine (my friend assures me the wine is 'ropey'). The service is a bit hit and miss - we found we were ignored for large chunks of time and then would be harrassed by staff (asking why I was a vegetarian..erm.none of your business?). Overall a fun busy atmospheric restaurant and cheap enough for a week night meal.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6tkZJmzV865nejRUTjXetA": {
    "date": "11/26/2008",
    "text": "I've eaten at quite a few Vietnamese restaurants in the area from Hanoi Cafe to Viet Grill, so I was expecting nothing less than the high quality these eateries have to offer for comparatively cheap. However, despite being featured on Time Out London's top 50 restaurants, reviewed by the revered Fodor's guide, and obtaining an overall user rating of 9.3 on London-Eating, I was sorely disappointed. Perhaps I chose wrong, opting for the monkfish and vegetable soup (cold), plain noodles (bland and dry) and duck, spring onion and mushrooms main dish (really greasy, with fatty slabs of duck adorning the plate). The lemongrass chilli chicken my friend ordered was also rather too spicy for her delicate palate. Unfortunately, what it lacked in brash, tacky decor it didn't make up for in fine food.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Bym1t0Cuc5kl2JGsmmdtpg": {
    "date": "4/19/2010",
    "text": "This was the first place I went to in London for pho.  It was featured in Time Out's cheap eats too at the time of 2008.  Fast forward 2 years and I still go here quite often.  The portion sizes are decent and the food is delicious.  Hits the spot every time for me.  There usually is a long queue to get a table but turnover is quick so just hang in there because it is all worth it when that bowl of pho is in front of your face.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MxrjSqyZe2IjDZwXxIT9rA"
  },
  "Akaq1W_oQNkY3NVgbo9Z0A": {
    "date": "8/13/2010",
    "text": "please also seehungryinlondon.com/2010/… I fell in love with Song Que on my first visit over 4 years ago and have been returning frequently ever since. Especially after having been to Vietnam myself I could appreciate the flavour and authenticity of their dishes even more. For me, eating at Song Que is always a treat. It doesn't matter that the atmosphere is canteen-like, the waiters are impolite and too many people are packed into too little space because I am there for the food. And the food is delicious and very cheap. Mind you, not everything is equally nice and the menu is very long and slightly confusing, so it's critical to know what to order to avoid disappointment. Here some of my recommendations: For starters: the fresh spring roles with prawns are an absolute must  they are full of fresh flavour with buckets of fresh herbs accompanied by a lovely dipping sauce. Heavenly. I absolutely adore their papaya salad  the green papaya is crunchy and fresh, with a lovely tangy sauce and crushed peanuts complemented with fresh chilli and prawns (although I could do without the pale pieces of pork that come with it, I usually hide them under the prawn crackers). Lovely and fresh is also the lotus shoot salad. The minced beef wrapped in betel leaves is one of the hot starters I truly recommend: the juicy beef is served with fish sauce, rice vermicelli and fresh mint. I am not particularly keen on their Bánh xèo (pancakes filled with chicken and beansprouts, served with fresh herbs, salad and dipping sauce) which is not bad as such but too greasy for my taste and it doesn't reach the level of the aforementioned dishes. For mains I personally tend to stick with the noodle dishes which are consistently delightful: I could eat their Bún cha every day. It is basically a very simple dish  rice vermicelli with lemongrass, fish sauce, fresh Vietnamese mint , prawn or chicken, fresh chilli, bean sprouts and peanuts all mixed together providing a flavour explosion. Also very good is their Pho (Vietnamese noodle soup) which comes in different flavours and with different meats. It tastes just like in Saigon and is not much more expensive either. I recommend to avoid their stir frys, they just don't match up to their other dishes.And also.. don't let the service annoy you; just prepare yourself for loads of rude little men, at least they tend to be efficient. I have to mention also that some major improvement has occurred beginning of this year  they now have a new shiny toilet! (meaning that you don't have to walk through their store room anymore). Song Que is by no means without fault, but in my opinion Song Que consistently offers exceptionally delicious food for incredible value for money.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ey63yzW6lx57E8-ZNY2j-A": {
    "date": "5/16/2010",
    "text": "The pho is indeed is as good as it gets to the point of addictive (and much better than what's offered at the neighboring vietnamese joints), but the service gets brisk on the weekends, as the waiters try to accelerate table-turning in order to accommodate huge crowds of waiting patrons.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQ_1oQNCh8ZywXK1eTliuA"
  },
  "bpKxtcwOoH2dvHmifYCvuw": {
    "date": "3/24/2010",
    "text": "This place is certainly is not up to standard, i have been to many Vietnamese places and the food is not up to scratch, i dine very frequently and i would not recommend this place to anyone. The place felt very grubby , service was very very poor, we were seated ,not greeted at all, the waiter came over dumped the menus on the table and threw some prawn crackers. When i was ready to order ,i called over to the waiter politely only to be answered with \"what\", disgraceful,. There was at least 8 -10 staff on the floor yet their service showed that they had no clue how to behave and run a business, Although this experience was terrible, i wanted to stay to see if the food was as good as what some reviews had said. To much i was disappointed.... Being of Vietnamese heritage ,the food was chewy, beef was not grilled but seemed fried and old....:( I could not wait to leave, asked for my bill, only to made to wait a further 6-10 minutes, i then took myself to the counter asking for my bill, only to be greeted with a sour face young girl, who simply wrote the bill taking 2 seconds, when i had previously asked for it 10 minutes ago, ... she threw the bill down, Honestly if you are looking for good Vietnamese/ Chinese food i would recommend that you take yourself a little further to West end, where service and food is great!! these areas in Hackney i have learnt that they just dont know how to run a business or treat customers with respect, i often dine at least 2 times a week and i think its important to be fair and honest if places are good or not, so hope this helps!!!",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ClVhFQPrA0YiGHmG9W1g-Q": {
    "date": "1/14/2009",
    "text": "poor service. and nearly half of the menu are chinese dishes. The beef pho is okayMy grilled pork is over-cooked but I do know why so many people are crazy to dine here",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}