{
  "nIEzKIC9qARkf2bduXW62Q": {
    "date": "11/25/2008",
    "text": "Does not look like much from the outside, but it's an impressive chippy so close to Waterloo station. They serve good fish and chips, and there is plenty of seating. It's a welcoming place with friendly staff. You will re-emerge smelling strongly of frying, however. But that's more or less a given for most chippies.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "47BjkEdamr2NGULKhwyDsQ": {
    "date": "11/13/2007",
    "text": "This pun does do this restaurant justice. This is a great little cafe tucked away under Waterloo railway bridge, opposite the tube station, and has served many a hungry commuter on their way home. Especially those who have recently departed from the Kings Arms on Roupell St. This is the place to get proper old fashioned fish and chips, with lashings of salt and vinegar and wrapped in paper. The staff are friendly, and service is always quick. If you eat in, there's a proper table service with plates and cutlery, but the quality of the food is exactly the same whatever your choice. It's also pretty cheap, and portions are very generous. Soft drinks are slightly overpriced, but that's the only fault I can identify.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oe39Xa_noq2-YQx6AHFeTw"
  },
  "dVVlu6qn4XyETpfyKMz-cA": {
    "date": "6/9/2010",
    "text": "This is a decent place, chips and peas were solid. Sort-of friendly but not really.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zRr9KpPEEp8LgtdUXYE5g"
  },
  "jY89fUfUgOkutfk_Xd9ZSw": {
    "date": "1/8/2009",
    "text": "this place is kind of hidden under a bridge near the waterloo station, but it's not to be missed. cheap fish and chips, large portions of fish, mainly for takeaway. the chips were great, and a small order is HUGE. very wallet-friendly.well-sized chips, perfect for drinking in your hotel room while watching trash on itv. or at least it was perfect while i was drinking in my hotel room watching trash on itv.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjWywtVqGv-rMKZeRGakWg"
  },
  "6TIjfc7tW3yNebiBH0ilcA": {
    "date": "10/19/2011",
    "text": "Hands down the best fish and chips i had while in London! Chips were great and not greasy, the massive piece of fish tasted clean and fresh. Nice people too, they are cash only, being from the states i wasn't  used to this, they let me leave and go to an ATM to get cash after i had finished eating so i could pay.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvPxPShA8Cn-eAHlse8cUQ"
  },
  "gG8EXrZIGbmD-QlBk1cL0w": {
    "date": "9/30/2009",
    "text": "I kind of stumbled into this place by accident.  I have to say, for the rest of the trip-Three weeks- there wasnt another place that could stand up to them when it came to fish and chips.  now everytime that i go back to london.  I make a special trip down to waterloo just to have some fish and chips!!!  they are awesome!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_fJx8QqA_-s6zlGsXGJFA"
  },
  "XR87BaowNGh_Iq_Zy9nhdg": {
    "date": "7/14/2015",
    "text": "The fish and chips is really nice, and the price is very fair. Location is good too, right next to the main entrance of Waterloo station under the bridge. The Fried chicken is also very delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giCvFmdKLwRKF07qrJxALQ"
  },
  "AgpnJQF14xtuw_-4682YAA": {
    "date": "8/4/2015",
    "text": "Having just flown into town and got dropped off at Waterloo station, my girlfriend and I were starving and just happened upon this place. We both enjoyed it and it helped us knock fish and chips off the bucket list for our trip to London!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "20yd50E-QxETaS6tq5Bmng"
  },
  "CTn5GQ2kiy7qxxrS7343sw": {
    "date": "4/27/2013",
    "text": "A combination of two factors saw me into Fishcotheque. First of all I fancied chips and second I couldn't pass a place by called Fishcotheque. That's about it, really (the chips were good)!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FVF1bk8UP7nOxl8L_vC-qA",
        "caption": "Photo of Fishcotheque - London, United Kingdom. Chipses!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FVF1bk8UP7nOxl8L_vC-qA/o.jpg"
      }
    ],
    "user_id": "K-diP3M8AXOkuUpaXWjd5Q"
  },
  "itU1IrZA59mGCqIVQIN-jg": {
    "date": "10/1/2014",
    "text": "My first fish & chips in London a couple of months ago. I had a cod with chips.. The cod was perfect, crispy on the outside and soft on the inside. The chips were not that good... they looked more boiled than fried. The service was ok, and they were really fast... I guess I could go back to try other variety of fish, and maybe give the chips another shot...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xMBFAVx8D71livzEgFnA7A"
  },
  "79d9hMSfhKsEfoHBelB68Q": {
    "date": "1/12/2015",
    "text": "Says on the door that the fish is delivered daily from Billingsgate. It couldn't get any fresher, fabulous fish and chips as good as you get on holiday. Good value especially given its location opposite Waterloo Station",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tsd2cLoByDGbDwpfCgz78Q"
  },
  "gSg_ziKFFnM6TwWooNc6vA": {
    "date": "3/30/2014",
    "text": "I've been meaning to write this update for quite some time cause I've converted. They did a 180 with a new, direly-needed renovation. Now it's decorated with a modern nautical vibe with glossy floors and crystal lighting. I wouldn't say it's the best fish and chips I've ever had but it's incredibly convenient, less than a block away from Waterloo station. The chips are especially yummy and the batter on the fish is delicious and doesn't get soggy fast, which is a huge complaint of mine. For takeaway, you can get in and out with a cod and chips in under a minute; the haddock takes 10 minutes extra. Plus they offer a nice 20% student and worker discount.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SgPvn5Fe0xxCBEKSLBOHSQ"
  },
  "nNV8snVEY8WWmRBqBwLDUg": {
    "date": "7/23/2014",
    "text": "On a Sunday at noon it can be hard to find a fish and chips shop open, and sure enough the place we wanted to go to take a friend on her first visit to London was closed. This was the closest alternative, but nothing about it lived up to our expectations. The staff are all non-English (not a criticism, but when you go for fish & chips, you kinda want a Cockney accent, rather than an East European one, from your server) and the fish, though apparently fresh, and cooked to order, had absolutely no flavour whatsoever, and neither did the batter. Finally, the pricing is way out of whack, though this is probably no surprise, given its location. Definitely not recommended.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZrsBqcs3-UGmsCwvvPutA"
  },
  "w3eafx_caYlsGo1NA0F01g": {
    "date": "11/7/2010",
    "text": "A jolly little plaice, this.  Clean and bright, tiled walls cheerfully decorated with retro 50s adverts and fish posters.  All the classic fish and chip fayre on offer (including Pukka pies), plus a few modestly interesting fishy riffs of their own, such as battered salmon and fishcakes with spring onions.  Also a standard menu of fried breakfast items.  Reasonably priced, especially considering the great location opposite Waterloo Station.  Open until 11pm.Service was nice and quick, and the cod and chips did the job.  Nice crispy batter, although it was a tad too oily, and the fish was a little bland.  I don't expect a taste explosion from fish and chips though, and I am being really picky here to be honest.  I'll definitely go there again.Loved the aquarium in the corner (is this a bit sick in a fish restaurant?). One ludicrous bloated orange fish in particular provided a great deal of entertainment throughout our meal (see photos).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L546fB9E4Tl19DBxX8BkeQ",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L546fB9E4Tl19DBxX8BkeQ/o.jpg"
      },
      {
        "img_id": "qNZO29MG65g_z5Rux2iyXQ",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qNZO29MG65g_z5Rux2iyXQ/o.jpg"
      },
      {
        "img_id": "feJvc2jp3f5J5hNIx9F6JA",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/feJvc2jp3f5J5hNIx9F6JA/o.jpg"
      }
    ],
    "user_id": "-LDyNtk9BsfCq15lrijISA"
  },
  "CkcrcHsjZJa7huhPGmWncQ": {
    "date": "12/31/2013",
    "text": "This was by far the worse experience at a resturant I have had in a very long time. Fish was sitting in warmer. This should of been my first tip to run. When fish arrived chips looked bland and tasted even worse. Fish was ok size but was soggy and greasy when it arrived. Cut into piece and grease just poured out. It seemed to me they reheated the fish and chips by trying to refry it. Would never try this place again or send my worse enemy to it. Would rate it lower if possible. Not sure why it's 4* rating comes from.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBGNcPUhoa-R0f3qBgH4SA"
  },
  "dyeY_dLuvnDRkR6vTi1Crw": {
    "date": "7/16/2014",
    "text": "I got the \"regular\" cod fish and chips. I was hoping for better than what I got. It was ok, but I think it was too greasy. The regular with chips is huge. Enough for two people. And it was almost 8 quid which is a bit much for a \"regular\" fish and chips. They did the malt vinegar and salt right, but I would have preferred a lighter and crispier batter with a lot less chips. I've heard I can get better F&C in London than here. I'm certain that's true as I've certainly had better in the states.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p6qXWGUnOKaLwRPndYivNQ"
  },
  "iQKvxmgG_a1YRdkkwEsMug": {
    "date": "9/7/2014",
    "text": "Can't say that I'm knowledgable about English fish and chips, but this was a step above the US variety and the couple of London pubs where I've tried the dishThe cod was tasty and the batter good and not greasy. I had the salad. It was a nice mix of lettuce cabbage carrots tomato and red onion. Tasty. Good price.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LAnlZNlYAlG0uLNsjKR_fg"
  },
  "bVmvsVSy81A6G1zT9qJPRQ": {
    "date": "2/12/2011",
    "text": "I don't know why, but this place seems to only be popular to old people.As a college student, I only really go here because it's close to the dorm that I live in. I think they are open until 10 or 11pm, which pretty nice.However, the fish and chips here are not too good. The fish also comes with bones in it. The chips taste ok if you eat them immediately, but if you set them for about a minute, they'll just taste rubbery and weird. I always get take-away from here, so the chips are fairly bad by the time I walk back to my room. Granted they give large portions of these chips, so if you think all food are equal, you'd appreciate this. Oh yeah, and the workers think they're really cool when they are loading your chips into the bag. They just look so smug when they shovel the chips in and shake the bag.Nonetheless, if you get their quarter or double quarter pounder burger, you will be satisfied. Those are not bad.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Az97YHaP5mognwqSz17ghA"
  },
  "Kw64bfIX3LY5bpa8MsCejw": {
    "date": "11/29/2009",
    "text": "Because of its name, Fishcotheque gets an automatic five stars for me.The fact that the fish cake was made, completely, of fish (no breadcrumb, potato or other starchy filler here) greatly appealed. And the chips were delicious and moreish.Nevertheless, the regular fish didn't blow my mind.  I mean, it was good, but more in the 'I'm so hungry right now and I'm going to eat the hell out of this battered and fried fish' sort of way.Fishcotheque's incredibly convenient proximity to Waterloo Station probably means that I will be frequenting it more than any other for some drunken chip indulgences en route home.  Other important things to note: seating inside is ample, and the service is fast and polite. Oh, and prices are well reasonable.But Fishcotheque skimped on the Heinz and had some Sainsbury's brand reduced-salt-and-sugar ketchup on the table.  I have nothing more to say about this, so intense is my disapproval.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "jXGLE81oJCcRBOeg1GlFtw": {
    "date": "6/25/2013",
    "text": "Look, I'll level with ya, pal. I went here purely based on the name. I can't even remember what I ate.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ul4CI-qBUYJxjy1jnRVDQ"
  },
  "eZhRCGqlKmw6NtL23PsACw": {
    "date": "2/5/2010",
    "text": "Avoid this chippie like the plague.  No self respecting fan of fish and chips would eat here. Put bluntly, the fish is bad and the chips taste like they have been frozen to death. It's also expensive. I seem to give it a chance every year or so and always regret it. Heed my warnings.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iG4NUq_7JhYXLa2nUhLC1g"
  },
  "1KkNW1VeTjHajlredtzWYw": {
    "date": "10/19/2012",
    "text": "Yum yum yum. I so very much recommend this fish and chip place. For years it have been amazing. Never fails to dish up a good battered sausage or two",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "43ufnud0QNqwVM3Us_l4OA": {
    "date": "5/13/2009",
    "text": "My boyfriend and I found Fishcoteque on my first trip to London last year, as part of our journey to find the best fish and chips. Once we found this place, nothing else compared. The batter had the perfect crispness, it was perfectly seasoned, and their other twists on the cod variety made with salmon was equally, well, delicious.I loved it so much so that while my mother and I were in London last year later on in the year, even though I wasn't the primary party for organizing travel and paying attention to the names of stops on the Tube when the boyfriend and I were there, taste-bud memories alone showed me the way. I was so desperately craving the same fish and chips goodness I had experienced a few months before, that I beelined to Fishcoteque the first night my mom and I arrived in London.The vinegar mixing with the flavor from the chips, combined with the tart and sweet relish from the Heinz Tartar Sauce dripping from the deep-fried salmon covered in breadcrumbs is worth the U.K. sojourn. And they have canned shandys that are sold like canned sodas. Come on.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucwEG7OV0NeoItS-eHuVUA"
  },
  "JwingV2M_o1JyZzQpO_Vqg": {
    "date": "2/20/2010",
    "text": "Reasons to like Fishcotheque:1. Good fish. The haddock tastes better than the cod, but avoid the haddock if you don't like your fish with the skin still on.2. Good chips. Just the right amount, with both malt vinegar and ketchup options.3. Good ambience. \"Classic\" decor, not fancy-shmancy upmarket furnishings.4. The name.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-CaoErm8niaoRa7Gl4iBg"
  },
  "ncIT04195e071VTxeLDchg": {
    "date": "6/11/2009",
    "text": "Don't let the facade fool you. Behind the dodgy exterior and eye-wincing pun lies a really quite solid old-fashioned chippy. It's not a place that reinvents the wheel so don't expect organic sausages in gluten-free batter or charcoal grilled sustainable sardines. Expect lumps of decent cod in decent batter served with a pile of decent chips, strong tea and bread and margerine. You can also expect change from a tenner though, so we like that. If you're travelling through Waterloo late at night and the munchies strike, this is a way better alternative than the station's standard fast food places and only requires a two minute detour. Big Mac and prcoessed fries? Or Pukka pie and ale-absorbing chips? The choice is yours.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vx9Hc-gz4UOIIty2sW6PTQ": {
    "date": "11/20/2008",
    "text": "I walk past this place every day and it is hard to resist going in there every day. I tried to get a picture of the place today but there is a lot of scaffolding blocking everything around it, bridge repair works but they're still open. It looks small from the outside but it is actually quite big when you go inside. They seems to be quite popular in the area as there are always people inside digging into something that smells great from the street. I've had the chicken fillet burger a few times and they're great, not those patty burgers you get at most kebab stores but the real deal. Their chips are pretty good as well, thick cut potatoes in large portions. This would be perfect to grab some food there and head down to the river for a nice lunch out and about!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jY3igUnSioahPATdcqvqzA": {
    "date": "7/1/2017",
    "text": "We chose to eat here because it was listed on several searches as having gluten free fish and chips. They do not have that. I did have gluten free grilled fish and a salad. It was very good. The rest of my group had traditional fish and chips and they said those were also good.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_czIz0hZC_uSS2qW3HYpmA"
  },
  "T-9eyfA1i17-2GlC6xepag": {
    "date": "3/10/2018",
    "text": "Decent at best fish n chips. Bit pricey for what you get in the end. Would probably look elsewhere for better quality for after what you're paying. Food was decent but nothing to write home about.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "la2dOFGz8AjYggUimA3OUg"
  },
  "JFwyjlQEwT1QNw3Eg-LV3w": {
    "date": "1/8/2017",
    "text": "This was my first time getting fish and chips in the UK and it was definitely better than any I've had in the US. As a starter I had the calamari rings, which came as three pieces. I also had the cod, which was one giant piece of fish with a ton of chips. The tartare and ketchup come in plastic packages which is a little bit environmentally unfriendly but otherwise no complaints about this place. The decor is playful and casual.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ik--IXyS20iqIOHltdkhFg"
  },
  "tgDG8ag4guN29GqvPjtThw": {
    "date": "8/9/2017",
    "text": "The calamari is a must try here. It was on point, but only comes out in 3 pieces, but they were big. The fish n chip was also good, not too much batter. Love the service there. It's was a young girl that help us out. Also help me with my Uber and not to mention that she was cute, always smiling too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLImwQXJGQi5P5sqUAyM9w"
  },
  "iU5Rv6r0NjGGa4Ulu4h4oQ": {
    "date": "7/2/2017",
    "text": "Loved it.  Fresh and flavorful. Not at all greasy. Chips were light and crispy. Large portions too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HIYkasimtUgt13vb2LnnuA",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HIYkasimtUgt13vb2LnnuA/o.jpg"
      }
    ],
    "user_id": "X0FNpW-nhdHQy5s390vgZA"
  },
  "Dwx0ibPaqWuyByZRn4alEg": {
    "date": "7/18/2016",
    "text": "after spending ages wandering around for something to eat, this place popped up. I was greeted by a friendly staff member and had the best fish and chips I've had in London so far!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DgIm7a4dTxLsBR-NZT2XFQ",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DgIm7a4dTxLsBR-NZT2XFQ/o.jpg"
      }
    ],
    "user_id": "krXZtPuOOjIXL-Fqh0uHrw"
  },
  "Bd2phMhrTqAxTgXkuSdE9Q": {
    "date": "1/3/2016",
    "text": "First off: much better than poppies. Great fish, fast and helpful service and great potions. You'll leave full happy and feeling like you got good value for your money.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysafjbp3KMfC5ok7vmK0GA"
  },
  "o5UOu8ablRN2kcJ1UffVYA": {
    "date": "2/1/2016",
    "text": "Went looking for a place to eat fish and chips and stumbled upon this place and I have to say it was delicious! It is cash only and is very small but the service is great and the food was amazing. The meal is very big and I had mushy peas and couldn't even finish it. I would definitely go back to this place when I visit London again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WPQHKOtCg31T-13jKGOPig",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WPQHKOtCg31T-13jKGOPig/o.jpg"
      }
    ],
    "user_id": "aPn4Vj0231A9KeSLephFvA"
  },
  "k7s4AMZ74qC4UT26FodOnw": {
    "date": "6/5/2016",
    "text": "If you wonder why the English cuisine has such a bad reputation you should give this one a try. #tasteless",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Np1GKuUf0W0AhHhjDBl_5w"
  },
  "4e0T8cvdjpWudagfGsCBdA": {
    "date": "11/14/2016",
    "text": "My group and I wanted to grab some fish and chips after going on the London Eye at night. This place was packed when we sat down. The food seemed fresh. They staff was very attentive. They gave our check in the cutest little treasure chest.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ouFWLP3kEFvV03fuWMyX8w"
  },
  "JbD9cUN9l-QRlrYFPV5ibA": {
    "date": "7/24/2016",
    "text": "The staff was friendly, but the fish was super greasy and lacking in overall flavor. The fries were like little, tasteless sponges. As I said, the staff was great, but the food was not.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b5SylKzkb-7g40NJfHu8dQ"
  },
  "tIFvsEZGjaYsy2qAFcE05Q": {
    "date": "6/4/2016",
    "text": "I have to agree with the other reviews: the weak point of this thread restaurant are definitely the fries. The fish was crispy but not particularly outstanding.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Akpavj9kGtTL4GHxUnogYA"
  },
  "m1c2YK39hP-aKcd-BhhZ3A": {
    "date": "7/6/2016",
    "text": "Cod fish (£5.95) made upon order. Saw the chef batter the fish in front of us. Even after a 1/2 hour wait to eat it (had to catch the underground) it was still flakey and moist. The calamari (£4.95) was breaded nicely and tender and included a small salad. The chips (£2 or 3) got a little soggy with the travel and could have used a little more salt and malt vinegar. But definitely a step up from the fish place near The London Eye which had heat lamp fish.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QzNkgcnYSI-Dp4dVJYyKmg",
        "caption": "Photo of Fishcotheque - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QzNkgcnYSI-Dp4dVJYyKmg/o.jpg"
      }
    ],
    "user_id": "EuFogOC6G_6sJEPHJNJG_Q"
  },
  "qpv7bdzdUtQbcjq4YBLTjA": {
    "date": "3/25/2015",
    "text": "Close to my college and I was in need of a cheer up meal one very rainy cold weekend. Opted to eat in and was brought a large plaice and chips. It wasn't the best in the world, the chips being a little old but the fish was quite good - did seem to be frozen though. I'm going to be at that college for a while longer, not sure if I'll stop in again, there aren't that many options around, but probably going to give others a try.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7LDWCOLV_KjP_RO0bn8PUA"
  },
  "o19lfRru7W61jCWwKS_69g": {
    "date": "4/12/2017",
    "text": "In London for Spring Break and we wanted local fish&chips for dinner. Found this easy peasy right across Waterloo Station. Fresh fish lightly batter fried yum, and thick hot fries quick to the table + interesting (in a good way) diverse clientele and the cutest nicest waitress in a 50's housewife apron. We named the corner decor aquarium fish \"Marilyn\", \"Marlon\" and \"Dean\".",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gkDhF_nE0FuKDhrfqqGqUQ"
  },
  "Dn6Ubn7Kc_Y2vfXKOIs97g": {
    "date": "1/30/2013",
    "text": "I would suggest this place to be called Chipotheque as opposed to Fishcotheque (as the entire menu comes with chips but not all comes with fish) except for this name change to actually happen, the chips would have to be good, and they're not. But then again, their fish isn't good and they're called fishcoteque, so really, what difference does it really make? The four of us ordered haddock and onion rings (free replacement from chips), cod and chips, and rock and onions to share with some gherkin (pickles). One thing that everything I just named have in common is that they are all soggy, with the onion rings being particularly under fried (still better than the freezer-burnt fries). All the dishes were about 9 GBP.  So some pain points:- all foods are soggy and flimsy- the rockfish comes with giant bone in (which kinda looked gross)- all fish had skin on under the batter- the haddock was better than the cod and rockfish- they use heinz tartar sauce in a package- takeaway is cheaper by a pound- the food wasn't good- neither was the service (i think the girl might have still been asleep)I don't particularly understand the high rating on Yelp, but you might want to take a look at the filtered reviews because they're all seem to be one star real reviews.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "3A0ZybZbNtyU2eMOCJsUrw": {
    "date": "7/10/2014",
    "text": "Great find at rush hour!  We had just finished the Secret London bike tour and my daughter was starting to get her hungry/angry look in her eye that means danger!  We got turned away from a few places because of crowds, then found this gem of a spot!Ambience:  2.5 stars.  Kitschy hole-in-the-wall.Service:  5 stars.  Really!  We were immediately greeted and invited in by a man at the counter, then our server Huyeshin took over--he was great!  Prompt, attentive, polite service--they seemed really happy to have us there.Food:  4 stars.  My wife says the fish and chips were the best she ever had!  A giant cod filet, with crispy breading (not greasy at all) and light, flaky fish--delicious!!  The kids had burgers that were fine;  the baked beans are great!Overall, definitely a great find and value at rush hour in this part of the city!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "k92K-9Sv_OO7JCrYXB_d0w"
  },
  "rCPgpKqJE2bQt1g9Uk9A6w": {
    "date": "11/30/2016",
    "text": "OK, the name is a bit campy, but this place is top notch -- clean, friendly, cheap, and delicious. My husband was looking for a cheap fish & chips place near a Tube stop; Fishcotheque fit the bill. For starters, the takeaway menu is ridiculously cheap (Remember in London, there's a price difference between eat in and takeaway!). A small fish & chips takeaway is 5,95; large is 6,95. My husband ate in the restaurant, so he paid 8,95 for a huge piece of crispy, golden fried cod and a plate of fries. It looked amazing (and apparently tasted quite good, too); the battered fish was golden and crunchy on the outside but flaky and tender on the inside. I tried the fries, which were OK, nothing to write home about. But the mushy peas I ordered were great. And they keep a bottle of malt vinegar handy on the tables (the way fish & chips were always eaten in my family). The waitress was friendly and helpful. And for vegetarians out there, they offer both a veggie AND black bean burger, so they haven't forgotten us. (NOTE: I didn't try either one, only noted them on the menu.)I subtracted one star for the big price difference between eat in and takeaway. IMO, three pounds' difference for a small fish plate is quite a premium, but the quality and atmosphere are well worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2ixCL3ahhTn8DYZMIGOFg"
  },
  "GRR-r-b9_gT1_o6sOAbSUg": {
    "date": "6/22/2014",
    "text": "Really enjoyed this little place. The cod was crispy on the outside and perfectly soft on the inside and came out piping hot. The staff was friendly and attentive, and the restaurant was really clean. The chips were pretty good as well! I would definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UIeXWbJNEgPeXbKWY7d9aA",
        "caption": "Photo of Fishcotheque - London, United Kingdom. Cod and Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UIeXWbJNEgPeXbKWY7d9aA/o.jpg"
      }
    ],
    "user_id": "DsZfrl4zhnEAhhjewT7Q5A"
  },
  "kOcC_v4-becL2cunS5txVQ": {
    "date": "6/16/2014",
    "text": "This place served what easily were the worst chips I've ever had in my life; soft, soggy and disgusting, so much that I had to pour enough vinegar on them so I could convince myself it was my own fault. See? Those chips were so bad, THEY WARPED MY MIND.Everything else was alright, though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bGzCwfhxfNnhc-mB0wiOA"
  },
  "JE_YcjzlZTXi-RBXyz7pxw": {
    "date": "6/27/2018",
    "text": "(Note: Sorry for the Snapchat picture, I forgot to take one without the filter and caption, but I was really excited!) This place is close to the London Eye so we decided to check it out, and we were so happy we did cause this place is ABSOLUTELY AMAZING! I'm not the biggest fan of fish and chips, but this place uses high quality batter and you can taste it in the freshness of their food! I would definitely check out their big portions and amazing customer service (I found out about the free WiFi right as I was about to leave, so look for it before that)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qTcjO81n6hxz9tk1Ksqow"
  },
  "WESipUZ6qenQt7KtZgte3A": {
    "date": "6/20/2018",
    "text": "This place is the only place to eat fish in London.  The portions are whale size!!!! The chips are great and huge also!!!!!They have a clean toilet also.  Nice music, excellent ambience and service is great. Don't go anywhere else!!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fjGCY7XFjQvSCsM7B7Whw"
  },
  "EOlK65gZXTY6TncWXpvfqg": {
    "date": "5/21/2018",
    "text": "CASH ONLYThis place is under a bridge next to the Waterloo station. It looked a little sketchy from the outside.I knew what I wanted when I sat down (medium cod and chips), and a while later the order came out. There were only two people working at the time so I was ok with waiting. The fish and chips came out hot and plentiful. I was a little disappointed because the batter fell off the fish pretty easily, and was less flavorful than the last batch I had. The chips also could have used a bit more salt, but it wasn't too bad. All in all the food was decent, and there was no wait for a table, so this is a good alternative if you just have a craving you need to fix.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-CxZvxcnLVlOdMfLwJrwgQ",
        "caption": "Photo of Fishcotheque - London, United Kingdom. Regular cod",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-CxZvxcnLVlOdMfLwJrwgQ/o.jpg"
      },
      {
        "img_id": "8yg4ibIu4BgwRBkuBL3lKw",
        "caption": "Photo of Fishcotheque - London, United Kingdom. Quick service",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8yg4ibIu4BgwRBkuBL3lKw/o.jpg"
      }
    ],
    "user_id": "OfdX0DGrAET9jqn_7gkXww"
  },
  "B8P634Zta6KaaI_fydGbEQ": {
    "date": "11/17/2018",
    "text": "This place sucks. The bloke refused to serve us at 10:45 pm on a Sat evening (11/17). There was food available but he clearly just wanted to go home for the night. People like this fool don't deserve to work in a city like London or anywhere. If you're the owner you should fire his ass because he gives your shop a bad name.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dnox5XCAAWb8VN55BZtpBA"
  },
  "xqQZKiGjENmwAm_QX-dVKw": {
    "date": "3/23/2018",
    "text": "Came here on New Year's Eve and decided I needed to try a couple places for Fish N Chips prior to writing my review. My friends and I each ordered a large fish n chips. And let me tell you, a large is large! I also got a side of mashed peas, curry sauce, and French fries (my British friend eats it like this so I just followed what he was doing). The fish itself wasn't bad. I found the batter to be a little greasy for my liking. I know, it's fried fish. But in a couple other places I tried, it wasn't as bad. Fish was fresh and cooked well. Seasoning was nice. French fries, or chips, were delicious though. Overall pretty good and has an awesome location! Right off the underground and near the river. Check it out! It's worth a try and they have all kinds of food. Staff is nice and attentive. Quick Tips: 1. Their burgers looked great. Give them a try. 2. Mashed peas are unique (to us Americans)! I recommend giving them a shot!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ge446UtI_M0yzQa-I66Vg"
  },
  "D1vJu5SZCE9nS-OSiD2j3A": {
    "date": "2/10/2018",
    "text": "Interesting concept that has tons of potential. Cod and chips (fried potato chips) were great but the Cod sandwich was horrendous. There were a lot of people coming for fried chicken and chips (fries).They should do home made dipping sauce instead of just giving you packs of Heinz items. Go to Costco, grab a huge bucket of ketchup and do bottles instead. Also, the bread was not good; I'm site they can find a local place to buy it or just Costco.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0_78MFajh0kpC0hAS0WAQ"
  },
  "hlvA62rZgNt0pyjdm8xDMA": {
    "date": "7/8/2018",
    "text": "I really did not have a positive experience here. My friends told me the fish and chips was mediocre at best. I personally got a meat pie and didn't even touch it after the first bite. The service was gruff. I won't be going back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhaUwMoqkOR6Fp0XyBZGcQ"
  },
  "ZDw7-YvZ7nmFw3skoApFag": {
    "date": "1/31/2018",
    "text": "Super friendly  staff, the food was good and affordable. I really liked the ambience, and decoration. My favorite was the fried calamari! The fish and chips were just okay in my opinion but, I would go back for the calamari.It's cash only by the way.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjl4xmrt3sigtHWJcvRNNA"
  },
  "RxMjMFXoShYJ7DsOApQVbg": {
    "date": "7/19/2017",
    "text": "Easiest the best fish and chips I have ever had. The decor though is a little ironic...there's an aquarium tank full of fish as you devour your meal. Service was exceptional and the waitress serving us was very kind. We ordered the cod and chips which I would highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tnn_sY9W24ho4Kw9uwuK6A"
  },
  "ZS_DmacYv2BHRERC8k4LLQ": {
    "date": "5/31/2018",
    "text": "Best fish and chips I've had in London so far. Great service, friendly environment. We had just landed from the US and they saw us waiting and opened a little early for us. The whole staff was amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9C8BfMOWCLtn983AgmyHg"
  },
  "vdYzMsGvctI8WjOjJ4QWbA": {
    "date": "8/12/2017",
    "text": "CASH ONLY!!!!Travelers beware as they only take cash. I had to go to the ATM in the Waterloo station while my family waited for me to grab some cash. Their portions are really big and price is very affordable. Had the fish and chips and it was very crispy and tasty. Also ordered their southern fried chicken and it was amazing. I would come back to this place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "STw_zm6DdipPUU8zzpGrBQ"
  },
  "tXS1xC7aDveQkAYOVl74iA": {
    "date": "5/8/2018",
    "text": "Difficulty ordering,language. CASH ONLY otherwise would rate it higher. Fish was great. I had the haddock, my wife had small cod. Both were sizeable portions.  The side of mushy peas was good and enough for three.The chips were hand cut but only single fried, hence not very crispy but a huge portion.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nERAF_3BsO5fvKeSIxs76g"
  },
  "3jQA4R2VtLlypu377fF62g": {
    "date": "5/16/2018",
    "text": "Decoration is quite funny.Cash only, no card. There are free ATM's at the station nearby.Staff was nice. Place is small, but didn't need booking (lunch on weekday). If you're around the area I'd say to go here.I had lost hope on fish & chips but this one was quite good. Was not oily at all, the fish was super soft and well cooked (the only reason I came here was because at the door it said they only bought fish of sustainable fishing and that it came from the Billingstone market. So yeah, recommended. The chips lacked salt but that's easy to solve (just put some salt on it) and not a problem for me. The portions are big enough for a meal so I'd say go for a medium size.Be careful because the price of fish is separated from the chips (because of different sizes) so it's not only £7 to eat here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0gsh-eHxdkYYH8VCHeYhg"
  },
  "6FWBpx9yCtN4MSTyQStkew": {
    "date": "1/27/2018",
    "text": "Not very goodDecent crust but greasy, tasteless FROZEN FISH. Surprisingly good chips!  Faux 50's American decor, with anonymous service.  Across the street from Waterloo station and yes, I would eat there again - and just have the fries!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6iUzUiYOVV2yl-Ssfv97w"
  },
  "PT42YTYgI-N7RELB-0wixg": {
    "date": "2/14/2017",
    "text": "Loved the decoration of the restaurant, I never looked at the walls so much time as I did here.The aquarium at the corner of the restaurant was beautiful to look and observe the fish eating dirt from the glass while others swim around.The food was okay, tasty, good looking and good amount for regular eating person.I used the free drink from the app and they didn't look sad for not getting that money and even asked if it would only one free or two since I was there with my girlfriend.The person who did the playlist of the background music should be promoted because it was perfect to feel like you wanna dance and sing like you were at home.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rIo7OLHESSY0V-V2pYeNqQ",
        "caption": "Photo of Fishcotheque - London, United Kingdom. An aquarium at the corner with really cool fish.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rIo7OLHESSY0V-V2pYeNqQ/o.jpg"
      }
    ],
    "user_id": "L3U5A4n06qeTyZsT4It2DQ"
  },
  "uYTe7krgidR0B9MHTqKd9g": {
    "date": "12/20/2016",
    "text": "I absolutely enjoyed my time here ! The prices were very good for the food and the food was delicious! And the service is pretty good, and the decor is so nice and vintage ! I ordered the mushy peas and a large cod which comes with chips which were really good. It was my first time eating mushy peas and it was surprisingly so good! And the fish was fried to perfection, crispy and flavorful with the perfect batter! The chips were also very good. Although I have to say, if you do order a large cod, it is made for sharing. But if you really have a big appetite I'd say go ahead and get the large haha. But they do have just regular size cod which is perfect for one. I enjoyed my lovely time here and the interior was one of my favourite parts of the restaurant! Totally recommend trying this place out !",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oRRRHlSMtis-6cpbHXGF-A",
        "caption": "Photo of Fishcotheque - London, United Kingdom. Mushy peas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oRRRHlSMtis-6cpbHXGF-A/o.jpg"
      },
      {
        "img_id": "ltdMzvuejYQ-1hnEkvJSjw",
        "caption": "Photo of Fishcotheque - London, United Kingdom. Large Cod and Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ltdMzvuejYQ-1hnEkvJSjw/o.jpg"
      }
    ],
    "user_id": "Q7_7CYKaSySKQPPEcSZ2Ug"
  },
  "f2Ur89GoV7z7M_DR2OuMlw": {
    "date": "1/20/2018",
    "text": "Great fish and chips. I recommand this place. The fish was very tasty. We have been there with my girlfriend during a trip in London. Decoration and service is also very nice. Good place to eat !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSiUoVITiIt2TZZ6nGIGEA"
  },
  "_BBB0pgRl0bCtrGlII4W6A": {
    "date": "6/19/2015",
    "text": "The GF and I were around Waterloo Station one night, feeling a bit peckish for some fish and chips. We looked a good thirty minutes for a proper pub still serving food past midnight. Alas, none were available so we settled on Fishcoteque.Located along a busy street, the atmosphere inside was cozy and adorned with plenty of marine decor. Regular Cod & Chips [8.95 Pounds = $14.65]The GF went with the cod and chips. The fish was clean, light, and fluffy, with the crispy batter lending a great crunch to each bite. There wasn't much, if any, seasoning, but there was nothing a bit of salt and vinegar couldn't fix! The chips were well-fried as well, with a creaminess within.  Regular Haddock & Chips [8.95 Pounds = $14.65]The skin-on haddock was similar in texture, though with a finer flakiness and had some bones.Mushy Peas [1.95 Pounds = $3.19]The side of mushy peas were mushy indeed. More like split pea soup, the GF enjoyed them, though I thought they could've used a bit more seasoning.The check came in a cute maritime chest, with a few chocolate coins to boot! FYI - cash only.Service was friendly and Fishcoteque fit the bill for our fish and chip needs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kO30XR2WeF6bla6dK1ZZLw"
  },
  "z51vpqwP5taZpThzGJI9fw": {
    "date": "11/4/2017",
    "text": "Definitely the real thing.  A huge haddock fillet in excellent crispy batter.  Thick chips and mushy peas.  The chips and mushy peas didn't do much for me, but the fish was 5-star.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-iWO4p2HA5CLb36sTbXXA"
  },
  "lglo4wDk2xFRt_mqLUu_rQ": {
    "date": "1/17/2017",
    "text": "Blue collar, busman's diner style atmosphere but you won't find more authentic and sizable Fish and Chips any where in London. The place has been around since 1974, so I think that's how they kept their clever name since the disco era.  Bright fluorescent lighting, and typical diner style furniture, doesn't make for anything romantic, but it is authentic. I think the large set us back $14 pounds, which I was surprised, especially factoring in the exchange rate, but it was ample enough for 2 people to share.   The waitress was very nice and helpful.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "HzoQKKHDq9BI37dyJAAtGA"
  }
}