{
  "jkiT5F4YdSwDGa4gScY3mQ": {
    "date": "8/11/2009",
    "text": "Ever-expanding Mexican restaurants of London. I have a bone to pick with you. So for a long time I used to work more or less on top of the Daddy Donkey burrito van on Leather Lane market. They're widely regarded as the first and best burrito in London, and rightly so. Last night, I stumbled across Benito's, yet another burrito joint that have ripped off the Daddy D status quo wholesale, and wodged it into a trendy shop. Choose your filling. Choose your salsa. etc etc. Now strictly speaking, it was pretty good. I had the chicken burrito and it was absolutely fine. The problem I have is that there now seems to be a London subculture to Mexican food that is teetering away from their Californian roots. This bothers me. It's all gone a bit organic, white & green decor, shiny tabletop, overpriced 'tortilla chips' (no, they're not called nachos) and all-serve-the-same-kind-of-beer for me. So, Mexicali entrepreneurs who are looking at London. Listen up. What I want is: - cheap tacos- nachos with that goopy cheese sauce- lots of hot sauce choices- FISH for GOODNESS SAKE- don't overdo the decor Basically, a slightly less evil version of Taco Bell that serves real food. That's all I want. It's not much to ask.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8vuZ_WmHagwCBKGiVXLiQ"
  },
  "-bE1CqTR1oRRwHwvyTcgtQ": {
    "date": "12/21/2010",
    "text": "Went in here recently after a few drinks on the recommendation of some friends who work in the area.  Its a pretty straight forward place, choose a Burrito or Tacos, choose your filling and choose the sauce.  I went for the Pork Burrito with the medium hot sauce.  Have to say it was big and pretty satisfying.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hD-NPMSDfUhOZyvHYrrp0A"
  },
  "DNtjInTD92R8tz4rQ-GHqA": {
    "date": "12/12/2008",
    "text": "The burrito taste tour has a winner...\"Benito's Hat!!\" And what do they win, they win seeing me so often that they might decide to give me a member card. I love the place, in the back they have this huge photo of the green cabs \"bocho\" that we have in Mexico City! The burritos are really top notch; they are cheap and fresh as if my mom had picked the ingredients herself. It gets really hectic though; apparently I discovered the best burrito in town at the same time as half of London. Definitely a place to recommend and enjoy! Oh and please have a Pacifico, a really yummy beer that goes perfect with the food they serve here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S2cE9DdaFKUiSv7yyFJKZA",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S2cE9DdaFKUiSv7yyFJKZA/o.jpg"
      }
    ],
    "user_id": "eN7dzEJM0yL0NgvAbCYbkQ"
  },
  "P2nIeNdFZCb6tsyo7Jk7gA": {
    "date": "5/10/2009",
    "text": "I try and mix it up when I go to Benito's Hat so I can say that the varieties of burritos and tacos are all fantastic. I also love the way when you eat in you get nachos with your burrito. Warning though - it is a bit addictive and I find myself planning my weeks around when I will again return to Benito's Hat!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aexegjp-7urSM35mPhT9Jw": {
    "date": "4/29/2009",
    "text": "The Scene: Having just walked down to Benito's Hat and purchased a Burrito filled to the brim with succulent pork, juicy salsa, re-fried beans, rice and cheese, Adam returns to his desk to work and eat. The Action: Bite 1: MM Bite 2: MMMMMMMM Bite 3: MMMMMMMMMMMMMMMMMMM   Many Bites Later: OH MY GOD THAT WAS ONE HELL OF A BURRITO! End Scene Now that might seem a tad theatrical but the burritos from this place merit theatrics as the burritos from this place are epic masterpieces. At 5.00 you might think them a tad pricey, in which case I recommend the Tacos but if you can afford it go big, go blockbusting and get a few of your pals (aka Three Amigos) together for lunchtime burritos.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "09hzHzGrV3EV6V0x_NcHmQ": {
    "date": "9/27/2011",
    "text": "Great Location, amazing margherita cocktails that perfectly compliment a generous sized burrito. Doesn't get too busy and happy hour is always great!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HtjYQCYL8fvVFNsseAzJPQ": {
    "date": "9/20/2009",
    "text": "Thought I was in Mexico for a while with the hustle and bustle of people trying to get their Burritos. People peering over others shoulders wondering hmmm that looks good, shall I get that? Benito's Hat for sure will be a success if replicated elsewhere. This place has Belly filling Burritos and the service was quick, efficient and reliable. You know a place is good when they offer the choice of Black Beans or Refriend Beans with the Burrito. Felt like I was in Mexico again! I had the Pork Burrito with Green Salsa, Guacamole, Cheese and Salad. It was spot on. The range of beers were good and love Modelo beer however it is not served in a lot of places. I did not try the Margarita or Nachos, had no space. Goodge St for sure is a hip area with a lot of food places and for value and service come here. Enjoy :-)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7HbRJP4Zw3HTJLAXtD-NEw": {
    "date": "9/15/2011",
    "text": "Massive portions of extremely good burritos. Fresh ingredients, great service, reasonably priced, lovely interior and serves an amazing watermelon margeritadefinitely going back!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5WBRWahsCkBUxb3C77AZMg": {
    "date": "9/23/2009",
    "text": "After googling 'good mexican food in London' a few weeks ago as to my horror I had found that Mexicali wasn't serving food in the evening I stumbled across some very lovely reviews of Benito's Hat. Considering it was only a stones throw away from where I was in Soho it was a quick skip and a jump up to Goodge Street. The food choice is fantastic, we didn't have to wait more than a minute or two to be served. It was quite busy (around 7pm) but we were lucky enough to get a table. And we were in and out in about 30 mins, which was perfect as we were hurrying off to see a film at Leicester Square. Would def go back because the food was awesome, there was a wide choice and it was really great value for money. They also serve my favourite Mexican beer - Negra Modelo which I fell in love with drinking at Cafe Pacifico. Can highly recommend this place for quick, yummy, in and out authentic Mexican food.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "X8D7H5jvbxFk7-wUOAmTHQ": {
    "date": "5/17/2011",
    "text": "Eh, just OK.  In terms of their burritos, the meat is usually not that flavorful.  Extra sauce is extra and the prices are a bit on the high side.  I am finding that Tortilla is a much better value.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rZ2FhKqV3EHgVJWj36jaYg"
  },
  "YGvMVJ-X4OK12cJlbJG5kw": {
    "date": "11/15/2011",
    "text": "Awesome food, especially the salad which is just as nice as the burrito. The cocktails during happy hour are very good value for money!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7MTyeiCJyKXYUcQS8MH-Ww": {
    "date": "8/1/2008",
    "text": "Every now and again, a new cafe opens up around the Goodge Street / Charlotte Street crossing, but you can never remember what was there the day before. As a hardened Qyper I hate to say this, but it's possible that this whole area has too many places to eat Anyway, Benito's Hat wasn't here yesterday. It is now and I'm very happy about it. Go in, choose what kind of mexican stuff you want (tacos, burritos etc) then you go up to the counter and watch as they throw all sorts of other mexican goodies in. Yum. The steak tacos I had were better than the pork one I swapped with my friend but both were really yummy. It was £5 for three and well frankly that's a bargain. I wasn't a huge fan of the refried beans though as they were a bit bland, everything else was great though. They do fresh lemonade, which was a bit strong for my liking and was actually like a virgin margherita (they have a 2-4-1 deal on those at the moment by the way.) We came away full and happy. But just a quick note, in Sianyland tacos have hard shells, like tortilla chips. Here, they are soft like burritos. I can never find hard tacos in London. Can someone please enlighten me?",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QKTqUKptmstpQBMtRfBi7Q": {
    "date": "10/15/2008",
    "text": "I love beans! Aren't they great? Benito's does their burritos with your choice of black beans or baked beans - no Mexican food should go without Mexican beans. (Try saying that ten times fast hehe) No really, I enjoyed my super-sized, had to hold with both hands, filled with guacamole, salad, chicken and a medium spicy sauce, burrito - it was definitely worth it's weight in pennies. They are served informally in a coloured basket, which also works as a hat so long as you haven't spilt half your burrito in there beforehand, or things could get sticky! The margaritas washed it down nicely, and the cinnnamon sticks with ice cream for dessert was a winner. The place itself has a friendly vibe, and the production line speeds up the burrito-making process. There isn't heaps of sitting room but we got the funkiest booth at the back :-)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lb_SAyimZZeMK6GmTFE-5A": {
    "date": "10/21/2008",
    "text": "Oiga amigos, Calimex street food has well and truly descended on Fitzrovia. But no this isn't the hood of a balmy Guadalajara suburb. By contrast, Benito's Hat is cushioned opposite a deluxe Habitat storefront in the culinary-rich area of W1. The happy arrival of this affordable, hearty eaterie comes off the trend of three burrito bars in the vicinity of Goodge St (the longstanding El Burrito restaurant and the excellent Freebird stall outside Oxfam, another off Exmouth Market (where there's also a second Freebird stall) and Mucho Mas on Upper Street, Islington. And it's a welcome cacophony of Latin spirit and sound, as a concoction of dipping starters appear in plastic postbox red baskets. We're ushered up to the front of the restaurant to grab our burrito (mine is of the beef variety), wrapped in silver foil and chomped hungrily as salty margaritas offset our tantalised taste buds. Diners are able to select a bespoke combination of marinated meats, vegetables, rice, beans, cheese and fresh salsas, all wrapped in a fresh warm tortilla or served over romaine lettuce. The meals come in at a student-friendly £4 to £6 which makes the venue a strong contender for the 'Cheap Eat of the Region' Award! Surrounded by the good company of Qypers nestled in the back corner of the restaurant, this provided the ideal spot for a friendly 'meat and greet' however it wouldn't get my vote for first date place. A dollop of guacamole on your lapel may not be the most enticing way to lure a potential amorado. Nonetheless, refreshingly crunchy cinnamon sticks with vanilla ice cream rounded off (quite literally) a Latin infused evening leaving me rather more rotund but quietly content.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vTphhd7rgZF25DYQuul_yw": {
    "date": "4/15/2011",
    "text": "Delicious burritos but a little too expensive ! 7£ the burrito without coke or other soda !",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "T2OkA_ZrRztd7GXdK9XeLg": {
    "date": "11/1/2008",
    "text": "Sorry, I don't understand the hype about this restaurant. The concept is young and funny, ok, some of the waiters might be cute, ok, they play really good music (the Cure, Oasis, well at least what I'd call good music, defenitely for the young crowd, though; it's also quite loud, not a place for a romantic dinner for sure), ok, they have really friendly staff, ok, so everything pointing towards a 4-5 star rating. Still: the food was simply not good enough. We paid 15 pounds for 2 burritos, chips and a beer. That's good for London. But in that area Goodge/Charlotte street are a lot of eateries where you'd pay roughly the same, so this price seems to be normal and to be expected for the area. And still, to come back to the point the food simply wasn't great. It was filling, for sure, but the chicken, luke warm and stringy, not to my liking. The guacamole quite tasteless, but - here they get credit: they've used nice and ripe avocados. The salsa was good. But the beans, well I've had better ones, I found them a bit bland. Same was true for the vegetarion option burrito my friend tried. Good there were salt and pepper on the table. In conclusion, a place to get filling, rich food, but in terms of taste not my first choice. I'll continue looking for great Mexican food in London.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oLZsinZiJBI8uKczgBdn6A": {
    "date": "3/8/2012",
    "text": "As a Californian and being a big fan of Mexican food, I found it a real struggle to find decent Mexican food when I moved to London 3 years ago. Just a few years ago, Mexican food meant Cooler Ranch Dorritos covered in wet Cheddar cheese and garbanzo bean burritos...it was just wrong....plain wrong. However, in the last year or so, the Brits have really come to grips with \"authentic\" Mexican food and I must say, i'm quite impressed. let's not kid ourselves...its nothing like the cuisine I get at home in LA, but it fills the void.  Benito's Hat is not the best of the bunch but it is a decent quick bite joint. Not too greasy, made with fresh ingredients and not a damn cooler ranch Dorrito in sight (fresh tortilla chips yes!). They even make fresh to order Margaritas (not out of those machines!) which are really tasty, albeit a bit on the small side. I do however have 2 major complaints with Benitos Hat. The first is that they don't have hot sauce on the table. Now, this might not be an issue for everyone, but mexican food is ALL about hot sauce for me...its like having a burger and chips without Ketchup...its just wrong. And their salsa wasn't amazing so they need to offer something. When I asked for hot sauce they said it would cost me extra...EXTRA...its bloody hot sauce. A chippy wouldn't charge you extra for mayonnaise now would it.  My advice to the owner would be to go out and buy a few bulk crates of Tapatio or Cholula to scatter around the joint. Ok, rant one over. The other issue I had is that they use white pepper in their cooking. I hate white pepper....it tastes like you're eating a barn. Literally, its like picking up a handful of dirty hay, wiping it on a horse and sticking it in your mouth. Good old fashioned black pepper does it for me. My Benito burrito did have a faint taste of this barn disaster which is why I can't give it high marks.  Overall its a decent burrito and if you're not as picky as me when it comes to condiments and seasonings, you might even enjoy it, but there are definitely better Mexican restaurants in the city.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6V3MgvjZKu2ZAnOAat86w"
  },
  "DsbZhWKEk5H3_NUi3JTWbA": {
    "date": "4/16/2009",
    "text": "Great place and a great name! Basically, it's a mexican Subway. The food was great - i had a chicken burritto - and REALLY fast. In fact, a little too fast! The guys behind the counter bark questions every couple of seconds, which although it's pretty intense it does get the job done! At £4 it's not exactly a cheap eat but for what you get it's worth it.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "H8Xtlma9IPp6N2igM_8Pqw": {
    "date": "8/24/2011",
    "text": "YUM! Loved the burritos, cheap and delicious. The guacamole was fresh and excellent. I'm enjoying this recent invasion of Mexican food into London!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OmhdI8aSbpuncKUrF2H0sA": {
    "date": "11/25/2009",
    "text": "If I was in California I'd give this place 2 stars, but as it's London I might be going back. The food was completely fine, the restaurant was clean. The taco was served in a flour tortilla instead of a corn tortilla which is strange. The hot sauce wasn't hot. There was no salsa/hot sauce areas. The rice has no seasoning on it which really ruins the flavour of the meal. The chips were bland.  Lastly, the horchata was terrible and chalky. Some POSITIVES: The guacamole was quite good, the hot sauce was somewhat hot, the prices are reasonable, they have black beans.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bm5tu0Lwd5xkDumkXe3MIQ"
  },
  "7a6tLRGov1NxWMnYuZmFZg": {
    "date": "3/17/2010",
    "text": "Basically, Benito's Hat is not the best Mexican spot in London.Everyone keeps comparing Mexican food to the American standard of Chipotle or Baja Fresh.  The funny thing is Chipotle or Baja Fresh isn't even really Mexican food either.  LOL . . as for London standards, it'll do.ANYWAYS, the upside to this place is that it's cheap and a good quick meal or even grab a quick happy hour margarita.  The downside to what I got (a burrito) was a bit dry, I definitely recommend a side of salsa.If you're craving something Mexi-esc, just have a go at it.  It'll be ju   st enough to suffice.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eL0ZTTGZrpifuB6CosRTUQ"
  },
  "udBXUqfMmwEFJfUmzO7ZHQ": {
    "date": "3/29/2010",
    "text": "I was not a fan. I really wanted a burrito on a Sunday after a night of boozing, and this was one of the only places I could find near me that was open so I thought it was worth a try, but to be honest I have had better burritos in London - Tortilla comes to mind.The guacomole was too chunky kind of putting me off the whole burrito experience. I mean, if I was in a burrito-mergency I might go back, but I'd try and find somewhere else first.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "cxt8iStHDBk5mZhWtIgNDg": {
    "date": "9/30/2010",
    "text": "When the Burrito Event Horizon has been reached and every shop is selling these tasty parcels of Mexican-style lunchtime goodness, I predict that there will still be queues outside Benito's Hat. And for quite good reason. Their ingredients are consistently high-quality and tasty, and the staff seem to have a knack for getting just the right proportions. I'll often think about asking for a little more sour cream, but then trust their judgement, and realise that they know what they're doing. Even under the high pressure of lunch-rush, they consistently come up with the goods. Personal favourite's the chicken burrito, black beans, sour cream, lettuce, cheese, and hot salsa. BAM! A taste explosion. There's a couple of decent beers on offer too, as well as various Mexican style drinks. I can't comment on the authenticity of the thing - having never visited Mexico - however Benito's Hat are consistently authentically tasty, and never so soggy that the bottom drops out of the thing before you've finished. The handful of tortilla chips is a nice touch, but probably unnecessary. The only way I'd make this place different would be to turn it back into a secret, so I don't have to queue up for their amazing bundles of awesomeness.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fdr7dlTVnawz-zxwhF2MSg": {
    "date": "10/16/2008",
    "text": "Benito's burritos are fantastic. I'm sure the rest of their meal choices are too, but that's what I went for - a chicken burrito with refried (baked) beans, rice, salad, cheese and a tomato and onion salsa. It all gets made up in front of you and packaged up into a foil wrap, put in a basket with a few tortilla chips and off you go. There's no waiter service but that was one of the things I loved about the place - you just choose what you want, pay and away - fast food but it's great quality. The staff almost guide you through your choices too, so if you feel a little nervous about selecting incongruous ingredients fear not! Don't let the sauce choices fool you either - there was a lack of spice in my chosen salsa (which is what I wanted) but the whole burrito was still full of flavour and textures. They're pretty big too, so will fill a hungry stomach up pretty nicely. As mentioned by other reviewers, the cinnamon crispy tortilla strips with ice cream were amazing, and well worth sampling even if you don't normally 'do' desserts. A nice smooth Mexican beer washed the lot down, along with a few Margaritas and Palomas. I have to be honest, I couldn't tell a great deal of difference between the two, but the Margarita maybe had the edge in strength. Palomas are essentially tequilla, lime juice, grapefruit juice and soda. Very nice, and it was great to be able to try something new and different from the usual choices found in the smaller restaurants and bars. From the outside it is minimalist and unassuming, but once you get inside there is a really good atmosphere, one that is clearly being shared by both punters and staff alike. The honcho, Ben, made sure we were happy throughout the evening and I applaud him for what he's achieved with Benito's Hat, it really is somewhere a bit different - equally suited to a quick but cool bite or a sit in with friends and drinks! I would definitely head back there when I'm in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wi2YUzMmc9_nTRMtUFyung",
        "caption": "Photo of Benito's Hat - London, United Kingdom. The baskets that your food is served in double as hats. An uncanny colour match presented itself....",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wi2YUzMmc9_nTRMtUFyung/o.jpg"
      },
      {
        "img_id": "Xi6K1aPmo4PnSjVKUbuFuA",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xi6K1aPmo4PnSjVKUbuFuA/o.jpg"
      },
      {
        "img_id": "Wt-8S8t68bczZkDhwET8Nw",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wt-8S8t68bczZkDhwET8Nw/o.jpg"
      }
    ],
    "user_id": "yIDLTJZD7wc0ZoBtnreoUQ"
  },
  "aQa_6hohQ2OScT1EuVhxXA": {
    "date": "10/20/2009",
    "text": "Yes, it's sort of like the Chipotle chain in the States.No, it's not the best Mexican food you can find in London.Yes, it's cheap and cheerful, and the staff are nice guys who want nothing more than to make you smile.I had a \"taco\" salad (just a salad really with some black beans and rice on top) and a nice cold Corona. It hit the spot. It was pseudo-Mexican and it held me over until my next Cali visit.The end.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XGaMoQ6sg0B5hSzC5aRmdw"
  },
  "qEKw9Nr2VjEyOWkBbzZNjQ": {
    "date": "12/12/2009",
    "text": "Thank goodness I'm back in San Diego.  It's unfair of me to review this since I've returned but on London's Mexican standards it wasn't very high for me.  I much preferred Tortilla and even more Freebird (The Stand on Rupert).The problem at Benito is that nothing had any flavor.  The beans and Carne Asada especially lacked.  I used to being so overwhelmed with flavor in my Mexican food that usually have to sit down while eating it, and rightfully so.  That just did not happen here.  I will say very good tortilla, which is an understated importance for a burrito.If you're on vacation though from the US, just wait till you get home for Mexican food.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rb_6s27JO3K87xtjwzXkFw"
  },
  "sv6yd3eUcbntvwPMc1BLMA": {
    "date": "2/11/2015",
    "text": "Great staff, great food at a great price coupled with a decent margarita! Will be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8M1DpOZ8DDI94o7pfkjPxQ"
  },
  "s_BrvDVQByEBQrjEirTn9Q": {
    "date": "9/4/2009",
    "text": "Ah, the ole \"Mexican in London\" debate.  I am not even going to go there!That being said, I was happy with my burrito. It reminds me of British Heinz' chicken noodle soup vs American Campbell's chicken noodle soup. Yes, they are the same thing, but growing up with Campbell's, Heinz' just tastes... different. There's a slight difference and I can't put my finger on it. (Spices, ingredients?)  Anyway, back to my point. It reminded me of Chipotle, but in that weird slightly off feeling. I had a chicken burrito with black beans, rice (got DAMN i love me some coriander and lime rice), cheese, pico de gallo, sour cream and guacamole. And I'll be damned if it weren't delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "fJH3zbE6BVL2B6-lk509hQ"
  },
  "O3EzmxWyXkL67xBw8zzEng": {
    "date": "1/9/2011",
    "text": "Great place! First, the not-so-great: The flavours & seasoning are distinctively different from other burrito offerors, and less to my taste. That said, I do still like this place and find myself coming back again and again, whenever I am in the area and hankering for a burrito (which is, unfortunately, quite often). Pluses: The staff -- you always get service with a smile! The cheery atmosphere. Not getting charged for guacamole. And last but not least -- fresh ingredients. Never does the food look or taste like it's been sitting around for days, dried out (ahem, see my other review of a certain inconsistent burrito joint in the city).",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pNq8Xv47W-0HW4QbSfwYXQ": {
    "date": "5/15/2009",
    "text": "I'm originally from southern california, so the very idea of Mexican food in a place like Europe just sounds a bit offensive to my taste buds. Not to mention that the few times I have tried it at Camden or Spitalfields, it was decent at best in terms of taste, but not the closest thing to Mexican food or at least the Chipotle-style burritos I have a penchant for. The closest it came to was probably Chilango near Old Street.. but something was still not quite there.Benito's hat = UNNNNHHHHH. so good. hands down best Mexican place I've had in Europe. I think generally the quality of the food tastes a bit better than Chilango's, and it's a bit more of a small place, so it doesn't feel like a humongous 2-story chain like Chilango does. And for some reason, all the girls that work at Benito's are all really hot. The salad is AWESOME, the burrito is so good, and even the soup is great.  They have some amazing variety of sauces that you have to specifically ask for -- I don't even know what they are other than amazing. Benito's has made it possible for me to consider living in London permanently.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "jWogrkf0PMfP9UoiXULKuw"
  },
  "48IuYydBaufuTO-WqYnMKg": {
    "date": "6/12/2010",
    "text": "This is one of my regular lunch places. Their burritos are not the best I've had in london but they are quite good, I have to recommend the pork which I found is the best of the burritos. Also, up to you whether you're into spicy but I find the spicy sauce is the tastiest one with a hint of garlic to it. I tried the tacos once and ended up wishing I had had the burrito, it's just not big enough and for just a bit more you get a burrito instead. Now the bad parts. The staff is a bit uneven, a lot of them leave and you might end up with one in training (not all bad, some new ones give you a lot more than they should!). Flavour-wise though the ingredients are always excellent.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ah_qair3jsvp5K9v0XmHoQ": {
    "date": "1/20/2010",
    "text": "I've eaten here once for lunch with my girlfriend and we were both very impressed with the quality of the food and their portion sizes. We chose to eat in rather than get a take away and we were unfortunately pretty unimpressed with the uncomfortable seating and plastic plates and cutlery. It was also cold.So, I'd definitely recommend this place if you're after a take-away lunch but not for dinner or if you're after a comfy place to park your bum for an hour.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQXV3vo235cFjNwlVU2qAQ"
  },
  "ykPlMpJiIDAvmTvMOZmd7Q": {
    "date": "12/10/2009",
    "text": "First Mexican food experience in London, and wasn't bad at all. That said, for being a order-at-the-counter taqueria, I've had better and much cheaper, but then again, to compare the SF Mission district with Mexican in London is an unfair comparison. Definitely more Chipotle or Baja Fresh style...it works, but just ain't the same. My burrito maker, however, was ultra-generous with the helping of the tasty guacamolitoness on my pork burrito, so 5 stars to him. My boyfriend, on the other hand, got a rather skimpy helping of chicken on his, and cried a little because of it. I'm kidding, sort of. Maybe it was the hot sauce, that had a surprisingly decent kick.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9m9adcWg9h8mRX9idm9Qw"
  },
  "vVulPK-fmgvH70XFYgGzag": {
    "date": "6/7/2009",
    "text": "There are no Mexicans in London, so it makes sense that there are no good Mexican places in London...except for this one. Looking for cheap, Chipotle-style eats in London is almost as hard as beating Mike Tyson in NES Punchout. This place is truly a godsend. Being from California, there's nothing quite refried beans, meat, guac, rice, and floods of hot sauce to alleviate a hangover and this place certainly has all of the above. My personal choice was always the Benito's Hat equivalent of Chipotle's Burrito Bowl. Sour cream and guac? Yes, please.On a sidestreet of Tottenham Court Road that actually has quite a few good dining options, Benito's Hat is a great place to fulfill your greasy Mexican food deficiency. Really decent prices, absolutely worth it! Forget 'pub food', just go to Benito's. Your stomach and your wallet will thank you.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXTkohpe3Hg_q_sKDbW__g"
  },
  "445qcL_t1lRb76xEFudTQQ": {
    "date": "6/16/2009",
    "text": "Coming from the states, where you have a burrito place within 5 blocks of you at all times, I was definitely feeling withdraw.  Its so hard to find a big fat burrito in the UK.  Benito's is as close to Moe's/Chipoltle/Barberitos (ATH represent) as one can get.  The burritos are FAT and the meat is seasoned well.  I've been to Chilango and found it a little bland for my liking.  Benito's Hat delivers the spice i NEED in a burrito.  and its only 5 pounds..not bad.I only wish they gave a bigger heaping of chips with it, but i have to remind myself that we are not in the land of the over indulgent American anymore..",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jdn3EG9KBRyjZH0HP_orzg"
  },
  "p0cAvQR4x9kg47qnptpN1g": {
    "date": "6/22/2011",
    "text": "I've not been to many Mexican restaurants in London (nor have I visited the country itself) and therefore I must admit to a limited burrito-based knowledge.  Having said that, I know good food, and this is good food.  It's not cheap - anything over £5 for a takeaway lunch in London falls into the \"splashing out\" category - but it is undeniably delicious and incredibly filling.  I used to work in Fitzrovia and would trek over to Benitos Hat on the days when I was going out in the evening and wanted something which would fill me up until my dinner at the likely hour of 11pm.  This always hit the spot.  You get a free handful of tortilla chips (yeah, ok, Doritos) with your burrito and the helpings are extremely generous.I now work seconds away from the well-regarded stall on Rupert Street in Soho, but there is something about Benitos Hat which still marks it out as superior.  Whether it's the plentiful options or the slightly more tasty salsas (the mild one is actually mild, as opposed to mildly blistering), I couldn't actually say, but the sizes and prices are not dissimilar.  The staff here are also far friendlier despite the super-speediness of their veritable production line.A handy tip: the chicken doesn't drip nearly so much as the pork or the steak, so go for that option if you're planning on walking and eating.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TNeXaR5i4Mm9ZxpJEY9OA"
  },
  "4eAQbvJXNJFVg_21ZoKPVg": {
    "date": "3/11/2010",
    "text": "I went to Benito's last year when it was celebrating its first birthday so everything was £1! It was the best birthday ever! I have been back since because i was left with such a great impression: The sauces are delicious especially the green spicy one (if spicy is your thing) and the slow roasted pork is great! It is a rather small venue so you can't go in big groups but it is good for a quick bite to eat if you are in the area. Having said that I am trying to be in the area sometime just so I can have another one! The taste is so good and the price is so good.......",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Abo1q5YCSgKM1CBirWCR8Q": {
    "date": "2/26/2010",
    "text": "It's Dan's favorite place. He took me and said me \" it's the best burritos that I have ever eaten \". And he is right. The burritos are amazing and so big. It's not very expensive because a burrito cost 6£ with guacamole, cheese, chicken, black beans, rice....The staff are very helpful and friendly and the service is very fast.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "I2uoneuZ8KYEHMazWza06Q": {
    "date": "8/21/2009",
    "text": "To spice up my reviews a bit until further notice I'm going to use famous people as metaphors for the places I visit and the food I eat. Benito's Hat has the privilege, if you can go as far as to call it that, of being the first in my esteemed series. My burrito at Benito's Hat reminded me of Danny Devito. Firstly it was fat. Very fat. It also wasn't much to look at, being out of proportion in a Dannyesque way. Obviously I've never tasted Danny, and have no intention of doing so, but I imagine he'd be quite tasty in a greasy kind of way - much like my Benito's Hat burrito. Danny has had a place in my heart ever since he guest voiced in the Simpsons - I'm not sure Benito's Hat will have quite such an enduring appeal - but then again I've always had a soft spot for fat misshapen things.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "54UV1eO0sVJXrBb8G1no1g": {
    "date": "8/19/2009",
    "text": "Benito's make magic burritos. Probably not the most authentic, but whatever. They taste effing great (pulled pork win). They remove the remnants of hangover from your head. They keep you away from your computer long enough for your internet problems to dissolve. They fill you up right to the top but don't make you want to expire during the afternoon at work. I wish I could make rice like that. But mostly I just wish they (and most everyone else too) would stop charging for guacamole.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BBmr4hMzbIOITEY6oJeD9g": {
    "date": "9/18/2011",
    "text": "Mexican...the final frontier in London. The great burrito race is on in London and Benito's Hat is doing a heck of a job in cementing themselves as one of the best Mexican burrito shops in London. The options are simple and to the point. The results are delicious. My only issues are that they are a bit over priced and the tortilla chips are ALWAYS stale. The last part confuses me as everything else is so fresh and delicious, even the guacamole. Also a good place to get a Pacifico, Negro Modelo and a few other good Mexican cervezas (beers).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GhPsVqtRtf1t-H9OIa1jMg"
  },
  "wa8TeTKKPJNq_blTAvo1nw": {
    "date": "7/10/2009",
    "text": "Unimpressed, big time.Overwhelming service. Underwhelming food.I finally stopped in just after the lunch rush today and got some tacos.  I picked my filling - vegetables.  I also asked for some refried beans.  Two men slopped the ingredients onto my tacos and moved them on down the line.  Why it took two men to pile refried beans and vegetables in taco shells is beyond me.  The toppings woman barked, 'You get two toppings!'  Okaaay... Guacamole and salsa? I guess I was going to have to forego the sour cream and cheese. She splashed the guac and salsa in the tacos, closed them up and moved them over to another guy who chucked them on a plate with some tortilla chips.  No salsa.  No salsa to be seen anywhere.  I paid my £4 and found a seat.In the minute or so it took to get from the assembly line to the till to a table, these tacos had turned into a hot mess.  Eating them was a precarious task.  And, sadly, they weren't even very tasty so as to excuse the messiness of the preparation and presentation.  The vegetables were waaaay overcooked and nothing was seasoned well at all.Let down.",
    "rating": 2.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "-m7Iyo8xWMiFeeAxNekREw",
        "caption": "Photo of Benito's Hat - London, United Kingdom. This taco disgusts me.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-m7Iyo8xWMiFeeAxNekREw/o.jpg"
      }
    ],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "q53wmojtT9Bi6Ic881oNqQ": {
    "date": "7/8/2011",
    "text": "The original and best in my humble opinion.Having seen a glut of burrito places explode around London in the past few years (c.f Mas Burritos, Tortilla, Chilangos) nobody wraps it like Benitos.It seems a little odd that many US-based Yelpers seem to enjoy comparing (unfavourably) these establishments to their own in SF, LA and NY, but the fact it is there are scarcely 5,000 Mexican nationals living in a city of 8+ million people... Those figures don't make for a promising Mexican food culture.So I think that Benitos Hat should be commended on their brick-sized burritos, filled with your choice of two types of slow-cooked, braised chicken, flavoursome pork, tender beef, and sometimes even fish (occasionally - which white fish though, I'm not sure! :S).Their guac is beautiful and always made with super-fresh avos (70p versus Chilangos - more miserly portions - at £1), and they have a slew of themed nights (two-for-one tequila-based cocktails for students every week, specials on Cinco de Mayo etc).Being a regular at the Mortimer Street branch, I've yet to venture to either of their newer openings nearby, both of which I've been told cater to the lunchtime crowd more than the former, which has a more laid-back evening vibe about it with outdoor seating like its neighbours (Barrica, Salt Yard, The One Tun pub). This Fiztrovia branch however, is simply awesome - authentic or not.Go in, drop a tenner, enjoy yourself, and stagger back out sated, happy, and ready for a siesta...",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "LbdSUsuvfhaZ4xJVziUgwg"
  },
  "Ya8TdK7TljTAj-57BYMQcA": {
    "date": "7/11/2011",
    "text": "Other than the meat selections, this would be a 5-star, easy. Of the meat slections, the pork carnitas are fantastic, but the rest look a tad dry/boring. Also, a bit stingy with the black beans. Excellent salsas, jalapenos, etc etc etc.But seriously, the best burrito I've head in London, hands down.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vh-z4u73KV3GhP1KOL36uA"
  },
  "tRogRVzTGE6oCOIUdmeMSg": {
    "date": "6/1/2011",
    "text": "ok, i LOVE the place (compared to the crap that passes as Mexican in London), however compared to Chipotle (which could be considered it's homologue in the US of A) it is A-OK.The price is right, and the fillings are healthy, but literally this is the  \"dump-it\" assembly line, as if they're scooping dog food on the tortilla, without caring much to spread it evenly.  This however does make for surprising bites throughout this chow wrapped in soft tissued tortilla.The taste is superb, however to eccho my foodie mates below re the really poor wrapping skills which could make the boorrito a LOT more mouthable, and to be honest... MANAGEABLE so you won't have to resort to the cutlery to fold the corners.Yet, i know i will be back again... b/c burrito-bowls that are the craze in NY, and the memory of which i so dearly cherish will not be available in london.Until then.... i tip my hat to you Benito!!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "na3UYTLl5dFNrHrOurmM6g"
  },
  "GjRbEt5xFaOWhBaD4Vc71Q": {
    "date": "1/15/2015",
    "text": "Very average Mexican/Tex-Mex - classic London. They have happy hour from 5-7 where you can get 2 for 1 drink deals",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPS6LQYDRLr7PZ-d8MvLag"
  },
  "57smBAKar2TSINhofzDkBQ": {
    "date": "11/2/2010",
    "text": "I'm not sure if I'm settling, changing, or just plain growing up, but I've become less critical and more accepting of differences amongst burritos. I believed that London had failed me in my search for a Mission-style burrito. However, my last trip to Benito's Hat made me think: perhaps it was not London that had failed. Perhaps it was I!Mission district burritos are alive and well, and exactly where I left them: in San Francisco. That's fine. That's where they belong. Meanwhile, some places in London are putting their own twists on this magical food, and sometimes it works out pretty well. Benito's Hat has flavors in their burritos that I wasn't accustomed to, but now that I'm accustomed to them, guess what- I like 'em just fine!Will I lust after them as I do burritos from home? Probably not. But once I stopped comparing and started seeing them for their own independent merits, I realized that Benito's Hat make a damned satisfying meal in their own right.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "tCt_tHrfCc8Vu4qRgxpuQg"
  },
  "qxGAyHeE60NoocuDEqnPhQ": {
    "date": "2/15/2011",
    "text": "I'm so faithful to Chipotle that I don't know how objective this review can be. (I want to say I'm not delusional-- I know Chipotle is pretty average, but to me it's wonderfully average and I love it.) Anyways, I want to give it 3.5 stars but couldn't so it's stuck at 4.I've been to Benito's hat a couple times and yes, the burrito is pretty decent. The meat selection/caliber is similar to Chipotle and so are the sauces.. the most notable difference was the rice, which is what I love most about Chipotle. The rice at Benito's hat felt much dryer and plain and not cilantro-y enough (or at all?). They did make up for it a bit later though cause they have a \"cilantro only\" option they scoop in after the lettuce, tomatoes, and salsa. If you're a fan of barbacoa at Chipotle, you'll like the braised pork option at Benito's hat.If I'm ever given a choice, I'd always pick Chipotle unless I was already in front of Benito's and too lazy to move. But this may be American bias.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SC51yA3mxFnQGHZnGMWvqg"
  },
  "NuMdyouvxMxq4QQ49pLvWw": {
    "date": "7/29/2009",
    "text": "THE BIRTHDAY PARTY Girls drinking Tequila like it was water, 60 cases of corona SOLD OUT by the time we arrived and it was only 9.30 Those crazy people at Benito's Hat have serious issues - I feel like HELL. Tequila, Wraps, Beer, Cocktails endless supplies. A great night, party people everywhere and great vibe. I have 3 interns missing - if you find them send them back to me Mr Benito.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "m2CB2kYeZ1NeymyZSzLtTw",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m2CB2kYeZ1NeymyZSzLtTw/o.jpg"
      },
      {
        "img_id": "cEQbEuSbAUHfM2cpkKiaPg",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cEQbEuSbAUHfM2cpkKiaPg/o.jpg"
      },
      {
        "img_id": "Q0PZV4mnGkqXnBIJ9b0sdA",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q0PZV4mnGkqXnBIJ9b0sdA/o.jpg"
      }
    ],
    "user_id": null
  },
  "6P-q8NYXNLt67a15_CR0gA": {
    "date": "3/20/2013",
    "text": "i was in need of a post-shopping, pre-gig dinner stop, and benitos hat came up trumps because between 5 and 7 everyday, all cocktails are 2 for 1. i love a good cocktail, and in particular, i love a good margarita, so i was sold!the atmosphere in here on a friday evening during happy hour was pretty buzzy - and it definitely felt more like a small restaurant rather than a fast food joint, which was nice. the cocktails were seriously good, and even at non-happy hour prices, i thought they were fairly priced. i ordered a grilled chicken, no rice, no beans, no cheese, no sour cream, extra guac and jalapenos, hottest sauce they got, burrito and it was deeeeelicious. this is my preferred way of eating burritos as the rice and beans is only filler for me and doesn't add anything to the taste (or texture!) of the burrito that i would enjoy, so i take em out to ensure that i can eat the whole burrito and get the most value for my money!chilangos is my favourite sit in place to get a burrito in london, luardos is my favourite burrito in london, and now benitos hat is my favourite burrito-with-a-good-cocktail place in london. hurrah for burritos!ps. i've never been to mexico, but i have been to SoCal and i'm not scoffing at the above three offerings ;)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WW3uGfrqB4tTDlQMKCiDbA"
  },
  "xkr_UESX_bWK-OkH5H0yWA": {
    "date": "5/29/2010",
    "text": "So when you do a really big poo, one that's been filling you up and making you sluggish and heavy for hours, doesn't it feel great to get it out? Sure - it's a little gross and as the poo leaves it can sometimes be a little painful too, but don't deny how satisfying it feels.A friday night pork burrito with the habanero sauce from Benito's Hat is almost the perfect opposite of this. It was a little gross and spicy painful as I ate it and it made me horribly sluggish and heavy for hours afterwards but there was no denying how satisfied I felt. A £5.50 taco-wrapped reverse mega-poo!In terms of the burrito itself I was mighty impressed with the pork meat, the taco and the spiciest sauce but the too much and too-dry rice negated the fifth star. I'll be back though - a chunky burrito like this is always good fast food, it's practically ready to leave your body before it goes in. Huzzah for cylindrical dinners!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "GnVC69jPz6XGGQd7bPRgDw": {
    "date": "6/24/2012",
    "text": "This is the closest to the buritos I had in the US. They have a very simple menu, buritos or tacos. Simple but delicious. They have recent started serving tofu for veggies or if you are not into beef or chicken. They also have a happy hour for margaritas early evenings. Very friendly staff and small but cute place. Fast food Mexican style. Love it!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "IOl91yBnRYK49NMTqNxM7g"
  },
  "__Wk1a95uMimMtn6UX2gCw": {
    "date": "4/4/2010",
    "text": "Advertised as the best burritos in London and until we get a branch of Chipotle here in the UK that should be true. This is not a complete restaurant but an extremely pleasant fast food joint with the nicest staff it has been my pleasure to order from. The menu is limited to burritos, tacos and salads so not a full menu by any standards. The Burritos are excellent, and as good as, if not better than many I have had in the US. The prices are reasonable ane especially for the size of the burrito, The ingredients were very fresh and the guacamole was especially good.The Margarita I had was nicely put together but small and wasn't one of the better ones I have had and I am a fan of the Margarita. The staff are cheerful, pleasant, helpful and efficient and make you feel very welcome. It's a pleasant experience to eat there and the food is very good if somewhat limited in scope. Well worth a visit and especially if you are hungry",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tav2Jecus4nDRIS21094QA"
  },
  "KWrv0Igeqb126DjHuLLLRQ": {
    "date": "8/26/2011",
    "text": "5 stars. These are the best burritos I have ever eaten, and no, I haven't been to Mexico, so yes, I am basing this on my limited London burrito eating experience. But I still say they really are excellent. I had a steak burrito. It was huge, the rice was tasty, the black beans delicious, steak incredibleyou get the picture (also had: medium salsa, sour cream, cheese, lettuce). It was huge, quite enough food for two meals (or one very long sitting). I also had a Ting, a grapefruit flavoured fizzy drink that accompanied my burrito nicely. They have started doing loyalty cards so look out for them by the till.Its nice to sit in the window and do some people watching out onto Goodge St.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cse_bzuUnqSiyEbGanwhEA": {
    "date": "2/9/2010",
    "text": "As I would happily eat quesadillas for dinner every night, it's no surprise that I am a fan of Benito's Hat. It may be small, and you may have to sit closer to strangers than you like - but the food is worth it. For £4 - £5 you can eat a massive burrito stuffed with everything from steak to chicken or chargrilled veggies, topped with cheese, sour cream, salsa, or delicious guacamole. They have tons of options for what you can put in your burrito/taco/salad. A bit reminiscent of Baja Fresh, but with less saturated fat and more authenticity, the good folks a Benito's Hat make your dinner right before your eyes. Like magic. They also have margaritas and Mexican beers, which is always a win in my book.If you're craving killer Mexican food, don't go here as you'll be disappointed. (Especially if you're from California. Or, er, Mexico.) But it's still delicious food and the staff are super friendly.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9piOzBr_kgd_sMf6PqONtg"
  },
  "uN6gZ0M7W4MrNXkuIhwhVw": {
    "date": "11/7/2008",
    "text": "Returning to London from California I immediately asked, \"Where has all the Mexican Food Gone?!\" Although London is thousands of miles away from the sunny shores of Baja, I was relieved to find a tasty burrito, taco, salad and soup bar that left a smile on my face and a feeling of triumph in my stomach for hours. I choose a burrito filled with black beans, rice, cheese, guacamole, lettuce and mild salsa.The staff is friendly and attentive. If you are confused by the various spiciness of each salsa, do not hesitate to inquire. Ask for Lara, Raliza or for Spanish speakers Abraham. Benito's Hat offers a simple concept with extraordinary taste and for just 20 minutes and around 5 pounds, I am able to exchange the hectic streets of London, for the sand, sun and flavour of Baja!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OSVpfqkgTKRK4bTVXudmKg",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OSVpfqkgTKRK4bTVXudmKg/o.jpg"
      },
      {
        "img_id": "bsE5fcDMADly--Lb92W1Tw",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bsE5fcDMADly--Lb92W1Tw/o.jpg"
      }
    ],
    "user_id": "OW3nrU3uQQ1DynD4MQ24-w"
  },
  "VDdr7l65xRE3Oc-6wChkLg": {
    "date": "11/2/2010",
    "text": "Benito and his hat deserve a medal. I discovered this place quite by accident, driving past one evening having not had dinner. I stopped and asked if they would serve me, and although they were closing up for the evening they whipped up some tacos for me which tasted sublime. I now work within lunchtime proximity of Benito's Hat, and worry that one day my office will move too far away to come here regularly. I eat here at least once a week. The prices are excellent, the fillings are top quality and there's a giant poster of Mexican VW Beetle taxis on the wall! What more could I possibly ask for? I could ask for Agua de Jamaica, but they have that too :) (For those who don't know, Agua de Jamaica is Hibiscus water. It tastes a bit like cranberry juice but is much nicer). I love Mexican food, and burritos in particular. Benito's hat is sited in an area of high burrito density, and the only reason for not going here is that the queue is too long, which says it all really. Benito's Hat serve the best burritos I've had in London, and I've had a lot of burritos. They also do cocktails and desserts, so you don't have to restrict it to lunchtime only :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cue1uXN_0nIQGX-4J7b_BQ"
  },
  "blXaGY42LqkBTEX4HPe5gA": {
    "date": "10/3/2011",
    "text": "Best Burritos in town by some distance  ingredients and subsequent taste to die for. Great vibe and service in the restaurants.In short I am addicted to Benitos Hat.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zsEWEJ5sP0Cl4mMcEOPc8A": {
    "date": "10/26/2010",
    "text": "Just went for lunch after a bad meeting so needed a luncheon pick-me-up. We fought through the rain and wind to the door of Benito's Hat. We arrived to a welcoming collection of chicas del Mexicana bopping and chatting over some dance music. It felt very fiesta like. The music level was reduced as we were guided through the choices of their superb Fresh Mex style cuisine. The soup sounded authéntico but it's hard not to grab a steak/pork/chicken/veg burrito when they look so good. The friendly service, good vibe and excellent fresh wholesome food makes Benito's Hat a great filling lunch choice. There is complimentary water jugs too if you over-spice your taco so you can extinguish the burn. The venue also makes a quick evening meal to be accompanied with some fine cervezas del Mexico. Señor Benito. I doff my Hat to you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8YSemTUrvD5h17ddJofFA"
  },
  "dXWDBgstRkE56m7j--ycyA": {
    "date": "5/7/2010",
    "text": "Meh...that's what I say...meh. Where is the spiciness?  And the atmosphere?  And the tasty pico de gallo?I ordered the chicken burrito - three people working behind the counter took over 10 minutes to serve me.  Not sure what they were doing.  The chicken tasted like something I overcooked at home sans spices and cut into larger than bite size pieces, making consumption inordinately difficult.  Black beans were more like black goo (no beans).  Pico de gallo was just tomato - no glorious, limey, cilantro infused goodness.  Rice = butter + not much else.  The tortilla was average, a bit tough, and not thin enough to sufficiently serve as a wrap.I then quietly enjoyed my burrito, wishing I was back in the buzzy-ness of the mission instead of listening to piped in tunes in a place resembling an Italian restaurant.Made me wish I went next door to watch the Spurs instead...",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4s5hZXip1X19eLWsKt79A"
  },
  "Tl_1ZLQ5cUWRqZHL5Nv2TQ": {
    "date": "1/7/2016",
    "text": "I'm not sure how BH has gone under my radar for so long, I knew it was a thing but I was always a bit loyal to another wrapper. Having wandered around after some shopping, I finally gave it a go and while it's a bit different than some of the other shops, it's pretty good. The choices are largely the same but the staff seem a bit more purposefully outgoing which can either be fun or if you're hangry, just a hurdle you have to cross to get to eating. Either way, if you've not tried them yet, stop in, it's certainly worth putting on your burrito leaderboard rankings.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "IgFOBchOZPS_PVpxz7OO5w": {
    "date": "6/12/2015",
    "text": "Can't beat it, for twice the price! Wahaca sucked in comparison. Friendly staff and great food, quite authentic! I had just about given up on mexican in London, but a few trips to Benito's has improved my mood substantially. 5-7 is happy hour, 2 for 1!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B2ZIwwYEM7uShbLcSbTm6g",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Naked style",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B2ZIwwYEM7uShbLcSbTm6g/o.jpg"
      }
    ],
    "user_id": "xc1s5KzPbbwS7PKspzAbJw"
  },
  "CukTX0yjq635Dy-YumL2dQ": {
    "date": "11/3/2012",
    "text": "The servers were super friendly and upsold us some 2 4 1 margaritas which were yummy.I have the braised lamb burrito and other half had the steak burrito. I asked for hot sauce, jalapenos, and guac on my burrito. The heat was mild and the flavours of the lamb were nice. Both the steak and lamb burrito were nice, but I felt that there wasn't enough seasoning on the meat to really make the burrito stand out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrGFc2IUccf2sKcvLc78LA"
  },
  "ZYFd56X6I-Wa-fBrfJeQ7g": {
    "date": "10/9/2014",
    "text": "I went into Benito's Hat in a hangry state thinking \"just another burrito chain\" to get a fix. Then my burrito slapped me across the taste buds and said, \"SIT DOWN, SON!\"Wait- what just happened?+One: I got a shit-tonne of fillings in my burrito. I get quite pissy when burrito places barely put any rice and beans. Imagine my delight here. I got TWO types of beans (real f'n refried beans), a healthy dose of rice and sauteed (not grilled-to-hell) FLAVOURFUL veggies. I was told guacamole was free on veggie burritos; add salsa, and a nice lightly spicy sauce... I had a stuffed-to-the-gills* burrito baby looking at me.+ Two: TORTILLA CHIPS! THEY COME WITH THE BURRITO! I was so pleased to see this! I love soft tortilla intermissions with crunchy chips. Best idea ever.+Three: WTF- the service? AMAZING. Sorry London, but your customer service is atrocious. Every person at Benito's Hat (Goodge St) working the line, the till, the bussers- smiling and making sure you're having a lovely time. Such a nice vibe.Others: I was genuinely shocked how good my first bite was. The are many hot sauces to choose from. There are evening Mexican sharing platters. Happy hour is 5-7.Benito's Hat KNOWS there are many burrito bars, but they make the effort to do it better and it pays off big time. As the person at the next table said, \"I love this place. It's unpretentious.\" And I would say, I'm going to be having a lot of Benito Burrito Babies!*I have been looking for fatty burritos since \"those guys\" now only have little baby-baby fillings. Please. I'm hungry, dudes!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "HCBj7FGTEl28ZKek9BMNRg": {
    "date": "8/18/2014",
    "text": "Great burritos (for uk standards)... easy and take away style. I recommend this place for a lunch bite, a lot better then some of the burrito stand options in London (example: Tortilla). The meat has great flavor. The only negative is that they are stingy with the cheese and they charge you extra for extra salsa!!! I never get beans so why can't they be nice and give me what I want! more cheese, it was a very light dusting of cheese! what is that! I can't even see the cheese they sprinkled on, it was that light! in the UK they just stuff burritos full of the cheap fillings (i.e. lettuce and rice) and skimp on the good stuff! meat and cheese! I also don't see why pork and chicken are cheaper the beef?I miss California where we have free all you can eat salsa bars with chips in our taco shops!!! its only salsa! these people need to calm down and stop being greedy! I hate places that nickel and dime their customers. Its the UK, there is no freebies in this country!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NgKm99u4c7MH53EVCZhCtQ"
  },
  "pRcGCtO8wZiIA8Lk4Rss-g": {
    "date": "2/5/2014",
    "text": "As being from SoCal, Mexican food is my thaaang. This was very good, basically like a mom and pop Chipotle, but more intimate and relaxing vibe. The food was great, the chips were outstanding, and the service exceptional! If you're looking for some true Mexican food in London, hit this place up!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkK1ECh1ANwxs6RrJk6kSA"
  },
  "UkybIDWEP_ywbe2lBL2A2g": {
    "date": "9/22/2011",
    "text": "I'd like to preface this review by stating that I'm from the SF Bay Area, so you may detect a bit of CA. snobbery here. :SLet's start with the best things about this place: the horchata was super tasty, and the puerco was succulent and flavorful.The bad bits: two tacos are in the neighborhood of 4.40.  You can't have just one if you're not that hungry.  However, you can stuff yourself with three, if you're so inclined.  I wouldn't normally call the above info. 'bad bits' save for the fact that the amount of pork for each taco was about a tablespoon's worth.  I thought that the three toppings per taco would round out the plate somewhat, but the amounts of lettuce and tomato added were equally anemic.  I think that I was so underwhelmed by the building of the taco that I didn't see that the dude helping me had used flour tortillas.  Flour tortillas for tacos=muy malo.  To further obscure my view of the food, corn chips were sprinkled over the open-faced tacos, so, only by the time I'd sat down, had I realized what I'd been given.  Nowhere on the menu does it state--please correct me if I'm wrong--that there's a choice of either corn or flour tortillas.  The dude helping me certainly didn't ask what I wanted.  I certainly didn't ask for something that I didn't think was on the menu.  Well, not again, as I'd already asked if they'd serve me only one taco, and that was met with a resounding 'no' from two different employees.  My lunch date wasn't keen on tacos with flour tortillas or otherwise, and went up to the counter after me to order a pretty righteous burrito with both pork and veggies.  While ordering, she found out that BH did indeed carry corn tortillas.After I'd eaten, I went in to substantiate her claim.  The guy behind the counter said, yes, they have corn tortillas, and that I should have asked for them if I'd wanted them.  Hmmmmm.  Shouldn't they be offering them?  Who knows?  Apparently, if corn tortillas aren't asked for, then the default tortilla used for tacos is flour.  Other points: the guac tasted of refrigerator, or something, however, it looked like it would taste really good.  We found out that they don't use citrus in their recipe, and that they use spring onions instead of red onions, so, perhaps, that could also account for the flavor differences between BH guac and guac from back home.  Also, in terms of spice, their 'medium' salsa would be considered 'mild' in CA.The moral of this rather tired story is: ask for what you want even if you think that the answer will be 'no'. :)",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "CPR7gdg-UXNDwTVv0HQcgA"
  },
  "AhbGF7bI6vl4WcME7p4h6A": {
    "date": "10/17/2013",
    "text": "It's a burrito place. It's in London. Like all the other burrito places you choose a filling. You choose black or refried beans. You pay for it, then you eat it. It's like Subway, but for burritos. (To be fair they also have tacos, or if you want to try to be healthy, a salad, which is a burrito without the rice. However once you cover it with cheese, sour cream and guacamole, it's probably not really healthy at all.)It's a pretty common business strategy. You can find the same thing under different names anywhere you go in London these days. And it's perfectly reasonable. It's not amazing. It's not terrible. It's average. But it's quick so if you want a bit of lunch it's not a bad place to go.They do get a slight bonus for having horchata. So far it's one of two places I've been in London that have it. They also have several levels of hot salsa you can add. The hottest one is pretty spicy. So that's a bonus as well, as I like it spicy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "ng5CWCnwhwtJssrKa502XA": {
    "date": "4/6/2015",
    "text": "So delicious! The baby burrito is perfect! Having it with a Mexican beer or just a freshly squeezed orange juice. Just perfect. Would recommend to anyone!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NHQwJFzPuKD9rKA6ANjQA"
  },
  "Ryjrnzpi8O9m2tUP-bc0rA": {
    "date": "7/23/2016",
    "text": "Good margaritas, the taco platter for two was amazing, but the extra tortillas were charged extra. The original margaritas were the best of the lot, highly recommended. The waitstaff was friendly, not many working though so we had to wait a bit and the orders were repeated a few times. Good Taco Tuesday place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGfX7bHRk-g26KYedrVF2g"
  },
  "wEUFhtftAIfl3BAA9Ia0AQ": {
    "date": "10/4/2014",
    "text": "I'd like to start this off by saying the girls working at Benito's Hat were super nice and helpful. That and the lime water earn two points. My burrito didn't taste remotely like Mexican food and made me feel a little queasy. I finished it because I'm a broke student...Anyways, I consider myself somewhat of a burrito connoisseur, having come from a place in California with a taqueria on every block. I was sorely disappointed by Benito's Hat and will have to find somewhere else to quench my burrito cravings.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4eDMRCuJhSb8oQT3V4N0A"
  },
  "BvYhlkEw1ildJ_XAS505OA": {
    "date": "9/27/2010",
    "text": "I already know the word about Mexican food in London, basically don't eat it here because its not their speciality here. But I'm open to trying new things in a new town, so why the hell not?Judging by the line out of the door during lunch hour, I presumed it was a hot spot if people are willing to line up out the door right? Well no, it's just a huge commercial hype. I thought well it looks just like a Chipotle chain in disguise, it's probably just fresh-mex so I'm not expecting close to authentic at this point from the looks of the restaurant's exterior. I ordered the steak burrito with black beans, lettuce, cheese, pico de gallo, onions, cilantro and salsa verde. Sounds like a basic enough combo right? Their ingredients were way under par and was very unflavorful (which isn't even a word!) Nothing special and I regretted paying £6 for such a weak burrito. Tried to imagine that hey this place is good enough for Mexican food in London, at least....but that image soon disappeared when I realized that even Chipotle is better than this place. I'll pass.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4TJF62R5ytolOmiMWKtjGA"
  },
  "opchOMtxDLXJ4JuL2QNoPw": {
    "date": "4/24/2015",
    "text": "Great Mexican food that tastes authentic for very affordable prices!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "llNrjwXhOiGURvJKLYvdpQ"
  },
  "tfoldgTeqctLL_9UgahtpQ": {
    "date": "10/28/2012",
    "text": "I actually didnt mind this place...unlike my other cali expats.  I guess the thing is, I'm over expecting a) good service and b) food that REALLY is mexican.This is another Chipotle/Tortilla copycat, with some different hot sauces. I ordered a \"salad\" which was actually a \"naked burrito\" for those who know Chipotle well, which was kind of a bummer bc i wanted it to be healthy and was staying away from Carbs...but oh well.. she tried to discourage me from getting the grilled chicken bc the braised chicken is so much tastier but fattier and of course i went for the healthier option, which im actually happy about.  Their hot sauce, though not super mexican tasting, was super spicy.  and this is coming from an indian girl used to a high degree of spice! Hubby had the burrito with braised chicken and he was quite happy with his purchase.  The boy literally scarfed it down in 2 mins!  im all about happy hour so next time i do come in, i will need to take advantage of the two for one drinks.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "m-i-5Irnc_B92rwQtZIPyQ": {
    "date": "4/12/2015",
    "text": "Cheaper and with far more filling than some other chain burrito places. Plus happy hour!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0BZhOPNe76MvHuy5Q2K53g"
  },
  "QwSbuwTu6Vvaw66zHKf0_w": {
    "date": "7/28/2015",
    "text": "While craving Mexican in central London, I came across the yelp reviews for Benito's Hat and gave it a go.  For London, it was alright Mexican.  But in California, they would quickly go under.  The food was generally not too flavorful and the salsa was fairly bland.  That said, not sure that it would get any better anywhere else in London anyway.  Service was friendly, fast, and attentive - definitely kudos for that!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dV4QVGzX3MzzK57hJGuBNg"
  },
  "mwB_7tSss6kU1cS3B_NWQw": {
    "date": "9/30/2011",
    "text": "yucktastic. I'm a snob of many things and 1 thing in particular is mexican food. Being from Southern California is like living in Little Mexico so yo conosco mi comida mexicana. Arriba ARRIBA AY AY AY! Sorry, i got away from myself a bit. Back to the food. I went there with fellow yelper Bea B. for a chance to taste home. What we got was some whack food. Bea went up to grab some tacos while i held down the fort out front (patio seating= 1 star). She comes back with tiny tacos with nothing on them barely and not happy that they didn't have corn tortillas for tacos. So went I went in I looked on the board and saw no mention of tortillas flour or otherwise. So i asked the guy if they had some corn tortillas and he said ONLY for tacos. And i thought that was weird because why would they give Bea flour. Bizarre. Anyway, I ordered a burrito because the tacos were too complicated. I Ordered the pork burrito with everything, even asking for extra vegetables that I saw lingering around. I didn't like that they automatically put rice in my burrito but whatevers, I can be flexible. I had a side of chips that were not stale at all, I actually liked them a ton and since the chips were good I grabbed a side of what I thought was quac. It was made of avocados but it was NOT guacamole. I actually got the waiter to give me the recipe and it was lacking in the acidity of lemon and the heat of jalapeño's. No thanks. I really tried to eat it. But i just couldn't. It was really gross. But the burrito was decent and rolled nicely and the Horchata was ok. As much as I really liked the outdoor patio and the service I don't think I will ever go to this place again.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "_8D4ZK9PvjQiAGKniqhCNA": {
    "date": "2/21/2015",
    "text": "Visited Benito's Hat on a Saturday evening and got a table for one person. You have to order at the till, where a friendly guy helped me selecting the carious indegrients, sauces and toppings for my food. After that was done, I selected a nice Mexican beer together with the lunch. The food was very good and tasty, the personnel was helpful and friendly, the overall atmosphere was nice and welcoming...definitely not my last visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5blcfWO_SQFB9At_ulBXA"
  },
  "kAQP2jQIa7YN0sqY84WKIw": {
    "date": "1/15/2012",
    "text": "Fantastic for takeaway!  Cheap, huge portions, don't have to wait long, friendly staff, and the food is still wonderful!  Yes... I'm American, yes I'm from San Diego (among other places)... is it authentic?  Meh, but for London it is pretty good compared to a lot of other places out there and for fast Mexican food, it is my choice.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIjIJxRZs5cCjwW9iJFzMg"
  },
  "ZhFiTbN0-A2JuAdlSN5IeA": {
    "date": "11/6/2011",
    "text": "As an American and a huge fan of Chipotle, I wasn;t expecting much going into Benito's Hat, but their burrito's are really well made and very flavorful. It's the Chipotle set up so you can construct your burrito as you like it.It's a good cheap lunch in London and I am a fan!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mZIfa9lbXUJBndotCJkbyQ"
  },
  "m-bBNJ6_h7CnVXrr_IfIow": {
    "date": "4/5/2018",
    "text": "Excellent food. The staff was very friendly and polite. You  an buy Guacamole for 1£ and it's marvellous!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ArR7_WPQHKsGUjeAGFcypQ"
  },
  "l0fZKwOqALH7z91Bb-1kxw": {
    "date": "1/6/2018",
    "text": "Got the grilled chicken burrito...This place is similar to the American chain Chipotle+ ingredients looked and tasted fresh+ lots of seating space ( comfy cushions in the back)+ their nacho grande option looked rly good and the grilled chicken burrito was ok+ cute neon signs !!+ friendly fast service- small portions, the regular burrito will not fill you up so get a side especially if you eat a lot - I got medium spicy but my burrito wasn't spicy or that flavorful..pretty bland(They do have fruit salsa that you can add but I prefer spicy that isn't sweet)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "01swAxMENqYIIAvkklHMOA",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/01swAxMENqYIIAvkklHMOA/o.jpg"
      }
    ],
    "user_id": "m2BgOdYMhcHbH1UFFLLtIw"
  },
  "h4-wjr-wkRzohC6SgTBd5w": {
    "date": "5/18/2018",
    "text": "They're okay. I'm from the states and am accustomed to Chipotle and Moes, Chipotle being my fave. They're no chipotle.. but they're cheap and okay. I got grilled chicken burrito with pinto beans and all the additives(cheese, sour cream, and guacamole). It's super convenient, and fills you up.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hrwk8NjcE5GT0S-b5KOHEA"
  },
  "ksw7Npp76KTXfHExhSzHcQ": {
    "date": "7/8/2016",
    "text": "Meh I wasn't impressed with the taste. They ran out of steak during dinner, so I opted for the two types of chicken. They were happy to give me half and half. They're also very generous with the portion, so you'll get a lot of bang for your buck. What to expect: You can order a burrito, burrito bowl, or naked bowl (which is a burrito bowl with extra lettuce). Choose your rice, beans, grilled veggies, and other toppings such as lettuce, salsa, and they even throw in guac. The restaurant is casual, so you can grab a quick meal by dining in or you can easily take away as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5bvLVfTgNqweAW-0s-jMzg",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Burrito bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5bvLVfTgNqweAW-0s-jMzg/o.jpg"
      }
    ],
    "user_id": "RXF7dEiuzqjHwIlOSNBm0Q"
  },
  "UGepR6r2HP1yqpF1ZgQHMw": {
    "date": "4/13/2018",
    "text": "Very soft 3. More like 2.9 stars and rounded up. The portion I got was very small, the barbacoa wasn't warm and tasted like it had been sitting out for a while. The food could have been more tasty if it was heated up. Considering it had solid reviews, I was surprised at the lack of quality I received. I left feeling satisfied (not full) but my immediate impression was \"that was very average.\" Not sure if I went on an off night but I was definitely disappointed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DZagt8CEUlOwThry6-OlVA"
  },
  "j3aldF00Qcs0HVbnWdc5pQ": {
    "date": "1/6/2018",
    "text": "I had the grande nachos with chicken. The nachos were pretty flavorful and the ingredients tasted fresh. They even gave free guacamole on top! Yum. The portion size was decent, but large eaters might not be full. Overall, I just thought it was okay. I think Chipotle has better flavors. It's close to UCL so students might enjoy grabbing something fast to eat for lunch or dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEEE3Rfw_RwUir5ncbb_5w"
  },
  "1PYcIIkKwPezm6rkaAmmzg": {
    "date": "4/9/2018",
    "text": "I thought the portions were extremely small and over priced. I went to the restaurant given the high yelp rating and was surprised how bad the food was. If a chipotle is within 1 mile I would highly recommend not going here.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-TdPeADxmmQDL5E0jIyyRw"
  },
  "c0D44nf3lo9P6H2Y39Tk6A": {
    "date": "4/4/2018",
    "text": "Very good simple but great tasting food - you can customise your own burrito or tacos but there is not that much selection to chose from when it comes to toppings. The staff are nice, the atmosphere is great inside the restaurant and it is quite comfortable to eat at. Honestly at first, I didn't think the place would be that great but the fresh food and great tasting simple items on the menu (there are only tacos and burritos) make it a very good choice for a quick meal or a night out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJ_8jJNeYWaAvUGtCgzGRA"
  },
  "k_GtkH1dA0BwjAW3HTA1LQ": {
    "date": "8/14/2017",
    "text": "We ate here 2 tonight's. It was our kids favorite place to eat.  Since our spoiled wMexican food from California, I would say this place is not authentic but real authentic but yet real good food. LOVED IT!!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_8BoxSS98q6IthaYrWZKsw"
  },
  "QqRe96cFzBfsYbZffziB8Q": {
    "date": "8/1/2016",
    "text": "Very good burritos from a Chipotle / Dos Toros-like place in London. Good food at very good prices (especially given how expensive everything in London tends to be), this is a particularly satisfying lunch option in a city with many good ones.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z9-hWCqhn7RJ3QKD4WFKtg",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z9-hWCqhn7RJ3QKD4WFKtg/o.jpg"
      },
      {
        "img_id": "Fhh-igKq6ELdQz0qfJycmQ",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fhh-igKq6ELdQz0qfJycmQ/o.jpg"
      },
      {
        "img_id": "dXULaMJuDL5v1l4-6qIKuA",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Outside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dXULaMJuDL5v1l4-6qIKuA/o.jpg"
      }
    ],
    "user_id": "ufco-sxD9Org0AMxagNgQw"
  },
  "jTQNfn1t57pFpjvgTa4xsA": {
    "date": "11/17/2015",
    "text": "It took a lot of will power to try a new place and not simply go to Chipotle nearby, but what a great decision it was! This place is fantastic! It's slightly cheaper than chipotle, but tastes just as good and seems to have even more generous portions. It's especially a great value since they give you free chips! And guac is only 80p more. AND everyday 5-7 there are 2 for 1 drinks for happy hour! The chicken salad bowl was delicious, with huge portions and delicious and fresh ingredients. I would rate this very similarly to chipotle, but it gets an extra star for great value, better experience, larger portions, cheaper guac, and free chips!You really can't go wrong here, I can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q1xLpZwoXRoNKmmPPmkmUw",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Chicken bowl w/ everything + guac!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q1xLpZwoXRoNKmmPPmkmUw/o.jpg"
      },
      {
        "img_id": "t5PS706fjYUTo5ihV-3xZA",
        "caption": "Photo of Benito's Hat - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t5PS706fjYUTo5ihV-3xZA/o.jpg"
      }
    ],
    "user_id": "HlvolKtO9f29ViF1n5-T8A"
  },
  "jRH-Rt3vM9SGq-LiZ8Jheg": {
    "date": "8/27/2015",
    "text": "This place used to be a poor mans chilangos for me.. Like good but not quite on par..but then the summer special came and oh wow what can I say. The spicy shrimp with the sautéed peppers and spicy mayo. It's ridiculously good. As a pescetarian, this is literally my dream burrito, if you're in London over the summer definitely check it out.I'm yet to try, but they have a happy hour with 2-4-1 on cocktails in the evening after work and margaritas look pretty damn good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9GK83UCILsxpgFEus85UbQ",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Spicy shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9GK83UCILsxpgFEus85UbQ/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "cf0xVNHtuEgI3Twf17kzhg": {
    "date": "7/19/2016",
    "text": "A great spot in a city that isn't famous for its Mexican. This place has done an excellent job, inexpensive burritos make it a perfect hub for he UCL students nearby and a great getaway from the crowded main road. Simple but great. Fun, interested staff. Great restaurant atmosphere. Can't wait to go again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EH3NT883vZQwr8O_C7eW1g"
  },
  "0s2j2o01u7n1shucQ9lSEQ": {
    "date": "8/28/2016",
    "text": "Good burrito Nice staff, maybe not as good as Chipotle, but possibly cleaner and slightly cheaper. The decor is alright. Haven't tried their drink but looked like an interesting list.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "isvG7Z6GUB-zKPL72usBnw"
  },
  "s8LC418R1MnLcgX4j71Hsw": {
    "date": "4/9/2016",
    "text": "Mexican food in the UK seems to be a bit hit and miss,  and in the game of burritos you either win or you ... die. I died at Benito's hat. First, the good. You get a bespoke burrito rolled for you with your choice in everything. Beans. Rice. Meat. Sauce. Vegetables. Guacamole is extra. It's a cute place. Staff are fast.  I also tried the classic magararita, which was delicious. Burritos come with a fistful of tortilla chips. The burrito itself was insipid. I was expecting some flavour from the slow cooked saucy beef or the beans, or the buttery feedback from the guac. It just flatlined. I could taste the rice, and I wound up with a mouthful of the hot sauce at the bottom. It was hot to be sure but there was no nuance in the sauce. Utterly forgettable.Your mileage may vary but there are so many options in the area, I think I'll dine elsewhere.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXCzCbYX8sSf301Y0fcJ-Q"
  },
  "gpmAXcWo8JZbxcxCZPwS1Q": {
    "date": "11/28/2014",
    "text": "I seem to write about Burrito places a lot. I think I choose them over other types of sustenance  because they seem healthy for fast food, and I enjoy quoting one of my favourite lines in Anchorman over and over again.\"This burrito is delicious but it is filling!\"I stumbled upon Benito's Hat by chance whilst doing a job in the area. I was on crutches at the time and the chap behind the counter took my order and asked me to take my seat and they'd bring it over.My burrito was stuffed to bursting with double meat, delicious rice, pinto beans, cheese, soured cream... all sorts!When the basket arrived at my table, there were nachos keeping my burrito company, a nice touch.It was all washed down with a refreshing can of Ting. An unusual choice for a Mexican I thought, but it was delicious!I'll be working in the area about 4 times a year, I'll definitely be visiting Benito's Hat again!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8hEdB2x2vluzF12tfBWqLg",
        "caption": "Photo of Benito's Hat - London, United Kingdom. So much girth!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8hEdB2x2vluzF12tfBWqLg/o.jpg"
      },
      {
        "img_id": "186StMxgNkzfnnb-hBlqqA",
        "caption": "Photo of Benito's Hat - London, United Kingdom. Glad we avoided this queue!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/186StMxgNkzfnnb-hBlqqA/o.jpg"
      }
    ],
    "user_id": "eoeLf2_93YxLGk4PRU2Dfw"
  },
  "ULUTr_HcURS1BdpMKALPFg": {
    "date": "9/29/2016",
    "text": "Not a terrible option if you're either taking away or need something fast. I wouldn't say that it's authentic Mexican, but good enough for London. I had a chicken burrito that was rather big, but still tasty. Their medium salsa wasn't spicy at all. Go for hot!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Z2VkPJpOcBdSbxGKRY8Nw"
  },
  "PGBVwC6BCArS1KSp1eDj3w": {
    "date": "9/15/2016",
    "text": "That was alright, a good burrito but comparing it to Mission Burrito in Birmingham. It doesn't compare. The wrap was cold when it should be heated slightly. And though the beef brisket was good, it doesn't compare to the chilli beef of MB",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kJfRL9ujljnJxCNZ4ve4og"
  },
  "V0LGVcdtZN9UYV4rn-VzGw": {
    "date": "7/11/2016",
    "text": "It may be that I'm not really qualified to comment on this. I've never had a burrito anywhere else (other than Wetherspoons, which doesn't really count), so I've nothing to compare it to. But my wife, who is American, says the quality is perfectly respectable, although not quite up to the standards of the burritos she was used to in New York. All I can say is that the Benito's Hat vegetable burrito is tasty, and we've been coming back repeatedly to the Goodge Street branch since our first visit, which must be about five years ago.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "inoFtjcSIINDFByDM3wBOw"
  },
  "naUBnL5OkiW0zCFO9srTZA": {
    "date": "6/26/2016",
    "text": "I have never had such A disgusting naked burrito in my entire life. The beans tasted weird, the meat too dry, the guacomole tasteless and since It Was take away, the lady pourred my chips in the bag And couldnt Even bother to give me a proper box. For 8£ it wasn't worth it while It cost 5£ At Tortilla and it tastes way better. I am never Going back",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1n8EL8Fl88ltjuSUvSVpDQ"
  },
  "gT6YE69917oqa1apvKRXtg": {
    "date": "4/23/2009",
    "text": "Heard about Benito's Hat the other day and dragged 2 friends after a gruelling session at the gym. I was expecting more of a restaurant rather than a fast-food type place but boy were the burrito's good. Stuffed full of flavour. We were served by two rather fine specimens of eye-candy which helped, especially as we couldn't really understand their questions regarding filling, which we just blagged. We sat inside which was quite cramped but food was great. Not a place to aim for for proper gathering but if on the run or needing a quick fix throughly recommended",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hmeOGer5S98QgBwZJpNOOg": {
    "date": "10/16/2008",
    "text": "Benito's Hat is great for a healthy fast food fix. You design your own burrito so you can pile on as many toppings as you want. You may feel like you cannot eat another thing after this but make sure you leave room for dessert - the buenlos with icecream are divine.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xlv84pG5Hzd2LBxORRKPMg": {
    "date": "3/13/2009",
    "text": "Benito's Hat. Benito's Hat. Benito's Hat. Is incredible. On a street that seems to have an abundance of Mediterranean and Mexican eateries. This one stands out, originally because of it's silly name and then very quickly because of the Burritos. It's no real looker, there's no atmosphere worth the mention but the fact that the place doesn't have that and still receives 4 stars? It's because they mean business. With almost clinical precision the staff can build a burrito the size of your head and they'll still throw some nachos on the side. Choose from a selection of contents like a variety of meat and an array of salad it's a little like a Mex Subway without the unlimited refills and the faint stink of health propaganda. The lack of bottomless soft drinks is nothing to worry about either, no, for unlike subway this groundbreaker of an establishment serves bottled beer! Including Negra Modelo! Seriously there's no better compliment to a Burrito than a nice cold Modelo, except, perhaps, Benito's very own hat - - Not on the menu as of yet.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Tt3QLvseurEua21766WM-Q": {
    "date": "10/20/2008",
    "text": "Love this place for the occaisonal decadent lunch (like I had just a few minutes ago). Its a close to a real mexican burrito as I have found in the UK. Go for the extra spicy sauce and the guacamole go on, you only live once.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GTHtCfDF33ANT1qSZ5qhLA": {
    "date": "3/2/2009",
    "text": "I can manage a chicken buritto, a beef buritto, tortilla chips and a coke, then i need a lay down. The food is soooo good though and really fresh",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1U0c5pcl3bQrFfdpIR-miw": {
    "date": "1/12/2011",
    "text": "tasty and quick service, considering the queue is so long. BUT i will not go there anymore due to the recent price rise (dec 2010). a standard burrito with chicken and guacamole = £6.80 takeaway. its just a burrito for heavens sake. rip off sorry",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DfL5epdTmg9iQnz2fLl4zw": {
    "date": "9/12/2010",
    "text": "Excellent Mexican food and among the best values in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EH8_0qwMry46Nr1Al2quiw"
  },
  "hzDzLSyXnhgYpzUYW3OWOg": {
    "date": "11/7/2010",
    "text": "It's gone downhill...have been eating here for a while but it seems they are getting into \"we don't have to try because we know we'll be busy territory. Siting in there as I write this. Service was rude, staff trying to multitask badly. Which means repeating your order 3 times because of \"what was it again\". And the music too loud for the staff's entertainment. Food goes cold while they mess about. And the quality has fallen...a lot. My veggie burrito was lukewarm, soggy and tasteless. Won't be coming back. Tortilla at Oxford circus is so much better.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OZOd45-oPDdC3MuTbUYSvg"
  },
  "dPmkLk_eNv3MGfe344Qrpw": {
    "date": "5/30/2010",
    "text": "Top burrito! Ok so I'm biased because I absolutely love Mexican food. But really, the food is fast, and very tasty, a few tables outside for the nice weather. I'd recommend this happily.  They definitely serve beer because I had a Corona with my Burrito.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9WTxkWfux0RBoiyOe7LpA"
  },
  "MYNEP7o7zHLnMG-OA6RZAw": {
    "date": "7/28/2010",
    "text": "Such a brilliant place to pick up a quick bite in town. Amazing staff and massively filling portions. Cheap and muy cheerful. My only regret was not going for one of the incredible looking mojitos. Although I did mange to get by with the great choice of 2 different mexican beers.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ioud7qRz4raOY4mmHpmPEQ"
  },
  "z-mH2tQE2vtHy7693KaImg": {
    "date": "2/10/2010",
    "text": "Awesome burrito, really made by the quality of meat. Try the slow-cooked pork for a real treat.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tk-RVnbbtqUoSLGobwEcsg": {
    "date": "4/21/2012",
    "text": "my friend recommended this place and i just got about trying it. absolutely delicious and huge burrito! i ordered the chipotle chicken, and the serving was so generous. the rice and beans, together with the multiple sauces and vegetables, make one hell of a burrito. would definitely be going back!! i am craving it right now.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OkuBVOPjLCKNRNDpdbih9A": {
    "date": "4/15/2009",
    "text": "Admittedly, I've been an uber-lazy Qyper lately. But man-o-man, Benito's Hat definitely required some reviewing goodness. Perhaps I've never properly expressed my extreme love for some fine Mexican (food), but Benito's makes one mighty burrito and I've been dreaming about it since our first encounter. I can't believe I haven't been there earlier - I supposed that timing is everything in such relationships. Benito's -- I heart you!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGVBPSUx7tS45QzalFwIaQ"
  },
  "Vf72rKa4RnE5TtatYxnbyA": {
    "date": "1/28/2010",
    "text": "10 words. Always get burrito. Never stray. Chicken and Beef combo. Wolfpack.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yUjZtSgj5GofAUe0eGTZeQ"
  },
  "5pyLW495pfR0oCOslyzmPw": {
    "date": "12/8/2009",
    "text": "After hearing so many great things about Bonito's Hat, I decided to book a table for my wife's birthday. We both loved every minute there, made such a refreshing change from the usual dull restaurants we usually visit. Mouth-watering. A dazzling experience!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gf7GD9ym40BENdm7fbkbyg": {
    "date": "10/15/2009",
    "text": "Tried Benito's hat for the first time last week - all looked great,food area all on show and enticing - but my burrito stuffed full of chicken,cheese,salsa etc; did not seem to have any taste! I see that one of the other reviews below seems to have felt the same - its strange as i was expecting it to be bursting full of flavour..but it wasn't.I do think the place is great,laid back and worth a visit for a quick bite to eat with a beer,and will def try it again.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3hzkdUAUZ1NpDrMjyKt_tA": {
    "date": "6/17/2009",
    "text": "A chance look at its review in Metro led me to Benitos Hat and I am eternally indebted to the daily paper now. Benitos is quite simple a little heaven! The ambience is warm, the drinks are great and the food is quite frankly-out of this world fantastic!! Fresh ingredients, smiling faces and penny prices make me visit it every week.just want to say a big thank you to the owners and ask them- when and where are you opening your next branch??",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nckhYpzFfgcnbkpXHv2KGQ": {
    "date": "8/13/2008",
    "text": "I was very impressed with the boys at Benitos' Hat. Often eating mexican in London I have found the food can be too greasy and it doesn't really fill the void. However, I think the food is that bit fresher at Benito's which leaves you feeling satisfied after hammering down a well-earned burrito. Think it is a good place for a few quiet ones after a long day at the office as well.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "X6OVDSworIjNrd-lyXQuug": {
    "date": "10/2/2008",
    "text": "i love this place. Food is delicious - burritos done the right way. Proper steak or chicken, guac, veg and firey salsas. Perfect for a quick bite and a drink. Atmosphere v cool",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qtXQllcU7AbVYtN9_4EnUw": {
    "date": "8/27/2008",
    "text": "omg!!!!! just went to get my first takeaway meal from Benito's Hat and it is awesome!I got the tacos with spicy chicken,sour cream, guacomole,tomato and onion salsa and a spicy chilli sauce.My first bite was an explosion of mexican flavours that will linger on for the rest of the day and until i get my next dose",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "olDuhfd_f3H1nRFbPPz7kw": {
    "date": "12/23/2009",
    "text": "I have no idea why this place is always packed. I also had no idea what was going on and how exactly you pick and mix fillings. Luckily I was with some people who had been before so just copied one guy who looked like he was making a good choice with a vege burrito.Probably best not to watch while they slap the various fillings in behind the counter. It's ridiculously messy but I'm not going to complain dubious levels of hygiene as I willingly eat in nastier places.Pay. Find a Seat. Unwrap foil. Spend 3 minutes trying to figure out how to eat this sucker. Being a lady, I decided to go for a knife and fork. Bad choice but it was done. It was a horrible mix of hot and cold and so very tasteless. Ok, I know it was just grilled veg but you'd think with all the other crap in there, it'd actually taste like something.There's no reason I'd ever go back here. The only reason I'm giving it 2 stars instead of one is because I expect the meat ones taste slightly better.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hrH9EUwv7oSBUEMJOwTVNQ"
  },
  "t-0Zinz2i5VIGp-JUDQehw": {
    "date": "1/15/2009",
    "text": "I have been sitting in front of my pc for about 5 minutes and I still cant seem to come up with the right words that will do this little gem of a place justice. Dont let the wooden furniture, token cacti and large images of VW beetles put you off, as the food is unlike any mexican you have ever had. While the menu may be simple and to the point, the ingredients are fresh and better yet, the staff have a heavy hand. I personally would recommend the burrito with the works and the pork filling - the taste has a magnetic force that will lure you in again.And if the mammoth burrito is not enough for you, try their cinnamon tortilla dessert which becomes available after 6 in the evening.Enough talk - need to get there now!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NoagPOi3wJfWXz8Adf998g": {
    "date": "10/24/2008",
    "text": "I ate at Benito's Hat last Friday night, so it has taken me a week to get on and write about it, but I have only just joined Qype.Anyway, as confirmed by everyone above, the food and service are both FAB!Best of luck to all involved and us hungry folk will keep coming back :-)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vVIS6nAFlJM3CJ27oAOSHQ": {
    "date": "8/1/2010",
    "text": "Cheap and cheerful. Decor is very bright and fast-food joint-like. Had burritos with horchata and sides of nachos and guac. Burrito was good, big and filling, black beans was yummy. Guac was ok. They serve a few kinds of mexican beer, horchata and margarithas. Overall it's not bad. Service was great and food was good quality but flavour could be more oomphed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0WtY-wfWtFiuOl1go_xFA"
  },
  "IkgwS-TiKyzbY8v-bUIORw": {
    "date": "7/18/2010",
    "text": "Cheap and cheerful, filling, tasty, in a great location, veggie friendly and nice staff, can't afford to go to Mexico now so think I'll be back here if I have another mex craving",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5Ab9wADrD3cM0kEAarMoeQ": {
    "date": "9/10/2008",
    "text": "After just discovering this place yesterday, I was incredibly pleased with my lunch there. The soft tacos with steak and guacamole were amazing and I thought the nachos were some of the best I've had since leaving the Southern US (a much better location for Mexican food). Overall, I thought that for a 6 pound mexican meal in Central London, it might be the best option. I still prefer Wahacca in Covent Garden for a proper Mexican dinner, but for lunch, this place is an amazing option.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4ptzIFuXtJ41Ha0FMqUvog": {
    "date": "9/23/2009",
    "text": "Having just come back from a business trip San Francisco this is probably the closest I'll get to the monster burrito's served up in Pancho Villa Taqueria and the like.  It's really that good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cRWo4VVOqVri2RFBbM7Wcg"
  },
  "dyF9w77jMMi6Vrlak1nEDQ": {
    "date": "12/18/2010",
    "text": "I've gone here a few times - any San Diegan needs her dose of Mexican food every now and then! I think overall it's a good package: filling, all the fixins, good menu. Sometimes I think to myself there's some flavor missing, but that may be just me being picky. Either way wash your meal down with an ice cold cerveza and you're set!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mb8DQlLqtvJq1Iwfay9DoQ": {
    "date": "6/14/2009",
    "text": "I've got to chime in with the other Americans dying for a good burrito.  This is where it's at!  It was a little crazy in there at lunch time, and I was confused about the process and I think that the English of the people behind the counter meant that there was some communication issues, but WHO CARES?  A lovely burrito with all the trimmings! And a really fun part of town!  Can't wait to go back!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "S1vSKO0xWt16WpA-YQCEjg"
  },
  "J-27pUcopWQ6oMKIeJ12GQ": {
    "date": "11/14/2008",
    "text": "As a bit of a Mexican food junkie, I have been thrilled by the recent proliferation of Mexican restaurants in London and have rushed to try as many as I can. For me, Benito's Hat is the best cheap and cheerful Mexican fix in the capital (for classic plated Mexican my pick would be either Mestizo or Green & Red). I have been to the Hat several times and found each of the burritos I've tried pretty incredible: mouthwateringly tender pork, flavourful chicken (I've never found it stringy) and lovely chunks of meaty steak. Delicious. The black beans are as good as any I have sampled in Mexico or the States and the salsas perfection. The salsa verde is my favourite, but the salsa brava will blow your socks off. The margaritas have that fresh zingy simplicity and kick I am looking for - some of the only ones I've found in London which are not made from a mix. The service is always warm and friendly and on the occasions when I have had to wait, the queue has moved pretty quickly. I love the music and the vibe. Need I say more? Viva la Hat!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UxTzS3Dp3DDqVxHWKaUGNw": {
    "date": "5/5/2009",
    "text": "My search for the perfect burrito in London has ended after 8 months of suffering. And it came with the perfect Horchata for only a fiver!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "mwJEd2Pp9bFfNGo1rZ9NvA"
  },
  "JkxS6DZhIw4N7ckS_1-uig": {
    "date": "2/14/2011",
    "text": "One of the best Mexican eateries in London in my opinion. You can taste that the ingredients are really fresh and that a lot of love goes into cooking the various meats available. I always go for a salad here as I cannot manage to eat a whole burrito (the portions are huge). There is usually a long queue here at lunchtime and in the evenings it is hard to get a table. The seating here is quite cramped but this is due to the popularity of the place. They could probably benefit from having larger premises. Good selection of beers too... Whenever I have a takeaway from Benito's Hat, I get lots of envious looks from my colleagues back at the office. Oh, and great Guacamale too!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "71BKx6aWjznAuNE6-IQG8w": {
    "date": "2/26/2010",
    "text": "When Danimal said he was going to go to get burittos for lunch vivid images of melted cheese and dirty rice filled my head...despite having already eaten lunch once today I had to get a taste of Benito's given everyone was buzzing about it. The size of the buritto is just right - they don't skimp on the meat either. All in all though I was not overwhelmed by the taste. This to me tasted like a healthier version of the thick, heavy, saucey burittos I am used to back in the states. Now, I am from California so I have been spoiled for many years by the home cooking of my fellow amigos de Mexico. That being said it is still the best buritto I have had to date since being in the UK. My search for the ultimate continues...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JxclaKYuH132QjN-7NLk-w": {
    "date": "12/16/2009",
    "text": "Is it a kebab? Is it a burrito?! I don't really mind cause it's only a fiver and comes wrapped in foil! I don't really need to review Benito's Hat because the huge queue down the road every lunchtime does that for me. A delicious bargin, the only downside of which being that sleep is easily induced in the afternoon.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "biPud03UhHsIgbeJOMmdCw": {
    "date": "1/27/2010",
    "text": "The sudden influx of burrito places in London has made me very happy so trying out another variation on this theme is always encouraged. It's quite simple here - you ask for a burrito, tacos or a salad and then choose a filling (beef, 2 kinds of chicken, pork or roasted veggies) and a bunch of toppings. I went with the pork along with black beans, rice, lettuce, cheese, pico de gallo, salsa verde and guacamole. This place does the most generous serving of guacamole I have ever seen! It's wrapped up in foil (I approve of this method as it makes it so much easier to eat) and then served in a basket with tortilla chips (which were nicely salted).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lNJwPtb0nosI-d7anWUmpg": {
    "date": "6/22/2012",
    "text": "Definitely NOT Mexican (the cue is in the lack of proper corn tortillas). Flavour is bland and nothing authentic in the menu. I can (and do) do better at home..",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BaxXOZiJ9RdVqQ2wK7NU7w": {
    "date": "4/3/2010",
    "text": "I came here after reading the menu online which made my mouth water and was really unimpressed. Im sure the meat tastes great but I h\\d the veggie option which consisted of really large chunks of big vegetables (not in easy to eat bits or strips) in a v bland sauce. I was sorely dissapointed. The guacamole said it had a hint of tomato, when it had massive great chunks of tomato (I HATE tomato!). I did like the free nachos and tap water, Ive been to California extensively and that was really authentic. Perhaps if the veggies were marinated in the tasty sauces of the meat (i.e highly spiced and saucy) then it wouldnt taste so bland.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wzkvjJ3p7Qk6DWC6GM6b7Q": {
    "date": "5/29/2012",
    "text": "BH's burrito are awesome! Highly recommend the pork which is amazing. They're also really nice about subbing rice for vegetables etc which I've found some places can be quite mean about!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GELkVVkKxo0jciOfOcJ38A": {
    "date": "4/14/2010",
    "text": "I really like Benito's. It's a great little place that have continued to make great inexpensive Mexican food. Always fresh, quick, and delicious. Definitely try.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BGTdxbhbXDgcs3KrW_ws_A": {
    "date": "1/30/2010",
    "text": "The burritos are so good here that my husband ate lunch AND dinner here last weekend...and I was so jealous. My favorite is a burrito with a mix of refried and black beans, rice, veggies, pico di gallo, lettuce, guacomole, onions and cilantro, and the spicy salsa. When I'm not super hungry, but want my Mexican fix, I go for 2 tacos with beans and rice and the proper toppings. Not only is the food fantastic, but the service is better than what I've received at much more expensive places. 5 stars aren't enough! Highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}