{
  "NJp0rU7NYLAewkECJOFecA": {
    "date": "1/23/2010",
    "text": "Nicely located on St Katherine's Dock with a great nice environment and friendly staff. I came here on a few occasions for an Indian meal and I must say you can never e disappointed with the food here. It's more on the pricey side but worth a visit.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "G0smuNisB-YFvAh6W8KJDg": {
    "date": "5/16/2011",
    "text": "The food is simply excellent. This restaurant is in a great location and the service is good. Can't wait to go back!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "W7Qih9yiHHFsYYzjyI-kYQ": {
    "date": "10/17/2011",
    "text": "Great quality food, good service, more expensive than many Indian restaurants, but is worth it for a more refined experience.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GWDlWpPUMH49QL1kHdo7CA": {
    "date": "3/26/2014",
    "text": "I've been to Mala several times now, and being of Indian heritage, I've got a good idea of what's good Indian food, and what isn't. With this restaurant being around the corner from where I work, it's often suggested for a lunch treat.First off, Mala is almost hidden away in a far end corner of St Katherine's Dock, but once you arrive there, the restaurant is spacious and there's more than enough room for diners not to be clashing into each other. It's rather a breath of (London) fresh air to be in a restaurant where you're not packed in like cattle.About 75% of the time I've been though, I've always noticed a little fly hovering around the table we're seated at. If that continues, I'm probably going to end up naming it.The waiters are impeccably dressed and very polite, and generally pretty decent at taking your order and fetching it. Don't expect much in the way of banter with them - it'll just confuse the poor souls.I've also witnessed a waiter accidentally knock over a glass of red wine over a member of our party (and her lovely dress), and then at the end of the meal, to have offered to only strike the Red Wine off the bill. Not cool, at all.The food itself is alright though - I usually opt for the Non Veg Thali, which is a mix of dishes. Naan bread, Lamb dishes, Chicken dish, a Potato mix and a pot of veg and what I think is meant to be Raita, but just tastes rather boring. For a mere £10, you won't be leaving hungry after all that.Do note that if you do go at lunchtime, by default they'll give you the 'cut down' version of the full menu, to guide you to just order the dishes they can get out quickly (mainly the Thalis). If you want to see their full menu, ask for it.Unlike Dishoom, the Mango Lassi at Mala is spot on - thick, flavoursome and plentiful. Though a jug will set you back about £13, which is quite the markup!So overall, Mala is a nice place to go. It's not stunning, but you won't be paying over the odds, the food is decent and though the service can be sketchy, the setting itself is nice enough.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0G-4DW_8r0Kz94JkFLj4A"
  },
  "U_OSLfvO1Nn_VT_Glw4OBw": {
    "date": "9/17/2015",
    "text": "Exceptional! I was in India in November 2015 and have since been searching for anything that remotely compared. This place did not disappoint! The food was flavorful with an expert level of spice, the service was excellent, and the view is terrific.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yo1cxwC2dW33jwBzt5wTtg"
  },
  "af-agEGRZSh3BH8OFJ_5nQ": {
    "date": "11/27/2015",
    "text": "For a mid-ranged sit down meal this is probably one of the better options around St Katherine's, at least you'll leave full without feeling you've paid over the odds and the flavours are not too bad.  The lunchtime Thali is good to taste a variety of dishes. It's not the place to go if you're looking for atmosphere but it does a job.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INVx3MKlgB_uMR4KmuYAgA"
  },
  "eU2LY8cDt2Geib9uBXLyLA": {
    "date": "3/25/2014",
    "text": "If I give Punjab Grill in Singapore five stars, Mala is a strong 3.5. Good tastes but lacking finesse. I took the set menu which consisted of maybe four dishes and some sides.Service can be a bit slow and inattentive, but nice.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ay1HtkPCsioAG9eAIQT79Q"
  },
  "BSg-pwuE8Wdb2mmlh2T6Tw": {
    "date": "5/30/2015",
    "text": "Genuinely Indian food, lamb jalfrezi was amazing. It's hard to find true Indian restaurant in central London, if you are craving for Indian food go here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjcUKJKoZiJO1re8SJzBhA"
  },
  "hguX-SbZxQ7D-LzSTnjw3g": {
    "date": "9/24/2016",
    "text": "One of the best Indian Restaurants I have ever been at. The chicken tikka masala was very delicious. The cod tandoori was also very tasty. We also got grilled onion stuffed nan bread along with the cashew rice. If your'e in London and love Indian food this is place is a must for you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWFNiIScUjKcQ5_Hs9YoHg"
  },
  "PZ83Ol-fi6iQ8AsZ7B_zxA": {
    "date": "1/13/2016",
    "text": "This place is great! I asked for extra spicy sauce on the side since my wife doesn't like it too spicy and they made me an extra side of curry, extra spicy, and it was terrific!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q4xSZ8xomUwonEIoQ8XyZg"
  },
  "C3mJN0p7x5sEKooJYytTFA": {
    "date": "8/13/2016",
    "text": "A stylish, efficient, and most importantly delicious dining option near the Guoman Tower Hotel. A much better option than the nearby Dickens Inn, with reasonable prices and very flavorful entrees. We came in a half hour before closing in due need of food, and they were easily able to accommodate us - and we didn't want to be Those People who keep the staff late, so we wrapped up with five minutes to spare, thanks to their quick kitchen. London is THE place for Indian; every Indian dish I've had in London has knocked the sticks off of anything I can get in the States.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGYJmXOphihB2oxcaE4wHA"
  },
  "soMcdJ898JQlvNtJGo5PUw": {
    "date": "7/13/2015",
    "text": "Had a hair in the naan bread and had to ask several times for them to bring us water and more refills on some of our food. Was a big disappointed with the food for the price.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r-62_tWZKJ-pZsH8i4PkOA"
  },
  "cmFmvZAwWLmK7HpUEQ2uuA": {
    "date": "11/29/2014",
    "text": "Loved the food and the atmosphere!  Great view of docks!  Great service!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BtZ27gqL0eyWIjaI0i7nNg"
  },
  "mCsepEvWOW4o0bcfKhLBMw": {
    "date": "7/15/2014",
    "text": "Ate lunch here with family.  Great setting at St. Katherine's Dock.   We didn't know much about Indian food so we admitted as much.  No worries, the waiter suggested the 2 course lunch for each of us which consisted of a starter and a main dish.   We had 5 starters, all separate items to sample and 5 main dishes which provided us an opportunity to try many things.   The conclusion I reached is that Indian food has so many sophisticated varieties of taste that westerners just don't get a chance to experience.  The food was fantastic.  Interior was regal and waiters, in full black and whites was friendly, respectful and helpful.  Our second trip here now and both occasions were of the highest quality.  We will return next time we make it to London.  Signed, paul, a Midwesterner from the good ol' USA.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCc50mtIG1JnTL0SdPH4mA"
  },
  "xKFCWKUW8TuTI49TyESX2w": {
    "date": "7/28/2012",
    "text": "Great food in a great environment.  Really liked all the dishes.  Especially the butter chicken, vindaloo and many of the house specialties.  Our waiter Farouk and a young man from Bangladesh whose name I cannot remember we're very helpful and friendly.  Nice view of the yachts from nearly everywhere.  Also a great value for upscale Indian food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "upFGIjITjBcMMTWxnfybiA",
        "caption": "Photo of Mala - London, United Kingdom. Delicious spread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/upFGIjITjBcMMTWxnfybiA/o.jpg"
      },
      {
        "img_id": "biios0QlMcJ5vFFhLnQhGw",
        "caption": "Photo of Mala - London, United Kingdom. A very good after dinner drink provided by the house.  Coffee flavored...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/biios0QlMcJ5vFFhLnQhGw/o.jpg"
      }
    ],
    "user_id": "lMzM7EPk8Jzg74QUiiuong"
  },
  "AH0E3Nenj7YhEeHdJNvqfg": {
    "date": "7/6/2015",
    "text": "Best Indian I've had hands down! Garlic cheese naan bread was amazing, chicken Tika masala was fantastic as well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mG0K8dEwOsQhwytQMwaHmg"
  },
  "xP1oRacEA5-FhuLzl_mr3g": {
    "date": "7/6/2015",
    "text": "Great service !! Great food !! Lively Vibe !! I was there last week and my favorite entrée was Methi Chicken !!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kAP9unaRxmb7mN11BfvUdg"
  },
  "X1pW_kgRc2wRw0igUkxjnQ": {
    "date": "7/21/2011",
    "text": "We love Indian food, and will drive an hour at home to get it.  This would be the place I would drive to if there wasn't an ocean between us!Read the other reviews for food details.  Come here for lunch and go family style.  It's very good!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fJ8VAC3EuN4OEoh-WzL2Og"
  },
  "uuSJTj1mHOoDXyx39e3TVg": {
    "date": "5/5/2009",
    "text": "Fantastic Indian food.  The lamb jalfrezi was incredible.  Ditto on the prawn biriyani.  Mix them together and you have a little bit of heaven.  It's hard to go wrong with Indian in London, but Mala shines.  The location isn't too shabby either.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1Ce1N6F7vw9pKnsv8MtRA"
  },
  "a7RlCXrrrsaX4sOucESZKA": {
    "date": "10/6/2010",
    "text": "Mala is situated in St. Katherine's Docks right on the edge of the marina. The majority of the tables offer an excellent view from large windows around the restaurant.The service was excellent with our waiter being attentive without overcrowding us and provided both enthusiasm and a repertoire of entertaining jokes while taking and delivering our order. The service was also quite fast despite the restaurant being quite busy.Being Indian and brought up on curries, I'm usually quite critical of Indian restaurants. Mala managed to bring an element on home cooking into their food that I greatly appreciated after sampling far too many places that have westernised traditional dishes to cater to the more delicate British palate.The lamb jalfrezi and chicken roganjosh were both excellently cooked, with delicate flavours being supported by the rich bases and for once not overwhelmed by spice. These aren't dishes that will scorch your tongue so if fire is your flavour then you might be disappointed. The chicken biriyani was intriguing as it was served in an almost deconstructed fashion. I personally prefer the melding of flavours when the biriyani rice, meat, and sauces are cooked together but the dish, once put together, was still pleasing.The garlic naan needed more garlic but was still satisfactory and the mango lassi was thick and savoury (as it should be!).Pricewise, the meal for 7 of us came to 125 squids which is pretty reasonable given the quality and amount of food we consumed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "b4b91ytG1aM9S25eARRwiA": {
    "date": "5/29/2012",
    "text": "Interior is classy and spacious. Location is near picturesque harbor area.   The food was good not great. I had the Multigawny soup (really a blended lentil soup with lots of cream and coconut - tasty), Chicken Tikka Masala (average/good) - not as tangy as I have experienced in the US - the chicken was a bit subpar - dry and not cooked well. The paratha was very good - a buttery layered version of a naan. The waiters are polite but they don't seem to give a darn. At no time during my meal did anyone ask how I was doing. Despite there being only 2 other couples in the place, it took 25 minutes to be served, and my water glass was frequenly empty. Every time I went to the bathroom there were waiters in there fixing their hair. And the end, I finished and waited, and finally had to look all around and hunt them down behind a closed door to get my check. They dont care because they get an automatic service charge/tip. It cost me about 25 pounds ($40) (1 soup, 1 entre, 1 bread) - about double what it would have cost in the US. Its not a bad place, but there are plenty of other places in London much cheaper.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-KkGLpVV8GPc-sBXY8LrVQ"
  },
  "Cg8ULugBYwsU0fNNa5HgkA": {
    "date": "7/27/2009",
    "text": "When my Indian friends - and I say that with a capital \"I\" - agree that Mala is on par with some of the best restaurants in India, it's got to be good. And it really is quite fantastic. Don't come here if you're expecting searing spicy curries that will burn your taste buds off; the curries here are remarkably complex. Much like a wine tasting (minus the snobbery often associated with self-declared wine aficionados perhaps), we found ourselves trying to pick apart the various spices and dominant notes of each dish. Although everything was excellent, everyone completely loved the Lamb Tikka Bhuna, the Goan Fish Curry, and the Dal Makhani. Portions are small and prices are relatively high, but even for cost-conscious new graduates, we felt it was worth every penny.I've had \"haute Indian\" cuisine in New York before and left entirely unimpressed. It had seemed to me, at least until now, that having waiters in tuxedos was merely an excuse to charge $7 per bowl of rice. While Mala indeed charges for plain basmati rice, it was a much more pleasant exchange. (Good food for good money? Deal. ) The best and probably most cost-effective way to experience Mala is family-style, provided that your tablemates aren't hoarding greedy pigs. It's never fun when you feel like you have to grab your \"portion\" of everything when someone's clearly trying his best to get his money's worth. But with good company, you can share multiple dishes, tasting a bit of everything, all for under £20.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "euDIcWuz_Uka8XuBT0dHVg"
  },
  "K5TqNxPT3GqLwlACm_laQQ": {
    "date": "9/21/2009",
    "text": "My friend Erin and I stumbled upon Mala while wandering around the area after our visit to the Tower of London / Tower Bridge last week.  All the walking had made us quite hungry, so we were very pleased when we came across Mala and their 12.50 GBP three course lunch (including a glass of wine).  We were really excited to sample the Indian food in the UK and we were not disappointed.  We both had the Non-Veg Menu which consisted of the following:STARTER: Chicken Tikka & Seekh KebabMAIN: Karahi Lamb, Butter Chicken, Tarka Dal, Pilau Rice, Nan Bread, Raita & Mix Salad DESSERT: Pistachio Kulfi (Traditional Indian Ice Cream) Yum!  It was a very generous amount of food, and I wish I could have eaten more.  Also, the service was excellent and the decor was tasteful.  The area that the restaurant is located in is super cute too!  We just loved looking at all the beautiful boats in the harbor.  And I'm definitely going back the next time I visit London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VyzEjq3r5vB4jslmH9le1A"
  },
  "mHKvvYGkqf79wqQ0j5nF9w": {
    "date": "8/21/2018",
    "text": "I am very pleased to say that while visiting London, we (party of 3)ate at Mala twice. This evening and two days ago. Although the area around our hotel has many restaurants to choose from, we found that Mala had the most tasteful dishes compared to the rest. We all agreed this restaurant had the best Indian food we have eaten in a long, long, long time. I highly recommend!  Vinny the owner was gracious and the wait staff was accommodating. Again a must stop if you are near St. Katharine's dock or anywhere near London tower. A must stop!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clRVe9CUC9O2Vfi4bXopGQ"
  },
  "BM7YjWQAiuCsH9VP085XVQ": {
    "date": "9/23/2018",
    "text": "Good ambience, quick cheerful service, and very tasty food which came fairly quickly. Despite the speed of arrival of all courses, the food appeared fresh and there was no evidence of reheating.First was the non-veg samosas and cucumber salad - very delicious. I asked the waiter if I could have one of each - non-veg and veg and he said they only come either or -- strange.Then the main course of Lamb Madras, Aloo with Baingan, and Peas and Rice Pilau. Delicious, although a bit much and could not finish but half the rice - should have stuck with my initial inclination to go with just the lamb and the aloo / baingan. I asked for some fresh green chillies to go with the food and he obliged.Then came the Mango Kulfi - delicious but I was not hoping for a little stick of it, but a small bowl. He must have known how ridiculous the portion was (even if it did come with a rolled wafer with chocolate on the inside) and must have seen my expression, as he let out a little laugh without me even saying a word. I did tell him they were funny for passing this off as a dessert for £3.75.Only had a sparkling water.The small dessert, the inflexible samosa order, and the bill (£48!) cost them a star.  Expensive but recommended. Oh and they don't serve goat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4qVE1IOCInm4Tm1t9fN-tA",
        "caption": "Photo of Mala - London, United Kingdom. Non-Veg Samosa with Cucumber Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4qVE1IOCInm4Tm1t9fN-tA/o.jpg"
      },
      {
        "img_id": "leMCBQ6acxr62TT7Pd8URQ",
        "caption": "Photo of Mala - London, United Kingdom. Mango Kulfi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/leMCBQ6acxr62TT7Pd8URQ/o.jpg"
      },
      {
        "img_id": "i3oUNf7ABWRszXD6HIFcQA",
        "caption": "Photo of Mala - London, United Kingdom. Lamb Madras, Peas Pilau Rice, Aloo with Baingan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i3oUNf7ABWRszXD6HIFcQA/o.jpg"
      }
    ],
    "user_id": "v-RJcT8mt-AeKZZZsuU9UA"
  },
  "DBCA_5NIRiVVOK8UG1Lzjw": {
    "date": "10/29/2018",
    "text": "Great spot for Indian and nice location at St Katharine Docks.  They were pretty busy on a Sunday night, but we were able to sit at the bar.  Tried the Chicken Tikka Masala, Saag Paneer, Mulligatawny Soup and Garlic Naan.  All were delicious!!  They also indicate which items are gluten free if need be.  All in all, great Indian food!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPyZ_STe3lsXdP3guAUzOg"
  },
  "pd1223hg9HavnqbdshWGZA": {
    "date": "4/18/2018",
    "text": "Made a spur of the moment decision to go here ~ an hour before closing time and was also testing the theory, \"Indian food is way better in the UK than the US...\" this place made that true.Hands down, one of the best Indian restaurants I've eaten at (outside of India).My husband an I still dream of the butter chicken and veggie thali -- the service was a tad slow but the food was worth the wait. Will def try an go back the next time we're in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQjcxncPI0N0ckLqHLxvaw"
  },
  "xoa3VRC9cDNQM3i00Cd-9A": {
    "date": "5/12/2018",
    "text": "I've had Indian food on three continents, and this is my hands down favorite. I'm gluten free, and they actually had gluten free roti (missi roti). We had the Rogan Josh and Chicken Korma. Both were divine.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vfb3fMZuhxdT9Wt_rvAoag"
  },
  "j4rlVu3uazTQLRN27klFKg": {
    "date": "5/17/2018",
    "text": "Don't eat here if you are dining alone. They spend the first minutes clanging the silverware off your table so that it appears everyone is looking around at you. My food was average and tasted warmed up. Korma is usually a safe bet but it wasn't flavorful. Also nana bread was dripping in garlic butter. Location is good but I don't think I would go here again",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gnmhWpP5R186sBZXJO6L8g"
  },
  "WVZU1H5anIIODU7_cACt-g": {
    "date": "5/21/2018",
    "text": "First time in the UK. First indian meal. Top notch. Had the non-veg thali with the lachedar paratha. Great flavors, fresh taste and reasonable portions.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2O63do9sE6lcPaPJltLHw"
  },
  "ZmMa13hEDY9hWenK43lAog": {
    "date": "4/30/2018",
    "text": "Outstanding food, service and overall experience. We had reserved months ahead since we were a party of seven, it was the evening of the London Marathon and we were celebrating a special birthday. We were late by an hour--they accommodated. Our first table was next to a noisy and even larger group--they moved us swiftly and professionally.  Vegetarian options? No problem. Complimentary champagne, appetizers and dessert? YUP...and totally unexpected.  Our group of foodies from around the US (including NYC and Portland, OR) spent five days in London--including lunch at Ottolenghi--and we all rated Mala #1.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkeddqGzWi94PqCTnE4i4Q"
  },
  "HKOs1oTxY6c875WnFoISOg": {
    "date": "10/13/2016",
    "text": "A fantastic place tucked away in a nice location, great to visit in the evenings. The food was excellent, a menu that fully caters for all tastes and preferences. I'm not vegetarian, but they also had quite a selection of dishes for vegetarians which isn't always the case in other restaurants. The staff were all very friendly and only too happy to help.  The interior of the restaurant is also very neat, tidy and clean. They also seem to cater from couples to some quite very large groups. Will definitely be making return trips here in future.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "3YQZmZB2UVNXqz04DYi3XQ"
  },
  "BFOJisOvdv5ytgAuhtkkig": {
    "date": "9/2/2016",
    "text": "Mala is an excellent Indian restaurant with quality food. The service was excellent and the food was very flavorful. I had the 4 course meat meal for 32£. Very reasonable price.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k04QhrELEplN9NQ_Negy5Q",
        "caption": "Photo of Mala - London, United Kingdom. I had warm Kheer for dessert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k04QhrELEplN9NQ_Negy5Q/o.jpg"
      },
      {
        "img_id": "PGhS82mpanU4HkwrDiBO3A",
        "caption": "Photo of Mala - London, United Kingdom. Excellent and tasty appetizers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PGhS82mpanU4HkwrDiBO3A/o.jpg"
      },
      {
        "img_id": "9aHTj3b9-QpqOrE8_1xqUw",
        "caption": "Photo of Mala - London, United Kingdom. The main course- very tasty and filling!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9aHTj3b9-QpqOrE8_1xqUw/o.jpg"
      }
    ],
    "user_id": "RE0UqmTZH0V-omBNz7jhJQ"
  },
  "I59953-tw7xZ8S0LtzRmIw": {
    "date": "11/29/2016",
    "text": "I went there with high expectations, but it was just not worth the visit. The staff were uniformly rude and unhelpful. Must be something to do with me, since they seemed to treat the other guests a bit better. Maybe an Indian wanting to dine alone is not welcome here.Food taste: 3 out of 5Health factor: 1 out of 5 (the chole had equal amounts of oil and chick peas... the peas were almost floating in the oil. It takes a genius to ruin Channa Masala).To their credit, the location is terrific though, and the food arrived very soon after I ordered.And oh, they chose to include a mandatory 12.5% service tax in the bill.  This was not even optional.  As far as I know service charges in London are optional. Overall, London has a ton of other nicer Indian restaurants. Not worth wasting a meal here.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6GrrztZ8jf6wASYYvDtAtA"
  },
  "yw-rnlYHhbiYXplX1Piu0Q": {
    "date": "3/3/2014",
    "text": "Fantastic! If you're ever at the Tower of London/Tower Hill area and get hungry for dinner, Mala is the place to go (especially if you have out-of-town guests to impress, like I did). And especially if you're super hungry. We were very happy with it.The first thing we noticed was on the walk there - it's on a little inlet with a bunch of boats next to the river. Beautiful with the reflections of light at night, and one of the many times where I have a moment of how much I love all the different facets of London.Inside, the space is large and inviting, with lovely decor and low lighting. There weren't many people here on a quiet Sunday night - all the better for us.I had a Mango Lassi to drink, my first time to try a lassi. It's a thick, filling yoghurt drink, but sooo delicious. Also, tandoori vegetables/cheese (Paneer & Subzi Tandoori Shasli), cheese naan, and Indian donuts and ice cream for dessert. And the best poppadum I've ever had (a crispy tortilla-like starter accompanied by three types of sauces) I was stuffed!Tip: My companions ordered meat/seafood platters, and were told they were per person, but they were HUGE. Two people could definitely share one, especially if you get a starter as well.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTHNbsEN_tmd7_--2Wv6LQ"
  },
  "GMK8hQq737CqxxQSnOamdA": {
    "date": "2/18/2014",
    "text": "I had a very nice lunch here. They were prompt, very tasty, and generous portions. I had the vegetarian thali, which is about 4 small pots of different vegetarian dishes, some rice, and some naan bread. It's a really delicious lunch at a reasonable lunch-time price.Service was fast enough, the restaurant was clean, quiet, and attractive. There's a lot to like.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_D33FGJKR2XoSMLAWJwqWQ",
        "caption": "Photo of Mala - London, United Kingdom. The vegetarian thal for lunchi. Nicely presented. Delicious.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_D33FGJKR2XoSMLAWJwqWQ/o.jpg"
      }
    ],
    "user_id": "2UpjdWjg7Uxv8rK9IebPdA"
  },
  "oZMqGb27PXCVQyvRD1-OYg": {
    "date": "7/7/2017",
    "text": "Good food but service sucks. Staff were not attentive and food was sooooo slow.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UxCfgwrsqsLNzr8dxZw_KA"
  },
  "qKVsOYEda3rzQ3f_sqRZkw": {
    "date": "2/1/2014",
    "text": "Excellent Indian! We had a large group so we ordered a lot. The usual; tikka masala, tandoori chicken, samosas, jalfrezi, different naan, we also ordered a huge seafood platter, chana dahl and murgh dopiaza. Everything was delicious!!! The jalfrezi was thought to be the best we'd ever tasted. The tikka masala was amazing and the tandoori was boneless, a first, since usually it has the bone. Everything was fantastic, highly recommend! Great staff and location, right on the boat docs over by Tower Bridge. Very good, highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njUgJcn8ZN0BdZdNEswRwA"
  },
  "EkiugIAUcj_LXpfvDP14Kg": {
    "date": "6/27/2017",
    "text": "For the price tag the Mala disappointed me. Even less crowded they faced me on a table watching the waiters grab and smash (sometimes) back the menu and nailed the dished washed cutlery in some baskets. Food was ok but not real Indian to me. Would not recommend to eat here again, there are other options.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "quUa94_qrxQYTjo9kzzBCg"
  },
  "Rh0k-vb7e_Mz3vBmrMddyw": {
    "date": "10/17/2015",
    "text": "I went here for dinner two nights in a row. Very solid Indian food on St Katharines Dock area by the Tower of London. Many dishes feature the flavors of ginger, coriander and onion and garlic. While I have had better Indian food in London I would recommend this place. It was quite crowded both Friday (when I went early) and Saturday ( when I went late) nights.  Still they took walk ins and I was seated quickly. Onion naan was very good and the portions are sized perfectly. One issue is that their selection of wine by the glass is extremely limited. You don't go to an Indian restaurant for grape wine but the bottle list is pretty long. Why not the same for by the glass selections?Decor is clean bright and real spacious; a lively atmosphere and fine for kids. If they make a fuss no one will notice in all likelihood.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1zP7MuRava7kI-rPES8alw"
  },
  "alzWflR0rJUu-1lM2nbcuA": {
    "date": "8/25/2015",
    "text": "Late night checking in, starving, close to my hotel. Walked in around 10pm and it was surprisingly full. It's a bit of a weird vibe. All the employees are in tuxedos but it's not really a dressy place.  Not great service. After I was seated (no napkin and no water....but they brought my wine quickly!), the service was quite slow. However the food is really good. If they worked on their service I'd give them another star.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UtjsP2U6JRKLwcZbq_wZEg",
        "caption": "Photo of Mala - London, United Kingdom. Tikka chicken and naan.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UtjsP2U6JRKLwcZbq_wZEg/o.jpg"
      }
    ],
    "user_id": "hBZHEGXXI2JDCn9AIenRZQ"
  },
  "RJLHsgZUnYbIHu6K6D70sw": {
    "date": "7/11/2015",
    "text": "The food was delicious. However, they forgot an order of rice and an order of naan, which was fine, but we had to remind them many times before they actually gave us what we ordered. The staff wasn't very polite either. Again, the food was very good though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8X00WYWbZmJkocTFugO7Mw",
        "caption": "Photo of Mala - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8X00WYWbZmJkocTFugO7Mw/o.jpg"
      }
    ],
    "user_id": "cKdJP9ZGgzJAbtxgnMi-zQ"
  },
  "3h0v_V5uGRUXnCgPltoU-Q": {
    "date": "2/16/2016",
    "text": "We went there for lunch. it was flavorful and tasty. My husband asked them to bring extra spice sauce which he loved. I ordered vegi and he ordered meat.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V3QL27dUSdmWicnTjK732A",
        "caption": "Photo of Mala - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V3QL27dUSdmWicnTjK732A/o.jpg"
      }
    ],
    "user_id": "8DmfPgY8CmL0cG0GaTj_0A"
  }
}