{
  "VgtEEQAF1_evKCs1jykkYA": {
    "date": "12/20/2009",
    "text": "Bocca Di Lupo has been one of London's culinary hotspots this year, garnering rave reviews everywhere from Time Out to august critics such as Giles Coren. I have been determined to eat here before the year is out and I finally found myself in the West End on Saturday with a spare dinner slot to fill.I wandered down to the restaurant, which, just in case you weren't aware, is down one of the slightly seedier streets of Soho. However, you're marvellously transported to the hustle and bustle of an Italian trattoria once you step in through the door.There is an area with tables at the back of the restaurant but your eyes and ears are immediately drawn to the large open plan kitchen with bar seating. That's the engine and the beating heart of the restaurant.I asked if I could book a place for one for dinner and the wonderful maitre d' Ernest kindly made the arrangements. When I returned later, perhaps sensing my interest in food, he had saved me what he called the best seat in the house - down the business end of the bar, where the plating up is done. He took the time to explain about the concept of the menu and to introduce Jacob Kennedy, one of the co-owners and driving force in the kitchen.I was mesmerised throughout my visit, just watching Chef Kennedy orchestrate his team of 4 chefs as they put out plate after plate of rustic but ever so appetising looking food. No fuss, no drama, no screaming. Just chefs obviously working hard but very co-ordinated. This seamlessly blended with front of house and the great server who was working the pass, calling out orders and cleaning plates.The menu lists which region the dishes come from, with a few marked BDL, which Ernest explained meant that it had been dreamt up at the restaurant. Let me tell you that this Italian menu bears absolutely no resemblance to any food you will see on any of the faceless and endlessly boringly menus you find in the thousands of high street Italians restaurants you find on our streets.There is everything from Sicilian street food to unusual ingredients such as lung and spleen through to simple deep fried buffalo mozzarella bocconcini. Everything is made fresh on-site and it shows in the flavours. You know it's a good menu when you want to order all the dishes!As I perused the menu, a plate of top class olives and bread with olive oil arrived to whet the appetite. Some freshly squeezed orange juice was sweet and refreshing.For those of you who have read my other reviews, you know that I can't resist odd ingredients and I got the fritto misto alla Piedmontese - a selection of deep fried lamb chops, sweetbreads, brain, apple slices and sage leaves. These were perfectly complemented with a generous pouring of aged balsamic vinegar, the sweet and tartness blending with the creamy textures of the sweetbread and brain.I was impressed by my server Richard, when he advised me to wait til I had finished my fritto misto before deciding on other dishes. I had thought about getting the deep fried chard but he advised that it might be too much fried food.I'm glad for his advice and I went for the intriguing sounding spaghetti and mullet bottarga frittata, a street food dish from Campania. The flavours were lovely and strong from the bottarga, which I was looking forward to. However, it was a very generous portion and my eyes had proven bigger than my stomach!I was able to have a few words with Chef  Kennedy and I was astounded to find out that this is his first restaurant venture. I wish him and all the brigade all the best and I'm looking forward already to returning and trying more of the menu.",
    "rating": 5.0,
    "rated": {
      "useful": 28,
      "funny": 11,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "dQAoJgMpZV0d5QbhhGGrqg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Jacob Kennedy (on the left) hard at work in the open plan kitchen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dQAoJgMpZV0d5QbhhGGrqg/o.jpg"
      }
    ],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "jy3vDJ1LHoLJgjw5IcsctQ": {
    "date": "2/7/2012",
    "text": "Living in Australia, we think we are the centre of Asia and everything we do is on a scale with the rest of the world.  My realization which will hit with full effect on my return is that Australia and to a finer point Melbourne - are sleepy little towns when compared to many cities of the world.  We in Melbourne think we have so much going on during the year that we are spoilt for choice.  We have/are not. A few weeks in London have cemented that fact.In Melbourne we have things going on at all times of the year that make us feel like we constantly need to go out and experience it all.  In London there may well be 20 things going on every single day that you will not find out about until you hear or read about them the very next day and then start kicking yourself as to how you indeed missed Pete Doherty of The Libertines playing a free secret gig right across the road from where you live. Yes, I did go to many of his secret gigs in London but there were many times where he would just show up and put on a show before disappearing back into the London darkness. That is what I love about London.Another thing I love but was unable to indulge in this time around is visiting the brilliant restaurant Bocca Di Lupo.  I have mentioned this restaurant in previous blog posts and was gutted to find I could not fit it into the schedule.  In light of that, should you find yourself in Soho make your way here like your life depended on it.It was the venue of choice for my last birthday in London and the fit out inside blew my mind once again when I entered to take a photo while they were closed.  Boca Di Lupo shines with its small, medium and large fresh tapas plates.  And if you can get a seat overlooking the kitchen, throw any chance of conversation out the window and watch the maestros in action.The cherry on the top of the Lupo cake is right across the road from the restaurant. The owner and chefs at Boca di Lupo have opened London's best gelateria right across the road - Gelupo - to put their great minds to work and come up with a selection of fresh gelati every day.  Geddit? Boca Di Lupo and Gelupo? Fogedaboutit.Inside you are able to taste any or all of their ice cream, sorbet and granitas (they will literally take you through all the flavours by spoonful until you have made your choice). Click here to see today's contemporary take on traditional flavours.They also have an attached deli selling beautiful hand made sausages, salamis and pasta sauces if you don't want to go the whole hog in the restaurant.  They also offer the same sommelier chosen wines to pick-up as they are often hard to find bottles.So I urge you to visit one of the restaurants of London that I hold in high regard and give dessert a miss so you can wander the streets of Soho with a delicious gelati (or granite if I have my way).",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LSNO6g0jcmgmffbzK-uvQQ"
  },
  "tRGb3YudlXeIWS5gnodcGQ": {
    "date": "7/3/2014",
    "text": "Located just off Piccadilly Circus the restaurant is located is a happening area and you feel there is a real vibe as you settle. We came off the back of a strong recommendation...and having read some good reviews.We started by sharing the small plates, the lambsweet breads with artichoke and sage, the second was the squid, courgettes, salt cod and red prawns and the third was the Pappardelle with duck ragu. The first two delightful with a blending of good flavours...the Pappardelle was not as good... chewy and light on flavour.For mains we really loved the roast suckling pig with grapes and white wine...a stunning dish done to perfection!The strawberries with gelato was a simple dish to good food night. We enjoyed a bottle a bottle of 2009 Barbaresco Santa Stefanco....came our off the cellar masters list and was drinking very smoothly, complimenting the good food.The service was good and this experience lived up to the pre visit hype we had heard of....",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "felKiMPaxPNsC3kRZBghfA"
  },
  "3knPUpdsjgO5IdGipHFifQ": {
    "date": "1/22/2012",
    "text": "My favourite Italian in London.  The oriechette with spicy nduja sausage and chili is SUBLIME....",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vDDtHvzvMc0FsACCrsPFKw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Tagliata Toscana w/ balsamic vinegar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vDDtHvzvMc0FsACCrsPFKw/o.jpg"
      },
      {
        "img_id": "140JQEPNMs7xTyxq-9ZiFQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Orechiette with spicy nduja sausage and chili oil",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/140JQEPNMs7xTyxq-9ZiFQ/o.jpg"
      }
    ],
    "user_id": "vgnxCeEh7M8SXHnm4yKC1Q"
  },
  "9Z-hs3Q0F0Nsit6EdKDrJg": {
    "date": "9/17/2014",
    "text": "The duck ragu pasta was tasty, yet the drinks were light on the pour.  Eggplant parm was average to New York standards.  Good place if your nearby yet I wouldn't go out of my way.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrmkHQaLRnIHRjWfx8p1pg"
  },
  "g9Mc-mg3RYjDnEVdiGvtiQ": {
    "date": "2/27/2014",
    "text": "I must say, this is one of the very few places that I disagree with the majority of reviewers. We had a few dishes and didn't like any of them.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IqAmXAnk0lgfeAvz--EUcg"
  },
  "WTAU1OB4n9OaGk8WjsL9LA": {
    "date": "1/29/2014",
    "text": "Plenty to like about this place. The lovely speckled floor tiles reminiscent of so many cafes on the continent. The beautiful light. The sweeping bar. The atmosphere, loud, choc full of people clearly having fun. It's a great venue and you feel like you're somewhere special. But I struggled a bit with the menu. Small or large plates they say, so you can structure the meal to suit you and your friends. Sort of tapas style I guess. But there are dishes there for £18 or £20. And the food. Ever so rustic. I love that, but much of it I found fairly challenging. A wild boar sausage thing that came out like meatloaf and was totally chewy and tough. Quail stewed with chestnuts that came whole and was again tough. Not sure how three of us were supposed to share that tapas style. Maybe that's not how it's supposed to be but that's how we were encouraged to order, so it didn't really work. Fish in batter that came out greasy. A warm salad of undercook potatoes salad. At best you'd call it rustic. But I just found it clumsy.A shame because I enjoyed being there. If I go again I would maybe order a large plate for myself and leave it at that. The carpaccio of bream was delicious. And I enjoyed the sausage and lentils. So either of those would do nicely. Then sit back and drink in the atmosphere.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJTAqZ8QgmvWuo8kuiIMJw"
  },
  "AkfE5MKBFJRMgIxjqwI7kg": {
    "date": "9/29/2011",
    "text": "Meh. A very +/- experience for me (2.5 - 3 stars)The place has all the elements for a really awesome restaurant - great menu, wine list, lively atmosphere *but* execution and service was sadly lacking and is inconsistent all around. Good: The menu design is very intriguing here, I love all the little tapa style plates you can get to taste a bit of everything representing different regions of Italy.Bad: I have to wonder if the staff gets mixed up with all the options resulting in a state of confusion. Service was slow which was funny because the staff was incredibly busy running around between the tables but not very efficient. Our waiter even had a little BO smell to him from all the running around *eep* Too Bad: Just a few improvements in execution of the menu would make a huge difference! I read the other reviews and it's very inconsistent. Some love the place and others were underwhelmed. I hope they can iron out the kinks here. Not sure if I'd go back. I'll keep an eye out on the other reviews and see if the place improves. Run down of the grub:Olives & Bread - Good olives, onion bread was soggy and greasy.Artichokes alla Giudi - Greasy. Saw the servers go to 3 wrong tables with our order, and back to the kitchen and back out 5 minutes later with the delivery to our table. Sheep's milk ricotta gnudi with lamb ragu - Gnudi were good, hard to mess up a fried cheese ball :PFinferli (girolle mushrooms) & parmesan risotto - Good, best dish we had.Tagliata - eye of the sirloin, with rosemary, balsamic vinegar, rocket & Parmesan - Meat was not seasoned and was unevenly seared leaving some pieces chewy and over cooked and other slices at varying degrees of med to rare. Bocca di Lupo - Lol, sorry no...they didn't have this on the menu but it might have been fun to have. Such a charming name and theme for the restaurant, maybe a good idea for a dish to swap out the tortellini :{}",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiyWzIIJhbuoF7fYWb0zeQ"
  },
  "kS7OvlpCR4yDszFPE6FaoA": {
    "date": "10/8/2015",
    "text": "Bocca di Lupo is by all accounts a popular spot which has now shed the trendy crowd. Hence me going there! The small plates were cooked correctly. The wine list is interesting. And of course you know everything is freshly cooked if you sit at the bar. But the food is pretty standard for a decent Italian restaurant both in terms of ingredients and recipes. Yes there is a buzz about the place but I wouldn't seek it out for the quality of the food. It verges on high-end NY Italian deli style.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gINYrYtC1Rueih_3asB9SQ"
  },
  "usL_wCCNWuZkLFC7gWIhcw": {
    "date": "6/24/2010",
    "text": "A stones throw from the madness of Piccadilly Circus is an osias of calm and wonderful food. Great light space with a long bar and tables at the far end (very small \"pass\" at the end of the bar which was pretty busy). No music but lots of lively chatter for a Monday lunch - Bacon would have approved!! My Negroni was excellent as was the house white. \"Dishes\" are available as small or large plates - small was great for me but if you are really hungry I would go down the small pasta, small meat plate route!! Whatever you do have a small plate of the radish, celeriac, pecorino and truffle oil salad - at first impression not my idea of heaven ,but how wrong was I?! The waiter promised it would be the best salad I'd ever tasted and he was not wrong. Stuffed olives are not to be missed and the clams with butter beans was authentic and very tasty - a really light but zingy and spicy sauce with distincy and authentic flavours. Staff are friendly and happy to talk about what they like on the menu - as opposed to sell you the dish of the day. A great place to while away a comfortable few gastro-hours. 9/10 Yet another reason why I love Soho. I'll be back!",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "3BsmR4FsyhQsgWUIrbGFmQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3BsmR4FsyhQsgWUIrbGFmQ/o.jpg"
      },
      {
        "img_id": "jmL5k9BV60sGZgAsyyDNUg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jmL5k9BV60sGZgAsyyDNUg/o.jpg"
      }
    ],
    "user_id": null
  },
  "vu4F33kd8z9S9TSNuIMaYw": {
    "date": "11/12/2014",
    "text": "Favorite italian spot in London. My friend and I sat in the bar. Service was prompt and efficient. They very much catered to our need to be at a show. All of the pastas we tried tasted so fresh. Highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtZ2ePEMsOfCrn0Bk4B4Kw"
  },
  "vbGFpImW_Jiigtd3NVYNUA": {
    "date": "9/18/2011",
    "text": "Wow, what a mixed bag. Great food and wine but service has some major gaps. On the night we went there were several issues with orders, how long it took to get food out of the kitchen and we waited a solid 15 minutes to get our bill sorted after asking.By this point, they should have the service down to a science, but unfortunately not yet!If I go back it will be to sit at the bar area where service looked more dependable.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBfzkI6URmtp3mIwhtXr4w"
  },
  "nCSj2c81m5o-rR-3D2F5Hg": {
    "date": "7/24/2014",
    "text": "Based on the reviews I was expecting a lot more. Service was good, food was mediocre but over priced for what it is. Won't be back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tk0mgkDurcGeCrvLgWA9nQ"
  },
  "2AqXISF4cobIYUZg3mrsRw": {
    "date": "2/19/2011",
    "text": "Deserving no less than five stars, Bocca di Lupo impressed me with the ultimate dining experience.  I stumbled upon it whilst reading a Giles Coren review from 2009, when the restaurant was still pretty new on the scene.  Coren was unambiguously thrilled with the place, stating that \"Bocca di Lupo is just bloody marvellous\" - off to a good start one might say.  So I was mightily pleased to find the place full to the brim when I turned up for my reservation, two years on and people clearly still think the place is \"bloody marvellous\".We arrived in high spirits, having come straight down the road from the Theatre Royal Haymarket.  Having rocked up half an hour early we could not be seated straight away, but the manager, Ernest, was genuinely apologetic for this.  Sincerity is not a commonly found quality in eateries, but Ernest managed to be convincing and delightfully charming at the same time. A winning combination.In lieu of our table we were immediately offered Bellinis, which seemed to be the perfect suggestion, no other beverage seemed appropriate.  However the full bar would have been more than able to cater to our whims, had we not been thus inclined.  So with Bellinis deliciously in hand, our spirits continued to rise as we were powerless against the cheerful atmosphere.  Indeed, it was horrendously busy, though not in the way that makes you impatient or frustrated, but rather in the sense that you're part of something exciting.  Which you are.Admittedly we were not seated until an hour later...though this was not through fault of the restaurant, as a couple of large bookings had arrived late.  Besides, we'd been having such a swell time anyway, and the staff had been so kind to us, that it really didn't seem like a problem.The menu at Bocca di Lupo is very exciting indeed.  On the front \"BLOODS ARE BACK!\" announces the return to season of blood oranges, a key feature in several of the dishes.  However what is perhaps most intriguing is the design of the menu itself, which totally ignores the conventional 'Starters, Mains & Sides' format.  Instead most dishes are available in either small or large portions, so the choice is up to you whether you wish for a starter and main course, or if you prefer a more tapas-style orientated meal.What interests me further is that the menu also tells you what region of Italy the dish is from.  For example 'nettle pappardelle with wild boar ragù' hails from Toscana - who knew?!Our meal comprised the following:Shaved radish, celeriac & pecorino salad with pomegranates and truffle oil.Mozzarella bocconcini (fried balls of mozzarella, basically).Nettle & borage pansotti with walnut sauce.Slow roast duck & Jerusalem artichokes.Blood orange with red onion and oregano.Grilled treviso with balsamic vinegar.I can 100% vouch for the sheer sensory delight of all of these dishes.  Simply put: they looked great, smelled fantastic and tasted even better.  If I had to choose a favourite, perhaps I would say the salad.  On paper it appears to be such a mish-mash of flavours, but golly is it successful, and the truffle oil is just something else.Despite being full and wholly satisfied already, the dessert menu enticed our stomachs to give in for more.  After serious debate we risked the Sanguinaccio aka 'sweet pâté of pig's blood & chocolate'.  Did you say pig's blood?  Really?  In a dessert?  Yes!  And what's more, it's fabulous.  No seriously, it is.  Almost like a luxurious chocolate mousse.  And to accompany the Sanguinaccio we selected Lingotto, a cow's cheese described as 'soft and voluptuous' - now you can't really resist that description, can you?To round off the meal there is a lovely selection of sweetened coffees, and I was particularly taken with the Caffè alla nocciola - coffee with egg yolks & hazelnut.  Mmmmm, delightful.  But despite being the only two customers left in restaurant, our evening was not to end there: after settling the bill, Ernest approached us with two complementary glasses of dessert wine.  Now, I'm not normally a fan of dessert wines, but this was sweet, obviously, yet also light and fresh at the same time, perfect! Usually by this point, staff are doing everything they can to hurry you on your way (it's already gone 1am) but instead, we had the manager taking the time to thank us for being so patient at the beginning of the night, and chatting to us quite leisurely about wines, food, and the preparation of some of the dishes.  Honestly, it was charming, and it makes such a difference to the whole dining experience if you are treated properly.  I feel I should also mention that is wasn't just a one-man act either, and the rest of the staff were wonderful too, very keen to help.So there you have it.  My most enjoyable dining experience to date.  I am but young, so take it with a pinch of salt of you must, though it seems my enthusiasm is shared by many so I might not be too far off the mark with this one...",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "0b1aOWnBYQRU6Hy2WyhQIA"
  },
  "_lcpcG5y3mYr3RrVG46duA": {
    "date": "7/14/2011",
    "text": "Now I have history with fried. Show me a tapas bar, a fine dining restaurant or a street-side snack joint and I'll gravitate toward the section in batter.BDL is a perfect case in point. A menu spanning the best parts of Italy available on a small plate. It could very well be the older, grown up brother that Polpo doesn't have or a distant cousin for similarly light and upmarket Barrafina.Admittedly it's got a 'build your own' Frito Misto section and an obsession with the (literally) gutsier end of the pig, but in the main it's a well brought up, properly behaved small plate Italian. Friendly staff in black buzz along the thick, light marble bar into the serious restaurant at the rear. If you're only a two (or a very close three) then snare seats at the wide bar if you can. It's well designed for flowing access behind you and relatively calm, even opposite the frantic kitchen, and doesn't thankfully feel like either an afterthought or a corridor.There's plenty on the keenly priced sharing menu to tempt the non meaty. I could happily graze from their side dishes, and a small plate of plump, fresh broad bean tortellini was well executed and possibly life extending if not eye opening. But in all honesty, if you're at BDL for a bite, chances are it's going to be porky.Most of the dishes come with two sizes, and even the small plates are reasonably proportioned. We started with plump olives, as green as snooker baize and a brace of sourdough bruchetta, layered with some of the sweet and seasonal broad beans scattered across several other dishes on the menu, here combined with salty thin shards of pig's cheek and a deep umami laden jus. They paired perfectly with similarly seasonally apt courgette flowers, stuffed with mozzarella and lifted out of their slightly oily batter with the soft bite of anchovy. If I were to throw a criticism, it'd be that oil. It slightly marred the courgette flowers and soaked deeply into the sheet holding the so-so Frito Misto too. Not a deal-breaker, but enough to make you regret another order of fried. You build your own frito from a small menu, baccalau was unctuous flaky battered pollack, whole squid gave great texture in the tentacles but over floured rings and bland aubergine, little more than an oil trap, let down the final dish.Thankfully, and expectedly for a restaurant with its own ice-cream parlor over the road, they made up with the desserts. My guest took a trio of the homemade, fruit stuffed ice creams, here nestling in a toasted brioche roll, I went for Sanguinaccio, the devil's own nutella, a thick chocolate paste with pine nut and pig's blood from Abruzzo, the blood adding a dark note of sweet iron, lifting the dark cocoa to the heavens. I licked the bowl clean. I'm not a proud man...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "jMk3OHNXC574C58QXjcoHQ": {
    "date": "12/26/2013",
    "text": "Had a late lunch at the bar. We ordered the burrata, tagliatelle with girolle mushrooms, orecchiette with sausage ragú, and one of the polenta dishes. All were really great. The buratta, orecchiette and polenta were fantastic and the mushroom pasta dish was good. It was a lot of food for two. The desserts also looked great but we didn't try any of them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IyzL95p73wJyRH8l1Jnz4g"
  },
  "yvB6YtWpCBA9rWuBTSdsyg": {
    "date": "1/14/2011",
    "text": "This place is absolutely exceptional. The reviewer who suggested that this place feels like it could be in San Francisco is absolutely right - it has exactly the feel of a place there called Flour + Water and it's just as good.I love a meal at a counter where you can watch the chefs and bar staff at work. I also love a restaurant where looking over the menu is almost as much fun as the meal itself.We had a widgeon from the many available roasts - it was a small duck, rich and gamey. And essentially it was cooked to perfection. I love the fact that they let you know how long you'll have to wait, and it makes for a leisurely evening easily filled with fried artichoke and sweetbreads.Great wine list. Friendly and attentive service. The only slightly disappointing bit was the stuffed pasta, but I am happy to overlook that as I am still contentedly remembering that amazing widgeon...Go.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "imxW4Dun1OhOWDnP-vN-og"
  },
  "Akw66Eeu32ZYx_2i7VvPOA": {
    "date": "1/31/2014",
    "text": "really spectacular.  busy, energetic, friendly, food is amazing, great atmosphere....really my only note is the art work is not good... i know it's done by the mother of someone involved... not the best... but so easy to overlook",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jo02z6hkTQDYDDBEMqJuCg"
  },
  "TcriewIE5WU1qL-pF4h_uw": {
    "date": "5/15/2014",
    "text": "Incredible food and exceptional service. Sit at the chef's counter if you can",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J33VthB3aLKyRjr-ImsXEg"
  },
  "4zyGBumwCCm9ZpFMSglj9w": {
    "date": "9/5/2010",
    "text": "living in London I have missed the restaurant scene that i was used to in San Francisco. Walking into Bocca Di Lupo felt like i discovered a bit of Home.effortlessly cool. Intensely passionate. incredibly knowledgeable. Relaxed and cosy, while still feeling special. everyone who worked there felt like the *wanted* to be there. that this was their one true love and they adored every bit of it. ive been twice now and im still in love.You walk in with the Bar and the  (open) Kitchen to your right where you can sit and eat/watch the chefs in action. In the back of the restaurant there is the dining room with small tables aranged snuggly, but not so close that you  feel like youre sitting in someone elses laps, as it is with some places. Service runs fairly quickly, but it doesn't feel rushed. The service team was super friendly and enthusiantic about their jobs and obviously loved food. When we had quiestions, if they didn't know the answer, they were interested themselves to find out, not just because it was their 'job' to know.Yes its all a little overpriced. But you know what? If paying a little extra to have an experience that I will remember for years is what it takes, then bring it on. Service, decore/feel, food, drinks (try the watermelon&basil martini), everything = perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "I3URSVRu24EaGWpvZB0cuA"
  },
  "JrPGTKzLNlauqy31PEweiA": {
    "date": "2/14/2012",
    "text": "The wife & I were off to the late show at Ronnie Scotts for our anniversary celebrations, now where to eat? On a whim we strolled into BDL at 9pm & like it was fate within two minutes there were two seats available at the chefs table.Love the classy tapas bar feel to the place. As we sat down at the marble table we were greeted by some fresh focaccia bread & bright green plump olives, we ordered still water, two house reds & two shots of tequila(classy aren't we). Our eyes explored the menu of small Italian plates.Food was ordered & arrived promptly.Crisp red salad, was crisp & red with balsamic dressing.Fried oysters, crispy outer & moist innards, oysters slightly on the small side though.Langoustines, just grilled plain nothing else is required when this fresh, again they we on the small side especially this time of year.Chicken stew, meat falling apart, classic flavours of soffritto & wine.Lamb chop, grilled plain again was good.Orecchiette with tomato, red onion & Parmesan...light, flavoursome & had a kick, definitely one of the highlights.To round things off....Gelato tiramisu, wow layers of goodness & a good kick of alcohol in the spongy base.The wife had a marzipan & ricotta cake, which was a perfect accompaniment to her expresso.The waiter gave us tremendous service all night & promptly got us the bill when requested. We finished two more shots of tequila to warm us up on this chilly night & off to Ronnie's we went for some Brazilian bossa nova funk jazz!Top experience, 4 stars as the food had some minor gripes, however I will be back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VPLX0YXT5pg9e5Q8JFcvKg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Stewed chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VPLX0YXT5pg9e5Q8JFcvKg/o.jpg"
      },
      {
        "img_id": "hHEZFCuKcqEtbo_pwpHK1w",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Gelato tiramisu, marzipan & ricotta cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hHEZFCuKcqEtbo_pwpHK1w/o.jpg"
      },
      {
        "img_id": "ygQcGUHW4da1xXebawLljg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Spicy pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ygQcGUHW4da1xXebawLljg/o.jpg"
      }
    ],
    "user_id": "E2YSjkXiJA1_QItm-lj8Fg"
  },
  "u9uNdHKUoEl93PbVGXv9VQ": {
    "date": "10/29/2013",
    "text": "Oh, Bocca, how I wanted to love you. It could have been so good, but plenty of little slips just really made you miss the mark.Let's break things down.It was the taller half's birthday and we scored a seat at the counter, opposite the chef. The counter seats are rather tightly cramped; the person sitting to my right didn't seem to get that (or had a few too many glasses of wine) and I kept getting elbowed, despite her petite size. That was unfortunate. Also, those of us who are vertically challenged and dressed to the nines might find it difficult to clamber onto the stool with anything approaching dignity (sigh). Not unusual, but something to be aware of.The restaurant in general was far louder than I would have thought; not quite \"yell in your companion's ear at a club\" loud, but definitely necessitated raised voices to be heard.While I'm normally the one domineering-- erm, directing-- the menu selection process, this time I gave up the helm. It was her birthday, after all. For starters, we got a slice of blood and pistachio sausage and the veal chop with sweetbreads and pears. For our mains, the suckling pig with chestnuts and partridge with polenta (which was sent back and exchanged for another dish), and a shaved radish salad to nibble on. Cocktails included a gin-based drink with cucumber and rose granita and a vodka-based drink with blackberry liqueur and lemon granita. Add a bottle of sparkling water, profiteroles for dessert and, service included, it all came out to £110.  Blood and pistachio sausage: overpriced for a single slice of what is essentially black pudding. Flavour was bland, with no distinct seasoning coming through. The pistachios were plump and fresh.  Veal chop and sweetbreads: veal chop was heavily breaded in greasy breadcrumbs and lacked enough salt and pepper to support the mild gaminess of the meat. Sweetbreads and pears were battered in a pleasantly crisp tempura batter. Pears were fine; sweetbreads were completely unseasoned and just slightly underdone, which meant they were chewy rather than pleasantly soft.  Our cocktails came out next. They weren't astounding, but they were a really solid idea for a place (presumably) without a star bartender: make a granita, top it with booze. It'd be difficult to go wrong, and these were certainly nice.  The mains came out together. The crackling on the pig was perfect, and the pork itself high-quality, juicy, wonderful. The portion was humongous and would have fed two. The chestnuts felt a bit like an afterthought, but they were fine and not overly sweet. Some acidity in the jus would have been appreciated to balance out the richness of the pork, but overall, this was the stand-out dish of the meal.  The poor partridge, on the other hand, was a disaster. It was overcooked on the breast side (completely dried out), and raw along the thigh and spine. I'm not one to shy from pink poultry, or even raw (when it's meant to be raw), but this was simply sloppy, uneven cooking on the chef's part. 30 seconds less on the breast, 40 seconds more on the other side, and this would have been a hit. I can't recall the last time I sent anything back, but this wasn't edible. Not wanting to wait \"at least 30 minutes\" for a new bird (and not convinced the chef would do it any more justice), I opted for pasta, since the man on pasta had his game-face on and seemed to be rocking his station. Little al dente parcels of home-made pasta filled with pumpkin and amaretti? Delicious, though compared to the pork, the \"large\" portion was a bit of a joke, and they could have used some sort of sauce. I wished for a dash of bitter or acidic to break up the sweetness (brown butter, a bit of fried sage, or a vinegar reduction?) but these were quite nice. For the portion, overpriced.  The shaved radish salad was wonderfully-balanced, with bold black radish and peppery red radish balanced out with pomegranate arils and a drizzle of olive oil. Unpretentious, pleasant, really good.  The profiteroles came out with the requisite birthday candle. Gelupo's gelato is, of course, solid (feel free to see my review for Gelupo). The profiteroles were filled with chestnut, pistachio, and hazelnut, all lovely flavours, and drizzled with a chocolate sauce. The choux pastry was a bit of a joke: clunky, bland, and obviously an afterthought.What was also interesting was the atmosphere in the open kitchen. The chef was clearly having a thoroughly off night: we watched a pan get tipped upside down and a widgeon burned to within an inch of its life, along with a wood pigeon. He was exchanging sarcastic looks with the staff whenever a compliment was passed back to him. It was just odd, especially considering the open kitchen makes that sort of attitude visible to everyone.Our waiter, while busy and distractable, was pleasant, bubbly, and mostly on top of things. Certainly no complaints there.Bathrooms were filthy, smelly, and in poor repair.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "18viTh3Uq5EoFPUV-dvuXQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. The ill-fated, half-overcooked, half-raw partridge. Waste of a lovely bird.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/18viTh3Uq5EoFPUV-dvuXQ/o.jpg"
      },
      {
        "img_id": "H2LY8rGx93sAE3VxSJ0vOA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Suckling pig with chestnuts.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H2LY8rGx93sAE3VxSJ0vOA/o.jpg"
      },
      {
        "img_id": "xrlPVuToxdN4KqS76FaqVQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Shaved radish salad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xrlPVuToxdN4KqS76FaqVQ/o.jpg"
      }
    ],
    "user_id": "y8Fc_lP3Lgzns-0XXaLSEQ"
  },
  "Az-LSEPw0b8IFh9hoC2M0Q": {
    "date": "3/23/2014",
    "text": "Boy were we looking forward to this meal, the reviews were great and the menu looked fantastic.  Underwhelming, nothing really lived up to the hype.  We tried a number of things but time and time again they were just OK.  Its expensive and mediocre so I'd skip it, not horrible but we'll not be back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y4XrPBUdbzXUCkkjfnvDYQ"
  },
  "YFr7rpETDEf5ppfwJWjRWw": {
    "date": "4/2/2011",
    "text": "Don't hate me.  I went in here really hoping that I would love this place.  I was looking for a special place to take a visiting friend and it was a disappointment.  We looked at the menu and we were really excited. The restaurant serves small and large portions of many of their dishes so you can tailor your meal to your liking.  You can almost have an Italian tapas experience.The shaved radish salad was lovely.  Unusual, light and savory and we hoped the rest of the courses would have continued to be a pleasant surprise.The Orricchiette pasta with 'nduja wasn't spicy enough, and the other Pansotta pasta was bland as well.  So we found both pasta dishes to be bland and oily.We also had the Luganega - thin pork sausage with nutmeg, cinnamon & clove, served pink.  The smaller serving was enough and we ordered a side of spinach. Which turned out to be very oily and salty.Don't hate me but it really tasted like the british version of italian food. On a bright side the manager did know his wines really well and was able to pick good pairings for the our dishes.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "dsu43n2DOR_pB07P1sOOZg"
  },
  "LyBLCoJB5M2_WlSBXIYdaA": {
    "date": "5/8/2015",
    "text": "Wow. Probably one of the best meals I've had in London.  The food was fresh, unique and perfectly prepared.  The service was stellar, absolutely stellar.  While we had to wait for our table even though we had a reservation, the staff went out of their way to make sure we were comfortable and happy.  It's moments like those that make you really appreciate a restaurant.  That fact that the food was top notch made it all the more enjoyable.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xhiuf-jBBWvq_4w0uSE1tA"
  },
  "rkoW8Tb_owt0g_pNg9DYzw": {
    "date": "4/1/2011",
    "text": "I've been wanting to check this place out since it opened yet for some reason never got there until recently. It did not disappoint.To start with the staff are friendly and very accommodating. That is saying a lot for a popular eatery. Many places would rest on their laurels and hand you a lot of attitude, but here they really do try to get you a table. So right away I liked the place. But we are here for the food after all and they do deliver the goods.Modern Italian dishes, some tapas size, were all delicious. Starting with a bread basket that included 3 different types of bread and the most gorgeous olives. Of course one has no choice but to have a robust glass of red wine from their extensive wine list to wash it down with. I sampled the roasted red peppers in anchovy sauce to start which were buttery soft and savory. I think it was my favorite dish but everything was very good. That was followed with white beans in tomato and and a warmly spiced sausage. Familiar tastes of Italy with a twist. I liked how on the menu they listed the region of Italy where the dishes were from. The vibe of the place in Soho had a bit of a New York City feel to it with its open kitchen at the bar area to watch the show, and a more elegant dining room in the back. A lot of activity but still cozy somehow. Can't believe it took me so long to get there but I will be going back again very soon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PAFlpDtI9gwR8gyt1kB5jA"
  },
  "YN3fc5FWjbn7eUzdlNoGZQ": {
    "date": "2/24/2013",
    "text": "Wow, this is my new favorite place in London. Fantastic food and service, a great wine list, it has everything one wants in a great restaurant. Highly recommend getting a few small plates, for oneself or to share - it is worth trying a number of different items. It is also great for vegetarians - there are a good number of veggie selections on the menu, so no one should go hungry :-)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qWyFxE4zftV_CdRMvYkMw"
  },
  "41pEqnNfIdIwZ4WjDiygSQ": {
    "date": "9/9/2013",
    "text": "Blown away.  Hands down the best eating I had on my recent trip to London.I walked in with no reservation after seeing a show on a Friday night - and the friendly hostesses snagged me a seat at the bar.  I would recommend sitting at the bar and watching the action happen in front of you, as chefs grill steaks and plate dishes and make magic inches away!I loved the menu - I could hardly bear to choose one or two items and pass up on the rest.  I also like how the menu tells you what region the food is from.  I imagine it would be quite fun to match a dish with a glass of wine from the same region.I had a few small plates - the sea bream carpaccio was sublime, as was the agnolotti.  Although too full already, I couldn't pass up the Sicilian Cassata - orange, chocolate and marzipan are the holy trinity of desserts in my view.  If you agree, save space for this glorious sweet.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsOmY_afZyLbjzOauAfl_Q"
  },
  "NhbvMrs8NPmkEHKwMMfhjw": {
    "date": "7/30/2016",
    "text": "Delicious!  We sat at the bar for a small pre theater meal.  On the suggestion of the bartender we tried the duck ragu and pesto gnocchi-  AMAZING.  Gnocchi was incredibly tender, fresh and flavorful.  The duck ragu was savory with very delicate pappardelle pasta. We both chose the small portions which are a good size for a light meal (along with complimentary focaccia and olives).  We could have licked the plates!   Good wine selection- I enjoyed a glass of chilled sparkling red which was very unique. Go there, you won't be dissapointed!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQcigvrcnL9T-6BGBM5ZgA"
  },
  "GyhOpTcWxGZP4js58RZRLw": {
    "date": "3/27/2011",
    "text": "I travel on business often and as much as I attend business dinners with others, I find myself dining for one often on the other nights.  It's an interesting alternative perspective on dining.  When in London a few weeks ago, I got a recommendation for Bocca di Lupo from the concierge at my hotel.  Great recommendation.It's in the SoHo West End Area which I really liked.  As a New Yorker, this area reminds me of a combination of the best of New York City areas, Upper West Side, West Village and Times Square all mixed together.  As you walk from the Piccadilly Circus tube station to the restaurant, your pass a ton a restaurants and bars that you may like.  Stay on course.The restaurant is a bustling, contemporary Italian restaurant.  Forget the old thoughts that the food in England is bad.  It was excellent.  The restaurant was busy on this Saturday night.  Dining for one, I took a seat at the bar seating area, close shoulder to shoulder with many others (couples and groups too) that probably couldn't get a table.Here comes the food, starting with olives, bread and red wine to the main course.  Unfortunately a few weeks have gone by and my recollection of what I had is now behind me but I have fond memories of it.  My lack of memory may have to do wit the wine story below.  Whatever it was, it was very good.The service form the waiter was very good, an ex-pat American from Kentucky I think.  The people behind the bar were a little aloof.  It was an excellent dining experience.  The only thing that went wrong was after one glass of wine, the waiter asked if I wanted a half carafe of the same.  In my moment of weakness (or maybe a buzz form the first glass) and not asking the price, I said yes.  When the bill came, the half carafe was about $45 US.  I negotiated that way down with the manager and waiter who did seem sincere to try to make it right.  The half carafe was large also so I gave a lot of it to the people sitting next to me eating at the bar.Bottom line, When in London, you can eat like a contemporary Roman.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gdQsk9I6nZ0g-LDsIbPWrQ"
  },
  "ksAeSkgoafr5vmKDPHUPRA": {
    "date": "3/10/2015",
    "text": "Even if the food weren't so good I think I would still like this place just because the hostess and waitress were so lovely.  It may all be an act to make you feel special and appreciated, but if it is they do it very well.  Oh, and the food was actually quite good, particularly the tripe, oddly enough.  I wish I had been with others so we could share more items.  It was quite expensive, but then again, it's the West End in London.  I'm not sure why I went for Italian, but I'm glad I did.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZHno98SJZ78tkzk8k18-w"
  },
  "Z2nRlOV4mSld5oblPVGQEQ": {
    "date": "1/27/2014",
    "text": "Great for dinner at the bar alone, or in the restaurant with pals.I like to sit at the bar and view the kitchen at work...Great food, great wine,great service",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xshvfzZ3DDGwWzzqq7--OA"
  },
  "lN9H8xifG9eTonzVFT9aDQ": {
    "date": "10/14/2012",
    "text": "Such an easy 5 stars...We popped in here today for lunch and grabbed a seat at the bar which overlooks the open kitchen. I love this kind of dining experience as there is so much to see, even before the kitchen's delicacies arrive in front of you.  If that isn't for you there is also a more conventional seating area. The menu is quite hard to fathom - almost everything can be ordered as a small plate or as a single bit of meat or fish. Thankfully our waitress proved an excellent guide, telling us when we had ordered just the right number of dishes for a lunchtime feast. Like any menu of this kind, the benefit of lots of little dishes is that even two people can get through a good selection of what the kitchen has to offer and we did just that. The food itself was delicious. A pomegranate and radish salad was a fresh and fragrant beginning and two slices of Bonnet (a coffee, rum and hazelnut desert) made for a luxurious conclusion. In between, each dish displayed fresh, seasonal ingredients to delicious effect.  The glasses of Italian wine which accompanied our meal were equally good - albeit, not being very knowledgable when it comes to Italian grape varieties it was something of a voyage into the unknown.In a city devoid of good Italian food, this is a rare exception. Bravo!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXcEvJHocUnXLGl0xILYgw"
  },
  "xS1SGt3h72GAGUiWIMU88Q": {
    "date": "7/4/2012",
    "text": "This is a quick and dirty review for now as I promised Bocca Di Lupo the spot for my 300th review. The food was delicious (mostly...will get on that later), the atmosphere perfect for a large group of friends, and the service impeccable. Overall, go here to enjoy youself!The key points that stood out were i) the friendliness of the wait staff and the skill our waiter exhibited in picking up non-verbal cues, ii) the delicious bread on arrival (it's a key selling point), iii) the confusing menu where you really order in unit amounts, iv) the ability to literally order almost everything on the menu when you have a group of 8.Extra points for putting a candle on some profiteroles and singing Happy Birthday to the Tracy L, the birthday girl. Also points for not charging us for the one bad dish (some sort of baked artichoke that was more ash than artichoke) after I mentioned in passing to the waiter I was disappointed by it.More indepth analysis to come once I get my copy of the menu in front of me!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "yY_GbtWXjcyA0f949DQCoQ": {
    "date": "12/8/2012",
    "text": "I eat out a lot mostly in NYC so it takes a lot to impress me. I was very impressed with Bocca. The food was sensational. Had three special large plates. Best was mixed grill - tasty spiced pork fantastic.  Mixed seafood - calamari was crisp on outside soft and tasty inside. Manchago was tangy and crumbly just perfect.  Pasta was perfectly dente.  I could go on and on. Wines were great. Service was as crisp as the wine.A must go.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UglmPVorcPvq1IIDLuefFg"
  },
  "t_agQ6Vay5ZeeAVECnXn1Q": {
    "date": "10/6/2012",
    "text": "It was so good I want to cry. That would be tears of happiness that I finally been to the place where the best sorbet of London is originating from, and happiness that it is in my city and I can go there regularly.My major advice - sit at the bar. You want to see your food being prepared - actually my friend and I were considering having steak as dessert - it just was staring at us from the grill.... and giving all the seductive aroma...and looking all gorgeous and juicy... Well, we went for chocolate marzipan ball instead and..and...it was amazing.True, prices are high. But give me a break - if you want good food and great setting you'll pay for it. Do save it for something just a little bit special.I'm not a pasta person. I don't like carbs but I couldn't help stealing some from my friend's plate: trofie with ink - amazing. I can't explain what ink tastes like - you've got to try it for yourself!I went for monkfish for main and although it was good I was expecting slightly more. Dipped it in the olive oil - and it made the trick of adding just a little bit of fragrance to it. I loved the texture though.For starters we went for the fish carpaccio (oh dear it was tender and fresh!) and prawn & squid in polenta - these were great too. I mean - we ate prawns with the shells tasting the sea - it was that fresh. Squid was made to perfection too. I never had a fried in polenta lemon - but it tasted stubbly sweet and just a little bit of sour - loved it.If you go there - I strongly recommend going with (a) friend(s) and ordering a bunch of small plates and try different things at the same time. Don't be fooled by the size of their pasta dishes - they look small, but they are filling!Wine list is very comprehensive, and as expected - all Italian - so much sweeter and fruitier than their French counterparts!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hVGwtNetpgdMSgOgv8PWQ"
  },
  "NRRJaUXcSysJcHL1BKK_BA": {
    "date": "6/9/2015",
    "text": "Favorite Italian restaurant in London!If you have a small group, try to snag a seat at the bar.  It is a great area and allows you to watch the chefs working quickly and meticulously to put out orders.  On the food front, opt of the small plates so you can sample a variety of dishes.  Standout dishes of the night included the squid, oricchette, and Agnes' donuts.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dNztDiCJavH2A1jO-DWyeA"
  },
  "rhVC6VHZYgtlujTO_STRzw": {
    "date": "6/3/2013",
    "text": "Ok, So i will be the one ok-ish reviewer of this place I guess. My friend recommended this place and once I saw a review on yelp, I was sold. She booked a table with them, but when we arrived (on a monday morning mind you) we were seated at the bar. This is weird since, we BOOKED a table. It was very uncomfortable too, being in the corner and all. Not to mentioned at some point it was full so the woman sort of came and moved my belongings to accommodate more people. We got starters and mains. The starters (smoked ricotta and the toast with pate) were average at best. I've tasted ricotta in Sicily so I imagine I have a fairly good idea how it should taste. This smoked ricotta tasted like really plain butter/cheese/cream thingy. the pate, to be fair might be an issue of personal taste: but it was weird in taste. My friends got their pastas, which were really average (or below average). Even though they were simple pasta dishes. I got the chicken with lemon and I admit that THAT is the reason this place is even getting 2 stars.The chicken was phenomenal. So my guess is that their mains and quite good. BUT dont get pastas or ricotta or anything.. well... fast food italian. And you should be good. While the chicken was amazing, not sure I am going back to this place for a plate of overpriced chicken breast.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XT2agaZ4EoOi2R25utZOWA"
  },
  "K0J0nLBfwgK1Y-q6eJHPeg": {
    "date": "7/28/2013",
    "text": "Amazing!  My girlfriend and I had the best meal at Bocca Di Lupo on our recent trip to London.  Our server was brilliant and really steered us in the right direction.  Some highlights were the fried sage leaves, fried stuffed olives, and the tagliatelle with ovoli mushrooms. Oh, and the blood sausage and wild boar sausage were delicious!  We'll definitely be back the next time we're in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YvXhbTIZFfrQt0fge0MyzA"
  },
  "AJAoZXQdZmqrtKYzae-5VQ": {
    "date": "12/2/2014",
    "text": "Two stars for the environment and a fairly nice service. But if this is the best Italian in London according to many guests, I feel a bit sorry for London. I had a Spagetti with a squid ragu and it was terrible. No sign of any squid and so much salt in the ragu that we needed another big bottel of water. The dessert, some kind of Tiramisu Ice cream wasn't much better!Bad day in the kitchen or lack of competition to get the status best Italian in London?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b4RFQOyI4vaWuq_315M0sQ"
  },
  "s5JXpWkwtZlqnmEOG7_nyw": {
    "date": "8/24/2013",
    "text": "One of the best places I've tried in London.  We sat at the bar, shared a carafe of fantastic wine, and six excellent dishes.  Standouts were the spicy sausage, the braised borlotti beans, and the sea bream carpaccio.  The polenta with shrimp was our least favorite -- too fishy -- but others might enjoy it more than we did.  For dessert we had the cassata, which was fantastic.  The atmosphere and ambiance made for a perfectly classy but not stuffy evening.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J99HPzd9Cla7M-mW2qEESg"
  },
  "KGk4UAKrxq8fPkHaWH5Lww": {
    "date": "5/19/2010",
    "text": "The service was a 5, but the food wasn't and my stomach is writing this review.  Let's just talk about how stellar the service was.  We got there at 11ish and they close at 12 and they were able to get us seated and our order in when we were there 9 minutes before the kitchen closed and the hostess busted her behind to make that happen.  My coat had fallen off the back of my chair and she just picked it up and hung it in the coat closet (okay a bit strange for not telling me and I asked her when I realized my coat was missing) but still excellent service.  I asked if I could just get a ball of gelato and they said they don't do that they could do a single espresso gelato.  Sold!  But what he forgot to mention is that it is an individual dessert of non-dairy espresso gelato.  People, there is no such thing as non-dairy gelato.  When he saw how disappointed I was he immediately asked me to choose a flavor and got me the most divine ball of pistachio gelato.My problem was that I was underwhelmed by the food.  The homemade bread was flavorless and textureless in my opinion.  We ordered cold spinach, mussels, and two pasta dishes.  They all were good but nothing that said \"oh my\".  And only oh my merits 5 start.  Also be fair-warned that the smalls are big--we ordered 4 small dishes and it was too much.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "tczpxiu42jffHPoKAUZ1fw": {
    "date": "4/12/2013",
    "text": "Outstanding food, coupled with excellent service makes Bocca Di Lupo one of London's most underrated and best restaurants.  Puts the cool, \"no bookings\" places to shame. Book well in advance, it's always heaving.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhoSFyZKpfOH0XC3BTP6hg"
  },
  "VDMc1JioeuevL-7ZsphHWQ": {
    "date": "5/10/2010",
    "text": "Awesome food and surprisingly good service for London. The foie gras sausage was super yum and the guinea was fall off the bone tender. Excellent restaurant!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UZ417tXUyEeP1lRe0uOKSw"
  },
  "FanUg0dFr4G_y7GQ3F_CTw": {
    "date": "9/17/2011",
    "text": "Had a lovely dinner here recently. Admittedly the company with me was good (until she and I fell out later - that's a whole other story though!) but the food was extremely pleasant too. Propped up in the corner of the chef's counter (thanks Rosie on the front desk) it is arguably the best seat in the house. Why? Because you can see the entire restaurant dining floor and the kitchen. Service was attentive and they knew the menu well. Complementary olives from Puglia, bread and olive oil a nice touch. Recommend small plates rather than large portions so you can ''mix it up\" and share. And the arancini selection is a must. We ended up having four different arancini, bruschetta (lovely flavored tomatoes), risotto, a cold broccoli spears dish and pasta. Washed down with a reasonably priced bottle of prosecco and the bill was a neither cheap nor over-the-top £89 including service. Definitely a return trip and back at my slot at the chef's counter!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yf7vvLE4Y96ZqOgI5lf4JQ"
  },
  "gX-Oxm0KDJ2zVg3e_0Hd6g": {
    "date": "10/16/2010",
    "text": "Absolutely amazing authentic Italian food with many regional specialities - a treat of a restaurant. Relaxed atmosphere at lunch - very good service - and very good Italian wine. The best pesto I have eaten outside Liguria, lovely Italian veal sausages and I recommend the Agretti (Monksbeard) if it is still in season. The menu with small and large portions allows a really good tasting menu across 3 or four people. I cannot wait to return with my foodie Brother and over-indulge. I would put it in the medium price range - but worth every single penny and more.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TIvkw_XlnrX0P5GhuLJyUA": {
    "date": "6/24/2010",
    "text": "wonderful food and relaxed vibe - I like sitting at the bar and just showing up instead of making reservations weeks in advance. My favorite Soho place is around the corner for after a good meal at Bocca - Snog Frozen Yogurt",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PXG69Bti8oPpbT6NCt1SMg": {
    "date": "11/30/2008",
    "text": "Bocca di Lupo had only just officially opened (over a week earlier) when I went for dinner, so it's obviously working out some \"kinks\" (i.e. they lost our reservation (but still promptly seated us), our waiter disappeared (but was quickly replaced), it took ages to get water (but they apologized) etc)... However, on the whole, I was thoroughly impressed.  The restaurant is divided into a front bar area and a small, back dining area.  Both are a bit too bright for my liking, but I forgave the dining area its luminance because it is simply beautiful (a stunning, gigantic circular light fixture makes the room).  The long, white marble-topped bar would be much more appealing if softened - dimming the lights and adding some candles would do the trick instantly.  But the food - wow.  I have nothing negative to say.  I was delighted by each region-specific, inspired dish (most come with a choice of \"small\" or \"large\" so your meal can be as you'd like it - heavy/light, individual/shared, value-friendly/expensive).  The food may look simple when plated, but each bite provides an intense welcome of flavour and freshness.  My personal favourite was the spaghettini with lobster, mussels & ginger (just the slightest kick), followed closely by an interesting bone marrow risotto and the pork/foie gras sausage.  Even the bread and accompanying olive oil were wonderful.A great, reasonably-priced wine list and an incredibly friendly staff helped to ensure my return - soon.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "dp1scrCkUAlLHLkv0d94Uw": {
    "date": "3/18/2010",
    "text": "Took my love out for a Christmas lunch (after shopping) here and we had a wonderful time. Service was friendly, the food is sublime - so good in fact I started writing down the ingredients of the salad I'd eaten. Convivial space with enough room between tables to have your own conversation, yet easy to lean over and ask your neighbour what they're eating. I would love to go back there tonight!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0QVsknUTlOBVM_1vBDqQuA": {
    "date": "1/19/2012",
    "text": "I came here for lunch after my graduation from university with my parents and several close friends, and we had the most wonderful time sharing the different small plates. The food is fresh, light Italian, and the wine list was extremely well-thought out. The service was helpful and prompt but never hovering. A really wonderful SoHo gem.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQeW-6DmDHpNeVRxgtfthA"
  },
  "UsPGRc2JJcd9_8Ooh00HKw": {
    "date": "2/6/2009",
    "text": "This new Italian restaurant is the talk of the town and you must go there! We chose to sit up at the chef's counter which is essentially a bar that runs the length of the kitchen where you can watch the chefs at work. The menu is best sampled as small plates to be shared between people. Don't miss the foie gras sausage or any of the pasta dishes which are divine. We also managed to order three desserts between two of us because they just all looked so impressive. Pricing was fairly reasonable as well we ate a lot of food and had six (!) glasses of prosecco between us and it was £50 a head. Good stuff for the quality of food that was served here. You will need to book - the place is packed out.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aet6RSjPtjTD__v0w4bBWg": {
    "date": "2/26/2009",
    "text": "Yet another über-trendy new(ish) Soho restaurant. There is so much vigorous wining and dining activity in Soho it does make you wonder whether or not the credit crunch is an illusion. Bocca di Lupo is an energetic restaurant specialising in Italian regional cuisine. There is a dining section in the back, and a long, marble topped bar opposite the kitchen for those dining at chef's counter. Demand for tables is so high that chef's counter comes with an I'm afraid when you are offered it. However, this is highly misleading. If there are just two of you, chef's counter is the place to be. It's the heart of the action. The cooks themselves made excellent suggestions and are a joy to watch. We had a selection of small dishes, ranging from the slightly uncertain in composition to the assured and inspired. A shaved radish, celeriac and pecorino salad with pomegranates and truffle oil (interesting), a Fritto Romano - whole fried artichokes and veal sweetbreads (intensely artichokey - very good indeed), crescentini with finocchiona, speck and squacquerone cheese (fried bread excessive), cotechino with lentils in balsamic vinegar and bitter clementine mostarda (easily the best dish, delicious), and rustic pork and foie gras sausage with farro and porcini (satisfying, but not especially memorable). Lots of fun. We had two pretty good desserts, and dessert wines. The wine list is tremendous - carefully conceived, eclectic and very much a celebration of Italy's famously obscure and unusual grape varieties. Service was good - we felt looked after personally. Bocca di Lupo is a delightful place and deserves a visit.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zwpjp8Eexkcjo9nK7K58oQ": {
    "date": "5/9/2009",
    "text": "Not a huge amount to add to the reviews above but I would reinforce the choice of sitting at the bar - especially if there are only two of you.Also great to see different sizes of almost all the dishes.I will return.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "l1qz8mgCKG1igMeFeGPJRg": {
    "date": "1/22/2009",
    "text": "Ex Moro head Chef Jacob Kennedy has gone Pan Italian and is producing very well turned out Italian Regional classics (small and larger plates for most dishes) The menu describes each dish in English and the region it originates from. The wine list is very well chosen with many of the great winemakers in Italy represented  however I was disapointed to see they had chosen Umberto Cesari's Sangiovesi di Romagna instead of his superb Super Emiliano  Liano a blend of Sangiovese and Cabernet Sauvignion. I need to work my way through the menu but today I had Tuna Tartare which had capers and pine nuts in the dressing followed by a risotto of bone marrow , barolo and radicchio di Treviso. The Tuna was delicate and fresh and a good way to wake the taste buds. I liked the Risotto but I'm yet to have a one in London that is as good as the ones I make myself at home or reach the heights found in good restaurants of all classes in Italy. I suspect there was a lack of flavour in the stock and an element of pre cooked rice so it was not cooked and stirred for 15-20 minutes from scratch. I finished with some excellent well kept Tallegio served with fennel ,grapes and rose hip honey. My guest had a lovely procutto crudo of lamb and some scallops with rocket followed by Sanguinaccio  a sweet pate of pig's blood chocolate with sourdough bread which was actually very interesting if somewhat rich. We shared some Puntarelle with anchovy with our mains and they were as good as I have eaten in Rome. As I said I look forward to working my way through the menu especially Cotechino with lentils in balsamic vinegar& bitter clementine mostarda Romagna ,Boiled beef with potatoes & salsa verde and Rustic pork & foie gras sausagewith farro & porcini.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DIAg-TXpP3AL_96X0HvQGw": {
    "date": "2/18/2011",
    "text": "We ate there in Feb'11. Chose 4 different half plates as oppsed to 2 mains. The nettle borage pansotti, cod cheeks and the fried prawns where good but nothing to get ecited about. My partner really loved the white polenta accompanying it. But the 3 cheese tortellacci was amazing with a burnt sugar and walnut sauce. Unfortunately only two small pieces so had to savour. Lovely prosecco and 2 gorgeous light reds Blauburgunder and Morgante Nero d'Avola. Dessert we had brioche with ice cream and a fresh donut filled with chocolate sauce. Again good but not exceptional. Would had preferred to go else where. Sat at a table at the back. If go again (unlikely) would be for the wine and to sit at the buzzy bar. Bill for 2 came to just under £90. Great wine, food good but way over priced.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dqHvWOCrsLRZAPRtA5-79A": {
    "date": "10/6/2010",
    "text": "fantastic! would recommend to anyone. The service was brilliant, all the wait staff were friendly and we weren't rushed at all. Food was delicious, even though expensive. I'd rather pay good money and have food that I still dream about for days after though",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7qwt2npnGmcXyoiz74Na6w": {
    "date": "6/30/2009",
    "text": "Beautifully unusual dishes using inspired combinations of underused seasonal dishes. We chose to have lots of smaller dishes, only dish that didn't hit it's mark was salt cod (which I found a little too salty (yes I know!)) but my partner loved it. Great advice from the wait-staff too. Shame that there were a few people that abused the 'who's next' system of waiting! Other than that, great.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DAL_PylMlj7g4vb6ZYkS4w": {
    "date": "6/18/2009",
    "text": "Having read fabulous reviews I was horribly disappointed when I went for lunch. Firstly, it is incredibly noisy and so my husband and I were almost shouting at each other to be heard. The food was just not very good - langoustines and peas as a starter was dull, as was the mozzarella and rocket salad. My main course of suckling pig was almost all fat and no pig, although the bream was lovely. The staff were nice and reduced the price of the meal because of the pig and also gave a complimentary drink but I wouldn't go back there.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nDZVh4iQtt4qHzP-fd1IbQ": {
    "date": "7/28/2014",
    "text": "My lovely London based friend researched and booked this place. Boy was I pleasantly surprised!Italian cuisine is so well represented and interpreted around the world that I'm often disappointed. It's hard to find a fresh angle to pastry, sauce and protein - but I think Bocca did it. Everything is small dish style and our waiter was very patient in explaining everything to us. We followed his recommendation and the portions we ordered were spot on. My favorite was the orecchiette nduja... Spicy, flavorful pasta. It is very appropriate for summertime palettes with the fresh herbs and tomatoes. While service and main dishes were sensational, dessert felt a bit non inventive. Instead we walked to another place nearby to get sweets. Overall I will come back. It gets packed so do book ahead!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "od-RCdl-xDtW5VJKH4uMZQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Lamb and lamb bacon ragu special (small)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/od-RCdl-xDtW5VJKH4uMZQ/o.jpg"
      },
      {
        "img_id": "rhnz6H3zEyjEeegHLzIzmA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. orecchiette nduja - spicy tomato sausage pasta. Best dish we ordered",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rhnz6H3zEyjEeegHLzIzmA/o.jpg"
      }
    ],
    "user_id": "pvi_baolWn7mrtcb9rWAEw"
  },
  "i0zYoF8-xUw5wZwbBq1Dvg": {
    "date": "7/14/2014",
    "text": "What a lovely little Italian restaurant in the heart of Piccadilly!First, food was solid.  We ordered calamaris and fried artichokes/mozarellas for starters, then an assortment of pastas/raviolis (crab linguini, spicy sausage, ravioli in olive sauce with nuts, plain tomato-based spaghetti) for main, and everything was perfect.  In particular, the calamaris were the freshest and the tenderest that I had ever tasted; it even beat out the high standards I experienced in Italy!  Also, my crab linguini was impeccable.  As you might have noticed from my reviews, I'm generally a fan of tomato- and seafood-based pastas, and this ranks as one of my top three such experiences.Second, service was good.  I had made this reservation as a surprise early bday dinner for my mum, so asked for candles to be brought out when we order desserts.  Unfortunately, they slipped on this request, after which I raised a gentle complaint.  They were quick to bring out a new dessert on the house complete with candles, and three different staff members came by to check whether everything was okay.  In general, they were friendly and eager to help from the moment we walked into the restaurant, so I appreciated the service despite the slip-up.Highly recommended if you're looking for a wholesome Italian meal while strolling around Piccadilly!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "7y_m-cx1A50KIb2b0Az7VA": {
    "date": "6/3/2014",
    "text": "Excellent service, excellent food. A tad overpriced but great quality. Very authentic, having lived in Rome for three years I can honestly say that this is the closest any other place has come. The small pasta plate means SMALL are lovely for a starter and the food is always the best quality here. They change the menu frequently and use the freshest products straight from Italy. The venue itself is very small but if you can grab a table it is truly something special. You can make a reservation online, and if its only for two people they normally just reserve you a place at the counter, which personally I find uncomfortable (although you do get a great view of how the food is prepared) A little trick I use here is I reserve online for 3 people even if its only for 2 and they you are guaranteed a proper table.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S6Ltt6w6H83OxsvCr4AFdw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Rabbit saltimbocca with lamb sweetbread skewer in the back!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S6Ltt6w6H83OxsvCr4AFdw/o.jpg"
      },
      {
        "img_id": "qqHPeSwDAvrFsefeHqxl2Q",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qqHPeSwDAvrFsefeHqxl2Q/o.jpg"
      }
    ],
    "user_id": "bdTzsZcoyzKdSz21SX_YyQ"
  },
  "cujpjJ8S5lhwi3XCOGp6JQ": {
    "date": "12/27/2013",
    "text": "Absolutely loved this little gem of a restaurant.  The food was fantastic, particularly the pumpkin ravioli!Our server was on point and when asked which of the barbera wines was a better choice, he completely nailed it.Very content, over ate but it was worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "w4j0OUsRxG46JZJgzYeHrQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. 2011 Barbera D'Alba",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w4j0OUsRxG46JZJgzYeHrQ/o.jpg"
      }
    ],
    "user_id": "40teYGl9oZc5wrPkeZAoaA"
  },
  "_-84IokJy169Fgs_53a4eA": {
    "date": "8/19/2015",
    "text": "The stuffed olives, lungi sausage, and the lamb tagliatelle were standout, as were \"grandpas balls\" dessert and the red wine. Sambuca was good as well. Fried artichoke, radish fish, and chicken were all good, just not as good as the above dishes. Service was friendly as helium, the waiter walked us through the menu. Wis the bar stools had backs. The real downside was the prawns. Just no value and the taste was bland. One downside of the whole place. Can't wait to come back and try other great Italian small plates.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gb78aM_aRxU8LUYb-gnTMA"
  },
  "0vjLVwsFd_XpwBlqA7vvYA": {
    "date": "6/22/2017",
    "text": "We stopped in here without reservations before a show.  It was extremely busy but they managed to fit us in at the bar overlooking the kitchen.  The food was outstanding and the service perfect - they managed to get us in/out without an issue for the show.   Everything we tried was excellent and we will for sure be headed back - next time with reservations :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Wy_28316uqg_cwt93eANA"
  },
  "BOy1dXg0QWksHnvbebSjiQ": {
    "date": "10/11/2016",
    "text": "Kind of like Italian tapas if you share small plates. They recommended no more than 3 plates per person, but they will help you if you need it. The service was really quite good. Even if you're seated at the counter, you don't feel like you always have to move out of the way or keep being hit by people passing by. Also, if you're sitting at the counter, you're right in front of the open kitchen. Highly recommend the tagliatelle with crab.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Z2VkPJpOcBdSbxGKRY8Nw"
  },
  "tTlbootEoCUr8Cuf_KB62Q": {
    "date": "10/11/2016",
    "text": "Hard to get a seat but worth the wait. We are at the bar. Two people and we are stuffed. Fantastic food. Good service. The carpaccio was the best I ever had, then the roast pumpkin, then the tagliatelle. Could have lived with out everything else but all solid scores over all.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HM3gB4bIy_abM7k-vVXD0g",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HM3gB4bIy_abM7k-vVXD0g/o.jpg"
      }
    ],
    "user_id": "17-kRmeceNF_3g7YlQK_bw"
  },
  "irVH5F_yzo12pGMERZcFGg": {
    "date": "9/19/2013",
    "text": "It was lovely. Food, service, decor, and atmosphere were fantastic. All the food was really great, but standouts were the fried sage leaves w/ anchovies, burrata w/ eggplant and tomatoes, and radish salad w/ truffle oil. I'd definitely go back on a special night out. Or sit at the bar to treat yourself!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K2yh5wKn-IurVWPoRIJ-6Q"
  },
  "6-UFhMLZu0_neRqtoTExHw": {
    "date": "8/24/2013",
    "text": "Perfection from beginning to end! Our waitress was so kind and offered suggestions as we ordered with regard to portion size. Most of the dishes come in a small or large sizes. We really appreciated her help as the portions we had for each dish were just right!I normally prefer table vs counter seating but at the counter you watch them prepare all the dishes which is always fun! After savoring every bite, head over to the gelato shop across the st!Radish, celeriac, pomegranate & pecorino salad, truffle dressingArtichoke alla giudiaOrecchiette with sausage ragúSpicy sausagePork neck with honey & rosemary",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "JJAW_J4qPV5PK3t3o1meBg": {
    "date": "10/15/2016",
    "text": "We enjoyed this gem of an Italian restaurant. It has a modern, fun, and classy vibe. The menu has a wide selection of appetizers, pastas, meats, and more. We went for a tapas-style approach by ordering 4 small plates of pastas. Highly recommended for dates or an evening with friends or family.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGoUbZfd--RtqUS4hizVeA"
  },
  "RjDVbekLS3X4VGjfngjKEA": {
    "date": "6/13/2016",
    "text": "Arrived around 1230 on a Sunday. We quickly took a seat at the bar, which was empty but filled (and the tables) to capacity by 1. We tried a variety of different items - a crab bruschetta, Parma and melon, gnocchi, octopus, and a type of bean we were unfamiliar with. All were remarkable. As was the bread basket and olives they brought out. They suggested a white wine they were offering at a special price (20£ for a carafe plus glass each). It was perfect for our food. We ended with a dessert (same owners have a gelato spot across the street). Our server was great - so friendly and helpful without being too stiff. She made us feel comfortable and always well tended to. Can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6S3HQMrWUXCLSqkq3ZoJg"
  },
  "FW_IcQ1SP-CMGReTiBBwfA": {
    "date": "1/13/2015",
    "text": "A must visit and a perfect seat in front of the kitchen at the bar!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GU5qqkyskXWKxpbksHVIdQ"
  },
  "pybg60N_fkL7llKMpHC3-w": {
    "date": "10/30/2016",
    "text": "This place is so close to being a 5 * place.  Let's start with the good.  Food is delicious. Perfect piping hot al dente pasta.  Amazing broccoli side. Suckling pig although delicious needed a little help. The skin was not crispy and they should have deboned it prior to serving.  Otherwise a great meal. Pretty great food. Head chef definitely had good command of his kitchen. Hard to complain about that.  Service was a bit lack luster.  My server did not take my order long after I had a glass of wine which I did not like and switched.  He was uneducated about the wines and instead encouraged me to just order the most expensive offerings. My silverware was taken away and replaced with the exact same silverware.  My bread plate was taken away far in advanced of my first course. During the middle of my first course he came to warn me my main course was on its way instead of waiting for me to finish before having the main course fired.  He brought me silverware for my main which again came with another set when served. Although he wiped down the bar for others he did not do this for my first or main course. The bar was only moderately busy and I expected better service to match the food and decor. Side note bartender was great in noticing I did not enjoy my wine and swapping it for something much better.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jBz-hEEWEW8Fj8cNhasfDA"
  },
  "UDrjV3gyEnI8rylTmhRPTA": {
    "date": "1/19/2015",
    "text": "Italian tapas that is unbelievable! Going back for a second time today. The pasta dishes are so good!!! I highly recommend this",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AyH0HZdKWCJ124yzJBPjlg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Pumpkin filled pasta, our favorite",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AyH0HZdKWCJ124yzJBPjlg/o.jpg"
      },
      {
        "img_id": "wQNTIJ1-qv2IVuUz2nP6bQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Lamb skewer and roasted pumpkin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wQNTIJ1-qv2IVuUz2nP6bQ/o.jpg"
      },
      {
        "img_id": "Qwe1myxy_NHsSSC7SU0dOA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Truffle risotto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Qwe1myxy_NHsSSC7SU0dOA/o.jpg"
      }
    ],
    "user_id": "x-9AN426Qpj8TXE6KA_yNw"
  },
  "CbnEvs5XNGWQOC_Q8Fscog": {
    "date": "5/6/2014",
    "text": "So much love for the pasta here!  I love this place.  Its pasta beats anything I've had in London so far.We had (favorites in asterisks)*Ricotta ravioli with butter & sage (delicate and soft)*Orechiette with 'nduja, red onion, and tomato (spicy and really delicious)*Spaghetti with anchovy, saffron, pine nuts & raisinsSpaghettini with rabbitGrilled lambCalamariGnocchiFoie Gras Luganega (sausage) courgette flowerCassata Siciliana (cake with marzipan, fondant, and pistachio)Dairy free espresso gelato (amazinggggg)The only thing disappointing was the foie gras sausage.  It seemed kind of a waste to put it in a sausage because the flavor disappeared amidst the rest of the meat.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "dJCUpJ62SrH6Scqmv7guXg": {
    "date": "4/30/2014",
    "text": "I'd never thought that, as Italian, I would love so much an Italian restaurant in London.I highly recommend it: interesting and original menu, fresh ingredients, nice atmosphere. I hope to go back soon.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pZNnB_YLu0HNdl22bWiJxQ"
  },
  "SSffRTysTIqq5NRhVZRFmw": {
    "date": "8/24/2013",
    "text": "Visiting here from the US and was looking for a good place to have lunch.  Came across this place on yelp so I decided to give it a try.  It's a bit hard to find so you won't just run across it.Got here around 230pm at the tail end of the lunch crowd.  Was seated immediately as I asked for the bar which is right beside where the food is prepared in front of you.  I ordered 3 of the small dishes.  Carpaccio of beef, orichiette, and malfatti.  All were extremely good.  The service was quick and the food excellent.  The only downside is that it's a bit expensive.  All in all, very good lunch!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PDV7elERX-oTBRAlkiZQcg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PDV7elERX-oTBRAlkiZQcg/o.jpg"
      }
    ],
    "user_id": "PK2HTzRAlfG-9-u9pdXDvw"
  },
  "WpJG4evvgvnRy8M7OTIn4A": {
    "date": "3/17/2015",
    "text": "Had a nice Mother's Day dinner here. Place was full and a bit stuffy, but had a nice lively environment. The starters were alright, seafood salad, caprese and radish salad were good but not mind blowing. The best was definitely the pasta, all executed well and flavourful cooked perfectly. The tortellini I'd highly recommend as well as the seafood risotto. Dessert is disappointing, relying too much on ice creams from Gelupo. Profiteroles were hard and the ice creams did not go well with it",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a5ALiTENc-5DTEJVKtwMfg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Pastas the best",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a5ALiTENc-5DTEJVKtwMfg/o.jpg"
      },
      {
        "img_id": "RkDVxmO73vvKlWc8fd2Gng",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Starters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RkDVxmO73vvKlWc8fd2Gng/o.jpg"
      }
    ],
    "user_id": "8PheOCW6OT_QQ4g5wul0hQ"
  },
  "rUYjDpCEb3ivAMeXnxY5pw": {
    "date": "7/23/2014",
    "text": "To be honest, I'm shocked I haven't officially reviewed this place yet. This is hands down one of my favorite restaurants in London.The food is very inventive and simply delicious. Everything is extraordinarily fresh and the flavors are pretty fab. To make matters even better, you can order small plates and share with your fellow diners to maximize the tasting experience. My favorites are typically some of the pastas as well as the vegetables. Make sure to save room for Gelupo across the street! Owned by the same owners as Bocca di Lupo and tastiest gelato in all of London.Advance warning, definitely try to book ahead. Sometimes you can get lucky and get a seat at the bar (prime viewing spot of the chefs at work), but best not to risk it when such high quality Italian is involved.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uJX434DN-_mIPBVVxn9AQ"
  },
  "_CqbIW4iqq5ymYOJ8BEGWA": {
    "date": "3/25/2017",
    "text": "Had a reservation for a table ,We came with our baby , the restaurant was practically empty . It started with the hostess who said that our reservation is for the counter but my booking conformation was specifically for a table.  We were treated like leopards just because we have a baby . Staff completely humiliated us and we left . Worst experience ever . Shame on you !!! I wish you just wrote on your website :we hate children ! FYI our baby came with us to all kinds of elegant restaurants and was absolutely a delight . I would never brig him if he was making fuss every where We made a real effort to get to this restaurant , staff was really not courteous and unhelpfull!",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g9WLoGmqqCvHCuiIS-fjKg"
  },
  "Zh_D_xvo1MP7xSWy7QK9NA": {
    "date": "12/2/2015",
    "text": "My partner secretly got us reservations for our 5 year anniversary. They gave us a glass of bubbly and presented me with a premade menu with everything that is vegan or could be made vegan. Love it! Effort!! So we ordered nearly everything I could eat and a bottle of wine. The staff were lovely, helpful and didn't rush us. We treated ourselves well that evening! Thank you so much Bocca Di Lupo for treating us so well!Food: artichoke bruschetta, fried whole artichoke, mushroom risotto, broad beans & spinach, borlotti beans & tomato, aubergine, peppers & stewed potatoes, plus welcome breads, oils, and olives. It was a lot (check the photos!) We then rolled out across the street to their sister establishment Gelupo for a light dessert.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jVP5oFJxejCpmn6QOJJwnQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Vegan table!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jVP5oFJxejCpmn6QOJJwnQ/o.jpg"
      },
      {
        "img_id": "zVFaEjxC2zKobIIA2SZLMA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Mushroom risotto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zVFaEjxC2zKobIIA2SZLMA/o.jpg"
      },
      {
        "img_id": "6sIt1W64GqceF_Rdrv4eaw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Broad beams &  spinach",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6sIt1W64GqceF_Rdrv4eaw/o.jpg"
      }
    ],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "FEz1qP-48FJ7gRfja1GmUg": {
    "date": "1/24/2016",
    "text": "Just hosted my birthday lunch at the private room. It was a really nice lunch with a really good group of friends. The good and the bad bits are below.GOOD POINTS-We had a dedicated waiter. He was absolutely great. Always there when needed, very discreet and extremely professional.-The food and wine was absolutely amazing. Everyone loved it. So sophisticated and simple. The quails were cooked to perfection. If anything, there was too much food.-The space was brilliant and I recommend it to everyone that needs to host a medium sized function somewhere.BAD POINTS-The worst part about this was the P.R. or whatever his position is. After trying for three weeks to talk on the phone with him, I managed nothing. In all fairness, I don't even know if it's a he or a she. Email communication was very unprofessional and even my name was spelled wrongly.-Also, and this is gonna make me think twice about going back, being a private function, I chose the menu and my guests had a choice of three different options for each course. My only demand was that one of the options was vegetarian because my partner has a severe allergy to meat protein. I was less than impressed to find out that the P.R. had done nothing about it and there was no vegetarian starter or main course. Thumbs up for the chef that improvised something.Final piece of advice: make sure you try bocca di luppo, but run as fast as you can from the reservations manager. It would be a much better place if they had someone competent doing his job.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WDr67c8pP6VgPc7k6JQ98g",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Delicious pudding, although extremely decadent (classic menu @ Remus room)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WDr67c8pP6VgPc7k6JQ98g/o.jpg"
      },
      {
        "img_id": "UFMmgojTf3SukrAlVNB1sQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Sea bream (classic menu @ Remus room)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UFMmgojTf3SukrAlVNB1sQ/o.jpg"
      },
      {
        "img_id": "HnKYT45vwxIxrPs2myYWyA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Braised quail with polenta (classic menu @ Remus room)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HnKYT45vwxIxrPs2myYWyA/o.jpg"
      }
    ],
    "user_id": "RcqPTpK32msBgpPQ-41LMQ"
  },
  "nDJdzDENudA7XCpDREVOPw": {
    "date": "10/14/2016",
    "text": "Oh my gosh, yes, a thousand times yes!I didn't realise how diverse and delicious italian food could be!Deffo try lots of different mini pastas, the fried artichoke and the salted baked fish. Can't wait to come back soon.I would recommend booking as early in advance as you can as they do get booked up quick!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OepicbUeYRwxGWM_rp1JRw"
  },
  "aWyZeF2hH7mt7nYeeZSdag": {
    "date": "10/27/2016",
    "text": "Bocca di Lupo has been on the top of my to try list for the longest time - finally got the chance to try it after a West End show (Curious case lets out less than two minutes walk away) - we were able to get in given we arrived around 10pm (otherwise reservations go very early online) and were seated right away - we got a couple of starters and mains to share - everything was delicious and lived up to my expectations - it should be stated early on that it was the desert that blew me awayStarters Celeriac root salad with truffle dressing and pomegranate - delicious, trademark dish, refreshingFried sage leaf with anchovy - unique and delicious- love sage leafDuck pappardelle - pasta was homemade, thin and delicious- the sauce was not too heavy and filled with good proteinFish - it was the special of the day (swordfish) paired with potatoes Roasted pumpkin - delicious - I want the recipe for this Dessert was the cassata Siciliana which I want to eat every day if I could and a blood orange granita - I still dream about the sugared orange and the marzipan in that cake",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MecQjgCcynl-5I1cuCGwVg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Cassata Siciliana !!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MecQjgCcynl-5I1cuCGwVg/o.jpg"
      },
      {
        "img_id": "DR-nE4Gq2qpsBivZi0QuZA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Roasted pumpkin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DR-nE4Gq2qpsBivZi0QuZA/o.jpg"
      },
      {
        "img_id": "PLNAaqQPFjCfcWmhQVjdQg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Swordfish with potato",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PLNAaqQPFjCfcWmhQVjdQg/o.jpg"
      }
    ],
    "user_id": "myzP-7xQtc4ag8Va1hfyQg"
  },
  "-Y82HIxWY8JXA7h8vutEoA": {
    "date": "1/3/2018",
    "text": "Dishes are absolutely delicious, high quality Italian cusine! Staff recomended us some lovely dishes, and that was the right choice, we enjoyed so much. They were kind and atentive. You must have a reservation, If you don't - prepare yourself for waiting.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WEmQCt3kaoKqj4Q9KW6TRg"
  },
  "TxyM5k6M4VUgq7XXavlGkg": {
    "date": "7/24/2016",
    "text": "Bocca Di Lupo is an Italian restaurant that has dishes covering different regions in Italy. We tried:- Seabream carpaccio with orange & rosemary - to get the full flavour of this dish you will need to sqeeze some orange juice, otherwise I thought it lacked flavour.- Grilled mussels with chilli oils - a simple dish that was nice, but it would not be a stand out dish for me at Bocca Di Lupo.- Bagna fredda (chilled anchovy & garlic cream with fennel, potatoes, bread and mammole artichoke) - an interesting dish where you dip the vegetables and bread in a soup looking sauce. The dipping was full of flavour which made it suited to go with the bread and vegetable which was on the bland side.- The Caponata (aubergines, celery and tomato in agrodolce) come in the option to be served cold or warm. I prefer it warm. Love that the vegetable cooked until it is soft and it compliment the meat dishes.- I found the texture of the risotto too hard. Although a good risotto is al dente but I thought it was too much with a crunchy side. Alternatively the pasta did not disappoint us.Bocca Di Lupo's roast/grilled dishes on the menu was the highlight of my evening.- Whole slow grilled leg of milk fed lamb with garlic, wine and honey. This dish cost £55 which is for two person to share. The meat was tender with a sweet honey taste.- Roast suckling pig with chestnuts, white wine & bay leaves for £26 would be my second favourite dish of the evening. Crispy skin with succelant meat under it.- Agnell cacio e uiva (lamb braised with white wine sauce thickened with egg yolks and pecorino) I thought by look was not a pretty dish on the plate.We managed to finish our meal with dessert, but unfortunately some of the dessert were already sold out although it was not even 9 o'clock.- The Bonet (chocolate, coffee, amaretti, caramel &amp; rum pudding) was very sweet and is for those with a very sweet tooth. For me one or two spoonfuls is enough to satisfy my sweet buds.- The Baba with baked rhubarb and cream I thought was like bread soaked in water. The portion size of this can be share. Compared to the bonet this was not sweet and more on refresh side. But it was my least favourite dessert of the evening as soggy bread really does not take my fancy.I did enjoyed the food at Bocca Di Lupo but I was disappointed by the service. Our waitress obviously was trying to get us to finish so they could turn the table. Me and few of us arrived 20 minutes early than our booking and we were shown to our table. However, even before our booking time we were already push to order and asked when the rest of our guests were arriving.I was already aware that we only had the table for 2 hours and 15 minutes. So when we were offered the dessert menu and needed to give the table back on time, we tried many time to politely get attention of a staff to take our order. Finally when our waitress wanted to take our dessert, she comes over and decided to take the menus off us, giving us the impression that we had no time for dessert.I know they are busy and want to turn as many tables throughout the night. But I think our waitress could had done it in a much more polite way. Other restaurant has been able to do it in a much better way. I wouldn't recommend this place if you don't want to feel push with your dining.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQJp6mwCMRCBLXDsF_cGAQ"
  },
  "jh8xduMQuV0t-v2wo6W5Ig": {
    "date": "7/9/2017",
    "text": "Where do I even begin - The food here is overpriced for the portions you get. Staff is really rude and will treat you like trash if you don't appear to be old or wealthy enough. Service is absolutely HORRIBLE - they turned away two friends that came along with us (even though we had a table booked) because they had a toddler with them and apparently this place despises kids. Also, we were there for a friend's birthday, and wanted to cut a birthday cake while we were there. Staff quoted us a figure of 10 pounds PER HEAD (i.e. 10x10=GBP100 TO LET US USE THEIR CUTLERY AND SING A BIRTHDAY SONG IN THEIR PREMISES). When we asked what other options we have instead of paying this exorbitant fee, the witty waitress told us to go to a garden in Soho and cut the cake there (like a bunch of hobos). Anyways, food was mediocre and SOME dishes were okay. However, just don't bloody come here... until they do something about their shitty service.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IEPd59cOzfWx_3BmwsHOCQ"
  },
  "hY6NP8-vMSctl7pQmoI9dw": {
    "date": "7/23/2016",
    "text": "Every dishes are full of surprises! Small sizes are good for shares, very nice place to go for a pre-theatre dinner!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KLEoOabhvjM4yTEPWUhRIw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KLEoOabhvjM4yTEPWUhRIw/o.jpg"
      },
      {
        "img_id": "n3NudzxhrgSyTaJrhNrQyA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n3NudzxhrgSyTaJrhNrQyA/o.jpg"
      },
      {
        "img_id": "Rq1aqD5aGeSEl-awoBlkyA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rq1aqD5aGeSEl-awoBlkyA/o.jpg"
      }
    ],
    "user_id": "28OReSay2Ih9TSsi1RtuDQ"
  },
  "NEVLpcVW06XM_hjUVHp_xg": {
    "date": "8/18/2016",
    "text": "Was able to find a table for a large group fast The waiter who took the order was rude , which gave a negative vibe to the placeWe ordered the fried sages , buratta cheese , bruschetta as appetisers (all good except the fried sages)The tagliatelle mushroom was ok , and the sea bass was very good .",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "REWGP_0hUGmkygequIuXZg"
  },
  "HUO1U5PyjaYkAzvIQwtVzg": {
    "date": "4/30/2017",
    "text": "Some of the best, authentic Italian food I've ever eaten.   Had the opportunity to sit at the bar and enjoy this meal all while watching Noah, a young chef on staff cook.  He was awesome.  The dishes were excellent and menu was presented in an Italian tapas style so you get to sample many different preparations and dishes. Reasonable prices as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pR-2SkuK5qWNb9CXOddtxw"
  },
  "stW2gDLrwj91lwcvpkB32w": {
    "date": "7/23/2015",
    "text": "Accommodated me at the bar with no reservation. One of those bars that's too high to eat off of but fine. Sat right in front of the head chef which was cool to watch.  All dishes had a small and large side which I appreciated as a solo diner. I got to try more things than usual so great for family style, if you are into that sort of thing. Best dish was the starter of tuna confit mixed with arugala tomatoes fava beans and onion. Tuna had so much flavor and fatty tasting goodness. Think this was a special for the day though. Next had the linguine with tomato sauce with squid and added clams. Good but nothing mind blowing. Then tried a fennel sausage over bed of tasted onions and finished with an espresso gelato. Gelato had a very good espresso flavor. Food was great would go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hkhSPhf8guyWqxrhg6jJSA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Tuna confit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hkhSPhf8guyWqxrhg6jJSA/o.jpg"
      },
      {
        "img_id": "y1X_Mt9x38P1ndotgSqLlw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Tomato sauce pasta with squid and clams",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1X_Mt9x38P1ndotgSqLlw/o.jpg"
      },
      {
        "img_id": "Kj4J1iEEZBzRmv8ckOLVrQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Fennel sausage over onions",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Kj4J1iEEZBzRmv8ckOLVrQ/o.jpg"
      }
    ],
    "user_id": "s4cqCZBm3qAPGaZGhtSGpA"
  },
  "dVlItfzME6Mht5HPV41EAg": {
    "date": "6/29/2016",
    "text": "One of my faves when I'm in London. They are very easy to accommodate you without a reservation. Although highly recommended to do so. I recommend almost everything in the menu... And yes I do eat a lot!.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qmMJlekYbcjUjN96RTl7A"
  },
  "E4QDZ98R_q0KKQwApzkXOA": {
    "date": "10/27/2017",
    "text": "The food was good, but if you are looking for those favorite basics, like Spaghetti and Meatballs, Lasagna, Bruschetta, or Garlic Bread, you won't find that here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97R6VG7G6EbzZHgGsVtXqg"
  },
  "W9jLnTKzq-ua35MvvjRCYw": {
    "date": "6/1/2016",
    "text": "This is my favorite restaurant in the whole world and it is what I miss the most about my brief 6 months in London. Everything is fresh, in season and absolutely delicious! I highly recommend the sweet breads, the orecchiette, king scallops, sage leaves with anchovy.. It is a little difficult to get a reservation. I suggest reserving for two people via open table and asking to be seated at the counter by the by window side. It is pricy but they have a pre theater menu is that's less expensive.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gIuw1ePERd3e5tD7reTLOw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gIuw1ePERd3e5tD7reTLOw/o.jpg"
      },
      {
        "img_id": "Xzx2WnrPCE-cHJDGyj52Vg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. From the counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xzx2WnrPCE-cHJDGyj52Vg/o.jpg"
      },
      {
        "img_id": "Bd-NxsA0KuVrG4t54bbsiw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Bd-NxsA0KuVrG4t54bbsiw/o.jpg"
      }
    ],
    "user_id": "9uVLAQFY9DJWC75f4VT7hw"
  },
  "jXf-Bur9q-fSIHFFjeMvhQ": {
    "date": "2/7/2016",
    "text": "After reading a number of rave reviews for this place, and having a lot of people highly recommend it, it was a big disappointment. We ordered a variety of small dishes for the four of us. The black risotto and the veal saltimbocca were great dishes with a lot of flavour and textures, but the remainder failed to impress. The tagliatelle ragu - pasta was definitely overcooked. The lamb chops were over-fried with rather limited flavour. The sides were underwhelming as well. The mozzarella was as expected. Overall there was nothing that we had that would make me say - wow I want to come back!Went to gelupo next door for dessert which never disappoints.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbO4rGTxcZqWooDRe4xHCw"
  },
  "S6j1Rpzqvi-tl5uRy5_SZg": {
    "date": "4/19/2015",
    "text": "Probably my favorite Italian restaurant in London. Have eaten here at least 4 times and it has always been great. Service is really good.You can have small dishes which is a great idea because you can try more of their specialities. If you seat at the bar, that is by the kitchen, you can enjoy the chefs cooking for you.  I had the fried artichoke, which is delicious and also so petty. The carpaccioThe incredible burratta and tomato saladAnd the lobster risotto.Dessert menu is also fabulous, but last time I had eaten too much and decided to slip it. Highly recommend restaurant",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4BAo0TITiq0S1JLtfK3_WQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Beautiful and delicious olives",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4BAo0TITiq0S1JLtfK3_WQ/o.jpg"
      },
      {
        "img_id": "yywakHj_dyiy9P_EWMDVmw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Lobster risotto",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yywakHj_dyiy9P_EWMDVmw/o.jpg"
      },
      {
        "img_id": "LIP_UVHkyWoEmh_N4iMtuA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Burratta and tomato salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LIP_UVHkyWoEmh_N4iMtuA/o.jpg"
      }
    ],
    "user_id": "RhGCsVzdv5Zr4jTW_vcXew"
  },
  "wCq0LeO4AI70m6lIDVqxhg": {
    "date": "9/14/2015",
    "text": "I adore the taste of Ricotta Ravioli with broad bean pure and peppercorn. I think it's my favourite meal on earth from now on. I haven't ate a dish so cooked to perfection lately. The combination of flavours is fantastic and I wouldn't mind eating it every day for lunch. They have an outstanding selection of other pasta meals and this restaurant goes to my top 5 of Italians in London. The portions, like in decent Italian restaurants are huge and enough to share. Who's coming back with me to eat Spaghetti?",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OOy2c56e3JV6OQO9oGgb6A"
  },
  "Hrtu6Z4fW4NMFVzgA-a6zQ": {
    "date": "5/19/2014",
    "text": "The best Italian food I've had in London.There. I've said it. No, really. Can I give six stars? At least five and a half? Please?I need to get all of this down now before (God forbid) I start forgetting things, and whilst still under the influence of a warm afterglow from having had truly spectacular food.And the small/large plate distinction. Fanbloodytastic. In the end, 7 smaller dishes came to the same price as 3 large ones. And my God I was glad for the opportunity to try more of this amazing food.My only disappointment, honestly, was that the best (main) dish of the day - the fried sage leaf with anchovies - was the first thing I tried. I think I made a face, contorted with such bliss, that must have made me look (even more of) a loony (than usual). Salty, crunchy, wonderfully balanced.Milky, perfectly-fried balls of mozzarella were delightful. I've not seen this level of skill much outside of Japan, to be perfectly honest - and the ingredients were just of the best possible quality.A singular pasta dish - why, oh why, was there only one pasta dish - was exquisite - the orechiette as beloved by so many other Yelpers - and I'm running out of superlatives here. Perfect pasta. I soaked up the rest of the wonderfully spicy and yet complex pasta sauce with a little of the remaining bread with completely undisguised glee.A risotto was perhaps the only slight let-down. But then I've never really been a fan of risotto so I must on this occasion defer judgement - the waitress suggested that today's rendition was slightly too cheesy and slightly too creamy - completely without prompting - and whilst I admire the honesty, that's a level of criticism that even I find too harsh.Drinks.I only had one - an Aperol Spritz. It was, by some distance, the best example of the drink I've ever had - almost certainly due to the use of anything other than bargain-basement Prosecco. Beautiful and so refreshing on what was otherwise a glorious May weekend.Dessert of profiteroles was as close to perfection as anything I've ever had the pleasure of eating. The pastry very much played second fiddle to more than generous portions of tiramisu, gianduja and ricotta and cherry ice cream, the latter of which might just have been perfect. I'm only really ashamed to admit that I only licked about half of the plate clean.Service was cheeky, and all the better for it - always attentive, patient and unlike in some establishments of this calibre, not at all condescending. Incredible service in an Italian restaurant? Who'da thunk it?And all this for just over £30 per head with drinks and service. I'm already desperate to go back.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ipPy6Bv0YYkLvODc3CmUnA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Mozzarella balls and sage leaves stuffed with anchovies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ipPy6Bv0YYkLvODc3CmUnA/o.jpg"
      },
      {
        "img_id": "vRLH-mUMurqpUQOCmWB6JQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Profiteroles with gianduja, tiramisu and ricotta and cherry ice cream filling.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vRLH-mUMurqpUQOCmWB6JQ/o.jpg"
      }
    ],
    "user_id": "aXeEGtPa6xJ7XzObdl6nPQ"
  },
  "1bSFzh8W3EWoP9Biw-J_EA": {
    "date": "4/25/2016",
    "text": "Delicious, original and well cooked cuisine. Daisy took great care of us sitting at the counter. Had a bunch of small plates-prawns were scrumptious, caponata delicious and chunky,chick peas one if my faves. Pasta with artichokes perfectly cooked. Have the house wine and end with homemade desserts. Super service with great passion and gusto.Highly recommend",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hJRTetXj_ZTxewLiud3r5g",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Us with the A team",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hJRTetXj_ZTxewLiud3r5g/o.jpg"
      },
      {
        "img_id": "835iOtnO71Pfw84-Sc5Zpg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Caponata never tasted this good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/835iOtnO71Pfw84-Sc5Zpg/o.jpg"
      },
      {
        "img_id": "vAFG3yGQ_XuwsQ0X9CjgfA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Perfect pasta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vAFG3yGQ_XuwsQ0X9CjgfA/o.jpg"
      }
    ],
    "user_id": "xHufsRyR9MRs2Dcbyr5-xw"
  },
  "FFNKQDbEnWDm0Wd_DBuVMw": {
    "date": "7/23/2018",
    "text": "We enjoyed a wonderful dinner here last night. Everything from the warm greeting on our arrival to the lively dining room was appealing. We started with i suppli Romani which were better than any suppli we had in Rome. Their watermelon salad with thin slices of the sweet fruit topped with red onion, cracked black pepper and a drizzle of olive oil was a fantastic surprise. The meatball with peas and a side of spinach topped off the meal along with a fantastic bottle of Nebbiolo. I would highly recommend Bocca do Lupo to anyone craving Italian food in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7T2kydMQC2rRvza3QsY4_g"
  },
  "vjLHbjItYdAQcKPru2KeRA": {
    "date": "3/12/2018",
    "text": "Bocca Di Lupo was somewhere I'd always been interested in trying so was delighted when my friend suggested it. We got a table at 5.15pm on Sunday having booked I believe that morning. Although you have a 2 hour slot we were able to stay until almost 8pm. They ask at the beginning if you have theatre reservations so presumably speed things up if they know you need to leave promptly.The drinks menu is impressive. There's a wide selection of pre-dinner drinks including vermouth and some excellent cocktails including a lovely amaro sour my friend liked so much she continued drinking through the dinner. There's an equally extensive wine menu and after dinner drinks menu, including many dessert wines and grappa. I really like the serious focus on presenting a wide range of Italian drinks. They have a sommelier and some of the servers seem to abdicate all responsibility for understanding what is they offer as a result - so if you want good advice I'd say go for the sommelier no matter how over-egged that seems for one glass wine. Price points I thought were very good, especially for the wine.Food-wise it's mixed. The croquettes were a stand-out, the fried bufala bocconcini had too much liquid in it and was tasteless. Aubergine busiate tasted weirdly of (my favourite) pumpkin ravioli with sage and butter - maybe it was the involvement of the latter two ingredients but odd overall, it felt like something sweeter (albeit delicious) had inappropriately interloped. Fennel sausage was tasty but perhaps expensive at £7 for what is essentially one medium sized sausage. Saltimbocca was not what we expected but had a distinctive marsala flavour and was worth a try. Tortellini was not good - both dry and hard, frankly an insult to Bologna. Bread and oils were outstanding.Atmosphere it's noisy (so glad I had cancelled, in the past, a dinner here with my hearing-impaired father) and a little cramped, although my initial anxiety at 3 kids arriving at the table next to us was totally unfounded as they were impressively well-behaved and I overheard one kid ordering pasta with tomato sauce (not on menu) to which server didn't blink an eye (it's interesting other reviewers have had negative experiences with children. I certainly didn't witness this - although I have to say I think this is a weird place to bring children as it's quite fancy and expensive but if you have money to burn then go for it). I admired the giant and elegant light fixture at the back of the dining room and overall felt positive about the vibe. Service wasn't 100% as we were left a little long at points but overall was attentive and extremely friendly and helpful.It's not perfect but drinks and service are a solid 4 and I'd say if you come here for a few drinks and small plates at the bar, rather than a major meal, you'll enjoy.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "Ou1BurOSwcAmJMa968WIJA": {
    "date": "5/1/2017",
    "text": "In terms of food, I give this place 4 stars. The goat ragu pasta was incredible as was the octopus stew, and the langoustine and prawn risotto. The fried courgette flower with mozzarella and anchovies was nice but a bit too oily. So why the 3 stars? I was looking for a good rose wine recommendation as it was lunch time when I went. The server was absolutely clueless and hopeless in recommending anything. From a restaurant which is fully booked out 2 months in advance for Fri and Sat evenings, I would expect a sommelier on staff and if not, at least knowledgable waiting staff. When I asked her if I could try a rose, her response was no. I asked her if she could recommend something, and her response was \"I don't know\". I expect better from a place with such hype.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qg-nwyb6sY8QjZ-OaKu1Tw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qg-nwyb6sY8QjZ-OaKu1Tw/o.jpg"
      }
    ],
    "user_id": "TaZU9xjsaCpKYirpriUYzg"
  },
  "C4gXgccHEMSsZveRUjnFsg": {
    "date": "7/24/2018",
    "text": "Good food:We ordered the:Chicken scallopini  - great Watermelon, onion and oregano salad - good Courgette flower stuffed with mozzarella & anchovy - amazing (I usually don't like anchovy but was delicious)Squid and lemon slices - ok Squid with linguini- skip A sea bream cooked in a salt shell - okIt's really a 3.5 Star rating that may go to 4 if I go back and have a knock out pasta dish!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPNuvW7y6aVwhKK5z6eTJw"
  },
  "ZgTvyzglVzNPt-SJWzqJ8w": {
    "date": "9/14/2017",
    "text": "First night in London and here I am. First off my thanks to front of house staff they helped me get a spot at the bar.  This place is jumping. I ordered about the menu and my two top plates were the stuffed olives and the rigatoni with tomatoes and calf milk intestines. Both are go to dishes. The arranchini was bland and the salad was over dressed.Diffidently a repeat.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Vxactb2ACon5boraoNWoag",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Vxactb2ACon5boraoNWoag/o.jpg"
      },
      {
        "img_id": "q9H222DzPIi1GmkwDcbfgA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q9H222DzPIi1GmkwDcbfgA/o.jpg"
      }
    ],
    "user_id": "szhitaiKPsjC15bveyXRzA"
  },
  "03lMOKGH7h0r-zw7HunZ4w": {
    "date": "5/23/2018",
    "text": "One of the best teas taut are in London Hands down!  My good friend Sasha Allen 1st visited this place 10 yrs ago and she makes and effort to have all the seafood dishes every time she comes!  Everything was tasty!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CGxYvmauiCjhiH39I-SFTQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CGxYvmauiCjhiH39I-SFTQ/o.jpg"
      },
      {
        "img_id": "7GmCEgIAu7epA6TuJgSAtQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7GmCEgIAu7epA6TuJgSAtQ/o.jpg"
      },
      {
        "img_id": "QDmyPw96Umc10v04N_vB9A",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QDmyPw96Umc10v04N_vB9A/o.jpg"
      }
    ],
    "user_id": "Opz-YSQQPygIiowXEeNNFg"
  },
  "FLKYGMz-t3L7J-4-cEbCYQ": {
    "date": "7/18/2018",
    "text": "We are convinced that this is likely the best Italian food in London.  We've been coming here for 7 years and have loved everything we've tried; the staff has been consistently courteous and well-informed, too.  On our last visit, we had their aubergine melanzane (as well as a delicious ravioli and spaghetti), which was so memorable I would be very happy to make the trip back to London from San Francisco for another bite.  Highly recommended but *do* book a reservation in advance as they fill up quickly for both lunch and dinner, every day of the week.  Try to save room to try to the focaccia that comes with the meal, and for gelato across the street at Gelupo.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pRTU4bSsT9TwvC9-wqqvhw"
  },
  "gtx-zbH7E7RvCuxWowwjkQ": {
    "date": "5/12/2016",
    "text": "I absolutely love this place. Everything about this restaurant is perfect. The service, the food, the wine selection, and the atmosphere was just lovely. I had a good experience here.It seems to be crowded and occupied during dinner time, best make prior reservations. I like the interior of this restaurant, as you enter there's an open kitchen with a long bar table that heads towards the back where there are more tables. If you don't mind seated side by side, the bar table is actually fine for two!The food is amazing. We ordered a bunch of starters to share and mains to share (unfortunately I can't remember them all). The Ravioli pumpkin is a must try! Almost feels as though the filling is melting in my mouth! The Tagliatelle with wild Venison should also be in your list of things to order (but I suspect this is seasonal). If you order the Fossil Fish, be careful of the bones. It's very nicely cooked, the meat is soft and juicy. We decided to try \"Grandpa's Balls\" out of curiosity, I don't remember it being particularly mind blowing but it was a nice sweet dessert to end the meal.The prices are slightly on the higher side but given its quality I would say it's worth the bill. Highly recommend .",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gm5M7ZTEsFsHl3UQIUgcHQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Ravioli Pumpkin",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gm5M7ZTEsFsHl3UQIUgcHQ/o.jpg"
      },
      {
        "img_id": "R6KkZ1Ckhhq0-kMd6yjh3g",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Fossil fish - sea bream charred in a crust of flour & salt",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R6KkZ1Ckhhq0-kMd6yjh3g/o.jpg"
      },
      {
        "img_id": "jJQUHdhdrhFpLJnScs6dGw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Le palle del nonno - \"Grandpa's balls\"",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jJQUHdhdrhFpLJnScs6dGw/o.jpg"
      }
    ],
    "user_id": "v5XZL6DY0aWq6LEM-vVIOw"
  },
  "-kq-NnYLDr4_e9G2tt5uVw": {
    "date": "7/21/2018",
    "text": "Outstanding!  Food and service.  All homemade food and try to sit at bar near open kitchen and watch the magic.  Some of the best Italian I've had.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8AOb1T4qEWjlj4OeDD3ew"
  },
  "pIroBE79uIfZdkZYv_2ebg": {
    "date": "12/16/2017",
    "text": "What a magical place! First, you gotta get yourself a reservation. You can't walk in here unless you plan on waiting for awhile and they don't want you to leave or you will have your wait time start over, nor is there really a bar to wait at as it's being occupied by diners that also have a reservation. So first rule, get a reservation. A group of us were lucky to snag a reservation on a Friday night at the bar and it was perfect. We had an amazing waitress that expertly portioned out the meal selections for us. She was friendly and knew so much about food and drink. You could sense her passion for the menu items and Italian culture. It was refreshing to be around someone so enchanted by the food and drink the place was putting out. The food was soooooooooo good. Wow. Dish-after-dish we were impressed. You can't go wrong with homemade pastas. Always go with the ravioli! They're pockets of love! The suckling pig and polenta was another highlight. We got a bunch of items to split and everyone left full and a smile on their face. Love it! Wish I was a local to get back here more frequently. Very fun place to dine and kick off a night on the town.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "osM4Ssqj-w-JTXGVe7TTuA"
  },
  "BDJCDKgUpQ2evARLD4fvgA": {
    "date": "8/19/2015",
    "text": "Second time here was as great as the first time. To make things even better the server remembered me from last year. Food is fabulous here everything I have tried I loved. The portions are good to share if you want to try several things.Reservations are a must, I booked the dinner reservation about one and a half months in advance and the only time I could get was 10:15PM.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iRIXs6Hq6zi3kkYCsq6liA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Chorizo and foie gras sausage",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iRIXs6Hq6zi3kkYCsq6liA/o.jpg"
      },
      {
        "img_id": "E3lYsiwtTKXE8osn28JZXw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Spinach and mushrooms",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E3lYsiwtTKXE8osn28JZXw/o.jpg"
      },
      {
        "img_id": "Cjq2aNUv7AyPq2B2N7sU3Q",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Grilled prawns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cjq2aNUv7AyPq2B2N7sU3Q/o.jpg"
      }
    ],
    "user_id": "ufICbdVlGBGKTKkyy6uBmQ"
  },
  "gz7UNOI_SDzm6CVUcodBGA": {
    "date": "12/28/2017",
    "text": "Don't waste your money here.Nothing related to Italian food. Too much gourmet but not good food.They changed the menu so the photos are old and are totally different now.We didn't touch the food and they charged $90 even not attending our expectations.Customers are in the bottom line here!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eU-mE9ASP4Phm1SestRJsQ"
  },
  "vF8PdHQB0gTvKeyTJe9j-Q": {
    "date": "6/16/2017",
    "text": "We walked in the restaurant without reservation and we were told the wait time was 45 minutes. We decided to wait, and it's so weird that they asked us to wait inside standing next to the bar but not at the bar. We were told the bar area required reservations. It's kind of weird, but it's good that we got seated at the bar pretty soon. What I like about this place is that you can order small plates and try more dishes. They also have different kinds of pasta and wine selection. The wine they recommended was good. We tried - gnudi with lamb ragú - the lamb and sauce are pretty good. It's my first time to try gnudi, so I'm not a big fan. - rigatoni con la pajata - it is the best among all. The pasta is cooked perfectly. - grilled giant tiger prawns - it doesn't taste as good as I expected. - grilled quail - the meat is pretty tender - tortellini - good The service here is a bit slow though even though they said in the beginning that we have a dining time limit of 1.5 hours.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XCMuANohVuvYULF4-6MDQg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Tortellini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XCMuANohVuvYULF4-6MDQg/o.jpg"
      },
      {
        "img_id": "SMzUZQPh9nNOZt58ohJ5kA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Grilled quail and giant tiger prawns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SMzUZQPh9nNOZt58ohJ5kA/o.jpg"
      },
      {
        "img_id": "RWYE3e2IfIcAKJTJtVyKKw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Rigatoni con la pajata",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RWYE3e2IfIcAKJTJtVyKKw/o.jpg"
      }
    ],
    "user_id": "PW-FPm_fZ7spmknmvfriyw"
  },
  "vAjKpZB35qgHPce4aJt7Kg": {
    "date": "2/2/2017",
    "text": "When in London, you MUST visit this restaurant---and make sure to get a reservation!  You WILL NOT regret it!I visited Bocca di Lupo on a recent business trip to London.  This restaurant was recommended to me by my Father-in-Law and I stayed up until the wee hours of the morning to make a reservation for the bar.  The bar is a ringside seat to the open kitchen where you can watch the magicians of Italian food at work.  Now, for those of your from the United States, understand that the portions are small.  The pricing scheme here is pretty reasonable and it is encouraged that your order 3 or 4 plates of food.  It's a terrific concept that I wish would be more prevalent in the United States.  I started off with a special for the evening, sea bream Carpaccio with orange.  Until dining here, I had never eaten sea bream---holy smokes was I missing out!  First, since I was seated at the bar, I watched the Chef delicately filet the sea bream and slice the thinnest pieces of fresh fish and then season it with orange and some amazing olive oil.  The fish was clean and fresh tasting.  It was firm yet melted in my mouth and it didn't have the overly \"fishy\" taste that one can find with other fish.  The layers of flavor with the sea bream paired with the orange and the olive oil is indescribable.  This plate was gone before I knew it, and I wanted more!  It looks as though Bocca di Lupo has added this dish to their menu, so make sure to order and it--you will be glad you did.  For those who may be wondering...yes, the fish is raw.  My second dish was tagliatelle with bolognese ragu.  Wow!  Since the pasta is fresh, it is incredibly tender and cooked to perfection.  The sauce was so good, I am pretty sure it would make a shoe taste pretty darn good.  As stated earlier, the plates are small, and I wish I had more of this pasta!  My next dish was risotto with porcini mushrooms.  I don't normally get excited over risotto, but this was akin to eating a cloud...with mushrooms!  The porcinis were cut perfectly and incorporated into the risotto perfectly.  To finish off my carb heavy dinner, I enjoyed a plate of gnocchi with sausage and spicy tomato sauce.  The little pillows made of potato dough and covered with a spicy arrabiata sauce were amazing!  I am normally not a big fan of gnocchi as some chefs can make them a bit too dense, but this was like eating little baby clouds.  The gnocchi were light and airy, the sauce was not too spicy but perfectly balanced.  The sausage---WOW!  It was packed full of flavor!  The entire dish worked so well together I had to force myself to stop eating it since I was full from the other courses.  I left Bocca di Lupo so stuffed, I looked forward to walking around London to stave off the inevitable food coma which I knew was coming my way.  This was one of the best meals I have ever had, and I totally look forward to returning back here the next time I am in London.  Make sure you do the same!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bErBCr3Nkgkfrs2944WC-A"
  },
  "sNAzSApAfHtJf81qMNt0Ug": {
    "date": "5/29/2017",
    "text": "We came here mid week on a warm summer evening when soho was packed so we were impressed to be able to be seated within 30 mins for a table of 4. The restaurant is small inside but didn't feel cramped and the staff were really friendly and helpful, especially in recommending dishes for one of our friends who cannot eat gluten. We shared a bunch of dishes including:Gnudi with lamb ragu - best dish we had! Ricotta filled dumplings served with really good ragu. Glad we got the large size of this one!Galletto in spring panzanella - a whole baby chicken with a type of pee purée (better than anything you've had a fish and chip shop!) - really well cooked with great flavours, generous portion.Langoustine and prawn risotto - another good dish.Chicken scallopine - really flavourful but it is literally chicken scallops so make sure you order a side too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uyAqdLyscWWJ0KSpyXt4eQ"
  },
  "_4eb-TEXeQMt3Dqc7yTkVg": {
    "date": "2/11/2016",
    "text": "Had read so many good reviews however it didn't live up to expectations I think the starters were slightly overpriced although good. Have to say, one fried artichoke for 5£, bit steep. Other starters included the fried squid which was good although nothing different than a regular calamari. The soft shell crab dish was low on the crabs but a fair few shrimps. Had a couple of the arancini but for the price , again over priced.The mains included the ragu dish which was Ecco, my favorite of the group. Two squid ink risottos which to be honest was a bit bland. The veal chop for two, was my least favorite - I'm not a fan of pink veal so at least the option for how we wanted it cooked would have been nice. In addition to it being pink, it was cold and lacking salt. The meat wasn't cutting properly off the bone, lots of meat was left on it.The table in the back wasn't ideal - people constantly went back and forth through the curtain which was distracting due to light and chair bumping.Overall the group enjoyed the restaurant, but I wouldn't come back anytime soon as there are better places for food and additionally for value.Service was decent, no complaints there.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "f7QuSTleFEnUE-oEj1aLWQ"
  },
  "STGw8OnxBizOzy4H74XkLA": {
    "date": "12/1/2016",
    "text": "I can't understand the high rating for this place and the crowds waiting to dine here. I came here for dinner and my experience was terrible. First, the portions were ridiculously small. I paid about £10 for 2 golf ball size appetizers. The large size order of my pasta was small as well. It was only about 225gm. Secondly, the 10gm white truffle I paid £45 at a sister location next door tasted dry and flavorless. It smelled good but I didn't expect it to taste so bland. Lastly, the agnolotti del plin I had my truffles put on was so salty that I had to force myself to finish it knowing how much I paid for the white truffles.  Overall I felt cheated leaving this place. Sure I'm a tourist visiting London and I may not be back for some time. No need for mgmt to worry too much about people like me. I'm still curious who finds this place so amazing to warrant such a high rating.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8NkSYs9aGmvFh8PtrzNXXg"
  },
  "eamu5vVB-K9Ri23PTfJWrw": {
    "date": "3/29/2018",
    "text": "Came here for an early New Year's Eve dinner with a friend. It was very busy inside and the atmosphere was lovely, especially for such a small restaurant. We ordered quite a few small plates to share, and while I found everything tasty, the one distinctive memory I walked away with was for the truffled radish, celeriac, and pomegranate salad. Wow! This salad is what dreams are made of! Of all things to rave about at a popular place like this, I will acknowledge that salad isn't usually it. But all I can say is, if there was one menu item to bring me back to this place, it would be this one. Amazing!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCMT97tm24QbkdFqnkltIw"
  },
  "YTpqKlk3PRzoZ1Lj6YYrFw": {
    "date": "1/11/2015",
    "text": "It was Friday date night and was able to get a reservation at Bocca di Lupo which has been on our list for awhile. Food: Since its a tapas style menu, we ordered the following.  Please note you can order a small or large portion of each on their menu:Crescentine with Parma Ham (small order) - Delicious.  The bread they serve it with was to die for.  The only drawback is that they only give you two pieces when you could eat ten.  The Parma ham portion is generous and the squacquerone cheese is a nice accompaniment.Tortellini (small order) - This is the best tortellini I've tasted so far.  It's made with veal, pork, radicchio and nutmeg.  I regretted not ordering the large portion after we received it because I could've eaten 50 pieces.Braised Ox Cheek with Chocolate and Spices  (small order) - Yum!  Wasn't sure what to expect with the chocolate, but it was very subtle and complimented the dish overall very nicely.  The meat was very tender and full of flavor.Grilled Langoustines and Mussels in a Chilli Garlic Sauce (small order) - The dish was good and had a kick with the chili.  Sucking Pig (can only order large) - The pork exceeded our expectations.  It was perfectly cooked and the sauce was light and complimented it very well.Broccoli and Cimi de Rape with Garlic and Chilli (small order) - This was our least favorite of the dishes.  The vegetables were overcooked and very mushy.  For Dessert - We ordered the Bombe Calde which are their donuts.  Thank god there were only three because they were so delicious I could've eaten ten.Drinks: We ordered two bellinis and one 500ml of the Primitivo red wine.Price: 137.48 GBP for two people.  It's expensive for what you receive overall.Ambiance: The restaurant was very busy and had a good vibe.  We sat at the bar to be up front with the chefs which we always like to do.Service: The service was very good.  Our server was friendly, helpful and attentive.Would I go back?  Definitely!  Even if I just ordered a large order of the tortellinis myself.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jrJK-zMErDjnhZE9jxclBA",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jrJK-zMErDjnhZE9jxclBA/o.jpg"
      },
      {
        "img_id": "iD7mJmJoaOISTzUDxB4Yrg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iD7mJmJoaOISTzUDxB4Yrg/o.jpg"
      },
      {
        "img_id": "GLhqicn3DanaTGRBHou-Nw",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GLhqicn3DanaTGRBHou-Nw/o.jpg"
      }
    ],
    "user_id": "UR6guAvsmsMX27bfFJ_Kzg"
  },
  "K5oeYFROJu_yNaX8BtNe6Q": {
    "date": "12/19/2014",
    "text": "How do you say 'yum' in Italian? Awesome meal again. Grilled squid and prawns to start. Then partridge off the truffle menu with amazing polenta, romanesco with spinach and orecchiette with red onion and tomato. Everything was delicious. Service was friendly and low key. It all went smoothly despite a few small mishaps. Can't wait to come back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bETV4NmSGNDIax9G2nf50g",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Grappa and espresso",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bETV4NmSGNDIax9G2nf50g/o.jpg"
      },
      {
        "img_id": "cOjNjdyYD-PIjgIMnILhwg",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. DIY cannoli",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cOjNjdyYD-PIjgIMnILhwg/o.jpg"
      },
      {
        "img_id": "oGFLL9PiT6OjVDaewre4rQ",
        "caption": "Photo of Bocca Di Lupo - London, United Kingdom. Orecchiette, romanesco and spinach, partridge on polenta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oGFLL9PiT6OjVDaewre4rQ/o.jpg"
      }
    ],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "MenOeAtpC4GiAEbQ63B5WA": {
    "date": "9/26/2012",
    "text": "After recently visiting London, we decided to head out in search of some good eats and came across this trendy little place tucked away down a side street.As soon as we arrived we were immediately made to feel welcomed and valued guests, we had made reservations an although the table wasnt free instantly (in fact a 20 min wait) being plied with free drinks is certainly my kind of customer service!As we were waiting we manager came over and had a chat with us several times to update us on the wat and asking us if we wanted more drinks, which i thought was a nice touch. This waiting period also gave us the opportunity to peek at what delights were in store.We ordered a whole bunch of dishes, this is because you can order small plates and treat it kinda like an Italian tapas, which is brilliant as there are so many things that look delicious.We settled for prosciutto cheese and bread starter, along with a wild boar and olive selection. All were very good although curing boar intensifies the flavour into really quite an overpowering taste. Ii personally didnt think much of the pickled porcinni though.This was followed by a wild boar ragu and fresh pasta (not our first choice because the one we wanted had sold out!) It was sooooo good though an i wasnt even slightly disappointed at my second choice.We also ordered a rabbit leg in the most divine tomato sauce, it had so much depth of flavour i mopped it up with the rosemary foccacia. For dessert we had espresso gratini and hazelnut gelato with a sweet alcohol shot to pour over according to taste; i order my coffee with dessert, Bicerni i think it was called and oh my god, the best tasting thing ever when eating with a spoon complimented with the hazelnut gelato! This may seem weird but the Bicerni is quiye a thick blend of coffee and hot chocolate that tastes like liquid heaven!Genuinely i think the best meal iv ever had as a whole, impeccable service, delicious food and a great relaxed atmosphere (even for a Northerner 'abroad')",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mFOJXB3gn6K1GpLp00iRhw"
  },
  "7H_5spAEHHzipkTmfpAdnQ": {
    "date": "2/15/2011",
    "text": "Slightly mystified by the hype of this place. 1. The food - most importantly, of course. Now, I'm speaking as a veggie, so I didn't get to try the meat/fish - perhaps this is where the restaurant shines. But even then, I'm always unimpressed by restaurants who can't manage veggie options well, particularly Italian restaurants. Now, that's not to say food was bad. The pasta was sublime, if a bit of a small portion for a large portion, if you get my drift. But the tapas-style starters? Very hit and miss - with more towards the slightly bland miss than the extra-tasty hit. 2. Ambience - cluttered, over-stuffed, loud. 3. Staff - noticeably honed in on high value customers to the detriment of others. The utterly smart architecty looking couple next to us got lavish attention, me and my not-so-scruffy dining partner? Fairly surly and inattentive behaviour. It couldn't have been more blatant - either they're underpaid and going after tips, or they're being instructed by management to lavish attention on people they think they can talk up on the wine list. Whichever it is, it's not being done subtly enough to not piss off other diners. In the end, then, as I said at the top, this is slightly mystifying. It's a competent and occasionally brilliant Italian. But it's let down in several key areas and I won't be rushing to eat there again. If I want high ticket Italian food in central London, there's lots of other, better choices (Locatelli. Mmmmm...).",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "I6emJ5-Lk9lyWeDyep6IzA": {
    "date": "5/16/2010",
    "text": "Bocca di Lupo does great Italian dishes that you can either enjoy tapas style or having starters and main courses. Seating in the restaurant is either at tables or on a bar that faces the kitchen and bar areas. I would recommend sitting at the bar as, although the seats were perhaps a little low the table area looked like it had a much less enjoyable ambience.Sitting at the bar you get to see all the dishes being made and sent out. This is a mixed blessing as now I have to go at least another 2 times to try all the dishes that looked so great. I do feel sometimes that having full view of the kitchen can destroy the magic a little bit but it also added to the entertainment. The head chef wasn't working so the second chef led the kitchen and called his cooks darling when giving orders.We initially ordered slightly too much food and one of the waiting staff very helpfully suggested that we might like to change some of our upcoming dishes, which we did. In fact the wait staff were very helpful, if sometimes a little disorganised., which we found quite charming.In fact there was only one reason I haven't given this place 5 stars - Braised Escarole. That they even have this dish on the menu deserves to lose it a star, never mind that they offer it as a main. This vegetable was impossible to cut with the cutlery provided and whilst it initially tasted good in the mouth it left quite an unpleasant bitter after-taste that outlived the sweet accompaniments on the dish. I can only hope that it wasn't cooked properly and that it's not actually meant to be as disappointing as it was.A real highlight dish is the seafood linguine. It was by far the best I've had and tasted so richly of the sea. The pasta was perfectly cooked in a way I could never replicate.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tV2ZQSVYo-AiKSrUaLXTIg"
  },
  "zVtFJiavV_YwUKYv9iJuLg": {
    "date": "9/28/2011",
    "text": "3.5 stars.  we came in a large group and tried a bunch of stuff.  they start you off w/ foccacia, bread, and olives which were good.i tried the fried balls w/ squid ink and the one w/ saffron and bone marrow.  i honestly couldn't taste the squid ink or the saffron/bone marrow in either of them and only really tasted rice.for my entree, i got the small order of john dory, which was big enough for me.  i also tried the oriechitte w/ broccoli raab, which was tasty.  i also liked the caponata w/ anchovies, roasted pumpkin, and broccoli raab.we didn't have time for dessert but went across the way to gelupo.  all in all, a pretty good meal.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rx7DNBmPPShVjlcQidGuTw"
  },
  "wbjoVSrO59_v18Vi1k5Faw": {
    "date": "2/13/2010",
    "text": "I've only been here once as well, and it was pre-theatre.  Nevertheless, Bocca Di Lupo did everything perfectly.  No overstatement: it was quite possibly the best meal i've had in 5 years in London. Everything was excellent: the service, the food, the menu, the decor, the ambiance, even the price.I didn't have much time to savour the experience, what with the limited time between work and the show, and its a testament to the waiters that i somehow managed a great meal including starters and coffee at a pace that never seemed rush.Me and my friend sat at the bar, and watched our food being prepared.  Unlike so many other open kitchens, this was somehow pleasant.  It worked brilliantly for friends, though for some dates it would perhaps be advised to get a table at the back.  The wine was on-par with the food: delightful.  The sausages and the risotto are beyond compare.  Everything is well presented, and without pretensions.  Not ostentatious, but well done and special.Reservations are more or less essential.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iG4NUq_7JhYXLa2nUhLC1g"
  },
  "4GqvvwvEI5Uac51DT7sdgg": {
    "date": "1/3/2015",
    "text": "Below average food, slow and hurried service and wines by the glass that are hardly drinkable. It is truly surprising that this place is so popular. There are way too many great restaurants in London to bother with such low quality place.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6ClhMxzNtBGMxNUyHX6KA"
  },
  "DKlnn30tLgaKinsaDNo-9A": {
    "date": "4/17/2011",
    "text": "Went to Bocca di Lupo with a friend last Feb, and i wondered how i've missed this decent italian place in Soho for the past 3 years ! LocationSoho, so it's perfect ! Food & WineWine is beautiful, no complaint. Most servings are not huge and that's a good thing. There are enough interesting items on the menu for one to order several dishes to sample. A little pricey but slightly above average quality (personally, I'd prefer that to cheap~ave prices but forgettable food). Dessert, we wanted tiramisu, which is only available in large portion. We asked the chef and he kindly let us ordered half of the large portion (half is still large !). The tiramisu is lovely, and I am guessing the secret ingredient is dates ?? ......... My friend ate and drank more than her usual portion that evening, so that's a good attestation. ServiceI had a table booked but we arrived 10mins late, and our table was given to someone else (granted they rang me earlier but i wasn't able to pick up the call). no problem as they offered us seats at the counter, which we accepted. It turned out to be a fantastic night, regardless, as the generous aussie guys sitting next to us at the counter shared their red wine, and we discussed philosophically what \"short term, long term\" is :D Will definitely return, and recommend to a friend.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HbUcqonlPDqtOQNqKvBg4Q": {
    "date": "10/28/2012",
    "text": "One of my favourite restaurants in London... I prefer having lunch here since they have an extended menu, plus it is less crowded and the service is much better than at dinner. Nowadays its really difficult to even get a reservation, but you can always pop in and try your luck at the bar, since it is not bookable and is reserved for walk ins. Best thing to do is come with lots of friends so you can order more small plates to share, that way you can try out everything since they change their menu regularly based on seasonal produce. The menu is very extensive and each item even has a \"region\" to tell you where the dish is from, but the standout dishes for me are the finger burning lamb(as good as it sounds), the truffle pasta(winter season), and the rum baba for dessert... actually pretty much any dessert there is bound to be amazing, it got so popular they even opened a gelato store across the road.For me a trip to London is not complete without eating at BDL!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U_40Vj7fYmfpd9Qv9cepnw"
  },
  "xl2Yh92vyMCHW8wlJ3rekw": {
    "date": "10/25/2012",
    "text": "Marvellous food! Intimidatingly good wine list, professional friendly staff and it's right in the middle of town. I don't usually go wild for Italian food in the UK, but I have never had Italian food like this. Go to Bocca di Lupo. It is good. It's really very, very good.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1RyJrV4_-TBIqLhozJo2gQ": {
    "date": "10/14/2011",
    "text": "overrated. the fried rice balls (arancini) had glowing reviews but they were all bland. i couldn't tell the difference of each w/my eyes closed. the fish is really good here but everything else is not memorable and sadly less savory than described on the menu.very nice host/waiter though!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ps_81rqwpgRnj2DCf7xcA"
  },
  "2A2OkfgD5tEyPdJaPF-yMg": {
    "date": "8/3/2014",
    "text": "Upscale London Italian.  Food and wine was great.  It was a bit on the pricey side however.  The wait staff was prompt and courteous.  The woman who sat us was a bit pretentious.  The tables are unnecessarily close to one another IMHO. This place gets packed, so be sure to make a reservation.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VQDckiRx4kjepaPisgwHw"
  },
  "gOmIQB-B4_CDEz6uJ2sTVg": {
    "date": "12/29/2011",
    "text": "We came here on a recommendation from our Hotel's concierge and I'm glad we did! The food was absolutely delicious, one of the past dishes we got was to die for.  Almost the entire menu can me ordered in small and large portions. We opted to go for several small dishes, which was wonderful because we got to sample a bunch of different things. I can't wait to come back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yYkjyR6go_f2Q4JgWau5Zg"
  },
  "B7JJIMLyiyT535QIimy7Cg": {
    "date": "10/12/2009",
    "text": "Bocca di Lupo - Pics @ The London Foodie(thelondonfoodie.co.uk ) Intrigued by all the hype surrounding Bocca di Lupo, I called up my dear Italian friend and foodie extraordinaire Tea (short for Teodora) for a meal at this very trendy establishment. Despite booking well in advance, we managed to get squeezed in for a 6pm sitting last Friday, and were reminded on arrival that our bit of counter should be vacated by 8pm, and no later. Bocca di Lupo is simply and informally decorated, tucked in on Archer Street, W1, one of the seediest streets in Soho. It was a runner-up in the Best New Italian Restaurants category of Time Out's 2010 Eating & Drinking Guide and had received rave reviews by fellow food bloggers World Foodie Guide and Londonelicious to name a few. The menu is not overly long or complicated, and clearly describes the Italian regions from which each of the dishes originate. I also enjoyed the possibility of ordering various dishes to share as opposed to having my own main course. We started the evening with Buffalo Mozzarella Bocconcini @ £2.50 each. As expected, these were very delicious and creamy. This was followed by Crescentini (fried bread) with Finocchiona, Speck & Squacquerone Cheese @ £5.50 (small). This was ok, although neither of us could taste the fennel in the fried bread, and felt that the accompanying portions of speck and cheese were rather meagre. The Shaved Radish, Celeriac and Pecorino Salad with Pomegranates and Truffle Oil £5.50 (small) was one of the highlights of the evening. The flavours and textures were diverse but came together nicely in the heavily scented truffle oil. I really enjoyed this dish and would certainly order it again. We ordered two of their pasta dishes, Tortellini with Cream and Nutmeg £8.00 (small), and Tagliatelle with Pigeon and Pork Ragu £7.00 (small). They were both good although to my surprise, the vegetarian option was the better of the two. The simplicity of the tortellini was refreshing, with the flavours of cream, cheese and nutmeg completely unadulterated and delicious. The Pigeon and Pork Ragu was also good and rich. The best dish of the evening was undoubtedly the Sea Bream Baked in Salt @ £16 (whole fish). The salty crust in which the fish was baked helped to season the flesh to perfection. It was reminiscent of Baccalá but without the chewiness and dense consistency of this salt-dried fish (cod). A true revelation. To accompany the fish we ordered a portion of Grilled Radicchio and Asiago Cheese @ £6.50 (small). The radicchio had been seasoned with balsamic vinegar and tasted sweet and slightly charred with the melted Asiago cheese (reminiscent of parmesan). We did not think it was an outstanding dish. For dessert, we ordered the Rum Baba with Pineapple and Whipped Cream £5.50 and the Brioche sandwich of Hazelnut, Pistachio and Chestnut Gelati (ice cream) £7.00. These were again fine, but rather unremarkable. I do not know if our mixed experience at Bocca di Lupo was because of my unduly high expectations or possibly because of the impersonal but efficient service we received. The food was good but not outstanding. I would like to give Bocca di Lupo another try when some of the hype finally quietens down. Verdict  Good Italian food at medium prices in Soho. Impersonal but efficient service. At £126.56 for four, Bocca di Lupo was relatively good value but hardly a bargain.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Q8eAhUHlQJc3Se1c1xragQ": {
    "date": "8/23/2014",
    "text": "One of the best italian restaurants in London. Very authentic and great tasting dishes. If you are looking for great italian food, I would definitely recommend this restaurant!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1yW0HvpA-AkTJG4SdxlyQ"
  },
  "nN38OHOD5XvqDKAVkSJ6_A": {
    "date": "11/3/2009",
    "text": "I've been to London twice in the past month, and this was the one restaurant I HAD to return to. What's better yet is that I didn't repeat a single dish and everything I had on both visits was excellent. On first visit, we shared the fried mozzeralla, fried artichoke, a pre-theatre portion of meatballs braised in a lemon sauce, a side of chard and quite possibly the best spaghetti amatriciana ever. All the items were perfectly portioned, seasoned, executed - you name it. And the pre-theatre menu looks like a good deal if that's what you are up to (we just happened to be there early). The staff was great about steering us in right direction as far as how much food we needed to feel satiated and they were very helpful with the wine list.Our second visit was on the late end of the dinner hour, so we had only to contend with the normal dinner menu. As an app we shared the most incredible quartet of items: a fried piece of airy bread, two varieties of salumi and a cheese from the crescenza family. When all were paired together on the fork, it proved to be the perfect opening to another fine meal. After that tidbit, we moved onto the suckling pig, an orecchiette and a side of greens (yet again [a jet-lagged girl needs her fiber]). The pork was as decadent and heavy-handed (in a good way) as at a full on pig roast, with moist fatty interior and crispy crust. My only complaint was with the pasta, which was a little under seasoned. I let it slide because with a forkful of pig it balanced out. To finish things off, we split the duo of gelato - chocolate for me, and coconut for my husbie. Both amazing.I really, really love this spot and and chances are, when I live in London this summer, I'll be using it as an excuse to get me to a gym!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vo1MmLAw2rpmblZ9wh3TCA"
  },
  "TJVOK7aGZRMk3owPBQKOhQ": {
    "date": "9/7/2009",
    "text": "I had tempered my expectations before dining at BDL, but I still felt sort of let down. Perhaps this was because so many respected food journalists had opined with such flattery about its merits and virtues. Or perhaps it is because we just didn't order right. I do hate the notion of not ordering the 'right' thing, though, as restaurants just shouldn't put 'wrong' dishes on the menu. But I don't think it was this either. I think it was just the feeling that, with a few minor adjustments, the food could have been so much better. So maybe it was just an off service in the kitchen, who knows. That said, what is clear is that BDL certainly serves up decent Italian food at reasonable prices (for central London) in a very appealing and comfortable dining space. And the menu is good fun too. The staff were all very pleasant, but we did find ourselves waiting around for long periods of time for someone to notice that we wanted or needed their attention. These often long gaps were all the more strange given that the restaurant wasn't even half full for most of the time we were there. Maybe they just lost focus as it was the end of the lunchtime service, but I can't imagine them being so lax in the middle of a completely packed out restaurant. Despite all of these niggles, I still did like BDL and would return, but certainly won't expect the world. For me, BDL is just a good, casual Italian restaurant serving reasonably priced food in a fun atmosphere  not the 'wolf' the press has made it out to be, devouring all other Italian establishments in the city of smoke.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nBm2BYOdubgGYPAWUggJrg": {
    "date": "9/21/2013",
    "text": "One word:  perfect.  I can go there every day.   Highly recommend their pasta dishes, if you like Italian way of making pastas (simple, fresh ingredients, al dente).  Just make a reservation and go... you won't regret (and yes, you will need a reservation)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzO1aRjLWDe-hpAy5Hj6eQ"
  },
  "NB-Ojd7lvvQCpiN1ba921A": {
    "date": "4/17/2013",
    "text": "A must  if you are interested in delicious, fresh, perfectly prepared Italian food. The entire experience at Bocca di Lupo is outstanding.  The food is scrumptious.  The decor is trendy.  The service is excellent.  Go for the food.  The menu is constantly changing.  The ingredients are fresh, beautifully presented and representative of the various regions of Italy.  Don't miss a stop across the street at Gelupo for dessert.  Owned and operated by Bocca di Lupo's proprietor/chef, the gelato is sensational!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6C7ulmcnwZtQoNBuov1bkQ"
  },
  "4Nabcby7y4hPAGkXusjhdQ": {
    "date": "10/30/2010",
    "text": "This place was recommended by a couple of Italians I met recently in Tunisia. They considered it to be their favourite Italian in London & it was indeed very good. The bar area, in retrospect, would seem to be the best place for people & chef watching but we sat in the crowded & busy main part. Boy, was it busy for a Tuesday!!! Attracive & attentive staff & interesting regional food with only modest pasta offerings. Had a delicious cheesy & rockety risotto followed by some deep fried fish & seafood with polenta. Again, different & tasty. I thought the portions were a little small (always do though!) & the Moretti beer a little yeasty. Otherwise, well worth a visit.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TZxEKSdhuP0k95mvENd8ng": {
    "date": "4/19/2009",
    "text": "WENT BACK again last night. Bloody fantastic food and superb service from very busy wait staff. The Ricotta gnudi with lamb ragu was simply perfection. Cannot remember the wine, but the recommendation was faultless. Anywhere with a long busy bar where you can watch the chefs at work gets my votes. Actually, I would only want to sit at the bar here as I think the table area lacks atmosphere. I was impressed that they served a mean aperol spritzer - order one if you like an orangy sparkly pick me up for a drink. Stunning bread, but that is what you would expect from a son of the Sams at Moro. I think it is the same recipe and probably from the same sourdough starter. Very yum. Food stunning. For me, the dessert won it. Almond and blood orange granita with bitter chocolate ice cream. Hit every note perfectly. Bookings are hard to come by. Try for a late bar seat, say 9.30-10.00PM if you can wait that long.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rWJTrjXurh_u9gFDvnBnPw": {
    "date": "11/26/2014",
    "text": "Last Sunday was my third trip to Bocca Di Lupo in about 2 years.  Restaurant owners, take notice: just like an attractive woman can seem ugly because of her personality, a restaurant that serves great food can seem awful because of its servers.  Here is how it went:  We booked a table for 2 at the kitchen counter.  We arrived and were led to our seats. Immediately I noticed that the chairs were squeezed very tightly against each other with a rather large gentleman sitting to my right.  Seeing that there were two more open chairs to our right, we took them instead of the ones to the left. As I sat down on the wabbly chair, I realized that one chair had to be moved in order to be remotely comfortable so I moved it out of the way.  There was zero elbow room. The host got weirdly uncomfortable. Minutes later the manager came by and told me that he had two more people coming and that I had to put the chair back. My reply was: look, where is this chair supposed to go?  They were already stacked back to back with millimeters between them. He would not budge and shoved the other chair back in. Luckily the other diner was a sweet tiny old lady. Then they took my coat, gloves and umbrella to be stored. The umbrella never came back. I hope they're enjoying it today. The server was snooty and pushy. He did not explain anything on the menu and seemed grumpy and had an attitude like he just wanted to get us out of the way. I ordered the mushroom pasta and chorizo sausage that was overly rich and fatty. I've eaten here twice before and it was great, this time it was not. We asked for our check at the end and that took a good 15 minutes. So in a nutshell, this place was good, but its food quality declined and its services basically went into the toilet. There are many places to have good food in London, I recommend that you try them and leave this one to fix its issues.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zFpUCddAULfJ2QaCYql0NA"
  },
  "3NVebSFmUKPbF02j4h6hlg": {
    "date": "6/3/2013",
    "text": "Bocca di lupo is wonderful.  Super intimate and very centrally located.  Oh and the food is amazing.  Very much a local's place.  If you want a nice evening out - cute place, delicious bites and great service, BDL is your spot!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ILxSblUWx4q02E2H_e9YQ"
  },
  "QHggGEx75EP3VuS6YHUvhA": {
    "date": "12/22/2013",
    "text": "Went with my sister and her (now) fiance and it was a great visit from start to finish. We arrived a few minutes early, so they had yet to clear our table and set it up for us. As we waited, they offered us complementary prosecco and took our coats. Once we were seated, our waiter quickly appeared table-side to offer water and drinks. The cocktails we ordered were fabulous. I had a very summery cucumber and fruit drink which was really refreshing. From there, we asked some questions about how much to order (much of the menu is small plates, so you share), and then ordered about 7 dishes or so which was perfect. All of the food was well prepared and tasted great. The wine that our server helped pick out went brilliantly with the lamb. We also got dessert, which was fun because there's an option to get \"mystery cones\" so you have no idea what you're getting! Overall, great food. It's a bit on the pricey side, so this was the one 'fancy' dinner that we had while the visited. The great thing though, is that it's not overly fancy. You get the great service and food, but don't need to be dressed to the nines.Also, I'm told they try to keep bar seats for walk-ins (which is the best place to sit apparently) so you don't always need a reservation. (Though I'd recommend it)Visited March 2013",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PorUmUEZw79q54VpWRE2NA"
  },
  "ryxQrwEV8W7cD2aivaSBqg": {
    "date": "9/20/2011",
    "text": "I should say first off that we ate the pre theatre menu. Got there about six being hungry in Soho and thinking it looked nice. Greeted by a very surly maitre'd who asked us if we had a booking (we did not) and said we could eat if we ate fast. We sat at the bar which is really cute because instead of barmen there are chefs, wouldn't recommend sitting there if there are more then two of you (neck ache would incur). Food was perfectly nice, I had pasta broccoli and my companion, pig cheeks and pasta. All and all a nice meal but we were in and out in 30 mins and did not appreciate the rude welcome. Would not my turn my cheek at going again but would book a table if I do so.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AiId0iNo2hnSLgvwlwzIQw": {
    "date": "7/6/2011",
    "text": "Please refer here for some photos and more:hungryinlondon.com/2011/…  it happens that, when you have finished writing a post, you press a wrong button and everything is lost. (why does the auto-save only work when you don't need it I wonder). This happened to me with my truly excellent Bocca Di Lupo post and I am writing it now again with significantly less enthusiasm I have to say. Despite my computer disability Bocca di Lupo deserves to be written up. I wanted to go there so many times already but never managed to get a table. This time however the queue in front of Spuntino was too long, so we moved on to Bocca Di Lupo located in a little Soho side street. After 20 odd minutes that we spent sipping prosecco and people watching we were finally seated at the bar. I like the atmosphere at Bocca Di Lupo very much. It is stylish and down to earth at the same time, the patrons being a good looking mixed crowd of post-theatre and pre-party diners. From the people at the reception to the waiting staff, everyone was very friendly, attentive and forthcoming. As the name already promises, Bocca di Lupo serves Italian food. I thought I would know or at least be able to translate most Italian dishes but when looking at the menu I realised that I had still a lot to learn. There were quite a few dishes I had never heard of and had not the faintest idea what they could possibly consist of. Provenance is a big issue as it is also stated in the menu from which Italian region the respective dish originates from, I do really like the fact that you can order small and large portions of most dishes which makes the food at Bocca di Lupo ideal for sharing (or not sharing for that matter). It is not exactly cheap and some of the dishes (see below) are bordering on seriously overpriced, but there are enough dishes under 10 pounds to choose from that you can get away with a non-bank breaking bill when ordering carefully. I had no idea what Crescentine, prosciutto sardo & squacquerone (7 small, 14 large) could possible be, so it had to be ordered. The 'bread' was reminiscent of fried pizza dough, still warm and very pleasant eaten together with the mild and creamy cheese (squacquerone stems from the Emilia Romagna) and the thinly sliced delicious prosciutto. This is comfort food of the highest standard. I have to order a dish that promises to be 'extremely spicy', in this case the Orecchiette with 'nduja (extremely spicy home-made salame) red onion & fresh tomato (7.00 small, 14 large). Finally a place in London were you get your pasta served al dente without having to fight for it and send the plate back 3 times! Again the thought of comfort food comes to mind. I have eaten more sophisticated pasta dishes, but this in its earthiness was rath enjoyable. Of note, it was spicy but not extremely so. For some vitamines we chose the Broad beans, rocket, lemon & mint (7.50). This I really thought was overpriced. Not a bad dish and certainly healthy but slightly tasteless and absolutely not worth 7.50 pounds! Or are broad beans an expensive ingredient?After so much green there had to be space for dolce . None of the usual suspects on the dessert menu  no tiramisu, no panna cotta and no zabaione. Again a lot of stuff I have never heard of and our choice finally fell on the Palle del nonno (6.50). 2 fried dough balls came filled with a hot chocolate/ricotta mix, faintly tasting of orange and this was unlike everything I have ever eaten before. It was quite nice but I don't think I would necessarily order it again. In addition, 6.50 pounds is just overpriced for this, particularly also considering the presentation (or better lack of any). In the end I did enjoy my visit at Bocca Di Lupo and I am intrigued to try more of their food. I was considering a green light and I would have given it, but the pricing seems a bit random particularly for dishes that can't cost very much to make.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "U2WCgf5nkN4ZQBar1UIqsg": {
    "date": "7/5/2011",
    "text": "3.5 stars.  Came here this weekend and managed to get seating for two at the around 6 PM on a Saturday.  The ambiance at least around the bar is nice - very active with people but still casual and friendly.  Our servers (we had two at different times) were also friendly.  The food, however, was very inconsistent: at times quite nice and at times quite disappointing.  Because more of the dishes were of the latter variety, I think this place is closer to 3 stars than 4.  First, a few things were excellent.  The olives that were served before the meal were absolutely spectacular.  These were among the best bites I have had in a long time and they were served as a complimentary starter.  Ask for seconds.  The focaccia that was served with olive oil prior to the meal was also excellent - very olive oil-y, in a good way.  In terms of main dishes, two items stood out: the homemade sausage with tomato and polenta (very good) and the orrechiette with spicy salami and basil (also excellent).  A veal saltimboca was also quite good - although two of us split opinion on this.  A second pasta dish was linguine with spider crab (just ok - the crab got a little lost in the dish and there wasn't a ton of flavor)Beyond that, other dishes ranged from mediocre to sub-par.  Two starters disappointed: (1) a salad with artichoke was bland and the artichoke was very tough; (2) courgette flowers with mozzarella and anchovy - this dish sounded absolutely fantastic but it had very little flavor and was quite oily - it could have used maybe a ricotta-type cheese n place of the mozzarella.  This place was good but not great.  A number of dishes missed the mark.  For upscale Italian food, the execution has to be better for a visit here to be worth it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RiX-KrIbTbxFBP8e3P6_pg"
  },
  "QjsX80mzZKcJL7NhuNrQiQ": {
    "date": "5/7/2011",
    "text": "Great experience, great service and really good food.  We had the much-mentioned radish salad with truffle oil, and it was perfectly balanced, unique and delicious.  My husband, who is more of a meat and potatoes guy, loved it.  The spicy orecchiette was very good, and definitely had a little bite. Everything we tried was tasty and well prepared.Out sweet Italian waitress was absolutely charming, and perfectly attentive even though they were quite busy. She took the time to explain the menu and her suggestions were spot-on.We will be back next time we are in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bC38WnG5JAIEFw_7h1FerA"
  },
  "JgpGs2HCj5Y9ua_jdSw1VA": {
    "date": "10/25/2013",
    "text": "Kitchen closes at 11:00. If you are going to advertise that your place closes at midnight, then keep it open to atleast 11:30",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5QNjZOwGdAF3O-CHQ1JTg"
  },
  "FaG4minjuaYmJb_r_wuAqw": {
    "date": "7/31/2013",
    "text": "We wish we could give it 4.5. We found this restaurant with the help of Yelp. Just arrived in London from the US. I enjoyed the tortellini Parmesan. Family members enjoyed dory fish, a spicy pasta dish (forget the name) and sausage. Many delicious desserts - mini donuts with a side of chocolate was fantastic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05KPnXbrBWsNqmgI1ynY7A"
  },
  "XYwv6mn2jNqLfjyrzXx6BQ": {
    "date": "7/1/2015",
    "text": "Top notch all around. Food was really amazing, ordered a few small plates and appetizers to share (risotto, tortellini...) as well as the lamb main. Friendly, authentically Italian chefs and waitstaff. Was seated at the counter, which was a little hot and noisy (as is typical) but close enough to the action to see the prep work which btw, is a great vantage point for deciding on which dishes you want :).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VC6sShDtQDvlzbiqoWUKw"
  },
  "ninAH1t8OSsTUZ33chwYOw": {
    "date": "2/18/2011",
    "text": "Yes, I am a fan.  This place was hard to get in but I finally manage on my last day in London.  We were seated at the counter by the chef station.  How incredible to see the chefs all hard at work, it was like a life viewing on a cooking show.  Anyway on to the food.  I went with my friend who is a pescetarian but that didn't hold us back. Cream of red prawn risottoBlood orange, red onion & oreganoMonk fish cheeks with gremolataNettle & borage pansotti with walnut sauceRustic pork & foie gras sausage with farro & porcini (i had to)Everything was so good.  I especially liked the pansotti, the monk fish, and of course the sausage with farro.  Really really good.  I recommend anyone visiting london and looking for a no fail delicious meal.Service - excellent.Atmosphere - excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HdqXXFNO3QeNRkz7l0OjdQ"
  },
  "rjNbpjsoL_VtxflQLj0A7g": {
    "date": "12/4/2013",
    "text": "Back for a second with some well-heeled guests and fellow frequent travellers. Another stand-out experience, this time putting ourselves in the hands of Rich and his team from truffle to menu to wine selection. Some unusual and exquisite choices which added to the conviviality of the evening. It's going to be a cold day in hell before I get tired of this experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Td-3hHK4tOgOu9wpv0r8bg"
  },
  "n7KMyMAVbHSjDqSgLiMnDw": {
    "date": "5/24/2010",
    "text": "One of my favourite places to eat in London, let alone Soho. I've always sat at the bar, right in front of the kitchen at the chef's counter (I love seeing how my food is being made), and am amazed at how efficient this place is. The menu is constantly changing, but is always packed full of traditional Italian dishes. I still couldn't be tempted into trying any of the offal, but I know it's very good from the speed at which I've watched someone eat it! My favourite dishes here are the seasonal risottos, which change every so often, and are just to die for. Very, very good dessert as well, with exceptional espresso. Good service without being overbearing, and a truly comfortable environment that makes you want to stay all afternoon.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P27bQcSOCsiRsv5wKwO3uw"
  },
  "7mCsNCv1dN5PBAMsFnfNXQ": {
    "date": "8/16/2010",
    "text": "Great spot, cool scene, love the location, menu is inviting, but every dish was just a little bit off.That's the succinct version. I went here on a Friday night with my wife, and we were really excited to get seats at the counter. The location is very convenient to our usual late night haunt, and we love rustic Italian cuisine. Upon arrival, the staff was fun and attentive, which is a nice change in this city. We opened up a bottle of Primitivo that was decent and affordable, and ordered a bunch of small plates, with great help from our waiter.What followed were a variety of dishes that just didn't get the job done. The ideas were great, but everything was just not quite to the level it should have been, particularly with regard to salt. We found most dishes had a complete lack of it, while a couple had way too much. These basic flavoring issues happen, but when they're consistent across a meal that's going to cost sixty pounds without wine, I have a bit of a problem. That said, maybe it was a bad night.We'll likely go back and sit at the counter right in front of the kitchen for a better perspective. I really want to enjoy the place, and I like the choices on the menu. Hopefully I'll go back, and the execution will warrant the prices and popularity.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cisT4a-uLrdCajUvIECttQ"
  },
  "9kcRsyrFuMbYuV583ZIK5Q": {
    "date": "5/1/2011",
    "text": "BEST meal in london!  A coworker recommended this restaurant to me before I left and I was luckily able to snag reservations at the bar - which is the best place to sit because you can watch them make everything! (And Chef Adam is super cute!)This is the perfect Italian food - light, fresh, and tasty.  Must haves:Radish SaladGrilled OctopusFried MozzarellaSpicy OrecchietteTomatoes side (sounds boring, but probably the best tomatoes I've ever had)Dessert: Brioche sandwich of pistachio, hazelnut, & chestnut gelato (AMAZING - all three of my favorite flavors!)I ate so much that the chef was shocked by my big appetite.  It's in a cute neighborhood with really modern decor - a must go in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUc2ehMXCEZG4CQo5DVWAw"
  },
  "_JDIQSK-zoZGh85c9wapGw": {
    "date": "2/27/2011",
    "text": "Great italian place with a well-balanced menu that ticks all the variation of cuisines of the peninsula. It's got my favourite fried soft-shell crab in London. You absolutely have got to sit at the bar to marvel at how fast and slick the cooks are working to create the little magic of your plate. And the best is the service which is absolutely impeccable and makes you feel super special: we got in late for our reservation and felt quite bad as the kitchen was about to close soon, yet the waiter offered us some prosecco to get us cracking on our dinner and revigorate ourselves from a mad run through the streets of Soho to get there in time.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "r6XlR9CLfhWLYGjRjNgROA": {
    "date": "7/14/2013",
    "text": "Fresh ingredients, piquant flavors and an attentive staff make this a restaurant worth visiting.  The extensive wine list had a number of hidden gems, including rarely seen producers and unappreciated varietals to which the knowledgable stand at the ready to direct you. Sit at the bar in front of the kitchen and watch the magic - it is a sight to behold.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aloua7cxRALuLv8i93Jm1g"
  },
  "sOKfBpiBV9tturJGej4zyw": {
    "date": "1/3/2011",
    "text": "What a sublime restaurant nestled in one of the most chaotic parts of London. If you are looking for delicious food, fantastic ambience and divine service Bocca di Lupo is your type of restaurant. I can only think of glowing things to say about this gem - from the abundant choice on the regional/seasonal menu to the service. It's simply perfect.I highly recommend sitting at the chef's counter so you can watch the preparation of meals - it's like a finely tuned symphony. Simply delightful. I've gone there three times, and I wouldn't hesitate in saying that it's my favourite restaurant in the city. A little pricey, but completely fair as going for a meal at Bocca di Lupo is a scrumptious and civilised meal experience.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GfkIpqIe-cXaQwPi0AotGg": {
    "date": "7/7/2011",
    "text": "This was just brilliant, popped in unknowingly and was blown away.The idea of small/big sharing for italian was very good. The calabrian N'duja pasta was dynamite.Price point is very good and you do get your moneys worth - big time.Service when we sat down was a bit slow (had to ask for wine-refill a number of times) but that's all forgotten as the greeting was fenomenal: a glass of wine/sparkling on the house while we wait. That's just A+ in my book.Food wise I'd recommend the N'duja and Spidercrab pasta as well as the small truffle dessert (cannot remember name) which actually is plenty to share for two if you just have that little sweet tooth after your meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5G18j3O7UmZ-aOWVVS1Ig"
  },
  "K1xxEniKupD5buUPFbAVNg": {
    "date": "6/30/2012",
    "text": "Great place after the theatre, but there is also aprivate dinning room downstairs which serve as a great place for private dinners - the pig roast is a must!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  }
}