{
  "Cp4d-wiOKSGEMhf974anSQ": {
    "date": "6/7/2015",
    "text": "Popped in for a late night grilled cheese toastie craving. Loved the fun & friendly ladies that were on shift. Not much for atmosphere here, not the most amazing grilled cheese ever, but definitely a good one. Solid option",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qdzkNY0U9Jv159GEF7KTyQ"
  },
  "B3hpks5BdzFQpg-MF1VMeg": {
    "date": "6/9/2015",
    "text": "A good place for a quick bite with friends, loved the sound of the crunch, and the nutella mascarpone was to die for. I also had the bbq chicken, which was ok.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3fRrM4Z9BEZQgCuy0_9pvw"
  },
  "qTtOyt_VONJhiWi8H2fNYg": {
    "date": "5/30/2015",
    "text": "Indeed nothing special, bread was nice but the cheese mixture was average and could have been more. I like my sandwich messy!Onions are 50p on top. Two slices of bread, a bit of cheese and onions for 5£ in total. I guess 4£ would be the right price in a non-hipster world.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xuIjymiB9HMIm_V9EQSwvA"
  },
  "sl2zuySObyHTUSmOKfrdmw": {
    "date": "5/9/2016",
    "text": "Absolutely disgusting and disappointed.  Had the Mac and cheese and 3 bean tuna. My wife got food poisoning from it.  The food was bland and utterly tasteless. Please avoid.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "glg5K2xeuAfp7rh19rs_bA"
  },
  "kMer3l09jMVhWrpRtBn6zA": {
    "date": "6/4/2015",
    "text": "Taste was just OK. Not enough lamb in my lamb toastie, I could just about taste it but I didn't get the texture of it at all and as for the price £7!!!!!!, daylight robbery. Typical Soho rip off, take essentially cheap food and mark it up.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVJidiYxSKDZWZq3sAZssw"
  },
  "8U7OqtVKrec0uyl65cKDmA": {
    "date": "5/27/2015",
    "text": "I had the portobello mushroom and cheese with peppers and thyme. The sourdough   bread was fresh and the cheese very rich-tasting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSFzZcqGfpMxX5CWF4w0iA"
  },
  "4lgMYzlo89KRWiAT5pof0A": {
    "date": "7/26/2015",
    "text": "The concept is brilliant; grilled cheese, toast, and it being served to you piping hot. Amazing.Some of the flavours are good, but there isn't enough variety in the types of flavours. Need more ... more ... ugh, I dunno. But I've tried everything on the menu, and they were all good but none of them apart from the sweet one with strawberries and cream cheese (it's like cheesecake on toast, omg) but I just want more meat on my toastie!All of this is incredibly subjective to my personal tastes, of course, and your opinion will probably differ. You should definitely give this place a try!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "riM0PfJOzcSSIH_fNBFiJA",
        "caption": "Photo of Melt Room - London, United Kingdom. Tuna and beans!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/riM0PfJOzcSSIH_fNBFiJA/o.jpg"
      },
      {
        "img_id": "XNCZkUbRk-L28KOJOajz4A",
        "caption": "Photo of Melt Room - London, United Kingdom. Platters and platters of amazing, gloopy cheese! #dietstartstomorrow",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XNCZkUbRk-L28KOJOajz4A/o.jpg"
      },
      {
        "img_id": "2KW382--rb5NbBQr9iYd9Q",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2KW382--rb5NbBQr9iYd9Q/o.jpg"
      }
    ],
    "user_id": "4DWI_eqBhkF7CG0EzPlEHg"
  },
  "QlH5llugkq_6udFzyElRfA": {
    "date": "2/7/2016",
    "text": "This place is dubbed an American style grilled cheese shop, and it's anything but that.What should've immediately given this place away a second rate is the fact that all their sandwich options are already pre-prepared and stored in day-dotted food containers behind the counter - which tells you immediately you could be eating a sandwich prepared yesterday.Moving past that, I ordered the BBQ chicken at the recommendation of the lady at the counter along with truffle fries.As another reviewer below wrote, this sandwich is completely devoid of flavor which is a remarkable accomplishment for something with cheese and BBQ chicken.  The truffle fries were nothing special either.If you go to the states, there are ACTUALLY good grilled cheese shops such as Murray's or Beecher's you can eat it.  For something fast-casual you could even do Melt Shop which is just head and shoulders better than this place and is comparatively fine-dining.I gave this place 2 stars and not 1 because the food was edible.  Don't fall for the hype, this place is below average.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PWS76dm182CIa8VIKY6Ncg"
  },
  "ym-1hPVUW-DYUdRxr_MATQ": {
    "date": "10/19/2015",
    "text": "Perfect grilled Cheese with lamb shoulder! Hit the spot after a nonstop morning of Westminster Abby, Courthault Gallery and Berwick street- fast and polite service, good quality and moderate prices-",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LN9jKtRpVapVFUiuit2Ogw",
        "caption": "Photo of Melt Room - London, United Kingdom. slow and low lamb shoulder",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LN9jKtRpVapVFUiuit2Ogw/o.jpg"
      }
    ],
    "user_id": "0k17z17jGgxJYUUWHEZVRw"
  },
  "JIar9A78zts0AYZXG_zgxw": {
    "date": "3/2/2016",
    "text": "Sadly I didn't like my sandwich :( I got the BBQ Chicken... I felt like it needed more cheese and the bread was half burnt which I hate the taste of burnt bread!!!! I don't mind a bit of burnt toast if it has butter but that wasn't the case. I feel I should've just ordered the Classic. The coffee was a complete waste... I felt it didn't have a bold flavor.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y1r60Pt4wkaXbP3S7N3QLw"
  },
  "sNFCQTD8BxfcsihpOPcpsQ": {
    "date": "7/16/2015",
    "text": "They opened recently, and as a food lover, I needed to come and try just because of the catchy name. Melt Room make magic with grilled cheese sandwiches. They taste like happiness and anything goes fine with the cheese. The BBQ chicken is to die for and it keeps me sate for the whole day. However if you are a sweet maniac I recommend you go for the Nutella melt. I is a sandwich made of heaven, dripping Nutella and marscapone grilled cheese. It's not a place you'd go to hang out or take a break, but great food is always a reason to visit.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "OOy2c56e3JV6OQO9oGgb6A"
  },
  "yrZQ4G8ZbD-SEGmaH7Q9iQ": {
    "date": "2/4/2016",
    "text": "My only comment to make about this place is that ideally, it just needs more cheese. Probably not the best comment to have for a place specialising in grilled cheese sandwiches...Don't get me wrong, the sandwiches were good and tasty, but there just wasn't that satisfying gooey middle packed of cheese that just splurges out the side of the sandwich. You know what I mean. They do have however, some really interesting flavours and specials! I'd happily go in if I was looking for a grilled cheese sandwich and was in the area, but I'm not fully sold on the way they're doing it at the moment, at least, not enough to go out of my way to come back to this place!Also, I get that this is just a small place churning out the sandwiches, but seeing plastic boxes filled with premade sandwiches doesn't exactly fill me with confidence that my sandwich is particularly fresh or individually made...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7eG-rakZRHCGyEEELoTFaQ"
  },
  "DYIuiJc0Z9n2dJlUluQN6g": {
    "date": "10/16/2015",
    "text": "I have loved grilled cheeses for many years. This love was only cemented by a restaurant in Toronto that was dedicated to the humble sandwich and was the best I had ever had. Ever since then I have hoped that someone would show this sandwich the respect it deserves by dedicating an establishment in London just to its gooey deliciousness and finally there is one!  But is it any good?   Ehhhh. It's okay!   It's a small place with room enough only to sit ten inside. It's clean and it's very bright inside and there is a nice atmosphere in there despite its small size. But what about the melts? They have quite a few to choose from, ranging from lamb to bbq chicken, pulled pork and even dessert melts with nutella. I opted for the salami cheese melt as with porcini mushrooms and red leicester cheese it seemed like a taste sensation!   The bread was toasted well, not underdone or burnt which is very important. The flavour of the actual sandwich was also really tasty - the only downside is how tight they are with the filling! When I have a grilled cheese I want to be able to really taste the cheese! The staff there are really nice but getting your sandwich can take a little while so don't expect to be in and out.   Give it a chance! As a new business they might just need some time to work the kinks out and while the portion isn't plentiful it is tasty.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dKJ8szjSFs3bWUtenDYFfA"
  },
  "VxKhlkKyJ7k-feT4WLgI4w": {
    "date": "12/9/2015",
    "text": "I don't know what the fuss is about. Decent grilled cheese (I got the classic). Had better in the LA food truck scene. Will return to try something else to be sure, but it wasn't that cheesy and my bread was pretty dry!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQ0r3LdgDtKCik5jUmqMUg"
  },
  "YJgsxV1yvZJBtiuKUi4rkg": {
    "date": "7/19/2015",
    "text": "This looks like a pop-up style restaurant located at the Oxford St end of Soho. It specialises in a range of toasted sandwiches; they are mostly savoury but I spotted a sweet one (Nutella and mascarpone on milk bread).I wavered a bit, but ended up choosing the sweet one just because of the unusualness of it. When it came out, I was a bit underwhelmed. Maybe I was expecting something more chunky, but it looked like an underdone toasted sandwich using ordinary supermarket bread. I liked it a bit more once I started eating it, but it was still nothing spectacular.I did notice a few people walking away from the shop, having bought some of the savoury toasted cheese sandwiches. These looked better and might be the way to go if you try this place.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "G9UDzw4fILnFfY0Aib1SbQ": {
    "date": "7/22/2015",
    "text": "I'm back to reviewing again and Meltroom deserves to be my first of the year. Meltroom is decent competition for Kappacasein to win the top place in my top 5 best grilled cheese in London. I would suggest try the classic because as Pamela said, it is the best way to evaluate a new place. And honestly, it was delicious. The bread is perfectly  toasted and buttered. The cheese was still very worm but It tasted so good I couldn't stop eating. The shop indeed is tiny, and despite they opened recently, it is getting pretty popular and as most places in Soho, it tempts to get very busy.Be prepared for some waiting which is acceptable considering the eating experience you'll get.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hrYQQEO2M-mrzU_QTEqq4Q"
  },
  "Qy3ICFKfNUMW64F_xLD4BA": {
    "date": "5/15/2016",
    "text": "I just had a regular cheese toastie here and it was a yummy toastie and we had very happy friendly service. Butttt just not the perfect toastie for me. The toast was so crunchy it was almost hard. I am a crazy cheese fiend so I would have liked a bit more squidge and even more cheese. Maybe the other fillings would make it a bit more fun, but I think I'll just stick to making toasties at home.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "aEvXXiSkgW4D2d8IJWPumQ"
  },
  "DAImTwjyIcR-bt_hUijDVA": {
    "date": "8/20/2015",
    "text": "To put it bluntly, the food here is fairly average. I had the slow roast lamb toastie and a side salad. The lamb was fairly bland. The cheese with it (swiss) didn't really work for me. Apparently there's mustard on it. I barely could taste it. The bread is quite crisp, but really lacked the butteriness you want on the outside of your sandwich. I don't think they used any at all. The salad was some greens and some chopped green onions. Luckily, it came with way too much dressing on the side so I could dip my sandwich in it to make it taste of something.I'm a huge fan of cheese, but the hype around this place is just that: hype. I was expecting a life-changing melt in your mouth toastie, and I got something that I probably would have liked as a thirteen-year old, but as an adult, my palate has expanded. If the first bite I take makes me think, \"Yeah, I can do this better at home\", it's not a good sign. It's probably also not a good sign that I was there for 15 minutes during lunch hour, and there were a small number of people who came in.Service was fine, and the staff were friendly, but as toasties go, there was a huge level of disappointment. Honestly, two stars is probably a bit harsh, but three is way too generous. So what can you do? It's (relatively) cheap though at £4-5 a toastie, so I guess that's something.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "wNj4o5003IVmyEuG7IQN1w": {
    "date": "4/30/2016",
    "text": "The cheesy fries here are amazing! And at a great value for money, especially in central London. I tried the truffle fries as well, but personally I didn't care for it. I also had the classic melt, which was good. They don't give you any plates when you eat in, especially since it's a small place, but it's hard to eat the sandwich and fries without any plates.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKb8To65Hw0vpmWO2eZhHA"
  },
  "q7W-l5fvZC4MvkbD9Jo5_A": {
    "date": "8/10/2016",
    "text": "Be aware that this place receives a lot of online orders and they will take those and finish them before anyone sitting in the restaurant. The sandwiches are all pre made yet it took almost 30 minutes for me to get mine while I was sitting in the restaurant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sgh9zaZDBI73RHqJRzPew"
  },
  "bikXZ6DKB_Hh4ykTFkIYlA": {
    "date": "8/6/2016",
    "text": "The grilled cheese and cheese truffle fries were ok. The coleslaw had way too much mayo. However, the reason Melt Room is getting 4 stars is because of the banoffee sandwich. When I ordered it I thought it was going to be a standard pie and was slightly disappointed to see a sandwich. One bite and all disappointment vanished. I won't be getting the grilled cheese again, but Melt Room is my new favorite dessert spot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsuJ4R1xYqCHp0GVbpZldg"
  },
  "0jt1F3qY_y90WTMQ-Tcw-A": {
    "date": "9/23/2015",
    "text": "Lovely little stop off for a toasted cheesy snack, with a variety of fillings to suit any cheese lover or if you're looking for something a little sweeter, try the mascapone and nutella toastie.  The latter was delicious, served on fresh milk bread with lashings of cheese and priced very reasonably as well. Great place to refuel and escape the hustle and bustle of Oxford Circus.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUjCjl-h44JjtMZfdO7LWg"
  },
  "XAs7KggUgdhtAAdpAs8ckw": {
    "date": "5/24/2015",
    "text": "Just had the Nutella and marscapone grilled cheese, surprisingly delicious. Not enough Nutella but then that's just me being greedy. I'll definitely be returning for a savoury melt and I'm looking forward to that day.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Pztr3DWMpVf0v_36lA6gA",
        "caption": "Photo of Melt Room - London, United Kingdom. Nutella marscapone grilled cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Pztr3DWMpVf0v_36lA6gA/o.jpg"
      }
    ],
    "user_id": "6Li70D0zzruSBjjIBrg96g"
  },
  "sQ-Mor4DwYj2sNNcr93hng": {
    "date": "8/18/2015",
    "text": "If taken for what it is, a sandwich shop, then I think this place is alrite. Perfect for a quick bite before a few beers. The basic toasted cheese at is 4 quid and the others 5. The service was pleasant and the interior comfortable. It's nothing special but reasonably priced.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "3GR-2pFD6TcQVW7nqht-XA": {
    "date": "11/19/2015",
    "text": "I think an angel came down from above and created this place because those Mac & Cheese melts are heavenly",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kcWWPb_NOEgoIvomxTEnA"
  },
  "WjlB658TE5FUVd9SrgTGzQ": {
    "date": "9/15/2015",
    "text": "AWESOME cheese toasties (the best I've found in London so far). I went with a friend and we both went for the Classic without onions - after all, what better to judge a place on that its simplest item? Despite only being £4 (compared with a certain Borough Market's infamous cheese toastie at £6), the toastie was sensationally cheesy and gooey, and I will definitely be frequenting this place as often as my waistband and purse allow me! Next time, I may even go one step further and ask for onions... *tense drumroll*",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8rJuX9ZfQmp4CtJOmjErg"
  },
  "Svmp0hJpq8kIcxw50S-jVg": {
    "date": "7/30/2016",
    "text": "This isn't a place you go to linger, it's a very straightforward sandwich shop with equally sparse atmosphere. That said, the sandwiches are excellent and made to order while you wait. No matter what you order, expect crunchy buttered sourdough, a generous helping of melty cheese, and more than enough of whatever filling you choose. A sandwich alone makes a very satisfying meal. The pulled pork is good, but not the best thing I've ever had. It was a little dry, could possibly have used a bit of sauce, and the delicate flavor of the pork clashed somewhat with the mustard and choice of cheese. Maybe try something else. The mac and cheese, however, is worth the trip to Soho if you're a homesick American. Gooey cheese, al dente macaroni, and for £1 extra, a thin but flavorful slice of Canadian-style bacon. Delish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXdrJNSTZX5j45mJfxHH2Q"
  },
  "jjbI5PMjUOIF5uN9mxGzOg": {
    "date": "4/26/2018",
    "text": "Feel like satisfying your childhood craving for grilled cheese? Just make yourself one at home.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MyTKanxkEXkJNAub4SmJsg",
        "caption": "Photo of Melt Room - London, United Kingdom. Classic Melt (4) - special blend, three cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MyTKanxkEXkJNAub4SmJsg/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "gafDhWfYnUqqRhrh6gjbxg": {
    "date": "10/25/2017",
    "text": "At its core, the grilled cheese sandwich is reminiscent of the simple, uncomplicated childhood memories of yore. A good grilled cheese sandwich isn't meant to be gourmet. It's meant to cut you straight to the core and smother you with nostalgia before shattering this facade and forcing you to swallow the bitter pill of adulthood and all associated responsibilities.I clearly should've studied philosophy at university. Instead, I chose to eat delicious $10 grilled cheese sandwiches and subpar $10 grilled cheese sandwiches. Call me the tortured soul of our generation. But when I walked into Melt Room, I realized that all I wanted was comfort food, plain and simple. My classic toastie was fine, I guess. No fancy ingredients, no gimmicks. It was a vague \"cheese blend\" on sourdough. No complaints about how the bread was toasted. But the sandwich itself was just... bland. There was nothing special about the cheese and it wasn't gooey like the grilled cheese sandwiches in my memories. But is anything ever as good as how you remember it?Realizing that I should have gotten one of their fancier toasties is probably what growing up feels like. And it only cost me £4 to figure that out!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cAfGtOXhJwo18TETVd26sQ",
        "caption": "Photo of Melt Room - London, United Kingdom. Classic toastie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cAfGtOXhJwo18TETVd26sQ/o.jpg"
      }
    ],
    "user_id": "35GpxESlwQLvq-K3t62mxw"
  },
  "DdmJKdR14W_WI544BLKFyg": {
    "date": "9/25/2016",
    "text": "I don't know why we decided to order toasties through uber eats.... We had a voucher so it was free but still - what a waste. Looking back now it was quite clear they were going to be cold and soggy. The promise of sweet toasties (one Nutella and banana and the other pb&j) had so much potential but they were just gross. I'm more annoyed that Melt Room have signed up to uber eats when they clearly can't deliver a good quality product, although saying that I don't think much of the toasties when visiting the shop in Soho.I would recommend avoiding visiting or delivery. Buy a toastie maker instead...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H4zmIPUnIwzhf6WtwShI5Q",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H4zmIPUnIwzhf6WtwShI5Q/o.jpg"
      },
      {
        "img_id": "C7UtZAL-AtIZlCOsnwUUpg",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C7UtZAL-AtIZlCOsnwUUpg/o.jpg"
      },
      {
        "img_id": "lH6Gfu3UN2iAu8Wz_UF0EA",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lH6Gfu3UN2iAu8Wz_UF0EA/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "Ts4o7FifyzuK7REhW1I6YA": {
    "date": "12/20/2016",
    "text": "No, I wouldn't come back!- Service: service is a joke. It takes over 15 minutes to make a grilled cheese sandwich. Staff are very rude!- Food: portion is really big. A sandwich can feed two! The cheese are not very impressive. My mac and cheese did not meet my expectations.- Tip: eat by the window to people watch!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "thafq65QNCSlmybFKnK-Ww",
        "caption": "Photo of Melt Room - London, United Kingdom. Mac n cheese with bacon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/thafq65QNCSlmybFKnK-Ww/o.jpg"
      }
    ],
    "user_id": "-dUYEbvjMGCtX_c0rVUjFw"
  },
  "TEl7rqRf7J8GgngXAmlc5Q": {
    "date": "6/10/2018",
    "text": "Rude staff and overall poor service. Waited by the register until the employee finished their conversation before being able to order. Food was cold when it finally came out and they were unapologetic and had to ask twice for them to remake it.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7HzxfFtpHxbAVbDXzzjfPw"
  },
  "y3EuxT3-oSGuXBjE2d8pOw": {
    "date": "3/29/2016",
    "text": "I was so excited to find this place. Especially for it being so cheap in Central London. I tried the classic, just a regular plain grilled cheese. It was delicious, although the bread could've been lighter as it tasted too heavy in balance with the cheese. We also tried the cheesy fries and truffle fries, but they're pretty much the same, just the truffle fries has truffle oil added to it which is not much of a difference in taste. Also, the check-in deal is no longer accepted. They gave it to me (since it's basically just a free soda) after a lot of confusion but they say they don't have any links with Yelp anymore.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OZhbdyANnVKUgbrXAfnzTg"
  },
  "GTSXcQMKpmVwcV9Ob-RHuQ": {
    "date": "7/24/2016",
    "text": "I LOVECHEESECheese is great, cheese on toast is great, grilled cheese normally a thing you make at home for a midnight snack, or dinner when you can't be bothered? Think again. These guys actually make it worth having one of these out, range of cheesy combos, and chips, including cheesy truffle fries, and soup that you can dunk your hot oozey sarnie in. I am a fan, particularly on a rainy day, you can even two course it, savoury, and then sweet with their cream cheese and nutella. There isn't much place to park, but I like it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIqgaeMSEh7i0AmFgtCYOA"
  },
  "1rvxowujGpLpGRJQxJwUKg": {
    "date": "2/1/2016",
    "text": "Believe it or not, some foods are just better off made in your home kitchen. Much to my disappointment, Melt Room, despite all its potential, proved that grilled cheese is better at home. My wife and I came on a weeknight, and the place was deserted. A lone worker, and not a single customer for the time we were here. The guy was friendly enough, but it's the food that fell flat. On paper, it sounds amazing, but in practice, it was just bland. I went with the BBQ chicken, which had absolutely no BBQ flavor at all. The chicken was bland as well. There was basically no flavor. My wife had the Classic, and reported a similar issue. Bland. I don't get the bland bit. One of the first things I noticed after moving to the UK four years ago, is the incredible selection of cheese, especially cheddar. In ever supermarket I've been to here, I've always seen at least half of a dairy case devoted to a seemingly infinite variety of cheddar cheese. So, I ask, how/why does Melt Room supply the one kind of cheddar that is bland? It makes no sense. If any foodie culture should be able to seize this classic food and grow it for the next generation, it should be the Brits and their wonderful cheeses. This place doesn't do grilled cheese justice. It was such a disappointment, I can't really imagine we'll give it a second try.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jHlM64I_gTdaQ5Ap0jxdqQ"
  },
  "IYEHW-xE_fbs499eTZGtNw": {
    "date": "7/29/2016",
    "text": "If you love melted cheese and a proper toastie then you have got to visit Melt Room! Having been introduced to this little hidden gem in soho by my girlfriend earlier in the year I have been back several times and have not been disappointed.Of those several times once included a free toastie compliments of Melt Room. All you have to do is get yourself photographed by the team, stick the Polaroid print on the wall and tweet a photo of the print sharing your excitement and beautiful, cheesy face and voilà!With a fantastic range of toasties there is certainly something available for everyone. Oh and don't forget to try the cheesy fries, they're incredible.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vTQ_unTnvcjeiJuojLvZ3A",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vTQ_unTnvcjeiJuojLvZ3A/o.jpg"
      },
      {
        "img_id": "1Ly1WSA4VYlTfihBcUyTZg",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1Ly1WSA4VYlTfihBcUyTZg/o.jpg"
      }
    ],
    "user_id": "nrcOyN9FfNlm-NpglFkZfA"
  },
  "L8NAWT4GzHYC7p4pQLN71A": {
    "date": "11/16/2015",
    "text": "This does exactly what says on the tin: Melting cheesy toast sandwich.and they're not afraid to put A LOT of cheese. I tried the one with chorizo and it was delicious. They also do Mac&Cheese and truffled fries so I'll definitively go back to try them.They have a couple of seats to eat inside.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Ggaq_5gjSj7FYMBmXKx0g"
  },
  "z-D-LkslnZcZcE3JGU_kTA": {
    "date": "12/2/2015",
    "text": "Cheap and cheerful feed. Can vouch for the pulled pork sandwich, although bit messy to pull open and add sauces. Can't recommend the coffee though, not the best.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3n36paU9D3SjVMCp3niLqw",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3n36paU9D3SjVMCp3niLqw/o.jpg"
      },
      {
        "img_id": "48HbL3nZTRrijDZMKs-Reg",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/48HbL3nZTRrijDZMKs-Reg/o.jpg"
      }
    ],
    "user_id": "Rhkv-27rPZHQzK_ZYhd3rQ"
  },
  "qkKR8_G3LNlvH7JzDmvglg": {
    "date": "11/22/2016",
    "text": "Quite simply if you love a grilled cheese sandwich this is the place to go!  It's a tiny space but the service is quick, the staff are friendly.  This kind of place you would quickly pop in for a bite or takeaway.  I'm not a big cheese fan but the nutella sandwich I understand got rave reviews!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PCjUN2gS1-rofYfaJDZ6zA",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PCjUN2gS1-rofYfaJDZ6zA/o.jpg"
      },
      {
        "img_id": "HD364gLb6TCLKpya2xKKOA",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HD364gLb6TCLKpya2xKKOA/o.jpg"
      },
      {
        "img_id": "MPuA8faQK8lAFJITbARzpg",
        "caption": "Photo of Melt Room - London, United Kingdom. Nutella sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MPuA8faQK8lAFJITbARzpg/o.jpg"
      }
    ],
    "user_id": "ud_XSg8h2NFskZaqGrCu8A"
  },
  "Fi43rSZYWQigYBAtHWbEAw": {
    "date": "5/22/2015",
    "text": "I was waiting for this opening for weeks (no kidding) and Meltroom didn't disappoint :) Be aware you will have to wait 10 minutes for your grilled cheese since it's the new spot to try in Soho, but it's totally worth it !We had the lamb grilled cheese and the one with the beetroot : first, be really careful when you try to see which one is which. There was a strange V on one of the packet, so I figured it was for Vegetarian, right ? But maybe it was a L, or maybe they switched the packets before handing them to us, but....yeah we almost eat the wrong grilled cheeses ;)No worries, with all the beautiful flavours it was hard not to recognise the one with delicious and soft lamb. The lamb + the cheese + the mustard : gosh, I wished it never ended !! Even if this one is a little bit expensive (7£), you should try it !I had one bite of the beetroot grilled cheese : heaven for vegetables lovers !Just one tip for the staff : maybe try to cut the grilled cheese in half for the take away orders, it will be much easier to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "jOfrpVCuVCVmsAQhRG7WzA",
        "caption": "Photo of Melt Room - London, United Kingdom. Slow cooked lamb with mustard",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jOfrpVCuVCVmsAQhRG7WzA/o.jpg"
      },
      {
        "img_id": "XuMfrBuNpFlk4-OW_ys8Kw",
        "caption": "Photo of Melt Room - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XuMfrBuNpFlk4-OW_ys8Kw/o.jpg"
      }
    ],
    "user_id": "nZmqgRuN86ekd6cD6lQEKQ"
  },
  "hZmii2RQpbdGUK-TtYwUrg": {
    "date": "6/24/2016",
    "text": "Got this delivered to my office (in Marble Arch) within 15 minutes with UberEATS. Very impressed. I ordered the chorizo with tomato and basil bread for £5. It was very cheesy and kind of sickly towards the end of the sandwich but it definitely  did its job filling me up.With it being one of the cheapest options on UberEATS I can definitely see myself ordering from there again for a lazy lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmbtRXRVjtsLCIAP8yAzIQ"
  },
  "KsKDQDnACtJDGFNvBdn8IA": {
    "date": "7/1/2016",
    "text": "Melt room is a perennial favourite for me and my friends. There is no meal more fundamentally good for the soul than a toastie and melt room does these WELL. You can have a simple classic (with/without onions), more complex recipes like the pastrami (like a New York deli-style) or really push the boat out with their toastie desserts. I haven't quite made it that far yet!Perhaps unsurprisingly when their main ingredient is melted cheese, the toasties can be quite greasy so do pick up napkins and the hand wipes provided. I'll definitely keep going back as long as my waistline can take it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bLXTZKhxs9NICljlmoz0Yw",
        "caption": "Photo of Melt Room - London, United Kingdom. They moved our photo from the O. We did get free toasties though.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bLXTZKhxs9NICljlmoz0Yw/o.jpg"
      },
      {
        "img_id": "S4CCiRQt8mmKZbvj3LKO4w",
        "caption": "Photo of Melt Room - London, United Kingdom. \"Pull your cheesiest expression\"",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S4CCiRQt8mmKZbvj3LKO4w/o.jpg"
      }
    ],
    "user_id": "6OuFE3uajrSGThl4cnKz0Q"
  },
  "9D0N1-5jBKhPOCqwGXCVSw": {
    "date": "9/14/2015",
    "text": "A grilled cheese - easy...A Melt Room grilled cheese - something special.I went in last Friday just wanting something quick and easy for dinner. I will admit I completely missed the menu on the wall, instead I saw one of the specials, grilled cheese with bacon? SOLD.I was the only one in there at the time so ordering was quick. The lady immediately went to work, bacon on the hot plate, freshly cooked, not reheated. Other people came in and ordered and I zoned out for a while while listening to my audiobook... The lady behind the counter catches my attention, and then hands me an insulated bag with my sandwich, I peek inside to see... macaroni and cheese, inside my grilled cheese. Apparently in my haste to order bacon, I didn't read the rest of the description. But what a treat! The macaroni was a little messy but so worth it. It was tasty, the bacon came apart nicely (was streaked enough that you didn't have to fight with it) and all good in a single hand held package.Eaten quickly and I was on my way. A nice pitstop to end the evening! £5 might be a little steep, but it's a good sandwich made to order.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LDWCOLV_KjP_RO0bn8PUA"
  },
  "k06ZcuIw2jnFwNs9o6UoWQ": {
    "date": "2/25/2016",
    "text": "Melt Room. I put this off for too long. I love a cheese toastie. In fact I grew up making these late at night or at uni cos it's cheap or to eat in a club with a can of red stripe (Bristol I love you).But when I get here I realise upon looking with own eyes that these toasties. In fact most if not all need me to be more gooey and cheesy though. Grill my cheese is better for proper cheese toasties and even some food stalls on Borough market. Toasties should be like dirty munchie food and not seem to be perfect when toasting. The bread should be slightly overpowered by the cheese melting over, I shouldn't have to taste too much bread. I do admire there price range though. £5 is just about on tipping point for most so that's fair as its central London too. They also do have a ice varied range in terms of other fillings also.I miss my uni days of imperfect late night toasties in all honesty, and I may invest in a George Foreman grill once again. I can't help being felt let down. Melt Room hasn't quite nailed it. It's like gourmet cheese toasties. Which is not what I think it is about. I think they should be pushing to more extremes, certainly visually which is what we see first in food. The taste is OK but give me more. Is it Instagramable? No. Then it's not pushing itself hard enough.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "EP0OqCJvONTwH7k9W5eNjw": {
    "date": "5/16/2016",
    "text": "Not bad for what I think is the first grilled cheese spot in Soho!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZdgbbvqdUNk2lpixctQs9Q",
        "caption": "Photo of Melt Room - London, United Kingdom. Gooey Cheese :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZdgbbvqdUNk2lpixctQs9Q/o.jpg"
      }
    ],
    "user_id": "T4hUdiA10H2XSyp-Hca-8A"
  },
  "-WLZRqkckvNQR0F2pPncUw": {
    "date": "4/5/2016",
    "text": "Should've tried a toastie - Went for the 'Truffle Cheese Fries' and 'Vine Tomato Soup'. The fries, when emptied had a miserable amount of truffle scented cheese dolloped on them (effecting about 10 fries) and leaving the others naked and bland. I gave the rest away and moved onto the soup. Assuming - foolishly - it would be homemade (with the 'Vine' in the title suggesting so). Imagine my confusion when I open it to see Heinz tomato soup looking back at me - At least have a warning as I would definitely have ordered something different. Although if tinned soup with a fist-full of cheese is your thing - you're in the right place. Don't visit if you appreciate effort going into your food.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q_J--9qNXrdzfQXGjmeAXg"
  }
}