{
  "c_nOfblDMUrFD6dqUa6Iuw": {
    "date": "5/14/2012",
    "text": "can't belive they dare calling the restaurant 'Pho'. cause the so called Pho Tai I had for dinner was overcharged hot water with some ingredients, which tasted like nothing! I was told that their soup is ok, so I had no huge expectations, but that was ridiculous - shame on them! haven't tried anything else from their menu and sure will never do.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Ez2iO_tCruQwGy2VEmiyhA": {
    "date": "1/21/2009",
    "text": "I don't think this place is anything special, it certainly isn't as good as some of the Vietnamese restaurants in East London. I found the Vietnamese pancakes very greasy and heavy, quite disappointing really. The noodles were nice and so was the soup but i thought the prices are too expensive. It wasn't great value for money but if you're catching up with friends and looking for somewhere quiet to eat then Pho is good for that as it doesn't seem to get very busy in the evenings.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rcSKV4756Xhpzhj-vQZI6g": {
    "date": "11/21/2008",
    "text": "Pho is rather disappointing. I won't use the word 'authentic' as this isn't it. I suppose if you're new to Vietnamese food, there's no harm in starting off here, as long as you doesn't leave here thinking that this represents Vietnamese cuisine. The bill came to £32 (with no alcohol) for two.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4weM-RjsuR52KSivrPYSag": {
    "date": "6/12/2009",
    "text": "i had a wicked night here with my girlfriends last week. we shared a few starters to begin with - summer rolls, spring rolls, meatballs, a crepeall yummy. we all had pho (noodle soup) for mains - amazing, which could have been precarious before going out, but the girls working suited us all up with bibs, and all our dresses were spotless for champagne induced dancing later. fantastic little place!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BnW-cRhDe6qzQMh6v657WA": {
    "date": "5/22/2009",
    "text": "i have been here quite a few times now, and it has definitely become one of my favourite restaurants. it's just so healthy, tasty, and fresh that i rarely think of a place i would rather eat. last night i had the 'bun bo hue', or the spicy brisket pho. it was to die for.. loads of coriander and chili - delicious. i washed it down with an ice cold beer - Halida. Perfect dinner.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "SuypKuADLXKT-GIJI5Kl9g": {
    "date": "11/6/2008",
    "text": "Truly the worst Vietnamese meal I've ever eaten. Last year I was lucky enough to work on a cookbook with experience in a professional Vietnamese kitchen in London  this rather spoilt me. Eating Vietnamese food in London can often be reminiscent of eating Indian food here in the 1970s. So, why is the restaurant PHO so bad? The banh xeo was like a hard greasy taco shell, the nuoc cham tasted like red dish water. The Pho, and noodles, and curry were vapid, with meat that tasted as if it had been frazzled-black several hours ago - like bits of old shoe leather. All in all, truly appalling food. The range of beer was good and the Saigon beer was the tastiest item on the menu by far. The staff were professional, courteous and very friendly  but he food was so bad I went home and cooked for myself.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zQ-ogEUviAgYq9x1Yew-Kw": {
    "date": "6/16/2010",
    "text": "For a super slurp-worthy Pho stop, this is your spot. Everything about the place is simple - from the design to the menu, from the flavours to the price. Sure, the noodles were a bit liguini-ish and the broth was nothing spectacular, but anywhere I can get a steaming hot bowl of pho with all the fixins' followed by some baby coconut ice cream for under a tenner is fan-worthy in my book.  The brisket and meatballs were stand-out fillers... just not quite up to the pho-nominal standards I'm used to back on the west coast of the US.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "TsqTDcGHz0MNJp_XLeTTwg": {
    "date": "12/26/2008",
    "text": "Pho is a brilliant place for lunch and casual dinner.I have been here several times and even taken friends here.  What keeps me coming back is that the food is always tasty and very healthy. The staff are friendly and the prices are really great - I never manage to spend more than £20 on dinner for two here even when we're having lots of choices. The phos are very tasty (have the spicy one if you like real spice) and I also love the buns (noodles with hot toppings), which are huge and delicious. They have a Vietnamese chef here or so I am told so I guess that is what makes the food so good. You get a really nice decor too, without the crap ugly almost food hall style you get in some Vietnamese restaurants.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "e31n4NCYv4P3SH8YVTef0Q",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e31n4NCYv4P3SH8YVTef0Q/o.jpg"
      },
      {
        "img_id": "TjqQBeZBhm-1MDf99vb8Xw",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TjqQBeZBhm-1MDf99vb8Xw/o.jpg"
      }
    ],
    "user_id": "vSFYKIibFakwFFsEeH-WiQ"
  },
  "W5JAWR7GwS6_Ysx6uguCkg": {
    "date": "4/1/2009",
    "text": "It's not just 54 that keeps my taste buds titillated. Pho Cafe provides a cute, reasonably priced Vietnamese outside of Kingsland Road. Here's their mission statement: The short menu means that we can specialise in a small number of Vietnamese street foods and ensure that everything is made in house from the highest quality ingredients and is bursting with fresh flavours. We don't buy in pre-packaged processed meatballs and frozen spring rolls  instead our Vietnamese chefs make everything using authentic recipes. Our pho takes up to 12 hours to prepare and it's this care that is key to the stock retaining its goodness and developing its subtle and distinctive taste. This place is also great for the gluten free, dairy free, fat free and the allergy ridden amongst you. No carbs can equal happiness, ask Dr Atkins!",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "sAUEXZ-XUrFpybz7dyAcTQ",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sAUEXZ-XUrFpybz7dyAcTQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "u-069NAHTeL-6Oj8zDi00A": {
    "date": "12/8/2012",
    "text": "Pho has limited, short menu but whatever they serve they do it perfectly. Their noodle soup and the chicken papaya salad was amazingly done.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QS_P0oKU8AscZnOHrdLDEA": {
    "date": "8/22/2009",
    "text": "Lunchtime at Farringdon usually results in limited choices...and if you live/work around there, you know that it's basically a choice of sandwich shops, coffee shops and the German Weiner place. So, grouchily strolling along one day, i stumbled across this little gem like a thirst-ridden (wo)man in a desert and it changed my life...or at least my cravings.Pho is a great alternative to the above and very reasonably priced to boot. The soups were amazing, and I loved the spicy ones, especially the spicy prawn. the noodles are excellent as well and while the menu says the noodles are cold, they most assuredly are not the mushy noodles you're thinking of and are quite hot.The restaurant is a little oddly shaped and can get very crowded during dinner time. I love the take outs, because not only are the portions MASSIVE for what you pay for, but your noodles come in tupperware. ACTUAL tupperware. Think about it, great food AND free kitchen utensils. I rest my case.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "z01l_LpA1eWUbzu54u29OA": {
    "date": "5/12/2010",
    "text": "I thought I knew what I was going to say here  that it's a great intro to Vietnamese food, doesn't quite match up to some of the Shoreditch Phos, Yadda yadda yadda. I was wrong. I've had Pho here a bunch of times and think that it's ok. But today I didn't have Pho. And I made a discovery. Pho is not what Pho is best at. Explore the menu a little more, venture off the beaten track and you'll be rewarded with some tasty surprises Goi Cuon Tom, summer rolls, were nice, although a little too noodley for me. They were freshly assembled though, full of herby flavours and the sea salty tang of prawns. The Nem Nuong though were good. Slightly crispy on the outside, they were moist and meaty without being too fatty. Lemongrass added a lovely citrussy undertone to the tasty pork. Next up salads. Vietnamese and Thai salads are a completely different proposition from their western equivalents. Properly made, they're packed full of powerful and punchy flavours, they dance sexily across your taste buds leaving them breathing hard and begging for more. Goi Xoai, a spicy green mango salad served with pork, dried shrimp and peanuts was an absolute bargain at £4.50. Hot chilli, roasted nuts, pungent dried prawns and crispy pork. Wonderful, fresh and utterly reviving. This is the best dish I've had at Pho. In comparison, the Goi Du Du, a papaya salad with chicken, topped with peanuts was more of a waltz than a tango. But it was super fresh, crunchy and soothing. The perfect spring time spritzer of a light lunch. To finish I had a dense dark Vietnamese coffee. It was as strong and treacly as you could want with condensed milk adding a sweet viscosity to the tar coloured coffee If you come here and stick the Pho then be warned, you're missing out.It might not be haute Viet food, but for a lunch spot it's great. And good value for money.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VbrQNvXBVOuzfWgRlYl06A": {
    "date": "9/9/2011",
    "text": "Have to say, this place is well advertised and well known as a great place to get Pho, hmmmm....I reckon Kingsland road is heaps better and cheaper. Pho is quite a westernised Vietnamese place, food did not have the heat or the lovely smell of fish sauce that I would expect from a Viet place. I like their table condiments & beer selection but can't say I'd rush there for Viet when there are heaps better places in London. Nice decor and friendly staff but, yeah, but no, but yeah but.....Na.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "4K4YUaQRiOYEJDRWDxdOIQ": {
    "date": "1/25/2011",
    "text": "Lemon Chicken Bun Noodles. That shall be the name of my first born. That will also be the last thing I eat before I die!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 6
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "Iy2aOGoQ11VRaUzE5XfqpA": {
    "date": "7/28/2013",
    "text": "Arrived to teeth-jangling accompaniment of Chinese heavy metal, tasted the bog standard squid, which was warm, tried the rather dull spring rolls, had a beer, left. Friendly staff but this place is just another chain.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvDXNoLTURhHjS0Xi24DLA"
  },
  "gAmc1Nd9k1rCV_igobDQ0w": {
    "date": "6/17/2012",
    "text": "Soup - excelent!! this area is the best for nice places to eat and this is one of them. Service is very good, we had an italian waitress that did a great job and the food, for once, was REAL spicy. Very happy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HytnUeLb2ma9BR2h2EI3VA"
  },
  "4sW_NsJ8y-OIV89L0BM5aQ": {
    "date": "10/20/2009",
    "text": "Inexpensive. Cheerful. Totally decent  pho. Too bad about the curry, though.This place used to do a stunning, unusual prawn curry that was like something you'd get way off the beaten path in Viet Nam. They've replaced it with something more standard, which is too bad.It's an inexpensive place you can get on the St. John Smithfield drag. It'd be really nice if there were more Pho options-- it's not the same without tripe, tendon, etc... but I suppose London's not quite ready for that. The broth cuts it, though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "D-bm0q69kvb5vFucjZA_LQ": {
    "date": "12/29/2008",
    "text": "Pho, apparently pronounced 'fu', is really fantastic and everything is so healthy meaning that you don't feel guilty every time you stuff yourself silly!The Vietnamese food is extremely fresh tasting which is made to order, with side sauce dishes made at various spicy levels. I would definitely recommend the Pho soup noodle soup with chicken breast. I could probably eat about 10 of them as they are so delicious! The food is very cheap - I usually spend around £8 - £10 and always come back feeling full but without that awful heavy feeling. They also serve weasel coffee which is apparently a rare coffee regurgitated by wild Vietnamese weasels. Indeed the food is delightful but this I couldn't quite face!  As a...fresher alternative, I finished my meal with a freshly made carrot, apple and ginger juice. It was the perfect way to neutralise all those spices and I left feeling very healthy indeed!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0Zr3pJV4wAtLNepARHOZuA"
  },
  "E1hlkfcBl8UmR2vU5rSrxg": {
    "date": "11/5/2011",
    "text": "At the time of writing, Pho Farringdon is one in a chain of 6 Pho restaurants (Mostly London) and this particular one has been dishing out really decent Vietnamese food for many years now.I came to Pho Farringdon about 3 years ago and remembered it as one of the only places around Smithfield area where it was possible to get a decent bite on a Saturday night that didn't cost an arm and a leg, or that wasn't fully booked.It's an informal affair, with an interior that is small but pleasant. Since my visit years ago I have been to the Westfield branch which I must admit I don't find as good. The food somehow isn't as fresh tasting, and the service is  well, non-existent.I returned again tonight to the Farringdon restaurant and remembered why I loved it so much at first. Absolutely brilliant service, really friendly and attentive.As for the food itself; the fresh Vietnamese spring rolls (the non-fried, see-through kind) were great, and their special recipe chilli dipping sauce called Nouc Cham was lovely  a delicate taste but with some kick.I personally love the noodle soup with beef and meatballs, which comes with a side dish of garnishes for you to add to taste. (Chilli, beansprouts, lime, oriental basil, parsley  create your own flavours by adding to the soup.)I was also pleasantly surprised by the delicious sorbets for dessert: you wouldn't think basil and strawberry went well together, but they do.And the small shot of Vietnamese iced coffee: sickly sweet and chocolatey. Lovely.It's a low key restaurant, and definitely not a place to take someone to impress them (try any number of other restaurants on Farringdon Road for that!) but if you need to grab a quick and delicious sit-down meal with great service and good prices, Pho is an excellent choice all round.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_DLUZQnSzE4Hr4KNU1wE6A": {
    "date": "12/11/2008",
    "text": "This place has become pretty popular over the last couple of years with the locals and it's not hard to see why. As soon as you walk in here your nose is  overtaken by the sweet-smelling and fragrant aroma of Vietnamese cuisine. It's more of a cafe and take away joint than a restaurant, with canteen-style tables and zippy service, but what makes it the rather more enticing are the friendly prices and extensive menu of noodle soups (pho means noodle soup if it wasn't already clear). It may not be as traditional as an up market Vietnamese diner in Chelsea but then it isn't claiming to be. It's fast, filling and heartening nosh to get you set for the afternoon's work or before an evening on the town.My favourite: Pho Chin - sliced tender roast beef noodle soup. If you take out, they give you the ingredients, the noodles and the seasonings, in separate containers to add yourself. I love this idea, reminds me a bit of the Salt 'n Shake.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6ET2d9X8m-OdUOMCXCUp-g"
  },
  "ZgsrEU9l3gnyu6dDr2V_Rw": {
    "date": "4/16/2011",
    "text": "It's a chain, but they deserve success for serving consistently good, fresh and interesting food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqnj3tF6Pe-9Ss4ahO3tug"
  },
  "lfhX18CafuxhBCk4Cim_rA": {
    "date": "9/28/2009",
    "text": "Went here for my birthday the other day, and had a great time. The food was, as usual, fantastic. I definitely recommend sharing some of the starters, especially the crepe and pork and lemongrass meatballs. I pretty much always have the pho, but ventured into new territory and tried a salad - the chicken papaya - and REALLY enjoyed it. It had really strong individual flavours, which is why I LOVE Vietnamese, and Pho. Can't beat it.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4ixAgLSMzb0k1Gjl36w4Rg": {
    "date": "6/16/2008",
    "text": "It's rather embarrassing how many times I might eat here in a week. But it's good and filling, fast and easy. I love their summer rolls and their fresh juices (my fave is the carrot, apple and ginger mix). And I'm crazy about their pho (Vietnamese noodle soup). I usually get the Bun Hue Ga ( hot and spicy chicken soup  with emphasis on the hot!) but all the soup's are wonderful. And, yes, I've tried them all. If there were only a zipline from my flat to their dining area  oh well, I'll live I suppose.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "i8xdXnneAFvit0LnEhj67g": {
    "date": "10/9/2008",
    "text": "I really have to agree with all the details of the above review. They don't have the biggest variety of Vietnamese on their menu compared to all the ones on Kingsland road, yet everything that I've had at this place has always been tasty, delicious and reasonably priced. I'm addicted to the flavourful stock that they use for all the 'Pho' dishes, and it's especially warming on those cold days. I'm happy for others that they've now opened up a new branch in Oxford Circus somewhere. The emphasis on really fresh, good quality ingredients also seem to win over their customers as it almost always seems full of people whenever I arrive. They even have a small counter (fitting three people) if you ever find yourself dining there by yourself or just can't wait for one of their tables.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Yg1LRVKJBxYb-jdEexWZCQ": {
    "date": "8/2/2009",
    "text": "I guess i liked this place quite a lot, as i made quite an effort to get lunch from here. At that point of time i worked near St Paul's, and from there had to go to Smithfields and beyond that down St John's st to Pho was a good 15 minute walk. But it was worth the effort for a friday lunch during the recession ravaged (read no work) 2008. :)The pho here is very tasty ... and by tasty i mean hot and spicy. Available in various flavours (types of meat), it was quite a hit at my desk ... even the vegetarian version. The quantity was substantial. I would be surprised if a person with a normal appetite can finish off a full bowl for lunch.Tip (more to myself than to anybody else): Make sure you don't have a meeting in the afternoon, i usually end up spilling a substantial amount of the soup on my shirt :(The only drawback of this place is that it is very small and hence gets very very crowded for lunch. So unless you are there at the door before 12:30, you can expect a total turnaround time of 1hr +.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "4Ytksixz2XCwLPqln_4J4A": {
    "date": "5/15/2010",
    "text": "A Saturday night treat, prior to a few beers and a slightly embarrassing dad dance at a 90's Indie club in Farringdon...   So it didn't get off to the best of starts... there were a few places I'd like to spend more time at in Farringdon, and while Pho is good, very good, it's not St John (or Vinoteca) and so I was living up to my name before we got there, and very nearly had a rant when the Vole attempted to steer us into a random pizza joint.It's the kind of chain that you'd be happy seeing more of, and I'm very lucky to work just near one. The quality is usually fairly high, and that was handy, with two 'challenging' eaters (one who doesn't like spicy food, yeah, didn't figure that one out early enough, and the other a vegetarian who lives off cheese) to entertain...We went for a mixed set of starters, the summer rolls proved slightly pointless without any meat (seriously.. it's shredded lettuce and coriander in a soft rice wrapper), and the veggie spring rolls were crispy and slightly chewy on the outside, with a coating like a Macdonalds apple pie. But I'm a sucker for the special, and there were two to try that don't appear on the daytime menu. The slivers of tofu and mushroom in a sharing (sized) crepe snapped with unami, though the crepe had the texture (and oily touch) of a sheet of grilled cheese on the bottom of an oven tray (the veggie cheesehound was delighted). My main was another evening 'special', a slightly too soupy Cari Ga (chicken curry) served with rice and it wasn't great. A very creamy light sauce with way too much sugar and coconut for me (and way too little chilli heat)... I knew I should have stuck with their simple and clean Bun noodles.The others adored it, but I've definitely had better from them...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "G2rYpnCX1QKnrj4cyxZy6w": {
    "date": "11/9/2013",
    "text": "I had the Pho Chin here a couple of months back.It was probably a first and last time experience for me. Don't get me wrong. The ingredients are undeniably fresh, but there is just something missing in the broth. It doesn't seem rich enough for my liking. My guess is the ingredients and herb mix weren't steep for sufficient amount of time to give that oomph factor. Just comparing within London itself, I think it falls short of Cay Tre. Cay Tre is definitely pricier, but I'm sorry to say I'm willing to pay a higher price for authentic, rich broth.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lf-R76prpRLH7DI7cHv1VA"
  },
  "TEPy3UR-BnOi06Jx9r1S7A": {
    "date": "5/19/2010",
    "text": "Pho could become a habit. Why? Because it does so many things right: Spare space and it's a fine place to dine alone or with a couple of palsRoasted garlic in the pho a nice touchVeggie spring rolls were creative and deliciousRoast chicken in pho ga was plentiful and of good qualitySomething that could be worked on:Broth, while not dish-watery, was still a bit single notedPho ga (chicken noodle soup) and cha gio chay (veggie spring rolls) are my main litmus test with Vietnamese food. Pho passes pho sho!",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 3,
      "cool": 6
    },
    "photos": [],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "sc2smjVFEK6gYy2YAnVcnw": {
    "date": "3/26/2015",
    "text": "Hands down best pho in London. I eat here at least once a week. The Veggie summer rolls with peanut sauce are to die for and I love the chicken pho. So flavorful and food prices!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tTOL-_yqRwsS1CF6A_T3qg"
  },
  "dZDfurcHXGHHs_hUcwieiA": {
    "date": "4/12/2015",
    "text": "I ate here around 2 months ago. I found the food quite bland and overpriced. The menu is also quite small. The service was good....but i don't see the fuss about the food. non of the people i was dining with were impressed by the food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XE84QsOwdWJTn6ILIoICGw"
  },
  "Adqcv7jFECcHZ2uGdGuCfQ": {
    "date": "3/24/2012",
    "text": "At Pho, the beef broth for the pho is a little single-noted, without the complexity of flavors I've had at most pho places in Westminster in Orange County, California (aka Little Saigon). However, it's the best I've had in London so far, and with generous serving sizes. Good service, nice casual decor. Would make a nice cute date spot, also just fine for eating alone. I live in the neighborhood, and would come back to fulfill my pho hankerings/hangover needs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6mgYTBGN1Ig2thDBCjmLwQ"
  },
  "ttbN-8mbB5nYin_3sIZavg": {
    "date": "10/18/2011",
    "text": "The morning after the weekend before, the miso soup and champagne eating plan has to go out the window if I'm going to survive Monday.So, where better to get a major carb hit than Pho. I enjoy bun and pho so much I'm beginning to think I was Vietnamese in a former life!*I tucked into bun with big fat king prawns and extra chilli, it was just perfect and just the fix needed to get me through the Monday marathon. The girls and boys are just the best and it really is a pleasure eating and spending my cash there.* Not that I actually believe in former lives but for the purpose of comedy I slide that one in - oh, all that I do for my art!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pyha-8xF-Bfx27lPT1yofA"
  },
  "2lmHGup4rGRIMsi99kmQPg": {
    "date": "10/25/2011",
    "text": "Oh dear, dropping them a star (usually I work the other way on my updates!)I'm still a fan but my last few dishes haven't been as good as the first couple. I've tried some variations on the bun noodles and I've found both the chicken and the meat balls to be dry and disappointing and the whole dish to be a little bland so I had to cover it in hot sauce. The prawn bun noodles were good but just not enough prawns in there for me.I think I'm going to have to go back to the pho again for a more flavourful meal.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "mvTskNQt0CMx8oTH1ku7-w"
  },
  "J6blwyK2vnZamdlu4B0UIg": {
    "date": "5/17/2012",
    "text": "Quick glance:+ aromatic bun noodles+ fast turnaround of food+ enthusiastic staff- small venue- pricey for almost-fast-food I came here with a couple of colleagues for lunch and unfortunately, arriving at 1pm, there was quite a queue for tables. The venue is small so we had to wait about 15 minutes for an area to clear, and there wasn't anywhere to stand where you weren't in someone's way. On a positive note, you can order take away and bring it back to the office if you work nearby. Once we sat down and have ordered, the food arrived within minutes. The bun noodles had the authentic flavour, even if it was more water-y than I am used to (but that's good, I love sauce!). The staff was absolutely enthusiastic, helpfully explaining the menu and recommending us things to try since we haven't been before. I did think that price is a little bit on the high side for 'street-food,' but the authentic flavour and its location helps make up for it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "IF1URDV9cIeQIdYat6QkGQ": {
    "date": "4/27/2011",
    "text": "Would it be wrong to say that this is perhaps the best Pho that I've had ever? Yes... all they way over in London. Yes... in a chic little spot, complete with modern decor and funky music track playing in the background. I know. I know. You area thinking - this girl did not grow up eating the Pho in Westminster (California). Whatever. It's me. And all I have to say is the Pho here is worth trying. The broth is delicate but full of flavor. The noodles are fresh and the spring rolls were fantastic.They even had Banh Xeo! I'm in love.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "S765x0O9aI2e1ISaB-NYfQ"
  },
  "VsYEw_naWGY6Nkgb1l8jLQ": {
    "date": "8/9/2014",
    "text": "The pho at Pho is just OK. The broth was just not that flavorful and I was expecting smaller noodles and the beef was like a roast which I thought was unusual. But what they do really well is the bun noodles. We ordered them with chicken and it was really tasty. Also the fresh juices are nice. We tried the one with apple lime and mint and could go for that again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8aqnc4rjpttKAoPTu7mGxg"
  },
  "PIeI-MSBDhUZ-6jORm6gBA": {
    "date": "1/17/2012",
    "text": "Just popped my pho cherry so to speak - finally paying the joint a visitVery impressed with the depth of flavour in the broth and although there wasn't much of it the flash fried garlic steak was nice and tender, fresh beansprouts and handfuls of coriander and mint alongwith some finely diced spicily hot chilli to customise the soup - nice touchSpicy fragrant and warming, what more could you want in this weather!Also shout out for the mint apple and lime juice - most refreshing!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0BTCHMYh7_DHyvq4D12LIA"
  },
  "0gK6oZKNlleK3sMoy1Uxhw": {
    "date": "12/9/2010",
    "text": "There are so many things wrong with the soups here. They take loved traditional dishes and just completely f_ck them up. - The broth. Really? REALLY?! This is the base of every good Vietnamese soup,  especially pho. If you cannot master the broth, just don't even bother with the rest. - The noodles. Pho noodles are thin, soft, and often times translucent. The noodles here are wide, thick, and they suck. - The meat. Not enough, and not tender. - The condiments. The hoison sauce was ok, but I don't understand how a pho restaurant can even operate without the real Sriracha chili paste. BY THE WAY, I ordered the Bun Bo Hue and not the Pho. How do I know what the pho tastes like then, you ask? Because they screwed my BBH up and made it exactly identical to the Pho and still managed to have me notice how bad their pho would have been if I had ordered it. On top of it all, the service sucked, the wait was long, and the place is too cramped. If they offered quality pho, none of this would be a big deal, but of course, they do not. If you are wondering, 'Pho' is on par with Cafe VN, which is down the street on Clerkenwell. Both should shut their doors. So there you go, a two for one whammy Yelp! review. You are welcome.",
    "rating": 1.0,
    "rated": {
      "useful": 8,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "TZ1NNJeGd6CQksIDmlgpNg"
  },
  "RaIHjzV4uhv7QN25GEYJSA": {
    "date": "1/28/2011",
    "text": "Coming back on my trip from Tanzania, I had a day layover so I decided to check this spot out since I was in the neighborhood checking out the art scene at the Barbican Centre.The namesake pho dish is not really the authentic style that I am used to growing up and eating all my life.  The version here is perhaps could be interpreted as a contemporary variant.  However, considering that the pho dish is a fixture of vietnamese comfort food, the offering here fell short of that mark.  The broth did not have enough of that savory meatiness and the anise was lacking.  Also, pho is supposed to offer a mix of textures when you eat it.  That's why there are usually several types of meat parts (eye round, fatty flank, lean flank, brisket, tripe, tendon).  All I got were the lean cuts with no fat on them.Overall, a decent enough fare, but if you're looking for authentic pho, then try over in Haggerston",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "W4LbhU_wABFABBZIqBV-lQ"
  },
  "wbnSTGAScvN0iRpw8PDi4w": {
    "date": "11/24/2010",
    "text": "Mint, basil, coriander and lime came neatly wrapped in a plastic bag along with my takeaway order, with a little chopped chilli in the nobule at the knot.  Sort of like this:                      ___                      /  /\\ \\                     /  / \\   \\                           |_|_                           | o |  {---- chilli                           ----                         /       \\                       / mint  \\ bag ---}         |  basil   |                      |   cor.    |                       \\_lime_/The ability to add these condiments to my Bun Tom as I saw fit made for a delightful lunch.  Pho is perfectly serviceable Vietnamese food in Zone 1, though it won't blow your mind or anything.(I admit, the extra star is awarded solely for the way they packaged the chilli.)",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "PzXVRt-k9M4PUJwdlq1Vxw": {
    "date": "6/4/2011",
    "text": "Naomi, Naomi, NAOMI!  Quite possibly the greatest server in London.  Naomi made this dining experience one of the best I have ever had in London.  She belongs in a 5-star restaurant.  When we were seated Naomi came and explained in detail every section of the menu.  When we asked for her opinion on her favorites, she was very forthcoming.  She checked on our satisfaction with every dish that we had, and never missed a beat.  Naomi, YOU ROCK!Unfortunately the food is not as good as Naomi is at selling it and serving it.  We had the meatball app, the lotus salad with chicken and a beef noodle dish.  The quality was mediocre and it was a bit too Westernized to be Vietnamese street food.  So for the best service but okay food and a decent price, I do give a cautious recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "SzkSxmJhg8u6EpX2lUivhA": {
    "date": "3/20/2009",
    "text": "A craving for Pho while in central London, brought me to this small restaurant. I would classify it as modern Vietnamese. The dishes are updated from the traditional bare-bones noodle soup shop. There is a decent variety of soups to choose from with some less common variations containing tofu and mushrooms, or just three varieties of mushrooms. There is also Bun (vermicelli noodles and toppings) as well as some very yummy Viertnamese curry!At 7.45 for a good bowl of Pho Tai, this is a perfect place for a quick lunch or dinner.For lunch I had Goi Cuon Tom, which was delicious and freshly wrapped along with a bowl of Pho Tai Chin. The ingredients were fresh, tasty and the soup was great!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8cyQGSO-GODXMUif4g73fw",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8cyQGSO-GODXMUif4g73fw/o.jpg"
      },
      {
        "img_id": "63t2PsllpNrVwY9mSA2sKA",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/63t2PsllpNrVwY9mSA2sKA/o.jpg"
      }
    ],
    "user_id": "UnnQ7aPuVPX02WBDakpBVw"
  },
  "7N1qgMlF2kGAlZfbnxqgBw": {
    "date": "10/11/2010",
    "text": "I'm from Southern California, and I live about 20 mins away from Westminster (nothing like Westminster of the UK). It is basically Little Saigon of California. I've grown up eating Vietnamese food since I was a kid. As such, I can honestly say that Pho on Farringdon sucks ass. I should have expected as much when I came across this modern, chic restaurant (and where i come from, the best Vietnamese food is usually in a crappy looking restaurant or hole-in-the-wall)Anyways, I had the Pho Tai Bo Vien (pho w/ steak and meatballs). It definitely left me wanting more. They don't even use the traditional rice noodles that they're supposed to. The broth was bland. The meatballs were all wrong. The lack of Sriracha hot sauce is practically an abomination. and the vietnamese drip coffee that I had was not nearly as good as it should've been. Anyways, at least the place was nice and the staff courteous. Nonetheless, this place is in no way authentic.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "haxK-nxfmeLG0fA-nnLGJg"
  },
  "RC83Aiv9_eT38Hlb3D1nhw": {
    "date": "12/9/2010",
    "text": "So I ended up here last weekend as we were randomly walking around the Farringdon area (some call it a pub crawl) and came into Pho because I've heard good things about it and was obviously warmer than the temperature outside.Sat down in this cozy establishment and ordered a bottle of their South African Rose - which was quite delightful. We had a great waitress - - to whom girlfriend and myself played the game of trying to guess where she was from since we knew she wasn't English but could not pick out a distinct accent. Being tall and blonde I went the Scandanavian route while girlfriend absurdly thought Irish - - we were both wrong when she told us she hailed from Krawkow, Poland.Anyways - - ordered the Rare Beef Pho - - and let me tell you I was quite impressed with the aroma and flavors which arose from that big bad bowl. Along with a extensivly large wooden spoon and chopsticks in hand - - we both went to town. Needless to say this place is great - cool decor, great food, friendly service, and located quite near my flat.Recommended to Pho lovers anywhere.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "UdFpFux1mTIV-GXkspHE-g"
  },
  "2Fn8UTRFTS0wYZ1DXFNyMA": {
    "date": "11/16/2010",
    "text": "Not being as well acquainted with Vietnamese food as i would like to be, i have the distinct feeling that having visited Pho my culinary life is about to change.I'm fairly old school and like to have my main dish as meat or fish. Put my main in a bowl and we're generally going to have issues, fool. It's not that I'm not adventurous with my food choices - i'll eat anything apart from tripe - it's just that habits are a hell of a thing to break.Here I ate a bowl of beef Pho for my main, that's beef with noodles and broth. Though simple is was deliciously filling. Welcome soul food for a weary stomach. Starters was a simple salad sprinkled with nuts and some six pastries in which tender slices of roast pork were hiding. Dessert was a three scoop sorbet affair including lime, mango and coconut. Again, here i once again strayed off my gastronomic path but again, I enjoyed being lost. In short, I appreciated the simplicity of it all.For that reason, Pho is going to form part of my on-going culinary rehab routine. Reasonably priced and clean, there is nothing to offend here and therefore, it's worth another look. PS - It's quite a squeeze passing by the close tables especially after eating, so you'll have to get your Kanye Workout Plan in check.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "qGxnU2m8lL7MGtBlr7pgFg"
  },
  "S6q9m9SPP8BA_AI4f2G7IA": {
    "date": "10/24/2010",
    "text": "Lizzles and I stopped in here on a cold, blustery night after a long, tiring day. Pho was exactly what we needed to warm up our spirits and fill up our tums (not that my tum needs any more filling out!) We got the last 2 seats at 7pm and after that, there was a line out the door, so get there on the earlier side if you don't want to wait.They have a strong selection of apps, but since the soups are so big, we decided to pass and stick with the main course: pho! They let you pick your broth and noodles, as well as your accoutrement. I got veggies in tofu in the lighter broth. It came out just a few minutes after our order and for 2 big soups and 2 drinks for under 19E with tip? I'd say that's a steal!Also have amazing fresh squeezed juices to cool your tongue.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "0L6XAQ_wYgR2d4lfX43XTA"
  },
  "kbwszL5oprRBfI8ZbAIQNQ": {
    "date": "9/15/2018",
    "text": "The pho was delicious but not that authentic. Staff was really nice except for one (maybe he had a bad day). The price was good. Overall 4/5",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CdFED8iEyUUzRyGpBs-Dw"
  },
  "sG5GL1kX4Is2dWyk1EyYhw": {
    "date": "1/29/2017",
    "text": "Yummy pho in a cute restaurant in east London! Came here with a friend to have some pho and we were so happy with what we got. We ordered the same thing and it was so delicious. The broth was perfect, the meat tender and my egg yolk was runny. Everything I want when I have pho! They have this amazing chili oil that you HAVE to try if you go here. That smell alone is enough to make your mouth water. Don't be afraid to have leftovers! I took mine home cause I couldn't finish it and put it in a pot to warm it up. I cracked an egg in it and it was just as delicious as it was at the restaurant. Juices are also great, fresh and not to be missed.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5fxyFT_DxSNai5sWiJx3MA",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5fxyFT_DxSNai5sWiJx3MA/o.jpg"
      }
    ],
    "user_id": "MR2REEWz4lz8WqdHeLGPZA"
  },
  "iKopEYkxOElc8QVKjD4GtA": {
    "date": "9/26/2017",
    "text": "I have a request, would the owner please change the type of restaurant to \"Asian fusion\" instead of \"Vietnamese\", please? This is not authentic. Not. At. All. It's very very British, down to the roasted beef in the pho, and everything was just... well... pretentious.where do I begin? I can't even decide. Everything was just wrong, on so many levels. They handed me a legit laddle- not the Asian spoon mind you, but a legitimate laddle. I don't even know what to say, am I supposed to eat with it? No. Just no. I got Pho, it was absolutely terrible. Broth was fatty and bland AND dark. Beef was not right. Hoisin has to be asked to be brought to your table (whyyyyy? It's like going to a coffee shop and having to ask for milk. Why?). There was no Thai Basil served with the Pho. There was not enough bean sprout. And what else, com tam (broken rice) doesn't come with the fish dipping sauce. Yes, I repeat. Com tan doesn't come with dipping sauce. So what the hell am I supposed to eat it with? I can't even. I don't even know what to do. I will never return to this place and I regret spending money here. The service was nice though. Hence 2/5 stars.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nh7KSsw_CaK7dhlq2i_JBA",
        "caption": "Photo of Pho - London, United Kingdom. What is this? Am I supposed to eat my pho with this?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nh7KSsw_CaK7dhlq2i_JBA/o.jpg"
      }
    ],
    "user_id": "maULRuURk3GTe2u7zdWhfA"
  },
  "OISTSFToqY0JG_Ne12TqAQ": {
    "date": "9/9/2017",
    "text": "When living away from home, you miss your mama's food. So I craved a bowl of hot pho. When I arrived I changed my mind and ordered the Bun Rieu with tofu instead of pho and did not regret the decision. The broth was so rich in taste, it was the best bun rieu I've ever had besides of course my mom's. Prices are okay, service good! Next time I'll try the pho",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6VZRijzLgF77dUfSwR6YVw",
        "caption": "Photo of Pho - London, United Kingdom. Bun rieu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6VZRijzLgF77dUfSwR6YVw/o.jpg"
      }
    ],
    "user_id": "XsR6_RN9oinszwvGu1UBBA"
  },
  "05Ocxvvxv9WfJr5WMHc5sA": {
    "date": "4/29/2016",
    "text": "Ventured in today with a friend who works in the area. I had seen the menu before hand so kind of knew what I was getting. We arrived early to beat the rush, it's a small compact place. Best to get here early for a table especially during lunch rush hour. Everything is described properly on the menu, as it was so cold today I opted for the Ph tôm with a veggie broth. Base broth of lemongrass, ginger, lime and different veggies with tiger prawns. A large bowl was placed in front of me with thick noodles and extra side of veggies for the noodle soup. I was impressed by the size, not so impressed on the bland broth. I added the garlic vinegar, extra lime, chilli oil and paste and sirarcha sauce to it. Then it was much better! The extra herbs of mint and coriander really helped to bring out the flavours. As I couldn't finish it, they packed it up for me in a secure tub which was then tied inside a plastic bag to prevent spillage. They also kindly added extra prawns which are £1.75 extra and the veggies are an extra £1.00. Overall a nice place for Vietnamese food. It's more of a street food style menu, but nonetheless still tasty and value for money.The staff are nice too!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jhUysCHMqzuWSB8or1HqnQ",
        "caption": "Photo of Pho - London, United Kingdom. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jhUysCHMqzuWSB8or1HqnQ/o.jpg"
      },
      {
        "img_id": "rKGPEOQ2KlDapX8VBP4rqw",
        "caption": "Photo of Pho - London, United Kingdom. Sauces and pickles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rKGPEOQ2KlDapX8VBP4rqw/o.jpg"
      },
      {
        "img_id": "KWy3A2SCkiFExTZW99ZCWw",
        "caption": "Photo of Pho - London, United Kingdom. Side of additional veggies for the Pho tom #colourblast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KWy3A2SCkiFExTZW99ZCWw/o.jpg"
      }
    ],
    "user_id": "Im4q9ajz36xpu4nF0g3xlA"
  },
  "9Qy0dHr7uwV8GRqTx1fnsA": {
    "date": "10/23/2015",
    "text": "Yum! Although the service at this branch wasn't anything to shout about, the food was pretty damn good. Really recommend Beef brisket Ca-ri - great sauce and rice. My friend got the beef brisket pho which looked delicious, comes with a funky wooden spoon and your own herbs, spices, seasoning etc to add to the pho! A great Vietnamese restaurant, very reasonably priced with a casual atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xERI9ynte9rtrdcNnwUD1w",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xERI9ynte9rtrdcNnwUD1w/o.jpg"
      },
      {
        "img_id": "UWsFz9vjq472UwXaGNMl3Q",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UWsFz9vjq472UwXaGNMl3Q/o.jpg"
      },
      {
        "img_id": "F7So_ufEbvnDWVYu0lnHVw",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F7So_ufEbvnDWVYu0lnHVw/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "3AEBxqkffa5zi1thveTqWQ": {
    "date": "8/26/2016",
    "text": "I was thoroughly impressed with this place, is the second Vietnamese place one been to in London and it blew the other one straight out of the water.My friend had finished work and wanted a quick bite to eat before finding a suitable wine bar to frequent, though he wanted something healthy and I persuaded him to try this place as it was nearby and he'd never had Vietnamese food before.The décor here is lovely; moody and quirky, with a lovely table half inside half outside that we perched on to enjoy the breeze. It's very clean and well kept in here, when downstairs and the toilets are nice to visit. Not that I'd go there for that, but it's nice when you go and it's not grubby!Our servers were very friendly, and upon hearing my friend had never had Vietnamese he explained the menu and made some suggestions.I had a fantastic chicken and prawn crispy pancake thingy which you wrap in this rice paper or something. It was absolutely delightful with great portion sizing and very reasonable pricing. Full of flavours and fresh, is thoroughly recommend this place to anyone and would like to go again!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZHbtxixJDxfMam4cb23RWg",
        "caption": "Photo of Pho - London, United Kingdom. View into the restaurant.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZHbtxixJDxfMam4cb23RWg/o.jpg"
      },
      {
        "img_id": "exUfoYNe1nSG-W15Y9biMQ",
        "caption": "Photo of Pho - London, United Kingdom. The crispy pancake! Sooooo good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/exUfoYNe1nSG-W15Y9biMQ/o.jpg"
      }
    ],
    "user_id": "9o9WubDPQ7XDCdfV2tiENw"
  },
  "zREidXrtqOtRFOR0tLU5HQ": {
    "date": "8/24/2016",
    "text": "So me and my friend were looking for a quick bite to eat after attending a networking event and we stumbled upon Pho. The staff where very friendly and very chatty which is what you want. When the food arrived it was nice. Would recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJ9AVnAYOG5dxKlPkJp5BA"
  },
  "LwJ94keyvIUurEYNt0RKLw": {
    "date": "7/28/2015",
    "text": "I'd heard of Pho but not actually eaten here. On the basis of tonight's experience, I'd happily come again. The restaurant is small and busy - it's on the crowded side rather than intimate - but the noise level was bearable and the service was very fast. I gather it is very busy after work, so dining a little later may help. Expect to wait for a bit at peak times.We tried the hot and cold (summer) veggie rolls for starters, and then I had the tofu and mushroom bun noodles. The food was delicious - especially the noodles, and the ginger soy I was provided with made a stunning accompaniment. Interestingly, the beers (Saigon and Lao) were great companions for the food.A nice feature was our very helpful waiter who pointed out which  sauces I could have as a vegetarian (ie avoiding the fish sauce).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0_pYTNf90AKN0MoxPFXc4Q"
  },
  "aVm3yRAeWxp0qb3bOZVvqw": {
    "date": "3/6/2017",
    "text": "Popped in for some Pho for lunch! It was tasty and quick. Not super inspiring, but definitely had what it takes to warm me up on a winters day.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RDyt1fgyR2FIrFwEqDRlpQ"
  },
  "thquUWKTGkIavKf8qCnGFg": {
    "date": "12/20/2012",
    "text": "I'm giving 4 stars for service.. the staff are very cool and nice.  And I like the decor.  They lose a star based on value.  I chose a higher priced beef noodle dish that was good, but not highlighted with the premium beef I paid for.  With a small coke (2.50). my meal was over 12.00 which is not shocking for London but a tad high for a weekday lunch with no special occasion.  Food-wise, it was an interesting take on a familiar dish and while I liked it, I also didn't love it.  There wasn't a star item.  Nothing punched its way out.I'd go back, but would also look at some other places in the hood.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SP9GYjAVc0BKxNytkeww1A",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SP9GYjAVc0BKxNytkeww1A/o.jpg"
      },
      {
        "img_id": "_vX9war3j17MmRg7BCamBQ",
        "caption": "Photo of Pho - London, United Kingdom. Beef bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_vX9war3j17MmRg7BCamBQ/o.jpg"
      },
      {
        "img_id": "Ig43HYfJmilqLxvSYv7ZTg",
        "caption": "Photo of Pho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ig43HYfJmilqLxvSYv7ZTg/o.jpg"
      }
    ],
    "user_id": "aIzN19RssPWSw9nDCPXU3A"
  },
  "dP0wsZuW2eijsC04bMQWEw": {
    "date": "1/22/2017",
    "text": "Friday night and the wait was 15 minutes. This is just the amount of time it would take to go someplace else and thus worth waiting it out, plus a server clearly tried to persuade a couple who had paid and were just chatting, to move on. The aroma coming out of the kitchen was tantalizing and by the time we were seated we had decided on our orders. He had the chicken broth w an egg and tofu with mushrooms while I opted for the spicy noodle soup w all the mushrooms and eko Choy, a cousin to bok Choy. We started w some rice paper glass noodles w prawns which came out promptly and were v tasty. Unfortunately the combo of being seated next to a drafty window and the long wait between app and main cost Pho a star. The mains were v tasty indeed and generously sized. The tofu was fried rather than soft but the noodles and enoki were amazing and the broth could do no wrong. V affordable price points for high quality eats. Can't wait to return for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4o1FlnvYZmdwYqbM-w9kA"
  },
  "2c8fPqtrbVuW4n-kIm9dGg": {
    "date": "1/29/2016",
    "text": "It's ok. I mean I honestly haven't had a goodPho in London. The broth in most places including here is not deep enough.I compare this to the best I've ever had which was in Paris where I ventured to a place where the broth was so intense and full of flavour that I literally picked up the bowl and slurped it all down without a care in the world. It was so good I actually ordered a second bowl.That is the feeling I want to get and is the benchmark for me to discover not a good, but a great Pho. I just haven't found it yet, and here a 'Pho' the dish is just 'OK'. It doesn't hit any sweet spots but is satisfactory for a quick meal if passing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "QWGykq3e6U30gMm4LLGjzg": {
    "date": "7/26/2015",
    "text": "Wow pho, I just wanted to sit there all day and eat everything off the menu. The place is small and can seem a little cramped but get over it, as the food makes up for it.We ended up going for the Beef Bun. Such a great dish. Nice flavour combination, very refreshing and also different textures. So glad I went for that rather than their normal Phos.Staff very friendly and food is served super quick. Would go back in a heart beat. (Visit - 23/06/2015 Lunch)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3QkozspSmuLnqHf6ZyFsg"
  },
  "Mu6Fy7xCQeDoNgWKLI2N7g": {
    "date": "8/19/2016",
    "text": "Not authentic and got our order wrong on the phone. The pho (which we didn't try) may perhaps be better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVd_wYYZDCAd4ubBDsrgLA"
  },
  "2WuQDNUreveuk_elELut3A": {
    "date": "5/26/2014",
    "text": "I went here for the first time last week. My dinner date and I both ordered the brisket pho with extra vegetables. The bowl was delivered quickly and was absolutely delicious, especially at just under 8£. The brisket was tender and there were tons of vegetables. I also had the Saigon beer which was impressively delicious - not what I was expecting with a hint of sweetness. The service was very friendly and they allowed us to stay and chat long after we had finished our meals. I just wish they put eggs in their pho...Pho is perfect as both a quick and long meal, delicious either way. I completely recommend it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7Q3Rurtpv7Bmy6htBpL7Q"
  },
  "hfpNrQ2MliGkUXxEI0gYsA": {
    "date": "5/7/2016",
    "text": "First time experienced Vietnamese food and I must say I liked it very much. Staff was friendly and attentive, even though it was a busy lunch hour. Particularly appreciated the fact they looked after my vegetarian needs by replacing fish sauce with soya. Only thing I would say is that the premises were a bit too small, felt crowded. Overall good experience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3rA6bTRfT04ClUN9SRVgBg"
  },
  "tDKP5fliywfNc8yNt7UYsA": {
    "date": "10/29/2013",
    "text": "So fresh, so delicious. London's best pho. The deep and rich flavor was amazing! I got the broth with garlic. The quality of meat and vegetables was amazing -- you can tell this is quality stuff not a fast-food chain. Where were you all my life, Pho? (This restaurant, not the dish. Me and pho go way back.)Gluten free notes: Most people think pho tends to be naturally gluten free. YMMV.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "BCUkQ5w31WhFSUulKtVCTA": {
    "date": "10/13/2013",
    "text": "I had their Pho Bo Combo last night. The broth is one of the best I have had here in London, but still falls short of the pho I have back home in California. I had the crispy spring rolls (cha gio) which is very good and authentic when it comes down to the actual rice roll wrap that they use to the filling with the ground pork and mushroom strings. Very Vietnamese and down to the T! Nice texture and awesome flavor. This is 5 out of 5. I will give the Pho 3.5 out of 5. The 'bo vien' meatballs was nothing spectacular, it feels like a housemade ground beef rolled up with no real chewy texture and flavor. The 'nam' (brisket) could be softer, but still had a nice texture. It's always a plus here in London to see a Pho establishment giving you Hue (basil) and sufficient amounts of bean sprouts. The meat could be more tender, but I've tried a lot worse here in London.The service was great, everyone was friendly and prompt for a Saturday night service. The restaurant is fairly clean for a Vietnamese joint. But then again - I grew up knowing that when it's too clean, it's not that authentic.I will definitely come back again on a cold, windy, and wet day here in London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgRhY_xYw2Xvb9jUkVQAKA"
  },
  "PqBxPSuXFGoTR3I12WOdyQ": {
    "date": "5/26/2015",
    "text": "The food was lovely. The stock for the Pho is very flavoursome and the meats were cooked to perfection. The starters are huge so beware if ordering a starter and a main! Most of the food was free of gluten, dairy and eggs - so it's great for those with these allergies. I can't wait to go again. This particular branch, however, loses a star for service. A family who came in after our party of two had their order taken and were served their meals before our table's order was even taken!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tr2I31H4Ux7DCbnGw02aRg"
  }
}