{
  "O-UnGvCBa9FK2SQE_ufnNg": {
    "date": "12/23/2009",
    "text": "If you love rissotto, go for the mushroom NOT the seafood. Some beg to differ. For me the smoked salmon is so overpowering that it leaves a tangy trail on your palette. My friend had the garlic bread with cheese as his starter and that filled him up pretty quickly.It  was quiet busy and the staff were very friendly. The guy who served us got abit excited after my friend tipped him and his collegue ask 'how much they they tip you...'? 'nooo way dude' 'you share you share' lol",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "sgnQLQ7dePY3iF_BPyMfNQ"
  },
  "tlmeu7rx5RYZih61acNnMg": {
    "date": "12/2/2010",
    "text": "Very good chain restaurant, I really wish they have it in the states. Much better than our olive garden and such .... Had the tomatoes pesto bread for appetizer and the Prawn Linguine and Chicken mushroom risotto .... the Linguine was pretty good and the risotto is AWESOME. The atmosphere was nice and very comtemporary and the staff are relatively friendly (in comparison to most other restaurant I have been to in London). And the price was really good ... with appetizer, main course and a wine, only £15 per person ... cannot beat that.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "300bVlfTh_IezEJ6R84bTg"
  },
  "caSSpMfIadkUTP3q3xDnEg": {
    "date": "8/18/2009",
    "text": "Located in the Cardinal Shopping Center across from Westminster Cathedral (not to be confused with the Westminster  Abbey further down Victoria Street near the Parliament Buildings and Big Ben.)Excellent quality Italian food, and it stays open late for the before and after theater dinner crowd.Started with the Caprese salad-nice slices of  nicely ripened tomatoes and mozarella,  with perfectly applied dressing of balsamic vinegar and olive oil . My main was a deliciously tender braised lamb shank, but I was too stuffed to have dessert but enjoyed a cup of good coffee to finish.Friendly and attentive service, in a clean environment. My neighbors had enjoyed their pizza from the wood burning oven located prominently as the centerpiece of the open space.A little pricier than your Olive Garbage (oh sorry, Olive Garden) but definitely worth it for the outstanding quality and service.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ZKjwRhEcM-_So_RoggTGw"
  },
  "RANVMi_Gyjdq0eUJBrsvgg": {
    "date": "5/9/2011",
    "text": "I do like this place. Okay, maybe I don't like how busy it inevitably gets at lunchtime given its prime location for shoppers and office workers. But that in itself is testament to its winning formula of competently cooked pizzas (with extra points for rolling the dough in semolina, which gives their bases a crispier texture) and pasta dishes, excellent and friendly service and a pleasant decor. Most of all though I like the positive vibe exuded by the staff: unlike many other restaurants one gets the feeling that the staff here like their jobs and that there is a good 'team feeling' at this Zizzis. I'm almost willing to patronise this restaurant for this reason alone. Recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "Du0G8t0yrt-_KpHSLru8Ww": {
    "date": "11/8/2013",
    "text": "Great place for lunch.  Shared a large antipasti plate, Zappa do fagioli and Arancini.  Enjoyed a Menabrea Italian beer, which was perfect with the meal.  Busy place with good energy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNN-afLela-z2c_U_qSw5w"
  },
  "uQJCO5vX54fiUWopSTWXOw": {
    "date": "1/18/2009",
    "text": "We ate in the Victoria Branch of Zizzi's when we were last in London and we just needed a Quick pre-theatre meal. The restaurant was packed on arrival and we thought we may have difficulty getting a table but we were quickly shown to a very small table close to the VERY hot Pizza ovens!! Because it was so busy and almost every table was full it felt very claustraphobic and we were able to hear the fellow diners conversations with ease, infact at times our elbows were touching the next table. On a good note the service was both quick and professional and even though it was busy our meal arrived about 15 minutes after our order was taken. I ordered a Pasta meal and my partner ordered chicken, both were OK and for the price good value but they were a little tasteless and bland. The side dish of Garlic Bread topped with caramelised onion however was very tasty and a lovely addition to our meal. An ideal place for a quick pre-theatre meal or an after-work get together with friends or work collegues.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "g7rqVoitio3jR8dCfs920A": {
    "date": "9/19/2010",
    "text": "I popped in for a late dinner. The service is very good and attentive. But when it came down to the food. I had the first pasta dish which was sort of a rustics chicken pasta dish. It was fantastic, tasty, and spicey!  I wish this chain existed in the states",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQCyMaubSgz0FpXDpwovyg"
  },
  "yVdcFU_7nSbqy4XKvdY9vw": {
    "date": "10/28/2009",
    "text": "We were in London last week and just happened to find the Zizzi's Italian Restaurant nearest Victoria Station.  We had never heard of this chain and thought it was just an individually owned restaurant.  We had marinated olives as we placed our order and shared some great Italian wine.  Our waiter Francesco made the evening to be very enjoyable.  He was very personable and friendly and we enjoyed chatting with him.  I had the chicken breast covered with pesto and my wife had the pizza, both of which were excellent.  We returned two nights later for dinner because of our wonderful experience.  I would recommend it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKoBQZVY7QUg6Q8wj0aP8Q"
  },
  "H4g-XN5TWQdCI2H0mE4ZDQ": {
    "date": "8/29/2008",
    "text": "Ate here last weekend the place was busy and had a good feel to it. My pizza was excellent while my wifes pasta was a little oily. I think the pesto caused that. Otherwise good wine list, very friendly waiter and manager, good toilets. Would recommend.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xRRa4AP6lRlp9Psa75vduQ": {
    "date": "11/19/2008",
    "text": "This restaurant is ideally situated opposite Victoria Train Station so we frequent often as we meet friends there when coming into London. The food is decent, the pino grigo blush is exceptional and the place is always busy. We've been here before going to see a show and despite not booking,the place being hectically busy and ors being a large crowd the staff went out of their way to serve us as quickly as possible, offered us some laughs and generally made us enjoy our night!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "H95X7nYkFKFpVUdZSI8prQ": {
    "date": "1/19/2009",
    "text": "I cant believe no-one's reviewed Zizzi yet! Its a popular chain and there are few in London alone but others across the country. I really enjoy the bruschetta and linguini gamberi. They also do very tasty risottos- not cardboardy like in some places but really full of flavour. I tend to order a tiramisu whenever i go. its my one treat of the month! i often go with friends and family and i would recommend people try this place out. This branch is good, i know the staff by name and they always stop and chat with me which is what i really like about zizzis.. its the personal touch.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xHaSxPdVaMGm3KRKeH4kAA": {
    "date": "6/30/2014",
    "text": "Good value, fantastic food. Shared the fonduta appetizer and primavera rustic pizza with 2 glasses of wine for £29. The pizza was so large we couldn't even finish it. The atmosphere was loud and crowded, waited 5-10 minutes for a table on a Monday night 7pm but services was great and food came out fast. Would definitely return for the great food, service and budget friendly price.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2MmuFuC0JX-TYZtEDgdQ3g",
        "caption": "Photo of Zizzi - London, United Kingdom. Formaggi fonduta appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2MmuFuC0JX-TYZtEDgdQ3g/o.jpg"
      }
    ],
    "user_id": "Go4nGejERn4TJnDxKZbNBA"
  },
  "EVmtVB5DYof4eIPvzBkXzA": {
    "date": "10/23/2016",
    "text": "Pizza was undercooked - not raw - but definitely not crisp like the pizza next to us. The garlic bread was unique in that it was basically pizza dough / flat bread with garlic smeared on it and mozzarella loaded in the middle. Not what I was hoping in pizza.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "m848ffC-GjX82CCRIgMRTA"
  },
  "sXBTGkO61waM_lUhbfJOOQ": {
    "date": "7/6/2017",
    "text": "Thanks to the clever restaurant manager Marzena who made our way. When we just got in a waitress gave 2 kid's fun art papers to our two pupils. As we didn't realise that these are the kids menu at the same time, we had to choose from the regular menu. We are not warned that they have kids menu that time either. At last we recognised that there was a kids menu, we complained about not being warned at the time of navigating for kids through the regular menu asking many questions.Finally the manager came and touched our table with her magic stick, changed our choices with the \"kids\" ones, we spent less, ate well, gratefully...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "psnaO1bEJ_h3VBIf6wxhyg"
  },
  "2WEqDzrvUT6MkV1zxcX8Bg": {
    "date": "4/1/2017",
    "text": "Our server was horrible and rude.... I think the food  was over priced for the quality and value.. you can only make pizza so \"fancy\" before it's just not worth what you bring out..  Wouldn't recommend..",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8CdwfCiGVVFPJAZfs3Yf1Q"
  },
  "zfNl_9m9riN-670hFZOQyQ": {
    "date": "12/22/2014",
    "text": "After a long walking tour of Buckingham Palace, we got here for dinner. It was better than what we expected for sure. It is a big restaurant and a little crowded. But the food was good enough, fair portion.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UveVcx6wU5-GobAveKfOtw",
        "caption": "Photo of Zizzi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UveVcx6wU5-GobAveKfOtw/o.jpg"
      },
      {
        "img_id": "oxLYyEQAKm2pp3z4jTrqCg",
        "caption": "Photo of Zizzi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oxLYyEQAKm2pp3z4jTrqCg/o.jpg"
      }
    ],
    "user_id": "aNfG4yqETNKXNQgc2qTToA"
  },
  "b4uAnvAo_bqVNqajCAtG4g": {
    "date": "3/27/2010",
    "text": "Very busy on a weeknight for dinner, I was here with two colleagues. Even though there were a couple of clean tables, we waited about ten minutes until we were seated at one by the window. (Which gave me a moment to visit the Men's room, which was clean.) Two regular chairs facing a two-seat sofa, it was uncomfortable and very low. If offered, take a table with regular chairs.An Italian restaurant, so the beer choice was of course Peroni, available in 330 or 600 ml bottles. I would have hoped to have other options, or even draft, but this was all. Lots and lots of wine was on display in massive back-lit shelves behind the bar.We started with the marinated olives and a plate of the garlic bread. Both were quite good, though I prefer my olives pitted before enjoying. The bread was topped with big pieces of roasted garlic, which set my appetite on high.My colleagues went with the Spaghetti Bolognese and the Mushroom Risotto. The Bolognese looked a little oily and rather a small portion. The Risotto was well enjoyed and very filling, so I was told. I decided on the Trentino pizza, which I thought needed a lot more cheese but it did have good flavor. I'm also not a big fan of the British practice of whole pies. Slicing it up with a knife and fork is a pain and entirely too much work.For dessert, I had the Torta Zizzi, a slice of tart with plum, almond, fig and pistachio. With a scoop of rich vanilla ice cream, absolutely heavenly. I was sorely tempted to lick the plate.We did a reasonable job of engaging our waitress and teasing her the entire evening. She put up with our hilarity and in doing so, earned a good tip. I would absolutely return.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G0vc4UUq6WR2Qloln8RmNw",
        "caption": "Photo of Zizzi - London, United Kingdom. Zizzi torte. Moist, fluffly and delicious.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G0vc4UUq6WR2Qloln8RmNw/o.jpg"
      },
      {
        "img_id": "264UoNSV5O0IitwscMNu_Q",
        "caption": "Photo of Zizzi - London, United Kingdom. Rissoto with Peroni",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/264UoNSV5O0IitwscMNu_Q/o.jpg"
      },
      {
        "img_id": "qAVoQE70jc7RXVGDSAPBnw",
        "caption": "Photo of Zizzi - London, United Kingdom. Trentino, unsliced.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qAVoQE70jc7RXVGDSAPBnw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "TWJMowo95M2dlrhl6rldOQ": {
    "date": "11/23/2012",
    "text": "We found this little place for dinner one night while in London...it was so good we had dinner there a couple more times before flying home. the atmosphere was very friendly, warm, and busy....apparently others know the quality of service and food as well.We had spaghetti with meat sauce, and garlic pizza bread. On another occasion I had one of there pizza's...Absolutely wonderful. The server we had was attentive and we felt welcomed and appreciated.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BAm09ZyCIygB5iih92pnVw"
  },
  "05ZDV0ZOJ7D_ObSiqsyS0w": {
    "date": "10/2/2016",
    "text": "Busy busy busy and well understood due to the excellent food. Waiters were trying desperately to keep customers pleased and it worked. We'd eat there again without hesitation!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0L6oTpN-4olOS65_0YH1ng"
  },
  "HsFy4O69mXE2Ihvd04j3FA": {
    "date": "7/8/2014",
    "text": "I luv the place and the food, i enjoy every bite there. I like the atmosphere and the selections of food and beverages. i would go there again and again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECbEWgpeMGV-0ltNAjtMIw"
  },
  "JT46GHKx82DlJdmbFgzKYA": {
    "date": "8/24/2015",
    "text": "Visited London with our public broadcasting station's group to tour #HighclereCastle-stayed at the historic Rubens at the Palace. Found ourselves wandering (and hungry) late one evening. Fortunately we stumbled upon this delightful and delicious restaurant, Zizzi, with wood-fired oven-baked pizza. The wine, the service, the atmosphere, the food...all perfection! So much so that we've planned a return trip to London and included Zizzi's for dinner!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mDZUpu_TttfL1Ve1PK7-Q"
  },
  "Ongd2TlLRuBmfsnsfoXjrg": {
    "date": "6/14/2013",
    "text": "Really pleasantly surprised by our meal here. I wasn't expecting much - I recall a particularly stodgy and bland lasagne from the early noughties - but I really fancied a pizza and I was at work so my options were limited. We had an antipasti platter which featured some very delectable soft mozarella and delicious sun dried tomatoes. If I had to criticise I'd say it was a little pricey for what it was, but it was fresh and tasty. My pizza - fiorentina so as to get my 5 a day in - was huge and utterly delicious. I cou;dn't finish it but it wasn't for want of trying. Again everything tasted really fresh - and what they called 'bechamel' was good, though it was more like sour cream. In fact, I think it might have been sour cream. The boy had one of their new salads and I got food envy. Then we had some ice cream - absolutely tons of it - tough the pistachio was disappointly unpistachio-y. But that was the only bum note in what was actually an excellent meal for what I tend to assume is a mediocre restaurant chain. It certainly beats pizza express and the like, and I'll definitely visit again. Because of its location it gets extremely busy - it's not a place for a date.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  },
  "oK-e7NbFK14C3F1CsV-93Q": {
    "date": "6/21/2011",
    "text": "Came here last week, was invited for lunch. The place was packed!!! But I liked it....it was lively and loud.Buzzing place, friendly waiters.I could not decide what to order and asked my lunch companion for advice.She said: \"Oh, the Pizza Rusticas\" are really nice\".Ok, Pizza Rustica it is.Bufala for me, Trentino for her. The food arrived after about 10 short minutes and was zizzling hot, the portions quite enough for lunch and after that my tummy was nicely filled up and I was ready for some more work.Loved the atmosphere, the food, the sparkling water....Definitely worth a visit if you are in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TpS63E_tKLGtbUYFdvlxDw"
  },
  "gfYuK14QwLFgwwaLA53GpQ": {
    "date": "1/3/2013",
    "text": "This was probably the worst meal we had while in London.  We ordered 2 pizzas and 2 pastas.  The pastas were mediocre (the gnocchi had an odd smell to it, so we couldn't even eat it).  The flatbread pizzas were decent, but nothing special.  The only nice thing was that I really liked the decor and atmosphere of the place.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pWuBXSLjvgqpW3MdAho5Q"
  },
  "ky9_In9hqBUrDxrlgGhrdg": {
    "date": "9/22/2014",
    "text": "This is a nice place for a casual lunch if you are in the vicinity of Buckingham Palace.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pkk8XaJP4WfxK3dWs8dnxg"
  },
  "XN4Bs-r0JA9QUwXQGbCz2Q": {
    "date": "8/16/2014",
    "text": "We took our three boys here (ages 9, 7, and 7). The food was very good for us and them. Our boys said we should rate it 5 stars.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZXSdifud2kVq0PNLceneQ"
  },
  "c1k-VEc9d_iUcYPrCVNO5g": {
    "date": "4/24/2014",
    "text": "Nothing special.  Solid but unexceptional.  Akin to a California Pizza Kitchen, if you're familiar with that US chain.  Service not attentive.  One dish in our order was incorrect.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlVqdxtuCoUkFFhwcGxlVw"
  },
  "OGkvbpldc5mhGA-h_hO0Tw": {
    "date": "3/18/2014",
    "text": "Excellent atmosphere, food, and location.  Highly recommend reservations due to the proximity to the theater district.  Will definitely turn.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0v3Qn8dqFR4ALEk2CFDMzA"
  },
  "KeJE-wlEslGf2foNtV2bTQ": {
    "date": "7/17/2015",
    "text": "Just finished dinner and walk by, saw the menu and decided to order pizza to take out for snack, this turn out to be the best experience ever(maybe because our dinner was not so good ). We had picanate? The spicy one, both my wife and me agree it was our best pizza ever! We love the spicy sauce so much and we actualy competing during the meal:) Will come back for more!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eWINz4QPVJxUJYSFfJ_vvw"
  },
  "wpD0b70UuJ0pKj4xtH0mnA": {
    "date": "9/22/2013",
    "text": "Was out for a night to see wicked the show and need a nice place to eat good food. Italian was my choose and zizzi delivered. Food was of high quality and service was quick and polite. A little pricey than I would normally do, but for sure worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YLYuSX0XkcnHJV4rmKryYw"
  },
  "zNV8k-vtOR8hYvWE11cIYA": {
    "date": "8/2/2012",
    "text": "It wasn't the best I've had or the worst I've endured, so it gets three stars.It was packed in this place so our server who was pretty good in my opinion held it together as best he could while being personable which is ever so important to me.My pizza was delightful but my friends meal was inedible, unfortunately the server didn't notice she wasn't eating it until he came to take the plates away and wasn't able to offer her a replacement meal, he did take it off the bill but she was still hungry and had to get a cornetto on the way home. ICE CREAM for dinner, we are in our 30's by the way.Not sure I'd go back, so many other options and so little time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "w96DMHYXiRtkftMj7Y0Z1w"
  },
  "sA0XReL9YyQdpg8AVBCAKg": {
    "date": "7/10/2017",
    "text": "Everything was delicious. After a week of pub food, we were grateful to sink our teeth into some bread and pasta... We sat outside on a beautiful patio in the middle of Victoria that wasn't overly crowded but just the right amount of foot traffic to keep my people watching in check... Since we decided to pre-game with some appetizers (and be really fat), we obviously went for the bread with not 1, not 2, but 3 different dipping options-- Garlic butter, Creamy pesto Rosso and Lemon & Rosemary aioli... How do you say no to any of those choices. They were all fabulous, but I think my favorite was the Garlic butter, obviously. We also opted for some calamari... so all health conscious options.For dinner, I had the Ravioli di Capra, which was SO good... It was made with goat cheese and spinach, served in a tomato sauce, topped with green pesto and pine nuts. Amazing!My little brother had a summer special pizza that had mozz, spianata piccante salami, red chillies, buffalo mozz, tomatoes, topped with lemon and herb salsa. His meal also kicked ass. All other meals around the table had zero leftovers ;) For dessert Brock and I shared our favorite, the classic Affogato-- gelato topped with an espresso shot... We obviously prefer slugging back a few espresso martinis but this was a close second. Great service as well! They had originally told us it would be about 45 minutes for food since they were working on a £2000 order (holy crap!) and we barely waited 10 minutes from the time we ordered between courses. Now, come to America Zizzi!!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 5
    },
    "photos": [],
    "user_id": "5tAupu4luR5o3nPqHchWUg"
  },
  "uja7aimyMtPXrCXcRVv4zw": {
    "date": "2/18/2017",
    "text": "Great Italian, even if it is a chain restaurant. I enjoyed the food and I needed a break from all of the pub food I'd been eating. The restaurant is beautifully decorated with hanging meats and vegetables, different lighting and wood floors. The service was very friendly although our server was very busy running around. I had to ask multiple times for water. The wrong food was delivered to our table. All minor things that didn't really bother me. The wine was excellent. They have some great reds from Sicily. Be sure to try at least 1! The food was excellent. The crust on the pizza was perfect- chewy, but crispy. The buffalo mozzarella on the spaghetti pomodoro was the best part of the dish.  Everything was fairly priced. I'll be back next time I'm in town.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rzQ1BqHOVLgePfxywgBBCQ",
        "caption": "Photo of Zizzi - London, United Kingdom. Spaghetti Pomodoro- mozzarella was delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rzQ1BqHOVLgePfxywgBBCQ/o.jpg"
      }
    ],
    "user_id": "UFC1dFI4Z9z1wfymHySH_w"
  },
  "ig8JFx04uqHhFfTxiTrEMA": {
    "date": "6/11/2017",
    "text": "It's ok, but the  spaghetti bolognese does have fresh noodles but they put carrots in it, which I would consider Italian Apostasy.  In addition their lasagna is mushy, I'll defined and has carrots in it. Not to mention we sat for 12 minutes without a server showing up.  And the restaurant was 60% empty, meaning they were not that busy.So if you like non-authentic mushy pasta that takes the server forever to see you, you have arrived!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9UaQnSBUgItgJy-yZKK_CA"
  },
  "6UGYvkHqT37fxbYY8igShw": {
    "date": "6/11/2017",
    "text": "This place is an ODE to chef boyardee. If you love mushy lasagna that tastes like Texas Roadhouse chili this is the place to go. The spaghetti has carrots in it (an amaerican thing NOT ITALIAN) and does not taste authentic whatsoever.We waited 20 before we got our drinks and when our food finally arrived we couldn't eat it because we had no silver and had to wait to ask if we could get it.While this happened our server said three words to us during our hour stay. I thought Denver Colorado had bad service but man does this too it off. I'm happy I will never come back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fJFuMnmQtVGjKPHdy79NpQ"
  },
  "NvGHMQ-HzLKG7dwK0rR-0A": {
    "date": "9/29/2018",
    "text": "Me and my boys were waiting for 10 minute before someone attended us. Such bad services.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUwGxyMzqYG_l-cpKD3Y2Q"
  },
  "_4LPcnJ6I0vnoG0f8iXDLQ": {
    "date": "5/27/2018",
    "text": "Very busy on a Sunday night, I think they were under staffed. Ordered pizza, spaghetti and gelato for dessert. Food tasted good and arrived quickly. Biggest issue was waiting for service- since the guy who was servicing had a lot of tables to handle.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cBsZT8o8F8QlWnNsXLeN6A",
        "caption": "Photo of Zizzi - London, United Kingdom. Pinoli pizza with goat cheese, mozzarella, Caramelized, balsamic onions with baked tomatoes and pine nuts.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cBsZT8o8F8QlWnNsXLeN6A/o.jpg"
      },
      {
        "img_id": "mFylsZRDZC1hhL4A7jhnuA",
        "caption": "Photo of Zizzi - London, United Kingdom. Spaghetti with bolognese sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mFylsZRDZC1hhL4A7jhnuA/o.jpg"
      },
      {
        "img_id": "2K50IJYpOUjMyJUsXjNPRw",
        "caption": "Photo of Zizzi - London, United Kingdom. Lots of pizza options",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2K50IJYpOUjMyJUsXjNPRw/o.jpg"
      }
    ],
    "user_id": "MbO1uK1w2bYcwp-pzsH57A"
  },
  "XnCidloEwblmiAe6RW68WQ": {
    "date": "9/23/2016",
    "text": "My boyfriend did a take out the first day we arrived while I unpacked and washed at the hotel.  Therefore, I don't know what it looks like inside or the service... But omg, their pizza was DELICIOUS.My bf said the pizza was Carnoso (?).  It had a truffle oil taste with some kind of pepperoni (looking) topping.  I just sat there and devoured 2/3 of the pizza.  He also got the spaghetti bolognese, it's whatevers.. But that pizza was the best, thin crust-gourmet style pizza I had ever had...",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6PvjZIoMXpWnkrV3rWJ8_Q"
  },
  "sH4lQcasEW647y8X2N6AfA": {
    "date": "4/28/2017",
    "text": "Loved this place! Altogether tried the Lamb meatballs al forno, king prawn linguini, and salted caramel chocolate brownie ...All we're great. The service was nice and courteous too",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BZ8CPSW7loMLRa7L3zwNig",
        "caption": "Photo of Zizzi - London, United Kingdom. Salted caramel chocolate brownie - yum!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BZ8CPSW7loMLRa7L3zwNig/o.jpg"
      },
      {
        "img_id": "hTZ2hVjqSE5bfQpnNyjIvA",
        "caption": "Photo of Zizzi - London, United Kingdom. Top- king prawn linguini, bottom- lamb meatball al forno",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hTZ2hVjqSE5bfQpnNyjIvA/o.jpg"
      }
    ],
    "user_id": "n77a8pr9OK4uBxyKulF2zw"
  },
  "vO0q78kyIaNZ-zGvbuWeEg": {
    "date": "1/17/2018",
    "text": "Excellent food, friendly staff, but slow service. The waiter took around 10 minutes to deliver our drinks (mostly waters) after ordering and the responsibility to split checks for a party of 11 fell entirely on us. Despite that, the food had incredible flavor and was reasonably priced. I'd definitely go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqg_nWc8tgMV40xsG1Ey8g"
  },
  "ZkjSatteXSFYzNhEferXnQ": {
    "date": "8/23/2017",
    "text": "This so called Italian restaurant is probably the worst I have ever had. We came to this restaurant for dinner because it was super close to our hotel. First the service was horrible. Our waiter arrived at our table after a while of us being seated and just simply stared at us, no hello or introduction of any kind. My husband and I ordered calamari (very basic dish to prepare) and it was completely flavorless including the sauce it was served with which tasted like mayonnaise from the jar. We then proceeded to order margarita pizza. Our lovely waiter brought it to us uncut so we had to slice it ourselves. He also didn't bring us any plates which was annoying. The pizza was ok, by that I mean if there is a fast food pizza chain such as Pizza Hut that would have probably tasted so much better. I over heard the waiter tell another customer the chef was Italian. What a damn shame.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZ_sqowqL7c5XrOpKHsgYA"
  },
  "IUDlvQJRNbZjB8MP_PJlTg": {
    "date": "10/29/2017",
    "text": "Decent food, fun atmosphere, children friendly, reasonable prices, and good service. We enjoyed our meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9XMuUjD0LDwF8QAQgLdJQ"
  },
  "gqZ4PjNgHA7FRrzJCK_aZg": {
    "date": "12/1/2015",
    "text": "Not the best. It was our last night in London and we just wanted to eat something quick and easy so we came upon this place, which seemed to serve decent Italian food. The food was only OK. We ordered the arancini, which was not the best and the tomato dip was SO cold. My boyfriend ordered the Rustica Pizza Sofia, which was not bad. I ordered the Penne Della Casa, which is a penne with chicken and creamy mushroom sauce, which had absolutely NO FLAVOR. I had to add a good amount of salt and pepper to make it taste somewhat decent.The service was subpar - our waitress at first was pretty friendly but then she disappeared for our entire meal and no one came to check up on us at all. My boyfriend asked another waiter for some more water and it never came until we asked again. And when we asked again, the waiter had attitude and was like \"I'm bringing it to you now!\" I definitely would not return to this establishment as the service and food weren't great. There are much better places to eat.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QbKrjRXuScMHIZLXC30-og"
  },
  "8Atbx6O1O9dH6voi-naQdQ": {
    "date": "5/4/2017",
    "text": "This place was extremely fast and very delicious. The cocktails are quite good and I highly recommend the primavera pizza and the zucca salad. I would get a pizza and salad and share with one or two people because the portions are quite large though.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gcJ5T8Nr17T6wNCzcMvI8w"
  },
  "tLYaBOeGscJcrdS2JSeQdA": {
    "date": "7/23/2017",
    "text": "Great service, drinks and food.   We really enjoyed a nice meal after a hot and tiring day touring the sites in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQtRPXIb_HDSBhl9EGWhyA"
  },
  "uFw9H1kQaiz5i-3bST2O0w": {
    "date": "9/20/2015",
    "text": "Great meal. Great atmosphere. Reasonable price. Check it out if you are in London.I believe this is a chain but they have done a great job. This is a short walk from our hotel and was just what we needed for a great night out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IVEMPtPt_pPN9dmf5cDUCg",
        "caption": "Photo of Zizzi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IVEMPtPt_pPN9dmf5cDUCg/o.jpg"
      },
      {
        "img_id": "Xqmboii67xNcKp9W38QfHQ",
        "caption": "Photo of Zizzi - London, United Kingdom. Pizza was marvelous.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xqmboii67xNcKp9W38QfHQ/o.jpg"
      },
      {
        "img_id": "zrgHOg4GxymQ0C7rMARjRw",
        "caption": "Photo of Zizzi - London, United Kingdom. Olive sampler is great.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zrgHOg4GxymQ0C7rMARjRw/o.jpg"
      }
    ],
    "user_id": "f_p0ZZT_jn_Cw0yxrmeqIg"
  },
  "62T9Yp1X3U7Oj5FY_6-1Bw": {
    "date": "6/22/2017",
    "text": "Italian restaurant with just so-so food that is overpriced. Pasta soft, flavors ok, meager on the meat, overall nothing special. My teen son and I could have produced our meal without a whole lot of trouble and we're not cooks or Italian.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cce3OG0O16bJMJq7v44Vzg"
  },
  "ktdPgp2J832CPp2fzi62Ig": {
    "date": "3/19/2015",
    "text": "After an evening at the theater, we were super hungry and having a hard time finding anything open - a harsh reminder that we were not in NYC anymore. We stumbled upon Zizzi, which was open for another 40 minutes, and willing to seat us. We split an antipasti platter that had some of the freshest most delicious mozzarella I've ever had - like a creamy cloud of delight. I had the ravioli, and Adam had a risotto. We were both totally satisfied with the dishes. They were no frills Italian staples and they were prepared to perfection. For a chain, I was really impressed by the strength of the food and its flavors.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "L2JUm1kc8M3ji-Ud2HUBSw"
  },
  "pfl_xaIQ3IF8aTeuzuYj3A": {
    "date": "4/27/2016",
    "text": "Poor service (even for London), food was okay but portions were skimpy. Didn't really enjoy it much but it has a good location.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NG3HtZLKkAEcNWsNVfcXsw"
  },
  "h3IPrSgtwftGFq-aIQziyA": {
    "date": "1/8/2017",
    "text": "Very busy restaurant with nice staff, great cocktails and tasty food. Wish we had it at home too ...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UEe_970o2sSQV5J8XGIYWg"
  },
  "tUk5YSQyC-0M59f0Px-MaQ": {
    "date": "12/29/2015",
    "text": "My new fiancé and I visited Zizzi for dinner in July '13 during a walk back to our hotel in Westminster from Harrods Department Store. It was packed on the inside as well as in their outside seating, where we waited just a few minutes to be seated. I loved the outside seating because of the view of Westminster Cathedral across the street at sunset. We ordered cheesy garlic bread & calamari as appetizers and a ravioli di capra dish and lasagna dish for our meals. The food was wonderful though it took some time to come out, likely because of the number of people being served. The Peroni wasn't very cold, neither were the waters we asked for. We figured that may be a British custom, so we didn't think anything of it. All in all the place was wonderful. Great food, great relaxed ambiance and wonderful energy, and that's all I can ask for. I'd certainly visit again.Visited July 2013",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUaMeemu5nyMFnSk8XjVCA"
  }
}