{
  "5lTTLRnHHQ0dFnxUZ6Bp4g": {
    "date": "10/1/2008",
    "text": "A few of the girls at work recommended the Patogh Persian Restaurant so I decided to go in there for dinner tonight. It's quite a dark place but with the atmosphere of being in a cave a la Aladdin I'm sure. The chef was a bit of a genie, conjuring up a huge portion of rice and lamb kebab with a yoghurt sauce to taste - all for the low price of only six pounds. They are very nice in there also, the service is good and they enjoy a laugh. I saw some of the other customers meals and they looked great too. It's definitely a place where I will be going back for more",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Oaa6OMOt-9PyppivPdMhGw": {
    "date": "10/24/2010",
    "text": "This place did not live up to my expectations, given a 4.5 star rating.  The lamb was very tender, but that was the only memorable part of the meal.  It wasn't bad at all, it was just forgettable.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6H3NPqHaW-L1t4-AqVAE0g"
  },
  "gBgEwU-9i-57gBuyLCrU_A": {
    "date": "6/27/2010",
    "text": "Spectacular breads and good value. A real gem. Tiny seating space; cosy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlFmrT2pMGUaKR_D3AEpIQ"
  },
  "1UP_yMDS0FBmqygxjqEv7w": {
    "date": "7/5/2010",
    "text": "Come on guys, 5 stars? I mean, yes, it is good, but 5 stars? Huge portions, decent food, small and cute location. The ground meat kebabs can be a bit greasy and the chicken is sometimes dry, but yeah, it is a good place - just not 5 stars!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tq9C0PIlTh7X7PQlT-yG6A"
  },
  "BSvcJU4nxX-V5QCbBkSJZg": {
    "date": "9/24/2009",
    "text": "This place is absolutely fantastic. The ambience is quaint and unique and cozy. And the food...wow! Incredibly flavorful and quite filling. I dined alone and could've easily shared my entire meal. Not a ton of vegetarian options, but the service, ambience, prices, and food are absolutely fantastic. I would recommend this place to anyone looking for a wonderful and satisfying dining experience. Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aj7593hkJijOc0nO1hcaiw"
  },
  "6_3xLGN52fqVYPhRLynmow": {
    "date": "6/5/2012",
    "text": "My favorite restaurant in London.  Fantastic food, generous portions, friendly service.  BYOB.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLbJ043pHzsWhKug4MNrnQ"
  },
  "3mzBAiDPUfKX6V-jwEUhHQ": {
    "date": "7/17/2011",
    "text": "impossibly crowded and small place. great way to meet your next friend from Iran :-).Food is authentic and excellent. Prices are reasonable. Great 'dive\"",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eTQH5Kee7XK-C_EMlGWY7Q"
  },
  "KiyB3Fi2f8Yx5F_boeWGAg": {
    "date": "7/10/2009",
    "text": "Nice little restaurant with decent Persian food (of course I am comparing to Persian cuisine in California). Good choice if you are going with some close friends but not somewhere you would take a date. I ordered the ground lamb kabob #11. It was delicious. We also ordered the Doogh (yogurt drink) which was homemade.I took some friends who had never eaten Persian cuisine and the really enjoyed the large nan (bread) we ordered with shallot yogurt.They don't serve alcohol but allow you to bring your own. Great option.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GgceXMO9FVSMmg0Zq5YvYg"
  },
  "cfC2oNitaMbE5yT9NujxKA": {
    "date": "3/13/2010",
    "text": "the bread doesn't seem all that special at first but for some reason I couldn't stop eating it.  the lamb pieces were tender and flavorful.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flTy1rss0oJBIVzjjpPyeA"
  },
  "JskExApXweHql6uYzZ8A6Q": {
    "date": "5/2/2009",
    "text": "I read the reviews and thought I had to try this place. After visiting Le Porte De Indes a couple of weeks ago and having an absolutely appalling time i wanted to go somewhere that was renowned for good food. I was amazed at this place. My friend and I visited last night and we had GREAT food at a VERY reasonable price. We ordered two different mains, 3 drinks and a side of rice and it only came to £22 in comparison to the £80 we paid at Le Porte De Indes. The food was cooked to perfection and was absolutely fab, mouth wateringly succulent. The bread is amazing, it takes up the whole table, it is soft and covered in sesame seeds, you have to try it. We will definitely be going back to this gem of a restaurant, whether we eat in or get a takeout this is going to become one of our fave haunts!! Admittedly the decor is mediocre and the restaurant itself is tiny, but the food and the value far outweighs all of this!!!!!!!!!!!!!!!!!!!!!!!!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "I6uoibuVnqpJ9WxRsPzLQA": {
    "date": "11/15/2008",
    "text": "Definitely the best kebabs in London. cosy little place that gets incredibly busy on Friday / Saturdays. For around £15 per head you get a large starter and an even bigger main. I urge all to try the special bread and humous, the bread is cooked fresh and occupies the majority of the table! It is also 'bring your own' so no ridiculous prices for drinks! You certainly won't be disappointed, quick, easy, tasty and cheap!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RO1utUB7Gia9iw84prVL_Q": {
    "date": "5/4/2011",
    "text": "Cheap and good!  Super small (although there is an upstairs) but it was full, so be prepared to wait.  Cash only, although you don't need a huge wad of bills to eat yourself silly here.  The big special bread is massive (and delicious) and the mezze platter will do you well.  Highly recommend the minced lamb kabob, but be prepared that there is a small selection of dishes.  We had a great meal although not a place to linger as they need to turn the tables.  BYOB BTW.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "Mq87Ke3JQBpndJ3Y3r7ZFg": {
    "date": "10/13/2014",
    "text": "Patogh is a very nice small restaurant situated just off Edgeware Road. Both service and food are always great and the prices are affordable. I recommend this place to anylone who likes traditional Middle Eastern cuisine.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byp9FFdzWnxPvMdgPECg1w"
  },
  "Ax1iyqRQMB0pq9lo0n9JGg": {
    "date": "2/24/2014",
    "text": "Okay food, terrible service. Very rude, and insisted on us paying a service charge despite it not being on the bill.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwajKKSuU0rQvJFZpYiCng"
  },
  "QPM0xK_Ad-EFyv8tlvAx0w": {
    "date": "5/30/2010",
    "text": "I discovered this place while looking on Yelp for a place to dine with an old friend while we were in London for an evening. This place oozes authenticity (for most of our meal, we were the only white folks in the place), and the food is stellar. We had simple kebabs, but the flavor of the meat was spot-on. I also started with a platter of pickles while my friend had the hummous with house bread, which was enormous (and she ordered the small size!). I also had the yogurt drink, which was different from anything I'd had before but complemented the meal well. One downside: I picked Patogh because it was supposedly baby-friendly, and we were traveling with our 15-month-old. They didn't have ANY high chairs, which was bad since our little one was antsy. Instead, I held her in our sling and she napped during dinner. Oh well.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spzHnMRdrcoHnnjlCJx-dQ"
  },
  "Qwp0rDefgRw2N3gWbXA31Q": {
    "date": "5/31/2010",
    "text": "What a gem!Huge portions, excellent minced lamb and you can BYOB. We shared grilled chillies and grilled onions, and had 2 main courses + 2soft drinks. All for 18gbp...They have some house rules: minimum of 1 main order per person, and no tips included in the bill.The place is very small and as soon as your food is finished, they will bring you the bill as someone else will be waiting to take your table, so not the right place to stay chatting after your meal.Overall, excellent place and good value for money!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yiIuv83XjHRXMSb0ZYmsAA"
  },
  "1FpleMs-OZh4Fwi3Y23fzg": {
    "date": "2/3/2010",
    "text": "Absolutely phenomenal chelo kabob here.  Seriously.  I ordered the lamb koobedeh (ground/mince meat) kabob with bread and grilled onions (the onions were a side order).  Sooooo good!  Two huge skewers of kabob and a large tray sized bread made on-site in the tanoor with onions, pickled vegetables, fresh mint, lettuce, and grilled tomatoes.  Total kabob heaven.  The added bonus?  This was £6/person + another £2 for the grilled onions.  We went for lunch, but I think the dinner menu is the same.One warning: there are, like, 6 tables total in this restaurant.  Didn't have to wait for lunch, but not sure what the dinner situation is like.  Can't wait to go again to order the mahi kabob.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2U1dOQmUFWE8XN1QspU4Gw"
  },
  "aJnsLA3gqp4RSRIzfnl5YA": {
    "date": "6/28/2011",
    "text": "I can't believe Patoghs hasn't been reviewed more. The food here is amazing, and it always gets busy in the evenings. It's tucked down a side street in the 'Persian Quarter' of London, and is really small. It only seats about 20 people max, with only space for 10 downstairs. it's really cramped, and the staff are quite happy to shove you right against a wall to make space. However, the food makes up for it. They do these giant breads, which are like thinner naan, but with a slightly different flavour. I recommend getting one to share. I usually go for the chicken with saffron rice, which is really well cooked and flavoured. I've been with friends who've had the baby chicken, and the lamb kebab, and everyone raved about them. There's a couple of really nice pubs nearby, which are a great place to go to after gorging on Persian food. I've been to Patoghs with friends, and on my own, and have seen many couples there as well. Patoghs is truely an unsung gem.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OUNfsUm9d7C6AJq8vMcjwQ": {
    "date": "8/10/2009",
    "text": "In light of me having a cold :( (Not Swine Flu!), I thought I'd write about a place that gives me the feeling of home. This small family owned restaurant features extraordinary sized special bread. It tastes a little bit different from Naan but delicious nonetheless with some hummus and taziki. They don't serve wine, but here's the kicker there is no corkage fee! Waitrose and Somerfield are but 2 min away to supply you with your alcoholic beverage(s) for the night. Mains are 6-7 quid. I recommend the Lamb kebab which is stunningly simple coupled with a roasted tomato and rice. Word to the Wise this place is very small so a big group would not be ideal. But it would be perfect for 4 people. Total price for a meal will run you about £9 to £10. I implore anyone to eat here!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "1EMTKLDBgLuNVeIkaiIIRA"
  },
  "88qBlRveZF23A39HYd25lw": {
    "date": "9/4/2011",
    "text": "OK - I used to be a big fan of yelp. Lately, however, I've grown disillusioned because the recommendations have consistently not lived up to my expectations. I'm writing this review JUST because I saw that this place is ranked the best Persian/Iranian restaurant in London. It most definitely is not!!!! I used to be a big fan of Patogh, but it was never my favorite (and I am Iranian, so I know what I am talking about). It's not even the best Iranian restaurant on Edgware Road. However, the standards have been slipping in my opinion.First of all, the restaurant is extremely small - literally 5 or 6 tables in the entire place, with maybe 20 patrons in total being able to squeeze themselves in at any given moment. Second, The only outstanding thing about this place is the bread. The meat and chicken are distinctly average, and more than once have I gotten a takeaway from here and found the chicken to be burnt to a crisp and completely unacceptable. Third, the menu is very, very limited. No kashkeh bademjan, mirza ghasemi, khoresht of any kind (that I can remember). Conclusion: this is definitely not the best Iranian fare in London. If you find yourself craving a chelo-kabab in the area, go to Kandoo (much better food and a more authentically Iranian menu). Mohsen, Yas, Al Borz,  Alounak are also all vastly superior to Patogh - and that's just a start. Do not waste your time here.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gJXqtp2xLdm24_XidRVRw"
  },
  "91ogNe2JNhalUQQ0D9v1QA": {
    "date": "5/15/2009",
    "text": "Why the hell hasn't anyone written anything about this place? It's freaking amazing.My first Iranian (and since then, many) culinary experience, and what an awesome one it was. Patogh is located on a random alley on Edgwar road, and is a tiny place with an open kitchen where two older Iranian men bustle around, pumping out delicious, freshly baked special bread and roasting their amazing kebabs.I always get the special bread (£5; huge, can serve 2-3 ppl) with tzinzinki sauce and hummus, and depending on the number of ppl, several plates of chicken/lamb kebabs (£6; come with rice or salad or bread).The service is straight forward and friendly enough, the food comes fast and hot, and you finish your meal feeling like everything in the world is a little bit more beautiful, if not tasty.This place is usually populated with Arabic people living around the area, so you know it's legit.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jWogrkf0PMfP9UoiXULKuw"
  },
  "mz3HkgvhMgHCYVyapYO_WA": {
    "date": "8/19/2010",
    "text": "Okay, yes, there has been an attempt to make Patogh look \"rustic\". And, yes, it is a little cramped. And, yes, I know, it does have the best food on Edgware Road. But aside from that... wait, what? Yes, really. The best. I think it was the bread that did it for me. A huge platter of freshly-baked bread, spread with fresh vegetables, big skewers of grilled meat and delicious sauces, this is the best example of the turkish/lebanese/syrian style of food I've experienced. Also, it's seriously good value, homely, friendly and when it comes down to it, rustic isn't half bad :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0pk34Vxu0TGRQScos4kp1w"
  },
  "lhfLQ2zIH1p5KJCa2hYasw": {
    "date": "9/13/2011",
    "text": "Yelp scores again (across the pond). This place was just a couple of blocks from my hostel, but I would have traveled way farther than the5 min walk it took to get there.I had a great lunch of lamb kebab, made by first mincing the lamb and then forming it and grilling it. Superbly seasoned with just the right amount of spices and cooked to perfection, the lamb meat was crispy on the outside and tender and moist inside.  Don't forget to try the hot sauce (seemed to be a harissa) on the table and ask for some of their yogurt on the side. It was a nice compliment to the lamb.  I had my lamb with a side salad but I think i should have gone with the rice, which looked great on other tables.I also had a yogurt mint drink which paired nicely with the meal.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNlv6ZXYeki_XA7YV7yLeA"
  },
  "uosaGReSQ7ITNwThAvJ_eQ": {
    "date": "7/11/2009",
    "text": "Amazing place. Walk in and feel like you've been transported out of London straight to the Middle East. Great selection of grilled meats, ditch the rice and go for the bread. One order of bread is good for 2 or 3  people. Combo dishes allow you to sample a couple of grilled meats. The mixed mezze is also very good.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yHkF4YbvYMaFE-927uobSg"
  },
  "WeqfvTX2aVB6EEJoy4gJrA": {
    "date": "5/8/2011",
    "text": "This a voluminous approach to dining with no detriment to quality. Most of edgware road feels overpriced so this little place tucked around the corner is a buck to that trend. Beware - the starters are a meal itself. The lamb comes recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EGYsPKoNGf8kqAO-Ma-8TQ"
  },
  "HmJu-F0MQauMmtVDq3JBBg": {
    "date": "1/22/2011",
    "text": "Quite a busy tiny restaurant. The food was fine but nothing special. They will not let you share an entree which I found very odd.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSucmZZPZ5GUyNdCHXVPIA"
  },
  "E7nHQqokbAFgnhg64eLLKA": {
    "date": "2/28/2011",
    "text": "We had their Persian bread, sampler plate, a chicken kabob, a lamb kabob, rice, and their yogurt-and-mint drink. All that was £30. *Every* bite of that was amazing, except the hummus. The place is small and crowded, but the staff is very friendly. It's a couple blocks from Edgewater, in a neighborhood with many other middle eastern people and shops. Two of us had to wait 15 minutes for a table, but the excellent double espressos we got across the street made that wait a good thing. Larger groups were clearly frustrated by longer waits. But this was a Saturday night, around 8. If I lived here, I'd be a regular...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0fRUvJhOCocN3IPxVeF6Gw"
  },
  "o1J98Lc5hbB5CDaniZVBhg": {
    "date": "12/28/2011",
    "text": "To step in to this place is to walk into a wonderful, olde worlde little cavern of bronze coloured walls ,wooden benches, oil filled lanterns amidst several beautiful paintings depicting 17th century ishafan landscapes. You can imagine 17th century ottoman knights visiting such a place at the end of a hard days battle and resting their trusty shields and swords on the heavy duty wooden tables before sinking their teeth into the meats on offer here.I have been visiting this hidden gem for 5 years now and nothing ever changes.Reading some of the reviews of Patogh on here it is to the credit of us as discerning consumers that at a time of national calamity  our economy in ruins, half the population in negative equity and the other half on Facebook,our youth rioting and lying drunk in the gutters, and our elderly lookig for a salubrious gutter in which to reside, it is to the credit of our spirit as a nation of restaraunt goers that at such a time so many on here can find the energy to complain the food was great but the waiters didnt tallk to me!Such people miss the essence of this place. There is only 1 waiter , there are 2 elderly cooks, making food iwith meticulous care and pride in a open plan kitchen/counter area the size of the average suburban semi detached living room with seating for ten downstairs and the same upstairs. Yet despite this the food and premises are unscropously hygienic and fresh and the food amongst the best value in the West End.The menu has not changed in the time i have been going there, service is always very fast, it can be difficult to get tables at peak times, and when u do u will be served your food fresh off the grill within 6-7 minutes and will probably have eaten it and left within 25 minutes. But you will be rewarded with the biggest nan bread in london quaintly listed on the menu as big bread, glazed with olive oil and encrusted with sesame seeds , or alternatively saffron rice and a choice of either chicken or lamb minced meat skewers, or baby chicken., the adventurous u can buy a side of grilled chillies or okra.and that is basically the food menu! For drinks there is pepsi/fanta/water and a drink called Dog which is a refreshing yoghurt and coriander beverage.Prices for either rice or one of these huge breads with your meat of choice is an incredible £6! Your salad will be freshly cut and consist of baked tomato, onions,cabbage,mint,green chillie,lemon,and radishes. Dont be misled by others descriptions, to sit in this place for even 5 minutes is to be taken to another world, perhaps a small downtown iranian cafe off the beaten track with its wooden bench tables and quite ambience. And for the record, the 2 cooks always say hello and goodbye! Just understand the culture.. this is a persian joint run by 2 older gentleman who are cooking non stop yet go about it so quietly and calmly! It isnt suitable for tuxedoed partygoers looking for a long raucous night out, and isnt suitable for screaming kids and pushchair toting bingo winged soccer moms.For perhaps a couple or a party of 3-4 connosseurs seeking a quick teleportation into a far away land and its delicious street cuisine try Patogh! If you want a more extensive selection of Iranian food and the full night out dining experience try one of the iranians on edgeware road.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "itn77m82Dxmc5u6Fqh4J6Q": {
    "date": "5/24/2009",
    "text": "The first opinion of this restaurant may sound snobbish due to the rugged interior design of plain mud-coloured walls, narrow stairs leading to the first floor of laid out wooden tables and benches and a rather quirky manner of service offered. Otherwise, this lovely Persian restaurant is a true hidden but humble gem. Kebab is the main food served here with fresh ingredient and very tasty rice dishes. I went for the chicken kebab, which was deliciously cooked with lemon marinade and some other ingredients I probably don't know! Totally just under £10, bargain! Talking about quirky service: food is served in tin dishes and interestingly no alcohol is served in this restaurant, so for all those who like a bottle of beer with their meal,be careful! don't know if you can sneak it in. If you are up for taste and not design, then this restaurant would meet your expectation or maybe you just want to impress your friends. Good service even though the waiters hardly make any conversation with you, if that's not your cup of tea then you should be fine. My verdict: cheap, but tasty.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mEjmQKVNOnkrZCWKt5y5iQ": {
    "date": "2/16/2013",
    "text": "This is the classic hole-in-the-wall establishment you could pass by a 100 times without realising there's anything special about it. I did not give this place 5 stars because I realise not everyone is looking to be squeezed in a small upstairs room, rubbing elbows with strangers. But, if a restaurant is to be judged by the sheer goodness of food alone, this is truly a 5-star spot. For very reasonable prices, you can relish fine Persian fare, ranging from their huge fluggy flatbread, grilled chillies and onions, hummus, chicken and lamb grills on rice and spicy sauces. This place is highly recommended for those who can appreciate amazing food without the ambience to match. Also, go in a small group (less than 4 people) given the space of the place, expect the service to be quick and don't expect to linger after wrapping up your meal. It's a BYOB place with no corkage and if I remember correctly, they operate only on cash.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8OPx1EO2EF8DjV5SQDOwQ"
  },
  "kbTp9d4WA7nr_fyGH52Wyw": {
    "date": "3/25/2012",
    "text": "Decided to try this place based on the good reviews on Yelp and the fact that it was reasonably close to the hotel. It's a tiny little place, at least the downstairs, with a tiny little busy kitchen that we got a table right next to after a 20 min wait (that was spent at the lovely bar just a bit further down the street, Lord Wargrave/Wargrave Arms). Great ambiance, busy, lots of people came in for take out. The food was good (and I loved the huge bread!), but it was not amazing. No alcohol on the menu but noticed that people brought their own. The one big minus for me was that I noticed that the guy who prepared most of the food that left the kitchen, handled money then used his unwashed hands to put salad on plates, etc. This didn't just happen once by accident but several times just while we were in. Without this experience I would have given them a 4/5, so when reading this know that I may have been biased by my germaphobic tendencies...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "keLybSRMQjtMmJcWpo5StQ"
  },
  "u1jjaRP5cHIjusZftMkPQA": {
    "date": "3/11/2016",
    "text": "Best Persian restaurant in town. Better than Alounak, Kish, Pars and Sadaf. The big special bread is amazing. So is the minced lamb and rice. Incredible flavours. Hole is the wall restaurant. Added bonus - bring your own alcohol, and this place is cheap. I mean ridiculously cheap.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TaZU9xjsaCpKYirpriUYzg"
  },
  "dX1VcAb_--juIfKi-HclLQ": {
    "date": "12/12/2016",
    "text": "This is one of my favorite places to eat in london. The food is cheap, clean and also very tasty. They also treat customers like family.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "23VoSRBe3XiLkEmOXyfQdQ"
  },
  "06Kaou9CK8aRKStiP2T23Q": {
    "date": "2/2/2015",
    "text": "Qorbaan e Shomaah.Moç ay karam...delicious Iranian Restaurant steps off of Edgeware Road.  Always crowded, order take away.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "18fZsAVFHHFYuaw-2Sq9_w",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/18fZsAVFHHFYuaw-2Sq9_w/o.jpg"
      },
      {
        "img_id": "Mzji8EGilsFiVM9praO9SA",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mzji8EGilsFiVM9praO9SA/o.jpg"
      },
      {
        "img_id": "UUmvDBGA5vmi8iNzkj-bNg",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UUmvDBGA5vmi8iNzkj-bNg/o.jpg"
      }
    ],
    "user_id": "Exue8Tno8rwF7eWqxr5_8g"
  },
  "T4zNuoO7S21-JvPEHXqnow": {
    "date": "7/13/2014",
    "text": "As you walk in, you find yourself in awe. The lovely exposed brickwork, with minimal lighting leaves a nice natural warmth to the interior. The smell is also lovely. Charcoal and a little like a high end kebab place.Service is pleasant enough, though the menu is a little thin. I came here because of a craving for Persian food, and came away disappointed. There large bread which you must get with dips, was great, as was the minced chicken dish with rice. But nothing was shout our \"Persian\". It could easily have passed for Turkish/Mediterranean. The lamb stew dish I ordered was pretty watery and lacked any flavour at all really. Even when lamb is supposed to be one of those stronger meats.In all, the highlight was that the place was cheap, but not cheap enough to warrant a second visit. The minced chicken was good, but there are plenty other charcoal/grilled meat restaurants that do this well.The place is really tiny, so it can be problematic getting a table, but we were here during Ramadan so it was pretty quiet.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eMrRs0V4S83qVAZXM2FttA",
        "caption": "Photo of Patogh - London, United Kingdom. Lamb and Rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eMrRs0V4S83qVAZXM2FttA/o.jpg"
      },
      {
        "img_id": "Be6IFvHa_VDgbwiIMOZ2hA",
        "caption": "Photo of Patogh - London, United Kingdom. Mains",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Be6IFvHa_VDgbwiIMOZ2hA/o.jpg"
      },
      {
        "img_id": "GzhyeELG3IlF1OcYSUmnRw",
        "caption": "Photo of Patogh - London, United Kingdom. Large Flatbread and dips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GzhyeELG3IlF1OcYSUmnRw/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "md_KYtwpSBdyy8kJxrSQmw": {
    "date": "2/4/2015",
    "text": "I'd read the reviews for Patogh on Yelp and Google and had seen that they were quite mixed. However it came up as Yelp's No. 1 Middle Eastern restaurant around Edgeware Road, so I thought I'd give it a go.I've been to Iran, and I thought that this looked like quite an authentic place to bring a friend who's not been himself...The atmosphere of the place is great, really reminiscent of an Iranian place. A bit cramped though, so they would squeeze three people around a table for two. Upstairs was also quite cold. All this could be forgiven though, if the food tasted as good as it looked.... However I must concur with the other reviews below. The humous lacked any sort of flavour and the meet was insufficiently marinated/seasoned. We had a minced lamb kebab and a boneless chicken kebab... The latter didn't really have any sumac flavour (the spice that would give it the Iranian flavour). The salad vegetables were anaemic even by British standards. As other people have mentioned, the only redeeming factor was the Special Iranian Bread. Very authentic and HUGE (£5), get the small one if you're only a couple. Price wise, it isn't very expensive, but I would still say it's overpriced for the quality of the food on offer. There are much better Iranian places in London, I'm sure....",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lVu74pnrw7P_LTkYlazd3A"
  },
  "gtqoq6BZU8ar57bz0q-_7A": {
    "date": "2/5/2015",
    "text": "My husband and I came here last weekend and were greeted and waited on by the kindest and most generous staff! The food was perfect and the portions were very generous! We will be coming back ASAP!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sh8IIx9kZ1o-wUrmBbgLUA",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sh8IIx9kZ1o-wUrmBbgLUA/o.jpg"
      },
      {
        "img_id": "6FwSB_CE1bfrXry7rM62zQ",
        "caption": "Photo of Patogh - London, United Kingdom. This their special large flatbread and the dipping sauces, along with fresh cucumber salad! Absolutely divine!!! YUM!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6FwSB_CE1bfrXry7rM62zQ/o.jpg"
      }
    ],
    "user_id": "DGKkBKs-K4SH4xsgiprYIA"
  },
  "ZoaoNdfIkih7tMX_UgJbfQ": {
    "date": "7/8/2015",
    "text": "As a flight attendant from SF,CA I get to go often. It's still my fav. I love the lamb. FYI they are not licensed if you want an adult beverage bring your own (the staff is cool w/ that)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Fiw6jNkTBTF24uJskH3rw"
  },
  "7r5ZWrka5Fs9lmKDxkoKag": {
    "date": "12/14/2016",
    "text": "Delicious , authentic Persian food! Minced lamb is off the chain ! Staff was friendly but the restaurant is very cramped!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCEishJWRa4uU3fhLq0D1Q"
  },
  "GFdl-G1ai7aUcTtKEv3VBg": {
    "date": "7/7/2015",
    "text": "This was such a nice dinner! The waiter was so sweet and gave us a large bread (we ordered the small one) and a cucumber yoghurt on the house. We also got the hoummus, minced lamb kabob and minced chicken kabob. They were all great and really fun to eat with the huge bread. Next time I won't order the rice, though, as it turned out to be superfluous when we had the bread.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6YxLAZUBxdIuVvugvnBrA"
  },
  "Wr_AIfitIETv3PadDgSkww": {
    "date": "10/8/2016",
    "text": "While the restaurant only seats 4-5 tables, the food at Patogh is authentic and unassumingly delicious. We've always been made to feel welcome here, a reminder how genuine people and timeless recipes often make you feel like you are part of a family. That's the feeling you get at Patogh, time after time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgxP45YEGxdQAS0OO0Q8YQ"
  },
  "YISIzgzCnuso1P8uN17CMw": {
    "date": "11/14/2015",
    "text": "It was a bit expensive considering the quality. The rice was undercooked​ and kebab was just ok.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xdgnuc4FPhTWzAoZy8mC9g"
  },
  "idEAz2HEzSGnmvAXza9ZsQ": {
    "date": "11/28/2013",
    "text": "Quaint little Iranian restaurant tucked away on a side-street. The decor is really good and seems authentic. Very cozy and small and can get a bit cramped.The chefs and the waitstaff are really friendly and nice. Not many vegetarian options on the menu. I had the Lady fingers stew with tomatoes and potatoes served with a plate of rice. Decent taste but I was expecting more spice. All in all pretty \"meh\" if you are vegetarian",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gG-0vzL493QjRc6n-smHCA"
  },
  "o_ozl1VHDhfzzYrjbeBd7g": {
    "date": "5/19/2016",
    "text": "Great food (especially the bread) and friendly service. Always try to stop by here when in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JswV5qV2Vbg78nlpErhNWQ"
  },
  "pPl9JHe7LStIJlykvhsdzA": {
    "date": "6/19/2012",
    "text": "How is it possible to give 5 star to this restaurant ??!!?? 0_oThe giant bread is just like... a tasteless giant bread, they forgot to add garlic to their hummus, even the yoghurt is tasteless.The lamb is better, but definitely not a good address :(A typical case of fake yelp opinions?",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yh53BsSYc6u6-GotqJPTLw"
  },
  "JLU8aOG049c15-CR4SvBmg": {
    "date": "8/2/2012",
    "text": "Quick glance:+ big portion+ tasty meats+ good service+ very cosy- queues can be longI'm not a connoisseur of Iranian and Peruvian food, but I enjoyed the food from Patogh well enough when my friend took me here for dinner one evening. The venue is very small spread over two floors, so expect a queue if you are visiting especially for dinner. You are put where there is space, so you may be sharing with another couple or a family. The waiting staff has a great memory; my friend has frequented this restaurant at least 3 times, and the waiter has recognised him and gave us a free starter of houmous and bread, which is absolutely ginormous. The houmous isn't particularly flavoursome, as other reviewers might have noted, but it seems to be a tradition to add salt to it judging by the actions of other patrons. Perhaps that's just the Peruvian / Iranian way...?I had the lamb cutlet and it was tender and well seasoned, while my friend had the lamb shish kebab which was juicy and tasty. The price is very reasonable and you get a whole lot of food!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "Wlv8Q1E3z1K5fQO3qndxhw": {
    "date": "4/12/2012",
    "text": "Super good and super affordable Persian food right off of Edgeware Rd. Really cool atmosphere (cozy) with an exposed kitchen and several floors (I've only been on the first one). First time we stopped in they were having electrical issues so we had to cut our visit short. Upon returning several days later the chef remembered us and sent out a free order of humus. I thought that was a very nice touch and one that will make me a repeat customer.I'm having dreams about how good the panir is here. The minced lamb served with saffron rice is also amazing. Best part is that it's BYOB with no corkage fee! So save your £s, pick up a bottle of wine at the Waitrose down the block and stop in!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "WVtX3oB45NDFxGXSgFqE2w"
  },
  "kSqVa29WeJwrywwl-UeHFg": {
    "date": "3/25/2015",
    "text": "The food is good but the service is really unsatisfactory. They refuse to serve tap water, and has a one person one main dish policy. We were a group of 4 and tried to order 3 main dish and many starters to share but they still insisted that we had to order one more main dish - so we cancelled the starters. Waiters were unfriendly. Atmosphere looks authentic.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Wh61KgHol7SS9cvQ0TBvA"
  },
  "n9bkI6xrrTw2-JKPk_29-A": {
    "date": "7/8/2009",
    "text": "A bumbling cozy place in a non-descript area, but filled with people?! This is a hidden gem. You'll be sitting right up against your table and bumping into the walls because this place is so small. The kitchen is right in the open so you can smell/see what's cookin'.What to get? Special bread. Take a look at it's size: yelp.co.uk/biz_photos/ez…. ENORMOUS. One is enough to feed 2-3 people. It's basically a huge naan, but it has crunchy edges and gets softer as you go towards the middle.They gave us hummus and yogurt sauce on the house so that was awesome. We ordered a plate of lamb and chicken kebabs to go with dish. Unfortunately, we ate them as they arrived on the table so I didn't take pictures. My bad.What's so good about this place is the simplicity of the food. It isn't fancy. It isn't complicated. It's just straight up authentic food the way it should be. Delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "T9xBkxxDNC7ezPEAG0Iwww",
        "caption": "Photo of Patogh - London, United Kingdom. size comparison",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T9xBkxxDNC7ezPEAG0Iwww/o.jpg"
      },
      {
        "img_id": "LVpvW8HFfcQjiHFG9Kp9sA",
        "caption": "Photo of Patogh - London, United Kingdom. overhead view",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LVpvW8HFfcQjiHFG9Kp9sA/o.jpg"
      },
      {
        "img_id": "HoSPoasvs85g_7LX3eEFkw",
        "caption": "Photo of Patogh - London, United Kingdom. The meal of champions",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HoSPoasvs85g_7LX3eEFkw/o.jpg"
      }
    ],
    "user_id": "ryQzhVKN-LwrtQ92DEdvRw"
  },
  "lYEEBtL0rC9pQ9DBz2k0uA": {
    "date": "1/3/2015",
    "text": "Easily one of the best lunches I've had in London.  Food was excellent, simple and extremely flavourful.  Fantastic service.  Will definitely be back again    The Special Lamb was the bomb",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_QPJkKgHi8E0w-5SDJMtA"
  },
  "iBPZt0mDXkN2WZx3xStfiA": {
    "date": "4/18/2012",
    "text": "Very cozy ambiance with pretty good kebabs at decent prices. Service was pretty friendly as well. I got my meal on bread instead of rice and it came on a GIANT piece of bread. I liked the option of having my meal on either rice or bread. We ordered hummus and used that giant piece of bread to scoop up all of that deliciousness.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "edPC6F45LkV0T6wu4Exfow": {
    "date": "11/9/2018",
    "text": "Definitely one of my favorites in London and a must eat when I'm in town. The warm bread alone is worth it and the kebabs are perfectly grilled and juicy. The restaurant is small and is also BYOB.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NoloWFSTIazQs8ccjoj7-g",
        "caption": "Photo of Patogh - London, United Kingdom. Chicken kebabs, lamb special, and their curry-ish dish (forgot the name).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NoloWFSTIazQs8ccjoj7-g/o.jpg"
      },
      {
        "img_id": "vqshLv8PjUJ5fklXNKDTDg",
        "caption": "Photo of Patogh - London, United Kingdom. Large bread and dips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vqshLv8PjUJ5fklXNKDTDg/o.jpg"
      }
    ],
    "user_id": "TWllZK0U0WOTMALznwHDvw"
  },
  "pL7q_vIPSXGZpTODoXFGtA": {
    "date": "8/16/2018",
    "text": "Stupid policy.  Came here (3 adults) and two kids. The kids weren't hungry so we ordered for three adults but were told that we had to order for them as their policy is if 5 are seated then you must order 5 main meals. So I asked, \"would you rather have three orders or none?\" Their answer.....\"none\". Stupid is an understatement. Business acumen = 0. But then the owner being from Afghanistan says a lot. No common sense and money grabbing bastards.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LAEYJ7TO2DI71nX0dzRl2g"
  },
  "I4IGrPQDRPp_XM4MwCAK-Q": {
    "date": "10/25/2018",
    "text": "Portions were generous. Staff was friendly. Food was decent but not that flavorful to me. Had the lamb pieces but others in the group had other items on the menu. Was taken aback by the everyone has to have a main course and the money having to be cash but we got through that. Water is going to be bottled which is another charge. But the bill was reasonable overall. The biggest drawback of the place is that it is very small, dated, and cramped. Worth a shot for the experience",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I75WqXtbA3FmZKoieo7YSw"
  },
  "PVkKM-iaXfdQmwSKa_-kZg": {
    "date": "11/10/2017",
    "text": "I ordered the special lamb with salad, and added a plain small bread to go with it. It's great to have two kebabs prepared with very different types of lamb for the contrast. There is chili sauce and chili powder (neither is very spicy) if you want to give it a bit of a kick. It came with an Iranian version of tzatziki, which went well with anything: the bread, the salad, or the lamb. Despite them calling it a \"small\" bread, it is huge - much too large for one person, but I can't complain as they're only charging £2 for it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1UHNug8lc1sIWpXXMti40w",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1UHNug8lc1sIWpXXMti40w/o.jpg"
      }
    ],
    "user_id": "0oD7hL4ie7_cwB9gWn8AVA"
  },
  "PRhsovLXJdeILhJtUuE1kQ": {
    "date": "8/3/2018",
    "text": "The kebabs and freshly baked breads are delicious! Friendly service and BYO. Love this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TErR9_OmU34G3EjuuZn8bg",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TErR9_OmU34G3EjuuZn8bg/o.jpg"
      }
    ],
    "user_id": "6OorueYqNUbrn8oK1ieR_g"
  },
  "54dK5FYSspLeyKyzXxRR1A": {
    "date": "6/16/2017",
    "text": "We've been able to come here every time we visit London, and each time we leave more charmed than the previous one.  This is a tiny, family-run, artisanal hole in the wall, with a warm, welcoming and expert staff.  The food is incredible, simple and inexpensive.  Come ready to wait for your very tiny table in the crowded space, and to be blown away by the flavors!!2017 update: they are still as awesome, and they treat customers so well!! Favorite place in London, this tiny Persian enclave!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m8tS0g-YWGGJYTBRm0dr3A",
        "caption": "Photo of Patogh - London, United Kingdom. I recommend the houmous and the Special lamb kebobs.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m8tS0g-YWGGJYTBRm0dr3A/o.jpg"
      }
    ],
    "user_id": "Nfj4KjMLhRCsl8v6RVpmLg"
  },
  "f35jMyZG2rl7RXZ8KMFfTQ": {
    "date": "3/17/2018",
    "text": "My boyfriend and I were looking for a new cuisine to try (I don't get much ethnic food where I live, sadly) and found this place. It's a tiny front so you might have to wait but it's worth it. We ordered the special lamb and the lamb kebab. It was delicious. I haven't had lamb in a long time and it reminded me why I loved it so much. When we sat down, they gave us hummus and giant bread to start, on the house. It was yummy! We couldn't finish the bread but I would have if I could! Our dishes were delicious, of course! It's a no-nonsense place and we loved it. I'd definitely go back when I go back to London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONdIhFmVruuTFYcTzi0y7A"
  },
  "SxKJros04Ph1lEAeeYQzXA": {
    "date": "4/1/2016",
    "text": "This place is quite authentic. I had the chicken with rice saffron. We also had a mix of starters including hummus and mint yogurt. The food is good and cheap. It was a bit outside my usual place of eating as it is a very rustic place and tight.We ordered a small bread and they gave us a large one without additional cost. The service is is friendly.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6Hd0R2QpeA3AGpaJHYDjzQ",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Hd0R2QpeA3AGpaJHYDjzQ/o.jpg"
      },
      {
        "img_id": "n8VWWPQ6ZMNykBw_Alfqfg",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n8VWWPQ6ZMNykBw_Alfqfg/o.jpg"
      },
      {
        "img_id": "X-UiNSCYS8Tk3nmX_msiWQ",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X-UiNSCYS8Tk3nmX_msiWQ/o.jpg"
      }
    ],
    "user_id": "pMxAeLHIklIgwyJ_gDdBCw"
  },
  "xlijRBZ5cN1cdNS9-R7kTg": {
    "date": "10/9/2017",
    "text": "Excellent kabab and hummus in this  charming tiny restaurant with warm, kind service. Can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K104KcyiCkz4fnYsMBDN8w",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K104KcyiCkz4fnYsMBDN8w/o.jpg"
      }
    ],
    "user_id": "4Yo3rl6V6boAG0ExZfWOrA"
  },
  "iqDmvbZ-p7cOZx-CKH8eAA": {
    "date": "12/20/2016",
    "text": "Excellent food and service as usual. I have been coming to this restaurant for many years and lately with family only. Food is simple but tasty and staff are friendly/helpful. Mince lamb with bread is recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RsKuJAMeGA2Nw4wQIsuH8Q",
        "caption": "Photo of Patogh - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RsKuJAMeGA2Nw4wQIsuH8Q/o.jpg"
      },
      {
        "img_id": "ofBBvQ8y51qXhBYn8b4stw",
        "caption": "Photo of Patogh - London, United Kingdom. Lamb mince kebab on clay oven bread with salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ofBBvQ8y51qXhBYn8b4stw/o.jpg"
      },
      {
        "img_id": "eKYgVxhSkBCKW6I6HQe4ow",
        "caption": "Photo of Patogh - London, United Kingdom. Chicken mine kebab on clay oven bread with salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eKYgVxhSkBCKW6I6HQe4ow/o.jpg"
      }
    ],
    "user_id": "384x6w4fBvCKKqbhjGDhSg"
  },
  "yEWzKQo6dqgbBWPkami_wA": {
    "date": "10/16/2017",
    "text": "My family and I have visited London a few years ago and we tried Patogh. It was absolutely delicious. Patogh was one of the best memories of London! Everything, from the bread to the meat to the drinks, was perfect. As a half Persian, I have tried Persian restaurants in Los Angeles and Paris too, but this was by far the best. I can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRwbhU9-XnoaJwHK1zdwwA"
  },
  "rHS3IbFMO2zVsdPDzMLbLA": {
    "date": "9/23/2017",
    "text": "Awesome place...Big dishes, more than fair prices, really tasty!Good qbd quick service!Not luxury but we were not expecting it anyway!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ziXOkBpYh-hOPBLEFTGyuQ"
  },
  "BE68HP-nwcx5MK-G0RHONg": {
    "date": "7/30/2016",
    "text": "It was great!!!!!! :)I love the Boneless Chicken with the rice  you should put the cinnamon on the rice as well as the salt. I visit London from the U.S so it is so exciting to taste food like this!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RiOp14rejJ7epfy3q-Lmdw",
        "caption": "Photo of Patogh - London, United Kingdom. I ate it sooooooo fast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RiOp14rejJ7epfy3q-Lmdw/o.jpg"
      }
    ],
    "user_id": "fBwhj66Sf_AJPMacz-sUXg"
  },
  "Ll3BBPasWKnxEs8dwpicAQ": {
    "date": "8/2/2017",
    "text": "As soon as I landed in London, my Uncle and Aunt kept raving about this place. Honestly, I was not expecting it to be as good as it was. I only had two hours to eat here and wish I had gone on a day where I had more time because this food is hands down DELICIOUS. Get the chicken and get the lamb. Just get everything! I cannot wait to go back in a few months to get another dose of this tiny little gem that has so much to offer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUil7LbX8h_PsZG-5uytxA"
  },
  "MpoChX8kod-S92TU2MQjPw": {
    "date": "9/22/2016",
    "text": "Nice Iranian restaurant. The food was good, plentiful, and well priced. The place is nice and homely--and very unpretentious.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vdkwsVYGO0pWc8ki-tDy9w",
        "caption": "Photo of Patogh - London, United Kingdom. Minced lamb",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vdkwsVYGO0pWc8ki-tDy9w/o.jpg"
      }
    ],
    "user_id": "XIUR196G_soVJV0srs-VlQ"
  },
  "-dX6j-plhMbseGrQ2WWRwg": {
    "date": "11/25/2017",
    "text": "I tried this place twice. I want to like it because everyone raves about it and its reviews are stellar. But i cannot get myself to give it any higher than a 3. The first time I ordered half a chicken with rice. The chicken was burnt.  Given that burnt meat causes cancer, this is really not acceptable. People said give it another try. I did. The 2nd time I ordered lamb special with bread. Again meat either not cooked properly or burnt and wrapped in bread that became disgustingly soggy. People have such poor taste in food I tell you, its mind boggling.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qoVOmSLRkQ9v-IkxVrktQ"
  },
  "_AS2IJb4JVzh1x21AcofRQ": {
    "date": "10/28/2015",
    "text": "Small and slightly cramped downstairs but portions were huge. Ordered humus and a fresh bread. They gave me a free salad too! The humus and salad were underseasoned if I'm honest. The bread though. Oh my days. Best bread ever. Also twice the size of my head. It arrived glistening with butter, thin and crispy in parts. I will dream about this bread. The fellas next to me had the chicken, which looked equally sublime. I can't wait to come back and try the meat. Oh and the mint yoghurt drink was refreshing and salty. This place is a treat!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MmpSqOGA_FKDJVkg-WzbkQ",
        "caption": "Photo of Patogh - London, United Kingdom. The biggest flatbread in the world.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MmpSqOGA_FKDJVkg-WzbkQ/o.jpg"
      }
    ],
    "user_id": "wVXje5_qclPCKXlJcy-ysQ"
  },
  "uOh5AnaHWgWC0ok6pRcaXw": {
    "date": "4/28/2017",
    "text": "The kababs here are more like Turkish kabab - just grilled meats but no saffron or persian flavors. Iranians will be disappointed. Bread was nice though. Cash only is annoying too.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-1GOFB7Wnp4bQs9AxPCXWA"
  },
  "aGi-N2zDZUcyAMxcf2BCaA": {
    "date": "8/15/2013",
    "text": "This place is tiny and is cash only and BYOB, so be ready for both. That being said, the food was fantastic. Sizeable portions for very low prices, and good service especially considering how busy it was.My wife and I shared #20 (some stewed lamb dish with saffron rice) and #12 (minced chicken kebab with pita). The chicken was seasoned beautifully and cooked on the grill in the tiny open kitchen. The stewed lamb was beautifully tender and tasty. Definitely worth checking out.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DmEL7a7d7V-ToZzfb_HZdQ",
        "caption": "Photo of Patogh - London, United Kingdom. Minced Chicken #12",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DmEL7a7d7V-ToZzfb_HZdQ/o.jpg"
      },
      {
        "img_id": "s0lJmWiaCEQDg9s9QN96bg",
        "caption": "Photo of Patogh - London, United Kingdom. #20 stewed lamb dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s0lJmWiaCEQDg9s9QN96bg/o.jpg"
      }
    ],
    "user_id": "TE5gASH_J3l6do8cbSU1aQ"
  },
  "uotINwkkDlmegR2K78z6Lw": {
    "date": "1/14/2017",
    "text": "Really had high exceptions for this place given the reviews. We did take out. Small place, nice staff.  The food just really had no flavor.  The hummus don't waste your money, tastes like washed out chick peas.  The bread as ok, but not as good as others have mentioned.  The chicken kebob which most places ace, was not flavorful at all, the roasted tomatoes were good, the rice was bland, the minced chicken smelled bad and just didn't taste good. Roasted chicken wings were the only thing we go that had a bit of flavor.  I'll give this place another try but not anytime soon with so many other places around Edgeware Road.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a_BJ4NvqN-vX2ZE0WxazaQ"
  }
}