{
  "z1zGyj08dhdIG1zsEU1Ryw": {
    "date": "4/20/2012",
    "text": "B was meeting up with her old Uni pals and Bermondsey Street seemed to be the idea place for everyone to congregate without too much transport fuss. A noon meet up was a little bit early for a full blow lunch so the search was on for a suitable brunch spot and after a bit of a google it was decided that Village East would fit the bill. Despite my many wanderings up and down Bermondsey Street I had never paid much attention to this place and was pleasantly surprised when we entered. Lots of exposed brick, wooden floors and designer furnishings make this a deceptively large place which is very easy on the eye. We had a table for five near the entrance which was light, bright and good for a spot of people watching. Our very friendly Irish waitress was chatty and very efficient. Menus soon arrived and a waiter had our glasses filled with water before we had time to even think about drinks; I suspect dehydration may be a problem for many weekend customers at Village East as the waiter seemed to spend most of the brunch session wandering round with his water jug regularly topping up glasses. I'm a bit of late convert to the delights of the Bloody Mary but I am making up for lost time with a vengeance so it was a very well made Village Mary for me while everyone else stuck to coffee. The ladies all went down the traditional breakfast route while I followed Tory Boy's lead and ordered the burger (worried about food envy yet again) which came in just shy of £15. Our orders arrived pretty quickly and the chatter soon died down as we tucked in. Perhaps I have spoilt recently by too many top notch burgers as this one, while being fine did not quite hit the spot  possibly due to a lack of seasoning and the quality of the beef. The ladies seemed well pleased with their breakfast selections although there was a bit of a grumble about the fried eggs: one over cooked while another was very undercooked. After more chat and a browse through the plentiful supply of papers we were ready for an afternoon stroll along the Thames. If you are after brunch in the London Bridge area you could do worse than Village East  what the food lacks the staff make up for with their very friendly service.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2ReJdpDEu2ezR5ygwj-IRA": {
    "date": "12/3/2008",
    "text": "I live nowhere near Bermondsey Street so sadly, Village East will not become a local of mine.  But a recent Saturday night spent there made me so nostalgic for NYC that I may need to make VE a regular just to get my fix.  The exposed brick space is varied layers of bar, lounge and dining areas, all mixed in with wood, metal and hanging lights.  It's so spread out (both horizontally and vertically) that I'm sure I didn't see half of it, and - at least on this particular packed night - there was a buzz in every corner.  A group of us had drinks followed by a late dinner of simple steaks and burgers - not exceptional, but perfectly satisfying.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "bv_rqij_qmgUkDwwjToCbQ": {
    "date": "3/18/2010",
    "text": "I've had two wonderful meals here in the last month. The food is delicious, fresh and nicely prepared. Also, it's the best mojito I've had in ages. It's a great spot for something special, meeting up with mates who like a lively vibe because you can stay in the bar area, and they do a great lunchtime which can just ooze on into the afternoon. Worth a second glance in a city the size of London",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "f2nnhdPqeNsQvy81zx1fUQ": {
    "date": "6/3/2009",
    "text": "Now this is a place that is just up the road from me and I always avoided it thinking it soulless and pricey. How wrong I was. Not only is it not overpriced but it feels like you are in your cool NYC friends apartment. The food is excellent, oh and I recommend a pitcher of Virgin Mary to start that slow post big night brunch. P.s. I almost didnt write this review cos I wanted to keep it secret.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "17UCt2DSueWhxxcUx28Aug": {
    "date": "11/2/2008",
    "text": "Just on Bermondsey Street, this is a great venue if you need to hire a room for work meetings. It also looked to be a really good place for lunch too, but we didn't stay long enough for that! We were here for a morning meeting and used the room downstairs. It was small but kitted out really nicely with a lovely big table and wooden chairs, and there's a nice screen for those all important presentations. The only food we sampled was the breakfast pastries, which although very unhealthy and definitely not good for the fitness regime, were absolutely amazing  still warm and some of them stuffed with cinnamon, what more could a girl want! Sister to the Garrison public house up the road, this is a lovely venue and I'll definitely be coming back to sample more of their food.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "h1r6YVzU-9YEjSnN3LHtig": {
    "date": "9/10/2008",
    "text": "You're in safe hands here with the both the bar, and their fantastic cocktail making skills, and the kitchen no matter what time of day you're after something to eat (Sunday brunch is as good as Saturday dinner)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CwFDM2DN9gG506bF9InQw"
  },
  "iK-jTg9E5YtGj0zXackWFA": {
    "date": "11/1/2007",
    "text": "I have been to this restaurant 2 or 3 times to eat and many more for drinks. The vibe and atmosphere is great- very modern with great decor and friendly and efficient hosts/hostesses and waitrons. The food is always good and quite varied, although it is slightly more expensive than some of the other good restaurants in the area. Nevertheless it is definitely worth visiting for an occasion. I tend to go more often for drinks before I head out for dinner elsewhere. There is normally space in the lovely bar and the cocktails are to die for. I always go for a gin based cocktail with raspberry and cucumber. Ok, it sounds a bit weird but it has such subtle flavours that I can't get myself to order anything else each time I go!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "J08ESziskKgbgoJXE7hf7Q": {
    "date": "9/13/2009",
    "text": "We went here for Sunday Lunch, we had originally tried the Garrison just up the road but that was packed out. Village East was busy but they fit us in. On first thoughts I was concerned that it was a bit too formal atmosphere for a Sunday lunch as has an evening dinner look when you walk in. However, when we walked into the back it was a nice spacious, bright, laid back room with wooden seats and tables. The menu is really imaginative, a range of dishes for all tastes, immediately I realise I could eat everything. There is a good offer of two courses for £14.95 as well on a Sunday. It is a Sunday so I'm craving a roast dinner and opt for the slow roasted leg of lamb. It comes with roast potatoes, yorkshire pudding, carrots, green beans and mint sauce on the side. This is truly one of the best roast dinners I have had outside of my own kitchen. The lamb is tender and delicious, the vegetables taste fresh and are cooked to perfection. I'm not a fan of Yorkshire puddings but this homemade yorkshire was divine. Originally we set out to just have one course, however, the dessert menu lands on our table and we can not resist. After much deliberation I go for the Summer Berry Trifle, it is out of this world, absolutely delicious and wish I could have another! The staff here are extremely friendly and very organised. They have a number of cocktails on the menu as well which looked great to accompany an evening meal. All round a great place and will definitely be coming back.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "k3qxoz83YuulcJO6FE2rNQ": {
    "date": "4/24/2008",
    "text": "The interior of this place is pucka mucka. It's got two bar areas, two dining areas, an open kitchen and a private dining room. get them, a dining room! One of the bar areas has cool leather sofas, a U shaped bar and is pretty chilled. The other bar does have some cool seating but its a bit more standy, as in people stand.around the massive porcelain bar (a bit like a bog but a lot nicer), there's lots of wooden touches and clever finishes with the exposed vents, tinted mirrors, the lighting and floating music which is never too loud. Its pretty much the only place in the whole area that you can get a decent cocktailin fact its one of the few places you can get a decent drink. Great wine list too. Bar staff are extremely professional, you won't have to wait like a mug for a drink if its busy. Clientelle are very cool, lots of different folk, post-work in the area people, lots of locals, not too trendy, not stuffy at all. The restaurant itself is in two area either side of the kitchen, one area is pretty slick and takes on the the vibe of the rest of the place, the other is bit more low-fi like their other place The Garrison. Food is high quality gastro, it's not that cheap but its no worse than any other top London restaurantand most importantly, food is always delicious. Service is solid. And the wallpaper in the toilets is worth a visit on its own, you always tend to spend a few minutes longer in there than you normally wouldunless you like hanging out in bogs generallyin which case I probably wouldn't advise going to Village East, its an eatery you sicko not a cottage-fest! Is this a normal kind of review? Probably not, but people should make their reviews more like this. Who am I talking to?",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "t5h3HUpGE0sQbAy1XfMj2g": {
    "date": "2/25/2013",
    "text": "One of my favourite locals. Have been coming here regularly for three years and never tire of the place. Menu changes regularly, wonderful, friendly staff and managers and some great cocktails. Splash out on the chateaubriand, it's worth it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6vrVCJet6SzUuPai4w1mQ"
  },
  "aNb9Sfo4ptjab4uwBogfmw": {
    "date": "5/30/2013",
    "text": "I went back to East Village last Saturday to meet a few of my Chilean friends returning from a trip. It was pleasantly busy and buzzing, the staff at the door were friendly and welcomed us upon arrival. It was a good start until we realised that the staff are constantly gossiping and talking horrible things about the customers, some of the things we overheard were truly appalling. However, when it came to the service at the bar (the one up the small stairs), that was slow and quite rude. The bartender served another 2 customers while serving us, then miscalculated the amount due and did not say please or thank you once.When I went to use the bathroom, the toilets were dirty and the had dryer was not working  despite it only being 9 pm. I thought it would be a good idea to let one of the staff members know about the hand dryer, but the girl I spoke to just said  oh I see, that happens.We did decide to get some food  the dishes were tasty, even if slightly overpriced for what they were. The drinks (we had some cocktails and Negronis  were delicious!). But as we sat at a strangely placed table, we constantly overheard the staff saying horrible things about customers and openly giving an attitude to those they deemed to be as they said 'cheap'. It got quite nasty, so we left because we were aware that probably we will be subject of gossip as well. Shocking staff attitude!",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8HQ8_2jn9SJwEWVm_DnCmg": {
    "date": "11/23/2014",
    "text": "Very disappointed in the service.  After spending almost £300 at this pub, our group had a friend trying to enter the bar to meet us (it was late, cold and raining).  The manager Kelsie would not let her into the bar just to wait with us as we paid/got our coats because it closing time. I don't appreciate the way this type of establishment treats its customers.  It was completely rude and unnecessary.  Will not be returning.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jE3r2qH6ulA-HVWyRzcs1w"
  },
  "QsCUnBKL5IenX2fItOPsqA": {
    "date": "6/30/2012",
    "text": "The pork cheeks and the lamb neck are unbeatable, but the hamburger was a bit dry--maybe because the waiter forgot to ask what temperature I prefer.  Great little restaurant in a great area.  Within walking distance to both London Bridge and Tower Bridge.  The service is squarely four-star.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MCZdOHixx2U3VcXm5ug31Q"
  },
  "zozfj8GUcBYD6jn59FRweQ": {
    "date": "8/19/2010",
    "text": "For pictures please refer tohungryinlondon.com/2010/…  We were actually trying to go to Zucca but they could not fit us in, so we ended up eating at Village East, a trendy cocktail bar/restaurant roughly opposite Zucca on Bermondsey Street. I like going there for cocktails actually, they do unusual combination with herbs (e.g. thyme, sage) and I love their gingerbread old fashioned. I had never eaten there before so it seemed a good idea to give it a try. Can I just say  the best thing about this whole dinner experience was the service. They were very friendly. They brought me the wrong starter, they did not tell us about the specials and we waited for about 15 minutes for our bill but they were still the best thing by far. Especially as they agreed on accepting our taste London card (50% off food). The whole place seemed strangely soulless and the food was expensive and not good. We started with a small portion of the Village Summer Salad (6.6). A few leaves of tasteless green salad were decorated with a blob of equally tasteless ricotta. There also were some lonely pomegranate seeds and an even more lonely single spear of asparagus. I could not detect any kind of dressing, after I put loads of salt on it was maybe not that healthy anymore but at least we could eat it. Considering that this salad costs nearly 7 pounds it just went straight to the top of my 'worst salads I have ever eaten' list. The other starter, Fig & gorgonzola salad (6.6.) was marginally better in comparison, at least it was not completely insipid (thanks gorgonzola!). But it was by no means a good starter either, they were too stingy on the figs and again I could have done with some kind of dressing. This meal did not start well and it continued to spiral downwards from there. The Black bream fillet (15.9) was maybe the best dish of them all. Having said this, it was overcooked and lacked any sophisticated flavours. The sepia ink around the plate looked cool (the presentation was in general really quite good) but did not add anything to the dish and together with the quite rustic potatoes it all seemed quite random. The real disaster came in the form of veal escalope (17.2). I mean 17 pounds!! For a bland piece of meat with the texture of a shoe sole lying on beans that might be nice if you got them as part of your fry up in the morning when you have a really bad hangover. They should however not be anywhere close to a dish that claims to be part of a 'modern and intelligent' cuisine. And what did they think in putting this celeriac mayonnaise thing on top? I mean really, who makes up these recipes? Apparently someone who should not have become a chef We would have been so annoyed if we had paid full price for the food. Cafe Luc in comparison, where I just ate a couple of days ago and which falls in a similar price category, is million times better and you get what you pay for. I always wondered why Village East was on Toptable (40% off) and Taste London (50% off)  now I know. No one would ever go there otherwise. For me, even for a quarter of the price, I want to enjoy my food. Village East is a waste of money, time and calories.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VpxTV8h0k0sRQBqa663cSg": {
    "date": "3/27/2013",
    "text": "Nice restaurant with quite classy overall feel and comfortable tables. Their menu is long enough but some of the prices are outrageous. I guess that's normal for a restaurant at that location but I still don't like it. Anyway, the place is good and if you're in the look of a quality dinner, this is your place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PrzT6RVYmx8gg1l-jz8P7Q": {
    "date": "4/15/2009",
    "text": "Brunch with a side of snob! To quote my hero Eddy from Ab Fab  ''You can drop the attitude. You only work in a shop.''  Since Bermondsey Street became one of London 'hippest' streets, the staff at most of the oh-so-trendy eateries do feel they can look down on you in your Sunday morning slob attire. Look I only want pancakes, this isn't The Ivy! We have all too frequently gotten waiter attitude and been left standing at the door of this place, even with lots of vacant tables. I agree with the previous reviewers, The Village East is a really cool place to hit for drinks and I love the industrial interior, reminds me of my ex-apartment in the area. It even gets extra brownie points in my book because they used to host Huddle's Drink Tank, a social networking event for start-ups. But unforgivably, on the weekend when all you want is comfort brunch, you get snotty, I've so above you, waiter attitude.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "In9N4Dkz458ENJp9yan9Bg": {
    "date": "8/6/2011",
    "text": "Went here with the fiance for a nice dinner.  Made a reservation online and we were off.  Showed up, were seated immediately at a nice boot table near the kitchen.  For an app, we had the seared tuna to split.  The portion was the only thing bad about this choice.  There were 3 very thin pieces of seared ahi with a peppercorn crust  for 8 pounds.  The portion was disappointing, however the taste was not.  The tuna was seared with a peppercorn crust and drizzled with a delectable vinaigrette.  Overall, a delicious, but small app.For dinner I had the shortrib special with dumplings.  It was by far the most tender, moist shortrib that I have ever had (haven't had many, but enough to make this a substantial claim).   To drink I had a Four Roses Single Barrel bourbon which represented one of the largest bourbon selections that I've come across in town. The dumplings were delicious and accompanied by the house red wine made for a great dinner.  My fiance had the crusted sea trout which came with fennel and some smashed potaters.  This also was delicious.  Didn't have enough room for desert but ponied up to the bar for a final cocktail.  I had an old fashioned with Makers Mark and was pretty much the perfect drink.  The bartender was meticulous in the creation of the drink, taking about 5-6 minutes to make it.  It was completely worth the wait and the best old fashioned I ever had.  Definitely recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3FhlkiHcCkwdArIkSPCEg"
  },
  "aAlvdLgezL_GkUre7_Mcig": {
    "date": "7/21/2009",
    "text": "I can only speak for brunch here - it was very good!  I had the burger, which was fantastic.  My fiance had the eggs royale and they were also amazing.  It was the perfect Sunday morning in the neighborhood.I haven't made it for drinks yet, but every time I walk by it seems like it is a lot of fun.  Has been recommended to me many times.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlxIt6MeEcBqqhWdEMsuOw"
  },
  "MhwDQJPzmC7FUbPDHvqwcw": {
    "date": "1/3/2012",
    "text": "This is one of my favourite places for drinks and dinner.  Two cool bars, good selection of drinks and cocktails.  Restaurant is excellent.  Always great specials (they go quickly so place your order as soon as you sit down).  Food is always fresh, delicious and perfectly cooked.  Fish and meat equally good.  Brilliant wine list.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UglmPVorcPvq1IIDLuefFg"
  },
  "UjEW6Ankc275au7ndwQ9Qg": {
    "date": "2/11/2010",
    "text": "Panfried Halibut was amazing. Dark & Stormy cocktail, also amazing.Really great place: defo date night venue, or gabbing/eating/drinking with friends.Entrees will set you back about £17, cocktails £7",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3idgX-PvIIU841rhXlQiKA"
  },
  "FJwCQssO1FN1K-M2afReyQ": {
    "date": "11/7/2008",
    "text": "The decision to try out this bar that I had never seen or heard of was down to my boyfriend on the grounds that the website looked cool and described itself as \"New York warehouse style\". It was more the design and décor than anything else that we fell in love with but by the end of a night there we were ready to put in an offer on buying the bar to live in.Village East is totally in keeping with the edgy, modern, industrial feel of SE1. Split into a bar and restaurant areas it has a really intimate feel. The restaurant has a huge selection of mouth watering fish, seafood and meat dishes to choose from, drinks and cocktails are perfect and all the staff professional but friendly.Sadly nothing came of our plan to move in but we will definitely keep drinking here and living in hope that one day it could be ours.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0PEVy4If8FJh3xP4DNppxQ",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0PEVy4If8FJh3xP4DNppxQ/o.jpg"
      }
    ],
    "user_id": "JY9GzXCZn4OVMqg07Wql2g"
  },
  "FWIo3s3FbFpJuCf5ngsuLQ": {
    "date": "4/16/2011",
    "text": "Good atmosphere and nice wines on the list.  However, i ordered chicken satay and the kebab sticks were so cheap that they had splintered in the meat. Also the cocktail sausages have lots of gristle....only go there for drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqnj3tF6Pe-9Ss4ahO3tug"
  },
  "Wqu4zR38dppeCPqNx0UI_Q": {
    "date": "11/1/2013",
    "text": "I really, really liked this place. The service was good, the food was good, the atmosphere is great EXCEPT...it smells like a sewer. You walk in the front door and it hits you. It's worse in the bar area (which makes sense as that's where the staircase to the downstairs loos is located). If you sit against the far wall in the lounge, it's not too bad, but you still catch a whiff now and then. We went three nights in a row (staying just across the street) and it was the same story each time. We kept going back because it's otherwise a great place for a relaxing drink and bite at the end of a busy day.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayUu0niv5b9dW_TQ6aiGlQ"
  },
  "yev6Osba0tO37jmUUeNGRQ": {
    "date": "1/22/2010",
    "text": "When I first went to this bar, I was blown away by the meticulous manner in which they made their drinks. It became one of my favourite bars in London right away.  Little did I know that I would move in the area and this bar has now become one of my everyday bars.  There is great food there and I discovered the magic that is a slow stirred Old Fashioned drink.  I highly recommend this place",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MxrjSqyZe2IjDZwXxIT9rA"
  },
  "HxGzI6V3z03PgkFtgqJV8w": {
    "date": "9/25/2008",
    "text": "Oooh Village East, you spoil us! I came here last night for a wonderful dinner with the Webjam team. (Webjam was founded over several dinners in Village East so it's clearly quite special.) I can see why now. Tucked away on a street you'd be forgiven for walking past (I did, got quite lost) when i finally found it, I was greeted by a lovely lady and a really pretty bar. We had dinner in the private room downstairs, not before being led through the entire restaurant (past the open kitchen) and feeling like we were much more important than we really are. nice. Dinner was amazing. I had a few problems with the starter - I asked the waiter if the veal was free range (picky i know) and he forgot to check. When he did check, he couldn't tell me and thought it 'might be organic'. Not the same thing. He then said 'but it's tastes really nice' and i know he was trying to help but it really didn't so i had a lovely Ham hock terrine instead. Everyone seemed to have steak for main which was really brilliant. Perfectly cooked and as it's quite a posh place, i was expecting it to be much smaller. The sides as well mean that a main dish creeps up to about £20, which is a lot, but the food is great. The wine was good, the desserts were brilliant (I managed to have truffles, chocolate fondant AND a tiramisa martini so i can definately comment on how good these are!) I'm never convinced by private rooms in restaurants, and I know it's sensible if there's such a huge group, but other than the bar, I'm not really able to comment on the 'vibe' of the place. I seemed fun though. I like it here. I'm not sure the service was that good - I thought it was a bit slow - in the bar and while we were eating, but I guess there was a lot of us so it's not a huge issue. They do cheaper lunch menus if the a la carte is too pricey and hopefully i'll be back here soon. I really like village east.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yL-XPMh8_xF8eZxFi5EFiQ": {
    "date": "11/15/2008",
    "text": "I had my birthday party is Village East this year and it was a great venue. The reservation for group service was free of charge and the service of the staff were fantastic. They were arrange and getting people out of the area which I had booked and trying to reserve sufficient space as more of my guests arrived for the party. I had dinner there as well before the drinks. The food was reasonably price; however was a bit disappointing in terms of taste. It was generally a bit salty. Drinks was great and the setting offered a great place for friends to gather and chat. Some of my friends went outside at the entrance for fresh air and it was quite pleasant as wellOn the whole, I would recommend this place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FhYM3BXOivEaIrJXldcc5Q": {
    "date": "4/2/2008",
    "text": "This restaurant is 5 minutes from my office and is used by all staff from the President down. The lunches are great value. They have a different set menu every day - 2 courses for £12 and the main courses are substantial! The staff are also incredibly friendly. This is also a great venue for drinks in the evening and it's really buzzy on a Friday. The bar is separate to the dining area so you can start the evening with a few drinks and then grab a table for dinner. Get there early if you want to get a seat though!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vjBiRvzur1BubDWaPn4bqw": {
    "date": "1/7/2011",
    "text": "I enjoyed a really delicious meal here, I thought the standard of preparation was very high as was the presentation. The pork belly I had for a starter wasn't the best - a little tough, but overall I really enjoyed the food. I really liked that there was a cloakroom and someone to take your coats, I'd agree with comments that the place is upmarket but not too posh. The decor is nice, you can tell they are trying to create a certain ambience and it's a bit edgy. The lampshades seemed quite 1970s to me and a bit out of place, but some people might like that. I thought the tables were a little close together, which means it isn't great for an intimate meal. Also the toilets could do with some sprucing up. The one thing that put me off was the waiting staff, they were kind of hanging around quite close to our table and chatting or they were chatting loudly in another area or they were staring waiting for us to choose our food. I felt a bit uncomfortable, but this could just be me being paranoid/grumpy (I have given this a 4 rating) or because we had taken a really early booking and the restaurant was very quiet. One other thing, the table wasn't ready when we arrived and no-one told us what to do. Gave us the chance to have a cocktail though and that was great.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oACmBODoXZgL0s0uFGqE0A": {
    "date": "10/7/2010",
    "text": "Good hidden away restaurant!! The London restaurant festival menu was a good bargain. The a la carte looks delicious with a bit of Asian/Chinese fusion, worth a try too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PpCBNBY1ZDGkbZ9QfLoUbw"
  },
  "O2nYC_Iv_62eFz-sfXtZzA": {
    "date": "6/10/2011",
    "text": "Village East is a trendy and hip urban bar and restaurant in Bermondsey. Nice selection of beers on tap. Food and service was great. My friend really enjoyed his burger (which I believe comes with some foie gras), and my steak bavette was perfectly cooked. I got there around 9pm on a Thursday and the place was definitley happening. Really liked the venue---it has almost a Manhattan warehouse feel to it. The only real con was that the back dining room was quite smokey...clearly they need to invest a bit more in kitchen ventilation. I also agree with teresa L---the kitchen seems to run out of items early on in the night. Other than those 2 items, I would highly recommend Village East.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "25QrDDjff5TUtTBrhZFBwA": {
    "date": "4/30/2012",
    "text": "The sort of place that becomes your happy place instantly, and if you come here often enough you may never want to go elsewhere.The food is okay - pretty good. The warehouse feel and location makes it quite awesome.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qLZrf-VWxNfDjT2aeClnjQ"
  },
  "7KyGwVEKW1ET90XogVkfcA": {
    "date": "6/1/2012",
    "text": "The ambience of this place is just to my liking, but unfortunately the incredibly slow service (like, 3 hours slow) and lack of lunch menu brought down the points. Their cocktail menu was impressive and I think I would really like the brunch here, but it ends at 2 p.m. and we had just missed it, so we were stuck with the lunch/dinner menu that is mainly hearty meals or expensive burgers/sandwiches. -Foie gras burger: pricey but delicious. Definitely share-able.-Club sandwich: pretty standard. Overpriced for what it is.-Salads had generous portions and good flavor, but nothing amazing.-Chocolate dessert was overcooked and disappointingI'm hoping if I return I have a better experience as the place looks like it has so much potential. Could've just been bad timing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "A2V6Fpj68mJkhvU6XDnOxQ": {
    "date": "6/26/2012",
    "text": "I was going to give VE two or three stars, and then I realized it might just be me, this is probably just not my kind of place. Whatever this place is doing, it's doing it well, I guess. I thought it was hilarious that the bartenders actually flip and spin the bottles like actors in Cocktail! When I ordered a martini the bartender actually did a weird little dance while shaking the shaker from one shoulder to the other, super-serious look on his face.  It was ridiculous!! (not to mention my confusion on why he defaulted to shaking a martini, did he not know better?)In short, there's nothing really 'wrong' with this place, if cold, urban hipster is your thing.  VE does it well enough. VE gets four stars from me for the sake of diplomacy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXwaukrgku-kAE3wUnh-Zw"
  },
  "yyhI7cIV1jxXpW-2e-YAjA": {
    "date": "12/16/2013",
    "text": "Ok I have to say I am so loving the brunch here!! We started off with mimosas and Bloody Mary's, which were strong and def started me off with a nice buzz. I had the eggs with the turkey hash, and that has to be one of my favorite dishes ever. EVER!   My hubby had eggs Benedict, which were tasty but as soon as he had a bite of mine, he tried to steal my dish as well. Coming back very soon!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "cTzfYz5-DbgJ2ZQFcMIJJA": {
    "date": "12/30/2008",
    "text": "Village East is definitely one of my favourite restaurants in London. Located on the uber cool Bermondsey Street I would probably come here around 3 times a month when I lived in the area. The staff really get to know your face and what drink or food you like which adds a lovely personal touch. The decor is cool and simple; lots of brick with funky lighting and different spaces and loungy corners for those that just want to have a drink. The last time I visited was a Wednesday evening and the place was packed yet they still managed to accommodate my friend and I despite not booking. The atmosphere in the bars was buzzing and the food was delicious. Indeed I have moved but Village East is a good reason for me to visit SE1 from time to time!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UyypqkcOFKhKecshaIszow",
        "caption": "Photo of Village East - London, United Kingdom. Image courtesy of Village East website",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UyypqkcOFKhKecshaIszow/o.jpg"
      },
      {
        "img_id": "SY8RgCwBNr76KejbWySZ4w",
        "caption": "Photo of Village East - London, United Kingdom. Image courtesy of Village East website",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SY8RgCwBNr76KejbWySZ4w/o.jpg"
      }
    ],
    "user_id": "0Zr3pJV4wAtLNepARHOZuA"
  },
  "M2QeMu9VYzaL2Kr-uIWy3A": {
    "date": "1/31/2010",
    "text": "This is one of my favorite places to eat and drink in London. It takes a bit of effort to get to, but it's on trendy Bermondsey Street and worth finding. The bar area mixes up original martinis and cocktails, as well as the classics. The drink menu alone is an engaging read. The bar itself is a rustic New York loft-style design. It's minimal, yet inviting. The downstairs bar is the perfect place to grab a drink while you wait for your table or friends to join you. Dining here also lends a bit of the New York feel. I would order almost everything on the menu, but I am a sucker fortheir specials and am rarely disappointed. The whole experience is good from entry to exit. The staff really takes care of you. There are rooms available for private parties and I hope someday to be hosting my birthday dinner there!",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "htvWboV46VuYPqtK5Av0dQ",
        "caption": "Photo of Village East - London, United Kingdom. Tiramisu martini -- order one for dessert!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/htvWboV46VuYPqtK5Av0dQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "pNn5cZcw7dx7Z9VWd_ZLuQ": {
    "date": "8/22/2014",
    "text": "Was in London on holiday and village east quickly became my favorite place for dinner and drinks. Only stayed in the neighborhood for a week and went there twice for dinner- the grilled cucumber whipped feta addition to the bread basket is so amazing and the vegetable parcel entree is delicately superb and filling. Would definitely recommend going to village east if you're in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgK4Z6Tcifos0oqLDsbHZA"
  },
  "ipD4PS7jhpfPtsnhw1Q4Sg": {
    "date": "8/5/2011",
    "text": "Another great find tucked away down Bermondsey street! For ages, this pub has been the landmark I use to find my friend's, Mike L, place. So I thought I'd give it a try one day for brunch with Kate P. Apologies as I'm behind in reviews so this one is an amalgamation of several visits.Brunch was pretty good and especially since we rocked up 30 minutes before they opened (we were early risers and got there at 11) but they still let us come in and sat us down with a cup of coffee for me to nurse my hangover. Definitely plus points in my book. Foodwise, the french toast was crunchy on the outside but soft and gooey with maple syrup on the inside and pretty much everything I could have asked for. Well I could have asked for more bacon but now I'm just getting greedy. The blueberries added a nice fresh tasting accompaniment for the carbolicious meal. I did have a bit of food envy at Kate's eggs royale so may have to go for those next time.On one or more of my subsequent visits, I've gone for a round or two or ten of drinks  to this quirky pub. Word of advice, book a table or at least get there early. This place gets packed as the after work crowd slowly drifts away from the office. Around 6ish, the place is empty although the bartenders are ready to go so you can order the fancier cocktails and not have to wait at the bar for long. I struck up a conversation with the LA gangs looking bartender who was a great guy. Noticing they have a couple of rye whiskeys on the shelf, I asked him if he knew how to make a Sazerac. He started interrogating me on blends, flavours, types of bitters, and a variety of other factors that go into the art of the Sazerac. I figured that anyone who knew that much probably knew what they were talking about so asked for his recommendation and made my way back with his promise to bring them over.15 minutes later, he shows up with three generous portions in brandy snifters. Aside here, a brandy snifter makes an excellent Sazerac glass as the light almost honeyed tones of the bitters and rye combined are a heady scent. Like me, my friends are not whiskey drinkers and approached the glass with trepidation. But after the first sip, they were converted just as I was after my first Sazerac in Dallas.Village East has the usual bar menus and assortments of wine, but get to know the bartender and find out what their specialties are. I'd bet you won't be disappointed. Think I'll go back tonight.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "rgC0ueqzZ33prAlsgKpv4w": {
    "date": "4/20/2012",
    "text": "B was meeting up with her old Uni pals and Bermondsey Street seemed to be the idea place for everyone to congregate without too much transport fuss. A noon meet up was a little bit early for a full blow lunch so the search was on for a suitable brunch spot and after a bit of a google it was decided that Village East would fit the bill.Despite my many wanderings up and down Bermondsey Street I had never paid much attention to this place and was pleasantly surprised when we entered. Lots of exposed brick, wooden floors and \"designer\" furnishings make this a deceptively large place which is very easy on the eye. We had a table for five near the entrance which was light, bright and good for a spot of people watching.Our very friendly Irish waitress was chatty and very efficient. Menus soon arrived and a waiter had our glasses filled with water before we had time to even think about drinks; I suspect dehydration may be a problem for many weekend customers at Village East as the waiter seemed to spend most of the brunch session wandering round with his water jug regularly topping up glasses.I'm a bit of late convert to the delights of the Bloody Mary but I am making up for lost time with a vengeance so it was a very well made Village Mary for me while everyone else stuck to coffee. The ladies all went down the traditional breakfast route while I followed Tory Boy's lead and ordered the burger (worried about food envy yet again) which came in just shy of £15.Our orders arrived pretty quickly and the chatter soon died down as we tucked in. Perhaps I have spoilt recently by too many top notch burgers as this one, while being fine did not quite hit the spot - possibly due to a lack of seasoning and the quality of the beef. The ladies seemed well pleased with their breakfast selections although there was a bit of a grumble about the fried eggs: one over cooked while another was very undercooked.After more chat and a browse through the plentiful supply of papers we were ready for an afternoon stroll along the Thames.If you are after brunch in the London Bridge area you could do worse than Village East - what the food lacks the staff make up for with their very friendly service.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rLYHrPpS6pYZq3IvsDMs3w"
  },
  "OJsjfoMTQHYsT6r2NtsBYw": {
    "date": "11/6/2011",
    "text": "Had a work night out here last week. Cool venue, friendly bar staff who didn't bat an eyelid at a huge group of office people filling their bar and acting rowdy.One thing that really impressed me was when about 10 o'clock I tried to order a round of jagerbombs for my team but they wouldn't serve them to me. They had jagermeister, they had red bull, but they don't do jagerbombs. The waiter took about five minutes to apologise and explain that they had all decided on this as a bar policy as its not really a jagerbomb type of place. Fair enough, I thought, you've got to have a system for these types of things, and nice of him to take the time to explain.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Fq6PvAiVrKfUfmAGx3RsVA": {
    "date": "12/24/2010",
    "text": "Well laid-out, this was a cozy spot to bring a small group of friends for holiday cocktails. A little far from the Tube but the walk was worth the positive atmosphere and handcrafted cocktails that ensued.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "faJOnZ2r3IzUXHU7kvm1iA"
  },
  "E1y5feFKxcDLyWgFl98oow": {
    "date": "3/16/2014",
    "text": "Really enjoyed my burger and bacon. Attentive wait staff, great food and a lovely Bloody Mary. Couldn't ask for anything more!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-BpJE5C7yiNLoJ-fq9sJ_g"
  },
  "-AeJurJiu4chfg_A6iC0AA": {
    "date": "1/25/2014",
    "text": "The building was beautiful, the brunch was ok, however the staff were very arrogant and seems to keep forgetting we were there - our juice took about 20 minutes to arrive and the food much longer! Definitely not again!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rF2naYK4ZK0mhjuxH3OLqA"
  },
  "ZWpHIQhMSfpqm3jMgOKMQw": {
    "date": "10/30/2012",
    "text": "I wish I could say I like this place. But the service was terribly slow when they were not busy at all. And the chorizo salad was not good... way too strong salad dressing. And they upsold me to get a side of chips with my salad, which I found bizarre. I will give this place another try because the others have had such good experiences, but until then, it's 2 stars.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9uf4g85B_gz2W4d_GZI-Wg"
  },
  "2XeNYPowUufL587UoYV4Aw": {
    "date": "2/15/2011",
    "text": "I came here with a co-worker on his suggestion, as it was one of his favorite places to eat when he lived in London. I can clearly see why.The restaurant has a sleek, cosmopolitan feel and the staff was very personable and helpful. The warm salad of squid, chorizo & smoked paprika was outrageously good and a definite recommendation. I thought my skate wing was prepared well and I thought it had a nice presentation.I was disappointed I wasn't able to visit here a second time on my trip, but hoping I can stop by if I ever find myself in London again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pQEcVQnEHamCC2auoNqOHw"
  },
  "ty8hPSuPuk9QYUE3sLjdBA": {
    "date": "5/1/2010",
    "text": "It seems almost criminal that 1. I'd never been to Bermondsey St before and 2. I've deprived myself of Village East until now! What was I thinking?I liked the decor of this place a lot. I felt like I was in the Meatpacking again - good memories there - so we were off to a winner. Neither of us went for the cocktails but the guys behind the bar clearly knew what they were doing. Impressive work.And the food? Incredible. Each mouthful was fantastic. I can vouch for both the venison and the ribeye... oh and the garlic mash? Hella good.I'll be back to try the pork that I spied on the table next to me!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "eibaOMDgiowslVGdpCDzQw": {
    "date": "5/8/2010",
    "text": "This place is great to go with a good group of friends for great cocktails, or if you're looking for a nice meal!The waiters are highly skilled and take pride in making their cocktails! But be prepared to wait. Or better yet, grab some dinner and get you waiter to take your cocktail orders!The food menu is seasonal, but always good. I've never been disappointed! Great service, good food, tantalizing cocktails, and with good friends, a good time for sure!Also once you're in you can stay in till after 12!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q5oTVS-XhmOzS4x7XM-F-A"
  },
  "b6edyc8GeejpGP_CSL40nw": {
    "date": "9/29/2010",
    "text": "Like HungryinLondon, we ended up here for dinner because we intended to go to Zucca, but, upon finding it was closed, went to Village East, as it was the only eating place we saw open that Sunday evening. However, I'm grateful my experience turned out to be very different than his/hers! The bar area was surprisingly packed to the hilt given it was a Sunday. Thankfully, we got a table, even if it took the friendly staff a fair amount of time to set it up. We had some difficulty figuring out what we wanted to eat, as I didn't particularly feel like having a burger, fish and chips or anything greasy and fried. Still, the options were interesting. I wasn't too sure what kind of theme they were going for as there were some Chinese-looking options on the menu, but, again, there were also burgers, steaks and other fried options. In the end, I had a chorizo and squid salad as a main. I loved the chorizo (I don't think I've ever encountered a chorizo I didn't enjoy) but the squid just seemed bland. Well, blander than usual. Still, given the limited options we had, and the state of my stomach, it wasn't too bad. I really liked the vibe of the entire bar. It's definitely very cool and trendy, and - thankfully - not posh. It's upmarket, but not offputtingly so. If I'm in the area, I'll definitely pop in and try the cocktails next time!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vt_lIJ3gqZ_Vm4p2fAqMGA"
  },
  "6SBBVbz7-kYiAvT6c6171Q": {
    "date": "4/14/2008",
    "text": "This bar/restaurant is a bit of a hidden gem in this part of town. They have the most fantastic wines, spirits and cocktails on offer and a friendly bunch to serve them. The decor is great! Good use of contemporary and retro fixtures. Definitely worth a visit!",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "vGXVWGt8h_-KTztEcKidaw",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vGXVWGt8h_-KTztEcKidaw/o.jpg"
      }
    ],
    "user_id": null
  },
  "DekpHVaqM06PTR4rCDKprw": {
    "date": "7/11/2015",
    "text": "Nice atmosphere however food is quite ordinary. Poached eggs lack the desired silky texture and tasted like they poured too much vinegar in the pot.Smoothie options try to be fancy without actually hitting the spot. Small portion leaves you craving a good solid smoothie with fruit and yoghurt. It's not that hard to make a good smoothie!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yH94sRY1i-1vLsyBuV2cQ"
  },
  "_zWgXTCGxNf2AYz2eF23QA": {
    "date": "6/30/2014",
    "text": "I've been there a couple of times for a Sunday Roast with friends and I have to say that I love this place.The location is quite cool, in the lovely Bermondsey Street, perfect for a walk if the weather is nice.The service is good, sometimes is quite pack and hard to get a table, especially if you are a big group. Is better book.The only thing is the price is a bit expensive.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OCW7PI4LumTQVpOkpQINog"
  },
  "9SNk8VgpP6o_XXwfAqPYkA": {
    "date": "4/14/2014",
    "text": "This is a gem in Bermondsey. We came here on a Sat night with a group of friends and had a blast. The place itself is really beautiful... wooden interior with a speakeasy feel. There's an open bar in the centre with a few smartly dressed bartenders constantly making drinks. They have a great cocktail menu. I wanted something chocolate-y and the bartender just made something on the spot, and it was super delicious. Definitely order as many drinks as you can because the bar gets so busy and you have to wait to get the bartenders' attention. Around the bar there are little areas to sit, and we finally found seating when it approached midnight when it was less busy. I ended the night with a fruity cocktail and really enjoyed it. It's quite close to London Bridge station so if you're out late there's lots of ways to get home from the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0uJTXAbf6Oeq4iafx6eQug",
        "caption": "Photo of Village East - London, United Kingdom. chocolate cocktail! this should be on the menu :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0uJTXAbf6Oeq4iafx6eQug/o.jpg"
      }
    ],
    "user_id": "M1Lt6xzFriw1p2fzbGIVgg"
  },
  "hRHFScn13VLIvN9Jo_6-kA": {
    "date": "2/21/2015",
    "text": "Went to the lounge (upstairs) for a drink only;Cocktail menu is limited but the bartender was eager to mix us anything we liked.So as usual asked for a Lynchburg Lemonade which was awesome!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTOXwFjdmwjC14rdUB5pgQ"
  },
  "5Ipg1PGCZUj-UHyBYlbx-A": {
    "date": "2/4/2016",
    "text": "Excellent place for a classic breakfast. The bacon was meaty and had great flavor, the scrambled eggs were moist, and the porridge was creamy and delicious. Quick, friendly service. Would definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghQjVxac6bdx0DI7jwVDSw"
  },
  "Fe_gsbTawl80blJ7af4ZLA": {
    "date": "1/18/2015",
    "text": "I liked it better before the renovation. There's a bone marrow dish on the menu now though which is really yummy.  And a salad with fennel that's really good too.Following the renovation, I think the bar area has gotten smaller or somehow has been redone so that it feels more cramped.  Also, the lighting in the dining area is terribly dim and I preferred the old table lay-out.Overall, I would suggest this as a good date spot.  It's been a while since the renovation so I really should get over the lingering sense of unease with the new set up.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QN-ltGtFDmZ0SixAX9Ik1w"
  },
  "3RSyK4-qxIvvMVKw-Bjizg": {
    "date": "5/11/2012",
    "text": "What a delight it was to enjoy the lunch time menu at VE. I had the two courses for £14 which I think to be pretty reasonable considering the delights that were on offer. I starter with a bowl of mussels drenched in a light white wine and garlic. That consumed, I followed with what I can can describe as a gorgeous rice dish, infused with saffron, though I suspect it wasn't quite of the immediate rice family but perhaps a close relative.  Atop this I had a fillet of sea-bass and sandwiched between the two, perfectly cooked mange tout, indicated by is iridescent green.I thoroughly enjoyed my Village feast and would (and will) return again soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "juhNw5w3nd2PyZ6dxsciEg",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/juhNw5w3nd2PyZ6dxsciEg/o.jpg"
      },
      {
        "img_id": "Tberyd0foJPbHXvEN8xW6Q",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tberyd0foJPbHXvEN8xW6Q/o.jpg"
      },
      {
        "img_id": "MX6NMfT0d0XHNh7HAGRiRQ",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MX6NMfT0d0XHNh7HAGRiRQ/o.jpg"
      }
    ],
    "user_id": "Pyha-8xF-Bfx27lPT1yofA"
  },
  "4hMpsueXv2jKdFV4B7FBMw": {
    "date": "12/14/2014",
    "text": "One of the most popular places in the neighborhood. We live close by and visit now and then for brunch, lunch, dinner or cocktails. The place has a very nice atmosphere and vibe to it. The service is great and friendly. Twice we have been seated at a table we didn't like and both times they accommodated our request and moved us with no issues.The food is good quality and delicious without being particularly original or dazzling. Price level is reasonable but not cheap.Cocktails are great and highly recommended of you are in the mood. They particularly serve a great old fashioned.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emc75yCGU6-znDtINMC1WQ"
  },
  "NH7New5-7bheiMijmCxvYg": {
    "date": "4/23/2014",
    "text": "Great original dishes (try the whipped cucumber + grilled pickles); the burger was to die for (make sure to add the bacon and cheese which put this over the top). Pair with a glass of the 2011 Moltepulciano.. Smooth, mild and delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PgzQeJzRacwQoDHNh8jxJg",
        "caption": "Photo of Village East - London, United Kingdom. Whipped feta with grilled cucumbers. Amazing and original! Cucumbers are briny almost like pickles.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PgzQeJzRacwQoDHNh8jxJg/o.jpg"
      },
      {
        "img_id": "KK7PV5vjdo29t0amY8APMQ",
        "caption": "Photo of Village East - London, United Kingdom. Burger with cheese + bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KK7PV5vjdo29t0amY8APMQ/o.jpg"
      }
    ],
    "user_id": "vfyeFWuU_gID3RvLCfsSyw"
  },
  "D6rLSYDJqcfJSc14XHtusg": {
    "date": "2/4/2014",
    "text": "Food was good. Ambience and decor - super cute. Good spot for a girl-date or, you know, regular date as well I suppose.There's an impressive range of cocktails and wine. I had the campfire breakfast and my friend got the lobster Benedict - both dishes were tasty and well-done. Runny egg yolk - YUM. They should come with bread though, to sop up the delicious sauces afterward. The quantities are on the smaller side, but the quality justified the prices - not that anything was unreasonably expensive anyway. However - the waiter basically implied that we were fatasses when we ordered a side dish to share. What? (We didn't even end up with that much food...) That's never happened to me before, but then again, in the US you always have the opposite problem with servers trying to foist more food on you. I was just more surprised than offended. We aren't fatasses, for the record.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMXfcEK9S4BVLYEGhyEsbQ"
  },
  "s46-dhxkQ0vq_wi1CgvUEw": {
    "date": "6/6/2013",
    "text": "Went here last night with some co-workers and fell into the oversized leather banquettes lining one wall of the upstairs bar. Do you have any friends who have an impeccable sense of style that is a certain brand of vintage, relaxed cool that would make you kill them in a fit of jealousy if they weren't so nice? That's what Village East feels like. Unfortunately, your friends don't work at Village East. We ordered a round of cocktails and then added a plates of charcuterie (£10) and cheese (£8) because that's what you do when you're with out with a group and see those things on a menu. Everyone's drinks were going down a treat when we saw a man standing near the bar with our food. One of us waved to let him know which table had ordered the nibbles and he looked away. Another person waved with a little, \"hello!\" but he didn't move a muscle. A few minutes later, he put the food on our table saying, \"I was waiting for my colleague as he had the cutlery.\" Way to make it weird, buddy. I think we could have restrained ourselves from digging in mouthfirst and making a scene if you had just come over sans knives and explained they'd arrive in a minute. Eventually we found ourselves with empty glasses so when I saw a man in an apron bussing glasses to the bar I waved, only to be told, \"I'm not service.\" Okay, fine, the bar is only a few steps away and it wasn't really a hassle to place the order for my table, but when I'm paying £8 for a cocktail, I like to feel like people are looking after me. Refilling my water glass goes a long way in my book. After the second round, we moved into the dining room. Service felt slow, but not excruciatingly so. The Marseilles shellfish stew mussels, clams, crab claw, prawns seemed bottomless. Every time I reached my fork in, I found more mussels and clams (there were also two large prawns and a small crab claw). We were all too full for dessert and didn't end up leaving until it was much too late to be out on a Tuesday. I may pop back in, at least for some design inspiration.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "ksCqKrthUj-0a82Kbrd94w": {
    "date": "10/22/2012",
    "text": "The food tastes amazing when you're drunk.Incidentally, the bar is good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "NCX7K_FXi_WnHJoUr8okcg": {
    "date": "1/25/2015",
    "text": "Had a terrible experience here. We waited 40 minutes for a table, then decided to eat at the bar, then it took 40 minutes to get our food, only to find my vegetarian breakfast had bacon bits in the spinach. I'm vegetarian so for me this is the worst thing you can do and speaks miles about their kitchen hygiene. I wasn't very impressed with the managers response either. What a shame.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LybAKIHiUjIa0TdlWGgI6Q"
  },
  "HHzKE5yV9LfH4WQrX-b93w": {
    "date": "12/27/2012",
    "text": "Quite good. Soup was tasty and worth the £5.5Bread that comes with meal was niceI had the ravioli app as a main, it wasn't special, lemon taste was overpowering. My Sis ordered the lobster which was done very well. the burger was done nicely as well, although I thought the beef was slightly on the gamey sideIt's quite hip and noisy in here, and small,Considering the price I would expect everything to be excellent in tasty ... So I'd give it like a 3.49, can't quite round up to a 4 star**note, i visited this place 2 yrs ago..not sure why it didn't get posted, but was in my incompletes **",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1NNEMOH_VNk7Amn2bgsVKQ"
  },
  "yM_Rn8L-hrPF8THdnGodgw": {
    "date": "4/21/2012",
    "text": "Great place to grab a bite to eat, even if it is a bit off the radar. Walked in the other night with a friend and had a great dinner with out any fuss.I enjoyed the relaxed, but not too cool for school atmosphere. Music wasn't alarmingly loud and the lighting was subdued, but bright enough that menus can actually be read. The server was unbelievable kind, helpful and funny, which contrasts with the cold shoulders, couldn't be bothered to crack a smile staff you often get in London. It was one of those dinners where everything worked well. We were given enough time to read the menus, but not left stranded for hours like social lepers. Suggestions and nightly specials were given, but not rammed down our throats as if the fish out back were about to turn. Everything gently flowed from one course to the next until we soon found ourselves back on the street, full, content and slowly waddling home. Well worth coming again.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FDwvqYPCK35fYpFYATStpg"
  },
  "pMU4bWKiWbDTSTYo2k0QTg": {
    "date": "8/27/2012",
    "text": "Bermondsey St. is always a pleasant surprise and Village East is one of several go to destinations on the Street (look forward to sampling some of the others in the future).All the components work for me here.A  friendly greeting at the door, shown directly to the table and the waiter who quickly comes to offer water (tap OK) and takes our drinks order.A good vibe on a Thursday night all tables packed with animated conversation and low music with a simple, modern interior and open kitchen serving area.A menu which is short enough but with lots of dishes that appeal. Starters for me, a good chopped salad, fairly simple but competent with light dressing. For mains, I tried the beef burger with foie gras and caramelised onions. Ordered medium but was well done but really good and excellent crispy chips on the side. My friends' mains were great too. No room for deserts on this visit.Competent, polite service and efficient operation that is well run and organised and a positive energised atmosphere that provides a light buzz.This was my second visit and just as good as the first. A restaurant I will come back to again when I'm looking for a reliable bet for an evening out for dinner with friends.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "ltc8dP9xxZFArJm0a1sMLw": {
    "date": "12/19/2012",
    "text": "we didn't eat in the restaurant but took advantage of the bar menu (burgers and a few other bits). the beers were quality and the wine list not too bad, £25 for a decent sav blanc.I would say the crowd left me a little wanting, fairly 'look at me' but its clearly a very popular place. packed. we ordered 4 cheddar burgers, came without cheddar and pate on top, interesting change up. sadly what had huge potential became an issue when 2 of the burgers clearly were cooked rare but we'd waited a while already so hunger took over!long story short they only charged us for 2 of the 4 and tried their best to apologise. this just avoided a 2 star speciale. probably wouldn't recommend but not too bad. peace.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "k6nDlMJ55Uy8LDI5OFAQuA": {
    "date": "11/10/2012",
    "text": "I'll never waste my time again. There are FAR too many options in this cool little area to settle for this place. \"Welcoming\" staff is anything but... Door guy was up his own posterior & hostess was completely disinterested. I should've left before ordering, but thought I give benefit of doubt.Food was bland. Night was wasted. Easier to swallow if you live here, worse if your a tourist.I loved Antica nearby, wines were excellent, service was superb! Next I'll try Zucca. The Hide will get you by for a late beverage, but short on ambiance.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXA3xzUpUW1aqWGPqTJ61g"
  },
  "PX0Fiyp0z-7YHNED39skXg": {
    "date": "7/20/2012",
    "text": "It's like one of those dresses that you wear a suit jacket over for the office but then you let your hair down and pair with a non-sensible shoe for evening. Village east is a good mix of foodie bits, boozy nips and borderline trendy chicks. It's got that sort of \"I want you to know I'm a young working professional so I'll go out and drink with other young working professionals in my young working professional outfit.\" kind of vibe. Such is life, I guess. But it does what it does well. You can read everyone else's reviews if you're ordering food... I'm just on gin, thanks.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "8fVko6a6AtfIQIJXG5LcvQ": {
    "date": "3/12/2015",
    "text": "This is our go-to weekend breakfast/brunch location as it does breakfast most of the day at the weekend which is ideal! They have a really interesting menu (I love the quinoa patties, my boyfriend loves the smashed potato with chicken skin). Really nice decor, always a buzzy atmosphere. Great coffee and smoothie selection too!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnW15DqF3u_zNhf-YJKHlQ"
  },
  "54rYO7Yaa1Z-Ejjcb57Rmw": {
    "date": "7/14/2017",
    "text": "Fantastic service.  Have to start with that review because their staff was in resolve.  Taking my vegan ways on the road is always a challenge but Village East was not only accommodative, they generally seemed thrilled to be able to delight me with great choices during a business dinner.The food was also great.  Surprisingly large, American-esque portions.  Vegan friendly!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "06CJsbK09BxrWL_I2uPOUQ"
  },
  "7RipiA4RCpfC74gUEjxEMA": {
    "date": "2/28/2018",
    "text": "Went here with some friends on a Saturday night and the place was absolutely packed.Most of the food that we had was really great, but my main course was really not even edible. I was hoping for the confit turkey leg, but they had run out, so the waiter recommended one of the specials of the night--it has been a little while so I can't remember what it was exactly, but I can remember that I did not enjoy it one bit.Overall, though this part of my meal was lackluster, we actually enjoyed as great rest of the meal and were treated with a lot of care. Definitely a hot spot in the neighborhood.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rLCbMQmIuWnlI-IhIj51kQ"
  },
  "ABLQY3vJBC8fZ8QKuqwRCQ": {
    "date": "4/11/2018",
    "text": "I ate here in late February and had a nice evening meal.The atmosphere of the venue was really nice and I felt this was one of the best service spots (at least our server was great) I've eaten at in London. The food is decent I had the Lamb Shoulder and I split a couple smalls with my dinner colleague. While there was nothing wrong with the meal or service I still left feeling underwhelmed given the price and hype I'd heard about the place. Maybe a 3.5 not 3 I still think Yelp needs half stars.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_XUoAGyj9svx4691YX2iYA"
  },
  "wSiU74UE-eibTHt-1_-T4Q": {
    "date": "1/27/2016",
    "text": "I like the concept of this place. I came here with a friend for dinner, and we tried their beer cocktails during happy hour. That was fun. The drinks were nice, but smaller than I expected. We had dinner and shared two fish dishes, with the crab mac and cheese. The first was a tuna salad, which I thought was nice, but nothing out of this world. The white fish with a pesto sauce and tomatoes was nice, warm, and hearty. I was pretty sad about the crab mac and cheese, because I don't think there was really any crab in it at all. My husband and I came back to try their happy hour, where we sat upstairs. It was nice to be there, but they clearly didn't have enough staff. It took a really long time to pay, and it was difficult to order anything because the poor guy was in charge of the entire upstairs and he was snatched away at every moment. Overall, the experience wasn't bad, but it wasn't amazing either. I wouldn't be opposed to coming back and trying again. The atmosphere was beautiful, and it's in a really nice location.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "MdLmpos-EVUFU1sZjHesfQ",
        "caption": "Photo of Village East - London, United Kingdom. Beer cocktails",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MdLmpos-EVUFU1sZjHesfQ/o.jpg"
      },
      {
        "img_id": "HnD4Ly-ofBOuz3w7n4A3wQ",
        "caption": "Photo of Village East - London, United Kingdom. Nice wine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HnD4Ly-ofBOuz3w7n4A3wQ/o.jpg"
      },
      {
        "img_id": "aSilsEVCf-XpSrXqtg5BGw",
        "caption": "Photo of Village East - London, United Kingdom. Fish with pesto sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aSilsEVCf-XpSrXqtg5BGw/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "2ECT2NC_UIr1yXZv6TsgHQ": {
    "date": "11/13/2017",
    "text": "Really disappointed by this place after reading so many great reviews. I had a great experience at first ahead of a large party booking - very helpful staff helped us to pre-order our menu, letting us know they would place down name cards for everyone to receive their food smoothly on the night. Sadly, when we got there the staff were extremely disorganised--at first came over to take orders and I had to explain that we'd pre-booked. When food did arrive the staff were all yelling over one another and frustrated by having to work out who's food was who's. As I had paid a deposit upfront, it took a lot of conversations to sort out the bill at the end of the night (despite already having had lots of confusing conversations at the start of the night, trying to avoid that). The fundamental issue was that the staff just appeared completely overwhelmed. I don't know if they were short staffed but we were witness to endless arguing and even crying(!) by the staff, which to be honest just created a really awkward atmosphere over what should have been a fun and relaxing evening. The staff were also really short with a lot of our diners and you were left a bit terrified to ask for anything! Sorry to also say the food wasn't very good, despite being pretty expensive  : (An overwhelmed waitress did ask the manager to come and speak to me after I had to let her know that two guests had to leave before dessert as dinner had taken so long. The manager did her best to make things better - she took the service charge off our bill and gave us some free Prosecco. I did appreciate this, but tbh we didn't feel great about the staff just not getting their tip (particularly if the issues were caused by how many staff had been put on that night / how they were being organised).I worked hard to find the right place for a big birthday celebration and I really regretted picking Village East. I can't remember the last time I spent an evening in such an unpleasant atmosphere. Needless to say, I won't be going back.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RyPKIaWeINSu3GFr-PGXfw"
  },
  "jHYn0lIGFhNglChg30Atlg": {
    "date": "10/22/2016",
    "text": "Today was our second visit to lovely Village East for Saturday brunch. I love this place so much, it has such a relaxing atmosphere, beautiful decoration and super friendly staff. Pancakes here are to die for! we order both pancakes on the menu, one with bacon and one with berries, they both were so tasty, we also had some chips that were very well cooked and salted. What I really like about here is that the music is not too loud so no need to shout while talking! We had to sit at the bar today which was fine the sits were quite comfy, but if you like to eat at the tables make sure you book before as they are always very busy.I can't wait to go back and try their cocktails next time as they all looked delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E54GRn4ciUStS3F-IDXozg",
        "caption": "Photo of Village East - London, United Kingdom. Pancakes with berries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E54GRn4ciUStS3F-IDXozg/o.jpg"
      },
      {
        "img_id": "N7aqJDvRDcm2phCz91Y3sg",
        "caption": "Photo of Village East - London, United Kingdom. Pancakes with bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N7aqJDvRDcm2phCz91Y3sg/o.jpg"
      },
      {
        "img_id": "a-I5454BYw-Zyx-ON3vqtw",
        "caption": "Photo of Village East - London, United Kingdom. Pancakes with berries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a-I5454BYw-Zyx-ON3vqtw/o.jpg"
      }
    ],
    "user_id": "6B5mIRBUAIj4cUjOFwot3w"
  },
  "8fDons3D8TJ29khgOxzBEA": {
    "date": "2/15/2016",
    "text": "No flipping words for how good this place is! All I can say is it's one of best brunches I've had in London in years. Fan-flipping-tastic!!! I went for valentines brunch with one of my closest friends for our yearly tradition and damn did this place live up to expectations! I went for the lobster benedict, minus the hollandaise sauce, (because yeah I'm weird) and wow, like an open mouth moment! It was small but every bite was like an explosion of flavour. The lobster, the egg, the soft muffin and the creamed spinach! Completely a knock out dish. To make it better my friend ordered pancakes and I was lucky enough to share some and these were what the word food porn was created for... The clotted cream just melted in the mouth and was complemented by berry compote, which was sweet but not too sweet and fluffy American style pancakes! Literally couldn't have asked for a better sweet breakfast dish...Since I went yesterday, I genuinely have told everyone about how awesome this place is! I'm already planning when I can go back... It's that good!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VNvEDxK23EeWqr_h_ohMbw",
        "caption": "Photo of Village East - London, United Kingdom. Lobster for breakfast! Yum",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VNvEDxK23EeWqr_h_ohMbw/o.jpg"
      },
      {
        "img_id": "hK603_TKzcmCUlI2gmYF0Q",
        "caption": "Photo of Village East - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hK603_TKzcmCUlI2gmYF0Q/o.jpg"
      },
      {
        "img_id": "qk3ff0KOJHR93PrLwILcEg",
        "caption": "Photo of Village East - London, United Kingdom. Berry pancakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qk3ff0KOJHR93PrLwILcEg/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "j-HOS6p44Wo65Sz7KfFjpg": {
    "date": "7/8/2017",
    "text": "We went for a brunch on Saturday. We were happy to see they served 9-4. We enjoyed our full English brekkies and other assorted breakfasts we chose. The decor on the inside was interesting as well. Service was good",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2BbLjmE0uge39Ruq_ZqBA"
  },
  "rnI6TkDl3rkhQ5lq1wrG-g": {
    "date": "9/12/2016",
    "text": "The five stars might come down to the fact we were a little boozy and celebrating .. But it might also come down to the ambiance, architecture and of course AMAZING food!An eclectic interior of bare wood, tiled floors & bare light bulbs welcome you into the fray of Village East. They have an ample Breakfast menu and and brunch/lunch menu that kicks off after 11am. Breakfast it was for us for our early start and the selection is really enviable! Avocado, Feta & Poached eggs on Sour Dough with me and a side of chilled grapefruit seasoned with sweet ginger and mint (Yum!). My companions opted for other varieties - from the Village Breakfast (think English breakfast but SO much better) to buttermilk pancakes with crispy bacon and maple syrup. Celebration bubbles aside we also opted for some Bloody Marys (delicious and the right side of spicy) and the Village East special Beetroot Mary (think Bloody Mary but with beetroot juice instead of tomato juice .. I'm a fan!). This was all alongside our coffee addictions (My espresso was served a little luke-warm but the flat whites did not disappoint).Deceptive from the outside, there's ample seating and two decent sized bars which my friends happily informed me you can come visit for some evening tipples (so that's on the To-Do List now). Prices are what you would expect for the area and standard of the place - and we were more than happy to pay! Fantastic happy staff made us welcome and service was prompt.All of the good things basically! If you're after a slightly more 'upmarket' brunch place on Bermondsey Street, Village East is a must!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tVoOqkzIdzJphkG0tVpaaQ",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tVoOqkzIdzJphkG0tVpaaQ/o.jpg"
      },
      {
        "img_id": "UCCaQuHFgmFg15VO5R9aug",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UCCaQuHFgmFg15VO5R9aug/o.jpg"
      },
      {
        "img_id": "_0_8jhqGW1xdeNZot6Ha0A",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_0_8jhqGW1xdeNZot6Ha0A/o.jpg"
      }
    ],
    "user_id": "1NxwSub0MOm0TC64dRt0QA"
  },
  "7U0ieFEIVMrpnRfcMGwsqQ": {
    "date": "6/30/2015",
    "text": "Props to the staff her for starters. I popped in here yesterday and the servers cheerfully put the superfood salad with grilled halloumi in the Tupperware container I had for takeaway. The dressing is great, a lemon-based vinaigrette, which goes well with the pumpkin seeds, broccoli and other great ingredients. Nice halloumi as well. One server even gave me a silver fork- not a plastic one!- for takeaway.Good customer service finally!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "LSjRPWIfNnAjgCKYhVbflA": {
    "date": "4/2/2016",
    "text": "Nice cocktail. And chartreuse. Did not try the wine.Good for a relaxed atmosphere of you are in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gb78aM_aRxU8LUYb-gnTMA"
  },
  "R2cEAK1Zf_l65aQXJInPnA": {
    "date": "3/11/2014",
    "text": "We had a fantastic meal at Village East over the weekend.  A early booking was all that we could secure due to our indecisiveness and procrastination.  As our meal came to an end, the joint was packed and jumping and we could understand why.  It wasn't too crowded when we arrived and we were seated at a very cool table with two large chairs opposite the pass.  We got to watch the chefs work the food at the pass all night.  That was a lot of fun.  Saw many burgers at the pass and they looked really good, as did the steaks and bowls of mussels.  I was a bit reluctant with the menu and not as adventurous as I typically am.  We didn't really know what would be too much for us.  But, it all ended up just fine and things were great.  We opened with the caramelized onion bread with yogurt and dill butter.  Fresh from the oven, it lasted only a few minutes.  Next starters up for us were the Heritage Beetroot salad topped with crabmeat and the poached salmon with pickled veggies and lemon dressing.  I really enjoyed the seafood in both of these dishes.After wavering helplessly deliberating my entree options, I ended up opting for the my standby soft-shell indulgence.  Soft-shell crab bap and fries, (Give me Ham on white) hold the mayo (Airplane! y'all).  Add a tasty side of decadent smashed potato with chicken skin and gravy.  My wife had the tuna and enjoyed it.  It's the first time I've seen soft-shells around town and I liked it as usual, though it was a bit heavy battered.  Chef actually stopped my dish at the pass and chiding his understudy for the mayo slathered roll before kicking it back for a redo.  He gave me a knowing nod to let me know he was on top of it.  Our delicious meal was proof enough of that, but that kind of service is always appreciated.  Concluded our meal with the banana toffee and peanut butter sundae that was outstanding.We were thrilled with the entire experience at Village East from the food to the hip vibe and decor as well as the spot on service.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 9
    },
    "photos": [],
    "user_id": "brQ7OjB6f9nXWGk45A9A3g"
  },
  "vm7w9y1kavbMaiptKdnN0Q": {
    "date": "11/10/2014",
    "text": "So I'm giving this place 5 stars for several reasons:1) Customer service - friendly, speedy and willing to have a good chit chat without losing out on attending to other people2) Delicious food. So it's probably not the most experimental food but good, heart warming food to keep the hunger at bay without completely killing you. Had the crab bap which was just succulent followed by the panna cotta.3) Entertaining as hell. Went there on a Saturday night, was sat in front of the kitchen and for the first 20mins I don't think I said two words to the boy because we were transfixed, watching the kitchen go. It was so entertaining to see how they put the dish together, the flames and flourishes. Then how they perfect the plate before sorting it out to go to the right place. Really fun to watch.Other reasons this place is super cool: fun looking private dining area, unique bathrooms and great decor.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XIhIPuY8TpXy-xvU7rIFqg",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XIhIPuY8TpXy-xvU7rIFqg/o.jpg"
      },
      {
        "img_id": "BAWDdY9iLWTL8lPzgbI27w",
        "caption": "Photo of Village East - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BAWDdY9iLWTL8lPzgbI27w/o.jpg"
      }
    ],
    "user_id": "brRicYvVLTx-xByTVyRBug"
  },
  "2wjFP_XNBg4Mo7ACiqvgiA": {
    "date": "8/18/2014",
    "text": "Yay for the cocktail bar, yay for the service, but nay for the food I'm afraid...I came here on a date and had a great time in the bar area - it was buzzing with the after-work crowd but we managed to nab a couple of stools at the bar. Cocktail menu is full of new and exciting ingredients and thus well up my street (nettle cordial this and black cardamom that) whilst the barman put on a good show and seemed to know an unhealthy amount about booze when I asked him a few questions!The ladies on front of house were lovely (though there seemed to be far too many of them) and they soon showed us to our table in the main restaurant. We were looked after really well for the rest of the evening by a very friendly and attentive waitress, who did everything right, apart from convincing my date to pick the wrong starter (she redeemed herself with wine tips though).Having been suitably coerced, we shared the whipped feta and grilled cucumber starter, which was quite cloying and not very nice (and in hindsight, doesn't actually sound very nice). Sadly mains didn't get much better - I decided to try something different and got the soft shell crab bap, which turned out to be a lot of bap, a lot of batter and not much crab. I should mention though that finding the dish quite tasteless may in part be due to my date deciding to spring the 'so where do you think this is going?' chat on me one bite in and I rather lost my appetite :-$I'd go back to give it another try - the place has a fun vibe and is a mishmash of bare brick, leather booths and wood panelling that make it interesting to look at. Next time though I'll either be sticking to the bar or ordering very differently (and hoping for a more successful date!).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "Ne2hZHQXQD84MVV5fTnnQw": {
    "date": "6/15/2014",
    "text": "My first time to this part of London and Bermondsey Street is such a cute area. This restaurant is fairly far down along the road that comes from London Bridge, like a good 15 minute walk, but I passed a lot of cool restaurants, bars, and shops along the way.We came for brunch and it didn't seem to be that crowded, with some empty tables around us at peak time. I ordered the lobster benedict, which was a menu item I hadn't seen before, and it was delicious. I don't know how much food they give you with the small portion, but the large one was a good amount and I would definitely have been disappointed with less.My friends had the buttermilk and buckwheat pancakes, which looked good but fairly standard. I don't think they're serving anything mindblowing in terms of brunch food innovation, but the food was very good and the decor is fantastic (and there's no queue).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "N1M07Y8Cy_KDrY3fbsXmJw": {
    "date": "5/6/2016",
    "text": "Probably the friendliest staff is all of Bermondsey Street. Go for the salmon stay for the gin.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OVbEmZnMbzRgV0_TnN3-WA"
  },
  "maFApSnj7inyeBAj4F8AGA": {
    "date": "10/11/2015",
    "text": "Brilliant service and a great menu to choose from. Loved the cool vibe they'd created in the restaurant/bar. I went for the smoked cheeseburger with fries. It was absolutely delicious and the burger cooked to perfection. You really can tell the difference when is good quality meat! Just lose a star as gave us a more expensive wine than we'd asked for/pointed specifically at on menu so tried to charge us for it. It was not our fault that we didn't notice and eventually they agreed! I'd definitely go back and they've got a really cool private dining area downstairs if you're looking for somewhere to hold a dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "E9V2A1QRlCFXNXOMBXEt2Q"
  },
  "fc_CwpVq9JAw18w59LHUZg": {
    "date": "8/21/2016",
    "text": "Such a lovely restaurant! I went here for brunch and had an excellent meal and great service. I will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_7j6bJIrsxam-0iP053Tg"
  },
  "8AldIE79nbcm-Tfvx-nVbQ": {
    "date": "3/3/2013",
    "text": "I am slowly starting to explore the East side a little more - and loving it!  We stopped here for drinks before dinner at Zucca and it was the perfect place to grab a quick drink.  I wish the place was a little bigger because it gets really crowded.  Funny thing about the name, I kind of expected it to be like the gay bar in Soho but on the contrary really chilled out place.  If you're lucky enough to score one of the comfy seats, I can be parked there all night!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "_v9kc3oLoRy7HwTJTGQT3A": {
    "date": "7/9/2015",
    "text": "Great food great experience!! Friendly service and unique food I've never tried before.  Enjoyed the pork belly and my son said the cheese burger was the best he has ever tasted in his life. The pickled herring starter dish really woke up my tastebuds.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JWxie_FBYZ1UINrxAcE2pQ",
        "caption": "Photo of Village East - London, United Kingdom. Chicken breast with garnisments",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JWxie_FBYZ1UINrxAcE2pQ/o.jpg"
      },
      {
        "img_id": "nlPY4NjM8eys7XuuulXaKQ",
        "caption": "Photo of Village East - London, United Kingdom. Cheese burger and poutine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nlPY4NjM8eys7XuuulXaKQ/o.jpg"
      },
      {
        "img_id": "e8pjD2VBxKFvj1V1QU45HQ",
        "caption": "Photo of Village East - London, United Kingdom. Pork belly with garnisments",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e8pjD2VBxKFvj1V1QU45HQ/o.jpg"
      }
    ],
    "user_id": "orLD7OqyMoqgWokyTqLl7g"
  }
}