{
  "_L56BT2gJr4MF2Ced-PWzw": {
    "date": "7/22/2009",
    "text": "As many other yelpers have pointed out, Mexican it is NOT.  So if you're coming here for Mexican food, you'll go home very disappointed.FWIW, I'm Mexican-American, born to Mexican parents, originally from Chicago where it feels like there are more mexicans than mexico sometimes, so I know what Mexican food is and is not.The food is more like Tex-Mex, and drowned in melted cheese.  Flavors are very bland, nothing is spicy.  the \"chorizo\" is not mexican chorizo, it is spanish chorizo which is a whole 'nother ballgame.  The refried beans are more like a paste than beans and I usually substitute black beans or frijoles rancheros for the refried.   The enchiladas suizas are drenched in some white sauce that resembles nothing of what real suiza sauce is though the chicken in the enchiladas is very nice.the only saving grace for this restaurant was the fact that they carried \"Pacifico\" beer which is way better than Corona, and comes from the Sinaloa state of Mexico. Once you drink a Pacifico with lime you will never want a Corona again.  Unfortunately, I went over the weekend and was informed they would not be carrying Pacifico beer until further notice. wtf. Overall, for the price and the \"mexican\" food you get, I would skip this place unless you want tex-mex with tons of cheese on it.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYaO6Z6u3jgtr3FfQn3A1A"
  },
  "ds62ToB1vDzdwwpyI1PXNw": {
    "date": "1/7/2009",
    "text": "Geez, I had to travel all the way to London from Texas to find my favorite Tex-Mex restaurant?! Something is seriously wrong with this picture! I used to work across the street from Cafe Pacifico when I was living in London and it would be a special treat to get to eat at Cafe Pacifico. (I was really poor at the time!) I usually ordered the brisket Quesada Grande with everything on it. It came with an orange slice that made the brisket really juicy when squeezed over the top. I can totally vouch for the authenticity of the Tex-Mex. But, let me tell you people...in Texas you will get as many baskets of chips and salsa as your heart desires because we a re bunch of fat asses so they are really doing you a favor by only given you one complimentary basket!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mgoDA8SYlSJrQ50fkMCFeA"
  },
  "zFXZwMSZQB5e4K0m6WkAdQ": {
    "date": "3/15/2011",
    "text": "I came here for drinks on a Saturday afternoon. I sat at the bar, chatted with friendly bar staff, tried some fancy tequilas, ate pretty tasty bar snacks (better than the table service, I'd say), destroyed some quacamole and drank delicious delicious spicy beer until I couldn't feel my tongue anymore.I can't think of any other bar that I'd rather while away a Saturday afternoon at in Covent Garden. Quiet, secluded and relaxed. Win.My previous review still stands, I don't think I'd eat here again. But for hanging out, drinking mexican gold and avoiding the intense London crowds and environment, this place is a Mexi-CAN.As opposed to a Mexi-CAN'T, which is something Mexican which CAN'T do something Mexican based. It finds itself unable to fulfil that particular Mexican criteria. Mexi-unable just don't cut it at this level.Well, maybe it isn't that it can't do it, just that it isn't very good at it. I suppose you could call it MEH-xican, if you like word play and stuff.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "b_VfT5y1c9LMO5RqV8ck0A"
  },
  "4N8Grr8L4NZQGBafX4jdJA": {
    "date": "5/29/2011",
    "text": "Ok, it wasn't gourmet.  The place was a little dingy and perhaps busier than it deserved to be...But my chimichanga was HUGE, the refried beans and rice were plentiful, and I stuffed myself STUPID.  O, man, so good.  It scratched that Tex-Mex itch and I'll definitely be back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1vSKO0xWt16WpA-YQCEjg"
  },
  "f9XxHfrXy9PKL8EaanL5qQ": {
    "date": "7/1/2012",
    "text": "Terrible. Would not go there again. I could cook a better Mexican meal at home.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_tP6TpU3BqKB1iG-yjydNQ"
  },
  "snnytqddUTIr_b2kyiM8Pg": {
    "date": "4/5/2012",
    "text": "Personally my favourite Mexican restaurant in London. Food is excellent as are drinks (large choice of tequila). Service is very attentive.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "26BqREZGGzCv0-p3n-_gLQ": {
    "date": "5/27/2012",
    "text": "Good Mexican place in an easy to reach street near Covent Garden. Enchiladas were good and I'd recommend the poppers as an appetiser.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mhx5eRaZQVfqGwZl7nA5lw"
  },
  "D3x2ZwBWJ1p0ZDF_rqH4KA": {
    "date": "7/11/2010",
    "text": "I must have been here six times before I actually ate any of their food, and when I did I couldn't really remember it the next day... you see there's a bar here and they sell a magic happy cactus juice called tequila. This not a trendy bar by any stretch but there is always a real buzz about the place and it's way too easy to get stuck here, perched on a scholl, wondering if it's a good idea to spend an obscene amount of money on a shot of tequila that gets your name on the wall. And the food? Erm... it's Mexican.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "g1LRwvIAwE1hGw2uyOgudA": {
    "date": "7/9/2011",
    "text": "Good atmosphere. Food was alright.  Disappointed that my tacos were soggy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmVpxJO-V0oGWTthJHBrCw"
  },
  "pK-9X_MByLnDxpomsSfRog": {
    "date": "5/23/2009",
    "text": "Mexican does not happen in London... it simply does not.They can nail every other cuisine (Chinese, Indian, Thai, even Philippino for gods sake), but not Mexican.Take it from a Mexican. I think that burrito place in Islington next to the N1 Centre has got it down better than Cafe Pacifico. And even that place is mediocre.I'm calling myself out on this one, but if you're from California you shouldn't even be thinking about having Mexican food outside of the state. Much less the country. You'll survive, I promise.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4e8OFbG7Miza_XT3C2DzDQ"
  },
  "s0AelXoJ6Pyz1M-1XOkgIw": {
    "date": "11/14/2008",
    "text": "This is a place that I thoroughly enjoy going with one other person, be it your girlfriend, boyfriend or best friend or a group. Down a side street in Covent garden you a greeted by a small flight of stairs leading you into the wonderful world of Mexican aromas. The walls have Mexican posters of old adverts and imagery. To your right is the grand bar - always packed with stools situated around the bar and people standing everywhere. In front of you and to your right are table and chairs with red and white tablecloths. This is the restaurant area where sizzling fajitas and burritos are continuously being served.As a group the restaurant is great - sharing food and trying out new dishes. The tables are positioned in a very social setting hence the loud, bubbly atmosphere.My favourite part of this place is the bar. Somewhere to go as just two. You can sit at the bar all night! Ordering corn chips, guacamole, salsa and tasty cocktails. The bar staff are incredible - creating the most amazing cocktail creations ever! The walls are lined with all the different cocktails they produce and a very detailed and thorough selection of spirits. A fun buzzing place open from 12noon to 11:45pm - a must!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "iJ9riYBvExYcSGPJmXXPOg": {
    "date": "5/27/2008",
    "text": "Quick summary: the best Mexican food I've had in London so far. As those of you who follow me know, since moving been to London I've been in a never ending search for good Mexican food. As the U2 classic goes, I still haven't found what I'm looking for. But Cafe Pacifico is damn close. We couldn't get into the (mediocre) Wahaca so went off in search of alternative Mexican delights. We had heard rumblings of Cafe Pacifico and a quick check of the Qype iPhone app yielded the address and some good reviews. We found it nestled in a relatively quiet street in Covent Garden. As soon as we walked into the place I had high hopes. It FELT like a Mexican restaurant. Like a cheesy, tacky Californian Mexican restaurant that you'd find in Ensenada or something. I have to admit, I got a little emotional. As far as I'm concerned, restaurants live or die by there ambiance/atmosphere and Cafe Pacifico had nailed it. The place was buzzing with energy, the staff were smiling and having a good time, the walls were covered in nick-nacks and chotchkes that made the place feel like a real Californian Mexican restaurant. And we hadn't even ordered. We had to wait about 20 minutes for a table but that wasn't a problem for two reasons 1) it gave us a chance to check out the bar and 2) it was 50 minutes less than the wait at Wahaca. The barkeep handed us a menu and I was immediately impressed with the Mexican beer selection. The Mexicans do great beer. Negro Modelo, Sol, Mexicali, etc are all fantastic and Cafe Pacifico had at least 8 different Mexican beers. We quickly got our table and the menu had some impressive treasures. Burritos, Chimichangas, etc were all there. My one piece of advice to Cafe Pacifico would be to ditch the haute cuisine stuff (duck, soy, etc) - you don't need the foodies, concentrate on your already good Mexican food and you'll be in great shape. LOVE the fact that they have Eastern Mexican food on the menu as well. My barometer for any Mexican restaurant is two fold: burritos and refried beans. Cafe Pacifico delivered both with aplomb. Way to go guys, you've now officially been awarded the alexhunter Best Mexican Food in London award.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gA_eNBoCPhbYZ79F-_HuA"
  },
  "Q02-8WbMEHSUeGlaeTdZ1A": {
    "date": "8/17/2011",
    "text": "There is a Mexican restaurant in London not far from Covent Garden that is really good and really fun. The first time I went there it was a Wednesday at about 1300. The place was hopping. It is a big restaurant up a flight of stairs from the street and it was about three quarters full with what seemed primarily to be office workers out for an afternoon lark. They were swilling chips and salsa and beer and having a great time. The chips, salsa and food were all in the better-than-good range; it was especially good for a chain  because that is what Pacifico is, a chain with stores also in Sydney, Amsterdam and (at the time) Paris. I liked the place so much I bought a Tee Shirt.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PwYsHQv7FdCkh40ESWPEyg"
  },
  "wFb9SN8FgjxHn7SAGmvomA": {
    "date": "7/7/2011",
    "text": "the salsa dip is to die for......and the margaritas must be alchole free because they went down like water - pitchers are a must if going with friends i just love it, great place for after work drinks and stop to eat, weekend lunch, weekend booze up....basicaly all occasions and suits all types of people",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2u3kFB882eJWWvM4-GfZgw": {
    "date": "12/9/2010",
    "text": "I finally found good mexican food I had in London. I found this place after going to the London's Transport Museum.  It felt like I was back in California. I liked the free chips and salsa. the food was really good also for being in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KyGkyqSPuJW-Sq7OXPVu2w"
  },
  "eS7E1-QuqU_4wiF5-wIBTw": {
    "date": "12/20/2008",
    "text": "This is a great little place, and i'm obviously not the only one that thinks so - as the place is always packed out! if you haven't got all of your party with you, you will need to wait until they all arrive to get seated, so you can find yourself sat at the bar, sampling the mojitos and beer. All the favourite mexican dishes are on offer, and are all tasty, although are not amazing. If you have room for dessert the deep fried tortilla chips, covered in honey and cinnamon with ice cream are amazing - although completly filling! Agreat place to catch up with friends. The prices aren't cheap, but reasonable enough whats on offer.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IeSav3qvpY7i0TqPzjfPlA": {
    "date": "3/15/2009",
    "text": "I like the idea of Cafe Pacifico, I'm just not sure I like the actual execution of it. The hype sells it as a mexican restaurant in the heart of covent graden - the kind of place you can go with lots of friends and have a really social experience with lots of cocktails and authentic mexican food. When I went I found that the service is chronically slow (don't go if you want to get food before 9pm), the drinks overpriced and sticky cocktails, and the food deep fried, deep fried and oh deep fried. What I hated even more was the open kitchen and the way it seemed to spew so much smoke into the restuarant that it was impossible to see to the other side of the table. Thank god I wasn't going out afterwards because my hair stank of cooking meat. I like the idea of these restaurants which provide a great atmosphere as well as good food, I just feel like in Cafe Pacifico I could do with a little less atmospere and some better food. I'm willing to give it another go but if I come out smelling of smoke again then that's it!...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "T1knWPD44hiXhDNUNNDUyw": {
    "date": "3/15/2011",
    "text": "Been here a couple of times, the lunch time special is a great price and the dinner menu is excellent. One of the best places to eat around Covent Garden.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GDbSoxBAB-nmxpXoEn2cpw": {
    "date": "11/24/2009",
    "text": "if you want authentic Mexican food.....go to Mexico (or a state in US that borders Mexico) ha-ha!!but if you are an uprooted SoCal ex-pat looking for a bit of Mexican restaurant atmosphere and a perfectly good meal, then definitely hit this spot - it will fill the void. i didn't venture further than a burrito (ranchero sauce on the side please), so i played it safe and was happy with my choice. the pleasant surprise was the refried beans and rice that the main course came with, that was just like home and  - yum!!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x27JrZ6Xxr1BOXmM_y9kiQ"
  },
  "Ncp3SxGDMrwOsVoGHNMWKg": {
    "date": "11/6/2007",
    "text": "How do I love thee, Cafe Pacifico? Let me count the ways..This fabulous restaurant is not only the source of the best Mexican food in London, but it's fun, energetic and OH those marguaritas!!Due to its popularity, Pacifico is often packed to full, so expect to wait at the bar  I recommend any of their cocktails on this occasion it will make your wait an enjoyable one! he Fajitas, Chimichangas and Quesadillas are all favourites of mine, but their range of options is extensive, and whatever you order on the menu, you will not be able to finish what is on your plate (take that as a challenge if you will). Unfortunately at around £8-£12 per main, and £6.50 per cocktail it's not a cheap night out. But perhaps that's just as well, or I would be going there three times a week.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pvqF7-O0q-btkSDLuZcVeQ": {
    "date": "8/17/2012",
    "text": "I was invited to Cafe Pacifico as part of a Qype review crawl. It's a lovely Mexican bar, tucked down a side street near Covent Garden. It's obviously popular as it was already buzzing when we arrived just after 6pm on a Wednesday. We were settled down with a (incredibly refreshing) margarita, and given a really interesting talk on the history of tequila. We were taught how to properly 'taste' tequila as a liqueur by sampling Cafe Pacifico's own brand (apparently it's best to breathe through your mouth when smelling it so that you don't get too strong a hint). We also got to sample some of the bar food  usual Mexican fare of quesadillas, nachos with cheese and guacamole. My favourite thing was pork strips which came complete with mini tacos, avocado sauce and shredded veg  yum!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97JTwCnKnyTHpr6fp-sNdA"
  },
  "cCqPQuJjqYCqyRB35423tg": {
    "date": "11/3/2009",
    "text": "Reviewing a Mexican restaurant in London on Yelp? Oooooh, controversial.I'm going with Sandie L on this one. Are you from California and miss the Mexican food you know and love from your home state? You will ADORE Cafe Pacifico (and its sister, La Perla).I happen to prefer CP because it is slightly more hidden and therefore not as crowded as La Perla can get. Their service is a bit iffy -- we had to ask 3 different servers until we got a jug of tap water for the table. And Phil R's spicy beer wasn't so spicy -- i.e. they screwed up. But the fact that you can order a beer \"spicy\" makes up for it I think.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "XGaMoQ6sg0B5hSzC5aRmdw"
  },
  "kie0jpVhYJ1KCTx_O_jhrg": {
    "date": "8/16/2012",
    "text": "Cafe Pacifico was the last stop in our review crawl. The restaurant is incredibly busy so it's definitely not a place to go if you're looking for a quiet romantic dinner, but definitely the place for friends or Mexican culture enthusiasts! We had a great crash course on how tequila is made and also how to properly enjoy a good tequila, whilst enjoying really yummy margaritas. Carlos is an incredibly welcoming, friendly individual, who made us all feel at ease and taught us a lot about tequila and a similar liquor called mexcal. We also got to try a bunch of dishes Cafe Pacifico has to offer, including quesadillas (one which had mango in it, odd but tasty!), small tacos, nachos, and guacamole. Everything was really tasty and fresh. This is definitely my kind of place, and I'll definitely be coming here again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU8n9Is1dbbasCTd5kKMWw"
  },
  "bHE_OqbLSRT1g11QJ-XB3w": {
    "date": "2/14/2010",
    "text": "On my second visit, I'd forgot what I ordered on my previous visit and thought, 'I'm pretty sure I got the enchiladas... I remember eating them with a fork'.  But, really, what I'd forgot was that the tacos were bizarrely served like enchiladas, which made eating them with a fork necessary.  So, I ordered the tacos again.  And this time around, I felt cheated.  Cheated because I'd forgot they weren't actually tacos.  Cheated because I didn't actually try the enchiladas.  Cheated because they weren't actually tasty.And cheated, most of all, because the margarita pitcher for 8 actually only poured for five.  Stingy false.The guacamole was pretty good, though.  Best guac I've had at a London-Mexican restaurant so far.  Actually.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "siJLVjCXXYZ3V89GB4Y3WA": {
    "date": "8/11/2010",
    "text": "Being an American and very far from the West Coast where we tend to have fabulous Mexican food, I was ecstatic upon finding Cafe Pacifico. I went with a friend and shared a plate of nachos, REALL nachos! Not as big and plentiful as Red Robbin's Macho Nachos, but then again I'm in the States for good reason. We each had a margarita but sadly they left a lot to be desired. I've had beer and other drinks since and they are pretty good.Regardless, the staff were friendly, the environment was great, not too pretending to be Mexican but mostly actual Mexican. I've brought other State dwellers here as finding decent, true Mexican food is difficult to do in London. It's not going to be the same as home, but it is able to provide a very nice substitute. I also believe they are one of the few places that serves El Pacifico beer, and as the BF has lived in Cali he couldn't believe his luck in me knowing of a place that housed one of his favourite beers from the States. So to American's, keep an open mind to this place unless you're only passing through. If you've been here for some time this place is great, and for everyone else, it's worth trying after some viewing of street performers or shopping around Covent Garden. It's far enough off the beaten path that most tourist won't be able to spot it. Total win for me.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjDgWfROZfFt8OSGz6GJCQ"
  },
  "Cz_uHKEDAxHPMJJdYvdFfQ": {
    "date": "7/19/2010",
    "text": "Originally a tip from a colleague for good Mexican food in London, I end up here every time I'm in London. I've tried a couple of things on the menu, but I often find myself coming back to their \"Street Tacos\" - 4 tacos each with a different meat filling.The one time I ever had a problem, the waiter came over and apologies profusely, the kitchen had burnt my lobster starter. The end result was a high quality mojito on the house while I waited another 10 minutes for them to cook it again.The bar is fully stocked and I believe it has over 100 types of tequila. I'm not a tequila man, but their mojitos are pretty good, especially if you splash out for the better quality rum.Whenever my craving for good Mexican food gets bad enough, I sometimes find myself considering the 45 min flight to London for quick trip, dropping by Café Pacifico along the way. It certainly beats the 12+ hours in the air to San Francisco.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WvA_UWwxdwSeerQ2faOSg"
  },
  "lxDX4NaV0dbit7bjIfdcQw": {
    "date": "2/15/2010",
    "text": "Mediocrity. Complete and utter mediocrity, with a side order of grocery-store \"tortilla chips\" and a drizzle of mildly-perplexing stylistic choices. The atmosphere was fine--quite good, even--with the most authentically-taqueriaish ambiance I've found in the UK and a team of wait staff who dealt quite adeptly with our large and boisterous party. The chips were rubbish but the salsa was quite good. The mojitos were almost entirely ice and un-muddled mint leaves, and the blended margaritas were bland tequila-slushies.The server didn't know what Pico de Gallo was.The \"street-style tacos\" were, um, evidently never served on any street I've visited. Served in FLOUR tortillas (?!) and wrapped as little mini-burritos they were, contradictorily, exceedingly mundane.Points for atmosphere, location, salsa, service, and the pleasant company with whom I dined, but I don't really have much more to give props for. Sorry, homes.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zptTiLrI85MWA96eDM84A"
  },
  "E5C264uivzcJp_w26lGOYQ": {
    "date": "11/10/2009",
    "text": "yup this was a great place. Id organised to meet old uni pals here. No reservations taken here which was handy as we werent sure how many of us would show up.the restaurants was larger than i thought, and the bar area was ample. I got there early so had time to hang out at the bar.Our allotted time at the table was 2 hours but we ran over that time by a great deal. it was so cosy in there we could move a good vibe as the atmosphere from the bar just spread across the whole restaurant.food was fresh and flavoursome i had the veggi tosda and there were plenty of veg options.the decor felt really genuine not kitsch as one might expect in a chain (very small chain) definately had the feel of an independent, successful Mexican tavern one like your local friends would take you to. i would definitely re-organise an impromptu get together here any day!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ab6t3mmUauabPJwW0LZow"
  },
  "azxVQ01nptmqBeMS14Yvpg": {
    "date": "7/22/2009",
    "text": "I am totally with Nick S on this one, if you aren't American and don't consider yourself a Mexican food expert then this place will make you very happy. They serve very very tasty food, it may be a European interpretation of Mexican food.You'll find quesadillas (pronounced kay-ser-diller) and fajitas all filling and spicy and warm. You'll also get friendly staff and great value lunch deals. So as you can see, if you don't go in there expecting the food to be fresh out of Mexico you won't be disappointed. This place could have been a solid 3 star place but I'm craving black beans right now so was generous!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "3RA0CtNBVvbEpudnpDDWzQ": {
    "date": "8/16/2012",
    "text": "Cafe Pacifico has been around for 30 years or so, which along with its sister La Perla restaurants a stone's throw away in Maiden Lane and Charlotte Street, are the original London Mexican cantinas. And they are the first bars in England to be honoured with the 'Distinctivo T' award by the Tequila Regulatory Council of Mexico for thie exceptionally high standards in the service and promotion of Tequila. This cafe-bar brand is managed but the charming and knowledgeable Carlos Londono (actually!) who taught me that Tequila is made from a blue Cactus-like agave plant grown in a limited area of Mexico with AOC-DOC type regulation - you may know that, but I bet you didn't know that Mezcal is another broader term for this spirit category and made from similar plants though with a range of different colours! It's the difference between Cognac and Brandy if you forgive my second French alcohol comparison in a Mexican place review!The busy yet relaxed party atmosphere here would be great for tables of any party size or even for one, two (or many like us) to prop up the bar. Colourful wall posters and food dishes abound - both of which include good quality versions of the standard fare you'd expect in a Mexican here such as guacamole, as well as less 'Tex-Mex' outcomes like the interestingly-tasting and nicely spiced tender beef or mango empanadillas that come with sour cream dips, or the pork belly slices with red cabbage in authentic imported tortillas. I will go back here again and again. They did it right, if I might borrow the phrase from the post-Olympic verdict of London 2012. Well I had to get it in somewhere (who's not still excited?)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QwbD7684Arg10Wc_rU8HRQ"
  },
  "wLQWyEyz7DWKMsDjJQsHsQ": {
    "date": "9/18/2009",
    "text": "For Mexican food in london i was pretty impressed with this place.  Sure its not like the states, but definitely one of the best in London.  Mostly you can only find a few subpar burrito places so it was nice to find some variety.I had the street tacos.  pretty good.  i also tried the fajitas which were good, but a little too sweet (don't know what sauce they use). also the appetizers i got were really good..thre was some type of salad thing...it wasn't very mexican but the dressing was really good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jdn3EG9KBRyjZH0HP_orzg"
  },
  "1S4V4o1emOOsZO393F41tA": {
    "date": "7/2/2009",
    "text": "Very nice staff, but super slow service. Had to flag down the waiter a few times for more drinks and the bill :(I hail from San Diego where the Mexican food is FANTASTIC! So I'm extremely hard to please when it comes to Mexican cuisine...I only ordered four beef taquitos, which tasted pretty good but not exactly the size i expected them to be. Usually they are a bit longer than the size of egg rolls (spring rolls), so I ordered four of them. When they arrived, i couldn't believe my eyes...they were quite humongous and I could only consume two of them. If I wold have known these were GIGANTIC taquitos, I would have only ordered two. I'll have to ask the waiter about portion size next time....but I'd def go back again :)",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "rem8ln92PSbFZ9IlqbToZA"
  },
  "t4P31EdRjykzfWLwUUolzQ": {
    "date": "4/19/2013",
    "text": "As a big fan of the different cuisines, I have checked a dozen of Mexican restaurants. I think that one of the best places is this restaurant, because it can offer you traditional food on good prices. Well, I know that the Mexican meals are complex and it is not easy to make their right delicious taste. However, I know that the rich flavour and nice aroma of the dishes will satisfy all your expectations.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oLPRoLDAi5zWzQUcF35Wng": {
    "date": "2/21/2013",
    "text": "Nice restaurant with delicious food and quick service. The thing that annoys me a little is that it is a little crowded sometimes and I don't like how the tables are placed very closely to each other. That's my only complain I guess.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BeR_yoPOEc9DoGd3rY7HKA": {
    "date": "8/25/2012",
    "text": "I went to Cafe Pacifico as part of the Qype Covent Garden Crawl that I was lucky enough to be part of. I have been working in London for the past 24 years, and yet somehow, Cafe Pacifico jjust a few steps away from Covent Garden station had passed me by. I don't tend to hang around Covent Garden much any more due to its touristy nature, but Cafe Pacifico is tucked down a little side street.As you walk in, it is like walking into a little bar in Mexico  you suddenly feel like you must be more fun and vibrant because everything around you is!We couldn't have been made more welcome than we were by the lovely Carlos  manager and part-owner.We were given glasses of iced water, gorgeous samples of food (best guacamole I have had in years and the beef and jalepeno quesadillas were to die for), and of course tequila.We were given a huge jug of beautifully fresh, zingy margueritta and then treated to a very passionate talk about tequila and Cafe Pacifico's history.Carlos then taught just how to drink tequila (another skill to put on my CV) and it is the first time I have been able to enjoy it  not a salt shaker or lemon/lime piece in sight!The rest of our group ended up having to come and hunt us down as Carlos brought out more jugs of margueritta, showed us photos of the agave plantations (the plant tequila is made from) and generally made us feel like his special guests.A great place to spend a lively evening with friends :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mwhar09i6Zmhlo-xw5mDow"
  },
  "X4n8Vw2Wtn0n9a07P9bLgw": {
    "date": "2/11/2013",
    "text": "If you would like to enjoy some nice Mexican atmosphere with friends, this is your place. The service is friendly, you will get your order on time, for sure. Sometimes it is a bit crowded but this is a sign of the popularity of this restaurant. I'll go there again soon.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "P9lbKhHY4hTosjIaQNH2BQ": {
    "date": "3/28/2009",
    "text": "We went here because of the Yelp reviews. It was AWFUL food! Not Mexican in the least. When I pointed out to the manageress that they don't drench seafood in sweet mustard sauce in Mexico, that in fact they don't even HAVE mustard in Mexico, she claimed the food was meant to be \"Mexican fusion.\" More like CON-fusion, said my date...That's not what it claims on the menu, which states clearly that the food is \"authentic Mexican.\" It's not. It's tired, boring and tasteless. The tortilla chips were poured out of a bag (and most of ours were crushed remnants too small to pick up any of the salsa) The salsa was made in a blender, liquidized like gazpacho more than proper fresh salsa cruda. The beans were right out of a can with no \"refrying\" as proper refritos should have had, and mine were dry and crusty around the edges from being under heat lamps too long before serving. The vegetarian fajitas were mostly square-cut carrots poured right out of a bag, barely heated through. Should have been called \"warm salad\" instead of fajitas. I sent it back to be cooked and pointed out it was missing the asparagus the menu promised and it came back ten minutes later only slightly warmer, with some asparagus bits hardly larger than a toothpick scattered in, and those were totally raw. It had no flavour and was not worth eating so I sent it back. Almost when the meal was over I asked the waiter what had happened to the guacamole and cheese and jalapenos that were supposed to have come with my order and he went and got them. 10 MORE minutes later. DO NOT BOTHER TO EAT AT THIS RESTAURANT IT IS AWFUL and about as far from real Mexican food as it's possible to be. We went because it was our 27-year anniversary and we spent our honeymoon in Mexico. I grew up in California and I am a Mexican cook myself, so I do know what the real thing should taste like. This is not the real thing. Run away. Run far away!",
    "rating": 1.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "kxf8q54lIYnPp-UMbnsz6A"
  },
  "N4lhuGkBrlZl0MdV-rGCIg": {
    "date": "3/6/2011",
    "text": "One of my friends once told me that you don't eat Mexican food in London.  We've been here twice now, and honestly I love it.  I also love to read reviews before I write my own to get an idea of what people think, and I think I've determined that people's ideas of what Mexican food should be like at restaurants are completely different.Growing up in Alaska, my experience with good Mexican food was pretty standard.  Nothing special, but I always enjoyed the flavor profiles.  After moving to New Mexico and experiencing the wonders of the cuisine there, I fell in love with the flavors even more.  Then I moved to California, where honestly, I felt like most of the places were pretty much the standard, bland, tasteless food you get everywhere.  Maybe I've never been to the \"good\" Californian restaurants, but my six-year experience of the food there basically seemed to be different fatty cuts of meat dripping in grease thrown into tortillas.  Throw some boring beans and rice on the side and you've got a Mexican dinner.  Granted there were one or two places that really elevated things, like the Oaxacan place I would go to in Watsonville that closed down, but the \"standard\" places were pretty boring.It's why it puzzles me that many reviews talk about how this isn't the amazing food in California.  Honestly, it's better than a lot of the places I went to there.  Yes, there are a few faults, what place doesn't have those?  But I've eaten here twice now, and both times I was more than pleasantly surprised with the food.The first time I went, it was with a large group.  I had the steak and mushroom fajitas, and they were really tasty.  I thought the flavors were much better than I could have dreamed and much better than the Mexican place that's near our flat.The second time we went, it was just my partner and I.  He wanted to order the duck and scallop fajitas again because they were insanely tasty the first time, but he decided he should try something else.  We decided to share some quesadillas, so I ordered the chicken and he ordered the mango, jalapeno, and Brie.  Both were quite tasty, the chicken being slightly more traditional, and the Brie being a bit more of a modern take.  He had the beef chimichanga main, and I had the street tacos (which are five mini tacos:  steak, chicken, pork, shrimp, and chorizo) with a side of the mole sauce.  I love mole, and was a bit apprehensive, but I figured I should try it.  I want to swim in their mole.  It was more chocolately and sweet than most moles I've had, but it had a background heat that made the sauce amazing.  I gave some to my partner, and he fell in love with it too.  Mine also came with charro beans (a bowl of beans with pork) and I'm going to see if I can order those instead of refried beans.  Amazing.  Also, I will be ordering mole every time I go.  I don't care if it's not traditional, it's fantastic.The drinks are tasty, my personal favorite are the rose margaritas (which are pomegranite and rosemary, seem weird, but tasty).  Nothing is perfect, we had slightly stale chips on one of the meals, but the salsa is fairly tasty.Yes, there are some strange things which aren't \"authentic\", like the duck and scallop fajitas and the Brie quesadillas, but I think they do a great job bringing a modern twist to some great classics.  Plus, I've never been to Mexico.  My ideas (and several others who reviewed this place) seem to be based on eating Mexican food in the United States.  The Oaxacan restaurant in California had some unusual dishes I'd never seen before in Mexican restaurants.  I'm pretty sure that like the US, Mexico puts a regional flair on their cuisines, and while they don't seem authentic to me, they might be authentic to others.  All in all, it's a fun place, where you can have a good time and some enjoyable food.  Just be prepared for a bit of a wait for a table on the weekends!",
    "rating": 5.0,
    "rated": {
      "useful": 11,
      "funny": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "hcAEHSo0_kgQvpKhG6UxXw": {
    "date": "3/27/2009",
    "text": "I love this place's authenticity and straightforward, tasty Mexican nosh. It all tastes amazing, and the staff are very pleasant. I highly recommend the tequila :-)If you're after something a bit more upmarket, try Wahaca (tapas-style Mexican dishes) just the other side of Covent Garden...",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Waj6YB8v-RlBfOSWTSdEsA"
  },
  "9s2er3vCKQaSZFDcwe3ZdA": {
    "date": "6/11/2010",
    "text": "Came here for a friends birthday.I love Mexican food, and the food here was the best I have had for a long time",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3_iX8wkZZu6MP_GEL-tZUw": {
    "date": "9/11/2011",
    "text": "Fun place in London with good margaritas! This was the first mexican place my husband and I tried (after moving from California). We were very happy with the margaritas and I enjoyed my fajitas. Food was good for London standards of mexican, which I know is a huge caveat but glad this place is doing well. It'll encourage more mexican restaurants to open -- maybe a bit more authentic *fingers crossed*I'd also come here just for the margaritas and some fresh guacamole and chips. There is a great bar that takes up the whole side of the restaurant which gets very crowded, but has a nice lively vibe.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eiyWzIIJhbuoF7fYWb0zeQ"
  },
  "6DwOnCCC1LZPVcKzByg9uA": {
    "date": "8/16/2012",
    "text": "What a great find, I was lucky enough to be invited to Cafe Pacifico and will most definitely be back again soon. The place was buzzing with a good atmosphere and loved the Cantina style decor.I tried the nachos, roast beef and jalpeno quesadilla and tortillas with fresh guacamole. I have been to many Mexican restuarants and I would highly recommend this one. Mexican food should have a kick to it so I loved having jalapenos in everything I tried.To wash it down I sampled the Margaritas which again where lovely. I have never been a fan of Tequila but Carlos was successful in changing my mind and learning how to drink it properly. His passion for anting customers to enjoy their experience is delightful to see.I look forward to trying more of the menu and maybe even a shot of the £150 tequila if I win the lottery!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JqK-ew_7rnsUdPPs2tYpPQ": {
    "date": "12/21/2011",
    "text": "This is a good Tex-Mex restaurant if you're looking for atmosphere and space to share with a group of friends. I particularly liked the tables by open windows, which looked very welcoming on a humid summer's day.Price-wise some items seemed a bit high - the appetisers in particular. Saying that, it is a Central London restaurant so they are keeping up with the Joneses in that sense. A bonus is that, in true Tex-Mex style, they provide free tortilla chips without you having to ask.I'm no expert on this genre of food, but I was happy with my quesadilla and the portions were decent - pretty sure I didn't finish mine and that's a rare occurrence!Downsides would be that the customer service seems to try very hard when they want to serve you, but it can take an age to grab someone's eye. The presentation on the plates could also do with a bit of work - I find that with this type of food, it can look like a pile of slop unless handled delicately.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wi4vILum7La67MCJQZMOVg"
  },
  "_CBPEThTkfwPQNnpE7SenA": {
    "date": "7/7/2012",
    "text": "Yes the place is loud and the food is very filling, it could also do with a more open layout. However the drinks are excellent and it is good place to meet up with friends before going out on the town. Service is not too bad and food comes quickly. Worth a try to see if you like it. I will back though mainly for the excellent cocktails.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymo_235aerk4mDYWGxBj6A"
  },
  "lIV97nq5E81QaCXNzdNL-A": {
    "date": "1/20/2009",
    "text": "Let's get real - this is not Mexican food.  It's totally tex mex like you would at any decent mom and pop place in Texas.  It's not wow food but it can certainly hold it's own against what you can find in the US.  The food is pretty true to its roots.It's definitely the only place in London to get tex mex.Why doesn't it get more than 3 stars?  Because though it's good it's no better than I can usually make at home (and yes, I do have some tex mex credentials having spent the previous 3.5 years before London living and working in Houston).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U9yWtQO_0LPjtaU9jN0JsA"
  },
  "2ftlJdmhbIJDCiuaGxQgtQ": {
    "date": "12/18/2013",
    "text": "For what it's worth, Cafe Pacifico is a okay Mexican restaurant. The whole meal- from the beans, to the rice to the actual pork tacos- was lacking flavour. I must give them credit for actually attempting to make Mexican rice, as many places don't even serve this, but it tasted very dry and plain. They do serve complimentary tortilla chips, which was nice. The atmosphere is very lively and loud- even on a weekday night. Overall, I won't be coming back here as the food just did not live up to par.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNtiIYMcmvRP_2bpByKLcw"
  },
  "9l1CYoBwF1o5HE_RksEJ_w": {
    "date": "3/5/2011",
    "text": "I can honestly say that I love this place. Being from California, I value mexican food and a lot of the places i have gone just haven't been up to par. This place however made me feel right back at home. I highly suggest the chicken chimichanga, it's so amazingly good. they also have the spanish rice and fried beans along with lots of chips, great salsa and the guacamole is quite delicious as well. All in all this place is great, the service is good. A few friends and I went in when we were in quite a hurry, we were out of there within thirty minutes.Great place and suggest it to all with a craving for mexican food :]",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8B7ffXY_v51fNghzc89QFg"
  },
  "bSPwjWsKzm4shvCz3_-ylA": {
    "date": "9/5/2010",
    "text": "This review is for the benefit of Americans, Mexicans, and anybody else who has experienced authentic Mexican food. Anybody who has sampled steak and kidney pie understands that Londoners do not have high standards for cuisine, so this review isn't aimed at locals.First, the good:A nice selection of tequilas, and they got my Margarita right. If I were just there to have some Margaritas or do some shots, I'd rate it at 5/5 and the review would be over.The decor and atmosphere are nice. Squint your eyes a bit and ignore the goofy-looking people, and you might be in California.Now the bad:I had the \"street tacos\" plate. One of them came with lamb. I asked the server to make mine just steak and pork, but I got them as per the menu, with lamb. I don't like lamb. The tacos came with a large bowl of refried beans, which quickly went off to the side.So I get it: they do the best with the ingredients they source locally. The tacos have lamb. The seafood enchilada is made from cod. Fine.The chips were over-salty (the standard \"sell more Margaritas\" trick) and the salsa is clearly from a jar. It tasted like Pace.If this restaurant were to listen to my advice for making this place more palatable to people familiar with Mexican food, I would suggest:- more carnitas options, please.- very few people like a big bowl of refried beans with their tacos.- it's not actually that hard to make fresh salsa, and it makes a huge difference. Just have somebody come in a bit early and chop some tomatoes and onions, and throw in a little cilantro, garlic powder, chipotle, or fresh chiles. Really, that canned stuff is nasty.- if you are going to festoon your tacos with raw onions, please cut them into smaller pieces. Believe me, I won't be kissing any British citizens while I'm here, but still.In summary: I might return if I'm in the mood for some Margaritas and light bites, but for authentic Mexican, I'll pass.I've enjoyed reading other reviews of this place here on Yelp that state, to the effect, \"best Mexican food in London.\" While I have no doubt that this is true, the phrase \"damning with faint praise\" comes to mind. \"best Mexican food in London\" is a bit like saying \"most talented member of Bananarama.\"",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "T4GOCPj5V9RC7TzQcuZPRw"
  },
  "Z9x3ezQnK78hP3LnU3qryA": {
    "date": "1/8/2009",
    "text": "Alright, so I am reviewing this as someone who lives a couple of hours away from Mexico.  I travel to London for work and I try to make Cafe Pacifico a part of the trip.  God forbid I go a week without Mexican food! I would give the ambiance 5 stars, really I would.  The interior is cozy, inviting and perfect for relaxing with a margarita after a long day.  I think Viviane's review describes it best.  It's been packed full both times I've been, which can make for a long wait.As far as the food goes, pretty average.  It will satisfy your cravings, but it is gringo style all the way.  That's ok, I didn't expect it to be anything else and it helps an Arizona girl get a piece of home while abroad.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8LqkYbwMPZmvXSsUfN8sQ"
  },
  "HmVh2jiarI4XpKffhgkwYA": {
    "date": "6/24/2011",
    "text": "This is probably the best Mexican in London, but it's a chain and it kind of feels that way. But, if you're after good Mexican food in London, I would recommend it. Have been here three times and I will go back! The service is friendly. Why only 3 stars? The margaritas in my opinion are weak and overpriced",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GxvKSeZMMSPFXBNfiMDXRw": {
    "date": "11/6/2010",
    "text": "Cafe Pacifico satisfied the craving for Mexican food, but just the littlest things could have made the place so much better.Some suggestions for improvements:Kudos on the salsa, but replace the thick corn chips with the ultra-thin kind!The chicken in my Quesada Grande was seasoned perfectly, but every part of that dish was strangely dry...fresher ingredients would have made an enormous difference. It all came out suspiciously quickly, too, so that my general impression was that it might as well have been pre-plated two days ago and microwaved to order. Especially the beans.The atmosphere was great, the servers were totally on their game.In the end though I'm really glad I split a meal with my guy and didn't pay 10+ pounds a piece for a basic mexican lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aDBbaacIo-kfZKNOpCiDcg"
  },
  "22R5CqGazP6zyuroYoKOkw": {
    "date": "3/18/2011",
    "text": "I think as a trendy-ish place to unwind with friends for dinner, this place is nice. It's in the heart of covent garden and has really interesting margarita offers like Lychee Margarita. Servers are friendly and seats are plentiful.Compared to Mexican food from Mexico and Southern California, however, the food here is way overpriced and not authentic. In terms of a nice dinner out in Covent Garden, though, pricing is decent and the food is alright. I just wasn't a fan because compared to what I am used to, the food didn't taste as rich and hearty. But! What can I expect.... we are thousands of miles away from Mexico :)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UplI21UWrE01arN0oZ5bZQ"
  },
  "u_pDiKNcfBRZddfWKMs_pw": {
    "date": "2/12/2010",
    "text": "Yeah.... no. My fajitas involved baby corn and asparagus. And one, yes one piece of broccoli. That's right folks, it was like a delicious Asian stir fry and a delicious Mexican fajita together in a totally disgusting flour tortilla marriage. Well I object. Chips were cold (read: not freshly made... or gasp, perhaps not made in house. I'm praying for the former.) And the margarita tasted medicinal... and not in that \"oh, it burns, it burns!\" tequila-type way.To end with a few hugely redeeming qualities: the salsa was actually the best, yes the BEST I've had in London. Spicy, just the right texture and very flavourful. Yum, yum, yum!Also, the atmosphere is fantastic -- exactly what a dirty Tex-Mex place should be. None of this sterile plastic-y pink, white, and neon green stuff that seems to be synonymous with \"Mexican\" here in London.Finally, the service was on it. A few missed connections here and there, but in general, I was exceptionally impressed with the speed, friendliness, and quality of every staff member I was in contact with.Overall, this was a fabulous place to hang out with a table full of my closest friends. Next time I'll just drink beer and eat the salsa by the spoonful.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "BDnM2nGBUuEij0b-Uph27A": {
    "date": "8/15/2014",
    "text": "I finally got a chance to visit Cafe Pacifico as I've heard so many great things about it. It was exactly what everyone has said...'the best Mexican in all of London!' Growing up in California as a Mexican American, on Mexican food my whole life, nothing comes closer to the authenticity of the culture as Cafe Pacifico (so far!) It offers not only great food but the atmosphere as well, ranchera musica and friendly service with a smile. The only thing missing were the mariachis! And it would have been nice to see 'flan' on the dessert menu but you can't have everything :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MVnr8jMgMg_-9QMoQr_hDA"
  },
  "sC8Qjw65xzGxvfaEUAotkg": {
    "date": "8/27/2012",
    "text": "So you wanted Mexican food in London? This place will have to do. Now that I'm back in the States, I have so many more options. However, if you just have to see that West End play *and* have your TexMex, then this place will satisfy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fhtmsQDGMTFL1qI8aOQTxQ"
  },
  "KwaHjf1m9O4RQ_7TKwPRzQ": {
    "date": "5/13/2013",
    "text": "This is one of my favourite Mexican restaurants in London! The food is always excellent and I am only subtracting one star as the service is sometimes a bit slow and inattentive. This however can be due to the fact that they are always quite busy and booking is absolutely essential on weekends for dinner.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "b1h_FtX1SPDi6TWH8YGRZA": {
    "date": "10/18/2010",
    "text": "Got to try out their Street Tacos at the London Restaurant Festival Market over the weekend.  And I gotta say, not too shabby.  Their carnitas and blackened chicken were tasty.  I loaded up on all the fixins (i.e. plenty of red onion, pico de gallo, salsa verde, etc.).  I was shocked by the number of people complaining that they didn't use any cheese, but it didn't really bother me.  If it's not queso fresco or Chihuahua cheese, it's not really authentic anyway.So, this preview made me think I might check out their main restaurant in Covent Garden.  And of course, trash accordingly.  Updates coming soon!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7lSiBklNNdbu-QE3B96fA"
  },
  "4xUK7BcUNEbG1QFwOKQx-A": {
    "date": "3/22/2015",
    "text": "Really disappointed. I have been coming to Cafe Pacifico for over 5 years. And this visit will be my last. This is not the authentic Mexican food I have enjoyed in the past. It was Saturday lunchtime, and we had no problem getting a table. Ordering was quick and the food can quickly as well. However, the food was just average. On previous visits, i received a large plate with Mexican rice and delicious black beans. This time, the food arrived in a trendy rectangular plate with a square burrito with just a drizzle of soured cream. The rice and beans were contained in small bowls, which I had to tip out in order to eat them with the burrito. I think someone has been watching to much Masterchef. The rice was bland, no way was it \"Mexican\" rice, the black beans were bland and the burrito was nothing special. If you don't know what authentic Mexican food tastes like, or have never been here before - it was an average meal. But I will search for an authentic Mexican restaurant in London and not visit here again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQX69WKi9bSJsg1L98l7bA"
  },
  "SbsM7rYNA7RovqoDzz9BFQ": {
    "date": "10/6/2010",
    "text": "I went twice to the Pacifico. First time thought it was brilliant with its wooden decoration and tequila-filled atmosphere- loved it since. The other day I suggested we go with group from work for lunch there and was absolutely disappointed:(so was the rest of the teamafter appetizer- which was served burnt- we waited for almost an hour to get the main course!!which again was not up to the expectation. I am talking here on behalf of 5 people that went with me and all agreed that MY CHOICE sucked :(I have to say though that service was polite and nice- even when we said nothing about the burnt appetizer sampler dish- the waiter came over after 20 minutes and suggested to replace 'just the onion rings' with new well-cooked ones !! we said no",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kIHG6LSUp-Ubqe9zbayzA"
  },
  "axaxxxfk8XIgPqwscPq9sw": {
    "date": "2/21/2010",
    "text": "Working double shifts in Covent Garden is quite a task for me(please dont get me started on the tourists) so its nice to be able to get out of work for lunch and find a nice place to eat some lunch.This place is just the right amount of hidden so that its quiet but not so quiet you feel the place is dead. The decor is a little strange and eclectic but somehow it works together with the fun music to create an extremely pleasant atmosphere.Im with Larissa on the disappointing tacos. Not what I expected. But the fajitas are really good and from my experience the service is quite quick most days(you do get the one random day where you cant seem to get anyones attention). The food always comes in a timely manner which is really good if you're eating alone.Overall the vibe is great. Deffinately somewhere I'd take my friends for dinner and somewhere I will continue eating on my lunch break :).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "knvmw7tsq-3yR_qOyzf4Ng"
  },
  "yuAcsi1pdcMaZD2yWZWJMg": {
    "date": "8/20/2012",
    "text": "I've never been fond of Tequila, for me it's always been that nauseating drink that's forced upon you at the beginning or the end of a night along with a dry wedge of lemon and salt. Yuck, yuck and triple yuck! However I have heard that along with Whisky and Rum, that if you avoid the horrible, cheap ones that you find littering bar shelves across the country, and find a good one, it's actually rather nice. I've tried very hard to find a good tequila bar and here at Cafe Pacifico I think I may have found it! They have a good range of Tequila, appear to be rather passionate about it. they even have a lovely certificate to prove that they have been approved by the Tequila Regulatory Council and that they are the first UK catering establishment to be awarded the distintivo T award for it's promotion of Tequila. I take this to be a good sign and can confirm that the Tequila that I sampled here, is indeed nice, in fact I might, even hasten to add, delicious!Cafe Pacifico is affiliated with La Perla, another Mexican restaurant with branches located around London. It has a very similar feel  quite rustic and down to earth, with lots of wood and chunky tiles. This restaurant, unlike others in the chain, however is not underground so it has a nice bright atmosphere and is warm and lively.The food at Cafe Pacifico and La Perla, is also very similar, expect nacho's, taco's, quesadilla's. which, although quite uninspiring, is made well, appears to be fresh, and is great Tequila drinking food!The restaurant itself was very busy (especially for my Wednesday visit), but if you go to eat rather than sit at the bar, you'll have more chance to bag yourself a seat. So grab yourself a seat and a few plates to share, and enjoy the lively buzz!Whilst not a gourmet experience, I can see this place as being a fun and friendly place, with a good vibe, perfect for meeting up with friends after work for a few drinks, or before going out on a weekend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "Q69Zr9vcQL9RWXjITVTQPQ": {
    "date": "3/18/2016",
    "text": "Place was recommended by a friend and we were pleasently surprised! Good Mexican food and good service. They had a really great special going on on a Sunday evening as well, 25% of of your bill. Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uEyA5ibwq_z2F3g0YzT3Ww"
  },
  "HeGRHGlFXO7gDibT3tCWCQ": {
    "date": "1/23/2016",
    "text": "Super overpriced. If you want to eat a lot of food then I guess it will be ok but not impressed at all. I would think that there is a lot of food that goes to waste every night.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Gw_rLYsisY7lyx3gGB5pw"
  },
  "s6ABr15oyUZ3r4DrMGESEA": {
    "date": "5/11/2014",
    "text": "To celebrate a friend's birthday, a group of 15 of us rocked up fashionably late for dinner. Good start guys. But thankfully the restaurant were really sweet and held our tables for us (they were obviously hoping for the 15-cover!) We arrived and all caught up in our raised private-feeling area of the busy and bustling restaurant. I say caught up, we shouted over the music. It was a tad too loud, even for the music and drinking lover I am! We eventually sat down after standing around chatting for over half an hour (whoops).Mexican is this place's speciality and it does do it well. I had the chicken enchiladas and they were delicious. Lovely tomato sauce, refried beans, coriander salad and paprika rice. Nice flavours, but I wanted more chilli heat. I asked for it without sour cream so I could try and get some of that (plus charging £1 extra for sour cream is completely ridiculous), but to no avail. Plus at £11 this place isn't cheap. It's in Covent Garden so can up its prices to attract tourists, but it won't pull any favours with regular crowds when it charges £17 for fajitas! I mean, THAT IS RIDICULOUS pricing for fajitas that I can cook just as well at home (I do love cooking a cheeky Mexican dish though!)Brisk service, nice food but overpriced. Tone down the music, knock off £2 from your pricing and you'll get another star from me.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpNl1ieZjanC54qQT9Y9Tg"
  },
  "ax7vEDKo8MHpcSCdRGzbsw": {
    "date": "6/18/2013",
    "text": "As a Californian, I can vouch for this place. I stumbled on Cafe Pacifico and took a chance. It was well worth it. The servings are a little small, but the food is so good. If you are a fan of Mexican beer, order the Modelo Especial. Eat here",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4k4lsXAtgDXwuyIeNOnotg"
  },
  "CUBeuOJ3Q5a47BjF0BvCfw": {
    "date": "9/6/2011",
    "text": "I think this place deserves a 5 star for atmosphere. It's just a really cool hang out to have a few drinks, eat some bar snacks and chat with friends. Very chill vibe for a restaurant.That said - the food was just okay. I think Mexican food is easy to get right and hard to get wrong, IMO.The flavors were great - but the spices do most of the work. Service was amazing and super friendly. Our dinner entrees came out minutes after we ordered.I got street tacos and this combo plate is really good, but the soft taco shells were cold and soggy. I guess nothing was that fresh except for maybe the onion and cilantro chopped on it. Came with two sauces that I liked. I think it would have been a world of a difference if these soft tacos and food came out hot or at least warm. So overall it was good, but London must not have many good Mexican food options if this one is considered one of the best. My stomach wasn't too happy afterwards either, but that's probably just a me-specific thing. Next time I come, I might try to eat off the Modern Mexican section of the menu.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Fj8TgE1OKBsg97YQEQmOGw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Street taco w beef chicken pork and fish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fj8TgE1OKBsg97YQEQmOGw/o.jpg"
      }
    ],
    "user_id": "ANVsYjL6J6irvp5qZZb9rg"
  },
  "ulshl6IchFO1K0L4GOlOjQ": {
    "date": "8/19/2012",
    "text": "if you dont know your tequilla history then this is the place to come. They even serve their own tequilla. Behind the bar is a collection of tequillas to sample.We had the best margarita i have tasted before (i've never been keen on them but this was NICE)We were also taught how to correctly sample a tequilla not the USA movie style that we all think ie salt lime shoot tequila.The bar food we tasted was lovely but we didnt really have enough time to taste properly as we were the first of the qype crawl to start there so time ran out.But i would definetly like to go back and have a margarita and peruse the menu",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "CAwshOmEGgjtJ0Xmst-ArA",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CAwshOmEGgjtJ0Xmst-ArA/o.jpg"
      }
    ],
    "user_id": null
  },
  "oZxMp0VUAD9mxidsz6XkaQ": {
    "date": "3/9/2013",
    "text": "Mexican restaurant in Covent Garden, in which you breath the mexican atmosphere.The place is on 2 floors, with also a bar on the side of the entrance room and the kitchen open at another side. The tables are very close to each other and the music is very loud, so it is a noisy place but quite fun (not exactly the best place for a first date, but good for a dinner with friends).The menu has the typical mexican food and some specialties. I took the degustacio de pacifico, that has a mixture of quesadillas, enchilladas etc, very good. Prices are moderate, around £30 for a good dinner with margaritas. Cocktails are also very good and not expensive.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jRAnL4nPczO2JvNvsTE8wg"
  },
  "TT2StNXTEjZ5GQY3NTTl1Q": {
    "date": "7/26/2011",
    "text": "For London Mexican, this place is fabulous. (Note: I am from California so I know Mexican ;-)Come with a preparedness to wait. On a weekend or an evening, you will wait.Now that that is sorted - you can wait in the bar and have a drink, which is nice. They have tasty margaritas. Don't bother with the pitchers of margaritas; they are mostly ice. Order drink by drink.Out of all the food here, the burritos and fajitas are best. If you come in hungry, you will leave full!! They do not skimp on the portions, that's for sure.You get complimentary chips and salsa - the salsa is yum yum!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VwNhTezcwcgPMbp1UoXmTg"
  },
  "0IuODfG3zrYhIHfyJOhDrA": {
    "date": "11/24/2011",
    "text": "Ahhh yet another mexican restaurant has failed me in London. The food tastes good, don't be mistaken, but it doesn't taste like proper mexican food. I was there for lunch and had the fajitas, which were tasted good, but I really missed rice with this order. Just beans, veggies, and whatever you order (in my case prawn) ist just not enough. They do have great lunch deals though as mini fajitas, which I think are pretty big as you can get three servings out of them, and 2 bottles of Pacifico go for £11,50, so not bad for covent garden. The restaurant is also cosy and offers a little hide-out from busy covent garden and long acre.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IpDVwK463yyvTimcyq_IsA",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IpDVwK463yyvTimcyq_IsA/o.jpg"
      },
      {
        "img_id": "D7gQR9g8Hd25qCf_YFHoQQ",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D7gQR9g8Hd25qCf_YFHoQQ/o.jpg"
      }
    ],
    "user_id": "B5M6l8SqwoZPSRcuMC47DQ"
  },
  "ZQLVpB17hyXjMv8WXFCLig": {
    "date": "10/25/2014",
    "text": "Came in while in town on business.  Had the special three course meal, which consisted of Lobster and Papaya Quesadillas to start, followed by a main dish of Enchiladas Suizas and finishing with Bolitas de Chocolate for dessert.  This was easily one of the best Mexican meals I have ever eaten.  I love out of the ordinary food and this definitely fit the bill.  Highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qoyoo60irqSBRxUYuwhpJg"
  },
  "MvuTyKU6uDOJI1BsbZ-O-Q": {
    "date": "4/19/2012",
    "text": "Take it from a Texan expat.  This place is NOT Tex-Mex.  It's just plain bad.  Anyone who tells you otherwise is deluded or lying.Three of us went to dinner, three meals were left uneaten.  The rice is just... wrong.  A chimichanga is meant to be crisp, not soggy.  Tex-Mex sauce should not be sour!  Who wants to eat a sour meat sauce?!The restaurant was hot and crowded.  The toilets would not flush.  The service was abysmal.  The hostess spilled my cousin's beer all over the table as she was seating us.  She neither offered to replace the beer nor CLEANED THE TABLE!  Didn't even bring spare napkins around for us to properly mop up the mess ourselves.Never... ever... again.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f2mIcHnWxSBs7KrQsnUvew"
  },
  "VWqn1vr0haWe-mXzdIS1Cw": {
    "date": "8/16/2012",
    "text": "It's nice to see that Cafe Pacifico is still going strong after many years; and thanks to the Qype Review Crawl I was reminded just why this used to be one of my favourite hang-outs. I now don't spend that much time going out in Soho and Covent Garden anymore, and somehow the draw of something new quite often outweighs old favourites.I didn't know that Cafe Pacifico is part of a little chain of quality Mexican restaurants in London (La Perla is a sister restaurant) and Amsterdam. I also didn't know that they are the only bar in London to be accredited by some official tequila authority. But then that's not that much of a surprise as I am not a big fan of spirits and have bad memories of a hangover following a tequila party years ago Tasting tequila in a more respectful way has almost convinced me to give the stuff another chance. The margarita was delicious, and I will come back from more when there is time to finish the glass.We were treated to a selection of snacks from the bar menu. They were all delicious albeit a bit messy to eat. The jalapeno taccos were drenched in cheese and very moreish, and I even triied a piece of belly pork which was served with guacamole and a red coleslaw and eaten wrapped in a soft tortilla.I am looking forward to an excuse to come back for a full meal soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "XGenWdGgdu78YiZACakSKA": {
    "date": "5/13/2012",
    "text": "California knows some Mexican food. I didn't eat here, but I tell you when the plate of sizzling hot fajitas passed by me, I knew this was possibly a legit establishment. Apparently London doesn't do Jose or Margarita mix, things you learn when searching on cinco de mayo. That being said what I had here was good:-it was free-it had Joseme gusta. will return for the food.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzvjtFHnrZZenTvjbShNkg"
  },
  "PIAHYOevSQFdTuBUGoN_uA": {
    "date": "1/25/2012",
    "text": "My boyf & I went here for a meal last night after the Yelp event at the Adventure bar. - I needed something to soak up those fabulous cocktails! Thanks to Grant T for the recommendation!We really enjoyed it - one small problemo though -  on our part - we asked for our meals HOT! Boy were they HOT! so HOT it was hard to eat...but the bits we managed (smothered in sour cream) were tasty! The place itself is pretty funky, I'd say a bit cooler to hang out in than even Wahaca's.I was in awe by how HOT they made our food, most places are afraid to turn up the heat in your meal that much! Impressive great balls of fire! Will definitely go back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "JkhKaGPedIF3fucLq5iWog": {
    "date": "8/16/2012",
    "text": "Gestern war ich hier im Rahmen eines Qype Events. Dies war die dritte Station unseres Covent Garden Crawls. Ein super Event, übrigens!! Ein großes Dankeschön an T und die Londoner Qype Crew!! Hier wurden wir von Carlos begrüßt, der schon seit ungefähr 15 Jahren im Geschäft dabei ist. Das Cafe Pacifico ist nich nur auf mexikanines Essen Spezialisiert, sondern schenkt auch viiiiele verschiedene Tequilla-Sorten ein. Darum ging es hier auch: Um Tequilla. Ob pur oder im Margarita-Cocktail  es schmeckte uns! Und heute geht es mir auch gar nicht so schlecht, wie sonst wenn ich einen Tequilla-Abend hinter mir habe ;) Die Qualität der Spirituose, die aus der blauen Agarve gewonnen wird, ist also tatsächlich eine sehr gute gewesen. Darauf pochte Carlos auch: Das dem schlechten Ruf von Tequilla endlich ein Ende gesetzt werden muss!!Das Restaurant an sich ist sehr rustikal aber gemütlich eingerichtet. Viel Holz, eine offene Küche und recht groß. An der großen Bar stehen zig Tequillaflaschen und das Personal ist bestens drauf.Ich werde auf jeden Fall wieder kommen!! Das Essen war grandios, die Margharita war köstlich (frischer Limonensaft, besser gehts gar nicht!!) und die Stimmung war super.In diesem Sinne: Muchas Gracias!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sco_v-dxIZ1FoRJlgn_Bdw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Sco_v-dxIZ1FoRJlgn_Bdw/o.jpg"
      }
    ],
    "user_id": "_TjOcbVM2Zc5lE0_m8A_nQ"
  },
  "NkXx5daQWl5cDcjnAXpDtA": {
    "date": "6/29/2010",
    "text": "A very busy and incredibly popular Mexican restaurant, located in the heart of Covent Garden. The food - fajitas, burritos, chimichangas and the like for me falls more into the 'Tex-Mex' category (ie, no chicken in chocolate-chilli sauce). There are a some beef, pork and fish dishes if you don't want Tex-Mex. There's enough vegetarian dishes to provide veggies with some choice. For starters, mains, drinks and service, expect to pay around £30 a head. We went there as part of a group on Mexico's Independence Day (16 September), and it was absolutely packed (fortunately, we had booked), and the atmosphere buzzing. I was very impressed by our waiter, who was really into the spirit of things, as well as being very efficient. It was very noisy, but that was part of the package. It's not somewhere I'd want to go all the time, and I suspect it's better suited to groups than couples wanting a quiet night out. The main downside for me was that they had a special offer on pitchers of margaritas, which my colleagues ordered enthusiastically, and I discovered that it is very easy to consume too much without realising it. Thank heavens for alka-seltzer...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_pYTNf90AKN0MoxPFXc4Q"
  },
  "C79RGKscsLatZ4XgGJ0iwg": {
    "date": "2/1/2014",
    "text": "Stopped in for some drinks and appetizers after a day of shopping/being a tourist with my boyfriend. Maybe it's because I'm a New Yorker, maybe it's because I'm a tequila fanatic, but I found the drinks to be incredibly weak; and the guacamole tasted like cardboard. Great attentive service and fun atmosphere though, and once you order an extra shot of tequila to add to the margaritas, they're not so bad. Wouldn't recommend to friends but probably would stop by again- avoid the guac.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_vevRDDalwVf7pfWFB82FQ"
  },
  "GHcpe9Du5MldpUiQHLRQXA": {
    "date": "9/13/2009",
    "text": "I'm from the West Coast State side and while living \"across the pond\" in London I got lonely craving for SOME things from home... mexican food... however in one of the most diverse cities in the world, mexican food is not something to be found... trust me, my friends I looked and looked.  When we found this spot of heaven we kept coming back!  Some of the things I appreciated on the menu:***COLD beer (not to be found in London or most of europe... no ice cubes). On a warm summer day you will appreciate this small treat!***chips and salsa. Dont laugh, but my chips, or crisps as UK says, were doriotos with cheese--- this is not nachos I'm used to*** my sizziling veggies and chicken - fajita style! Very yummy!!!The service is awesome and spacious.  Washrooms are nice too, which is always a good thing to know ladies!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lJsm_zrbNSoiqQfAWYH2-Q"
  },
  "S46GVSg203Q8wPVFzAiUgw": {
    "date": "8/7/2014",
    "text": "Good Mexican food. We were surprised to hear that the Sydney branch advertised, is no longer running, A lot like many Mexican restaurants in the US, though better than average even there. Good ambience and service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kUdYyppM03agX9EBB-nAzg"
  },
  "0y5q9UGYAiUNRIsE2GylZQ": {
    "date": "7/24/2018",
    "text": "Great Mexican dinner in London.  Dinner for 4 covered a combo platter, fajitas, enchiladas and chimichangas.  Margaritas daiquiri and a virgin Mojito.  Wonderful meal and not ridiculously priced.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YOnbb6DCiFPVkjVquRzhZA"
  },
  "iily77kQUvM7-nuE5m5fgg": {
    "date": "9/23/2017",
    "text": "Not sure if the food at Cafe Pacifico is very authentic, as I have never lived in California, but it is definitely very good and tasty.The fajitas are simply amazing. We were a group of 6 and we went for prawns and beef and both were very tasty. The tuna tacos are also delicious. We had a couple of desserts: the fried ice-cream and churros (the menu says 5 churros, the waiter told us 6 but the portion brought four). Overall we had a great  Mexican feast!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YxkA7rpo0bJapXWeYeXpiw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Churros and deep-fried ice-cream.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YxkA7rpo0bJapXWeYeXpiw/o.jpg"
      },
      {
        "img_id": "FLb4Adn80tigTl9P1F6c8A",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FLb4Adn80tigTl9P1F6c8A/o.jpg"
      }
    ],
    "user_id": "Pl7lKVLcfFC7KtJqGOcpjw"
  },
  "aUnWJG1MBJNA4OSSIggY1w": {
    "date": "7/15/2018",
    "text": "Loved the decor and vibes in this restaurant. Had a lot of vegetarian choices. I got the avocado and quinoa tacos which was a healthy option and it was good proportion and filling. Tried the mushroom quesadilla which were nothing like I've ever tasted before...absolutely loved it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bGoVBHwhVf7bX8sR1Cnltg"
  },
  "SeknlqDwXx9hlr-LUOVIzg": {
    "date": "4/8/2018",
    "text": "A long metal filament was found in my vegetable fajitas for one.  I am 8 months pregnant and took a bite of the fajitas that I had assembled.  I suspect that the filament was from the grilled vegetables.  I felt something hard and sharp in my throat and spit up the mouthful.  I separated the food from the filament and showed the manager.  He apologized and said it looked like part of the metal cleaning brush that they use to clean the grille.  He said they would talk to the cook and throw away the brush.  He took the fajitas off the bill.  I was very shaken up.  It could have pierced my throat.  I suspect that maybe there was also cleaning solution left on the grille if there was part of a brush.  The next day I had very bad diarrhea.  I think I'm ok now.  I think the baby is fine.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spqpZ_dtAvyeous3Qnkn1Q"
  },
  "RXcn0lX09rjcJRVKPOvrcQ": {
    "date": "4/11/2016",
    "text": "My friend and I came here Friday night. It was jam-packed and we were seated in an awkward spot- literally wedged next to a large group and a few meters from the steaming kitchen. I coughed quite a bit at first as I got used to it. But free tortilla chips yay!I ordered the roasted veg and beans tacos- two small sweet potatoes chock full of black beans, with plenty of corn tortillas and Mexican rice and various sauces as sides. A good amount of food for 11.75 quid. I found the food very good... amazing, no, and I still think Taqueria in Notting Hill has better food. But decent for sure.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "P5RYemqaZDjRI2KaDHWipQ": {
    "date": "2/28/2016",
    "text": "Popped in to try the lunchtime menu as colleagues have been many times and love this place. A main and a margarita for £10, great! Ordered the mini chicken fajitas (you get a lot for 'mini') and was served beef. When I mentioned this to the waitress she contradicted me and said I'd ordered beef before stomping away to speak to the manager. 2 minutes later I was brought the chicken which was sizzling so much we ended up getting a steam facial.  The waitress then barged past my friends chair to open up the windows. Overall the food wasn't too bad and it was a pretty good margarita but the waitress should probably not work in customer service! I decided to give this place another try as the food isn't too bad, what a mistake! Once again the customer service here stinks..we queried the bill as wine has always been offered to us instead of beer or a margarita on the lunch menu. She said this had never been the case so instead I provided her with the Yelp voucher to get 20% off the bill, she then laughed in our faces and stormed off to correct the bill. They seriously need to change their staff!!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_SvTPhYUjBYb3snZg3mcQ"
  },
  "2DL7J3sFeZ7CSEPP8Fs9fA": {
    "date": "5/27/2016",
    "text": "Meh. So so. To keep my review In context, I come from California where the Mexican food tastes like Mexican food :-)The guacamole here doesn't quite taste like guacamole should. It has some other spice that isn't used in traditional Mexican guacamole. I had the lunch special made of chicken and salsa Verde, and could barely eat the thing (it's one of my favorite dishes at an actual Mexican restaurant). Even the Coke was highly watered down by stale ice.I was very happy to see a Mexican restaurant after all of these days overseas, but unfortunately I think we should change the name of the restaurant to \"Mexican kind-of style restaurant\". What they did serve wasn't that great.Service was poor - tough to get the attention of a server and took forever to get food. Definitely won't be back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wk6DEWAbA31uPFyM-xpZOg",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wk6DEWAbA31uPFyM-xpZOg/o.jpg"
      },
      {
        "img_id": "ZeUY-2GOxqFl1iMlKepy1A",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZeUY-2GOxqFl1iMlKepy1A/o.jpg"
      },
      {
        "img_id": "rygqXXJYG3mngs_P9iujFg",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rygqXXJYG3mngs_P9iujFg/o.jpg"
      }
    ],
    "user_id": "8LmX92aavOhU_s_ch1rqBA"
  },
  "KUPnenQE-T-wOePvSPnpGQ": {
    "date": "12/23/2015",
    "text": "Loved this restaurant! I went in to celebrate my 19th with my mates!. I first started with adventure bar which was shit! Their cocktails were horrible then my mate suggested that we should go to cafe Pacifico. The cocktails were AMAZING!!! Great staff especially the bartenders  and the food as well was just great! . It was my second time going and looks like I'll be going there every time I'm in the mood of Mexican food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6K3Twpm2wpOEeCm5Wpxhlg",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Best cocktails I've ever had",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6K3Twpm2wpOEeCm5Wpxhlg/o.jpg"
      },
      {
        "img_id": "9IK-xA2CDVpAj5bqBT8IVw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Amazing food!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9IK-xA2CDVpAj5bqBT8IVw/o.jpg"
      }
    ],
    "user_id": "x1LYkNl7iAbRhGrDn2S_-w"
  },
  "JRnPVZHeiO2_bs1QPMEaqQ": {
    "date": "2/18/2017",
    "text": "Very good nachos and guac.  We got a couple pitchers of Margarita as well.  I will definitely be back again.  The staff were also very friendly and non-intrusive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMPvf_uQCoZoXkGDKxwNaw"
  },
  "bGdoRCS365RcxLTEGXOzbQ": {
    "date": "2/16/2017",
    "text": "I came here for lunch and the place was pretty empty. I got seated immediately and the food came out super fast. Mexican food is pretty mediocre here in London but I  kept my hopes up. This is easily the best Mexican place I have had since living in London. I would not call it \"authentic\" because it doesn't actually taste anywhere near the type of food you get in the southern US or in Mexico but it was a very good lunch meal with very fair prices for what you get.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbM756CRfiywcjtUOdhxLw"
  },
  "eTgVmREnicAfeJ406IpJ8g": {
    "date": "2/4/2014",
    "text": "This place is all about the drinks for me! They've got a good selection of Mexican beers, including my old friend Modelo and my mate's beloved Pacifico (which he likes to tell us repeatedly was the only beer he drank when in Mexico and can hardly find in London).Lucky then that they were well-stocked with these, as said friend and I managed to get through 6 Pacificos together over an hour and a half, as we waited for my lawyer flatmate to be released from work shackles to meet us. The servers kept refilling our tortilla chips and salsa munchies in the meantime, without making us feel like we were wasting table space which was nice, though the place wasn't full. We also ordered one of their 100% agave tequila shots as a penalty for my flatmate's lateness, which seemed to go down smoothly!The food is the missing piece of the puzzle for me though; there's a good range on the menu but I've tried a couple of things now and chicken or beef, enchilada or chimichanga, I've repeatedly found it lacking in flavour. They're also served with an accompanying deluge of refried beans and rice that sadly I found quite bland and too heavy to finish.The fun friendly vibe, central location and aforementioned drinks mean I'd agree to meet up there again if a Pacifico fan asked - but I wouldn't get your hopes up for the food.",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "7GleDsarB6D7mWZSppmfmA": {
    "date": "7/24/2014",
    "text": "It's so hard to find decent Mexican food in London, but Pacifico went and did it! Filling portions, option for corn tortillas all over the shop (being a celiac is hard, okay!), fast food service, AND friendly staff... I love this place!We had the beef and chicken (yes, in one dish. Heaven, I know) tortillas for two. If you run out you get more tortillas for free, but, honestly, we were full quickly! It was tasty, well cooked, and had a huge array of flavours. I honestly wasn't ever expecting to get good Mexican food this side of the pond, but it did remind me of Texas (my home town, so other yanks may disagree) in terms of tasty.We also had a couple of cocktails - their selections of mojito is fantastic! - but opted out of the tequila from the longest tequila menu I've seen this side of Mexico, because, well, it's just a Thursday dinner!Very excited to have finally found a passable London Mexican, and will DEFINITELY be back! Thank you for a wonderful meal, guys!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ozpkLDJV-WLpvCEE0hbydA",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Caipirinha!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ozpkLDJV-WLpvCEE0hbydA/o.jpg"
      }
    ],
    "user_id": "mB6XDueDo29CHNE572gqCw"
  },
  "o2miHpkfM3LXGE1KQmq3WA": {
    "date": "9/6/2015",
    "text": "My friend and I come here regularly for margaritas and food. It was the first Mexican restaurant I went to in London when I arrived many years ago, so it will always hold a place in my heart. Servings are huge and good enough, though not fabulous. Can't compare to the restaurants in the States but it's good enough to scratch the Mexican need itch.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "16z-WLNL3FydeAX0G1y8Pw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Tacos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/16z-WLNL3FydeAX0G1y8Pw/o.jpg"
      },
      {
        "img_id": "_pDa51p3IrdFhpsTrX5o_w",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Passion fruit margarita...yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_pDa51p3IrdFhpsTrX5o_w/o.jpg"
      }
    ],
    "user_id": "5dgWqgYcJPeFmRPZ5bxiQQ"
  },
  "zZw5Pph2QB88HJ5fH49-Fg": {
    "date": "4/13/2015",
    "text": "I'd visited Cafe Pacifico a couple of years ago when moving to London was but a dream and remembered them doing the most amazing margaritas. I'm trying to be a little more adventurous when ordering out so rather than sticking with one of their tried and tested dishes I opted for the curado tequila creole sea scallops with crab and asparagus as I absolutely adore seafood but don't eat it enough. As this was just a starter option the waiter suggested that I also get a portion of rice on the side to bulk it out a bit which was definitely a great suggestion.Sadly I was left quite disappointed with my choice though as the sauce while nice was very thick and creamy leaving an odd tar like coating on my tongue. The first few bites were lovely but it soon became a bit sickly. Michael on the other hand thoroughly enjoyed his chile con carne and I know that they do other dishes really well so I do still recommend this place but I left after this visit feeling a bit dissatisfied unfortunately.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vwgvK7fyM9ahSZzdKuksZA"
  },
  "MJFzO9XwYKgJGs6r0nGjbA": {
    "date": "3/9/2015",
    "text": "My housemate and I decided we were long over due for a night of tacos and margaritas. I stumbled across Cafe Pacifico on twitter and decided to book a table for Friday night. We arrived a little early and were sent to the bar to chill before our table was ready. The bar area was quite busy, lots of people eating and drinking there. I assume anyone without a reservation was at the bar claiming their place to tuck into some tacos. (Tip... do make a reservation, the bar area isn't all that big).After we ordered a Mexican Punch, we were kindly collected by our waiter and taken to our table where chips and salsa was waiting for us, WINNING! Both my housemate and I had decided what we were going to order before arriving, haha, I always check the menu of every place I eat at before going, its weird, but Oh so effective.We both ordered Street Tacos- mine with chicken, gammon and chorizo, and my housemate- chicken, chorizo and steak. There is a huge buzz in the restaurant, lots of chatting, eating and drinking tequila. The food didn't take too long to arrive, and is presented in a fun way. We decided to order a Lycee Margarita to go with the dinner. The food was pretty delicious, I'm a huge fan. Though I'm not sure I ordered enough food, I was still kinda hungry afterwards, but that was more my fault for not ordering a side or something.All in All a pretty fun and delicious night, and I will be back for Taco Tuesday.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b8GKq58rrMvGrX_XyGVi9A"
  },
  "uzX6nnDNtoxX4XGzBAqJXA": {
    "date": "1/27/2015",
    "text": "I am a self confessed Mexican food aficionado. I grew up in Florida where there is a large Mexican population, and have been spoiled by authentic Mexican food. I am also a self confessed moaner about there not being any quality Mexican in London. I fall on my sword, because I have finally found it! Thank you Cafe Pacifico!I went to Cafe Pacifico for a friends birthday and was so glad. Where to start? Tortilla chips and salsa were great, and dont forget the guacamole. The margaritas are strong and not too sweet, just the way I like them. The buckets of beer were also a reasonable price which is hard to find in London, especially Covent Garden. The portions were huge, and thank goodness for that because the chimichangas were great. It was an eat till I hurt experience, but had no regrets. Suggestion, don't wear tight jeans if you too have no self restraint. I am so glad to have finally found a place in central London where I can get my Mexican fix. Will be back very soon, for Margarita Monday and Taco Tuesday anyone?  OLE!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7hEzBcM0nHfy__xrknnPWA"
  },
  "3Aq9UxoDhi96FCUNKHYzLw": {
    "date": "11/18/2015",
    "text": "The food is ok, the service is terrible, atmosphere is lively but loud. Had the guacamole, not fresh, comes via ice cream scoops out of a large pre made pot.  Ordered the fajitas, lots of veggies, very little meat, veggies not sliced the same size so you'll receive uncooked veggies alongside overcooked veggies. After we flagged a server to take our dessert order, I also ordered a coffee with dessert. The dessert came, the coffee never did. They should be embarrassed to add an auto 12.5% service charge for the quality of their service. Shame on you. Clearly from my experience this will not be a repeat for me.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cuo9AP3fdlMHg4j16ToHAQ"
  },
  "9dOxqYIatBw_Jutrj6wjDQ": {
    "date": "4/26/2016",
    "text": "My lunch was a very disappointing experience in Cafe Pacifico! Their lunch menu was inexpensive, so that's the only good thing. But I'd rather pay double for an authentic Mexican experience. I am from California and I love/know my tacos, so I chose the California tacos. That was a mistake to think that perhaps this place will be authentic cause of the name and basing on ok reviews on Yelp. My minced beef tacos (I should have known, this ain't carne asada) tasted like Taco Bell tacos. If you are from America, you know what I'm talking about with its crunchy taco skin and minced beef, even the cheese and lettuce resemble it. The rice was awfully dry and didn't taste anything remotely close to real Mexcican food. What is it about Mexican eateries in London do not know how to make real Mexican rice? All they have to do is first fry the rice with with vegetable oil (I know it's unhealthy but that's how they cook the real thing), tomatoes, garlic and onions, then simmer them until rice fluffy. If you are a fellow Yankee Doodle living in London and miss Taco Bell, go for their beef tacos in their lunch menu. Their fajitas and everything else looks similar to Chevy's or something like that in America.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2rgLbHvB_CHywTUrmOwvw"
  },
  "w6EfiFtXvoJKbBjE_B-KpA": {
    "date": "7/6/2015",
    "text": "Nice food, friendly atomosphere",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q6NyEAMeJus-N5mXVN3Vnw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. Chimichanga",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q6NyEAMeJus-N5mXVN3Vnw/o.jpg"
      }
    ],
    "user_id": "7oKlbqEu43WKvzXLoq3Srg"
  },
  "1X4VezfoaifkRmInVIFV7Q": {
    "date": "1/16/2011",
    "text": "I'm always looking for a new Mexican restaurant that will somewhat match the fantastic Mexican restaurants that I love in the states...  I happened to be walking from Leicester Square toward Covent Garden when I noticed the sign sticking out on a side street.Immediately I liked the interior, although the music was a bit on the slow side on this particular night, the atmosphere was good.  My waiter could have been a little more attentive, but overall the service wasn't too bad.The salsa was wonderful and very spicy!  The chips though were super salty...make sure to get a glass of water...  I ordered the Canelita Margarita.  It is a frozen margarita with apple puree.  It was kind of like a frozen applesauce, but surprisingly refreshing.  A word to the wise, take the gi-normous cinnamon stick out of the margarita before drinking; it will save you from sucking up the bits that eventually fall off.I decided to have the enchiladas with chicken...  I liked the enchilada sauce, but I just wished they would have seasoned the chicken because the chicken was bland and dry.  The rice...even worse.  It just looked like brown rice, it had a little bit of flavour, but I ended up mixing a bit of salsa into it.  The refried beans though were fairly good.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N053SwcEer68AR6SZS4QYw",
        "caption": "Photo of Cafe Pacifico - London, United Kingdom. The Canelita Margarita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N053SwcEer68AR6SZS4QYw/o.jpg"
      }
    ],
    "user_id": "GIjIJxRZs5cCjwW9iJFzMg"
  },
  "kyV2TUWDpYZhBA0FgYrQBg": {
    "date": "11/18/2008",
    "text": "Cafe Pacifico is always a great fun place to dine. Start off in the bar with a cocktail, if that is your thing, then once at your table get stuck into the tortilla chips and excellent home made salsa. The food is of a decent standard, and the starter in particular are always great, though as a note of caution I invariably find myself too full to enjoy my main, so consider sharing!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "A2sBYdhazpvFWo14_jMiVQ": {
    "date": "5/21/2007",
    "text": "A little piece of MexicoThere is a little piece of Mexico hidden away in a quiet side street in Covent Garden. The restaurant is lively and has a fun atmosphere - it is decorated with Mexican memorabilia, and is rustic. The food is filling and quite good value for London - it is the best Mexican food I have ever had, and this is the only place I would go to eat it. I've been going there for over 10 years now, and it is still a favorite. Great for parties, groups, couples and families in the daytime or early evening.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cJ9MPGs3ygDFn96LkHMTqA": {
    "date": "12/9/2009",
    "text": "Great place. Fajitas were excellent. Beef was juicy and tender. Very busy - recommend reservations even on Monday and Tuesday.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3_QNVGR8KczE5IZ4tPLiA"
  },
  "GpGuEPQaJpKDRc8wpDNieg": {
    "date": "5/28/2009",
    "text": "Love this place. Authentic Mexican feel, the food is great the cocktails and wine are great and the service is great. It is a buzzing little place which is packed out but this adds to the lively, fun atmosphere. The food is delicious, nice and fresh and you can see it being cooked in the kitchen. The whole place just feels so energetic which makes the whole dining experience thoroughly enjoyable. I recommend this little taste of mexico to any food loverfajitas every time!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3ON2_W3Fvd_Ipo0pJl-nHw": {
    "date": "11/25/2007",
    "text": "This place has great mexican food. The restaurant is fantastic. It is often very busy at night but the marguaritas are the best. They have a big range of food from which you can choose from. When I was there I didn't know what to eat as there were so many things to choose from. The waiter recommended our meals and it was fantastic. The cocktails were great too. The atmosphere is vibrant and fun. This is the place to be.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FLs2VJtJNXi5SaQ4FfingA": {
    "date": "11/20/2008",
    "text": "Really good Mexican restaurant. Good atmosphere and the food is always great. Good selection of drinks.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ULe5g6CbFR37l9RhAfy5Nw": {
    "date": "2/25/2008",
    "text": "This is not an authentic Mexican restaurant, if you see enchiladas made with flour tortillas or any mention of duck and soy sauce, you can safely say that you will not have a an authentic Mexican meal. The food is overpriced, 5 pounds for squashed avocado. You would think that for those prices they would make their own maize tortillas, it isn't exactly rocket science. I struggled to find anything in the menu that reminded me of good old home cooking. If you are a Mexican then stay away, if you've never tried Mexican food then this restaurant will not change this. If you want a taste of authentic Mexican cuisine you would be better off walking to Wahaca instead.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vJXctMbPrGVlhmet5YMgbA": {
    "date": "11/30/2007",
    "text": "The £10 lunchtime special at Cafe Pacifico is pretty hard to knock. A choice of main courses and two bottles of beer (or a margarita) will satisfy most people. The Chimichangas are superb, as are the Enchiladas. But no matter how good the lunchtime special is, it is the full menu that will tempt most people to return. The Taquiza, although on the pricier side, is awesome. The Street Tacos, Burritos and Alabre Tepoztlan are too. Even basics like the Chilli-con-carne are top-notch but might prove somewhat fiery to many palates. Vegetarian options are available, but limited. Best bet to non-meat-eaters will probably be the Tostada. The bill can sometimes take a while to arrive but then that's probably because the staff know that movement shouldn't really be attempted on such a full stomach!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "YvAcpnk4BD8kysCi0G_6-w": {
    "date": "6/3/2011",
    "text": "There's a lively atmosphere in here and the food is fantastic. I have not yet found a better place for Mex in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uICsrNpQNpT0_mPjSHD57Q"
  },
  "LUK609JZHbNK2YhvYKtAsQ": {
    "date": "2/17/2008",
    "text": "Though the wait at Pacifico can be forever on a Friday night -- I think we waited about 2 hours despite a good deal of negotiating with the hostess -- you can at least hang out in the bar and get some drinks and appetizers. Careful, though, the bar area will be packed, too. The 25 year margarita was my favorite, though there were some others that sounded good, especially since they had a decent tequila selection. They also had a decent selection of Mexican beers, including Negro Modelo and Pacifico. Though some of their menu items are decidedly inauthentic, and they know it, the fajitas are good and the salsa is spicy. I'm still looking for a place in London that makes its own tortilla chips, though.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cIljhfCsCNmnxwgJKdqiow": {
    "date": "7/11/2008",
    "text": "Cafe Pacifico is the best and most authentic Mexican Restaurant I've been to in London so far. Don't fall for those other cheap chains with inticing 2 for 1's or the tex-mex wannabies that pop up every now and then. Chimichangas are always a winner, burritos, enchilladas and quesadillas are all awesome, guacamole is top notch be naughty and try a sopapilla for desert. They also serve tex-mex incarnations, such as nacho cheese platters, which I've tried but not really enjoyed. Although their homemade salsa is very nice. As for drinks, Mexican beer is so underrated and No! Corona is NOT a Mexican beer!!! Negra Modelo seems to be the drink of choice for most of Pacifico's patrons, as it was mine, until they brought in Bohemia. I'd only had it once in San Diego a few years ago but my tastebuds have longed for it ever since. They have a special lunch deal where you can one of the popular mains for about half price at £6 or you can have 2 beers with you main for £10. Otherwise mains will set you back around £9-13 excluding service charge pocket change for the orgasmic taste you will be rewarding your stomach with. 5/5, I'd give it 6/5 if i could.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JR68Ims8r9I7yf9cMd_NzQ": {
    "date": "2/1/2013",
    "text": "My friend and I got extremly ill here - quiate a few years ago now.    I had to catch a plane the next morning -- threw up the whole way over the Atlantic.  She had to catch a train home and ended up doing the same thing!  Terrible.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPLBAzqxfIEmPvKCqNc54A"
  },
  "cYhB-1czFtsu1PH4p1QZYw": {
    "date": "6/16/2010",
    "text": "I had heard a lot about this place before going for a meal and had been craving a Mexican feast! The restaurant was packed, and judging from other feedback this is generally the case. We squeezed to the bar and had a few beers while waiting. The atmosphere was buzzing and the place was heaving, defiantely more suitable for a gang of friends on a night out rather than a romantic meal. When we finally got to our table service was friendly if a little slow. The food was.. well actually nothing that special. Mexican food is hard to get completely wrong and and didn't think this was any better than I would easily do at home. I wouldn't rush back.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gIWwTyHCRhuiyHNY2MK8fQ": {
    "date": "11/17/2008",
    "text": "Best advice about this place is to do mid-week and book a table in advance. The food is OK to good, let's face it most Mexican restaurants seem to serve the same ingredients - tortilla, tomatoes, beans, avocado - in different combinations over and over again. The drinks though are great, especially the frozen margaritas. Enjoy the vibe over dinner, then pop next door for cocktails at The Langley - much more civilised.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HiXuhQdHHvEnNcKerLrOaw": {
    "date": "9/18/2009",
    "text": "This place has a lively atmosphere, but is below par compared to restaurants serving \"mexican\" food in the US. If you don't know any better, then you may like it...and I would know since I am mexican. Also the service tends to be shoddy (I gave the place two chances)...last night when I was there the server essentially tossed the food and drinks on the table and never asked if we needed anything.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4dTzfNaT2f7CD6EhXMjtQ"
  },
  "6ehS-P6oNseDHp72RAnKnQ": {
    "date": "8/28/2010",
    "text": "Possibly the best Mexican restaurant in London...amazing food and cool sounds...Chimichangas and Dos Equis all the way!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-gzhaINCn5lU-RfD4Gs6wQ"
  },
  "a6muT0UtMwqdw6lFystqcA": {
    "date": "10/29/2010",
    "text": "I see that a lot of people find the drinks to be a novelty - but if you have any expectations higher than a home made Old El Paso, like I did, you will not only be disappointed, but you may also have some digestive discomfort. Upon entering you will be herded towards a crowded bar area to buy some expensive cocktails, which on an empty stomach churning some after work drinks may seems a little undesirable, until out of boredom decide to pony up for a pitcher of cocktails, which turns out to be a jug of ice with some booze in it - somewhere. When you finally sit down, by which point you are so famished you feverishly devour a bowl of salty tortilla chips. The menu is strangely repetitive, and the variations between tacos and tortillas come out looking exactly the same. The refried beans looks like something you would find in a joke shop, and probably tastes the same. The rice is also refried. The beef 'tacos' I had were also greasy, and incredibly salty. My friend who had the chilli con carne was very reminiscent of a Bombay Badboy from the Pot Noodle range. When the bill arrives you start to wonder why you didn't go to a real restaurant, and instead spend the rest of the evening in isolation so as not to upset people sat within a three metre radius of you. Adiós Cafe Pacifico.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qoXZBCW39ct4hy0N2LHWLQ": {
    "date": "5/1/2010",
    "text": "A month into our move to London from California, we thought we'd venture out and give this Mexican restaurant a shot given that it got good reviews in one of our restaurant guide books.  Big mistake.  We obviously had eaten good Mexican food too recently to find anything redeemable at this place.  For the time being, I will stick with the Whole Foods Mexican section and my own kitchen.  Much better Mexican food!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4wTV600BZbl6XEUk4FXIrQ"
  },
  "oIpOtuwHLu65LOi6B2-3aA": {
    "date": "1/17/2010",
    "text": "I recently dined here with a few friends. Despite its convenient location (moments from the tube station), I wasn't really taken with the food. The service was ok, but the atmosphere was a little too crowded for me. Wouldn't go back.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Foh6zyPRltdbl_qCiq9_jA": {
    "date": "2/22/2009",
    "text": "If you are in Covent Garden around lunch time and have a craving for Mexican food, this is your place. It's cafe style, fajitas, burritos, and tacos. Good authentic flavors. A lively bar with a variety of tequilas (no self respecting Mexican bar would only serve Jose what's it's face). I'm constantly explaining to both Brits and Americans the vast difference between real tequila and that synthetic shite...",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YuZ6h2UoptT5tLt6IosJ2A"
  },
  "hMaC7isSAXnfNgDMevKZ2Q": {
    "date": "3/20/2009",
    "text": "Two years after the fact, this is the only restaurant that I really remember from my trip to London. I felt like I was back home in California. Tequila selection is good . I could get a real cocktail for once (a girl can only drink so much beer), and all of my Americanized Mexican favorites. It was expensive, like everything else in London, but I managed to go there twice during my three-week visit. Just be prepared for a long wait.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qk7VYrdD9epr0povsGolMQ"
  },
  "QYNim_-DHT7syRYTTiUsbQ": {
    "date": "6/7/2012",
    "text": "Friendly atmosphere and good service. The staff are quick and attentive. The cocktails were very imaginative and tasty. The food was fresh and served promptly. overall, a pleasant, quick and good value-for-money dinner",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8RpjXUPycjvebFisSnpC3w": {
    "date": "10/14/2009",
    "text": "Too loud and bad service but great Tex-Mex (for London)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxHRNMRfwoPvjDlJwnswkQ"
  },
  "0Et7bJJ5FOab_IJO7VAsVw": {
    "date": "8/22/2009",
    "text": "It was a busy place since there is not alot of Mexican rest in the area of London.  I went in there and craving chips and salsa and ate a few bowl and it was not the best but it was better than I expected from a London tex mex restaurant.  The cheese enchiladas were not very good they were too sweet or something  but the chicken enchiladas  definitely were the best thing they tasted farther than i expected in a central London mex rest..  The waitress made me some amazing sweet brewed tea with lemmons- I have to love her for that.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mByNLalfzOdB5gngAWR4fQ"
  },
  "zI_MKKDR0ad7mqxrrnKSrA": {
    "date": "1/10/2010",
    "text": "I love this restaurant! Big portions, delicious food and stellar margheritas. All for a nice low price. Oh and try the Sopapillas dessert - it's a winner!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WbXrujVj0jcDd4xaeApEjQ": {
    "date": "2/28/2009",
    "text": "My Valentine and I dipped our chips into the salsa and were instantly transported back home to Texas and Arizona (respectively), as a mystery ingredient instantly triggered childhood memories of family barbacoas and drunken pachangas. Apart from the accents of the servers and the strange white sauce on my enchildas suizas, this was pretty damn good Tex Mex, in Covent Garden, of all places!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwFMbKklySC3yxf5M4y85Q"
  },
  "iO8ZKCcV2WADznsxKWmNeA": {
    "date": "10/7/2008",
    "text": "Love, love, love it! Cafe Pacifico is just fantastic. Always busy (even on a Tuesday which shows how lovely it is) and always good quality, tasty food. The waiters are great at explaining dishes, helping you choose, and are so accomodating if you want to make slight changes. Went there for a meal with a friend who had just got engaged and arranged with the waitress to bring over champagne as a surprise, and open it as the friend arrived, which she did with perfect timing, and joined in the congratulations, which was so lovely and friendly. I keep returning to Cafe Pacifico - both for the lovely food and the fantastic cocktails. Ok, it's not cheap, admittedly, but you won't go wrong for a fantastic night out in London.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}