{
  "0JwwzlSUIWWrAxTsX84bZg": {
    "date": "2/12/2011",
    "text": "yes the staff are rude there - they're fed up with the customers who wont move aside for other customers - just get out of everyone's way and you ll be fine! :-) When they found out that I am deaf, they were extra patient with me explaining which is which :-)Don't trust the labels (they are so disorganised) - DO ask the staff which is which - once I pointed at the buns, ending up bringing home the wrong ones!The buns there were always great - the drawback is that they go hard in a day or two so don't order a lot of buns if it is for yourself to last a few days or even a week!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2hqOHhLVom33vhK9COfGOw"
  },
  "mYOX49MBzSEy24OjqOXaKQ": {
    "date": "11/28/2010",
    "text": "This place is terrible, I was hurried along and I ordered 2 egg tarts and was given a price slip immediately.  I wasn't given a chance to look at or order anything else while my girlfriend was rudely shoo'ed to the side to make way for some unnecessary shelf adjustments.  The egg custards were not good, the crust was hard and the custard was passable.  Service is clearly lacking in the place and they'd care less if they had my business.  I took my business elsewhere for buns.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "22oIJGWqtkx-mKGeh66Z3g"
  },
  "s89mxCC4TAiZkaVYk2316g": {
    "date": "6/24/2012",
    "text": "decided to do a taste test of the pork buns of here vs. golden gate, and I do prefer here better.  sweet savory is a good ratio, no gristle or fat.  back in the states, we can get these in chinatown for $1.  prices would be better in london if all the numbers listed were 1:1",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kS1MQHYwIfD0462PE61IBw"
  },
  "G2zqeaHyTpwZ3qu_v7qolQ": {
    "date": "8/20/2012",
    "text": "MEH we just ate here since we were hungry and tired from all the touring we did. The food was OK but I have to say the service is pretty crappy. But what can you expect from a chinese restaurant in china town? I had a bottle of water on the table and one of the ladies scolded at me saying that we can not drink anything from outside and that we MUST order a drink from the menu (they charge 1.5 pounds for still water). You can say it nicely then I will understand but if you scold me like that I will not be a happy customer!   l:O",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0OMqihDIKOvMMdsq0j5U1Q"
  },
  "rQI0I8UsE-jrrlqNwy1F8A": {
    "date": "3/16/2011",
    "text": "After eating at another buffet restaurant around the corner I said we should try this place as through the window the selection of food looked nice. I'm sorry but this has to be the worst chinese buffet I have ever been to. The food quality was of the lowest standard and the staff just seemed interested in a group of students, in case they left without paying, instead of looking after everyone. I gave it one star because of the free refills of green tea and thats it. Avoid like the plague if you value your taste buds.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yxfgTXNUf7SHsKtYmNOzww": {
    "date": "7/24/2010",
    "text": "Restaurant - buffet, but with very poor selection, brusque service and huge amount of bone/gristle in the meat. Poor quality overall, however the chinese tea was good. Bakery - used to be a lot better than it is now - as a previous commenter has said, buns were dry and a bit lacklustre. Much prefer the cakes in one of the supiermarkets down Gerrard Street further.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_QDwJWDGtZpihtBbJ8ZcvQ": {
    "date": "10/27/2008",
    "text": "Yum. Kowloon Pork buns.so good I dream about them. Cheap too, like everything in this bakery! People will happily cue up to buy all manner of goodies from this place, if you taste the goods you'll understand why. If I am in the area I can't help but to drop by and spend the last couple of quid in my pocket on these porky fluffy pillows of loveliness!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XzeRdMfOUvSgBgWQbTzPGw": {
    "date": "12/20/2007",
    "text": "Authentic Chinese bakery in the heart of Chinatown, this is quite an institution. Small and unassuming, it has recently had a customer-friendly refurb adding a buffet restaurant next door. This place used to famous for its abrasive Chinese service but has mellowed out recently! Nevertheless the cakes and pastries are delicious and the finest you will find in London for Chinese baked goods. Its all about the Char Siu (BBQ Pork) buns. Be warned, they're addictively tasty...",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "v7bZWAiYBhe5BG-Mjoq7Og": {
    "date": "2/10/2008",
    "text": "I have just left the Chinese New year in the West End and I am very annoyed at the Kowloon restaurant... Firstly members of my family had been buying food there for around 20 years and we never had problems... Than today I have just been charged £10 for 6 cakes...Yes I said 10 pound for 6 cakes, this was outrageous overcharging. If you are wondering what I ordered it was 4 dan tarts and 2 moon cakes... I have bought cakes from this store often and these cakes would normally cost just under a fiver... So why did I purchase the cakes at this high price... I was at the front of a long que and there was a number of people behind me... I paid but that is the last time Kowloon will get my money...",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "os6rZupiYVXhAJSnqpAN4w": {
    "date": "11/1/2010",
    "text": "In all honesty the food is of a very poor quality and the drinks weren't exactly cheap.. they even charged us 50p for a glass to drink tap water in. The only redeeming feature of the buffet was the cake which was ok. The service was quick and friendly although we were watched like hawks for the entire meal.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VI2l3ip_iHTipgf_SIQkpw": {
    "date": "2/22/2009",
    "text": "Visited The Chinese Bakery in China town a few days ago, I must addict the cakes and pastries look nice from the outside but after purchasing some and tasting them myself, the quality is very poor and average. The buns are very dry and lack the extra topping, also the coconut buns is plain and hardly any filling inside. Usually they are supposed to be full of content inside it, yet it looks like nothing in it. The swirl rolls look interesting and colourful, yet hardly any cream and dry and plain to the bone. You are better off buying chinese cakes and buns from a major Chinese supermarket as for it tastes much nicer and the quality is very good. Also, the customer service there is extremely poor, I was completely disappointed with the lack of customer service in there. The staff don't wear staff uniforms so you get confused on who's serving and who's a customer, because they dress like a normal consumer! Also, you can't pay by card so all payments are done by Cash only, which was annoying. I was really expecting high expectations from there, however after going there once I'm never going back there again. I rather go to the other chinese bakery down the other side of the street called the Golden Gate Bakery.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rEspYozUnHKnAugf9aF07g"
  },
  "Sif0y8XdXMBFb8lSkGCCfg": {
    "date": "5/24/2015",
    "text": "We're tourist and decided to try the restaurant buffet.  What a mistake!!  They were half empty and yet they sat us in a drafty table and refused to let us sit at another table because it sat 4 and it was just my husband and myself.  Normally we would walk out but we were too tired to argue.  Then it gets better, there is a sign posted at your table about charging extra if they feel you are wasting food!  Last time I checked, it was a buffet!  To round out our horrendous experience so far, the food was nothing special and the wait staff sucked!  The waiter kept walking back and forth like a caged animal and refused to take our plates until I said something!  Stay away..they don't want your business!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C854n7ZbuUg-yJF9N26I2w"
  },
  "c-EjBBJ9CIxVajkHnk6xjA": {
    "date": "11/7/2010",
    "text": "As a non-European visitor to London, one of the most frustrating things about visiting this amazing city is finding an decent and inexpensive place to eat while on a tight budget. Fortunately, London's Chinatown seems to be the neighbourhood my family and I turned to whenever we did not want to spend more than £7 on a dish. I came to this Chinese bakery recently with my friend and we got a few snacks.We got some Daan Taat (egg tarts), Gai Mei Bau (Cocktail bun), and some Coconut tarts. Each piece was around 90 pence, which is fairly inexpensive for an expensive city like London. The Daan Taat was pretty good, tasted almost exactly the same as some of the best Daan Taat in Boston's Chinatown. The Gai Mei Bau was also pretty good and a couple pieces could make a filling breakfast. Inside was fairly sweet and the bun itself was soft and chewy. It tasted almost exactly the same as some of the best Gai Mei Bau in New York's Chinatown. As for the Coconut tarts, they were also pretty tasty, and I enjoyed the sweet coconut flavour. I also came back for a second visit to get a Cha Siu Bau (Roasted Pork Bun). It was probably the most expensive version I had to pay for it (about £1.70), but this is London. However, it was fairly big compared to the versions I had back in Boston and about the same size as the ones I had in Toronto and New York City. The bun was pretty tasty, soft and chewy on the outside, and meaty and flavourful on the inside of the bun. Overall, this is a pretty good place to get some inexpensive Chinese bakery staples in London's Chinatown, and I would probably come back again if I do not want to spend more than £4 on breakfast or lunch.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DdAiRoHXi-I9rh7vNSd21Q",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DdAiRoHXi-I9rh7vNSd21Q/o.jpg"
      },
      {
        "img_id": "71wq15jdGRrk_7HUIDYamQ",
        "caption": "Photo of Kowloon - London, United Kingdom. Coconut Tarts - .90 a piece",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/71wq15jdGRrk_7HUIDYamQ/o.jpg"
      },
      {
        "img_id": "CeRgQnOmRjZJDbGrLYkTeQ",
        "caption": "Photo of Kowloon - London, United Kingdom. Daan Taat - Egg Tarts - .90 a piece",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CeRgQnOmRjZJDbGrLYkTeQ/o.jpg"
      }
    ],
    "user_id": "DeqIeM5LTAC4MmYLtJxn7Q"
  },
  "TWFvrvTf0BwOfsKVgIS7Wg": {
    "date": "2/22/2013",
    "text": "I love this bakery!The quality of Kowloon's pork buns and sausage croissants is excellent. The dough is light and pork filling is super sweet - making the perfect pork bun! However if you are westerner you may be shocked by the sweetness of Kowloon's pastry. A lot of Asian breads tend to be very sweet. However, if you can get past this - you will be able to enjoy these little delights!Kowloon reminds me of many Asian bakeries in Singapore and Australia.These types of bakeries are littered everywhere in Singapore and Australia!  I was determined to find one in London, because I missed these bakeries so much! By comparison to Singapore - Kowloon is just as good! You have to try this place next time you're in Chinatown. I certainly will be going back for more!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wg9V4sE_N3aWwuzwGvO2vw"
  },
  "8m43oc_4QDIc-5oDx0ZlRQ": {
    "date": "5/8/2013",
    "text": "Great selection of baked goods here, so many to try!On my last visit we were just in and out, which I really appreciated as the place was full of people waiting for their pastries.  The workers were efficient in the process.  And everything we got was quite tasty!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wq9YJt-k2o7ILJBSMKAxPg"
  },
  "JqMsgZ0F9DIpayXZ-I1rbQ": {
    "date": "1/1/2012",
    "text": "The display of sweet baked goods always lures me in, I just can't help walking in for a treat.I have fond memories of this place as my late aunty used to be good chums with the owner, as a kid I was fortunate enough sample EVERYTHING! (:They definitely have the widest selection of buns & cakes in Chinatown, sesame balls, egg tarts, pork buns etc etc.As already mentioned, it can get busy in the little corner of the bakery, just make sure you've decided what you want & take your pick. The hustle & bustle is normal!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "E2YSjkXiJA1_QItm-lj8Fg"
  },
  "9RDEGMNo8ln_dlYVMGCUqw": {
    "date": "7/10/2011",
    "text": "First off, this review concerns the buffet portion of Kowloon. Reading previous reviews, I assumed this restaurant would at least be bearable. I was woefully mistaken. Entering the dim, slightly dirty establishment, we had our first doubts regarding the quality of the \"food\". Motivated by previous comments on Yelp, we soldiered on and found ourselves quarantined in  the back corner away from all other recognizable signs of life. Although we were excited about the buffet aspect, we were unhappily met with signs informing us, a la our grandmother, stating that if we didn't finish the food on our plate, we would be punished and charged a \"food wasting\" fee.This proved a genuine challenge when we found the food to be utterly unpalatable. I do not mean to be witty -- this stuff was nasty. As I recall, amongst all of the soggy fried badness, there was only one green, yet seemingly brown vegetable to be seen. And what unhappy \"broccoli\" it was. Ultimately, not only were my expectations of this well reviewed restaurant thoroughly belied, but I'm convinced that the other reviews were written by family members of the owners. Do yourself the personal favor of frequenting one of the many other restaurants in the area and save yourself the heart burn / ache. You can thank me later.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gnG_eMuiBfUUfm3K87Aefw"
  },
  "mzjjPn_szTYwjWxHQEirag": {
    "date": "7/5/2011",
    "text": "I never know what to order when I go to one of these Chinese bakery type places. Most of them just don't seem right, as neutral and unbiased as that sounds. And whenever I go eating with my Chinese friends, it's almost always for dimsum or real food. But then last weekend I met just the right person; a fine Englishman, who wanted to run home in anguish after the London Pride parties in Soho made him borderline claustrophobic. \"Would you like to pick up a Cha Siu Bau?\" he asked. \"Would I what...?\" I replied, and in instant recognition of my Chinese bakery evangelist, I jumped at the idea and him lead us (there were seven of us) to Kowloon on Gerrard St, which was teeming with even more human flesh than Soho.We wriggled our way into Kowloon as we received half baked greetings from the demi attendants who were not amused by the mass intrusion of what looked like decisively low revenue targets. An aggressive Chinese woman asked us what we wanted and before the answer was attempted in full, there was a paper box taped up with a threatening bill for a little lesser than £10. The appearance being one of an overglazed bun, I still couldn't figure out what the big deal was. The first crunch revealed sweet bread, the sweetness coming from the glaze, which as an afterthought was just about right. Sweet tenderloin oozed out of the core of the dough which an elegance almost characteristic of the finest chocolate fondant I've had in Paris. The cornstarch from the sweet syrupy sauce played in my stomach for a minute reminding me of the steamed cousin of this baby I'd had, albeit inadvertently ordered, in Chinatown, Manhattan a few years ago. Loved, loved it!! I'm a fan!The chinese totally know how to stuff their bread.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "UsZ-9xcfubD8j0dUR7ke5Q"
  },
  "x0o0oYIeI8eF0TNT4Qg6SQ": {
    "date": "3/23/2011",
    "text": "I have a bit of an inferiority complex. I am good at shopping in Tesco, I know how to do it -- but anywhere else I feel inadequate. Especially in this place -- because it's a bit bizarre.Firstly; when you arrive in the door, you get ignored for about six minutes. But you're not allowed to grab at the food yourself, they get it for you.And eventually they notice you. But you're a dumb ignorant English idiot, like me, so you don't know the name of what you want or what's in it --- so you do the pointing thing. You point at the thing. They pick up the wrong one. You point at the other one. They think you're retarded. You get what you want, they put it in a little bag and they give you a little slip of paper to take to the cashier. You hand over the slip, but they want the food item instead. Unless;You hand over the food item.In which case they want the slip. And you're just pathetic. You have no idea how to buy one of those round things with the seeds with the stuff in the middle. But they taste so nice. And you keep going back.",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 24,
      "cool": 9
    },
    "photos": [],
    "user_id": "CpqbhptBIhSI9t0dukZdjQ"
  },
  "862w5gIzb8EIrlp0A9v5Ig": {
    "date": "1/9/2016",
    "text": "The bakery in front of the buffet restaurant is great. I've never gone past the bakery into the restaurant itself, but the barbecue pork buns, custard buns, red bean mochi, and sweet lotus pastry are fantastic. The service is too quick to be friendly, but the food is delicious and almost never more than £1.5 per pastry. Perfect for a quick pit stop, or as a reward for making it through the commuter and tourist crowds in the morning.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QuVnT5HGoPQGowDLQjgRMA"
  },
  "zRMWA23L7KFliqnZ9Y5nYw": {
    "date": "6/28/2014",
    "text": "Best Chinese bakery in Chinatown. The prices have hardly gone up since I was a kid, there's a great selection. Personal faves are pork bun, curry puffs, and egg tarts. There really is no need to try the other ones.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INVx3MKlgB_uMR4KmuYAgA"
  },
  "uuQBjlFWm5TFF7pb3MjirQ": {
    "date": "1/22/2012",
    "text": "It's difficult to take a step back when one has tasted perfection.  So is the sad case between me and the egg custard tarts at Kowloon.I hold all Chinese egg tarts (dan tat) to the standard set by Golden Gate Bakery in San Francisco.  I want a delicate, moderately eggy custard, not over-sweet, with a nice, flaky crust that seems to be on the verge of submitting entirely to the yellow joy encased within.These did not hold up.  The crust was too thick and pie-ish.  The custard, too thickly congealed and devoid of the taste of the chicken fruit I assume was used in its creation.I also had a crispy red bean bun which was tasty... But honestly, is there actually a way to screw that up?",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yao2uyKHomW9MdLHI1BKAQ"
  },
  "nzNCjOl3SPDQ6lovZmxohg": {
    "date": "4/6/2009",
    "text": "I am reviewing the cake takeaway section of Kowloon, not the rather generic looking buffet restaurant of the same name next door.I love looking in through the window at the treasure trove of  Chinese buns and cakes just to whet my appetitie. There is a small cafe seating area but most people come for takeaway.The space just inside the door where you place your order is rather cramped and it can be sometimes hard to see what is available in the myriad trays. However, the queueing is generally good-natured if a little po-faced at timesThere are some savoury pies that will do for a light lunch like beef curry puff and some dishes that are usually dim sum dishes like savoury meat croquette. To be honest, the lovely flavours and textures are lost a bit in translation but try something new and you may be pleasantly surprised. For the sweet-toothed, there are cream cakes but I would recommend trying some Chinese delicacies like Chinese custard tarts and sesame seed balls.The girls serving you the food will give you a bag with your goodies and a bill, which you pay at the door.Worth a look for a treat and light lunch!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "WJrmTHDFzVjcG2d7AEvV5g": {
    "date": "5/6/2013",
    "text": "Incredible Chinese bakery in the Chinatown mall. The pork buns are excellent, along with the sponge cakes with and without filling. Most items are £1.50 or less. There isn't a queuing system, you have to push in to get served! Great for a budget late night snack.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kcz4CkCKc8rXtSV3TS4XWQ"
  },
  "xcWheW7Y97kx1Exk9mydqg": {
    "date": "5/4/2008",
    "text": "Kowloon Bakery is an institution, and the frenzy of the queues of people - Chinese and other - trying to order some pork buns and sweet lotus cakes are proof of it. They make all manner of pastries, sweet and savoury. Slide in the front door, try to keep your place in the group of customers yelling out orders and pointing at the shelves, and you'll leave with some exceptionally tasty treats. They've recently renovated and expanded the bakery.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "GdBSfbXhg60OYlLe8BJ17Q",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GdBSfbXhg60OYlLe8BJ17Q/o.jpg"
      }
    ],
    "user_id": null
  },
  "TwitXUL03JF8_eUN55w6Wg": {
    "date": "9/18/2010",
    "text": "It's so hard to find a proper Chinese bakery in London because it's not like where I live near Los Angeles where there's hundreds of Chinese bakeries vying for my custom. However, one place stands out in London. If you want fried dough, red bean buns, or sausage buns, go to Kowloon restaurant.This place has so many pastries to choose from that I haven't gone through every one of them! It's reasonably priced and they have a good portion of drinks to compliment your pastry, including coffee-tea!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbNhjE300UX-BPtLPPiK_A"
  },
  "zQ8CJBkifemzjWLfsKVcAQ": {
    "date": "1/8/2010",
    "text": "I'm doing a review on the Bakery part of Kowloon. My husband and I love this place, I have been coming here with my dad since I was a little girl and it really hasnt changed very much over the years.The bakery on the left side is still small but they always have a lot of fresh goodies coming out of the oven and a lot of yummy selections to choose from. The best things to get here are the Red Bean Moon Cakes (and my husband says anything else with red bean in it), BBQ Pork Buns and Coconut Custard Bread, sooo yummy especially when they have just come out of the kitchen.Prices are very reasonable and they always pack the goodies in a box for later, or you can just eat them and walk! We can't wait to go back to this place, Kowloon Bakery DONT CHANGE!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J410hCHoEbcJyUfgHYreDw"
  },
  "-m7jsCSNyow9fJ5cYZZFKw": {
    "date": "5/22/2012",
    "text": "I was distracted by the pork buns at a Chinese restaurant, but my friend pulled away saying \"the best ones are over here.\" After enjoying the Kowloon goods, I'm apt to agreed. Red bean paste buns, bbq pork buns, and more filled our takeaway box. Prices range from 1-3.50. You pick what you want, pay cash (and only cash) at the counter, and walk away with a big grin on your face as you anticipate the delicious food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNL4SpfIdMC8GywGayDEOw"
  },
  "_dup2gLMCFyUEYODnljZGw": {
    "date": "1/18/2013",
    "text": "Food is good value but not a great selection, adequate for a lunch though and can't complain at only £9.95 a head.staff are rude I will admit, hovering around table is off putting, but like I say, good for the money.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "luBp_NN7Ckv-g4gFvYOuaA": {
    "date": "7/9/2009",
    "text": "As the above says... Ignore the buffet restaurant next door which seems to be mainly tourists eating sweet and sour chicken. The shop itself is a tea room and a takeaway place. The cakes and buns are always fresh. Both my BBQ pork bun and egg custard tart was still warm from the oven. A nice light snack meal for around £2. There are other items such as plain doughnuts and pandan cake.The payment system is a little eccentric as you receive a slip with a price which is handed to the cashier for payment.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JvHImDKFGDU45OsYDEo2JQ"
  },
  "pMjDRZQJsuyouq-AA_2Dew": {
    "date": "11/5/2008",
    "text": "Well I promised my girlfriend I would cook her dinner tonight. However, what with alot of recent excitement in and around my flat, I didn't actually find the time to shop for delicious fresh food for my delicious fresh girlfriend (forgive the crass analogy, just turning phrase for your pleasure!) so after we did some shopping in Chinatown, I said I would take her to an all you can eat buffet. What followed was a dark chapter in my life as a restaurant connoisseur. Chinatown is an exciting place, especially for a first timer like me, but I was insistant on finding myself an all-you-can-eat as opposed to other restaurants where I couldn't eat myself to insensitivity for relatively cheap prices.. I eventually came across this place for Â£8.50 a meal and I was, as I usually am, easily satisfied. Pulling my girlfriend in, I asked for a table for two and was led to a table for eight and just placed there. Slightly perturbed, I took my seat but was told to in fact sit in a specific two-person bit of this eight-person table. Interesting... So I sat down. I was immediately asked what I would like to drink and I waited to see what my girlfriend wanted - simply because of the unwritten rule I employ when dining with a girl.. always let them order drinks first. I always get tap water (restaurant drink prices are just criminal) so that it doesn't make me look cheap when I order tap water after they order themselves something exciting.. however, at this restaurant, they told me that tap water wasn't an available service.. the menu listed everything from water to fizzy drinks at Â£1.50 and I thought Christ, that's expensive. I decided (unwisely, as it turned out) to order the same as my girlfriend, Green Tea. It also was Â£1.50 but had free refills so i thought, awesome! So before I went and got myself some food from the buffet, my tea was on my table but too hot to drink.. Green Tea Temperature : Piping Hot So I went and helped myself to some food. I was looking forward to this bit but I ended up feeling quite disappointed. They had alot of choice for the little commodities like prawn toast, seaweed, prawn crackers etc but as for the main food I am sure other places in the past have offered me at least double the amount that the Kowloon Restaurant does. With three types of staple (thinner noodles, normal noodles and rice) I chose my usual.. normal noodles with lots of meat. I was tucking in with my girlfriend when she, in her beautiful way that means she cannot be horrible about anyone or anything, said 'these noodles are a bit.. special' and laughed. She was right on the money.. an odd, almost soil like taste followed a mouthful of these noodles. I was a bit perturbed but the texture was still like normal and mixed with meat, it was bearable. The salt tally on my body was increasing sharply though so I turned to my drink for refreshment but.. Green Tea Temperature : Piping Hot This situation had become a bit too annoying for my liking and, gasping for appropriate refreshment, I was backed into the corner of getting myself some mineral water. Expensive, I thought, but the perfect accompaniment to this salt festival in my mouth. What I ordered and what they bought me though appeared to be very different things. I expected half a litre of nice cold mineral water. What I got was a warm bottle that had less liquid in it then a can of coke does. It managed to fill a single cup to the brim and that was it. Having drank this (it took me all of 6 seconds to do so) I turned to my girlfriend and asked her where the rest of my god damn water was! She didn't appear to know either.. so through a series of events, I was pretty fuming. In the end though, it did manage to get slightly worse. Green Tea Temperature : Piping Hot Having finished my meal, I reclined my chair with a full belly and was slightly less peeved then before. My girlfriend thanked the waitress in Chinese for her meal and luckily she didn't catch my glowering glance as I let her and the waitress know exactly what I thought of the meal. The waitress, in turn, was disappointed in me for taking some duck meat off the bone from the buffet cart and not managing to consume the bone itself.. for this I was so sorry, I must have left my shark dentures at home! I was charged Â£2.10 for leaving these bones on my plate and instead of arguing like I wanted too I just left so that I could tell my girlfriend, and anyone within about ten feet of us, what I thought of that restaurant. If you couldn't quite hear me, I was the one with the air turning blue all around me! I am not coming back to this place... I recommend that you don't either. Green Tea Temperature : God knows because I didn't get to drink it!",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FFPFu2bNLzlghS6fTTf3vg",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FFPFu2bNLzlghS6fTTf3vg/o.jpg"
      }
    ],
    "user_id": "UG_hriMI8ZFkZFDOT-96ig"
  },
  "5AG6BObBrrXYZ8dutVLEZA": {
    "date": "10/20/2015",
    "text": "BAKERY Review Only:This is the most authentic Chinese bakery in London. We enjoyed it so much that we made the effort to visit a 2nd time after finishing a tour in Trafalgar Square.Egg tarts - Yes, good crust that doesn't collapse on the first bite. Center contents were perfect as it was smooth and rested on my tongue with no running liquid and reminds you of egg custards back in the days when people gave damn about quality.Sesame seed balls - there is a pretty decent churn on these and we had to wait 5-10 min for the next batch. For those who do not like the familiar large chunks of red bean, this is a good compromise as there is a sufficient amount but it doesn't overwhelm the entire ball.BBQ Pork bun - large portion, we got lucky that it was still pretty warm.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "owRJSf6XpxG0d9vBl04uAQ"
  },
  "zGzmGBYMCwh1SOTuayC6ng": {
    "date": "9/22/2018",
    "text": "The first 1 star review I've ever given and I am extremely saddened... First of all, the food: there was a great selection. As someone who grew up with Asian baked goods, the selection got me and my sister very excited. And the food looked fresh enough! But when we saw the reviews, instead of going crazy and buying all the goodies we wanted, we decided to just try one. Thank goodness we did that! Because we purchased 1 Pineapple Bun and... it was terrible. Terrible in the way that it tasted stale, and it was salty? I couldn't figure out why because Pineapple Buns are supposed to taste sweet. I took one bite and immediately told my family members to just throw it away. It wasn't even worth trying to finish it. Second of all, the service: now, like I said, I grew up on Asian baked goods so I have pretty thick skin when it comes down to rudeness. But man, was the rudeness in this establishment on a hole other level. My mother asked the lady who picked up the food for people a simple question and the lady immediately just shouted an answer at my mum as if she was ignorant and stupid. When we went to pay, the lady just took the money. No thank you, no come again. Well, we won't be coming again anymore. This entire place was a disappointment. I don't really understand why they had so much business because just the service itself would've just put me off. Extremely disappointed, and it's establishments like these that give some Asian restaurants a bad rep.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7jdjcNBbcpNKFlHRduZIxA"
  },
  "MApmU7Z6YgcPbbCOkeZrgw": {
    "date": "4/29/2018",
    "text": "Have to say that I do like a good Chinese and it's been awhile since I had one so whilst I'm London we thought that we would take a look at Chinatown and pick a place that looked good from the food on offer and had a reasonable price.From the outside Kowloon looked like the place to go as the food through the window looked very appetising and good value - but word of warning they will take cash only so don't go in if you think you can pay by card. It did look busy inside when we entered but we were taken to a table and sat down after a couple of minutes the person on the till started to talk loudly at us saying we couldn't sit there I tried to explain this is where we were told to site and tired to see where she wanted us to move to but that clearly didn't work until the original person came back and moved us to another table. Plates were eventually brought over and we went a picked our food have to say that the choice was good and the food was hot so that was something positive the drinks didn't taste great but they were from a can. Value for money wasn't really there which was a shame",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d151kVUTvyT7aFKUM8Z_dA"
  },
  "MvL2-ytb1gYgFraXaeeM2A": {
    "date": "7/29/2018",
    "text": "Review for buffet only: You get what you pay for--I mean can you really trust a Chinese restaurant that doesn't have chopsticks?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ijV2zA_A9IN2q8h1owyO0g"
  },
  "7BhTPfYCm_pJrC4qHwoBxg": {
    "date": "7/12/2018",
    "text": "I hate this place! Horrible service, once you sit down they give you your check already and you'd have to pay right then and there. If you leave food on your plate, you'd have to pay and I got the iced tea and they gave me a small amount. Once I finished the drink I asked for a free refill and they said, \"yeah sure,\" and when she gave me my refill she said, \"£3 for drink.\" I am completely dissatisfied about this restaurant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6ahy3NzHOjdPf7U8mTsuw"
  },
  "eEu009Z8lOJQ0bUbdwpWbw": {
    "date": "12/27/2017",
    "text": "Buffet review only:'Twas a rainy evening in London on Christmas, and my family and I were tourists trying to find a decent and inexpensive place still open for dinner. Seeing the multitudes of people inside, we assumed Kowloon was an okay restaurant and entered. Fake news! Turns out the others inside were also misguided tourists who stumbled into this trap of a sad, sad restaurant.We were seated at a table in the back, where the corner of the walls was visibly cracked, repaired haphazardly, and then left to attract dust and grime. The waitstaff immediately demanded the money in cash upfront. It was £14 per person. We were then given plates and reminded repeatedly to take our plates with us to the buffet. We asked for still water, and it took them fifteen minutes to bring us a pitcher and some old plastic cups. The staff kept yelling at each other throughout the restaurant, creating quite a noisy environment. They gave us an empty bowl to scrape our leftovers into, because we had to reuse the same nasty-a** plates. Revolting!I started on my treacherous trek to the food area, carefully squeezing my way through cramped tables. The buffet selection was minuscule - about sixteen different selections, just enough to line the windows and deceive hungry passerby. A third of the food was the type of fried food you can get at the store and bake in your own oven. The curry potatoes dish looked like half of one potato swimming in a yellow grease pool. The broccoli dripped with oil. The rice was steamed with dubious egg-like flakes. I wondered why they had a serving spoon with the so-called Singapore noodles; turns out they had cut it into such short pieces that it was possible to serve with a spoon (very inauthentic fyi). They had no soup or dessert.Bathroom: [redacted to prevent your complete loss of appetite]Bonus: a French couple was on a date next to our table. Both grabbed fried food and ordered cans of Coke (£2 each I believe), neither finished either, the man asked for dessert and was rudely told that there was no dessert, both looked thoroughly disappointed at the end, their relationship was maybe on the rocks after this experience, who knows.Tl;dr save yourself fifty pounds and a nightmare. If anyone is in contact with Gordon Ramsay, tell him to come here to film Kitchen Nightmares. Sad!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Zk4HyfbbN-2_ZE2pAEuJKw"
  },
  "--TlWQaIlIR0GoRiCYVR4Q": {
    "date": "8/4/2015",
    "text": "Another one of the Restaurants in Chinatown that has a bakery front so you can just buy and go. I selected a duck pastry (wasn't sure what it was and took a risk) and got a red bean mochi !  The mochi was delicious! So delicious I wanted to go back and get more!  The duck pastry was interesting to say the least. I started with the duck pastry and ate only half. It had interesting flavours, like a sweet bean/ peanut paste? And then some fermented duck egg? That was my guess at least . It was a gamble but I'm still glad I tried it! The mochi was good to end on since it was so yummy and sweet! I love red bean mochi.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QqEIYNQklA0V8Y1-hVmnow",
        "caption": "Photo of Kowloon - London, United Kingdom. Yummy red bean mochi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QqEIYNQklA0V8Y1-hVmnow/o.jpg"
      },
      {
        "img_id": "DVAyUdKXfZT0uhX-T_i_cA",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DVAyUdKXfZT0uhX-T_i_cA/o.jpg"
      },
      {
        "img_id": "iGVBbkloxAxHEsQ_r9lWbQ",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iGVBbkloxAxHEsQ_r9lWbQ/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "k7kq01uglDlzPapvl1UQtA": {
    "date": "12/30/2015",
    "text": "Once upon a time, the foolish hungry american tourist stopped at the buffet. happily never after.Food: admittedly tastes alright, but choices are limited (many are filler vegetarian items - fried wontons with no filling, potato pastries, fries, sweet potato tempura only, fried rice with no egg, etc.) meat dishes (ex. beef stir fry, chicken w/black bean, mongolian pork were good) but i tried not to look to closely (read hygiene section).Service: FAIL. could write an expletive-ridden essay, but attempting to write cliff notes version...should've left when the crazy host lady seated me next to the staff only door which kept slamming. got yelled at by lady because didn't know to pay first. yelled at by staff because another person put here bag on my table while zipping jacket (thought i was sneakily adding to people at table). another man got reprimanded for getting more food (staff said \"i wish you were gone already\").Hygiene: yes, its that bad that this gets it's own section (a personal Yelp first!). dirty floors, dirty food area. will spare fellow Yelpers pictures - do not wish to cause loss of appetite.1) no clean plates provided for subsequent trips2) lady halfheartedly washing dishes in middle of restaurant (weird) while screaming at waitstaff and banging dishes onto cleaned pile. station is next to buffet area.3) don't look at floors. didnt brave a visit to restroom. pity/applaud one who does.lady washingBottom Line: doesn't matter how hungry you are don't dine-in buffet here. crazy lady hostess & staff. if desperate, try other buffets in area perhaps? or get takeaway of lots of regular chinese food.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gD9uzTSl_LwdGsX73ubhtQ"
  },
  "M_6cSyoTROqvVSqyb6XWug": {
    "date": "8/9/2014",
    "text": "It used to be the best Chinese bakery in Chinatown but I'm afraid their standards have dropped in the last couple months. What used to be fresh egg tarts with the fragrant egg middle and buttery flaky crust is now replaced with a diluted egg filling and a really sad crust. Along with the egg tarts, I bought my usual share of beef curry turnovers, banana mochi, melon cake and sesame ball. Melon cake was okay but the rest tasted stale. Would not go back again - the search for a decent Chinese bakery continues...",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7K1fw42TU5wzqhgLa5t7Iw"
  },
  "gM3LMj2wHVI2highE6MiUg": {
    "date": "9/28/2013",
    "text": "Ever since my first egg custard tart in the foodie wonderland of Hong Kong last year, I've had a hankering to find one closer to home that hits the same spot. If I hadn't had that specific treat in mind I'd have been in big trouble, as boy is there some yummy looking stuff in here!Ignoring the fact that at almost 6ft I felt like more of a giant in there than usual, the tricky part is figuring out the non-obvious serving 'system' which kinda adds to the experience. Basically just push your way over to a server as soon as you see one free, as you won't be beckoned in. Point out what you want (literally) and they'll load you up a box of goodies whilst you go pay at the cash-only till. Pick up your box. Enjoy.Ok I confess it was actually my housemate that figured that out whilst I was looking around drooling. There's huge choice, both savoury and sweet, and all looks enticingly fresh (not like those places you go in and suspect some things have been sitting there for a week). Also a small seating area at the back though it looks like most people take away. At £1 a pop the mark-up on the custard tarts versus HK is noticeable but hey inevitable, and we picked up half a dozen to satisfy the cravings! Firm pastry, light custard, not too sweet and with a good amount of wobble, so I'll definitely be hitting this place again to taste test some more. For now though I still have 3 left in the box to deal with before my housemate gets home... mmm.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "GTEfoJUduaGRssSPwSgQoQ": {
    "date": "5/12/2015",
    "text": "I only go to the bakery for a quick pit stop. This place is always busy with people picking out sweet and savoury delights. But after seeing the Munchies Youtube Channel and Action Bronson (rapper who also knows world food and can cook) state that this place has THE best BBQ Pork bun...I had to go. I went, I bought two, and I loved it. As he also stated it's better warm but they don't really warm it up. And barely speak much English, but loved it all the same as a cheap snack on the go. And for £1.20. Cheap as chips!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5WluecQxksaO-AGXOpotMg",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5WluecQxksaO-AGXOpotMg/o.jpg"
      }
    ],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "T2_46eqibheuj1rn2ogQhQ": {
    "date": "8/24/2016",
    "text": "The pork bun is just amazing. The bread is like eating a sweet cloud and the bbq filling was delicious. If there was more meat it would be the perfect bun",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gtbaeLEdA6_GrPjI2a7VMQ"
  },
  "W_0uzeTPpm8y5ca89-MBbg": {
    "date": "5/4/2015",
    "text": "This is a review for the little bakery, not the restaurant next door: Great little bakery, open late and serving a number of sweet and savoury treats! Reasonably priced for individual little snacks. Service is very fast paced and non-smiley: you order what you want and it's boxed up straight away. Then you leave your box while you go to the till and pay. Once you have your receipt you can pick up your package and enjoy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0U01VMPBEP1dgpl6h_JRfg",
        "caption": "Photo of Kowloon - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0U01VMPBEP1dgpl6h_JRfg/o.jpg"
      }
    ],
    "user_id": "1v2-TcNnww0dIEOm6Chtxg"
  },
  "WIXGCnBA4-AlKIdEeznC3w": {
    "date": "7/5/2013",
    "text": "They adon't put it in individual plastic wrap which is annoying. Alot of choices but they didn't have the ones I wantedActual bread is pretty good, but i dont think its as good as delicious patissiere",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gy3QT35nJDpvKPuFCy3uow"
  },
  "ZERYdwQULdjz9ec32kEKOw": {
    "date": "2/6/2015",
    "text": "One of the better Bakeries in Chinatown- brisk, efficient staff ( one lot who take and box your purchases, before handing an invoice to the person at the cash desk) . The standard I use for judging bakeries in Chinatown is pretty simple- the roast pork bun. here, I found it well executed and fresh, as were other purchases, including a lurid but delicious Swiss roll. Prices are pretty similar to the local competition £1-£2 per item.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GUUH2FU7r36h1KxEhZFXQ"
  },
  "DQaEgsVkCszdQfds8crGuA": {
    "date": "3/13/2016",
    "text": "Awful service! If you don't take cash they literally will kick you out. The place looked dirty.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a2kJUiTVoL8RYhzxy5gVzA"
  },
  "FlG1c-p1k5WQu3yDTgzNtQ": {
    "date": "3/18/2016",
    "text": "Gross.  Like,  really gross. Save your money and get a bubble tea and steamed bun for half the cost.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a2oF2uNr1GW1L1y0FPzL-w"
  },
  "DnKsfoVOwkosMmgqCAJUiQ": {
    "date": "5/25/2015",
    "text": "Yummmmmmyy.....for only a fiver you can do the take away buffet! Pretty good deal and the food is good!",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "ZNhgQMd7xCBaunfJxhmftA": {
    "date": "1/22/2014",
    "text": "Quick glance:+ two varieties of egg tart+ staff handles baked goodsFull review:After visiting half a dozen bakeries in Chinatown, I found it here at Kowloon - egg tart with short crust base. All the other bakeries offered only the puff pastry variety (some looking sadder than others) but I've always been a fan of the short crust base. Imagine my delight when I finally found it here at Kowloon, and they look perfectly formed! Not to mention oh so tasty. The other positive is that the staff handles all the baked goods so you know the food stays relatively hygienic.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "arqCZxMxgLkj-gFIJfnCXg": {
    "date": "7/24/2015",
    "text": "This place deserves 0 stars. Nasty. The fried food was very soggy. The wait staff was rude. Maybe it's a European rule but it's nasty that they only give you one plate and you have to keep reusing it.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4e_T-oJ9vTRAhJ8KGy_AA"
  }
}