{
  "PzzrddIXQvuo9ulNj_REdQ": {
    "date": "10/21/2011",
    "text": "Amaaaaaaaaaaaaaaazing Pizza guys! We'll be back. Great service too",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "H2bsaaTQcL3603xmNrg-Sg": {
    "date": "4/4/2008",
    "text": "The girls and I like to frequent this particular pizza express. No matter how busy it seems after work, the staff will always find you a table. As it is part of the Jazz Club you do often here the live performances whilst sitting/eating upstairs, which really adds to the ambiance of the place. Its quite a loud and energetic place to eat anyway, and always the food is good, and more than reasonable the staff seem to be help on tap which always makes you feel rather important.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ER88rKqFx8Ca7wO_rJmq9w": {
    "date": "9/19/2010",
    "text": "Great place, great food and very helpful waiters. Recommended",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PIR1tTrODh_qApVwirZ-GA": {
    "date": "4/30/2008",
    "text": "This place is rather special. The pizza express on the ground floor is exactly what you expect but there is a back entrance down some steps into the basement that lead into a dark jazz café where they serve pizza express food which you eat whilst listening to live jazz music. The whole venue has a real jazzy feel to it and it has bee open for decades! There is an old banner on the wall advertising a live jazz night back in the 70s showing that the price of pizza and the jazz is about £2!!! Of course things have changed since then and it is a lot more expensive than that. Most nights cost about £15-£20 per person plus the cost of the food on top of that. So not a cheap night out, but definitely worth every penny if you choose to see a great artist. They have booklets with their programs on the tables and performance listings on their website as well, so make sure to choose something you think you' enjoy!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GtpS1pbFDhE4UL6NYgMDDA": {
    "date": "8/4/2013",
    "text": "This Californian loves Pizza Express! I first went to PE years ago on a visit to London. I most recently went to two different PE's in May while visiting a friend in London. Both were outstanding. My favorite pizza at PE is the \"American Hot,\" which has pepperoni, mozzarella, tomato, and a choice of hot green, roquito or jalapeno peppers. I chose jalapeno. Prices are reasonable and the service was fantastic. Try it out!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAbMXtl-cybg6wyl93HQrA"
  },
  "J-nzHH95F_7Hjsid5AY_BA": {
    "date": "12/19/2008",
    "text": "This particular Pizza Express is special, The main reason being that it boasts one of the best jazz clubs in London. First of all, If you are going to get pizza from a chain pizza store, I suggest you go to Pizza Express as they actually care about the pizza they serve.In true jazz style, the jazz club is located downstairs in the basement. This club has become somewhat of an institution in the London jazz scene, and has hosted some of the best acts from London and abroad. The club is typically dark and a bit raw, just the right kind of aesthetic for the music.Because the place hosts such a high calibre or performers, tickets are often quite expensive. Unless you are a die-hard jazz fan, maybe reserve it for a special occasion.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OQERwFXPPlIE5XO_ZXdWLQ",
        "caption": "Photo of Pizza Express - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OQERwFXPPlIE5XO_ZXdWLQ/o.jpg"
      }
    ],
    "user_id": "WXP9hhQKPItddmjB_5nTLQ"
  },
  "dGDB0hcOyMwKbaUb_QHhkw": {
    "date": "4/15/2012",
    "text": "You can't go far wrong with Pizza Express as far as chains are concerned. Decent food, not too expensive and a nice setting. There are plenty of independent places around Soho so this should only really be where you end up if you're feeling lazy.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "asGKmnLAW5I4N3bwYmxk3A"
  },
  "pqAyyoVh_JyCE-v43YY96Q": {
    "date": "8/18/2010",
    "text": "I was visiting London from the States, and wanted something takeaway for just hanging out at the hotel for dinner.Found this place via Yelp, and it was in the neighborhood; the beauty of it was that it forced me to walk through Soho, which was the neighborhood behind the hotel. Soho, though very discreet in the daylight, was pleasantly abuzz with activity in the evening. I would never have known this otherwise! Being a foreigner in a foreign land, of course, I was expecting a fairly generic takeaway establishment, though when I arrived,  I was surprised at the intimate (yet bustling) ambience with low-level lighting, and 30-something crowds coming here for date-nights or group dinners. I was amazed!I ordered both the Margherita (tomato and mozarella) and American (pepperoni) pizzas - in addition to the Nostrana Salad (New potatoes, torn chicken breast, avocado, red peppers, green beans, mixed leaves, parsley and a free range egg, served with house dressing).Since I walked to the restaurant to order, rather than call, I waited for the food on a still (where I people-watched!), and it took less than 20 minutes, which I thought, was reasonable.The food was good. The pizzas, as I expected, were Italian-style and not at all like American pizzas (thinner crust yet doughy, and less toppings); the crust was warm and doughy. The salad, was great, and all of the ingredients tasted really fresh!Had the timing been right for me in my schedule, I would've have loved to take in some jazz.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TTXdVPTinvm5tEA-_w-DcQ"
  },
  "ucPsV0-f7aBQmn3Wyr8mKQ": {
    "date": "10/12/2009",
    "text": "I really am quite a fan of Pizza Express. I love to hate restaurant chains, but despite the dominating presence in UK high streets and the formulaic menu, the food is always consistently great at Pizza Express. It can be a brilliant asset to know that if you are in the middle of a hideous high street and needing decent food, the Pizza Express there will be of a standard that you are familiar with. So when I was invited by my company chairman to the Dean Street branch for live music I was more than happy to go. Most of my friends would not touch the place with a barge pole due to the Jazz played there. Last night far exceeded my expectations for the talent on the bill. A fantastic fusion of Funky Jazz, Pop, Latin and Cuban feels from Marc Antoine/Paul Brown/Jessy J, that frankly was some of the best live music I had seen for a while in London. The atmosphere was intimate, which was without a doubt expounded by the formidable Jessy J playing sax solos that wound their way among the audience. Service here was only very average. I am still waiting on the chilli oil that I requested to go with my pizza. Which incidentally was the same pizza that got very cold 3 minutes after it was served because the air conditioning was blowing directly on it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "_4C2f6WPf_1_GyHkMDmC1g": {
    "date": "1/31/2013",
    "text": "Nice pizza place and a great jazz bar. I love Pizza Express.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HWKbn3nKd8obT9AWjtJ1iQ": {
    "date": "4/16/2009",
    "text": "After reviewing a theme park crossed with a Chinese supermarket yesterday, today, I'm going to review a pizza restaurant crossed with a jazz club.I'm not sure about the history of this restaurant and how the jazz connection began but amazingly, in the basement of this chain restaurant, you will find a live jazz club in the evenings. They've had acts like Norah Jones and Amy Winehouse.The food is standard Pizza Express fare but the jazz makes this a unique dining experience.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "yVl1nVtZ-rBmLclDSsGulA": {
    "date": "4/5/2010",
    "text": "I'm a big fan of Pizza Express. You know what you're getting, no matter where you are (very tasty food, relaxed service and reasonable prices). Which is why we came here. Smaller than I've seen in Leeds, it had a nice atmosphere, and seemed to be the place for a lot of first daters. We had a couple of pizzas on those slightly thinner, stretchier bases, and a couple of salads to start, and it was a welcome relief not to have service automatically included for a change. And to spend under £50 on our tea. So yes, I liked coming here. The only thing I didn't like was the rumbling of the jazz coming from downstairs. It shook my chair and made my tummy feel funny. Which is why I knocked a star off.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "bOzC8yHNDnhGJX29zaaJ2Q",
        "caption": "Photo of Pizza Express - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bOzC8yHNDnhGJX29zaaJ2Q/o.jpg"
      }
    ],
    "user_id": null
  },
  "zruOsdcLlLd1NM7RqratHg": {
    "date": "12/24/2011",
    "text": "This is basically the California Pizza Kitchen of England, but not quite as good.  Sorry Pizza Express, I love my CPK, in fact I think I'll go there for dinner tonight!  We ate here two times, the first I remember the pizza and salad to be pretty good, the second time the pasta I ordered was terrible.  Under seasoned, a bit hard in places and unimpressive.  It is a good place for quick, cheap italian but if you want good italian, I suggest going elsewhere.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vr3Pb396ITDu_1hL5W1CeA"
  },
  "UiX0CImUhEkTsCuxxME2Tw": {
    "date": "1/9/2009",
    "text": "My date had taken me here some time ago; when I first saw the place I was thinking Oh; a California Pizza; in London.. I'm not a huge fan of pizza chains; but this place is anything but California Pizza; The place is quite posh with it's large selection of wine with it's candle lit table settings... Pizza Express is fun place to go if you want to impress someone without looking stuffy.. Over all the food and the service was excellent; as well as my date!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "18VDWSkSPCvCf5F4CLwWuw"
  },
  "Xyez8KlCH4PR9h-X6ssHvQ": {
    "date": "10/4/2007",
    "text": "If you like Jazz and relaxing atmospheres, I would suggest that you go to the Jazz Bar Club in Soho. It's also a Pizza Express so you can also eat a delicious pizza or a salad (if you are watching your figure :-)) while you are listening to the music played by the jazz band. The tickets for the performance cost about £15-25 (depending on which artist is performing). Delicioso!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XgCU3SxuQIm_luSW7J-Vsg": {
    "date": "11/15/2008",
    "text": "I keep meaning to go along to a jazz night sometime but never seem to get around to it. The restaurant, however, is a nice size and has pretty high standards for a chain store. A good value pizza and a good drinks list make it a good stop for dinner to begin a night out. It's also a favourite for a quick take away when I'm working late in Soho and need a bite to eat.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vKM-bFALnkDYLFdGH7UZpQ": {
    "date": "5/16/2013",
    "text": "None of us had been there before so we didn't know what to expect in terms of live music but were excited Nothing about the evening disappointed. The atmosphere is very relaxed and very intimate. We could not have imagined a better place to watch a master guitarist play, as we sat lterally 3 metres away from him. The food was excellent. We all had different starters, main courses and deserts and there was nothing but praise for the standard of cooking. All the waiting staff were superb, courteous and sympathetic to the environment, as food was being served during the performance.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Co592RoDszBIt-_LPV4Efg": {
    "date": "11/25/2007",
    "text": "To add my tuppence on the Pizza Express on Dean St I'd like to say it has a wonderful lunch time vibe on a weekday, while Soho is busy all around you, you can sit and watch the people go by in a slightly calm oasis. The staff in here are delightful, and even if you don't sit in the jazz area, there's always something good to hear over dinner. The pizza is Pizza Express pizza, i.e. brilliant for the price and always piping hot. It's also worth noting that this branch is just around the corner from Soho Square, where on a sunny summer's day you can relax and let your food go down while sitting in the grass.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oe39Xa_noq2-YQx6AHFeTw"
  },
  "h2vkTOdDRPKEMjJhZUMQgw": {
    "date": "6/4/2010",
    "text": "Saw Lee Konitz performing live here couple of weeks ago. Food is standard Pizza Express fare. Lovely ambience, tables are placed just a bit too close to each other.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4O4buIsxPGrgbR0La-9s-g": {
    "date": "12/13/2010",
    "text": "i have tried out many pizzerias in London but Pizza express is the most consistent and my husband rates it as the best. I would much prefer to like a local family owned pizza but unfortunately the recession seems to have cut the quality in these. Pizza express still continues to deliver tasty good value and increasingly inventive and authentic pizzas. I cannot say I have found anywhere that beats them as surprising as that may sound!Well done. keep up the good work and dont be tempted to cut quality.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BsM9DoIRec7WHXRqmT4b0w": {
    "date": "5/12/2010",
    "text": "I took 3 friends here very nice indeed, the restaurant was lovely bright and airy and the prices where not babd either.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "itOW8cKPDOrtCLzRZwloeQ": {
    "date": "2/21/2010",
    "text": "i'm pretty sure my tastebuds and brain cells were shot after a debaucherous weekend of drugs, drinking and more drinking (unfortunately no sex--LONG story). still, it's been over 4 years since i was there and remember it to be a great experience. the place is laid out nicely and mood lighting is just right. dinner was great and was the perfect apertif to yet another evening of more....sigh. drinking.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "bSI8nd71eOaVWWYiaAmbdQ"
  },
  "IQkZAYorGLbrC6BMU3xIHg": {
    "date": "12/17/2008",
    "text": "My boyfriend took me here for our first date and I remember thinking he could have up with somewhere a bit more original than a pizza chain. However I was pleasantly surprised because the jazz club was a fanatstic touch. I've been to Ronnie Scotts and always have a great time and this place  is definately another excellent choice to listen to some great music and eat some delicious food. The Soho branch of Pizza Express has been around for 40 years and is a legendary Soho venue. Next ttime you're in Soho pop in and with nightly jazz events you never know who might be playing on the lower ground floor. I would've loved to have seen Amy Winhouse perform here maybe next time...............",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibGwYz5b6zO5FA03b2EBxA"
  },
  "Dd-IN7bSxAYqnefH9MhqTg": {
    "date": "12/16/2008",
    "text": "Although not normally a lover of chains I am a definite Pizza Express fan. I love its seasonal specials and the Giardiniera pizza is one of my favourite meals. Its Bosco salad is amazing and the dough balls rightfully legendary. And this branch on Dean Street in Soho has the added bonus of its Jazz Club, which hosts nightly jazz events and has done for over 40 years. All Pizza Express restaurants have an airy but intimate atmosphere - all blue and white surrounds - and this one lends itself perfectly to the music, which takes place on the ground floor. I would always recommend Pizza Express to anyone anywhere who wants a reliably good pizza, and this is no exception.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnRGniwBA5vYvlHo7A3OHw"
  },
  "dHh9HDgYNoQaeGUjIBARaA": {
    "date": "1/22/2015",
    "text": "I liked it, I thought the pizza and the presentation were great. Infact I was a little surprised by the menu. I found myself back here 2 days later on this trip, contemplating another go around today !!I do love pizza and this is great, and essentially I will get used to the British charm of customer Service not always with a smile !!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrtvSUmP0tUV1Y7y6Gu-Jw"
  },
  "KUZseeKn_K4fMQxpBTf-xw": {
    "date": "10/1/2016",
    "text": "When we visited there last Sunday around 7pm, it was pretty empty but the staff failed to acknowledge our arrival and left us standing there for 3-4 minutes, which was totally unacceptable.  Even after we were seated, they failed to come to our table to take our order.  So we moved to the back area to get better service.   The waitress came quickly and took our order.  A stream of diners started to arrive for a Jazz session downstairs, and it seemed that only one staff covered the front, another one at the back and the rest downstairs.  They do need more staff to offer better service upstairs.We both ordered salad and they were properly prepared and were delicious.  It was a shame that we had bad service at the beginning.  I hope they would improve it, so that I can give them a better rating.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMbGqg5EovIcFnfIxUw7hQ"
  },
  "_Mp-mazEBJFUQWjwVpLnUw": {
    "date": "2/17/2017",
    "text": "Good pizza, great service and very friendly - hit the spot after the Harry Potter show and despite being busy we were quickly served.  Lots of menu variety and good drink menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z_yj0AZRySTEFLuBnNB8w"
  },
  "QR892egf5UCCFrbgEyikmA": {
    "date": "11/1/2014",
    "text": "The food here is excellent and the staff are nice and friendly we ate on a Saturday lunch and even though it was busy we still got great attention from our server. There was a jaz bar below where we were sitting but we couldn't get in it was packed will have to go again just to see that. Highly recommend coming here for lunch and dinner",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dJSK7DTwC2BWg0NTyYX4Fg",
        "caption": "Photo of Pizza Express - London, United Kingdom. Great food & service best of all you get to cut your own pizza I loved that well worth a visit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dJSK7DTwC2BWg0NTyYX4Fg/o.jpg"
      }
    ],
    "user_id": "otrWcvksV222Q9bzV4PZxQ"
  },
  "BXByQfHvOBk2hKmGXX5-HA": {
    "date": "5/10/2015",
    "text": "'Do you want to go watch a jazz show at Pizza Express?' Um... no?But I did and I was happy that I did. My friends and I showed up for a lunchtime jazz gig by Earl Okin on a bank holiday Monday. You go through the typical Pizza Express restaurant and downstairs to a dark jazz bar with a little stage. It's kinda weird. There were only about 20 people in the club but it was a sunny day so that's to be expected. I would recommend ordering before the show starts as it's so awkward trying to flag down waiters and order while someone is performing 5 feet away. You are also eating in the dark, which is a little peculiar. But the show was great and I loved hearing him play. If you are a real proper jazz fan then this might be a little too mainstream and 'play the hits' for you.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "PRd9rrgP5WFuppssNPdJ1Q": {
    "date": "4/10/2015",
    "text": "I am not really a fan of Pizza places as pizzas never truly taste like a real Italian pizza in my opinion in the UK but Pizza Express comes very close.  They have a new spring menu out at present and i had New Romana 65 Margherita Buffalo pizza it looked amazing, tasted fresh, crust very thin and was massive so massive was bigger than my plate.  It also came very close to tasting like a traditional Italian pizza.  For any Pizza in the UK I do recommend Pizza Express as they do fresh thin pizzas and it the closest you can get to a Italian one.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fqP70CNVTZwwNrk-bmnYA"
  },
  "gyK_qpRS6lMnz-UDJ7LAFA": {
    "date": "10/3/2016",
    "text": "I had the Salad with Tuna, anchovies and capers topped with a lovely dressing and dough strips.  I really enjoyed this quick lunch and would go back again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU-ZbzQ-GLDoqOIzNTuT0A"
  },
  "0jpwZ2lZNtt46RzKb0UaYw": {
    "date": "11/26/2015",
    "text": "Not great pizza, the service is ok. The menu is quite limited. I ordered a pizza from them the other day and it was quite dry. However, their salads are quite good. This place is not bad if you are eating out with kids.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NQt645IJwa5ADM26UQ-jlA"
  },
  "opMb4Y-w85RXp2vbJpzJtQ": {
    "date": "1/24/2016",
    "text": "Good service. Inoffensive pizza that is consistent. I just can't love it hugely because I think other London places like street food stalls or new pop ups or independent small restaurants are doing great things that have upped the pizza game. So, I think I'd only go back to pizza express be uses of the deals they have. Nice to have around though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "j9A5qW_awIwGPJJjQjOWiA": {
    "date": "2/21/2013",
    "text": "I came all the way from Los Angeles to try this place. Okay maybe not, but as a Californian I fell in love with pizza express. I've heard so much about it.Pizza was amazing. Service was great. Fun decor.I'll def come back again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7HX_WVMJb6a3iDrsT1GqWg",
        "caption": "Photo of Pizza Express - London, United Kingdom. Heaven",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7HX_WVMJb6a3iDrsT1GqWg/o.jpg"
      }
    ],
    "user_id": "PgnMF7reUjWEejkdRk4dPw"
  },
  "-MNaLjhs8aLynLGNmTN-pw": {
    "date": "7/30/2015",
    "text": "Came here for a late lunch. They were accommodating for a large group including six kids (they provided coloring books and paper hats). We had the Romano 65 La Regina and the American Spicy. Both were excellent but the Regina, with bechmel, ham hock, truffle and buffalo mozzarella was phenomenal. The margarita pizzas were also good. The restaurant was conveniently located next to the Baker Street Big Bus Tour stop in Marylbone.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SIT2McFNaq6F9cyBH0ciIw"
  },
  "ciVVKeM4_EWYlkEu1oED9Q": {
    "date": "10/28/2013",
    "text": "Had 45mins to kill and was slightly peckish so came here on Saturday night post-cinema and pre-drinks (we'll get to that later).Service was good, but my pizza, although having arrived quickly was kinda poor/burnt though my friend's salad was quite good he said.The place was busy but didnt feel rammed which is impressive as a chain restaurant in the most touristy part of London would normally be like a scrum.It's inexpensive so I cant/shant complain too much but perhaps should have gone for a pasta dish instead.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JeTyxMflxvCvKlvWQIb9g"
  },
  "UaqD5X_O7H9Vz0YjXws4Pw": {
    "date": "3/6/2015",
    "text": "I was desperate for a decent slice of pizza yesterday so I made my way to pizza express .. I ordered a vegetarian pizza ,thin base ... It was yummy I won't lie but it was almost so thin that I couldve eaten two! I give it 4 stars because it did take me to flavour town and that's what it's all about in the end for me .... I Also had  the snowball dough balls which were wayyyyyy too doughy but you know what? They made great ping ping balls! So overall it was a win win",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft8cn80hAJcOl_hRiVpP1Q"
  },
  "28xgQNSQPa0XqFMXKdCECQ": {
    "date": "11/10/2012",
    "text": "This Pizza Express has a famous Jazz Club in its basement. We went there for a jazz concert as part of the London jazz festival. The venue is really nice. It's very intimate with max 35 tables. No matter where you sit you are very close to the stage. The food was also quite good. I didn't expect very much, but I was pleasantly surprised. Our pizzas had a thin crust base that was very crispy. The toppings were good too. In the end we paid less then £ 70 for 2 pizza, one bottle of wine and some starters. Good value if you think that you are getting this with some great entertainment on the side.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "012_hfMATnh0nUEi9OYLug"
  },
  "Y1Hh3r_miIP32HnNcMruKg": {
    "date": "4/26/2012",
    "text": "A chain at its \"finest.\"It was one of the only thing open at past 9pm on a Monday night with lots of people in there so we thought hey why not.  We're on our way to drinking so we need something hearty. The prices are pretty budget friendly and you can drink some pretty good wine too. I got pasta while my boyfriend got pizza and they were both good. I did not need the dough sticks that they are \"famous\" for.  It was just aight. These things are everywhere and I'd say if you have the choice to go somewhere else go for it. THey also gave me a coupon for 30% to try some pizza by Valentine's which I'm assuming is a famous chef. I won't use it- anyone want it?",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "MxnNT3MSGco7hQN6-pCNow"
  },
  "eAvPGGGZy0WmwA9IMLk4fw": {
    "date": "4/15/2012",
    "text": "As you already know, I'm not a fan of the old chain restaurants but I feel this branch of P.Ex. as we endearingly call it, deserves a mention & grand old 4 stars. Now, probably like most people these days I refuse to eat in Pizza Express without a Taste card or a voucher (& I do like a voucher!) but I have to admit if you don't know where to go or have no other option or just fancy a decent meal; some wine and a place to chat, then this is the place to be. I can't visit P.Ex. without partaking in a 'Padana', it's simply delish! Everytime I've had something else, I've missed my favourite pizza and felt like I was almost being unfaithful to my first love in pizza. You can also have (believe it or not) tasty and filling salads (recommend the Pollo); delightful little doughballs and scrumptious desserts too - and then feel like you need to be rolled out! Ah well, the diet (always) starts tomorrow.  This branch is always busy with a great atmosphere, speaking of which I'm dying to return to check out the Jazz Club here, and the service has always been really good and friendly. Located in the heart of Soho with plenty of post-dining options for a drink or two or maybe a theatre visit, what more could you ask for?!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S771b84rRUVnRRFy1fIBcw"
  },
  "csGFSFNJDE-V8zeuLl-c3g": {
    "date": "11/6/2013",
    "text": "This is no ordinary Pizza Express- This is Pizza Express Jazz Cafe! They have an assortment of fantastic jazz musicians if you buy a ticket to their basement jazz cafe. The regular Pizza Express restaurant sits atop the Jazz cafe. The basement is transformed into a unique Jazz cafe & you dine on Pizza Express menu. My only qualm is that the menu is more expensive than other Pizza Express's- thus my 4 star rating. I am already paying for a jazz ticket so why do you need to hike up the price of the pizza menu? I could understand if we were not paying for a jazz ticket but we are already paying a premium. It seems unfair to use a menu that cost more. Regardless this is an awesome place to listen to Jazz- a very intimate cool venue. I would definitely take people here from out of town because its a unique experience in London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VDlqj5-U22KcSFgBPqaFg"
  },
  "7Jarv43-MJAj6pGeiIekXg": {
    "date": "9/15/2011",
    "text": "My cousin and his wife took us here when we came for a visit from the states. The name made us wary, but instead of being a greasy pizza chain, the restaurant was actually quite nice (though crowded). The pizza was large, but also very thin, and we all enjoyed our meal immensely. I'd say this is like a classier CPK. Good bang for you buck. Service was kind of rough at first, but the waiter grew nicer as the meal progressed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJ9GXhmGZhpZA_HSt4VhGA"
  },
  "unTtsgEtgssvmue9OGXRsg": {
    "date": "10/10/2010",
    "text": "It's really easy to be snobbish about Pizza Express. After all, it's a chain.However, since attending a great event with Francesco Mazzei in East LDN to show off his special range of rustic Italian recipes, I've promised to be more open-minded.It's not like I've stopped going. PE is a great stop for when you want freshly-made, quick pizza. The pasta isn't great, but the salads aren't bad, and Mazzei's attention to detail in his chosen ingredients are admirable.I then attended an event last week that was part of the new generation music programme at PE, designed to showcase the brand's musical heritage.We munched on dough balls ( which never fail to please me) and slices of pizza while listening to two fantastic new artists - Stac and The Simonsound. There's not much I love more than sitting in a dark basement with a glass of wine and some soulful music. That's exactly what I did. It was terribly fun, and I'd definitely go back.Hey, the food might not be the best in town, but combine it with some jazz, and it's a whole new ballgame.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P27bQcSOCsiRsv5wKwO3uw"
  },
  "PSr1ypKH7aCfKSYiz7XaLA": {
    "date": "12/16/2008",
    "text": "If some day you have  any doubts in Pizza Express, even though it is as legendary as the Big Ben itself in London, then you should make your way to Soho where you will find the Pizza Express Jazz Club at Dean Street!Normally I am disappointed with the food in a jazz club, here you have it all, a great pizza as well as high-class quality Jazz!  Pizza Express Jazz Club hosts a regular string of live jazz acts in an intimate, relaxed atmosphere. Based on the ground floor, you can expect a selection of acts. Crowds have been loyally flocking to the basement club of this pizzeria since it opened in 1965. Musicians have ranged from Van Morrison to Amy Winehouse.It is great for friends gathering, as it is good price for the full program. When you pass by, ask for their brochure, which they print regularly. Musicians play 7 nights a week. This is a real insider!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Et1nf_I6aQ7D_kQZ__R3Yw",
        "caption": "Photo of Pizza Express - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Et1nf_I6aQ7D_kQZ__R3Yw/o.jpg"
      }
    ],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  }
}