{
  "ZngQd1h7rSQl6HomBnyyZQ": {
    "date": "9/22/2009",
    "text": "Le Pain Quotidien has become my go-to coffee place at work since my beloved Coffee Republic closed down. It should be noted, though, that this is purely out of need for a coffee place within 45 seconds of my desk and not because Le Pain is extraordinary in any way. Le Pain Quotidien is a \"quite nice\" little bistro-style restaurant and wine bar with a take-away coffee and pastry counter, selling such posh grocery items as free-range, corn-fed, sun-roasted coffee beans and £6 PETA-endorsed granola (I kid, I kid. Though the teeny little bags of granola really are £6.) The products are pretty decent, but nothing breath-taking. The coffee is palatable, despite the inexplicably foam-topped iced lattes (WTF?!) and the pastries are fine, but there is really nothing to keep me visiting this place daily other than its proximity to my office. The organic \"thang\" is great and I'm a huge fan, but as other businesses begin to get hip to the consumer appeal of fair-trade/organic products (Pret already sells only Rainforest Alliance fair-trade coffee, for instance), Le Pain will find themselves priced out of the market.  It sounds from other reviews that the sit-down side has a bit more awesomeness to offer than the take-away side, so maybe I'll try to pop round for a glass of wine after work and see if I'm seduced by the Pain, so to speak.I spend my days and nights wishing, dreaming, hoping, praying that an awesome and cheap coffee shop will move into the Coffee Republic space so as to give me a salmon bagel -serving alternative to Le Pain. Hell, if they would just bring Coffee Republic back, I'd be thrilled. Le Pain will suffice until that day arrives, though hopefully it won't be too long.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0zptTiLrI85MWA96eDM84A"
  },
  "X2NotRWPmsGPs3N6M5-2BA": {
    "date": "11/16/2008",
    "text": "I think this place is okay, nothing special but damn good bread and olive oil.I had a chicken salad in here once. I really didn't like it that much. It was supposed to be a chicken walnut salad, but it was pretty sparse. I thought it was crap for the price. On the other hand this place always has good bread and if you order the mezze type dishes, you will be plesantly surprised how good it is. A decent price as well. You will also feel quite glamorous sitting out here right in the paladium in front of this place. I did.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSFYKIibFakwFFsEeH-WiQ"
  },
  "JvX9Nkq9Lnm4rTLXTN82Dw": {
    "date": "11/15/2008",
    "text": "The first time I ate at Le Pain Quotidien was some years ago in Paris, and it was love at first bite. When I saw they opened here in London, honestly... I salivated. For me It is carbo heaven, their bread is to die for, my favorite thing to do here is come for breakfast, order a big cup of cafe au lait, a basket of bread and get crazy with the amazing spreads they offer, my favorite is the praline spread, it is heavenly. Of course I can't treat myself to often this feast, otherwise I'd be a walking blob, but from time to time a little indulgence is perfectly allowed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JJhfVadOhU5Tb3hWy79ppw",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JJhfVadOhU5Tb3hWy79ppw/o.jpg"
      },
      {
        "img_id": "PkuZYYj74Av_VA7NDJGc6g",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PkuZYYj74Av_VA7NDJGc6g/o.jpg"
      }
    ],
    "user_id": "eN7dzEJM0yL0NgvAbCYbkQ"
  },
  "zqr1UXrNW6iuCRgTEOfK5w": {
    "date": "3/23/2011",
    "text": "Not a fancy place, but I had a great experience.  The servers all had smiles on their faces. I had a vegetarian tofu salad and the presentation was beautfiul, quantity was plentiful.  Their sweet potato fries were delicious.  And their cheese plate was nice too (had it at the close of the meal).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDG5r0s33MsiweWCk8YKig"
  },
  "wiR7oV8n_OHlRsq5Nf7Fog": {
    "date": "9/10/2010",
    "text": "I ate breakfast here three times while staying at the hotel next door. Consistent, solid breakfast, lots of jams and spreads for all that bread. This is an excellent place to get your carb fix at the beginning of the day, or to kill a hangover. The coffee is OK (cappuccinos are better), orange juice is fresh pressed, and no one will rush you out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJfHIGyA5lSF7YRbtMXh7g"
  },
  "Z28Jd1e9-twrCLvKjojyFA": {
    "date": "6/13/2008",
    "text": "the bucket of latte was wonderful as was the food. I have eaten here both indoors and outside and outside is absolutely best. From small dishes of bread and honey through luxurious salads to full evening meals, this is a fantastic place to eat. All alone with a book or with a gaggle of friends, this is a great place to blow a few quid",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "h_XBZmfHSxxgHqpYUOcTWg": {
    "date": "10/31/2008",
    "text": "Nice place if you like coffee in a bowl. It's trying to be quite French. The breakfast menu is limited and if you want to stuff yourself with lots of different kinds of bread, this is the place to come! They do a nice granola pot with yoghurt and berries and if you like soft boiled eggs and soilders, this is a good option out of mostly sweet things. The lunch platters are pretty good, they do a lovely one with different types of salmon and smoked salmon with guacamole on the side. Nice light airy atmosphere for a relaxed meal, but doesn't set the world of fire.",
    "rating": 3.0,
    "rated": {},
    "photos": [
      {
        "img_id": "hPPeWB6aLkgwOvlSW7H2pw",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hPPeWB6aLkgwOvlSW7H2pw/o.jpg"
      },
      {
        "img_id": "HDmmpkn0dg1mIiab1M4MdQ",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HDmmpkn0dg1mIiab1M4MdQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "TDwDycYb8H8zjrXR2EoFQA": {
    "date": "7/9/2009",
    "text": "I've been to le pain quotidien first in Nice, then in NYC. My Nicoise experience was amazing, which explains my return to it in NYC, which was slightly less amazing but still very good. The London stores, however, just doesn't give me the same feel... it feels a lot more franchised, and the big open wooden tables feel more clustered and systematic than open and friendly.  But, echoing everyone else's sentiments, if you're a carb whore and love your breads and spreads... this is the place to be. Their chocolate spreads are ridiculous... hazelnut spread = delisssssssh.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jWogrkf0PMfP9UoiXULKuw"
  },
  "buaR_TP14eve9gIma6Ghpw": {
    "date": "6/19/2008",
    "text": "Perfect spot for freelancers with free wifi in a central location as you will tell from the number of people working on laptops either side of lunch. Recently ive been spending a couple of days a week working from here. The coffee is great and comes in a bowl. The food is also good, I would recommend the salad nicoise or a mediterranean platter if you're hungry, or with a friend. Ive also noticed this place is good for meeting/bumping into people. If this place is full, the breakfast club on d'arblay street also has wifi and is good.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qIUFf57vIr-4CRLHApn9Xg": {
    "date": "7/2/2008",
    "text": "Wonderful place to relax, have some excellent food and coffee plus catch up with friends. The perfect place for networking, having a meeting or relaxing and getting work done, I would highly recommend this place. The staff are not intrusive and yet just when you need something, they are easily found. They do not hover, nor try and remove you during busy times. The food is excellent and varied and the desserts are worth the trip alone. The outdoor seating area can be a bit too much in certain weather but otherwise an excellent experience.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MvkXAMU0hsBbW3_D4j0sEQ": {
    "date": "4/18/2009",
    "text": "Even though it's a chain, it was very nice. The \"Tartine\" was excellent and the coffee was very good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3fyShJFz57qhL0OG2-i_7g"
  },
  "fU1hPhJCM0P8CXwlSMA7vA": {
    "date": "11/20/2008",
    "text": "I am not sure where this fantastic chain was started(I became a fan while living in Los Angeles) but this place rocks. They have the best quiche lorraine ever. I order it  most every time. They also have fantastic salads and wonderful sandwiches. Save some room for one of their orgasmic pastries, chocolate tart being my choice. There are many Le Pain's in NY and LA and are all the same. Kind of a country French look and feel. They sell a few items which I suggest all should have in the cupboard. Salt, pepper, and a hazelnut spread that is beyond dreamy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uo0f6HVG3K34L8Aa8f4VVQ"
  },
  "siOIoAzFJeEgGOk1aq48mg": {
    "date": "11/30/2011",
    "text": "You can get a decent latte just about anywhere in London but you have to come here to get the best tar tune, the open sandwich film France? Belgium? The smoked chicken one is the best I a bit fiddly to eat. The cheesecake was horrible though. It felt a bit unthawed although they denied it was frozen.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fESw9C1vBEfnjUiRJM703A": {
    "date": "10/27/2008",
    "text": "I tried this place for lunch (londonist.com/2008/10/wh…) and aside from my oblivious waiter really enjoyed it. Despite its deep in the thick of it location, it had a nice mellow feel. Free wifi was a plus. And, oh yeah, the food was really yummy too. Given this chain's name, good bread is to be expected. During my visit, I was impressed by my soup and coffee too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "dcWYbWoBOp6A4YLsfTc8Mg": {
    "date": "12/1/2008",
    "text": "The danger is I am starting to select all my favourite places by their wifi offering! Never the less, I love LPQ on Great Marlborough Street for the great breads, platters, quiches, and light / spacy interior, as well as the free wifi. It is the perfect place for ad hoc meetings, and for whiling away the time between meetings.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHOlP582pn4SLnDH0yd-sA"
  },
  "IQ7h9CHfHiCQ2SfW0gv9UA": {
    "date": "6/12/2008",
    "text": "Thinking about this place makes me hungry! I recommend coming here for breakfast on a weekend morning, when it's generally quite quiet, despite its hectic location. There is a chain of these quaint cafes/resturants - but this is the one I know best and frequent the most. As probably guessed by their name, which translates, 'the daily bread' (minus religious connoctations), they have a vast array of breads and pastries perfect for a breakfast treat. Each table, which are usually large and communal, has the most delicious pots of spreads - chocolate, nut.hhhmmmmheaven. All told, slightly on the pricey side, but well worth it now and again.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1f9f2F1LSPUUKqlRkGS16A": {
    "date": "11/27/2008",
    "text": "This chain bakery/cafe offers breakfast through dinner in a relaxed airy atmostphere. The fresh bread, which comes with multiple choice of spreads is delicious and the coffee strong and (mostly) well made. While slightly on the expensive side, and with service that swings between over enthusiastic and damn right tardy Le Pain makes up for its downfallings with free wireless internet and staff that let you loiter!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "x-z42-IArrPCqbTaUbxMQA": {
    "date": "7/19/2008",
    "text": "after work ????????tart??ice cream???.. iced latte!!??pot?cup?coffee???internet??????????",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vnuHiHs6Cuzq8pzXoYvXbw": {
    "date": "3/6/2018",
    "text": "Pricy but worth it if you want something flavorful and simple. I had a delicious open faced sandwich with buffalo mozzarella and smoked chicken. The salad was perfectly dressed with a lemony vinegrette.  The bread was exquisite and well worth parting with my limited wheat intake as of late. My mint tea was mistakenly given to someone else, I suspect, and I find myself sipping on something Earl Greyish. The customer service was too nice and the day was too cold as well as rainy to stop me from sipping it. I will chalk it up to a happy accident.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YjHqkRJQ99ExTyCK1XU9tg",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Open faced buffalo mozzarella sandwich with smoked chicken.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YjHqkRJQ99ExTyCK1XU9tg/o.jpg"
      }
    ],
    "user_id": "rjWAylKG5sOfCw0k9eGLVQ"
  },
  "RpQKBg8OQjCzaYJxRZVrxg": {
    "date": "10/30/2016",
    "text": "My hotel room wasn't ready when I arrived so I decided to wander over to Carnaby Street to explore. This is just at the entrance.I was carrying too much and perhaps a bit impatient to sit, so I and the people behind me gave up and seated ourselves. The place was half full and a waiter was trying to do double duty at the tables and front door. It smelled delicious and everything was organic.I found a yummy trio of jams/hazelnut spread on my table and knew I needed some fresh multigrain bread to eat with them. To be honest that seemed like a meal in itself, but I couldn't justify asking for table service for £3. I evened it out with yogurt, fresh berries and a skim cappuccino. (Like in Canada, they say skim rather than nonfat, except perhaps in Starbucks).I added a little sprinkle of sugar to the unsweetened yogurt - yummy but I could not finish it. The cappuccino was one of the best I have ever had. On to the bread. I could have eaten a shameful amount of the Belgian hazelnut praline spread - put Nutella to shame and I love Nutella. I didn't even try the jam!By the time I left the place was packed with happy looking people.The food is amazing, service is okay. Definitely would repeat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bTZYUMFXFY_iMmyIWeQPpA",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. More spreads.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bTZYUMFXFY_iMmyIWeQPpA/o.jpg"
      },
      {
        "img_id": "BKGjNljz0o5o9Tgogn2kXQ",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Yummy spreads. The Belgian hazelnut praline is amazing",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BKGjNljz0o5o9Tgogn2kXQ/o.jpg"
      },
      {
        "img_id": "6zj3A_PHbsPD8eO9CyS-lg",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Multigrain bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6zj3A_PHbsPD8eO9CyS-lg/o.jpg"
      }
    ],
    "user_id": "l1VoG-0-bDF-us7xbWxfeg"
  },
  "1CclGW-Ax-WdbuU_GttQew": {
    "date": "2/19/2016",
    "text": "I've been to this LPQ many times but realized today, after enjoying another lunch at this location, that I haven't written a review yet.Ambiance: This place is sprawling and yet almost always has a bit of a wait during lunchtime. Must be the great location in the middle of Covent Garden. My biggest problem with this location, however, is that it's quite dirty. Restrooms are often disgusting, tables could use a proper cleaning as well. Service: Hit or miss. We had a great server this time around, who was quick to take our order. Other times we haven't been as lucky and have struggled to find someone to take our order, to bring butter (can't have enough butter), to bring water, to bring us the check.Food: Is fairly consistently good. Love the Quinoa Cake and wish they served this in the USA. Bread is excellent and fresh. Salads are usually good as well.I'm sure we'll return as we're often in the area. I just wish they'd clean up a bit!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "GYv8xJeLdN0aQq8dZqIH4w"
  },
  "lS2STvRsvuiwxpL0rh8vUA": {
    "date": "1/15/2017",
    "text": "While in London this past year, my husband and I made this our regular breakfast place. The staff was amazing and super kind. Loved the bowl of macchiato. I couldn't be happier. Thank you for starting our mornings of right. We were even more pleased to know that there are locations in our lovely city of Chicago. Although they are nice, doesn't have the same feel as London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCMPltXPjttXws2ajcTwlw"
  },
  "rGTu8-hLEcXJZ0EMpdBPXw": {
    "date": "10/25/2015",
    "text": "Great atmosphere, friendly waiting staff, I liked the mix of modern and bit more hip elements. The cake selection is great and the almond croissant is a must try!The only point which was a slight let down for me was the take away flat white ... They use the same size cup as for latte so you do end up with a latte instead of a flat white which is disappointing. What saved it is the quality of the coffee which is great.One of the reasons I originally picked this location was the free wifi which functioned very well and was easy to connect, no registration or signup needed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GQErj-rVu3u448vGejM33Q",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Take away flat white",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GQErj-rVu3u448vGejM33Q/o.jpg"
      },
      {
        "img_id": "ACPTZWtsTpopybw7fAGTwg",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ACPTZWtsTpopybw7fAGTwg/o.jpg"
      }
    ],
    "user_id": "qmlkQI-qpHqo1Pd-M289UA"
  },
  "bE7qyMgEVZD29dGvrhhvLQ": {
    "date": "3/19/2017",
    "text": "We were waiting on our hotel room and stumbled upon this location for breakfast. Loved it so much we ate there for breakfast three times during a one week trip! I am a huge fan of their porridge with honey and almond croissants. Even when busy the service was above average and the food quality was consistently excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTB2Adze4ZmDmZw_t09VnQ"
  },
  "m3VFhdbNDX0OY3EtPulQ6w": {
    "date": "2/28/2016",
    "text": "Really enjoyed the salads here. Staff are really friendly and a the avocado tartine is yummy!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C46M5gPmWt4F5oPpy4DMAQ",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C46M5gPmWt4F5oPpy4DMAQ/o.jpg"
      }
    ],
    "user_id": "8PheOCW6OT_QQ4g5wul0hQ"
  },
  "v7hlxI8VV0WLpvhlIXpPUQ": {
    "date": "6/7/2015",
    "text": "Fantastic food and drinks!!!  Cappuccino was tasty!!  Fresh orange juice was delicious. They have a wide assortment of breads and jams - Raspberry was awesome!!!  Egg dishes were tasty as well - scrambled, soft boiled and baked!!!  Environment was relaxed and servers were all friendly. Ate there all week during my stay. Highly recommend!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ta0SGMUv8JqrGWwpQSO1gw",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Baked organic eggs with chorizo and a large cappuccino!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ta0SGMUv8JqrGWwpQSO1gw/o.jpg"
      }
    ],
    "user_id": "NTa0X4TIaUnbPxYiY-2f8g"
  },
  "giimtmIkC-cpCxERmJdmPA": {
    "date": "8/12/2015",
    "text": "I love everything organic and healthy and I like the Pain Quotidien interior with the long wooden tables, so I chose this place for a sweet afternoon snack. I got a chia seed pudding, which was pretty nice, and my brother ordered the Belgian waffle with warm chocolate. First of all, it was a tiny waffle and quite sad to look at. On top of that it also tasted awful and was only enjoyable with lots of chocolate poured over it.I hope that their savoury dishes are better!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPutIn3JgUQyVBLOeilXEA"
  },
  "i5TX1OatebstKzxeFCMRtA": {
    "date": "10/24/2013",
    "text": "Charmingly strange coffee place.I stopped by for a quick Mocha between getting some shopping down around Oxford St. I was having lunch a short while later, so didn't indulge in the delicious looking pastries and home-made sandwiches at the counter. I ordered and sat down to await my coffee.It arrived, and strangely in a bowl. Granted on a cold winter's day, this would be ideal. However drinking from a handleless mug/bowl was a little weird. But that added to the charm.Wifi as expected is free, and the place deceptively spacious. The ambience is quiet and groups would walk in for their meetings with laptops in hand.The theme is simplistic, you're able to buy all sorts of jams and teas you find on the shelves, but this place is nothing special, just another really good clean coffee shop. Food is absent from this review, but I'm sure it will be just as good as the coffee.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CkJMMj0o8ojjjffhsjI-Rw",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Mocha in a bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CkJMMj0o8ojjjffhsjI-Rw/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "bdJY8_KhE6s3S7HPXtTKHQ": {
    "date": "3/26/2016",
    "text": "My first experience at Le Pain Quotidien was in Philadelphia in 2015; so I wanted to try out a London branch of this eatery. And I took the family there, since I had always told them mouth-watering stories about this Café. And...again it was a great experience. We liked the relaxed and donw-to-earth atmosphere. Food was excellent (particularly the bread with avocado spread) and my personal favourite: Belgian waffles with berries (although I must say: in the US they are a little more generous with the amount of berries they put on top...). Fast and friendly service, there was even a little time to chat with the waiter. Coming from Bavaria, we also like the concept of the Comunal Table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G0odyeVdKaV3fpsNR8EBsw"
  },
  "h0TSja3PPX5j0JnG4wH3wA": {
    "date": "12/13/2014",
    "text": "It real feels like comfort food when you're eating it... it's fresh, nice combination of flavours and good looking too, slightly pricey (paid around £30 for a salad, glass of wine and a dessert) but would go again occasionally. Service is spot-on, very friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lbpsmRnUjdhrVFqXNJWLJA",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom. Lyonaise salad and confit duck",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lbpsmRnUjdhrVFqXNJWLJA/o.jpg"
      }
    ],
    "user_id": "ceLsCxNVYEnjb0qPD9hAiQ"
  },
  "w_XjTayTmVDG1bls46HIWQ": {
    "date": "10/28/2013",
    "text": "- nicely located in Soho (not far from Liberty)- friendly staff- pretty popular place- nice and big variety of pastries/soups/salads/sandwiches (great bread)- detox salad was very flavorless (only a little bit of oil); ok it is detox, therefore no spices, pepper, salt; big portion including bread (9.80 GBP)- salmon & prawn platter (big variety of fish, guacamole, etc.) was good, but nothing special (13.95 GBP)- Vegetarian Tartine with goat cheese was really tasty (big portion as well; 10.75 GBP)- Scone with clotted cream and marmelade (4.10 GBP; big portion as well)- limonade (very sour, but tasty; 3.10 GBP)- big bowl of cappuccino (3.30 GBP)Conclusion: I liked the place and next time I would not take a salad but one of the tartines!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3BHeHTGNZcaEi8woqGy2kA"
  },
  "0C46ddHXX9AnSv2DEeLrXg": {
    "date": "11/21/2014",
    "text": "I just love this nice place i Soho. Good food and nice people. I can recomend it to everybody. Free wifi.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qfAeGHgtefBR42K5qGjJVA"
  },
  "ZJHUYaRHSuG6mTQGypd-3A": {
    "date": "12/26/2014",
    "text": "If you like flavourless food you must try Le Pain Quotidien!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GfXJmyt8dM53urHbHbg5Lw"
  },
  "G-OeMh8g1EKpWuwCJHd2oQ": {
    "date": "11/11/2008",
    "text": "This lovely little Belgian organic chain is the perfect place to use for a series of purposes.  Le Pain Quotidien is a delicious bakery, patisserie, coffee shop, and restaurant all in one.  All of the foods are simple but full of goodness.I often see business meetings taking place here, but there are also a lot of people just popping in for a quick lunch after shopping or for a social meeting.  The chain serves a fine selection of bread, wines, coffee & tea, milks and butter, charcuterie, soups, chocolates and many more.  The quiche is also one of my personal favourites.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zb7L7AIsN0ctHQPKU_dPqA",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zb7L7AIsN0ctHQPKU_dPqA/o.jpg"
      },
      {
        "img_id": "QXJZ-rYnddtcfYJ1gmkOUQ",
        "caption": "Photo of Le Pain Quotidien - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QXJZ-rYnddtcfYJ1gmkOUQ/o.jpg"
      }
    ],
    "user_id": "O3CZ6ePrFYCNKks3xCaaMQ"
  },
  "qFOBCm7S9E0-ku5fPzrj_A": {
    "date": "11/1/2010",
    "text": "Looking at previous reviews and the carbs loading debate, I can summarise my lunch experience as carbs/protein/saturated fat/fibre combo.Might as well get the full spectrum of nutrients:- chunky organic pate (with bread)- warm duck confit salad with prosciutto and pan fried potatoes (and bread).Oh and I went in there earlier for brekkie, hot choc & brioche (more bread, this time sweet).I was happy as Larry me!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTUbajPBghvj-4ebP2D8-Q"
  },
  "6D_GHh0ZEa9Gcc0ZydgJjg": {
    "date": "12/18/2009",
    "text": "It's lovely, it is well located, the staff is nice. Just lovely.It's just that the food seems to be mostly small pieces of bread, and smaller excuses to serve that bread. If you need protein here you are out of luck. If you are very hungry you are out of luck unless you order double. Just order some prosciutto snack and watch as the thinnest sliver is lovingly served artfully folded on a slice of bread 30 times as thick. Four slices like that, the end.It's snacks served as main courses and it just won't do.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i7-9PzjvO_lrzQvVxHAibQ"
  },
  "28Q-3rc0AVF03BA6l7yVCw": {
    "date": "7/9/2009",
    "text": "If I were a dinosaur, I would be a Carbosaurus Rex. I would also be a C-Rex who loved free internet. (Although typing would be a bit of a challenge.) And since I'm a dino, I'd only like organic food, natch. Thus, Dinosaur Laura would looove this establishment. Picky eater human Laura wasn't as impressed. While the food was \"nice\" as Brits would say, it certainly wasn't \"knock my socks off and leave me thinking about it for days and days,\" as I would hope.  (Although \"nice\" can mean exactly this if it's coming from a Brit, be warned.)  My favourite part of the meal was my bread and olive oil, so I can certainly see myself coming in for a mid-afternoon work-sesh and carb load. Perhaps I'd even splurge on a glass of white wine. But for a meal?  Nah.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "JCGIYIEHiLfh4HPhkAwh4Q": {
    "date": "7/8/2009",
    "text": "Being taken for lunch is different to choosing a place and having the weight of expectation on you. Will it be good or will it be bad? Relieved of the duty of choosing, I was able to sit back and savour this very good French restaurant. The lunch menu is clipped to essentials and someone used to the likes of a Wetherspoons menu may not appreciate the offerings at a Le Pain Quotiiden.With an impressive variety of Tartines and Salads for mains, four different healthy sounding platters and starter options of soup, pate or quiche there is choice for those looking for an organic, anti-bloating meal.The clue is in the name, but if you like bread, Le Pain Quotidien will take you to heaven. This artisan bakery takes tremendous pride in their food and it shows. My beef tartine was very good, and I really enjoyed my pate and cornichons. For a big eating, hungry man (that's me), I would not recommend this restaurant. The meals are very well presented, clean and healthy, but it is unlikely you will leave feeling ultimately satisfied as there are no real lunchtime MEAL options. For the discerning health concious man/lady, this place is perfect.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  }
}