{
  "8rZaGDBoTE_oBftWWuouMQ": {
    "date": "10/2/2008",
    "text": "When it comes to fish & chips, most take-aways are pretty much the same, but not this one! Some people might find it difficult to believe that someone can get passionate about chips open in a piece of newspaper, but Toff's have some way of stirring that emotion! It's always busy, which is a sign of good food, but can get irritating if you just wanna pay and go. There is also a sit in area if you just want to relax and read the newspaper :)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OXWC9TqfwyYoNzYi8ymZig": {
    "date": "9/28/2011",
    "text": "okay finally went here after bookmarking it ages ago in the hopes of showing my american visitor \"really amazing fish and chips.\" we trekked the two buses it takes from NW3 to N10 and yes it was worth it. we had the cod and haddock and i'm no fried fish connoisseur, they tasted the same to me, but in a delicious way. the fries looked super soggy because it was drenched in vinegar but somehow still managed to be one of the yummiest fries i've had. coleslaw tasted really homemade, simple, incredible. i didn't even feel ripped off about the £1 or £1.50 i paid for the pickle. read a lot of recommendations on yelp to try it grilled instead of fried, so if i ever have time to do a proper sit-down at this place, definitely going to try it!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "SC51yA3mxFnQGHZnGMWvqg"
  },
  "OAra2u1YmRr4siEHSJ5D7w": {
    "date": "8/11/2010",
    "text": "Excellent fish&chip shop gets very VERY busy on friday evenings and not without good reason perfect f&c plus all the usual pies/saveloys/fishcakes/codroe/mushy peas/pickled onions/gherkins etc... also sit in option available ( but you might want to get here very early on a friday i dunno if they take bookings )",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5EshS2GGfnJSrCF1PpMUzA": {
    "date": "8/25/2009",
    "text": "my very first taste of england couldn't have been better! Toff's is absolutely amazing! you simply must get their cod and chips wrapped up in brown to-away paper drenched in vinegar and drizzled with salt! de-licious!!! the take away is great, the restaurant itself is a little small, so if you have a big group, don't eat in... for less than 10 pounds, you can't beat it! cod, chips and gherkin, yes please!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "kprBZ0AgofFpB4yu139ExA"
  },
  "CBj9m60UAL9xtPUADNIt7w": {
    "date": "7/24/2010",
    "text": "Very good fish and chips and huge helpings. Gets very busy on a Friday night so be prepared to que.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PXCxseYtDQtZviwK-tPJMw": {
    "date": "7/11/2009",
    "text": "Hands down, the best fish and chips in London. Enough said.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yHkF4YbvYMaFE-927uobSg"
  },
  "ZaRx1vE9bfaLy7HphPHBlg": {
    "date": "3/17/2012",
    "text": "It was my first time at Toff's fish. Fish and chips is my favourite dish and they really cocked it up! It was mostly hard batter (which I had difficulty getting my fork through) on my plate and tiny bits of cod-not a good solid fillet as I am used to. Well cooked and the portions were very, very generous which was great because I was absolutely starving!! but the food was tasteless including the lifeless salad and the insipid soup.You wouldn't think they were an old hand at this dish, although, so many of these glorified chippies change management then the quality diminishes, sadly. I always try anything once, especially where food is concerned but I won't be returning. There are far more superior fish restaurants in London.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uUC5eBqFfLusF9h7QKNoUA": {
    "date": "12/25/2012",
    "text": "I really like this place--I was expecting a bit of a grubby chippy, but this is a proper family-run restaurant serving to a diverse and casual crowd in Muswell Hill.The fish was amazing--the crispy delicious crust that the batter creates was spectacular and the fish was so moist and delicious.  Unlimited chips--wow (although they weren't amazing--something to work on).  And the Greek salad is spectacular.  Congratulations to those that were able to save room for dessert--I was absolutely stuffed with my massive piece of fish.A true neighborhood treat.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "Yz2UBN1Rtlk4chNN3iO3UQ": {
    "date": "12/14/2011",
    "text": "Yum, yum, yum, I am licking my lips as I think back to the best fish and chips I have had in London and yes I consider myself a fish and chip connoisseur (OK chief tester then!).  They have a great selection of fish and you can take the healthy option and have your fish grilled and not fried.  They even reccommend grilling some of their fish for example their lemon sole.My only complaint is that it is in Muswell Hill which isn't that easy to get too.  However, I and my firends heard it was the best so we took a cab, have to say it was worth the journey!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "eRHkfYKYhj6J7QS8cNoxZA"
  },
  "SM6Fc2_EaxxVuFAncPrt0g": {
    "date": "7/26/2014",
    "text": "The restaurant was so busy at dinner time, and a lot of people were waiting for take out. However I didn't need to wait for a long time. Because they have a plenty room on their backside and up stars. A portion of meal was just so massive, it was pretty good but I wasn't able to finish it!(Too big meal for me)  Recommend you to visit when you feel REALLY hungry.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mk671kZxxGhjbeNdSdEmCA"
  },
  "V1Sm_BsmWTkM5toxP0S97A": {
    "date": "7/29/2011",
    "text": "I really needn't write anything as I think everyone has already praised it enough but I just have to - best fish and chips in London.Dining in I had grilled cod with new potatoes and dining out I had battered haddock with chips and a giant gherkin (of course!) and both meals were so fantasitc that, despite the fact I was full about the third of the way through (due to the GIGANTIC portions), I forced myself to finish every last bite anyway...food THAT good shouldn't go to waste!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 5
    },
    "photos": [],
    "user_id": "mvTskNQt0CMx8oTH1ku7-w"
  },
  "Fwl_33evMQzZpcxKtNwyDg": {
    "date": "9/28/2009",
    "text": "Great fish!  Many varieties!  And, for those of hearty appetite, the regular-sized fish portion is HUGE.  If you're going to visit North London, then stop in to Toff's.  Heck, even if you're not, maybe you should make a special trip up for great fish and chips!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CPR7gdg-UXNDwTVv0HQcgA"
  },
  "fPDC7m3Tgl_2XFKk9Pp97Q": {
    "date": "12/1/2008",
    "text": "Toffs is simply the best chippie I know of, and I am not the only one who think so.I recall first discovering it a few years ago. I saw this nice looking chippie, smelt it and was sold. I had a takeaway and started munching on them just outside. Half way through my bag, I saw a celebrity walk past me and go in, not Britney Spears, nor anyone too famous, I think he presents 'have I got news for you'. Anyways, when he walked in, I thought to myself, this must be a well known place.That day I went home and looked forward to telling the family about this new place I discovered, called Toffs. When I did finally tell them, they had already knew of it and had been going there for years, in fact, we use to take walks around Muswell Hill and treat ourselves to fish and chips there. How weird.I have been going ever since and must visit around twice a month. They have a traditional seating area and it is usually packed. It is also award winning and has been around since the 60's, it is now owned and run by a Greek family and I absolutely love it. They do have a few other things on the menu, like grilled chicken but I couldn't really tell you about that as I haven't tried it before and doubt I ever will. Eating chicken at Toffs is like eating a salad in a sweetshop.  It's all about the fish and Chips at Toffs!! Go!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iwzsY2w3SuHbsa1Y2F2dFg",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iwzsY2w3SuHbsa1Y2F2dFg/o.jpg"
      }
    ],
    "user_id": "A3tbiT99rP4J2J4RPbYBUQ"
  },
  "0Fr_2TFq4gGsV4tTRotGNw": {
    "date": "11/1/2013",
    "text": "It is not just a fish&chips place. It is more than that. They really know how to cook and season the fish.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qkEjr5aR8SaZHvme_Znuew"
  },
  "YMAGN_4ZgaNgveuZPyIluw": {
    "date": "5/9/2010",
    "text": "In total agreement with the other reviewers: you will not find better fish and chips anywhere in London, if not the world. Every conceivable type of fish made into utter scrumptiousness. If you're some slimline person who insists on ruining the fun, they have delicious steak fish as well. (And if you're a rutting pig such as myself, you may find yourself from time to time indulging in pies.)The stogy chips cannot be described, they are that delicious.The cole slaw is extremely tasty.And the desserts, which you won't have room for, are out. of. this. world. If others were not in attendance I would eat the treacle pudding by sticking my face in the bowl like a wild boar, until the emergency medical team intervened.Wash your sins away with a bottle of champers and you will have had yourself a most satisfying meal.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 11,
      "cool": 4
    },
    "photos": [],
    "user_id": "oCnLbe9OGnpyQBY4E90bVQ"
  },
  "jmw8w-L3QkU-ePXB7yMwAQ": {
    "date": "9/21/2010",
    "text": "Fish and chips will never be the same to me, Toff's I will never look at another fish and chips the same way ever again. LOVE this place, and portions are outrageous! I shared one with my cousin, next day i got my own. Go Toffs!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U5pgwqar3Tbmyp_DR2nNzA"
  },
  "6jbc1yI3eCmm6OplkAnTgw": {
    "date": "2/15/2014",
    "text": "The place is awesome, enjoying my saturday evening with friends. Food is prepared quickly and tastes delicious. We had the chicken steak with some side orders which were prepared very well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5s8Mehm9iC7q57K8i0KWUg"
  },
  "xPTuj05xsoPADZx4wzpNdQ": {
    "date": "6/6/2012",
    "text": "yes, yes, yes! The best Fish. I was on the hunt for the best Fish and Chips in UK. By far the freshest and light cod I have found. They serve you the whole fish not left over lumps. It's plenty for two and the sides were really good too. I will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aqkv6KMvDLf348ejnnbh_Q"
  },
  "h6CZgXgs0yTYNMgso2zDTg": {
    "date": "8/15/2011",
    "text": "Great British Fish and Chips, no frills but lovely taste, would definitely go back.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "v8RyuX7ybTlkQ9vbAd6VBw"
  },
  "BI3j8SeHbIBCpkmDwFivHg": {
    "date": "6/30/2011",
    "text": "Holy Moly.....have you tried the crispy cod here?? perfection! and the chips....mmmmm.....and the coffee and bread you get in the deal for under a tenner!!! hahahaaha....this one meal was the only meal I had yesterday and I still felt full when I went to bed!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "mHdmytqk6BwqayZAJR7PyQ": {
    "date": "10/17/2011",
    "text": "I've been going here for years and years. Food is fantastic and the staff are very friendly. A must visit in Muswell Hill.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWfZ8JsAneryNfSo2AZrFA"
  },
  "ZIB6xMeWdgaQHyCK0yrj7w": {
    "date": "12/18/2008",
    "text": "Toff's have the best fish and chips in North London, maybe even in the whole of London. Period!The Greek family who run it have an uncanny ability to make a typically English dish to perfection and this has been noted. You can read the dazzling print reviews in the window as you wait. I've never eaten in as being a Northerner I like mine wrapped up and taken back to the comfort of my own hobbit hole, and it would just feel a bit weird eating fish 'n' chips off a plate and not from a piece of paper that you're worried will leave a greasy stain on your couch arm/lap/table (hey it's all part of the fun) but the restaurant does look nice.You do have to be a bit of a toff to eat here though as it's very expensive (by 'eck we're not in Yorkshire now love) but it beats any other chippy down here so I'm prepared to pay the price. One great little thing is that they will do you a grilled fish if you're on a diet, but the batter's so light and crispy that I seriously recommend you don't miss it. It's simply fabulous Dahhhling.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "SazNhsqh0aCMKkn55MXjBQ"
  },
  "tc6emrn23BhkBwmuKThYaA": {
    "date": "2/13/2011",
    "text": "Toff's is in the top 50 fish & chip shops in the UK and as it's on my doorstep, the only choice to go for fish and chips.I managed to reserve a table at 3pm on a Friday for 6.30pm - I recommend booking a table as it gets very busy - it was packed by 6.30pm, so was very lucky to get in.Now, normally I'd have battered fish & chips but the charming elder gentleman who works there - could own Toff's came over to ask us what to like.  He encouraged us to try a grilled cod without batter -- he stated that once we'd tried the grilled fish with fresh lemon juice, olive oil and parsley, we'd never go back.So, we ordered one battered and one grilled.  It came with a generous portion of chips to share, ketchup, salad and homemade tartare sauce. Had two cans of coke. Breaking it down:1. Battered vs Grilled - Grilled is the WINNER! It was so tasty, flavour was beautiful, fish was light.  I will struggle to eat battered fish again.  Also, I didn't really like the batter on the fish - it was was a bit stodgy rather than light.2. Chips - outstanding. I've been on the look out for a chip shop that hits the spot since my youth in Coventry where 'Cooper's Fish Bar' on Gulson Road was awesome.  Toff's chips and just awesome.3. Atmosphere - Vibrant, friendly and full of all mix of people. Staff are friendly and have personality.4. Cost - its twice the cost of take-away (£30) but if you are going to enjoy the grilled fish, you can't take it away, so worth every penny.If you are in the area then go to Toff's - it's awesome.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SH08S4_b_PHsuw7nTie3qg"
  },
  "8V-CVNzMjMnKmYy7O66x9g": {
    "date": "11/8/2009",
    "text": "I'm not sure about the name, but what I am sure about is that they had some very nice chips that went some way to soak up the alcohol in my body at the time! They really were excellent. I see this place has won awards so they were probably wasted on me in my state of inebriation. This place might well be worth a 5, but I would like to try something else before I bestow that honour upon it. Unfortunately as I was here late at night, there wasn't much else available besides the chips.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "MJKb_25tzrf0NFMy2gJnKQ": {
    "date": "3/12/2014",
    "text": "Many of these reviews say that Toffs is a very good chippy.  Normally the fish and chips are freshly cooked, and certainly if you want something other than Cod or Haddock, it will be cooked while you wait in 6 - 8 minutes.There are some Buts!  Yes Cod is cooked up front, and Haddock too. and chips. occasionally the bag of fish and chips you get are not quite as fresh as they might be.  Although compared with many a Chippy, Toffs are rather better.  Yes there are staff everywhere, and one wonders why there are so many feet behind the fryer! Then there are new alternative fish types.  Cornish Pollock, North Sea Whiting. er NO.  It is time to embrace these alternative white fish types to preserve stocks.  They could be a lot cheaper out of the fryer,offering a modest portion of fish and a small chips for under a fiver. Time to CHANGE THE FISH! Which brings me back to prices.  Toffs is very expensive for those on a low income. I cannot afford regular cod and chips at Toffs at £8 a throw.  Particularly as at Stroud Green, the new CHIPPY, that's its name, does a fish supper for £4.50.  And it is a good fresh small Cod and medium Chips.So Still a Good product, but NOT value for money. So only 3 stars.  Rxx.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5pV37-v8gpuXGErU9vq8aw"
  },
  "HFjYQ6V_Daw3FSAjks2SKQ": {
    "date": "9/16/2010",
    "text": "if you live nearby, you have to try this place.  huge portions of fish, excellent fries, awesome vinegar... best fish/chips ive ever had in my life one thing that did stand out to me the most was there was no fishy smell or fishy flavor. it was very succulent, and a huge portioncome hungry.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "oc1t5JVVjyhU4vrMA1Q3VQ"
  },
  "gX5BFJ_5W8TJ1JziQ6OfBg": {
    "date": "11/16/2009",
    "text": "Quite simply the best fish n chips in town and I've tried a few.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ql_IjW6MBtkPvmz8f7FV1A"
  },
  "spUEO6Fo5cVeyuXrTtjOdA": {
    "date": "9/29/2015",
    "text": "My visit to Toff's is one I will never forget. The fish and chips were the best I've ever had and I had to eat the sticky toffee pudding slowly to enjoy every bit of it. And for those who said they charge for ketchup, that is just not true. The walk from the tube station was very pleasant, not the terrible, grueling trek that I have read about. I sat and talked to two local ladies throughout my entire meal. As an American traveling alone, it was wonderful, then George, one of the owners came out and I think I talked to him for half an hour. I did not want to leave and nearly asked him for a job! What a great person and I wish him all the success in the world.I look forward to returning soon and recommend Toff's to anyone that wants a wonderful, authentic London experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "YYeLyitVp89BxijB720mgA",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YYeLyitVp89BxijB720mgA/o.jpg"
      },
      {
        "img_id": "MWGsADb1oGzYT4tuzj_87A",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Me & George, one of the owners.  One of the nicest, friendliest people I have met in the UK.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MWGsADb1oGzYT4tuzj_87A/o.jpg"
      },
      {
        "img_id": "CAY8GsHCS97-EpSRa95U5g",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. These guys were great.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CAY8GsHCS97-EpSRa95U5g/o.jpg"
      }
    ],
    "user_id": "DRcu5C-rWFDwJyADfk2rjQ"
  },
  "mTzxpMG7aePCq53O9i0VYA": {
    "date": "6/9/2017",
    "text": "Been a regular in toffs since I could walk. Eaten in and had takeaway. Probably one of the best fish and chip restaurants I have been to. The portion sizes are massive the cod literally falls off the sides of your plate. The chips are crisp and chunky! Service is lovely you can always see the owner walking around and talking to the customers. Really one of my favourite places :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xEiHQZ5ao4Z1GvkK0dq97Q",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Cod and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xEiHQZ5ao4Z1GvkK0dq97Q/o.jpg"
      },
      {
        "img_id": "SOl-dOk6PAR9DHEkSl08dA",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Battered sausage and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SOl-dOk6PAR9DHEkSl08dA/o.jpg"
      }
    ],
    "user_id": "vDI9VLfAVeAXBoQIcU9XDw"
  },
  "dOc5XNtiY1NFBGBtR2A8UQ": {
    "date": "5/15/2017",
    "text": "Best fish and chips in London - no need for too much more information. Have never been disappointed with Toffs. The fish is always fresh, the portions are generous and the staff is very friendly. You can eat in or take out, and they have a menu that ranged beyond your traditional fish and chips. If you haven't tried this place you should. You are unlikely to be disappointed.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "ne1E3sz4-LeBAwDjXTbMUA"
  },
  "8zYO4lQ2Gk_kEoHDnF0Rgg": {
    "date": "9/14/2016",
    "text": "Hate to have to leave a bad review here but given the circumstances of what it took for me to finally get here, I feel obligated. I happen to watch a special on Food Paradise London and TOFFS was featured. I keep a diary of places it eat and this made the list. Did I mention that I saw this special maybe 2 years ago. Well I finally made it to London so was very excited when I knew I would make it there. One of my best friends is from Newcastle and lives in Brixton. For the last few days, he suggested several places and of course, I said no. So we set out on a journey. And when I say journey, I really mean it. We started off by heading to Castle. Since we are heading out to Scotland tomorrow, this was my last chance to do this. So we hopped on the train and it went as follows - 1 stop change, 1 stop change, 7 stops change, 11 stops change, then a slight walk to the bus stop and 5 stops. So we arrived and I was thrilled!!!  It was quite slow when we walked in. My excitement may have been much for them as I felt the need to tell them I travelled all the way from Miami FL to try the Fish n Chips. When we ordered, they were taken from the display rack and right then and there I got a little nervous as I just assumed it would be fresh and crispy. Fries were grabbed in another area in which they have been sitting there as well. So there goes freshness. But still, maybe their batter withstands the air and maintains the crispiness or maybe I was just optimistic in thinking they would not serve anything that was not up to par. We ordered to go and walked a few blocks to a park to eat as the weather was delightful. What a huge, and I mean HUGE disappointment!!!  Cold, soggy, dry. And that was for the Fish and the Chips...  If after reading this review you decide to still go, I would highly suggest you demand it be made to order. Oh well...  My friend told me not to worry as we will find some great places for Fish n Chips when we set out for Scotland....",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C8ABmuHY3zUBkIGqY7WwvA",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Cold, soggy...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C8ABmuHY3zUBkIGqY7WwvA/o.jpg"
      }
    ],
    "user_id": "xxVlgB1pxFClNdCKvsBsOg"
  },
  "QX0RdEjtHHIkGr-hUwd3Vw": {
    "date": "8/25/2016",
    "text": "Fish is soft and good. Chips are tasty.This time I chose take out and ate 10min later after bought.It would be nicer if there is Half portion of chips.I would like to eat in a restaurant next time, of course with much of molt vinegar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RMj_Dla3y8SYp_fa-iFx1Q",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Hoddock",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RMj_Dla3y8SYp_fa-iFx1Q/o.jpg"
      }
    ],
    "user_id": "tWnutGphx0_skiIEOuFUaw"
  },
  "-xiB-u87Z-S6F7p_hP_KFw": {
    "date": "1/27/2017",
    "text": "I've got a takeaway from Toffs a million times, ots such a good staple to have a great fish and chips shop near by! You can tell how popular they are as most nights they have ques outside the door! Plus they do lunch and OAP deals. Normally the staff are very warm and friendly, however the one occasion I chose to dine in the waiter wasn't very interested in serving us and basically forgot we were there. I would stick to getting a take away rather than the choice of dining in again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqJOBqu9hMnoC0cJtTmoRA"
  },
  "EV_pDNpr_Apfagj3PwTShQ": {
    "date": "8/19/2017",
    "text": "Chips are absolutely delicious and I'd go again. However It would be even greater if they delivered to locals via UberEATS or Deliveroo as I think I would probably order more frequently.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2iLlq32kb6xd_sYMgy7nA"
  },
  "XesLUUVdQQ3170XHFS-QCA": {
    "date": "10/21/2016",
    "text": "Love Toff, best fish and chip in London, the owner also super nice! The down side is that the place is very small, since I have a young baby I can't really go there unless I'm carrying the baby in a sling the whole time, no pram",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ar8NA9FoOFmFXR9AWHLCpw"
  },
  "tsELkgp2vN02PDONv4jVXQ": {
    "date": "7/17/2015",
    "text": "Great food, friendly service, this is a local gem! I sat in and dined on a Friday night and the place was full. It's slightly more expensive if you dine in but once in a while, it's worth it for the lovely experience. The staff are incredibly friendly and you can tell lots of locals frequent there by the conversation and banter! You also get unlimited chips :)If fried isn't your thing, they also do a roast fish which looked fantastic. The puddings are traditional and look luscious. The fish and chips were so filling I never got to dessert but the ones my neighbours had looked fantastic.It's going to be dangerous that this is now my local fish and chip shop! I've already been back for a few cheeky cod and chips :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "255UWFKMll3xfOtUj1E_ZQ"
  },
  "oX6vdoO75-5EwrUoPojnIg": {
    "date": "6/3/2015",
    "text": "We always have an excellent meal here. It's always busy which is understandable. Staff are helpful and cheerful. We really enjoy the genuine fish&chips&gherkin&coleslaw. Dover sole does not worth the price however still it's a good try if you fancy grilled fish. We come here often and will continue to do so.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SXWmZQ_o-BDsPKVg0a96IA"
  },
  "PI6H4BoqYO4KDE6mbaThCQ": {
    "date": "6/22/2016",
    "text": "Best fish and chips in London. There, I said it. I am not a big fish lover, but I LOVE what I get here. It is far from being glamorous or a place where I would take a girl for a first date, but the food is just terrific. I always have the haddock with chips and a side order of coleslaw... delicious. I think it could only be improved in the fish were fried on olive oil. I also like the friend calamari and the fried camembert (at least 900 calories per cubic inch!). It is a bit pricey, but it is always full. A couple of times I had to go somewhere else because there were no tables and the queue to order take-away was too long.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFLKdM6o2QTKRN5QYfrplw"
  },
  "sybR6zq0pWExCm_xlQrV5A": {
    "date": "11/14/2014",
    "text": "I just recently visited the UK for the first time.  I figured visiting a restaurant that served fish and chips was something I had to do.  After doing some research I decided to visit Toff's of Muswell Hill.  I'm so glad I did!!My group ordered the following: taramasalata, cod fillet, haddock, vegetable pastie, mince beef and onion pie with mushy peas, spotted dick and sticky toffee.  I am glad that our waitress suggested we order small portions on the cod, as this was quite a bit of food.All the food was extremely fresh and full of flavor!!  My personal favorites were the cod, pie, taramasalata and the sticky toffee.  Everything else was great, it's just that those items I listed were beyond amazing.I would definitely return to Toff's.  Also of note is that we had the good fortune to speak with the owner of Toff's . . . a truly pleasant and knowledgeable man!  Added to my groups experience.Thank you Toff's for helping make my visit to the UK a memorable and enjoyable visit!!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SIx4nci-myQIP7pGzyFgkg"
  },
  "XRfierVdcmC5t-WOv1ZzIw": {
    "date": "11/17/2014",
    "text": "Pretty nice place, the fish and chips were really nice, the fish was fresh and crispy. I would come back to this place. The price is around 10£ for one huge fish and chips plate.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BWjzPACDVNZRybFLIQ5MXQ",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Nice fish and chips!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BWjzPACDVNZRybFLIQ5MXQ/o.jpg"
      }
    ],
    "user_id": "XPnZrVuXX4hkEh-x0SqVZA"
  },
  "KdU5OxJxmUx0GWNLNxHMwA": {
    "date": "9/10/2016",
    "text": "One of the best places for fish & chips in London. There is ample seating to stay in but takeaway is also an option. You can tell by the high level of service and food that there is a lot of love put into this establishment.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JBin82S_wiZMGQC-Y2jORg"
  },
  "8I89WmY5lS3kQG7-GqR2ug": {
    "date": "5/25/2013",
    "text": "Yum, this is brilliant. Great fish and service. Fish anyway you like: Grilled. Battered. In Matzo meal. Fish & Iron maiden memorabilia everywhere.The drummer from Iron Maiden, apparently loves this place so much, he flew Toff's staff out to his restaurant in Florida to teach them how to make fish and chips, is not wrong.Fish!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FOH02K684lzDHKtNanaigg"
  },
  "Pmmylce-1UywSzHQTeWq0g": {
    "date": "8/20/2013",
    "text": "I ordered the Haddock (grilled) with fries and my dad got the Smoke Salmon. The fish was well cooked and tasty but I wish there was some sauce or something. There was vinegar on the table to use but dunno, I guess with the great reviews I was expecting something less plain. The fries were really good. The Smoked Salmon was just so-so.In summary: It was a good meal and I would come back to try the fish fried but not worth the hype in my opinion.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TvP_eoBVvaxULWPNihq-pg"
  },
  "KmEUPFSUmItkmoBH-Xo6Hg": {
    "date": "5/12/2015",
    "text": "Toffs. It's fairly local to me. The prices are quite high, probably based on it's reputation and the fact it's been around for a very long time (nearly 50 years). Cutting to the chase, there is a wide variety of fresh fish. The cod and haddock are very good (what most people have) and the chips are good too. Can't help but feel it's hard to get this type of food wrong in all honesty but this place is good for a reason What make it worth a visit is it actually sit in as it's a nice cosy decor in a lovely neighbourhood. It's definitely considered posh on a comparative level to most but that's fine. I do like it as everything is properly fresh.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "24nhebvGR_fQ86hQ3PBg1w": {
    "date": "9/9/2012",
    "text": "Have to say I've been blown away with the reviews I've read here about Toff's. Is there another 'secret' Toff's hidden in Muswell Hill where people are going to because the one I know in no way what so ever deserves the high ratings its getting. Closer scrutiny of the awards certificates/news articles plastered all over the place show a disturbingly high number that aren't exactly shall we say errrr....  recent. Firstly I'm reviewing the take-away not the sit down restaurant. I have friends in Muswell Hill so am normally passing through a few times a week. Last night (a Saturday) I decided to get some supper on my way home it was about 6:30pm.On walking in the first thing that struck me was the large number of staff.... 6 or 7? far more than I would have expected to be needed to run the place even at full tilt. One of the things that I always see and always annoys me about Toff's is that on there website it says (and I quote) \"All orders are cooked to order\" yet I counted 23 yes! 23 portions of fish in the warmer. There was no way on earth that they'd all been ordered. The place was no more than 25% full with most people in the restaurant section already eating and me the only person in the take away. I always look when passing even if not buying and its the same.Prices are rather odd at Toff's as a take away fish and chips is £7.90 yet the restaurant only charges £11.95. So after adding VAT eating in is only a couple of quid more expensive. Are those taking away subsidising the restaurant?I ordered a large cod with a regular chips. The Cod came in at a WHOPPING £7.90 the chips a more reasonable £1.40. Total cost an eye watering £9.30 for take away fish and chips. Maybe its to pay for all those staff??Anyway on to the actual fish and Chips I got....The regular chips size wise where about right and they were nice and hot. I would have preferred them to have been fried a bit longer for extra crispiness but they'd spent time in the serving draw which sort of steams all of the crispiness out of them.... acceptable but could have been much better.The fish was hugely more problematic. Firstly theres the £7.90 cost. Will you ever get take away battered cod WORTH that? size wise it made a good meal.  As I said above there were  23 portions in the warming cabinet when I walked in and the fish I got tasted like it. The batter instead of being crispy like it is when freshly cooked to order was 'damp and mushy' tasting with not even the merest hint of crispiness. I got  the thin end which didn't flake at all. Taste was o.k but hard to say that over all it wasn't just plain average. The above pretty much sums up my experience of about the last 10? trips over the past couple of years. I only go if theres no other reasonable choice as there really are MUCH MUCH better Fish and Chip places in London than Toff's.For my recommendations....Fishers in Fulham (near Putney bridge) is utterly EPIC. I've not ever been disappointed with Masters Superfish near Waterloo and its only £6.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UC1yBRV7Fy1Jt4LNUEPDQg"
  },
  "8M-HNnApwAwbGRiIL1Hcgw": {
    "date": "6/23/2012",
    "text": "Amazing fish and chips. Very nice setting, feels like an authentic, nice restaurant. We have been looking for a good fish and chips for a while now and this has by far been the best one. They also have a great selection of different fish. I recommend the cod and the plaice. Both excellent.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "012_hfMATnh0nUEi9OYLug"
  },
  "Ppxxo26nISbMQAE8FNi9xA": {
    "date": "4/15/2012",
    "text": "I consider myself a traveler, not a tourist and I hate tourist trap restaurants. I really wanted good fish and chips on a recent trip to London so I checked Yelp rather than the tourist guide books. I read the reviews for Toff's and decided to go there. I didn't realize Toff's was such a journey away from Kensington where I was staying so my mother and I set off in search of great fish and chips. We took the train to North London and got off and started walking. She hates walking and it was 15+ minute walk uphill for the most part. She complained the entire way. She didn't even appreciate the wonderful park views or lack of tourists. The only thing that stopped her complaining was when the fish and chips were set down in front of us. In short, it was worth the walk and the complaining. The fish was huge and  crispy and delicious and it was fresh. The chips were the best I had in London or pretty much anywhere. A testament to how good it was is that my mother, who picks at food and eats very little usually, ate everything on her plate and finished before me!The best part of the meal though: the sticky toffee pudding in custard. I'm drooling now thinking about it. I had also wanted authentic sticky toffee pudding while in London, so I killed 2 birds with one stone at Toff's. My mother had the creme caramel and loved it. In addition to the mouthwatering food, the service was friendly, fast, and totally efficient. The owner joked around with us and Alex, our waiter, was a delight. When my  mother complained to him about the walk from the train he told us to take a bus from right outside so she wouldn't have to walk back. It was one of best dining experiences we had in London. They should consider opening more branches, specifically one in NYC,",
    "rating": 5.0,
    "rated": {
      "useful": 11,
      "funny": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "0NuhTInCpjanu8iyh4HppA",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Sticky toffee pudding in warm custard.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0NuhTInCpjanu8iyh4HppA/o.jpg"
      },
      {
        "img_id": "k2sw5YLky8fp44ffwuZpnQ",
        "caption": "Photo of Toff's of Muswell Hill - London, United Kingdom. Toff's  Cod and Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k2sw5YLky8fp44ffwuZpnQ/o.jpg"
      }
    ],
    "user_id": "wKVM5awMabg0cATYHjDClw"
  }
}