{
  "98E7png_IKmt9Op-bHkLrg": {
    "date": "2/13/2012",
    "text": "This is a lovely little cinema, comfortable, well designed and with always friendly staff. During the day it's also a lot cheaper than most of the cinema's in the West End, and the selection of films they have is almost always fantastic as well.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8GS5MRtvi3hk-H0ALDymRw": {
    "date": "5/21/2009",
    "text": "Even if you prefer mainstream films, I would suggest you try and see them in indie cinemas like this rather than chain multiplexes with shoddy projection. The Curzon has nice café and bar facilities as well as decent-sized screens. Definitely worth booking ahead as the box office queue tends to move slowly.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xYrmOnBc3CMo_yYUJf3_Hg": {
    "date": "11/30/2008",
    "text": "The last film I saw here was Linha Del Passe, the story of four brothers living in Sao Paolo, Brazil. Normally, I would go to the Cineworld because I have an unlimited pass. However, the Curzon Soho is the only cinema in the West End that screens a lot of the important foreign films. For that reason alone, it is worth a visit. The screens are bigger than in most chain cinemas and at least you don't have to spend £15 on a ticket. Watch out, though. For the best new films, this place often gets sold out. Also, there is not enough space inside to queue so people often end up waiting outside. Not a good idea in January.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LzQ8P-5oIW5S2jW-7zbHeA": {
    "date": "2/12/2009",
    "text": "This theater has a great selection and an even better vibe. I recently watched Milk at Curzon and had a nice night. The bars are always full and people come just to enjoy the atmosphere and have a coffee. The variety of films being shown is very wide and they cover the categories I enjoy most-independent, art house, foreign, etc. The pricing is expensive, but going to the cinema is pricy everywhere. Located in SOHO, so it is a perfect place to go before a night or as the first portion of a date. The individual screening rooms are nice, not too big. Reminds me of older theaters that are more personal. I really like The Curzon Soho, and intend to go back as many times as I can afford! Student tickets are a bit cheaper.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jSja4JpPqkxDOlfzD1fKEw": {
    "date": "10/17/2008",
    "text": "Love this place. It's a Cinema for grown up's and independent film fans alike and much, much more than your usual stale popcorn, multiplex cinema experience. This has a special stand out from the crowd feel about it. It tends to show more European and Art house films than the mainstream stuff, but saying that I am off there tonight to see Burn After Reading so don't be put off if you think its all foreign language flicks. Final mention goes to their cafe as the food and snacks are excellent, but in particular the hot chocolate. Bar none this is the best hot chocolate you will drink in the whole of London town. Warning: don't try when you are full.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "74b-erzU83y8RfrdE3-PAw": {
    "date": "11/14/2008",
    "text": "This is a great cinema as they place a lot of international films. They also have a nice bar downstairs where you can sit on sofas and hve a chat with friends before the film. The cafe upstairs also serves some delicious cakes. They sell many films on DVD by the front desk; these are expensive but great for browsing.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xvDQuQiJxl_mIMgs_YXjlw": {
    "date": "1/29/2008",
    "text": "This is such a brilliant cinema for those who are sick of going to Odeons and Vues and being ripped off for a fairly mediocre experience. The Curzon is a lovely independant cinema that offers their audiences those critically acclaimed, quite arty and general great films that the big cinemas seem to cast aside. Tickets aren't exactly cheap but then neither are many cinemas these days. The Curzon actually makes you feel like it was worthwhile bothering to go to the cinema instead of just waiting to watch the dvd.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Bbf1EEwUfXnJRI8hWmy2WA": {
    "date": "11/23/2008",
    "text": "This Curzon is in a decent central London location. It's arthouse so not the identical fare showing at every Odeon in the city at the same time. The place to go to find limited release foreign films  very expensive though  cost me £12 on a recent Saturday. Attractive bar/café attached  probably worth a visit even if you are not seeing a film! Screens are an acceptable size but not large  main weakness for me are the seats  quite small and low backed so not sinkable into. A lot of independent screens have been lost in London in recent years so well worth your support.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6GUFIV1QMD7StsusFRicvA": {
    "date": "2/22/2011",
    "text": "This has been my favourite cinema in London since I first came here (to London.) Is there another cinema where you can meet your mates before the film and get drinks, lounge in the loungey annex, chat and get all revved up and filmic, then see the actual film. I love it. Really turns 'watching a film' into a social experience. I always come out bouncing.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gMokFI6CwaXgq9uVTF6yZQ": {
    "date": "1/16/2008",
    "text": "The Curzon Soho specialises in European and arthouse films. Recently I went to see the film about Ian Curtis and Joy Division 'Control' here and thought it was the ideal venue. The cinema was decorated with posters of the band leading down the staircase- it really felt like much more of an 'event' than just going to the pictures. The feeling I get from this cinema is that it seems to really celebrate film rather than just see it as a business. The venue has a cafe and bar and the fact that you can bring a drink into the cinema itself I think is just fantastic for relaxing after work. Consequently it has a much more grown up feel and I probably wouldn't recommend it to families/children.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DdDzdtfj--KVqh8sR7UCbg": {
    "date": "1/26/2010",
    "text": "i have been here twice, the first time because there was a david shrigley showing and secondly there was a midnight movie special of the freaks. the films shown here are of a different kind and if you appreciate cinema in a whole new sense then this place is probably the best place. from a whole line of curzon cinemas this is the best for international and independent movies. they have fab and fun events that occur each month and even have exhibitions and talks with animators,illustrators,designers and film makers. it is for them arty farty types like me ;);). there is one near me in richmond too if you dont want to travel far",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OdkAHeFoZexQ21MoUHXaCg": {
    "date": "11/21/2008",
    "text": "Curzon Cinema specialize in European and Art House films. Having access to these films is something not to be taken for granted it is something I have never had until I moved to London and it really opened my eyes to the other films that are out there besides Hollywood bolockbusters, which lets face it, have become predictable and uninspiring.  This fanctatic cinema holds Q&A's with leading actors, directors, and industry people. A menbership to this cinema is basically mandatory for anyone wishing to break into the film industry, not only for keeping up on what movies are out there but from a social networking point of view.  There is a wornderfully informative magazine which you can pick up for free which contains editorials, film releases, interviews, and events. Curzon Cinema  has five locations around central London with tickets ranging from £8-£12, but don't forget about Orange Wednesday's (2for1 ticket prices which Curzon accepts)",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hl92A0_X80y4XjL93_9uLg"
  },
  "smuRY4JojCSx1xtOlrlTuw": {
    "date": "4/15/2010",
    "text": "Cool place, nice film club look, great movies (we watched Exit thru the gift shop). Do look where you sit because chairs and sofas are stained ew ew ew, refurb needed. Toilets and facilities are pre-historic. Haven't been to big screen yet, smaller one's got comfy seats, but size of the actual screen is smaller than my TV, so that was a bit of let down too. Now I can really appreciate my local cinema for cleanliness, fresh popcorn and screen size ;) But do go and have a look, many cool people in, nice staff...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lm8mLKA4O0fY4aq5Ilfzqg": {
    "date": "12/4/2008",
    "text": "The best present I've ever bought for my boyfriend was a years membership to The Curzon for his birthday this year. He loves it because of their selection of art house films and special events. I love it because the films they choose are, for the large part, still accessible enough for me to tag along and not feel like a complete moron. I'd also recommend this place as a nice bar and somewhere great to meet up with friends. There drinks selection can be a bit pricey (though members get a discount) but it's worth it for the buzz of the place and the comfy sofa's. If you're into cakes (and I am) then you'll find the display by Konditor and Cook irresistible. I think my favourites are the tiny jam sponges with rude words iced across the top- fun to laugh at and fun to eat! Touches like this make you feel like The Curzon still has a sense of humour and while it deliberately avoids the mainstream it's not too cool for school.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "hE9H_cVeb1Lvl4M-FC9E2w": {
    "date": "6/30/2011",
    "text": "Alright, yes, it's expensive, but what do you expect from a Curzon? They have fantastic Q&A events here from time to time that are brilliant for Superfans. I went with my boyfriend to see Senna with a discussion after the screening with the film's director. Such a great draw for filmgoers. It really sets them apart from their competitors.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hgjtgzQPl8rKkhRJgvhu_g": {
    "date": "11/10/2008",
    "text": "The Curzon Cinema is a great place to meet your friends in Soho when you are not in the mood to get mind-numblingly pissed. As well as the fact that it is a cinema which shows a range of art house, independent and British films, it has 3 floors of coffee shops and bars.I came here on Friday night with some friends; we were looking for a night cap but fancied caffeine, rather than alcoholic stimuli. We headed for the ground floor coffee bar (the floors work downwards), and had to wait for a table for a bit as this place gets pretty full. The cakes in this bit are by Konditor and Cook, and are yummy. My friend had a raspberry meringue, which was every bit as sweet and gooey as you would expect. Also look out for the chocolate brownie if you come here. The lattes were very good quality, but the server could have perhaps been a bit less...sniffy. When my friend asked if one latte could have a shot of caramel in it, he replied 'darling, you are not in a Caffe Nero!'. Alrighty then; I will just keep my coffee simple then!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4MzgIVS21sK4qr1yfKw_g"
  },
  "OOILFvcj4Pb2j5BaYsLQ3g": {
    "date": "9/16/2011",
    "text": "Have been going here for years and it is a great cinema that always shows the films you want to see but don't know where to find. If you're not a fan of mainstream blockbusters then this is the place for you.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TIE-rwuSIiw5QDy4Rp5NEg": {
    "date": "11/18/2008",
    "text": "I recently attended the Halloween all nighter here run by the Midnight Movie people. I didn't read the instructions properly so missed out on the band, Creme Brulee, fronted by Jeremy Dyson (of league of gents fame). He had selected most of the movies (except one) and gave an introduction/read from a story he'd written that was a bit creepy but available online from the grauniad. Lots of people made the effort to dress up, there was face painting and a free cocktail. The League of Gents xmas special worked brilliantly on the big screen, then there was I walked with a Zombie, which is the most beautifully shot B movie ever. After that a Peter Wyngarde movie for all the Jason King fans, Peter looked practically hairless, no moustache, it was disorienting at that time in the morning (about 2am). Basically he found out his wife was a witch and got really cross because guess what he was a humanist teacher who taught there was no such thing as witches ha ha. NIght of the eagles I think it was called (american title Burn the Witch or something similar) Then the real treat of the Night (after very strong complimentary coffee and loo visit to the poster loo) The Believers by John Schlesinger starring Martin Sheen. Absolutely brilliant. I recommend it if it's on dvd. A little bit racist but I can see the influences in the league of gentlemen. All about child sacrifice and secret cults. Very pertinent to these times where dozens of children in africa are murdered every year, accused of being witches (I mean come on) Finally, the one not picked by JD, Scream Blacula Scream, a rather elegiac B Movie, no nudity unfortunately, and some truely awful vampire makeup. Then it was about 8am, we got our pastries and coffee and headed out into the chill of Shaftesbury avenue. The seats are great, has to be said, I don't think you could have done it in another venue, and I was just near enough to the front for the sound to keep blasting me awake.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FLphonGHFjDw4VgxWRv24g": {
    "date": "11/15/2008",
    "text": "Excellent art house cinema that also screens many commercial releases and retrospectives. A better experience than the chains as it's possible to have a drink in the bar beforehand and have a browse through the shop. It publishes its listings well in advance so it's possible to plan a weekend cinema trip with more than just a day or two of notice.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8DxqaJjBrFjNcM-lJyO1qw": {
    "date": "2/5/2011",
    "text": "Wonderfully private and intimate cinema. We saw The Fall here and loved the fact that it was a smaller auditorium as it the experience so much more personal. I have recently been to see Abel and was allowed to pick up pre-booked tickets at the till in the bar.. made life a lot easier. It's a real gem of a place..",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tOQ8XttBi27fSbwjWdAFEg": {
    "date": "4/15/2011",
    "text": "Yes, extremally expensive (ever looked at memerships?), but yes, extremally nice. We actually had a school trip there couple of years ago from my film school, since we were in some labs around for grading sessions, and walking round soho it really felt like a place to rest. Nowadays I have endless conversations about the films we have seen, and there is nothing better than crushing on 2nd floor sofa when you were running around with three hards drives in your bag all day, and just relaxing with a glass of red. It actually is inspiring to see all these people around in a cinema, watching something different than Funny Green Monster In 3D or The Escape From Burning Plane 2. ;)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gUSlJKQ6Y3dB_FVKA83SRw": {
    "date": "5/8/2009",
    "text": "Not only a great cinema but what a lovely bar - making this the perfect date venue! Big comfy couches, a lovely selection of wine and bar snack, what more could you ask for? I've been here several times and almost always arrive early for a drink to set the mood for the picture. The bar kinda makes this place a perfect date venue, meeting with friends or hotties it's just a great place to hang out.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "wvJxXG3O8-3_ijqeY5BmrA": {
    "date": "11/23/2008",
    "text": "I've seen a few films here and it's a lovely art-house cinema in the middle of the west end. The restaurant/coffee shop that greets you when you walk in is a little busy and expensive - it also seems that people go there who aren't also there to see a movie. For me, it's better skipped. The screens themself are small and the seats aren't the most comfortable, but whatever film is showing, patrons are very respectful and don't talk through the screening. This cinema hasn't provided me with my most luxurious filmgoing experiences, but it has provided me with some of my best.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yylvLVLFUbtSf-eJUcVYWQ": {
    "date": "12/17/2008",
    "text": "Great cinema with a lot of films you can't see anywhere else. Has a nice-ish bar for having a drink beforehand too. Worth keeping an eye on what they have on.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jlYFAG9UvNOEB28Efmhyag": {
    "date": "1/23/2008",
    "text": "One of my favorite cinemas, the Curzon has long been the bastion of independent films and film festivals alike. my first experience with this gem of a picture house was back in 1999 watching High Art in a packed auditorium. Unlike Odeon's and Vues this truly is a independent establishment that does not fuss itself with hot dogs and popcorn but rather focuses on non main stream films that have been forgotten by the bigger picture houses. Ticket prices range from 8 pound upwards depending on the feature but look out in the press for special offers and membership. One of the highlights for the Curzon is the London gay and Lesbian Film festival that hold many of there showing at the venue. Tickets can be booked on line, over the phone or at the box office, book ahead however as often films sale out quickly, especially for the G&L F F.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xmPjzsmQ1ebbFF_EJ4evcA": {
    "date": "2/7/2010",
    "text": "Great indie cinema in town, fantastic bar and cafe, friendly staff and plenty of stuff to keep a wandering mind occupied; lovely stuff!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GAtiCp63KUpvlJlQUDGwyA": {
    "date": "3/26/2009",
    "text": "My favourite cinema in London. Good selection of arthouse/independent films. Great lively bar to stop in before and after for a drink. Theatres are nice and initmate and you're allowed to take alcohol from the bar in. What more could you want really?",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qoy0r2Qp1RjXvRCdWMHtIA"
  },
  "VzYy2Wfj1edGzvtdN8LFAA": {
    "date": "6/9/2010",
    "text": "Great cinema in central london, showing the pick of independent films both recent and slightly older. There is always something interesting on, the screens are great as they are always quite small and intimate but friendly. The cafe upstairs is brilliant, as is the bar downstairs. Highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Xe-SH2GkS0lELtDyW2CW9g": {
    "date": "2/26/2010",
    "text": "Went here as have walked past and drooled many times and the yummy cakes did not disappoint! I tried the lemon chiffon, coffee and walnut and curly wurly (chocolate) cakes and all were divine. Don't worry I wasn't a total pig, I tried other people's (just a bite ok maybe two!). It's actually over 3 floors, try and snag one of the cosy sofas a floor down so you don't get a cold blast every time the door opens. Perfect laid back chilled place to hang out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "RP1r3646EheoMYabbcKyLA": {
    "date": "3/29/2010",
    "text": "By all means this is a beautiful and comfortable cinema, with amazing sound showing films that you won't catch in your bog standard Vue. A very a slick setting with an accordingly expensive bar. You definitely won't be getting your feet stuck to the floor with old popcorn or experiencing any strange smells. However...and maybe it's completely bad luck on my part...the couple of times I've been here the clientele have made me want to rip my seat out and lob it at the screen. It is obviously for those that like the finer things in life and have a disposable income and apparently feel the need to talk through the WHOLE film. Seriously every time I've been, there has been chortling, witty remarks, chatting among themselves while fondling their iPhones and one time spoiling the motherjeffing plot. Shut up...Jesus. But like I said maybe it's just bad luck on my part.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "goYx1ZjJxSfIyq1-FQQaPw": {
    "date": "7/26/2012",
    "text": "I'm not really one to do cinemas but this one is nice enough if you're central and fancy seeing a film. I'd rather sit out and watch the people walking by personally.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "o2QsBq0gkHGAccpXs-nSzw": {
    "date": "7/3/2010",
    "text": "A terrific little cinema which always has a truly wonderful selection of films and some great Q & A sessions. Only thing that keeps it from being five stars is that box office seems a little disorganised (we got our tickets alright but had to wait in a very long queue before being sent downstairs to pick them up from the concesssions stand!)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GzSqPaqnB9Zkgd8OZjhidw": {
    "date": "2/15/2011",
    "text": "Probably the most loveliest cinema in Central LDN, all things considered. There's a lovely café immediately by the entrance - all manner of drinks and snacks. A great place to hang out in its own right.Downstairs is a pretty bar which, when we were there, was decked out for a Black Swan showing - ballerina pictures, feathers, photos, quotes painted on the wall, fantastic artwork. These guys really go for it. It's great to see.The screen was old school - flat seating with a raised screen. We saw a re-run of Breakfast at Tiffany's, it was a fitting retro setting.I'm a huge fan of my local Picturehouses in Clapham and Brixton, but the next time I plan to go to the movies in town, this will be my place.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "lywpmIGAlWpjtyj-Wkn_zQ": {
    "date": "9/16/2009",
    "text": "A perfect London cinema. Yes sir.Great place to discover amazing movies, kill time, read a book, drink coca cola, daydream, attend Q&As, gossip, people watch and plan your future.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n8jvmTfUBUz_pt1Xy5R6ww",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n8jvmTfUBUz_pt1Xy5R6ww/o.jpg"
      }
    ],
    "user_id": "obKR9ZN1DQcJjiuje7zVfg"
  },
  "NwiaSKdiWea7SnlRq1hpqg": {
    "date": "12/31/2010",
    "text": "Mhh, what am I going to pick for my No. 300 review? Tough choice, but I think it's got to be the Curzon. Why? Because I am a total sucker for movies and even more so for movie theatres, and because the Curzon is my favourite cinema in London. They have a fabulous selection of films, the staff here seem to know what they are talking about, and the cinema has a very cosy and intimate feel to it, so I always feel a little special when I come here. What's more, they also have a wonderful little café and a bar, and you even get to bring your drinks into the movie theatre - how cool is that? Also, the location is at once very convenient, making it easy to meet here after work, and to get back home afterwards, and at the same time makes this almost a hidden jewel, as you wouldn't expect such a charming and high-quality cinema in the middle of the hustle-and-bustle and commercialism that is Soho.Granted, the prices are not cheap (so, sadly, I hardly ever come here), but when I do allow myself the luxury I always thoroughly enjoy it.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "UnLIvR1AyM9JD2RgQfY5Lg"
  },
  "iOES39KP6AGgONop8J-Eew": {
    "date": "12/26/2010",
    "text": "Their raspberry meringue is sexy... how I first notice this place. Later, I dream to be Toto (Cinema Paradiso), operating Laurel and Hardy (the 35mm projectors) like I used to do at MIT Lecture Series Committee. Bringing other people's stories and dreams closer to you.  Moments of boxing day blues... my eyes are delighted by the Curzon email :-) Not a cineaste yet... I was drawn to a few art-house movies and Q&As with the directors and actors (Christian Carion on L'Affaire...). The manager of the Q&A is attentive,  giving good cues and engaging us in a good sense of humour. It is a typical London cinema i.e. a social experience, yet with its own flavour.  Curzon Soho's full window embraces the sunlight, when you can sit on high chairs sipping your coffee and whisky for hours.  We shared a few paragraphs of reading (lines from Omega Minor and references on Wagner). Downstairs has more cozy sofa with wifi and 3 different screens for movies. A low key yet embracing experience in London to have for 2nd/3rd time visitors. Many thanks to NG's initial introduction.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wyQ5ypRqXfYltNOdV0O7Vw"
  },
  "2vutEfU4jwjvcZUVImSQ3A": {
    "date": "2/8/2011",
    "text": "I came here to grab a drink at the cafe. I can't really comment on the movie theaters but I can say that the cafe was a lot of fun and a great way to hang out while waiting for your movie to start. Their restroom were clean for such a busy place so that's always a plus for me.It's a bit pricey here, but it is Central London so it's what you'd expect.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_APo4b5Y2lDlP681zvROA"
  },
  "pQ60ceIRDYeJ2VV2bTafkg": {
    "date": "1/22/2011",
    "text": "Went here for the first time last night and this will now be a regular haunt of mine for after-work friend or boy dates.  I echo everything that's already been said - really handy location, two bars, the delicious Konditor and Cook bakery and a buzzy atmosphere, with hip young things with pretty clothes hanging around looking all, hip, in their very, you know,  hip way.  Their programme leans towards indie/world film and they host some cool looking Q&As, talks and festivals.All that stops it being 5 stars for me (and it's only 0.2 or something off) is that the cinema seats had sloped backs which forced us into slouching.  They look deep and luxurious, and it feels relaxing for the first 5 mins, but later I was longing for some lower back support.  Also, better (or ideally more) seating in the popular bakery area would be appreciated.  It was very crowded, and the high stools or little pouffes round coffee tables look cool but aren't great for relaxed tea and cake munching.  Both of these are minor quibbles though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-LDyNtk9BsfCq15lrijISA"
  },
  "0th31uL92AwGSBGYlynLYg": {
    "date": "3/21/2011",
    "text": "This place is fabulous! It has a Konditor and Cook and downstairs there is a really chilled out bar. When not watching a movie I have taken a shine to coming here as I find it the perfect place to meet someone in central London if you just want somewhere quietish to talk.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6lLFq2E4YK7Kfa_9UsYWuQ": {
    "date": "12/20/2008",
    "text": "The Curzon cinema in Soho is probably one of my favourite places to see a film in London. Its central location means that it can get quite busy, but also makes it all the more exciting.There is something really nice about stepping off the busy streets of central London, and escaping into the quite zone of a cinema. In true Soho style, Curzon is trendy, comfortable and has a general high quality. There is a nice bar upstairs and another downstairs. The selection of films is always really good, and there is usually quite a few European films showing. If you plan on going quite a bit, you can get a membership for 40 pounds a year, which gets you discounted prices for you and a friend, as well as the Curzon magazine delivered to your door.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ybG4xJyVpOBSxrCkcdZmw",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5ybG4xJyVpOBSxrCkcdZmw/o.jpg"
      }
    ],
    "user_id": "WXP9hhQKPItddmjB_5nTLQ"
  },
  "UsDjfguuo2H8VtXaSC2Ohw": {
    "date": "12/4/2008",
    "text": "Meeting friends here for a drink in the bar at the basement. Just goodenough for a relaxed chat, the chilled drink and the walls are usually adorned with artisitc exhibition from different artistis. These keep changing and likewise has a new effect on the place everytime.I've never tired to visiting this trendy place to either just catch up with friends or watch one of the ecclectic films. And just at the edge of Soho, the crowd here is very individualistic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XkUqwq2_Rf8T7dhcNupiRg",
        "caption": "Photo of Curzon Soho - London, United Kingdom. The Bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XkUqwq2_Rf8T7dhcNupiRg/o.jpg"
      }
    ],
    "user_id": "AmgGjiGtZKY9_UDbIwuEBg"
  },
  "WLtTI4DrYZzFP2JRx7KVrQ": {
    "date": "12/1/2008",
    "text": "The Curzon is a great cinema chain and this battles with the Renoir for the spot of my favourite branch. Soho has the edge as a venue in its own right, independent of the cinema because of the Konditor and Cook cafe which sells probably the best cakes in London - I've never had such a perfect coordination of cake and outfit than the day I had a slice of chequered pink and white sponge (raspberry and vanilla) whilst wearing a very similarly patterned dress. Pret-a-Portea at The Berkeley eat your heart out.OK back to the cinema...Staff are pretty cool, the downstairs bar is nice, films are good, they sell a good selection of DVDs. Ah whatever, the cake-dress thing wins it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CwNlsfXn854ceyzLsr0oaA",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CwNlsfXn854ceyzLsr0oaA/o.jpg"
      }
    ],
    "user_id": "WhUdxlmwXdJhv8YMRfAuxQ"
  },
  "x40Pjbufm6IutYZdHlOdhQ": {
    "date": "11/18/2008",
    "text": "The Curzon Soho is a good place to hang out in Central London. As well as the arts cinema, which belongs to the Curzon chain, there are two cafes. On the ground floor there is a cafe that belongs to the Konditor and Cook chain, as consequently sells coffees, teas, and lovely cakes. It is often busy, but a great place to pop in for a quick break, or to get out of the rain. On the floor below is another cafe and bar which is open for as long as the cinema. It is a good place to while away a day reading a book, hanging out with friends, or, if you are seeing a film, get a drink pre or post. The cinema itself has three screens and shows general release arts films, as well as one of screenings, talks and recently a midnight movies series.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4ZpQVF8vCvBSnORkOZbbjg",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4ZpQVF8vCvBSnORkOZbbjg/o.jpg"
      },
      {
        "img_id": "UObs5RDkZZ6GYRmr6_drEw",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UObs5RDkZZ6GYRmr6_drEw/o.jpg"
      }
    ],
    "user_id": "lHjrUujYLS-cOu--fnXCJQ"
  },
  "8kI51IgFXzRTuF4Na_walg": {
    "date": "12/13/2011",
    "text": "any theatre that lets you bring in mulled wine is a-ok in my book.  this place is fancy schmancy, and i like it.  we even got a free mince pie w/ the mulled wine!!  the curzon theatres show indie films, and we saw wuthering heights last night.  the movie was so-so, but the ambience made up for it.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rx7DNBmPPShVjlcQidGuTw"
  },
  "OauSXXb37skikl5icZUatA": {
    "date": "1/26/2010",
    "text": "What a great place!!! Fab movies and lovely atmosphere. If you are a member, you get 2 free tickets and discounted fee for any movie after that. you also get a magazine on the post, with film reviews and info.As Lizzie well mentioned, the bar is fabulous... complimentary WIFI, comfortable couches and great place to meet up with friends.A gem in Soho!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiIuv83XjHRXMSb0ZYmsAA"
  },
  "p3Lz6QMIApy9P5acbxgrPA": {
    "date": "8/14/2012",
    "text": "A lovely old style cinema that shows the films you cant find in horrible VUE cinemas and the like. nice comfy seats too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4E2pM2mbMiIFHukuP2_tA"
  },
  "3UN_IDPAHiLoYKvzgRYlQg": {
    "date": "8/11/2009",
    "text": "I'm not totally sure how to review this place.  They obviously don't set out to compete with the likes of Odeon and Vue.  Seems to me they're targeting an older crowd with it's lounge like full bar, the ability to take your drinks into the theatre with you and selection of slightly less mainstream films.  So whilst all those things are great, they bring with them increased expectations, as does the £12 ticket price.In that regard, I wasn't blown away by the place.  It's not very clear where you go to pick up pre-ordered tickets and the fact you don't have to join the huge queue of people waiting to buy a ticket (you can go to any till apparently).  I don't like the fact you can only take plastic glasses into the screen and the seats, whilst comfortable, lack drinks holders - even more of a problem when everyone's taking a tipple in.I'd go back, but wouldn't go out of my way to do so (as I did this time).",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3Yahu7lXBNt9RNjDdBX7Dg"
  },
  "IWo2NuTNHqoHW5cm5ebxog": {
    "date": "2/17/2009",
    "text": "After attending a bevy of Curzon's Midnight Movies series, I think that this place has come to be my fave Kino in London. It just seems to tick all the boxes. Just to prove this, without the boxes - here is a list of things that I would tick were there boxes available.- Great roster of new films - always current, always adventurous.- A sense of history. This place puts on some top notch retrospectives and often gets the director (when alive) to talk beforehand.- Crazy ideas. As mentioned before, Midnight Movies is a perfect example. Last time I was dressed in gruesome attire for their halloween bonanza. it was great. I woke up the next morning with a green pillow thanks to my makeup.- Nice bar. The bar is nice - it serves Vedett beer. It has comfy sofas. It is big. Which is very nice.- Lovely cafe above. Konditor and Cook is ace - it does ace cakes and sandwiches.- Good DJs and music before and after the show. You get a bit more for your money - not just stale popcorn.- Perfect location. On the edge of Soho means it's easy to get to, great to go out from afterwards, and good for an impromptu cinema trip in the afternoon.Other than that, it's lovely to be able to go somewhere where the staff know what they're talking about, and people have a real passion for films. The Curzon is also a key player in London's cinema culture. When there's something special on in London, Curzon is invariably involved, and most indie, leftfield and small budget releases get their feet wet at the Curzon.Mostly though, it's the atmosphere of the place - it makes you want to go watch films all the time. Which is good.I might even become a member i like it that much, which means that I get nice freebies.SO, it shall be deemed worthy of the five star accolade that I just gave it. Hurrah.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 6,
      "cool": 9
    },
    "photos": [],
    "user_id": "qIe8KorGaQb2iu4qAVz3Sw"
  },
  "lp3rEZJ_Y6yQxbnmKf4XgA": {
    "date": "12/10/2009",
    "text": "This is my favourite cinema in London, hands down.  It's not perfect, but it's the best I've found in the Big Smoke.  There's a cute cafe on the ground floor with street-side views of Soho, and better yet, a bar one level down.  Have a pre-screening glass of wine and then come show time, bring it right into the cinema (in a plastic cup they provide).  Specific seats are reserved for you, of course, so it's all dignified and unhurried.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7UGAhFL26kyuhJ9I21AVTA"
  },
  "43Uu_hT2L22bd4b7tSCDhA": {
    "date": "6/17/2010",
    "text": "A little gem of a cinema in the heart of London. Comfy seats, plenty of room, good sound and a decent screen. Bar is fine with a reasonable beer and wine selection - west end prices. Put me in mind of a grown up student union!! Great place to see the movie of last years Bruce gig in Hyde Park - long time since I have seen the audience dancing in the aisles!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "59HQQMAfJk13aDp60RDMyA": {
    "date": "10/20/2012",
    "text": "I have to say that while I think that the movie programming is very good, I find the website soooo annoying and difficult to use that I try to avoid buying tickets there because it's such a basic aspect of a product offering today.  I have sent 2 emails about this but they never responded which mirrors the attitude of the staff which is always a bit blaze.The cafes and bars in the cinemas, while a welcome addition is not that novel in London, but they are WAY over-priced.Curzon have a bit of a monopoly and they know it and act like it....hopefully other cinemas like Everyman will force them to change their attitude a bit.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yto2Ao2ZjjFjaPG58iSE0Q"
  },
  "kgA747EALo1f8Zw3vggqsw": {
    "date": "10/14/2010",
    "text": "Love this cinema! The Midnight Movies are the best in a city where every multiplex shows its last film at 8.30pm... Tickets are expensive, but its Central London so what do you expect?I've watched some cult films here. The bar is very busy, but not my scene...Snacks are a bit pricey though, especially when you have Chinatown across the road providing authentic, well priced crackers etc...And dont buy any of the overpriced DVDs...you can find the same ones at Fopp 5 minutes away for a fraction of the price.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppy_4JyxB5oYmAa5_AhSaQ"
  },
  "asCoehByCk20-qKzuFj15Q": {
    "date": "9/4/2016",
    "text": "Curzon Soho is simply one of the best cinemas in London, great programme of arthouse and foreign movies in central location.  Absolutely shocking that it is under threat of being closed to make room for the next Crossrail project - the first has left a trail of destruction and hasn't even completed yet.My last visit was for the Argentine Film Festival and a Q&A with the director, and I have had loads of meetups in the cafe and bar areas.  Curzon Soho is always buzzing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qr1fC85hbuhL-HN0owaY1Q",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qr1fC85hbuhL-HN0owaY1Q/o.jpg"
      },
      {
        "img_id": "Kjph0nnBJqYQTF0JocTVmg",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Kjph0nnBJqYQTF0JocTVmg/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "uVqoPIGSFrhLPqktOqirlw": {
    "date": "9/2/2017",
    "text": "This is a review of the bar as I came here to meet up and chat. There are two bars, one upstairs and one downstairs. This allows for ample room to hangout before or after a show.There is a selection of both alcohol and non-alcohol drinks. I had an iced latte and asked for some sugar syrup to be added, which made it tasty. Someone else had a hot coffee that they said was just average. Someone else had beer and another, so I assume that was good. There is a food menu which no one tried. Overall the ambiance was good. Artsy films were showing and indie posters graced the walls. I look forward to watching a movie here to provide a complete review.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gs1HAp_sImvHS_yCfySaKQ"
  },
  "J8akRwrv6mJcB85faOErFw": {
    "date": "1/1/2018",
    "text": "Nice cinema with cafe at the entrance and a bar downstairs. Lots of drinks. Comfortable seats in the theater itself with lots of plush sofas and seating around the bar. Just as expensive as anywhere else you'd go in London. A large popcorn, coke, and ticket to watch Call Me By Your First Name was about £19. Also, the people who go there seem quite respectful when you watch films (they don't talk loudly, go on phones, etc) which is a bonus as my local cinema can be annoying to watch movies at for that reason. Would recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5LxgHFoknHZ6eJv6lxJwlw"
  },
  "sZnFVi8i_OUVEwGtX-P1xA": {
    "date": "6/4/2016",
    "text": "This branch of the Curzon chain of cinemas in Soho has had a revamp in the box office and basement areas. Gone is the dingy tired looking space, and replaced with more welcoming seating areas and roomy feel, updated but still in keeping with its origins.  It would be a real shame for it to be knocked down now for Crossrail. Surely, Crossrail could be built round it. Already the Astoria round the corner has been knocked down for Crossrail.  They should try to preserve lovely old buildings with character and history.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nGiXgGhwKw2-X89ssRwNUA",
        "caption": "Photo of Curzon Soho - London, United Kingdom. The cafe area on the ground floor as you walk in",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nGiXgGhwKw2-X89ssRwNUA/o.jpg"
      },
      {
        "img_id": "hSRRP3Q2ZGa4rQdaGOWgkg",
        "caption": "Photo of Curzon Soho - London, United Kingdom. Newly refurbished area where once was the box office",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hSRRP3Q2ZGa4rQdaGOWgkg/o.jpg"
      },
      {
        "img_id": "LZ2fxYpmXY1RP6rL8Hqdzw",
        "caption": "Photo of Curzon Soho - London, United Kingdom. Newly refurbished area in the basement area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LZ2fxYpmXY1RP6rL8Hqdzw/o.jpg"
      }
    ],
    "user_id": "NcGrzF4ygFZEOhWIkLdOVQ"
  },
  "npNtj82hOmXMp2eHjjw0lg": {
    "date": "12/30/2015",
    "text": "This is an incredible cinema house that offers an abundance of indie, art house and mainstream films. It's a historic landmark once named the best cinema in London by Time Out and built in 1912 to replace the bombed out Shaftesbury Pavilion. I love the spacious seats and warm, cozy setting on a cool winter day or it's refreshing air conditioned space on a warm summer day. It has an array of independent film videos for sale next to the awesome cafe. The cafe offers a full range of coffee, tea, beer, wine and spirits. It's what embodies what every cinema should be like in my opinion.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KoZ0kexV8UygJiHXKOEXmg",
        "caption": "Photo of Curzon Soho - London, United Kingdom. Excellent cafe, open to public! Reasonable prices and great window seats that provide for amazing people watching!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KoZ0kexV8UygJiHXKOEXmg/o.jpg"
      }
    ],
    "user_id": "dqXnIDr6XMr2aMbA02sSRw"
  },
  "ad-9w3ylVzjSF30zAgYnyg": {
    "date": "5/20/2016",
    "text": "I like curzon soho, it is nearby Chinatown and Leicester Square. It is a vibrant cinema with a lot of people's hanging out there. It is a good meeting point for a drink as they have a good bar downstair and coffee and cakes upstair. Nice seating area both downstair and upper floor. Sometime you could find a preview film party at the basement. A total of three n screen at this cinema. I like the largest one with decent seats and sound system. Best things is you have a choice to sit anywhere you like. Latest film I watched there is \"son of saul\", foreigners best awards film. The amazing sound system make your heart beat hard. Although there is a fault fire alarm happened that night, but they managed to continue the film afterwards.  This cinema is like my second home cause I'm a movie person especially i enjoyed watxhing foreign movies and arty movies. And curzon  soho fulfilled my needs.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9mS7Wz2-qdgmHFumqTBs4w"
  },
  "MkPyaQzbOSjOvTvc4edv9Q": {
    "date": "4/12/2015",
    "text": "I love this cinema, seriously one of my favourite places; a true London treasure.Always showing the most interesting and well crafted movies from around the world in cute screens with plush velvet seats. Don't miss out on the MASSIVE cakes from the top floor cafe, or the wide range of tasty wines and beers from the lower floor bar. Both of these areas also have their own comfy seating areas so you can relax before or after your film. You can also be pretty sure that you won't have loudmouth kids ruining your movie experience, as this cinema tends to attract the more respectful, grown up customer there to enjoy the amazing films on offer. Step away from Leicester Square and take a chance on the Curzon, you won't be disappointed. Then maybe like me become a member and enjoy 15% off, oh yeah! Pleas also sign this petition to stop the Crossrail destroying another Soho cultural hotspot:you.38degrees.org.uk/pet…",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e0pmhaf0Kwi_Ucxg5Gv9Rw",
        "caption": "Photo of Curzon Soho - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e0pmhaf0Kwi_Ucxg5Gv9Rw/o.jpg"
      }
    ],
    "user_id": "W41-ZkAIjOTx_ftYMdUAUw"
  },
  "1Ez2pG_EEWO-u60z18bGow": {
    "date": "11/18/2015",
    "text": "Now I've converted to being a Curzon member this has become one of my regular haunts.  It has a cafe on the ground floor, a bar with sofa seating below and the screens and the loos right at the very bottom.There are 3 screens here, one big screen and two smaller ones.  The seating isn't as good as the other Curzons I've been to, it's more traditional style with no sofa seats.  The legroom isn't too bad and there is no seat allocation either.You can bring in your drinks from the bar but it will be in a plastic cup, no styled plastic glassware here.  But it's great location, near Leicester Sq and Piccadilly circus.  Lets just hope that Crossrail 2 doesn't get the go ahead to plough it down.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw81aVQdsfiVXOq2Kgl8EQ"
  },
  "J16xtNeUNyuEUVdAdR_4Sg": {
    "date": "9/5/2015",
    "text": "I firstly want to say I hope this place doesn't close due to the Crossrail. It feels like an institution to me. Not only are the screens intimate and the special Q&A's with directors and actors are  so frequently great. Not only that but the bar area serves good coffee and drinks with a great view of passing London life out the window. It's a true gem of Soho.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "AvY1RFekA4ZM8gEUPvsefQ": {
    "date": "8/1/2015",
    "text": "Curzon Soho is one of my favourite cinema spots in London.I'm not a bar/snacks type person when I go to the cinema.  I don't mess about.  I'm there for the film and the film only.  And you should be too.  If you want a review of the bar then look for another review.For cinephiles, this is a great cinema, especially Screen 1.  The sound is perfect, the screen is perfect, and if you sit near the front of the middle section, you get lots of leg room and a completely unobstructed, slightly elevated view.I'll give you two case studies of recent films I've seen here:1) Birdman - the multi-directional sound really came into its own in Screen 1.  You got the experience the director intended.  I wouldn't have wanted to have seen it anywhere else.2) Eden - again, this is a sound-heavy film, based on the 90s house/garage music scene in Paris.  The Curzon soundsystem made MINCEMEAT of this film.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXaB48ggyqYMswBvS9__Nw"
  },
  "2aTzg_L5CLFp0GX3ENGoyw": {
    "date": "4/12/2014",
    "text": "We often seem to end up in the Soho Curzon whenever we are in London. It's a great place to chill out for a couple of hours and catch an original art house film. Tickets are a very reasonable £8 each if you go off peak (ie the afternoon), making it cheaper than the Duke of York in Brighton. The film selection is also great, a little different from your run-of-the-mill chain cinemas, with movies often being successful at numerous foreign film festivals. There are three screens here, all of them quite small, but the seats are comfortable and the view is always good. You can buy alcoholic or non-alcoholic beverages from the bar and take them in to the movie with you.Upstairs there is a lovely cafe with comfortable sofa's to relax on before the movie starts, and free wifi is available. On the top floor by the entrance, there is also a Konditor and Cook, where we usually grab a hot drink and cake on arrivalThe staff are also friendly and helpful, and this is generally a nice place to hang out in London.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "vFwLk1sX-fbKEgliBJhR4Q"
  },
  "9C6kqUrVYQ56To4FupVpfQ": {
    "date": "9/22/2014",
    "text": "Give me an indie movie house anyday!  So, you know it. it's out.  My review for Curzon is going to have a strong heavy bias.  This place is cool, hip and arty.Two great bars.  The ground floor bar is busier, but fear not, there's plenty more seating in the downstairs bar.  Ground floor bar feels a bit like a classy diner.  The downstairs bar is more moody, mysterious and studenty-feeling with it's balck walls.Just as a place to chill out and unwind it makes a great venue, whether that be on your own or with friends.  The bar prices are very reasonable.You get a diverse array of movies and events to choose from, and all of much greater interest the commercial, mainstream movies you on offer at the big chain cinemas.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSwwRATdcNBDDz8dF4oJpg"
  },
  "L7QZJhwbYEOmw5bMWLnwKw": {
    "date": "9/22/2015",
    "text": "There was a rumor they are shutting down this lovely independent cinema, one I sincerely hope isn't true. While they don't specify in just foreign or art house films, if there is something a little far fetched you fancy seeing, the Curzon is probably your best bet.   They curate a great selection of films from around the world, along with a couple Hollywood films - though lean more towards the quirky or Indie side for those picks - and at a much better price than the ones just a couple streets over in Leicester Sq.   The Curzon plays host to a Konditor and Cooke cafe too, so you can load up on their yummy curlywurly cake or fudgepacker brownies before setting in for a good film.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUjCjl-h44JjtMZfdO7LWg"
  },
  "05ioAicgkv4OqVnPX5yh9A": {
    "date": "2/4/2014",
    "text": "Sorry, first off I have not seen any movies here.However, I have been here a few times for coffee with friends upstairs. Big spacious sofas/couches, very pretty pattern on my mocha coffee, good place to hang out with a big group of friends and no pressure for you to see a movie or anything.Every time I walk past, I see that the movies they show are more alternative/indie ones rather than the big blockbuster movies.One more thing to comment on, the cafe on the ground floor, Konditor & Cook, is always packed. My boss bought a cake from here once, it was big, and it was lovely. Not touted as \"high class\" bakeries like Valeries or Pauls but a good local bakery nonetheless!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qhJEA-T_q-0qp-0v0_81Ew"
  },
  "4h2hpJm0pS9sxf0ngRwe8w": {
    "date": "8/7/2013",
    "text": "Grow a beard.A great cinema that has to be on a top ten list of posy - arty - beardy destinations. Alternative films shown in an upmarket location for those of us who yearn to live in NYC circa 1970s, in a loft, with Woody Allen next door. Be cool, grow your beard (oh you already have) and get down to Curzon Soho and enjoy a great film. Get your beverage and snacking sorted before you enter as like any other cinema the popcorn and fizzy drinks on offer before you enter the screens are embarrassingly overpriced and without any imagination.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cp27cgp_OYglU0J5D_lTmw"
  },
  "I6Udqn2mcmdHG6b_atlUxg": {
    "date": "6/15/2013",
    "text": "A pretty cool indie theatre. The lounge and bar area is full of comfy chairs, and the cafe above has coffee and desserts to tempt you either before or after the show!The screens themselves are fairly big, especially for an indie, and the chairs are velvety and surprisingly comfortable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ctrp5IoEKHkixDSIyYHDpw"
  },
  "U9krzG-fXftWItIsoA1qGA": {
    "date": "9/30/2012",
    "text": "Great location and great two lower ground floors of food & drink! I mean - their sofas on the lower ground floor are just asking to be sat down upon whilst enjoying your cake from upstairs!I should've checked out the food and bakery - I know! Shame I was full already by the time I got there.Downside - legroom. For £13 a ticket I would expect larger legroom. Same price other boutique-like cinemas give you Space.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hVGwtNetpgdMSgOgv8PWQ"
  },
  "VD2PU1bMjSkSUjLl8LpsBA": {
    "date": "11/29/2011",
    "text": "This cinema, part of the Curzon group, offers great film programming.  At any given time they'll be showing arguably the best of the films on release.  But the best part about this place is the additional amenities offered.  There is great food available upstairs.  Given the location, and the quality of the food, I was ready for high prices, but in fact the prices are very reasonable.  There is free wireless available at the bar downstairs, and it's actually a good place to just hang out, which seems strange given that most people are coming into or leaving from one of the theatres.  But quite a few people do hang out there, evidenced by the full sized empty bottles of wine left at a vacated table, or the number of laptops open and connected. It goes without saying that you can take your food and drink into the theatre to enjoy while watching a movie.  And if you are still hungry afterwards, you can cross the street and you're in Chinatown!The movies are expensive, but you can buy a yearly membership valid throughout the Curzon group of theatres, which includes the Renoir.  This membership includes a discount for you and a guest each time you attend, so you can earn your money back if you attend enough movies, which given the pleasurable experience, it's not difficult to do!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 5
    },
    "photos": [],
    "user_id": "5XsVXyHr95m8A07IVrqG7Q"
  },
  "rrO8jdCUOEJE3CbXRNxYGQ": {
    "date": "10/28/2011",
    "text": "This is my favorite of all the Curzon Cinema locations. I really enjoy the cafe, the selection of movies, and the bar! Who could ask for more... eating cake, while watching a top-rated Rotton Tomatoes movie, and following it with a pint?The perfect date place. P.S. Cinema lovers, save your money by getting a membership!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "gA4MiXjhX9iZmqkIgMxWjw"
  },
  "fDQdEiKJbbVzBSkXTfWhIQ": {
    "date": "9/14/2013",
    "text": "Cool central cinema that shows interesting, good films. But £13 a ticket and no student discount? That's not cool.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  }
}