{
  "RzDw5vdrQ3Q6X-s1bNzeHQ": {
    "date": "11/23/2014",
    "text": "I tend to use this as a bar rather than a restaurant (although the sushi and ceviche are great). The ground floor is always buzzy and in summer the windows along the front all slide open for great people-watching. Cocktails are well-made and decently priced, my fave being their (Tanqueray gin) negroni which is served with a large hand-carved ball of ice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1yNJCe57BrbB5e5fNDwmgw"
  },
  "naX0qz5R0N1-hZ05bwHVuw": {
    "date": "7/25/2014",
    "text": "Had sushi at the sushi bar. The quality of the sushi was very high! Nice atmosphere with an upbeat mood on a thursday. Great location",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jrVFb8ckqa0gTZxmUbvFkQ"
  },
  "jHCtQnffkivXSE0A8fwQ7g": {
    "date": "4/25/2015",
    "text": "Chotto Matte was a great surprise - an interesting combination of Peruvians and Japaneses cuisine. It has a really nice atmosphere, and the food is great. I highly recommend the warm beef fillet tataki (appetiser) - it's tasty and has a really unique flavor. Enjoy :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pK9nu-JMQwzqFxSkK-HFag"
  },
  "2R75L_JKxqTfd_0ZdASNrQ": {
    "date": "10/12/2013",
    "text": "Our table was not ready for us when we arrived so we were asked to just wait there. There was a bar right there but we were not asked if we would like a drink while we wait. Strange. By the time we were finally shown to our table upstairs they were still having a staff meeting! Hmmm.....Anyway, now to the food:They have some nibbles they refer to as \"something while you wait\", we chose two options from here: the Taco Selection and the Cassava&Sweet potato chips. We did not like either.The seafood gyoza was too doughy and undercooked.The Following dishes were nothing special:The Pescaditos ( a selection of fried seafood), the arroz con verduras (fried brown rice with veg).The salmon and mackerel nigiri's were average but were ruined by the truly awful soy sauce. Unfortunately this also ruined the delightful FRESH wasabi. Shame.The dishes that were really delicious: the paperthin veg salad (wow!), the black cod, the tentaculos de pulpo (octopus so tender we were rendered speechless!), the lomo saltado (their own version of the Peruvian national dish in a roll).  As for dessert, the chocolate fondant was better than the passion fruit brulee, we thought.Some dishes better than others. We shall be trying the other peruvian options in london soon.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPrEHeYY-Q1rMQ6LxmlzEQ"
  },
  "4D6rrg9QkIFHxAyaaWdiIw": {
    "date": "5/23/2014",
    "text": "The decor is lovely, the vibe is cool but it's busy and loud and when we went on a Tuesday night it was packed. We had the taster menu and I wish I had just ordered what I thought looked good because we only liked about half of what came to the table. Had The Classic sake and it wasn't that impressive either. Probably won't go back anytime soon.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YlOVkavM90kVu9c0pABBDA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YlOVkavM90kVu9c0pABBDA/o.jpg"
      },
      {
        "img_id": "LUZi6_T7FaxwxfD2IJAV8g",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LUZi6_T7FaxwxfD2IJAV8g/o.jpg"
      }
    ],
    "user_id": "8xZwevOkVdOnOSuR18rCmQ"
  },
  "HhtmI5GHzAFcv7HKw7e8Sg": {
    "date": "11/2/2014",
    "text": "Another one of those Japanese / Peruvian fusion restaurants in London. Restaurant has a great vibe and the food on the whole was yum. For the sautéed eggplant which had chopped up egg plant, I prefer how it's done at other restaurants where they grill half a large eggplant with the miso on top which gives it a nice caramelised flavour. Service was a little lacking. Waiter came to ask for our drink order even though we had just ordered and the wrong sushi was delivered to our table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRjr7N6zGB10XP7kd8q8-g"
  },
  "HRh3ZxfyoK4kFPsUnobTGg": {
    "date": "3/23/2016",
    "text": "After searching high and low for a place to eat last night I was in London, I came across Chotto Matte. Being a massive sushi fan, I felt this would be the place for me and booked ahead. Once I had arrived, I was really impressed with how it all looked. Very modern and, to sound like an old woman, very \"hip\". We were quickly taken to our table and told about how it all works. We were told normally people order 5 dishes but that seemed a little too much for us. We had only really planned to have a bite to each and some cocktails. After sitting for a little bit longer than I usual, our waiter came round to take our food order. He started to walk off just as we gave our drinks order and told us he would come back. After that, we watched as he went round to every table bar us. It almost felt like because we didn't want to order 5 dishes, he didn't seem interested. The food itself was perfect and came out very quickly. Sadly several times we had to ask the other waiters about our drinks order and nothing ever seemed to come from it. Finally when we were on our last dish, we managed to get ahold of our waiter, who didn't apologise for forgetting our drinks or generally seemed bothered by us which was frustrating. Overall, the food was pretty amazing and the vibe inside is great but I was so disappointed with the service we received that night.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JUc49GPNufVHhPl2BIoAAw"
  },
  "zBbcv2Zp1uGGqBkg399Gfw": {
    "date": "1/23/2014",
    "text": "Ordered: Pescaditos (£7.50), Lamb chops (£7.25), a few rolls Price: total £80 for twoReview:I was a bit skeptical coming here. Came here with a friend. We were both not too pleased, nor let down. It is not a great place nor, a poor place to eat. It is kind of 'meh'....The food is rather small in portion....and ok in taste...ok i get it - it is supposed to be 'hip' but still...not mind blown. Having come here within the first few weeks of it opening - maybe I was bit harsh?? I don't know. I am always in that area, but I won't be returning in the near future.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxDOuSJm1uZIMAnEL__juQ"
  },
  "E4mVvRMazE9FVDilvPq-9w": {
    "date": "6/1/2014",
    "text": "Nice, trendy interior decoration, though the lights can be blinding if you get too close. The service is great, very friendly staff but a little on the slow side. They need to allow people to order at the bar because the table service just doesn't work, the waiters are run-off their feet and almost crashing into people. The food looked great but was only ok, if you take into consideration price then the food is very disappointing. Sushi wasn't great. Tuna tatar tasted mainly of corn. Spicy chicken with taro just didn't work. Aubergine was nice. Chips were awful. Cerviche good but had only 3 pieces of fish in it. Quinoa was boring. The grapefruit juice in the bellini only ruined the overall taste of it. The only thing that was good here were the patron peppers and the peruvian beer. The food at Roka is is much better than anything I ate in this restaurant. Come here for the trendy youthful ambiance. Don't come here if you are looking for great food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2ashjKp9OxI1ag3p7wzDg"
  },
  "cjHc1ZnlMNETs7KxlzNMag": {
    "date": "3/15/2014",
    "text": "Low star review here to alert you to the hap hazard service received. We decided to try the restaurant after we had we tried the bar on a previous occasion. The bar service downstairs was great , we didn't need to leave our standing table during the night and we were looked after. Unfortunately the same could not be said for upstairs. We were offered a table around the chefs cooking area which I normally prefer anyway to add to the dining experience. I would not recommend doing this at Choco though. My eyes were sore and hair stank of smoke by the time we left. The extractor fans for the BBQ meat and fish is clearly not efficient enough to cope with eradicating the smells and smoke. It also didn't help being able to see that the mayonnaise used to dress the dishes was past it's use by date by 5 days. The dishes were good. The cold dishes great but surprisingly the hot dishes, despite being prepared right before my smokey eyes, were being delivered mildly warm. So the lomo steak and monk fish would have been much better had they been delivered hot. Such a shame as they had great flavour. We had the yellowtail sashimi and mixed sashimi that were good. The polpo (octopus) did arrive hot and was also tasty. Another review states that after ordering the food, that was the last of the service. I absolutely agree. The same happened to us.  We were only able to order one drink and when we tried to order espressos from 4 different waiters we ended up waiting nearly half an hour for it to arrive. When we finally left our table, having asked for the bill 20 minutes earlier also from various different waiters we waited at the hostess point to pay as we were not getting  anywhere waiting  at our table to pay. Parts of the bill was wrong (check they don't charge you for iced water) and by this stage we felt we had no option but to rev up the complaints. We very much were the disgruntled customer. The hostess was horrified to find out about our experience and after speaking to the manager she  removed certain items off the bill such as cold food and service charge of £15.So advice - be aware it might be slow service on the busier nights of London -Friday and don't sit by the chefs table. It is a good venue and it should be tried. I hope that we just had a one off bad experience. Otherwise just stick to the bar downstairs . It plays great music and drinks are excellent.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8TtW_hQPbkbsgcp2KdeJrA"
  },
  "YBeykfEbybK3bbgTZYe6iw": {
    "date": "6/19/2014",
    "text": "Great attentive service which can be rare in London, coupled with a delicious mix of Peruvian Japanese food.From black cod miso, salmon ceviche, and tiger prawn tempura everything was delicious and perfect for sharing. Between the four of us we also had 2 bottles of wine and were shocked when the bill came out at an incredibly reasonable number.Definitely going back if for no other reason than to try the much talked about octopus.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3_Sdi7jzKxIowaRhjVdHA"
  },
  "aAD3lh3CcSE8rXopMM6LgA": {
    "date": "3/30/2015",
    "text": "Great place to go with friends. The downstairs is very cool and the atmosphere is fun and lively. Food is quality! Although a bit on the pricey side it's worth it as it's a great evening. Staff are lovely and friendly too",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KJ1HAE_XZo7XxlIxRIvw-Q"
  },
  "YFGFcX0wq4KNVX0cx2qYNg": {
    "date": "2/1/2016",
    "text": "Good was good but the service and staff were  lousy.  When my friend asked why so slow on a Monday night with very few customers, the waitress insulted her!  A nice night catching up with a beautiful friend ended with such rude indifference by their staff.  She used to go there frequently and will never go back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GY5ekZnUTDn9GbGkMH5wiA"
  },
  "9AL6UMX0QmjKw2a76BTgKA": {
    "date": "3/22/2015",
    "text": "Great atmosphere, the place looks great and food is really tasty and well presented. Cocktails are lovely too. A really nice night out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhoL7iBDOTPiJ-wOvWp-Xw"
  },
  "PlM0DClH_t_5tsrDiNVgYQ": {
    "date": "3/8/2015",
    "text": "Food is not good. If you want good Japanese go to Koya right across the street. These types of Asian restaurants are so out and too gimmicky for me prefer authentic and restaurants really passionate about the foods they serve. Unfortunately Chotte doesn't fit into this category of restaurants.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duuUsHSY4k_k75sP8D7cGA"
  },
  "R1saAOUBEvTDKzE22r04kA": {
    "date": "3/18/2014",
    "text": "Having not been a part of the Yelp crowd that attended this location for a birthday party, I decided to come here with my swimming buddy after one of our few swim + dine nights. We tend to pick places we haven't been to and this was one of the places that's been open a while that I've not managed to come to, since my partner would usually balk at the notion of beef hearts and octopus. It's a Tuesday night, and it's apparent the place isn't fully seated yet (we waltz in around 7:30). Thankfully, we're seated at the bar seats upstairs. When you first walk in, you feel like this place should be in NYC, not London. It's somewhat pretentious in decor, although, I couldn't quite place a finger (even now that it's been a few hours after the meal) about what I didn't necessarily like about the decor. I guess it's just that pseudo semi dark atmosphere that isn't done as appropriately and doesn't do the Peruvian portion of the menu justice.Anyway, the food here is actually really good, especially if you're not looking for authentic Japanese or authentic Peruvian. We ordered the Beef Hearts (Corazon), the Octopus (Tentaculous), Courgette with beetroot crisps, and the Sato Maki. All come really well decorated, and finely put together - somewhat. We had the pleasure (pain) of sitting right next to the area which the chefs prepare the sushi. Now, I've seen the folks at Taro Restaurant and a number of different sushi restaurants do it, and there's an adequate amount of care that goes in. It seemed here, not so much. Perhaps they were a little rushed tonight and many more rolls had to be made than usual, in a short space of time. We had the fun show of our own roll being made right in front of us, and when it arrived there was a little bit of theatrics with a blow torch (unnecessary pretentiousness again) but it was good. Could have used a little more wasabi, and a little less salt in the rice, but otherwise, very tasty, and well balanced.The Beef Hearts followed. Now, they were cooked perfectly and have a texture that's somewhat inbetween a fillet of beef and a kidney, and taste somewhat inbetween too. It was definitely very well done and melted in your mouth. The Octopus dish was the same way. I thought it would taste a little like squid, but no, it was tender, well grilled and the spicy aoili and purple potato made it an absolute delight to eat. All in all, this place serves really good food, but it's not a place I'd regularly return to, because it's not my \"style\" of place. It's got a fine dining feel, without the pull to return again. I've now tasted Japanese Peruvian, and I've gotta say, I'm good to go and don't need a revisit. Service wasn't poor for us that night, but I can't say that the atmosphere helps either. It seems like a place (and the clientele on a Tuesday night proved it for me), where corporate soho'ites come to dine because the company is paying for a good meal for a party of 6 or more. Not quite the intimate place that I'd bring a date to.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5pQIxCTGyjd89bqgUonNg"
  },
  "e6UWOTPAZxkFEFxmnywGGw": {
    "date": "10/11/2013",
    "text": "Like many places in Soho, Chotto Matte is a restaurant that turns into a trendy bar in the evenings.  I'll start by staying I only went for drinks, so I'll have to come back and update my review once I've eaten here.  The menu looks pretty intriguing though!  As far as a bar goes, I liked this place.  Despite a pretty busy vibe, my friend and I were able to get seated at the bar and had a nice chat with the bartender despite how busy it was.  It's a little fancy, so it's a little pricey, but if you're in Soho and looking for a place open late that's not too crazy try out this place.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqKmPP3nPycZvMBpDrVJxw"
  },
  "UExmBsI-5McDavsombMwKA": {
    "date": "10/4/2014",
    "text": "Octopus here was amazing; my friend and I immediately ordered a second to share. Corn tostadas with various sashimi or meats were creative and tasty. To fill up on food here would probably cost £100 per person, before drinks, which can quickly almost double your bill.  But it's all tasty, and the atmosphere is very modern and hip. The bathrooms were quite posh and interesting, too, with a black-on-black theme and odd mirrored lighting that turns on only when very close to a sink.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzqKjphI2USrsFpz35w98Q"
  },
  "DG8f8VpVBCIUN9buS86_hQ": {
    "date": "2/3/2014",
    "text": "I think there's a joke to be made involving the phrase \"chotto matte!\" and dismissive service, but I'll let you put that together seeing as I can't be funny all of the time.  First things first,it looks like they've got their act together pretty quickly as far as service goes.To sum up my experience at CM (thoughts echoed by my dining partner): good food with some great dishes, decent drinks, knows what it wants to be.  To elaborate on the last point, the interior of CM is pretty cool...low light, glossy black walls, but with spray painted graffiti-esque murals and a UV-lit splatter painting in the basement next to the loos.  As much as I like the space, it is undoubtedly trendy and we settled on 'effortfully cool'.  Being food first, I would probably prefer to more quiet and minimalist setting in the same vain as Dinings, but it didn't detract from my experience, nor was it overly loud.The downstairs section is a bar, and there is a pretty extensive cocktail menu.  I tried a reasonably light cocktail (combination of grapefruit, elderflower and tomato) which was not bad, although it did sound a bit better than it turned out to be (which, to be honest, is mostly to do that, for me, dark spirit cocktails have a higher ceiling for me than light spirit cocktails, but whatever, the drink was still enjoyable).   We went for the Nikkei sharing menu II (recently changed from being termed a 'tasting  menu') consisting of 10 shared dishes and a supplementary plate of Nikkei sashimi - a plate of thinly cut yellowtail with yuzu soy, tomatoes, and jalapenos.  The yellowtail was a really nice dish, very much a ceviche-style dish with a lot of acidity and garnishing elements, but with the yuzu soy giving it that distinctive Japanese flavour.  This was definitely a case of resisting the temptation to lick the plate (this was a common theme throughout the evening).Running through:- The first four dishes (IIRC) were i) a selection of tacos with three different fillings (snow crab yuzu/tuna in an interesting tangy sauce/crunchy vegetables); ii) scallops served in a ceviche-esque styly with coriander and jalapenos; iii) ceviche medley; iv) prawn spring roll.  These were all good dishes - whilst there was no stand-out dish as such, they worked really well together.  I guess some may find some of the flavours a little samey (the Peruvian influence brings a lot of tang and coriander which was a major part in each of these dishes), but honestly, I couldn't really get enough of it - this dinner definitely seemed to cure my case of scurvy.  The salsa accompanying the spring rolls was particularly good in this respect and the sauce may have been drunk.- The next two dishes were more mains-y, consisting of black cod and a lamb chop.  The black cod was very good , the yuzu miso being a nice touch (if you're not a fan of citrus, maybe this menu is not for you).  The smoky lamb chop provided a nice counterbalance to the cod.  Again, neither dish was necessarily outstanding, but they were both really well done and nicely complemented each other.- Sushi/sashimi rounded out the savoury section with a plate of maki rolls and a plate of salmon, yellowtail, and tuna sashimi.  Overall, pretty good quality (as you'd hope), and a nice way to close out the mains.- The two desserts were really good - a chocolate fondant and a passionfruit creme brulee.  These were probably the most standout individual dishes - A* on the sugar test (I don't have a very sweet tooth), and they worked really nicely as a pairing.  It was nice having something a bit heavier after a reasonably 'clean' meal.I did wonder before I started, but I left feeling just nicely full.  All in all, it's pretty decent value at £45 (averaging out at £9 per dish if sharing which does tally given the amount of seafood, and given my recent experiences, it could be all too easy to spend that much at an Izakaya-style place in this country) and the food is of a good standard, especially when taken as a whole.  It's less fusion-y than I would have expected - the ceviche was very much ceviche and the sushi sushi, but I thought that the overall balance was great.  As mentioned above, the service was almost faultless, my one criticism being that they could have given us a little more pause between dishes (I know it was Saturday night and all, but I hate hate hate that feeling of being rushed).  That said, there were no glaring errors, no impoliteness, and the service was generally attentive, so I give them kudos for working hard to correct that.  Ultimately, it's not the sort of place that would appeal if I walked past (unless I looked at the menu), but looking past the aesthetic, there is some really good food here and I'd quite like to return at some point to try the a la carte. There are plenty of 'cool' (yes, Dr. Evil quotation fingers) which would give much less thought to their food, but I give CM credit for its quality and for being just a little different.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7_FGnfY_rI4A2PFLZbkgw"
  },
  "wkqUbsmOs3LZvZsMRJUNBg": {
    "date": "10/3/2014",
    "text": "Great food and atmosphere. Ceviche and rib eye were excellent. Came here on a Friday night with no reservation and got a seat in 20m - busy but not unmanageable. Prices are high but expected for the area. They did however forget our water and it took a while to order. Otherwise a very positive experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzXyBIfuUtsU2ZGF36IKDg"
  },
  "s_5au3vonf7J3YV9FQ6l-Q": {
    "date": "11/6/2013",
    "text": "It was the Godfather of Yelp's (that would be Yee Gan!) 32nd bday, so what better way to celebrate than to check out a tasting menu at a new Peruvian Japanese restaurant?  So a few of us checked it out, along with Grant T and Andrew M.  There is an a la carte menu, along with 2 different tasting menus priced at £40 and £45 - we opted for the £45 one. The bar downstairs is nice, and cocktails were tasty, even the non alcoholic ones!  I really enjoyed the Matte Elixer, which was coconut cream, orange and carrot juice.  The food itself was pretty good, I really liked how cumin was mixed into the dishes, had a nice bit of flair to it.  I love anything acidic, so one of my favorites from the evening was the seafood ceviche.  There a mix of Peruvian corn in there, with some shrimp, and fish.. The ceviches I have had in the past were never that good, but this was a winner.  My other favorite was the miso cod, though this is a pretty simple dish.  The buttery fish just flaked away, cooked perfectly.. delicious!  The lamb chop was tender, but I preferred it more when I mixed in some of the yuzu salsa (from the prawn spring rolls).  I don't usually do tasting menus, and maybe this is common, but while I'm OK with sharing dishes.. I wasn't too keen on sharing plates for a tasting menu when the items seem to be so small.  If its easy enough to divvy up portion sizes for each diner, thats fine.  The desserts were a bit funny where there were 2 plates of 3 kinds of desserts, plus 1 super tiny slice of something delicious.  Tasty, yes! A bit funny to share. I would have given this place 3*, mayyyyybe 4* .. but the service was *that* bad that I had to drop it to 2*.  I can be pretty forgiving if 2, maybe 3 things happened... Grant T summed up a lot of things in his review in regards to the service, so a few specific things that started to add up (yep, its lengthy):  - we had an 8pm reso (on a Monday night), were told to relax w/ our drinks, but when we asked for the table at 8:30, it wasn't even set up yet.  After 15 minutes, we asked if the table was ready yet, and we received a very blank \"Yup, its been ready for a while.\" Umm, so why weren't we seated? - we weren't asked if we wanted drinks when we were seated. - there was about a 15-20 minute wait to receive the 2 bottles of wine ordered - food came out a bit too fast (efficient kitchen, I suppose?), and the first 3 plates were piling up.  Though, we were hoping to enjoy wine with our seafood, and I suppose we did slow our eating down a bit to wait for the wine.. but the wine shouldn't have taken 20 minutes- dishes were inconsistently cleared.  At the end of the service, we had an assortment of random dishes- there was a 20 minute lull in waiting for our 8th dish (sushi rolls)- almost lost Grant's credit card, had to ask 3-4 times for it. One girl said she'd get it - but didn't even bother asking for his name.. or trying to get the card, so we had to ask someone else.  Everyone who searched for it had to keep asking for his name.  During the course of our dinner, they came to us with someone else's credit card too.. don't think the owner of that card would've been too happy that his card was being shopped around.- took another 20 minutes to flag someone down so we could pay - 7 of us went down to get our coats, and understandably the girl told us that our coats and bags are still being retrieved since we had a lot of stuff.  Half of us were still waiting, so we asked her again, when she realised no one was getting the rest of our stuff- someone from the group politely mentioned that the food was great, but service needed to be brushed up on (and since he's in the food industry, he understands that things can get tough on the service side).  One of the guys from the bar tutt'd as he went to get our bags, and sloppily held them out saying \".. and who's are these?\".  You can definitely sense the attitude...In summary, all the food came out really quickly (except for the 20 minute wait for course #8), but in total, we were at the restaurant for about 3.5 hours, just waiting .. and waiting ... and waiting, for things to be done, or rather - not done. We had to repeatedly flag people down request for anything - and you couldn't just ask 1 person, you had to ask a 2nd and 3rd because nothing we asked for firsthand was ever done.  That was the toughest bit, is that we saw lots of different servers, its just that we didn't have a single server who had ownership of our table, nor bothered to come over and see if we needed anything. Several annoyances were just adding up, and I was *thisfuggingclose* to speaking with the manager (politely) about the poor service, and if they could remove the £50'ish service charge from the bill. Was the food good? - yes, though I wouldn't be able to comment on the value of the a la carte dishes Would I come back again? - to be subject to that type of service again, not a chance!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJKnmUxpJfzPovCTsT1kLg"
  },
  "f9iGZ2EZZ-6bz0hr1ZAFZg": {
    "date": "12/2/2013",
    "text": "tldr - Spotty service but more than made up for by incredible food and a fun ambiance! (Great value too)Atmosphere:Bright, nice music, mural adorned walls; just a really fun vibe. We were there from 2030-2230 - it has to be said that the music got notably louder at 2200, such that you almost had to shout. It did however become notably better as well (more housey) so as long as you have a few drinks by 2200 you'll be fine.Food:Almost every dish was stellar. We had the:Aburi Salmon - fresh salmon pieces blow-torched at your table. Cool way to serve it and really tasty.Tostaditas, tuna and hamachi tartar, beef short rib, black cod, and chargrilled chicken and lamb chops - All of these were awesome and worth ordering.chargrilled octopus - the only more average dish but still good.Corn puffs - worth trying. Looks like alien corn; the kernels are massive. Had 2 desserts, the cheesecake and something else. Both good but didn't reach the heights of the other food.Service:2000 reservation and we arrived on the dot. We were told that we had to wait a while for our table. Ended up waiting almost 30 minutes; we didn't actually mind as we were chilling on the single couch near the door and just talking but it's a problem many people seem to have.Our waitress was friendly but not always easy to flag down. They also took ages to bring/refill water.I ordered the sparkling sake and asked if it was sweet (was reasonably sure this was the case as every other sparkling sake I have had is); she said it wasn't and suggested something else. I decided to go with my gut anyway. It was lovely - sweet, light, and exactly what I expected. She should have checked instead of winging it.Others:Toilets are a bit weird - down 2 flights of narrow stairs and just a bit disorienting. Fun to check out though.So reasonable!! Maybe my perspective is skewed but for just the food, and for a lot of food, we paid around £33 each (one friend didn't drink hence we had to calculate the food price).Overall:As long as you aren't starving when you go, and are willing to overlook bad service for amazing food check it out! This is definitely a 5-star restaurant based solely on the food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tIXoexTdxCj2B8S-4jFOPA"
  },
  "ZNaznjD1D6pv7MfQLt1c9A": {
    "date": "11/4/2013",
    "text": "This place seems to have appeared out of nowhere - one day it was a Giraffe, the next day its a trendy Japanese/Peruvian restaurant. Unlike many other places in London, the restaurant is huge, and the atmosphere is very nice. I didn't get to try much of the Peruvian dishes, but the sushi rolls were very good - I'd recommend the Aburi, which they torch at the table in front of you. The menu is very elaborate with a lot of choice, and the drinks are very good. Definitely a great place for a romantic dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SWNkgZL1cJTek7odyJYkOg"
  },
  "OJ32oFp_71En18HZagU8Kg": {
    "date": "3/21/2014",
    "text": "A cross between Nobu and Sticks n Sushi for Japanese/Peruvian izakaya style dishes. Yes the price is cheaper than Nobu, but I still could not justify it for the small portions, particularly when it's salmon sashimi. No real creativity when it comes to the variety of sashimi and sushi on offer. The miso cod is delicious, but again not justified by the price considering it is the same fish used in run-of-the-mill fish and chips! Lovely venue and atmosphere but I will not be rushing back here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CcMH2bObppn53U-9FK3foA"
  },
  "Xcw7S8pyw9Xsw4SJDxVHIw": {
    "date": "3/15/2015",
    "text": "I really like this place. The food, the atmosphere, the service...all goodThe place is nicely decorated, with a good young and stylish vibe. The service is good, polite and prompt.the food is very good, a mixture of sushi and peruvian that takes the best of both cousines. Few things to try out definitely: the octopus with purple potatoes, the tostadas with salmon, the seabass and the salmon and avocado rolls...delicious!Pricey but not utterly expensive, definitely worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRAnL4nPczO2JvNvsTE8wg"
  },
  "SUg8ekESGXODPPsYLskEdw": {
    "date": "8/15/2014",
    "text": "Seeing as I dined here with Rob H., many of his views and experiences mirror my own (though, let's face it, generally more eloquently written by him than me. Best to skip the rest of this and find his.... kidding... sort of).The really nice thing about this place is that, for the money, the sharing menus are, I think, a pretty good deal. I always worry, particular at seafood-orientated places that tasting menus will leave you feeling hungry. Was not the case here.The ambiance and clientele aren't really my vibe/crowd. 'Effortless cool' is not a phrase I would use to describe it. It is trying really, really hard. But I'm not giving it 4 stars for that. The food was great, totally up my alley, and that's what really matters, no? And unlike other yelpers who went earlier on, we had none of their service issues. If you like lime, yuzu, raw fish, and the like, try it when you feel like a splurge. We left with happy bellies and tangy tongues. A sensible fusion of Japanese and Peruvian flavours and techniques that make a very moreish marriage of styles.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "3KbwjL6yD7lSKe_CZX8HGQ": {
    "date": "7/20/2015",
    "text": "OMG. This is the best restaurant we have experienced in a long time. The most amazing flavors, great staff and incredible waiter. Ours was named Manuel - he is an amazing waiter with great skills,  engaging and very knowledgeable. Try the short ribs and the octopus. The rolls were fantastic! Loved the entire experience. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_if9XHbHcAR_O0AMj6mIaA"
  },
  "r2qm6CWmY8jJJ6PvXgwE_w": {
    "date": "7/13/2014",
    "text": "I'm not sure why the reviews here are a little bad by we had such a great time here !! We were planning to go to Ceviche and decided that this place looked so much better so asked if we could get seated. Tin being a Saturday night I had very little hope but they had a great seat for us by the kitchen. We order the beef tartare, sushi, lobster ceviche, eggplant and a few other dishes with a reasonably-priced bottle of champagne. Yummy !! I'll Defoe back bc it's such a cool vibe with great food!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "6jR5cK5retT748-qPMJBfg"
  },
  "u7e36FlrSH-RVG2rFbmBcw": {
    "date": "4/21/2015",
    "text": "The doorman here is lovely. I really like the atmosphere of this place but the waiters and waitresses can be a bit snobby and rude. I asked for a table to order a drink and the waitress told me she was too busy to attend to me. The dismissal was very snobbish and rude. I was dressed quite well so I don't know why she gave me the cold shoulder. Other than the bad service the mocktails are lovely and I love the interior design with the graffiti! I always bring my friends here for a drink.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f4MapZCStu6x-0DyPndRKQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Near the toilets!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f4MapZCStu6x-0DyPndRKQ/o.jpg"
      }
    ],
    "user_id": "kHhqHtaFiooYl6kxE-2bXg"
  },
  "PFj7jk2MuRMt_S0PL5JuNw": {
    "date": "3/7/2015",
    "text": "The food was amazing but the service from our waitress (Rocío) defined the experience. It is a tapa-esque service where diners are encouraged to try multiple dishes (typically 3-4 a person). Everything from the starters, mains and desserts were unique and very flavorful - we especially liked the purple potatoes.I've been to quite a few and I found this restaurant one of the best in London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5QNjZOwGdAF3O-CHQ1JTg"
  },
  "hvhJbAnElwlY97H94U3d9A": {
    "date": "11/4/2014",
    "text": "I don't think Chotto Matte is for everyone. I was excited to come here, as I am a huge fan of Japanese food and I like to try new things. I think the problem for me is that I like Japanese food because it brings out the flavour of the actual ingredient, not just the sauce on it. The fusion with Peruvian flavour seemed to me to be about all the sauces and added flavours, most of which were sweet, and I don't really like sweet food. The best item for me was the miso chicken, which was well-made and well-presented. It tasted more like barbecue than miso though and was quite sweet. We also had some kind of vegetable fries, I forget now what kind but perhaps yucca. They were flavourless and after a few I couldn't force myself to finish them even though I was hungry. The salmon sashimi was fine but nothing special. The service here was attentive though and I am sure someone who really likes Peruvian flavours or sweet food would be happy here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YtEzz2fxpygNApntINsNhw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Some kind of fries...not so good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YtEzz2fxpygNApntINsNhw/o.jpg"
      },
      {
        "img_id": "oF4QRw7UkD1xBhZilAMTVw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Miso chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oF4QRw7UkD1xBhZilAMTVw/o.jpg"
      }
    ],
    "user_id": "PWOk9EXCeuwHAayusD8oXQ"
  },
  "pggBuY2k-Nl5jH_-a0e5sw": {
    "date": "3/3/2014",
    "text": "Interesting spot that is targeted toward the a nightlife atmosphere. Awesome space with a nice ambiance. Sadly, service is only good when they are required to serve you. Food is great and even comparable to a similar location in Los Angeles. ServiceFrom the beginning, I thought the service was solid. The wait staff seemed knowledgeable about the menu and reasonable about their recommendations. For the most part they were also attentive and prompt in bringing our drinks and food. BUT, the second our menu completed (we got a tasting menu) then service pretty much ended. No one checked in and it took several attempts to get any wait staff to come to our table. Rather annoying when trying to end the night and get home.FoodOverall good food. If you're willing to spend, then do what we did and grab the Tasting Menu. No one really looked at what was apart of it, but all solid dishes that portioned out well to not be overfilling. I don't remember every dish, but the anticucho dish was nice. Ceviche and gyoza were also excellent. The sushi sampling was also well executed.Overall happy with the place. Of note, the bathroom is a trip with it lit up in the basement. Anyways, I would say try this place out for a nice place for dinner and drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBLfm4o4rTUwqdgfNtFbkg"
  },
  "en4sH6dT5FIghBvhVu-GRw": {
    "date": "12/30/2013",
    "text": "Dropped in by chance and have been truly surprised.Great food, excellent service and moderate prices. The chef spends a lot of effort in creating, taste wise and optical wise great dishes. Take your time and enjoy.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "XmK7hcl2qeqlauZnxqqW5A"
  },
  "FanPVwD1X_vq6l_eOR33AA": {
    "date": "4/14/2014",
    "text": "Sooooo, I came here with girlfriends Friday evening for an early dinner. I had never heard of it before so when I looked it up Japanese Peruvian sounded great.I arrived first and I was given the option to be seated or have a drink at the bar. I chose a drink and had a Chotto Bellini, and did some people watching from the bar. The bar and restaurant has a very trendy interior and feels a bit like a night club. Our table was upstairs and we drew a short straw and were right by the main gangway and right by the open kitchen. My first thought was great my hair is going to stink for the rest of the evening and it did!The menu is so hard to choose from. Everything sounded delicious. In the end we decided to get various dishes to share:Canchas to nibble while we waitedTempura prawns, with huacatay and ponzu butterTempura soft shell crab, with yellow chilli and yuzu Black cod, with yellow chilli misoBeef short rib, with asparagus, purple potato and teriyaki sauceAubergine miso, apricots, puffed soba and sesame seedsPork belly, nashi pear, yellow tomato salsaBrown fried rice, vegetables and fragrant soyCassava wedges and smoked panca dipQuinoa salad, pomegranate, coriander and canchasFollowed by:Miso mousse, white chocolate foam, lime and lemongrass sorbetPetit foursGreen teaOur mains and sides were all delicious, especially the black cod and beef. We had told the waiter we'd like to share everything but our food arrived in dribs and drabs and the dishes are quite small so we added a couple of dishes to our order.There are loads of staff, which is quite overwhelming but it's also difficult to get someone's attention. The staff are nice but there is an air of arrogance among them.Dessert was also good, the miso mousse dish is incredibly sweet and is nice to share. The petit fours are tiny and so cute. Another let down was our tea wasn't served with dessert which would have been nice.The loos are interesting as there is on way glass from the gents and a chap came out very concerned we had seen him pee, which was quite amusing. For a busy upmarket establishment it is disappointing when the loos aren't kept clean, a few stalls were not usable and early on in the evening. Come on you have tons of staff, get the, to check the facilities more.I did want to give 4 stars but my niggles out way the delicious food, but it's definitely worth a visit.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QQM6jv7CoAEb71wW8Qvi2Q"
  },
  "pkdNTxE_da6HKDGNgkCADQ": {
    "date": "1/20/2014",
    "text": "- went there for some drinks on a Saturday night- part of the location is a restaurant, the other part is a bar - DJ plays good/chilled/house music- reservation recommended; however, there are some small tables in the bar area- nice staff; nice people (mixed age)Result: I would come back for some drinks or even try the restaurant!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3BHeHTGNZcaEi8woqGy2kA"
  },
  "AuVEdhFlm8GzemUMO9-SNQ": {
    "date": "2/24/2016",
    "text": "BEST sushi in London we've had thus far. The rolls are creative and even the basic ones melt in your mouth. The ambiance is great too, perfect for any type of celebration or just a nice dinner. Would recommend to anyone.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P14T7JAXmrhTTRVb1sN6_A"
  },
  "IX-GjFI17pOfHf08X0MN9w": {
    "date": "6/17/2014",
    "text": "I came to the cocktail lounge here, we arrived around 10:30pm on a Monday and this place was quite busy! The music was louder than it needed to be, but the world cup was on so we decided to stay. Having never heard of this place before we were very impressed with the innovative cocktail selection. I got an extra dirty martini, as I normally use that or an old fashioned to judge the barmaids skills. I was pleasantly surprised! The drink was strong and tastey and at an average London price (9-12 quid). They had a lots of Japanese whiskies and unusual sakes mixed into cocktails and I will be returning for the food and more cocktails whenever I am in the area next!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdTzsZcoyzKdSz21SX_YyQ"
  },
  "-PmcC7AlgzJu5m6pS8utQg": {
    "date": "5/5/2016",
    "text": "This review is solely based on the service, not the food.  We were so put off by the lack of attention, that my hubby and I just wanted to finish our drinks and bounce!  I arrived before my husband to get a table ahead of time, and I probably made eye contact with 4 different waiters as well as the hostess, and not one of them offered to get me a table or even acknowledge my presence.  I finally had to waive my hand around like a kid in a classroom, to get someone to walk over to me.  The guy seemed so annoyed that I was ruining his water-cooler chit chat session near the register and just asked me \"Are you eating or drinking?\" Didn't get a \"Hello\" or a \"How may assist you?\" Anyway, he sat me down without giving me a menu.  I then waited and waited and WAITED for a waitress, she never came.  My husband showed up about 15 minutes later, and we still didn't have a waitress or a darn menu.  We were so tired from jet lag as we had just arrived from LAX so we were not about to get up and leave as we normally would after such poor service.  Ambiance is great, decor is stylish and trendy, and it's location is convenient as it is located in the heart of Soho, but honestly, skip this place unless it's midnight and you want to grab a drink at the bar to just people watch.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ct-hodheavdNe3x8cdWh2Q"
  },
  "jNU1VccNZROL4pJujFKqVQ": {
    "date": "11/6/2013",
    "text": "Chotto Matte first came to my attention via the Nudge due to the £35 sushi tasting menu. Seriously, £35 for sushi made by a chef who used to make the stuff for the Emperor of Japan?! Bargain! However, it seems that was an intro special as the tasting menu is now £40 or £45 and is more a Japanese Robata menu rather than pure sushi. That's still a pretty solid deal for Frith St dining and the food turned out to be excellent. Sadly, the dining experience was overshadowed by the largely apathetic (and that's putting it kindly) service we received. And that's enough to make me think twice before ever going back, sadly.The street level of Chotto Matte is a large bar area with plenty of seating and standing room. The bar itself is interesting with a cocktail list with intriguing concoctions and an emphasis on utilising herbs and spices. I tried a toasted cardamom Manhattan which was delicious with the earthy cardamom balancing the smokey whiskey and each sip finished with a hint of sweetness.The menu is a blend of Japanese and Peruvian dishes with several being great examples of well executed fusion cuisine.  We opted for the £45 tasting menu which included a trio of cold starters, hot mains of miso black cod and grilled lamb chops, a selection of sushi, and an array of desserts.The highlights for me were the seafood ceviche, miso black cod (hard to go wrong with that), and the roast beef maki rolls (bear with me on this). The seafood ceviche is a mix of sweet succulent seafood that melts in your mouth balanced against the crunchy corn and tangy citrus sauce.Next, we had the miso black cod which is usually a winner and here it didn't disappoint. The flaky flesh was perfectly cooked with a light sear on the outside and a moreish miso sauce with just a hint of heat. The roast beef maki rolls were topped with something approximating fine shoestring fries - essentially you have a tender roll contrasted against the crunchy topping. It's worth noting that the term tasting menu is a bit of a misnomer for the menu on offer here. Your dishes for the most part are designed to be shared between two people. The term \"sharing menu\" may be more appropriate to set expectations. The wine list is respectable with our two choices (a Riesling and a drier white) offering a good choice to the party while both pairing well with the food. However, there didn't seem to be a sommelier or knowledgeable waiter around so it was just lucky that our group included an expert bartender. The major let down was the service. It was bad - plain and simple. In all fairness, there were a couple of staff that were good - the lovely girl who cleared our table and offered to hunt down someone so we could order wine and a tall Asian waiter who went above and beyond to track down a credit card misplaced by the bar downstairs - but in general it was slack. It started off poorly as we rocked up about 8pm (when our table was booked) and asked if we should go up or have a drink at the bar. We were reassured there was no rush and to have a drink - great! Then when we wanted to go to the table at 8.30, we were told it would be 10 minutes before it was ready. Essentially, we didn't get to our table until almost 9pm. Our main waiter seemed almost put off by the fact we knew ahead of time we were getting the tasting menu and proceeded to disappear. The food arrived in clumps (3 dishes at a time) so we had barely started into the first course when courses 2 & 3 arrived. It was a good thing they were all cold starters but this was unlike any tasting menu I've had. The general feeling was one of being rushed to wait as there was a long (c15-20 minutes) pause between courses 3 and 4. By this time, we finally managed to get a wine order in and flag someone down for tap water. On a strictly food basis, Chotto Matte is great value for money. However, if the question is would I go back, I'd be torn. Actually no, no I wouldn't - there are just too many excellent places to eat already in London without setting yourself up for more disappointment.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "p3EwxODw6QUbK0y9HMbR6g": {
    "date": "10/12/2013",
    "text": "At first sight, I really didn't like this place and would probably never have entered if it weren't for my friends sore feet and the fact that all other places nearby had a wait of about 1-2 hours. So waving goodbye to gorgeous Barrafina across the street, I crossed my fingers, hoped for the best and went in for a table upstairs in the restaurant area - not that the hip and happening music was any lower so expect to yell your way through your conversation.The menu was quite elaborative and a bit confusing with Mexican, Spanish, and French dishes aside from the Japanese, so  we decided to limit our options and go for tasting menu 1 with a range of fish courses, sushi, pork belly, creme brûlée (it's world kitchen!), and a bottle of sparkling rose.The first dish came in, and I have to admit it was quite good. Raw salmon fire torched at our table, really yummy and props for special effects. The second dish literally blew my socks off; white fish in absolutely delicious lime sauce, we basically dug in with spoons to eat the sauce. The third dish was perfectly grilled white fish, so gorgeous and crisp with skin on and - a bliss! The fourth dish was pork belly, and at this point I was so stuffed that I decided to wait for the next course; my friend went crazy for these, so I guess it was quite good. The fifth dish was sushi - and that dish would have sufficed in itself, huge portions they serve here! We nibbled and have to admit, good sushi - but there's a catch: they make their own soy sauce and it's just not good enough. We were wondering what the weird taste was until my friend said 'it tastes like hotdog' - and it's absolutely what their soy tastes like, quite funky. Finally, dessert! The passion creme brûlée is really good, the ice cream was good, the almond cakes ok. There were some black seeds underneath the ice cream that nearly broke my tooth, but afsides from that a decent ending to a surprisingly good tasting menu. I would probably come back sometime when I'm planning to go clubbing - just down the stairs and you're in bar! What do you know.. I'm really old school and quite fancy the whole slow music-candle light scene too much to trade it in for club dining. But I have to admit, the food was unexpectedly good so props to the chef. Only 3 weeks into their opening, I only hope they stick to their high food quality.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NfVbJXks-Omf2V6ePZTJ9g",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NfVbJXks-Omf2V6ePZTJ9g/o.jpg"
      },
      {
        "img_id": "dkOQlNioXkOFOKctBhlMnA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dkOQlNioXkOFOKctBhlMnA/o.jpg"
      },
      {
        "img_id": "FBGSTmHmy2RxGeAPq_pPpQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FBGSTmHmy2RxGeAPq_pPpQ/o.jpg"
      }
    ],
    "user_id": "tcTTATDVkNccRFVLZbdykQ"
  },
  "vjUePc_Q3xHr7ChIpfPo7w": {
    "date": "11/4/2013",
    "text": "We came here for a friend's birthday dinner. As there were several of us, we staggered in and had some drinks at the bar. I had three cocktails over the course of the night, and one was amazing and the other two were quite good. Anyway, our res was at 8:00, but they told us to relax so we did. When we decided to go to our table at 8:30, we were told it wasn't ready. Really? It's been a half an hour since our reservation time? So we had to wait an extra 10-15 minutes for our table. Which is just strange.When we got to our table, they did bring us some extra nibbles in order to compensate for their ineptness with the table. Which was nice. But really, the table was just the beginning of the problem. We knew in advance, we wanted to get one of the tasting menus, so when they came to our table to bring us the menus, we told them. And they left. No ask about drinks. Just left. The food started arriving. I had to ask for water from someone. We had to flag down someone else to order the wine. And it took ages to show up. By the time it did, they had brought three of our courses. And those courses came way too quickly. Like they just kept coming.But then something weird happened. The courses just stopped. And there were insanely massive breaks between the courses. It was just so disjointed. We had to keep asking for more water. We were basically ignored except to bring food. When we decided to order a few more cocktails at the end of the night, we had to flag down someone. They almost lost my credit card as they require one for a bar tab that they were eventually going to transfer to our table. As you can see, there's a long line of service problems that Chotto Matte seems to have. When we mentioned it to them at the end of the night, they said that they were \"understaffed\" that evening. Which is strange considering I saw at least six different people come to our table that couldn't be bothered to ask us if we wanted anything without our prompting.The food was fairly good. The best dish for me was the beef \"sushi\" rolls. Tasty and the cumin sauce was amazing. The nigiri sushi was kind of average to be honest. Most of the other courses were tasty but not memorable. They brought out a dessert for everyone and we were expected to share. The tasting menu could have been executed better in all honesty. It was as if they just did a full size course and expect it to be split between two people. Meh.The venue itself is one of those restaurants that also wants to be a bar. It's like someone wants to be a chef, but knows that a bar is likely to make more money so they combined the two. It's very disjointed. The toilets are obnoxious and confusing.And with the poor service, I can't imagine that I'd want to go back to give the food another go. They really just need to figure out what they're doing and realize that the service is as important as the food.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "A2QbN0gfgO7cPANzk8Fd_w": {
    "date": "11/7/2014",
    "text": "Fun, modern restaurant with culinary adventurism. All of the food was tasty but not mind-blowing. I would highly recommend nonetheless because Chotto Matte is quite the experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nKERf4LS6tD6JydoFbUteg",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Pork Belly",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nKERf4LS6tD6JydoFbUteg/o.jpg"
      },
      {
        "img_id": "YUAOz-_RqtGwrQXnTjJUaA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Sushi Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YUAOz-_RqtGwrQXnTjJUaA/o.jpg"
      },
      {
        "img_id": "F1fUXRZF7oklJYQNfrKH5w",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Tuna Tartare",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F1fUXRZF7oklJYQNfrKH5w/o.jpg"
      }
    ],
    "user_id": "FtZ2ePEMsOfCrn0Bk4B4Kw"
  },
  "RP99SQHD_dze4GTfMhajKQ": {
    "date": "5/1/2014",
    "text": "We arranged to meet friends here on a friday night,  our choice had come from a recommendation so we had high hopes. We arrived 10mins before our reservation and were directed to the packed bar to wait for our friends. Eventually we managed to get to the bar that was surrounded by people that already had drinks (personal pet hate of mine) in their defense the bar was already uncomfortably packed so there was no where else to stand. The music was also a couple of decibels louder than it really needed to be. Our friends arrived but it took them an hour to seat us even though we had a reservation, no reasonable excuse was given for our wait but we were told that we would be compensated. Having a vegan in our group we were restricted in our choices but all the food that came out was very good and extremely tasty, it all came out pretty quickly and portions were just enough for four people to get a taste.We finished up at about midnight and requested the bill that arrived without any of the promised discount :-*( fortunately one of our group was an American who had no qualms with pointing out the mistake. To the staffs credit the bill was taken away and returned with £70 taken off. Overall the food and the discount made up for the wait and  the annoyance of the inappropriately loud music and I would give them another chance.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "we6pxelXyHkR_Sp3gCtNPw"
  },
  "yGX5MYNYZzQUu33HaHsKwg": {
    "date": "3/16/2014",
    "text": "Japanese and Peruvian Fusion food was much too intriguing not to try out, so not long after it opened, I booked a table and made my way down to Soho to try out the delicacies of Chotto Matte.Right from entering into the place, however, I felt it had a rather pretentious feel about the place. Not a \"This is a seriously classy establishment, and we have the goods to match the trade\", but more of a \"We're going to look hella good, dress up nice and hope the rest follows\". I love a stylish restaurant just as much as the next foodie, but Chotto Matte just felt very.. out of place.That aside, we got seated in a corner (adjacent corners to each other on the table, not opposite - which is always weird), and the menus were bought over. We were recommended to go for the Tasting Menus (which happened to be the most expensive thing on the menu), but wanting to sample it all, we opted for both of the Tasting Menus.The food itself was very delicious, and definitely a lot of new experiences to be had. Though if you're not a fan of fish, this really isn't the place for you! The avocado tempura with smoked purple potato was a delight to have!But the service was.. overbearing. The main waiter came over with each dish (about 14 in total), and followed up each time 30 seconds later asking us how the food is. And the other waiters and waitresses were also keen to pop by and see how the meal was. And I think at some point the manager also came over to ask how everything was. Perhaps they thought I was important people?Whatever it was, it was highly counter-productive to having a conversation with my dinner date. Not really what I'm after when dining in a restaurant.The customary trip to the bathroom was somewhat... confusing, however. The corridors are dark, with low lighting and the Gents and Ladies are clearly distinguished on the doors. Unfortunately, the doors slide automatically, and whenever anyone is nearby... which means you can't see what's printed on the doors. You can probably see where I'm headed, with this..So once you've arrived back at your table and refuse to make contact with anyone who may have seen you almost enter the wrong gendered restroom, the bill was settled, and an experience had been had.One which probably won't be repeated, I'm afraid. Though the food was good, the experience left a sour after-taste.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0G-4DW_8r0Kz94JkFLj4A"
  },
  "ui387o5UBQcm30-5FWx57w": {
    "date": "3/27/2017",
    "text": "Loved this place! In addition to the fantastic interior design, the food was delicious. It didn't take much for me to get full up! Good service and fun vibe. I recommend the pisco cocktails. Loved the murals (on both floors).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4JuByAp5HX5Smk8sR2dVVw"
  },
  "XM-c2jCPTdiK19v8IUQLBA": {
    "date": "6/30/2017",
    "text": "This place is incredible. Such fucking good sushi, so many good vibes. Hell fucking yeah. Bouncers are great. Incredible music. The bathrooms are orgasmic. Everyone come here and fuck shit up. Hell yah",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7-c72YQ6n3L2-wltq9qP8w"
  },
  "F88yj1yfUSyDpu1FhO0dnQ": {
    "date": "7/30/2016",
    "text": "Delicious, average prices not too expensive. Nice vibe. Must try's are: octopus, purple potato mash and courgettes with carrots. They are simply perfect. And as dessert you want the peruvian chocolate and dulce de leche thing - like heaven for your papillae!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FZ_qxoyFge6k4lk4Uc0plA"
  },
  "L8iTI4zTaeq2I5iGW_5_dA": {
    "date": "5/3/2016",
    "text": "If walking or bar hopping around Soho, you can't avoid this place. The cocktails in London are famous for being watered down & pricey and this place was no exception so I had to keep ordering to get a buzz but the bartender was this charming Italian dude & made it fun to stay around",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nh8xHcqaPv02byODGhAW4Q"
  },
  "2Me7xhhDY91174_xNKbQmw": {
    "date": "7/16/2016",
    "text": "Overall a great experience. Vibe, decor, service, food, drinks- all were good. I like the stoned panther on the wall upstairs.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sh_l0G96V87vzEqbLR3dyQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Chotto Matte Entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sh_l0G96V87vzEqbLR3dyQ/o.jpg"
      }
    ],
    "user_id": "-MSmyDfWXZfJsrEHgr_MqQ"
  },
  "6ACpZO0OfiCaKvY6xfO0_Q": {
    "date": "1/7/2016",
    "text": "what a combo, peruvian and asian fusion. Some things were great and some things fell flat. The sushi i thought was less than decent for the price but the real star was the meats and at the moment i can't remember a damn thing from 5 months ago.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "5RwyJKah5fti-Iu9ygcsyQ": {
    "date": "2/12/2015",
    "text": "I've only had the (mis)fortune of sampling the bar here, not the restaurant, and it always saddens me to report that it was the staff that put a dampener on the night :(It was a busy weeknight eve when I went in with a group of colleagues, as we were attracted by the buzz from the outside and the funky awnings. It was pretty rammed inside, but whilst I was busy admiring the very cool graffiti style art on the far wall, my team mates managed to find somewhere for us to perch.We took over the spare corner of one of the large communal high tables, and the boys graciously offered the two high stools to us two ladies. We weren't taking up too much room, nor blocking off the walkway to the restaurant area, and yet a highly-strung member of staff complete with earpiece kept ushering our group back against the table. She seemed to have some invisible (and pointless) line in mind and every time someone crossed it she would give an exasperated sigh, ask them to move aside, then return to blocking it herself and scowling. When some of my team attempted to move out of the way to the opposite side of the table she again asked them to move, but seemed to have no problem when a couple of pretty girls wandered in and sat there.I'm not sure what she had shoved up her- ahem, I mean what her problem was, but it felt like she just needed to make herself feel important. Fair enough if there had been reason to the madness but if it was health and safety then the doorman should've stopped letting people in. First world problems I know, but it was a shame we couldn't relax and enjoy our bubbles as we were hoping to...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "bE_w44Vzrqe00ukeCd2hqA": {
    "date": "6/9/2016",
    "text": "We stopped in for lunch. Very cool atmosphere, great soho location.  We each had the chotto bento box. We both thought it was excellent, we really enjoyed all the features.  Really fun place and in the evenings and weekends it brings a lounge atmosphere. Don't forget to check out the bathrooms it glows in the dark.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BT7e7X398OKKepHWErhvKQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BT7e7X398OKKepHWErhvKQ/o.jpg"
      },
      {
        "img_id": "vTivIY3zali-hGwFIi9SiQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vTivIY3zali-hGwFIi9SiQ/o.jpg"
      },
      {
        "img_id": "r2ykjbRmfe9wcucDrtVB4Q",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Table side aburi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r2ykjbRmfe9wcucDrtVB4Q/o.jpg"
      }
    ],
    "user_id": "B1YiexaiQzK-KOVveQuR_Q"
  },
  "amz3EfR3B1RJ5fkKrPqNSw": {
    "date": "7/8/2015",
    "text": "A great experience - a selection of different tasting menus or the main menu. A fusion of Peruvian and Japanese dishes.Vibrant and interesting bar with a large range of cocktails and exotic liquors.Almost impossible to walk past this place with its open frontage and funky awnings. Great place to meet a s a group for drinks or to enjoy the eclectic cuisine.Cocktails all round, I had a limoncello based cocktail which was super refreshing.Our table selected  a Japanese sparkling white wine to accompany the meal. it was very cold and very dry, super with a spicy meal.Tostadas to start the meal off the main menu. Highlights were the pork belly and California roll dishes.Modern funky toilet zone was an experience and the Velocity app that was available and gave us £10 off our meal was gratefully accepted and will get good use in the future.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f0Hx4d7W2yy9DCKVXTTp7w",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Tostada",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f0Hx4d7W2yy9DCKVXTTp7w/o.jpg"
      },
      {
        "img_id": "9APXvu_lKIaKq2rKaYH4ZA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Pork belly",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9APXvu_lKIaKq2rKaYH4ZA/o.jpg"
      },
      {
        "img_id": "zDOxBUEt931c8pSE8gIdQQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Cod",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zDOxBUEt931c8pSE8gIdQQ/o.jpg"
      }
    ],
    "user_id": "_9LN9broCCkesAX38Buwqw"
  },
  "XfoZ7dWSSdlx1M1GESeP2w": {
    "date": "11/8/2016",
    "text": "I did not have a reservation however the place was not at capacity by any means and yet they made me wait. The customer service was bad, this all before we were even seated.The menu has no continuity.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoI5XBXUR1V57EF2S1T75g"
  },
  "93vsuzHS7wbMnvkwPJA_fg": {
    "date": "2/24/2014",
    "text": "An excellent new addition to the upcoming foodie scene in Soho. All tastebuds will find culinary pleasure and this buzzy, yet intimate, trendy atmosphere. A great spot for group dinners with the fully shareable style menu, great background music, intimate lighting and classily edgy artwork and atmosphere.The pace of the food delivery mades it ideal for a long weekend dinner over conversation and drinks. The quinoa salad, teriyaki beef filet, miso chicken and dumplings are all memorable and made to share. It is also well-priced and accepts walk-ins. Definitely one of the best spots in the area for a yummy and fancy - yet reasonable - dinner out.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "drxJItwfuwVdSPQpMKH07g": {
    "date": "11/21/2014",
    "text": "Consistent food after visiting several times. Knocked 1 star for the  Service, still not on point. Don't miss my favourites: Smoked purple mashed potatoes, Sea bass cevice and the padron peppers.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GU5qqkyskXWKxpbksHVIdQ"
  },
  "Tgnj1kKSab1xuk8JSpKxTA": {
    "date": "1/16/2014",
    "text": "Chotto Matte is new-ish and rather trendy Latin-Japanese fusion restaurant and lounge. I went on a Tuesday night for dinner and it was bumping. We opted for the £45 tasting menu, which included as election of sushi rolls and grilled items. It was truly a mixture of eclectic flavours which I guess is what happens when you mix Peruvian with Japanese cuisine. Most of the flavour combinations worked, especially the Ceviches...great mixture of fresh fish with the unusual twist of large dried corn kernals. The lomo saltado roll though was a bit weird....surely combining two favourite dishes---lomo saltado (stir fry beef with chips) and sushi would work....but alas the sauce seemed a bit weird with the rice and seaweed roll. The accompanying cocktail list was extensive and there were quite a few drinks I wanted to try. I especially liked the spherical giant ice cube in my Yamazaki Highball.Price wise, Chotto Matte isn't cheap, but not outlandish considering the amount of food you get esp on the tasting menu. All in Chotto Matte is a nice fun addition to the Soho scene. 3.5 stars, rounded up to 4.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ylex9iKIWWmvJOW6arRZjA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ylex9iKIWWmvJOW6arRZjA/o.jpg"
      },
      {
        "img_id": "LZhReKSksWGud-crvSWtFA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LZhReKSksWGud-crvSWtFA/o.jpg"
      },
      {
        "img_id": "o-2iDPOBiMpoZ9hnpa4IeQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o-2iDPOBiMpoZ9hnpa4IeQ/o.jpg"
      }
    ],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "_lv_YGqoSjYhMtlSGD_DMg": {
    "date": "3/5/2016",
    "text": "I came in with high expectations and this has managed to exceed them all! The seating area is nice and casual and the staff were very friendly and helpful! We ordered the spicy edamame, which was pretty good, the yellow tail and sea bass sashimi were both exquisite. The tempura was pretty good as well.The sushi rolls were heavenly, the dragon roll and spicy tuna were insanely good! Would definitely recommend it to all sushi lovers and look forward to visiting again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8wF9SPdC8055-8Z3G541og",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Sushi rolls to die for..",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8wF9SPdC8055-8Z3G541og/o.jpg"
      }
    ],
    "user_id": "7Gt-yoUaTXkDzTuOXzZM1Q"
  },
  "x9rRT4UPv7G8c7Z3MMpucA": {
    "date": "9/7/2015",
    "text": "There's a doorman.  Which usually makes me feel I'm walking into a nightclub rather than a restaurant, which filled me with a little bit of anxiety, but anxiety went quickly and we sat down for a really nice meal!Had a great experience as far as service is concerned.  We had a lovely French fella in a bow tie and others popped in on us from time to time to explain what we we're eating or just to check in on us.  All friendly folk.Dining is family style, so order a load of stuff and chow down with your party!  Honestly, we ordered so many things and they were all really tasty.  Except for the last minute tuna roll which we'd forgotten we'd ordered, and arrived well past the time all of us were full.  I didn't try it but heard from my fellow diners it was eh.  The highlights for me were the pork belly and the short rib.  Both so flavorsome and tender.  Definitely get the fried yucca which is basically crack in root starch form.  The corn has a lovely buttery flavor to it, but the texture is a bit odd.Give it a go.  Service is good, food is good, people are pretty, atmosphere is trendy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2mIcHnWxSBs7KrQsnUvew"
  },
  "DLnrsisj98YzDh5kl9I4aA": {
    "date": "10/16/2016",
    "text": "Words really cannot express my love for this place.  The atmosphere is on point, but beyond that, the food- wow. Have come on multiple occasions with different friends and tried different thing. The Peruvian corn, bbq chicken and anything with spicy tuna are my favorites but I've never had something not incredible. Have literally paused conversations to just say OMG after taking a bite (cue \"I'll have what she's having\"- like that was really our reaction). I love the cocktails too but generally end up with a bottle of waiter recommended cold sake.  I can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZCduE8lau5JI5NJrwvyGQ"
  },
  "xNsS50O2KEPP2WqwuuWcHA": {
    "date": "5/8/2015",
    "text": "The dishes at Chotto Matte are all small tapas portion which are made for sharing. We ordered various of dishes to share from the different section of the menu - sushi, barbecue, sauté and tempura.We started off with the Seabass ceviche which consisted of seabass sashimi, sweet potato, Peruvian corn, coriander, chive oil and citrus sauce. This was one of my favourite dish which had a refreshing flavour and was a good appetizer to start a meal.Another refreshing and tangy dish we tried were the tuna and yellowtail served with onion, ginger, shiso, tomatoes, blackberry salsa. I would had liked some tortilla to accompany this dish as this would goes nice to scoop all the salsa.We tried two of the sushi dishes that are flamed at the table. Sato maki comes with a combination of seabass, salmon and romano pepper with lime soy. The Aburi, comes with four different nigiri: Tuna yuzu, aubergine miso, turbot and salmon. Many of us felt this could have been flamed a bit longer to give it a seared texture. We also ordered some dishes from the barbecue section, including The Lomo a la parrilla was sliced beef fillet served with spicy teriyaki and pomegranate salsa. I found this dish was not worth the price tag of £20.29 as it was only a few slices of beef and I would probably not re-order if I revisit. However, one barbecue dish that did impress me on the table was the Barriguita de chanchito, which was pork belly. We thought the texture and the flavour made this dish a winner for most of us. Chotto Matte is a great place for a cocktail because you will be spoilt with choice as there are a large range of cocktail on their menu. I tried the Flor de Manzana from their anti-depressant cocktail which is described as cocktail with personality. It combined Finlandia Mango vodka, Akashi Tai sake, passionfruit, Bottlegreen elderflower, lime and apple.A meal is usually never complete with out dessert but I could have pass on the dessert at Chotto Matte. The service at Chotto Matte was slow, for both back and front of house. Also, we found that the waiter had added four bottles of water with out us knowing. We did order a bottle of still water to start the evening and the waiter poured it for us during our meal. But it would had been courtesy for the waiter to have asked if we wanted another bottle of water each time it was finished. We could have then decided on having tap water for those who wanted it or none at all because our cocktails had arrived.I would consider Chotto Matte as an expensive place to have dinner, since between 8 people it cost us around £50 per person (including service charge). It would only be a place I would come for just a cocktail or light bites. If it is for dinner then I would wait to visit Chotto Matte for a special occasion.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQJp6mwCMRCBLXDsF_cGAQ"
  },
  "fnsyHhR0zjvvSjly0BUfsg": {
    "date": "9/19/2014",
    "text": "Came here for dinner with two friends and we ordered the Nikkei Tasting Menu 3.The starter courses were good, with the Truffle Sea Bass Ceviche being my favourite. The mains comprised of lamb cutlets and miso cod, both of which were good. However, the miso cod was slightly too fishy and so not as good as the one served at Nobu and Zuma. The sushi course was a major disappointment as the fish was room temperature warm, and definitely needed to be colder. This took a while to arrive so I think maybe the sushi was left out to sit for too long. Lastly, dessert.. Heavenly! They brought us three different kinds to share, which is lovely for a tasting menu. Each was amazing, loved the mochi flavours. Everyone does chocolate fondant, but the one here was mind blowing with perfect chocolate. And the popcorn banana parfait... A great surprise. I gobbled up the dessert. Service could perhaps be improved, as the first few courses arrived in very quick succession, too fast. And then some later courses took way too long. With a bit of improvement though, this could my new favourite modern Japanese restaurant in London",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jVCFzYxjQpoXFIgSKCl-BQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Popcorn Banana Parfait",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jVCFzYxjQpoXFIgSKCl-BQ/o.jpg"
      },
      {
        "img_id": "a7TKPblU7yJk5JLEHCwfhw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Chocolate Fondant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a7TKPblU7yJk5JLEHCwfhw/o.jpg"
      },
      {
        "img_id": "b9fVi5fy7zCpaHYDdNkyMg",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Miso Cod",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b9fVi5fy7zCpaHYDdNkyMg/o.jpg"
      }
    ],
    "user_id": "QPKikyMD1KXn8KxiuByRzg"
  },
  "R5VmjpScrmwhrF_BEV_PQA": {
    "date": "9/18/2015",
    "text": "Yummy food, fresh fish and other sea food, friendly and nice staff , great ambience with good music playing in the back ground. Will definitely come back and recommend it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yYypKSJha1cGVDnDpU_w8Q",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yYypKSJha1cGVDnDpU_w8Q/o.jpg"
      }
    ],
    "user_id": "d2bUTNmSBDEpOROha37xgw"
  },
  "0G3CWbWptmPOT_Wgu8ndGA": {
    "date": "5/10/2016",
    "text": "Great drinks and decor but a by pricey. Would love to come back and try the food next time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzKJrWhb2LZhYkIeAWd2JQ"
  },
  "_H_ilxYobgDLmtUm1rJdBQ": {
    "date": "10/2/2015",
    "text": "I took advantage of their great pre-theatre menu which includes miso soup, a bento box of goodies and a glass of prosecco for just £25. We started with the miso soup which was warm and not overly salty like it can sometimes be. The bento box was huge with two layers to it and crammed with goodies. There was no clear order in which to eat it so I kinda just went for a try a little bit of everything to find out what was my favourite and the polish off the good stuff.The Padron peppers were something I'd never had before and was surprised by how mild they were, although I read that one in fifty peppers is much, much hotter than the others so I'm very glad I didn't get one of those! The lobster tempura was really great, big chunks of lobster meat in a light and crispy batter and not at all greasy.I absolutely adored the ceviche that I ate at Rex and Mariano a couple of weeks ago and was excited to try more but the sea bass offering here wasn't anywhere near as good and the marinade was far too overpowering in my opinion. The Nikkei sashimi salad was nice too but I do think the presentation of these two dishes was better than the actual taste which is always disappointing.I love sushi so the  spicy tuna sushi rolls and mixed nigiri were always going to go down a treat and this was a very good selection. Tuna and salmon are familiar toppings to nigiri to me but I'd never had a sea bass one before and thoroughly enjoyed it. Luckily the tuna rolls weren't actually that spicy in my opinion which made them all the better!The final compartment was definitely my favourite though with grilled octopus anticucho, BBQ miso chicken, steamed rice and vegetables with chili & garlic. I've never had octopus grilled before and I don't really like it when my food has suckers but this was cooked to perfection any my absolute favourite dish of the night. The BBQ chicken was really nice and wonderful dipped in some soy sauce but I scrapped a lot of the white sauce that was smeared over it off as I thought there was just a little too much of it.I wasn't stuffed by the end of the meal but I was definitely satiated and there was actually quite a lot of food for £25. You'd spend a lot more than that buying individual dishes anyway and it's nice to get to try selection of things.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vwgvK7fyM9ahSZzdKuksZA"
  },
  "evs91Lzw54Nl3e1DMiyM6w": {
    "date": "10/5/2017",
    "text": "It looked like a pretty hot spot for date. It's a drink, dinner place with good music & atmosphere. The service is pretty fast considering how crowded it was although waitresses didn't really spare a minute to explain what they were throwing on the table! It's best to share a few different dishes. It's on the pricier side & last but not least their drink list sounded quite disgusting so I couldn't bring myself to order a drink & took a beer instead. I mean who wants a drink with Sake, turmeric or egg white!!:/They serve good food but it doesn't exactly surprise or tickle the taste buds.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yXTvjZpyJYyqr4E44G_6Mw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Tuna sushi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yXTvjZpyJYyqr4E44G_6Mw/o.jpg"
      },
      {
        "img_id": "vWO-U4jgzQVgu0RkkmwZSw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vWO-U4jgzQVgu0RkkmwZSw/o.jpg"
      },
      {
        "img_id": "zaYK1i-esUBIoxp3dDkpjA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Dumpling",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zaYK1i-esUBIoxp3dDkpjA/o.jpg"
      }
    ],
    "user_id": "tI1Nmg0iFZCJOLDVbXw9JA"
  },
  "YIgr752SL_Hl9G5GPITH3w": {
    "date": "7/31/2018",
    "text": "Really disappointed with Chotto Matte. After wanting to go for ages because we liked the look of the place and the interior, we found that the place had really no substance. The food was really unspectacular, portions were minuscule and considering some of the dishes are priced the same as Michelin starred restaurants, you would think they'd deliver on flavour. But no, most of the dishes were overpowered with the salty/citrusy taste of yuzu, and had no depth to them. The only redeemable factor apart from the decor & good service was the sharing dessert platter we ordered which was actually really tasty. Won't be going back and won't be recommending.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ge372SNSBFGvwo0Uld2bA"
  },
  "fJyaIEuLGrgNMZof9fB0wA": {
    "date": "10/11/2017",
    "text": "We tried the £25 prix fixe menu. The food came out very quickly and there was quite a lot of it (we were stuffed!) but the food was a bit meh. The only other time I had Japanese-Peruvian fusion was Nobu (which I get is not a fair comparison) but that said, I'd opt for a normal Japanese restaurant over this. Nothing was horribly wrong but there were a few things that could have gone better. Shrimp tempura was more battered shrimp with no panko and oddly served with a mint sauce (huh?). This was just bizarre. And teriyaki chicken was served with rice but with a big drizzle of some lime vinaigrette. Again, bizarre and not very nice. The mango ice cream mochi ball was my favourite thing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "lt9Ge4Rtg9VzbuYoVvCF_Q": {
    "date": "5/25/2017",
    "text": "We got the sexy tasting menu when we came here on a special occasion last month. The restaurant is light and airy, with a very cool vibe. The food was similarly light, but perhaps that was because I had the veggie tasting menu. I thought it was exquisitely presented but would have liked a little more protein in the courses - as I did feel like I had 6 courses of salad, followed by dessert (which was my favourite - mochi mmm ;)I'd probably come back, but would order a la carte to feel like my tummy was more satisfied!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yw13c6M8oTo__HqpGIgWNw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Tasting menu: 1st of 8 courses!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yw13c6M8oTo__HqpGIgWNw/o.jpg"
      }
    ],
    "user_id": "qSQ0nB8GdTIl1c4B1GG8YA"
  },
  "FGulBQVWvLFIiNmUvTiWOg": {
    "date": "6/2/2017",
    "text": "Had a dinner here yesterday with one of my favorite people and we choose chiefs menu. General manager came over and introduced us to the chief who explained us course by course. It was loud and I did not hear 70% of it. Courses started arriving one after one - the portion size was not appropriate for the tasting menu and number of dishes served. After the 3rd course we were done but still had 6 more to go. They couldn't time it right - we ended up with not a tasting course but rather Indonesian rice table - all the dishes on the table for us to eat. There was not much creativity on the texture play.If someone would invite me here again I will come, but will stick to one dish and avoid £70 per person tag, as it's just not done up to my standards.We ended up paying £250 for two of us including sake",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "irkLTpGy-NJjJDgkqZXC4A"
  },
  "NWJyvWaI3GgoiDd2bY6o5A": {
    "date": "4/1/2018",
    "text": "Japanese-Peruvian fusion restaurant with a cool/trendy vibe (good date spot). The ground floor has more of a bar scene, whereas upstairs is a little quieter and more restaurant-y. Both floors have really cool mural art as a focal point. We had the paper-thin vegetables (nice and lemony), ebi harumaki (shrimp spring roll, bit on the oily side), nasu miso (sweet miso aubergine), salmon teriyaki (tiny bit overcooked) and octopus with purple potato (tender and garnished well). I recommend the chotto matte desert platter, which is large and has a varied assortment of deserts (£7.5 per person). Service is a little slow at times, but the ambience and overall experience does not disappoint.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0jWngZTojEzKLC8hq3focw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0jWngZTojEzKLC8hq3focw/o.jpg"
      },
      {
        "img_id": "dX5nlnmcLlmypLGf8FkwOQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dX5nlnmcLlmypLGf8FkwOQ/o.jpg"
      },
      {
        "img_id": "9Dn6E0Fnl6xtrjtawDXILQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Dn6E0Fnl6xtrjtawDXILQ/o.jpg"
      }
    ],
    "user_id": "YSCnvGFmBqce1vJ7ipY0HA"
  },
  "8rmO3IIe-wK_F_PqqBD9lA": {
    "date": "1/22/2018",
    "text": "My boyfriend and I came to London for vacation, and our mutual friend that lives in London brought us here for dinner. I was intrigued by the idea of Japanese/Peruvian fusion food. We had a reservation, so when we arrived, we were seated right away even though everyone in the party was not present. After everyone had arrived, we decided to order one of the pre-fixed menus that were available. I believe it was about 60 pounds per person, which I find is more on the expensive side. The food was pretty good for what it was, but not amazing from what I remember. Everyone else in the restaurant, who I assumed were locals from the area seemed so bougie and upscale, so I felt slightly underdressed at the time. My dinner experience as a whole here was a nice one, but I probably wouldn't come back as for the price didn't justify the food in my opinion.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPCGRmvI8H8EoaexOMJ6Og"
  },
  "BOIgGapxlIoE0HxKE9IgmQ": {
    "date": "2/16/2018",
    "text": "One of my favorite meals in London ! Super great vibe, fresh sushi, and delicious cocktails. Sooo tasty !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NsILCas-Ah7DtcYACjvAVA"
  },
  "UnpCbndmoxlyCoEwC4Fndg": {
    "date": "8/13/2017",
    "text": "We had an absolutely wonderful evening at Harry Potter which was ruined by our experience at Chotto Matte. The only reason I have given the restaurant a star is because the food is good. I can't fault the chefs.. kudos. The service however was a disaster! Right from the pretentious hostess to the servers, which made the entire evening including the food unpalatable. Yours is a service industry please do not forget that. You were rude and obnoxious and did not deserve the tip that was included in my bill.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TG-E3GOMq2FoEoVJuVnwxw"
  },
  "Dd53LLDNPJoacZYYdYlGLQ": {
    "date": "8/1/2016",
    "text": "Looks better than the taste,  We got two different set meals, one for each person.  Al the dishes came was a nice presentation.  Most dishes tasted reasonable, but none are remarkable.  Dessert was definitely not the strong point.  Again, good presentation but not so great in quality or substance.Vibe, decor, service were all engaging and appropriately modern and trendy for a soho restaurant.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hqphsMI6mJ2R8gtyrW6R8A",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Desserts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hqphsMI6mJ2R8gtyrW6R8A/o.jpg"
      }
    ],
    "user_id": "LRTC_Gl63vsOjnhJtPyZXQ"
  },
  "blbuiFCiBxHYDn4Mk9O2rw": {
    "date": "1/17/2016",
    "text": "Very trendy and popular eatery in Soho Cotto Matte is more about style over substance. Walking in on a Friday night the restaurant was buzzing, the bar a choice hangout for cocktails. From the clientele to the very styled mood lighting and slick modern decor it felt almost a bit more South Beach than Soho. Then I was hit with a bit of attitude from the hostess at the reception. Completely unnecessary as we had a booking, but none the less this was the greeting. Then I had to deal with a 5 minute queue to check my coat in like I was at a club, all this before I had even had my first cocktial. Add to that snooty clientele in designer fakes who were just being generally rude and obnoxious and it just didn't feel like the best place to be.Soldiering on, having finally checked my coat I then went back to the hostess desk who told me to go upstairs to check in with the next hostess.. and finally I was seated. The waitstaff was pretty good, and thankfully no attitude there, though they did forget a couple of drink orders -twice-  and the last dish on our order took ages to appear, but it was Friday night and quite busy. Since we shared all dishes within our group, the waitstaff did time and space out delivery of the several dishes we ordered properly, though there was not much room on our table even that way. Seating is quite tight. The Japanese-Peruvian infusion cuisine was more Asian inspired than Peruvian, but what was good, was tasty, while other dishes were just so-so. The challenge is that it is very hit or miss to find what was good. The sushi rolls were probably the best choices on the menu, the ceviches were ok (you can find better next door at Ceviche), so really the best of the menu would be the Japanese dishes. Overall I was left a bit cold by my experience but it did not completely dislike it either. Some of the food was very enjoyable and thankfully the night did get better. I would consider trying it at another time perhaps not on a weekend. But if you like being part of the trendy party scene then go on the weekend as this place is perfect for those types on the way to a big night out or having loud group gatherings after the workweek. For me it was all just a bit... meh.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PAFlpDtI9gwR8gyt1kB5jA"
  },
  "uWSQNDU-ONELOgFbLna52w": {
    "date": "9/14/2017",
    "text": "Chotto Matte is down the street from one of my surprise favorites - Ceviche.  With more of a Japanese than Peruvian influence, I found the sashimi yellowtail and the rotaba salmon fantastic.  I would definitely come back for those two.  I wanted to try more of the rotaba, but that'll be the next trip. I had some of the nigiri sushi with various dressings.  The flavor was good - sushi itself was just ok.  Service was good, though a little spotty.   If you're in the SoHo area, I'd definitely recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5X9-5vDT03_RhSD6irDtiQ"
  },
  "ZZbSLbJXNo3sZ6CjEp_7pA": {
    "date": "10/17/2017",
    "text": "This place is awful. Really cool atmosphere and food ok. Service was shocking. Rushed us over and over again to order even though place was empty. Reminded us we only had two hours several times - again - the place was empty. Server was rude - food came out randomly. For example - rice came out first - by itself. Manager then gave us a lecture on how the Japanese do it. Long story short - this place try's way to hard to be high end. There's nothing high end about it. They need to chill out! Wouldn't return or recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FE1TfJLk70dbwRrHoy9S_w"
  },
  "LO40LMVnUS_2YDWlTdnGFg": {
    "date": "10/14/2014",
    "text": "This restaurant changed my life. The whole ethos of the restaurant's sharing concept was beautifully explained to us by our waiter who equated sharing food or sharing a meal as an expression of love. Overall, the food was beautifully presented and a flavour to match. The Japanese and Peruvian flavours blended together perfectly. There were Japanese ingredients and dishes with Latin American spices and colours. The Seabass Ceviche was a beautiful blend of how both cultures prepared raw fish. The Scallop Tiradito, a delicious take on scallop sashimi- pairing it with a tangy Latin flavours of citrus  and sliced jalapeños for spice. For the main, the Tentaculos De Pulpo, the sweetness of the Japanese purple potato complemented the spiciness of the octopus. Fusion food is rarely done right, and this is hands down one of the few. My only regret is that I did not try everything.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Y4kmdOt78RxWV0OgCByfzw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Tuna tostaditas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y4kmdOt78RxWV0OgCByfzw/o.jpg"
      },
      {
        "img_id": "yWIHjlTfAmgnchk42veDmA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Guava Sorbet, passionfruit brulee and almond pyramids",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yWIHjlTfAmgnchk42veDmA/o.jpg"
      },
      {
        "img_id": "6nDS7MGH8CC7uvTeoC0wnA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Ebi Harumaki Ponzu Salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6nDS7MGH8CC7uvTeoC0wnA/o.jpg"
      }
    ],
    "user_id": "q4aPN-ojewCsG6umCMUBJQ"
  },
  "xzkQsbCoRXobXjYlKanMYw": {
    "date": "9/18/2016",
    "text": "Make a reservation, place was packed. Found the prices very high for the portions. Stay away from their tostatidos, I think was the least valued item on the menu. If you are still going to get it, no it's pre cut into four depending on your party size.Also don't bother with the sashimi or nigiri options, way overpriced.What we tried that was good: grilled salmon, sea bass, corn, octopus, soft shell crab roll, rolls were overall good, grilled beef was super tenderWhat we tried you can pass on: yuca, dumplings, edamame, peppers",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i1y_-2QqluZx_bGJUGtiQg"
  },
  "hLSS7XwjQem7ocOd-l8qbQ": {
    "date": "1/3/2017",
    "text": "Fabulous restaurant with great food and even better vibes. We loved the nikkei cuisine and style of sharing plates. The menu recommends 4-5 plates per person but we found 5 plates to be perfect between 3 people. Plating could be better but was nice for a casual dining experience. Good service and would recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DWCn9S_j0pKaguZbygGydg",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. chef's special wild shrimp and asparagus tempura with a truffle dipping sauce and cut roll spicy tuna sushi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DWCn9S_j0pKaguZbygGydg/o.jpg"
      },
      {
        "img_id": "mKUlfr45isN1G_67v2QuWQ",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. salmon teriyaki",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mKUlfr45isN1G_67v2QuWQ/o.jpg"
      },
      {
        "img_id": "2BI7oAl48aMtVAGyc1XNbg",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. amazing nikkei sashimi appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2BI7oAl48aMtVAGyc1XNbg/o.jpg"
      }
    ],
    "user_id": "OUgCBmOl71UdF5VxgaEmfA"
  },
  "GS4b0zzQbkpk-8e4FkzquQ": {
    "date": "6/23/2015",
    "text": "The food here was very good.  I probably won't be back here, but I was quite impressed by their seabass ceviche(10.95 pounds) and their Sato Maki Roll, which was seabass, salmon, romano peppers, and lime soy (13.25 pounds).  I highly recommend these dishes. I wasn't too hungry, so I stuck with these two.  The service here is only ok.  A bit sparse, I'd say.  And finding the bathrooms was like a labyrith of stairs and different floors.  What you should be forewarned about are the cards they give you to download some app called Velocity, which would give you 10 pounds off your bill.  It sounds like it would be a good deal, but this app REALLY sucks.  It's slow, buggy, and super slow.  Yes, that slow.  Just pay the 10 pounds extra and be on your way.  Otherwise you'll be spending 30 minutes trying to download the app, figure it out, go around the bugs, and split your bill.  While that experience was awful, the food here was not.",
    "rating": 4.0,
    "rated": {
      "useful": 11,
      "funny": 7,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "pYM1KBkK7I3-KSNSfXQBHw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Sato maki roll 13.25 pounds",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pYM1KBkK7I3-KSNSfXQBHw/o.jpg"
      },
      {
        "img_id": "QbY2sUp0Y03mqHJrxiX2tw",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Seabass ceviche",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QbY2sUp0Y03mqHJrxiX2tw/o.jpg"
      }
    ],
    "user_id": "rBBQbHErcvNH916VHw0gZA"
  },
  "6Jgyai5FnLETS4-LQhap3Q": {
    "date": "7/14/2017",
    "text": "Really amazing food. Lots of different flavors mixed to perfection. Everything tasted fresh and yummy. The service was on point as well. Overall an excellent experience!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99-2ANFxhSSv1l5nP5cVCg"
  },
  "kX9xm4hgAwTlPUu0y-5tCA": {
    "date": "10/1/2015",
    "text": "My team and I (6 of us) went for the £20 Bento Lunch. This is by far the best value in the city for such high quality food.  And don't worry - you won't leave hungry.  I struggled to finish mine and ended up giving a way a few bits (much to their delight). The dishes we so sumptuous and delicious. I don't eat chicken and they were very kind to provide me with a sub. The tastes of each box was different yet suited the story perfectly. Lots of intriguing flavors that I have never tried together. Peruvian Sea Bass ceviche? More more more! Service was attentive and the atmosphere is modern & fun with street art on the walls. Covered all the senses. We collectively cannot wait to go back and try more. FAB! Whether you are a Londoner or visitor, this is a must do.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4fB3Pl0Ypy6SI7EMX1AzrA",
        "caption": "Photo of Chotto Matte - Soho, London, United Kingdom. Bento Box (Lunch)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4fB3Pl0Ypy6SI7EMX1AzrA/o.jpg"
      }
    ],
    "user_id": "pdr6U7qSa9jIivVy_glF-w"
  }
}