{
  "EigAFj0S6QXWnN4RAnxekw": {
    "date": "1/11/2015",
    "text": "We ordered pizza, it was very good.. Service is a bit slow.. They dont look at you, so you have to keep waiving like an idiot for them to come or simply you have to go to them.. But the food is good :)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWUJUJFMWo-EPOCeq7ZW0A"
  },
  "mw8tzGFvIKRKvGvNdhOtBQ": {
    "date": "10/27/2011",
    "text": "Lively atmosphere, crammed full of diners, even though it was late wednesday night. Restaurant is much bigger than it appears on the outside.Wait for a table was shortened after a bit of italian chit chat.Quality ingredients, executed badly. Finished with a tasty glass of mirto.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "se2Ba3ekEPxpMLt-WlbFgA": {
    "date": "1/28/2013",
    "text": "Very good authentic Italian restaurant. Part of a small chain in Milan, which is known for good pizzas. The service is excellent, the maitre D Marcello is very good and very caring, kept on asking how things were. The food:'the pizzas are very good, very typical Italian with real fresh mozzarella Bufala, the trenette were very good, even for our Italina guests. The antipasto misto Italian style was excellent. The cannoli at the end for dessert were very fresh and excellent. All in all recommended by Italians from Milano.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tLOPe0I6x2Z3Yhc564pvQ"
  },
  "XizwJaB_k1EN2wF2N2f_7g": {
    "date": "8/1/2010",
    "text": "I went to La Bufala a few months ago, I must keep this place on my radar as it's been the best pizza I had in London and the quality of the ingredients is unbeatable. La Bufala is a chain in Italy with a great reputation.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gjmockeBOTpPmZBrrnATCQ": {
    "date": "10/10/2015",
    "text": "If I could give this place a zero for service I would!   I came into the bar area with 2 friends for after dinner drinks around 11pm.  The two guys behind the bar (see my picture of the two) did not greet us or ask us if we wanted anything for at least 10 minutes.  When one did finally take our order he was rude and snotty and rolled his eyes if I asked if he had a sweet wine.   I would not recommend this place just for the lack of service and rudeness received by those working the front downstairs bar!",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vAMn818yyDKBlm0AC9Ghtg",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom. The two rude bar backs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vAMn818yyDKBlm0AC9Ghtg/o.jpg"
      }
    ],
    "user_id": "FZWFzfm6czT6Tygg7tbtdg"
  },
  "Q9ObdsAp7wjTugN6hwpRcw": {
    "date": "7/22/2014",
    "text": "I've experienced better. This place felt very touristy, the service could have cared less about us being there, and the food was bland.Although I did like my buffalo mozzarella salad, and it was a great portion size, overall the food WAS just....bland. Would not go again, would not recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMRucNvjaoSrvo6Jo5yjhA"
  },
  "Ak7yjMnhM1bIEFmE_Q_LaA": {
    "date": "7/31/2015",
    "text": "I cannot give an excellent rating to any restaurant that provides poor service. We were seated promptly but realized when greeted by waiter that he spoke almost zero English. My wife ordered a pizza and I ordered the meatballs with mashed potatoes. After a few minutes he returned to inform me they were out of meatballs. I waited a few minutes for him to return to take my second order if lasagna. When the food arrived my wife's came and I watched her eat while I waited several more minutes for my food to arrive. I later ordered a second glass of wine which he forgot. The food was about 3 stars. The service was 1 star, thus the 2 star rating.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyCLgaqwFZj-oPOmV6zWCw"
  },
  "n1rAxLzWkHGtLGwv65v98A": {
    "date": "6/25/2016",
    "text": "I came here after the Pride Parade and it wasn't too busy. However, the staff were very rude and impatient and we had to explain to our waitress three times how we were going to pay the bill. The pizza was more like bread topped with soup and floating mozzarella, not to mention overpriced. The bathroom was not pleasant, either. We did not have a good experience here.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4JuByAp5HX5Smk8sR2dVVw"
  },
  "LMVnbJgISVgw0FLro1zeqg": {
    "date": "4/27/2016",
    "text": "Awesome super fresh food! And my Caesar salad was literally half the size of our table! Fabulously tasty meal!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GEIwzR71at2ZBn4kJtDOcA"
  },
  "bz9dZcCavSZ9aowS8NaEMA": {
    "date": "8/11/2014",
    "text": "Boring.Really boring.Damn, why are we Italian that stupid?! I mean, I know I'll never get what I want going to a touristic chain in Leicester Square, and still at 6 PM of a Sunday we end up here, in Leicester Square, with a reservation for a pizza in one of the most notorius italian pizza chains in the world. Sometimes I hate myself.Anyway, we went here early for an aperitivo, which was surprisingly better than expected (would deserve a 3 stars), a not-that-bad spritz and negroni (a bit small on the dose but.... the taste was better than expected), and dishes were good, not THAT good but at least not disappointing. The problem here is the restaurant itself, buffalo mozzarella is dry (damn, you offer a mozzarella and bla bla bla and you serve it dry, what's your problem?!), prosciutto was really bad cut (I can cut better with a knife, without even using a slicer), pizza is super salty and gummy, desserts seems a lot nicer than what they actually are.That's it, I don't like to speak about this place, it's just what it is: a super touristic place with average service, less-than-average food and inflated price. Not that bad, but definitely not a place anybody should eat. Avoid this place pleasePS: obviously the place was filled with italian tourists. Damn people, just try something else at least when you are abroad!",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "H8BzKdlqFAUOARGnpml6SA"
  },
  "OwlUe9sI2WOo8XJuXxq4Tw": {
    "date": "2/11/2016",
    "text": "Loved the risotto pescatore. Had a good red wine - Nero d'Avola. Across from our theatre - with plenty of time as the service was quick and responsive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5cIct_4Lcyj2BQ6FmMeeBQ"
  },
  "eumn-Gui8UVb5LGNQSs0iw": {
    "date": "6/9/2015",
    "text": "We were recommended this place by an Italian acquaintance who swore the pizzas were just like in Italy. We went there and it really didn't look like a place that serves pizzas so fantastic - it looks a little bit like a tourist trap and we wouldn't have tried it had our friends not recommended it. We got a table that wasn't all that great and our pizza arrived before our drinks (5-10 minutes after ordering) but OH MY LAWD the pizza was good! One of the best I've ever had, with tomato sauce, fresh buffalo mozzarella, basil and cherry tomatoes on top. It was perhaps a bit expensive for a pizza but once you've tried one you'll see that it's worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ovgOzcEtJpaGnsAIpekejg"
  },
  "PhFwx1CjH_ILkyWagmHv3w": {
    "date": "1/30/2014",
    "text": "The worst food and rudest staff I've ever seen .Ordered 2 main courses and second one was ready after 15 minutes and so cold .Hate it .Horrible",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ngFnK41CktSWn4kiHEBdQ"
  },
  "d8yoD3HKzWj6IqgM1t6PGw": {
    "date": "8/19/2015",
    "text": "Mediocre food, bad service. I would not recommend this place to tourists - there are a ton of better Italian restaurants in London that you should try before this place. The only positive aspect is that it's close and convenient to some of the theaters. Not worth it...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "THMp4w17JfOoNXCXrgR4rA"
  },
  "nTaaoUdv7mOGfo7Klb4nQA": {
    "date": "6/21/2012",
    "text": "Came here late at night. Got their cheesecake, which was quite yummy. It was served over a flat stone, rather than a plate. It was a smaller restaurant on one side, with a round bar, and a bigger seating area around behind it. Presentation seems to be big here, and it did impress! Will have to return for a proper meal!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cgHaP3OZIcZLzB8fds1CyQ",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom. Desserts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cgHaP3OZIcZLzB8fds1CyQ/o.jpg"
      }
    ],
    "user_id": "rO7V3lpQ-8NegHWbWcxbag"
  },
  "CcO77MssL_xRLnJTUUq0Rw": {
    "date": "10/15/2014",
    "text": "Ate here in April with a large group of friends just before the Pasha & Katya West end show and I really enjoyed the food. I had a Calzone and it was really big and tasty. The cheese was delicious and it was packed with meat.Service was prompt and polite. Our meals all came at the same time so we could eat and enjoy each others company. Our table forgot to tell the waiter that we needed seperate bills but he was really nice and able to split it after on out different methods of payment. Overall a memorable time on my trip!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_soNJR2wGGsj9LPQb0heQ"
  },
  "MftKzolHIYR4G5-51vmfkA": {
    "date": "5/15/2013",
    "text": "I was told by an italian mate that the food there was good so I tried a pizza to compare to Sartori and they are really not in the same league. The pizza was really average, not bad but not super tasty. In addition, the pictures in the menu looked were mouthwatering but what came wasn't at all the same.The place looked very touristy too. I would never have been there if it wasn't recommended given how close to Picadily Circus it is and how tourist-friendly it looks.If you are looking for good Italian food and are in this area, you should go a few block south and have something at Sartori. It is worth the walk.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQyGxGvJufzJ6QIwSUQxdQ"
  },
  "L6cUP_PuIN0cABr_XzpeEw": {
    "date": "10/22/2014",
    "text": "We where on our way to china town for a Chinese. Out side this place they where giving away free slices of pizza, she even offered us more than one slice. As soon as we eat the slice the plans changed and in we went.We where seated strait away and promptly offered drinks. The service continued to be this good and I cannot complain. The food was one of the better pizzas I have had in London at a reasonable price. I will be returning to see if it continues to live up to expectations.The only criticism I have was the absolutely terrible music being played in the background.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yx8tlJIpy4ouQ-H_yFqifg"
  },
  "GC8hXR9vGFsSuKyaqigO_A": {
    "date": "8/20/2015",
    "text": "Super friendly staff and service very good. The mozzarella is bloody fantastic - full stop. The food is bloody good and I repeat the staff very friendly. A special call out to Naresh and Yolanda. Must visit for every tourist and Londoner",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mTI6Lr0lDZ5VW4Xu7TPsQ"
  },
  "b555dhPluFXFENZ7QpB_-g": {
    "date": "2/21/2016",
    "text": "We called at 7 p.m. To book a table for 14 at 8 p.m. Maybe there was some confusion, but when we got there there wasn't a table ready for us, diverted to the \"bar\" we tried to order 4 \"Spritz\" misunderstood to mean a table for 4, go to the restaurant, no we want 4 Spritz, oh ok, sorry and @ £6.50 they aren't cheap. Watching the bar person prepare the drinks I realise we're not getting the full measure. They taste good, and the remaining 8 of us eventually get a spritz. After two more attempts to get a table the 14 of us are given the seats next to the toilet door. Ok they are busy, but this is going to be a £300 + bill. The waiter is attentive and good, but doesn't want to let us have separate starters and insists that we have a mixed plate of meats and veg. The anti-pasti we get are good, but for 10 people not 14. We all get the chance to order our own main course, we all opt for the pizza. These range in price from £10 - £20. Very genuine pizza tasty and although only tepid were exactly what we ordered. Ordering a beer was a task they kept forgetting, only on the third time of asking did the order get entered on the till. The bill arrives we note that there's £50 worth of tip. Split by 14 it's £27.33, the waiter tries to make it £28. So now there's bad feeling because we've told him no. We already spent £78 on the spritz. Moral of the story is to go elsewhere, it's a tourist trap, on the corner of a busy main road in Soho, lots of people, chaotic ordering, but the food is tasty.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jvVi-xBpQCAdHPsi-e5A4w"
  },
  "cqiwMlKGKamjQj1UUO3KoQ": {
    "date": "12/28/2015",
    "text": "Horrible service! The waiters do not acknowledge you and hardly  speak English. They look at you from across the room as if you're crazy. You have to wave them down for orders, for the check, for them to come to your table to charge the card, etc. after all is said and done with gratuity automatically included, they won't even say \"thank you\" or bye. They take their receipt and leave and go back to standing like a statue in a corner and laughing while looking at customers, so obvious that they're talking about them. It's a VERY hectic atmosphere which is fine, but not when the entire staff except the 2 men behind the counter making the food are rude and seem disgusted by the customers.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IjYaDTeV8FVYw2MSD-N6lA"
  },
  "lZC8EDPVE2igPTfc-2vPNw": {
    "date": "4/11/2015",
    "text": "Unlike the other reviews, I thought that service was great & the servers were attentive to think that it was a busy Friday night. The pizzas was ok (nothing special) but the desserts were awesome! I would give this place 4 stars :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8t4nnItV0Fl5rH6lpD87g"
  },
  "EkVkwrHTOrM5gHTaNLlXvQ": {
    "date": "9/20/2014",
    "text": "Great service, pizza was made in a wildfire oven. We gave specifics on how we wanted our pizza done, and they listened. Will deff be returning!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "snzzll9CxG4HmYYYwT3nfw"
  },
  "S1MANfWcG6QEoX4UPNvcGA": {
    "date": "3/16/2014",
    "text": "Stopped here for lunch after seeing the oven. Reviews weren't very encouraging but we were pleasantly surprised.  Had the grilled vegetables with smoked mozarella; great portion, tons of cheese. Also had the margherita DOP pizza with buffalo mozarella (instead of the standard cheese) which was very good. Authentic neapolitan pizza with quality ingredients. We enjoyed ourselves.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eeb5EpGatGPMofV0Tp1hKw"
  },
  "Pk-GTLLAdFW6wDGFgCmUoQ": {
    "date": "10/18/2018",
    "text": "Very good crust. Salad was tasty with not much dressing. Beer and wine selection is limited and service was a little off. All in all a good experience. Ask for salt and pepper to season to taste if you like.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4WK1BAEwoYdbqrEGeuOWg"
  },
  "Vcu5S9PSnHoVee_iyQ6zpw": {
    "date": "11/6/2018",
    "text": "Food was great. Staff was ok. I was told by the host that I could wait at the bar for my table to be ready. My bf and I just left the theatre to celebrate my last night in London. We went to see Motown. So amazing! Anyways, while we were sat at the bar the y'all guy with the glasses who attends the bar was beyond rude. He told us contradicting information. The host said we could wait at the bar, but once at the bar the guy with the glasses insists that we cannot be there unless we order at the bar. I under where he is coming from but we were told by another team member that it was ok. He had the nastiest attitude and it just contributed to the eventing going poorly. Once seated at our table at the back of the restaurant in a crowed area at a shit table I had to basically crawl into our booth seat and ripped by tights on the corner of the table and cut my leg. How the hell is a table end that sharp!?! Needless to say the night went from amazing to wow i wish I had just went home after the theatre. The waitress also had an attitude after the bar altercation got leaked to the rest of the staff. She kept clicking her pen waiting for me to order instead of asking if I needed more time. I've worked in the food industry for over 5 years and thank God I no longer do. It's not a for life thing. If you aren't going to be hospitable, change your profession!! Just a horrible way to leave London. Thanks for the experience...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccl28FOIKRU5oZHrrYcTfg"
  },
  "TY8Wj8YRt9H4kMwUQQhd4g": {
    "date": "5/4/2018",
    "text": "I was traveling for first time in London with my family and as soon as we saw this place we new it was the go to :) I tried the calzone and was absolutely delicious, we had a great time",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q5g0b-srWWcwPNfu9DjtOw",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q5g0b-srWWcwPNfu9DjtOw/o.jpg"
      }
    ],
    "user_id": "MTgpe468N4KoKdBXsxZkMA"
  },
  "_YZFPFH0ocY-b3bD-3IcSw": {
    "date": "6/6/2018",
    "text": "Had a great late night white Pizza. We got in at 23:26, four minutes before closing, very hungry after a concert, and received a great service.Pizza was just great in it's taste, we will be happy to enjoy that great taste again on our next trip to London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9n_fm3XjsUOILC-mZTeB2Q"
  },
  "mH_Wi3nqqhTPQwCzooOgmQ": {
    "date": "7/24/2018",
    "text": "We had the lasagna and gnocchi, and both were fantastic. I requested a sauce change for the gnocchi, to the cheese and pepper sauce with a little pesto, and it was delicious. Giving this restaurant 3 stars because the service was terrible. Had to ask for water several times, and our waitress kept whisking past us.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8by8Q_cBOo8uU4YpyD83Q"
  },
  "lt_XmD5fVytVfP92s4Nr-w": {
    "date": "3/31/2017",
    "text": "Great pizza! We stopped in unplanned and we were pleasantly surprised at everything.  The food, the atmosphere, the service... They all were excellent!This place will definitely be revisited often.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eBqvcJ16tJudkQ8YVBgDMg",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eBqvcJ16tJudkQ8YVBgDMg/o.jpg"
      },
      {
        "img_id": "yPC8yK2zUDFQAgtNdf5bbQ",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yPC8yK2zUDFQAgtNdf5bbQ/o.jpg"
      },
      {
        "img_id": "Ilewm8cJZihsXVAjidtPVQ",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ilewm8cJZihsXVAjidtPVQ/o.jpg"
      }
    ],
    "user_id": "mCATE-1BwJswoIzWgcQApA"
  },
  "pn_U40HFKBXXmqwYDTp5gw": {
    "date": "12/3/2016",
    "text": "I found myself in this busy little area between Soho and Chinatown, right in the middle of London. It was my first time ever in London and I was craving Italian food.  I stumbled across this place as I roamed the streets looking for an Italian restaurant that was still open at 22:22. Being the yelper that I am, I of course had to take a peak at their Yelp reviews. They were not bad and the photos of the food looked good, that't what I always go to. Photos of food make my mouth water. As I walked in I was quickly greeted and sat down at a table right away. The menu was pretty extensive with many options. There was a good sized wine selection with very detailed  descriptions of each wine. There was a cool outside bar area that was partially open to the street and a good place for people watching. I decided to sit inside since it was a bit cold out and I wanted to sit in warmth and enjoy a glass of wine.I am a sucker for the lasagna, always have been, so of course I ordered that. I am not sure what I was expecting. I guess I thought since London was a lot closer to Italy than Texas the food would be that much better. Umm, I am going to say no. The meat lasagna was't bad. It had a good flavor, it just wasn't anything memorable. I would eat here again and try something else as there were many great dishes I would have loved to try also.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-G4u9Sii67dooDt8W1robw",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-G4u9Sii67dooDt8W1robw/o.jpg"
      }
    ],
    "user_id": "7abqnGe1hieTgH4Tft3-8g"
  },
  "hKardbhJ3fkE6M3gL_Bkfw": {
    "date": "9/9/2016",
    "text": "Ok ok, when Marco said that we were heading to one of the best Italian restaurants in the city that was on Shaftesbury Avenue I thought he was going mad.We arrived and he wasn't wrong, slap bang in the middle of busy central London lives this restaurant - bright and double floored. Obviously my instant reaction was \"this is clearly a tourist trap, it can't be good\" but soon was I yet again to learn that you should never judge a book by its cover. We were taken upstairs and provided with a table. The wine began to flow (Marco's choice - it's was a lovely dry white) and we ordered. I couldn't see just Arancini balls on the menu so asked if this was possible - the waiter headed to check the till and returns stating, of course, they'll £1.50 a ball - I'm in.Paula and I also ordered a pizza to share - toppings included ham, mushroom, artichoke and their famous buffalo mozzarella! The food arrived quickly. First the Arancini balls - they were ok but not everything I wanted them to be, lacking in some flavour and that real bite.The pizza however was wonderful. I loved that they cut it in half and put it on two plates knowing we were sharing! I loved the doughiness of the crust and I loved the toppings! Thumbs up.And to top it all off we were greeted by the owner who bought us a round of drinks - lovely man! So who knew, good quality, authentic Italian slap bang in the middle of the tourist trap!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "8DLsQWVQ2p3KMjIhYkOuMg",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom. Bufala!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8DLsQWVQ2p3KMjIhYkOuMg/o.jpg"
      },
      {
        "img_id": "J9e2h5FpJM17fhVjsDtYCw",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom. Friendly chef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J9e2h5FpJM17fhVjsDtYCw/o.jpg"
      },
      {
        "img_id": "MZQUmk4dgx3yqKSfS7rF2w",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom. Italian produce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MZQUmk4dgx3yqKSfS7rF2w/o.jpg"
      }
    ],
    "user_id": "Ry0REo4iHIAdZv42csbxWQ"
  },
  "HPWUHpftfpQr9ZHy4Iaekg": {
    "date": "8/13/2015",
    "text": "I went here with a friend on a Wednesday night.After a performance across the road, we headed into this place as we were hungry indeed!We got seated relatively quick enough at a table in the corner by the window.  We ordered our food, which was taken rather haphazardly by the waiter.  It all seemed a bit disjointed and scatty.We got our drinks quite quickly.Food was served and it didn't look anything special but actually tasted quite good and fresh.The prices for theatre land were good, and although the service was all over the place, you were not left on your own when you wanted something.I didn't set the world on fire, nor does it really need to.  For somewhere to go, with decent enough food, for not ripping you off, this is perfectly acceptable.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bsSCmYRY_trZGaBDnRTRUA",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bsSCmYRY_trZGaBDnRTRUA/o.jpg"
      },
      {
        "img_id": "lSvHYnR31H2rQA1wW3Y3Xw",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lSvHYnR31H2rQA1wW3Y3Xw/o.jpg"
      }
    ],
    "user_id": "tEtGghKHbFs8acm9SIyXUg"
  },
  "KZtnf6w0R3UXkh2aKNB6wA": {
    "date": "12/4/2017",
    "text": "We went to a play across the street and noticed this restaurant as we passed by.  The pizza looked great from the window.  So, after the play we went for a late dinner.  The man who seated us, and who doubled as our waiter, was not very pleasant.  At one point, he had a bit of a meltdown as I mentioned to the man making the pizzas that I'd like mine without added oil.  The waiter was nowhere to be found and I didn't want the pizza to go in and have it be too late.  Between that meltdown and ignoring us for long periods at a time, I cannot recommend the service.  Additionally, he got into it with some people who came in and seated themselves at one of several empty tables after waiting at the door for several minutes.  They were so unhappy they left.  Regarding the food.  I disliked the pizza.  It looked crispy but was limp and doughy.  The sauce was good but the crust was not.  My partner had the risotto.  He thought it was decent.  The cheesecake again looked great but was like a sweet whipped cream pie that I did not like.  I would not eat here again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EABpKAiCT9yalEM05GuxQ"
  },
  "cw4P5sAteTnpr2RSHFYjzA": {
    "date": "11/25/2017",
    "text": "Great location, food can be decent, but really bad service.  Food did come out fast but drinks and wine were about 15 later than food. Why order wine if it comes after your meal? Also, on this night the grill was not working so there were no meat options. They should have shared that before sitting people at tables.  Lots of better options around. Go elsewhere.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qEk0NGaXEUmTNiUvuowBhA"
  },
  "BSJkBsXPUb79Eja4rW-2ow": {
    "date": "9/17/2017",
    "text": "Visited London and came here for dinner. My friends and me were roaming around Chinatown and decided to have some Italian food for dinner. The food was good, decent choices of drinks but slow service with confused waiter. I was given two different answers for a question I had about a dish. The waiter who was serving us did not know what I asked him (may be new hire). Keeping that aside, good food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WOLshj6xJnHAJ-9W-Y2BOg"
  },
  "XyBM_lYY_GvGNEidCOpyFw": {
    "date": "8/29/2017",
    "text": "They closed a hour early before the closing time . Very rude , and horrible customer service . We flew in all the way from the U.s.a",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLhwLKAkA8uMvvM1e8iJyA"
  },
  "YyniPPeVYWjoBq7DCCEaWw": {
    "date": "2/21/2018",
    "text": "Terrible service. It is turist tramp. The food is ok but no worth the price. Think there are better options around",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1O8HxJ0Yz6Z27kEoT5eCw"
  },
  "aesSKLAaThdTPuOLeZXyrA": {
    "date": "2/5/2017",
    "text": "I stopped here for a Spritz! It was great! ;) I didn't really eat anything but the food smelled delicious. Nice music and ambiance",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IN1WGGQrJxBIyZXR6OIRg"
  },
  "RbKGT5LR5gauhVOuJOp0nw": {
    "date": "3/18/2017",
    "text": "Aperol spritz was wonderful. Had the gnocchi, which was OK but not great. Wife had the meatballs with mashed potatoes, very tasty. Worst part was the table near the ladies toilet. I'd recommend stronger deodorizer.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KI7VT8gACSGXtk0zHh78Bw"
  },
  "3xeDDevsY5tXdk_m-L4Eow": {
    "date": "12/10/2016",
    "text": "Tasty and quality Food in a nice Ambiente. The price is also okay. But!The service is miserable and the restrooms are rubbish. Last time the restroom was cleaned up was 6h ago. We waited over 30min to get our starters.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e-Wz1Md7zzXMDWAjgm4dpA",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e-Wz1Md7zzXMDWAjgm4dpA/o.jpg"
      }
    ],
    "user_id": "YX0_HAkdMhUQNhaIPYptkg"
  },
  "9XCgPeUmXQIUXmUSdbgfvw": {
    "date": "4/24/2015",
    "text": "Wow did this place start out strong! In the middle of Piccadilly Circus and we walked in and got a table with little wait.  Buffalo Mozzarella, which was HUGE for sharing was fantastic, the pizza bread was fantastic.  The wine selection good.The pizza, we all got our own, 3 of them were well...initially good flavor but the center of the pizzas was wet and mushy.  The Diavola pizza had the right spice and heat flavor but was a puddle in the center of the pizza.Go there for the starter, cool atmosphere, leave before ordering a pizza.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MDa81iq3kec9VXchxVuGVw",
        "caption": "Photo of Fratelli La Bufala - London, United Kingdom. Big - HUGE - Bufala Mozzarella",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MDa81iq3kec9VXchxVuGVw/o.jpg"
      }
    ],
    "user_id": "yFOg7zFu58ouDr_6uy0_Wg"
  },
  "vzdhV1eclCmttenFgAh0Tg": {
    "date": "6/3/2016",
    "text": "Went here mid-afternoon on a weekday with someone who had visited before and enjoyed. The place wasn't overly busy, probably five or so tables in use downstairs and upstairs empty. Not much atmosphere but I would assume that it has more of a buzz in the evening. We were seated and had our orders taken promptly. The starter came swiftly - the Cuoppo Tradizionale - I don't eat dairy so I only had the barest of nibbles at this but along with my companion I found the items overly oily. Unfortunately most of it went to waste; some tourists sitting behind us having the same dish also left the majority behind.There was a longish wait for the main courses to arrive. I wasn't overly hungry and just needed a light bite, with a dearth of dairy free options on the menu I went for the Minestrone soup. It was nice but nothing special, also could have arrived at a warmer temperature.Overall service wasn't the friendliest. Pricing standard for a touristy area.Probably won't return as there are better  & more dependable Italian's in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TycaC_3EYFZ-0QoCoB8NiQ"
  },
  "K121dNA-NT5KIU8fJpsjOA": {
    "date": "3/9/2016",
    "text": "One of the best italian restaurants i have seen in London. When you go inside you can see the bar table and the food exposed inside, and you can see the quality of the food: amazing.The prices are a little high but the quality is equal to them.The choices in the menu are not soo many but they are the best of the italian cousine, i have ordered the focaccia with aglio e olio and the taste is superlative! It's a good choice with even the little mozzarella bocconcini if you want to break the hunger.The best part was the pizza with mozzarella and one day i have ordered with the bufalo one, and both were amazing! The taste is about the REAL pizza without too many tops, the basil and the mozzarella are fresh and the tomato souce is the best i ever taste here in London.The last but not least: the dessert with tiramisù and coffe: the first is the REAL tiramisù where you can taste the coffe, the chocolate, savoiardi and even the liquor, best quality and even your stomach feels well!If you want to take someone inside an italian restaurant, this must be the first choice!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ELP_eQckeus0-Krb8IJqtQ"
  }
}