{
  "ruB4WhCLDH6YyC34TdsPPA": {
    "date": "4/23/2009",
    "text": "We were able to get a lovely table in the courtyard on a very pleasant spring evening.  It was a very lively scene with many people outside enjoying the nice weather and the company of friends.  The food was enjoyable and the ambiance truly made Hush a memorable venue.  I would highly recommend Hush for anyone looking for a fun, romantic evening with outdoor seating, good food, and decent value.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "gwZEIB4Ntez8BlUwrSuOyA"
  },
  "DF4X8u7xI4xViBECzQxkMA": {
    "date": "12/5/2009",
    "text": "I was invited along to Hush for an Elements 8 sponsored \"rum do (london.blog.qype.com/200…) \" event. My first time at Hush, I was impressed with the location (down nookish Lancaster Court), the atmosphere (classy but relaxed) and the especially fabulous drinks. Hush has a competent bar staff and a brilliant molecular drinks menu. Among Hush's unusual mixes, their foam mojito is a sensational treat, as is their piña caviada (featuring tiny pearls of rum). Apparently, the sugar content of rum makes it the best booze for molecular cocktails. Fine by me  especially when it's super premium rum. And if you still think a cocktail ain't a cocktail unless served as a liquid, well, you'll be happy to know Hush still makes 'em a stiff one the old school way too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "lsgmmZtZtICWhZZWoZ1Yqw": {
    "date": "10/31/2012",
    "text": "I love Hush the deco the ambiance the food and the service",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gLVXm2AtDvj9pSAOiyd9BA": {
    "date": "4/24/2012",
    "text": "not too pretentious. reasonably priced drinks and great night for after work drinks.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8A1MY_nr_-l8bHHNPlShhA": {
    "date": "5/20/2009",
    "text": "Came here for cocktails late one evening. The first floor of Hush houses the cocktail bar and it is a nice, relaxed place. The menu is extensive but well thought out, with many different tastes catered for. I opted for the Honey Gin followed by the Black Forest Gateau martini. Both were interesting in their own way, although the former came with far too much ice which weakened the already delicate flavour. Overall, I couldn't really fault it, but would like to try a few more of the bars nearby before I consider returning.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rG_2Wi6CP2SgqcO7LJQIKg": {
    "date": "1/28/2008",
    "text": "I love this place. It's definitely a place to visit in the summer. It's on a tiny cobbled street just off Bond Street  the street is so tiny I only became aware of its existence summer 2007. It's this surreal little village looking street with beautiful cafes, restaurants and bars. It's like a little hidden secret and I'm so gutted I didn't know about this little spot before. You enter this court yard like area between a gap between two shops on Bond Street and as you continue to walk you discover all these little surprises. La Cave (French pronunciation) isn't actually a bar, but a 'wine boutique,' with two or three small round tables outside which allow for a seating area. Although the seating area is small and the cobbled street is somewhat narrow, in the evenings after work this place becomes completely filled with suited bodies, standing, sitting and lulling around drinking. A very friendly man served our drinks, he also worked in the boutique's sister restaurant which is also located in the little courtyard literally opposite La Cave. This place was introduced to my partner by a friend and he decided to take me and my friends. It was so unplanned, one minute I was shopping and the next minute I knew I was hazy on champagne. We spent the whole afternoon and evening there and managed to drink five bottles of Bollinger and a sixteen pound bottle of wine. This place may be selling it's alcohol at off licence prices, however this is no Threshers  the wine is pricy and high quality.Drinking in the sun during the day is not always the best concoction and by the end of the evening there was definitely some slurring and drink spillages, nevertheless this impromptu visit was more than a treat and we all had a great time.This place is 'Sex and the City' eat your heart out and I love it  One thing girls, be careful wearing heels on this downhill cobbled slope of a street. My partner was not impressed when I kicked my six inch heels off and shimmied down the stones barefoot!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9Ua0tAss2ohJM84IH_F4Ng": {
    "date": "10/12/2007",
    "text": "Hush was hard to find, but worth the touble. You wind your way down a cobbled Lancashire Court and find a lovely restaurant and bar, that has the added novelty of a terrace. It is open for breakfast, lunch and dinner and because the bar is upstairs, you can enjoy a romantic dinner without interruptions. There is a lovely ambience with candles lighting each table and a great selection of food at approximately £35 per person. You can get food in the dark and moody bar, surrounded by a hip business clientele. The only thing is, you have to look the part at this bar, as they have no troubles putting the pressure on those not suitably attired to hurry up and get out, no matter the amount they are spending on food or drinks. Hmm, image is everything they say!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5DXMS4NuAMY0zfnqti3JjA"
  },
  "92rBnwuP9Z4-muduiXzCLg": {
    "date": "1/29/2008",
    "text": "lovely little venue with a really good bar upstairs. classy, quite pricey but good food. good date venue and nice dark lighting!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LMJxHHRK-emR9kVZfpRpfQ": {
    "date": "6/10/2008",
    "text": "Beautiful setting but overall it was disappointing. food was ordinary; i wouldn't say over priced because of the area but defintately not justifiable. we were in the courtyard and pretty much forgotten about; not even offered bread! Some of the staff were running around while others seemed to be swanning about; we didn't stick around for dessert and i'm not in a hurry to go back.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "svB-0WCqqSbItE2AjDjGwA": {
    "date": "11/25/2012",
    "text": "Uniquely located in a cobble-stone street in Mayfair, Hush offers a great dining experience in the heart of London, a stone throw away from the nightclubs of the west end. The cocktails at the bar are simply fantastic and so is the team. Only challenge is the noisy dining room. A great address though.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Y_ftB0PWeq3TZsMdKsQuVA": {
    "date": "10/31/2012",
    "text": "Good place with nice food and really nice prices, great atmosphere, for a family reunion for example, nicE!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CmkCpbbZI5HSyq_QnxjqHg": {
    "date": "10/31/2012",
    "text": "I went there with some friends a week ago and we really liked it. The interior and the atmosphere are good. We enjoyed our stay a lot there. You can use the second floor for a private celebration and I think that we can have a family reunion there. The prices are normal, we decided together with my friends that we will go there again, for sure.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Z5xoNtORENWIWMK0nTLXmA": {
    "date": "9/2/2009",
    "text": "This is a great place for after work drinks. There are rooms you can hire out, as well as cozy rooms with 'bed' type things! Adornding the walls are pictures of the celebrities who have visited the place with their finger up to their lips (to represent 'hush', one can only presume!) - (Tom Jones, David Walliams etc!) although I've never seen any celebrities when I've been there! There is a restaurant downstairs and a bar upstairs. Downstairs you have the benefit of being able to use the terrace to eat (but you can't sit out there with your drinks which is a bit annoying!) All in all though, a sweet little place!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WTBOvWyYGMlYmZ49GcQXRQ": {
    "date": "7/7/2011",
    "text": "Beautiful place, nice outdoor seating. Great place to come with you girlfriends for brunch. However the food was okay. Ordered: Henrick's Hamburger. Not much flavor, you just dip your burger into ketcup. Aspine truffles w/parmesan and oil. It sounds good, but it's okay.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wS10oJExYmBlUNAXJt4Ztw"
  },
  "CEbqY7XR3v4PHoKa9BMsSQ": {
    "date": "6/18/2011",
    "text": "Here for lunch yesterday and I remembered I'd been before. The location is excellent and its easy to forget you are only just off Bond Street. I had tuna with ginger and soy salad, the tuna was basically raw which was perfect, I ate it in about 15 seconds. Rump of Lamb with beans and peas next, maybe if I was being harsh I'd say the lamb was overdone, but the sauce kept the meat moist enough and I wanted to lick my plate afterwards. We didn't have dessert. The service is perhaps a little snooty but I think that suits most of the clientele.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "r6Q3KLyzIbaozGWHhVAAQQ": {
    "date": "11/10/2008",
    "text": "In the classy part of the city -Mayfair-, split on three floors and with a very nice terrace, this stylish Brasserie offers grate food quality, a French and Italian wine list, relaxed atmosphere and an excellent service. The atmosphere inside is cool with  loud music as soundtrack of a romantic night out if your with someone special, but your going to be looked after if your by yourself aswell. If you have a date this one is the place for the first approach. Chatting up!. Surprisingly it is not thaat expensive for food and drink.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "h77Z1wpw3mNXj_ptfzGHCQ",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/h77Z1wpw3mNXj_ptfzGHCQ/o.jpg"
      }
    ],
    "user_id": "tYnxDawnD6tMVhU5-qcqTA"
  },
  "A4bXAKUL1iYNO9GAD28znw": {
    "date": "4/19/2011",
    "text": "Had a great night of making cocktails at their masterclass and drinking plenty of others. The strawberry and basil mojito is dang tasty on a hot (23C) day and the whisky sour is fab as well. The bartenders are quick and smart, and that's a plus. I'll definitely be back for dinner sometime because all the food that passed us looked tasty!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DaxD6-CEh08g9zMOpET9NQ": {
    "date": "1/23/2012",
    "text": "Great place, restaurant and bar under one roof, Hush is a place to chill, to chat and sample some wonderful cocktails, sophisticated yet not stuck up.definitely worth a second visit.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pqFKD0agcuYif1ZRxoBMfQ": {
    "date": "10/29/2011",
    "text": "On arriving we had high expectations. As the attractive terrace was full we walked upstairs for a table for drinks I assumed there would be table service as more than 4 waitresses hovered around the floor, it was only 5pm on a Saturday so not busy. After 10 minutes I approached the bar I must have waited 15 minutes for our drinks as our glasses ran dry the same experience repeated itself, waitresses walked by looking at empty glasses. The interaction that we did have was abrupt and unfriendly. We heard staff talk to other customers and it was the sameall very arrogant. The decor etc is a little dated now and menu over priced I geek this place needs to smarten up and improve it's service and move with the times or it won't compete at all. I'm strongly put off returning.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fvFIn1wUhqq3vk6Zf1e-yw": {
    "date": "5/31/2012",
    "text": "Hush was a recommendation from a colleague and a damn good one. We went for brunch the first time. Best Bloody Mary in London thus far. YUM! The burger is great and the truffle fries are so good you want to lick the dish when they're gone. The outdoor dining space is wonderful and they have heaters for cooler days. The area is completely covered with tents however you'll still enjoy that open air feeling. I've found the staff to be good and hospitable. I took a colleague there for lunch and had an amazing bowl of the pea soup with rarebit. I had no idea pea soup could be so good. They have a lovely selection of wines as well as a full bar. The inside dining space is nice however the carpets are looking just a bit tattered. The upstairs lounge areas are nice and there's space for a private dining experience as well. I wasn't very impressed by their bathroom... it didn't feel or smell clean. (Note: To some this is no big deal, after all it's a public toilet but I'm picky about where I pee... there I said it.) Anyway, you'll truly enjoy this place however it's a bit hidden so give yourself a little extra time when you plan to dine there. I've been three times and already have another reservation so clearly the mention above isn't a deterrence. Hush is a fantastic little escape with a delicious dining experience that you might just want to keep to yourself. Perhaps it's why they call it Hush? Over all this American Southerner in London gives them two thumbs up and says give 'em try, y'all.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HfVxnwV2tZuLq6wIpIKxaQ"
  },
  "2rkcARwfSBnNT0lh1uUY8g": {
    "date": "4/20/2011",
    "text": "Got invited to the Cocktail Masterclass there and what fun it was! Hush is a beautiful place, tucked away from the hustle of Bond Street shopping in a nice courtyard. Great on a gorgeous day if you can get a table outside. We were upstairs in a cosy alcove sampling some of the lovely cocktails and then it was behind the bar action on actually making our own! The staff were excellent considering it was actually relatively busy in the bar and Pedro took the time to explain to us the real history behind cocktails and just how they are made. Very knowledgeable! Def will have to come back to sample their food at some point. Thanks to Sarah for organizing this!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Mdxqh7_N-_ZF8g886kaDhQ": {
    "date": "4/20/2011",
    "text": "One of the best cocktail bars in London. We enjoyed some of the most delicious house cocktails and learnt how to make our own. I thought I was a good dirty martini maker but there were a few tricks I didn't know. Thanks to Pedro for his warm welcome and expert knowledge on cocktails. I shall definitely be going back!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "krkI1WjTglqT2Po8kqTtYg": {
    "date": "7/14/2011",
    "text": "For a more modern take on afternoon tea rituals try Hush whose peaceful courtyard and elegant dining room are a quick detour from Regent Street and New Bond Street. The decent selection of sandwiches and scones are ample to snack on while drinking the Hendrick's Gin-based cocktails. There are a couple of moleculars, a couple of infused martinis and a hot tea infusion for the brave. Try the Hendrick's Spring from the infused section, Hendrick's Gin infused with Lavender and Cucumber, garnished with a Lavender Flower. Once you've worked your way through the short but effective menu bring yourself round with a sugar-shot from a Bougie mini macaron and prepare for some frivolous shopping. Our advice, head straight to Sandro on South Molton Street, a pleasant 2 minutes wobble away.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UaHLr4MzKV3UyH-4ISPVcA": {
    "date": "2/10/2009",
    "text": "Tucked away in a gorgeous courtyard, Hush is a great little hideaway in the summer, but in the winter its interior dining is equally cosy and sophisticated. The menu shows a few hints of creativity (the bang bang chicken is great) but the prices are somewhat extreme. There are often various offers advertised (£25 set menus, 50% off food, etc) so have a look around if you're planning to go, and book the offer. However even with the 50% offer, dinner for two managed to hit £80, with a £25 bottle of wine and a rather shocking 20% service charge. For £80 I would say that the dinner was worth it - at a stretch (ignoring the 40 minutes it took for our starter to arrive, or the sniffy response to a request for a pitcher of tap water). The bar upstairs is very cosy and it was easy enough to get a table there at 10 on a Saturday night - not bad for a decent west end bar. Good drinks menu, although expect to pay £10 / drink. Would I return? Maybe for an 'occasion' - but only if I could get the offer. I'm mortified that our meal would normally have cost £130, considering what we got for our money.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3m4xij1zNGb77IiFvmATw"
  },
  "VmFGMgd1dhgDLOvULVQZ5A": {
    "date": "4/8/2008",
    "text": "Lively, good food, good for a group, fun bar.Odd celebs!I think 167's review sums it up pretty well.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dceBiRHCAJtCoIppXgR7hQ": {
    "date": "7/10/2008",
    "text": "This place is packed lunchtime mostly with mature yuppie types, most of whom were eating on the outside tables even though it looked like rain. In short, it's a place where appearances matter. The decor is contemporary modern, the service is good and efficient and they do make one feel a little welcome. The food is quite good, provided that one orders carefully. The burgers and steaks are only so-so, but the avocado Dorset crab was great. I had some simple grilled salmon, cooked perfectly pink, which went well with the side dishes. The champagne aperitif was also lovely and generous. The bar upstairs is quite elegant and lively and definitely caters well to the mature 40+ crowd. Overall, it's a great place for meeting up in London - lively but not boisterous, sophisticated but not too expensive and hip but not loud.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rt-_fc9ScucMdiVWcsRdGw"
  },
  "nuBxhO-3oPh7DgBHcgdTmQ": {
    "date": "5/26/2011",
    "text": "Very beautiful place, stylish, modern great service smiles all around one of the best social spots I have met a lot of people when I'm there who have turned into close friends now and theres not many places you can do that I believe sometimes a certain place attracts nice down to earth people, and I always feel comfortable when I'm there. Thanks You Andre",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "P-LTemiFC5XBvKrpzNfW1g": {
    "date": "4/22/2011",
    "text": "Shhhh! Hush has a quiet and stylish upstairs bar hidden off Brook Street. Delicuous cocktails and friendly hosts. Keep it on the downlow or everyone will be there ...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-05_3XT1pQv-Hc8bxRNywA": {
    "date": "2/15/2010",
    "text": "Hush is where the pretty people like to go.  Somehow I manage to slip in when no-one is looking (before you ask). The food is good. The atmosphere is good too. The wine in the bar area is also very nice. I actually like this place. I have taken private dining areas out also and I have not been disappointed yet.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q59vnLIaj0S0NbQDfAtORg"
  },
  "BllcIugkwxDyFidEhSzzyw": {
    "date": "8/28/2012",
    "text": "The waiting staff were great. I wasn't feeling that well when I first arrived and the waitress offered me a cup of camomile tea which settled my stomach and I was able to have a Schnitzel.My mum had the tuna salad which looked amazing and tasted great.Great food, just wish i could have had more to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "D-Vs3RHxnpQ9DcRdo4gv4w"
  },
  "ASpII9vOJTFN5gKHgHiwRw": {
    "date": "7/6/2012",
    "text": "There is a lovely outside courtyard so you can dine al fresco, and as this brasserie is down a little alleyway you're away from the hustle and bustle of London life and pollution!Note: This place does accept taste London cards, 50% off any meal for 2.I went with a friend, we both had delicious rib eye steaks with bernaise sauce and some truffel and parmesan chips to go with it.  Perfectly tasty and a nice vibe with helpful waitresses and a swinging bar next door for cocktails after.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8lhOc2ALAqKdmidG7DLFDQ"
  },
  "9JgitTZ3jH2ChxlGj_7C_g": {
    "date": "1/11/2015",
    "text": "I had a wonderful meal at Hush. We made a reservation for our party of five, which turned out to be unnecessary; it was surprisingly empty for a Sunday night. The waitress was quite friendly, though overall the service was a bit slow considering how few people there were. My food itself was delicious. I had the salmon with artichoke mash and split the sautéed green beans, the roasted squash with pine nuts and raisins and the beetroot salad with my boyfriend. The portion sizes weren't huge but they were reasonable. Everything was great, and I came close to ordering seconds of the roasted squash.Overall it was a great meal, and I would love to come back next time I'm in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "--HCNwho-zAc2Unwhp4vpg"
  },
  "wJX6bTxSepS3CVOyFl9sJA": {
    "date": "4/25/2015",
    "text": "Came here with a friend for lunch.we out outside, which was lovely! The food was amazing and the staff were nice and friendly. Couldn't fault this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_ZyryPpK2BmXXSCTbwGCw"
  },
  "MM7sHyHPDnzDGMJ-W9q3MA": {
    "date": "6/5/2013",
    "text": "This is my first Yelp review. Very nice restaurant, you can dine on the patio outside, first floor or the second floor (request where you want to sit when you make your reservation). We found the second floor to be less crowded and quieter, which we prefer.Service was very good, with three different people coming by throughout the meal for various items, although I didn't feel like our main waiter gave came by very much. As seems common here in London (first visit), you have to wave over the waiter to get your check. I would be positive and say this is a sign they're in no rush to hustle you out the door.Food was excellent - I recommend the carmelized onion tart as a starter. It's like a sweeter, solidified french onion soup in a small pie with a very flaky crust. For dessert, the White Chocolate and Earl Grey Crème Brûlée was fantastic.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PaktGbkD7HiCKyV3h8EhJg"
  },
  "QlL-IC0x_4DdJIPCZEr-Yg": {
    "date": "12/18/2008",
    "text": "Wonderful restaurant in a secluded spot which has a lovely terrace area outside for a bit of al-fresco when the weather permits. The silver room and the cocktail bar are upstairs and are a mix of intimate dining area's, a really nice bar and a larger more main stream area capable of seating larger groups. I have eaten here many times and it is one of my favourite places to go for a quiet and relaxing meal either for two or with a group of friends. Service is always good and the menu which changes form time to time is always top notch. Slightly formal but you need that for it to fell special, this would be a good place to celebrate something special, to entertain business lunches or dare I say it - for that intimate evening with a loved one. Definitely worth a visit, I think you will enjoy.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fBHKC8HrXslsUTqBvr2zug",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fBHKC8HrXslsUTqBvr2zug/o.jpg"
      }
    ],
    "user_id": "mQkBnWxkYKAShYr_spk64w"
  },
  "A60pV-5ZKeMFVRLaAqEKMA": {
    "date": "6/11/2011",
    "text": "Very stylish cocktail bar/restaurant in Mayfair. I love the surroundings and although it's quite famous, I didn't know this place until a couple of months ago, when I found it by chance while wandering around New Bond Street. The courtyard is really lovely, I wish I could bear the English weather and have lunch/dinner there sometime, but less than 20º is not acceptable for my Spanish background. Still, I kept Hush in my mind and when I saw a deal to try their new Hendricks High Tea menu at half the price, I bought it instantly. Afternoon tea is served in the cocktail lounge on the first floor, and the Hendrick's option includes a choice of a Hendrick's Gin Cocktail, a sample of a Hendrick's Gin Molecular cocktail and finger sandwiches, scones and mini macarons. Staff are very kind and pleasant and presentation is impeccable. They have those cute Hendrick's teapot and cups, for example. Now, the food. Sandwiches were really good, specially the chicken and avocado on on Poilâne Bread. The warm scones were good as well, and I really liked the trio of jams (Wendy Brandon's Rose Petal Jelly was really special although maybe too sweet, Gooseberry and Elderflower was my favourite). Macarons weren't as good as the rest of the menu, though. The only thing I didn't like were the cocktails. We had the Hush Wolfsberry (Hendrick's Gin infused with Rose Petals and Goji Berries, Goji Liqueur, Edible flower) and as sample something with peach puree and Earl Grey Tea foam, I believe. It's not that they weren't good, I guess it's because I'm not a big fan of alcoholic drinks and those cocktails were the strongest I've ever had! I suppose it's similar taking an average Starbucks-caramel vanilla extra sugar and whipped cream frappuccino coffee drinker to Spain/Portugal and offer him a \"café solo\". Even if it's good, they wouldn't like it. I could barely finish the sample one, so my boyfriend had 2 Hush Wolfsberry and 1 sample molecular one. He said it was the best afternoon tea he has ever had :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efClwtXiP3r3dC-TBqSO8g"
  },
  "dmWDOe9E0g8to2XgKWJW_Q": {
    "date": "2/16/2011",
    "text": "I loved Hush.  The whole area, little alley way with a number of restos and smushed outdoor space was one of the first times I felt like I really find a little hidden gem in this town and right by oxford circus too, love when that happens! Hush is clearly very trendy but being a New Yorker I love places that serve up great ambiance with good food and this place doesn't disappoint.I had the salmon tartar in appetizer which was a very good portion and with just a hint of chili was fantastic.  Finished it up with a medium spicy steak tartare for my main.  I enjoyed it but could have been a bit lighter on the capers... my personal preference though.Really, it's for sure a place I will be back to, love the location, enjoyed the food, loved the vibe of being some where you know something cool is going down!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bk8vptdyN5iH9pM8_SB1cw"
  },
  "a4k4pwGx-FizGnkGzBiZow": {
    "date": "4/20/2011",
    "text": "When I got invited to the Qype event, I realised that I had indeed been there a few years before. It is certainly a place littered with posh city types, but that didn't bother me as the cocktails were mightily fine. I had one with sake and a floating pansy it in and it was divine. I took part in the cocktail masterclass and discovered my love for the classic gin fizz. The mixologist was rather patient with me as I was a bit rubbish with my cocktail shaking technique. The venue is stunning and as it's just off the main drag of Oxford Street, it doesn't feel like you are in central London. Its beautiful courtyard gives it a distinctly mediterranean feel. I will be returning with bells on! :o)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uY5Q4yXDDynwNXyK5jbSQ"
  },
  "FMz1PGnOB41zvqDqena2cQ": {
    "date": "2/25/2013",
    "text": "Full of wealthy lavish corporate people, with suitably luxuriously decorated restaurant and bar. The food is good, not the best ever, but just worth the price. The wine is very good and service is as well. The 50% Toptable discount makes it well worth it :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "patjWcCve5DgaBnCe_OJBw"
  },
  "Txc0jSVIjfqob5TrnZrxWg": {
    "date": "4/8/2008",
    "text": "Hush is definitely a special place. I will give it 4 stars but that's not for the main restaurant and only for the following:- a great location in a small pedestrian mews in the heart of Mayfair, with a nice terrasse- a very lively bar upstairs at night - a perfect place for alfresco dining or lunching at their terrasse on this pretty little piazza- a good place for a business lunch or dinner at the quieter and more grown-up upstairs restaurant called The Silver Room. That room is elegantly decorated with comfortable seating and professional service. They serve a mix of French and Italian food. I had an excellent buratta to start followed by a milanese veal perfectly cooked and a very very good coffee (worth stressing as this is rare in London) The restaurant on the ground floor is not so great in my view although it is clearly very popular, and noisy! Too noisy for me, plus the chairs are not so comfortable and the tables very close to each others. The menu is ok but nothing to write home about. So remember, go there for drinks, outdoor dining/lunching or for serious lunch/dinner at the Silver Room. PS: I am amending this review slightly as I come back from an evening in the private room above the restaurant (on the second floor), definitely a great room to rent for an event with friends or for business (with dedicated bar and lkounge area).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_4xMloKY1QBfD581xwFcEA",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_4xMloKY1QBfD581xwFcEA/o.jpg"
      }
    ],
    "user_id": "HMe7MW1M-4A1iEhySt4wpA"
  },
  "S7PC6V8HPTK7xtUJCKg6Fw": {
    "date": "7/14/2011",
    "text": "For a more modern take on afternoon tea rituals try Hush whose peaceful courtyard and elegant dining room are a quick detour from Regent Street and New Bond Street.The decent selection of sandwiches and scones are ample to snack on while drinking the Hendrick's Gin-based cocktails. There are a couple of moleculars, a couple of infused martinis and a hot tea infusion for the brave. Try the Hendrick's Spring from the infused section, Hendrick's Gin infused with Lavender and Cucumber, garnished with a Lavender Flower.Once you've worked your way through the short but effective menu bring yourself round with a sugar-shot from a Bougie mini macaron and prepare for some frivolous shopping. Our advice, head straight to Sandro on South Molton Street, a pleasant 2 minutes wobble away.£24.74 for High Tea with one cocktailSurplus cocktails are £9 each",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pNMho1oWnPhVNy5JpUo9tA"
  },
  "HbMRhO_rgqmhyfFQkK-a_g": {
    "date": "4/20/2011",
    "text": "I went to the Qype cocktail making event here last night and was very impressed. The venue has a great courtyard location just off Bond Street. Sitting outside on a lovely evening with a cocktail or two would be great. Inside is very dark and full of men in suits drinking. It's definitely a place you'd want to get a little dressed up for, although there's no dress code. The staff were all really friendly and helpful. The cocktails were great, as was being let lose behind the bar. Thanks for organising it Sarah and nice to meet a few fellow Qypers.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aD8BQgFNfZR0XRtwUUgzBA": {
    "date": "8/25/2013",
    "text": "We've been here more than once and the food varies from OK to good. The service is always excellent. Enjoyable  the atmosphere is generally buzzing and often a bit too noisy to hear conversations in some parts of the restaurant. The prices are pretty high but possibly average for the locality, expect minimum £25 per head.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aT_lt7gFYHJOeX5ncb-MYA": {
    "date": "11/18/2009",
    "text": "Hush is visually very interesting. a combo of lush and industrial. the lighting was just enough to see, the wavy bar along one side, the staircase, teh slightly raised area with tables. interesting.food. eh. it was ok. we had an artichoke that was half wonderful, half undercooked/burned. the beef carpaccio was tender and great, but desperately needed more salt. for mains we had duck confit, which was quite good, but whatever it was served with was lost in the shuffle. needed to be more... stand outish? something was missing. i had a ahi tuna sald which was amazing. but slightly drenched with amazing sauce/dressing which was fantastic at the start, but by the time we finished it the last few bites were swimming. dessert was a mars bar cheesecake (omg!!!!) with praline ice cream. perfect texture, fantastic way to finish a meal.   the wine was a sauvignon blanc, recomended by who i think was a manager, which was fine. very drinkable, but nothing special about it.the waitstaff: a bit clueless. when we first came in, a manager with glasses greeted us and let us pick a table. i was never really sure who our server actually was, it felt like they all kind of did random things. the manager who actually took our orders honest almost makes me want to give Hush two stars. he was a disaster. rushed, rude, and oblivious. when we were leaving we went to get our coats and he just brushed us aside and rushed somewhere. saying he would be back. at least take our ticket for the coat and get to it in a second. would i come back? maybe. its another place i now know.shrug,",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "I3URSVRu24EaGWpvZB0cuA"
  },
  "EHhHiCa-THeGwSLIjsTgsg": {
    "date": "12/1/2010",
    "text": "Lovely venue with attractive decor and stunning outside space. I went with a friend and she had parsnip soup, chips and chocolate icecream while I had foie gras with an artichoke salad, roasted squash with pine nuts and raisins, and rhubarb rice pudding.The food was stunning, especially the foie gras which I had never tried before in my life, just thinking the saturated fat content made my heart skip a beat! Well worth trying but I think my arteries will be grateful if I never eat it again!I absolutely adored the rice pudding, which arrived with a deliciously crunchy caramelised top, a subtle orange aroma and the tart rhubarb to cut through the sweetness of it all.The only criticism is that the waitress wanted to charge us for a drink we didn't order (£8.75) and we had to fight our corner to demonstrate it wasn't us who ordered it!A good dining experience overall.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTUbajPBghvj-4ebP2D8-Q"
  },
  "8leAMRcNnzwv7TkrFcq_Aw": {
    "date": "2/12/2012",
    "text": "Located in Lancashire Court, a lovely little alley packed with hip bars and restaurants, HUSH should be an excellent choice if you are looking for cocktails.  We started with a few, and were anticipating the best.  But once we moved to the table for dinner (which they were late in delivering, despite a reservation... no worries because of great bar)... the meal itself was only average.  The service was fairly inattentive, the assistance in wine selection (after food ordered) was off-the-mark from what we stressed, and the food itself was good, but not outstanding.   Overall, I'd return for drinks, but probably not for food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OgE-yl_jkBBO6dQCjDeXtg"
  },
  "JrDLwk9Y1AJratLOdLiZHw": {
    "date": "12/7/2012",
    "text": "Great assembling of cocktail. A relaxing atmosphere. Makes you relax body and mind.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "b1-R-UdKrADNz11rIgplUg": {
    "date": "8/26/2009",
    "text": "I didn't eat at Hush, but it was a nice mellow place for after-dinner drinks.  Both the house white and the house red are pleasant blends of wine, and the lounge seating and low lighting provide a sultry environment in which to enjoy them.  I still haven't decided whether the man I stumbled into on his way out of the women's bathroom was confused or had been banging the woman standing next to him inside moments before.  The men's bathroom is a little difficult to find, I suppose, and Hush does seem classy enough to provide the benefit of doubt.  Shhh...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WWnhqRnWWjutMqh-2SzEuQ"
  },
  "IvnAG4ZZKY1sk3FaYKgdhg": {
    "date": "3/17/2009",
    "text": "Hush is one of my favourite places to hang out in Central London. Brasserie is always buzzy but they can always find you a table or they have a gorgeous intimate restaurant on the first floor called The Silver Room which is absolutely stunning. Drinking Champagne in the bar really makes you feel you are in Mayfair but you have to try the cocktails. Good looking bar men who really know their thing - getting rarer in London every year. The food is tasty, the staff are friendly and the ambience is great. Definitely a good place for taking someone on a first date. If the sun is shining, the terrace is one of the best al fresco dining locations in London.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "TqbGnY5FZeTh8cw3umsnZw",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TqbGnY5FZeTh8cw3umsnZw/o.jpg"
      }
    ],
    "user_id": null
  },
  "xJ4ZMescZZ0hVLicK4-LBw": {
    "date": "9/8/2018",
    "text": "A group of colleagues and I had an event at Hush this evening and it was STELLAR. Their private room upstairs just off the bar is glitzy, cozy, and perfect for a night of fine dining. Upon entry, waitresses greeted us with glasses of champagne and we were never left with empty glasses. (Cheers to that!!) Even though their menu options for large groups was very \"protein\" centric, they were outstandingly accommodating to my being vegan. At no additional cost they prepared a vegan starter and main, that varied from the rest of the group. They were also very respectful of food allergies. The beet root carpaccio (pictured) was delicious. The beer root was very thinly sliced, topped with fresh arugula and drizzled with balsamic glaze. For my main, the staff crafted up a vegan risotto with barley as the center of the dish accompanied by squash and leafy greens. The squash had a truly smoky flavor and the barley was perfectly cooked. I would absolutely recommend booking an event here if you need a private room or space for a large group of guests. The accommodating nature, the vibes, the food, and the attentive service will ABSOLUTELY win you over!! Thank you, Hush!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mG3zh4ZKOX7VGs50JRPYQg",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mG3zh4ZKOX7VGs50JRPYQg/o.jpg"
      }
    ],
    "user_id": "tlts1g3e5YZi0PqRsbUfXw"
  },
  "b60dwaBulEeEI_pfxpOvkQ": {
    "date": "2/18/2018",
    "text": "The 3 star review is almost entirely owing to the slow service.   We waited 20 minutes after sitting before anyone came by, which is an absurd amount of time.  I complained and they finally came over and took our drink order.   After that, you would expect snappy service, given that they were trying to make up for the slow start.   But no, mostly slow all night.   It's a shame because the food and drinks were all good to very good but that is hard to make up for.   Won't be back.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Re7IvWTCBG0ZYj9qMG57hA",
        "caption": "Photo of Hush - London, United Kingdom. Monkfish on Cassoulet.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Re7IvWTCBG0ZYj9qMG57hA/o.jpg"
      }
    ],
    "user_id": "b-fP5XcqMMI4dhp4bAxRrA"
  },
  "wci2Dn5UajDAn54V_lpnKA": {
    "date": "2/19/2018",
    "text": "We decided to come to this place based on the good reviews. However, the service really let us down.We arrived and were shown to our seats. It's a nice dining room, with a very attractive bar in the corner. However, no one came over to take our drinks order. We waited 20 minutes until my husband had to go over to the bar to complain. Then when someone did come over, he didn't even apologise for making us wait! Service did not improve from there. I had to ask for tap water three times! Really not acceptable. There was also no accommodation for food requests - the monkfish came on a bed of beans and chorizo. I asked for it without the chorizo as I eat fish but not meat. Apparently that was not possible as the beans and chorizo were pre-mixed. Any decent chef could have whipped up an alternative base for the monkfish, especially as the menu is pretty extensive.The food we did order was good. Hence the 3 stars. Though good but not great. My watermelon and feta salad ticked all the right boxes. My lobster/crab salad was also enjoyable. The sourdough with maple butter was delicious (who'd a thought!).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VaoP54PaLRDLjQuBd4Sd1A",
        "caption": "Photo of Hush - London, United Kingdom. Watermelon and feta salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VaoP54PaLRDLjQuBd4Sd1A/o.jpg"
      }
    ],
    "user_id": "Ig4gTKQCrahJyvvfitmZHQ"
  },
  "2r8-W2C34GboJWxHdVVZdA": {
    "date": "4/12/2018",
    "text": "Cute terrace with lots of flowers and green \"grass\" on the ground. Central location, just off oxford street. Price was kind of expensive but keep in mind that it's London and a good location. We had one main each and two side orders which was more than enough. The toilets are worth a visit. And so are the photographs on the wall on the way to them.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wYJn0jt5WP98Uy6Fov0aGg",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wYJn0jt5WP98Uy6Fov0aGg/o.jpg"
      }
    ],
    "user_id": "ceHC4NXHF0lm6pn9aMlEdg"
  },
  "orc2c25IFckV4GcwereSWA": {
    "date": "2/7/2018",
    "text": "Lots of fuss about this place The place is vast with nice ambianceBeautiful outdoor setting Food was ok ,Service not bad",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "REWGP_0hUGmkygequIuXZg"
  },
  "wvGnRmmTw6Mmehh4F3xfsA": {
    "date": "9/20/2017",
    "text": "Great menu with lots of options, juices and teas. Charming exterior seating in the summer time and interior decor of you're seated inside. However, 4 stars because the staff can be extremely condescending and rude if you don't order much and want to stay and chat. Definitely overly accommodating if you order a lot with alcohol though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iMJrKmygO4r7siKQLY1_Wg"
  },
  "bJWOcF18YxAYbrzO_uWcHw": {
    "date": "10/26/2016",
    "text": "Service was super attentive when I came by for lunch today. We ordered a range of starters which were all delicious - tuna tartare, scallops and burrata with asparagus - but quite easy to put together. The mains were well sized and pretty good but unmemorable which for the price you're paying is not great. If this place was slightly cheaper I could definitely see myself coming back but you can get better value for money at so many other places in London, especially for lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jIY9y_msUb89UCLilkn9-Q",
        "caption": "Photo of Hush - London, United Kingdom. Tuna and risotto in the background",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jIY9y_msUb89UCLilkn9-Q/o.jpg"
      }
    ],
    "user_id": "lmbtRXRVjtsLCIAP8yAzIQ"
  },
  "nKtCCERBnMrWDK4zngGdug": {
    "date": "7/22/2017",
    "text": "Overall disappointed by this place. The setting is lovely. We had a table outside in the courtyard (despite the rain) and it is tucked away off Regent Street and away from the tourist hell of Oxford Street. We were given the brunch menu (which looks amazing), ordered, then told brunch had ended. So ordered from their lunch menu which to be honest I've had better small plates else where in London and better value for money. The food itself is really good. The service isn't great. Inattentive staff who don't know the menu. Overall a bit mediocre.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fdne37GHogC29jR7x-vwOQ"
  },
  "ZAUXZKdGqmt6QRdxTPhKYQ": {
    "date": "7/12/2016",
    "text": "Tucked away off the main streets behind Oxford st. This is one of my favourite places for a drink. The bar itself is located above the Hush restaurant and they also have a great courtyard area that has heating in the winter months. The service in this place cannot be faulted. The staff are attentive and welcoming. They have a great selection of alcoholic and non alcoholic drinks. Yes, it is a little on the pricy side but it's worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxb_Sd9JYq94WoO0qxNp3Q"
  },
  "k4prE-C-dG6GsPYzJ_28gA": {
    "date": "5/9/2015",
    "text": "I went here for a seminar over lunch, so my view could be slightly off par, but even so, food is food and the same goes for service.So, (I'll save going through the seminar.... haha)  there was bread and butter on the table, and I have to say I am a bit of a bread'o'holic and I had one or two bites and then decided to leave it.  There was a funny taste and a bit bitter.They were serving orange juice and water for drinks, and the waiter was excellent.  Although the orange juice was rather sharp and made me pull a funny face.  The starter was potato and parsley soup, which was \"nice\", nothing to rave about though and definitely needed a bit of seasoning to it.The main was salmon on lentils.  Which I didn't eat as I don't like fish, and although they did offer me a plate of lentils, I passed on that option.  When the salmon did come out, it did look very dry and the lentils had the appearance of dryness (like you get when you leave beans to go cold).  The feedback from the table was pretty \"meh\".The dessert was white chocolate and Earl Crème brûlée. Well, my colleague I was with took one mouthful and took an immediate swig of water, I persevered for a few more spoons and then decided it was making me feel a bit icky.  However, there were 2 people at our table that demolished it, so maybe the result on that dessert should be 50/50.On the way out the first floor bar looks really enticing and  my colleague and I are probably going to go back to give it a try on the first floor, ordering what we want and enjoying drink at the stylish bar.Downstairs the patio outside seating area was full of people.  I don't know though if this is the place people go so they can say \"oh darling we're off to Hush for lunch\" rather than a quiet location that they go to enjoy fine food.  Currently I think it is the former.....The toilets are delightful though.  Very clean and smelt divine.The staff are brilliant.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aN1w2zouZWBEE8p6WO-MJQ",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aN1w2zouZWBEE8p6WO-MJQ/o.jpg"
      },
      {
        "img_id": "SZBcEqjcNxBm4rYJVJDmlg",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SZBcEqjcNxBm4rYJVJDmlg/o.jpg"
      }
    ],
    "user_id": "tEtGghKHbFs8acm9SIyXUg"
  },
  "mu6LReZibXKEGAl0ELNP1w": {
    "date": "6/29/2016",
    "text": "Lovely little courtyard with reasonably good service. Had the lobster salad and it was really good (minus the over-cooked bacon atop it).  1/2 of a 1 lb. lobster and some lovely potato salad. Host was bubbly and atmosphere was lively.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mGzszpYDR09ExeG04LzE7w"
  },
  "VftTvwtGiWklWXwv9mTfAA": {
    "date": "4/25/2013",
    "text": "The visit of Glasgow Elite Martyn M to London gave Andrew M and me an excuse to go out for another dinner. Not that a Yelper needs any excuse to go out for dinner!We agreed on Hush as the menu looked promising. The name Hush suggests that they want to keep it a secret and indeed, the restaurant is a little hidden away off the main street. A word of warning to ladies wearing high heels - the path is downhill and cobbled - Andrew and I were royally entertained by a pair of glammed up ladies struggling down in their high heels. We did offer to help but our chivalry was  declinedIt was one of those in between London weather days and we weren't sure whether to sit in their inviting outdoor area or play safe and sit indoors. In the end, we went safe!The restaurant certainly aims to be high end and the clientele fit that bill. Opposite the upstairs bar, there is a wall of various celebrities doing the shush finger to lips poseBeing typical Yelpers, talking made it hard to order but we eventually managed to get starters of dressed Dorset crab with avocado and the pulled pork, Yorkshirepudding, apple and calvados. These were a good start to the meal. The crab was freshly picked and given enough pep to liven it up and still be the starring main ingredient. The pulled pork was good by British standards but can't match the American BBQ jointsFor main, I enjoyed my half lobster with taglierini, tomato and chilli, which once again had nice ingredients to lift the starring lobster. Martyn pronounced himself very pleased with his steak. I think Andrew regretted not getting steak as well because his fishcake was rather dry and underwhelmingWe rounded off our meal with blackberry sorbet, Mar bar cheesecake and sticky toffee puddingA great evening with a visiting Yelper. Food was 4 stars overall if you ignore the fishcake but they lose a star for the price",
    "rating": 3.0,
    "rated": {
      "useful": 11,
      "funny": 8,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "omP4q5EYn-zDFW3IGVbEiw",
        "caption": "Photo of Hush - London, United Kingdom. Blackberry sorbet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/omP4q5EYn-zDFW3IGVbEiw/o.jpg"
      },
      {
        "img_id": "sW8lKvh6CkEKRohmHUfShg",
        "caption": "Photo of Hush - London, United Kingdom. Sticky toffee pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sW8lKvh6CkEKRohmHUfShg/o.jpg"
      },
      {
        "img_id": "gUv5kzBWA4RzkTIfRvAVTg",
        "caption": "Photo of Hush - London, United Kingdom. Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gUv5kzBWA4RzkTIfRvAVTg/o.jpg"
      }
    ],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "YapepsDuvoXNk0rYsmHbYw": {
    "date": "4/5/2013",
    "text": "Located on Lancashire Court, tucked away behind loads of buildings, lies Hush. I did have to ask for directions to get here even whilst I was on the street, but I got here in the end.Last night I was invited to a yelp event dinner by Yee Gan O, who arranged a dinner for me whilst I was down in London, which was delightful! Andrew M also attended, and it was fantastic getting to make more friends through Yelp outside of Glasgow. I arrived early, and so had a glass of white wine, which was gorgeous, while I waited. Shortly after the others turned up, we set to ordering. We were actually talking so much I think ordering 2 courses took us about half an hour, but eventually we managed it. Yee Gan and I both opted for the Crab & Avocado Salad to start, whilst Andrew went for the Pulled Pork. Both were absolutely delicious and went down a treat. Then for mains Yee Gan went for the half lobster, Andrew for the Salmon Fishcakes, and I went for the fillet steak with béarnaise sauce. My steak was cooked to perfection and was absolutely delicious. The homemade chips left a lot to be desired though, but I've often found that good steaks come with bad chips. The two guys both cleaned their plates, and food satisfaction was had for me. I've noticed that I'm the first person to review this place with 5*, but I genuinely cannot fault my experience here. The decor is absolutely stunning, the food was excellent and the service was great. It's definitely a place pretty people like to go to be seen and spend money, but that didn't influence my enjoyment. I had blackberry sorbet for dessert, which was gorgeous and sweet and delicious and rich and I just love sorbet. Andrew had the mars bar cake and Yee Gan had the hot chocolate fudge cake. Definitely recommend this place. Excellent food, excellent service and everything excellent in between. It's definitely on the pricey side, and the 12.5% service charge is popped on at the end, but I thoroughly enjoyed Hush.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cf74JKFqxYUBTsJqwv3TSw",
        "caption": "Photo of Hush - London, United Kingdom. Blackberry Sorbet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cf74JKFqxYUBTsJqwv3TSw/o.jpg"
      },
      {
        "img_id": "RagVQkFU8KDQYaiSm3n8hg",
        "caption": "Photo of Hush - London, United Kingdom. Fillet Steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RagVQkFU8KDQYaiSm3n8hg/o.jpg"
      },
      {
        "img_id": "QSLmavdf3G_0_vkjSYfoXQ",
        "caption": "Photo of Hush - London, United Kingdom. Crab & Avocado Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QSLmavdf3G_0_vkjSYfoXQ/o.jpg"
      }
    ],
    "user_id": "VFhor53ZPCDw6EELQkSHLg"
  },
  "rT4F_7SDjVKK_Rkb6ND6zQ": {
    "date": "3/12/2015",
    "text": "Hush is great, the food gets better and better every time I go there. We booked a table for 5 but we ended up being 8 and then 9 which was no problem at all and they fitted us all in. The staff are mostly friendly and the service is good as well.I usually go for the arancini then any of the fish choices, they cook it wonderfully! Never overcooked and generally really lovely. Love the cocktails as well, they've got the standard ones you'd expect to see and a few of their own creations which are super tasty! Oh and don't forget the desserts!! I loooove the raspberry and white chocolate creme brûlée and the mars bar cheesecake is divine! Plus they do cinema viewing outside on their heated patio in the winter and use the patio as outdoor seating!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRrDF0rG0mcet58ppldPGQ"
  },
  "c0qNq6GNKBteebQ9tupjlw": {
    "date": "9/2/2015",
    "text": "I was here about a week ago with an old friend for a reunion... We headed straight to the bar as dedicated alcoholics do haha.. And the menu was diverse and very resonably priced! I was surprised as I usually go next door where I pay £16 for one cocktail, so when I saw some priced at £12.50 I was surprised ... I tried the bubble gum martini .. Ladies.. It's a nice sweet tipple but it could do with a little polishing. It had popping candy and candy floss .. Ahh it's the little things in life that count.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft8cn80hAJcOl_hRiVpP1Q"
  },
  "F0xGUrN4BlVI4t69J-zaoA": {
    "date": "2/21/2012",
    "text": "In a secluded little alley of London lies hush.  I think hush is a fun little venue.  Menu was standard \"modern British\" fare which for a new Yorker like myself seemed like \"standard new modern\" restaurant fare.  There is something to please everyone from the wanna be vegan (moi) to the carnivores in my group.  Bar seems lively and the restaurant ambiance is decent.  What keeps me from a better rating is that hush is simply ok. Nothing memorable nothing special.  But definitely a good group venue.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCKMjBXwlybZrZ7Q1wUAPg"
  },
  "Ty7uQQX2Fme8Y9QjC3sT-w": {
    "date": "4/16/2013",
    "text": "Hush is one of those hidden just out of sight restaurants that you hear about but never quite end up going to try on a whim because...well you just don't see it. I assume it's called Hush to imply it's a secret dining escape in the middle of the city or perhaps they just want you to shut up and stop whining about the tourists. First off, the entrance is a little deceptive as the most obvious route from Oxford Circus actually takes you to the back entrance. Now this entrance has an awning over the door which says \"Hush\" so you wouldn't be faulted for thinking perhaps they are going the speakeasy route with a  very minimalist entrance. Nope, the actual entrance (and fairly large outdoor seating area) is just around the corner. Ladies beware - the path is cobblestoned which would make heels a tricky proposition unless you have a handy gent's arm for support (unless said gent is also wearing heels in which case you're outta luck).The interior is elegant with small but comfortable dining area on the ground floor and a pretty slick bar on the upper floor.  However, despite having a number of friendly staff around, service seemed a bit slow. Perhaps it's because we were chatting away and had to ask for a couple of minutes more the first time, but surely that's no reason to forget about us?We had been discussing various approaches to slow cooked meats, and with this on my mind I had to opt for the pulled pork starter. Now, if you've been following my reviews, you probably know I'm partial to a burger and considered trying the Hush burger until I found out it was merely a patty on a bun with a bit of lettuce as a garnish. For £13, I expect a little more style in a dish particularly for a place trying to be as glam as Hush. Instead I opted for the fish cake - a choice I later came to regret.The pulled pork was tender and juicy but the marinade and sauce leant more towards sickly sweet rather than the full bodied tangy flavours I've come to associate with such a dish. The sautéed apple in a calvados reduction didn't help matters at all nor did the brioche shell it was served in. Overall, it felt as if they had tried to make a pulled pork dessert - an odd choice in general and even more so when considering this was designed as a starter.My main was singularly disappointing and lacked in flavour, creativity, and all round taste. The salmon fishcake was under seasoned and overcooked and the tomato relish, while tasty, was provided in insufficient quantity to add sufficient flavour to each bite. However, the side of parmesan truffle fries were excellent and I confess I was greedy and ate more than my fair share of that. I'd happily go back for that time and time again as a snack with a drink. My dining companions confirmed that their food also was perfectly fine just lacking that wow factor you'd hope for given the level of style (and price) that Hush aims for.Finally, dessert! We shared a selection of the sticky toffee pudding, black berry sorbet, and Mars Bar cheesecake with praline ice cream. The star of the show was definitely the sticky toffee pudding with was rich, sweet, and fluffy - exactly what you want in such a pudding. The blackberry sorbet was tart and refreshing and couldn't be faulted. The Mars Bar cheese intrigued me as I wasn't expecting to find a dessert based on a candy bar in such a place. To be honest, it was just a cheesecake with a bit of chocolate and wafer but little resemblance to my memory of a Mars Bar (granted it's been a while since I've had one - do they even sell them in the UK?). Overall, probably the best course of the night.All in all, I'd say Hush is a nice place for a drink (and some parmesan truffle fries) but given the stiff competition from other restaurants in the area (Sketch, Little & Pollen Social, etc) I think it needs to up its game if it wants to compete on the restaurant front. But given that it was quite full even on a Wednesday, perhaps there is enough of a market even for them!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "qU9EOfXrmGwgfIVqsIaDjQ": {
    "date": "9/5/2015",
    "text": "A must visit in Mayfair! Excellent customer service and fantastic food. Ambiance will take your breath away. Sit outside under heat lamps. Walking there is quaint through small alleys. Reminds me of Bellagio Italy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d_nVIHCyg931LZ-vD80lIw",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d_nVIHCyg931LZ-vD80lIw/o.jpg"
      },
      {
        "img_id": "oZwqc85MMt_hPsehQ59eWg",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oZwqc85MMt_hPsehQ59eWg/o.jpg"
      },
      {
        "img_id": "77DZ5Buri6cfnSTOp3a6Ug",
        "caption": "Photo of Hush - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/77DZ5Buri6cfnSTOp3a6Ug/o.jpg"
      }
    ],
    "user_id": "7A1uKOCXf6JvXnDd_ltbXw"
  },
  "9z8AGWm-5I5Tk5eQ-V_4VA": {
    "date": "4/12/2013",
    "text": "With a buzzing cocktail lounge and chi-chi decor, this place seems an ideal spot for kicking off a girls night out.  Start here and then go to the Mews next door for a cocktail or three!And...top tip: 50% off if you have a Taste London card!  I had the Agnolotti with Duck Confit as a main course - lovely, but needed more seasoning.  The Mars Bar cheesecake was decadent and delicious.The service was quite slow and not very responsive - perhaps I'm too used to the impeccable service in New York.  This was my conversation with the waiter:Me:  I'd like a glass of champagne, pleaseWaiter:  Would you like one of our spritzer cocktails?Me (confused):  No, Just a glass of champagneWaiter:  How about a mimosa?  Wouldn't you like a mimosa?Me (now irritated):  No - just a GLASS OF CHAMPAGNE.That said - food was decent - a nice place for a group dinner!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsOmY_afZyLbjzOauAfl_Q"
  },
  "SOu90_d0yxLNpFPRj3Xr7g": {
    "date": "9/21/2013",
    "text": "This place should be so much better than it actually is.A great little setting, in a cobbled alleyway off Bond Street and feels a world away from any of the hustle and bustle just moments away. However, the food and service do not match anywhere near the price they charge for their exclusive location. It was so bad in fact I had to ask to have the service charge taken off our already extortionate bill (£65 for a couple of burgers and a glass of wine each - I think not).It could have just been a bad day (WImbledon was being shown on their large outdoor TV so maybe all their staff were distracted...) but still, it will take a lot to get me back in here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4DDcE7uULzejAtim6yqs5A"
  }
}