{
  "0GhA46i6x4EmImuHQ7uIpQ": {
    "date": "5/31/2012",
    "text": "I had high hopes for this restaurant  given that we had to book 3 weeks in advance for a Wednesday night table. The venue really is excellent  the sex shop outside is a great novelty and the candlelit cave below was delightful  perfect for a memorable night. The slightly odd choice of music  fairly loud and top 40-ish  jarred with the decor. Our waitress was lovely and recommended dishes to share. We started with a hibiscus margarita which was strong but not unpleasant. We kicked off the food with guacamole and chips. The mean portions (5 chips for a table of 5) were laughable. We then moved onto the steak tacos which were incredibly spicy  rendering our tastebuds practically numb for the remainder of the meal and in dire need of a second bottle of water. The corn on the cob however was delicious  probably the best savory dish of the night. The chorizo salad was delicious but again seriously spicy so most of the taste was lost on us. We had the prawn ceviche  it was passable. The spit chicken was moist and tender  the skin blistered well and the potatoes in the sauce delicious. We sampled the spicy prawns  yum. A mixed bag at best. We ordered a selection of desserts which took 20 minutes to be served, and coffees which annoyingly followed 10 mins after. The coffee was tepid. The desserts were excellent and it was the one part of the meal where the portion size was large (in fact the churros were too big to finish). Despite telling us that we must finish up as the next party had arrived for our table, they took at least 15 minutes to organise giving us the bill, and another 20 to bring a card machine. We opted for a 10% service charge rather than the optional 15% which was added  a fuss was made and the manager informed before we could continue to payment  optional it was not. All in all I would not return  the food was decent but there are much better examples elsewhere in London which are cheaper and easier to secure tables at!",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MOdcE-kwFKnzMUmmkvBN6w": {
    "date": "2/10/2016",
    "text": "I'm a big Mexican fan and was a bit disappointed with the ceviche and the queso fundido was ok the fajitas were good although.  Maybe in London they don't know about real good Mexican food? The service was good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SM8HguCRDGtMl2PinMxcNA"
  },
  "IimcKkYCBHyyuAzYXqgegQ": {
    "date": "5/10/2015",
    "text": "Enjoyed a 30th birthday meal for a good friend, who was very surprised as we entered through what looked like a sex shop. The food was very tasty and reasonably priced.The watermelon cocktail was to die for and the staff where very pleasant throughout. You must book early as this is a very busy place,",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1VPFPx7AiowpP4Cb8voQw"
  },
  "ArHkGdfa5t9Er6HDbtGYTQ": {
    "date": "10/7/2012",
    "text": "Apart from being so hard to book a table ( took couple of weeks to get a table for two and a month for a table of four!) And the wait for 30 minutes to get the table you have reservedAnd the crowdAnd very close seating of diners In both times I had good food, good wine and fairly ok service And yes for the food I would go again",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kIHG6LSUp-Ubqe9zbayzA"
  },
  "U8uq3QkM43-Zh8ux78PiAg": {
    "date": "4/28/2012",
    "text": "Hmmm - I was really excited. Mostly to see what justifies expensive Mexican food - always a debatable topic among foodies.I'll admit the menu is pretty exciting - a modern twist on the classics and I'm a big fan of any restaurant that advocates sharing dishes. The BIG win for me were the chorizo quesadillas. Absolutely to die for. The kind of dish that makes you giggle a little bit after the first bite (like a Hawksmoor steak).However - I found the pork and steak meat in the tacos a bit dry and some of the potato sides were really underdone - an absolute sin for an Irish customer! On the other side of the fence, bonus points go for delicious cocktails, pleasant customer service and a decent buzz even on a Wednesday night. I also like that you can put your name down for a table and come back when they call you.All in all - a nice spot, but I have yet to be proven that mexican food deserves racy prices.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wi4vILum7La67MCJQZMOVg"
  },
  "X_7XP2rhfX_a98NhIzENUw": {
    "date": "4/1/2014",
    "text": "really tough one this. completely polarising restaurant., which i've avoided but was still intrigued to check out. the food was really really good, but also half the portion size it should be, so it becomes really really expensive. bordering on taking the piss. £26 for 3 skewers of octopus/chorizo?!? the soft shell crab taco's were £8 for 2, so about £4 per delicious mouthful. mexicans would hang their heads in shame, this isn't what mexican food is about.but then just by going in here you know what you're getting. more fool me for even bothering.on the flip I found the service to be pleasant, and the atmosphere is fun. great music, and by the end of the meal people were dancing all over the place. rather than leave for somewhere cheaper we did end up staying for 3 rounds of £10 cocktails. take from that what you will.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "X4xqQ3yJII3qppwPhaFB6A": {
    "date": "8/6/2012",
    "text": "Had dinner here last week following the recommendation from some friends who said the tacos would not disappoint and that it was the best Mexican restaurant in London. They were half right. The tacos were delicious - had both the steak tacos (which were a bit spicy but still enjoyable even for a wuss like me) and the shrimp tacos (yum) - but the portions were tiny (3 very small tacos per order). Also had the chorizo quesadillas, which were tasty. We also had an order of salsa and guac with chips and it was sorely lacking any flavour. The guac tasted like the brand I get from Sainsbury's to eat with my weekly attempt at chicken fajitas. Sadly, that's one of the ways I judge my Mexican restaurants so that was a huge letdown.All in all a solid Mexican restaurant, but still looking for better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOQlGpgqq2MBCuEzxLMm4g"
  },
  "oSZRGoGHd65Tv78OnBj0Wg": {
    "date": "5/5/2012",
    "text": "One of the best parts about this place is the novelty of entering through a sex shop and hoping you've got the right place. I love how speakeasy entrances make you feel you're in the know when you're in a tourist area. I went with a large group, so we were able to try most of the menu. The highlights were the Camarones and the Prawn Tacos. Everything was perfect, and we were thrilled with our choice. The vibe is fun and hip, with great music, and the most fascinating murals. I would definitely go back if I had the chance.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EjA7rcw9F7By6GFQ7-t9WQ"
  },
  "rp7HfgnC2D375ieZYqZFrQ": {
    "date": "8/29/2012",
    "text": "Have to say the reviews seem overly harsh to me, but I didn't go expecting the world's best restaurant.La Bodega Negra is Soho mexican stylistic excess  that's the whole point of it. The food and drinks are expensive, the ambience is hip and the fit out incredibly cool. As a place to go for food and cocktails before a show it summed up the place  a party starter!Yes it's frantic, and a little rough around some edges, yes its food could be improved but otherwise it's well worth a visit and not just for some novelties like going through one entrance that looks like a sex shop. Oh, and the restaurant in the basement downstairs is the place to book and go, not the packed upstairs so worth bearing in mind for the full experience in my opinion.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1ksOYU-0DxVxPwdQ2NjgXw": {
    "date": "6/14/2014",
    "text": "I finally ate here a few months ago after hearing all the hype...I don't understand the hype! Maybe its the cool sex shop vibe? Maybe the music? Maybe the drinks? maybe the dim atmospheric lighting? It's not the food, that's for sure If I showed this menu to mexican friends they would tell me it's a great menu, but it ain't Mexican! Secondly, Mexican food isn't supposed to cost this darn much! There were 6 of us dining so we tried nearly everything on the menu and NOTHING was memorable or worth the final price tag or a 2nd visit to this place! If a see and be seen vibe is your thing, this is the place. If you're in search of good tasting food that will fill you up, try somewhere else",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhDYgMx7KuUzzneR21gPVA"
  },
  "5Z67uibvgIyv5cYswcHLUA": {
    "date": "6/12/2013",
    "text": "Really unimpressed with La Bodega Negra. I met a friend here for a weeknight dinner and we shared a few dishes in the cafe upstairs. We ordered some chips & salsas, the ceviche baja, and the chicken tinga tacos. The waitress was completely unhelpful and didn't seem to know anything about the menu when we asked for recommendations and questions about specific dishes. When our dishes arrived, they were so small (and with no sides included), we had to then order another dish, the corn salad. The ceviche was very fishy and didn't taste very fresh. The chicken tinga tacos basically tasted like overcooked chicken in a tomato sauce, no interesting spice or additions. Our bill came and was almost 25 pounds each... certainly not worth it for the amount of food we got!Overall, thought the food was mediocre and overpriced and won't be back.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r3Uj9otxxe3PZDcGqH5Bmw"
  },
  "jCZs2tC1xINErhGTKs6NNg": {
    "date": "2/18/2013",
    "text": "I heard interesting things and they had reasonable reviews, so I wanted to check this place out. Sunday evening, the other half and I headed here to eat. So as a heads-up we ate in the cafe in the front and not the restaurant in the back. Now there are two things about Mexican that I love: Delicious margaritas and a good wallop of spice. Unfortunately La Bodega Negra lacks in both of these areas. The margaritas are really quite boring. And for £8.50 I would either expect them to be awesome or giant. They were neither. Small, average margaritas. They lose a star just for this. We switched to beer.For the food we ordered some ceviche to start. The other half ordered a chorizo quesadilla and potatoes with mole negro. I ordered pork belly carnitas tacos with beans and rice. (The menu says you get three tacos, but they all have to be the same flavor. Annoying. Just say \"tacos\" and list the options). So the ceviche was really tasty. I enjoyed it quite a bit. They also brought out the potatoes at the very beginning. Weird. We ate them anyway because we didn't want them to get cold. The waitress saw it and apologized and said she had no idea why they came out so soon and she's bring more with our meal. That's a nice touch. The mains came out, and the tacos were miniscule. I lived in California. These tortillas were about 1/4 the size of the ones you'd get there. Two bite tacos apparently. And three of them. Granted they were only £6, but if you're hungry order two orders of tacos. The pork belly was really good though. Cooked well and crunchy crackling. But no spice. Zero. Nothing. I expect spice. And unfortunately they provide hot sauce, but only super nuclear hot sauces. I tried both, and enjoyed them, but they would overpower the dishes. The cilantro rice was spectacular. Some of the best I've had. The beans were good, but lacking a bit in spice as well. The potatoes themselves were great, and the mole was nice, but not spicy (you see a trend here with Not Spicy). The waitress did bring out some chipotle sauce as well, which was by far the best sauce that we tried. The quesadilla was good, but I can put chorizo and cheese on a flour tortilla at home. I just wanted something more. However it was tasty. So I give them props for that.So overall, 3.5. I'm feeling generous so I'm going to give them 4. However, there are better Mexican places within walking distance. At least better than the cafe. I haven't been to the restaurant (apparently there's an eight course tasting menu I might have to try to convince the other half to go back to). I might go back to the cafe if I'm with people who want to go, but I'd probably try to encourage them to go somewhere else instead. If they made a decent margarita and kicked up the spice a notch, it would be worthwhile. However the slightly underspiced meal is not something that would make me want a repeat performance.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "E1VTop8uFGD_h6r4b0gv9w": {
    "date": "11/22/2012",
    "text": "I've been here twice now. The portions are small but that suits me fine. I like the decor and the style of food. Clean loos which are important! The bottled chilli sauces are fluorescent and gross but the fresh ones they bring you are lush.  I don't quite remember what I ate the first time, but the 2nd, I had the lunch special which was flavourful and fresh on the whole. The sides of rice and beans were odd though. The beans were a bit sweet and the rice was bland and chewy.  I liked the staff although they brought me the wrong drink and then I had to wait ages for the right one.  I'd still come back though :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qSQ0nB8GdTIl1c4B1GG8YA"
  },
  "TJPigeXvupdlUb8bWslxvA": {
    "date": "12/7/2014",
    "text": "Arriving at the front of the restaurant you would never have a clue that this is a restaurant. Looking like the front of a sex shop, we find the very hidden door where we go downstairs to the restaurant. Please note that if you do not like loud music this is not the place for you! We sat down and ordered two cocktails and some appetizers. The appetizers came on good time, the cocktails however took a good 20mins! We then ordered our mains to which our waiter didn't seem too knowledgable on what is best to order. I took my own initiative and ordered the ribs with chili mash potato. I was pleasantly  satisfied with the ribs and mash. Along with the food we ordered some tequila shots to which the waiter never brought lime, despite asking every round for it! It seems like this place is under-staffed as the waiters seemed very overwhelmed with catering for everyone. Overall, great food..not the best customer service.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rj1iz-j0y0YfnUWogk3v9g"
  },
  "KRD7nCnfOO8Fg0iA5cYH-g": {
    "date": "8/29/2012",
    "text": "On a sultry Soho night, the office Joes and Olympic trippers trooping down Old Compton hardly notice Kate Moss extinguish her cigarette and stalk back into the sex shop. Is it that regular round here to see a supermodel (retired) in a sex shop? Given the in crowd's current predilection for hip Mexican La Bodega Negra, hidden behind the porny facade, it's probably not that unusual dahling.Following Kate down the staircase to this modish modern Mexican is a crowd definitely more Chelsea than Soho, beautiful blonde embassy types squired by ex Bullingdon Clubbers. This isn't entirely a bad thing. They bray less when they're out of their comfort zone and here just provide a slightly well-to-do wallpaper. The rest of the decor veers from New York Underground cool (distressed brickwork, exposed piping) to second toughest in the infants (the artfully carved cardboard clad VIP room currently occupied by La Moss and the cool kids looks like it was assembled by class 5b). Not that any of this matters, because the 'atmospheric' lighting stops you seeing much of it, or the food, or your fellow guests. The sevice was disarmingly friendly, with the exception of snappy, fraught bartenders, but occasionally bordered on slightly hapless  We went through three separate clean plates each for our shared starters (one of which didn't arrive until prompted and felt missed) and had our table turned on a ten minute notice in the same breath as being offered desserts. We were offered a space in the barrio chic bar to finish up before being moved on from there for another booking. All minor points, but given the ease you can spend £50-£60 a head without booze, these are things that need not to happenThe tacos, a bellweather dish in any Mexican restaurant, were pretty good in the main. Street food purists (and most Americans) might baulk at £6-£8 for a pair of the soft shelled snacks, each a two bite pop, but both lamb with a deeply savoury 'drunken' salsa and pork with grilled pineapple were excellent. A prawn number was superbly flavoured if a little too subtle for the likes of Kate's smoke raddled palate. Better than Wahaca? Almost certainly. But at three times the price you'd hope so.Mains were larger than expected. Given the average waist size of the crowd, I was expecting to sample a range of (very) small plates, but the mains were all plus size, verging on the American. The Author and I shared an excellent lamb barbecoa, slow roasted meat falling off the bone, cooked till tender in a rich, chocolatey sauce and served in an enormous chafing dish that occupied the table like a meat filled Olympic flame. It's not easy to split one of those up in the half light of the restaurant but we struggled manfully through it. There were some great flavours coming through in the deep rich cooking technique, and my only criticism could be that it left me with barely enough room to finish my (slightly hurried) dessert. Sides are extra, expensive and necessary, the big hunk of lamb came with nothing itself, a bit of a squizz for a £40 shared dish. The Publisher gamefully went for the sea bass that AA Gill had described as like antibiotics growing on a pantyliner. The red and green adobe topping was tasty if more muted than described, but the fish was perfectly well cooked and not noticeably like a Bodyform. Like much else, it was a deeply enjoyable dish that I'd order in future. With a surfeit of meat on the table, Dr Vole went for a slightly disappointing mushroom and tortilla salad. She enjoyed the flavours and contrasting textures but it added nothing to my understanding of Mexican cuisine, and was pretty much the only option if you didn't want meat or fish. I'm not sure how Mexican it is, but they've half-inched the Scandinavian inspired 'Frozen Berries with White Chocolate Sauce' from Le Caprice. I didn't notice any specifically Latino twist to it though it was as delicious as it has ever been. Dr Vole's Chocolate Fondant had the slightest spike of chilli and a quite superb Mole infused ice cream. That one is definitely worth returning for.Cocktails were excellent and I was impressed by the food on show, though I'm not sure it quite matches the pricing. This is rustic food in the main, with a variety of rich spicy sauces masking a number of usually cheaper cuts. The premium is for the atmosphere, and the bar, and on a buzzy Friday night, I didn't have a problem with that, though I might do on a slower Tuesday service.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "lT8ydDqBTGFeAcZreqnNsQ": {
    "date": "2/1/2013",
    "text": "I've been meaning to come here for a long time, the entrance has always intrigued me!! I eventually made it on Wednesday evening. It has a lovely atmosphere and is very quirky. the menu isnt extensive but very tasty, we had the lamb to share which was enormous and succulent great food, good service and nice atmosphere. I will be back!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CVuZkQRlkHzpLIowPk4Ndw": {
    "date": "8/10/2012",
    "text": "Went to the downstairs reservations only restaurant. Had an ok experience but wouldn't go back for a few reasons:1. Extremely overpriced for the quality - found the food to be quite bland2. Incredibly noisy and could barely hear each other talking3. Food came out way too quickly, all at once, and in no particular order, i.e. therefore if you order starters and mains, the main may come out first if it happens to be ready first.The only things I liked about it were more to do with the experience: sex shop entrance, cool interior and vibe, den like setting, chilled music.But there are much better places for Mexican street food in London.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLTU-EK-g59osf5dSVx3vA"
  },
  "pN9q72wOtg7kFXsrX3NG4A": {
    "date": "9/7/2013",
    "text": "seriously, great staff, perfect/fast service and a decor that make you want to linger, but the food, YIKES could it have been more salty?  me thinks not and calling itself Mexican, well that's more than a stretch, it's a bald faced lie.  definitely won't be back!!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "37_Lh52DeoFmvU-C8r-Qxg"
  },
  "Kj8w9VzAoFnEJCDw2jTTQA": {
    "date": "4/26/2012",
    "text": "I went with a few friends after hearing a lot about this place. We ate in the cafe which had a really nice ambiance. It's a little bit of a tight sqeenze - but this is not different than most restaurants in Soho. I'm not sure how long the restaurant has been open, but the service was a bit frantic  our meals didn't come at the same time and our appetizer arrived after the main course.The food itself was good, but nothing particularly outstanding. It might be worth giving the restaurant a try which as a bigger menu (but is a bit pricier).",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7vECigajreXsjnsaRd1eMQ": {
    "date": "6/29/2012",
    "text": "All style but no substance whilst the atmosphere and cocktails were great the food could, at best, be described as average. I love Mexican food and was really looking forward to some ceviche and a nice mole but was very let down. Left feeling like had just had very expensive bar food.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OkNcYVphYZyNklNpgCjLvg": {
    "date": "5/14/2012",
    "text": "I know some people didn't like it because of what it looks like from outside but I thought that was hilarious and the atmosphere and decor are great inside. good for group dinner and awesome for dates too. shame sometimes they don't let you in just for drinks when it is busy because i really like the set-up of the bar. food is good but didn't blow my mind. price is on the medium-high end. Worth a visit for sure.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "733wQlLxbghIWNkhkMhyKg": {
    "date": "3/21/2012",
    "text": "Move over Wahaca! Finding good Mexican in London is no easy task, but La Bodega Negra goes some way in filling the gap. I had high expectations, so I was initially disappointed that the staple  guacamole and corn chips didn't really impress. However everything after was delish.The highlight was the De Camaron Salteados, soft shell prawn tacos - of which we ordered a second serving straight away. The chorizo quesadillas were a very close second (I would have loved a second serving). The Tuna Tostadita was another highlight worth mentioning. We had desserts, which were definitely good - but if I had my time again, I'd order more mains (to share!). The food is backed up with solid cocktails, which frankly go down a little too easily. We ate in the cafe, where we had a short wait to get a table. The restaurant was booked out. Given it has only been open some seven days, I highly recommend going now before it becomes popular. After all, Geri Haliwell was walking around scoping the place out - that means it's going to be popular. Doesn't it?",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Dd9K9ytXkQC2sh0z2JNw-Q",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. De Camaron Salteados",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Dd9K9ytXkQC2sh0z2JNw-Q/o.jpg"
      }
    ],
    "user_id": "NkYQ_wHWcBuOh7vlD3Wa2w"
  },
  "PrMFq5S2kgHe9yUQyOcUkA": {
    "date": "1/6/2015",
    "text": "Came here the week it opened because of how much I loved La Esquina when I lived in New York. Sadly, I found it be more style than substance then. To my chagrin, it didn't live up to its sister restaurant across the pond. The second time was for a birthday party and, while the bar was very crowded and it was hard to get service, the drinks were top notch. This time around, we had a large table and were treated to the tasting menu. I gotta say, they hit it out of the ball park. I rarely order the large mains when I go to Mexican restaurants, perhaps because I am always desperate to find London's best taco. And the quesadillas were truly in a league of their own, I must say. But the fish, chicken and beef were each exquisite in their own way. Green chile, mole, and another sauce I tragically cannot remember at the moment accompanied their proteins with delectable aplomb.I cannot wait to go back, despite the kind of outrageous bill. Careful not to order too many margaritas, I guess. I think the restaurant space is also more enjoyable when it's less crowded. On the other hand, the DJ, while a bit too loud to promote conversation, was outstanding, spinning a masterful mix of classic and contemporary dance, funk, R&B, disco, and pop. Again, maybe it was the margaritas, but if he is on when you go (try Fridays), don't be dismayed; he'll have you dancing in (and out) of your seat by the time you finish your starter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AaT-JLOygZ7j1KOmzRkg7w"
  },
  "rJ8GzuVTsue7zOAwuqkGDg": {
    "date": "5/26/2014",
    "text": "This place was okay. Just okay, really. Nothing exceptional, and the portions were really stingy considering how much they cost.I had the mackerel ceviche which, for £8.00, consisted of a minuscule blob of said ceviche with a small garnishing of corn chips. It was very nice, but a ridiculously small portion for said price. I even mentioned this to the waiter, who explained that ceviche is usually served in small portions. This would have been better received had I not spent some time living in Perú, where the dish originates from - I can tell you that over there, the dish is served in far more generous portions, as well as being cheaper and more tasty.The waiter we had was really friendly, but the service was pretty slow. There were three of us, and two of us received and had finished our food by the time the third person's crab burger was brought over. They had obviously forgotten to order it, but to their credit, they took it off the bill for us.I thought it was pretty cheeky how they charged us £4 for chips and dip considering we didn't even order it - the waiter just brought it over to us, so we assumed it was complimentary. The decor is pretty cool, like some sort of Mexico-if-you're-off-your-face-on-coke type thing. Despite the service being slow for our table (the restaurant was very empty), according to my friend, the lead singer of some band called Marina and the Diamonds was sat opposite us, which would explain why their table was waited on with a lot more alacrity than ours.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jpgx9s5BTfyJ_SxWug_fjQ"
  },
  "0lOUR9kPJEwOCpHuYbtrJA": {
    "date": "8/6/2014",
    "text": "So promising, yet such, such a fail. This was my second time here and it was a markedly different experience from the first. I arrived first and sat again at the bar. Then I was WARNED by the host that I had to order food as they didn't have an alcohol license. I then had to flag down the laissez faire bartender to eventually order a drink. By the time my friend arrived and we had a round, the place was filling up a bit but plenty of seats still available. As we were about to order another drink, we were warned for the third time about food and asked if we were ready to order. I ordered some chips and guac and was told that we both had to order a substantial meal in order to drink there. FFS. This was not told to me by the hostess and I feel is just a heavy handed tactic by the restaurant. We left, since I hate being pressured into anything. The bartender then cheekily told us to come back later when we were hungry, yeah, don't hold your breath, buddy.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "GUZ6qpOMP_XI_u3KFOCkFA": {
    "date": "1/23/2014",
    "text": "Ordered: Burritos and some other stuffPrice: £20 per head. Burritos - £12????Review: It has been over hyped by the entrance. But still not a bad place to eat if you want a burrito on the fly. Don't plan to come here - just stop by if you're in the area??? Maybe Sunday night wasn't the right day to choose???",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxDOuSJm1uZIMAnEL__juQ"
  },
  "fOzQyjt_NbXuCKpZRRV7xw": {
    "date": "8/7/2015",
    "text": "Summing up our experience in the cafe (not restaurant) I have one word: cheese. Obviously a major part of the cuisine, but there was cheese in everything. Even in the black beans which was a big disappointment and made it too stodgy. I had the £18 8 x tacquitos, one of each of the flavours/fillings. A nice idea but lacked individual flavour and all merged into a single taste. The best was the the crispy pork belly and also the prawn. The service was slow and inattentive, and the music was too loud for them to hear our order. Generally the prices were quite high and the food was ok but not great enough to justify them. (Visit - 13/11/2014 Dinner)",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3QkozspSmuLnqHf6ZyFsg"
  },
  "8LflvSBKALqqGsp9523Y1A": {
    "date": "6/4/2013",
    "text": "I'm hovering between three and four stars, because there were some really cool parts of La Bodega Negra, and some that could have been even cooler.First off, the DJ was fabulous. The entire dinner was punctuated with comments of \"oh, I love this song\" and \"great choice\"... in a place where the music is loud, you at least want it to be great.The service is nice, because our server was certainly friendly, but she forgot a few things and was hard to get a hold of... most restaurants are pretty attentive, so it felt weird that there were times where the meal didn't flow that much. That being said, we got in and out super fast! We had a 10pm reservation and were fed and happy by 10:45, though we sat for another half hour enjoying ourselves, the conversation and the last of our drinks.Speaking of, they make great cocktails. I tried the Diablo, which was smooth and fruity and light and probably just as wily as its namesake. The Tijuana Whore I sipped from my friend was also good, definitely the best tabasco cocktail I've ever had.Our food was good, though the portions are really small and very highly priced. When the server said we should order 4-5 each, I knew my wallet couldn't handle it, so I split a few things and managed to feel full but not too full. Overall, it was a cool experience. Definitely a fun Tequila Tuesday, and somewhere I'd heard a lot about. Getting to dine in the \"sex shop\" which really is a cozy underground lair was a neat experience, and I'm excited to try the new restaurant next week!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "tWHFVH5HG5H8Af7M_NmGKw": {
    "date": "5/24/2015",
    "text": "This place is fun, tasty and has character. I particularly enjoyed their spicy Margarita and the service was very good. The atmosphere is lively and has a grunge-like diner feel to it. While we only had drinks and a some tortilla chips I'm keen to come back for más! Olé this is a great place to dine, hangout and get some drinks, y'all. This American Southerner in London is a fan and thinks you might be as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfVxnwV2tZuLq6wIpIKxaQ"
  },
  "vzvEOtKhaWZLOPAK6HhELw": {
    "date": "12/11/2013",
    "text": "Coming from SF it is hard for other places to live up to the variety and quality of food.  London is a great place for food, but I would say spend your money elsewhere.None of the dishes that we ordered came with sides.  We had 2 orders of tacos, crab burger and the spatch cooked chicken.  Soft Shell Crab Burger - Pretty decent, would order it again but not for 10 gbp.Tacos - tiny and didn't seem special, expensive and costs 5 gbp for a side of beans and rice.  Otherwise you will pay more for beans or rice separately for other entrees.Spatch Cooked Chicken- the pumpkin mole wasn't anything special.  A bit runny and flavorlessThe appetizer guacamole was over salted.Had high hopes but was left dissapointed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghtOIiJvk0oFR7ttFY5u7A"
  },
  "xuy-PJsEM_ED7NU0hVnc9w": {
    "date": "2/11/2014",
    "text": "This was our first restaurant for our second trip in London, and well, I wish we would've went with another option.We ordered two drinks and one of the two, the Watermelon Slush was more so like an actually slushy at the mall (no alcohol). I ordered the soft shell crab burger and my husband ordered the heuvos rancheros. We also ordered the potato and chorizo tacos and a side of rice (none of the entrees comes with sides).The side of rice was the only thing appetizing. The soft shell crab was very plain and just tasted like fried dough in the burger with mayo. My husband's plate was very salty and the tacos were quite small and salty as well.Lastly, our waitress was unwelcoming in every way. The restaurant had loud music playing, which made it hard to hear what the person next to you or better yet, your waitress was saying. She seemed very annoyed when we asked her to repeat what she said and more upset, when we asked her if we could add gratuity after she had slid our card already. Really? The gratuity was for her? She responded, \"It's too late.\" which a definite attitude.The overall experience was a bad start to our London vacation.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NbnbrxQFTMiOSiF9dtKuXg"
  },
  "-PAFJpD236Fvu5VzXle9MQ": {
    "date": "6/25/2012",
    "text": "A newer restaurant to the growing Mexican street food scene, La Bodega Negra has also joined the ranks of the London's growing hoity toity cafes that do not take any reservations. Calling even a day before hand, the restaurant was full and we had to settle for the cafe and do a walk-in. Granted, it was Friday night, at 7:45pm, an hour wait wasn't too bad. We trucked back to Rupert Street bar for a pint before heading back to the cafe. We were seated pretty much immediately thereafter. The atmosphere was great. It was great to sit right over where the chef was making cerviche. We ordered a couple glasses of wine, the Tuna Cerviche, Tuna Tostada, and three types of Tacos - Al Pastor (pork), Lamb, and the Kale and Mushroom. I think the dishes that were most forgettable were the Kale and Mushroom Tacos and the Tuna Tostada. They were mildly bland and the Tuna Tostada was a single serving and ridiculously expensive for the serving size. However, the Tuna Cerviche and the two other Tacos were absolutely divine. The Al Pastor was probably the best dish at the table, and I probably could have downed three more of them myself. I'd agree with most folk here that the place is a bit pricey for what it is. I'd come back, but immediately after payday because for £25 a pop and not that much food, I'd probably not be able to afford it otherwise.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "_5pQIxCTGyjd89bqgUonNg"
  },
  "AeYCMVea-Z7kR242Ehiz8Q": {
    "date": "8/6/2012",
    "text": "Tried to get a booking for the restaurant.  I like the ambiance of La Esquina in NYC so was looking forward to trying out the London version. Unfortunately, it was fully booked but the nice lady told me that they have a cafe round the corner (i.e. the one you can comfortably take your granny/children/elderly spinster auntie to) which is walk-in. So we settled for that.The cafe menu is fairly limited with a few choices of starters, some tacos, some salads and some bigger mains.  The food was good.  Favourites of the table were the prawn tacos, the green rice and the beans.  The other tacos and the tuna ceviche were unmemorable. Friendly, happy service although the servers can get a little rushed off their feet later on in the evening when the place starts to fill up.UPDATE - 6 Aug 12 - RESTAURANTThe bill for four of us came up to £320. Wow. In the words of the very eloquent JP McEnroe (1959 - ) I felt like yelling, \"You cannot be serious!?\"Might I add that we left the restaurant satiated but not stuffed and definitely not even tipsy.  The food was ok but SO NOT worth those Michelin star prices. The tacos are served in pairs and the diameter of the palm of a child's hand. So if you are a party of four you have to order two of everything. Then they have the gall to kick you off your table after two hours.  For £80 a head you get the pleasure of mediocre tacos and margaritas from Lilliput as well as 120mins (no longer, mind!) to eat it.Oh, and the server spilled taco oil all down my rather costly handbag. 'nuff ranting.  I will not be going back. So, so overrated.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0x1bkKr058NHXTPMA4-qA"
  },
  "ANVZbL41LTLSMr_EQ_uC-w": {
    "date": "11/4/2012",
    "text": "This review is for the cafe, not the restaurant so, unfortunately, no fun entrance through a sex shop....Ok, first off, I would have given 4 stars, but I have to knock off a star because they had NO Guacamole!! I'm sorry but, a Mexican eatery with NO Guacamole?? WTF??...not impressed....Overall, the food was nice, sauces served were not hot, however, the bottles of hot sauces on the tables were pretty hot! good stuff!We had the lunch special: 3 taco's, a serving of rice, a serving of beans and a Hibiscus soft drink. This was £10.Portions were small, but it was filling. Service was good and they sell the bottles of the Hot sauces!Very similar to Wahaca's, but a shorter menu here.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "zsoWSWArk1wJM2K5CeTPRQ": {
    "date": "4/1/2012",
    "text": "I have already been to La Bodega Negra a couple of times (once to the cafe and once to the restaurant) which is probably a good sign.  I am going to concentrate on the restaurant as I preferred this over the cafe which although fun, somewhat pales into comparison once you have been to the restaurant.The restaurant is accessed from a 'Sex Shop' on Old Compton Street which is quite entertaining.  I wonder how many people walk in without realising it is a restaurant as there is no signage for La Bodega Negra from the street.  Once inside you are escorted downstairs into the subterranean space, most of which is given over to the restaurant, although there is also a small bar.  The decor is dark and stylish with themed alcoves and hoards of diners tucking into the Mexican inspired menu.  An eclectic selection of music provided a sense of fun - everything from the Rolling Stones to M.I.A. to the theme from Austin Powers. It sounds a bit weird but worked and the up tempo beat of each track was in keeping with an atmosphere which was, at times, slightly frenetic.We were sat next to a group of Spanish speaking friends, which we took to be a good sign and immediately tucked into the relatively short cocktail list.  The Spiced Daiquiri was too sweet for my taste (too much pineapple juice to blame) but the Margaritas we ordered later were much better.  We also enjoyed the food, ordering a selection of Tacos, Tostaditas and a plate of Camarones to start.  The Tacos were seriously addictive and had we not ordered a heap of other food, I suspect that we could have happily feasted on these all night.  I also enjoyed the Camarones which were served, perfectly cooked, with a spicy tomato based sauce.For our main course,  we ordered the slow roasted lamb for 2 to share. This is a serious dish, served on the bone on a hot plate at the table.  The lamb was perfectly tender, flaking off the bone although the sauce which accompanied it could have had a bit more kick.To finish, we both ordered the churros which came with two dipping sauces  - dark chocolate and caramel.  While both the dipping sauces delivered bags of flavour, the churros themselves were not as I expected - think random dollops of doughnut rather than the more precise piped doughnuts that I have enjoyed before.  In addition, the portion is huge! One order to share would have been enough for us.While the food was not necessarily perfect, we still loved the experience.  Everything about the restaurant, from the entrance through to the decor and music, helped to build a fun atmosphere and it was clear to me that we were not the only patrons who were enjoying ourselves.  We are already planning a return visit!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sXcEvJHocUnXLGl0xILYgw"
  },
  "3_PxsB8HGFHg7zJIq9vJDw": {
    "date": "8/29/2013",
    "text": "Its a good date night restaurant, but there's better Mexican food in Soho, certainly. You pay (extra) here for the atmosphere and the setting, the design of which is about as exciting, imaginative and oh-so-contemporary as its possible to be in a Soho basement circa 2013. For added larks the door is situated next to a (deliberately placed) large neon sign that says \"Sex Shop\" with a mannequin in the entrance sporting a gimp suit.  You find the excitement of transgression offset by the notion that you could have been spotted walking in unawares by a friend of your mother-in-law's who will forever change her view of you and it'll take six Christmas parties to find out exactly why.  I went in once as a single guy and was turned away by the door team, presumably there to weed out those seeking Mexican food and (admittedly excellent) cocktails as opposed to the spicier delights ostensibly advertised.  My intentions were pure but I think they assumed the worst, which is why I wont be going back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zubZ2_xPjqmZQC5ZoLn7w"
  },
  "HstoyV3I_z5UOYGBhNcJhg": {
    "date": "3/31/2012",
    "text": "Billed as being the next big dining thing in London, La Bodega Negra's cafe managed to carry off a laid-back lunch service for me on a Saturday. I came for the modern Euro interpretation of Mexican food. I stayed for the du jour NYC casual dining atmosphere.The pork tacos were tiny but enjoyable with the addition of Cholula.The friojoles negros were bland.The chips and guacamole - nothing special.You might blame my food choices. Maybe there are still undiscovered dishes that aren't to be missed.But:The house-made hot sauces weren't hot (even the 'hot' one).And the margarita was weak and thin.The cafe itself, with the bar at its heart, was certainly welcoming and comfortable - a perfect place for a catch up with friends and do a spot of Soho people watching from one of the tables by the front window (arrive early to get one). I might return.Might.I've come to expect disappointing Mexican food in London, but watery margaritas are nigh-on unforgivable.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "pt_qLpdy3BDdjN7fMr1OVg": {
    "date": "2/9/2013",
    "text": "La Bodega Negra's downstairs restaurant is very nearly trying too hard, but definitely on the right track, and it's impossible not to be swept up in a bubble of infectious hedonism.  Accessed speakeasy style through the faux sex shop frontage, it's reassuring to be immediately greeted and have someone there to take your coat and show you downstairs. You can hear the buzz before stepping into the softly glowing cellar pulsing with drinkers and diners, giving you the satisfying feeling that you've just arrived at the best party in town as you weave through the tables to your seats. With margaritas flowing and sizzling platters and racks of tacos being delivered left, right and centre, it's a hive of activity, and draws a fascinating crowd - who knows who might be cloistered in one of the booths. This is a frenetic fun fueled environment reflected in an eclectic mix of consistently upbeat music. There were a couple of occasions where the lighting was dimmed a little too much, then corrected (there was a risk of returning from a trip to the bathroom and sidling up to the wrong companion). And whoever was in control of the music had a few contrary moments - sometimes they'd get halfway through a track and decide, actually, no, they'd prefer something else, before changing their mind again. But this all seemed delightfully entertaining, as if arriving on the first night of some new avant-garde improvised cabaret show, with an exciting undercurrent where anything could happen. When you leave planning the next opportunity to return, it's definitely gone well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WpyL_tAWvAF8YT7QH_UD3Q"
  },
  "O45rPTiAoSg4BKOT_TqIZA": {
    "date": "4/9/2012",
    "text": "The tacos are very good (especially for London).  They even have carb-less tacos using Jicama root sliced tortilla thin to hold it all together.  Steak tacos are very spicy and a surprise given the local tolerance for spice.  Decor is reminiscent of NYC sister La Esquina with a much smaller budget.  Fun place!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BAOWWEEfl1LgrdjTwOlABw",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Tacos, Tacos, Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BAOWWEEfl1LgrdjTwOlABw/o.jpg"
      }
    ],
    "user_id": "vgnxCeEh7M8SXHnm4yKC1Q"
  },
  "Bli-SGkWsmrRI01vMTupcA": {
    "date": "1/7/2013",
    "text": "This is a review of the cafe, not the restaurant with the funky entrance.It's astonishing how many new Mexican places London has gotten in the past couple of years (!) so there are several places to choose from. Like the main restaurant, this place can be a bit of a zoo. But that is what you are expecting, right? Call ahead, come early and see what you can do. We had a really fun evening, sitting at the bar and trying a bunch of different small plates. The guacamole was very enjoyable, and we enjoyed several of the different flavors of tacos.I didn't try any of them, but it looks like they have a good selection of mezcals which seem to have come into fashion recently.Gluten-free notes: Most Mexican food is gluten-free. The tortillas used in their tacos were correctly masa harina (corn flour) only. Quesadillas are, as usual, made out of wheat flour. If I remember correctly, they were willing to make me a quesadilla with corn flour only, which was a treat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "CQTXx_Lx61c-9RQ1Iu9WwQ": {
    "date": "2/14/2015",
    "text": "Good food, horrific manager. We had our reservation until 8pm, kicked us out at 7:35 for another party. Apparently that was bad timing on their part, but we have to leave because they didn't plan for us to be there for the full time of our reservation.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pNXsO-RU6zPp-CZdoD3u1g"
  },
  "lzrvxEF_69sD9ibe6DxJjg": {
    "date": "8/7/2018",
    "text": "I've been here twice now and both were great experiences.  The tacos are all fantastic but the duck and fish ones are especially good. The quesadilla rustica is also very good. They have good mixed drinks, some I've never heard of but were fantastic.  Neat atmosphere and a convenient location in SOHO. I highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ulOU3d9EodzT-XSUgbm0g",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. The quesadilla rustica.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0ulOU3d9EodzT-XSUgbm0g/o.jpg"
      },
      {
        "img_id": "ep85z3VYzrd5T7XLaYdHJQ",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Plate of the 6 different tacos. Each excellent.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ep85z3VYzrd5T7XLaYdHJQ/o.jpg"
      }
    ],
    "user_id": "kjfF-u8c55wI8f9Oouac8Q"
  },
  "e0ntlNW8QGVY63mCJb7Byg": {
    "date": "10/23/2018",
    "text": "This place is loud!! But yes fun and a great place to get together for drinks and Mexican food if you are in the soho area. Food was ok my favorite was the quesadilla and the tuna. I had a regular was a regular one and I definitely had better but other people had the mascal margarita and they said it was great!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nafBTudEm0KLB_TeFK6Elg",
        "caption": "Photo of La Bodega Negra - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nafBTudEm0KLB_TeFK6Elg/o.jpg"
      }
    ],
    "user_id": "ftBfZ1NH_hmo8Q2HJg2I7A"
  },
  "iS3vlmlLWawcSlvkRSJNRw": {
    "date": "2/3/2018",
    "text": "We were 5 ppl and the fajitas had 4 tortilla breads - they denied to bring an extra bread as they said the portions are set....",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tv5qwdNz4DM_nyl_BGW9Dw"
  },
  "GkKs3Viq6iTzlRKGBEIDpQ": {
    "date": "1/22/2017",
    "text": "I was just telling my friend how I can never find good Mexican food in London when he kindly showed me La Bodega Negra- and I promptly retracted my previous statement! I really like everything about this place - from the quirky entrance (I won't give too much away here...) to the bar atmosphere, to the food, to - most important - the margaritas. We met some very nice people here at the bar and many tequila shots later we were all fast friends. Great place to go with locals and out of towners alike - everyone will be sure to enjoy. It's centrally located in Piccadilly, making it easy to find but it's also hidden enough off the main drag to not be clogged with tourists. Food is great with creative spins on Mexican classics - I loved the tacos especially. I plan on taking some visitors here next week and am eager to revisit La Bodega Negra and hope they like it as much as I do.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "RORrWniaUl8nseq47oLOyg"
  },
  "pn8l4d3YKIvSITUdaxvXHw": {
    "date": "2/14/2016",
    "text": "Lovely evening and in a stunning atmosphere!The moment I arrived at the door I knew it will be a night to remember.  The decor is amazing and the staff live it up!  The menu is creative and fresh with many tasty options.  We selected a big selection to share and everything was very tasty.  I will definitely go back!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0DNDsDnVhdfgF0GqgSn6LA",
        "caption": "Photo of La Bodega Negra - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0DNDsDnVhdfgF0GqgSn6LA/o.jpg"
      }
    ],
    "user_id": "TAOass0cFSHdU0JBfZRDOg"
  },
  "_pj9nnjbxp-4Rx_f4AgsaQ": {
    "date": "11/7/2015",
    "text": "I came here with a couple of friends for dinner and drinks, and it started out pretty well. Our Pisco sours were decent, and the staff seated us at the bar until a table opened up, which wasn't long at all. The food was okay - I had the camaron tacos, and while the flavor was good, the taco shells were very disappointing. They were closer to paper than tortillas, very thin, and crumbled in your hands. It was also very loud - the three of us couldn't hear each other even while yelling over the music.What ruined this place for me was that one of the staff members came up to our table and told us that they'd be kicking us out soon. I could understand if we had been there for hours just wasting time and taking up space, but we hadn't even hit the 2-hour mark at our table, and my friend had just gotten her glass of wine when they told us our time was up. It struck me as rude and unprofessional. THEN, when we asked for the bill because we were being rushed out, it took ages to get the bill. I know it was a busy Friday night, but we had waited our turn for the table, and should have been allowed to finish our meal in peace.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FVHD03qWKyg2MJJmDegGtA"
  },
  "qc3AQD1HxCq6GJgSBlGFzg": {
    "date": "5/18/2015",
    "text": "First of, all thumbs for great service and cheery smiles on a busy Saturday night. My husband, an acquaintance and myself came here after crappier food and service at Shakfuyu. I got the camaron tacos (3 for 8 quid) and he got the lamb tacos (8 as well). The acquaintance got the soft-shell crab burger. The camarones were quite juicy and the chipotle mayo a slightly spicy touch. My only complaint were the tortilla shells sucked. They are tiny but even worse, paper-thin. Uhhhhh, I know good tacos and they are corn and at least semi-sturdy. So giant fail. My husband said his lamb had a great flavour. Not sure how the soft shell burger turned out.The waiter was around pretty regularly for drink refills and order queries, which was greatly appreciated.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "L4iZ4LQSHoPyLGwgGRpJ1A": {
    "date": "8/16/2016",
    "text": "Mouth watering. Try the hibiscus margarita, so unique, and oh so good. The staff was absolutely fantastic. I have dietary issues (wheat and dairy), so Mexican establishments' menus can be a bit of a minefield. I told the guy I didn't want cheese on something, and he promptly sat down next to me with an excel sheet of all the allergens, and listed off all the things I could eat. It was so personable and friendly I was instantly wooed.All the food is locally sourced out of England, and though it wasn't terribly authentic compared to what I get back in the states, the experience wasn't lessened in the slightest. All I can say is GO to this place. Even just to see the decor. The vibe is so colorful and hip. I 100% recommend chasing dinner with a margarita at the bar downstairs. The set up and decor is vibrant and unique. Neon signs, hanging wicker chairs. Really a fabulous atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77iTaWU2oTg5D3K8JbFIXw"
  },
  "dFB3QYSCDyumUrjVdeNpGQ": {
    "date": "1/19/2017",
    "text": "God awful. I have had mexican/hispanic food all over the world and this is by far the worst mexican food i have ever had in my entire life. Taco bell is way better. The queso tastes like throw up in your mouth and everything is tasteless.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWRoGBTifIi-lvBMie6G1g"
  },
  "WrEOkj8nwrlKL0lwhnnzGg": {
    "date": "1/9/2015",
    "text": "Ah tacos! I am on a constant hunt for good even decent Mexican food in London, most especially tacos, so when a friend says 'I know a place' my heart skips a beat only to be disappointed later. Because of this it was with low expectations that I walked into La Botega Negra a predictably decorated Mexican styled, 'cantina. Or what most of the world considers to be 'south of the boarder' decor with wooden tables, distressed paint, and a bar with as many tequila bottles they can show off. Yet it was exactly what I wanted and couldn't wait to order up, sip a margarita and try the food. As it turned out Botega Negra was pretty darn good, The guacamole could use a bit more seasoning, but the tacos al pastor were quite satisfying and I was tempted to have another order. Always a good sign. I would definitely to back, and seeing that it is right in the middle of Soho makes for great post boozing munchies.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PAFlpDtI9gwR8gyt1kB5jA"
  },
  "yiZ3Zntt0e7jragKT8h_vQ": {
    "date": "11/23/2014",
    "text": "For the first inaugural Taco Tuesday, we went to La Bodega Negra. Did the name seem eerily similar to La Bogedita del Medio which would suggest Cuban food? Sure.... it's a stretch, but a little.  Was the restaurant COMPLETELY empty from noon to one?  Yes....But why heed any warning signs.Both of us went for the two course lunch menu:* Empanada- In my experience, empanadas are not an obvious Mexican starter.  I am not a food historian or anything and really like empanadas, so ....o Huitaloche -  This was the vegetarian option, but for the sake of completeness we ordered it. The mushrooms, which were featured, were hearty and there was a nice spice. I didn't know it at the time, but it would be the best part of the meal.o Oxtail - Again, oxtail is not the meat that comes to mind when I think of Mexican food. (I am not nearly the purist that I sound). The filling had a cinnamony mole-esq feel, that I was not all that into. * \"pastor\" burrito - Thank goodness for the word meh and the Cholula on the table. The burrito was on the dry side and there. I do not say this lightly, but I think a Chipotle burrito is better.* Chicken tacos - First off, why was fish not an option? Seems a bit (un)fishy to me. I have already used the word meh, so ... I will resort to ho hum.We discussed ordering a pitcher of Sangria but they say it's not good to drink alone. This may indeed be a place for good drinks and a fun night out, but it is not a place  for good Mexican food.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "38oUl0oeovZixECjd5XtIw",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Chicken taco & Pastor burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/38oUl0oeovZixECjd5XtIw/o.jpg"
      }
    ],
    "user_id": "a3JVxSMRFT7MARL6NJrq9Q"
  },
  "BjVr8OPPMxmsnBmF_dLVhQ": {
    "date": "4/21/2012",
    "text": "Again... the quest for Mexican food continues!  I have to say that the website was very interesting and the menu looked a little similar to Wahaca, but still a bit different.  When I got there, I had to wait for a staff member to acknowledge me... the hosts/hostesses seemed to be a bit occupied at the bar chatting.  I was shown to a table, but the tables were so close that it was difficult to squeeze through to the bench... I thought my butt was going end up in the lunch at the table next to me.  And that's saying something because my butt is flat as a pancake.Anyway, the waitress came over and asked me if I had any questions about the menu.  I asked her if she had any recommendations since a lot of the things on the menu looked good to me, but she just looked at me blankly.  So I just ordered.  I'm not used to having to pay for tortilla chips and salsa as that usually comes free at Mexican restaurants in the states, but I wanted some, so I decided to order some.  One of the quesadillas that was on the menu online, was not on the menu at the restaurant, so I went with the Chorizo and Butternut Squash Tacos with the Cowboy Beans and Green Rice.The tortilla chips came out with guacamole and salsa fresca (I'd call it pico de gallo...).  The chips could have been warmed and salted, the guac was nice and the salsa fresca was nice.  The waitress who brought the chips over explained the two sauces on my table.  One was a chili sauce and the other was a cilantro (coriander if you are British) based sauce.  I liked the cilantro sauce and liked mixing it with the salsa fresca.  I did like the fact that there were lots of tortilla chips, but I didn't feel like there was enough guac or salsa fresca for the tortilla chips, especially if I were sharing these with friends.My tacos came out... wasn't sure what to expect since at Wahaca it is the tiny tacos... the tacos were the same.  There was too much filling inside to pick them up and eat them, but I refuse to eat a taco with a fork and knife as they are meant to be eaten with your hands.  So I took my fork and speared some of the filling and ate it separately.  HOLY HEAT!  And I mean spicy heat!  I'm not sure if it was the sauce or the chorizo, but my tongue was burning.  I like spice, but this actually hurt a bit, so much so that I couldn't enjoy the flavor of the green rice.  So I took a moment, had more salsa fresca and took a couple of gulps of my Corona (which was cool, but really should be ice cold).  I decided to eat the green rice first... which was lovely and I liked it more than Wahaca's green rice.  I hate to keep comparing to Wahaca, but from my experience, it is the most similar to it.  I did not enjoy the Cowboy Beans, which were more like a bean soup.  I finished the tacos, but my mouth was on fire.  I had wanted to try dessert... the banana bread with the cinnamon butter, but I wouldn't have been able to taste it!  The only flavor I could taste before my mouth started burning was the chorizo, I didn't get any butternut squash.  If they could tone down the heat on that one, it would probably be delicious, but then again for those of you who like the pain, then this one is for you.  I did think that the place was a bit pricey, especially since I was eating at the cafe, not the restaurant.  I would go back to try something else on the menu and I would definitely ask for another side of the green rice instead of the Cowboy Beans if they came with whatever I ordered.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QPQ38wmd_oMimpMGJxQUdA",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Chorizo and Butternut Squash Tacos with Cowboy Beans and Green Rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QPQ38wmd_oMimpMGJxQUdA/o.jpg"
      }
    ],
    "user_id": "GIjIJxRZs5cCjwW9iJFzMg"
  },
  "tVPiWwvP4LFbjPh7ECrZqw": {
    "date": "9/7/2012",
    "text": "Very, very cool and well hidden. Find it beneath loads of seedy neon and you've hit the jack pot!During our visit we enjoyed...*Camarones - Just the right amount of spice and cooked to perfection*Bbq octopus - Not my favorite dish there but definitely good*Rock oysters - Fresh! Well prepared will pico, a unique twist on this simple delight *Scallop and yellow fin ceviches - Both worth a taste for sure* Sea Bass - One of the best sea bass dishes I've EVER had. Done sooo very right.* Tacos - Small but ridiculously good. They come in a very ingenious serving tray.I am originally from Austin, TX and this place reminded me a bit of home. The interior is very well done and the food is great so I definitely recommend trying it for yourself!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VRnX_K9qw9cPKAg5ltg-Tg",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. The entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VRnX_K9qw9cPKAg5ltg-Tg/o.jpg"
      }
    ],
    "user_id": "Auw-d-fvSqVXnWDekZd-bw"
  },
  "vsu5IfnGr7yB5G7PQ16vVw": {
    "date": "12/10/2013",
    "text": "Pretty awesome ruse of a strip club lured me in but the drinks made me stay. I love a place that has free (with tip of course) coat check and and lively music on a monday night. So i went out on a monday, don't judge me. Mexican-esqe vibe, low ceilings, candles, lots of tequilas. Really chill. The bartenders were attentive, the crowd fun and there was enough room to have your personal space but still close enough to people if need be. The music can be a bit loud, but it was otherwise really fun. I don't remember what I had because I just  told the bartender to make me something juicy and awesome like me.. and it was. Something with grapefruit and bubbles. Twas nice.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "9pwIwemBONrXX7tNwFDQ_g": {
    "date": "6/2/2013",
    "text": "As much as I wanted to see the peep show, I couldn't get reservations until 10PM so my friend and I settled for the cafe. LBN is crazy popular and always buzzing with a crowd. There weren't any tables at the time, but there was space at the bar so we just sat there. Our bartender was friendly and I let him surprise me with a special drink. I have no clue what it was, but it was very good.So what makes LBN cool? The atmosphere. To be honest, the food isn't really all that great. Taste-wise, you can do a lot better. I felt I got a little ripped off because I got 3 measly little tacos for 9 pounds. When you get Camaron tacos with only one prawn in it, it doesn't exactly count as a substantial meal. My friend and I also decided to split a mushroom quesadilla. I wasn't expecting much but it actually was really good. Wish I went with the quesadilla as opposed to the tacos. At least with the quesadilla, you'll get more of your money's worth. Although I wasn't overly impressed with my overall experience here, I still want to check out this underground tequila peep show side of LBN.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SJajtSBDlpzcstaHJUE-lA",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Mushroom quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SJajtSBDlpzcstaHJUE-lA/o.jpg"
      },
      {
        "img_id": "frtlJ2V9FGp-RQQGOLkZ0g",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Camaron tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/frtlJ2V9FGp-RQQGOLkZ0g/o.jpg"
      },
      {
        "img_id": "yPmqZcIXUDlmytOUop9e5g",
        "caption": "Photo of La Bodega Negra - London, United Kingdom. Chicken tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yPmqZcIXUDlmytOUop9e5g/o.jpg"
      }
    ],
    "user_id": "3jjiY5D7oIlKeiCIZGHQew"
  },
  "1Qn9sGsb2FBuIQY5_IXcUA": {
    "date": "3/11/2014",
    "text": "So most people will probably stumble across the brightly-lit, street-level LBN café and stop for a Mexican fix. Fair enough. But if you fancy somewhere a bit more interesting, then for a bit more effort you want their hidden basement restaurant around the back.By 'effort' I mean you'll have to book a table in advance, and be shameless enough to walk into what looks like a sex shop complete with neon signs on the door. Luckily I'd been warned about the novelty entrance, though for a split second I still wondered if my mate was having me on when I scurried in to find a woman with a clipboard surrounded by some bizarre glass cased exhibits...I needn't have worried as the place goes from seedy to wellll sexy once you head down the stairs into a series of candle-lit caves - didn't appreciate how big the place was until I ventured to the loo! Our party of 5 got a comfy booth and I was soon sipping a Watermelon Lush - a tough choice as the cocktail list sounded pretty lush all over.They add to the sexy secret lair atmosphere with good-looking staff and dim lighting, though be warned this also makes the menu a bit of a squint and wasn't ideal when fumbling around for the bracelet I managed to drop under the table (phone torch a go-go). Probably a nice light to admire a date in I'd imagine.Sexiness only gets them so far though; I knocked it down to 3-stars because the food was just okay. Portions are small whilst prices are high and nothing really got me excited - choose the quesadillas over the tacos, and veggies won't be spoiled for choice. If nothing else though I learned that chihuahua is also a cheese, not just a small dog. Who knew :P",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "APboyiNk5etUDuSW3UBw9Q": {
    "date": "7/30/2016",
    "text": "If you come to London you MUST come here! Amazing tacos. Quesadilla is outstanding. Good drinks. Fun vibe. Come to the \"casual\" bar side of the restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8rru5Z_1HjjYTgAfjqhaQ"
  },
  "tKPqOjeHcpA0HowkRltEcA": {
    "date": "4/15/2013",
    "text": "So..... the ceviche is good, but the portion size is small.  The tacos, and I tried beef, chicken and pork were all bland.  Don't bother trying to spice them up with the supplied range range of sauces in ramekins on your table, they're bland too.  The chicken quesadilla is OK, but really, it's bland.  Even their salsa de tomatillo is bland......How the F$%& did they manage that!!!!!!?????  The only thing that isnt bland here are the two little bottles of chilli sauce on the table and as they're both made with habaneros they make your tongue hurt and your mouth numb which is what you reach for in a desperate attempt to stop the £50 of food you ordered taste less like cardboard.  Fortunately, deactivation of all oral sensory capability makes no difference to the food here.As an alternative, why not buy a small packet of tissues for 50p and chew them for a Bodega Negra taste experience while you look for another local restaurant using the handy Yelp application on your IPhone.   It's overpriced by about 30% and underflavoured by about 70%.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S3c4_-Xb4cFK_xR3kE43Pg",
        "caption": "Photo of La Bodega Negra - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S3c4_-Xb4cFK_xR3kE43Pg/o.jpg"
      }
    ],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "CNLQUFObaTJbXTakYYBzzg": {
    "date": "7/4/2012",
    "text": "La Bodegra Negra is above average Mexican fare in Soho on par with Wahaca. The menu looked great --- especially the selection of tacos. However at the time I wasn't able to mix and match---I had to get 3 tacos of the same kind which was a bit of a let down and hopefully something they will address---I really wanted to try multiple. The steak tacos were the highlight by far.Service was spotty, they forgot a few of the dishes even with a few reminders. I went opening month so it's possible there were quite a few kinks that team Bodega Negra didn't have a chance work out. They do make nice margaritas although they are very tiny. Again as the service was slow (and this was on a not so busy weekend afternoon), we had to order 2 margaritas at a time to ensure we constantly had a drink as one does not want to be eating Mexican food without a margarita in hand.Note this review was for the casual cafe and not the restaurant (I might be slow but it was unclear that there were 2 separate parts to the bodega).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vdWAm-rQUMFvJ5F5ybO6HQ",
        "caption": "Photo of La Bodega Negra - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vdWAm-rQUMFvJ5F5ybO6HQ/o.jpg"
      },
      {
        "img_id": "xylpakpuMWvTerbBjUV82w",
        "caption": "Photo of La Bodega Negra - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xylpakpuMWvTerbBjUV82w/o.jpg"
      }
    ],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "MqKhH7-b0OoWxoqHixujBw": {
    "date": "5/12/2014",
    "text": "Hahahah, what a comical evening it was last night! I had passed by the La Bodega Negra \"cafe\" a few times while passing through Soho and decided to book a place there for a reunion dinner of sorts. I was running 5mins late... the ones who arrived ahead of us called me in a completely flummoxed tone as to why I had booked to dine at a strip club. Um, say what? I hurried on quickly to figure out what damage I had unconsciously done. I eventually figured out that it was merely a theme and that it was a legit restaurant but my prudish acquaintances (not quite friends) were rather freaked out and insisted we dine at the cafe instead of the restaurant. It did not comfort them when I told them that the lady who took the booking asked how many men and women there would be and stated that no ties/suits/corporate wear was allowed.Anyway, comedy aside, the food at this establishment looks great on the menu - authentic names, tantalising list of ingredients and sufficient degree of variety. And then it arrives on your table and you're like, umm, sorry, where's the rest of the food? Portion sizes are hilariously small, effectively making everything rather more expensive than it seems originally. Oh but that;s ok, I thought, bite-sized portions but bursting with flavour, I hope. Well, it was OK I guess, but certainly not that impressive. The place suffers from over-promising and then just 'delivering' (not necessarily under-delivering) so it qualifies as strictly A-OK (3 stars). But then we had to wait a lot for service - water, bill, change, etc so I take half a star off. So I'd say, it's a 2.5 star place...",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8OPx1EO2EF8DjV5SQDOwQ"
  }
}