{
  "BqMMk-zXcBG_W0ze8qn6Ug": {
    "date": "5/6/2013",
    "text": "This place has such amazing food. Flavors are on the spot. Just brilliant. The dishes are also nice and big also, so don't have to worry about getting your moneys worth. It has a very earthy feel to it also, with plants hanging all over the ceiling. HOWEVER, be prepared to wait during peak hours. I went at 3pm once--it was half full. 7pm--COMPLETELY PACKED. I asked how long it would be before I would get a table for two: 3 hours. There are two separate parts of the pub though. One for drinks and one for sitting down and eating. (Although you can eat at the bar also.) It just depends on what you're looking for. I guess while you're waiting you can go have a couple of drinks? Go for the food though! The pad thai and drunken noodle we had were both delish. (:",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9C-ldORiiB-iuT1uEZFVw"
  },
  "zrkSCk3gYGRAg6W-RxJoQA": {
    "date": "8/21/2012",
    "text": "Pub on the bottom (game machine and all)Thai on topKind of like a warped version of a mullet... if you see where I'm going there.Nice Thai food. White linened tables, flowers, attentive service. Good atmosphere at the pub with plenty of brews.Wifi code en route to the stairs.Shrug.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IffXJS48gglrJfHqOkCW3Q"
  },
  "Jyp1Pi_p9zYaFZx8m1_FgA": {
    "date": "6/20/2012",
    "text": "All the positives from my last review still apply but felt compelled to lop a star off following a second visit, this time for lunch. It's hard to give 5 stars with the 1 hour table rule, even when the place isn't full with the bill plonked down after 45 mins without even asking for it. So just keep that in mind when you plan your visit, OK!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "7h2CdJYniYp64tsK1VvHZg": {
    "date": "7/26/2012",
    "text": "This pub/restaurant was recommended by a good friend and a guide book.  This was my family's first visit to London (my 5th visit), and we were typical Americans.  We wanted the ambience of an English pub, but we wanted a step up in cuisine.  Voila!  The Churchill Arms.  After a long day of walking, my wife and I were ready for a cold one.  We were not disappointed as Churchill Arms had pints of ice cold Stella Artois!  The thai food was very good, adequate portions, and it was an interesting mix of English pub and ethnic cuisine.  Couldn't go wrong with that.  Even the kids (daughter 18 and son 16) enjoyed the Thai cuisine.  While we're certainly not experts in authentic Thai cuisine, we live in Orange County CA, we do know good food when we eat it.  The chicken yellow curry and egg rolls were very good.I highly recommend this pub/restaurant for American families wanting to try something different....",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5QT0MEZ1YCEN6BugT_8Sg"
  },
  "ymm7F5Vt8XsXG8sopJgh5A": {
    "date": "5/1/2015",
    "text": "This place has a lot of character. We stopped by for lunch and it was like eating in a florist shop. Food was good, generous portions and reasonably priced. We will be back if we are again in the area. Next time we'll check out the pub and have a pint!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hynsWq9J813JnjXbYRECnA"
  },
  "iiR8--8Up6OSCH1TH9eSaw": {
    "date": "5/20/2014",
    "text": "Sure it may be a little warm in there and quite packed most of the time, but it remains On my way of London's finest traditional pubs. Was also the first pub I ever drank a pint at whilst in London ! I will miss this place. Place will remain - I'm returning to Montreal ! And Thai food served in the back of the pub is just fine / great prices too!!!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1fuMTz9bLKsMTr6fFri5Q"
  },
  "q-y8AvRAvHyZhuCiRvYoHQ": {
    "date": "8/29/2014",
    "text": "It's a garden really, outside is full of smokers drinking at the curb right next to the beautiful flowers and if you go for food (Thai food that is) you will be dining under a fresh canopy. The pub serves the usual suspects (Pride, Chiswick, ESB...) and the resto offers tasty Thai picks. Quite affordable (8 pounds a plate) BUT here is the bad thing: they give you exactly 60 minutes to sit, order, wait for food and eat. Beware slow eaters! You will be rushed out politely! Oh! And if you have left overs or didn't manage to eat your food you can have a box for take out after paying 50p",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sQgNOwEQzlcR_7Fbal-JeA"
  },
  "5fZBHIUe5alajoL6uR_6wg": {
    "date": "12/20/2012",
    "text": "Main Idea:Authentic and historic pub AND awesome Thai food in the back.Pros:Cheap food (starters: ~2 to 14; mains: ~10-12) and drinks Beautiful atmosphere (bar and restaurant) and outdoor patioCons:Extremely busy/crowded - but that's quite often a sign of a place you want to be.One hour seating limit in the restaurant - no lingering. Back to the bar people!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLaUMTsYtpHu7UIO7U2kzg"
  },
  "dlm1CnwKgwZMcQ3LG796vA": {
    "date": "2/27/2013",
    "text": "O.M.G.A friend and I watched a movie close by and we were looking for this particular pub. It was so cold we nearly gave up but suddenly we saw a burst of flowers (seriously the whole building is covered in potted plants).It was packed, it took about 35 mins to get a table but we were quite happy to have a drink and wait. We weren't disappointed - I had the spicy pad thai and it was amazing! So many flavours, the portion was huge but i somehow managed to finish it - although this meant waddling to the tube later on full to bursting.The thing that made it for me was the decor - there were plants hanging from the ceiling and even the loo was full of pretty potted flowers. Kinda like a pretty english flower jungle. Def recommend it for great food and strange surroundings.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gx39-Q2A9cG2sHzjK4qvQ"
  },
  "FYR934v3IPQ_e5Zxw8fK1w": {
    "date": "9/6/2013",
    "text": "Found this out-of-the-way gem on Yelp. Spring Rolls are excellent. Pad Thai also excellent. Very cool and unique atmosphere   Don't let the British Pub in front fool you.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ga6d2yAzMRMANJloWvwOSA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ga6d2yAzMRMANJloWvwOSA/o.jpg"
      }
    ],
    "user_id": "hiZ763AFp5BpgDkiRKO86g"
  },
  "bVcRNkH5q43m0JmwFLFqDw": {
    "date": "3/30/2016",
    "text": "Brilliant indoors and out, food is great.  Wish they had T-shirts that I could take to my friends in the USA rather than the London tourist shirts at Covent Garden!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lUovteY3Wi0DUIwapZeKtA"
  },
  "1W7G1GSH_AgSP1KuxymOSw": {
    "date": "11/7/2009",
    "text": "I never thought I'd experience a Thai version of Chef-Boy-R-Dee but, here we are. We went to the Churchill Arms this afternoon after reading all the glowing Yelp reviews. We were, sadly, greatly disappointed with the mediocre fare we received. We had the pork Pad Thai and the stir fried pork with vegetables. Overall, the flavor was weak, the sauces were thin, the meat was tough and over cooked and, screw it...It was just bottom of the barrel crap. I can't understand how people are saying this is 5 star Thai food, unless we happened to be there on an off day.The place is fairly cheap for London, but you get what you pay for.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmL1P6wJi0Z8Jg8DTPqawQ"
  },
  "pY89vQzGAWQL3W2GXYR18w": {
    "date": "1/2/2016",
    "text": "Loved the chicken red curry. Thai basil-kaprow was nice, more basil would have been nice. Very cute inside and out. Sad I found it on my last day in London. Staff was pleasant. No Thai tea, I asked.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SU8tmtjbF9qWR_MVutT0iA"
  },
  "knsaC6oTukyge5DaHQEYfA": {
    "date": "7/23/2014",
    "text": "Bit of an institution this place. It's a Fuller's pub so the beer range is limited. But the flowery exterior makes this one of the most recognizable pubs in London. Worth a visit, but not a long one.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "_bH1KRe1S9TbplCYwJCjIg": {
    "date": "5/13/2014",
    "text": "Great food and a great ambience! Watch out if you have pollen allergies. There are a lot of flowers in the back room.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NXArjjctFM04--ndxJ3W4w"
  },
  "JpuP5CeK404nun33bilHsA": {
    "date": "5/10/2012",
    "text": "An excellent pub with, strangely enough, a great casual Thai restaurant in the back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SRjrCDKvwjWZ6lbrihu5Og"
  },
  "TB5iGOlT_x-Dgilf4jsy3g": {
    "date": "7/21/2014",
    "text": "I probably can't add much to what all the great reviews have already covered. I was not expecting great Thai food in an old pub. The pub itself is a reason to visit, the cozy atmosphere enhanced by greenery everywhere. And I mean everywhere. How the heck do they water all those plants? And the icing on the cake is that you get a large portion of food for a reasonable price. There were 3 of us eating dinner and we all ordered different dishes. I sampled them all and would have a hard time ordering next time because everything was so good. My stepmom is Thai and I know what good Thai food tastes like. Of course you can find better Thai food in Thailand or in fancier restaurants but I think you won't find better in a pub. Run, do not walk, and get you some crazy good Thai food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcnwW-_xRk9PxOlCtn_CKw"
  },
  "FhgoI7zTuGHyQpF-bAZV5A": {
    "date": "2/22/2014",
    "text": "I don't get all the fuss. The service bordered on just plain bad, as we were rushed from the moment we sat down by numerous waiters so they could turn over the table. The food was nothing special. I've had much better Thai food elsewhere. The exterior of the pub is about the only thing that makes this place charming. Wouldn't go back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tpdW9HSa4eKqGIigdeBQ0g"
  },
  "1BoStEtjmhlncxodssmEmg": {
    "date": "10/25/2011",
    "text": "An eclectic experience as the restaurant is tucked in the back of a pub. Loved the Pad Thai. Not to be missed. Affordable too. Beware. This restaurant likes quick eating and will be prone to push you out quickly.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TxcUeHBtlSYaqzFDVgVFMg"
  },
  "LQMHnb2qvI5yMzqra0NoTQ": {
    "date": "3/14/2013",
    "text": "Great British Pub with a twist.......A restaurant at the rear which serves fresh cooked Thai food!Quality of the food,for a pub restaurant is very good indeed,and the ambiance of the restaurant,is great fun.Visited this great pub on numerous occasions,both to eat & just for a pint of very well kept ale.Would recommend to anyone (with one proviso),they have to be patient,this is a BUSY place,although the staff work \"flat out\" to serve you as quickly as they can.If you want a quiet pub to sit and contemplate,then this is NOT the place for you,as it gets incredibly busy and space is very much at a premium in the bar area.Give it a go,you won't be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e8p5V3Q5_wnK-kSRg5D7iA"
  },
  "OrRMBKj5hvZHaqnqvKcpWA": {
    "date": "2/18/2017",
    "text": "Earlier in our trip we had Thai food at Rosa's and it was so phenomenal that we wanted Thai food again before leaving. Did a quick Yelp search and this place popped up. Pub + Thai? Yes please. We made a reservation just in case and glad we did. It was packed. Good beer selection which we partook in. Beer came out quickly as well as food. We ordered chicken pad Thai and a beef red curry. Both were good, but not great. We asked for a way to make it spicier and they provided red pepper flakes and some sort of liquid chili sauce. Delicious after that addition. Added just the perfect amount of spice. Noise level was about average.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PBA1rCTmVaI5APfQ1WgbyQ"
  },
  "pQ9GS9GREydfiPaJs_3JfQ": {
    "date": "9/17/2016",
    "text": "First \"Thai Pub\" I have ever been to. This place was located in a residential are of Notting Hill. It was not too far from Hyde Park. We went there for dinner on our last night in central London after spending an evening walking  the Hyde Park.Had Chicken Fried Rice and Green Curry, along with some Beer and wine. Food was ok, but the ambience was great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5CmFN4TULKvry4NzfAoNA"
  },
  "jhUnGiU9IBjtLlGwYpxROA": {
    "date": "1/9/2017",
    "text": "Very reasonable and very charming pub/Thai restaurant.  So homey and wonderful decor.  The food was not fancy (in fact, it wasn't much better than okay) but still, it was a fun place to drop in for drinks and an informal dinner with friends.  We had a good time.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hJpnSWqL_Otz_bqvEtxU5A"
  },
  "pFbYLSYW10_gsG4In_ikAg": {
    "date": "2/24/2015",
    "text": "The Churchill is something of a London institution on the pub scene. It's an odd mixture of British, Irish and Thai and yet somehow it works. As most of the reviews mention, the outside is bedecked by flowers. The inside is equally cluttered with tankards, flags, chamber pots, Winston Churchill paraphernalia and Irish souvenirs. It all adds up to a very quirky environment.Essentially though, it is a London pub and a fine one at that. It carries the Fullers range of beers plus a fully stocked bar. Many people gravitate here for the Thai food but as I've not eaten here, I can't comment on that.Gerry is a big character landlord who is happy to chat to the customers. At the time of writing, he appears to be canvassing votes for the VisitEngland Tourism Superstar 2015 awards!A popular draw for tourists and Londoners alike.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "1NhEQLPowrkswEX8uLdF2g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Fullers ales in tip top condition",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1NhEQLPowrkswEX8uLdF2g/o.jpg"
      }
    ],
    "user_id": "xl8e95fM9-dXZ6Tymxkddw"
  },
  "9M2CW9dR593CC-9l996Azw": {
    "date": "4/24/2013",
    "text": "One of our best meals in London was at The Churchill Arms.  We arrived around 7pm and the bar and restaurant were packed so we put our name in with the receptionist for an 8pm table.  To kill time we ordered some English beer and hard cider at the bar and went outside to stand amongst the locals.  The wait wasn't too bad since we had good beverages and good company!The Thai food is absolutely amazing at The Churchill Arms!  We started off our meal with spring rolls and shrimp chips.  For entrees we ordered the Chicken Pad Thai, Green Curry Chicken and Pad Gai Himmapan.  The portions are huge, the prices are inexpensive, and the food is delicious.  What more could you ask for?  Friendlier service?  The service was was friendly enough and our food and drinks arrived promptly despite the restaurant being so busy.Because this place does get packed there is a one hour limit at the tables.  Eat your food, pay the bill, and grab some drinks at the bar if you want to linger longer!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AvTAdj3Xm6UtCi3XJlBVIQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pad Gai Himmapan",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AvTAdj3Xm6UtCi3XJlBVIQ/o.jpg"
      },
      {
        "img_id": "egRb2P6xYhLB8WuaHyRTeg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Chicken Pad Thai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/egRb2P6xYhLB8WuaHyRTeg/o.jpg"
      },
      {
        "img_id": "BQ-9m4lnzuEsEp4CXvCnZQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Shrimp Chips and Spring Rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BQ-9m4lnzuEsEp4CXvCnZQ/o.jpg"
      }
    ],
    "user_id": "5O3VvfDu_HDvgUviAqmTEA"
  },
  "ryUt9fzX1CqYeMPJF2_6aA": {
    "date": "5/9/2017",
    "text": "You have to go just to see the flowers everywhere. The atmosphere is something we've never seen before. Thai food restaurant was fantastic!!!! Waitress attitude was so-so, but worth it 100%.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hV-ud83BXVvpctT04CfYaw"
  },
  "03VtEdlxnmaVQaEoTUlozg": {
    "date": "1/8/2015",
    "text": "Fun place with lots of kitch hanging all over the walls and ceiling.  Standard pub beers, but with Thai food offered!  Great location.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zXTq5nrgZM0egN0MK5sQ5g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zXTq5nrgZM0egN0MK5sQ5g/o.jpg"
      }
    ],
    "user_id": "YAIxImxlu3jlSdG91T2Pig"
  },
  "zd9vv5rgtkrSpe7YJv-UFg": {
    "date": "2/9/2016",
    "text": "I am in love with this place! Very charming classic British pub, with an incredible Thai kitchen in the back!?!? What an amazing, random combination! The Thai food was some of the best I have yet had London. Simple menu, with just enough choices. It also clearly rates the spiciness of each dish with a pepper symbol- and the threepepper dishes are VERY SPICY!! It was amazing! So many Thai places tone down dishes for westerners, but not this place. Only order the three peppers if you know you can handle it. I was pushed to the brink of my spice tolerance, yum yum yum. Can't wait to return.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKV1U78NbGrIy4JHBx6THA"
  },
  "gFXrP8AR8xUEaJxm4QrKGA": {
    "date": "10/14/2017",
    "text": "Food was unbelievably good! However, unfortunately the service was extremely bad! I went with my wife and got the chicken pad thai, which I highly recommend if you decide to go. The server treated us as if they were doing us a huge favor.. not sure what training they received, but the owner certainly needs to review his staff/training, especially in the Thai section of the restaurant. Guest satisfaction always needs to be top priority.. keep that in mind.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XeB3PG1xie503PqHQphQHg"
  },
  "SyHwWH4RLiZW5Hq6iCNaYQ": {
    "date": "10/3/2012",
    "text": "If you're a visitor (llke me) and looking for an authentic pub experience, check out the Churchill Arms if in the area.Firstly it's covered in flowers and flags.Inside, the scene is just as festive.  There are hundreds of historic items hanging from the ceiling and walls adorned with posters of Sir WInston and others.  The staff were nice as well as the regulars.  My only regret is that I had just eaten somewhere else and couldn't try the Thai Food.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lH_2PUJNHKc9Y0ErCdecjg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lH_2PUJNHKc9Y0ErCdecjg/o.jpg"
      },
      {
        "img_id": "j-9VK9LquGg7Rl_S3b38rQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j-9VK9LquGg7Rl_S3b38rQ/o.jpg"
      },
      {
        "img_id": "VZrbZDGt_AVhPcmTm7z4zA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VZrbZDGt_AVhPcmTm7z4zA/o.jpg"
      }
    ],
    "user_id": "aIzN19RssPWSw9nDCPXU3A"
  },
  "Zq-JaFBa43mJH6xiE-Ts_w": {
    "date": "7/4/2016",
    "text": "This place is amazing! Atmosphere is very bustling, but definitely enjoyable. The inside of the pub is decorated with flags, pots and pans, flowers, and virtually everything you can imagine. The food itself is delicious authentic Thai, which was a pleasant surprise to us.I would highly recommend this pub if you are a local, but especially if you are a visitor to the U.K.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9o3W1kH7CJ8rR104sU9G1A"
  },
  "cXK4lYCLSfGexAcHXnPhEw": {
    "date": "9/7/2015",
    "text": "This is an absolute must if you are visiting London. My fiancé and I stumbled upon The Churchill Arms on our final day in London and I am so glad we did. The outside is incredibly picturesque -- bursting at the seams with flowers and flags galore. You walk inside and are greeted by a traditional British pub, but it won't be long before you start smelling the incredibly curries and other Thai flavors. Wander to the right of the bar and you'll find yourself in a beautiful oasis full of flowers upon flowers and a sit down Thai restaurant. (Don't worry, you can still order drinks from the pub -- we took advantage of that!) The spring rolls, pad see ew, and red curry were phenomenal. The perfect of amount of spice and the rice was cooked just perfectly! This is definitely a spot I will be making sure to visit every time I find myself in London!TIP: Avoid the need to make a reservation and grab lunch instead! We had no wait and the food was on our table within 10 minutes of ordering!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8nCLO5K32yExteVIQytuWQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. The beautiful Churchill Arms!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8nCLO5K32yExteVIQytuWQ/o.jpg"
      },
      {
        "img_id": "LtEsR_XvcfKaDa6M8ZWSNA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Spring rolls, pad see ew, red curry, a Guinness and a Staropramen -- yum!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LtEsR_XvcfKaDa6M8ZWSNA/o.jpg"
      },
      {
        "img_id": "LfgRW5Wq_WxD_hl6NQjdFw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Inside the back dining room at The Churchill Arms.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LfgRW5Wq_WxD_hl6NQjdFw/o.jpg"
      }
    ],
    "user_id": "kIYFGmvsyL_faoYd71ZiOw"
  },
  "WPtnuAGuVpNnSVVFrKLDKA": {
    "date": "7/4/2014",
    "text": "The Churchill Arms is truely a hidden gem in London. Our friends led us to the pub for Thai, which we thought was a touch strange. There is absolutely no way of knowing there is even a restaurant in there.Initially we were turned away for dinner as the restaurant out the back of the bar was full, however we insisted we had to eat here, so they reluctantly accommodated us in the bar.I'm so pleased they did. It is seriously the best Thai I have had outside of Thailand. The duck curry is absolutely out of this world and the pad thai is perfection! Not only that it's really cheap too. Nothing like great food that is easy on the wallet.The service however, is absolutely shocking! The owner/manager is rude and abrasive, but it's worth putting up with for the amazing food.We will definitely be dining there again.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QkDn4Por54tw5LYbxkCoKw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QkDn4Por54tw5LYbxkCoKw/o.jpg"
      }
    ],
    "user_id": "y8bnnphVEGGOJRVQf2NtLQ"
  },
  "jw_qM40EPRsCKoo_qRBJ8w": {
    "date": "5/10/2016",
    "text": "You have to come here with the right expectations. Most of the bad reviews are not about the food, but about the service. And most of the service reviews are about being told, often more than once, that you have ONE HOUR to eat. So, if that already bothers you, or if getting the bill placed on the table without asking (normal in the U.S., rare in the U.K.) don't go, you won't enjoy it.The restaurant is decent looking. Not a particularly romantic spot, but a fun friends spot. The pub is bustling, and the flowers everywhere is a sight to behold.My G/f got the Pad Thai with shrimp. Tasty, not outstanding, but much better once she asked for some chili oil. I got the Pad Kee Mao noodle dish with the three heat symbols, with the mix of meats. The heat was fairly intense, and this coming from someone who always gets Madras hot, and sometimes Vindaloo at the Indian. I'd put the heat up there near Vindaloo, but, for me at least, absolutely perfect, with a little burn, but not unpleasant. And most importantly, it didn't overpower the flavours of the dish, which were outstanding. I think the chef knows a thing or two. One of the best plates of food I've ever eaten. Yes, that good. And a bargain at £8.50 for a big plate of food.The service was fast, fairly friendly, and the food came quickly. If we'd had appetizers (really limited choice, one being six very tasty looking fried egg rolls for £4.50 I think, but we weren't hungry enough) then we would have been pushing close to that one hour limit, but with just the main we were done with no rush. I don't think they will bother you unless you are done, and then sit with your drinks, then they'll want you to give someone else a chance at this amazing food.Book ahead and prepare for tasty.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L4K7pl3gL9ZwJcIX--L3-g"
  },
  "Kp7Uq_3d4WBKphaD-HrtKg": {
    "date": "10/1/2015",
    "text": "It's a must stop in London. British beer and thai food! Holy crap, so good.  We had an english cask pint with spring rolls after a red eye flight coming from the USA.  It was perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fw0KDwLwvksGOw-VZMTM5Q"
  },
  "mB_HlymsI-2QtOy1FM1U0A": {
    "date": "4/15/2014",
    "text": "If you're searching for \"American\" Asian cuisine then you've found it here. It's an Irish/English pub as you walk in where you can enjoy a nice Guinness and await a table for the restaurant in the back that serves Thai food. As we walked in the back towards the restaurant we were greeted by several very friendly women servers; one in which immediately stretched out her arms for my 16 month old son to come to her. My son must have sensed her warm personality and went straight to her. She took him to the flower garden and showed him the fish and flowers as my husband and I got situated in at a table. We ordered spring rolls to start which were amazing. Very light and not oily at all. We then each ordered a Thai dish that had red and green peppers, onions, spring onions, as well as a choice of chicken, pork, or prawns. I opted for cashews in addition and spicy. Both came with white rice and were a perfect portion. It was extremely tasty, as well as, making me feel at home as it made me feel like excellent Chinese take out from home (NY). I would definitely recommend this place and we will definitely be coming back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Rf0_L0H-ClD8eFmujBdZg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2Rf0_L0H-ClD8eFmujBdZg/o.jpg"
      }
    ],
    "user_id": "zJtb0gzASccciTpcNliCoA"
  },
  "dL2XRyQ5Q-2RXxN9YdFzSw": {
    "date": "8/9/2015",
    "text": "A Thai restaurant inside a beautiful old English pub? I was sold! Upon arriving at the Churchill arms I was really impressed with the flower display and couldn't wait to go inside and sample the food. The interior is also quite a spectacle; there is a somewhat eccentric mix of British bric-a-brac, Irish memorabilia and flowers.The food prices are very reasonable for London. For £8.50 I got a large portion of rice with some vegetarian jungle curry. There was no tofu, which was a bit of a let down, but the food was okay. It was far from being the best Thai food in London, but really you are paying for the beautiful location.I would happily come back for a drink, or just to stare at the building from outside.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "RPe1CkL8k1qGFsv7WmAyqQ": {
    "date": "2/9/2016",
    "text": "The Churchill Arms: Pub, 5 stars every time... Thai Restaurant, 3 stars but would return for sure...   We have been a few times for the pub side of The Churchill Arms but this visit was our first Thai Restaurant visit. The Pub is just fanatic, quirky, British, fun, a good selection of Ales. Service quick and pleasant, as it has been on previous visits. 5 stars for the pub side... we love it....The Thai Restaurant part I knew of its reputation and its didn't disappoint. Running late with our table, and at the end of our meal being chased off it sharpish. Food is very good, and there is a good selection to choose from, maybe a little research beforehand as the staff are not too helpful with explaining about certain dishes as one of our guests found out. The wine took a while, and we should have grabbed a bottle from the pub side beforehand, as we had got well into our starters before it came. It's a 3 star, but I would eat there again as it is an experience and with the right group of friends can be very amusing as we found it. The Thai staff there are sharp, not rude but they will do their thing - their way.... maybe that's why people return to the scene of the crime.... we would, and it's NON-halal according to James who works there, so a plus for us.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHHsILb0yT8zPzYt0JoHcg"
  },
  "mTldqAUCRzvCDNqeVudzug": {
    "date": "5/23/2016",
    "text": "Cool place with a relatively mixed crowd. Gets rather busy and due to it's set up, this can be rather annoying. Trendy decor with a warm atmosphere, ideal for winter nights.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrYGAxvkhenAt5fpOPDmgQ"
  },
  "AWo6pUO-VHFN4LPefYzrcw": {
    "date": "8/17/2013",
    "text": "Very good pub, moderately interesting restaurant.I like this place for a beer. Loud, good selection of beers, beautifully covered with flowers outside in a nice neighborhood. When it comes to the restaurant though I have mixed feelings. On one hand the food is ok, but as you have limited time to spend at the table you might del little uncomfortable being nagged by the waitress that your time is up. So not a good place for a relaxed dinner or lunch. Not my type...",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyFTRi6r5ftRFkCz8DM4qw"
  },
  "okNWS2kz4VNeI53Fdj1Rmg": {
    "date": "7/2/2008",
    "text": "In my experience this is the best pub in London. Run for many years by a friendly and gregarious Irish landlord it has all that you could want from a traditional pub: good beer, excellent food (Thai), and a marvellous atmosphere at any time of the day or night. Pubs where you can walk in and feel immediately comfortable and at home are quite rare but that is the case with the Churchill, whether you are a tourist or a local. I am lucky enough to be the latter and whilst not a frequent pubgoer I am a regular visitor here. Outside in the Spring and Summer, the floral display is worth the visit alone and the greenhouse restaurant inside serves extremely tasty and amazingly good value Thai food. The bar staff are friendly and efficient and one end of the bar is dedicated to sports on the TV and this is a fun place to watch a major event. Only downside - it is usually crowded because many obviously feel as I do. Hats off the landlord - his infectious sociability sets the mood. If only all pubs were like this.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_GcLwdCWBp09w81xhLDQjw": {
    "date": "10/2/2009",
    "text": "In town visiting from the US.  A nice walk from the hotel and very pleased when I arrived.  Very nicely decorated with a nice aura inside.  Friendly barkeeps and delicious thai in the back.  Definately recommend checking it out.  Nice pub.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q9-ALmOe8ahaHykDx1ysXw"
  },
  "-Pa45cef2SYpvEgV-MUsqg": {
    "date": "10/1/2009",
    "text": "Traditional pub with line of ales on tap.very friendly staff. but too busy in afternoon.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VxuxL1qCQTXFnxpapBULtw": {
    "date": "3/11/2009",
    "text": "I adore this place. The coziness when you walk into the front pub, the bizarre hanging plants when you enter the back area for cheap curries and pad thai. I used to scurry over here on rainy/snowy days, order the most spice-filled thing on the menu and then scurry home toasty warm! Great place to grab food and not empty your wallet.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ms2mSa0ItzpG6paQz5VAYQ"
  },
  "JD3JhkPBKxhyWQdpf5eZxw": {
    "date": "5/29/2009",
    "text": "This place is great. A good old boozer in Kensington/Notting Hill. Loads of stuff hanging from the ceiling and the regular, reliable Fuller's beer on tap. The Thai at the back is always good in a cafe sort of way, good value. No garden.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "giJ0HDm7BtcRvEUfYCzCww": {
    "date": "8/12/2011",
    "text": "such a pity. its way more appealing from the outside. the food is cheap, but the service is nasty. in the restaurant at the back, you are constantly reminded that you only have 90minutes to eat and leave. fine, get on a darned well serve me then!! the pad thai is fine, but exceptionally stingy with prawns (3?!!!) so knowing this, my friend asked for additional prawns (which she'd pay for) to which she was flatly told no. They then brought the bill whilst we were still eating (and had 20mins of our 90 left) then returned every 2 minutes asking for payment.i will not be going back a third time.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OvC9Z5C0LGok3ZUQUzxbaw": {
    "date": "1/15/2010",
    "text": "If you're looking for a real, classic english pub, but also a very handy and nice location, then this is the one you should be heading to. The experience of Churchill Arms starts with what can be seen outside. A beautiful house in a corner of Notting Hill that looks almost made of tree leaves and flowers welcomes you in a very particular way. Inside, the environment is special and different from the rest of the pubs I have ever visited in the city. Very nice and high class looking people, no lousy drunks, no music, but still very funny. All the way down you get the restaurant section with a spillover of flowers and green, which is a nice touch. And a very very good thai food for a really good price (mains for less than 7 pounds). I don't give the place 5 stars just because of the service in the restaurant which can be very much improved.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pUpr5R9HVuJ-aCPxwwgsGQ": {
    "date": "1/19/2009",
    "text": "Fuller's best pub, great beer, great food, the best collection of chamber pots and butterflies in the World.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ndcbkzL4pfwLI3RZq2AX4Q": {
    "date": "10/11/2008",
    "text": "Unglaublich: Ausgezeichnete Thai-Küche in und unter einem Blumenmeer in einem historischen Pub. Wir hatten Padthai mit Shrimps & Chicken - einfach ein Traum. Grosse Auswahl an Bieren.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0d_PBBj9ws6zLdiM-WYQ3w"
  },
  "QyszTIAFUHNiOx0VbJ9rmg": {
    "date": "10/24/2008",
    "text": "A mighty fine boozer with a great atmosphere. If I was directing a tourist to a traditional english pub this could potentially fit the bill. Decent selection of drinks, and not at all expensive. Worth going to, and it shows the sport too but in a none offensive way.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NB7NlaIem_vYLjS-marlAw": {
    "date": "12/20/2007",
    "text": "This pub seems to be most famous for its wonderful display of flowers surrounding it. But for me, this pub is so much more. As well as friendly bar staff, and a great atmosphere for having a drink with friends, the thai food in this place is wonderful. Not many people think that a pub would have good thai food, but this pub serves only the best. Delicious food, great drinks and great atmosphere.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ezMXr9TYBUT8DSA-h7YVFg": {
    "date": "11/19/2008",
    "text": "Wonderfully British institution, best visited in summer to get the full view of its amazing flower baskets that hang all over the outside, a definite stop for tourists walking through the area. Great atmospheric interior, lots of hanging Churchill-related memorabilia and friendly bar staff, with well priced drinks. Very eccentric. The highlight for me, however, is the Thai restaurant that joins itit's one of my favourites in London and I regularly make the pilgrimage West just to go here. Incredibly well priced dishes (around £6 each) and quick service with big portions. They also offer a take-away service and you can call ahead to order. Highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mNS0Y-w1y1dZfgEZDL4-6w": {
    "date": "1/26/2009",
    "text": "Hmm did I die and go to heaven? So I think that statement may be a bit too extreme for those who live in London, but this is coming from an American where the concept of an original English pub that serves good Thai food is totally out of the question. This venue is half English pub, half Thai food restaurant with a clean restroom to boot. While I was here, I had the most spicy pad kree mao with a pint of beer  - several different kinds in fact that went very well with my food. And when it says very spicy on the menu, they really mean it. I am pretty good with spicy food and favor it, but I had to take a pause after maybe 5-6 bites so that my ears would stop burning. All this while at the same time every time I glanced up, my eyes would meet Winston Churchill's. It was strange at first, but then he started to resemble someone who would actually listen to my problems and have some sort of solution to it. I was probably drinking a bit too much at this point. Well, I'd love to go back to this place again and again, but sadly I'm just a piddly little foreigner here. However, while I was here, I had a great time speaking meaningful conversation with my husband, eating good spicy Thai food and downing pint after pint of beer. Cheers!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDmNN2laCuXHrfc04COMCQ"
  },
  "7ZtjZwj-bdeVJCWd0xv0Mg": {
    "date": "6/2/2010",
    "text": "It is a very expensive pub, that although pretty in cluttered sort of way, the staff are neither friendly or polite",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mUbxr3DvKAZwMFle7bobIg": {
    "date": "3/30/2010",
    "text": "i really do enjoy this pub, the food, the price, atmosphere everything...and specially the chocolate cake..!!! my God..... _",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3B-HJuMJpfVCfCY-yp0f1g": {
    "date": "3/12/2012",
    "text": "I used to love going to the Churchill Arms for a nice Thai but after my recent experience will not return. I recommended the restaurant to a friend organising her birthday meal in London. Our table of 14 was booked for 7.30pm on a Saturday. The group took its time to arrive as the Central Line was down, but everyone was ready to order by 7.55. Throughout the meal our food was almost thrown at us, whilst drinks orders took 40 minutes to appear (not great if you're eating a spicy curry!) Our plates were cleared whilst others had only just got their food. Our bill was brought (without being asked for it) whilst some of our party were still eating - I take it they don't offer desserts/coffee?! Then as soon as our credit cards had been charged they literally evicted us - moving chairs away whilst some of the party were still finishing their drinks! Appalling service. We ended up stood in the bar, catching our breath and finishing our drinks at 9.10pm. I understand that some restaurants in London 'turn tables', but even so - allowing only 1h40 for a group of 14 to have a 'celebratory' meal seems ridiculous. I was so embarrassed to have recommended the pub in the first place - in the end the birthday girl took it well and we ended up laughing at the Fawlty Towers approach...A nice atmospheric pub, with good value but 'nothing special' food and terrible service - you can do better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bmet0Ckg62tIfFwZN7AAAw"
  },
  "i_7Cae9VJOg0lXq4gyMuqA": {
    "date": "4/25/2009",
    "text": "Good and inexpensive Thai food. Service in the pub is better than it is in the restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tg6z8quGRlUQ5sEE7Eq7cQ"
  },
  "4LuMJqZ8V90D_GAYSYapgA": {
    "date": "5/28/2009",
    "text": "I thought this place is brilliant. It really doesn't get much better than this. But the I saw how much it was! Only joking. but seriously I would probably go there much more often if it was cheaper. However the food is great and you really can't fault with much. So yeh, a good place to eat.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uv7ZuAsgW5QmPk3KtVaEFA": {
    "date": "11/16/2008",
    "text": "The Churchill Arms is an institution. It combines a great British pub with a great Thai restaurant. Service is pretty fast, although you sometimes have to wait a while for a table. The green curry is excellent!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4wlNLswmbdSNO6fypf9EwA": {
    "date": "3/30/2008",
    "text": "Great pub, fantastic setting with masses of flower baskets in summer, beautiful dining area but bad food and service in the restaurant.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "roMD04HPP5zVqZHK7UVbeA": {
    "date": "7/18/2010",
    "text": "great thai food, very authentic (and spicy). i think this place is affiliated in some way with addies in earls court, which is one of the best thai restauarants in london (and this place is also a pub)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ygWbfcjbUsgKdf5Nu0BGlg": {
    "date": "2/2/2017",
    "text": "My friend and I were in London for 6 days and ate here 3 times for dinner. I kind of wish I had eaten here every night, honestly. At the second visit the hostesses recognized me, and by the third they were willing to accommodate us even though they were fully booked (I think they were also on to us that, as Americans, we wouldn't linger all night long over our meal). Regardless of the fact that it was within walking distance of my hotel, it has absolutely the best Thai food in the world. IN THE WORLD. A lot of American restaurants have a serious issue serving truly spicy and authentic Thai food. Not this place. Our eyes and noses watered and we loved it.  I couldn't tell you exactly what we ordered, but I'm confident that all of their dishes are delicious. As for the actual pub . . . what a gem this place is.  Always crowded but always welcoming.  My friend only drinks cider beer, and she was not disappointed.  And the florals outside--oh my.  A sight to behold. This is a bright light tucked back in the sweetest little neighborhood. I want to be back in London for many reasons, but most of all to eat and drink at The Churchill Arms again.  Thank you for bring such a memorable part of my trip. Please visit if you have the opportunity!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPMX0b3I64tdaDJnFCLYXg"
  },
  "wkALXMnnNAo2_ozt494MRg": {
    "date": "3/1/2017",
    "text": "The Churchill Arms is an exercise in brokering the modern bar with an extremely traditional British pub. You are surrounding with Churchill memorabilia that evokes a wonderful sense of yesteryear. The crowd is a full spectrum of young and not so young which makes it a good place to bring your friends (or your mom if so inclined.)There is an adjoining Thai restaurant with a friendly staff which you can order from and they deliver it right to your seat in the pub. As a lover of alcohol and Asian cuisine this place speaks to me on an existential level. Definitely check out their website; their email sign up includes a free drink.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "nwbY0-627D2thfEIFAcEfw"
  },
  "ZMd57AC2Y6gGLtJEtoM8jw": {
    "date": "5/28/2015",
    "text": "The Churchill Arms is as good as it gets.  Apparently the first London pub to replace a traditional pub kitchen with an exciting Thai alternative = legend has it that Jerry met the original chef on one of his butterfly hunting trips.  You see the man himself less behind the bar these days, but the pub is just as buzzing as ever.   Actually, the Churchill Arms is a victim of its own success, it is way too busy.  It is impossible these days to just walk in and stand any hope of a table.  Too many raving reviews (this is another one, not that one's needed!) pack the place out with tourists from all over the world.  I wonder if any of the old regulars still pop in for their pint.  I hope so!The only chance you have is to book a table at the conservatory restaurant - highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "CPCs-PrhK6bEwwTlsHgsqQ": {
    "date": "6/23/2016",
    "text": "This is one of the best pubs I have been to in London! We were here to watch the England Vs. Slovakia Euo '16 match. So great atmosphere - check! Churchill Arms is all-out floral on the outside and extremely rustic on the inside. Don't think these guys believe in the middle path! The flowers outside bring out summer very charmingly. Inside, I love all the trinkets hung from floor to ceiling...wish I could buy some of them! I could just spend time staring at each of them and wondering what's the history behind each.They serve good Thai food and if you are sitting by the bar you can order just the spring rolls and prawn crackers.Must go if you are in the Notting Hill area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l7TTbgXtsY14xYvJSDvziw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l7TTbgXtsY14xYvJSDvziw/o.jpg"
      },
      {
        "img_id": "qR52HuYKwJXOvnLAZHlFvA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qR52HuYKwJXOvnLAZHlFvA/o.jpg"
      },
      {
        "img_id": "hBH-gaYT_zOJhs8fZ0xNgg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hBH-gaYT_zOJhs8fZ0xNgg/o.jpg"
      }
    ],
    "user_id": "LScF4h8D88MAxT3nMsSVEQ"
  },
  "P_zklksixdxJCFncTCJv6Q": {
    "date": "7/10/2017",
    "text": "Thai Restaurant Review!Well this was certainly an interesting experience. I read the reviews for this place extensively and despite the negative tones for the Thai restaurant, we decided to check it out simply because the exterior and interior of the bar is super cool.First off, you cannot make reservations online if you live outside the UK/EU. I tried and they sent me a denial email saying I had to call. Being that the restaurant highly suggests making reservations, I called England from the US on my dime. It was for my husband's birthday and I wanted to make sure we were guaranteed a spot. I called and the lady told me we'd only have the table for an hour and I agreed.When we arrived, the outside was really cool and the inside of the bar area was packed. We went to the back of the building to access the restaurant. HOLY HUMIDITY! In none of the reviews did I read how horribly miserable the atmosphere was in there. It was stifling. We were in and out within 30 minutes--between the temperature, humidity, hot food (review on that in a bit), it was totally unbearable. We were wiping sweat with our napkins. Now, we're from California and have spent summers on the east coast, so we're used to uncomfortably warm weather, but this was totally unacceptable for an eating establishment.As for the food, it was mediocre. It was NOT spicy (and I even ordered the supposedly 'spiciest' option). I think most of the reviewers who claim it's so wonderful must live in places that serve dreadful Thai food.So yeah, spending less than an hour here should be no problem because the service is quick and they basically hot-box you out with the temperature. As for the bar, even though the air was more tolerable, we bounced as fast as we could. Oh well :-/ Gave 2 stars only because of the aesthetics of the building.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wLMRbo2cU5GlnPRtNAzL5Q"
  },
  "2Xq096q0Jov_YENZ5XfLBQ": {
    "date": "9/6/2017",
    "text": "Having read the reviews thought our dinner may be rushed-1 hour limit at table made crystal clear as we entered restaurant. Fine. We were in the mood for Thai. Table was ample and menu items sounded good. Ordered 2 different curry dishes. Both were good. Wine was a \"light\" pour. Rather than being rushed had to summon waiter for water than for check. Maybe because it was a Wednesday night. Upon leaving, noticed people eating in pub. Pub seating far superior to the atmosphere in back as the hanging plants on ceiling were yellow and looked as if they were suffering. Would have preferred comfortable pub seat and a view of the bar. Overall, food ok to good but atmosphere lacking. Unless you are hankering for Thai food and nothing else will do, maybe stand outside under the beautiful foliage and have a pint instead.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1hiy3ntZ46QdZKEQ-z-kg"
  },
  "NsRQ-h4vaFKtLwljhAGHxQ": {
    "date": "1/5/2016",
    "text": "THE prettiest pub I've ever seen! I'm kicking in 2 stars just for the beautiful foliage outside. We were meeting a friend there for a pint and pub was lively because of the Rugby finals on TV. Unfortunately for us, it was so lively that we weren't able to get a seat or attention from any of the servers for a table.I was looking forward to having a pint and Thai food but it was not meant to be. I'll give it another chance when I go back and hope that I won't have the same experience.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8flMOM04LfF0175Stp3AA"
  },
  "E_Uon_rFp9zL6zrzK_JsdA": {
    "date": "4/11/2018",
    "text": "Growth isn't always good. Haven't been here for years but the \"get'em in get'em out\" mentality is alive and well. The food was so so. No fish cake. (A go to for me).  Disappointed at best. The staff, however, is amazing and nice ...  and super quick. (Get'em out).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayt3ucaGgUoYNZR33TOkBw"
  },
  "n5Asx4dDmGAIBGubt3gmFg": {
    "date": "2/26/2016",
    "text": "AMAZING Thai food. Seriously, the best sit down Thai in London. Small space, service isn't the best, but the food makes up for it. Such a fun atmosphere, with the garden look and butterfly theme. Again, service isn't fabulous...bring your own water, they aren't good at doing refills for you. A must visit for any Thai food fans in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LfG0t9x07CodCIZIMv2ljA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Churchill and Arms-one of the restaurants I always visit whenever I go back to London!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LfG0t9x07CodCIZIMv2ljA/o.jpg"
      },
      {
        "img_id": "sgWhMjj69M2bcUwuOnVxJg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. ceiling of Churchill and Arms-I felt like I was in a butterfly fairy garden!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sgWhMjj69M2bcUwuOnVxJg/o.jpg"
      }
    ],
    "user_id": "iK55qpozdt219tnFT2RRIg"
  },
  "sC8m16u3dycNBuxWPFYROA": {
    "date": "3/17/2016",
    "text": "After dinner we were ready to go to our first pub! Since we were staying Notting Hill, we wanted to go to a local pub. We did a bit of searching and decided on The Churchill Arms, a pub dating back to 1750 which the grandparents of Winston Churchill used to visit! When we arrived the entire pub was watching a rugby match. I don't really know the rules or anything, but it was exciting to be in the midst of the excitement!My husband ordered a pint of London Pride and I tried the Cornish Orchards cider - yum! I would definitely come back - very cozy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5EP8x1iqRh-t4TNYuFnX9A",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Everyone watching the rugby match",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5EP8x1iqRh-t4TNYuFnX9A/o.jpg"
      },
      {
        "img_id": "Y1lhbb6yP6DeKmZL8MVJ0A",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y1lhbb6yP6DeKmZL8MVJ0A/o.jpg"
      },
      {
        "img_id": "bm0q50ZukzqouKbFp64k4A",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Exterior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bm0q50ZukzqouKbFp64k4A/o.jpg"
      }
    ],
    "user_id": "RoyfwK_-UFh6Gg7B9cX1BQ"
  },
  "09VLU5dN60YXEIyzGj-rbw": {
    "date": "4/12/2017",
    "text": "Everything here that we ordered was sooooo good. Fried rice full of flavor and not greasy. Pad Thai so tasty and not fake peanut buttery. And a perfect Guinness to boot. Five stars!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "b9oNk3PFe3uc4zrbF8g0cA"
  },
  "SFB-KgXXEDkyX_hafhjgBg": {
    "date": "3/19/2018",
    "text": "Place is beautiful on the outside and very cute on the inside. Reason for three stars is the Service wasn't great. They tell you \"one hour then you go\" when you're seated. They dropped off my food and never came back - not even to drop off the bill. Food was good but I've heard there's better Thai food nearby. I would definitely go back to have drinks at the bar",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8bncY_u9wIvt-LDiRhP2DQ"
  },
  "U1g0J0BK66ilZMntL7aMUw": {
    "date": "3/4/2018",
    "text": "Great atmosphere, nice food, fast service, interesting combo of British bar and Thai restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "excvXQoQm7pnj2NqTfzJDQ"
  },
  "j6INT3fJOjdVQp2cSuP0YA": {
    "date": "8/17/2017",
    "text": "While the pub looks pretty well worth the visit I guess. The Thai restaurant at the back is pretty average. Also we didn't find it be a kid friendly place to dine in. Wouldn't recommend if you have kids. They refuse to serve simpleboiled noodles to kids. They said you can order any of the noodles dishes and pick out the meat/veggies yourself. We were quite surprised as to why wouldn't they just serve the plain noodles which they anyways have in the kitchen. Overall very bad experience. Our previous review citing the same experience was deleted by the owner. What a way to insult yourself even more!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hwIc6_-GQob7_dntEE_3qA"
  },
  "6DbtKm2Hi44y0CS6Mczorg": {
    "date": "8/14/2017",
    "text": "It's a shame such a big restaurant refuses to serve simple boiled noodles (which am they have tons!) to kids. We didn't dine here as they are not at all kid friendly.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RbDoX4Pc_0ssCLYCcsr8hQ"
  },
  "LBb3Eo5W58kv387gA9CnhA": {
    "date": "2/5/2018",
    "text": "Great Thai food, average beer selection and BRILLIANT atmosphere. It's a bit too busy for my liking, but oh well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Wg-o8IHHgCoK2hYm65xLg"
  },
  "TnLS6sNk8oYnBi1831uoQw": {
    "date": "10/25/2016",
    "text": "Really more of a fan of the decor and atmosphere than the food. I ordered the Pad Siew, which was far more greasier than it needed to be... but would be the perfect hangover cure. The pub itself doesn't have the atmosphere the dining room does.. so if you do come, make sure to come for a meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pfbIVsfvmmCTq60JaqE_ew",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pfbIVsfvmmCTq60JaqE_ew/o.jpg"
      }
    ],
    "user_id": "oleWZYnYRSrAnaVXsNc-kw"
  },
  "9Kqs-Xw0LT3ES1HhruDz_w": {
    "date": "7/7/2017",
    "text": "Thai restaurant in the back of the pub is the highlight. Make a reservation or plan to have a couple pints while you wait for a table to open up. Well worth the wait. Only critic is the limited selection of beers on tap. Plenty of ales/lagers, but no pales.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvSfOWwkusENV2CWDvF3ww"
  },
  "5jXH9zPUjIle7KlVlqSuyw": {
    "date": "6/16/2017",
    "text": "Love the decorations, it makes me feel I walked into a castle of flowers. You cannot expect it to be too fancy, I mean, it's a bar, but the food are tasty and quite homey.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AQ2IOh9x42HChpq_E8T7Mg"
  },
  "IaNfa0HrQ8s2DDI9Syc6mw": {
    "date": "11/1/2016",
    "text": "The beer was a little warm but the vibe was really cool. Definitely check it out if you're in the neighborhood, close to the underground.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sgLQxA1fuDHHf8Upfd9s9w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Exterior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sgLQxA1fuDHHf8Upfd9s9w/o.jpg"
      },
      {
        "img_id": "OOkavf53RVHcOTGwugJ0Pw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. London Pride",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OOkavf53RVHcOTGwugJ0Pw/o.jpg"
      }
    ],
    "user_id": "J3eeXFUj4Zr8R7HKN7l7mw"
  },
  "X7bbDOufwLgB02TDwZRyKg": {
    "date": "8/7/2014",
    "text": "A beautiful, busy pub in a gorgeous area. The outer walls are bursting with flowers and it's so charming!The interior is kitschy and intimate, albeit quite loud with the evening crowds. During the after-work rush it took about 15 minutes to get a beer at the bar (we went for the Staropramen - a nice, middle of the road Czech beer). Without a reservation we only waited 30 minutes for a table in the attached Thai restaurant. The Thai food is awesome! The prawn crackers are a must, and it seems that you would enjoy any dish you order! Definitely check it out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-gUZrCjW5qX3ZT3Jw-4MQ"
  },
  "Mx7tBaOIfSgVGEb8ME3jWQ": {
    "date": "8/29/2013",
    "text": "Great atmosphere and quality Thai food makes for a happy me!  We dropped into this place for lunch and were told we could only sit for an hour, but it was definitely enough time to enjoy a delicious lunch.  We had the pad thai and the duck curry, both of which were very good.  I don't like bean sprouts in pad thai and theirs had very little of them.  The duck curry was not too hot and it was super tasty.  One of the best things about this place are the all the decorations!  The back has hanging plants covering the ceiling, making you feel like you're in a garden.  The pub section has pots and pans hanging from the ceiling all over.  There is so much to look at it's difficult to explain everything.  The outside is just as interesting as the inside!  Loved everything about our lunch!Warning: we came here a few nights before for food, but the kitchen closes at 10pm, which is when we arrived, so we left.  It seemed like a fun night spot while we were in there though!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pKN5U-pS-680yUGe87Gelw"
  },
  "d4nTAPPCioWqABC1Im4_gg": {
    "date": "9/25/2016",
    "text": "We ordered a chicken dish and a prawn dish at the Thai restaurant inside.  The meat was not fresh and the sauce was not authentic. Would not go again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nmXtJn2dpkJxhGqZSbzhHg"
  },
  "T-HQVbymQo812iMhX0fqIA": {
    "date": "12/31/2013",
    "text": "Food is amazing. Service was awful. Some of rudest staff I have ever met. We didn't get waters until the end of the meal. The waitress at the end threw our money across the table. It was crazy. I guess they assume they can serve good food and forget the good service? We ate Panang curry and pad Thai both were very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXERAT28NbczUUbN7yrPrg"
  },
  "TQyHvmJ4Qc1ayj2sd94j3Q": {
    "date": "3/13/2013",
    "text": "Went here for dinner and drinks, defo recommend! Fab Thai food, great little old boozer seeped in history! They have heaps of chamber pots (and the odd bed pan) hanging from the ceiling! my type of place for sure!  The fire's are great but alas, they are fake and only look the part, still lovely!Yep, worth a visit, gets busy, food yummy, guinness not bad and yeah, if you are in the area, go there!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "PhVO0Mrx_HgUlqMdufmScw": {
    "date": "3/18/2014",
    "text": "Who would expect Thai food in a pub!? It was fabulous! I love Thai and i like it very spicy...so be prepared if they say it's a spicy dish IT IS! I highly recommend coming here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "et1VtUxRQD0H-WUBP2BDBA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. St Patrick's Day",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/et1VtUxRQD0H-WUBP2BDBA/o.jpg"
      }
    ],
    "user_id": "j_GXFSN6nrzgZy8CxtchZw"
  },
  "7f40kL7OMVOVgTbg3UpJNw": {
    "date": "11/7/2016",
    "text": "Gerry, the manager has been here as long as I can remember. He is a perfectionist and a great lover of Winston Churchill, who the pub is named after. Many flowers, and photos of Churchill. Thai food, excellent, and the road was closed when they had a party last year. The Mayor of Kensington attended. Gerry has clout in this neighbourhood.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nhzyG7vCvZyfpNBvMqXjsA"
  },
  "77TBGfNCxudXHggIRUkDxg": {
    "date": "5/21/2015",
    "text": "Stopped in here for pints and thai food a few weeks back after my cousin recommended Churchill Arms as 'the best pub on the planet'. Whilst I don't know that I would go that far I would say it is at least a good local,full of friendly people, nice dark ambience, lots of Churchill Memorabilia, good pints, and filling spicy thai food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e3xXqCayE5Oo_xpgQifWWQ"
  },
  "K_9RQsgqySSw_Odx-WOVxQ": {
    "date": "6/16/2013",
    "text": "This is my go to pub when in London. It's one of the few proper pubs independently owned. The outside facade is covered in flowers. On the inside antiques and relics hang and cover every inch of the walls. Beer deliciousThe best part is the food - some of the best Thai food I have ever had and every inexpensive.Get there early because it fills up quick!!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JNmsCscNJlIYQ-GRhVSZPA"
  },
  "Z6voBVdVC2LLW5mnwKINlg": {
    "date": "3/22/2014",
    "text": "After seeing The Churchill Arms in my local restaurant feed for months, finally tried it. We sampled three main courses: mixed pad thai, kaeng Penang, and pad ga prow. The pad thai was the winning dish but would have been nicer if served with some lime wedges for freshness. Lovely flavour otherwise. The bill with two pints only came to about £30, so was a tasty & good value.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSPoK41InV_xppNS6p-NpQ"
  },
  "egXT-kL6wNaqn3JNsMJ3DQ": {
    "date": "10/26/2013",
    "text": "Beautiful place, both inside and out. Just covered in green. The Thai restaurant is in the back, and it is full of real plants and flowers, which creates a damp, humid atmosphere. I was with a party of 8 on a Monday night, we had a reservation - and good thing too. This place was off the hook. Reservation essential. The restaurant team was very efficient. I had a vegan rice and rice dish (the server understood this meant no fish or oyster sauce), which I'd requested mildly spicy. Now, I enjoy spicy food but I couldn't even finish my dish. So be warned! Afterwards, we moved into the pub for drinks. Nice, relaxed ambiance. Definitely recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XZfv70IsujPrIMGKeL9kdw"
  },
  "fFs739BcaiRdgqsx4YUOxQ": {
    "date": "9/13/2016",
    "text": "Literally the best Thai food I have had in London. Perfectly balanced flavours. Taste of lemon grass, fish sauce and coconut. Very cheap considering the location. I come here very often especially that pub itself is really nice.  Remember to make a reservation because it's so good that it's almost always ver",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPNOz4-benEvpaaWi0dtiA"
  },
  "t4EuHOkoB29rgBluoAFo4w": {
    "date": "8/10/2013",
    "text": "This has been one of my favorites and a must visit with each trip to London for years.  The bar is outstanding.  I love the quirky and rich décor and always enjoy the Fuller's cask offerings.  But the Thai restaurant in back is what sets it apart.  The food is authentic, tasty and a good value.  I always go spicier than I should but never regret it.  I love this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEUccJ6MxdaXPdnFfWT3dQ"
  },
  "S1ULvMcH6Ogqguj8ijDSQw": {
    "date": "1/17/2013",
    "text": "Friggin thievery central! You know how you don't really pay too much attention to those 'pickpocketers operating' or 'keep your stuff with you at all times' signs? Well at The Churchill Arms, you really should!I got my bag lifted there last night and the bar staff were so unsurprised looking that I figured it must happen all the time. Other than that, it's a fairly decent bar. An odd mixture of Irish and English that seems really weird together. They also serve Thai food. I'm really not sure why, it's very shizophrenic.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "SJjoj2P8iunH4F_nYdwEXg": {
    "date": "8/20/2013",
    "text": "During my business trip to London, I ended up at this restaurant as a recommendation from a colleague.  It's 10 minutes from High Kensington Street station and a very nice walk.  The service is fast/good and the food was really good.  The ambiance is very different/nice and first time I've been to a restaurant where you have to go through a pub to get to the restaurant.  Each time, I ordered Rad Na and loved it.  If you love flat noodles, gravy and veggies -- get this dish!  As for drinks, I ordered a lemon-aid during my second visit.  Heads up -  It's basically seltzer water and a lemon wedge.Next time I'm working in London, I'll be visiting this restaurant again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFElfMXI9bzdv0lMp12UFw"
  },
  "_oX1FfKInqsZp-aCuao_HA": {
    "date": "2/1/2013",
    "text": "For a pub with food this place has it all:Thai food is very good (they also serve traditional British pub fare).Atmosphere is bright and airy in the butterfly covered and glassed in conservatory in the rear.Outside of the Pub is an amazing exterior covered with flowers.  It's one of the most beautiful pub's I've seen.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vgnxCeEh7M8SXHnm4yKC1Q"
  },
  "W0zOikD7Evg8hJq7OBcnUA": {
    "date": "4/13/2013",
    "text": "This is a fine old lady of a pub with a decent selection of (Fuller's) ales. It should be a 4* pub, and Beer in the Evening and whatnot suggest it once was, but the indifferent service & crowds make it less so.There's decent food, though it's Thai food. It's good for Thai, but I don't understand combining Thai food & pubs. Someone should explain it to me.Teetering on the cusp of going to 4* for me, but it's going to stick at 3. Grand. Nothing wrong, but it doesn't feel special. Crowds? Staff who look like Saturday AM came about 12 hours too soon and hit a bit too hard? Overheated (we don't need heating and fire on when it's 11 degrees outside)... Not sure, but leaving I felt less good than walking in.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "PvUB9ORrh1qgpbXrihlKzw": {
    "date": "4/3/2015",
    "text": "Sorry to say, asking me and my girlfriend to leave our table before finishing our last drink that we paid for deserves a one star rating. We paid good money for our experience and travelled far for it and this just left a bad taste in our mouths.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBYg1XVHWJGWFK7EhVFZuQ"
  },
  "r8icMUUNz2z2zJyNfvuAVQ": {
    "date": "6/6/2016",
    "text": "Tasty food, quick service, very lovely ambiance with fresh pots of flowers. FYI, there is no prawn in the prawn cracker! Vegetable spring rolls are good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABogd8QN2wcB5hCWMD9C8A"
  },
  "WbAlGYU3cZsU1qTYJZ8dkw": {
    "date": "6/5/2016",
    "text": "This place is fantastic. It is busy and hard to find a table. But we snagged a table by the bar (these are first come and first serve) and ordered drinks. When you sit in the bar area you can still order food - just walk back to the restaurant to order and pay and they will bring your food to your table when it's ready.  You can stay at the bar tables as long as you want.  The restaurant tables require a wait.  Thai food was fantastic, the drinks are great and the vibe is awesome. If you want to go to a place that's lively and enjoyed by locals - this is the place to be!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W4EKYkNlgUnhndEFJ8RH-A"
  },
  "_zNOEJKzrzlGAf-iSYQIeg": {
    "date": "12/5/2017",
    "text": "I would come here for the decor alone! Historic posts and seasons extras made this a cheerful place to visit. The mid day mid week clientele were older and adorable as well as welcoming to us inquisitive Americans.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EF9Ek97Wvkni8hloSEA3Xg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EF9Ek97Wvkni8hloSEA3Xg/o.jpg"
      },
      {
        "img_id": "LvH0WR0F2-L-X-GbjzS2xA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LvH0WR0F2-L-X-GbjzS2xA/o.jpg"
      },
      {
        "img_id": "5CIQCqv_folFeJ7lsecOCg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5CIQCqv_folFeJ7lsecOCg/o.jpg"
      }
    ],
    "user_id": "ORPvRisZYWxTCiOCE03rpA"
  },
  "54qBFDSugIo6HWxYklAgnA": {
    "date": "3/21/2016",
    "text": "No visit to London town would be complete without a stroll through the beautifully quaint neighborhood of Notting Hill. It's here that you'll find one of the most wonderful surprises, a Thai restaurant hidden inside a dimly-lit oasis of flowers and memorabilia housed within a traditional British pub. It is one of the most delightfully odd combinations you'll encounter in the English capital. Delightful surprise aside, the Thai food was amazing! Authentic, delicious, and at a good price!!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DSWF36ea50u6qr3T-IL1oQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Inside the restaurant area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DSWF36ea50u6qr3T-IL1oQ/o.jpg"
      },
      {
        "img_id": "O_ynImmEe787p79-_ur04g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Inside the pub area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O_ynImmEe787p79-_ur04g/o.jpg"
      },
      {
        "img_id": "aOX_gBeS0DjQCWw7r8hd2Q",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Outside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aOX_gBeS0DjQCWw7r8hd2Q/o.jpg"
      }
    ],
    "user_id": "xtVcWcIKVORcBKhmdbrFiA"
  },
  "NK_E4K59WWdyjFdwNu3N0g": {
    "date": "1/15/2017",
    "text": "It's a nicely decorated pub that serves Thai food, what's not to love?  Throughout the years it seems that Churchill Arms has become a hotspot for tourists attracted to its lovely exterior but it's definitely still a worthwhile place to visit in my books!Come for a cheeky pint but stay for the spicy dishes.  While it's not the most amazing or authentic Thai I've had, it sure hits the spot when you have a hankering for some noodles or curry.  During Christmas, they take the decorations a step further and the entire outside of the pub is beautifully lit up with lights and it's not to be missed!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8kY5aHfA0k0BhvakKg076w"
  },
  "lse-fH70z2SVBeOot131ew": {
    "date": "10/8/2017",
    "text": "Yum some great Thai food ! The front serves as a bar with a great atmosphere . The ales and lager options were awesome. The back is a Thai restaurant with some great food. There's a bit of a crowd but worth the wait . Plus you can always have a beer while waiting =)Ordered a spicy prawn dish (#16) ... if you can handle the heat ... well worth it .Oh and great prices !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "prAzN3cVJAAeBhQYQPGpCA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. #16 under noodles ( prawn )",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/prAzN3cVJAAeBhQYQPGpCA/o.jpg"
      }
    ],
    "user_id": "XXbJ9r4futHfZKFeholztg"
  },
  "r5DFabIjpSPqkU4D3mqW-Q": {
    "date": "3/25/2018",
    "text": "The food here was really good. The one caveat to mention is the set up is confusing. For example, there are two parts of the restaurant -a pub that is loud and smells strongly of beer and a thai restsurant that is much more quiet and refined. Be sure you go to the section that you prefer based on your scene for the night.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WCZJHL2JcDB1MCgqJX0vmA"
  },
  "Xr2v7RJUxCYX4dwil1Swiw": {
    "date": "10/20/2017",
    "text": "Beautiful and unique bar and Thai restaurant with amazing hanging plants and decor, a must go!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FXJGqplo3wGuWFGxqxmv8w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. The charming ambiance and plants.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FXJGqplo3wGuWFGxqxmv8w/o.jpg"
      },
      {
        "img_id": "bGh95GkByWfKKxWzMAitdw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Jungle curry and pad Thai, delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bGh95GkByWfKKxWzMAitdw/o.jpg"
      }
    ],
    "user_id": "1rCIwEDtkTgj3GcpRNpbJA"
  },
  "b4S-e0Lqb_L3BBiQJ7JRyQ": {
    "date": "9/17/2017",
    "text": "Nice place. It's a bar in the front and in the back there is a Thai restaurant. You could sit \"outside\" and enjoy your meal, but you have a 1 hour time limit to eat so be aware. Food is ok compared to all the Thai food I've ever had, but it's a nice spot for a meal. Staff were very friendly and courteous. You could get some nice pictures here as well. Just don't stand in the middle of the street like some one did. Go across the street.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E-Nbwa93s7dm81N8AinM5g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E-Nbwa93s7dm81N8AinM5g/o.jpg"
      },
      {
        "img_id": "d_zeNEpEK6N7jY0P6frIzw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d_zeNEpEK6N7jY0P6frIzw/o.jpg"
      },
      {
        "img_id": "isz_CA63W-b88w6AK09pjw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/isz_CA63W-b88w6AK09pjw/o.jpg"
      }
    ],
    "user_id": "zAgS9yEyETNwGz2YSI1ZrA"
  },
  "UNSq8Eebmiu5U-AeUE5I6Q": {
    "date": "9/9/2017",
    "text": "This is a must stop!  We had the best time meeting some Brits!This is the second most popular pub in London.  The food is outstanding too.  Try all of the ales and lagers!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRlHuRKQe6pH7BegzH4o4A"
  },
  "xKFeIkXIJvDF_e_rISqY0w": {
    "date": "3/4/2018",
    "text": "We discovered this place to go for drinks. It's a classic English pub. What we didn't realize was the food here is AMAZING!!  They serve Thai food and it is so flavorful. I'm from Los Angeles and often I find it hard to find a wide range of Asian food in Europe that's full of flavor and compares with food in LA. This place does. They even had great vegan options for our friends that ate with us.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DWgtq_2YblvlJ_VptHoXg"
  },
  "CZi1HmUJ8kuhDfa52snkvg": {
    "date": "11/23/2016",
    "text": "I've admired the Churchill Arms from across the Atlantic for years. You could say this place is \"Instagram famous.\" I've seen countless of Instagram pics of this beautiful pub in London that is covered in flowers. The Churchill Arms didn't even seem real to me. How can a place so beautiful actually exist? Knowing that I was finally going to visit London, the Churchill Arms was on the top of my list of places to visit. When I actually arrived, luckily, it did not disappoint.This place is just as  beautiful as in the pictures. When I saw it for the first time, I thought maybe I had stepped into a Jane Austen novel. Flowers covered the entire building and it was like looking at a dream. Inside, the walls and ceiling at covered with knick knacks and artifacts. Most would think this clutters the pub, but I think it gives it certain character and adds to the whimsical setting. While at the pub my sister and I decided to have lunch. In the back of this out of world pub, is a Thai restaurant. I got my usual Pad Thai, and I can't remember what my sister got, but there were no complaints, so I think she liked it. The food was nothing special, but it was still tasty. I think the ambiance is what really makes this place memorable.I'm not sure I would recommend anyone to visit the Churchill Arms just for Thai food, but I would  say if you want to drink in a beautiful bar, this is the place to go.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HJhaVgR-DqPinbdxXyRUGg"
  },
  "Z4wTwFZovf_7BRYzAJpJuw": {
    "date": "4/1/2018",
    "text": "For starters this place is not a steak house. So if you're in the mood for steak hint they serve Chinese food!!!  not steak, Chinese food!!!  The place was packed but their service sucked.  I don't know how it got such rave reviews and why this place is promoted as a steak house.  Walked about a mile and a half in anticipation of a great steak and ended up having to eat pad thai. Not only that but the staff pressed me to pay my check the moment I ordered.  No Thank you. Giving them 2 stars I think is generous",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fK1--Uv5EWr-PFt1DvYDWg"
  },
  "Ccykh-fXB_FJRvn8Cdb3MQ": {
    "date": "8/12/2017",
    "text": "Great, unexpected Thai food! Very courteous to Americans. Portions are well sized and flavors are phenomenal. A nice change from the typical pub food. Plus, the inside of this place is so cute and quaint with a lot of greenery. A must-go in London!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2sJqk-HhIpkUEnqAchte7A",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2sJqk-HhIpkUEnqAchte7A/o.jpg"
      },
      {
        "img_id": "cV7W4_UpOKFTeomOeFCw1w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Cute exterior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cV7W4_UpOKFTeomOeFCw1w/o.jpg"
      }
    ],
    "user_id": "lZgTKOIHUTXHmo1IzTZd_w"
  },
  "lRK-YuRwyTu_Y8G0-LccAw": {
    "date": "6/21/2018",
    "text": "This was a great gem recommended to me by some American expats in London. The bar has a unique decor and a cool ambiance - part pub and part Thai restaurant. The food was amazing and the place looked to be popular with locals and tourists alike. I had the jungle curry, which was spicy but not too spicy so long as you like spicy food. It did seem like there was a long wait, but you can just grab a punt and watch some football while you wait.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PvBxts5crwntwpvsGedQig"
  },
  "OVUsvtaf4MYq_Q6d9lE-Gg": {
    "date": "5/28/2017",
    "text": "Beautiful old English pub with flowers galore.If your looking for traditional English pub food this isn't the place. All Thai food, the only thing English here in the beer. Waitress told use we had to finish in one hour and told use we had to order whole meals. Never again",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLzgnkIJXV59RsxNPsiwCg"
  },
  "ZtpHT3BR022tVRiPN_E8aA": {
    "date": "6/16/2017",
    "text": "When planning our trip to London, this was a must do for my husband. Obviously the facade of the building is photo worthy and beautiful but even more so he was excited to try the Thai food! We made a reservation (had to do it via phone) and I am glad we did. It was very busy, which I assume is how it normally would be. We printed the coupon for a free drink off of their website, that was a definite plus! I ordered the shrimp pad Thai and my husband ordered the chicken pad see ew. Both dishes was delicious. We had another couple with us that really enjoyed their dishes as well. The best surprise was the spring rolls. They was amazing! We ordered two plates of them!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SFPVLskvMhFXWF_3ULactw"
  },
  "F82NVJbQs44VZA9bhDf9JA": {
    "date": "8/3/2017",
    "text": "I loved the flowers. The decor is really nice and impressive. But unfortunately it cannot cover up a nasty smell inside. Thai food (completed with a rude service) is average at most.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9dLjr2lfpRsJtAv6ewt3g"
  },
  "4tExGusT52DmVy2RHdIxyQ": {
    "date": "4/30/2017",
    "text": "This was such a neat pub! Loved all the fresh flowers inside. Very unique. I had pad Thai and it was excellent. Very reasonably priced. Definitely a good one to check out especially if you like Thai food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nW8ujzozMdCPeEhD-_QRcA"
  },
  "Aw5Uy-5YBqYrwfy3BdCt3Q": {
    "date": "7/8/2017",
    "text": "The pub part of the place was bumping and full of excitement. The restaurant side had the same lovely decor much much less of a crowd. The Thai food was good but not incredible or unique. This is more of a place to visit to take pictures or have a pint.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sx7enNUrzrzSY8UcdlIK9g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sx7enNUrzrzSY8UcdlIK9g/o.jpg"
      }
    ],
    "user_id": "ihnziCmSLLpNvl0xefGayA"
  },
  "oIf5LBoWfVqOB84YL6lS_Q": {
    "date": "3/1/2017",
    "text": "Excellent Thai food. Priced right, great selection of Pub drinks etc. nice people, always crowded, but a lot of seating so not too much problem of waiting. I like all the selections and you just can't go wrong here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZdNFnb44pkjKXdRNZ4Cvlw"
  },
  "PQTqqoyBGZJsFrAZ8Z16Mg": {
    "date": "12/19/2017",
    "text": "The BEST pies ever!! Loved going here and hanging out with my work colleagues!! Great times!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AI1-EBbstD44GkqtV0RZBw"
  },
  "wQSGY6BuOb5a1NmEwX1UFg": {
    "date": "11/12/2010",
    "text": "Awesome vibe at this Winston Churchill relic pub and thai restaurant on the back.  Love the green curry!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E5Wy5rft_MZaH7quCTAhfA"
  },
  "xai3om2-uInFy4h6Xn8wgQ": {
    "date": "2/28/2009",
    "text": "The Churchill Arms is one of the local pubs in my area. It's located on Kensington Church St, not far from Notting Hill Gate Underground Station. I like it because it's sort of quirky looking with lots of hanging baskets on the oustide of the pub (as you can see from the picture). The bar area is pretty small, but in the summertime it's actually quite nice just to stand outside. There is also a restaurant area that has been recognised for it's great Thai food, which is delicious and pretty inexpensive. They also do three types of roast dinner on a Sunday. A really lovely pub in a nice area with friendly staff. Definitely recommend going there.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "I_eZl5FJN0XsJjsax_O56w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Churchill Arms, Kensington Church St, W8",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I_eZl5FJN0XsJjsax_O56w/o.jpg"
      }
    ],
    "user_id": null
  },
  "QL2nkCSe74LFXZS44pBc3w": {
    "date": "5/9/2011",
    "text": "I exaggerate alot, but I think this has to be best value meal in London. Great food for an amazing price. Couple that with a picturesque pub and the Churchill Arms is always a great experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkNRIGWXLQIquX1LcM9lQA"
  },
  "WZCu5goh8zTY3egfaxnj4A": {
    "date": "10/6/2010",
    "text": "Churchill Arms may be the most charming pub in London. From the hanging baskets both inside and outside to the funky decor, it certainly packs a big punch with ambience. The thai food was very good for pub grub, and an absolute steal for this neighbourhood. However, it left my tummy feeling a bit \"uneasy.\" Don't want to necessarily blame the pub on that, but it did leave me with an imperfect impression of the place. That said, I'll definitely go back and give it another go!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZGTn42PI10nzs0Amg-7qg"
  },
  "R5QFvyIwFGrtjT5NYa8wLw": {
    "date": "9/28/2007",
    "text": "Every Year when I am at an Exhibition in the Olympia Hall it is a definite MUST to meet a friend at this bar. It is a very very very inspiring place with good fresh beer and at least when I was there very atentive and attractive staff. See you in December!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lb9VJ44IP43z4fL4vcZD1g"
  },
  "s47jiaZfjkpotJoRbOuTjg": {
    "date": "4/8/2008",
    "text": "Stonking place. Packed even on a Monday night, which tells you a lot. We eventually came in here for a nightcap, as it was totally rammed at first attempt, which is a shame as we had been lured in by the delicate waft of Thai spices and the promise of a great atmosphere. Ok, so drinking options are about as standard as you are going to find, but the interior entirely mitigates this. It's like wandering into a witchdoctor's bar with low end of the spectrum lighting and strange voodoo like watering cans and rugby balls hanging off the ceiling, even a (quite useful) signpost. As mentioned by other qypers, the Thai section is a brighter palm leafed little oasis to the side of the bar. It's a wonderful symbiosis which results in an inviting and charactered spot to socialise in, ably assisted by lovely staff.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "s9uc2QrmaaEIR8q2WgmYAA": {
    "date": "4/9/2011",
    "text": "Tasty Pad Thai, well-kept Chiswick, courteous staff and very cool decor inside and out. What more could you want? Oh, you want your meal for under a tenner as well? Done. Get there really early or really late, 'cause the place is rammed around mealtimes.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hfv00bSvms_YLkJyQ5aC1w"
  },
  "jxdi-CvO-70oYIyeBOZZ7A": {
    "date": "11/1/2007",
    "text": "Another cursed-name venue, but hey it seems that it's blessing in disguise!Churchill's IS the epitome of good pub foodForget sausage & mash or fish and chips though: we're talking Thai pub food. Go and see it for yourself, it's only 5 minutes from Notting Hill Gate station. You'll get your money worth: £ 6 for a big phat noodle or rice meal! Don't get put off by the pub side of the pub where Churchill governs on wallpaper, but head straight to the green back garden, which is actually where the action is. This may sound very adventurous, but I just make-believe: I usually only stick with Pad Thai (number 5 or 6 on the menu).",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "w7nr2ffRHWfpuUBJnEz-yQ": {
    "date": "11/6/2007",
    "text": "The gem of Kensington, in my opinion, the Churchill Arms is both an excellent British pub, and exceptional Thai restaurant. It is as if someone decided to put two of my favourite things together in one building! The pub interior, decorated with a bizarre arrangement of random memorabilia, is intriguingly fascinating. It is often busy, but always relaxed, and once can usually find some standing space to enjoy a traditional pint. (Standing outside is often the preferred practice in warmer months).The Thai restaurant round back is like another world  a leafy oasis, with tables to fit any group. The food is fantastic  the pad thai being a consistant favourite  and meals are extremely good value, with generous mains under £10. The only problem I have with Churchill Arms is that it is not closer to my house.Like, next door.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "huTVwh5429i6CcFZHaYsbg": {
    "date": "3/16/2008",
    "text": "This place is actually called The Churchill Arms, but it's certainly true that it serves up incredibly tasty and massively popular Thai food from its busy kitchen. It's located halfway between Notting Hill Gate and High Street Kensington. The exterior of the pub is an explosion of mutli-coloured floral baskets. Inside is an even more intense explosion ofwell, everything. Books and weapons and instrument cases and bicycles and everything under the sun lines every square inch of wall and ceiling in here. The place is crammed full of bits of history. The drinks are what you'd expect: Fuller ales, lagers, spirits, and wine. It's for the Thai food that people pack the place out. You get a lot for the money, and they don't scrimp on the spices. Get in early, order, and enjoy the great pub character while you wait.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2s2k78xLOBrv5P6fT7pY9Q": {
    "date": "4/26/2008",
    "text": "You can't miss this place in summer due to the amount of hanging baskets this pub has. Never before have I seen a building so devoted to floral attire! Inside it is eccentric in the old english pub way, pots and pans hanging from the ceilings, old photographs etc etc. The pub leads through to the restaurant which continues the over abundance in plant theme. You can get Thai food here if you manage to get a table - this place get rammed, in fact I have never actually been able to sit down in this pub.",
    "rating": 3.0,
    "rated": {},
    "photos": [
      {
        "img_id": "6OeSg2RvCySduGVe6iHo7w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6OeSg2RvCySduGVe6iHo7w/o.jpg"
      }
    ],
    "user_id": null
  },
  "wf5WQ02wrCbAHU6FBoQd7w": {
    "date": "11/19/2008",
    "text": "This pub is very close to my office so I have been there many times. What I love about this pub is that it's just full of character which is rare these days with the pub chain filled high streets around London. As well as being a great pub to go for a drink, I think it serves great Thai food which is not only tasty but also great value for money. The only downside of going to eat here is that if you enter the 'restaurant section' of the pub at the back then the table is normally turned around in about an hour. So if you fancy going there one evening and are planning to stay a while, I would suggest securing a table in the bar area first so that you can eat and then sit and chat over a beer or three. Would highly recommend giving Churchill's a try when you are next in the area!!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "eqZuJSl9Htg454o2xbE0YA": {
    "date": "1/15/2008",
    "text": "The first thing you'll notice about the Churchill Arms is the huge flower display outside. The name of the pub is barely readable amongst it all. If there is a sports tournament/war memorial etc. going on somewhere in the world, there's a good chance landlord Gerry's barstaff will have gone all out to represent it with inflatables and memorabilia. There's loads of other interesting collections on the walls an, of course, tons of Churchill stuff. After you're good and drunk, had the spilt drink trick played on you by Gerry and watched the sport, you should move to the courtyard at the back and have one of the best Thai meals in London. Winner of the 1999 Evening Standard Pub of the Year, it hasn't dropped an ounce of quality since. Great for families, dates, meeting mates or a quiet one after work, The Churchill Arms is the ultimate Central-West London public house.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zcetb-kZa7qq82dNqzwkAw": {
    "date": "7/5/2010",
    "text": "One of my favourite pubs. The real ales are varied and excellent. The room is publy attractive. The staff are competent and quick. The patrons are diverse and uniformly friendly. The Thai food is filling, flavorful and inexpensive (very inexpensive).This is a great place to watch Formula 1 or football. I last watched England draw with the USA in World Cup group play and the crowd was polite to both sides.This is one to try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fO3Krss6nRHglxVXetRazw"
  },
  "Amn_mWN3C3ufKNcX2zprOw": {
    "date": "11/17/2008",
    "text": "I've never really understood the fuss about this place, though being Australian perhaps I am not as enamoured with the idea of putting Thai food in a pub which is quite common in Sydney. The food is good not great, but it gets packed and it's always really uncomfortable. For my money I would go to a Thai Restuarant and eat in less cramped conditions and then go to a pub after.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "j-gMenpX_NDzbe9pb5TiFQ": {
    "date": "1/29/2010",
    "text": "Good food and massive portions but it is hot hot hot!! I'm not usually a wimp when it comes to heat but my duck curry nearly blew my head off! Ask for mild and see how you go. Lovely little conservatory area out in the back and eveything tastes authentic and fresh.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "BbTC3MwM5HF2XtLliVPSyw": {
    "date": "12/18/2009",
    "text": "One of my favourite pubs in London. Only real downside is the popularity, which makes it a complete pain in the ass to find a table, or a spot at the bar. The interior is completely mad; all kinds of junk hanging from the ceilings and walls, WW2 propoganda posters everywhere, and a restaurant cum greenhouse selling Thai food out the back. If you can get here early, and grab a table, then I can highly recommend it, otherwise I'd give it a miss for somewhere less crowded.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JaEysnNbJFTMPirLjlbbxw": {
    "date": "2/23/2012",
    "text": "One of the loveliest pubs I have been to. It is very pretty and you can enjoy different types of food firstly, my friends and I stayed in the pub area and had some lovely beers (they have got a great selection there in the pub) and then secondly, we moved on to a Thai restaurant in the same pub which was fantastic, food was lovely spiced up. I can definitely recommend it. Would go there again and again.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Hz3ks-z6_V9095J_ml7c3A": {
    "date": "6/16/2009",
    "text": "London is expensive.Churchill arms is the best of both worlds.  A traditional english pub + a thai restaurant hidden in the back.The prices were extremely reasonable and the portions were huge.  The wait can be a bit long during peak hours, but that is just because it is so popular and the seating is limited.Spiciness for each dish is measured using a 1-3 butterfly system.  I have tried the 3 butterfly and it makes you sweat.  The type of sweat that you appreciate, if you are a spicy food lover.  A must visit, if you are in London and are having trouble adapting to the english pub food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1VvrDo7dGv_WOQG3C-yvOA"
  },
  "8yEkaYtBNFS_w-OxbrbEfw": {
    "date": "11/28/2008",
    "text": "The Churchill Arms is certainly atmospheric.  Its theme is pots, pans, plants (and Winston Churchill), and I suppose this is charming, but on most nights I have found it chaotic and a bit claustrophobic.  Like the exterior (which is drowning beautifully in hanging and potted plants), the Thai restaurant in the back in also drowning in plants, so much so that a tall person will easily find their head caught up amongst the greenery falling from the ceiling.  I finally had a chance to eat here - after hearing about its famous cheap Thai - and yes, it was pretty cheap.  But the food was as good as any cheap Thai food.  And instead of being intrigued by the little room and its dichotomy to the old English boozer I entered, I found it oddly unpleasant.  It feels like a fast food joint (but cleaner and with live plants), complete with harsh lighting, flimsy tables and laminated menus, was picked off a street corner and attached to the pub.  And the service!  I know they really try to turn tables here, but I swear to you that we were asked - by sweet-faced waitresses that quickly turned surly - if we were ready to order TEN times within 20 minutes of sitting.  And 9 of these times came after we had ordered wine and appetizers.  And did I mention there were at least 5 empty tables in the room?",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UHZPdrwiOMjiqb8IyAfwMQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UHZPdrwiOMjiqb8IyAfwMQ/o.jpg"
      },
      {
        "img_id": "KztFnoZVl-HQL8_Bby9aNg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KztFnoZVl-HQL8_Bby9aNg/o.jpg"
      }
    ],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "WRkSz8XXsttcPgAY55Nggg": {
    "date": "4/10/2011",
    "text": "Best Thai food I've had in London... and it's AT A PUB!!!  Get a beer in the front while you wait for a table, and then head to the back and eat some excellent Thai food - it actually tastes authentic.  Everything we ordered was top notch, so go family style if you want and share a few different things.  Very reasonably priced as well!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bqKmPP3nPycZvMBpDrVJxw"
  },
  "8as9VX7rhsntRSNxP9tofA": {
    "date": "7/29/2015",
    "text": "How can you go wrong with a traditional English pub that also serves Thai food? Answer is you can't, but that's not to say there isn't room for improvement. Dining without a reservation, we had about a 40 minute wait--not bad and the Notting Hill neighborhood is one to walk around in the meantime. Once seated, the food was solid, but the atmosphere itself was awesome. The pub is decked out with plants and flowers and while a bit claustrophobic at times, was beautiful. The Thai menu is not very expansive, but that's ok given the entire experience. The Thai egg rolls were a winner, fresh and crisp, and the cashew chicken had the spice done right--not overwhelming, but a lingering kick. The lack of Thai iced coffee or tea was a bit of a disappointment, but the pints more than made up for it. The restaurant and bar seemed to be independent operations, but that didn't distract. As an annoying American, I could do without dogs in bars (there were at least 2), but overall, the experience was pretty solid and worth a try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gaCXBsn5w3jcsVpJ4dkLTA"
  },
  "Y2FywJ3m4bGmwCU69yjglg": {
    "date": "1/21/2009",
    "text": "Never been to the Churchill Arms as a pub, only for the Thai food in the back!  Was recommended to me by a colleague.  Amazing Pad Thai and Green curry, large portions, mostly everything on the menu is only £6!! They don't take reservations for lunch, but in the evenings it's a MUST as it get's super busy. The staff are all very friendly and accomodating. Mostly go only with a friend or two, but one time they made room for a whole gaggle of girls (at least 10).",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "fJH3zbE6BVL2B6-lk509hQ"
  },
  "rcXpwGit-CQopPFj9Du0dA": {
    "date": "6/30/2014",
    "text": "The flowers outside this pub are so impressive and enjoyable to see. The inside of the pub is very \"old school\". We enjoyed grabbing a pint or two here, yet mostly enjoyed the outside of the pub with the beautiful flowers on the street. Notting Hill is charming, this pub adds to the charm.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FbImB89RQDqK_t3m4dyViw"
  },
  "204ZphYQTtezo-gHfZlX8Q": {
    "date": "10/25/2012",
    "text": "Great pub, and delicious (and CHEAP!) thai restaurant in the back.This is a charming, local haunt that I frequent often.  Very typical neighborhood English pub up front, and charming little butterfly/conservatory themed Thai restaurant out back.  The thai food is surprisingly good, given the price point.Beware, though, 3-stars spicy, while good, is REALLY SPICY (I eat loads of spicy food regularly).  Also, the wait staff always give the standard \"only 1 hour\" per seating thing at the beginning, but if it's not crowded, they don't hold you to it.  If you visit the pub during dinner time and think you might want to eat, be sure to go and put your name on the list for a table in advance if it's crowded, as it can get VERY crowded.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mObkshufoxYGFIRD8eUyLg"
  },
  "vijWbA2WqlEG92sWHFKjpg": {
    "date": "6/11/2014",
    "text": "The quintessential London pub - tons of character, fun crowd. We came one evening for drinks and came back a few nights later for Thai food. The dish I ordered (Panang Beef) was not what I expected and was a bit disappointing but my BF's chicken with basil was really tasty. If you are getting food I recommend a reservation because it does get crowded. The \"garden room\" in the back is unique, but a little questionable in terms of cleanliness- it's very cluttered. Anyway still a fun place with decent prices and food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dptdrfU7mylLQqCnBAE6nQ"
  },
  "ozGKwW6juiBCvjA4VS-DCg": {
    "date": "7/13/2009",
    "text": "London, much more than new york, seems to be big on chain restaurants, its difficult to make it 60 feet without seeing another pret, 100 feet without an \"eat\", 120 feet without a costa, 150 feet without a starbucks, 200 feet without a major american chain (mcdonals, pizza hut, bk, subway, kfc), and 500 feet without a number of smaller other chains (pauls, thai square,  etc.). Omnipresent in this is the endless queue of pubs, most helping to further prove my favorite quote about london \"You know- fish, chips, cup o' tea, bad food, worse weather, Mary f*cking Poppins...London\"Here's the most normal looking pub you could find, then add a thai place around the corner of the bar. You know, the random bits and bobs, dark wood, 8 taps of fullers on cask, small woden tables, couples and their kids and dogs sitting around reading the paper, but then getting some pad thai and a curry. Its a concept i quite likeThe invisible que for tables in the pub part can be long and in the restaurnt peice it can be even harder at times but the food's quite solidIt may not be the best thai i've had, even in london, but the plates are generous and reasonably priced, spiced a little more to my mates tastes than mine (read: milder than you'd get in ny), the appetizers are quite small in comparison to the mains, but nice enough for them the main dishes come with rice without needed to order on the side (which seems to get more and more common each year)For a pint or three its nice to be able to get some craveworthy food right at the bar, likely worth 3.5 stars",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGNm8ZuCrNOkZikce_CoxA"
  },
  "tAWk5nhNHZsZz1CKU_NoEA": {
    "date": "3/3/2010",
    "text": "I really do enjoy this pub, it is one of my dad's favourites as well as I mine, which I think says a lot. You will find all sorts of ages in this pub but thankfully without any noisy big parties or teenagers. The look of the place is incredible. The outside is beautiful with all the flowers all over the building. The inside is like gymnastics for the eyes - there are so many things to see and you bounce from one artifact to the other. There are pots and pans hanging from the low ceiling as well as rugby balls now because it is the season. The owner of the pub is always around and he is such a laugh. He clears the glasses of the table with his hooked cane so beware if it comes swooshing close to you! The back of the pub has a conservatory/ butterfly exhibition room which serves thai food. The thai food is very yummy and a good price. Unfortunately to eat in the actual restaurant you almos always need a reservation but the good news is that you can actually eat the thai food anywhere in the pub! So no need to reserve! I would definitely say this pub is worth a visit if you are in the area, beware though on Sundays it gets very busy.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zHWeXaKNqMpqzftqJ4evUQ": {
    "date": "3/20/2009",
    "text": "Fantastic pub and Gerry behind the bar is a legend of a landlord.The Thai food's great, last time I was home it was GBP5.50 which is a steal for Kensington!  Not sure how much it is now!!The only gripe I have about the pub it that it's too small, there's not much they can do about that though!!  Any chance of opening a branch up in L.A.?!Keep up the good work Gerry and Up The Banner!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VUzFjBnDYk9TGZboqfU5-g"
  },
  "AIQS2O62-QMofFbjpOt6hg": {
    "date": "12/21/2011",
    "text": "My friend and I ordered the pad see eww and the duck curry.  Both were delicious and the portions were great. The prices for all the dishes were pretty reasonable.  We ordered the two mains and a bottle of wine and the total was about £29.  My only gripe was the one hour time limit per table bit - but I guess thats why the wait for a table isn't too terrible.  We basically attempted to down our wine in the remaining time period before we had to leave the table (2 minutes). Class!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpnBAjy4h0y95Icf_3bUrw"
  },
  "0TLeRsUHdGP6oh1UyI_ZmA": {
    "date": "4/22/2012",
    "text": "Had this place on my print out of BeerAdvocate places to visit, but only noticed it as we passed by it on a bus tour, so we had to memorize the way, as we waited for the next stop. Inside the place was really unique, with a butterfly garden in the back. People watching aspect of this place is extraordinary, and the beer selection is above average even for a place such as London. I would also imagine that this would be an easy sell for those BAs that have significant others that are not as keen on visit beer places, as this has a good amount of history and uniqueness for everyone who is visiting.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zc7SNKIZur-Q4C-J6bGXfw"
  },
  "pppqQo5-uO3RIlsX_SPCIg": {
    "date": "12/30/2008",
    "text": "Churchills is my favourite pub in the area. They have a great selection of draught beer and lager and the pints are not to pricey. The décor is dark wood and very cosy. The sense of the place is old country and welcoming.What makes this pub so special is the Thai food. For £6 you can get a huge plate of Thai goodness. The Pad Thai is sensational. The service is quick and even when busy you get you food quickly. The eating area is split. There is a restaurant at the back where you get full table service, or you can sit in the pub and you grab your own drinks from the bar. (No service charge for the latter.)Be warned the menu dishes have chillies next to them to indicate spice level. I love hot food and went for a level three. The food was so hot I though my brain would incinerate. Play it safe and go for a one or two if unsure.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "L7ln7GPekZW6tK0dU4btoQ": {
    "date": "10/3/2009",
    "text": "Not recommended for tall people, unless you enjoy having your head amongst a diverse mix of low-flying plant life, butterflies and general knick-knackery! But, all that stuff does make this an interesting and unique pub. What's more - they've somehow sneaked in a small Thai restaurant in the back. I love this concept, but in reality it serves a very limited selection of quite basic and unspectacular Thai dishes. The prices are what you'd reasonably expect for food that isn't going to blow you away. Very busy on the Friday night I went, with a one hour wait for dinner at 8.30pm.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-RB3_zYK2dHRMWbVY4EVw"
  },
  "mRRSpgiWcsM0Dc5fSre5gw": {
    "date": "7/11/2011",
    "text": "this is a random place, but in a good way.  i was looking on yelp to see where i could meet my friend in the area and thought churchill arms was perfect...thai food and beer.  what could be that?we shared the prawn pad thai and some other prawn stir fried dish w/ peppers.  it had a level 3 spice, which is the spiciest they have, and there actually was spice (even by my chinese and my korean friend's standards).  portions were pretty good, and the food was tasty, so i will be back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rx7DNBmPPShVjlcQidGuTw"
  },
  "Sj9UwURlvqpY2k0RchAovA": {
    "date": "10/20/2009",
    "text": "Must be memorable or my South African friend would not have remembered it so fondly from his months living and working in the big smoke? This character filled pub gets so busy that they've started hanging their memorabilia from the ceilings. It houses more than just a pub, however. There is an equally busy and popular restaurant serving Thai food in the back. Food was tasty and service acceptable, if a little rushed.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jNuuCGEiWnn_WU1dyWhoRQ": {
    "date": "11/30/2011",
    "text": "Fantastic Pub. I've only been there once but I am dying to go back and can't recommend it highly enough! It's a great place to take people that are over as tourists. Full of character and full to the brim inside with interesting things to look at. Lovely friendly barstaff, good range of drinks on offer. The icing on the cake is the lovely Thai restaurant out the back (or you can eat in the bar/pub area), fantastic food at a really good price and again really lovely surroundings. In the Summer there is an amazing display of flowers outside.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FMPMlJ6Ufy_L-T3x9YUcWQ": {
    "date": "9/26/2010",
    "text": "This pub looks great not just from the outside, but check out the Thai dining room! Plants galore :) Really good (and cheap!) Thai food in the back of the pub. It gets very busy though, so without a reservation, you'll most likely have a wait and not get into the main dining room (still, even then it's worth it). You can order your drinks from the main pub bar bit to enjoy with your delicious London Thai cuisine :) Watch out for the particularly spicy dishes!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BHg8vBiAGS5eMqejydHsKg"
  },
  "ikZq-A05STyU7WAqVp7iHw": {
    "date": "4/30/2009",
    "text": "Must be about the only pub in the world that has a picture of Churchill above a Céad Míle Fáilte sign (its owned by a Irish fella so there's a strange mix of decoration) Great wee pub,good for conversation and the kinda place where you can chat about somethin random with the people sitting beside you; not easy to find in this town I tell ya!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "896iELqyTrg1V8LubWV-tg": {
    "date": "3/1/2012",
    "text": "Pub is nice but the Thai restaurant in the back which use to be good has gone right down hill, surly service and small portions, takeaway is even worse, £7.50 for half a portion of pad Thai with 3 bits of chicken, poor value. This place use to be very good will not go again am now a fan of the Thai at the latimer pub hammersmith road.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vXgJdUvleI1UW7rOvq7oPQ": {
    "date": "6/12/2009",
    "text": "Pretty much an awesome pub, though it's more of a novelty pub than a real pub you'd go to regularly. Full of tourists but the potties, knick knacks and thai food make up for it. In summer you won't see it for hanging baskets, so keep your eyes peeled.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wtkbLvkQnCkNyGf3jEL5fg": {
    "date": "7/25/2018",
    "text": "The Churchill arms is absolutely beautiful, dressed in flowers on the outside with the feel of a garden on the inside. We came for dinner, because I read that Thai in the UK is a must just as Indian food is. The Churchill did not disappoint, I had the pad see ew and it was better than my go to Thai place back at home in the NYC, as reluctant as I am to say so. The Thai tea is delicious and refreshing. The service however was not the best, they rush you and border in rude when you ask for anything.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "oh3tI4bX14h20eDfwQEAAA"
  },
  "6xTjwjpFP6V7iEVpFO8bbw": {
    "date": "9/5/2018",
    "text": "Amazing Thai food and wonderful pub atmosphere!  A must see every time you're in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wXDRDLWTC6W2Kx73P08Orw"
  },
  "BQWfjryFii1tOwNyovqHYg": {
    "date": "4/1/2018",
    "text": "Cutest pub in London and for sure a photo opportunity not to be missed! And if it's Christmas-wait till you see it!Just down the street from Portobello Market and a great stop after.Oddly, there is a Thai restaurant in the back which was pretty good!Of note-across the street is a great bakery to grab that much needed sweet to complement the Thai spicy!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "huXqrSaGyNO1aZKiM55EUg"
  },
  "QGZ7gJOVhfR_a_VOzncPyQ": {
    "date": "8/19/2018",
    "text": "Great service. Bar staff is amazing and was incredibly helpful while we we were lost. Great Thai food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-bPT9-dTTT_rhsTRPdcpAQ"
  },
  "h3--oZzQFu3lj-xhA2KIIw": {
    "date": "1/2/2017",
    "text": "We went for dinner at the restaurant, and it was really mediocre at best. Our pad thai was average, though the portions were good for sure. Service was what annoyed me the most. First, the staff member that accepted my reservation took down my name wrong. Second, when we asked why our food was delayed behind those that ordered after us, we got very uninterested and curt response. Overall, a lot of room for improvement in terms of service. Ambience was unique and interesting for sure. Both the exterior and the interior were a sight to behold.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sVm_vtPByF37fKjHGp1PVg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sVm_vtPByF37fKjHGp1PVg/o.jpg"
      }
    ],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "55ogquaP7j9U37OwIsG6mg": {
    "date": "7/23/2018",
    "text": "What a fabulous restaurant! So much fun to be in the garden of flowers. The food was great and quick to the table. Loved the ambience! Can't wait to return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-SeIcD8u0bTNRC0bl01K1w"
  },
  "nx9rMui9G0xrVn0TDfd7ew": {
    "date": "1/5/2018",
    "text": "Granted, London is know for its rude people, but there's no one ruder than that old battle axe who runs the Thai restaurant in the back. \"You have one hour. One hour to eat and then you go,\" is her standard greeting I heard repeated several times while others we being seated. Service was reasonably quick and efficient - the old lady probably starts cutting off digits if they dally too long at a table.The food itself is average Thai food, it will probably fit the bill if you're out getting hammered but this place has all the charm of a Waffle House. Do yourself a favor, book a table at Siam Secret - the best Thai food I've ever had outside of Thailand.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h_fZaH7wq8P1u9inSW_vAg"
  },
  "3hsxEttNGWzpuAU2TAT19g": {
    "date": "11/28/2017",
    "text": "Beautiful pub near Chelsea in London. Went on one of my many exploration treks when I was visiting the city for my birthday this past August. There is a lot of Churchill memorabilia there. Apparently he spent a lot of time at this pub, writing and sometimes delivering speeches during his time in Parliament as Prime Minister. I loved the atmosphere! The pub seems to serve mostly Fuller's brand, which was great (my favorite beer is the Fullers ESB :D). I had lunch at the restaurant (which is just behind the pub). They server Thai food, which was delicious. I am not a fan of Asian food, but I made an exception here. The food had the right amount of spice and paired great with the beer I was having. One complaint! The person who seated me told me that 'we need the table in one hour.' I was a bit upset because I was willing to spend more money, but I didn't let it tarnish the whole experience. Will come back.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "52sNE8NW-0W0IVaigtz9qA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/52sNE8NW-0W0IVaigtz9qA/o.jpg"
      },
      {
        "img_id": "OPDup7UVLZhJUJtLwBZs_w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OPDup7UVLZhJUJtLwBZs_w/o.jpg"
      },
      {
        "img_id": "C2zMny9QIqylc-XJ7li3tQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Some of the great wall decor @ The Churchil Arms",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C2zMny9QIqylc-XJ7li3tQ/o.jpg"
      }
    ],
    "user_id": "uinnfMZfWr_5xdFcK0eSSg"
  },
  "0ydAO602eAGz3fb6aNhNGw": {
    "date": "5/19/2017",
    "text": "An eccentric little place where Winston Churchill's grandparents used to frequent is one of the most famous pubs in London. Its overgrown plant collection, large ale collection, and Churchill memorabilia make this small watering hole a must-stop destination for locals and tourists alike.Being the first pub to offer Thai food in London, Churchill Arms serves no-doubt authentic dishes, getting their spices just right. If it were not for the elbow-to-elbow atmosphere, this place would have gotten a 5-star from me. But I guess it's just all part of the Churchill Arms experience.Oh and if you sign up on their emailing list on the website, you get a free pint when you visit!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "J_NZejScaR5_D6LerjASew"
  },
  "C2ApZITyJI68M--Dz3WQzQ": {
    "date": "1/15/2018",
    "text": "One of my favorite pubs to visit. I always enjoy going back. It's even cooler around Christmas when they go a bit overboard with the decorations. The Thai food is excellent and authentic. I would recommend having some along with some Fullers pints :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tXhscxwFTd-ayLTdPx_2yA"
  },
  "Y580SbaDmSFoUZcU-N1l9g": {
    "date": "3/26/2018",
    "text": "First timer having pad Thai & I have to say I'm very impressed. This place was amazing. I will note that you have to make a reservation in order to get it for they are very busy. You are only allowed to really have a table for an hour, we stayed for around an hour & 30 mins but it was a week day so maybe they only mind on weekends. They also have great rice. Yummy !!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tm45s2M5WMn43uC0wx-bdg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pad Thai, shrimp rice, curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Tm45s2M5WMn43uC0wx-bdg/o.jpg"
      }
    ],
    "user_id": "YcVjZ7H7RE8rAT6frz6RZw"
  },
  "1l5vU46y-cbxz9eddxGVUQ": {
    "date": "6/1/2017",
    "text": "Beautiful pub, great beer selection, friendly service. Incredible character. If you are visiting as a tourist, it is a must visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SAU1oT73aS-IovaRIWHm-Q"
  },
  "U2QZz-yNpuYgumwLiRRm4w": {
    "date": "6/15/2018",
    "text": "My home away from home. The perfect modern but traditional British pub. An amazing place to meet new friends with a great staff",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dWnHa9vGHakd9ZezJakV-w"
  },
  "hGdKE9rR6h_LEaHdyQXErg": {
    "date": "6/23/2018",
    "text": "The Thai restaurant here is a hidden gem tucked in the very back of a traditional English pub.  A tropical, green filled nook, the food was delicious (when they say spicy they mean it!), and plenty of it.  Easy on the wallet.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pgdyxjRmUhhrj5hvrEDmYQ"
  },
  "oF8d03XM8yo9Jh9LyOmvwQ": {
    "date": "7/1/2018",
    "text": "Always crowded but they will get you in because they kick everyone out after an hour LOL! Personally love the Thai green curry and my husband loves the Pad Thai. Everything delicious and the atmosphere is a festival for the eyes.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mL8t_CHHPAMOOLSqudUblQ"
  },
  "bZ-LogFtuLvCdojfQ7WDCw": {
    "date": "5/17/2017",
    "text": "Drinks only review.  This is a must do if you are near it.  It has quite a bit of character, and it was elbow to elbow the time i went (friday night).  Had several pints with a friend and it was an enjoyable time.  I love the fact that you can drink outside on the sidewalk.  I was a nice cool night and everyone was friendly and a few chatted me up while I waited for my friend.Not sure that I would want to spend much time inside, as it was pretty packed, but people were having a good time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UE253L6vW3b8rQhRHWWi3Q"
  },
  "N6Gg8d0kwFNDvtGfYFy4FA": {
    "date": "9/16/2017",
    "text": "review only for the pub and atmosphere, not the foodit's so picturesque inside. like stepping back in time. decorated with all sorts of eclectic mementos hanging from the ceiling and tacked to the walls. beautifully lit inside. I was there on a Friday after work, so it was crowded, but I managed to find a seat at the bar and enjoy a few beers before dinner. the bartenders are very friendly and do a great job managing the chaoswill make it a regular stop when I'm in Kensington!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "jj7qARHi2gfTZY87v2RQsw"
  },
  "owMW2GnEPMG_vk87l0wXYw": {
    "date": "8/3/2016",
    "text": "The venue is too cool! On the outside the pub is covered in flowers. On the inside is British memorabilia from Churchill to Prince William and Kate, tacky in a fun way.  The funny thing is the bar is very British, but in the back room it is a Thai restaurant.  The host was extremely rude and rushed us.  The food was mediocre, but it was the first Asian food I've eaten in a week so I was happy. I may be spoiled, I lived in Thai Town in LA for a few years. I was just surprised that the food wasn't better because of the many positive reviews on Yelp. We got the pad Thai, fried rice and duck curry. Everything was good, but I've had  better. Fun venue to try! I'd recommend it because it's quirky :)",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kIpuxNODs8KajsGvJ-m_dA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Food was OK.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kIpuxNODs8KajsGvJ-m_dA/o.jpg"
      },
      {
        "img_id": "QFSYIus34zVJ3EDaDg5iMw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Very pretty, covered in flowers.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QFSYIus34zVJ3EDaDg5iMw/o.jpg"
      }
    ],
    "user_id": "PWgcYLgF2iO86dEVQFxH9g"
  },
  "Xa-DVOftYU6797AanBFXvA": {
    "date": "8/25/2017",
    "text": "The 2 stars are for the exterior of the building. We decided to visit, expecting a really quaint traditional English pub and I'm presuming that's exactly what you would get unless of course you want food. In which case you are told they are serving food 'out the back'. It's only when you get out the back you realise - hang on, this is a Thai restaurant. My wife loves Thai food so even though this was not what we were expecting (who expects a Thai restaurant out the back of a British pub?) we decided to try it.The experience was horrible. Before we even sat down we were told we had 1 hour to vacate the table. The tables are heaped on top of each other, clearly trying to cram as many customers as they can into a very limited space. We could hear every word of the couple's conversation next to us (they were on date #3 and she really wants to try snowboarding in case you're interested). The servers just dumped the food in front of us, adding to the feel of being on the clock - no time to chew, the food will digest in your stomach. The food itself - not being an expert in Thai food, I defer to my wife who said it was just ok. It was not exactly cheap for pretty average fare.Now, the piece de resistance, my wife's digestive system has been suffering considerably since we've eaten there. In this day and age, it really is unacceptable to suffer stomach and digestive complaints from a restaurant in a recognised establishment that charges a tidy sum.Thanks Churchill Arms, for turning the last 36 hours of our honeymoon into a 100m dash for the nearest latrine competition. Great job on the exterior of the building. Could you now turn your attention to the interior of the building? Specifically the area 'out the back' that passes itself off as a restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0-dmjGZvfFzmcEpTR5Mhg"
  },
  "ldOcYbZJhL1tJbUNer9N5w": {
    "date": "8/29/2018",
    "text": "Was not impressed with the attitude of the establishment or the employee's. When we first arrived we were told we had one hour to eat, the waiter miscommunicated our order and when we tried to get his attention he told us one minute, kept walking and never returned. We had to ask another waiter for the menu to place another order.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oe0wbKEBwsHEG0mJaXVoEg"
  },
  "CRX08DuVdXaPaTfsLcqF2w": {
    "date": "8/23/2010",
    "text": "Thai food at a pub? Don't be deceived by appearances! The Churchill Arms serves up an awesome Pad Thai for much less than most restaurants!The wait can be quite long in the evening, but they do takeaway if you walk right up to the counter in the back of the pub. The dining area is small, but you can sit in the pub area if it's full. I actually prefer to sit in the pub area because your eyes get to wander all the interesting things adorning the walls and ceiling.It's a quick walk from Notting Hill Gate tube station, so it's a great place to stop into if you've been up at Portobello Market.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0SZy4uieBzBzg54vRdAfgw"
  },
  "TawUt3a8sP6U-xuDskvHtA": {
    "date": "6/4/2013",
    "text": "Had a great time here. My wife and I agree that this was the best meal we had during our London vacation.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SxZp4JAsOpVg2Z8CTTuAQ"
  },
  "IjAHcPWyyqdFCCqGsq731A": {
    "date": "7/13/2013",
    "text": "Really great experience from start to finish, great pub, fast service, and reasonable and delicious food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "osOQbJU321dcEQHR2gD44g"
  },
  "BzUJBz4RYssNs2BMINarmw": {
    "date": "7/18/2010",
    "text": "Beers - GreatAmbiance - Fantastic - great outside/insideFood - I didn't want ThaiService - The guys were pretty young, and not knowledgeable about anythingIf there was a bar keep over 25, with somewhat a knowledge of the beers - 4 stars..",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8xaBJ1Mu1rDHQsD_mAdIsw"
  },
  "X_zzQgTZXoZDqDiUTFiQSg": {
    "date": "6/16/2012",
    "text": "An authentic and historic pub plus pretty good Thai food. I love combos.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SzHDUZ0lgCJsF7ECRyjzhQ"
  },
  "EwlvCMQLTvgdGI7pPmK22w": {
    "date": "8/31/2008",
    "text": "As you can see the other posts, this pub hides a delightful secret a thai restaurant at the back! Run by a Thai native, it serves simple, but great thai food. The menu consists of rices dishes that come with curry or stirfry, or noodle dishes. For the adventurous, they have spicy jungle curry that will rival those found in Bangkok for its spiciness. Each dish is £6, and is very filling. Service is quick, and there is usually a queue to get a table on weekends or in the evenings. Drinks have to be ordered from the bar in the pub side. This is a place for when you want to have lunch or dinner with friends in a relaxing friendly atmosphere, and don't want to spend too much either!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "UFjXTQl0EJmq2H5HaIRrKA": {
    "date": "7/22/2012",
    "text": "This pub a great photo opportunity, inside & out. And the surfeit of hanging baskets makes it the most attractive pub I've ever seen!   It also has a great tap and lots of comfy chairs.  But the most peculiar thing is that the pub is connected to a Thai restaurant.   I can just imagine the poor soul after a pint too many, who wanders off in the wrong direction in search of the bathroom finding himself in Thailand.   Definitely a sobering shock!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbR7mXUKWlwjL2zdY438ZA"
  },
  "EzkrEPxFjRFCHWRjwRLnxw": {
    "date": "3/4/2010",
    "text": "Great, great recommendation from a local!Delicious and inexpensive thai food in the back section of a pub.  Lots of character (flowers and plants in every nook and cranny).  Fast service, which was good because upon being seated, our waitress informed us we could only have our table for one hour.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnAox4KQN8oBc_MWveKs4Q"
  },
  "PfpK8BC6p_9DIsknsupdxw": {
    "date": "7/14/2010",
    "text": "I was in London for about 9 weeks and this was my favorite pub! Great Thai Food!! Egg Rolls and the Pad Thai! May have to wait with a big group, but you can just grab a pint in the front and they will come grab you!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CX2HkcnlXpW95nSvOXOPsQ"
  },
  "vAOBixZ8fu8WnXrWJ12Zww": {
    "date": "3/17/2011",
    "text": "A friend suggested me to check this place out. He was very positive that I will like it. Well, it's nice and it has character, and the staff was very friendly. However, the Thai restaurant in the back of th pub just made this place have a weird mixture of bad smells. Too strong. I wasn't too impressed.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IuScx7ksl1Gzl9KokA9Bag": {
    "date": "8/5/2010",
    "text": "One of my classmates has been obsessed with this place since the second day he got here. He made me curious, and passing the overly-flowered outside while walking to the Portabello Market and Notting Hill thrift stores made me want to go in there more. But, I don't go to pubs alone, so I had to wait until we could go together.Man, the wait was well worth it. We went in the afternoon when it was filled with disgruntled tourists and old ladies....perfect atmosphere for a weekday afternoon. Drinks were cheap and the Thai food was cheap, let alone delicious. Many places do duck curry wrong, but the portion was perfect and perfectly flavored, and they gave you enough rice to have the perfect rice/curry ratio. Good work, Churchill!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMDBx5JniWfeL26ZdnaCPA"
  },
  "E5bhc9JV8lonbOxDST3B7Q": {
    "date": "9/30/2012",
    "text": "I thought I had reviewed this already.  Go here! it is without a doubt my favorite bar in London I only wish I had found it sooner.  For some reason it never feels cramped or hectic despite being very very busy.  Add to that the interesting decor and incredible thai food and whats not to love.  I can't for the life of me comprehend how much work must be involved in maintaining all those plants and flowers :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yh2LI7JQAODDn8a1ky0qxw"
  },
  "x_CQziAFFHK6BYu0Wqt-ww": {
    "date": "8/23/2010",
    "text": "Undoubtedly one of the prettiest pubs in London, with hanging baskets galore in the summer months and endless fairy lights come Christmas time. The interior is just as charming, although the hundreds of chamber pots hanging from the ceiling is a tad unnerving! Out the back there's a restaurant which serves Thai food. I've never eaten there but the restaurant area is wonderfully quirky, and feels like an indoor garden with water features and shrubbery wherever you turn. I'll report back once I've sampled some of the cuisine.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "i-oU2aHRmReMB4p6kaD4vQ": {
    "date": "1/27/2015",
    "text": "The best Thai food in London (my opinion of course)! Food served quickly, hot, and so tasty! Great pub atmosphere with pints and wines. But the Thai food is something to brag about. Fun time, interesting bar setting, cool building (especially in the spring with all the flowers) and delicious food. Friendly bar and restaurant staff. Go! Go now!! If you're on Kensington High Street and you see a bunch of people walking, this is where they are going... follow them, you will have no regrets.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pv6Ax-zSvj7eBWn0cU2o8A"
  },
  "LhH8G7C8_lhzUd6lqHyx-g": {
    "date": "2/3/2011",
    "text": "This pub is really pretty, thats partly what made me want to try it, well that and the thai food. However this pub I feel is a victim of its own success, I went on a Wednesday night at it was rammed and impossible to get a table. However we did get a table in the restaurant but I found the food a let down, I love thai food and I like it spicy but the dish I had nearly blew my brains out. And the experience was quite rushed so I won't be returning.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EIzNiv-mvsh_YFHCEnHFGg": {
    "date": "11/4/2010",
    "text": "This review is just for the Thai restaurant attached to the pub and not for the pub itself (which I think is a bit too old manish).It serves the best Thai food in London bar none.You will probably have to wait a while for a table but it is worth it.The portions are large and the price is very good (you will not find cheaper in the area).Now if only they could move it out of that old geezers pub.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBEcxUip646XsYH-V2YPfQ"
  },
  "_IihB2pJqEPu7RcNdfxxpg": {
    "date": "4/23/2013",
    "text": "Very cool venue, tasty Thai food- what more could you really need?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U8gHyA_v2VJG3BkFIF_87Q",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Looking up in the garden area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U8gHyA_v2VJG3BkFIF_87Q/o.jpg"
      }
    ],
    "user_id": "DsfbVzBvXY2LSExw7fKRxA"
  },
  "DVh4pqMNYyoqO3vVb7YomQ": {
    "date": "8/11/2009",
    "text": "Great atmosphere (homey).  Great crowd (equal age distribution between 20 and 60, and everyone gets along and converses).  Some of the best Thai food around (I always get #16 w/prawns).Great Fuller's ales.It has it all.  What else do you need?Oh, and it gets a bit more crowded during rugby matches....",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fqmQYC7iiWfiOpH2ohFq4A"
  },
  "xsRhsyHRpHzilxZumz1seA": {
    "date": "12/12/2012",
    "text": "Nice traditional pub atmosphere. Very crowded though. Very good thai food served at the back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pymN3cigO6WF-yIQFG7-xA"
  },
  "-ckwH6b05Q8zLyhTsuKKXA": {
    "date": "7/22/2014",
    "text": "I followed a Yelp recommendation here and was somewhat disappointed. Mediocre at best Thai food and very expensive drinks. Besides the flowers there's very very little to recommend here. Certainly not a #1 pick on any level.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjBjnL8tzHoAFroM_gCTTg"
  },
  "Gw4z1Zg5jUjo5hX1-f7EDA": {
    "date": "11/3/2018",
    "text": "I was traveling solo and was looking for a tasty dinner. I was seated right away and told I could only take one hour to eat. Odd but I wasn't planning on staying longer than that. The decor is really interesting inside with lots of plants & vines hanging. It is very cozy and the food in the Thai restaurant in the back is really good. I didn't know what to order and looked for a review and ordered the chicken Pad Gai Himmayan mild (spelling?) and a Thai iced tea. I was extremely satisfied with my meal. I've had some of the best Thai restaurants in NY and can say the flavor was spot on. The service is quick but of course not very friendly but I think it's just a cultural thing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5rGUgZ2x5GAbKWiRr85uoA"
  },
  "Po373UVKCm42VPjX6n1o1A": {
    "date": "9/18/2018",
    "text": "Cool old pub. The bar section and exterior are kitschy on top of kitschy with a side of kitsch. There are tons of knick-knacks inside, and the outside is plastered with vegetation to the point it almost looks like a building is growing on the vines rather than the other way around. Hey, go big or go home, right? It's pretty cool looking, actually. We shared a gin and tonic and left, but it's worth a look if you're in the neighborhood.They also run a Thai restaurant in back, which sadly we did not try due to their being completely reserved a few days in advance. It's a hot ticket!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ll9xYfxhRJ3gy3upckMrTQ"
  },
  "DT3snCh-k758ucU-SHQx5Q": {
    "date": "8/2/2018",
    "text": "This place is VERY cool. Eating here just to sit in their canopy of plants and lanterns and interesting decor is an experience in and of itself. But on to the goods - the food. We (my guy and me) have Thai food quite often in the States, at least once every two weeks. We both got different spice levels of Pad Thai, and I wouldn't recommend the very mild one - it is pretty plain. But, my partner in food had the mild level of spicy and it was very flavorful and tasty! The waiters aren't super friendly and the beer was warm, but I'd still recommend checking this place out (it is cooollll) even if it's just to have a beer. The front is actually a pub, so you don't HAVE to eat, you can always just drink!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GS8JBR4o_fJ4CiGRM-idKw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GS8JBR4o_fJ4CiGRM-idKw/o.jpg"
      },
      {
        "img_id": "Fx2VoiJE7eeSsqTsZIJeNQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fx2VoiJE7eeSsqTsZIJeNQ/o.jpg"
      },
      {
        "img_id": "VAWcroOOB8b17CATDAulNA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VAWcroOOB8b17CATDAulNA/o.jpg"
      }
    ],
    "user_id": "cb8z9k6I1_oNbC8bLFSrwg"
  },
  "q3v2eDkeKEBYSjmh90fBVQ": {
    "date": "10/20/2018",
    "text": "Great beer, great Indian food and fantastic atmosphere. Bar staff could be a bit friendlier though. It can get pack quickly and unexpectedly so make sure to show up early. When you walk in, you must find your own table and grab your beer from the bar. You also have to go on the side of the pub (right) to order your Thai food. The will bring your food the the table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vIApj-K58KwuhFMDY7awdQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vIApj-K58KwuhFMDY7awdQ/o.jpg"
      },
      {
        "img_id": "IyYL88TAYkC99fxA-pOUuQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IyYL88TAYkC99fxA-pOUuQ/o.jpg"
      },
      {
        "img_id": "r4tTZxJegafxensS4vsb0g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r4tTZxJegafxensS4vsb0g/o.jpg"
      }
    ],
    "user_id": "d79dPSEQNogIarJb0lY-0w"
  },
  "MCb7iTy1R2HVQ7OTqNlAaQ": {
    "date": "5/25/2018",
    "text": "This place was soooo good. It was one of my top 5 for best food I've had in England. I was just looking for something close to my hotel but I got so much more. Food is flavorful and you get lots of it. The outside and inside is beautiful and there is tons of space. The front area is a bar and the back area is the restaurant. I got pad Thai and spring rolls. Both great for the value and had left overs. Service was just ok but the food makes up for it. Already planning to go back and bring friends.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DpsXNe_90MYGhMgl1khhFg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DpsXNe_90MYGhMgl1khhFg/o.jpg"
      },
      {
        "img_id": "_C5e26_XbW0bfnib0btgNg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_C5e26_XbW0bfnib0btgNg/o.jpg"
      },
      {
        "img_id": "9IRGDcb_ZzhdwKHB3Rj1lg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9IRGDcb_ZzhdwKHB3Rj1lg/o.jpg"
      }
    ],
    "user_id": "TMxJ_nX9P0hNK-TlaA_q-w"
  },
  "uHc7jXR589pcsIC2u3qJNA": {
    "date": "11/4/2018",
    "text": "Based on reviews, I knew what to expect. The reviews are very accurate. The place gets crowded, so I took care to get there around noon. By 12:40, it was filling up fast. I ate in the front pub area. You go back to the restaurant area, about midway back, and order from a woman who serves as order-taker and cashier. Her demeanor is a cross between sadness, anger, and resignation. You indicate in the general area where you're sitting, and hope the server finds you. They do. I started with the fried spring rolls, six of them, accompanied by that pink-orange sweet-hot dipping sauce. The spring rolls are small and quite ordinary; even the sauce wasn't up to the task of saving them. My stir-fry (#11, with chicken) was hot in both temperature and spice. But it had a vague fish flavor to it, so much so that I reviewed the menu again to see if that was among the ingredients. No. I wistfully looked at the dishes being served to the neighboring tables; they all looked good. I'll try this place again (I enjoy pub interiors and the people who frequent them) but I'll try something else. The brewer's (Fuller) lager, Frontier, was a perfect accompaniment. I gave an extra star for the motley collection of toys and memorabilia on the ceiling, including a Focke Wulf fw190 chasing a Spitfire.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kbUPdc_Q1qdAzwAMMGP0g"
  },
  "JzoIUaVsTwNn7Ww4wAo6-A": {
    "date": "10/17/2018",
    "text": "Such a unique place! We were sick of boring pub food, and we love Thai. When I saw this spot on Yelp we had to check it out. Great solid Thai food in a charming pub. I'd recommend this to anyone staying around Kensington!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9bgJdfrBWmd-D0B8hwOeIA"
  },
  "-aQiZN065yLNwMufS3nFtA": {
    "date": "5/16/2018",
    "text": "This picturesque bar is a nice stop for a quick drink! We did not order food so I cannot comment on the food. The selection of beers & spirits will satisfy any pallet. My only qualm was the lackluster bar staff who were unwillingly to enter into any conversation and seemed like they didn't even want to be working together. At a \"touristy\" destination such as this one, I wished for more conversation from the staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WAA18XLgmNvngI7VlR86GQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WAA18XLgmNvngI7VlR86GQ/o.jpg"
      },
      {
        "img_id": "WbU_0Uw4D07U4dMH5BOuWQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WbU_0Uw4D07U4dMH5BOuWQ/o.jpg"
      }
    ],
    "user_id": "5k0VjoCXFNz1qfeylktyTg"
  },
  "ge4q3bT7BeM56bdijuWzJQ": {
    "date": "6/11/2018",
    "text": "Cheap Thai food in a nice British setting. Great for a quick bite and pint. Good taste and portions for the price. All dishes are ~9 pounds. The exterior is very pretty and worth a picture. A nice place to grab lunch before or after exploring Kensington palace / Notting Hill.We got the Jungle Curry and the Pad Ga Praow. Both on the very spicy side. I also got a passion fruit cider! Very refreshing and I would highly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ho-rFTYPAEd01GIY3iGXzA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Jungle Curry - spicy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ho-rFTYPAEd01GIY3iGXzA/o.jpg"
      }
    ],
    "user_id": "lx6sNseyS_PLf-T9ZiQ5Ow"
  },
  "qdy8Pslechqjw3jCMpoyuQ": {
    "date": "3/24/2018",
    "text": "The cutest building all covered in plants & flowers.  quite funny because it is half pub & half thai restaurant which is such a random mix. We enjoyed both sides! Sat at the pub one day during the rugby Six Nations match & came back the next night for some Thai food for dinner. At the Thai restaurant all the food was really tasty & had a good amount of spice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ytw1GEZSH5tkuR7SjUK_uQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pad kra pow w/beef",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ytw1GEZSH5tkuR7SjUK_uQ/o.jpg"
      },
      {
        "img_id": "SL4QizXlSDz8nvEW6hsdrw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Prawn chips (recommend!!)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SL4QizXlSDz8nvEW6hsdrw/o.jpg"
      },
      {
        "img_id": "DvWfuzv7_mmVtom_Nn8o-w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DvWfuzv7_mmVtom_Nn8o-w/o.jpg"
      }
    ],
    "user_id": "pLuqaZyi-XhtxwRPTMn3fg"
  },
  "fH13R4DY4YAMPYnLyljXoA": {
    "date": "7/14/2018",
    "text": "Let me start this off by saying I truly love Thai food - and have been to several Thai restaurants (in the area and in the states) Okay. I walk in, table for 2, they're busy but we're seated within 5 minutes. Much appreciated. Hostess was rude. Look, I know Asian culture, I get the language barrier, BUT the hostess was RUDE and she knew she was being rude. Server was slightly better. Food came out quick. I ordered pad Thai and pad kee Mo, with an order of spring rolls. Food was average. They didn't have Tom Kha soup and the server was extremely rude when I asked for Siracha. To summarize:Food: averageService: below averageAlso, they had 32 people crammed in one back room. That's just the one room in the back, the other rooms were even worse (didn't get a total count) There are better Thai restaurants in the area.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWuVZY2Gw-nLihFrY5kDSA"
  },
  "PsQJMLAUx6SnZHSKJA63pg": {
    "date": "7/3/2017",
    "text": "I found out about the Churchill Arms via Instagram. It's that picturesque pub that you see with tons of flowers outside. I was really only expecting to snap a quick picture outside and leave, but when my friends and I were in the area, needed a dinner place, and saw it had 4 stars, we decided to give this place a try. Plus, we were pretty sick of English pub food at this point, so Thai food was a welcome change. Speaking of Thai food, from the outside looking in, you would never guess it was Thai food. It was only through research that I learned this. I also learned that it can get pretty packed. So when we showed up on Friday night at about 8 pm, we thought that grabbing a table for three would be a feat. Luckily, the place is pretty big, they told us to look around, and we eventually found a table not too long after.I ordered the pad kee mao, which came out really quickly. It was SUPER spicy. TOO spicy for me, but this isn't the fault of Churchill Arms, as the dish is meant to be spicy. But, I couldn't eat the dish because my mouth was on fire and I got filled up on the water that was putting out the fire on my tongue. Could have used some Snow (Hey Yo). I got the rest to go and ate the rest later that night. I picked out all of the RHCP and it was great. The noodles were palatable again.Bottom line, you should definitely go to at least check out all of the flowers. But if you want to get a seat for some Thai food, don't go at prime dinner time.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xtowxiMJAZFD_7Sho7ou8Q",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xtowxiMJAZFD_7Sho7ou8Q/o.jpg"
      },
      {
        "img_id": "gWMcZqJ90gCRHepue9m4xg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pad see ew",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gWMcZqJ90gCRHepue9m4xg/o.jpg"
      }
    ],
    "user_id": "hwSSM8Jn29dXRW4ym-roDQ"
  },
  "cwpYeKDT-Vq9fcRBJTx3qg": {
    "date": "7/9/2018",
    "text": "Lovely from the outside so much fun on the inside.  We came during the World Cup and it was packed! We didn't have a chance to eat but it smelled delicious. Great place to enjoy a pint when around Kensington.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3o03ZW81acqWyBuI7_uicg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3o03ZW81acqWyBuI7_uicg/o.jpg"
      }
    ],
    "user_id": "0FNHHcIPWKCo63pwPiGGuA"
  },
  "QKKT9GbxIHvEvWkVJkUKlQ": {
    "date": "5/18/2017",
    "text": "Okay. I am sorry this place is loved by so many people. I understand why the bar is famous, I get that part and it wowed me too. But the thai restaurant, it wasn't that good, actually it wasn't good at all. The place made me claustrophobic, the plants were too much, and then food in there with so many people sitting so close, the humidity , o am sorry but I didn't have a great experience. They tried to create it pretty and may be it is for some people. I personally didn't like it .Again, the bar was great and so was it's historic significance.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "aBT2g9V7zqLHyEXJ0vuJog",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aBT2g9V7zqLHyEXJ0vuJog/o.jpg"
      },
      {
        "img_id": "e8BncQ955PILq_bVsgJZNg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e8BncQ955PILq_bVsgJZNg/o.jpg"
      },
      {
        "img_id": "e-CXX-wB0gWOkuSRsBqJRg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e-CXX-wB0gWOkuSRsBqJRg/o.jpg"
      }
    ],
    "user_id": "8JBNbcvUBpHCnt2zHWB6EQ"
  },
  "Hx-EKTaAPY0CWYA7S3dICg": {
    "date": "9/14/2018",
    "text": "A unique pub experience. Come for the unique environment, stay for the Thai food. Both are truly enjoyable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-yB-ZiPSQlLLdeBgCKmkg"
  },
  "kkYo5nVFrR5WICK5WNfeEw": {
    "date": "5/23/2017",
    "text": "I've been here twice already as a tourist that a local friend of mine recommended to me. You'll first notice the grandiose display of flowers out front which is certainly an eye catcher, but incredibly beautiful in my opinion! You'd never guess there's a Thai restaurant in the back of the pub and alas! There is. The first time I went, it was a group of 8 of us. A reservation was made and we had to wait about 35 minutes, but got seated. I know that the restaurant is small and I sensed that such a big group was a \"burden\" of sorts but we were taken care of. Albeit, quickly so they could open the table again , but it didn't matter to my friends as we were enjoying the company. I fell in LOVE with their sweet and sour chicken dish which was delightful yet affordable and a combination hard to find in my native Los Angeles. Because it was the end of the day, my group and I corralled at the front pub after we paid our bill. Some had pints they enjoyed, I did not. We had to split the group as there weren't tables big enough to accommodate, but we made most of the situation as people filtered out the later it got (it was a Monday night). The second time I went, it was a group of three on a Sunday during the Notting Hill Carnival so doubly packed in the pub, spilling out into the street. and we were served almost immediately with no problem as my friend made a reservation. I also have to give the 'Arms \"props\" for a lovely, clean washroom with a flower theme (as you can imagine). Delightful albeit crowded and loud, Churchill Arms is my recurring London spot to pop in to!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LY1EqTV18dq2cE3DSxelSg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Gorgeous exterior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LY1EqTV18dq2cE3DSxelSg/o.jpg"
      },
      {
        "img_id": "FRaqcmlBiLVDa7Lc_73pLQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Sweet and sour chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FRaqcmlBiLVDa7Lc_73pLQ/o.jpg"
      },
      {
        "img_id": "D0QG4xV4Ax00-H9_vbZZlg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pub area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D0QG4xV4Ax00-H9_vbZZlg/o.jpg"
      }
    ],
    "user_id": "TxCdYTGAXSmE3SkkfuLk1Q"
  },
  "ipFcrgyFICSR-FKxxWNrHg": {
    "date": "12/20/2017",
    "text": "We met a local friend here for a pint and it was amazing. The entire exterior of the pub was covered in live Christmas trees. It is literally the most festive place I've ever been. It was a bit crowded, even on a Monday night, but we enjoyed a glass of their mulled wine and then a pint. Another friend suggested we go to see them on Halloween as well. It was a pretty traditional pub on the inside with a very warm atmosphere. We would definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZRbHWhBAWpy5xJzHzlly-w",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Outside the pub at Christmas.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZRbHWhBAWpy5xJzHzlly-w/o.jpg"
      }
    ],
    "user_id": "oCQL1K75KqzptANKH5eUCQ"
  },
  "2qxllMSud_fuQYcB_EjEjQ": {
    "date": "5/30/2017",
    "text": "I have to admit the initial reason for me coming to Churchhill Arms was initially based on all the exterior pictures posted to various travel websites,  showing a vast array of flowers and plants spilling over from windowsills and down the walls made it look like the quintessential British pub. The interior is actually bigger than it looks, but made to feel cozy with walls that a filled to the brim with various pictures, knickknacks and greenery throughout. A warning though, this place is very popular and wait times should be expected, but between the bar and nearby shopping, the wait time doesn't seem too long. The restaurant has a great selection of beers and wines that pair well with the Thai menu. The portions here are huge, so you could easily share a dish between two people. Everything is made to order and the degree of spiciness for each dish is listed on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "siuCiwLVF-c5PjDgz5qysg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/siuCiwLVF-c5PjDgz5qysg/o.jpg"
      }
    ],
    "user_id": "Byog9k35hMURW_O1dIteHw"
  },
  "rbnDrJNSFqjp3BBjMaFC5Q": {
    "date": "7/11/2018",
    "text": "My favorite restaurant in the world. The best Thai food I've ever eaten - I always get the panang curry. The butterfly garden atmosphere, the rustic decorations inside and the flowers covering the outside mean that this is one of the happiest spots I've ever been to. Love it so much, this is the place I tell EVERYONE they must stop by when they visit LDN.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Z1Esb3b__pzy8ZWHYmnqQ"
  },
  "b7K4WVAwgikGBgyht80kyg": {
    "date": "4/7/2017",
    "text": "I love how unique this restaurant is! It's covered with an insane amount of plants inside and out. When we came the place was packed! Clearly a hit with the locals. The inside is dark and has a very distinct damp mildew smell (because of all the plants). Once you get over the smell it's really a unique atmosphere. For dinner we had the spring rolls and pad siew. Both were absolutely delicious! Good potions too!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1wjTmmuvYBwr1d-e2rfd5g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1wjTmmuvYBwr1d-e2rfd5g/o.jpg"
      },
      {
        "img_id": "dMv5yoG6zK4d7apVLLgZCw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pad siew - great",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dMv5yoG6zK4d7apVLLgZCw/o.jpg"
      },
      {
        "img_id": "kLay335wy4li8pM-QLCV6Q",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Spring rolls - great",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kLay335wy4li8pM-QLCV6Q/o.jpg"
      }
    ],
    "user_id": "k97c4eriYUeMG_cGw8rYLQ"
  },
  "icsVjdypWclGJSOG1FukzQ": {
    "date": "4/26/2014",
    "text": "A two-for-one deal - kitschy, famed pub with a Thai resto in the back! Besides being a spectacle of history, it's overwhelmingly pretty as well. The show-winning flowers that spill overtop of Kensington Church Street and the hanging tropical conservatory inside create a display to admire. And as if the atmosphere weren't enough, it's backed up by some great Thai food in the city. Offering decent flavors at an affordable price, it's a win-win all around.  (Note: Judging from the mixed reviews, you either love or hate this place, but it's worth finding out.)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-5wyZWy6BiO-u6nuFd10Q"
  },
  "RiWKztwnvQWn7IkjlSfDQw": {
    "date": "1/27/2009",
    "text": "Went here last night with my parents who are over in the UK to visit. We are staying in a hotel in Kensington so it was a quick walk from are hotel to this restaurant/pub. Kind of funny since its both a Thai restaurant and an English Pub but I really like it. They have tons of plants inside the restaurant part which I thought was really cute and made for a kind of rain-forest atmosphere. You can walk through the pub and sit in the back at a restaurant or you can sit in the pub and order from the bar. I rather liked the restaurant more because I got to sit there and have a proper catch up session with my parents. You order beers from the bar when you sit down in the resturant so you get the best of both worlds.We got the Pad Thai, the Duck Curry, and this really yummy rice dish  with pork and onions and bell peppers. All were really good at the bill for the food only came about £19  which was really good for all of us.The only reason they did get a 4 star was because There was a hair on the edge of one of the plates which is ughhhh.... not COOL. But I really like this place.... just not the hair....",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "RjVfqq84ud4Le14QdKKq_g"
  },
  "KWGcQmVezRef_By44Mgqtw": {
    "date": "7/14/2011",
    "text": "Best Pad thai I've had, ever.Surely, the idea of opening the wall between the pub and the thai restaurant was risky but turned out brilliantly.Also, the deco is really nice, with old kettles hanging from the ceiling.Nice atmosphere and service as well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWPw2mY-82hmNNJpp84R-A"
  },
  "1Bfal9fKUnp9ZA1x5ZuRMQ": {
    "date": "4/22/2012",
    "text": "After being one of the top rated restaurants near my hotel (Hilton on Bayswater), I decided to give it a shot and headed out into the spring showers. My first impressions were extremely positive. Arriving a little after 4pm on a Sunday, I expected the place to be empty. Boy was I wrong! I barely was able to get a table and the bar was two deep. Going in the back, there's a beautiful seating area filled with live plants.I ordered a glass of Merlot (okay) and spring rolls to start. The spring rolls were decent and plentiful (6 total). The service was good, as far as Thai restaurants go. Fairly quick, which wasn't surprising since there's an hour max on the tables (that's what she told me). However, right after I ordered that, I proceeded to wait for over 30 minutes for my pad thai. Which, unfortunately, was very mild when I asked for hot and spicy. Also, funny how a couple sat down next to me, ordered, and got their food in 15 minutes.OverallGood: atmosphere, the bar, wine selectionBad: very average food, unpredictable wait times",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F90-NRkWcQiCJNJAoFw6pQ"
  },
  "H79LsCuxDOl_I_UdiRvH8w": {
    "date": "7/17/2011",
    "text": "Wonderful location, and delicious food.  Can't be beat!  Picture this: stuffy pub with taxidermy and flea market bric-a-brac everywhere, couple of paces, and voila: a butterfly conservatory garden with potted flowers hanging everywhere.  Churchill Arms, a sly fox with a gem of a restaurant tucked within.  This review is for the Thai restaurant in the conservatory.1. Food:  Delicious, and hearty portions.  Had the pad thai and the pad see ew, both highly delicious.  A tad bit on the sweet side, but not complaining.  This and Busaba Eathai are my favorite Thai places.2. Service:  Pleasant and efficient.3. Atmosphere: Cute, charming, and quaint.  Would make for a cheap date place or a meal with the girls / family.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FywH1DoTKMwXMRz1DPwPw"
  },
  "22LuiwH56jA5MBLqGBZCcw": {
    "date": "7/18/2013",
    "text": "Amazing decor. Food is alright, but this place has an awesome atmosphere. It looks like a kleptomaniac decorated the pub with all their collections and then decided to spice things up by serving traditional Thai food. I'd definitely come back!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWCM4Gb9M_ot2ipq-uZgYQ"
  },
  "lmrllPqRWtqpYSvINW_19A": {
    "date": "4/19/2013",
    "text": "Great quiet little boozer with nice bitters, easy vibe, and plenty of classic old kitsch to set the mood.  Spent a couple of good hours here with a good old friend shooting the proverbial shizzy.  Great place to do so.  Plus, I didn't eat but the place smelled like there was some fantastic food cooking up.  Wish I'd have eaten here instead of the crappy fish n chip joint I went to.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZLpWx1QjpfDhwqQaW3g4KA"
  },
  "orlCluyQMCq8uj-eaWjGaw": {
    "date": "6/15/2011",
    "text": "I really wanted to love this Pub/ Restaurant. It is a traditional pub with OK beer, so so food (I went to the loo more than considered regular for days after...mmmm)  and OK staff.It has a separate restaurant that serves Thai food. Good for separation of eaters and drinkers. The portions are decent. None of that itsy bitsy poncey food rubbish.I love the fire place and the roof clutter. The Churchill memorabilia is pretty educational too :-)I particularly had the following niggles:1. Maybe it is because I was there with my friends on a Saturday but should that be an excuse for rubbish service. Really? Really? Waiting staff rudeness is just so arghhhhh.2. I know, flowers are great, lovely and all that but there is such a thing as too much. On my way to the loo, I had to traverse a veritable jungle with water features (the works!) and nearly slipped on a few wet petals lying around the stone floor.Not good for your mood if you are a stone-cold sober pregnant women in a pub sipping on cranberry juice with a slice of lemon (yum!) when everyone around you is drinking special apple juice and beer.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cznAF9JRTp3tKu8r8XPnOw"
  },
  "cs4wHVZuJJj4YsX76UVGqQ": {
    "date": "4/24/2012",
    "text": "I was here, quite drunk, the thai food was nice.The noodle dishes were fine, but the curry plates were quite small, be warned.The pub was a pub, nice enough crowd.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K8GT_Lvm1GK53yDpJqE6JQ"
  },
  "EEPzD3XEqn1zU4vXHEQ5Eg": {
    "date": "5/10/2013",
    "text": "The Thai red curry was hot and tasty. Pad Thai was also great. Even more remarkable is the atmosphere. Bric-a-brac literally on every wall, ceiling and any other bare surface. Very memorable!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PxpDI3maaOVDrGZ7_dENJw"
  },
  "UpL_ztStI7HlC79RBi2IAg": {
    "date": "3/20/2014",
    "text": "Delicious Thai food tucked away under the guise of an English pub.Pad Siew was delicious and had cabbage, peppers, and peas, adding some nice vegetables.  My friends ordered the tiger curry and the #5 (beef stirfry) which was amazing!  Interesting space too, loaded with fresh flowers/plants. Almost felt like being outdoors.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V36_qfdVKnK5cE6qX3PT9A"
  },
  "g5R1SiJWYEocGlPCjKnsPA": {
    "date": "10/10/2010",
    "text": "Ok, this place is awesome.You walk in the front, looks like a traditional English pub.... (the ceiling decorated entirely with bed pans. Lots of cool WWII and other memorabilia to look at. BUT!You go through the pub to the back, and through this door SUDDENLY YOU ARE IN A MAGIC GARDEN OF THAI GARDEN EXPLOSION (or something like that). It is a secret hidden thai restaurant, and that is awesome on its own. And it really is like one big overgrown garden, in suck start contrast to the Pub facade and front bar.AND more importantly, the food was affordable (most if not all dishes under £7) and plentiful (my friend and I ordered a prawn crackers, panang-type curry (#20) and Pad See Ew, and we didn't finish it all (a rare occurrence for me). It was hot and good. I'm happy, I just wish it was closer to where I live.The one weird thing was that they wouldn't take our £20 note because it was one of the older ones the banks are phasing out. We had other cash, but we thought that was ridiculous. Money is money and it was really stupid they wouldn't take it.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "DUor5CbUdp8hFWTittxKkQ": {
    "date": "10/17/2010",
    "text": "Winston would be proud.There is much to like about the Churchill Arms:  The warm, cozy atmosphere.  The kind and friendly wait staff.  The spectacular choices of ales, lagers and ciders.  And tucked in the back is some of the finest thai food you'll find outside Bangkok.  All the noodle dishes pack a punch on the spice meter and the rice dishes are worth trying too.  Each time I dine here I order a plate of their perfectly cooked spring rolls.   I strongly recommend the Churchill Arms for a casual dining and drinking experience.Pros: beer selection, authentic thai food served by thai peopleCons: need a booking during peak hours.  Otherwise, prepare to wait.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Pqv2jFpLg8rIDvsd0-v_Q"
  },
  "6NinUs8g-up__MzfT_pW-Q": {
    "date": "11/17/2008",
    "text": "One day in 3 it rains in Britain. I walked with an umbrella (which in fact I always carry with me) down Kensington Church Street to a pub.  In summer the pub is buried beneath an abundance of flowers and has won an award 'Boozer In Bloom' at Chelsea Flower Show! Finally arriving at the destination I was soaked in rain and couldn't wait to order a red wine.I entered a pub, which could not been more English. It was cluttered up with memorials and you wont be disappointed, there is also a picture of Winston Churchill accompanied by a selection of other gentlemen such as of American Presidents, British Premiers and a good number of British Royals. A varied group of clientele queued up at the bar to order a pint or two or three. At the Churchill Arms you order the drinks from the bar while as you order the food from the Thai restaurant, which is placed at the back of the restaurant- Apparently, it is a converted garage. There you find yourself in middle of a tropical garden, flowers have been planted and butterfly images hang on the wall.Be aware not to be given a table unless your whole group of friends have arrived. Due to its popularity the tables take turn every hour. The Thai restaurant reasonably priced food, I believe, is its major attraction. Pad Thai with prawns is my recommendation to start a night out.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WzJ8ZJaiHoUfrufdfL_qbA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WzJ8ZJaiHoUfrufdfL_qbA/o.jpg"
      },
      {
        "img_id": "Zuwoq9rt5kbO48B59QJiRw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zuwoq9rt5kbO48B59QJiRw/o.jpg"
      },
      {
        "img_id": "WUDowHGcFFbzmePWiWKgoQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. The impressive flower vegetation of Churchill Arms",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WUDowHGcFFbzmePWiWKgoQ/o.jpg"
      }
    ],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "ni41V9T3YpwuoNSzZ_VBVw": {
    "date": "2/20/2011",
    "text": "Amazing Thai food!  Warning, though, when it has three butterflies on the hotness indicator, that means it is seriously hot!  The green chicken curry is my fav, with two butterflies on the hotness scale.  The red curry with either beef, chicken, or prawns is very nice as well, but not as spicy hot as the green.  In addition to the Thai food, the Sunday roast is terrific as well.  A humongous plate of food.  My husband got the roast beef and I got the roast lamb.  Tender slices of meat with gravy, roast potatoes, carrots, green peas, and cabbage.  We lived in London for 2 years (05-07)and ate here at least three times a week.  Gerry the owner is a great barkeeper, the staff are well trained, and at the Thai restaurant you could not ask for nicer staff.After being gone for 5 or so years, we just returned for a holiday with our friends and it felt wonderful to be not only recognized but hugged by the Thai staff members and some of the regular patrons.  This place is a \"crown jewel\" with trinket prices in a posh part of town.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FjEtJPZ2UpooKiuUyH2WOA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. A charming night at the bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FjEtJPZ2UpooKiuUyH2WOA/o.jpg"
      }
    ],
    "user_id": "z02ZFPGJYIWfG1sMJE_grQ"
  },
  "BQotdAFfCO8NIVkiuqHf-g": {
    "date": "2/11/2011",
    "text": "I lived in this part of London for years and have been to the Churchill Arms quite a few times. It has an eccentric (read 'precious') feel, with things dangling from the walls. The clientele is older, particularly during the day, and it can be challenging to find a section of the pub where there is not a strong draft from the weather outside...However, the atmosphere is strangely charming, and the beer choices wonderful. The Thai restaurant in the back does better take-away (in my opinion) - you'll avoid the painful wait... portions are American-sized and tasty.Churchill Arms does this neighborhood proud",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hGWaykWcZS6Cey2krK67vg"
  },
  "Glrf-lO3n2gy-jzuXglpag": {
    "date": "4/2/2014",
    "text": "If I was more swayed by atmosphere and decor, I'd give this a five.  A busy pub setting, with low ceilings, an odd array of decorations, and enough plants to feel like a greenhouse.  But the food was just not there for me.  Maybe I set the bar high for Thai, as I've enjoyed some good ones, but it was all just a little bit cloying.  I'm probably being a touch harsh.  It was decent, and I wouldn't say never, but definitely not worth a 4.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "28PphqJdrLZZnFIl-li2JA"
  },
  "F3ueRPFeGPiU4ALOn4Zktw": {
    "date": "8/31/2012",
    "text": "Surprisingly good Thai food served in an authentic British pub with fair prices.  The servers try hard but communication can be difficult especially given the fairly high decibel noise level",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1zWo40J2G6lDMLlsBL01g"
  },
  "FLPszSGDKKAykGKqHJKchQ": {
    "date": "2/24/2014",
    "text": "So I come here on my first day in london expecting a good Thai Meal based on the reviews.....contrary to my belief, the food was horrible. Then I ordered Pad Thai noodles and the smell that came frim the plate was atrocious. ....when asked if I could replace my order, I was told I still had to pay for the dish I didnt eat. Unbelievable.  I will never return, nor did I order another dish. Horrible customer service.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nt6yD_5UGFZK6iYa1C252w"
  },
  "MhzRHengSNE1Cvny7RzZSw": {
    "date": "12/3/2008",
    "text": "Y'know Little Shop of Horrors?  Well, this pub is nothing like it, except for the plants/ the plants/ the running theme of plants.  Lots of plants everywhere - woo hoo.  Imagine the exterior all covered in little potted Christmas trees - Weyhey!  Fun, come in and what do we find?More theme, Churchill (yeah, he was good wannhe?), real ales (nice, not to expensive, nice), atmosphere on tap (make mine hushed and tranquil, so not great on a Friday night) and Thai restaurant out back.  You gotta have 'em these days.  I didn't eat there, though interestingly, I do like Thai food...I just stopped in to sup an ale, that was it, and for that, it want all bad.  But really, I found these themes, a bit hard to swallow.  Thanks Churchill, I suppose it's 'cause of him we're able to be so damn ironic... in some way shape or form...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LZOfh7V3O4RlF-IVzQm_Eg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. exterior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LZOfh7V3O4RlF-IVzQm_Eg/o.jpg"
      }
    ],
    "user_id": "9p_cITa30ZvlxBltHWrpCQ"
  },
  "R1rJFjQZIjNSM5uYIXxIAQ": {
    "date": "10/22/2015",
    "text": "Went in for a quick drink before lunch and was immediately overwhelmed by the stench inside. Is it the carpet? Or is it the 'decorations' hanging from the ceiling? I have no idea, but you'll adapt and get used to it in 10 anyway. Tacky decor throughout affected the experience further. Had a London Pride and it tasted quite alright, kinda like a light beer. My taste buds felt satisfied but my other senses did not.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "TL0vWOgt4sFtgjOVe-xH7Q"
  },
  "6F4pfYKfBvbRWfyK3007Lg": {
    "date": "1/30/2014",
    "text": "This isn't any ordinary pub as it's been drawing foodies craving a Thai fix from all over town. The pub area alone is quite nice with a fully stocked bar, a wide range of beers and ales on tap and bottle, and plenty of seating around including a fairly large outdoor terrace when the weather is favourable. But the Thai food is really what draws the crowds because, quite simply, the staff and kitchen look like they've been taken straight from Thailand. These guys and gals are no-nonsense and all about the food. It does feel a bit like you've stepped into the streets of Bangkok as they quickly usher you to a table, push you for an order, and then within minutes your food has arrived. Add that to the slightly hot and humid setting with the smell of fresh flowers in the air and you can close your eyes and escape the City for a little while.The Pad Thai was delicious with supple noodles in the classic lime and peanut sauce bursting with fresh clean flavours. It had the taste of a dish made to order rather than en masse and spooned out as needed. I'd easily rate it as one of the best Pad Thai's in London if not in my experience to date. On the spicy dishes, each was well executed with tender meats, crunchy veggies, and a boatload of chilli flavour (despite there being relatively few chillies in the dish). Even the most leather tongued veteran at our table had to admit the heat was there in spades and more than a few of us broke out in hiccups. Yet it wasn't all fire with a solid depth of flavours shining through so that the heat enhanced rather than overwhelmed the food.With main dishes being around £7-9 and each one a pretty hefty portion, it's brilliant value. Hell, a meal here costs less than the average cocktail at the bars/clubs just down the street.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "gq_u5hYRjVA2NweNfVfv0A": {
    "date": "11/24/2015",
    "text": "I came for the beer,  stayed for the food, and left cos of the service. As advertised, quirky Thai restaurant in an old Fuller's pub. You get the usual range of Fuller's beer on cask - ordered a London Pride and ESB without even referring to the bar. The food is more than decent - possibly as authentic as you can get in London. Flavours are very, very close to authentic, although a touch sweeter and possibly a little less spicy than what you get in Thailand (I've not really had a lot of very spicy food in Thailand - that said I have quite a high tolerance for spice, higher than some Thais even). I had the green curry, missus had basil pork. Meat was a bit overcooked, and I missed having Thai fig in my curry. Still, convincing enough for me. The service though, is quite appalling. I've been to Thailand, and they don't call it the land of a thousand smiles for nothing. Nary a smile from the Thai wait staff from the moment I entered, til I left. Was brusquely informed that we had one hour to eat. Thankfully we knew what we wanted, and ordered quickly. Being relatively hungry and spice-resistsnt, we polished off our meals in short order, and settled down to make the best of our measly hour. Throughout my meal, the staff were gesticulating at us and plotting table arrangements, ostensibly conducting an academic exercise on how to accomodate more imaginary guests. At the 45th minute, we were served our bill without word. And at the 60th minute, we were perfunctorily requested to move to the bar area if we wished to continue drinking - I still had half a pint of ESB. This was despite the house being less than half full in my estimation. Look, I've been to Thailand. I know that the Thai people are capable of embarrassing levels of hospitality and politeness. I've experienced it many times. This was really a very poor reflection of the establishment, and of the Thai people. The beer is good, the food is great but the service is just a mess. I'm not coming back here again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IzwsiilxLRG_jg3wKIUxpg"
  },
  "UpEylItfdsWa9KOKBzgyFA": {
    "date": "10/6/2015",
    "text": "Came in for a quick dinner and pint before meeting some friends in Notting Hill. Overall, they serve pretty good but highly westernized Thai food in a cool pub setting. Other reviewers have already given a good overview of the atmosphere, so I'll skip right to the food. My husband and I shared three dishes: pad gra pao with beef, pad kee mao (often translated as drunken noodles, but not here) with prawns, and jungle curry with beef. We requested our dishes - especially the gra pao, Thai spicy. The server insisted, \"It's already Thai spicy.\" I asked if the kitchen could make it spicier than they usually did, and he insisted again, \"Already very, very spicy! We do not change the taste at all from the way they do it in Thailand.\"OK. It is what it is. I crossed my fingers. I am an unabashed chile head. When I eat most Thai food, I want to sweat and sneeze, I want to wish for cucumbers and vanilla ice cream to make it all cool down, I want to burn baby burn. But most Londoners don't want that, so I was skeptical of the server's claims. The dishes arrived, and I was crestfallen to find that they barely had any heat. To be fair, all three got the non-fiery flavor components basically correct: the curry especially had beautiful complex layers of flavor. My one complaint about the gra pao was they majorly skimped on the basil - that's one of the things that annoys me the most about Thai food in the U.S. and Europe - they often skimp on herbs. We asked the server for more chilies for our dishes. At first, he was reluctant, but finally brought us some. Finally, satisfaction! And the dishes paired well with the Fullers real ale they had on cask.When we went to pay, the server told us, \"Next time, tell us you've been here before, and we will give you properly spicy food. We've had issues in the past with customers requesting Thai spicy, and then sending back the dishes because they were too spicy.\" Lovely. Typical culinary bravado. I've seen it with meat too - people requesting steaks \"blue\" and then expecting them cooked to a level I'd consider medium rare or even medium. People, it is OK to want mild Thai food or a medium rare steak (though if you go more than that, you're dead to me - the cow has already been killed - no need to add the insult of mediumness or well-doneness to the injury of slaughter). It is fine not to want to cry from the capsaicin burns while eating curry, people! However, if you don't want that, do not request Thai spicy! And if you do order it that way, and it's too spicy, tough. Suffer through it. Because if you whine or send it back, you are ruining things for the rest of us. Restaurants are refusing to give us our heat because of chickenhawks like you. So man up or shut up. Rant over. In sum, this place definitely worth a stop if you are in the neighborhood. Not worth a trek all the way across London, but definitely worth it if nearby. Can't beat the prices - can have dinner for under a £10 without alcohol. They keep you moving, too - we were in and out in under an hour, which was good as we were running late to meet our friends. But until they know you, they will withhold the good stuff, or at least the hot stuff!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bKtVaquILDCO9U9rM29m0w"
  },
  "gBbWYiVbT2HDA_6FP857yg": {
    "date": "9/12/2015",
    "text": "I've been here before for a catch up with friends and loved the food, so I decided to come back with my family when we were in the area. There were 5 of us, we were seated on a 4 person table, and ordered 5 drinks, 2 main courses and 2 sides. We were going for dinner later on so didn't want to be too full! We were seated by the most bad tempered woman who got really annoyed and told us that we hadn't ordered enough food so she needed us to vacate our seats. \"So you're kicking us out?!\" \"Yes. I have to kick you out\". We left! We left within 10 minutes, still hungry. Such terrible customer service, won't be bringing anyone back here again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "j5P9GUtcotLBsvQqyFeM9w"
  },
  "mwHPoqH1jcXWNErEbA0Etw": {
    "date": "9/6/2014",
    "text": "The ambience and decor of this restaurant is very unique and elegant.  The pub is always a popular hangout.  The food here is decent and above average with highlights being the Spring rolls, pad Thai, and green curry.  Prices very reasonable for London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zcxyPOzSKC3bw3pZfI9sUw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Pad Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zcxyPOzSKC3bw3pZfI9sUw/o.jpg"
      },
      {
        "img_id": "wfguURBOBKvQULaYvYM0zg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Green curry!!!! One of their most popular dishes if you can handle very spicy...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wfguURBOBKvQULaYvYM0zg/o.jpg"
      },
      {
        "img_id": "zz83hPoNCqnEK9p5s0J-6A",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Spring rolls (but note that they are \"egg rolls\" to Americans)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zz83hPoNCqnEK9p5s0J-6A/o.jpg"
      }
    ],
    "user_id": "dbQZumYFn7K7FMSVlQR1vg"
  },
  "46SuAUS-dTQRh4KY3Qcjuw": {
    "date": "10/1/2015",
    "text": "Crappy Thai food, very standard beer selection, outstanding florals, excellent brick-a-brac.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "l4dUwssAcZM2EefyLWP8uw": {
    "date": "5/21/2014",
    "text": "This pub gets crowded quite quickly, and for good reason: beer and Thai food. What more could you want?OK, there isn't a huge beer selection, so don't come expecting a wide variety. You'll most likely be choosing from the usual Fuller's choices. Still, it has to be better than Greene King!As far as the food goes, you probably know not to expect your general pub grub since it serves Thai. It's not very upscale food, to be honest, but it's pretty good value for money (and quick!). So if you're ever fancying a quick, budget Thai, this is a great choice.You'll probably want to make reservations for food, or go extremely early and try to eat fast so they can fit in those who have made reservations. I have had the Pad Thai and the Pad Kee Mau. The former has pretty good flavour for the cost, and the latter nearly brought me to tears. That's a great thing when you're looking for spicy food!The other thing I like about this place is the atmosphere and the interior. It's kinda crazy with all the hanging plants and the collection of figurines spread out all over the pub. But it's entertaining and not at all boring to look around in.So do try The Churchill Arms out, not for high-end pub grub, but for a casual outing that just needs good, comfort Thai food and pints of beer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4yclQAOoXgrozfwP7Y5NkQ"
  },
  "vI5n-c0lc3rBQrtWMyYBlA": {
    "date": "12/31/2013",
    "text": "The Churchill Arms scores highly for its distinctive foliage-strewn appearance and interior, good value Thai food but less for its mixed quality service and comparatively bland Fullers beer.Indeed, in many respects I feel the same as Steve B about the Churchill Arms. I love the zany appearance of this pub, which apparently has earned it many a title from the London in Bloom competition. I also salute it continuing inside, with a veritable hanging garden of Babylon suspended above diners' heads in the incorporated Thai restaurant. And the food is certainly good value at £7.50 plus rice etc.However, the 1 hour maximum table policy grates, as does - as with Steve B's experience - the pointed slamming down of the bill while we were still half-way through our mains. Plus the Fullers beer, though dependable, is slightly behind the craft beer times that we live in when it comes to quality.Still, definitely worth visiting for its highly unusual appearance alone.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "aPMN6S19oobhGFzrL6OJ-Q": {
    "date": "4/2/2014",
    "text": "I didn't like one bit. Disgusting food (not even close to Thai food in any possible way) and really slow service. It was really crowed. It's of course a beautiful place, but that's not what matters when it comes to restaurants.Never coming back",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "41TKQA-Ojmmuqvx_pKvZsg"
  },
  "a_iCsGdv1RXbHTnqWrR0Og": {
    "date": "4/24/2014",
    "text": "Wow, I can't believe such a difference between my experience at the Churchill Arms and those who gave it 4 or 5 stars!We were recently visiting London, and while walking around the Kensington Palace area we saw the Churchill Arms.  We were immediately enamored of the wonderful exterior and decided we must go in.  Plus we were thirsty anyways from all the walking around.  This was mid-week, in the mid-afternoon.So, as we walk in the door, the very first thing that hit us was the odor.  Not good, a mixture of old musty damp smell combined with the aroma of urine.  Half our party of four was about to turn around and walk right out, but the other thirstier half said \"come on, just one beer\".  The place was not crowded, there were about 12 or so people scattered around the front area.  So we sit at a table, and notice it's filthy.  Ask the girl behind the bar to clean the table, and after a bit of a glare she did wipe it off.  We get our beers and sit down.   And notice the whole place is not very clean....the carpet, the chamber pots hanging from the ceiling in need of a good dusting, etc.   And the smell, it just didn't go away.We skipped trying the food, gulped our beers, and left.  Never ever to return again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QlP2c-xDGvAYgPq6pkJAkw"
  },
  "yr9pzBvCzI1o4SIpYUHAuA": {
    "date": "3/3/2014",
    "text": "I came upon this restaurant by sheer luck and fortune, and boy am I glad I can add this place to my box of memories!As a hobbyist being a Thai food critic, it must have been fate that my gang and I stepped into the Arms. Outside, the building is anything but unassuming. It is layered with natural greenery, and sticks out from the other buildings like nothing you have ever seen in the heart of London. But, it is hardly what one would expect to see as a Thai restaurant, since the facade is entirely modeled like a pub. And upon entering, the pub scene is only intensified. The lighting is so low, that it makes following the hostess to the table a chore in itself, but that only adds to the charm. As you walk through the seating areas, you will be visually bombarded with so many decorations that hang both from the walls and ceilings; do not be surprised if a plant vine, or old fishing net gets tangled in your hair as you proceed. Once seated, I remember our waiter being very patient and attentive, despite the tightly packed and busy evening he was encumbered with. When our dishes arrived, we all gladly devoured our plates within a few minutes. Stopping only to sip and talk over our drinks. After a 12+ hour day exploring London with my backpacker pals, this was just the place we needed to stop. The piping hot, delicious food and added environment made this restaurant a perfect end to a perfect day. The only issue I had (which is entirely subjective), is that I ordered my dish Hot, and it ended up being quite mild, so I asked for extra chilli and hot sauce, which the waiter promptly brought out. I would highly recommend this place to any of my acquaintances.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUndzCRoTbp2mvPHjapVJg"
  },
  "RAndybS9GKFUU7gdrrFPlg": {
    "date": "7/29/2015",
    "text": "We tried to eat at this restaurant the other evening and we were sent away from the dining area 30 minutes before the restaurant closed. The waitress said the table was reserved for someone else but we waited to see if the table was taken after the restaurant closed and it never had people arrive. We also watched another couple be seated by a restaurant employee only to see the same women turn them away. I have a feeling that they chose to tell us that so the kitchen could close on time. I am ok with that, but the waitress who told us was extremely rude and I had to ask her to quiet her voice.     The exterior is beautiful and the ambiance is an incredible location for dinner. Book a reservation to help avoid this issue.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MH2lGIyi-Z_MTvQO_4suCQ"
  },
  "xoKtIA145o7g466M6QF61A": {
    "date": "8/14/2013",
    "text": "The Churchill Arms...... how do I describe this interesting eclectic place.Well there are three aspects to this place.1-The outside setup of the hanging flowers on the walls outside.2-The pub3-The Thai restaurantI think the flowers outside are beautiful and eye catching, I think that how everyone end up inside that place when they're passing by.The Pub is a cool pub with an eclectic collection of things just hanging from the ceiling or where ever they can fit or hang! You can have the Thai food on the pub area tables if you go to the food area order and pay, they'll find you after that.The Thai food area was very interesting and another masterpiece of plants and flowers. As for the Thai food its self I really dont know what everyone is raving about. Maybe i jsut ordered a bad dish, Pad thai and to be honest it didn't taste like anything and the Noodles were mushy.The experience and the service earned them my 3 stars",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "qqrUNRg1nfm6-HMaYNKsdw"
  },
  "CzLMrF5Y_0AEC4mSIOvPRQ": {
    "date": "12/20/2016",
    "text": "I love this place! The unusual combination of a classic pub and a Thai restaurant appears to be one of those happy accidents that works for some inexplicable reason. Maybe it's the bric-a-brac from British history hung on the walls and suspended from the ceilings. Maybe it's because the Thai food is some of the best that we've ever had. Whatever the reason, it is a great spot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y60zCUWvbFlEX-w9qnOviA"
  },
  "QVrw0M8mV4goXapabWUAEg": {
    "date": "2/24/2015",
    "text": "Amazing place. Beautiful flowers that really contribute to setting the ambiance. The whole decor is very quirky I would say. The Thai food is very good.Overall, I'd say this is a great spot to go to if you're in London. Good for going with a group of friends.Highly Recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pU_NU1dWMy5bUSampgmamA"
  },
  "isQIlPMIwjRaOBLHhjQLdQ": {
    "date": "12/1/2013",
    "text": "Authentic. Authentic. Authentic. Weird in a authentic British pub huh? That's what I thought when my co worker suggested I go there while in London, as I am insane about Thai. The place is in a killer quaint area in west London, and has all the typical features of a traditional British pub, including the guinness flowing. You make your way through a dim lit bar/lounge area and head to the back. There is a gracious sweet Thai lady there to seat you.They have this super small intimate area in the back where they serve up delicious authentic Thai dishes, at a very fair price. Lanterns and ferns hanging across the entire ceiling make you feel like you are in a wonderland.My wife and I always share pad Thai and a curry of some sort, so here was no different. She got the pad Thai and I ordered the red curry with roasted duck, yes, roasted duck. It was amazing.If you are in London, this is an absolute MUST dining destination.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-i4LIqFs_iQ0BKRZmDfUAg"
  },
  "PlkSjJ1YfqrBv9Ee3f4MFw": {
    "date": "7/26/2011",
    "text": "OMG!  This place is magical.  The Thai restaurant in the rear is lovely and I'd dine there again in a second.  We just strolled in, told of the 1 hour seating limit, and then watched as the tables quickly filled up around us.  We quickly realised we were very lucky to have gotten a table.  The food was good and cheap.  We ordered drinks at the bar in the pub (not sure how much) but for an appetiser and two mains it was less than £20.  The location was great and the appearance is adorable.  There were so many people just taking pictures of the exterior.  Great staff, great food, great place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8J0L-c14x5Fr7gslVdizrA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8J0L-c14x5Fr7gslVdizrA/o.jpg"
      }
    ],
    "user_id": "sM44zE2jzh3Ohju6soac2w"
  },
  "VSO5ujHFpAnGtn0AcjjmhA": {
    "date": "9/28/2015",
    "text": "Decent beer and cider with a fun ambiance! We had the cashew chicken and pad see u with beef which were both very tasty. Service was lacking but not horrible.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oq1dUgofkn7TedjWbNEj8A"
  },
  "XZjD4JRCUawzaw-U3JKkKQ": {
    "date": "10/24/2013",
    "text": "Walking down Kensington Church Street with a growling tummy is no fun, until you spot the ever so magnificent Churchill Arms. This pub is definitely a sight. I've never seen so many flowers on a building in my life. They are everywhere; I mean how do they even water all of them.A few happy snaps later, and we are seated inside this pot plant, where the decor is just as flowery as it is outside. It feels like you are sitting in a greenhouse. There are flowers and pots and all type of living plants everywhere. And for such a style pub, you are served Thai food. Amazing Thai food at that!The service was fast and friendly, and the meals were a great size for the price. The atmosphere is incredible, and really makes this place a fun restaurant to meet with friends.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b8GKq58rrMvGrX_XyGVi9A"
  },
  "Q4Z786l_gdRXMcQC5B1DKQ": {
    "date": "4/7/2015",
    "text": "I've only ever come here on Friday & Saturday nights craving great a pint or two andThai food, and it delivers.The pub is always busy on the evenings on weekend, and quite small. The Thai restaurant attached serves a good range of simple Thai food at great prices. Lots of weird kitchy memorabilia on the walls, and a full range of beers & drinks available. Very hard place to resist if you happen to be walking up or down Kensington church st.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gVTQ5Wq7_klOXwBrdwrekQ"
  },
  "Jy4RyFkcCUpt3-6x6W_80Q": {
    "date": "6/2/2015",
    "text": "This place is amazing!! Thanks to yelp my wife and I stumbled in while wondering around notting hill. The Thai food wasn't the best in the world but the ambiance in the garden setting was unreal! We also had some proper English pints and had good service. Overall it was a great stop and I would recommend it to anyone!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5DVDixxrGpgBoPKpgwVyhg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Some pints and Thai food!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5DVDixxrGpgBoPKpgwVyhg/o.jpg"
      }
    ],
    "user_id": "8uAlatbShTkFXIJQY4ZmKA"
  },
  "25xw69DtmIUFtzbsblufeg": {
    "date": "2/1/2014",
    "text": "Here's a great cozy (read:small / tight spaces) restaurant with a thai restaurant. You need to make a booking to eat inside the restaurant. Or you can finagle your way to a table in the bar, and place an order with the restaurant host who will deliver the food to your table.Restaurant: Not too large but they push the tables to get the people in and it seats maybe more than the bar itself. Standard thai menu. Food is a 4/5. I will say, one of our dishes was labeled spicy and it was hot as heck. I can handle spice but this was so hot, each bite burned my mouth and I couldn't take more than 4 bites. My dining companion managed to eat more of it but was sweating the entire meal.We ordered a bottle of wine and around the one hour mark, was brought our check and told we had to finish up. Listen, in America we understand not taking a table for multiple hours but if we have half a bottle of wine left that we purchased at your establishment and we were never told our booking was strictly one hour, that's just rude. We pushed off the 'you must go' for 15 minutes, drank what I could stomach (on a burned mouth) and left some vino at the table.As for the bar, always pretty packed. Low tables and stools. Must order at the bar. Great that one can get thai food while enjoying some brews.I know my review probably sounds more like a 2 star, but really, i do like this place. Just be ready for some spicy food and potentially not nice service in the restaurant. The food and joint is good enough to stand up to it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIDrWjy2WNxSUNbkmg5Kfg"
  },
  "Hbvfs563nZK_DiIouCYALw": {
    "date": "7/10/2013",
    "text": "Guinness Extra Cold FTW!It has a stunning exterior.  Otherwise it is just another pub in a very lovelly part of London.  I will definitely go back and send friends to check it out.  The flowers are amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "77WQrCN48Zgds0t3NryGvw",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. What an amazing pub.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/77WQrCN48Zgds0t3NryGvw/o.jpg"
      }
    ],
    "user_id": "ZUsS5CjWh4YrPVi4Hi3Y6Q"
  },
  "epcPnD19K_CfFTczflvuPg": {
    "date": "5/14/2015",
    "text": "Love this pub. Great setting with trinkets and books and pictures and newspaper articles all over the place (genuinely all over the place, there's random stuff galore hanging from every inch of the ceiling). We just had a couple of drinks but a friend got some food. This pub has a Thai restaurant running out of it, the food looked fab and if you want to sit in a more restaurant style setting then there's a gorgeous conservatory space out the back full of plants and flowers and tables for meals.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UjfrHXO8RFcMYhEsk_PG7g"
  },
  "kOI0Kf14R32EmRIGtzl6_Q": {
    "date": "9/15/2013",
    "text": "This is a Thai pub/restaurant.My hubby had heard of it, and we'd decided to walk more than two miles to get to it. We are still happy with this decision.There is a one-hour limit to dinner service, so don't order too much food. We got a curry and another dish, and both were the perfect size for sharing.I believe that the curry is probably the best we've ever had. It was so fresh and clean and filled with amazing Thai flavors. Both the dishes were winners, and we're planning a return trip before our departure home.The two dishes we ordered were a level one and level two in heat. We will go with level three and four when we go back. The heat level was alright, yet we love our food really hot, so are more than happy to amp it up a notch or two.If you're seeking genuine, clean, Thai food, then The Churchill Arms is your place. I find it difficult to believe that you'd be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "mkCrGZHQAFGDiCDzp7pu1w"
  },
  "00RsrEcAVkEADS_WCP4H1Q": {
    "date": "10/23/2016",
    "text": "Absolutely loved the visual here! We stopped in because of the history, and just for drinks! The place was mobbed, standing room only and a game was on. You could tell this is a local place to hang out. So glad it was recommended to us. Service at the bar was quite friendly, and speedy considering how busy they were. We walked into the back restaurant to see the foliage and flowers! Really cute and unusual place. Loved it. Would return!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-gPSSMlouKGhWp0BVK2Lzg"
  },
  "aVH-E_bbjf4rtMnm2bRJvw": {
    "date": "3/29/2015",
    "text": "This was my favorite place for food and drinks while on vacation in the UK. I love beer and Thai food and this place has both under one roof! My husband and I spent time at the bar as well as in the dining area.The bartenders and servers are friendly and attentive. There's a good selection of beers on tap and you can even try samples before ordering. The food was great. When we ordered the Pad Kee Mao, we were warned about the spice level, but we love spicy food so we gave it a try. They weren't messing around - it was quite spicy but delicious!I would definitely come back next time I'm in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U2-Nh0uzxIIEJlp89Nfhiw"
  },
  "ewZfyuOL9N2D6pvMzEidqw": {
    "date": "7/21/2015",
    "text": "This was such a nice change of pace from traditional pub food. My boyfriend and I came across The Churchill Arms while searching for a spot to grab lunch in London. Both of our dishes were delicious - he had the Pad Tai with chicken, and I had the Pad Siew with beef. Note: the pub side does not serve food, you need to be asked to be seated in the restaurant.Even if you aren't hungry, it's worth popping in for a pint just to see the unique decor.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxOQcgBgp1p4lkjDQosiJQ"
  },
  "OKv9EUV91XpDEyGYRZW7xw": {
    "date": "5/1/2013",
    "text": "My partner and I went to Churchill Arms on a recent trip to London, and overall, I found that it was a very quaint pub mixed with a pretty good Thai restaurant.We sought out and went to Churchill Arms explicitly because this is one of my partner's favorite pubs in London. You walk in and it's just like any other pub, but very homey. It was packed in the drinking area, and it seemed like the place that always was packed. That's understandable, considering its location right by the Kensington Gardens.You walk through the actual pub area, and it's almost like you're transported to a different world with palm trees and patio furniture. Originally, didn't know what to expect because when you think of a traditional British pub, a Thai food place run by Thai people doesn't exactly come to mind. We both ordered some food so that I could try it out, and I was impressed with the offerings (though I don't remember the actual dishes). I had something they labeled as very spicy, but I don't feel it was a spicy as they said it would be. The waiter recommended a good Czech beer that went along with food, and I was glad to find a random European beer that went along with the Asian food.Ultimately, I had a really good time at Churchill Arms. I could look at the contrast between a traditional pub and a Thai restaurant as a plus or negative, but I just enjoyed it for what it was. I didn't to get to sit in the pub area in front (and the Thai food isn't allowed in that area), but that also looked like a fun spot.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s19c8t_yAmFrby90LjDk8g"
  },
  "IRW-vtISdjDUXpy9gX6VYA": {
    "date": "3/15/2015",
    "text": "V. Charming and quaint. Non-Londoners and tourists - this is a \"must visit\". This is as good as it gets for a pub.The Thai food used to be good but quality has gone downhill.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hd4NVW-FOxvfSC7Yv4iYXg"
  },
  "ihlRwiFqwzpjQd_0eifjLg": {
    "date": "7/27/2016",
    "text": "There is a cheer that students do at American basketball games. The cheer is called, \"overrated.\"  It is used when a winning team plays poorly or when their performance seems to be inflated as compared to what is really happening. The Churchill Arms is a beautiful pub/ restaurant with ample flowers out front and great beer. However, the Thai food brings the rating down. Clearly, this restaurant is overrated.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kI4y4wSR32sFT3p0Pkzfnw"
  },
  "szVilv71akv-nBQvgcMF-g": {
    "date": "7/4/2013",
    "text": "The only reason for the 2 stars is because the service is HORRIBLE. I read the reviews prior to visiting the restaurant and expected bad service, but I was not expecting outright rudeness and apathy. The only reason why I bothered to visit this restaurant is b/c I love Thai food. It was as good as the reviews say. Very good flavor, portions are plenty, price is right...but is it worth a 2nd visit and endure rude and ill mannered attitude to customers? No. It was delicious food and amazing while it lasted. Unfortunately, I'd rather spend my money elsewhere where the bad attitudes don't make me feel uncomfortable throughout my entire meal and experience. It's too bad, because also the ambiance is beautiful with potted plants hanging from the ceiling.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0bDMQtp1wj6cRxjK0QmEhg",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Shrimp Pad Thai. Delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0bDMQtp1wj6cRxjK0QmEhg/o.jpg"
      },
      {
        "img_id": "KOtZmcmfVbgkI4uuLrOUqQ",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Red Curry. This has 3 spicy rating. I had thought it was London standard spicy=mild. But it is HOT!Caution on the extra hot dish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KOtZmcmfVbgkI4uuLrOUqQ/o.jpg"
      },
      {
        "img_id": "6oMWqC5VSxpbOUcOT9gneA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6oMWqC5VSxpbOUcOT9gneA/o.jpg"
      }
    ],
    "user_id": "u4qzfPNQtRErtLf5K5UIXA"
  },
  "ezZGFlK3FwXADU8qGeuMVw": {
    "date": "2/1/2015",
    "text": "I am biased, been coming here for 15 years. Great, great pub. A Sunday afternoon / evening favourite. Nice log fire, great ambience with the Churchill memorabilia and the Thai restaurant out the back is a firm favourite. Simple food, not gourmet, but large portions and £8.50 a dish is a winner. Book in advance always, make sure you sit in the indoor garden out the back. Just a lovely laid back vibe in the heart of London. Alan Titmarsh was hear two months ago to see the indoor garden so that must be a thumbs up from him as well !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P0Z8fDDgog2MkT-JWPUo2g",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. The dining room",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P0Z8fDDgog2MkT-JWPUo2g/o.jpg"
      }
    ],
    "user_id": "q_ae2p8uyMDSm9zKqN6Btg"
  },
  "U9oK6dOsiMeS04KhgfhtqA": {
    "date": "11/15/2014",
    "text": "Cue Natalie Imbruglia: NOTHING'S RIGHT, I'M TORN!So: top marks for kitsch and environment.  I have always admired The Churchill Arms from the outside - flowers galore!  Prime Kensington Church Street corner location! - but had never ventured in.  Tonight...we went!  The pub has a lot of weird stuff (I know, I know, that's a general term, but still: applicable) hanging from the ceiling, and through to the back is a Thai restaurant.  Thai you say?  Yes!  Even better, though: an amazing display of hanging plants, flower pots and lit candles all around the dining room.  It's like a magical conservatory with SE Asian flair!Marks knocked because: the Thai food was fine (hot fried vegetarian spring rolls were crispy, the veggie 'sweet and sour' stir fry was a little \"gloopy\" but totally fine, and my favourite part of the pad thai were the plump prawns that were part of the \"mixed\" option including shellfish, chicken and pork).  BUT, that said: the service was extremely rushed.  We felt forced into our choices, forced to finish, and then were told (though this was never indicated when we sat down) that we had to \"finish up\" because they \"needed the table\".  My *major* pet peeve was in the case of the bill / tip, though: because there were two of us paying (both cash) and we only had big bills, we put in over 50% of the final bill.  The server took our money tray away and...never returned.  When we caught him (long wait), he said he assumed that was our gratuity.  An assumed 50% tip?  Especially given the totally rushed nature of the meal and how we felt like we were being moved along at every course...that bold assumption just rubbed us both the wrong way, and I ended up feeling like a schmuck asking for some of the change back.  Meh meh.  Yelp note: come for the beer and the flowers, maybe pass on the full meal?  Just a thought.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CkqmyV3UWUd70oM3F-PahQ"
  },
  "8oPYufpZlXpTquoQV5RWWw": {
    "date": "7/25/2016",
    "text": "Great Thai food and wonderful ambiance. Get there early, put your name in and have a couple brews at the bar. There is so much history at this place , you'll find yourself talking for hours! Great location",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYLYnZHsZ3zXodzqTpFo_g"
  },
  "flT1-kpf8x4B8q-48XU67g": {
    "date": "3/15/2017",
    "text": "Such a great looking place from outside. Haven't seen anything like it ever before. In terms of food it was okay. Nothing too crazy, but value for money was good. The bar is what makes this place very, very good. Service is great, prices are great, and atmosphere is great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFF9f0h-TjvRUEZ7r5ToPw"
  },
  "zICn7twCUIee6kRz6fxpYg": {
    "date": "6/19/2016",
    "text": "Really cool concept. The Penang curry was delicious. Pad Thai was okay---would order something different next time (and all other dishes around us looked great as well). Generous portions. We watched the euros here and had a good experience--- plenty of screens. Good service. Would come back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "281pGZx7SfGNr9d21663iA"
  },
  "YvXxr9noAupJEHoEEx6zgQ": {
    "date": "6/9/2016",
    "text": "Very impressive pub, both exterior and interior. And their Guinness is always fresh.Overly crowded and boozy most of the times, which is part of experience.Enjoyable local crowd and quite many tourists at all time.And they have a lovely Thai restaurant in the extension on the right hand side, which is both cheap and tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4YB6UNxH-SJNEt1nSjE-Q"
  },
  "2BCyT18cc77BhshByVvuSA": {
    "date": "3/21/2013",
    "text": "A waitress came and interrupted our conversation with her presence, pointed twice to her \"not there watch\" and left without saying a word. I was a bit shocked, to be honest, I have never seen anything like this before. Apparently you are only allowed to have the table for one hour and we were taking a bit longer... shame on us! Enjoying our diner!Apart from that, the food is great and (most of) the waitresses are nice. The decoration is great: pub and thai part! I did not know it was really common to have Asiatic restaurants in the pubs and I loved the idea.I must confess I am thinking in the panang curry I had and I would love to be there right now!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gamMxe69bDQOPhX0Ya5wMA",
        "caption": "Photo of The Churchill Arms - London, United Kingdom. Spring rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gamMxe69bDQOPhX0Ya5wMA/o.jpg"
      }
    ],
    "user_id": "W6vd4JIEHeB2aqqmD0Eryw"
  }
}