{
  "ht7ci4ZEcV1dy8NeXgMxmQ": {
    "date": "1/8/2011",
    "text": "Poalina cafe is a brilliant Thai restaurant if you are looking for a sincere, friendly, relaxed and down-to-earth place to have delicious Thai food. The best pork dumpling I've ever had anywhere and I'm Thai! The lady owner is very friendly and sincerely lovely and generous. Her husband had passed away a week ago, unfortunately. The decor aren't great, which is a shame as she could attract more customers otherwise. But the quality of food compensated for that once you are inside and eating! Since I moved out of London, I came here for a meal every time I come to London.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "H8bBNV0yHwFEOO-tc9y8tw": {
    "date": "11/19/2008",
    "text": "Dirt cheap and dingy Thai cafe. Handy for a quick bite before Scala gigs. Decent pad thai but some of the other noodle dishes are glutinous and to be avoided. No alcohol licence. Three stars just for the prices.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "C7q9MpEfM-1FohEATB6KOw": {
    "date": "1/19/2015",
    "text": "First time coming here and it was so good! Didn't wait long and the pad Thai was so good! The hot and sour soup is also good, considering going back for dinner as well!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F0r4PNie08z-M4HABIj7XQ"
  },
  "8Gh-cIGYRB4evBt72bVALg": {
    "date": "9/13/2014",
    "text": "Cheap and cheerful.  Probably not the highest-quality ingredients, but one guy in a tiny kitchen making good Thai food to order.  Casual and cheerful and low-key.  There is nothing not to like if you want some home cooking.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "l2qbqxB08IqNu5zp2-uhAw": {
    "date": "10/3/2012",
    "text": "A friend who has lived in London for ages brought us out for one of our first restaurant meals after moving here from Toronto. We were not disappointed! The food was delicious and inexpensive. Plus, we saved money bringing out own beer with no corking fee! I got the prawn pad thai and hubs got chicken pad thai. Both were great.My only complaint (which, really, I could have voiced at the time but didn't) was that my pad thai (1 of 3 we ordered) was much smaller than the orders given to my dining partners. Not sure if that's just because I'm a small woman or if it was an accident. (When I used to live in Guatemala, my portion sizes when I ate out would frequently be \"sized to fit\" my tiny frame. Unfortunately for me, I eat a lot more than one would expect for my wee-ness!) Luckily, my fiancé had already eaten before we went out so I was able to finish his equally yummy dish.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvbPRZ6ruEjm38_QMivaBg"
  },
  "4j_RvOgRmCd8LhzHb3EmuQ": {
    "date": "1/22/2016",
    "text": "Amazing find. Very authentic food. Loved the fact that it is family owned and not a chain. Prices were reasonable and service was fairly quick. Only complaint was that the place was a tad loud and quite cold.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0lgSJ4-i8MHAwEiKTlJ-Ng"
  },
  "GZ-jNuWHlyRewS7JWZNiEg": {
    "date": "8/10/2014",
    "text": "Maybe I'm used to the thai food here in the states, but I was pretty disappointed with the Pad Kee Mao, Drunken noodles, the noodles were bland and flavorless.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O6X5CjOE5Xj6osM33IPmiw"
  },
  "JC8wrYDJW43JV21NXW4f9g": {
    "date": "11/9/2013",
    "text": "Not necessarily the cheap spot it once was, but truly fresh and flavorful Thai food made in a seriously tiny open kitchen right at the entrance. You can see that they know what they're doing and not skimping/shortcutting on any of the layers of flavor that makes Thai so wonderful. Main dishes of curry range between £6 and £9 depending on your meat, but this adds up as the portions are not huge, and don't include rice which is £3+ Regardless, the food is yumminess, so that's the price you have to pay!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TNNRmOheG5PFV7qXop151A"
  },
  "z0a1fJS8HMXQMK_oa9BUgg": {
    "date": "10/18/2014",
    "text": "I'm from the US and I got takeout from here tonight...best red curry I've had here!! And the lemongrass soup was to die for! Delicious flavor. Love how cozy it is inside as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xmCptszui1LNAuLT-9YYjA"
  },
  "WNsptuWIOZ_H6ZLgniEsBA": {
    "date": "9/22/2014",
    "text": "On my own in London for work and very happy to have found this gem of a place. Had been curry with rice, awesome",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cnc4d_1V4FGHTqJHZkAsVw"
  },
  "_cIc10g8VvVae5KdcVpKeQ": {
    "date": "7/31/2010",
    "text": "Don't be fooled by the dodgy exterior, this place does a banging Chicken Pad Thai! It's very cheap but the food is really good quality and the little old couple who run it are super friendly. If you are in the area, this is the only Thai place to go.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "jJLlynUVMZtlbrhoHyRx8w",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jJLlynUVMZtlbrhoHyRx8w/o.jpg"
      }
    ],
    "user_id": null
  },
  "rqLOepR2CPfkBp3msCgP_Q": {
    "date": "8/16/2009",
    "text": "if this is the paolina's i think it is, it's really close to dinwiddy house on pentonville road and pretty much the BEST thai food i've ever had.  pad see ew, gyoza and chicken satay. AMAZING. humongous portions, and their food was so so good. i went to SOAS for my third year of undergraduate and lived at dinwiddy house. we used to frequent paolina's and sit in their downstairs room w/ the tables that were too close together at least once a week. ok so here's the thing -- the food was good but the ambience wasn't even close by a longshot. and service was always so slow. however, they were SUPER friendly and it was really close to our school. so we returned frequently.  paolina's is the type of place you go to all the time with your best friends because it's close to your heart. because it's got comfort food. because they always make you feel welcome and smile big and you leave full and happy.  you don't really notice the stained linens or cramped bathroom (which you sortof have to climb your way into) or the fact that your table is pretty much touching the table next to it. you sortof just gloss over all these things. because paolina's is the type of place you can make your own \"spot\".  and who doesn't love having a restaurant to call their own spot.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JE2pyEew6XtQxZojRNmbKA"
  },
  "C3H7Pa0ES056rE0adgW9oQ": {
    "date": "5/3/2012",
    "text": "Very cheap & cheerful. You wouldn't expect it to look at but a little gem in Kings Cross. The food was great & really reasonable: 2 starters, 2 mains, rice & soft drinks was £26 (not including tip). Will definitely go back! Oh, & it's BYOB.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7o2QmDANaVr01R7Natmv8Q"
  },
  "YyvgHZFYG99FxRMr7LT_Sw": {
    "date": "3/4/2010",
    "text": "When I first entered this establishment (I can't call it a restaurant) I thought I might find some old sex-workers sitting in the corner, eating thai food before their shift on the streets of Kings Cross. It's charming, in a slightly run down and uncared for sort of way, but don't worry cos it's clean and safe (no food poisioning just yet). Average Thai food if you can look past the exterior, interior and strange set up. Not for dates. Not somewhere I'd go out of my way for. But it's alright if your stuck for anything else to eat. Recommend the Pad thai...it's pretty decent.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "R5HDviOWhPqjVGnCz0XKnA": {
    "date": "11/27/2011",
    "text": "Paolina's only competition, in the 'scruffy, endearing, delicious and cheap' league, is Tippy's in Barking, where one of my dearest friends and I used to scoff Pad Thai while pretending to be anywhere but East Ham.Yes, Paolina's is scruffy. Its pine-paneled dining room is bizarrely reminiscent of an ersatz Swiss chalet, or a themed room in a Bangkok love hotel. Yes, really. But it's in a pokey corner of Kings Cross, and kinda fits in.As other reviewers have noted, the food is as authentic as you'd find in any restaurant (or on any street corner) in all of Thailand, the staff are charming and helpful (Pad Thai Jai  egg or no?  without having to ask), and it's very, very cheap.I'd disagree with lizwhitney  it's for those dates you want to impress with your local knowledge, or you'd want to make out with in a love hotel, and those you'd go absolutely anywhere with.Go there and fall in love  with either the food, the faux Swiss chalet, or with someone you're with.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dvKZkLEY1SZ1L81Otfaq_w": {
    "date": "10/21/2010",
    "text": "alrighty, my coworker recommended this place as a cheap eat.  it was cheap and down n' dirty family run establishment.  it's no nonsense thai cooking.  no pad see ew here.  the menu is largely under £5 and the portions are hefty.  i ate it all, but it was missing a kick.  it ain't no king of thai (sf), but for london standards it's good value for money.directions for first comers:1.) order you dish.2.) take a seat in the back.3.) pay when your finished.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnpIbinfzqdoETYZ9XqQ3g"
  },
  "T7tQPvQQDxEeHNYN1WRFeQ": {
    "date": "5/23/2009",
    "text": "This small family run Thai restaurant is among the better places if you have to eat in the King's Cross area. It doesn't look very impressive from the outside (I wonder why they don't fix the exterior), but the inside dining hall is fairly clean and comfortable. The choice of traditional Thai food is quiet considerable and the quality is generally fine. It's certainly not high end, but probably fair given the prices. Most main course meals cost around £3 - 5.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6yH_2IK4lfB4Ep3TpKQelA": {
    "date": "1/22/2011",
    "text": "This place is great, it offers exceptionally good value for money and the food is always very good. You can take your own wine for a very reasonable handling fee. True, it looks scruffy on the outside but don't be put off by this, it is so nice to be able to have a delicious meal at a very tasty price.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CoFG04IVs9Ugmuf3xbe2vw"
  },
  "Q_OvXewwATIjUV5fAshMRw": {
    "date": "11/18/2007",
    "text": "This is a wonderful little spot just round the corner from the Kings Cross Thameslink station. Easily located by its bright yellow A-board, once you're up the steps, you're facing the chef. The family that run this place are really friendly and accomodating. The place is tiny; the downstairs section can probably fit 20 people at a maximum, and fills up v.quickly. However, it all makes for a cosy, convivial atmosphere. The menu gives you loads of options and overall the food is fantastic (if perhaps not as spicy as I have had elsewhere). The don't have an alcohol license, which means you can bring your own (corkage is 50p per person)! Brilliant!",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "EwvUe6F7Hsp2dz1DYdxgsw",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EwvUe6F7Hsp2dz1DYdxgsw/o.jpg"
      }
    ],
    "user_id": null
  },
  "QGpUUAYW9qg1-WlxRYP8uA": {
    "date": "2/4/2008",
    "text": "Paolina's Thai Cafe is my favourite in Kings Cross. The dilapidated exterior hides a gem of a place that is pretty much off the radar. If you don't know it, you wouldn't give it a second glance, but once you have been you will back for more. It is an extremely friendly, family run restaurant with the emphasis on no frills. That doesn't mean that the quality of the food is compromised - far from it. I have eaten there countless times and the food has always been magnificent - the green curry is hot and spicy, the starters fantastic, and it is very reasonably priced. Add to that the fact that you have to bring your wine/beer etc, it makes an excellent alternative to fast food when you are on a night out. Payment is cash only, although you can usually pay for dinner out of the change in your pocket!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uLpJNN0cMwE0liGVPcogFw": {
    "date": "1/9/2013",
    "text": "highly recommend! In fact, best tasting restaurant in this area that we've had all week! we know our Thai food because we lived in Bangkok for 2 years! Service is friendly,quick and portions are a good size. As everyone mentioned previously, the ingredients are fresh and the taste is authentic! For the 2 of us we ordered a thom yam soup, satay for starters' a vegetable dish, pork dish, and a pad thai plus 2 jasmine teas. came to 28GBP.Absolutely full and were thankful for the 10 min. walk back to the hotel to burn some of it off!!!!Great value meal with superb taste! we will definitely eat here again!!!:-)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0K8nj6D9FOYX3gghsvN7SA": {
    "date": "1/6/2009",
    "text": "Maybe not the best Thai restaurant in London but definitely the most endearing, Paolina's Thai Cafe is great lil local dive near King's Cross. This is a perfect spot for a homey lunch (londonist.com/2008/12/wh…) at a decent price. The staff couldn't be friendlier and the lady in the kitchen (Paolina?) is about the sweetest woman I've ever encountered in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "HyhSOpos1_MWCDg2aES0Og": {
    "date": "12/29/2017",
    "text": "This place was a little hidden gem near King's Cross Station that serves up great Thai food at reasonable prices. Be sure to bring your cash though!We stumbled upon this restaurant on Yelp when I was craving something more flavor able amidst the bland Western dishes. It was located very close to our AirBnB so we had to try it out! The food: we ordered Tom Yum soup, sweet and sour fish (forgot the Thai name for it), and pad see ew. They were all DELICIOUS! I was hungry and was so glad we had everything we ordered. The place and service: it's definitely a hole in the wall, mom and pop shop kinda place. But you know that means a cozy, casual atmosphere. Service was kinda slow to start because they just finished cleaning and getting ready for the dinner crowd, but it was good nonetheless. Overall, highly recommend this place for great tasting, flavorful Thai food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MD5qo5pO2PV6gFbmsqXtjw"
  },
  "jFvmwLbQkfFDrru8kDRR_Q": {
    "date": "11/15/2018",
    "text": "So tasty and at a great price. Portions could have been a bit larger, but I wasn't left hungry nor was is disappointed. It's BYOB, but we learned that too late. Would definitely visit this place again should I return to London!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gX0wwLyvoUDHO-J_x7GnHw"
  },
  "5f1yMHQNuCAsPit6ZWmvZA": {
    "date": "5/3/2018",
    "text": "This place has a warm and inviting feel to it. There is nothing fancy about it, but you can see your food being made by one woman up front, who I think might actually be Paolina, and you can tell she makes her food with love. Reasonably priced good food. I came here and picked up takeout but looks like a nice place to gather with friends over good food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zks9fZuLK8lE_752gb863A",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zks9fZuLK8lE_752gb863A/o.jpg"
      },
      {
        "img_id": "B0YgJyHvfiSVHtROabmLow",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. cute little place. there is seating in the back",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B0YgJyHvfiSVHtROabmLow/o.jpg"
      },
      {
        "img_id": "QbOwn-qJhKuMtHQ2zve2JA",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. Takeout pad thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QbOwn-qJhKuMtHQ2zve2JA/o.jpg"
      }
    ],
    "user_id": "OKLDnGoweVlBdKGutn4Exw"
  },
  "VvzEPZRDW0buJF17T-y6jw": {
    "date": "1/9/2018",
    "text": "Delicious, authentic Thai food. One of the best in London. Outstanding service. A favourite to eat-in or take away. Hidden gem!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_hBF999ZOT1YtlpazG-1Q"
  },
  "FimgbqCDZNHSH15Z3I7D2w": {
    "date": "4/4/2016",
    "text": "By far the cutest Thai restaurant I have ever been to in London. The restaurant itself was downstairs and incredibly small and cosy with its medium oak walls and tables.  Service was exquisite and staff were of all genders and ages like a family run restaurant. Upon entering I saw the elders preparing the rice and some carrying heavy loads of dirty dishes downstairs to wash. It was like I stepped out of Kings Cross for a little bit and into a Thai family's home.Deep fried tofu This came piping hot, freshly fried so still kept it's lovely silky melting texture inside which balanced well with the thin crispy exterior sides. The peanut sauce was lovely and thick to cling on to the tofu adding a lovely rounded nutty sweetness to it. Tom KhaA coconut based milk soup with galangal and kaffir lime leaves was very fragrant with warming notes of spice. It was filled generously with lovely fresh and plump prawns and mushrooms.Thai green curry chickenThis was a lovely addition of the classic dish. It was thick, creamy, complex flavours with all the traditional ingredients of aubergine, bamboo shoots, galangal and more. The chicken was a bit thinly cut but was still very tender. Portion was very small too but quality made up for it.Kang massaman beef This was one of the best varieties we've had being really thick, savoury, rich in flavour with complexity. Unlike some we've had before it wasn't overly sweetened. The carrots and potatoeswere both fork tender and the beef came chunky and soft too. Cashews provided a lovely sweet nutty finish as well as a contrast to the softer textures.Lard na This was also surprisingly good. I somewhat didn't expect fresh Ho fun in a place like this. It was cooked perfectly, slippery, full of bounce and in a lovely soy based gravy seasoned perfectly. It was better than more than half of the restaurants in Chinatown serving Ho fun. They were generous with the prawns and squid which were both tender and plump. Vegetables were fresh and sweet too.Coconut custard & Sweet Sticky rice This has become Ren's favourite dessert. The custard pudding was like an egg flan, subtle in sweetness with a layer of sliced pumpkins for a more diverse experience. The sticky rice had the most comforting texture being chewy and al dente. The slight saltiness to it against the custard was like maple syrup to bacon being the perfect match and balance whilst the condensed milk made everything creamier and sweetMango and sweet sticky rice This was delicious and without fault. The sticky rice was slightly salty drizzled over with condensed milk to add a layer of creaminess as well as sweetness. The mango was sweet and juicy provided the perfect contrast to balance not only the salt but the density of the dish too. Truly delicious.I love this little cafe so much. Blended amongst other buildings along King's Cross Road it almost feel like a hidden gem. There's no fanciness to it, just all the classic Thai dishes cooked homely, with passion and at reasonable prices. Can't wait to return.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GM6Dv3w-8TcU-XrTuKD5Iw",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. The staff upstairs preparing the food",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GM6Dv3w-8TcU-XrTuKD5Iw/o.jpg"
      },
      {
        "img_id": "uOa_7RtooFQUdSEQ6UDdWQ",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. Deep fried tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uOa_7RtooFQUdSEQ6UDdWQ/o.jpg"
      },
      {
        "img_id": "ytC3nUDLsNvO3cIyij2nHA",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. Lard Na",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ytC3nUDLsNvO3cIyij2nHA/o.jpg"
      }
    ],
    "user_id": "GhmA0xBVIxxlfOhnEiUyIQ"
  },
  "fUVNx7eVaP15VWa9I56_SQ": {
    "date": "5/12/2015",
    "text": "I'm slightly disappointed by Paolina's Thai Cafe. I got takeaway, and while the food itself wasn't bad, it certainly wasn't memorable. Also the portion size was shockingly small, so I came away still a bit hungry. Perhaps I would've gotten more if I had sat in instead of taking it away? However, the most egregious part of the meal was actually when it was being prepared. The kitchen lies exposed to the customers, and it makes for a pretty neat scene while you wait for your food. The one chef that was preparing my food seemed friendly and knowledgeable enough, and my food came out rather quickly. When he was packing my food, he started to make another customer's dish. AT THIS MOMENT, he decided to PICK HIS NOSE, wipe it on his apron, and continued cooking without sanitizing his fingers. I was disgusted and almost had a mind to throw away my food, out of fear that he might have done it earlier without me watching.That one moment has probably turned me off this place for good. Rather disturbing display of the sanitary conditions, or lack thereof, in this one-man kitchen.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MNC4xBMbc6gY4I9Ji96E_w"
  },
  "ffF8JjNcMSoA8JuOQZruBQ": {
    "date": "10/22/2016",
    "text": "So came back here with a larger group (7) the week after I wrote my glowing review. Sadly I feel as though I have to knock it down to three stars, especially if there are more than 4 of you and it's a Saturday. Our issue: we ordered starter platters for sharing and when the food came to our table the waitress said we've had to change some of the food as we've run out. This meant that 4 people in the group couldn't eat 80% of it. I completely understand that these things happen but it's not acceptable to tell people as you serve it. We would have been happy to order something else but by this point it was too late because we had already ordered mains. The mains came and again chicken had been swapped for beef in two cases, luckily this wasn't a dietary issue. At the end the staff had forgotten to include some items on the bill and then asked us for it after we paid. These things happen but I no longer feel as though it deserves 5/5. Will definitely be returning on a quieter evening with 1/2 other people.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1aVLmVvQdEoGBww_Sx6mpg"
  },
  "9sAvVMrL2WOrjjjvm4vFBA": {
    "date": "3/23/2016",
    "text": "Cute place with sweet staff especially our waitress who was patient and calm despite how busy it was. I feel bad for the grandma carrying a huge heavy tray of dishes down the stairs by herself, I really wanted to help her but it was back of house and she was smiling so figured she could handle it.The atmosphere kind of reminded me of Thailand somewhat only 30° colder.It's warm welcoming staff and casual seating made you feel at home.The food was a bit hit and miss, the masammam curry was homely and comforting. The Tom Ka also hit the spot and tasted better than an instant soup which is my usual Thai restaurant experience.Many other dishes were generic english 'thai' food that you don't really get in Thailand except for the tourist spots but saying that, the quality was pretty good, nothing was bad so far.The desserts really shone, I can't speak for the authenticity as I rarely ate dessert in Thailand. One in particular, the coconut custard and sweet sticky rice. This dish was one of the best desserts I've ever had. It wasn't exactly complex or fancy, just a simple creamy rice dish but made me feel like a 4 year old Thai kid being treated to home made desert after getting a gold star at school :(Don't come here expecting a gourmet experience, come here expecting to feel at home and welcome, the prices are not too bad but be careful as it can get pretty busy at peak times.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-0NtuosP41pGsA_EgbbIqQ"
  },
  "SkHdek2HGxD-Lry4qZxeVQ": {
    "date": "8/25/2013",
    "text": "Okay, why isn't there more review on this Thai place located off Kings cross? Oh- my- god. (with Friend's Janice's accent). Delicious thai food freshly cooked right next to you in the store. This place deserves more rave and praise! Don't get put off by the small store front, say hello to a few step down and a few bigger long tables! All their noodle dishes are well made with affordable pricing. Not the cheapest thai, but for what you get, and its portions, it's not a bad deal. Also once saw a group celebrating a birthday dinner here, so, there you go. It is big enough to cater more than 10+ people!Do try their thai ice tea! Yum!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oJUmIRaw0Lgo-KN_KbxzHg",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. kitchen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oJUmIRaw0Lgo-KN_KbxzHg/o.jpg"
      },
      {
        "img_id": "YHTyBvbdRBwQ9WJ__SZAPg",
        "caption": "Photo of Paolina's Thai Cafe - London, United Kingdom. Lard na",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YHTyBvbdRBwQ9WJ__SZAPg/o.jpg"
      }
    ],
    "user_id": "wUglOGOHWulhp8Wo9bb7Sw"
  },
  "8OToTtzcpL58TeU3RSTOVA": {
    "date": "8/17/2016",
    "text": "Best Thai food in London. I don't think you could get any better. Everything is homemade, fresh and well cooked. I've been going almost once a month and I'll never tire of the starter platter. It's BYOB aswell with £2 per person corkage which always helps! Don't miss out on this one!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWQbyOh9aFVnEp6KlxDy_w"
  },
  "UCeuzv0vmsqvgLVTwETqHQ": {
    "date": "2/18/2017",
    "text": "Perfect no frills Thai place of the kind you would find in Thailand itself. Couldn't have asked for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Afam-XK9j-TlFobZez7Jlg"
  },
  "20LGtTFPtJbXMQX4vBoGgg": {
    "date": "9/10/2016",
    "text": "I really like this place! There's a lot of Thai in London. There's a lot of posh thai in London. Then there's this place -- authentic humble thai restaurant. I was looking for a low key but delicious place near Kings Cross (there's SO many fancy restaurants out there, that are GOOD, but not for an every day budget) and found this place on Yelp. Didn't disappoint. It just *feels* thai. The food was delicious  and service didn't complain about our million substitutes. Friendly staff and I filled my hankering of thai ice tea that I've been having for a while!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qnrq6N5x10bToGqjIrtIPg"
  },
  "MiB4nMik_Xn9NlK-rNd3Ug": {
    "date": "8/1/2017",
    "text": "I read the other reviews and tried the place. It was fabulous. We had the Panang chicken with rice and steamed vegetables. Best I've had of either ever. Also loved their Thai iced tea. Placed was packed but we got a table and the service was excellent. If I ever get back to London, I will make an effort to eat here again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rixr2RFDiC5EfGdNuBYvSA"
  },
  "tnuiwg03v22vcEICAHDKpg": {
    "date": "8/10/2015",
    "text": "Definitely a hole-in-the-wall, but it was pretty packed on a Friday night, so we figured the locals must be on to something!  It's BYOB with a £1 corkage fee per person which is a great deal.  We sat outside (two small tables, the rest are inside and downstairs) and ordered Tom Poh Taek soup, Pad Cha Talay (seafood stir fry), Kang Pa (beef curry), and an egg fried rice.The soup was great - hot and sour, with tons of flavor, and very spicy!  Absolutely clears out your sinuses but is also delicious from the lemongrass and coconut.  If you usually get the same Thai soups, try this one.  The seafood stir fry was our favorite dish, while it didn't blow me away, it was very flavorful and actually reminded me a bit of Chinese food in terms of the flavor of the sauce.  The beef curry was our least favorite - not as spicy as advertised, and quite boring flavor-wise despite being advertised as hot and spicy.  Both curry and stir fry were very \"wet\" dishes, almost soupy, so hard to eat on your plate.  Better really for one person to eat them and you can just add the rice to the bowl, instead of spooning out small portions.  But we managed!Overall, I thought it was good Thai food, though I've undoubtedly had better.  If I lived in the neighborhood I'd get takeaway here, but frankly I don't see a reason to go out of your way.  I'm not sure what I'm missing, but I didn't really see what was so special about it.  It is pretty cheap, though the portions aren't huge - you won't have any leftovers.  Cash only!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "OpwhqZmpWZNJk_plZi2Qsg": {
    "date": "12/30/2016",
    "text": "Very, cute neighbourhood resto. Simple, fresh food served by sweet staff. Not fancy and tiny, but the price reflects that. Definitely worth it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqi5tu91oVzUlsEDnqUuzQ"
  },
  "pdwNMk8LcTPw4bJlBAgEWQ": {
    "date": "3/6/2015",
    "text": "Its a nice little family run Thai joint. Not a place you would generally come across but its cheap and relaxed. It ain't a chain so don't expect a fancy decor however, it great to grab a quick bite (something after work maybe). There is a inner and outer searing area, inner can cater for a group of 6 max. seated together, more can do but not ideal, although the place can hold about 30 people in total. They don't except reservations neither do they do delivery's (but yes do have takeaway).If you are unsure what to order - spicy, mild, sweet and sour), do ask as they provide personalised suggestions (which is great). All the meat/seafood dishes availabke can be made in Vegetarian.Last tip, get some cash before popping in to avoid rush for cash machine after a good meal (since they don't accept cards).",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v0nnKt2jagldEkaV2kr_6g"
  },
  "MwdcXrHJJi2PMoNlDiOM9w": {
    "date": "10/16/2013",
    "text": "I'm a big fan of this place. It looks dingy from the outside, but don't be afraid, walk on in!I absolutely adore Thai food. It's so hard to find a place in central London that is both affordable and serves high-quality food; luckily, this is one of them! I come here at least three times a week.The green curry with vegetables is excellent, and the pad thai with prawns is alright.I also appreciate that the restaurant has an open kitchen, which I'm always a fan of because I'm a real stickler for cleanliness and open kitchens make me feel that the restaurant has nothing to hide.Tip: this place is cash only.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDQjLgm0u8WwlkQU6oHmqw"
  },
  "BU6VLUjLzACet3BmEt9jZQ": {
    "date": "1/22/2016",
    "text": "We heard about this great thai cafe just around the corner from the office so five of us went down after work. It's a cosy little place tucked away from the bustle of kings cross. We got a nice table and ordered. I got the Chicken tom yam and Gai med mamuang with sticky rice. the food was good. Everone else liked theirs and so i think we may become regulars as the prices are really good for kings cross.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGeioYD7_GNZKlNqUFziuw"
  },
  "KFAZHKtTye2XiFvut-6LIw": {
    "date": "9/18/2014",
    "text": "Hole in the wall thai walking distance from kings cross station. Just visiting for a week to london but decided to come back here for a second pad seeyu beef and banana fritter with ice cream.As good as it gets for cheap eats in London from what i have seem this week. The only drawback is that things could move a bit faster in terms of service and food. Both times i was there an hour although i ate and wanted to pay quickly",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Jj7s1Np-3bGhBqyy7KAQg"
  },
  "aeXRPxQzATp6N5Q-cx_E3g": {
    "date": "6/22/2015",
    "text": "Food was delicious!  Great little whole in the wall.  Definitely recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_wU4JHzkgYTabH3XpSyMQ"
  }
}