{
  "EsC1c2MmdWMT2HxYNCYt-Q": {
    "date": "1/24/2012",
    "text": "Lovely bistro just off Upper Street with a real ambience. Great menu with good veggie and vegan selection and lovely selection of wines. Make sure you get a seat away from the back as the heat from the kitchen gets a bit much.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HcBjM_pcWJ27eVcb9R2LQg": {
    "date": "6/13/2011",
    "text": "Lovely friendly bistro which.serves a lovely grilled.goats.cheese salad. Unfussy, good value, excellent coffee. Could stay here all day, but must get back.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wE-W6femU-Gbbuv7Xcr7gw": {
    "date": "4/1/2012",
    "text": "Service and ambience was good but the food was excellent. I had the lamb en croute with the tart tartin for dessert and I can honestly say for me this is hands down the best food going in Angel. It's very rare to find something to this standard in such a commercial part of town and I'm just glad I live a stones throw away. Definitely recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "K_Pxjtpxr0LvQNXaFpdWgQ": {
    "date": "8/11/2013",
    "text": "I have been here several times and, as a restaurant has to be pretty special for me to return  that's high praise indeed. The food is reliably delicious  I have NEVER had a dish I didn't enjoy  and the ambience is relaxed, efficient, friendly and they don't rush you. They even have genuine French waiting staff! It used to be said that there were more restaurants on Upper Street than on any other street in London. Whether this is still the case after weathering the economic storms of recent years, I'm not sure, but I can say with certainty that Le Sacre Coeur serves the best French food in Islington. The only place that comes close is La Muse, a very small restaurant/cafe which is not far away, on Holloway Road. That is the place to go for a lovely breakfast/brunch with fantastic coffee and sit out back in the tiny garden reading the morning paper. I would have lunch there too, but for the big meal, I'd jump on the 43 and pop down to Le Sacre Coeur, where there is more space to sit and a much larger choice on the menu. Both places are unpretentious, authentically French, great value, fresh seasonal ingredients and I recommend both to you without reserve! As La Muse is so petite, personally I wouldn't go larger than a romantic dinner a deux if I ate there in the evening; but I suggest you won't be disappointed by either restaurant, although Le Sacre Coeur probably has the edge, if only to sample everything on their extensive menu. Also, it's great for any occasion; whether a family meal, a group of friends, a romantic meal, or a pre-performance meal before going to The Almeida or Sadlers Wells or one of the several pub theatres in the area. It's literally just off Upper Street, the last of three restaurants situated on the side-road where there's a zebra-crossing to guide you safely across, and is just before the famous King's Head pub and theatre, which is opposite St Mary's Church so it's easy to find. Consequently, you are the heart of the action but not in the middle of it, if you get my drift, unlike so many of the restaurants that put tables outside on Upper Street itself where the diners have to eat their meals while the whole of Islington traipses past them, including tourists, beggars, half-pissed workers, trendy bendys and the odd celeb on their way home. The restaurant, which is done out like a traditional old-style French bistro, has large open windows that open up right on to the pavement and you can sit at your table watching the nightlife go by on Upper Street and enjoy the buzz without suffering any of the less pleasant consequences.it's not impossible to find parking up that street, which is saying something for inner London, but be aware that it is inside the congestion zone. The reasonable menu prices offset the price of travelling into inner London and finding a place to park though it's near to the Angel tube station and not far from Highbury Corner. Le Sacre Coeur? TRES BON!! TRES YUMMY!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4V7Im9g-ebkuk6uz8lsv2A": {
    "date": "11/19/2008",
    "text": "Delicious food at Sacre Coeur, with a wine list boasting some amazing reds that I've not been able to find elsewhere. The food is always cooked to your liking and it's always busy (so need to book in advance!), which proves how popular it is, despite it being sightly off the main Upper Street, so wouldn't necessarily attract passing trade. The menu is extensive, but so is the specials board, so it's often hard to make up your mind. The food is reasonably priced and the staff usually friendly (apart from the time a friend asked for a Cappuccino and was sharply told that she was in a French restaurant and not an Italian - eek, but ha ha). I've eaten here at least 5 times and plan to return time and again. Wonderful.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5B5T_PNkT8kItOEA2eE3Hg": {
    "date": "4/2/2008",
    "text": "This is one of my favourite restaurants in London and can even sometimes persuade a south Londoner to head northwards. It has a real neighbour hood feel about the place and you never feel rushed which is a joy in this area. The food is strong on traditional French classics and they do fantastic mussels and steaks as well as some more modern dishes. The wine list is extensive and all reasonably priced. The owner is gregarious and you should be offended if he doesn't stop to have a chat. The staff are friendly and service is efficient. You don't need to book during the week and at weekends if its full they usually will tell you to go to the pub opposite and return in half an hour  definitely do this rather than be seated at the bar, the bar is tiny and you are very much in the way of the waiting staff. This is the sort of venue that is good for everyone there are couples of all ages, groups and families and all are catered for. If you are in this part of town I would definitely recommend that you should check it out.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JFPyvbOhu6M0wbD-ugf4Iw": {
    "date": "9/11/2009",
    "text": "fresh food ,very friendly staff",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "B2NhMnU94FMU6xOdtUElIg": {
    "date": "11/6/2013",
    "text": "Loved our meal here.We popped in for dinner having listed Sacre Coeur as one of the local restaurants on my 'to try' list and glad we did.We were welcomed in and shown to a table. It's a homely, cosy bistro style interior and small, intimate tables but perfect for two or a small group.The menu is straightforward French classics. There were several dishes that looked good and with the waitress reco I ordered the boeuf bourguinon. A generous portion with large meltingly tender chunks of beef, plenty of mushrooms and a great sauce. Just what I was hoping it would be. Served with mashed potatoes, it was a perfect comfort dish.My partner's choice of pan fried king prawns with vodka and chili was an equally good choice and perfectly cooked and flavoured.We shared a perfectly executed tarte tatin for desert with ice cream. A good sized portion as it should be and just right.Service was great, unobtrusive yet attentive and just the right timing. Value for money was also excellent.  Looking forward to going back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "8dEjsPkcpK0OXE83OHaC7Q": {
    "date": "11/23/2014",
    "text": "I went to Le Sacre Coeur last night for a friends birthday dinner. I was incredibly impressed by this hidden little gem of a restaurant! Everything was perfect - from the friendliness of the staff to the calamari, to even the cleanliness of the toilet! We went as a big group and so we had the 3 course set menu costing £21.50 each excluding drinks. It was fantastic value for money. I had the calamari for starters which were delicious, rib eye steak for mains which was pleasantly surprisingly good (excuse my rubbish English today - I'm still in bed!) and a crepe au chocolat for dessert. What I liked most was the cozy atmosphere. The lighting was perfect and it was just an overall very pleasant dining experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "i-0Yz644F4_cNLK3K-Z_tQ"
  },
  "jeP2IfIZys8KwhncNc1DSA": {
    "date": "1/22/2012",
    "text": "Le Sacre Coeur is the quintessential French restaurant, humble in character but high quality home style cooking, blue gingham table cloths to top it all off.Everything here is a staple French dish... The have an a la carte menu and specials list, both which rotate quite regularly with the likes of beouf bourguinon, coq au vin, french onion soup, steak frites, garlic-spinach, pork joints, escargots, baked fish etc making popular appearances. I have never eaten anything that wasn't superb and authentic and believe me I've frequented this place plusieurs de temps. Main dishes cost around £10 plus or minus a few quid, which is amazingly good value for money in London anyway, let alone for the quality of the experience you will have here.The house wine is always very decent and affordable. The staff are friendly, and although this little restaurant gets busy they never rush you out the door. Might be wise to book in advance...",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b4M9lkCHWg3FtS1uTMjxiQ"
  },
  "jmRuGI2qZt_NhdZ7zf-riQ": {
    "date": "1/20/2015",
    "text": "Excellent French comfort food.  Between us we had mussels, onion soup, coq au vin and a sea bass (might've been a special, can't remember), and everything was delicious.  Plus the atmosphere is great, the prices are very reasonable and the portions are huge (after getting the appetizers we had enough coq au vin and sea bass left over for dinner the next night too).  A+",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yKuGB87CJX4uBQ3dCKlalA"
  },
  "N7CEIDgCBSU3gzs3x9q5dg": {
    "date": "11/24/2013",
    "text": "Lovely French food, cosy and vibrant atmosphere. It has a good selection of vegetarian, fish and meat dishes. I had vegetarian, but the steaks on the neighbouring table made me jealous.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JmhjhNuPzgTaJPEY1M6AXA"
  },
  "PeKM91OqAS7SVdcWYEZ-yA": {
    "date": "1/30/2014",
    "text": "Fabulous French bistro. Does everything you would expect- including frogs legs and snails. Extensive menu. The steak I had was superb. Great atmosphere and packed with people even at 630pm. The tables were really close together and I felt crammed in -   that took the edge off a bit. Would definitely be a regular if I lived a bit closer!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ochg_GQr_xInSsN-qO9rlg"
  },
  "IsfVBjucnSF0lCRnVubVvw": {
    "date": "11/30/2012",
    "text": "Roast lamb here is my perfect Sunday lunch meal. I like the way the bistro looks. All different posters on walls make place colourful and fun. And if you go there with children you'll appreciate it even more. Restaurant is not big but atmosphere is cosy and relaxing. You need at least to check it out!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lapY_Ca7X7baHjs1QmRM3Q": {
    "date": "7/24/2014",
    "text": "Food was excellent and service was outstanding. We were a party of seven and ordered quite a few things from both their a la carte menu as well as the 3-course menu. Standout seafood, especially the mussels as a starter was probably the most popular. Steaks too, were cooked to perfection.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwyWC6CRdC-WVwVwiHN3bw"
  },
  "QfVNMrnSfFmeuRG_zMIeVA": {
    "date": "10/21/2012",
    "text": "One of the best restaurants in Islington and certainly on a par with any of the best restaurants in London without high end prices.Le Sacre-Coeur is always busy in the evening, mostly with locals who know their restaurants. The service is welcoming and efficient, the prices are good and the menu delicious. I usually opt for the specials as they are ever changing and know I can rely on the food being excellent.The atmosphere during busy periods creates the buzz of chitter chatter, while still being able to hear the person you are dining with. There's also a feeling of intimacy despite a full restaurant.By day it's quieter and has a relaxed atmosphere and a fixed price menu option. If you are going to see a play at the Almeida Theartre, Le Sacre-Coeur offer a discount off your meal. When on one occasion the waiter forgot to provide a discount, a rather out of breath manger caught us up outside the Almeida to provide the discount. Out standing service and top class cuisine.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZyYHlQhKsWGu8bjcGG_Y-w": {
    "date": "8/30/2015",
    "text": "If U love authentic french food at a reasonable price, this is where  to  get it at London, Islington. nearest tube station is Angel",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxtdvsXO80tP-TjQQX1xLg"
  },
  "R1w9tz4ia5_OJmzkvRMgyQ": {
    "date": "4/14/2012",
    "text": "Have been back again.  I'd rate this place a 3.5 stars.  It has now consistently not overwhelmed nor been anywhere near poor.  It does struggle to compete with other goodies in the area (Le Mercury, Ottolenghi, and Gallipoli).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMiEr8JQEVd6NuMfEnhQ3w"
  },
  "mP54SPlT-Cjt9kY4MC-wuQ": {
    "date": "10/15/2008",
    "text": "Located on Theberton Street, a hop, skip and a jump from Islington Green and the bustle of Upper Street's multitudinous crowds, a warm Friday night brought me to this lovely little French bistro boasting some of the best value food this side of N1. The waitress was charming and attentive, offering a well timed five minute prelude before our wine (a modest bottle of Pinot Grigio) was delivered. Perfectly dim lighting with tables (note the lovely rustic checkered tablecloths) were positioned fractionally too close together, however this did not prevent free flowing banter with excellent company. My buttery monkfish was served with crunchy, moist vegetables and a voluminous rocket and parmesan salad that 'minimal portion' eateries could certainly take a leaf out of! Previous culinary recommendations also include the hearty Toulouse sausages, although the coq au vin left a little to be desired and rabbit pushes my moral taste boundaries! A great choice for understated intimacy, well worth the extra five minute flutter from Angel station. Certainly sacred in my heartc'est vrai!",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "2zpo-4bPaCEeW2H6zVsDJA",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2zpo-4bPaCEeW2H6zVsDJA/o.jpg"
      }
    ],
    "user_id": null
  },
  "d07ggY4V8liv06aiH6AWcw": {
    "date": "6/16/2012",
    "text": "Unfortunately not very French at all... no French staff in sight though the staff are very nice and attentive and offered a lovely complimentary post-dinner drink, music featuring singers in other languages and very disappointing squishy air filled profiteroles.  They do a Sunday roast with Yorkshire puddings, I've never seen that in France. This place may have been good once but is now very confused and not worth a return visit from me for now until they sort out some proper French cooking.. The nice staff resulted in two stars up from my original score of one.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Avgk_XggqAYktoqAvPqkeg"
  },
  "SvNpPCLzNMajAMxtPc7w_A": {
    "date": "4/19/2010",
    "text": "Had a great meal at Sacre Coeur this weekend meeting a friend's new boyfriend for the first time. He happens to be French and the food here even impressed him (in fact he nearly took my friend's arm off when she attempted to abduct his chocolate crepe) The fish dishes here are delicious and I always have a massive dilemma whether to have one of them or the steak au poivre which is always great. The veggies are always really nicely cooked (always always have the spinach) Oh and as a starter the vodka prawns are garlicky and decadent and the onion soup is really classic. Yum.The staff are friendly and the atmosphere is always a nice balance between really buzzy and chilled out.They have really nice wines too.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vVA62esBr_t5ldLD5n9X3w": {
    "date": "1/16/2013",
    "text": "A lovely French restaurant.Since early childhood I've always hated snails no matter how they were prepared, but after my daughter convinced me to try them out at this place I totally changed my mind. They tasted simply delicious. I don't know what kind of seasoning they use or the exact way they prepare them, but if you ate one with your eyes closed you would have never ever guessed that you were eating snails.The service and decoration there are both amazing. The place is decorated in a typical French style- tables covered with checked table cloth and lovely flower pots. Upon arrival a very nice and friendly young man asked us if we preferred a table on the pavement as it was a very sunny day. He later helped us chose our dishes while explaining the one we were interested in and making suggestions.Overall I think this is a very nice place even though it can come as pricey for some people, but I thank this little French restaurant for making snails one of my all time favourite dishes.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fiJpkPkx_kMY2TTQjyjuhQ": {
    "date": "12/28/2012",
    "text": "Little cosy restaurant with nice atmosphere. The French cuisine is one of my favourites so I enjoyed a lot my lunch there. It's perfect for gatherings with the family as it's combination of casual and classy decor and they serve amazing dishes.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1Q1DgxVngI7gk7VGbwGoKA": {
    "date": "3/30/2012",
    "text": "Stumbled up on Sacre Coeur when strolling in Angel/Islington and decided to have a bite to eat. Service was freindly and attentive and there was a good selection of food. We chose the mussels and the Calemari as starters  both very good. For main there was Boeuf Bourguignon (Very good) and seafood platter with Porcini sauce (Daily special  a bit bland) Think I might have to go back and try the escargots and rib eye steak.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wY8dUZypJQ9zQBa11xmqSw": {
    "date": "2/22/2010",
    "text": "sacre coeur has definatly got a place in my heart as one of favorite places to eat!! My girlfriend and i have shared many lovley meals here, wether it be for lunch or dinner, the food it always top notch and the staff are very friendly and accomidating.The menu is excellent and they always have great specials on offer, they have opened my eyes to a lot of different foods. The kangaroo steak was amazing!!! loads of quality wines to wash your meal down with.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dqugOAQ7FctvqK4MLa6wKQ": {
    "date": "9/22/2010",
    "text": "Everything a French bistro should be -Fantastic traditional menu with equally fantastic food.Comfortable outdoor seating.Incredibly friendly staff (ok, so this is not so French, but appreciate nonetheless!)Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TXrsfiSpIDoH06SyVDLZsg"
  },
  "89n5Lsq4H1Y3wksTCSokOQ": {
    "date": "3/2/2013",
    "text": "Le Sacre Coeur is an absolutely fantastic French bistro. The food, the wine and the service are impeccable. I really enjoyed the meal I had here on Friday night immensely, my onion soup starter was delicious as was the hearty and delicious rabbit stew (perfect for a cold late winter night), all washed down with a very reasonably priced bottle of pommerol. My dessert of Tarte Tatin was also excellent and worth finding that extra bit of space for. The whole experience of this long established Islington eatery was overwhelmingly positive, service with a smile and a complimentary Armagnac topped off great evening. The only reason I haven't given Le Sacre Coeur 5* is the slightly over crowded dining area, maybe a few less tables would mean I wasn't quite so intimately acquainted with the entire conversation the people at the next table were having.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BBXkdqDYfK8RCWdNs8hX1A"
  },
  "T6WtlVRoAV1yfIQnycs95w": {
    "date": "8/16/2018",
    "text": "I've now been here twice and have really enjoyed it! It is an adorable French restaurant in a great location. Recently, I went with the prixe fixe menu with three courses. I started with the Camembert Frit (Camembert cheese coated in breadcrumbs, fried, and served with redcurrant and raspberry coulis). This was delicious! The cheese paired so well with the raspberry coulis and it was no greasy at all (perfectly fried). For my main course, I got the Steak d'Agneau au RomarinGrilled lamb steak with red wine & rosemary sauce (served with sautéed potatoes). This was delicious as well! The lamb steak was so tender and flavorful and the sauce went so well with it. The potatoes also went very well with the lamb. I have also had their Filets de Cabillaud Rôti(baked cod fillets with sun-dried tomato and cream sauce), served with leek and potato mash. This was excellent! The cod was so fresh and the sauce was to-die-for! I could have licked all of the sauce off of my plate (if it were socially acceptable haha). The sauce was so fresh and paired so well with the fish. The potato mash was also fantastic--perfect texture. For dessert, I had a rhubarb tart. This was delicious! I loved how the tart wasn't too sweet and I could really taste the rhubarb. The service was also excellent. The servers and managers were very attentive and considerate of my husband's allergies. They were super accommodating, which is the reason we came back again! The have a great price for their prixe fixe menu.I would definitely recommend this restaurant! In a nut shell, great service, excellent food, fair prices and great ambience!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WhAuxS55OCiMKBctBirVAg",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Rhubarb tart",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WhAuxS55OCiMKBctBirVAg/o.jpg"
      },
      {
        "img_id": "u9NiAURfwrAmze7qnMoCBg",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Steak dAgneau au Romarin (Grilled lamb steak with red wine & rosemary sauce, served with sauteed potatoes)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u9NiAURfwrAmze7qnMoCBg/o.jpg"
      },
      {
        "img_id": "bG2DpMuuOFpgZeVNOMCCLQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Camembert Frit (Camembert cheese coated in breadcrumbs and fried, served with redcurrant and raspberry coulis)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bG2DpMuuOFpgZeVNOMCCLQ/o.jpg"
      }
    ],
    "user_id": "qu01gRc5j4rZspUcT6Xqzw"
  },
  "qYFGGYULIX1Qgp7bz-TcIw": {
    "date": "11/1/2018",
    "text": "We found this lovely little family run French Bistro tucked away just behind Kings head Theatre in Angel. Difficult to find something decent to eat that late in London, but this place is ideal for theatre goers. They seated us quickly, and all the service was with a smile. They have a cut price dinner menu for 25 euros and even the alacarte is so reasonable. My hubby ordered the steak with pepper which was delicious, salad and a cheese plate. I had onions soup and the confit duck. We were not drinking but I had a virgin Mary, sparkling water and tea and coffee. In all we paid 60 quid for two. For that part of town, very decent food , it's a steal, and way cheaper than Paris and also better I dare say. The confit duck could have been moister but guess they were getting the steak ready so it sat out for too long, that's my only criticism, but on the whole definitely going back Great service!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zgVDAo-5Q0Y6n9ekOR5QRw"
  },
  "wbCg6OoRRPxuCzWOEwbMaw": {
    "date": "8/8/2016",
    "text": "Went with my partner for lunch, and I have to say that we had an amazing experience! The ambiance is SO cute, very French, and warm. We both had 3 courses which was priced extremely well at 10.95. We had the king prawn tempura and the warmed smoked bacon and chicken liver salad for our starters. The king prawn tempura was only alright with 4 medium sized shrimp (I wouldn't call them king prawns) and a side salad. The bacon/chicken liver salad was the winner as it was a large portion of yumminess. We had the moules frites and the croque madame for our main courses. The mussels were AMAZING and the broth was rich and creamy. The pot was MASSIVE and totally worth the price. The croque madame was decadent and delicious as well. We both got the lemon sorbet and raspberry coulis as our desserts. We were already SO full but enjoyed them nonetheless. Aside from the tiny king prawns (which wasn't a big issue), I can't say anything negative about this place. It's my most favorite French restaurant and would highly recommend it to everyone!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K2HH0DffShOTG5JdpPTtaQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. King prawn tempura...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K2HH0DffShOTG5JdpPTtaQ/o.jpg"
      },
      {
        "img_id": "FjA82LoWCheZFz2YZ3KuCQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Moules frites... what a HUGE bowl of mussels!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FjA82LoWCheZFz2YZ3KuCQ/o.jpg"
      },
      {
        "img_id": "mOhGvW655S0O7b_F75JNCw",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Warm smoked bacon and chicken liver salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mOhGvW655S0O7b_F75JNCw/o.jpg"
      }
    ],
    "user_id": "XxAgDaVlA5dvq5KgXKUT8Q"
  },
  "EJ0_9ISv9Z6SmzHy8YTvxQ": {
    "date": "6/9/2017",
    "text": "I enjoyed my time here. I went with my girlfriend. Love the atmosphere. Excellent waiting staff. Very attentive and not intrusive. I love this. The service was excellent. My boeuf was excellent. Her coq au vin was nice but she wasn't overly keen on the presence of a \"few bones which felt like shrapnel\"  My creme brûlée was a little cold after I broke through the crust which was a shame. Her chocolate mousse was excellent. Will I revisit this place? Yes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cznAF9JRTp3tKu8r8XPnOw"
  },
  "NQPmSRBjd3O-VUUV5-UoZg": {
    "date": "12/14/2014",
    "text": "Three of us went. Appetizers, cocktails, entrees, two desserts and service charge came to 75 pounds. Amazing. Back home it would  have been double that. My son had the rabbit. He has taken a liking to it since being in the UK. I still can't eat the Easter Bunny though. My wife had the salmon crepe. I had the Beef burgundy. They were all excellent. Dessert?  For me--the creme brûlée of course. My son had a crepe with ice cream and chocolate.Food was quite good. Servers were friendly. We used the yelp reservation service. It was a good thing we did   They were busy.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "opzBR3zmPZAkbWW30HDdYg",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Creme brulee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/opzBR3zmPZAkbWW30HDdYg/o.jpg"
      }
    ],
    "user_id": "q_59ARjoIUkyfzdtnE2ciw"
  },
  "A4-ay5505YeK4_UCEzVAvQ": {
    "date": "1/21/2017",
    "text": "We went to this charming French bistro before going to a show at Sadlers Wells - it was just the thing - lovely atmosphere and tasty menu.A word of warning, though - be cautious when ordering starters and main course! I had onion soup followed by mussels, which was perfect! My husband had breaded Camembert (which looks scrumptious) followed by beef Bourguignon (also delicious)... but the portions could easily have served two! Probably best to ask the waiting staff about portion size when ordering!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYyp0CMTWMjA1NKdyriQxQ"
  },
  "6BPJGHb0qLNFKfn7k9rJPg": {
    "date": "6/13/2017",
    "text": "Had a lovely dinner on a warm summer evening. I was able to get a table outside. The atmosphere is very charming and all the staff  very polite.  The service flowed very well from course to course and the food was delicious. I had a glass of rose, appetizer of bread olive oil, Brie, bread and olives with mustard, a special salad with artichoke, avocado and feta cheese, beef bourguignon and creme brûlée for dessert.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pmcJxy3z5dlYUHww2Um3QQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pmcJxy3z5dlYUHww2Um3QQ/o.jpg"
      },
      {
        "img_id": "NrmHXIYzFUTZgyuLuahTyQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NrmHXIYzFUTZgyuLuahTyQ/o.jpg"
      },
      {
        "img_id": "PRTGP7bbT8vH0oAA1lKNjw",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PRTGP7bbT8vH0oAA1lKNjw/o.jpg"
      }
    ],
    "user_id": "IAoUMtuRvwMkfosEyyor7g"
  },
  "HH7Fz1xvwNohy0p8bf_A0w": {
    "date": "6/3/2016",
    "text": "A few things that struck me by this place. First I couldn't get in as the door was stuck then I couldn't get it shut. If the doors not closed it will stay open.Ok so inside lovely decor, French music lovely ambiance. Get the menus. Some aspects tip ex over and hand written and in a polly pocket. I had to smooth it out and even then couldn't read it properly. I decided to go with the set menu.I had onion soup. Steak and fries. Creme brûlée to finish. Food was ok nothing special to be honest. The creme brûlée had to be the highlight. Cost £22.50 for set menu - 10% service charge. Now that is the fun part. I like to pay gratuity where it is earned. During my meal not once did anyone check how I was with my meal. If I required anything. Nothing. I had to ask for the bill by getting staff attention. Seen as though I went alone no one made the effort to talk to me either which in other places staff have. In this vicinity for French food I preferred Le Mercury.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uEZzbRaHl-zhRYdxlmXZIg",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Creme brulee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uEZzbRaHl-zhRYdxlmXZIg/o.jpg"
      },
      {
        "img_id": "_EqCTwS1tKJak2cnunhksg",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Steak and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_EqCTwS1tKJak2cnunhksg/o.jpg"
      },
      {
        "img_id": "gzQnprGinLe9LJMc6c-c7g",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Onion soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gzQnprGinLe9LJMc6c-c7g/o.jpg"
      }
    ],
    "user_id": "Ntw9EXjF8TAZNtqBbDp4aw"
  },
  "uCiKHbyaa-DZNJ4fnOOgrg": {
    "date": "6/2/2015",
    "text": "Omg. The mussels are so good here! Must must must get. Fries are pretty tasty to. This is now my go to restaurant for guests in town. I think they have one high chair in the restaurant which we happen to get each time I've been. It was pretty awesome with their service. We got a candle for my daughters bday from them&",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ESO4nYBiGf_rF2TtWtzwYQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ESO4nYBiGf_rF2TtWtzwYQ/o.jpg"
      }
    ],
    "user_id": "q2Mv09kRLrMQATwHcjapxQ"
  },
  "0E03xAn8X07SQ-CGeSmwhw": {
    "date": "3/6/2015",
    "text": "Been here twice for their lunch time offer. Really good service. Staff are very pleasant. Even towards idiots like me who can't figure out how to open the door Ordered the Camembert and the minute steak. Both came out in really good time. Huge portion of Camembert. And the steak with the peppercorn sauce was actually flipping gorgeous. And if you watch the Ricky Gervais comedy, Derek, this is where Derek has his date in the first series",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U5KuNgkyCtjuHM168z8g9w",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. NOM",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U5KuNgkyCtjuHM168z8g9w/o.jpg"
      },
      {
        "img_id": "7t8dkgUUXAU2cOmFm_9kwg",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Huge saucy Camembert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7t8dkgUUXAU2cOmFm_9kwg/o.jpg"
      },
      {
        "img_id": "qW-oOvl744MY32FR9Ae6AQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qW-oOvl744MY32FR9Ae6AQ/o.jpg"
      }
    ],
    "user_id": "6ysU6q9uBHE4F6k1C6_LEA"
  },
  "VJrM24cINKpzg3R4_f6YLw": {
    "date": "11/27/2015",
    "text": "The lunch offer is incredible value: 2 courses for £8 or 3 for £11. The menu is fairly standard French bistro style - moules, pate, steak, and a selection of other meaty dishes, although there were a few vegetarian options as well.  A nice setting and friendly staff.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cVYVbw3l7lHbHxqrfDECIQ",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Minute steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cVYVbw3l7lHbHxqrfDECIQ/o.jpg"
      },
      {
        "img_id": "CGcyC96v0ndzq7nZ975__Q",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Fish soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CGcyC96v0ndzq7nZ975__Q/o.jpg"
      },
      {
        "img_id": "e96-e7RZ-FVrSI-r9i2Q3A",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e96-e7RZ-FVrSI-r9i2Q3A/o.jpg"
      }
    ],
    "user_id": "jkD0eejAIYjqiAbWw8BzMA"
  },
  "VFytYz0YLOz7aSv3fofonQ": {
    "date": "6/27/2014",
    "text": "My group of friends came here on the recommendation of a colleague, who described it as inexpensive but with generous portions. On both counts, he was completely right. French cuisine is pretty heavy, so you probably won't need appetizers unless you're extremely hungry.That said, I found it almost impossible to choose an entree because everything sounded amazing. I ended up ordering the T-bone steak, which came with a side of baked cheesy potatoes. The potatoes were heavenly, and the steak was of a substantial heft. The gravy poured on top of the steak was a great complement to both.We washed it all down with a bottle of their Sauvignon Blanc, which was really good. Also worth mentioning is that their menu is very vegetarian and pescatarian friendly, so don't be deterred by all my meat descriptors!The staff was extremely helpful and friendly. My only regret is that I missed the Sunday roast that they do here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xJpvRrk04rb4rgWtMXaPUQ"
  },
  "TTKWkPFbAvbS0XG60mTxKw": {
    "date": "3/11/2015",
    "text": "Cosy French restaurant with the most delicious steak I've ever had. Very good value for the area and courses. Went with a group of 20 for a Christmas meal. We were served in good time, everybody thoroughly enjoyed their food and the staff were polite, friendly and attentive. Apart from the decor not being the most extravagant and it being a little on the small side, I can not fault this restaurant and, even then, neither of these things posed a problem for our party.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ft2vIYz089O-ll1QsyOHtg"
  },
  "BE_7D4EBgAPwRO7pxoalyA": {
    "date": "6/19/2015",
    "text": "Went for dinner last night and although we used a Tastecard, I could quite happily have paid full price. Great selection of food and the meals (we had coq au vin and toulouse sausages) were very tasty and ended with delicious desserts.Typical French decor with a quirky edge.  As it was a rather warm evening it was nice that they were able to open out the front of the restaurant.  Great service and was an easy, relaxed evening.Would definitely come again.  A nice little find, tucked away from the usual line of Upper Street restaurants.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ao6T2NQVTdakMoVFYXwErQ"
  },
  "tZA7tVMjgdXdwrCgVJhsRQ": {
    "date": "8/7/2015",
    "text": "Amazing place! Nice and friendly people doing an excellent job with the food. I have been several times in Paris so I recognize that this resto keeps that vibe. Totally recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s366-05u6RPTHYZok63RxA",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Celebrating our third anniversay.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s366-05u6RPTHYZok63RxA/o.jpg"
      }
    ],
    "user_id": "EZrebC3UHym89ifDUgwojA"
  },
  "JvOujgVrHWnMZ7YGZA-Pcg": {
    "date": "8/13/2014",
    "text": "This small restaurant is situated in an area where restaurants are plenty. I can't say if the others are any good, but Le Sacre Coeur is worth a visit.We had three courses and were well satisfied. Although the food can not lift itself up to great it was really good. The downside to this place is the atmosphere. Although the decoration is nice, there are twice as many tables in the restaurant as there should be. This results in large noise levels along with the fact that the table next to you can hear everything you are talking about. And then there is oilcloth on the tables. That does not exactly say \"romantic evening and french cuisine\". However you do get good food at a very reasonable price and that is worth something as well.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0bpe54UmM9T6LnpSpx6UAA"
  },
  "LUFnEryOjK8OW31caUkYJw": {
    "date": "3/9/2015",
    "text": "I can only recommend this very good and cosy French restaurant.The food was great, the place very nicely decorated (old-Paris style with lots of theatre posters) and the staff friendly. This is very good value for money given the quality of the food.I recommend the beef, especially if you like meat cooked the French way (i.e. rare).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vVzzUF-4FrlKm8BCAar_Hw"
  },
  "q_dBMtm0B2kdFHLVI7lihw": {
    "date": "5/4/2015",
    "text": "Amazing little french restaurant, great food, cozy ambience, excellent service. Highly recommended, their goats cheese starter was made to perfection. Very decently priced and unlike most places their set menu is great value for money!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "soKVNa8_sH3TFqw8-HJ0ow",
        "caption": "Photo of Le Sacre Coeur - London, United Kingdom. Goats cheese on tomato with salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/soKVNa8_sH3TFqw8-HJ0ow/o.jpg"
      }
    ],
    "user_id": "RuIjnhGaRmp-3Zc0WvJDKA"
  },
  "F98hSNxsKcWK7belGlWF3Q": {
    "date": "2/1/2014",
    "text": "I must say, first and foremost, that I went for the soup. It's been a soup couple of weeks, right? And all I wanted was French onion soup. The soup did not disappoint. It was a solid French onion soup. Maybe I could have used more toast to dip, or a couple more croutons, but it was definitely all that I expected. Oh, and the salat chèvre chaud was good too. Good selection of vegetarian items; most of the menu is mussel-based, but they have all your French classics. Dim lighting and musical theatre posters make for an intimate evening.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks-RuwIQU_7oA5Sstor67g"
  },
  "6-FCXxOoiVNN2audetzr8w": {
    "date": "1/28/2014",
    "text": "I'd give this place 3 1/2 stars if I could.  It has a relaxed vibe with a neighbourhoody feel. There's a big enough menu that you feel you have choices, but not so huge that you feel overwhelmed. Also have a solid amount of veggie options, which is a nice thing.My vegetarian pasta provencale was really good but the mussels starter was only halfway decent. There was only a touch of broth at the bottom of the plate, and the mussels themselves were dry and a bit rubbery.This may be the type of place that's touch and go, and they do some dishes very well and struggle with others. I will say, though, that the creme brulee was delicious, if a bit heavy. I may go back, but with so many other small local French restaurants (and other cuisines) in the area to try, it won't be soon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3zaKl7vvQ8w2GU2IZ30Nkg"
  }
}