{
  "RPenPA22HLnQ-XD_wqcixg": {
    "date": "6/10/2015",
    "text": "Just about perfect.  We went at lunch and had an absolutely wonderful time.  We were admiring the meats hanging in the window and the Chef brought as a sampling gratis.  Even at lunch we had a nice 4 course meal.  The setting is upscale wood without tablecloths, but it fits them perfectly.  Of the Top 100 places I hit while in London recently, this is #2 for me.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQLyh09liGmCegPxMwPqMg"
  },
  "oJaCEaFpOdljdkmUtyyV7Q": {
    "date": "11/25/2014",
    "text": "The Clove Club is a true gem taking up the space that used to be Shoreditch Town Hall. From the moment you set foot inside the building, you know you are in for a good night - whether you are going for a full on experience in the restaurant, or are just hanging with a drink in the bar.. this is not a place to get disappointed. It is possible to order meals in the bar too, from fresh salads to the flakiest cod. The menu get small daily tweaks, so you know the produce is as fresh as can be. And oh, the drinks are sublime too.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "vjn26NXeNLOx88Nput92NQ"
  },
  "MD6Rm5TmYY9ceTlWhU82tA": {
    "date": "9/28/2014",
    "text": "I have a couple of problems with Clove Club.  Actually, only one of those problems is specific to Clove Club and the other is with restaurants like this in general.  CC doesn't seem to know if it should be fine dining or casual and the whole contrast is very jarring and comes off as pretentious.  Secondly, I am so bored with 'tasting menus'.  I can understand if you are the Fat Duck why you'd have a tasting menu, there is a lot of technique to show experience and showcase.  But here you are served fried chicken, it might be dressed up in a Christmas tree but it's still just fried chicken.  The menu here should definitely be a la carte and it should be casual because that is the food that is served.  Its sister restaurant 10 Bells is exactly this and it is wonderful and I love it.  CC on the other hand is trying to be something it is not.Re: the food, it was good but a little bit boring.  They do change their menu regularly so the descriptions below may not be around when you visit.The good dishes we had on the day were:  the fried chicken (although you only get one piece per person.  It's the same chicken at 10 Bells except you get a lot more to enjoy), pigeon sausages (wonderfully seasoned and gamey), 20 day dry aged Challans Duck (perfectly cooked, skin crispy and the flesh soft and tender), Amalfi lemonade (the sourness was quite the shock and then you get to the sweetness and it was like a party in your mouth) and the blackcurrant leaf icecream (intense and a perfect end to the meal).  There were some very forgettable dishes too like the smoked roe, beetroot & yoghurt (this tasted like any kind of canapes you'd get from M&S - which is solid but why served in a place like CC), tuna tartare (completely not enough dressing), thornback ray (plain and nothing to recommend it).And everything came out so slowly.  We were well and truly bored by the end.  It felt like the food kept coming with nothing to remember it by.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "pZHWJHpOFt38YnR9-MZcNA": {
    "date": "12/9/2014",
    "text": "I don't usually like being the bearer of bad reviews, but I thought my experience was important to share for others who might be likeminded.TL;DR: I left hungry.My friend and I had a reservation for the bar, and ordered:Cocktails: Japanese whiskey thing was refreshing, and maybe my favorite part of the experience but nothing to return for. Pisco Inferno was delightfully named but confusingly flavored, as my friend didn't get anything pisco-y from it.Bread and butter: Would have been fantastic if not seemingly baked from frozen--the bread was warm on the outside, but cold and wet in the middle. The texture was actually perfect for me, up until I hit the clammy parts. It was upsetting.Buttermilk Fried Chicken & Pine Salt: Tasty, but I was distracted by the set-up being an overabundance of pine nesting that made me wonder if they throw the nest away every time, or if the nest had been reused. Neither thought made me happy.Raw Orkney Scallop, Hazelnut, Clementine & Wiltshire Truffle: I usually love raw scallop, but I didn't love this combination at all. There was something weird about the textures that reminded me of slivered styrofoam and brined slime. This was a personal preference, as it really worked for my companion.Roast Cornish Cod, Borlotti Beans, Smoked Garlic & Tarragon: The only thing I remember about this is that I let my friend have most of it because it didn't really do it for me. I wasn't being terribly gracious, as there wasn't a lot to share anyway.Clove Club Salad with Radishes: Definitely the best-executed food we had, mostly because the lettuces were super fresh.Smoked Kielbasa & Sweet Pickle Mustard: They forgot to bring it out, but didn't forget to put it on the bill. The servers apologized, but I wish they had just remembered to bring it when we wanted it.I really do wish Clove Club the best, as I see they have made many of my friends so happy. But I can't recommend it based off this experience, unless you really crave a side salad with a refreshing cocktail, in which case by all means, it's got your number.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hhHdA-UuG5DG1XYXfClPtQ"
  },
  "09w_lBm9VF3V6ggf9scO2w": {
    "date": "7/10/2015",
    "text": "Overdue review here but a definite 5 star review from me.On arrival we were greeted and shown directly to our table by friendly and assured staff. From there the experience started...Chose the wine pairings and then within just a minute or two our dishes started to arrive. Everything was interesting and exciting and innovative but at the same time not overly fussy or silly. A stream of flavours, textures and combinations designed to please the senses and it all worked. A standout was the raw scallop with brown butter and truffle. There were some quirky dishes such as duck and ginger broth with 100 year old madeira (you drink the broth and then sip the madeira). The wine pairing option was quite a bit more but a real treat and each dish had a wine option so I think I tried about 10 different wines, including dessert wines. Everything was highly coordinated in timing and perfectly executed with the chefs in the kitchen on show and working together in a focused manner.Different from a classic Michelin restaurant experience and maybe more exciting. The restaurant itself is in a low key, almost minimal interior but warm, not cold. Service was superb. Low key, friendly, just on point.In terms of value, I also give 5 stars. Pricey yes but excellent all round so good value.I want to go back if I can get a reservation again!",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "GLROpanhr8oSnPgBRpO8Uw": {
    "date": "5/9/2014",
    "text": "Amazing food, amazing service, amazing drinks. In short, this place is amazing, and you need to go here.Located in the bustling and uber-cool Shoreditch neighborhood, it's your best bet to make a reservation and show up on time. I was lucky enough to come here with a local who knew best how to navigate the menu of multiple small plates, and among the four of us in our party, we shared just about every plate on the menu, in addition to a few cocktails and a great bottle of wine. The Clove Club really shines when it comes to meat and cheeses; their charcuterie is simply not to be missed. The care and thoughtfulness that goes into combinations and presentation is very apparent and much appreciated, too. Another thing you're going to want to try? The fried chicken -- it's simply sublime. Our servers were incredibly sweet and helpful when it came to making recommendations not only for what to order, but how much of what to order. I think they enjoyed us enjoying them, because on top of the two desserts we ordered, they gifted us a third because they 'though we might enjoy this, too.\" Such service!While the vibe is on the hipstery side of things, the mood is anything but and the food, cocktails and service give this place the clout to do whatever the cripes they want with their decorative choices. I, for one, will be returning here immediately upon landing in London whenever that next happens... And it will happen, I can assure you.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "IcdxwCBX6rNHwlcFJEVVtQ"
  },
  "THpV4aRLA5eeoAOpOhmm8Q": {
    "date": "5/3/2015",
    "text": "Went for the full tasting menu and left the wine pairing up to the very knowledgeable and welcoming server(s). I hate using the metaphor \"journey\", but from the first bite of the delicious pre-menu snacks, that's exactly what it felt like; A journey through the English countryside. Everything was very tasty, but there were definitely some highlights. The Flame Grilled Mackerel (with English cucumber, elderflower and sorrel), the Duck Broth & Hundred Year Old Madeira, the Yorkshire Grouse (with elderflower and golden turnip) and last, but not least, the Amalfi Lemonade & Sarawak Pepper dessert. Damn, that was good! I will for sure return here next time I'm in London. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rwCp_exgRZ0UwxxIo3-Qkw"
  },
  "0DbE8xkESwFXuG3c8W6dnQ": {
    "date": "8/27/2016",
    "text": "monday night dinner.had one regular and one vegetarian extended menu. things that were odd: the small bites that they gave us before dinner...both had meat even though we said and ordered a vegetarian menu...so my wife got haggis...and breaded chicken....kind of weird.the menus themselves were good, not amazing. im writing this review about a week and a half after the reservation. i honestly cant remember anything i ate other than the stuff mentioned above...and the bread course which was good. we had a nice dinner here and im sure youll enjoy it, just nothing in particular that made me think or feel...omg this is amazing type of feeling.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhYY6qm3-Q_1a0XheGFmNA"
  },
  "JvP7HgfQqKcnuFpWIQ5v_A": {
    "date": "7/20/2014",
    "text": "Was blown away by this place on Thursday evening. The first thing you notice is the venue itself. Set in the heart of Shoreditch in what seems to be an unassuming grey ex governmental building from the outside. You immediately walk into a view of dried meats and a buzzing but equally laid back bar and smiles from all the staff. The restaurant is located at the back and with its huge old windows was perfect for a hot summers evening.The staff were attentive but non intrusive and exceptiinally friendly and our particular waitress had great knowledge of all the courses and wines and helped us make an excellent choice on drinks.The menu itself is a set tasting menu of £55 with supplements for some extra courses. Before the meal you are given some amazing bite size snacks. Despite their size, each set off a taste explosion in your mouth.This was then followed by 8 (ish) courses of sheer culinary brilliance. Everything was delicious and impossible not to savour. A particular favourite was the aubergine puree served with one of the courses. In addition the bread and butter side is made there and even the butter was delish!This meal was finished off with two separate desserts and when the bill came this was served again with further smaller and equally stunning desserts.  It would be impossible not to leave this place 100% sated. A London must do!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3_Sdi7jzKxIowaRhjVdHA"
  },
  "ScNUitkQhWFos3LhoYbtKQ": {
    "date": "3/24/2013",
    "text": "Recommended. The latest venue of the \"Young Turks\" impresses in ways, not least of which is their addictive and delicious Buttermilk Fried Chicken and Pine... a dish that I could see myself coming back for again and again (think: the best Popcorn Chicken you have ever eaten). Other dishes were generally strong as well: Pigeon Sausages, Chicory Salad, and the Beef Short Rib main (with a delicious schmear of mashed potato) all stood out. While some of the tapas from the \"Cold\" section did not particularly impress, I would be quick to point out that everything was more than edible... and we left our plates almost uniformly clean.Service from start to finish was very good. A last minute change of our reservation from 4 to 2? No problem. I also appreciated that the wait staff all seemed very into food... and all had insightful opinions on the menu. The only miscue was with regards to wine recommendations: our Bourgonge Rouge was not close to impressive, albeit drinkable.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "faK-VaDldjRT0IR0xgHM1g"
  },
  "oJuMz46_tQXsmXe7OghKVQ": {
    "date": "4/1/2016",
    "text": "This was a really excellent tasting menu-- the food was innovative and yummy.  The staff was very very nice and helpful.   It has four $$$ signs, but in terms of tasting menus, it's very reasonably priced.  I also liked the relaxed vibe and that you didn't have to get dressed up.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Wu9F2Xg61KHuOVsRYEfyw"
  },
  "FcjhJr1yW_oubWPZ-SSScw": {
    "date": "7/15/2014",
    "text": "Since moving to London, my mother really likes to find out about new and interesting restaurants for me to try. The last time I was home, she had printed out something from the internet about the five best restaurants in Shoreditch. I had to roll my eyes, because Shoreditch is that place I love to hate. It's so trendy, it's not even funny. And usually things seem to be too trendy for their own good and ultimately aren't really as good as they think they are or that the hipsters think they are. However, I was curious (and I have been to a few decent places in Shoreditch), so I glanced over the list. The Clove Club really jumped out at me because they mentioned \"de-boned puffed chicken feet\", and I immediately knew that this was going at the top of my list of restaurants to try when I finished my vacation.Well, due to Nava N.'s imminent return to London for a few weeks, I convinced her (and her beau) to come to dinner to give it a try. Checking their website they offer a five-course tasting menu for £55, but if you pre-order, you can go whole hog and pre-order a nine-course menu for £85. So yeah, nine courses it would have to be, so I sent them an email to set up this experience! The menu had no mention of the chicken feet, so I was a bit disappointed, but I'm aware that places change menus so I shouldn't be too bothered that the course is missing.The venue itself is really simple and modern. Not elaborate, but really well done. There's a bar area (where we sat and enjoyed some really delicious cocktails to start the dinner) and a dining area with a few tables and a big open kitchen. We were sitting on the other side of the room, so I didn't have a great view of the kitchen, but I did get to glance that way a few times to see the chefs bustling around the kitchen.So the tasting menu starts out with snacks. Apparently snacks are the new \"in thing\" for tasting menus. Not that I mind. There were a lot of snacks to be had. The first of which: THE CHICKEN FEET. It really made my night to know that I was going to eat the dish that convinced me to try the restaurant in the first place. Oh yes, the chicken feet. And it was really delicious. Like crackling (but chickeny). The came a selection of house-cured meats, a peanut and mint roll and a cracker with a fishy cream on top. All were delicious. Then came out pine fried chicken, tarts with a hazelnut oil and mini cheese sandwiches. The chicken was perfectly cook (and moist thanks to the use of thighs). The cheese sandwiches were heavenly with a slightly chilled bechamel between two light and crispy crackers. Finally we had sausage with a green ketchup that was a just a burst of flavors in your mouth. What a great way to start the meal!This was followed by mullet sashimi (though the American guy bringing it to our table called it mackerel, so who knows). Light and delicate and you can't go wrong with daikon radishes. Next was a potato soup with cockles and beans. Really light potato soup! I didn't know it could get so creamy and yet so light! Then my favorite course of the night: the squid. It was cooked perfectly with an amazing indian spiced sauce. One of the best squid courses I've eaten. The following course of turbot was also really well done (and I usually don't like fish unless it's seafood), and the elderflower and fennel puree was delicious. Next was a cheddar tart (where the cheddar just oozed out of the shell). Really good. Then a duck broth with 100 year old madeira. Nice, but the madeira was hard to taste over the broth. Then we had a black pudding dish with peach (although they said it was lowquat), and we all enjoyed it quite a bit. The last savory course was duck with seeds and grains, and while I really enjoyed the duck, I wasn't a fan of spelt risotto (I never am, I think it's a texture thing). The flavor of the spelt was nice, but I just couldn't finish it.The two desserts both consisted of ice cream, and they were both really delicious. The first was a Pepper Ice Cream with a lemon cream on top. The pepper was really subtle and hard to taste, but I could have eaten that lemon all night. The final one was black current leaf ice cream with a black current jelly, and it was a perfect end to the main courses. At this point, it was getting late, so we had to get the bill and get rushed out, so I didn't get to try the coffee. But they did deliver three petit fours at the end of the meal for us to try. One was a little cake that was heavenly. The second was an almond and coffee chocolate bar. The almond was really subtle, but the coffee was really in your face. I loved it. Finally a candy with a liquid center made of fernet and creme de menthe. It just finished up with a lovely burst of mint to end the meal.Unfortunately, they don't do wine pairings, which was a bit of a let down, but I had my partner figure out some good wines to go with the meal. I can't recommend The Clove Club enough! We'll definitely be back in the future.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "iJOaINYXPE-NKv1_wlld0w": {
    "date": "5/11/2015",
    "text": "Marvellous non-alcoholic cocktail (!). Also, tried the kebab from their bar menu. Come to think of it, was I even at a Michelin Star restaurant? Well it tasted like it, anyways.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GqB9b9RQ4knhaQSYjYD0MQ"
  },
  "k-zTXbV0mpq2gZL874MV4g": {
    "date": "12/19/2014",
    "text": "Now that I've had two visits to the Clove Club, I feel like I can give a more holistic review. To be fair, my first visit started out with a bit of bickering between me and my partner over why I booked the bar area for 8PM on a Tuesday rather than wait for the 9:30 reservation for the set menu in the dining room. My argument is that it would be a long dinner to be enjoyed without worrying about rushing home (more on that later). All resentment faded away when we realized we were literally sitting next to Kiera Knightly in the back room of the bar. So there was that.  The pros of the night were getting drunk on delicious cocktails  (I mean it's a Tuesday, but now we're sitting next to Kiera Knighly - so why not celebrate and send a couple shots to her table as well - yes that happened .)The cons were...well, sitting next to Kiera Knightly - so the staff was pretty indisposed and starstruck and focused on making sure everything (literally everything) on the menu was delivered to her table while we waited ages for the dishes we ordered. I think we had about 4 waiters through the night as they could come over to us and drop food and get a glance over to the table. So much for consistency, right? That being said when we did have a chance to interact, everyone wa nice and chatty.  So, I suppose you might be wondering about the food.  If you go for the bar menu, don't miss out on the buttermilk fried chicken. You'll also find this on your snacklist on the set tasting menu if you decide to come back and try that.  The buttermilk was by far the best dish that we tried at this sitting.My second visit is where I think I can give an actual review. My girlfriends and I have a monthly wine club and to celebrate the Holidays and relieve us of our hosting duties, we decided to do a wine and food pairing at the Clove Club.  I need to mention that we didn't provide any dietary restrictions in advance and there is a set menu.  One of my friends has a deathly shellfish allergy and we realized upon arriving that a few of the dishes in the set menu had shellfish.  Without having to say much the staff was super accommodating. Wine pairings: Do it. And if it's a celebration - start with the prosecco. The prosecco they had available was organic and \"cloudy\" and though not you would traditionally imagine when you think prosecco - a delight.  The sommelier knew his stuff and it really added to the experience to have him pop over for each dish and explain the pairings (plus if the kitchen is going a bit slow - he will make sure you always have a full glass to taste with!) We left with a wine list in hand for future wine club inspiration.  Food: As I mentioned you'll get to try the buttermilk fried chicken as part of the snacks here.  As for the other food. So - great! My favourites include the scallop and venison but there really wasn't one bad course.  I'd suggest making reservations pretty far in advance if you're looking to dine in the set menu restaurant, though the bar seems to have more accommodating seatings at the last minute.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zwVYz5sXfeaxdbRr7nXb7g"
  },
  "mZ4o3hQAjbR0ZU3j9nxKiQ": {
    "date": "6/11/2014",
    "text": "Beautiful food, warm and comfortable dining area, and courteous staff. Amazing special occasion restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlxdobUMQBgyoQjyQqpEZQ"
  },
  "wJbP9ViXe6EyvXvXeYpj7g": {
    "date": "5/23/2014",
    "text": "The charcuterie set the bar for the rest of the night. Then came a creamy cheese tart that had a much fancier description - it set the bar even higher. We had gulls eggs (not sure how as they were simply served soft boiled) - amazing! Scallops melted in my mouth. Broad beans with sea urchin soup so so tasty. The seabass was good (I'm not a big fish eater). The lamb with mash...loved the crisped up fat..delicious. And so much other tasty stuff in between. Only problem is that I feel very full. The staff were enthusiastic about the food which I loved. Attentive without being annoying. I really enjoyed the night.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_J_bJ6wAS0ejMxFa2RJLw"
  },
  "SgFZMfxwek68_obIT5uaOw": {
    "date": "11/16/2014",
    "text": "I can't agree with the previous reviewer who suggested that fine dining in a casual setting came off as pretentious. It's true the setting is casual / down to earth and the food is top notch, but I didn't get the impression they were glaringly try-too-hard or attempting to pull off a fake overpriced hipster chic. Rustic wood floors & tables, open kitchen and hanging hams fit with a laidback Shoreditch vibe, and the area perhaps doesn't lead you to expect a lot of michelin-quality food options. Perhaps if the clientele had been City suits from a couple of miles down the road you would have looked at the decor and pricing more cynically as if it were just the latest 'new alternative' place to separate you from your cash. But most of the guests seemed to be couples or good friends having a fun time without being too formal or too raucous. Didn't spend any time in the bar as we had quite early reservations on a Friday evening, and it filled up relatively quite quickly between 6.30 and 7. Staff did a good job; while it was less busy some of them were standing around a little awkwardly but not in your face. The £55 per head tasting menu (5 courses plus some snacks and other titbits) was good value, although by the time you add on a round of cocktails, some inhouse cured meats, pay the supplementals for an excellent optional course, have coffee and a couple of bottles of excellent wine - you can triple that, pre tip (12.5%, auto-added).So, not the kind of place you go every week or every month, and with so many other fine dining choices in London I've yet to try, I'm unlikely to be back for a while. But I'd recommend it and give 4.5 stars if that were an option. As it isn't, I can't justify 5* so will have to just say 4.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZfQvZqaPEwbvvD9ZzuRaEQ"
  },
  "nEUcJGWlNJ6tjoYr7u6fKA": {
    "date": "5/2/2013",
    "text": "gets 2 stars solely on the fact that it is massively overpriced. £47 for a 5 course set menu...one of the dishes was f*cking radishes with, basically, burger sauce. 2 desserts also seemed like a cop out. the beef was beautiful but there was far too much fat on the cuts. the service was great and the venue is simple, clean, open plan with a great view of the kitchen. the owners seem like decent blokes too.we didn't eat at the bar which could be the way to go, cocktails etc.the dining room will not get repeat customers if they carry on like this.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "WUniDj6LiZRFEfUBnnQlaQ": {
    "date": "4/8/2014",
    "text": "Fantastic prix fixe menu, everything was delicious, the buttermilk fried chicken was probably the highlight and couldn't have been more moist and tasty.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dwke12tCm5qJiNlRiDD_rA"
  },
  "A-v6SsL1k10evIgXJ-goJA": {
    "date": "3/31/2014",
    "text": "This place is great. We went to the more low key downstairs a la carte menu. To begin with there are 4-5 cocktails that are pretty fantastic (in our party we tried four and they were all good). Then there are small starters that include salami, cheese, and some yummy radishes. The real piece de resistance however was the buttermilk fried chicken. Trust me you will want the basket all to yourself. The sole was great too, with an Indian twist. Finally the fennel mousse for dessert is certainly not the most delicious thing I've ever tried but the combination is interesting and worth trying out. Atmosphere was very trendy and extremely friendly and efficient staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mxCZk4OpX8dK1ax3oOva-Q"
  },
  "6-OG1DcKMVwTurugjVrAkg": {
    "date": "4/13/2013",
    "text": "Food was good but portions were small.  Good but nothing really blew me away.  The buttermilk fried chicken was tasty and had a cool presentation on pine",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wtc-_ItNFE7GCddADBR34Q"
  },
  "A3oZZtTML8yNyTR4TzT8rg": {
    "date": "1/15/2018",
    "text": "The Clove club is simply sublime! We had a perfect dinner, staff gave us the perfect recommendations on what to order. Everything together (the food, the drinks, ambiance and service) went so perfectly and resulted into a memorable experience! This is the place I am surely going to visit again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WEmQCt3kaoKqj4Q9KW6TRg"
  },
  "MzLEcivTM00L41ASRpK24Q": {
    "date": "11/5/2016",
    "text": "I will put 5 stars because the food is definitely of a high standard - and God knows the food is good in London.Everything we tasted was delicious and of a superior quality, especially the fish and sea food.However, the amount of ceremony is a bit too much and the dinner was too long.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LI2Ml9DOriXdKZa9UeLGOQ"
  },
  "ZcvyVEQLp0XqhtGgtbsrKA": {
    "date": "4/26/2013",
    "text": "How does eating all of this sound to you? Restaurant Menu (April 2013) Radishes, Sesame & GochuchangButtermilk Chicken & Pine SaltSmoked Duck Ham---------------Mackerel, Pickled Rhubarb & Tokyo TurnipGrilled Squid, Tarragon & Green RadishesRib of Beef, Ramson & PotatoBlood Orange, Sheep's Milk Mousse & Wild FennelCaramel Ice Cream, Barley & Oats£47 per person. And drinking this... Allpress Coffee (I had a Flat White) --  £3.00A WhriligigA Gimlet Some wineJaipur IPA. Basically we ate and drank our faces off, and loved every minute of it. May be my best dining experience in London I've had thus far. The food was fantastic, I didn't have to choose (love this part, actually!), great drinks, wonderful service, cool digs, great vibe.Housed in the Shoreditch Town Hall. Gorgeous space that's been outfitted beautifully -- high ceilings, rustic/vintage feel, no detail left unfinished. 5 minute walk from Old Street Tube. *All dinner reservations are the set menu for £47 per person. *Reservations necessary. I booked 1 month out and got 9pm on a Thursday evening. *No reservations needed for the bar area. I'll definitely be back for drinks, and dinner...the buzz is high right now, catch it.",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 5,
      "cool": 10
    },
    "photos": [],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "GO6xZvZTcUx4mkzNVHzrwg": {
    "date": "2/14/2016",
    "text": "Amazing experience with the tasting menu, at 95GBP per person it's definitely pricey but worth our 3.5 hour meal (book and pay online in advance). Each course (roughly 10) was extremely unique and delicious except for 1 or 2 misses, they'll adapt the menu if you have any food allergies or aversions, and overall service was great. The one hiccup in our experience was a fire alarm from the theater next door which went off and continued for at least 5 minutes. Highly recommend booking here for a nice treat.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4lpAu8nFqMv1nXz5NLfcXw"
  },
  "DrY9AZLcNkSklIJbfmgljQ": {
    "date": "6/11/2013",
    "text": "The Clove Club is a very comfortable setting with a rustic country feel. The menu is pre-fixe but they will happily accommodate for allergies/dietary restrictions and ask you upon arrival if you have any issues. Service was seamless and dishes came out at just the right times.Presentation for all dishes was nicely done and we pretty much liked every dish. The small bites are truly 1-2 bite portions but just enough for a good taste. Fried chicken= wonderful! The flame grilled mackerel was fresh and cooked just right but could have had a bit more oopmh from the sauce. It was a very mild dish. I love sesame and thought the radishes with black sesame and gochuchang was a really unique combo.Radishes, black sesame & gochuchangButtermilk chicken & pine saltFried sand eels and vinegar mint sauceBiscuit and cheeseBraised LeeksSalad of spring vegetables, pheasant egg, fresh ricotta, and lardoFlame grilled mackerel with dill, cucumber, and elderflower vinegarSlow cooked loin of lamb, spinach, anchovy and mintLamb ribsStrawberries and creamPrune ice cream, kernel and rosemary sorbet, and walnut cake crumb",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iek0_KMCQFn7z69F070zNg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iek0_KMCQFn7z69F070zNg/o.jpg"
      },
      {
        "img_id": "GT2YafSyRVviQzcMDREyMw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GT2YafSyRVviQzcMDREyMw/o.jpg"
      },
      {
        "img_id": "6woMCKtn5K9rn-qA45B3og",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6woMCKtn5K9rn-qA45B3og/o.jpg"
      }
    ],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "SwkxuhfQLeJc-Ty_NwzYHg": {
    "date": "9/12/2016",
    "text": "Incredible experience with the best dish I've ever had! The clove club was a cheeky, stylish and sensational dining experience. We chose to have the wine pairing with our tasting menu and it was perfect. The service was flawless and the staff was extremely knowledgable and helpful.After visiting Alinea // Chicago several weeks prior to The Clove Club, I found myself asking how The Clove Club will live up to it. In a nutshell, it was a close second to Alinea. Even though The Clove Club had the best dish I've ever experienced, the service fell just a little bit short of Alinea. Overall I cannot wait to visit the clove club again! I highly recommend it to anyone and wish all could experience the Clove!For a full detailed review of The Clove Club and its amazing dishes, visit lambertsontheloose.com/r…Follow me on Snapchat and Instagram: reed_lambert for around the world cuisine experiences!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1tFadbOGy-FKFDHqmNxCQ"
  },
  "ZxoHsHyAUWmjZT7lG26nuQ": {
    "date": "11/17/2016",
    "text": "I came here for dinner with two friends last night after booking a few weeks prior. As is widely known, The Clove Club requires advance payment when booking, which is very unique, but some other things I noticed were that 1) it was very hard to know when dates would open to be available for  booking, as the site just says the end date that it is booking until, so it was only through consistent checking of the site that I booked at the very start of October for a November date 2) I did not think about the fact that there will be gratuity added later, so you will have some additional amount to pay, regardless of whether or not you get drinks / supplements and 3) you can upgrade to the full 9 course menu when you get there, so that is not a problem. The venue is very cool, as it is part of Shoreditch Town Hall, but there is a separate entrance that is well marked so finding it was not a problem. We have a large comfortable table in a quiet corner, but the bar was quite loud and the seats didn't look very comfortable, so I am glad we did not book for that area. The other remarkable thing I noted was that it was a very casual vibe for a Michelin star restaurants; our corner was decorated as if it was a living room, and there were rustic wooden tables and no white tablecloths. I loved it! We had the five course set menu, which was predominantly seafood based, but also came with several courses of amuse bouches and petit fours, so it ended up being a lot of food that took us over 2 hours to finish. I also thought it was very interesting that each course was presented by a different person, which made me think that it may be the responsible chef in the kitchen. The most memorable dishes was an amuse bouche with crab and hollandaise, the smoked mallard that was presented to us in its entirety at the table before being plated and the tarte tatin that was simply incredible. We also got the £50 egg yolk with white Alba truffle supplement to share, and while the truffle servings were extremely generous, I didn't think it was worth the price. The sommelier was very helpful and recommended a white wine from the southwest of Italy that we really liked. I would definitely recommend the experience!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "VDvZFqAIPw4pU9N9T3Gd0g": {
    "date": "4/5/2014",
    "text": "Heard a lot of good things about The Clove Club and I took two foodie friends from out of town there and this place didn't disappoint! We had a wonderful evening tasting delicious food and enjoying great services which were not typical of London restaurants. The restaurant only serves a 5-course tasting menu, and based on previous reviews, the price has increased to £55 (from £47 April 2013). However, it is still great value for the high quality and innovative food on the table. The dining room was intimate and you can see the open kitchen at one end of the room. As soon as we were lead into the dining room, people behind the kitchen greeted us. They were so nice and warm and I feel that they were really happy that we came to dine tonight. Before the tasting started, there were 3 pre-courses, which included the famous buttermilk fried chicken & pine salt, pieces of juicy deliciousness with fresh pine salt, simply heaven. We also ordered their house cured Jamon for an extra £16. It was good, but I have tasted better. The tasting started with horse mackerel tartare covered in picked rhubarb & turnips. The presentation was so pretty and the taste was extremely refreshing and delicate. A very strong opening. Then followed Cornish monkfish with white asparagus, cinnamon and curry leaf. I love how the warm and sweet flavor of cinnamon compliment the taste of monkfish. The heaviest dish was lamb with seaweed sauce. It was quite an unusual combination. Both have very distinctive flavors and I would never have dreamed of putting the two together. However, it worked beautifully together, and I especially loved the fatty part of the lamb, so very delicious. Then we were transitioning to the sweet part of the evening which took the meal to a new height. The warm blood orange, sheep's milk mousse and fennel granita was divine! The palate cleanser which was not even listed on the menu turned out to be another highlight. It was a lemon soda mousse, which was fluffy and tingled on your tough. We all loved it. Last but not least, we had apple tarte tatin. And in typical tasting menu fashion, we got some last sweet treats of house made chocolate. We thoroughly enjoyed the whole experience and it is definitely high on my recommendation list.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "PBOSyX7VN3yNrvlKxtaG-g",
        "caption": "Photo of The Clove Club - London, United Kingdom. Apple Tarte Tatin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PBOSyX7VN3yNrvlKxtaG-g/o.jpg"
      },
      {
        "img_id": "iUjRKvfkPJv4dJuUMSlenA",
        "caption": "Photo of The Clove Club - London, United Kingdom. Lemon Soda Mousse",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iUjRKvfkPJv4dJuUMSlenA/o.jpg"
      },
      {
        "img_id": "qel13PpkSjDyYr52wrDMvw",
        "caption": "Photo of The Clove Club - London, United Kingdom. Warm Blood Orange, Sheep's Milk Mousse & Fennel Granita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qel13PpkSjDyYr52wrDMvw/o.jpg"
      }
    ],
    "user_id": "l6Yh_hwYzqnt4EzSiCqJDQ"
  },
  "mjrh5VDnnnvXoqqmnyDbMQ": {
    "date": "2/24/2015",
    "text": "Stuffed out of my mind...the 100 yr old Madeira and duck soup 5 star dish in my opinion, but the other dish was alright.  I guess the biggest problem for me is the sequence of the dishes, it just got heavier and richer as the meal progress. It just became too rich even if the food looks delicious.  My favorite are the wood smoked pigeon sThe tongue and tummy just needed a break if they mixed in something acidy and tingy would've been 4 stars. Wood smoked pigeon Sausage, the fried chicken feet that taste like chiccharonnes.  Also lets not forget about the scallop truffle dish see pic..food mix with abstract art. The blood pudding was disgusting, the texture was just too thick..",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4meJ4_EhwaP5yo1z8Log3g",
        "caption": "Photo of The Clove Club - London, United Kingdom. Scallop w/truffle sauce from the start to its completion",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4meJ4_EhwaP5yo1z8Log3g/o.jpg"
      }
    ],
    "user_id": "AEcgyhwxC5tDZV5tY_ALJw"
  },
  "c1_6xyR1MRNm1re61EVrVA": {
    "date": "1/31/2017",
    "text": "You can totally understand why its in the worlds top 50. Been here twice, first time to try the tasting menu which did things to me i never knew food could do. And second, as a walk in and sat at the bar to sample some snacks and cocktails, my date was super impressed with the buttermilk fried chicken and the bread and butter - simply devine! Staff are very friendly and welcoming with the atmosphere made slightly pretentious from some of the customers, but definitely not the staff who know everything there is to know about their menu and the ingredients they use. Worth the repeat custom.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7p2jcoaUm5Q3oh68s6Lm2w"
  },
  "NYQRc4o0xnUlXn8OrNO7OA": {
    "date": "12/7/2016",
    "text": "This place was absolutely charming. My boyfriend and I came here for dinner while in London, and we both really liked the whole experience. Since I am pregnant they had to make some adjustments to the dishes, but the chef was creative about it that I didn't miss anything on the flavors. There was one or maybe two dishes that had to be completely different to my boyfriend's, but they looked just as good as his. Non-alcoholic drinks were also very flavorful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cRopvbV52e_AbVLfan4mnA"
  },
  "xYS2LB0MYrQrRhIeScR3gg": {
    "date": "10/4/2016",
    "text": "They are on the Tock ticketing system (like Lazy Bear in SF, Alinea in Chicago).  I was interested in some Indian influenced British food.  The tickets are £95 each.  We ended up with 2 bottles of wine, and the sommelier was very helpful with picking out the reds. It's not a huge wine list, but there's a good variety.To start:- Beet root and apple granita with walnut cream: the cream was definitely nutty and interesting- Cornish crab tart with crab hollandaise: the spices reminded me of Old Bay and were good with crab- Buttermilk fried chicken and haggis buns: the haggis buns had a good spiced onion flavor. This dish is actually at In Situ in SF right now. This was my favorite of the amuses even though I don't usually like haggis The meal:- Red Cornish mullet sashimi: with thinly sliced black radish and tarragon - Raw scallop (signature dish): I thought that texture and flavor wise, the scallop could have used a bit more. The hazelnut and toasted hazelnut actually obscured the sweetness of the scallop - Chestnut and oyster broth: served like a chawanmushi - it was like a creamy spinach and seafood chowder. This was very warming and satisfying, and the Scottish seaweed was very unique - Monkfish: cooked in malted barley oil with Jerusalem artichoke and coffee- Buckwheat pancake: I liked being able to pick it up with my hand. It had chicken, a long pepper, a mustard leaf, and devil's spices (similar to what was on the crab) - Madeira from 1908 - you first get to taste it on its own, and then they pour in warm duck consommé with fermented cabbage. The consommé was rich but clean and had a nice hint of thyme- Fallow prickett: a bit gamey for me. The Szechuan pepper and black currant made it very interesting, though- Yorkshire grouse (add on supplement): we didn't expect for it to be quite so gamey, and we actually had a comment from one of the servers that was kind of like \"well what did you expect?\", which was very off-putting. The elderberries and bread sauce were enjoyable To finish:- Amalfi lemonade and an Appalachian ice cream: the lemon was very clean tasting, which I appreciated- Jelly of champagne and summer berries: I don't usually like fruit based desserts, but this was good for the end of the meal- Islay whisky gel caramels: alcoholic bonbons with a fragile shell and liquid insideI think everything in concept was very creative and interesting, but the execution wasn't quite what I was expecting or hoping for on some of the dishes.  I do enjoy feeling like you're sitting in the kitchen and being able to see the chefs in action.  The meal ended up taking about 5 hours. I appreciate that we were never rushed, but it did last a while.  The price was quite reasonable for what we got, and the sommelier was great.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfyW0vuJls8ARoHmogfcmw"
  },
  "rE4-m-xLmnX0f2cSO4_neg": {
    "date": "10/6/2016",
    "text": "OverratedLunch4 peopleStarted with drinks that were nice but miniature.Tomatoes for starter might be grown locally but were bland and over ripe.Scallop looked good.Grouse for main was nice.Was first served two legs each on the side. I asked if we shouldnt share a plate of two legs but was told no. Afterwards the waither came back and took away my friends plate of two legs and said he had made a mistake.Petit fours the best and most original thing.Asked if we could have more and was first told no then yes. However, when served the waiter kept pointing out how lucky we were to get moreAll in all bad serviceWill not be back",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKRVtO4SYvTzITapLm58RQ"
  },
  "Mw0kkzee789wh83siivtRw": {
    "date": "8/6/2013",
    "text": "5 big stars for the Clove Club. Really innovative and delicious food in a hip setting (Shoreditch town hall). Since opening earlier this year, the Clove Club has been getting quite a bit of hype among London's foodie scene, and for once the hype is well-deserved.For £47 quid you get an fantastic and semi-reasonably priced tasting menu. Some of the dishes were simply amazing---mackerel tartare I'm looking at you. My friends raved about the fried buttermilk chicken. The pan grilled red mullet was also well presented and rather tasty. The only dish that was just ok was the roast barbary duck--a bit bland, but every other dish was a culinary work of art.Service was friendly and helpful with the wine selections (we opted for bottles instead of the £40 wine pairing) as well as accommodating dietary restrictions. The tasting menu was easily adapted to for lactose intolerance---even down to the diary free chocolates at the end!All in, the Clove Club is such a great spot. Definitely worth checking out. If you can't get a reservation for the main dining room, the front bar serves more casual food for walk-ins.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Q0aVJsYs4YHmQTP4B-Sdbw",
        "caption": "Photo of The Clove Club - London, United Kingdom. Dairy free chocolate!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q0aVJsYs4YHmQTP4B-Sdbw/o.jpg"
      },
      {
        "img_id": "Botb66AU7C2IxwqxOSdE9A",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Botb66AU7C2IxwqxOSdE9A/o.jpg"
      },
      {
        "img_id": "9DBNVCPNyj9ZfD_4n_TeJQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9DBNVCPNyj9ZfD_4n_TeJQ/o.jpg"
      }
    ],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "Xs0_gE3IIV_o2Tyac-LRDQ": {
    "date": "8/17/2014",
    "text": "Fun place - one tasting menu only place but with the price.... It is hard to complain.. Great value and pricing. The setting is nice - quite hipster with nice historic feel. The only thing is that it smelled like old stale bar when I walked in. The smell went away in the dinning area but the floor could get better scrub?!The food is nice and experimental - some dies are hit and miss but at least they try.., my experience peaked on the first dish but others could argue differently, I am sure. For me, the highlight was snacks to start off including fried chicken with pine dust, home made bread (absolutely delicious) with homemade butter, and lightly flamed mackerel... The rest of the meal was not bad but not great for my taste - everything was in good quality though.   Service was friendly - really enjoyed the evening.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q3PslVkJlvhfPCGcMBlfiA",
        "caption": "Photo of The Clove Club - London, United Kingdom. Menu on 16th August, 2014",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q3PslVkJlvhfPCGcMBlfiA/o.jpg"
      },
      {
        "img_id": "S65PfuN6st3gTay-ZHyTIw",
        "caption": "Photo of The Clove Club - London, United Kingdom. Mai course - pork with turnip",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S65PfuN6st3gTay-ZHyTIw/o.jpg"
      },
      {
        "img_id": "8FvFV4frbT9qq3fvDo5Emg",
        "caption": "Photo of The Clove Club - London, United Kingdom. Second dish - ray in burned butter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8FvFV4frbT9qq3fvDo5Emg/o.jpg"
      }
    ],
    "user_id": "cNT93-GajYp36jMu7alv2A"
  },
  "J83Bs5H3-QR8O8A-x185Wg": {
    "date": "12/7/2015",
    "text": "First of all the handmade bread is amazing. This is a very modern restaurant in Shoreditch, the trendiest part of LONDON. The decoration is awesome and the food is outstanding. They have two different set menu for dinner. You should definitely try one of it... #shoreditch #london #cloveclub #wining #dining #finedining #foodie ##",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VKY_SoxtFlI_gstyYuyVeQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VKY_SoxtFlI_gstyYuyVeQ/o.jpg"
      },
      {
        "img_id": "kHMIIfAzCDeCfunGGHfIaw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kHMIIfAzCDeCfunGGHfIaw/o.jpg"
      },
      {
        "img_id": "5YNQi1C-uETwhVl_knafVA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5YNQi1C-uETwhVl_knafVA/o.jpg"
      }
    ],
    "user_id": "F2wMCR10XzwYkMIMCry58w"
  },
  "37yDiMqbez-VzlOQVLC63Q": {
    "date": "7/17/2016",
    "text": "Went for lunch on a Saturday and it was fantasticSat at the bar which ended up working out perfectly.The food is what you expect at these prices.A top level wine list and very knowledgeable staff",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THcG4V0fjrkJwyQvBaGiiQ"
  },
  "3V-mZDvhHgQ2CIlERKvLTg": {
    "date": "7/4/2015",
    "text": "We dined at The Clove Club on our last night in London and the first night they used the ticketing system. We were really excited to do the extended tasting menu and to try out this highly rated restaurant - part of the Worlds 50 Best List - 66 on the list. We started with a series of different snacks from the kitchen. All were absolutely amazing. I would say the best was their house cured meats or the buttermilk fried chicken with pine salt that everyone talks about. We were lead through a series of dishes, that range in size. Some of the tasting dishes were quite smaller than we expected (cheese tartlet with malt; duck and ginger broth) but still packed amazing flavor. Some of the dishes were really delicious, well seasoned, prepared and composed. We loved the raw scallop with clementines and oysters; slow cooked lamb with spring onion and mutton; or the  chilled pea mousse (amazing!!!). Some of the dishes were good but not great though - the pollack with curry leaves was a little over cooked and the foam wasn't needed, and the desserts were good but not amazing. We dined at the Ledbury the night before, who also had a fresh strawberry tartlet, and the quality of the strawberries and the dessert itself didnt even compare with the Ledbury. Overally it was a really great and fun night. The atmosphere was casual but still intimate enough for a date or personal event. It is also fun to watch the kitchen at work. I wish Chef Issac was a little more personable and talked to us or some other tables though; but on the contrary to that, every dish we had was brought out to us by a kitchen staff and explained thoroughly. In addition the wine selection is extremely reasonable and the cocktails are amazing!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "X_ptBCkwNo8klmRTNLTrfQ",
        "caption": "Photo of The Clove Club - London, United Kingdom. The #TheFoodieFamily trips and food travels.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X_ptBCkwNo8klmRTNLTrfQ/o.jpg"
      },
      {
        "img_id": "T5Gi9XEbZzns0OPwYvgn4A",
        "caption": "Photo of The Clove Club - London, United Kingdom. The #TheFoodieFamily trips and food travels.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T5Gi9XEbZzns0OPwYvgn4A/o.jpg"
      },
      {
        "img_id": "j9c43XWvow8BIQoMuKxDSA",
        "caption": "Photo of The Clove Club - London, United Kingdom. The #TheFoodieFamily trips and food travels.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j9c43XWvow8BIQoMuKxDSA/o.jpg"
      }
    ],
    "user_id": "WtBfZpY5xW1Gji6x04Fdwg"
  },
  "bHWrjlPIaeae8Egh8PqvoA": {
    "date": "10/11/2016",
    "text": "Just OKA lot of fuss for nothing. Service was very sketchy, a little bit up themselves, lack of knowledge of the menu, food was very slow come out. Not going back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "797zJPOvn32SoigIM7VYgg"
  },
  "K3ZUSl1utMhwjzkk6e03ag": {
    "date": "7/28/2015",
    "text": "We arrived on a damp night in July, and sat in the bar, because the main room was booked. However, we were treated to the tasting menu, which we had hoped to taste, and amazed.  The wine list is an education and delicious.  Well done.  The food came out perfectly, and we were very entertained by the staff's coming and goings.  The location is not an easy one to get to, but worth the extra to get there.  We had brunch at Spring the end of the week, and discovered the manager at Clove is the wife of Clove Club's Manager.  Smart.  I hope we can get in again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rcjdrBcCyEIPspjT3rFKRQ"
  },
  "vxR628SIHKDDd6R3r48k9w": {
    "date": "5/14/2018",
    "text": "Had a wonderful meal here with my honey on our second night in London, visiting from Los Angeles. Was nice to be able to see the chefs in action in the main Dining Room. Good service in this Michelin starred restaurant. We had the full tasting menu which was £110 a person, plus the caviar supplement. They even surprised us with an extra dessert after telling them that it was our anniversary. Some of the dishes had flavors that I didn't love, and others had very good flavors, hence the 4 stars.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z6d34cWSRtFhinzxnGZFvg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z6d34cWSRtFhinzxnGZFvg/o.jpg"
      },
      {
        "img_id": "BayCW2OxOReNhHM4rsxSKQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BayCW2OxOReNhHM4rsxSKQ/o.jpg"
      },
      {
        "img_id": "BsV6300Ig7MtWF0MGL5BIQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BsV6300Ig7MtWF0MGL5BIQ/o.jpg"
      }
    ],
    "user_id": "eZiIXWdTgpurLj1Xkue8Lg"
  },
  "AFj1Jc3wGp6aKD_9g2pGqA": {
    "date": "12/23/2016",
    "text": "Happy and full - that was my experience at the Clove. For a Michelin star restaurant, I was ecstatic to have this be my last meal in London, enjoyed with some great friends. We booked the restaurant months in advance through their reservation system which required payment upfront. It was a little terrifying but there was no way we were going to miss this meal. We decided to go with the five course dinner menu at 65 pounds. I didn't expect five courses at a fancy restaurant to be filling but my stomach felt like it was going to explode by the third course. The restaurant had a very simplistic look to it. The service was top notch. The food was delicious! Quality and execution was spot on. We tried an assortment of things and it was all really well done. All the flavors worked together and everything on the plate had a purpose, even the smallest sauce on the side added to the dish. Their infamous fried chicken had great seasoning, with tender chicken on the inside, a good crunch on the outside. Their monkfish was deliciously soft. The potato soup was super creamy. A wonderful, fancy experience!",
    "rating": 5.0,
    "rated": {
      "useful": 12,
      "funny": 10,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "1qEb4mim_1hSSpP7S7SsAA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1qEb4mim_1hSSpP7S7SsAA/o.jpg"
      },
      {
        "img_id": "TK3ee03NT6H7bTSDbfMPVg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TK3ee03NT6H7bTSDbfMPVg/o.jpg"
      },
      {
        "img_id": "26PKVNAod_1lbuYmAp1NNg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/26PKVNAod_1lbuYmAp1NNg/o.jpg"
      }
    ],
    "user_id": "QZ3grLRAy7do7inT4OcltQ"
  },
  "besUobfqR6MAyQiG06yzwQ": {
    "date": "7/14/2018",
    "text": "Amazing meal and wine selection.   Service was fantastic too.   Truly great dining experience.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "m7SLLv96Q4379kdbP2IeyA"
  },
  "KeAyNruprllDLG25sXW90w": {
    "date": "7/8/2017",
    "text": "I am no culinary aficionado and don't eat at places like the Clove Club except for 'once in a lifetime/extremely special' events. But I do like food and I like good food even more. On our vacation through Europe, my wife and I had selected two high-end restaurants to eat at - one in Paris and the other being the Clove Club. The Paris one was highly rated with plenty of articles saying it was the hottest place in town. We'd left pretty disappointed and so walked into The Clove Club with low expectations. As you can see by my 5-star review, we were blown away.Walking in the door, I believe we were greeted by every member of the staff. There may have been a dishwasher that escaped us, but the committee was in full force. After being seated and getting our water, we were given options on beverages to get us started. I wish I remembered what we ordered, but both were non-alcoholic with mine being a sort of limeade/tea and my wife's being a smoked lemonade. After walking all day around London, they were both refreshing, with mine being quite delicious. We also chose to do the 'soft drink pairing' which was £30 per person (which I don't think was listed anywhere, but much cheaper than the other pairings offered).Before I start talking about the food itself, let me talk about the staff. We had no less than 6 different people that 'served' us throughout the evening. Each one was very friendly, but our main server - a petite Italian lady - was one of the best servers I've had anywhere. We were able to strike up small conversations with the staff throughout the evening and they were great at being just normal human beings.The food was a parade of individual delights. They say it's a 9-course tasting menu, but that doesn't count the \"selection of snacks to start\". I'll outline them individually, so if you don't want to have the surprise spoiled, skip to the end.-=[ Snacks ]=-A. Frozen gazpacho - Not the official name and there was more to it, but we kicked off the evening with a food slushee.  Round 1 and we already were impressed. The gazpacho was very flavorful and was balanced with a cream that I unfortunately don't really remember the flavor of.B. Crab tart with hollandaise sauce - I'm not a huge crab fan, but these were delicious.  Maybe the hollandaise and seasonings worked their magic on my tongue. Well balanced flavors and a perfect texture combination.C. Buttermilk Fried Chicken & Pine Salt (Fancy Chicken Nuggets) - Reading other reviews, people are knocking these bad boys. Ignore those food snobs - just because something categorically similar can be found at McDonald's doesn't mean they can't be enjoyed. And enjoy we did. These are not shredded chicken dunked in fry batter and then bathed in a vat of hot oil. You get a solid chunk of actual chicken flavored in a way that makes you feel like a kid again. And yes - they're as succulent as you could hope for.D.  Battered meat balls - I only vaguely remember these, but my wife said they were meat in a corn-dog style batter, in a spherical shape. Another twist on a childhood memory.-=[ Main Courses ]=-1. Hay smoked wild Scottish sea trout, jersey royal potato, and Sansho - Basically ground trout tartare in a cream sauce with straw fries for texture. I was a little nervous as it looked like raw fish.  I've had sashimi and lightly smoked salmon, but I'm not really big on it. Silly me. This was really good. The trout was flavorful, the creamy sauce appropriately rich, and the potato added a nice crunchy element.2. Raw Orkney scallop, hazelnut, clementine, and Manjimup truffle - This was my least favorite dish, but my wife's favorite. That said, I still enjoyed it. The slimy scallops dominated the texture, but that IS the nature of scallops. The fungi were pleasant and the overall flavor was still good. Scallop lovers won't be disappointed.3. Chilled soup of Courgette (zucchini), Chrysanthemum, and smoked ham - This was my wife's least favorite, though I really liked it. Again, she still enjoyed it though, it was just low on the ranking. You drink this like a tea. The presentation was striking and mine actually got prettier as I sipped it. (Who have I become that I call food pretty!??!)4. Baked Dover sole, green peppercorn hollandaise, and spinach - My biggest regret here is that the dish isn't served as a standalone meal, large enough to indulge in for an evening with extra to eat later. WOW. Simply delicious. Even the spinach was great.  :)5. Hot smoked lamb ribs, mint and seaweed jelly - My wife does not like lamb. Mark this as the first time she's liked it. The flavor was not pungent like lamb can sometimes be. I'd say it was comparable to some great Kansas City barbecue in texture.I'm getting a character limit warning on Yelp. The rest will be up to you to enjoy. I was simply so impressed that I wanted to share the entire experience. The Clove Club is a once-in-a-lifetime experience (for us) and worth the adventure.  Plan for 3 hours!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QPvSfCiKBKpZbnh6PAFmFg",
        "caption": "Photo of The Clove Club - London, United Kingdom. Hot Smoked Lamb Ribs, Mint, and Seaweed Jelly",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QPvSfCiKBKpZbnh6PAFmFg/o.jpg"
      },
      {
        "img_id": "wgCcLeBaXlvtVFuohAeJ5w",
        "caption": "Photo of The Clove Club - London, United Kingdom. Baked Dover Sole, Green Peppercorn Hollandaise, and Spinach",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wgCcLeBaXlvtVFuohAeJ5w/o.jpg"
      },
      {
        "img_id": "ejZYUxZTHzMYJIM7P6XGJw",
        "caption": "Photo of The Clove Club - London, United Kingdom. Raw Orkney Scallop, Hazelnut, Clementine, and Manjimup Truffle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ejZYUxZTHzMYJIM7P6XGJw/o.jpg"
      }
    ],
    "user_id": "sgkIikDZunIKUIcHUI-Qdg"
  },
  "rRP9k5Icd0KyHQry8Sv__w": {
    "date": "2/20/2017",
    "text": "Classy and fun establishment. Didn't leave with anything particular memorable that I was craving to come back for. The famous chicken was just okay.On the plus side they are friendly to line diners. Presentation was also generally well done.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vXrtDoLtt6UONqU69hx7EA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vXrtDoLtt6UONqU69hx7EA/o.jpg"
      },
      {
        "img_id": "CH0TJFVR8a4nkyFocsxYmQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CH0TJFVR8a4nkyFocsxYmQ/o.jpg"
      },
      {
        "img_id": "USO5leZsDEKKbh5tpWSLuA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/USO5leZsDEKKbh5tpWSLuA/o.jpg"
      }
    ],
    "user_id": "fitXjNnwVB_HzqaBSrIGXQ"
  },
  "7-jAmmIlhePkyenD4P20cQ": {
    "date": "7/14/2018",
    "text": "Amazing experience. The food was great. The wine was great and the service was a 10. Best restaurant I've been to in London. Would love to return next time I'm in the UK. Not a place to be noisy though.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQuQESqsCIRVa-7tGYYTNQ"
  },
  "AmrgpnivzjjDp6qz4XM6LA": {
    "date": "7/25/2017",
    "text": "While researching for a trip to London, I came across a list of The World's 50 Best Restaurants and saw that The Clove Club was ranked #26. Upon further investigation, I also found that it earned a michelin star and was ranked #1 in London. Needless to say, I was sold. I made a reservation for lunch and settled on the 9 course tasting  menu for £110. While I normally don't spend that much on a meal, I figured it would be worth it for the 26th best restaurant in the world. By the end I wished I had saved the money and put it towards some other part of our trip. We spent 3 hours here, which was a nice break from sight seeing, and while the staff here was very friendly and the services was great, the food didn't impress me like I hoped it would. Overall the flavors were not as unique and mind-blowing as I had been lead to believe based off of other reviews. While some dishes like the suckling pig belly and 100 day old Lincolnshire chicken were great, others were just OK or a miss. With a rating like #26 in the world, I expected each one great. In my opinion, try if you want to say you've been here, but otherwise save your money and use it elsewhere. BTW, anyone else wondering why specifically 100 days for the chicken? Would anyone really notice the difference if it were 101 or 102?",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5NXx2D5ORMHIROt6PjyYVg",
        "caption": "Photo of The Clove Club - London, United Kingdom. Some dishes from the 9 course tasting menu.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5NXx2D5ORMHIROt6PjyYVg/o.jpg"
      }
    ],
    "user_id": "0rUbcgT5ept0ICBkJSkIwg"
  },
  "1nfuArb4sBlMR9gRTJDF3g": {
    "date": "5/27/2017",
    "text": "Such a special meal at the Clove Club. We were a little bummed to only have the option of the bar seating (it's a long meal to enjoy perched on a backless stool), but it turned out to be a wonderful evening. The bar staff were super nice, very knowledgeable and made the experience that much more special. Custom cocktails were incredible, and it was fun to watch them work.The star of the show, however, are the many plates, from little bites to larger courses.  We loved everything. They really showcased the very essence of the main component of the dish: a beautiful chicken dish, a perfect langoustine dish in two parts, an incredible duck consomme...so much more. Each dish really highlighted the star ingredient beautifully. Thank you to everyone at the Clove Club for a very special meal!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qkVSiZRit66R9EQ6Ra_sQg"
  },
  "1vZrgcVdTNJ2_oewcubGNQ": {
    "date": "7/20/2016",
    "text": "Made reservations to Clove Club a few weeks prior to our trip to London. Reservations were fairly easy on their website, and what's best (or at least in my opinion) is that you can choose ahead of time what kind of dining experience you're looking to have: Just drinks, a la carte, tasting, etc. My fiancé and I chose the tasting menu, the only catch or plus (whichever way you see it) was you had to pay for your meal upon booking. To be honest it's the same as placing a deposit for your reservation. I don't know about you but, paying ahead of time instead of seeing a gi-normous dinner bill, psychologically hurts my funds a little less. But let's move on to the experience! We were running a little late (past 15 mins) to our reservation, so we had called ahead of time to let them know. (Their policy honors a reservation up to 15mins of the booking time). The person on the receiving end didn't seem to mind, and when we got there, we were immediately seated. The dining hall was modern and contemporary, and reflected their dishes like they said it would. The amuse bouche dishes was lighthearted and fun, but highly executed nothing short of what you should experience at such a high end restaurant. The mains were as good as the amuse bouche, obviously with more complexity, but just the same integrity. From the SCALLOPS, SWEETBREAD, and DUCK. How impressive is it to drink DUCK BROTH mixed with and a glug of 1908 bottle of Madeira wine? I wasn't expecting to order two different bottles of wine with dinner (white with the seafood, red with the duck and sweetbreads), which was money wisely spent than by the glass. The food was excellent, the suggested wines were just as great, and I truly enjoyed ever minute spent dining at the Clove Club. The experience, was just another round of sprinkles on my ice cream trip to London. The Clove Club in my opinion beats Estela (NYC) on the Top 50 Restaurants of the world list. Totally worth the value and the experience, no questions asked.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "3gpzfx_3T0d-DqEP5I3X6Q",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3gpzfx_3T0d-DqEP5I3X6Q/o.jpg"
      },
      {
        "img_id": "AkSL-yyBHrbCqnverxyYHA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AkSL-yyBHrbCqnverxyYHA/o.jpg"
      },
      {
        "img_id": "wNWsnyDEIgf2Iq_ZaLlE7Q",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wNWsnyDEIgf2Iq_ZaLlE7Q/o.jpg"
      }
    ],
    "user_id": "5PtkFEymTrtxdZ9Wys5s8g"
  },
  "slUjIVq9IP-FgcuV8U1b4w": {
    "date": "12/1/2017",
    "text": "Last night of our trip to London which included some good (Hardwood Arms, Lyles, Marcus, Nightjar), some meh (Ametsa, Dandeylyan), some awful (Greenhouse). Our expectations were ridiculously high and I left thoroughly pleased. I love the ambience, the quiet electricity in the room . The very open kitchen helps, and comfortable albeit slightly crowded seating. I like the lack of white table cloths; and I prefer a water bottle left on the table. The staff goes above and beyond to make you feel special; corny but true and really hard to pull off actually. Who Evers hiring here is doing an excellent job. Wine list is concise with many above average options for good prices. We enjoyed a Prager Riesling with a little age and a Cru Beaujolais with even a little more. And some Port and some Scotch. They poured a 1908 Madeira for one of the courses. It was exquisite.The food was memorable and sums up pretty much everything I love about the tasting menu format when it goes right. Mackerel, Sardines, the Pheasant consommé Madeira dish were my faves but it was all so good.This was top 3 for me up there with Commis and Meadowood. It may be the best meal I've ever had.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOKQlI8wYpkM_A1Y2VojXA"
  },
  "nsVMbUZLTzXVjTr2y45aAg": {
    "date": "6/8/2017",
    "text": "We were here before we had the Buttermilk Fried Chicken in IN SITU in San Francisco.  It was super good and would like to try more items in The Clove Club. Unfortunately, due to tight schedule, didn't get the chance to try their tasting menu. Therefore, we order what they have on the menu. Honestly, we were disappointed on the other items, except the the Buttermilk Fried Chicken. I am not sure about the tasting menu but we might be want to try the menu if we are in the area again.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "A5QwexpI_U5TOERV15zx4g",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A5QwexpI_U5TOERV15zx4g/o.jpg"
      },
      {
        "img_id": "Hg3v6YbDpYO7TAi5n27GGQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hg3v6YbDpYO7TAi5n27GGQ/o.jpg"
      },
      {
        "img_id": "mIsf0zXlL98pA6QS0RYumw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mIsf0zXlL98pA6QS0RYumw/o.jpg"
      }
    ],
    "user_id": "LlS-UqX9g3q11UwDdaKlRA"
  },
  "sC-ktYeUOMXbS2l49BYdjg": {
    "date": "3/30/2018",
    "text": "Such an amazing restaurant that serves very experimental dishes some of which are influenced by Asian food--more specifically Japanese. I had their 5 course dinner that came with 3 additional appetizers and 2 also additional sweets. Great portion. The restaurant managers and bartenders were so friendly that I felt truly welcomed and warm hearted. Definitely going back during my next visit to London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YM3_h82geNGgypAPTVDpaA"
  },
  "fmhh12x6B6IR-W-MSP5NPQ": {
    "date": "1/12/2017",
    "text": "A delicious meal with an exorbitant amount of food.  The five course tasting menu is such a great value at £65, though I checked recently and it seems they've hiked up the price to £75-still a steal in my opinion, for the top-notch service and food.  Five courses doesn't sound overly impressive compared to some other tasting menus you're likely to encounter but trust me, the kitchen makes sure you're well fed with a selection of amuse-bouches to begin and several dessert bites toward the end.  I wouldn't say service in restaurants is particularly noteworthy in the UK, but here they were extremely gracious and accommodating.  The set menu offered venison for it's main dish which I will eat but am not super keen on and the staff readily substituted mallard for the venison for me.  Thank you, Clove Club for bearing with me. To reiterate my point about the generous portions, I was so uncomfortably full by course 3 that I would have unbuttoned my jeans right in the middle of restaurant if it wasn't such a classy place (and if i had less dignity). I couldn't even bring myself to so much as lick one of the chocolate caramels they brought out at the end...and desserts are my jam. Long story short, come here for an impressive meal and be prepared to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kY5aHfA0k0BhvakKg076w"
  },
  "9P8jYlSu2hk-yiWgnLs6fA": {
    "date": "3/16/2017",
    "text": "Excellent.  We were able to book ahead without a deposit.  We did the larger menu and were so glad we did.  The service was perfect and you could watch everything be prepared.  It is often hard to find a delicious vegetarian tasting menu that isn't just a bunch of eggs or mushrooms and this had an excellent variety with lots of flavors.  I wish they had better cocktails but that was the only thing I was worried about.  The cheese was excellent as part of the dessert.  The full tasting menu took a little over 3 hours.  The price is great for the full menu and I will come back when back in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mSmR8zS7lmUy6gtEAXMKiQ"
  },
  "BIJvfbpCq7J0ozNBCbKlhQ": {
    "date": "3/5/2017",
    "text": "One of the best meals I had in London. I would highly recommend this place to anyone. The BBQ lamb rib was amazing and something I've never had before. Service was really good and food came out at a good pace.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MMqEYeKVR-xby4Hp54yX8Q",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MMqEYeKVR-xby4Hp54yX8Q/o.jpg"
      },
      {
        "img_id": "Bu8WYQRBgAZQDd5-nwszoQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bu8WYQRBgAZQDd5-nwszoQ/o.jpg"
      },
      {
        "img_id": "7R2Q_-4a5MwwmT80cWKsaA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7R2Q_-4a5MwwmT80cWKsaA/o.jpg"
      }
    ],
    "user_id": "oXEJ1gJTIrg4ebe39_ojNg"
  },
  "muz-E30Pe4nLCo9sIMLikA": {
    "date": "5/24/2016",
    "text": "Amazing. Just amazing.  I've spent my time in London sampling the restaurant scene, and the Clove Club is definitely my favorite meal to date.  Most restaurants I've been to have a mix of excellent dishes and good dishes, but everything I ordered here was fantastic.I ordered:- A non-alcoholic drink. I forget what it was called but it had nettle cordial- lovely- Buttermilk fried chicken with pine salt. A signature dish and for good reason- excellent- Scrambled gull's egg with a celery foam- seasonal and excellent- Pork belly dish- excellent- Warm blood orange with sheep's milk yogurt and a fennel granita- excellentButtermilk fried chicken: crispy, flavorful, served piping hot, unique with the pine salt, and tender and juicy chickenScrambled gull's egg with bacon and seaweed- Seasonal item and sustainably harvested. beautifully and creatively presented.  The seaweed was an appreciated acknowledgement that this is a sea bird and not a chicken egg.Pork belly- perfectly cooked. Rich but the fat was well cooked so as to maintain and a pleasant mouth feel.  Delicious.Warm blood orange dessert- Beautiful presenting, mix of colors and flavors. The fennel granita was an excellent complement to the orange and yogurt.Everything I ordered was absolutely delicious.  Make a reservation and come here.  It is definitely worth the price, and you won't regret it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XHKkj63W__cJP0l4Q0rERA",
        "caption": "Photo of The Clove Club - London, United Kingdom. Petits fours: salted caramel chocolate, peated barley muffin, candy filled with fernet branca and creme de menthe as a digestif.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XHKkj63W__cJP0l4Q0rERA/o.jpg"
      },
      {
        "img_id": "YdrmmrST2L0DzndGaP5dbg",
        "caption": "Photo of The Clove Club - London, United Kingdom. Warm blood orange with sheep's milk yogurt, fennel granita, and a milk crisp. Fantastic combination and oh so delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YdrmmrST2L0DzndGaP5dbg/o.jpg"
      },
      {
        "img_id": "bwgxCM2D7oQVB5HKo1iErQ",
        "caption": "Photo of The Clove Club - London, United Kingdom. Pork belly dish, fabulous!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bwgxCM2D7oQVB5HKo1iErQ/o.jpg"
      }
    ],
    "user_id": "FGPP7hzwQv5DO_g3aZZUFg"
  },
  "427VeuSqCewCNGXHWYkzTw": {
    "date": "11/7/2017",
    "text": "I usually don't post reviews but this place is over the top. First, I'll admit I'm not easy. I have a pretty high standard.  Have been to Eleven Madison and many others. This place is outstanding. The buttermilk chicken is incredible,  the prestige wine pairing well worth It. The atmosphere and excellent service is over the top. Just do It and don't think twice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YGGSN6d8HEIqkAZwHEK0Jg"
  },
  "e93vDzIEv4Z7JBqo-QqWHQ": {
    "date": "11/8/2017",
    "text": "Four stars for the staff and flavour of all the dishes. There was however bits of shell in our crab dish and the wine was pretty underwhelming for the prices. The service, presentation and vibe are phenomenal and they even gave us a dessert plate that said happy anniversary which was really nice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ZnthB4QTZG4oxsUeBZc8Q"
  },
  "o6NW8557af7nUHVlwT7CVw": {
    "date": "6/28/2016",
    "text": "Went here in a group of five and all had the tasting menu with the prestige paired wines. I thought the food was extremely good. I liked the way the chefs came out to tell you about the food, and the wine was just divine!I am a big fan of The Dairy/ The Manor in Clapham and I think this is very similar although i would say the Clapham restaurants are better value for what you get, albeit a more central London premium is to be expected.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "vnBSUhqdRrDV88gRsLQYIQ"
  },
  "P5ZIaWURej-dEcsFaApZgw": {
    "date": "11/16/2015",
    "text": "I arrived at The Clove Club super excited! This was booked way in advance - I think almost 3 months ago. The restaurant does one sitting only and I could see that the majority of diners were also going for the 10 course tasting menu. We arrived at 7pm and left at 11pm. Some might consider this slow, but I loved the relaxed and attentive atmosphere.The good:- Food was absolutely delish (it's all about the food afterall, right)- The snacks actually consisted of a trio of items which were exceptional- Served the right amount of food (didn't leave hungry)- Romantic and relaxed vibe great for couplesThe bad:- It took ages to check-in and collect coats as there was noone there- The 'grains grains grains' dessert was actually quite poor and both of us did not eat more than a bite, but no biggie seeing as it is a tasting menu afterall",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n1gP5KuEr9MNUoRH61Bsjg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n1gP5KuEr9MNUoRH61Bsjg/o.jpg"
      },
      {
        "img_id": "pBsZebOsxYbFsxH8ziQXdQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pBsZebOsxYbFsxH8ziQXdQ/o.jpg"
      },
      {
        "img_id": "M59gQJEi2sz9RPbG5vGSLw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M59gQJEi2sz9RPbG5vGSLw/o.jpg"
      }
    ],
    "user_id": "Ww5nUMSrT9yod-MvSesZzQ"
  },
  "0euhTBB-_JkRqTsUg31-Zw": {
    "date": "11/17/2018",
    "text": "Delicious British fine dining in a wonderfully casual setting!My friend and I did the full dinner prix fixe, and were delighted by every dish. While you don't get the crazy creativity of a Heston Blumenthal here at The Clove Club, what you do get are unbelievably fresh and well-paired flavors. For instance, I usually can't stand sardines. However, one of courses was a raw sardine, and it was absolutely delicious. Not even the faintest hint of fishiness to the flavor. Other standout dishes include the fried chicken (wow!) and the fresh scallops (wow wow!)Just as important, the staff here is fantastic - casual, but they clearly know their stuff. Dinner isn't cheap here, but if you can swing it, I'd highly recommend a visit!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j8klE-VaYju8r_VjFnoa_A",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j8klE-VaYju8r_VjFnoa_A/o.jpg"
      },
      {
        "img_id": "ZeSlCTYH1Fx7-IyymZQ1sQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZeSlCTYH1Fx7-IyymZQ1sQ/o.jpg"
      },
      {
        "img_id": "HcVJugeuEU-GGSuA5vb7eQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HcVJugeuEU-GGSuA5vb7eQ/o.jpg"
      }
    ],
    "user_id": "dohuRohZZKd5654iHk-gHQ"
  },
  "MvtckgE5d3ppBmYYFx25iA": {
    "date": "11/19/2018",
    "text": "Warm service but absolutely disappointing food Honestly this was one of the most underwhelming restaurant experiences of my life. They served me the following dishes before I told them I don't want any more food from the tasting menu I had already paid for in advance: 1. Crab tart (average)2. Smoked eel on cracker (dry and average) 3. Buttermilk fried chicken with pine salt (average) 4. Raw mackerel with smoked sauce and dashi broth (good)5. Smoked trout tartare with caviar and potato sauce (this potato soup will haunt me for a long time)6. Raw fish with horseradish on cracker with warm broth (good but the broth made it average) 7. Bread course sourdough with home made pancetta and coppa (average. Supermarkets in the south of Italy where I lived sold better coppa and pancetta also bread was average)8. Fish with smoked hazelnut foam and leeks (it tasted like bland hospital food and the leeks were raw)9. 100 day old farmed chicken - breast, thigh, crispy skin feet, smoked sausage (sausage was good but rest average and that crispy feet skin was so bad and lacked seasoning) At this point I decided I couldn't handle anymore food from their kitchen and left hungry (ate a wild boar burger at a bar nearby, dumbfounded and pondering how this place could possibly make the world's top 50 list)Ps- the FOH tried hard to salvage the situation - offered me complimentary sake (which I declined) and a whisky based cocktail that I accepted (and was delicious) but there was nothing they could do about the food which truly was subpar.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "105R7uT1U7Ei7rqDwk8dRw"
  },
  "kxsfRuZn7giSpTvc40NEuA": {
    "date": "10/9/2018",
    "text": "Last meal in London, and we saved the best for last! Love the simple decor and homey dining room. It only makes the food taste better...if that's even possible. They keep it simple with a prepaid tasting menu, and you can choose to add wine pairings if you want. They also have a tea pairing, which is really cool, especially for those who don't drink. Dinner starts with a tiny Bobby Bean Tartlette. I swear, London has the best green beans in the world, and it only gets better when you add fennel and lemon verbena mousse.A Crab Tart comes next. Delicious and a great presentation.A basket of Buttermilk Fried Chicken, buried in pine branches, sprinkled with pine salt. Tastes like Christmas. A gorgeous dish of tomato, nectarine, ham jelly is next. It looks like a garden and tastes like Versailles. They say that Scotland had an exceptional crop of Cep Mushrooms this season and it shows. They're just shaved and raw, and wow, I've never had a mushroom taste so much like a mushroom!Time to swim with the fishes. The Dorset Clams are awesome and then there's a meaty Sardine Sashimi with an awesome-sauce sipping broth. Scallops stuffed with nori are so tender! The crab broth adds some brine to them. The MEATS! The Aged Loin of Pork is a like a cross between ham and bacon with the texture of a very tender steak. And I love the breast of Grouse. It's like a duck but lighter, and I love the berry sauce it comes with. Dessert starts unexpectedly with Szechuan Pepper Mousse, and I'm so blown away by the surprise pepper ice cream at the core.Potato Jam resembles the inside of a French fry, and a slurry of potato mousse carries its sugar well. I didn't think this could be a dessert, but it's  kinda perfect with caramel ice cream.A flight of house desserts, and the meal comes to an end. Profiteroles and truffles are predictable, but then they bring on these jellies that are based on a favorite drink of Fernet and Creme de Menthe. It's like a soft, enjoyable punch in the mouth. Top-notch ingredients, great creativity and presentation. Why does Clove Club only have one Michelin star? It deserves two!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "DMdk_AUkXqgVSwpmIn3mTw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DMdk_AUkXqgVSwpmIn3mTw/o.jpg"
      },
      {
        "img_id": "IGZeE-fKGc5XkRdd7roDLQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IGZeE-fKGc5XkRdd7roDLQ/o.jpg"
      },
      {
        "img_id": "mQhBO9zjwiSxFpcgQlbHpg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mQhBO9zjwiSxFpcgQlbHpg/o.jpg"
      }
    ],
    "user_id": "p0UbZ13W0IxJUy-hDB_OqA"
  },
  "TuB7kgzd4Vi_zUe0Eeor5Q": {
    "date": "12/10/2017",
    "text": "Raw Orkney Scallops, scallops, scallops!! More on that later...We took a couple of friends visiting from Texas for a surprise Birthday / Anniversary lunch. After almost getting lost (walking into the Town Hall building) we found the proper door - wasn't hard to miss with a brass Clove Club sign above it. The restaurant is amazing - nestled into the old Shoreditch Town hall. We were seated in the front - amazing ambiance and light from the big windows. There is also a more closed off area in the back with view of the kitchen.We wen't with the lunch tasting menu - washed down with bottles of our favorite Tempier Rose.All the dishes were very memorable and well put together. Especially good:- Smoked Trout cigars. Beautifully delicate and smokey taste.- Pine salt buttermilk fried chicken. AMAZING! It came in a basket of pine needles. The chicken was incredibly succulent and moist.- Charred mackerel - I believe they used a blow torch to char the outside. Very delicate and flavorful. - Amazing pork (I don't fully recall the preparation).The highlight dish.. Raw Orkney scallops. These were covered in generous truffle shavings and a thick inky sauce. To die for! We had a similar dish at another Michelin restaurant the next day with a similar dish and it didn't even come close! The scallops just melted in the mouth. More please!!! Having planned ahead - the restaurant surprised our guests with hand written Birthday / Congratulations cards and Happy Birthday candles. Nice touch! The meal ended with a selection of little chocolates, cakes and nibbles - beautifully presented.Cannot wait to get back here for dinner!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Pjyux-39tfNHfW_Fk8URMw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Pjyux-39tfNHfW_Fk8URMw/o.jpg"
      },
      {
        "img_id": "aDE3uTeLTts2mdnURD5Iqw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aDE3uTeLTts2mdnURD5Iqw/o.jpg"
      },
      {
        "img_id": "vQwNOi0A6vraxQkpycdiDw",
        "caption": "Photo of The Clove Club - London, United Kingdom. Raw Orkney Scallop with tons of shaved truffle, mushrooms and ink",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vQwNOi0A6vraxQkpycdiDw/o.jpg"
      }
    ],
    "user_id": "N4Nu4txLSGmT8pU1XPwlLA"
  },
  "WEGw7az3fV1Qu12W3JTbgw": {
    "date": "2/19/2018",
    "text": "I've eaten here twice and both times were fantastic. It's a Prix fixe that's 5 course for 75 quid or 115 for the proper one. Food is inventive with each course better than the last. Friendly staff, cool old building, and you leave feeling happy and full.Go here. Trust me.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J_2ZsNfWbuaW8oRBGRmOQg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J_2ZsNfWbuaW8oRBGRmOQg/o.jpg"
      },
      {
        "img_id": "RujqCPhcGR_LUj9fYiKnKg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RujqCPhcGR_LUj9fYiKnKg/o.jpg"
      },
      {
        "img_id": "KB-hxsruvmK2JR3YBqAkBA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KB-hxsruvmK2JR3YBqAkBA/o.jpg"
      }
    ],
    "user_id": "j-NTYILkPdeydjz139viMA"
  },
  "MhNJ6Qi4BmaF6GPtdACyjA": {
    "date": "9/7/2018",
    "text": "Had an amazing lunch here. Service was excellent !!! Everyone was friendly and on point! The food was to die for !!!!! Highly recommend, a high light of our trip. At the end the chef joined us for some pictures and took the time to speak with us places he would recommend. Added such a nice touch. Overall I felt like a princess.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-6XTIZgQ1Neunn1vZpe6Lw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-6XTIZgQ1Neunn1vZpe6Lw/o.jpg"
      },
      {
        "img_id": "cZHBit4-Naw2JFXPMpzNMg",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cZHBit4-Naw2JFXPMpzNMg/o.jpg"
      },
      {
        "img_id": "SJ-QVOL8EyylhY4mmjkj1w",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SJ-QVOL8EyylhY4mmjkj1w/o.jpg"
      }
    ],
    "user_id": "2R6Ix9vg8mpPm-p871e71Q"
  },
  "xnN1raZkattS3fQ2LLmkUQ": {
    "date": "10/26/2017",
    "text": "WOW. Whatever expectations I had about eating at Clove Club were obliterated and exceeded. My \"experience\" (because \"meal\" is too much of an understatement) at Clove Club was sublime: the food, people, staff, decor, and wine all meld together perfectly to provide a truly memorable and delightful event.It's not hard to speak in such hyperbolic terms about an establishment that manages to dole out a culinary adventure without the fuss. The interaction with the staff and the setup of the space fosters a feeling of dining at a friend's place rather than at a restaurant. In terms of the food, I can't pick a specific favorite because I was too busy trying to roll my eyeballs back to the front after each bite...each and every item was superb and the wine pairing took things to another level.Your pocketbook will certainly hurt, but I would skip dining out for a week to have even just one course here. I am fortunate to have a kid brother who treated me to a visit, and it will certainly go down as one of the best moments in 37 years of life.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RNh54Ioy9IKQ8p8cs89Zpw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RNh54Ioy9IKQ8p8cs89Zpw/o.jpg"
      },
      {
        "img_id": "wBVm0bw1b_VnwABm5uAw8w",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wBVm0bw1b_VnwABm5uAw8w/o.jpg"
      },
      {
        "img_id": "vB6kq0IiNMaXzHEdzQSGJA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vB6kq0IiNMaXzHEdzQSGJA/o.jpg"
      }
    ],
    "user_id": "GsxMieTzgHE7BCk_Lm5OCA"
  },
  "V7kXJ-HoSHmgvCEv4uqWMQ": {
    "date": "2/20/2018",
    "text": "Beautiful dinner and a flawless tasting menu. The cocktails and service were on point. The food was simple yet inventive, and most importantly, delicious! The snacks at the beginning of the meal are absolutely perfect (crab tart, buttermilk fried chicken, haggis balls). The rest of the meal flowed beautifully and the dessert (tarte tatin) was out of this world. The wine pairings were also great, as was the coffee. The ambiance was not fussy at all. This restaurant needs to be on everyone's list for top London dining.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "YieJJ3RvUbRc-ob-xqIedw",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YieJJ3RvUbRc-ob-xqIedw/o.jpg"
      }
    ],
    "user_id": "6pDCqee5g6jFB402L15kmg"
  },
  "Eq9l4h1FvXhaUSa8z5JTGA": {
    "date": "10/23/2018",
    "text": "All I can say is it's the best fried chicken you will find outside the Southern United States. The atmosphere is beautifully done. The menu is modern and unique, but not fussy. The service delightful and the staff is knowledgeable and gives great recommendations.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9v3WdIRtkpF097FOEotgA"
  },
  "-YdlK_H97q6L0X4btN3h8A": {
    "date": "1/4/2018",
    "text": "At Clove Club, I had the best meal I've ever had. It was genuinely and legit faultless. Everything was perfect - the food, the drinks, the ambiance and the overall experience. I was sat at the bar for my 5 course lunch. I had the company of Rob the barman, who is a top guy - even giving me recommendations for his fave restaurants for later that evening. And he was my geographical hero, giving me directions to Moorgate (which was only down the road as it goes). He explained each course and was chatty enough without being overbearing. Service was quick and efficient. The drinks he made were stunning - the sweetdram rum and clementine soda aperitif was sweet but refreshing and the railway sangaree cocktail was potent and delicious - the addition of porter to an otherwise sweet cocktail was inspired!The food was exceptional - the tasting menu consisted of snacks (spider crab with brown hollandaise, buttermilk chicken, haggis ball), tartare of trout, sea bass, roast fallow deer, burnt clementine granita and a warm apple tart tatin, plus further sweet snacks at the end (mini apple muffin, salted chocolate and a very boozy and potent ball of deliciousness!).Every course was spot on and I wouldn't have changed a thing - quality ingredients, cooked and presented to perfection.I can't recommend this place highly enough. A worthy entrant to the worlds top 50 restaurants. If I could give it more than 5 stars, I absolutely would",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jcMnt62krN3-3as96vxjjg",
        "caption": "Photo of The Clove Club - London, United Kingdom. Tartare of hay smoked trout, pink fir potato & sansho...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jcMnt62krN3-3as96vxjjg/o.jpg"
      },
      {
        "img_id": "cmW8--vPwmUdJj9U76aTug",
        "caption": "Photo of The Clove Club - London, United Kingdom. Second and third snacks - buttermilk chicken & haggis ball...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cmW8--vPwmUdJj9U76aTug/o.jpg"
      },
      {
        "img_id": "5YWIae8aShVjbDp7jwl8xA",
        "caption": "Photo of The Clove Club - London, United Kingdom. First snack - spider crab, Brown hollandaise...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5YWIae8aShVjbDp7jwl8xA/o.jpg"
      }
    ],
    "user_id": "ZpMiutGgkr2VIb44Fmd4cQ"
  },
  "u6QUNvbkWlqt6Mu43f4LqA": {
    "date": "6/13/2017",
    "text": "Dinner at The Clove Club was full of culinary surprises. Tasting the 11 courses menu were liked pulling out goodies from Doraemon's magic pocket one by one, you could not really tell how each dish will taste ultimately until you put it in your mouth and closed you eyes. The mixture of flavors exploded in your month and your eyes will lift up in awe. It was that good.My eyes got so widely opened while having the course of \"Duck, Morel & Ginger Consommé and Hundred Year Old Madeira\" that I had a hard time trying to blink. It was so smooth and comforting, amazing!! The smoked lamb ribs were so delicious and Gods know the Brits can really cook lamb.Just a friendly reminder to bring an absolutely empty stomach for the 11 courses tasting menu, it will be such a waste if you were too full to enjoy every dish on their menu.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hn99heyhkakM1s6CF1RVhA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hn99heyhkakM1s6CF1RVhA/o.jpg"
      },
      {
        "img_id": "Du5d2HWmLtSzAjUHwEfUkQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Du5d2HWmLtSzAjUHwEfUkQ/o.jpg"
      },
      {
        "img_id": "CbONNutjYjz6orTlae66XA",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CbONNutjYjz6orTlae66XA/o.jpg"
      }
    ],
    "user_id": "V2bYfc9d8wEv39Wl94nHgA"
  },
  "xCTFGiMuIgrDo20K3LxQAQ": {
    "date": "2/4/2018",
    "text": "Interesting, tasty dishes with very good service.We had a reservation for lunch on a Friday, and the room was moderately full throughout the meal. We opted for the tasting menu, and all of the dishes were interesting and generally very tasty. The proteins (seafood, meats) were generally very tasty, particularly the seafood, especially the scallops and the mackerel. The service was extremely attentive and helpful throughout, and it's a nice, relaxing environment for a meal in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooBKO0v4P-hLDn1Yg607Xg"
  },
  "x3d8g-N4JZz_bqSGXNrVow": {
    "date": "9/27/2018",
    "text": "Fantastic food. Outstanding is the tea pairing which can be ordered to the menu. If you're really interested in tea. The evening can turn easily into an very rich and inspirational journey to taste tea like you never have experienced before.The service is very friendly and thoughtful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKpuWQ0KZ8088jHNALpCVA"
  },
  "7Ymujp5coqApIUKGDqbSVA": {
    "date": "11/29/2017",
    "text": "#26 ranked restaurant in the world because of the orkan scallop dish.  I wanted to get this dish a la carte, but they wouldn't let me.  It was either the 5 course abridged meal with the option of adding the scallop dish for an additional fee (so really the same price as the 7 course) or the full 7 course meal (the only option with the orkan scallop).  Service was impeccable.  Orkan scallop dish was the highlight with black truffle puree and topped with local mushroom slices.  They also served us local crab in a crispy fried wonton like shell and on a bed of salt in the body of the crab which was impressive.  I didn't care much for the clementine granita on ice cream served in a burnt clementine shell as one of the desserts.  I kept accidentally scraping the burnt shell which left a bitter taste in my mouth.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PIKQw-8PtmywqV2bDb78Ew"
  },
  "WwMvZyVIN_cWJuWDBzlc0A": {
    "date": "5/25/2017",
    "text": "Have a taste of the most glorified Chicken McNuggets at The Clove Club. These bad boys are everything you could possibly dream of in a chicken nugget - the meat is overflowing with juices, the skin is perfectly crispy, all served piping hot. A dash of pine salt is finally sprinkled on top, which added a unique twist to the flavor. Get your camera ready because this dish is also totally Instagram worthy.Sorry, Mickey D's.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rNPqvegdfVE2lYAlNiCQ9w",
        "caption": "Photo of The Clove Club - London, United Kingdom. Buttermilk Fried Chicken & Pine Salt (7.20)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rNPqvegdfVE2lYAlNiCQ9w/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "P4_1RhSvTI1go5GqUqx8Nw": {
    "date": "5/2/2017",
    "text": "I knew I was going to love The Clove Club when I took a look at the cocktail menu and they had a drink called \"Powys and Gwent.\" Not being native to the UK I assumed that Gwent was a reference to the video game The Witcher.  Any place that can combine video games and artisan cocktails is ok in my book.  When I inquired about the name the bar tender was kind enough to stop by our table, discuss The Witcher, and then let me know that Gwent is actually the name of a kingdom in Wales.  Tasty and educational!In addition to cleverly named cocktails there are many reasons why I absolutely loved The Clove Club.  The menu is fascinating, delicious, and unique, the staff warm and charming, and the overall vibe of the place is of people really enjoying themselves (both staff and patrons).The tasting menu was a delight (and they only do a tasting menu, so not much choice there unless you opt for the vegetarian menu). Pushing some interesting envelopes of native British ingredients and flavors.  Interesting that for a cuisine that is almost devoid of spice the Chef is able to provide such a rich and flavor packed experience.The array of little bites to start were all wonderful.  I particularly enjoyed the Crab Tart & Brown Crab Hollandaise.  Even the Haggis Bun was yummy, and I am not a big Haggis guy.  I do have to point out for all the folks who have raved about the Fried Chicken that it is indeed good, but I recommend you try the Fried Chicken at Roister (in Chicago) before declaring it the best.The menu was a very interesting journey through 9 courses, which resulted in a very satisfying evening.  A few stand outs for me were the Spring Herb and Smoked Herring Broth which was deceptively rich with wonderful, velvety herbal overtones with an accent of Herring. Not at all what I expected.  Grilled Pollock, Grelot Onion, Cinnamon, and Curry Leaf was wonderfully subtle and the addition of Cinnamon Salt which you add yourself had a huge and very delicious impact on the dish.  Hot Smoked Lamb Ribs were absolutely delicious and a bit of a revelation (I've eaten many ribs, but never lamb).  The only dish that wasn't a complete winner was the 100 Day Old Lincolnshire Chicken - it was a bit dull compared to everything else.However, two of the dishes were so good and surprising they almost caused my head to explode.  Duck, Morel & Ginger Consomme and Hundred Year Old Madeira is ridiculously deep and layered and is a umami bomb.  The presentation of the dish only heightens the mind blowing first sip of this.  And then for desert was Wild Fennel Granita, Ewe's Milk Mousse and Warm Blood Orange.  The granita is amazing - bright green and pleasantly herbal without being sweet.  But the entire dish is brought together by the warm orange.  I was shocked at the huge difference made by having it warm.  Both of these dishes were genius.Service was very good and friendly.  It is totally in keeping with the character of the place.  Our staff were all clearly very happy there and described the restaurant in terms you usually here about a family.  It is clearly a unique place.  Our wait team was from many different countries in the EU, I wonder what happens to a place like this as Brexit takes hold.  The Clove Club seems to be a shining example of the power of the open model, so hopefully nothing gets lost.  I must also give extra special props for Dr Henderson's Bon Bon, which was one of the small bites presented at the end of the meal.  It is a genius way to end the meal - not sure who came up with this, but it is stunning.  The Bon Bon is a small drop shaped bite- think an M&M - which is filled with a mixture of Crème de Menthe and Fernet Branca, per Dr Henderson's old hangover cure (based on the brief explanation which was provided with the Bon Bon).  Not sure if the story was true but this bite perfectly wrapped up the meal - bravo.All in all this was a lovely evening and one of the most interesting and fun meals I've had in ages.  While this is clearly fine dining there is not an ounce of stuffiness to the experience.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D3hDBeM4aSG4Cd23pUqNhQ",
        "caption": "Photo of The Clove Club - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D3hDBeM4aSG4Cd23pUqNhQ/o.jpg"
      },
      {
        "img_id": "KTuRfNEeir4K3D5uwYl24g",
        "caption": "Photo of The Clove Club - London, United Kingdom. Haggis Buns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KTuRfNEeir4K3D5uwYl24g/o.jpg"
      }
    ],
    "user_id": "J8mFTJfBBBaShBX1WV30hA"
  },
  "8oe_sqFdOkH7UZEtUC6vZQ": {
    "date": "9/27/2018",
    "text": "The tasting menu is incredibly awesome and even my daughter who is allergic to nuts can enjoy the menu without any issues. They listen and handle it with care and heart.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_nAo2SXoxdfo_RMvvBZYw"
  },
  "kaHuQD1FCmaTcXP4BshD-Q": {
    "date": "4/20/2017",
    "text": "The Clove Club was our first stop in London, and it certainly didn't disappoint! We ordered the full lunch tasting menu (which is the same as the dinner one), and enjoyed every dish except for 3-4.Some of the highlights from the meal were there the Buttermilk Fried Chicken, Grilled Red Mullet, and the Burnt Clementine Sorbet dessert. The Clove Club's fried chicken beat any fried chicken I've had in the states - it was so impossibly moist that I almost want to label it \"juicy\"! The Red Mullet surprised me because I typically find fish dishes slightly bland, but this one had a ton of spice and flavor. And the clementine dessert was one of the best ends to a meal - slightly sweet but-oh-so satisfying. The dishes that we didn't enjoy as much were the Raw Scallop with Truffle, Chicken with Morels, and the Broth of Smoked Herring. Instead of the typical shaved truffles you would get on a dish, the scallop course came with chopped truffle pieces (hard to fully taste in our opinion), and we felt like that raw scallops and truffle was a strange combination. The chicken dish, while well-cooked, felt like it didn't belong on an expensive tasting menu, and the herring broth was quite forgettable. Overall, we felt our meal was enjoyable, but didn't top the list of our favorite tasting menus. Given that we weren't fans of about a third of the courses, we probably wouldn't come back the next time we're in London, but I would definitely still recommend this place for locals who live in the area!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4Hz80w784YZMi-yk29psAg",
        "caption": "Photo of The Clove Club - London, United Kingdom. 100 Day Old Lincolnshire Chicken, Morels, Broad Bean and Ramson",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4Hz80w784YZMi-yk29psAg/o.jpg"
      },
      {
        "img_id": "DAWzo3Ud60MTPBBRuRmJPg",
        "caption": "Photo of The Clove Club - London, United Kingdom. Duck, Morel & Ginger Consomme and Hundred Year Old Madeira",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DAWzo3Ud60MTPBBRuRmJPg/o.jpg"
      },
      {
        "img_id": "HQmK8lw2uDovLrzZNdlGPw",
        "caption": "Photo of The Clove Club - London, United Kingdom. Raw Orkney Scallop, Hazelnut, Brown Butter and Perigord Truffle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HQmK8lw2uDovLrzZNdlGPw/o.jpg"
      }
    ],
    "user_id": "ySl_GUTqkjqfhK8_VbyIMg"
  },
  "tjFcY5PzJ7cbXFP5Qs-zKA": {
    "date": "11/28/2017",
    "text": "My second time here. First time I had the abridged tasting menu, this time I went with the full tasting menu which took about 3 hours. What a difference! I highly recommend just ordering the full tasting menu experience. Dishes seem very complimentary. One of our party got the optional dish of a risotto with Alba White Truffle which was delicious.The Raw Orkney Scallop was definitely the highlight of the menu.Great service, servers happy to answer questions about each dish.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9rkVoNB92HR_bFOe6MFTQ"
  },
  "-NUK2OpYtMd10pQpZ9fgMw": {
    "date": "4/20/2017",
    "text": "This review is only on the bar area.I was happy to be seated right away on a Friday night. The atmosphere was calm. I didn't find any cocktails on the drink menu that appealed to me which was kind of a bummer.I read great reviews about their buttermilk fried chicken but compared to the US I think it fell flat. It may just be a cultural difference. I didn't like the cut of meat they used and felt that there was way too much breading. I liked the pine bowl presentation.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CofXcY_ssp0g338qeIVjaA",
        "caption": "Photo of The Clove Club - London, United Kingdom. Buttermilk fried chicken - ok",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CofXcY_ssp0g338qeIVjaA/o.jpg"
      }
    ],
    "user_id": "k97c4eriYUeMG_cGw8rYLQ"
  }
}