{
  "Ws9YYhqfHPp-d2W8U5ocEA": {
    "date": "2/14/2015",
    "text": "If you are a big fan of your chops, whether it is beef, pork or lamb than Blacklock might just be the place. The restaurant is all about chops which can be order in a single portion or in a stack.If you want to try all the chops then the All In can be a good choice, which is available for a minimum of two people. The meal include starting with crisp which you get a choice of flavours (Cheese and Pickle, Filthy Ham, Egg and Anchovy). This is not crisps like we all know, but similar to crackers with different toppings - like canapés. Each crisps has it's own unique flavours, I don't think i could pick out one as my favourite. However I thought the cheese and pickle was great appetiser to start a meal. The Anchovy will definitely won't be those who not fan of the fishy taste of anchovy. Following from the crisps was the main stars - the chops and our choice of side. As we ordered three All In, we tried the ash roasted sweet potato, heritage carrots & meat radish and charred courgettes, chicory and stilton. My favourite was the sweet potatoes, which was sweet and soft.  It complimented well with the chops. For some thing that will help open appetite with all the meat would be the heritage carrots & meat radish.The meat of the evening has to be the lamb chops. I was less keen on the pork belly as it was really fatty.  I could hardly see any meat but just fat. The beef short ribs was nice and do not mind it is pink but preferred it was more cook, instead I felt it was too rare for me. I actually felt beef short ribs is not suited to be rare. The pork chop was another favourite that evening after the lamb chops.Overall being the first opening day the  food was okay, service was good and a nice rustic concept.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQJp6mwCMRCBLXDsF_cGAQ"
  },
  "HWPvFbYtIVBfjASyokeIkg": {
    "date": "3/6/2015",
    "text": "Mama, can I have some chops? Chops you shall have dear, for here are all the chops you can ever hope to order. Can't decide? Then go for the All in, which includes all the chops available, there were two different types of lamb chops, a beef chop and a pork chop to brighten up your day here.As my party went during the pre launch, understandably the queues were superlong, the customers were super demanding, and the staff were all run off their feet! The service was a tad slow (especially drinks!) but we can't blame them as there is only one poor lady making the concoctions of cocktails (super super alcoholic btw!) and then not enough staff to run around collecting orders, cleaning tables, dishing out chops etc. The pork chop was also slightly raw for 2 of my party but they changed it for them and since then more of my friends have gone and the issue seems to have been resolved.The starters (this reminds me of Ritz biscuits, you're not really getting crisps) were interesting but not something I would come here for specifically. The other sides we ordered apart from sweet potato were unspectacular. The drinks were also very dull looking and tasting.Best value order: All in, plus sweet potato sides. The breads that soaked in the juices of the chops were oh so amazing. You can choose the chops in your all in if they have enough of those chops left.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qhJEA-T_q-0qp-0v0_81Ew"
  },
  "B4CTocwIuxmYuXSE4kGqRQ": {
    "date": "7/17/2015",
    "text": "We went for my Birthday meal that my gf had organised & the guys had been really helpful at organising it. Food was amazing, had the 'All In' for £20 and got all the meats a side each to share and a starter each. Cocktails were great too and reasonably priced. Had the spiked lemonade and gf had Aperol negroni.Top night and top service!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0BZhOPNe76MvHuy5Q2K53g"
  },
  "H3qL4tw9FAL43lCfAlTeug": {
    "date": "3/5/2015",
    "text": "You need to love your meat to go to this place. They're all about chops. Beef, lamb, pork - open up because they're coming home. I have to say, on my first trip I genuinely enjoyed Blacklock. The service was fantastic, courteous and welcoming. The vibe is rustic and informal. The food itself isn't polished but it's big and brash and demands attention. The meat is properly charred and cooked to a perfect rare texture. The flatbread is smoky and crisp and forms the perfect counterpoint to the soft, carnivorous mountain. Most surprising is the veg - whether it's the courgettes or the kale it's fresh but cooked and salted aggressively in way that says buckle up, little lady, it's getting heavy tonight. Lastly the cheesecake. Sweet Lord. Scooped out of a communal pan it's light and airy - top that with fresh rhubarb and you're in heaven... Now if only they served coffee!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LvXffiBKA1pOaN4R_bpGMA"
  },
  "QvJhOyLMaWWR354PFa6HEg": {
    "date": "8/7/2015",
    "text": "I came here on their soft launch week. We ended up going for their selection plate to try it all. You get nearly one of every chop and also some 'crisps' which are like mini appetisers with different flavour combos. All the chops were perfectly cooked and had so much flavour. The beef short rib just melted in your mouth and was so creamy, but surprisingly the pork chop was my favourite. For all of this it's only £20 which is ridiculously cheap. To top it of, all the cocktails are £5, I would even push it towards the best Old Fashioned I have ever had. Great concept, a must try and I will be coming back as I could see this becoming one of my regulars. (Visit - 12/02/2015 Lunch)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3QkozspSmuLnqHf6ZyFsg"
  },
  "6IyyooXXkVypKYmno5zOnA": {
    "date": "8/12/2015",
    "text": "I'm going to start with my conclusion...they were having a bad night. I might come back as so many before me rate this place but I wasn't impressed. Though the chops are amazing.So now for the story. We all sat down and settled in for what I thought was going to be A-MAZing. And the we waited and waited and waited for what must've been a good 20mins before we were asked for our drink order. Then we waited and waited and waited for the drinks to arrive. Just as our drinks arrived the waitress dropped a fairly full tray of drinks on the floor. To be fair to her she did a damn good job of ensuring none of the customers got hit too badly. And amazingly the replacement drinks came out very soon after.So on to the food. The meat - lamb, pork & beef - all juicy and cooked to perfection. If this was all I judged on I would give them 5 stars. Sides were all a little underwhelming. The portions were small (particularly in comparison to the amount of meat on the table) and none of them made my tastebuds pop. The cheesecake dessert brought it all back for them as it was creamy and the right amount of sweetness. The biscuit base was a little weird but overall a nice end.Now back to the service, the waiter presenting the food was very good, gave us a few top tips (like leave the bread to soak up the meat juice). The waitress who was having a bad night only got worse and when asked if we could get more of a particular side I almost thought I was back at school with the way she snapped at us.So not the amazing meal I was hoping for but still good. And like I said, probably just a bad night.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_J_bJ6wAS0ejMxFa2RJLw"
  },
  "B-lArRZHe3z5zsZcHiHoiw": {
    "date": "8/21/2015",
    "text": "We had a taste of all the chops that were on offer on the night, the weak link were the pork chops, they lacked moistness and they weren't strong enough on their own without any sauces or garnishes. Their clear winner has to be the beef short ribs, served medium rare, very moist, having a great depth of richness to them. Also a special shout to the very good value cocktails(£5 each), my gimlet was nicely mixed with a good balance of bitterness and sweetness, and judging from how the bartender was making an old fashioned, he knows his stuff.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "Q-ol6uEy6tyAVZt5xOV9Ww": {
    "date": "8/26/2015",
    "text": "YOU HAVE TO GO HERE IT CHANGED MY LIFE. The meat is so tender and flavorful. It is quite expensive but it's worth every penny",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HJM8WdfCme5TTAuyCm7v7A",
        "caption": "Photo of Blacklock - London, United Kingdom. Apps",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HJM8WdfCme5TTAuyCm7v7A/o.jpg"
      },
      {
        "img_id": "zKfdivgy3_wZvyrjOP9Plg",
        "caption": "Photo of Blacklock - London, United Kingdom. Lamb chops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zKfdivgy3_wZvyrjOP9Plg/o.jpg"
      }
    ],
    "user_id": "yUgH-UsvllpVJDJ-L-4m6A"
  },
  "lBQ_R11oZ_E14YpI7s2wnQ": {
    "date": "8/7/2016",
    "text": "Do not over think the Sunday Roast. Blacklock is the solution. Attentive and congenial staff bring the best plate of food I have had in London in two weeks. I was advised to put all of my Sunday Roast ingredients into the bread for a 'British taco', don't be shy with the gravy. Round out the meal with an Old Fashioned and chill out to the groovy mix of tunes pumping. Not to be missed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3S8Pxj_8K21_MvmWuMQWPg"
  },
  "CsizvzD0DH7FOY-XPk-F8A": {
    "date": "3/11/2015",
    "text": "When I heard they do £5 cocktails I was all for it! Sadly, I didn't love the rest of the experience. Once seated at our table, it took about 15 minutes for someone to come over to take our order... only for them to realise we'd not yet got menus. Once we had menus in hand we picked out what we wanted, ordered, and the food came pretty quickly. At £4 per chop the portions felt a bit small (I ordered 3 and could have done with more - and I never say that about meat!) and my friend & I both found them too salty and overly seasoned. As for the sides, the flatbread was *delicious* and the kale and parmesan salad OK, but still small portions. We did get to eat in peace, however, though we did have to flag someone down to bring the bill. (And were never asked about desserts or another round of drinks.) The total was just shy of £50 for 3 drinks, 6 chops and 2 sides. I'd be a bit annoyed that we spent so much and left wanting for more, but at least the drinks were cheap! Maybe next time we'll have to get the 'all in'. As for the atmosphere, it was pretty busy, dark and super loud. My friend and I sat next to each other for dinner and still had trouble hearing each other. I won't be rushing back for dinner here, but would consider it for a pre-night out snack.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3D1QP2MNjRaWXZL-J2aDrg"
  },
  "YOAWI_GoHqqe8UvVKFBjWQ": {
    "date": "4/12/2015",
    "text": "Incredibly friendly front of house staff that were very professional and relaxed. A very welcoming place with great wait staff, great product and somewhere to relax, have a drink and eat decent good value and quality food. My only two criticisms were that the portions are a bit too small (except the pud!) and it's a little too dark.  However for the money it is great value and I would have paid a little more to get more in the all in and sides.  We had our two youngest with us. My daughters 6th birthday on Tues and the team there made a huge fuss and made her the star and everyone have a great time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nsteCVxCsE2pi1_bsX8bAw"
  },
  "kIwWFrEYX1KMl-cfLihBJA": {
    "date": "3/16/2015",
    "text": "Food was delicious and service was great, really friendly. Drinks cheap though a bit more alcohol would have been wonderful. We had the all in and had the perfect amount of food...perhaps slightly on the pricey side though, would have been happier paying about £16 for it (rather than 20).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDPJxsBnbZjZbbrzPIpceQ"
  },
  "bW6IirQYlHCrjBRaojvaOA": {
    "date": "4/7/2015",
    "text": "One of the best dining experiences I have had in a long time,  friendly staff,  cheap cocktails,  simple yet delicious menu.  The chops were amongst the best I've ever had.  If there are two of you,  I definitely recommend going \"all in\". Vegetarians avoid!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QyIERBHHA0bK8rGJu2q3Q"
  },
  "lRZpfqu9kvAds3iKmUr2eg": {
    "date": "12/14/2015",
    "text": "So good that I've been twice in the last week. Love everything about this place: the industrial-rustic charm of the basement, the very smooth negroni served in a cut-crystal glass from a drinks trolley, the pre-chop bites (egg and anchovy is my favourite), the amazingly juicy chops with a crispy ribbon of fat, sitting in a dish lined with flatbread that is slowly soaking up all of the chop juices, beef dripping chips and charred chicory, gallons of red wine on tap, and the fluffy vanilla cheesecake that is served from an enormous platter for dessert. Perfect for a speedy bite before or after the theatre. And good for groups as you won't get people poring over a menu for hours, although it can get a bit rowdy down there. Great value for money - for £45 a head you will leave absolutely stuffed and tipsy. And both times our friendly waiters have thrown in a dessert or a round of cocktails for free, which is a sure way to keep me coming back....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1yNJCe57BrbB5e5fNDwmgw"
  },
  "YCLTqVe0VmGh6_HIVoQ-Cw": {
    "date": "6/30/2015",
    "text": "My Eric sent me a list for us to go to in London and I'm such a good friend that I went here without him.  It took me a minute to find it, because it's not well marked, but that only made me like it more.  I was alone cause Eric, my friend, was on a plane, probably dreaming of chops, and they were nice enough to seat me at a community table with a family who did not seem jazzed on my sitting with them. Not sure why, I'm a delight, and I also had a Star Wars shirt on, which is pretty much universal.  Anyway, I bought them some drinks and then we got along grand.  I got the 2 chops on special, and the pork chop, cause I love a good pork chop, and Estelle, she was Rebecca's grandmother, but I didn't get her name, so I'm going with Estelle, she loved the pork chop as well and ordered two more, one of which she gave to me, which was a nice surprise because I really wanted another chop. I returned the favor by ordering two of the 10 hour sweet potatoes but Estelle didn't like sweet potatoes and the thing was so amazing good that I ate the other one while Rebecca looked on with disgust. Beer was great, atmosphere was great. Probably top 5 london meals I've had.  The two salad leaf salad needs a few extra leafs.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-jXIsX2Inx3CzmqMHnRRA"
  },
  "gUEcdcw6J4ll8_n2RgiNcw": {
    "date": "2/28/2016",
    "text": "Great spot for meat and a stiff drink tucked away in a basement. The place is very lively but not loud to a point you can't have a real conversation. The wait can be really long and in fact we had to wait 1-1.5 hrs though they claimed to have texted us our table was free (We had given a US mobile number and never got notification). There isn't much of a bar area to wait and even if you snagged the limited seat at bar, you can't get food. They did make it up to us with some nice bites on crackers.The \"all in\" meat platter is a carnivore's delight. No piece is the best you'll ever have but altogether it makes for an experience. The sweet potato side was great. The fries were okay.The standout here is the £5 cocktails! The old fashioned here is spot on with what you'd expect of a good one in America but it's way cheaper here! That is what makes this a gem.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fitXjNnwVB_HzqaBSrIGXQ"
  },
  "sw3RNMKgD3HqFGb75sB0dQ": {
    "date": "5/7/2017",
    "text": "Great food, great service.  Really enjoyed this restaurant.  Oder the special meat platter for 2 with sides.  Really loved this place!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "dWEeZANzQwcRNQmb-PDFkA"
  },
  "XLaEMRGDyh0P95cyG7T5zA": {
    "date": "2/26/2017",
    "text": "Had to reserve in advance. This place is for carnivores only. We went \"all in\". The starters were amazing! I'm still thinking about them. Meat was cooked beautifully, and the sauces that we ordered went along well, especially garlic and bone marrow sauce!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pZHV1mT6bjrYPEfwspJ_DQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pZHV1mT6bjrYPEfwspJ_DQ/o.jpg"
      },
      {
        "img_id": "8pUalvACWqiJZrhx3m2I6g",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8pUalvACWqiJZrhx3m2I6g/o.jpg"
      }
    ],
    "user_id": "SzhAnSr01Axl1qZofecZ5w"
  },
  "tNxdot0gvlXFrwK9c981ow": {
    "date": "11/13/2016",
    "text": "Pretty good food and value on the wine, but our visit was sadly let down by a poor experience with our waitress.We arrived and were seated about 730pm on a Saturday, ordered our food and were finishing off our wine. Around 9pm the waitress informed us that they had people waiting for tables and wondered if we needed anything else. My friend and I each had half a glass of wine remaining, and there were several free tables in the restaurant. I enquired as to what the alternative to finishing our wine at the table was and her response was something like \"you came I without a booking in soho on a Saturday and we need the table back\". We weren't given a time limit when we sat down and her abrasive tone and attitude was extremely unpleasant! We informed the manager who apologised profusely and offered us a small discount on our bill which was appreciated, but honestly I won't return to risk being treated so rudely by the waitstaff!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYxJqFgSvQPQ1BukYWHfnA"
  },
  "M2mk5za2xf8InZ-A3k3Epw": {
    "date": "5/12/2016",
    "text": "If you didn't know this place existed you wouldn't be able to find it. Very much hidden from the hustle and bustle. Staff are so friendly and more than happy to answer questions about cuts of meat. The waiter suggested All In for £20. Each person gets 4 chops each served on top of a flat bread so all that meat juice is soaked into the bread mm delicious !!! The cuts of meat are large and cooked to perfection. Melt in the mouth experience awaits when you eat here.I couldn't finish it all and ended up taking a doggy bag!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cUW2DqA0xMwjlNgYezf1vg",
        "caption": "Photo of Blacklock - London, United Kingdom. Pre chop bites.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cUW2DqA0xMwjlNgYezf1vg/o.jpg"
      },
      {
        "img_id": "Sau9F2NaD5bdD6YoaVTotg",
        "caption": "Photo of Blacklock - London, United Kingdom. All in for 2, Beef Dripping Chips and 10 hour ash roasted sweet potatoes.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sau9F2NaD5bdD6YoaVTotg/o.jpg"
      }
    ],
    "user_id": "vDI9VLfAVeAXBoQIcU9XDw"
  },
  "mbPm5fHt7VyoEffhYsRGWw": {
    "date": "9/29/2016",
    "text": "London chophouse in Soho. Located one level below ground, Blacklock has a hip urban and almost warehouse feel. The bar is well stocked and for food, you can order 'All In' which is a sampling of all the chops they have for the night over a baked flatbread drenched in oils. The chops were the most fatty cuts I've ever had and melted in my mouth. There is a minimum of 2 people to order this. One member of our party had gluten and dairy allergies (meat has butter) so he was able to get the meat on a separate plate.The 'All In' order also comes with a side which include options for barbecue gems (grilled lettuce), chips, baked courgette (zucchini) with Doddington cheese.There are of course many drinks options including beer, wine and cocktails. For wine, you can choose between 125, 250, 700 and 1000 mL. The wine list isn't that big. The reds are came from California or the south of France.Nice chophouse for anyone who loves meat and wants to eat it in a hip basement eatery!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kamYd0yguQlwpkW7M9CmRQ"
  },
  "8TOqlTjznn_QYnk2uCGo4w": {
    "date": "12/17/2015",
    "text": "It's Christmas and I was tasked with sorting a meet that catered to Xmas festivities and soaking up booze. First place I thought of? Well it could only be Blacklock.An early Christmas present from Blacklock in Soho was in the form of one giant beautifully wrapped warming bearhug. A brioche bun filled with charcoal grilled turkey, a Blacklock sausage, greens and onion patty. Not forgetting some middle white bacon and cranberry chutney that sends this over the edge of awesomeness.All of this dipped in a boat of turkey gravy. Corrr blimey, no need to wait for Xmas dinner leftovers this is a beast of a sandwich! I hope it's back next year!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R3k3m7ccAa_uAFvauXQY-A",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R3k3m7ccAa_uAFvauXQY-A/o.jpg"
      },
      {
        "img_id": "ilYaUmAg1DmCTH05l--FWA",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ilYaUmAg1DmCTH05l--FWA/o.jpg"
      },
      {
        "img_id": "FT562-gA8D72zfKRpolrww",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FT562-gA8D72zfKRpolrww/o.jpg"
      }
    ],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "qVMmoDmBfZ6-qL3Mkhf0yA": {
    "date": "8/10/2016",
    "text": "great place for some serious meat eating! Just make sure you book in advance and one more note: Sundays they have a roast special and don't do they usual menu. The manager there is amazing and the service is outstanding... I actually visited this place twice in space of few days during a business trip",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0o0v9QzJSIuq5GY4ICPXQ"
  },
  "0s-GJm5LPScYjWnF-_9hCw": {
    "date": "6/30/2016",
    "text": "Calling all meat eaters.. yeah, I'm talking to you!  This is a meat lover's dream with a menu option called \"All In\" where you can get a generous plate of varied meats with a choice of side, as well as a starters plate, for £20. The restaurant is tucked away in a basement and is not very large, but it makes it cozy.  I think it would be awesome for a date night or group setting because it's comfortably casual but trendy.  As for the good stuff... The starters plate includes three small bites that truly complement the rustic meal to follow.  Having a party of more than two is beneficial when ordering different sides bc they're all good for sharing.  The sweet potato and chips/fries are ones you can't go wrong with.  The kale would have probably been my favorite if there wasn't an excessive amount of parmesan (my serving must have been a one off). The side with the apple is a popular side, and I can taste why - it was sweet, tart, crunchy, and healthier??  It was delicious and that's all that matters.  However, there is one part of the meal that must be underrated.. and that's the bread that sits underneath all the meats, soaking in all that goodness.  I bet people forget that it's there, but do yourself a favor and don't be one of those people!I docked off one star due to service.  The service was very slow, considering it was a Saturday evening.  I don't usually complain about timing at restaurants, but it really did take ages for someone to come and take our orders.  Our waitress was lovely.  She threw in an extra Small Bites platter since all of us but one ordered the \"All In\" option (small bites included), and she said she didn't want our friend to feel left out.  Unfortunately, shortly after explaining her good deed, she knocked over a bottle of coke over my friend's white canvas tote.  It was such a bad spill, that the coke even went into the tote where there was a new white sweater!  My heart broke a little, seeing the gorgeous white being stained by dark soda.  Our waitress was very apologetic, but nothing else could be done after that except to eat our feelings.  For that experience, I would knock off two stars, but the food was just that great, that I put one back.  Be careful of potential spills!  Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T1ECVGXE_vwCoCOY5s4esg"
  },
  "ItNBKczr5G_suvR-y2Xe7g": {
    "date": "7/26/2015",
    "text": "Easy to get to off the Piccadilly Circus tube station. When you are close to it you need to be looking for a door with the name on it, not a sign.  It is a basement restaurant, done  very tastefully.   Food was fantastic.  Best pork chops I have ever had.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MplmkysyTleR1TFAPodMew",
        "caption": "Photo of Blacklock - London, United Kingdom. Me and a work mate showing off a plate of the skinny pork, stake and lamp chops.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MplmkysyTleR1TFAPodMew/o.jpg"
      }
    ],
    "user_id": "zxGdMM5dRaFBvxCvC47XUw"
  },
  "n8Y1aTgIX-sPHe-JLXTmsQ": {
    "date": "6/15/2017",
    "text": "Amazing service and delicious Sunday dinner!!!!!! Upon returning to London this place is at the top of my list!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iR0ylA_H6OOKwBbDwqxqrQ"
  },
  "QIKhyVs6yOciQBi4MezU9A": {
    "date": "7/3/2015",
    "text": "I'm not sure I even knew beef chops were a thing...what is a chop, technically? Regardless, Blacklock does a good line in them. It's fun choosing individual chops rather than a preordained meal. I wasn't that interested in the crisp starters so ordered my own selection of food rather than going 'All in', which would include 4 chops per person, plus bread and a side and starters for £20. I ended up with three chops, chips, bread and chilli Hollandaise - about £16.50. The chops were great, with the beef standing out in particular. I was also very, very impressed with the beef dripping chips - you could really taste the beefiness, which was incredible. For some reason I'd expected a more traditional, cosy place. I think the large, scandi minimalism was a bit weird for the food. The waiters were also a bit impersonal so it loses a star for that special atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LDCjG3M0Ncdhv4ubYVcyxA",
        "caption": "Photo of Blacklock - London, United Kingdom. The menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LDCjG3M0Ncdhv4ubYVcyxA/o.jpg"
      },
      {
        "img_id": "33jcacgUU0wUq9VEoClr5w",
        "caption": "Photo of Blacklock - London, United Kingdom. The table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/33jcacgUU0wUq9VEoClr5w/o.jpg"
      },
      {
        "img_id": "i-IJhUTC96Id7NO_5aWx3A",
        "caption": "Photo of Blacklock - London, United Kingdom. The daily special chops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i-IJhUTC96Id7NO_5aWx3A/o.jpg"
      }
    ],
    "user_id": "1IpZks_GTP79WPbO7OvPow"
  },
  "5hH-4zhHJmbtngFPsnL3yg": {
    "date": "9/2/2017",
    "text": "Favorite meal of the entire two week trip. Reservations recommended, especially pre-theater. I had two beef skinny chops (I don't see the exact cut--rump?--on their online menu) and it was melt-in-your mouth tender. My husband had both lamb t-bone and lamb cutlet and loved both. We split beef dripping chips, sweet potatoes, and the summer salad which was a perfect counter to the richness of the meat and other sides. Next trip to London, I want to have Sunday roast here. And the biggest surprise was how reasonably priced this was. We were expecting to pay at least £100 and walked away with a bill of only £65 including service--and even double checked that our server added everything (including three drinks.) It was all there. Best laugh of the meal: directions to the toilets indicating which was for West End Girls and which for East End Boys. Generational-specific humor, I suppose, so we must be their target demographic. (Gluten-free and allergy-friendly.)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7LGRwTxNtWj5SM2WP59Lg"
  },
  "JGwk05FJD9HWBw5D-dGF2Q": {
    "date": "12/1/2015",
    "text": "Blacklock is, simply put, amazing. I'd heard about it from a few foodie friends, and when they started their Butcher Price Mondays, it became a new goal of mine to suggest it every time Monday dinner plans came around. I also expected a queue out the door for something that sounds so fantastic. They only take bookings for dinner for parties of 6 or more, which is a tough thing to call when in Soho. Yet, to my surprise, there was no queue when we approached the door at ground level, and upon descending the stairs into the restaurant, found that there were quite a few tables available and many friendly staff members to greet us. The place was also positively buzzing, with good music and a lively atmosphere. It was by no means a quiet Monday night in the least.I really thought we were going to go for the Butcher Price specials, which come in cuts of around 900grams and are meant for 2 people to share. Our server told us about some cuts that were a little over 4 pounds per 100 grams, so I estimated that it would come out to around £40. But we weighed that against the \"All In\" special that they have all the time, which is £20 per person for a selection of the skinny chops, a side each, and some pre chop bites. Since we were 2 people, we decided that getting a selection with all the trimmings was much better value than just one large slab of meat, no matter how good the deal was. We ordered the roasted sweet potatoes and charred courgettes as sides, and a 500ml bottle of Bordeaux. They have quite a few wines on tap so you can choose from 200ml, 500ml, 700ml, or a litre. I thought the sizing of 500ml was perfect for a few glasses to accompany the food, without having to take on a whole bottle.We got one each of the pre chop bites, which were crisp breads served with dripping ham, cheese and pickle, and egg and anchovy, respectively. We were told to eat them in that order, I think in particular because the cheese and pickle was particularly acidic, and the egg and anchovy was extremely rich. I didn't think they were anything amazing... definitely not what I came for, but a nice touch, I suppose. Service was extremely quick and we received the meat and the sides shortly thereafter, no more than 20 minutes after arriving at the restaurant. We weren't told exactly what we got in the pile of meat, but there were two delicious beef short ribs, two lamb chops, then another cut of beef and another cut of lamb, and a large pork chop. It was served over chargrilled flatbread that tasted like garlic bread, and which had soaked up all the meat juices. That itself was actually better than the pork chop, a cut of meat I don't particularly care for. Aside from that, the rest of the meat was fantastic! And it was actually the perfect amount, as we actually managed to finish it all! As for the sides, I thought the courgettes were nice, but personally didn't really care for the fennel that came with it, which I thought was a bit bland. The sweet potatoes were sprinkled with some delicious herbs and that went very well with the meat.I would definitely come again. They were advertising their Sunday roast, for which they take bookings because it is lunch. Our server told us that it is booked out for the next two weeks. I also thought the service was top notch. Because we got our food in 20 minutes, we were done eating and out the door within an hour. I reckon they just have a lot of meat on the grill constantly, so it is fairly easy to pile up and serve. And it is such a good deal, at £20 each and £22 for our 500ml of wine. This is definitely worth many, many return visits.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "z6ExLpS4mKmPCWCO_mry_w": {
    "date": "2/25/2016",
    "text": "Oh my word. So many delicious chops! Fantastic meat, marinated and grilled to perfection - melt in the mouth pork, well-seasoned lamb, properly seared aged steak... you couldn't ask for much more!Blacklock really does well what it advertises: it's a chop house, plain and simple. Side dishes are hearty things like kale and parmesan, veg with blue cheese, and so on... and the only thing you need on your chops are the spicy mayo or the fantastic \"green sauce\". It's a pricey place, but you get what you pay for. Written on chalk are the available \"big chops\" of the day, and you'll rack (sorry) up quite a bill ordering some of the prime cuts - but I can tell from the pictures on Yelp that it's really worth it, if you're a party at dinner. We went for lunch, so had to scale back a little. 2 of us went in on the platter, where you get all the starters, all the small chops, and a side for £20 each. This definitely seemed like the best value-for money deal. We were stuffed full and couldn't stop describing just how delicious the pork was! You know a good chop when even the fatty bits are melt and the mouth, to-die-for deliciousness. Friends went for the pork chop sandwich; a couple complained that part of it was a little gristly but generally were satisfied overall. I think they have just been jealous of our huge chop platter!They served some good beers too, and I can imagine coming back with a party for dinner or taking some meat-loving friends for a real treat. Forget your barbecue places - slow roasted and smothered in sweet, sticky sauce - this place is seasoned slabs of only the best meat. Simple, effective, heavenly!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p0tGE0tPVnMj_jVh91STvw"
  },
  "v0ciS3iMzUVCHH9JUBbxEg": {
    "date": "3/20/2016",
    "text": "Pretty good Sunday roast-- All In! Not enough vegetables to go with all the meat. The lamb roast was particularly excellent. The roast almost came too quickly as we had barely dented our drinks. Be sure to get a reservation on Sunday!Above average washrooms.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V56AwFRZ7JErc_6dD5Wkbw"
  },
  "UICnWD2o54-oDiqEST8nDQ": {
    "date": "11/9/2015",
    "text": "Have waited a while to come here and I'm really glad I finally made it. What man (and woman) can't be interested in a chop specific restaurant?!? Well it was worth the wait and the food was excellent. We went for the 'all-in' £20 per person for a selection of the chops, 2 sides and some nibbles. I was a little disappointed we didn't get the beef chops as part of the mix but the lamb and pork (a selection of ribs, belly and chops) were all superb. tasty and superbly cooked. nice sauces, all the mustards, and the vege sides we chose lovely, if a little small on portion size.beers were decent. didn't have any wine. service was good and it had a nice atmosphere.i was tempted to give it 5 stars solely for the soundtrack, jimmy barnes, toto, meat loaf. amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNSvCs15r0MDkvFa75SqnA"
  },
  "eRF3SN3y_IiP6l83CUSP9g": {
    "date": "5/13/2016",
    "text": "Me and few friends have a bit of a foodie club. Once every 2 or 3 months we are will go out for food and on this occasion we decided to go to The Blacklock. It's a Chop house (the first I've visited) based in an old illegal Soho strip club and boy can you tell. Mostly by the fact it's got a very small sign and down in the basement.First off I need to thank the staff. They were great. Originally I booked for 10 and then it ended up as just 4 of us. Normally they don't take bookings for less than 6 but they were kind enough to hold my booking anyway.We arrived about on time and were seated quickly near the bar. Our waitress explained the ordering system to us and we order what turned out to be A LOT of food. Like some of the better steak houses, the maintain a list on the wall showing the available cuts. We had an 800g porterhouse between us as well as 2 \"all in\" chop platters.My GOD the food is amazing. Beef short rib, lamb cutlet, lamb t-bone, lamb neck, pork loin, pork rib and pork belly \"chops\" served on top of an incredible garlicky focaccia with beef dripping chips and 10 hour ash roasted sweet potatoes on the side. I'm salivating just thinking about it now.You have to visit Blacklock to really experience it properly. On top of the food they do great cheap cocktails too so you'll be full on food and in merry spirits by the time you leave!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VF3-orqv6RY8eEB1zM42Bg"
  },
  "FU9pKL4aEucZklFJOk1B8w": {
    "date": "5/8/2015",
    "text": "It's been 3 days since I went to Blacklock but I'm still dreaming of the food and wishing I could eat there every day. There are a range of meaty options but we went for the all in - a plate of different chops to share, with nibbles to start and a side each. The chops were cooked beautifully and the 10 hour ash roasted sweet potato is just something else. We even opted for another dish of it instead of pudding! Not to forget, the cocktails are a fiver and very tasty, would recommend the nettle gimlet. The service was delightful and I'll be back soon!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GBk8csnq16UaxNtCgd1hUA",
        "caption": "Photo of Blacklock - London, United Kingdom. Mixed chops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GBk8csnq16UaxNtCgd1hUA/o.jpg"
      },
      {
        "img_id": "YmRWZVl9_8AtgMNxNN8w5w",
        "caption": "Photo of Blacklock - London, United Kingdom. Anchovy starter nibbles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YmRWZVl9_8AtgMNxNN8w5w/o.jpg"
      },
      {
        "img_id": "VO2uHoG78L3aOPTFBHOaEg",
        "caption": "Photo of Blacklock - London, United Kingdom. Old fashioned",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VO2uHoG78L3aOPTFBHOaEg/o.jpg"
      }
    ],
    "user_id": "ieSrncoNtOb9AdwkSwoaGA"
  },
  "o6IDJWsDZE2lJORKsUljzg": {
    "date": "6/18/2015",
    "text": "DANG this place is good. I'm still in a filthy meat coma as I'm writing this, but it needs to be said. Came here for dinner tonight and all three of us got the \"all in\": £20 each for three crispbread hors d'oeuvres, a honkin' big plate of beef, pork, and lamb chops, three strips of meat grease-soaked focaccia and three different sides. All in all, considering there are places out there charging £20 for a single burger (ahem), not a bad deal. Service was fast and the vibe was casual American, which is a nice way to describe what is essentially a meat-inhaling cavern underground. Step through an unassuming slim black door to the basement, where we were able to be seated immediately at 7:30 in soho on a Thursday night. That in itself was fantastic. The cocktails are only a fiver each, but the best part is the food. Small rounds of crispbread kick the meal off - the anchovy and egg is a perfect mix of sharp saltiness and creamy egg. Then a huge plate of meat piled high arrives, hot, crispy on the outside and nicely salted. Pork chops, lamb chops, short ribs, t-bones... Not sure what else was in there but it was delicious. The sweet potato side is an awesome complement, and the fries have an amazing textural contrast between the soft interior and thick crispy skin. There was no room for dessert, as many jugs of water were imbibed to keep our sodium levels from skyrocketing. This place rocks - it's not an everyday joint, but huge value and an awesome meal for a treat. Now back to the meat coma.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1SYPsnRScaQZPWv-X234w"
  },
  "V_4nryJeI5f7eqOlc1nvUw": {
    "date": "6/25/2017",
    "text": "A friend made reservations here for 530pm to try the Sunday roast. As New Yorkers slowly navigating the streets of London I'm glad to say we found this place relatively easily. The restaurant's front door is quite narrow and to my surprise it is located in the basement. After walking down the stairs we were pleasantly surprised by the decor and atmosphere of the place. All the staff was super attentive and friendly. We got seated immediately and pretty much ordered one of everything on the menu. The appetizers was a scallop dish and a pigs head dish. Both were absolutely amazing! Next we ordered all 3 meat options to try. I personally don't like lamb so I didn't try it but my friend thought it was good. The pork was great, i loved how they included pieces of fat still attached to the meat so the meat wasn't so try. The steak was cooked perfectly medium rare and was tender. All the sides were interesting but the meat dishes itself came with awesome veggies and the Yorkshire pudding was so good! (In new york they are called popovers so that was something new to learn for me)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WqDtvKoML78zelzlxeWnUw",
        "caption": "Photo of Blacklock - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WqDtvKoML78zelzlxeWnUw/o.jpg"
      },
      {
        "img_id": "m4cj7ITfxjKfxmlQ0pND2w",
        "caption": "Photo of Blacklock - London, United Kingdom. Steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m4cj7ITfxjKfxmlQ0pND2w/o.jpg"
      },
      {
        "img_id": "XjhNY9HOl8GDgf3CuBltSw",
        "caption": "Photo of Blacklock - London, United Kingdom. Mint peas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XjhNY9HOl8GDgf3CuBltSw/o.jpg"
      }
    ],
    "user_id": "Cye1fDlmni6DepktlUi33w"
  },
  "TI0vATFDVfL5FFJCRiubCw": {
    "date": "7/26/2017",
    "text": "Tasty meats, really fun place to hang out.  Drinks were on point, meats were nicely done.  Chips were interesting, almost like they were dried and bit and then fried.  There were good though.  Very fun atmosphere, especially if you are into the 80's-90's music scene.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fs_D7obapT0_5ABnIrx-bw"
  },
  "94-th3_tgSzNNRKhK4GSPg": {
    "date": "3/15/2016",
    "text": "Wow!  Simply the best Sunday roast ever !!! Booked here after seeing a picture on either Instagram or Twitter of there all in Sunday roast.  It looked Awesome!Had a cocktail to start - a vesper something which was just right.  Shared the all in Sunday roast - a delicious platter of beef, lamb, pork with roast potatoes, carrots, greens and a massive Yorkshire pudding.  Accompanied with bone marrow gravy and some crackling.  It was super delicious!  I couldn't complaint or dislike anything.Had a cheeky glass of Cali Pinot Noir with it.Service was spot on.  Price - a bargain!If in London and wanting a Sunday roast GO HERE!!!?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TZAHV5QjPs9SOUJyjpdsgw",
        "caption": "Photo of Blacklock - London, United Kingdom. Roasted / Blackened Sweet Potato - I'm not usually a fan but this was delish!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TZAHV5QjPs9SOUJyjpdsgw/o.jpg"
      },
      {
        "img_id": "_JLDdV4yXeO8M_TZj5mgbQ",
        "caption": "Photo of Blacklock - London, United Kingdom. From the bottom - Lamb Cutlet, Pork Loin and Pork Belly",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_JLDdV4yXeO8M_TZj5mgbQ/o.jpg"
      },
      {
        "img_id": "IlIEVpffsDQ_5gP9FcR9iw",
        "caption": "Photo of Blacklock - London, United Kingdom. Sunday roast platter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IlIEVpffsDQ_5gP9FcR9iw/o.jpg"
      }
    ],
    "user_id": "9f1s2Wi6bJ1Y5aJfG77d-g"
  },
  "RysMRotHR8ryZNO4PYkAqg": {
    "date": "3/8/2018",
    "text": "Just walked up and we couldn't be happier! Downstairs, cool vibes, wait staff was great and door was delicious!  We split the t-bone and baby gems and sweet potato were the bomb! 80s music in the background rounded it all out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRKAbh4G5nmglkMM0wmPVQ"
  },
  "idt8DJycfepZ1CJgHsJT8A": {
    "date": "10/19/2017",
    "text": "Warning- not for vegetariansFor anyone else looking for quite possibly the best chops - lamb, pork, beef... stop looking. Go down the stairs and enter into an old school restaurant where the food is the star and the service is first rate.  We entered the Blacklock as they were opening on a Thursday night, early but we were hungry from a long day of shopping. We had no reservation but they sat us. Within a half hour the place was full up. We ordered the All In for the four of us and the fun started. Amazing drinks, the Old Fashioned was on point and the Mule with honey bourbon, ginger beer and chilie was surprisingly fun. The beef dripping chips were the best fries we've ever had and the beet salad was good. But the star of the meal was the platter of various meat cuts placed before us. Wow. We topped off the meal with a house made cheesecake and fresh berries. Best Dinner. Complements to the staffs they worked seamlessly together",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eGvC4g0-uYe1lno9G4vFEA",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eGvC4g0-uYe1lno9G4vFEA/o.jpg"
      },
      {
        "img_id": "oyyjTOghUUVgzAkWcVnJJQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oyyjTOghUUVgzAkWcVnJJQ/o.jpg"
      },
      {
        "img_id": "-m8BBejFzNlWGLmn7AilbA",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-m8BBejFzNlWGLmn7AilbA/o.jpg"
      }
    ],
    "user_id": "tRx83QmxLlttJkMtHTxq4w"
  },
  "t3ECMPL2b8tqQb736ITUjw": {
    "date": "6/24/2018",
    "text": "Fantastic Sunday roast, we got the all in, ordered for 2 but split between 3 people.  Also ordered the pigs head toast and scallops, both were delicious as well.  To end the meal the dessert was cheesecake with fresh berries.  My belly was so happy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTvdLNvPGjk_SsCEY-4S8w"
  },
  "JcbS8Pw81fxIqNelse7KjA": {
    "date": "8/14/2016",
    "text": "Blacklock is very spacious, but due to the high demand for their Sunday Roast, recommendations are definitely recommended. It also seems more like a tourist spot rather than a locals. Wanting the full Sunday Roast experience, like the rest of the tables around us, we had the All In, which consisted of 2 slices each of the following - roast beef, lamb, and pork. This platter also consisted of 2 pork ribs, fried potatoes, string beans, carrots, and Yorkshire pudding. When it arrives, the entire dish looks massive, but nothing's too heavy, so you'll walk out feeling full, but not overly stuffed. The meats on their own were flavorful, some a tad bit too salty - the addition of gravy elevates the taste. Of the roasts, my favorite was the beef, followed by the pork. The lamb was too gamey for me. The Yorkshire pudding was delicious and buttery. Having seen Yorkshire pudding on Diners, Drive Ins, and Dives, I've always wanted to try Yorkshire pudding - it didn't disappoint! Great experience to sample multiple things if you want the Sunday Roast experience.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7zoKX7PxU8XqiySFTvJviw"
  },
  "Ta_kwN8dRS1gOoFT2xBV9w": {
    "date": "10/25/2015",
    "text": "Recommend the chops... Pah. You'd hope so as that is what this place is all about.A basement restaurant with a unassuming front door - you could easily walk past this place... but make sure you don't! The charcoal chops served on to of flat bread which is full of meaty flavour are a must. I would say go for the \"all in\" which includes a selection of nibbles to start, a massive plate of chops (beef, pork and lamb) and a side each for £20, however although the starters were nice they were nothing special so next time I will definitely just pick a few of my fav chops and go for the beef dripping chips. Rest of the sides were also good in particular the 10 hour smoked sweet potato. What is also fab about this place is the very reasonable priced, tasty, different and strong cocktails they serve for only £5 (Nettle Gimlet & Blacklock 75 were awesome).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZG_bFQ5b-LGnf3hwytqOkw",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZG_bFQ5b-LGnf3hwytqOkw/o.jpg"
      },
      {
        "img_id": "DTIjUVGpzRQylCd0j2SxTw",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DTIjUVGpzRQylCd0j2SxTw/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "duFU4SBAaMzg-sMggGIZmQ": {
    "date": "10/30/2016",
    "text": "British BBQ? Except so much better! It's hard to sample some of their meats because it only comes in 8-900 gram sizes (so great for group gatherings here!) But we tried some of the small bites which were all amazing - beef rib, pork chop, pork belly. All arrive hot, juicy, and bursting with flavor. We also tried the special they had: 55 year aged rump. So good, just enough flavoring. We really didn't need sauces for any of the meats. They also offer little sides, in which we ordered the sweet potato and Caesar kale (both basic). The staff is super friendly, and love the basement feel. Be ready to eat meats!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "khVNSNyTz49ksVgHZZLYjg",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/khVNSNyTz49ksVgHZZLYjg/o.jpg"
      }
    ],
    "user_id": "A5ymNYLMb6ky0rCUKCdS-g"
  },
  "6kUOUfei1raxZRHcsLmA7Q": {
    "date": "7/3/2016",
    "text": "Do you like Yorkshire puddings the size of your head? Do you like paying a reasonable price for one of the best roasts in London? I'll bet you do. Blacklock is awesome. We went on a Sunday (obvs) without a reservation and the lovely staff squeezed us in. We ordered two roasts between three and they gave us another Yorkshire pud for freezies so we didn't have to share! It's like they know they way to my heart. Heart eye emoji.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "SsPXe-gofKF7GjkTiUYa-w",
        "caption": "Photo of Blacklock - London, United Kingdom. Pork + lamb = dreamz.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SsPXe-gofKF7GjkTiUYa-w/o.jpg"
      }
    ],
    "user_id": "MQnrJmk5Dkvi6rnWyyWJDA"
  },
  "5i4sjiyzmY_B-n-eQx8l3Q": {
    "date": "1/10/2018",
    "text": "Must LOVE meat! Food was excellent and service was lovely as well. We were starving after a long trip and happily stumbled into Blacklock SoHO. Great bites and drinks. We split the large plate for two(I forget the name) it had a sampling of all the chops and had some sides. Highly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nxmjD5eHJKb1sFg5sLULQ"
  },
  "wmEhcunGBvPI-pUHVokvEQ": {
    "date": "11/18/2017",
    "text": "Perfectly cooked chops of all kinds, delicious sides and sauces. Amazing service. (Best chips or fries I have ever had.) highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_xCAwkEhLa-gMIBGOH71Zw"
  },
  "Eb-C1XkIEC0kcvHXFG8P8Q": {
    "date": "10/28/2017",
    "text": "Tasty food! We had the pork belly skinny chop and the prime rib chop - cooked to perfection. Menu pricing was a little confusing since it is priced per 100 grams and you have to do a bit of math to see how much you're going to spend. Cheesecake is to die for. Friendly staff and a cool dining space.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jX7oYas-JwBcDJC-Y_RuWQ"
  },
  "A1rZDtTtKdojX55FTLxvNg": {
    "date": "6/1/2016",
    "text": "I've waited too long to go to Blacklock and I've finally been. Ren decided to treat me to their Sunday Roast which runs from 12-5pm every Sunday so if you're after their main menu then don't turn up on a Sunday.The place is very casual, quite a small place located in the basement so a reservation is a must as I witnessed them turn people away. To be honest it's not my kind of place with its overly loud music, cramp seating that made it all very chaotic and impossible to make conversation. At least the lighting was right, nice and low with warm spotlight lighting against the dark grey walls. Decor was kept simple but the exposed ceiling made it look cool. Staff were friendly though and were very efficient at refilling our water and getting us seated immediately even though we arrived 45 mins early. We told them 'all in' and ordered a couple of sides and starters and they got everything sorted pretty quickly. Scallops Oh the texture of these were just as if they came straight out from the sea, incredibly fresh and plump. My teeth just sunk into them revealing its fleshiness and delicate sweetness. Roast with them was deconstructed black pudding which made it quite a greasy oily dish but the flavours created were sublime. That subdued earthiness conveyed through its rich soft crumbly texture was one perfect pair for the scallop, adding a serious depth to the dish.All in- Roast of beef, lamb and porkEverything piled on one plate and it doesn't matter how many members you got on your table, it still goes on one plate.The lamb was enticingly sweet and juicy, packed full of flavour which a lot was the result to the lovely fatty bits that surrounded it. Needed a bit of knife work at times but tooth tender enough.The pork loin was my favourite, the most tender out of all of the cuts and sweetest in taste. It also had a good layer of fat providing all the rich flavours. The lovely pink beef rump was the richest in flavour compared to the rest of the meats. For a rump cut it was pretty tender but still required some chewing time. However I didn't mind as the seasoning really brought out its bold robust flavours and I was able to enjoy it for longer.The trimmings were all very welcomed. One of the best roast potatoes you can find in London with that thin crispy floured shell breaking into the fluffy buttery inside that almost resembled mash itself. Broccoli were a bit old and tough to eat at times, especially the stem but still produced a lot of earthy sweet flavours. Both the yellow and red carrots were packed full of sweetness, still had a nice satisfying bite to it too. The Yorkshire pudding was probably favoured the least as it was quite dry being slightly cooked. The charred brown skin was a big too strong and it took a while for the gravy to soak in to make it edible again.But it was that phenomenon gravy that made everything stand out to your standard roast, rich in its savoury flavours from the bone marrow it was made out of. The fatty collagen turning into gelatine became a lovely thickening agent in the gravy making it viscous and somewhat sticky, coating everything it touches with a layer of intense umami flavour. We finished our first pot pretty quickly but luckily we found we later there were unlimited refills of itCauliflower cheeseA beautiful contrast between the fine crispy topping and the soft tender cauliflower itself. The charred cheese sent a lovely smokiness across the more gentle white cheese sauce inside that kept the dish moist. Nicely seasoned with nutmeg giving a nice edge to the creaminess with its warm sweet spice.Blacklock does offer one hell of a roast and one of the best out there. All the meats were cooked and seasoned perfectly to how I like it, beef and lamb nice and pink. However I couldn't but help that they could be a little bit more adventurous with the trimmings, beyond salt and pepper. Maybe even throw in a bit of herbs for the meats whilst it roast for additional flavour and depth. But their starter filled in their lack of creativity as those scallops were worth coming back alone for. As much as I loved their roast, it's only almost as good as my mum's (and they admit to it too). Their poor choice of loud music brings it down a notch too.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "W08Ssb-ChVq4PfkNPn8RPw",
        "caption": "Photo of Blacklock - London, United Kingdom. Exterior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W08Ssb-ChVq4PfkNPn8RPw/o.jpg"
      },
      {
        "img_id": "DbI7pXwBfJvpw8BLiye7lA",
        "caption": "Photo of Blacklock - London, United Kingdom. Interior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DbI7pXwBfJvpw8BLiye7lA/o.jpg"
      },
      {
        "img_id": "Dw-44eb22tN1VQJtLp-NSA",
        "caption": "Photo of Blacklock - London, United Kingdom. Interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Dw-44eb22tN1VQJtLp-NSA/o.jpg"
      }
    ],
    "user_id": "GhmA0xBVIxxlfOhnEiUyIQ"
  },
  "etY8hUEWv9Y1Asf3wz8sWw": {
    "date": "5/15/2016",
    "text": "This place is for carnivores. If you are vegetarian, stop right there and turn back up the steps. It's basically a meat house/bbq place with a red wine list to match. Best way to do this place is to find some fellow carnivores (4persons is perfect) and get the £20 menu for two, 2 extra of the small bites each, then an extra slab of meat with some extra sides.The £20 menu is the best value out of everything. You get two sides and all of the 'chops' plus the small bites. The chops have some much flavour! It's probably a little too much to eat for me but put in the mix a hungry boy or two then you'll be fine. The sides are super small so I'd recommend ordering a couple more if you care able veg. If not, grab the chips and indulge in your meaty platter of goodness.At lunch they have a steak sandwich special that looks like good value. Make sure, whatever you do, get all of the small bites.They also do cocktails, crafty beers and, as I said earlier, very red meat suited reds. The wine list is very new world Aussie/USA/NZ focused.Get there early- they take no bookings for parties under 6!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PL-EHrTbIqF5QbTeh5BJ2g",
        "caption": "Photo of Blacklock - London, United Kingdom. They have decanters!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PL-EHrTbIqF5QbTeh5BJ2g/o.jpg"
      },
      {
        "img_id": "k5UFTOlzZLcbZI4fY7tllQ",
        "caption": "Photo of Blacklock - London, United Kingdom. 2 person, 20 platter of all the 'small' chops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k5UFTOlzZLcbZI4fY7tllQ/o.jpg"
      },
      {
        "img_id": "yza5DYHwrpgcocKKD25sKg",
        "caption": "Photo of Blacklock - London, United Kingdom. 1.2 kg of iron",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yza5DYHwrpgcocKKD25sKg/o.jpg"
      }
    ],
    "user_id": "onJgko2C3WB5XLqYHqD2MQ"
  },
  "a0cf6ykll4jSXxym7otRtQ": {
    "date": "11/23/2017",
    "text": "This restaurant was the highlight of our visit to London. The cozy atmosphere, attentive service, creative drinks, and delicious dinner options were a perfect experience before heading out to the show.   We recommend the \"All In\" to share - served with a sample of all of the skinny chops.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SgGK-Vmd3_I-o0qeZOXP_A"
  },
  "DgISXzJ-8tTdVZ7M6_bV_A": {
    "date": "11/25/2017",
    "text": "Hands down the best meal we had in London! We entertained returning every evening. We had the mixed grill, a sampling of all the meats, apps, and sides and it was the best value in town! So much meat and everything cooked to perfection. Service was courteous and swift. We had a play we were attending and the waitress was conscious of our timeline and kind in the process. Do yourself a favor and make your way to Blacklock.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oPU6gljL0MddvM2HA9KiBw"
  },
  "KYsW1gosRSGutFemWHroNA": {
    "date": "1/7/2017",
    "text": "5 of us went for the \"all in\" , tasty starters so off to a good start.  When the chops arrived piled onto one plate, we were concerned we had over ordered.  However with the sides this was just right!  Everything was cooked just beautifully!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "QKUiu1FcQ3gXLEpUCqRYkA",
        "caption": "Photo of Blacklock - London, United Kingdom. All in for 5",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QKUiu1FcQ3gXLEpUCqRYkA/o.jpg"
      }
    ],
    "user_id": "I9D9iypt9KZkrnsgjm8Klw"
  },
  "cxe-I9g7MO9f8YTDwnPuxA": {
    "date": "2/20/2016",
    "text": "NOTHING CAN BE FAULTED. My experience was up there with the best.We were seated immediately at 6pm on a Saturday night when everything else in Soho was full and queuing.When i read ex-Hawksmoor chefs started this joint I got very excited.For £20 each we were treated with the 'All In' which was all the meat, two sides and the Chop Bites. The bites where a trio of different starter bites, a cured ham, one with pickled veg and Stilton and one with anchovy and egg. The latter was certainly not my vibe. A salty bomb of creamy sick, but the other where delightful.So much food for such good value. And £5 cocktails! Service was very speedy and friendly, we even ended the night by sharing the cheesecake which is served at the table. Really light and delicious.Most important aspect, food was filling and plentiful but didn't leave me feeling over fed or bloated. 10 million stars",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aexvtMviYeYBlXOA6zp4Cg",
        "caption": "Photo of Blacklock - London, United Kingdom. Chop bites.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aexvtMviYeYBlXOA6zp4Cg/o.jpg"
      },
      {
        "img_id": "yXyttpX7BHrqbjhOISWMCQ",
        "caption": "Photo of Blacklock - London, United Kingdom. All in chops: beef short rib, belly pork, pork chop, lamb cutlets and lamb chops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yXyttpX7BHrqbjhOISWMCQ/o.jpg"
      },
      {
        "img_id": "KL8D8bVeDnwn_Pxkr-t90w",
        "caption": "Photo of Blacklock - London, United Kingdom. Barbecued baby gems",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KL8D8bVeDnwn_Pxkr-t90w/o.jpg"
      }
    ],
    "user_id": "yZnR-BubZoknXd6sgiMDZw"
  },
  "ZezBZ8wJaUJdJvE4M9dhHw": {
    "date": "5/8/2017",
    "text": "A great place for meat lovers. It also recently got into the 100 Best Restaurants in England, which they totally deserve! The prices are also really good when you think that they serve fresh meat.The meat was cooked to perfection, my favourites were the beef steak and the pork belly. Actually everything was so delicious. I could make an entire meal only out of the starters and sides, they were that good. You also can't miss out on the sauces they offer to choose to be served, especially the bone marrow one. Just close your eyes and eat! The cheesecake also came highly recommended, but there simply was no room. Definitely will have to get that next time. Because there will be a next time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TuOhDrdr2irXB5XCRKcXEw"
  },
  "yfPQVJF-s11rLLeKg5etJg": {
    "date": "10/16/2018",
    "text": "AMAZING food, service, ambiance. Squeeze us right in, gave us a shot and everything that was recommended was PERFECT!!!This is a must! If you like steak, pork chops, lamb etc get down here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vY7Xrd2BbXIjNz6c0djcEg"
  },
  "1YsiHOxZPaudJHtXNZQYZQ": {
    "date": "7/11/2018",
    "text": "Best meal I had in London was the Sunday roast here, and my biggest regret is not coming the next night for the promotion on the chops (prime rib for £5/100g). Super friendly staff from reservationists to servers. Great drink specials and wines by the bottle. The meat platter itself is a sight to behold: Yorkshire puddings the size of a baby's head, and meat piled in abundance. Great carrots and parsnips too. Just fantastic: a must-go.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "TzYxxd2g8JwXbBdKmhWtBw"
  },
  "yqlELfj3MLONVfAIF4NDag": {
    "date": "6/29/2018",
    "text": "Fantastic steak and staff made our dinner stunning. Food was great, and I especially enjoyed my bone marrow sauce to go with the steak. Sides were generally good too, though I do hope they will expand the variety a little bit. Portions were good, and the wine was spot on. Above all, the staff were fantastic. As it was the night of a World Cup game, we were watching it on our mobile, and they came by to check on the scores themselves and interacted with us in the most welcoming way. In the end, they even served us free portions of dessert. The white chocolate cheese cake with a side of summer fruits was the absolute highlight of the dinner -- tasteful and perfectly sweet. Ambience was hip and nice. Not the most spacious restaurant, but it made it all the more cosy and fun",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "q21h3hqVBA7CODOt-XsJuA": {
    "date": "10/28/2018",
    "text": "This is the best Sunday roast in London, hands down. Make reservations far in advance so that you can get a table and not stress! The prices are very fair for the amount and quality of the food you get, and the cocktails are lovely. We visited in celebration of my college graduation and my boyfriend passing his veterinary school exams- and they surprised us with dessert and the sweetest messages! I make sure to visit here every time I'm in the U.K. and can't wait to be back again!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cSi9mMkQ6ffvvZ5XwY-wBQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cSi9mMkQ6ffvvZ5XwY-wBQ/o.jpg"
      }
    ],
    "user_id": "kgox9u4FAmkZk4qHEv0Mhw"
  },
  "L237-cfTQqos_6Jbd2dU0w": {
    "date": "11/19/2018",
    "text": "Back for a second time after a show this weekend and OH MY GOODNESS! I thought I must have exaggerated my memory of how amazing this place was, but no, it is fantastic in every way. Incredible steaks (and sides and desert and cocktails) and the most friendly and fun people working there! My new favourite place for special occasions - I would travel far to go here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqzAqbM5D2HLi6NFRsH4pA"
  },
  "ZrmHhuX0cydhbUs03mhRGw": {
    "date": "4/26/2018",
    "text": "At Blacklock, one must go all in and order the \"All In\". It costs £20 per person and includes a series of pre-chop bites, each of the skinny chops, and side dishes. You definitely get your money's worth. It's a lot of food. My parents and I thought that the appetizers were generally more enjoyable than the actual meats, although we unanimously voted the pork loin as the best single bite of the meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2igzba_scCwy-ZTRP8kF3w",
        "caption": "Photo of Blacklock - London, United Kingdom. All-In (20 pp.) (2/2)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2igzba_scCwy-ZTRP8kF3w/o.jpg"
      },
      {
        "img_id": "oxk8tMiBAfDvkof8QCOHtw",
        "caption": "Photo of Blacklock - London, United Kingdom. All-In (20 pp.) (1/2)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oxk8tMiBAfDvkof8QCOHtw/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "IIukhuZyNbyMXX9XKrud-g": {
    "date": "5/28/2018",
    "text": "First heard of Blacklock through The Infatuation and wanted to make sure we made it through on our recent trip to London. Following a day spent in Borough Market and Tate Modern we hopped across the river into SOHO for a quick bottle of wine before dinner. In fact, the little French wine dive Le Beaujolais was a great little spot for an afternoon bottle. We certainly appeared to be the only \"tourists\" there and were quite welcomed by the owner and his regulars.Getting back to Blacklock, we arrived a few minutes early for our reservation and were immediately escorted to a table of our choosing, which is always a pleasant offering and should be noted as much appreciated by myself.After selecting a table with a view of the pass through so that I could judge the plates coming out, we were greeted by a young gentlemen who could not have been more accommodating. He explained the different cuts available for the evening and we selected both a porterhouse and the Barnsley lamb chop along with the charred sweet potato. When the cuts arrived they had been sliced from the bone and we grilled to perfection. Medium rare on the lamb and rare AF on the porterhouse. Normally not a desserter, I had to order the homemade cheesecake with the seasonal berries once the crossed my line of sight. The filling was a perfect creamy texture with a hint of vanilla, complemented exceptionally by the fresh berries and sauce.I'd rank this steak experience well within the top 15 I have ever eaten somewhere in line with Bavettes in Chicago. The service, quality of cut and general dining experience were enjoyable and certainly worth another visit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9178TuDdSGGTDgwLBUNcjQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9178TuDdSGGTDgwLBUNcjQ/o.jpg"
      }
    ],
    "user_id": "m_8CxYht2RpJlhQcOcblig"
  },
  "ir8vcfWM54_6YjAYZY-ABQ": {
    "date": "8/5/2018",
    "text": "We had the £20 all in, Beef was cooked medium well  as we requested, the lamb was good, the Pork was awful over 50% fat. Roast potatoes were average at best, bone marrow gravy was excellent, Yorkshire puddings were huge. And vegetables were tasty, so mixed review really, quantities were very large, overall quality good for the price in central London, decor very nice, service ok. Just no wow for me much as I wanted to be wowed, my wife however thought it the best Sunday roast she ever had.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hzQH1a_3zuWR6iRMPey7ZQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hzQH1a_3zuWR6iRMPey7ZQ/o.jpg"
      },
      {
        "img_id": "H9dYvSEIIqXBYIsOosvKNA",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H9dYvSEIIqXBYIsOosvKNA/o.jpg"
      },
      {
        "img_id": "4N5Hffkw8VKOCWXGkHMPGQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4N5Hffkw8VKOCWXGkHMPGQ/o.jpg"
      }
    ],
    "user_id": "aToXreIHebl82eiRptU1-Q"
  },
  "GGatlyp-dFY_6DrzLtyQWg": {
    "date": "10/15/2018",
    "text": "Top 4 greatest pieces of meat in my life. Sunday roast is better than any Thanksgiving in the states I've ever experienced. Service staff is top notch",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9HDUehVltBTwuuaA0NOGxw"
  },
  "50SQKTNdEOupEEnq0zzOEA": {
    "date": "6/26/2018",
    "text": "Blacklock is a chop house right in the heart of Soho and believe me when I say it should be next on your to-go list (unless you're a veggie, then...soz). You enter through a door-way on Great Windmill Street and head downstairs to the basement...It's dark and it's moody..and it also used to be a brothel. All signs of the knocking shop have since been removed and they've done it out in exposed brick, wooden boards and industrial metals which created a relaxed, energetic vibe set off perfectly by the 80's soundtrack which blasts out of the speakers.There's no reservations (unless your in a group of 6+) so it's a case of turning up and waiting. We were lucky and got seated straight-away but if it's a busy night you can leave your name and head to the bar, or go down the road and they'll call you back. None of this silly, queuing down the road nonsense which London restaurants are fond of....The menu is nice and brief which I like. I like restaurants which find their strength and just do it well. Chops is what Blacklock does well with a short but tasty menu of 'skinny' chops. Our waitress advised that the best way to try the menu was to go 'all in' (£20pp) which was essentially a platter of chops of the day along with some crisp breads to start and a side dish.The starter comes in the form of the 'pre chop bites'. Three crispbreads heaped with three different toppings each increasing with flavour. You start with the dripping ham, then work your way to the stilton & pickle and on to the egg & anchovy. I liked the cheese best but the egg and anchovy was surprisingly tasty.The main event, of course, was the chops. We started with the beef fillet, then worked our way through pork loin, pork belly, lamb cutlet and T-bone. All the ribs are cooked on the right side of rare with plenty of crispy flavour on the outside. I'm a hands-on kind of eater so I had no shame picking up my chops and gnawing my way to get to the bits of meat hidden by the bones. The lamb and beef were my favourites - for the first time ever I wasn't mad on the pork belly but it was still definitely very tasty. Side dishes were also good. We ordered the barbecued baby gem which had a nice smokey char to it but the chips stole the show. Triple cooked in beef dripping with just the right amount of salt - up there with the best best portions in London (and I've had Heston's).It's definitely worth giving a shout-out to the flatbreads which the chops are served on too. Soaking up all the meaty juices, these beauties are incredible and the probably the most non-diet friendly item on the menu, but worth every last calorie.If you only order one thing though. Make that the pudding. They only do one. It's that good, they have full confidence in it. White chocolate cheesecake - served with rhubarb stewed in vanilla infused juices.It's easily one of the best cheesecakes in London. Buttery, crumbly biscuit base with a THICK filling - and the best bit is that it comes served home-style so you can chose how much you're served.If you're looking for some no-nonsense eats in Soho, I highly recommend Blacklock...even if just for pudding alone!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hFlzqhZxiIraa2FhOte7SQ"
  },
  "79t8-6zF1JRMbAHpIpMGOQ": {
    "date": "9/15/2018",
    "text": "We came for the Sunday Roast and it was pretty amazing. Definitely need a reservation for this place because walk-ins were turned away and even though we had a reservation, we still had a wait. We had several orders of beef and lamb because no one wanted the pork, but these came on separate plates so order the all-in platter for a better instagram shot! The meat itself was tender and delicious, I wanted bottles of the sauce, and it was my first time trying Yorkshire pudding and I loved it. The portions were enough so that we felt full but still had room for dessert. The beers are pretty weak so I wouldn't recommend unless you just want something to drink. The restaurant is in a funky basement with a hipster vibe thanks to the exposed brick and chalkboard decorations. People of all ages were here though, so it felt like a comfortable gathering hole rather than a snooty new pop-up joint. I'd highly recommend the Sunday Roast and I'll be coming back for their regular menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXeXR0heCFB5OoiLZkQvsA"
  },
  "-5HlkBVcpfO1AxKB_Ygeww": {
    "date": "10/13/2017",
    "text": "Pretty much faultless. The service was excellent from the moment I arrived. Food was incredible - go for the prime rib if your budget can stretch - and an 'all in' as a starter between 3 of us was plenty. Great beer selection and very well priced cocktails - the negroni was sublime and old fashioned up there with the best I've had - both a fiver! Such a cool vibe in there as well - a gorgeously decorated underground spot with great music and an easy going crowd. Loved it and will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VnbeIphOMcWBm6Mwxmqt1Q",
        "caption": "Photo of Blacklock - London, United Kingdom. Old fashioned to finish things off",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VnbeIphOMcWBm6Mwxmqt1Q/o.jpg"
      },
      {
        "img_id": "nkiADCREfh8Zz663cn4zhQ",
        "caption": "Photo of Blacklock - London, United Kingdom. White chocolate cheesecake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nkiADCREfh8Zz663cn4zhQ/o.jpg"
      },
      {
        "img_id": "KtVa0GIabWYH-Ux3poEG3w",
        "caption": "Photo of Blacklock - London, United Kingdom. Prime. Rib. FTW.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KtVa0GIabWYH-Ux3poEG3w/o.jpg"
      }
    ],
    "user_id": "ZpMiutGgkr2VIb44Fmd4cQ"
  },
  "PB6P9BjhXxiP9HxsjFFMdw": {
    "date": "4/20/2018",
    "text": "Wow! This place has become one of my absolute favorites in London. To start with the atmosphere and warm welcome of the staff and their enthusiasm and commitment to making your dining experience is fantastic. And then there's the food... we had the 800g Porterhouse steak with bone marrow, garlic and parsley sauce with a set of fries and the 10h baked sweet potato to share between the two of us and it was amazing!!! The meat was grilled to absolute perfection (we ordered medium rare), the sauce had plenty of bone marrow and was packed with flavor to elevate the dish even further and the sides was was so good that they actually could do as mains just by themselves. And when all of these amazing components come together as they did in this dish, with the atmosphere of the restaurant and their amazing staff is becomes a one of a kind dining experience. This is an absolute must when in London and I can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KjKuKbbNYCjwFrkVgR4SNA",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KjKuKbbNYCjwFrkVgR4SNA/o.jpg"
      },
      {
        "img_id": "bUrMCl5nAB0Z3Wk7FqDBSw",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bUrMCl5nAB0Z3Wk7FqDBSw/o.jpg"
      }
    ],
    "user_id": "nqY_SneS05gnVoSTBr4gQA"
  },
  "prmniHrzDx70x9pd4N2e4Q": {
    "date": "10/7/2017",
    "text": "What a great last evening out in London for us! Ellie was the host and greeted us with a big smile and although we were full, held our jackets while we waited....(and I mean literally held them). She was very kind and provides incredible hospitality. (Ellie you deserve a big fat raise). The cocktails were amazing, the service exceptional and the best food we had on our trip (and we have been in Europe for 2 weeks) Go for the \"all in\" it was amazing!The meat here is perfectly seasoned and cooked, and we are tough critics! Would 100% recommend this place to locals and travelers alike! Blacklock FTW.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YuzwSwM6D9v0S0T1f-Mv7A",
        "caption": "Photo of Blacklock - London, United Kingdom. The \"all in\" doesn't disappoint!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YuzwSwM6D9v0S0T1f-Mv7A/o.jpg"
      }
    ],
    "user_id": "HRRp9hJNqKEYlMFObvGgiA"
  },
  "Fee90LXzPz9qRXl4O2G9Cg": {
    "date": "3/2/2018",
    "text": "We split the dinner for two and it was a AMAZING! I have never really enjoyed lamb but it was delicious!! Surprisingly my favorite bite tonight was the egg and anchovies bite!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m1jKJjuNFcj4aNyJcv9JfQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m1jKJjuNFcj4aNyJcv9JfQ/o.jpg"
      },
      {
        "img_id": "q6T-RmfuGt9PxxsQy84ApA",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q6T-RmfuGt9PxxsQy84ApA/o.jpg"
      }
    ],
    "user_id": "O21pUX3Dg6UAdTW2I6PcTQ"
  },
  "ScWVh1I_VUTkgPlLrCuVHg": {
    "date": "9/9/2018",
    "text": "Amazing - went for a Sunday roast and the meat (beef) was to die for!! Our group went all in but the veggies/potatoes/beef was my favorite!!! The drinks were fun and super tasty, I had a grapefruit mimosa! And let me tell you about the homemade cheesecake!!! That was melt in your mouth insanely delish!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "363NvmhpEfwC95u78KGG_w"
  },
  "WwS1iS_gT7TjbJktnr_O8Q": {
    "date": "9/16/2018",
    "text": "Our adventure at Blacklock Soho began with a couple of wake up drinks. I had the Corpse Revivor No.24, a gin, cocchi, blackcurrant, lemon and absinthe combination. I thought it was delicious but let me tell you if you are not a fan of absinthe pass on this one. You'll have a balanced drink but the absinthe will be a slightly more dominant flavor. For our meal we did the Sunday Roast All In which let us try all three meat selections: 55 Day Aged Beef Rump, Cornish Lamb Leg, and Middlewhite Pork Loin, in addition to all the sides and sauces it comes with.So first thing, if you've never had a Sunday roast it is such a treat. One tip, as soon as you are served take the yorkshire pudding and pour a good portion of the marrow gravy into it straight away and leave it alone till the end of the meal. This might sound strange but you'll understand as soon as you get your plate.The meats were all very distinct and had unique sauces to go with them. By far the aged beef was the most delicious of the three for us. Tender and not at all gamey it was perfect as is or with a dab of gravy or horseradish. My only complaint was that we only got two slices on our plate. I really wanted more. (Maybe in the future they will offer to double the meat for a surcharge. I would have gladly paid.) The lamb was super juicy and the mint sauce they served with it was a great bite. Of the three we didn't like the pork loin as much as we thought we would. There was a very thick ring of fat around each piece and while some might love that, I prefer a leaner piece or having the fat crisped up more. So I just cut it away but this greatly reduced the portion size. There were what I believed to be some pork cracklins on the dish and my suggestion is to drop them into your yorkshire pudding and gravy when you find them.As for the include trimmings, the veggies were fine and who can ever say they had bad duck fat roasted potato's. Now that you have nearly come to the end of your meal, let's go back to the yorkshire pudding and gravy. By now the gravy has saturated the inside of your pudding, as well as any bits or meat or potato etc that you tossed in there. So just crush down that crown and begin to enjoy this gravy soaked piece of wonder. It will be the perfect end to your Sunday Roast meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kVNKW8URQ5MeqakeGsSx1g"
  },
  "bKSlybwZaLiMAN568bwFTQ": {
    "date": "10/29/2017",
    "text": "Omfg I would come back just for the marrow gravy. And the cracklings. Yorkshire's the size of a baby's head hiding a roasted potato. All in roast ( beef, lamb and pork) was amazing. Wanted to miniaturize the staff and I've space and bring it all home with me.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h_BY67PtmUnsVa8Mq-k7lw",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/h_BY67PtmUnsVa8Mq-k7lw/o.jpg"
      },
      {
        "img_id": "zVYKmwL9_c3EyVv6ocx4wQ",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zVYKmwL9_c3EyVv6ocx4wQ/o.jpg"
      },
      {
        "img_id": "atmJeWx4yrvLQQ-4av6N4w",
        "caption": "Photo of Blacklock - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/atmJeWx4yrvLQQ-4av6N4w/o.jpg"
      }
    ],
    "user_id": "Wme_XX7CkO7hv8H2SPMWlw"
  },
  "AtchYR8tgUdXw_kZNItjhA": {
    "date": "12/30/2017",
    "text": "A group of about 6 of us came here for a \"birthday roast\" and ordered a mountain of meat. I got the meat sweats for the first time in my life. Thought I was a goner for a little while there in the middle, but I took a few deep breaths and kept going. This wasn't actually the best roast I've had in London, but the food was nonetheless excellent, and the experience was memorable. As a bonus, the staff were very accommodating, even delivering coffee to some of us from a nearby coffee shop, as Blacklock doesn't serve its own coffee.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COlsr3ylbrZi2miqbY9ZlA"
  },
  "V-BmyrQPXewLysCnXW3fMA": {
    "date": "7/17/2017",
    "text": "Definitely a lovely experience.I would've kept eating if i werent full.Service was great, and our waiter was kinda dorky cute.Food was great, korean bbq who?Would love to go back again.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BGFSugF16_fGN3j8NwfFuA"
  }
}