{
  "6Yo2OtNtB-AnAx6wRzOngg": {
    "date": "7/23/2015",
    "text": "Amazing place! they only have 3 items on the menu lobster rolls, burgers and full lobsters. We tried lobster rolls and those were absolutely delicious!!!!! Great ambiance too. We love it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BM3E-JnDJyexVUPjzPFmJg"
  },
  "YClBuZi3n6LTqLe5O43g2A": {
    "date": "5/19/2016",
    "text": "This place is DEFINITELY NOT kids friendly. They were not only rude on the phone and when I arrived at the hostess stand, they have no kids menu or any thing that would give you the slightest indication that they welcome families and kids. Not recommended.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54pHOPBuXCiebbWAVOZGdw"
  },
  "EEiK6dnMrNIXQZQ8d2H-pw": {
    "date": "7/17/2016",
    "text": "My wife, daughter, and I stopped here for dinner. It was little hard to find because we did not know it was inside of a department store. But it's a good sized proper restaurant. The menu is limited to pretty much just burger and lobster. My wife got the burger and thought it was just fine. I got the lobster roll and loved it. The butter sauce was really good. Also they sell a huge selection of premium chocolates right outside which is a plus!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWcXQ70o1UvrgNhsR6fdlQ"
  },
  "SE_gRf0GwgQeuhnSgdRSWw": {
    "date": "4/17/2015",
    "text": "The place was packed but we managed to get in after a 10-15 minute wait.  The burger was delicious (and massive)!  The service was good and the ambiance was nice.  I think most people come here for the lobster (from what we could see) but the burgers were fantastic.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p7a7EVDk-qBLd3mIjH3ZSg"
  },
  "ljSv6j5xsKeek_zHL-jJ-A": {
    "date": "12/7/2014",
    "text": "Lobster is amazing with that delicious garlic butter sauce! Get your steamed as grilled gets a little bit over cooked. I am watering at the mouth as I type. The main thing I don't like about Burger & Lobster is that they don't take reservations its first come first serve and there is normally a long wait. If you want to avoid the line go to one of their less over crowded branches like knightsbridge (in Harvey Nichols) at 9.30 pm on a weekday. Also don't bring a vegetarian as there are only two options Burger & Lobster and they are both £20. I would not recommend ordering a burger for £20 as I find that overpriced but the lobster is well worth it. Also the side salad could use a little help, maybe a better salad dressing it is just an below average balsamic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NgKm99u4c7MH53EVCZhCtQ"
  },
  "-trYt_qVDCCGpNyiYk4XNA": {
    "date": "1/7/2015",
    "text": "The menu is simple...it has three items. We ordered a lobster roll and a hamburger to taste both. They were out of this world. So fantastic. Service was good too. We were here on a Wednesday night and it was packed! Well worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXt2qkjCxWb0VLUm186cgA"
  },
  "49npVCKsOYaFDv5HYD_u3g": {
    "date": "2/15/2014",
    "text": "Visited here with my fiance on a recent Thursday night. Was not a planned visit but we caught the lift up to 5th floor to see what was on offer. I had read about the lobster roll trend but never managed to get to enjoy one so was pleasantly surprised when the person who met us at the top read the 3 item menu to us before seating us. The place was packed, we both opted for the lobster roll as opposed to the unshelled lobster or gourmet burger option. My fiance was a little hesitant at trying the lobster rolls but after some gentle persuasion she agreed to try it. The end result was that the delicious lobster meat was served in equally delicious brioche roll along with fries and a salad. The food was impecabble and well worth the price paid, we will definitely be going back for more of the same.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_J_uKrM-pHiBVkdbRfL2EQ"
  },
  "VdCbCxRK-e4jYHX-5yojOA": {
    "date": "3/5/2016",
    "text": "I have now been to 3 Burger and Lobsters; NYC, Bath and Harvey Nichols. They are pretty close to perfect. Perfect food, perfect wait staff, perfect price, perfect surroundings....the only thing that is far from perfect is the music, int he UK ones.  Too loud, too annoying....the wait staff agreed and said that \"management\" said it was the American Way....i disagree as the NYC one did not have it!! We also checked with neighboring eaters, who were considerably younger than us, just in case it was an older persons complaint. They also found it annoying. The wait staff said they had had numberous tables of young diners saying the same.  LISTEN TO YOUR AUDIENCE!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kb-PKSFcZkTYpIcvRyKhvA"
  },
  "h46eT_0DxNWS_seCeDWe4w": {
    "date": "6/15/2014",
    "text": "While visiting London, a friend of ours suggested we check out Burgers and Lobster for dinner one night. Our group basically tried all three items on the menu and my personal favorite was the lobster roll. Good place to meet with some friends for some good food in a casual setting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6B0LaOK9AhdQe7_hmNV9AA"
  },
  "--gyeiijfI6E_TNQdbqYqQ": {
    "date": "7/21/2015",
    "text": "Very, very good place with delicious fresh food, awesome service, and great vibe.  Had the steamed lobster which was fresh and perfectly cooked.  There simple fries and salads were perfectly executed.  Will have to come back for the burger before heading home to the States.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pE4Bo8v_trE80MahMOdWpA"
  },
  "-dHddJWlPoRFOT3KHdjl2g": {
    "date": "10/24/2015",
    "text": "Finding a delicious Lobster Roll in London wasn't surprising as London has to cater to tastes across the board - what was surprising is that this place was packed and only had 3 food items on the menu.If I were a resident of London this place would work it's way onto my comfort food restaurant list.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-HNFSWxiIEzDmjWTxHZzg"
  },
  "TGdytDlTLa_HPc4G-lYoAQ": {
    "date": "12/26/2016",
    "text": "We ordered 4 grilled lobsters and the quality of the lobsters was amazing. The environment is perfect for dinning and we love the sauce! Although slightly pricy and the waiting time is quite long, it is worth a visit!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzTZEk6KSAnZ-fNU_Pt0Qw"
  },
  "vz2ykcgcCsY_rU5K0bEQag": {
    "date": "6/19/2016",
    "text": "Only a few choices, I went with the lobster roll which comes with fries and a small side salad.  The lobster roll was so very good.  The fries were pretty good, not great.  But the lobster roll is 5 stars on its own.  The side salad is actually quite tasty as the greens seemed fresh and the vinaigrette dressing was very tasty.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zpo26bYBC3rnmtZnECoVw"
  },
  "E3dm9NG4PjXxzs419kw0xA": {
    "date": "11/25/2016",
    "text": "My husband and I were visiting our daughter and family living in London and they brought us to this little gem. We had a baby with us and though they told us seating would be a wait, bam! We were in!  Service was great!  We had a menu and it was easy for us.  We split the 5th Floor combo and it came with a split lobster and a burger to rival any of the best burger joints in the USA.  Wait times for food was minimal, sides were just fine to compliment the main course.  Time-wise, we were there Black Friday at 3 pm and the place was mobbed!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPvNojLJ_CIUP4hADtP_6g"
  },
  "LmkG6RX6Q2Fwt52vSLdWkQ": {
    "date": "4/11/2016",
    "text": "Went there on Sunday afternoon. Good service, great food. £5 off for paying the bill using the Zappo app. No complaints. Recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TP4sbFxrsQIktD1IF33Maw"
  },
  "aLiuj6S3CAjswqAADJ1WPA": {
    "date": "8/5/2016",
    "text": "The service here is horrible. And the lobster is not exceptionally tasty given the price.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vy7xrZeJRnjBxHvh60rwfQ"
  },
  "LQQsyFkJmdSv0ITTRXzxtA": {
    "date": "5/15/2015",
    "text": "My husband and I have been on a Lobster Roll kick and had a local tell us this was where to get the best one in London and it didn't disappoint! From the roll to the lobster with the garlic butter sauce it was delicious! So good in fact that we plan to eat there again before we leave! My fav meal in Londonderry so far! Service was great too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T5CDyYEZ2nmylXCSajCe4g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Ready to dig into the amazing lobster roll!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T5CDyYEZ2nmylXCSajCe4g/o.jpg"
      }
    ],
    "user_id": "yFSMIJXeWInkk59YOEaSFQ"
  },
  "DTHxheUJiZlZZZXw0K02xQ": {
    "date": "7/26/2014",
    "text": "At burgers and lobster there is only 3 choices on the menu: burger, lobster or lobster roll.Went for the burger and it was a great choice. Comes With salad and fries",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0kEJMDMFuTWy7D7-agXNAg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The burger With cheese and no bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0kEJMDMFuTWy7D7-agXNAg/o.jpg"
      }
    ],
    "user_id": "jrVFb8ckqa0gTZxmUbvFkQ"
  },
  "4Z969rX5ur1wb95sSAgHZg": {
    "date": "12/4/2015",
    "text": "Three of us decided to try this place on a Wednesday night. It was crowded and there was a 30 minute wait for a table but the bar was open so we took seats there. Actually a good choice since the bartender who was also our waiter was very personable. There are three items on the menu, whole lobster, lobster roll and burger. We ordered all three. The food was served quickly and presentation was great. I had the lobster roll and there was plenty of meat in a mild dressing. The bread was disappointing, looked like a thick slice of regular bread sliced into a pocket but it was toasted (or fried) and had a spiced butter or oil on the outside. My colleague's lobster was meaty and good tasting (she said) and my other colleague's burger was huge and very juicy. We were very happy to try the place and will return if we get the chance.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "78k9hAKmW1IHeA1_dXS6XQ"
  },
  "iH7E9iUCBAWKFGYOtCuBfg": {
    "date": "6/25/2015",
    "text": "The name says it all.  They only have 2 things on the menu - funnily enough a burger or lobster and both for £20 - nice and simple.  There are a few variations and they come with salad and fries. But they are perfect.  Unbelievably tasty and moreish and here  lies the problem - it is always packed.  Get there early or grab a seat at the bar and people watch. But it is worth a wait. As to which to go for - I can't really say they are both fantastic",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ef87QhZ1jhPCJ1VluxSrbw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Great food, great drinks and great service",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ef87QhZ1jhPCJ1VluxSrbw/o.jpg"
      }
    ],
    "user_id": "E9rGNsL1p8U8SXK8yTsqZw"
  },
  "lnuKGgIkuGCf1OnehbRd6Q": {
    "date": "3/21/2015",
    "text": "I have never had the burger (I don't know whether I'll ever convince myself to try out a 20gbp burger when I can have an entire lobster for the same price), but the lobsters are just excellent. I suggest going for the lobster itself, as the lobster roll is, while yummy, quite small in comparison (and for the money). If anything, the desert menu could use a little upgrade, but there are plenty of places in the area to go for a desert afterwards. So just keep it simple and enjoy your lobster.The service is always impeccable. Just be ready for the inevitable wait (as there are no reservations) - but they do give you a buzzer so you can browse the store and look around until you're called for your table.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DsvGJeygRXPoS9kYbEWXzg"
  },
  "5ZtdiS2BSY8oDkS-6UI0WA": {
    "date": "2/17/2016",
    "text": "Great place!I found it easier to get a table than in other B&L locations.Great, friendly staff.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RdOzBS_M1BUFhGmGJnsI0A"
  },
  "jNyb5zTGUZk6XiIRc3CqHg": {
    "date": "2/27/2015",
    "text": "A great experience and a delicious dinner! I love a good burger and was not disappointed. My friend had the lobster and thoroughly enjoyed it. Also love that the menu is straightforward, 3 items, done. Wish we had a Burger and Lobster in Sydney!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rID-sL3HIy87Ig70gcuN0Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger and Lobster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rID-sL3HIy87Ig70gcuN0Q/o.jpg"
      }
    ],
    "user_id": "uhiyURfoSM8vfdCVIZdO2A"
  },
  "bAKyO0hsZWiGkfzI4g46Pg": {
    "date": "7/23/2015",
    "text": "We had the lobster roll and the burger-both excellentService was excellent. Fun atmosphere.  Lots of locals eat here.  A short walking distance from Harrod's",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGtPg-8kKM66cXlXmuzIbA"
  },
  "qpBRdEfK0Wklqnhx8FpESw": {
    "date": "12/11/2015",
    "text": "A little but of lobster please. Well if u have been here u know exactly what u are getting.  20 pound meal burger or lobster  pretty tasty although I had the sandwich and felt like a snack . But that is me more than them. Good service and vicinity . Quick and cheerful. The meal was in front of me within about 3 minutes. This was  fast dining that was quicker than McDonald's.  I will be back at some point be certain",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tu4fyZsClRRU7hRMivOkIw"
  },
  "f0EYxc56jJOOBZkdxB1kbg": {
    "date": "3/10/2016",
    "text": "Lobster was excellent (grilled). My colleagues had burgers and one had the lobster roll. Everybody loved their meals. Bravo.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "muTPhNmWJDatuN0oStfqSQ"
  },
  "jBgkgJnHxd37iDEtfXNrhQ": {
    "date": "3/10/2015",
    "text": "It was my first time trying lobster and to be honest ..... I didn't really liked it.  But the sauce and the salad were really delicious. My friends that like seafood and tried lobester before said it was really good tough. Any way It was worth a try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fQanP7rJWqEnqOR36nN7_A",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. First time trying lobester",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fQanP7rJWqEnqOR36nN7_A/o.jpg"
      }
    ],
    "user_id": "IIW3VRmVLT_BzySQv9Z0yA"
  },
  "sEK4fewSKOq8AifraDuqUA": {
    "date": "10/24/2015",
    "text": "Great lobster but I had a sore throat after finishing all of my chips!! £20, still worth trying",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2KNjdIKQwnb2mQ2AX51VA"
  },
  "GvTsHMsBeV1NNQKV6V8SNQ": {
    "date": "4/24/2015",
    "text": "Really nice lobster. Great ambience too. Suitable for friends/families. About £30 per person for the lobster and a beer. Little bit expensive given everything but it's expected in London",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kRxMh43TKJkUbgpthJOf3g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kRxMh43TKJkUbgpthJOf3g/o.jpg"
      }
    ],
    "user_id": "RyP2Q15xJclR0_rizUXqIg"
  },
  "ZAXvP3_22-TNXFt195BImg": {
    "date": "2/9/2016",
    "text": "Fantastic, I read the reviews and wasn't disappointed. Ordered the lobster roll and loved it. The fries were also very good. I would return next time I am in London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GChxexWi064HZtcGHfGZWQ"
  },
  "Jw9_YrR5C8QqodsJXhdH5A": {
    "date": "3/9/2018",
    "text": "Took a friend here and had a fabulous meal. Normally I don't splurge on lobster but this was a nice treat and the atmosphere and service was great. Personally I prefer my lobster on its own and not in a burger as that for me takes away from the taste but they had some nice choices.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-LADjmUUdF32BdOSnMAS4g"
  },
  "qbrZErKa3XdI__I1h3DKaw": {
    "date": "9/17/2016",
    "text": "Absolutely delicious food and awesome service. Busy place, but for a reason. The kitchen is open and the food is so so good! Moderately lriced, but the food is satisfying.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lO3vfraNZr968p7r5VksKA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Inside decor.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lO3vfraNZr968p7r5VksKA/o.jpg"
      },
      {
        "img_id": "tK-FQ8hnK0I3Xnx278Hm3Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The Original, 700g lobster mine was grilled. So delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tK-FQ8hnK0I3Xnx278Hm3Q/o.jpg"
      },
      {
        "img_id": "4R9FYoVbRNsXEMbKh0SxFg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The Californian burger, no bun just lettuce instead.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4R9FYoVbRNsXEMbKh0SxFg/o.jpg"
      }
    ],
    "user_id": "n6G_YGZa4GBMbwL3FpJseg"
  },
  "hwloYb0NNcdnbkrN8x1CVg": {
    "date": "7/19/2017",
    "text": "It's a chain restaurant and was recommended by my coworker to definitely try the steamed the lobster. It was a good recommendation as the lobster was really tender and juicy inside and it was such a sensation to put lobster into mouth. The lemon butter sauce was a little bit too heavy so I skipped it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rSpBFWuXiczX3Hz1qh3JoQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Original 1.5lbs steamed lobster",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rSpBFWuXiczX3Hz1qh3JoQ/o.jpg"
      }
    ],
    "user_id": "jOjOE1CfdRYcd7RmXBHZ1A"
  },
  "G_GNPaVaDC3psOxl3_93tQ": {
    "date": "3/26/2017",
    "text": "''This is my second time visiting the restaurant at this location . Both times it was great !!! Both times I ordered the lobster roll & I  LOVED IT !! Everything is great !! the fries , salad  & of course the lobster is so moist and the brioche roll so good !",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xRtZbbPXFPQy-5phdyFkXw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xRtZbbPXFPQy-5phdyFkXw/o.jpg"
      }
    ],
    "user_id": "Tptcb0k1ka-f6Io0CbgZnA"
  },
  "i3qf_SCcleRIpWqAxdwpWA": {
    "date": "1/30/2018",
    "text": "Great three sandwiches menu u cant expect more than the name of the place sides comes along tho perfect combination",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zfaeuYdSBFw6Je2QyvBOIw"
  },
  "eJ2rni3vQHdMWmN9XH-q3g": {
    "date": "6/3/2018",
    "text": "Lobster burger is delicious!!! Only place that has a real IPA beer. Staff is very friendly!! Only trick to know is the place is on the 5th floor of a shopping center.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GaIlqTnD40WHLaTiA7kfEg"
  },
  "i7NwowYVX_p8JdZYUyXBUg": {
    "date": "12/31/2017",
    "text": "Delicious fresh lobster. The Singapore roll is also yummy although portion is rather small for the price.  Reservation is recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMx4d7KQJeCv5hWJkxQLRw"
  },
  "Y1i2E63BCBhTRip02Zikhg": {
    "date": "4/1/2018",
    "text": "Huge burgers and nice staff.  A little pricey but All in all Perfect after a long day of shopping.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ulj2NxfqPs5v1cul-MnpCg"
  },
  "zuIvtNQH3FLEkZgVmx4Xkg": {
    "date": "11/4/2017",
    "text": "This place is great for a casual and comfortable atmosphere with quick service and perfectly prepared food. The lobster roll is a favorite of mine from New England, USA, but these guys are a close second. Good quality. Friendly staff. Pleasant and casual atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9kD9ednSiHPv5CuGk0uUw"
  },
  "pXeHL8dg5_OGd1vIQcRsWQ": {
    "date": "12/1/2015",
    "text": "I've been meaning to try this place in NYC but never got the chance so when we were heading to London, I knew I had to try it. We got there at around 9PM on a Saturday and the place was packed. We got pretty lucky and got a high top right away and didn't have to wait for a table. We could have also sat at the bar. We ordered the burger and the lobster roll - both were realllllly good! Burger was cooked perfectly and there was so much lobster in that little roll, never would have guessed. It was really good but not sure I would go back seeing as how expensive it is! Maybe if we both ordered the whole lobster, I would have thought it was more worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QbKrjRXuScMHIZLXC30-og"
  },
  "QGh3AEdTJmvI9Yvv8CU4gw": {
    "date": "7/5/2017",
    "text": "I'm from the US.I ordered the crispy calamari as a starter/appetizer. However, not only was it served after my main meal, it was too salty for me to finish eating. After eating a single piece, I talked to the manager who told me that there was no salt in the calamari and that perhaps the breading had salt. Either way, the restaurant was denying that it had salt and I couldn't enjoy my food. The lobster and burger were also salty but durable; in any case, if you don't like food too salty, this is not the place for you. All my orders were salty. If you do want to try, prepare for the salt.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lbKw2WEKchA6iK0BjBhK-A"
  },
  "RZItFvapXrv9Y6kil1nZkg": {
    "date": "7/23/2015",
    "text": "It's our fourth day in London and we decided to try out this place.The restaurant was empty when we arrived.  Lucky us! As I walked by the restaurant the other day, the queue was so long that I couldn't even see the end of it.  They don't have a food menu, our server (very nice guy) explained to us what food they were serving.  Basically, we can choose grilled/steamed whole lobster, lobster sandwich or the normal beef burger.The lobster sandwich was just fabulous, lobster meat mixed with their special dressing with crispy grilled white bread.  I just can't stop eating, and the fries were just how it should be - crispy yet soft in the side.  The burger, not as exciting as the lobster sandwich but it was not bad at all.  Extremely attentive and service oriented, not to mention the food was amazing as well!We are planning to visit again before we leave London.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PBaRESznGVnCoJWUX1ijKg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Not so exciting beef burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PBaRESznGVnCoJWUX1ijKg/o.jpg"
      },
      {
        "img_id": "Ppp0xkLUsrvPktG3BUzY_g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Grilled lobster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ppp0xkLUsrvPktG3BUzY_g/o.jpg"
      },
      {
        "img_id": "zsxIB8si8Iu1PAjOX6LzFw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Best lobster sandwich I had ever",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zsxIB8si8Iu1PAjOX6LzFw/o.jpg"
      }
    ],
    "user_id": "IOno7gA0w4CB8rq5ODzgLQ"
  },
  "37qgrVn3_6HLicXce6ychQ": {
    "date": "9/24/2015",
    "text": "After a day of shopping it was time to refuel. I was extremely skeptical since I live in the states and this restaurant was categorized as traditional American. The burger did not disappoint. It was flavorful, juicy and cooked as order. This burger was better than a very popular place in LA. Also, the service was great and I enjoyed the atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LE3Z-kAndCscDYv8CZGoBQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger with everything",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LE3Z-kAndCscDYv8CZGoBQ/o.jpg"
      }
    ],
    "user_id": "5eIaMYhMP5APRnYKTafmsw"
  },
  "xaRD6BTyWb4UTs-w3L13VQ": {
    "date": "4/25/2016",
    "text": "We visited this spot twice while in London. It was right around the corner from our hotel (The Levin) in Kinghtsbridge. The first evening was for a late night dinner at the bar, second time was for drinks only. As you probably already know, the menu keeps it simple: you want a burger or lobster? Can't go wrong with either choice! We should know because I had a delicious lobster roll and my companion has a delicious burger, both served with yummy shoestring fries. Service was friendly and efficient. As a bonus, the restaurant is located inside Harvey Nichols department store, which is a whole lot better of a shopping environment than Harrod's.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PEm8lcae89_fjJV86AoTxg"
  },
  "hzBysE4faWmZoE9IVw_Iiw": {
    "date": "9/4/2015",
    "text": "I loved, loved, loved this place! It also popped up on my newsfeed and I finally got to try it!There's only 3 main courses on the menu: burger, full lobster (steamed or grilled) or lobster roll which amount to £20 each. We opted for the full lobster (steamed) and lobster roll.They are both to die for! So delicious since the full lobster was so juicy and full of meat, it was really fresh as well! I managed to get all the lobster out of its nooks and crannies (couldn't let it go to waste) and was fully satisfied after the meal.The lobster roll was served on a toasted brioche bread with lobster and mayonnaise inside, the dish is served cold, but the mixture of sweetness from the brioche bread and lobster alongside the saltiness of the mayonnaise made it a perfect combination! The chips were thin cut and crispy, it went well with both the lobster and lobster roll.The staff were all really friendly and you could tell they had a great synergy between them which created a good vibe in the restaurant.If you're in London or Manchester in the UK, you DEFINITELY have to give Burger and Lobster a try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QL20zE2e1Dk4a5zNy0XJQg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Close up of how big the full lobster is!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QL20zE2e1Dk4a5zNy0XJQg/o.jpg"
      },
      {
        "img_id": "fI5EvkUaJfUOyaBzORZ0Vg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster Roll: Scrumptious, the brioche bread with lobster was a great combo!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fI5EvkUaJfUOyaBzORZ0Vg/o.jpg"
      },
      {
        "img_id": "gblRS8eSlu5Z6tCfd64R_g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Full Lobster = Juicy, Sweet, Amazing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gblRS8eSlu5Z6tCfd64R_g/o.jpg"
      }
    ],
    "user_id": "8IjqK6JHxvsNTWJvD-Xddg"
  },
  "OFjxYqotzNuzUfcOZ_0HcA": {
    "date": "12/7/2015",
    "text": "Burger and Lobster is the BEST! I mean what else could you ever want to eat besides for burgers and lobster rolls??As expected, B+L executes both exceptionally. Juicy, medium rare burgers and delicious, buttery lobster rolls. And even better, everything comes with salad AND fries and is the exact same price regardless of what you get - burger or lobster. Easy, cheap-ish, and insanely delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "UDrVdIeUNnmBT3__dJchCw"
  },
  "MesdWFo12geXNvSUCS4lEA": {
    "date": "1/24/2016",
    "text": "I love lobster, but never eat it in London.... Too expensive. But then my friend told me she had never had lobster!! I had to rectify this and so, off we went to this affordable lobster chain.This particular branch is just off the food hall of Harvey Nichols, on a quiet night in the store, the restaurant was buzzing. Could still get a table at 7.30pm on a Friday with minimum wait.They begin by telling you the 3 options, but not the 4th burger and half a lobster option. There's no starters or dessert menu, everything is rattled off by the waiter. There's a full drinks menu and we both had the rum, pineapple, jasmine and lime option which was excellent.Along came our lobster plates at break-neck speed. Impressive presentation and portions. Lobster was steamed and delicious in taste. The salad had unnecessary parmesan. They give you JUST enough butter sauce (but I'm a greedy girl) but the chips were undercooked, standard skinny fries.This place fails at customer service, only providing 1 meat-reaching device, not cutting all the shells so 2 people at 1 table had issues getting the meat out of the shells. Not filling up water, not bringing change, no thank you from reception as we left. I did appreciate the super thick napkins and the bibs though.Overall, I liked the lobster, the sauce and the price so I'll go back, just without expectations of service which is fine. Now that I know.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "n8w-TgVOXaISN6Kyoogo1Q"
  },
  "fYwxjP6Y8pmDjjQxxb8VGA": {
    "date": "1/21/2016",
    "text": "The Lobster and Lobster roll is soooo delicious!  It is a great stop for lunch while you are shopping.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JG3pVPcDg3vs8Y7XBZZ2cA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster, Lobster roll, salad and fries! Fantastic!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JG3pVPcDg3vs8Y7XBZZ2cA/o.jpg"
      }
    ],
    "user_id": "iG4aG5dS3qLNmLxD1swaqA"
  },
  "MA8oCJ1SZ-x0ecjVg5oBjQ": {
    "date": "12/30/2015",
    "text": "This restaurant is on the fifth floor of an department store.  They have three items that they do well, Lobster (whole), lobster rolls, and burgers.  I had the lobster roll and it was great!  It is difficult to prepare a bad lobster roll, however they elevated by adding a some a unique butter sauce on the side.  I could eat there everyday as long as I was able to work it off!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1r9PAS8macaEQ8YySn4wXg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobsters roll, fries, arugula salad!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1r9PAS8macaEQ8YySn4wXg/o.jpg"
      }
    ],
    "user_id": "C-ct2LqVgyJqw7yZmL2itA"
  },
  "5z-oaI4Bu-VlOhmCQJmUEg": {
    "date": "3/1/2017",
    "text": "I think the best burger in London. And the service is top notch. Guido was my waiter today and as usual , his service was attentive and on point. Knew his menu as well. I had the burger and lobster last time and I've never been a huge lobster fan and it didn't change my mind. BUT if I'm craving a burger, I make my way to Burger and Lobster. I'm assuming the management must also be great because the staff really seems to know what they're doing and the kitchen is always right on. Medium means medium. Etc.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSFUcrJcgWwxidpwnRwXiQ"
  },
  "avH7V-TbWxT6w9rnjauiZA": {
    "date": "10/9/2018",
    "text": "For reasons I cannot explain, I was craving a burger recently. The last time I was craving a burger was never. I read some great reviews on B & L while I was in my hotel room and decided the 30+ minute walk to get there might just be worth it. Once there, I found myself sitting at the bar. Immediately I was greeted by the bartender, Rikardo, who made me the most perfect Old Fashioned. I asked him about an item on the menu: a hamburger with melted brie, AND fresh lobster meat on top of that?? Insane, right? He said go for it. OMG! It was one of the most amazing, mind blowing experience, and (may I continue to say) it was orgasmic. It was a messy meal, but I had never been so happy as I was at that moment when I had burger grease slithering down my lower lip, melted brie hanging down my mouth, and lobster meat falling off my delicious burger. Rikardo happily provided me with a bib and extra napkins.I did not inhale. Quite the opposite. Took more than an hour to savor this dish with a couple of Old Fashioneds. The burger also came with a side salad and fries. B & L automatically adds a 12.5% service charge (it tells you that on the menu), which in my opinion was not enough for the excellent service I received. I was more than happy to add a few more £'s. I was at the bar by myself and Rikardo really kept an eye on me. I appreciated that. 10 stars for service. 10 stars for the most mind blowing burger of my life. Side note: If any Boston chef is reading this, can you add this to your menu? Then PM me that you have it on your restaurant menu. I'll be right over. I am not kidding.",
    "rating": 5.0,
    "rated": {
      "useful": 51,
      "funny": 28,
      "cool": 47
    },
    "photos": [
      {
        "img_id": "Mbnwidg-99xweW6UM4D-Dw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Rikardo, the BEST bartender in London!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mbnwidg-99xweW6UM4D-Dw/o.jpg"
      },
      {
        "img_id": "vL6yhx8ngN5JmrGOw9bxqg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster Burger w/ Brie. OMG It should be a sin to have something this good in your mouth. Thank you sweet baby Jesus! With an Old Fashioned.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vL6yhx8ngN5JmrGOw9bxqg/o.jpg"
      }
    ],
    "user_id": "FtTwsdIffvlrkoqnDtpLTQ"
  },
  "GueJE3JsWItnN7x7RENnvA": {
    "date": "8/7/2018",
    "text": "Huge disappointment. As a burger lover who was in a serious need of some nice food after a long morning, I went to BL based on the raving reviews. While the Pattie was jusy (as it should be), the meat had little to no taste. Maybe the seasoning was off - not sure, but worth the money it was not. I complained to the manager who said he was sorry to hear that but offered nothing to remedy the situation. No more BL for me...",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cvBjjjudwfxSa8-7DpWFTQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Classic Burger with Cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cvBjjjudwfxSa8-7DpWFTQ/o.jpg"
      }
    ],
    "user_id": "UsFX95QeHVEDX7gsX9Fi5w"
  },
  "yzRY5tmBY57qMWavwgY5jg": {
    "date": "10/27/2017",
    "text": "For the longest time, I couldn't figure out why I ate at Burger & Lobster multiple times during each visit to London. I can easily find better lobster rolls back home in the U.S. without being gouged by the painful pound-to-dollar exchange rate. But then it finally clicked: Burger & Lobster is the perfect place to people watch. This experience begins before you even decide to eat here. Maybe you're amongst actual Londoners, enjoying a stroll in nearby Hyde Park. Or maybe you're at Harrods down the street, mingling with other tourists, in awe of what must be the world's most extravagant department store. Maybe you've just gotten off a train at Victoria Station and push through hordes of commuters while realizing that you're absolutely starving.Don't worry, Burger & Lobster has got your back. Make your way to Harvey Nichols (again, mingling with locals and tourists alike), take the elevator up to the fifth floor, and get seated. if there's a wait, wander around on the fifth floor. There's a food hall here, and you can observe other visitors or flip through some reading material.Order the lobster roll. The lobster meat is fresh, succulent, and tender -- while I would have liked a bit more lobster, the garlic butter on the side is so good that it should be illegal. I was also surprised by how good the dressing on the side salad was.London is a melting pot of cultures and I love being reminded of this whenever I'm out and about. However, I didn't love being charged for tap water, but I guess that was just a reminder that I wasn't in the States anymore.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "35GpxESlwQLvq-K3t62mxw"
  },
  "YG37PpjplRqPBAnts4eGuA": {
    "date": "6/24/2018",
    "text": "Well this is such a fun find. I know London is the place for fish and chips and bangers and mash but something has changed and they are putting some foodies in charge of the food. We decided on the combo lobster and burger and wow oh wow were we glad we did. It was all cooked perfectly. We had a martini to start with and I must say it wasn't the best... but I think London town likes gin martini's over vodka so it is our fault for ordering a drink from our home town. I wish you would bring this restaurant to Dallas. We would be here all the time. Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "Acq_rUflSL2KdaMfCjNNJw"
  },
  "ERJw0mNBGdmkznkq4fmLkw": {
    "date": "2/15/2018",
    "text": "Burger & Lobster is located in the Harrod and at 5 floor.  The combo meal comes with 1 lb Lobster, burger, french fries and salad. The combo and the Lobster roll were really great, recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5AcBCJFhDl35KGOB2ZeUfw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5AcBCJFhDl35KGOB2ZeUfw/o.jpg"
      },
      {
        "img_id": "PEbE01b8M4sSAyiSYYG3pg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PEbE01b8M4sSAyiSYYG3pg/o.jpg"
      },
      {
        "img_id": "df6nhDZ41mepx-qtNcihXQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/df6nhDZ41mepx-qtNcihXQ/o.jpg"
      }
    ],
    "user_id": "0opgtcPNP7S76mccVfWi8g"
  },
  "OOsW0MmzxQUoRLFOujsc7w": {
    "date": "6/1/2017",
    "text": "I swear I had the most delicious burger here! And the staff was pretty great, too.My choice was the lobster burger: 6oz burger topped with lobster meat, brie, truffle & tarragon mayo, fennel and Chinese cabbage. The flavors were great! Somehow lobster and beef marries well. I didn't taste the Chinese cabbage as much, but it was still delicious. The menu is limited and simple. I think this helps them succeed in executing consistently and quickly. We really don't need a hundred things on the menu and they offer what they say: burgers and lobster. You can get them together, or not and choose just a burger or just some lobster! (they also have a bean burger)I also loved my cider there which was local, Aspall Suffolk draught cyder.Just cause I was enjoying everything so much, I started chatting with the manager as he passed by about how good my experience was and how I can see how the execution is so well and understanding the concept, overall positive stuff - he was so kind and said, can I buy you (and your friend) another drink? Well, sir?! What -- I mean, yes!  He said it was a rough night with some complaints and I made his day by talking to him about good things. Now we were all happy! :) Yay!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oKVhMYbB-KYmEsFQHP3Exg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Prawns with tarragon sriracha mayo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oKVhMYbB-KYmEsFQHP3Exg/o.jpg"
      },
      {
        "img_id": "GTYiVN_iVVJf33uikEiDFw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Best burger I've ever had, lobster meat, Brie cheese, truffle, tarragon mayo, fennel, Chinese cabbage, salad, & chips - medium",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GTYiVN_iVVJf33uikEiDFw/o.jpg"
      },
      {
        "img_id": "1QKsDLWiRO6oF3cBXvjQCA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Best burger I've ever had, lobster meat, Brie cheese, truffle, tarragon mayo, fennel, Chinese cabbage, salad, & chips - medium",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1QKsDLWiRO6oF3cBXvjQCA/o.jpg"
      }
    ],
    "user_id": "0hDy_Y29b_Np4CidP_aylQ"
  },
  "tgrHME706hAT97doCj5Jsw": {
    "date": "4/15/2018",
    "text": "I have to say I know London is best known for its fish and chips.........but burger and lobster is phenomenal! I do consider myself a lobster connoisseur, I've traveled and eaten great lobster from lobster well known States/country's but this lobster was absolutely amazing. Fresh Maine lobster is wonderful rich, sweet and luscious however I have a new favorite! I've never had such a delicious lobster, you can have it steamed or grilled, I choose grilled with a side of lemon garlic butter when it arrived I was speechless! It was a absolutely delicious experience. The burger was fantastic also great meat cooked to perfection, strange combo but it works! This is what enticed my friends and I to try it out. There are several locations we choose the Harvey Nichols location \"was the closest to us\" My friend had the lobster roll and was again the best roll I had sampled! Maine has nothing over lobster and burger London. Side not the lobster burger was equally delicious, Brie cheese tarragon mayo supurb! The good thing about going with friends is you get to sample everything! Appetizers was great also, but I recommend saving your appetite for the great lobster! Sorry Maine, London's got this one!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Akxjx75DQt4465-SdULz-g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Akxjx75DQt4465-SdULz-g/o.jpg"
      },
      {
        "img_id": "UbOczrgffWogWGHc2osgWA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UbOczrgffWogWGHc2osgWA/o.jpg"
      },
      {
        "img_id": "I0EBRTSIy0pWRX2PLvjkTg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I0EBRTSIy0pWRX2PLvjkTg/o.jpg"
      }
    ],
    "user_id": "xXWUgFpC5w-PwuZ_MES2Kg"
  },
  "c4Fsbw-i5Rgp9hYxZ1TCCQ": {
    "date": "4/4/2018",
    "text": "Getting a later dinner in Knightsbridge and this place had some good reviews. Harvey Nichols was closed but the restaurants on the 5th Floor were open and had a dedicated elevator. Got a table after about 3 minutes which was great. You are paying for the location no doubt. There are burgers, lobsters and lobster rolls and combos. I had the Singapore Roll which was lobster and prawns with a spicy sauce. It was good. It was also 22 pounds. Burgers were good. Son had a burger lobster combo which he really enjoyed. Probably would be 4 stars if not so expensive. But worth it for the experience I suppose. Service was good. They added a service charge on the bill so no need to leave anything extra,",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "RaZ2286VnFLZDFYAmw-gCg": {
    "date": "4/30/2018",
    "text": "Superb burgers! Would definitely go back! It's a bit pricey, but really worth it! I had the burger with bacon and cheese and my bf got the burger with lobster, also amazingly good!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYSAsozQJf7kzbbSBH4HJw"
  },
  "B0rhQIjltltqZ7kEBBI3eg": {
    "date": "2/11/2018",
    "text": "We were starving so we stopped by Burger and Lobster because they were able to seat us the fastest. Essentially, their menu is a few burgers and whole lobsters. We didn't get any lobster, so the review is just about the burgers.Ugh. This place is EXPENSIVE. After conversion to USD, how did our bill come to $65 USD???? And the burgers were so mediocre. They were juicy but lacking SO much seasoning. I had to douse it in salt, pepper, ketchup and mayo just for it to the some taste. As someone from Los Angeles, I would not recommend their burgers to anyone from America. Surprisingly, their NYC location is super popular... maybe they season their burgers there?",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "D7IONMrpSX9PuJdelvAWVA"
  },
  "Mc4_hm4Pxm0tDfpIAf6_RQ": {
    "date": "8/10/2017",
    "text": "Delicious and good amount of lobster. Wish the fries weren't so generic- could be better quality. Staff very friendly.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v_iGCb8CR3NmcFENGnptRg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster Roll, 25",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v_iGCb8CR3NmcFENGnptRg/o.jpg"
      }
    ],
    "user_id": "u4qzfPNQtRErtLf5K5UIXA"
  },
  "mWVLQxEckpgUsxPncqrm5Q": {
    "date": "12/30/2016",
    "text": "I was in London for a couple of days before heading to Amsterdam. I was looking for a place for dinner and found it on Yelp.There were good reviews, and it was walking distance where I was, so I decided to try it out. I arrived here around 5:30pm and didn't have to wait to be seated, but the restaurant was busy. The menu was very simple and easy to see. I was craving a burger, so I ordered a cheeseburger with fries.It took about 15 minutes to get my food. I asked veggies on side, and they also separated sauce from a bun. My burger was perfectly cooked, and the patty was very tender and flavorful.The sauce was very good and went well with my burger.The service was alright, and the portion was generous. The price was decent, and it's located in the convenience area. Walking distance from Harrods.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "WOio2DwpALMmw0bD8zTHxA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WOio2DwpALMmw0bD8zTHxA/o.jpg"
      },
      {
        "img_id": "-QnHAk51duRlhE0FyzTwDg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-QnHAk51duRlhE0FyzTwDg/o.jpg"
      },
      {
        "img_id": "v5LnWpwJbMnHamVsHXMPMg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v5LnWpwJbMnHamVsHXMPMg/o.jpg"
      }
    ],
    "user_id": "qVuZit1iyRNc_0eqdBYgYA"
  },
  "IRfOa0BvwDk9iuz2HPL_Pg": {
    "date": "3/13/2018",
    "text": "Amazing burgers. Amazing lobster. Amazing drinks! This place does two things and they do them fucking well. You will not regret it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MryYEdlGXJ9S9_lbyc6_cA"
  },
  "lnjJToJ7kDCVwAgcPapR_g": {
    "date": "3/3/2018",
    "text": "After our first visit to New York, we also enjoyed Burger & Lobster in London. Great food, very good wine. And of course a very nice service. Gladly again. Where else in the world are you?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VPt83UN44gMyENYkMPZAXw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VPt83UN44gMyENYkMPZAXw/o.jpg"
      },
      {
        "img_id": "CLL1rs12e6RIUiKBdHGlvQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CLL1rs12e6RIUiKBdHGlvQ/o.jpg"
      }
    ],
    "user_id": "jxWzRK7kVDXBp3KyiW2Vfg"
  },
  "Yh9tA6RRbW-JpsQIG4r-_w": {
    "date": "12/24/2017",
    "text": "I have been here a couple of times and I noticed the  prices gets higher every single time . Now a standard lobster and chips meal cost £31! While the bigger lobster portion will cost you £40! We were a family of five and hence the total damage was about £250 ( includes a bottle of white wine). I would say the garlic sauce hasn't been as good as previous years. While I was satisfied with my lobster meal, I'm starting to think that burger and lobster is becoming too commercialised and is starting to charge its customers at very steep prices. Service wasn't that great either - no smiles and long service. Overall, it's becoming a little overrated for a lobster meal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uth-22gkADhMezPVEOMWYg"
  },
  "Vvy59SGYagOXptViVRnMRg": {
    "date": "6/19/2018",
    "text": "Amazing! Lobster roll was absolutely stuffed with claw meat. Hubs had lobster burger which he inhaled. Even the side salad was yummy. And loved the shoestring chips. Nice selection of cocktails. Visited at a non-busy time of day and service was very friendly and helpful. Pricey but worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pBVId24co8JGhR8RGqWDDw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster roll to die for.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pBVId24co8JGhR8RGqWDDw/o.jpg"
      },
      {
        "img_id": "n_a_pHjH4skOUnjfjv8qrQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Pimm's half gone. So refreshing.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n_a_pHjH4skOUnjfjv8qrQ/o.jpg"
      }
    ],
    "user_id": "VYzyEH5TUsKiem6MaqIhhw"
  },
  "BfuM4rVzwQ3PIcywSI8ehw": {
    "date": "2/13/2017",
    "text": "Bad ass food! Burger and lobster is the name, and they know how to play that game. Damn the food was good! My lobster roll was delicious. The lobster meat was piled onto the most glorious buttered brioche roll. Wowza! And whatever they garlic butter is that's on the side is sinful! My friend got the lobster burger aka burger topped with lobster and Brie and other culinary delicacies, and he loved it! We left with smiles all around :)",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ro6RBJO5r_ba0lYTZWLkCA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ro6RBJO5r_ba0lYTZWLkCA/o.jpg"
      }
    ],
    "user_id": "osM4Ssqj-w-JTXGVe7TTuA"
  },
  "dhs_ERgkixv6Hn1LoXAVcQ": {
    "date": "2/2/2017",
    "text": "I didn't have a chance to partake in Burger & Lobster the last time I was in New York, so I was excited to come across them in my recent London travels. After working up an appetite window shopping at Harvey Nichols (& nearby Harrod's), we decided to have lunch at B&L located on their 5th floor collection of eateries. The £25 lobster roll is jam packed with lobster -- definitely no skimping here. He chose a combo with the split lobster cooked two ways: grilled & steamed. I tried a forkful of the grilled & it was firm & delicious. Lovely butter sauce was sprinkled with chives & had a hint of garlic. Positive remarks for his burger, as well. It's no small triumph that they do both items named in their brand smashingly. Friendly waitress; nice vibe & bustling atmosphere; a good place to re-energize & be off your feet for a little while. Sidenote: their shell cracking apparatus, shaped like a lobster claw, required much strength & effort to use.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "pQVzOZLt3lIomS7j0C17tg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. His & hers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pQVzOZLt3lIomS7j0C17tg/o.jpg"
      }
    ],
    "user_id": "kZJWAY828P8QZTqVYzhTCg"
  },
  "MxHKbJZwtj9tviyzpplROw": {
    "date": "12/3/2017",
    "text": "If you're looking for a burger with lobster, with a bit of lobster on the side and a lobster roll to die for plus lobster, lobster, lobster? This place is the lick!What made it perf, you ask? Our lovely waitress and wait staff. Will be back to this one for sure!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "535xnTtc7xPMj_D5IAX8fQ"
  },
  "69pa2EQld3tY2-NzDOIhEw": {
    "date": "12/24/2015",
    "text": "This restaurant only offers three meals:  The Traditional Lobster Roll with Fries and a Small Salad, a Grilled or Broiled Lobster with Fries and a Small Salad, or a Burger with Fries (and perhaps the same Small Salad).While it was surprising to not have a menu offered to us when we sat down the small selection made the ordering of our meal very easy.  What's more, the food came out relatively quickly and you would hope so!  If you only serve three meals \"they sho nuff betta be good\"!!  Yes, I meant it that way!The food WAS awesome and we enjoyed everything (totally pushing to the back of our mind that the meal was priced in POUNDS)!While we waited an hour for our table the restaurant is conveniently located in a mall with plenty of browsing available while you wait.  I would totally recommend this restaurant!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JbYfPuwrCrDzIVKh3Y_PuA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. You can order an extra set of fries if you're very HUNGRY!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JbYfPuwrCrDzIVKh3Y_PuA/o.jpg"
      },
      {
        "img_id": "-Kolr8A7SRb0ch3f2EHnRQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. This was the VERY BEST LOBSTER ROLL ever!  And I mean EVER!  It was worth the HOUR wait!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Kolr8A7SRb0ch3f2EHnRQ/o.jpg"
      },
      {
        "img_id": "RZYSgQI8Z8SpowgC3m_8Gg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The shoe string fries were salted JUST RIGHT!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RZYSgQI8Z8SpowgC3m_8Gg/o.jpg"
      }
    ],
    "user_id": "V951o5RxrPxKK4qM5O-MdQ"
  }
}