{
  "RYBU926TdYjOU6rjpKL_Kw": {
    "date": "6/12/2016",
    "text": "This is one of my favorite restaurants because of the convenient location and the speed in which they prepare take away orders. It is a very busy restaurant, but I have never had to wait more than ten minutes for my order. They prepare the best curry katsu I have ever had (prawn or chicken) and make incredible starters. Some of their more standard dishes such as chicken teriyaki or pad thai are less than exciting, but their specials are amazing. The sushi is good as well, but I almost exclusively order the curry now. The portions are a great size and the prices are reasonable. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9jKZvIAgptNdpAKr76RfA"
  },
  "ccGC2Gtk1bws5WiLaYESMw": {
    "date": "1/12/2013",
    "text": "This place was such a good find! I'm always on the lookout for places I can depend on for a satisfying quality \"fix\" and this place is perfect for a sushi craving:) The salmon sashimi was fresh, the maki rolls were tasty, and the miso was good, so tick, tick, and tick for all my sushi needs! The noodles were good too, not amazing, but a generous portion of very satisfying noodly goodness.The prices were reasonable and the place was clean. The service was fine and the food came quickly. The restaurant is hard to find but I'm so glad I know it now! I went for an early dinner with a friend, but I would recommend it for an anytime quality sushi fix. I will definitely be back next time I'm craving good sushi!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PWOk9EXCeuwHAayusD8oXQ"
  },
  "naOlSrmG8CiuuUS9Gcag8Q": {
    "date": "3/19/2016",
    "text": "Nice place opens on Saturday for lunch. The waiters were not really friendly today maybe because we are not on a busy day. Starters are quite expensive but mains are good bargains! Food is tasty, species are well managed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YIyKYXuJJI7i-pU24XBzGA"
  },
  "pmgPWcBe6WsqWKLgTGWdIA": {
    "date": "12/4/2013",
    "text": "So my problem with Wagamama is that it looks like they chucked a bunch of Tesco stir fry bags in a vat of soup mix powder and called it a day.  Hare and Tortoise is pretty much the same.  The laksa noodles were tasteless and bland, and although the serving size was huge, I lost my appetite pretty quickly.Sushi is also Itsu quality.  Seriously man, save your money.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "xUbWx9apCEuw_IergHJH1w": {
    "date": "2/13/2014",
    "text": "Great food, great value.I never get tired of the Hare and Tortoise.  We come here for lunch on a fairly regular basis.  The food is great.  The Singapore noodles and chicken katsu curry are the best I have tasted anywhere and I order them regularly.  I have also tried their soups.  The grilled chicken ramen, curry laksa are fantastic and so filling I can't finish them.  The only thing on their menu which I tried and was not impressed with was the Tom Yum Noodle soup but considering the size and variety of their menu I won't hold that against them.This place is really popular and if you want to come here for lunch you really need to be here by midday otherwise you will be waiting for a table.  The service is pretty good and you get your food quickly.  They have a great selection of drinks as well both alcoholic and non-alcoholic.  I particularly like their raw juice.  The prices are great too.  A main course will set you back around £8 and you will be full for the rest of the day.They also do take away which is a good option if you can't stay out for lunch.I am slightly loath to recommend this place as it is so popular already and hard enough to get a seat some times but if you promise not to go there before midday then go right ahead and give it a go - you won't regret it I promise!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IqBqV2IUsupilRyofrNcGA"
  },
  "llsLwhwopTHjh7O7Mk62kA": {
    "date": "6/28/2015",
    "text": "Best value ramen I've found in London - and huge portions.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zP53rcqQXGfhr0IVk-4jYQ"
  },
  "aJRUTW3nvoDqn-CntzG_BQ": {
    "date": "12/12/2014",
    "text": "Delicious, efficient and affordable, a gem in the barren culinary wasteland of Bloomsbury. We arrived at around 8:30 on a Friday night and were lucky to get a table without waiting. Everyone who came after us had a few minutes' wait. The starters - veg tempura, prawn gyoza and chicken rolls - were delicious. The roast duck was the best I've ever had. The laksa and Malaysian curry both looked and smelled incredible, and judging by the noises being made from my table mates, tasted just as good. Oh and the portions were huge!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4AQCCtgg_IXVjgKR5PlMdQ"
  },
  "gEupKrDyow4DjcdyJ2ObrQ": {
    "date": "3/27/2015",
    "text": "Good selection of the menu, fast paced service without rushing too much and a nice location. We'll come back soon!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "868jo7D2a4Dx8U0l588boQ"
  },
  "EMfoVxtIrhuMwPhPJwoAGQ": {
    "date": "3/28/2015",
    "text": "Love this place - the wait is never long for a seat even during lunch hours. Service is fast which is great for the general hour lunch break. The food is delicious, I'm always dubious when places mix cuisines together but the ramen is just as good as the kueh teow. The brown rice tea is amazing and sushi is fresh, you can actually taste the flavour of the sashimi rather than the bland cuts from wasabi/itsu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1VHLWYNBEPVxnNFyoP9-g"
  },
  "MOhiKubdDB-AIFb2upX7Ww": {
    "date": "9/9/2011",
    "text": "Quick glance:+ generous portion size+ fairly priced+ swift, courteous service- easily mistaken for a pub from the outside!- small surcharge for credit card payments under £10I work fairly close by and have visited here for lunch a couple of times on workdays, when it tends to get quite busy. There is usally a queue during weekday lunch but if you are coming as a couple the wait is usually shorter than that for a group. The food is a mixture of Japanese, Chinese and southeast Asian foods, such as sushi, teriyaki ricebowl, fried noodles, etc. If you are familiar with the Wagamama chain in the UK, then this is a more atmospheric, tastier, and much cheaper version. From the outside, the sign and decor give away no indication of the type of establishment and I had initially mistaken it for a gastro pub serving Asian food, so I was really pleasantly surprised by the quality and price of the food. At the entrance is a fridge with foods you can buy for takeaway. You have to go downstairs to get to the restaurant, and insdie it's not particularly big but it's buzzing with happy diners. It's well worth a visit for a quick, fairly priced, hot meal when you are passing by and feeling hungry.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "uLoojpAH3e4zXD4fDa3rCA": {
    "date": "10/17/2014",
    "text": "Good selection of sushi and sashimi.  Fast & Friendly service. The fried shrimp dumplings were ok, nothing to brag about. First place I've had tuna belly, which I found to be a little tough.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGzTlfp-eOW5Yll1_iEPjQ"
  },
  "r4NBqKnjPItBisiETxd3XQ": {
    "date": "8/18/2011",
    "text": "Tasty foodlooks fresh and cleanswift servicegood pricingDefinitely recommended... no more needs to be said!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GhqQSkvHwHzKwiOFlEBzIw"
  },
  "Y5GElrVi9WKdq1HHkgtdog": {
    "date": "5/4/2012",
    "text": "I found through Yelp. It's near Blackfriars with some great pubs nearby. The restaurant is downstairs so quite secretive at street level.Inside it's buzzing with efficiency. Kind of like Waganama but so much better. Pan Asian favourites including sashimi, noodles, ramen, laksha and tempura.Clean and modern. Post City crowd who know where this place is.Service is prompt. Food arrives quickly. Portions are generous, well made and tasty. And best of all it's great value. An instant hit with me.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "5Iv1Mggwcqw-kvkif3VkpA": {
    "date": "12/8/2014",
    "text": "Quite nice for a chain restaurant. The Magura Tataki (tuna) was nice but the tempura udon was a bit bland. The pricing was weird though. A glass of wine was more expensive than a main course (aye, the wine was vastly over priced). I'd go back but it wouldn't be somewhere I'd make a big effort to go to. Much better than the likes of wagamama and the like.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OZriGJc-HL3Qbpnv6T9s_w"
  },
  "8T5WwMoLR7tW6GhZstUUsQ": {
    "date": "10/10/2014",
    "text": "This is a great place for lunch if you work in the area, quick service, reasonably priced and very tasty! Try the Pad Thai, yummy!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "93lF4OACV_54SuguODnbpw"
  },
  "TqXYc45-Tgb16LBBvH0kbw": {
    "date": "2/24/2011",
    "text": "This place is solid. :)I didn't think they served Asian fare given the name of the establishment, but was pleasantly surprised when they served fresh sashimi and good sushi.In addition to the fresh fish, my colleague and I ordered a noodle dish - the Char Kuey Tiew New (talk about a tongue twista!). This dish was so good. I would describe it as a cross between pad thai and beef chow fun. The ingredients are similar to what you'd find in pad thai, but the taste was more savory and less tangy, like beef chow fun. I loved this dish.Overall, the prices here are very affordable for UK standards! The noodle dish was a mere six pounds for a pretty large portion, especially for the UK. I was expecting a side portion but was surprised when a plate of heaping noodles and prawns came out.Many of the other dishes looked and smelled lovely as well. I would describe the atmosphere here as trendy and busy  - it's a bit dark and sleek, and the place filled up quickly for dinner. We got to sit near the kitchen in a booth and the smells were so lovely. I would definitely come back - it's a great place to have some sashimi and a cold ice beer after a long day of work...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUe6WiXlsjIRBLOZcJa3cA"
  },
  "dH09EHNl8zUW7M-ebyQs5Q": {
    "date": "1/5/2010",
    "text": "This place is amazing! Went with friends sometime last year after craving Sushi and refused Yo!.. a walk well worth it!This is the sister branch of the one in Kensington and Covent Garden and is an amazing value for price versus quality. Serving Pan-Asian cuisine, I had a lovely seafood ramen soup which filled me up and what I believe was a spicy salmon roll. It was some of the most authentic and best sushi ever. The quantity of food was massive and we rolled out of there stuffed to the gills with sushi (pun intended) and more than pleased with the service we received.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "b5ZX1k6MGdDD-43uyONBug": {
    "date": "10/19/2012",
    "text": "Waiter didn't know what some of the things on the menu where.  The food was average, but then again um use to food from Melbourne. However the sashimi was fresh.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fg0DljkO_phbdrIZ85gvXg"
  },
  "JZFDWqxHgnj8igygLfxehg": {
    "date": "12/7/2011",
    "text": "I'm not sure why someone wrote that this place could be mistaken for a pub. It looks nothing like a pub. It looks like a standard Japanese restaurant. Had dinner there and it was totally fine, nothing special. The eel was good, everything else was just ok. Quick and nice service though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUM_lO2CC2O7CAQ6tAqmew"
  },
  "J1bKhdi2M1kdyy66mcf5Rw": {
    "date": "9/11/2018",
    "text": "This branch is near the river and is located underground with no windows. Black decor throughout with a serene sense of Zen and calmness. Small attractive tasty dishes. Generally good service and ambiance. Grilled salty mackerel is very good, as is their crispy soft shell crab (a classic dish). Calamari is excellent though be warned: it's spicy! If you are a fan try their tuna tartar (see photo).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iTX4eoCKbwUAjbvQ-SSn-g",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iTX4eoCKbwUAjbvQ-SSn-g/o.jpg"
      },
      {
        "img_id": "zbXEVKdPi-Ml2DMp4h9M_Q",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zbXEVKdPi-Ml2DMp4h9M_Q/o.jpg"
      },
      {
        "img_id": "GY8AX1Tp-VxgmtrR5mdtkw",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GY8AX1Tp-VxgmtrR5mdtkw/o.jpg"
      }
    ],
    "user_id": "awyFpFpdjdkgJZ_x1CtWVg"
  },
  "B6xpNbdAkVRXEdn-HazgEA": {
    "date": "10/25/2018",
    "text": "We had a really good sushi dinner here! The location is kind of crap, it's in a basement and on an overpass. The waiters are all Russian and they can't really understand what you want, but the sushi is fresh and of sound quality.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3rJtTId7C-ky4PZquuDVw"
  },
  "GaZ7mZAogOxvm-YylQ0Bbw": {
    "date": "11/14/2017",
    "text": "Reeling from the previous day's hangover, I came here with a friend a few Fridays ago. Can't believe I hadn't been previously as it's very close to work. I get excited every time I find places in London that do Ramen soup. I think it's huge in the states but the UK seem to be slightly more indifferent towards this stocky, noodley bowl of soupy perfection. But I digress...H&T has a contemporary, sleek feel which is buzzing without being too loud or overbearing. Definitely a good shout for busy nights of the week. It's underground (probably why it's not over-spilling with patrons) and features a descent into unknown concrete darkness on the way in but you are met with bright lights and Pan-Asian smells and friendly staff. I never feel much of an affinity for meat when I'm hanging so I went for the Tofu Salad which was actually quite tasty, well-dressed and had a nice crunch. I had a few pieces of general vegetarian maki sushi which was bouncy (a good sign of fresh rice and ingredients) rather than dry or clumpy. The Tofu and Vegetable Ramen which was restorative, filling, and downright good. Was it the best Ramen I've had? No, not by a mile. The broth base was not savory or rich enough and there was no stand-out aspect for me. But I'd have it again and have no regrets. We were pleased with their assortment of sakes and did a good job having a taste of pretty much all of them. It would have been rude not to partake in the selection... The staff gave us some good recommendations and were attentive so it was never too hard to catch an eye.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nsQM7w81hX3EKnh6IYKD3A",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Veggie sushi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nsQM7w81hX3EKnh6IYKD3A/o.jpg"
      },
      {
        "img_id": "GWhay06rR1oq7frSExPUCQ",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Veggie Ramen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GWhay06rR1oq7frSExPUCQ/o.jpg"
      },
      {
        "img_id": "kjuLhJ8Ocw4tE25YzPQc3g",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Tofu salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kjuLhJ8Ocw4tE25YzPQc3g/o.jpg"
      }
    ],
    "user_id": "zAZpV6TnwXB-bXyhEVBccg"
  },
  "BvpuUxxSFB9YrCDLuv-zMw": {
    "date": "7/24/2017",
    "text": "After a full and early morning spent at St. Paul's Cathedral, I was on my own for lunch. I checked Yelp for places to eat on this side of London and found Hare and Tortoise. The only thing on the ground floor is the entrance and you walk downstairs to the basement level for the main restaurant. Since it's on the basement level, that meant no cell reception or service for me. It's not bad, though I didn't really have a book with me to read so I ended up reading their table tents over and over and doing some covert people-watching. I did notice that I wasn't the only solo diner. There were a couple of other individuals enjoying their sushi as a party of 1.I ordered their chirashi dori (£11.40), which came nicely arranged with 2 pieces of salmon, 2 pieces of tuna, 2 pieces of yellowtail, ebi (shrimp), some octopus, and unagi. Very filling and it satisfied my sushi craving!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "wV4uhvJGok8nOR56Ex5mAg"
  },
  "ZjeJUilZolU6nR-16ieW3A": {
    "date": "7/11/2018",
    "text": "They serve good sashimi and sushi.  Noodles are also pretty good. Highly recommendable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3l1I9NoixJxO3gNve4xcmg"
  },
  "DqFq6TSC9BsWDryQPQC80w": {
    "date": "9/16/2016",
    "text": "A little hidden away, but definitely worth the descent into the catacomb-like interior. The vibe is intimate and the food is a legit take on Asian Fusion; mostly Japanese-inspired, but definitely with a bit of Chinese and Thai in there.The starters alone are worth a trip, and there were so many I wanted to try, they're actually all I had. Don't judge. They were amazing.The Pumpkin Croquettes were a slightly sweet and crispy version of traditional croquettes, deep-fried to perfection, with a light and smooth finish. Two will set you back a mere £3.10.While the spring rolls are good, I highly recommend the Vegetarian Duck Rolls, made with slightly sweet tofu skin, spring onions, cucumber, and Hoi Sin sauce. Three of those healthy rolls are a whopping £4.60.Finally, the Chicken Yakitori was also a dish worth it's weight in pounds, char-grilled to perfection and doused in a sweet yakitori sauce. A few skewers costs around £4.10.The rest of the menu is not only enormous, but sure to please any seafood-lover, especially sushi. They serve just about any Asian-inspired dish you can think of, including salads, ramen dishes, rice dishes, noodles of many different varieties, tempura, and sushi rolls, with a perfectly-paired sake menu to boot. But really, those side dishes are to die for.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1il_Looryp_arV0JtCKmWA",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Pumpkin Croquettes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1il_Looryp_arV0JtCKmWA/o.jpg"
      },
      {
        "img_id": "HEku-quItEls91tvh_Ft7g",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Chicken Yakitori",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HEku-quItEls91tvh_Ft7g/o.jpg"
      },
      {
        "img_id": "jUIrQSu3eMYVUTIYj3NJpQ",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Vegetarian Duck Rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jUIrQSu3eMYVUTIYj3NJpQ/o.jpg"
      }
    ],
    "user_id": "X0smwzdpSGrIInWyO5GrWA"
  },
  "ciV_6wJ2oZemBvq-h4iQqw": {
    "date": "9/8/2017",
    "text": "Was skeptical why it was in an underground bunker but was delightfully surprised by the atmosphere and food.20/20",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0lX8uSETAAVpKK6QlKNYew"
  },
  "gZA-xXdqrlCosxkW4yLs9A": {
    "date": "2/20/2016",
    "text": "I used to go to the branch in Putney all the time and turned out this was a convenient place to have dinner with a friend who catches a train back home from Blackfriars.  I always have the trouble of picking what I want to eat because there is so much to choose from.  I decided on a mix of something new and what I regularly get.To start I had the spicy calamari rings.  It was okay - I thought it was a bit more on the salty side than spicy but still quite good.  For my main I had the char kway teow which was good as usual.  I do enjoy the refillable jasmine tea.  Generally the food comes out really quick so good if you want to catch a quick bite to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "-uI111kb7er73o5NSI99BA": {
    "date": "12/3/2015",
    "text": "Nice place that was still open on a Saturday afternoon, the place was relatively quiet, it looks like nothing on the outside, but there is a large seating area downstairs.We were a little surprised when they decided to seat another couple on the next table to us, I mean there were so many tables and only 3 tables filled, they could have literally sat anywhere else, even 2 tables over!Sushi and the Yaki Udon dish were competently prepared, but I have had better. The side dishes were okay but unmemorable...Look, it's a decent place to get lunch, but you can do better, but on the other hand, in Blackfriars, you could do a much, much worse!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LDWCOLV_KjP_RO0bn8PUA"
  },
  "LUVkTO4TywEMxmckpDzYyA": {
    "date": "4/10/2015",
    "text": "The Hare and Tortoise is a venue that I have often overlooked, as it doesn't look like much on the outside. A simple sign and windows covered in grey, hide behind them a downstairs area filled with delicious food smells. When you go down the place may feel a little dark due to the lack of natural light and the darker toned furniture but the minimalists in my group really liked that simple decor. To be honest I prefer Japanese restaurant with obvious Japanese vibes and slightly more traditional decor.Then it was time to try the food. Being me I could not resist the chicken katsu curry, as it's one if my favourite dishes ever, and this one certainly did not disappoint. The chicken was juicy and delicious, the curry sauce was amazing and the rice was cooked to perfection. I also tried my friend's duck and rice dish and it was also excellent. My other two friends said that their dishes were great too and we all found that the portion were massive and it was actually quite hard to finish them. I was very pleased with the food overall because it was really good, quite a lot of it and it was under £8! I would certainly go back there to try more things from their menu, as they also have a great selection of sushi and sashimi and I would definitely recommend it to anyone who is looking for a good Japanese meal around Blackfriars.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9iMe2vpsAjV7zAcsHinGrw",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9iMe2vpsAjV7zAcsHinGrw/o.jpg"
      },
      {
        "img_id": "9-cmgVm9llkosGUjlMQ_Rw",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9-cmgVm9llkosGUjlMQ_Rw/o.jpg"
      },
      {
        "img_id": "Dat8kRB-yAvt7r-OY1BQqg",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Dat8kRB-yAvt7r-OY1BQqg/o.jpg"
      }
    ],
    "user_id": "YvDd_HOaHJGYUYMq_H2imw"
  },
  "KyzeYmNILvC-BfsgOkjjaA": {
    "date": "12/2/2015",
    "text": "Really nice sushi bar ! In the basement of an office building, really crowded at lunchtime. The warm dishes like ramen and noodle ones were not breathtaking, but sushi, especially nigiri were awesome. Fresh fish, great taste, not too wide choice. Sashimi looked also great. So definitely good place for lunch. Not sure about the dinner in a very simple and no window sitting, but owrth trying anyway. And prices were acceptable too. Four people ate to the limit for 80+GBP",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "NyFTRi6r5ftRFkCz8DM4qw"
  },
  "4Iohf5TqPXFQ0VL0oIlVAg": {
    "date": "5/12/2015",
    "text": "The Hare & The Tortoise falls into the 'ok if you're in the area' category. They churn out food and I can imagine it would be quite popular with nearby corporates but when in London for a week, I reckon you can give it a miss. Technically, the food is Japanese but they have other Asian dishes too. I ordered the laksa (perhaps that's where I went wrong...). It was passable but pretty sweet and heavy-handed on the coconut cream. Again, ok for a quick, relatively cheap corporate lunch but no wow-factor.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S1125nKt9QtXW4OArFTiXA",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Laksa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S1125nKt9QtXW4OArFTiXA/o.jpg"
      }
    ],
    "user_id": "2XFpcnga2CpIC9YioVmNeg"
  },
  "HC94KgNTxbqTvh-UHFA4JQ": {
    "date": "8/15/2015",
    "text": "It doesn't look like much from the outside and you could easily walk past and never know it was there. I was thankfully introduced by a local to the area and my love affair with this place was born. Then menu is plentiful and the portions are generous in comparison to the price! I had beef in black bean sauce which was soft and not even slightly chewy and my other half had sushi. Both were lovely. His fish was fresh and melt in the mouth soft and easily passed the 'can I bite this in half without it exploding everywhere' sushi test.We had a selection of starters including the vegetarian duck rolls and okinimiyaki(?) sticks both were scrummy but I did think the price of the veg duck rolls was excessive. Four small rolls of classic duck pancake with tofu instead of duck for a hefty £4.30 is a bit steep for what is essentially cucumber/spring onion/tofu and sauce is one of the pricier things on the menu along with a pint of kirin for £5.70. Although both delicious, together they cost considerably more than either of our mains which came in at £6.80/8.30. Stick to the right things on this menu and you can be full, happy and have a couple quid still in your pocket!I feel I must mention the staff who are quick and so very attentive that your plates disappear in moments once you've finished, this is not a place to linger. They are a mixture of happy, indifferent and morose but they get the job done!I've had a fair few pleasant evenings with my girls in the hairy tortoise which is what it has become to us and enjoyed all of them. If I'm in the area it's my go to place but as another reviewer said, its not somewhere to seek out in London but its perfect for locals. Even my other half was impressed on what was his first visit and mentioned what he would try on our next visit! Sorry ladies, i fear our secrets out!???",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvgVPn7xyDS2T8kJf0F7PA"
  },
  "TY3eDXFb1cbQJXigkZz6Dg": {
    "date": "12/16/2014",
    "text": "Reasonable food quality but it's cheap and quick near the office, so it's become an occasional lunchtime haunt. I recommend the chicken laksa, but not the Phad Thai in the photo below!Be warned - there's zero phone signal downstairs!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kskd4LATLcEXH-x7ewmufg",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. A slightly underwhelming Phad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kskd4LATLcEXH-x7ewmufg/o.jpg"
      }
    ],
    "user_id": "eYQkH-IrcWZDG2CjZJMv1w"
  },
  "3B2GL0uBR4LFw6TdgRIybw": {
    "date": "11/17/2015",
    "text": "Nice ambiance, large, spacious, comfortable. Bustling on a Friday evening for dinner. Servers are nice and accommodating. But didn't think the food was amazing. Tofu & Vegetables Lo Mein in a Black Bean sauce - first, there were 3 enormous squares of fried tofu. I've never seen tofu that big. But the sauce was a no go. It just wasn't very tasty. It had taste, but not a great one. Ample veggies, though. But I wouldn't recommend the dish as a whole. Also, there was a piece of paper in the dish that we discovered only half way through eating it. It looked like food packaging of some kind. We immediately informed the waiter and he was nice about it, remaking our dish right away and removing it from the bill entirely. We appreciated this and from a service perspective had no issues. I would try this place again and order something different because it's otherwise a nice place, but that dish wasn't a hit.Cucumber sushi - standard, fine, no complaints. A bit on the expensive side. Most places charge between £2.50 and £3 for a roll and this one is £3.30 for nothing special, but ah well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9XURN5_9kHlvYUd-AisTA"
  },
  "yU12matqOlwGxZMPxobp6Q": {
    "date": "9/9/2011",
    "text": "Very decent sushi for lunch.  Had hamachi, unagi, snow crab and ikura - all were fresh and nicely prepared, washed down with a refreshing and sushi-friendly Tsingdao beer.  All of this cost £19. Not cheap by any means!Service was friendly and swift.  Americans beware - their mobile credit card readers do not accept US cards that do not contain the smart chip.  Bring cash!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yAq657uSmy7TOE4-qeDAqg",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yAq657uSmy7TOE4-qeDAqg/o.jpg"
      }
    ],
    "user_id": "YZ8ifu4BoaEGZYmZwLfZWg"
  },
  "nDWifay_WfHf01EwuakS5Q": {
    "date": "3/22/2013",
    "text": "Huge portion sizes and really yummy food.You have to get here by 12pm though to beat the lunch rush otherwise you'll be waiting for a while for a seat. Our drinks were served very quickly and the waitress was very patient taking our orders (there were a few particular order taking out stuff and adding stuff to standard dishes).All the food that arrived was served in huge bowls and smelled delicious. I got the chicken and black bean sauce with noodles and it was really nice! One of the order at our table was wrong and the manager was so nice and helpful about it. She rushed the ticket to the top of the line and has the correct food with us within 7 mins. It's a really great place for a city lunch, just make sure you time your visit right!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrGFc2IUccf2sKcvLc78LA"
  },
  "ApU_rkCVdNSmf6TwCHn6mg": {
    "date": "8/2/2016",
    "text": "In the mood for sushi. Stopped here and had some of our favorites. Charming restaurant in ambience. One daughter ordered the seared tuna, and it was quite good. The other ordered rainbow roll and unagi and avocado roll. The eel was so good! Husband ordered Singapore noodles, also excellent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5etoH93OqkQUyqEjs_nsHg"
  },
  "4M__02FPGxZDI-yFP69t3Q": {
    "date": "6/1/2013",
    "text": "I've wanted to visit this place for a while, after walking past many times over the past few months. As you enter, you walk down the stairs where you reach a small and sparsely furnished dining area in full view of the sushi kitchen. The decor is modern and stylish, and the place feels quite spacious and inviting.Onto the food which is the reason we're here. Portions sizes are quite varied. The Wakame is tasty, the fried vegetables a little bland. Edamame beans hard to get wrong. Katsu curry, good portion, but again nothing special. I would highlight the pistachio ice cream dessert which was amazing and quite the surprise. Molten chocolate cake oozing with warm chocolate sauce with a nice scoop of pistachio ice cream in the middle. Superb.Service was excellent, staff were attentive and never felt overbearing as happens in some restaurants. Some dishes like the katsu curry were good value for money. Some sushi dishes were a little pricy and personal preference, not vinegary enough for me, but this is more a state of sushi in the UK, rather than a food quality issue.I'd probably try this place again simply for the divine dessert.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7-PCfqqhWzSWf8IOVdpQjw",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Chocolate Molten Pistachio Ice Cream Dessert",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7-PCfqqhWzSWf8IOVdpQjw/o.jpg"
      },
      {
        "img_id": "f4Sxi1IPYhKbmoZzjDcNIQ",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Sushi Assortment",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f4Sxi1IPYhKbmoZzjDcNIQ/o.jpg"
      },
      {
        "img_id": "uIgWypi0WLJUeneLfAYJOg",
        "caption": "Photo of Hare and Tortoise - London, United Kingdom. Katsu Curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uIgWypi0WLJUeneLfAYJOg/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "zOVRVdWCd5A6B2iBzz4Ayg": {
    "date": "4/10/2015",
    "text": "Huge portions and amazing value for money. What more could you want?Thoroughly recommend the Hare & Tortoise. I describe it as Wagamamas but cheaper with more food. They are a little chain so I'd really like to try out one or two other places to compare. They have lovely lovely Kirin lager on tap. But it's pricey for a pint. To be fair, it's the only pricey thing on the menu. Sushi - lovely. Katsu curry - bloody lovely. No duck, duck pancake roll things - also damn fine. This time there was 10 of us on a table. Mixed starters, main courses, bottles of wine, many beers and soft drinks. Many monies each you'd think? Well you would think wrong good sirs! £22 each including tip. BOOM. It's in a basement so no phone signal (unless on O2 apparently). But I like that. Service is good too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ysU6q9uBHE4F6k1C6_LEA"
  }
}